[{"title": "Great prices", "text": "Great prices, love the monthly automatice refill plan, high grade products, a little expensive but worth it.", "rating": 4}, {"title": "Website was difficult to use and a bit…", "text": "Website was difficult to use and a bit clunky. Customer service was superb. ", "rating": 4}, {"title": "Good explanation of products,helping to…", "text": "Good explanation of products,helping to understand  the uses of various  supplements. Also, the proof is in the performance, and I've found LEH products  to be higher quality than others I have tried. ", "rating": 4}, {"title": "Love the Herbs", "text": "Love the Herbs, especially the tinctures, but really want a USPS tracking # for my orders within 24 hours or less. ", "rating": 4}, {"title": "The products seem to be working well! BUT...", "text": "The products seem to be working well!Just really need to include MORE Info about each product as I receive them in the mail they have no information as, 'when is the best time to take them, 'Can I take them together'? I get packets of all kinds but don't know what they are for! You don't seem to get it! Sending already printed brochures does not cover all possibilities! ", "rating": 4}, {"title": "I’m very happy with all of my purchases…", "text": "I’m very happy with all of my purchases at LEH. However this time I didn’t receive any shipping confirmation or tracking number. This would help immensely for people like me who often work away from home. ", "rating": 4}, {"title": "Lost empire herbs is legit", "text": "Lost empire herbs is legit, I love all of their products everything I purchased from them is always top quality and does what it says. After 5 years of using their products I still continue, lost empire herbs is A1", "rating": 4}, {"title": "Excellent product quality. Slow/poor delivery time", "text": "Excellent product quality.Great product descriptions.Slow/poor deliveryProbably just USPS, but still.Amazon is your competition for delivery.If I could buy your products on Amazon I would.", "rating": 4}, {"title": "Great products", "text": "Great products, I have tried several and have always been satisfied with the effects.  The staff is very helpful and replies promptly to questions.  I would like to see additional products, such as for men’s prostate health.  I trust Lost Empire formulas to do what they say.", "rating": 4}, {"title": "The only difficult part of your process…", "text": "The only difficult part of your process was receiving my veteran’s discount.  I never could get it to work.  After receiving the code, a difficult process in it’s self there was no place to enter it on the order.  Just gave up.🙄", "rating": 4}, {"title": "I started drinking it while being off…", "text": "I started drinking it while being off the pill for the first time and it helped a lot in making my body went back to a healthy hormonal balance. Last time I stopped the pill I got terrible side effects while my hormone were balancing, but this time I believe the powder helped my body be normal again in no time. The only bad thing is it taste really bad, even when i mix it with other things", "rating": 4}, {"title": "Been a loyal customer hoping for more discounts or loyalty program", "text": "If there was some kind of loyalty coupons I’d give this place all the stars—- but someone who is trying not to spend $200/month on herbs, it’d be nice to be able to utilize old discount codes, etc. I’ve recommended you guys to all my friends and a refer a friend program would be nice too- idk. High quality goods are sold here, FOR SURE and the knowledge share is great but if I look on Amazon and other online retailers I can find “good enough” stuff that can replace some items. Hard for me to give 5 stars with the price not being subsidized with loyalty credits or some other kinds of fair incentives.", "rating": 4}, {"title": "Mobile site a bit clunky.", "text": "I accessed your site using my phone, so it may have simply be because I was using a mobile device, but the moving back from the cart to continue shopping seemed to be a little clunky and not intuitive.  Again, this could be to me using a mobile device.  One other thing was that I order Tongkat-Ali, 60 capsules and it was 44.99, then, at checkout I was given the option to order more with the March Madness sale, and the second order was only 35.99.  That was a bit odd.With that said, I'm quite excited to receive my products as I have only heard great things from coworkers. ", "rating": 4}, {"title": "Shopping and checkout experience was…", "text": "Shopping and checkout experience was great.  However, at the very end of the purchase process (and I think this also happened during my last order as well), when I used PayPal button to process my payment (which worked OK) and then was redirected back to the Lost Empire Herbs site, my items were still in my cart and the purchase process seemed incomplete.   Note: This could be due to the Brave browser blocking some functionality.   To confirm my purchase actually did go through, I logged in (separately) to PayPal and saw my order charged there....and then I also logged into Lost Empire Herbs in a new browser tab/window and saw the order under my Orders history section.   Then after a few minutes I received the email from LEH pertaining to my order.  A fresh re-log-in to LEH site also finally showed my shopping cart as empty.", "rating": 4}, {"title": "Great products... Fabulous Customer service Callie W is awesome.", "text": "everything about this company is on the up and up from my perspective.  Products are expensive and seem to work as advertised (only been a few weeks).  Problems shipping to Canada however.", "rating": 4}, {"title": "The products are top quality", "text": "The products are top quality.  The quiz was helpful.  The bot is fun. The information on the website is unparalleled.  The only reason that I did not give it 5 stars is that the company is still very much targeted towards men:  There are no bundle deals for women.  There are many more articles specifically for men.  Some of the articles on herbs for men could also be useful for women. One that I read has a sentence at the very end saying that women can use it, too. However, I don't think many women will read it that far.    That being said, the article on women's hormone health was exceptional.", "rating": 4}, {"title": "My shopping experience has been good…", "text": "My shopping experience has been good with Lost Empire Herbs. I did not communicate with their team on this most recent purchase, but I have in the past. No, I did not take their quiz, but I have before in the past. Their daily blog post I would have to say is the most influential reason behind my confidence and trust in their products. The wealth of knowledge I have gained from months of reading has been game changer. A company who is not just willing to sell you something, but educating customers long before they ever buy from you is something else entirely. Which makes me trust them! Folks you are in great hands with Lost Empire Herbs!", "rating": 4}, {"title": "“Meaningful Impact”…", "text": "I have ordered products from Lost Empire and plan to rely on them for future shipments into the future. The products are first rate and I trust their knowledge and expertise when it comes to “quality and safe products “..  Their are many businesses on the web selling second tier products or worse, junk.  Thanks to Lost Empire for making an impact in such a meaningful way.", "rating": 4}, {"title": "Cognitive Enhancement Package", "text": "I've been using the bundle for Cognitive Enhancement and my mind feels sharper than ever. There is a noticeable ease in forming thoughts and increased focus.", "rating": 4}, {"title": "These are the most potent herbs I've purchased online!", "text": "I have purchased & taken many herbs online through Amazon, but Lost Empire Herbs have been the most potent herbs out of them all!  Pine Pollen, He Shou Wu, Mucuna, Tongkat Ali, and Nettle Root. I will continue to take these herbs because my husband and I have noticed we have more energy everyday and we seem to have a clearer thoughts...like not so foggy. Thank you Lost Empire Herbs!", "rating": 4}, {"title": "quite satisfactory", "text": "My experience was quite satisfactory ..I do have a little trouble with your website, though, maybe it is just my browser. And so far your assistance has been very impressive, but I haven't received my last order, yet..", "rating": 4}, {"title": "I was able to find and purchase some of…", "text": "I was able to find and purchase some of the products that I sought to purchase. You are doing a good job of describing the various herbs, what benefits they provide, and the customary dosages. The only problem I encountered was that you were out of a few herbal tinctures I wanted to purchase.  The tinctures are so convient for taking herbs when you don’t have very much time to do so. You were out of Cistanche, Horny Goat Weed, and Tribulus. I left my email so that I might be contacted whenever those items were in stock again.", "rating": 4}, {"title": "Been on trt for 7 years I’m sick of it…", "text": "Been on trt for 7 years I’m sick of it tired of being a pin cushion. Searched for a natural real alternative, I found y’all. Haven’t had a t shot for seven weeks just been taking your product still messing with finding the right dosage but I feel good and my head is clear I’m very active still so I can say so far so good and my wife noticed so she ordered y’all’s Athena mix. If and when I have questions I’ll send them to y’all thanks for providing an alt to the trt. Kyle Dewitt", "rating": 4}, {"title": "Shopping", "text": "Shopping for the products I wanted was easy as I already am a long time customer and knew what I wanted.Receiving my military discount was more challenging than I was prepared for but it is done.   ", "rating": 4}, {"title": "Love the research", "text": "Love the research, the products are high quality, customer service is fantastic, shipping is fast, and the vast majority of the products I have used have made a difference. The ONLY issue, and it is a small one, sometimes when navigating the website it has been a bit challenging. Overall, I am very satisfied.", "rating": 4}, {"title": "The buying experience is actually very…", "text": "The buying experience is actually very good. So far though the herbs that I’ve been using for the last few months have not given me any positive results except for the ashwaganda. It does seem to help with my sleep", "rating": 4}, {"title": "I've been taking LE's Pine Pollen…", "text": "I've been taking LE's Pine Pollen capsules for a few years now and although there's been a big improvement over my former state of brain fog, I wonder of I could do better.", "rating": 4}, {"title": "first time user", "text": "just all the important info on all sites i could find ,also the reviews helped,hopefully they are real reviews,anxious to try the product when i get it,thanks", "rating": 4}, {"title": "I bought the products but haven’t…", "text": "I bought the products but haven’t received a confirmation email and I’m not sure how long the products will take to get here. I’m hopeful they will be good, but I don’t know when they’re coming:( ", "rating": 4}, {"title": "Labeling", "text": "To be honest I haven’t tried the product as of yet.what I did notice was the labeling I think there should be a little more information as to ingredients and dosage.Over all looking forward to trying the product thanks again", "rating": 4}, {"title": "Well I got products for someone who use…", "text": "Well I got products for someone who use herbs I myself want to try them I just want to be assured that light beer won't disturb what I'm using the herbs for", "rating": 4}, {"title": "When I was checking out", "text": "When I was checking out, an add popes up to buy Tour's hammer for $24.95. I was charged $55. I got a partial refund of $27.50 which is only $2 more but I still didn't get the sale price. Also I was sent a coupon for 10% off which wasn't accepted. I won't be buying any more pop-up. Love the products I use them every day. Just wasn't happy with the results of my purchases. Thanks", "rating": 4}, {"title": "The product I like the best is Pine…", "text": "The product I like the best is Pine Pollen. I spent 103.97 on Mushroom Tincture, Ho Shou Wu Tincture and Gynostemme Tea. Not sure if any of these did anything. I do like the tea. I do a lot of my own tea mixtures and tinctures. I like the information on your web page. I may try other products. You company seem to be doing well and I alway get my orders quickly.", "rating": 4}, {"title": "checking out is user friendly", "text": "checking out is user friendlycommunication after order has been placed is good perception is that the products are real and effective", "rating": 4}, {"title": "The website is easy to navigate.", "text": "The website is easy to navigate.The herbs quiz is helpful to find suitable herbs but i suggest to add multiple related herbs in the quiz recommendations.Thank you", "rating": 4}, {"title": "A legitimate company.", "text": "The customer service personal did not answer or return my calls for an order confirmation number, but did respond to my emails. I was assured the product was shipped and given a scheduled date and tracking information. I did receive the product one day before scheduled.", "rating": 4}, {"title": "NO NEGATIVES", "text": "NO NEGATIVES. Timely turn time. The products perform as advertised. Going forward, I will continue to experiment with their other products too. ", "rating": 4}, {"title": "Nice to have a company that genuinely…", "text": "Nice to have a company that genuinely cares....Good customer support and overall good service. I have not applied a specific date regarding my experience as I am a long-term customer; hence I am more than qualified to make reference to my overall experience, which has been extremely good.", "rating": 4}, {"title": "Discount well received ! …", "text": "I received a discount which motivated me to purchase the item I really wanted to buy. ", "rating": 4}, {"title": "My wife and I learned of your products…", "text": "My wife and I learned of your products from a friend.  We were given a sample of the nettle.  We liked it and decided to order a few of your items that we currently take but purchase elsewhere, so we will see how they work for us after using for a while.", "rating": 4}, {"title": "Shipping was super quick to my location…", "text": "Shipping was super quick to my location here in Canada. Been ordering from you for many years now. Got hit with a 20 dollar duty charge on the last shipment. Still worth the purchase. Keep up the great work.-Adam", "rating": 4}, {"title": "I enjoy the info n blogs about the…", "text": "I enjoy the info n blogs about the products, I would prefer more creative ways to consume the powders or to mix them with other things. Would have been a 5 if the Can. Govt didn’t charge me $45 tax when i picked it up at post office.  Praise God n keep up the great work!", "rating": 4}, {"title": "What makes it great is when people are…", "text": "What makes it great is when people are real, and actually care about their customers like I do in my business", "rating": 4}, {"title": "Checkout was easy", "text": "Checkout was easy. Just waiting to receive the product.", "rating": 4}, {"title": "The morning wood is a plus", "text": "The morning wood is a plus, but the taste is terrible. I have the drops and mega pollen. I pollen is almost unbearable to get down. The directions could be better know.", "rating": 4}, {"title": "Unsatisfied with website ", "text": "I couldn’t find any space to enter my coupon code. However, their products and customer service is great. ", "rating": 4}, {"title": "Albizia work very good for depression.", "text": "Albizia work very good for depression.Also Pearl powder for sleeping and the skin. Definitely I will continue buying from you.", "rating": 4}, {"title": "I like that Lost Empire Herbs provides educational", "text": "I like that Lost Empire Herbs provides educational information on their products. Plus they have qualities products.", "rating": 4}, {"title": "Timely delivery", "text": "Timely delivery, and seems to be doing the trick-if you get my drift.  Very satisfied with product.  Thanks.  Bought enough to last awhile on our second order.", "rating": 4}, {"title": "The product is really good", "text": "The product is really good. I would have rated it Five stars but the price is a little high for the amount you get just wish the price was a little bit cheaper or had more deals /coupons available.", "rating": 4}, {"title": "Callie was terrific", "text": "Callie was terrific. Answered all my questions and resolved my problems", "rating": 4}, {"title": "Great product; slow delivery.", "text": "Great product. Great customer service.The last couple orders have taken them a few days to fulfill. This, along with the slow shipping, means I don’t get the product as quickly as I’d like.", "rating": 4}, {"title": "Occasional code for discount on…", "text": "Occasional code for discount on purchase is nice, get product pretty quick as well.", "rating": 4}, {"title": "I mean", "text": "I mean, I realize the herbs take a while to take affect so but right now I can’t think of any complaints that I have", "rating": 4}, {"title": "The variety of herbs is impressive", "text": "The variety of herbs is impressive. I also like that pine pollen performed as advertised.", "rating": 4}, {"title": "Ordering was painless", "text": "Ordering was painless. Shipping confirmation took a bit of time but not bad.", "rating": 4}, {"title": "Website is a little hard finding…", "text": "Website is a little hard finding products if you can not remember the names of the herbs.", "rating": 4}, {"title": "While the ordering process was…", "text": "While the ordering process was relatively easy, I'll have to hold off on any further comment until the product is received and taken.", "rating": 4}, {"title": "I just received your product", "text": "I just received your product. Please give me time to evaluate. Delivery is slow. ", "rating": 4}, {"title": "Amazing", "text": "Lost empire herbs products are as advertised. The ingredients works as stated.", "rating": 4}, {"title": "Was easier to find items this time and…", "text": "Was easier to find items this time and check out was easier ", "rating": 4}, {"title": "Web site was helpful and showed items…", "text": "Web site was helpful and showed items out of stock rather than take the order and not ship.", "rating": 4}, {"title": "Very happy with customer service responsse", "text": "Was taken care extremely well with one item that arrived damaged", "rating": 4}, {"title": "Great service", "text": "Good service product arrived in reasonable time. I would recommend this company", "rating": 4}, {"title": "the product i ordered", "text": "the product i ordered. get to me on time .i do not get the carrier who is handling the package .they ship it to west canada then they ship it to east canada ????. they should continuo to ship it to B.C. canada.?????", "rating": 4}, {"title": "The shipping was fast", "text": "The shipping was fast, but I am not sure if  the pine pollen is helping yet.", "rating": 4}, {"title": "Fast response", "text": "Fast response. Product benefits explained clearly", "rating": 4}, {"title": "I emailed a simple question and it was…", "text": "I emailed a simple question and it was answered quickly.  I placed the order based on that and am waiting to try it out.", "rating": 4}, {"title": "Good customer service", "text": "Good customer service.  Had to leave a message but they did get back to me the same day.", "rating": 4}, {"title": "Great products", "text": "Great products, well packaged, shipped in a reasonable amount of time", "rating": 4}, {"title": "I ordered and it came as ordered to my mailbox", "text": "I received what I ordered within a reasonable timeframe.  In today’s world that is a significant customer experience.", "rating": 4}, {"title": "Lost Empire is transparent and…", "text": "Lost Empire is transparent and informative about the products. The products are good quality without unnecessary additives.", "rating": 4}, {"title": "Excellent source for herbs and…", "text": "Excellent source for herbs and education regarding herbs and health.Extremely rare to find a company that shares it lab results to the public without customers requesting them.There is probably no more than 10 companies in the whole world that do this.", "rating": 4}, {"title": "These guys really try their best to…", "text": "These guys really try their best to assist whenever I have any issues.I just happen to live in a place where its hard to send orders to with any level of certainty that they will arrive. However, the orders always arrive when I send them to a different address, where its shipping is easier to track.", "rating": 4}, {"title": "Frontier Herbs sells high quality…", "text": "Frontier Herbs sells high quality products.", "rating": 4}, {"title": "YOU HAVE GREAT PRODUCTS", "text": "YOU HAVE GREAT PRODUCTS: BUT A LITTLE EXPENCIVE FOR ME TO BUY MORE.", "rating": 4}, {"title": "He Shou Wu", "text": "Appears to be a good quality product.Better sound sleep.", "rating": 4}, {"title": "website", "text": "Pretty easy to navigate through website.", "rating": 4}, {"title": "Phoenix", "text": "I've only just begun using Phoenix so can't give a tptal review yet. I mix it into my morning protein shake. I am starting to notice a small increase in energy and a sense of well being. I will give a more informed review after I've used it for a longer period.", "rating": 4}, {"title": "black elderberry powder", "text": "everything went fine, item was pricey and very difficult to handle once opened so far results have been varied still hoping for improvement. packaging does need to be better to be able to get proper dosage without undo waste.", "rating": 4}, {"title": "Products were available and shipped out…", "text": "Products were available and shipped out in a timely manner.", "rating": 4}, {"title": "Customs", "text": "I rate info, test and site a 4. My order has been held in customs since October 3, not sure what the problem is. When and if I receive order I can give a better review", "rating": 4}, {"title": "Excellent products and excellent…", "text": "Excellent products and excellent customer service, thank you Lost Empire Herbs!", "rating": 4}, {"title": "Would have given 5* if shipping was…", "text": "Would have given 5* if shipping was faster.", "rating": 4}, {"title": "Products are good quality and nicely…", "text": "Products are good quality and nicely packaged.", "rating": 4}, {"title": "Yin and yang balanced ", "text": "Real people at Lost Empire! Thanks. More later when I try your products. ", "rating": 4}, {"title": "Excellent products that do what they…", "text": "Excellent products that do what they say.", "rating": 4}, {"title": "EASY  to Navigate the site", "text": "Date of experience: April 19, 2024", "rating": 4}, {"title": "You’ll get healthier", "text": "I love their products. I have sickle cell so I need the supplements as I get older.", "rating": 4}, {"title": "I am not fully acquainted", "text": "I am not fully acquainted, or immersed yet but what I have learned and purchased is of very good Quality, great service, and quick shipping.", "rating": 4}, {"title": "I am a 74-year-old woman", "text": "I am a 74-year-old woman. I bought Lost Empire Ashwaganda tincture to help with weakness and exhaustion that I'd been experiencing. I felt a difference within a week or so, felt more energy and strength. The original surge of energy did wane after that. But overall I do feel stronger. Thank you.", "rating": 4}, {"title": "It's easy to mix and drink", "text": "It's easy to mix and drink. I'm slowly increasing my mix until I feel comfortable. So far it's working like it should just making me feel better..", "rating": 4}, {"title": "Good customer service", "text": "I appreciate all the helpful informational emails I've received since ordering pine pollen. I do want to mention that when ordering, I opted to get an extra pouch for 1 cent plus shipping so both my husband and myself could try it but when I went to place the order it only showed the 1 pouch. I didn't want to go back and try again.  I haven't felt any different yet but I'm only taking 1/2 tsp 2 times a day. Maybe I should up it to 1 tsp.? It seems like you company is making a great effort to be helpful and I look forward to trying other items in the future.", "rating": 4}, {"title": "Great product", "text": "Great product. Wish shipping was a little quicker.", "rating": 4}, {"title": "Pine pollen", "text": "Product was delivered in a timely manner.  It was well sealed and appears to be pure and of good quality.  I would give 5 stars, but I’ve only recently begun to use the product so I can’t give a definite answer on whether it’s effective or not.  Also this is my first order, without an established track record of consistency, I can’t give 5 stars.", "rating": 4}, {"title": "Ordering was efficient and the products…", "text": "Ordering was efficient and the products were received in a timely fashion. Quiz was useful to choosing some products to try.  Im a first time buyer. I enjoy their YouTube videos as well as their blog emails sharing about various products, their benefits, and how to take them.", "rating": 4}, {"title": "Easy ordering", "text": "Easy ordering. Would like to get the free shipping when retail cost meets free shipping requirements but discounts get you below the $100 min and you still pay for shipping. Not that big of a deal. Just saying.", "rating": 4}, {"title": "Order shipped quick and correct", "text": "Date of experience: April 22, 2023", "rating": 4}, {"title": "Website could be easier to understand...", "text": "Date of experience: March 28, 2024", "rating": 4}, {"title": "I was able to make my order from the…", "text": "I was able to make my order from the email I get from you. No problems.", "rating": 4}, {"title": "I started out with the pine Pollen…", "text": "I started out with the pine Pollen capsules. Did the whole bottle faithfully. Saw absolutely no advertised results. To be fair, I did not want to give up on just one bottle. I reordered. This time I chose the Pine Pollen tincture and Tongkat Ali powder to compliment the Pine Pollen. Also I went ahead and added a bottle of Thor’s Hammer. At this point (around 10 days in) I still can’t say I see any difference.", "rating": 4}, {"title": "Easy 123", "text": "Easy in easy out experience ", "rating": 4}, {"title": "I called and asked why the Lion's Mane…", "text": "I called and asked why the Lion's Mane product has changed since I bought it a few years ago and the answer I got was short and seemed lacking of details. At that point I just thanked the girl and hung up. I expected more, but still she was right, the product is better now.", "rating": 4}, {"title": "I live in Northern Victoria", "text": "I live in Northern Victoria, Australia and have been using LEH products for more than 6 years now.I and am very happy with their products and service and their website is well set out and easy to navigate.I Highly recommend LEH to anybody who’s looking for quality herbs and great service.Michael", "rating": 4}, {"title": "Shopping and checkout was a breeze", "text": "Shopping and checkout was a breeze. The products arrived 2 days ahead of schedule.  I deducted a star because none of the links in their marketing emails work, despite trying multiple browsers, the most important of the broken links is the one to limit the amount of spam email.", "rating": 4}, {"title": "Simple", "text": "Very easy interface and checkout process", "rating": 4}, {"title": "I find the herbs to be of a very good…", "text": "I find the herbs to be of a very good quality. I know the customer service situation has been tough during this period of dealing with the whole covid issue. But I generally do receive very good customer service, if and when I have an issue. The website can be somewhat tricky, at least for someone my age. Because I have not seen a \"continue shopping\" option. I have to use the refresh, or go back button, to get back to the previous page. The check out process, is something that I have not had much trouble with. Overall, I would say I am very pleased with your company.", "rating": 4}, {"title": "Hopes Up", "text": "I have read about pine pollen pretty much and I did try your capsules before but for some reason didn't feel anything and I'm a healthy person besides been overweight, this time I went for da powder and any powder is a huge mess every time and not liking it, went for da price and so far don't really know if im feeling any effects, was gonna order and try other companies on pine pollen that I know about but really grab this special and hoping that it would do what it saids, I'll wait and see!!", "rating": 4}, {"title": "Awesome website", "text": "Awesome website, products, and information. Unfortunately they run out of a lot of things. Almost everything I wanted to order was out of stock. I get it, they are herbs and the process for creating the tinctures and powders is complicated. I am willing to wait and reorder! I wish there were more combinations. As a man in my very late 40's, I don't have the inclination to take 3 or 4 different powders or supplements a day. perhaps custom blends? I love what they have though and will continue to support them.", "rating": 4}, {"title": "Love LEH's", "text": "Always have what I need,  and always great products. Just wish they'd use ups instead of usps for shipping, usps had a hard time honoring delivery dates nowadays.  Otherwise the company itself is great in my opinion. They help keep my health in check.", "rating": 4}, {"title": "Your site is somewhat difficult to…", "text": "Your site is somewhat difficult to navigate. I tried to set up the monthly subscription for Pine Pollen. And could not figure out what steps I needed to perform, to accomplish this task. And getting back to the herbs, after you have put one in your cart, seems a bit strange. It takes two clicks on the back button, to get back to the page.", "rating": 4}, {"title": "Hi I've followed you guys since…", "text": "Hi I've followed you guys since superman herbs.Your  powders are so fine there's no grit taste , I like all I've tried butt I'm stuck on black ant. I Believe it turned my hair blacker I had grey hairs growing after 6 weeks my wife asked me how did I get out the grey... I showed her the black ant. Oh and he-wo shu and pine pollen.. 4stars you guys are very expensive ..", "rating": 4}, {"title": "hi everything is very good products but…", "text": "hi everything is very good products but sometimes you get allowed to a vip area from which I bought at the time I believe I had just filled out the questionnaire/profile  in the profile I put down that I am a US navy veteran and a 911 paramedic in nyc. on on going back to the website the next time I could not navigate to the vip area that I had been in on the last visit.", "rating": 4}, {"title": "This is a very well run company with…", "text": "This is a well run company with quality products and generous return policy.  My only issue is the dishonest and unethical methods one of your affiliate marketers is using.  You  obviously believe in what you do.  It does not help your credibility with a shill who calls himself \"cdsnuts\" promising people the impossible on men's health and rare disease forums.", "rating": 4}, {"title": "Lost empire herbs has been great", "text": "Lost empire herbs has been great.  As with any supplementation program you must find what works for you.   Lost empire herbs is fairly informative.  I love the natural for the herbs come in although if it’s no a tincture I end up spilling a lot out of the bags.  That’s on me!  Great job keep up the good work and don’t sell out!Mike", "rating": 4}, {"title": "Quality products that really work", "text": "Quality products, reliable, clean-sourced natural products. Functional, powerful formulas and single herbs that do what they promise. Delivery and packaging are first-rate, even with all the pandemic challenges we face. If you can afford them, they are the best you can get. That's about the only con to them. But what you do get is top-notch products, research, and education.", "rating": 4}, {"title": "Strange times indeed", "text": "This rating is only based on the current social climate(i.e.-pandemic). It has been harder than normal to get a hold of a person to check the status of an order. And I do understand the delivery issues. Normally, I receive great customer service. Overall, I truly enjoy doing business with your company.", "rating": 4}, {"title": "As with all supplements", "text": "As with all supplements, Savvy consumers do as much research as they can regarding a particular supplement  and then hope and pray  that what they are buying is actually  the product being sold. I do think though that Lost Empire herbs does the best job at being transparent with their independent laboratory studies testing for heavy metals and other such contaminants. I applaud them for their effort to give the customer Clarity and confidence in their choice to purchase products from Lost Empire herbs.", "rating": 4}, {"title": "Quick and painless ordering", "text": "I love getting email notifications of upcoming sales and product updates from you all. The ordering was quick and painless, and the delivery was satisfactory. I've ordered from you all for a couple of years now and this order experience will not cause me to stop.", "rating": 4}, {"title": "Easy order and fast delivery.", "text": "Date of experience: November 16, 2022", "rating": 4}, {"title": "the order process was very straight…", "text": "the order process was very straight forward and the information provided on the different products was excellent and made choosing the right products easy.", "rating": 4}, {"title": "Lost Empire Herbs", "text": "Lost Empire Herbs, Great products,  they have helped me a lot in my journey to better health. I have more energy and have lost some weight.I would give 5 stars, but the website is a little clunky, it does the job though.RichOhio", "rating": 4}, {"title": "I like the good variate of herbs.", "text": "Date of experience: July 16, 2024", "rating": 4}, {"title": "So far I have nothing bad to say about…", "text": "So far I have nothing bad to say about the the products and service that I've received from Lost Empire Herbs.  It seems like the He Shou Wu is working good for me, and the Pine Pollen too.  I plan on reordering both products, very soon.", "rating": 4}, {"title": "Great products.", "text": "Great products.Shipping is too expensive. I live in the same state, two hours from where the items are shipped. Shipping should be free or negligible for me.If I could subscribe to more items that would, but only pine pollen has that option.", "rating": 4}, {"title": "I tried the website", "text": "I tried the website, but kept being redirected elsewhere. But good for me I found the product on Amazon, so I'm trying the product now so in a few weeks I'll let you know.", "rating": 4}, {"title": "Lost Empire Herbs has an awesome…", "text": "Lost Empire Herbs has an awesome website with a lot of valuable information about the herbs they sell. You can literally spend hours reading on that web page about the herbs and the effect they have on the body. I can't give them 5 stars yet as I have only been using a few herbs from them for approximately a month. Since I have been taking their herbs my performance has improved and my stamina has made a marked gain. I am referring to bicycle training. I would recommend their site and herbs to any friend of mine. I suggest that reading as much as you can before you decide to order and take any supplement to make certain that you are ordering the correct product for your specific situation.", "rating": 4}, {"title": "I find the pill form of pine pollen…", "text": "I find the pill form of pine pollen less effective than the powder form which is mixed with pure honey. That could be just me, though.", "rating": 4}, {"title": "Really like the products and integrity…", "text": "Really like the products and integrity of the company. The only thing I'd add is possibly doing more to reward new, loyal customers with a discount incentive as the items are a bit pricey", "rating": 4}, {"title": "Good overall experience", "text": "Good overall experience. Lost Empire Herbs is a Godsend; previously I was using a company I found on Amazon (who's name I can't remember because it's been so long), but they no longer make the product that was very helpful to me.  I stumbled upon LEH late one night and decided to give them a try. Their pre-sales reply-speed is quite good.  Once I purchased however, it was slower - HOWEVER, that is not to say it was bad, I just noticed it was noticeably slower; perhaps these are different departments or it could be the issue I was having as a customer needed more time to resolve.  My issue was resolved and I was very happy.  The experience of LEH is pleasant, informative and empowering.  I would recommend LEH in a heartbeat to anyone.", "rating": 4}, {"title": "Herbal Review.", "text": "I have tried your products--some work good, others don't work for me. They are a little high price but they are pure herbs.", "rating": 4}, {"title": "Can't complain", "text": "Can't complain, didn't notice much but i also didn't use for that long, I did see some results so I'm by no way saying I wouldn't buy again and I would recommend Lost Empire", "rating": 4}, {"title": "i like it!!!", "text": "Dear Friend, I pray that you are doing well in every way. I pray that your body is strong and well even as your soul is.3 John 1:2 bible!!!  SHALOM!!!!", "rating": 4}, {"title": "Experience with check out an order is…", "text": "Experience with check out an order is fine to sleep formula the jury is still out also with the. Cistanche.", "rating": 4}, {"title": "Awesome company!", "text": "Logan and his brothers are doing their job amazingly!They have a good variety of herbs and their prices are fair.But! They must use a faster international shipping method!", "rating": 4}, {"title": "Orders process quickly and they keep…", "text": "Orders process quickly and they keep you posted on the status of your order. But the shipping is brutal. It was too long even before Covid. Takes 3-4 weeks to get to you. I admit that recently my pine pollen tincture arrived sooner than the powder, so it’s not all bad. A year or two ago i ordered a product and it took so long to arrive i wrote to the customer service about it. Their answer :  « Thanks for the heads up Alain ». Got the point?Not a bad company by any means, mind you, and the product is in good condition when it does arrive...  but they don’t put huge efforts on the shipping part of the deal and that bugs me a little.Good enough company and i will order again. Good product, good packaging. Just know that you have to brace yourself for some awaiting :)Alain", "rating": 4}, {"title": "Requests for previous invoices have not…", "text": "Awesome response to my review regarding previous requests for an invoice.  Thank you to the staff at Lost Empire Herbs for solving the problem.", "rating": 4}, {"title": "Good Customer Service", "text": "I received an empty package which apparently got opened in mail delivery process. I called lost Empire customer service and they immediately sent replacement. Great customer service.", "rating": 4}, {"title": "Albizia Rocks", "text": "Products were helpful. I appreciate all the information on the website. I am disabled and on a tight income. I wish it wasn’t so expensive.", "rating": 4}, {"title": "You only get 4 stars  becsuse of the…", "text": "You only get 4 stars  becsuse of the long delay in recieving the product!! Thanks to the year of \"Rhona\"19!😁But very professional and extremelly informative!", "rating": 4}, {"title": "I use this product as a supplement in…", "text": "I use this product as a supplement in maintaining a healthy bladder without the side effects of drugs.", "rating": 4}, {"title": "Only issue for me is that I had a hard…", "text": "Only issue for me is that I had a hard time finding your articles on topics when I put terms in the search bar. And the website seems slow. Products are lovely.", "rating": 4}, {"title": "Service is good", "text": "Service is good.  Not so sure about the effectiveness of the product. But that's the case where ever one shops.", "rating": 4}, {"title": "I found it a little difficult to use…", "text": "I found it a little difficult to use the site to order, but that may inpart my lack of skill. But I don't have that much trouble with other sites.", "rating": 4}, {"title": "On time delivery", "text": "Date of experience: April 03, 2023", "rating": 4}, {"title": "Ordering was easy and convenient.", "text": "Date of experience: March 13, 2024", "rating": 4}, {"title": "I think your products are great", "text": "I think your products are great. I just wish I could get to know when its best to take them, certain ones that I am using.", "rating": 4}, {"title": "Akways happy and surprised at the…", "text": "Akways happy and surprised at the quaility and great assortment of rare herbs and spices...just love this place.", "rating": 4}, {"title": "Excellent herbs", "text": "Excellent herbs. I definitely feel better since using. The goji powder came clumpy. But other than that enjoyed the overall quality.", "rating": 4}, {"title": "Great site with great service", "text": "Great site with great service. Shipping is always within a week. I will continue to use this site for the quality of your products.", "rating": 4}, {"title": "I'm using your Pine Pollen with great…", "text": "I'm using your Pine Pollen with great results in the bedroom. Thanks so much", "rating": 4}, {"title": "Service as always here was quick and…", "text": "Service as always here was quick and friendly.  I felt nothing from the pine extract and will be going back to the powder.", "rating": 4}, {"title": "Great company", "text": "Great company, great service, quality products. Just a bit pricey. But, you get what you pay for I suppose.", "rating": 4}, {"title": "4 star rating is a says a lot", "text": "For me to give a 4 star rating is a says a lot. Quality products, good supply chain, keep up the great work Logan and company.", "rating": 4}, {"title": "Clear and concise website", "text": "Clear and concise websiteEasy to navigateSimple to understandDosing and cycling was clear-cut", "rating": 4}, {"title": "You can tell it’s working", "text": "You can tell it’s working, but it takes some time.  Roughly 2-3 weeks.  Will be purchasing again.", "rating": 4}, {"title": "Lost Empire is a great supplement…", "text": "Lost Empire is a great supplement company to work with, I wish they would change their packaging for their herbs.", "rating": 4}, {"title": "The quality of the product", "text": "Date of experience: April 27, 2023", "rating": 4}, {"title": "I'll write a review in a few weeks as…", "text": "I'll write a review in a few weeks as I've been taking the herbs for less than 1 week.", "rating": 4}, {"title": "Great product, taste not as great", "text": "Great product, it works, however, it’s only a 4 because the taste is not as good as purpose of the product.", "rating": 4}, {"title": "I had no issues but believe always room…", "text": "I had no issues but believe always room for some improvement somewhere", "rating": 4}, {"title": "Good company to work with", "text": "Lost empire herb company is a good company to work with. With good products and fast delivery.", "rating": 4}, {"title": "I like them and their products I always…", "text": "I like them and their products I always buy it from there", "rating": 4}, {"title": "Purchasing product was easy", "text": "Purchasing product was easy. Explanation of product was very helpful.", "rating": 4}, {"title": "Great products and even better staff", "text": "Great products and even better staff!  thank you for making my experience a positive one!", "rating": 4}, {"title": "Great info", "text": "Great info. Great emails. Even great shipping rates to Canada. Little expensive though.", "rating": 4}, {"title": "Great products", "text": "Great products. Long delivery time to overseas because of the way the world is.", "rating": 4}, {"title": "Great service from this company.", "text": "Great service from this company.. The product however was ineffective for me..", "rating": 4}, {"title": "The results speak for themselves", "text": "Convenient ordering and subscription services!", "rating": 4}, {"title": "Good company- fast delivery- sells a…", "text": "Good company- fast delivery- sells a good products - will order again !!!", "rating": 4}, {"title": "I’m happy with the product and the…", "text": "I’m happy with the product and the speed with which it arrived.", "rating": 4}, {"title": "Information review and…", "text": "Information review and producrguidelines our thorough and informative.", "rating": 4}, {"title": "I did not get erections when I took…", "text": "I did not get erections when I took pine pollen.Bob303-519-2829", "rating": 4}, {"title": "Lost Empire Herbs is a good company", "text": "Lost Empire Herbs is a good company - fast delivery!", "rating": 4}, {"title": "The product took too long time before…", "text": "The product took too long time before it arrived.", "rating": 4}, {"title": "Solid great products and good…", "text": "Solid great products and good information on website and youtube.", "rating": 4}, {"title": "No issues with the product but takes a…", "text": "No issues with the product but takes a long time to get to me.", "rating": 4}, {"title": "The pine pollen is great", "text": "The pine pollen is great - you can really feel the difference", "rating": 4}, {"title": "I have nothing critical to state..they…", "text": "I have nothing critical to state..they are very good", "rating": 4}, {"title": "Service was good", "text": "Service was good.  Products not efficacious.Guy Yondo", "rating": 4}, {"title": "Well organized and easy to work with", "text": "Date of experience: July 13, 2022", "rating": 4}, {"title": "Good and quick service but prices are a…", "text": "Good and quick service but prices are a little high", "rating": 4}, {"title": "Pretty darn good herbs at a price.", "text": "Great quality and service but still a touch pricey.", "rating": 4}, {"title": "Nothing wrong at all…just love your…", "text": "Nothing wrong at all…just love your products!", "rating": 4}, {"title": "its good stuff", "text": "its good stuff, not really good, but pretty good.", "rating": 4}, {"title": "I'm satisfied with my products I…", "text": "I'm satisfied with my products I received.", "rating": 4}, {"title": "Need more time to see if it work,s…", "text": "Need more time to see if it work,s Thankyou !", "rating": 4}, {"title": "n/a &^%$ ^????!!!!!", "text": "Date of experience: June 06, 2024", "rating": 4}, {"title": "The cost is to high", "text": "Date of experience: September 08, 2022", "rating": 4}, {"title": "Still trying to make this herb thing…", "text": "Still trying to make this herb thing work", "rating": 4}, {"title": "Order promptly processed and delivered", "text": "Date of experience: April 04, 2021", "rating": 4}, {"title": "The best quality natural products.", "text": "Date of experience: November 27, 2021", "rating": 4}, {"title": "Good quality and delivery of products.", "text": "Date of experience: December 27, 2020", "rating": 4}, {"title": "Great product", "text": "It's good for the body and skin.", "rating": 4}, {"title": "Fast", "text": "fast and simple", "rating": 4}, {"title": "Always good prompt service.", "text": "Date of experience: November 19, 2021", "rating": 4}, {"title": "Veteran’s discount?", "text": "Date of experience: June 12, 2022", "rating": 4}, {"title": "All good", "text": "All good, thank you.", "rating": 4}, {"title": "Okay", "text": "detail information.", "rating": 4}, {"title": "Good experience", "text": "Date of experience: January 30, 2023", "rating": 4}, {"title": "Products always seem to arrive within 4…", "text": "Products always seem to arrive within 4 days. Logan is a wealth of knowledge about herbs.", "rating": 4}, {"title": "I am very confident in the starter…Lost Empire Herbs", "text": "I am very confident in the starter pack. But actually I’d like another product for increasing testosterone. My levels need another little push. send me the info for this subject!", "rating": 4}, {"title": "They do exactly,what their say", "text": "They do exactly,what their say, provide you with quality herbs,and tell you how why and what there for,", "rating": 4}, {"title": "In my opinion I think free shipping…", "text": "In my opinion I think free shipping should be available at $50!", "rating": 4}, {"title": "I have tried many company that sell…", "text": "I have tried many company that sell herbs. This Is a great one.", "rating": 4}, {"title": "Everything with my purchase went…", "text": "Everything with my purchase went smoothly and as promised. No issues at all. LostEmpire has excellent quality too.", "rating": 4}, {"title": "Easy to use website", "text": "Easy to use website, reasonably prompt shipping and delivery. Will be a repeat customer.", "rating": 4}, {"title": "Buying experience was cool", "text": "Buying experience was cool. Now in the phase of experimenting the effectiveness of the product I bought. We'll see.", "rating": 4}, {"title": "High cost,low amount of product,can't …", "text": "High cost,low amount of product,can't  afford to sustain  a regiment to see the full impact of the  product", "rating": 4}, {"title": "I bought a bag of powdered Shilajit", "text": "I bought a bag of powdered Shilajit.  The delivery was timely.  The product is effective generally more than specifically as advertised.  The taste is not terribly pleasant although palatable. Although it came with instructions to use one half teaspoon a day, I am uncertain if using it in hot liquid is optimal, and think perhaps one half tsp. a day is more than needed.", "rating": 4}, {"title": "Product is top notch", "text": "Product is top notch.  My only unsatisfied dealing has been when product received was incorrect.  I had to pay shipping to get their mistake back to them.", "rating": 4}, {"title": "Good service", "text": "Date of experience: April 28, 2020", "rating": 4}, {"title": "Good product I’m impressed with the…", "text": "Good product I’m impressed with the service thanks for everything.", "rating": 4}, {"title": "I have tried Pollen Powder (Mega Dose)", "text": "I have tried Pollen Powder (Mega Dose), Tongat Aliand Thor HammerFormula,and now Pine Pollentablets, all to no success, they all failed. That is the reason I cannot  give a five Probably something is wrong with me.lost empire ads are good  but their products have left much to be desired.PS : I am 73yrs oldand Bedroom Formula", "rating": 4}, {"title": "Good product not enough in the package..", "text": "Hello, lost empire has really good quality products.Been with lost empire since superman herbs..My favorite is pine pollen..great overall nutrients vitamins minerals all of the above... The other herbs and drops are also fresh. But...I wish they would have a sale \"BOGO\" becuz the powder extracted from the herbs are very small particles for ease of absorption and one month serving it's not enough. Every time I've ordered I never felt the first package it was only when I ordered two of same herbs into the second one I started to feel the herbs working.So order two if you order from them. They also a little expensive and don't offer no sales for two packages..", "rating": 4}, {"title": "4 stars", "text": "4 stars, only because prices are high.", "rating": 4}, {"title": "Great service", "text": "Great service! Unfortunately the product didn’t help me.", "rating": 4}, {"title": "Good luck with most of the products", "text": "Good luck with most of the products. Thor’s hammer was a disappointment but so good so far with the rest.ThanksTodd", "rating": 4}, {"title": "Not sure 🤔!", "text": "Not sure how much it’s helping me out with my issues of bed room performance. Taste is a problem, I mix it with pomegranate juice and hold it in my mouth as long as possible. My girlfriend thinks it BS. Because I’m not lasting longer than normal in the bedroom.", "rating": 4}, {"title": "I have tried several of your herbs", "text": "I have tried several of your herbs, and have received a varying degree of results.But over all I feel that the herbs that you provide are the best on the market, and I will continue to take them.", "rating": 4}, {"title": "So far so good", "text": "So far so good.  I like the pine pollen.", "rating": 4}, {"title": "I really enjoy your products", "text": "I really enjoy your products.  And you have learned, making the delivery process MUCH more enjoyable.  Thank you for not bombarding me with extensive advertising as well.  We will do business again.", "rating": 4}, {"title": "I like everything except for the…", "text": "I like everything except for the password business on the checkout.  I will never remember my password, and that process makes it difficult to complete an order.", "rating": 4}, {"title": "Prompt service and well priced product.", "text": "Date of experience: February 20, 2020", "rating": 4}, {"title": "Quality herbals that work", "text": "Quick shipping and great products. You will notice results if you take the products consistently, and you do need to cycle certain herbal items. Tongkat Ali and Pine Pollen tincture, for example to get the best results. The only downside is they are some of the most expensive products per dose. Other than that, they work. Listen to experienced guidance and listen to your body as it responds to each herbal. Used properly these items can alleviate or help greatly with many common conditions. Take good care of yourself, exercise, eat right and let nature provide help", "rating": 4}, {"title": "I have a good relationship with Lost…", "text": "I have a good relationship with Lost Empire. All the product I have ordered have right on.  THe description have been detailed.The information for each product has been well written. The products have out performed my expectation. I will continue to purchase products at Lost empire.Thanks", "rating": 4}, {"title": "I have been taking tongkat ali for…", "text": "I have been taking tongkat ali for about 10 days now. And i have noticed an increase in my upper body muscle definition. I will continue to take tongkat ali for further improvement.", "rating": 4}, {"title": "Just taking the time to find", "text": "Just taking the time to find , what works and dont work for me", "rating": 4}, {"title": "Still in the beginning of taking this…", "text": "Still in the beginning of taking this herb. I like that it has all of the ones I've researched all in one. Going to cycle, but am feeling some positive results.I heat up cranberry juice and add the herb. The taste is not bad at all. (Editing this review as it is coming up as verified under the name \"Betty\" and that is not me, so do not know how to update this. I am male; name is Mark).", "rating": 4}, {"title": "I would have appreciated an e-mail…", "text": "I would have appreciated an e-mail informing me that there was a delay with my order. It was a while before I finally called to see what happened to my order. However, the phone conversation went very well, and shortly after that I did received an e-mail informing me that my order was on the way, and it was indeed. The wait without information was not appreciated, but the phone operator was excellent and her promise that my order would be there soon was accurate.", "rating": 4}, {"title": "Great products and customer service…", "text": "Great products and customer service support !   Also a hassle-free money back guarantee.    A bit pricey, but I am convinced they’re taking the measures they claim to take to ensure quality products.  👍", "rating": 4}, {"title": "Need additional instructions on the…", "text": "Need additional instructions on the consumption of this herb.", "rating": 4}, {"title": "I'll be back!", "text": "I am new to your company, and am pleased with the pine pollen tincture that I got. It's been less than 30 days but so far it seems better than the one I got from pharm origans. I've spent a lot of money in the past on products that where more hype than hope. I will be buying more of your products after I use up the stuff I already have.", "rating": 4}, {"title": "Good service", "text": "Good service , could have been a little faster.  Nettle Root is a great product but is a little expensive.  More sales would be nice.  Maybe, a buy 4, get 1 free for example.", "rating": 4}, {"title": "I think that they have quality…", "text": "I think that they have quality products. Maybe alittle pricey. But worth it, for piece of mind. The customer service is on point! When I called customer service instead of emailing them I was alittle taken back because of the brief conversation I had. She basically told me that I didn't give it long enough to take effect. I get it, but other herbs that I've purchased I felt a difference in as little as 1 week. 2+ week's not feeling anything is adaquete time to feel something. Maybe not the full effect, np. But allow me to judge that. If I'm taking multiple herbs how do I know which one's are effective and which ones aren't. Just saying.", "rating": 4}, {"title": "Great on delivery.", "text": "Great on delivery. Very potent product. Beware if you have allergies to pollen. Also sleep was an issue.", "rating": 4}, {"title": "Great products", "text": "Great products but a little expensive to maintain a continuous supply", "rating": 4}, {"title": "Awesome product", "text": "Awesome product!  Shopping cart is very slow.  Otherwise, 5 stars.", "rating": 4}, {"title": "Everthing is ok", "text": "Date of experience: December 27, 2019", "rating": 4}, {"title": "Your company herbs are great but I just…", "text": "Your company herbs are great but I just havent found the one herb that will give me morning steel yet so im hoping my last ordered product will do the job.", "rating": 4}, {"title": "I like the products but the price is a…too pricey", "text": "I like the products but the price is a little too steep for me to continue purchasing. Have to go someplace else to get the same thing but hard to find good quality. But achievable.", "rating": 4}, {"title": "Bought your Macuna product", "text": "Bought your Macuna product. I didn't see anything from it,", "rating": 4}, {"title": "Honest opinion", "text": "Honest opinion? Delivery was prompt, have not encountered an issue to deal with customer service so have no opinion on that. As for product, I sincerely can't say if its working or not. I place under tongue & try to hold it there as long as possible but it does burn a little, that's all I got for now. Maybe after I finish this bottle & go without for a week or 2 I may notice something & will report back if I do.", "rating": 4}, {"title": "You have wonderful products but if you…", "text": "You have wonderful products but if you can find a way to lower the price then I could assure you I'd be buying more. There are those that are just getting by but still wish to pursue a healthier being.", "rating": 4}, {"title": "Trouble with ordering online", "text": "Date of experience: November 22, 2019", "rating": 4}, {"title": "The product was very good I enjoyed…", "text": "The product was very good I enjoyed it’s benefits!", "rating": 4}, {"title": "Pine Bark tincture is good", "text": "Pine Bark tincture is good.  Not sure about Thor's Hammer -- too early to comment.", "rating": 4}, {"title": "great service", "text": "Date of experience: November 09, 2019", "rating": 4}, {"title": "I recently purchased a bottle of Thors…", "text": "I recently purchased a bottle of Thors hammer pills. I thought I would purchase the pills instead of the powder. I think I should've gotten the powder but was afraid of the taste. I must say....your products have been effective for me. Keep up the good work.", "rating": 4}, {"title": "Your competition offers free shipping…", "text": "Your competition offers free shipping and at a lower price for pine pollen and other items", "rating": 4}, {"title": "I am very satisfied with my products", "text": "I am very satisfied with my products. They are working. Can't wait to try more. Definitely will be back.", "rating": 4}, {"title": "Quality Products", "text": "Products are very good but shipping costs to Australia for the weight is way to expensive!", "rating": 4}, {"title": "I love the product !!!", "text": "Date of experience: October 23, 2019", "rating": 4}, {"title": "lostempireherbs", "text": "I know the stuff that I order works for me, if not, they have a generous return policy.", "rating": 4}, {"title": "The Lost Empire website…", "text": "The Lost Empire website (lostempireherbs.com) has lots of quality herbs that you cannot find all in one place so easily on the web. Personally I think they should stay away from the animal based products ie., \"Stag swag\", as these products just promote illegal hunting and so forth. A good site.", "rating": 4}, {"title": "Great product", "text": "Great product, a little on the expensive side", "rating": 4}, {"title": "The Pine Pollen is very effective", "text": "Date of experience: September 25, 2019", "rating": 4}, {"title": "All of the products that I've ordered", "text": "All of the products that I've ordered, have been of good quality, and decent results. I will order again.", "rating": 4}, {"title": "received stag swag leaking", "text": "i enjoy all your products . i would of marked a 5 star but gave you a 4 star because i ordered stag swag and i received it leaking in the package . kinda got upset cause it cost so much then for it to leak in the package , well im sure you understand , you would probably be upset also if you were in my shoes.", "rating": 4}, {"title": "Company's great", "text": "I guess it's ok as far as the herbs go. Really didn't tell any difference for myself. Customer service is awesome. I might give it a try again a little down the road.", "rating": 4}, {"title": "Sorry did nothing do not waste  your…", "text": "Sorry did nothing do not waste  your money.", "rating": 4}, {"title": "Simply put.", "text": "Simply put.. great products (tongkat, Pine Pollen, Stag Swag). But, nothing in life is perfect. That's why the 4stars.", "rating": 4}, {"title": "Good products", "text": "Good products, just wish price point was more reasonable.", "rating": 4}, {"title": "Good service", "text": "Good service. Fast and prompt", "rating": 4}, {"title": "The herbs work!!!", "text": "Date of experience: August 29, 2019", "rating": 4}, {"title": "Great products and service", "text": "I have enjoyed a plethora of your products. Thanks!", "rating": 4}, {"title": "Great site for some herbs", "text": "Great site for some herbs. Variety isn't great but quality seems to be there. A little on the pricey side though.", "rating": 4}, {"title": "Provides in-depth information regarding…", "text": "Provides in-depth information regarding products", "rating": 4}, {"title": "I like it", "text": "I like it. 😄🤤", "rating": 4}, {"title": "Great.", "text": "All good, thank you.", "rating": 4}, {"title": "I just don't understand why it take so…", "text": "I just don't understand why it take so long to receive my product from the time I order it.", "rating": 4}, {"title": "Serving sizes are too complicated to…", "text": "Serving sizes are too complicated to figure out especially with most not coming with any sort of measure or scooper.", "rating": 4}, {"title": "No problems to date", "text": "No problems to date. Keep up the good work!", "rating": 4}, {"title": "Good company to supply herbal products…", "text": "Good company to supply herbal products with great selection. Shipping is very efficient.", "rating": 4}, {"title": "Great products and service......", "text": "Date of experience: August 08, 2019", "rating": 4}, {"title": "Lost empire herbs", "text": "I have used some and liked them even if I felt no different on them, so it's difficult to say.", "rating": 4}, {"title": "Very good service", "text": "Very good service, herbs and tinctures are first rate. But return customers are not given any discount for their continued purchase loyalty.", "rating": 4}, {"title": "Your site is great and I would buy more…", "text": "Your site is great and I would buy more but it's too expensive to do every month. And as you know some herbs take longer to work right. If you could get more product in each bag that would be great! I'm really trying to make herbs a daily part of my routine,but the cost :(", "rating": 4}, {"title": "Because nobody is perfect....", "text": "Date of experience: August 02, 2019", "rating": 4}, {"title": "I’ve had a positive experience with…", "text": "I’ve had a positive experience with herbs I’ve taken , the only reason I didn’t give it a 5 star review is because I’m still experimenting with some of the herbs to see what suits me best .", "rating": 4}, {"title": "Great products, but should not be discontinuing lesser-selling herbs", "text": "Your products are wonderful and your service is excellent! But I wish you would stop discontinuing certain herbs just because they are not your best sellers - especially after you have gone to great lengths to convince us how great they are. Would love to rely on you as a one-stop shop!", "rating": 4}, {"title": "First time user..", "text": "First time user... still evaluating.", "rating": 4}, {"title": "Lost Empire Herbs is one of the best…", "text": "Lost Empire Herbs is one of the best quality herb supplier, I've ever ordered from. There prices are exorbitant.", "rating": 4}, {"title": "Lost empire herbs is pretty legit", "text": "Lost empire herbs is pretty legit. They answer your questions and concerns and overall very friendly people. 4 stars!", "rating": 4}, {"title": "Fantastic quality products", "text": "Fantastic quality products, my only complaint would be the pricing. Just too expensive to use everything every month.", "rating": 4}, {"title": "Always excellent service", "text": "Date of experience: July 21, 2019", "rating": 4}, {"title": "Love the pine pollen and thors hammer…", "text": "Love the pine pollen and thors hammer but not to much of an effect of the Phoenix  capsules. Need something to feel more energy for the morning.do you have red panax ginseng  or something better", "rating": 4}, {"title": "Good stuff", "text": "Good products. More than fair, easy returns. Will order again", "rating": 4}, {"title": "Great delivery", "text": "Great delivery, great videos, 4 only because I am new to herbs and still checking potency and results. I have nothing to compare.", "rating": 4}, {"title": "herb questions. i have left a couple of requests for someone to call me but i have not heard from anyone.", "text": "having questions on the herbs and not being able to contact a person on my questions.", "rating": 4}, {"title": "Excellent quality and would give five…", "text": "Excellent quality and would give five points but they seem to be out of products on a regular basis.", "rating": 4}, {"title": "This Company has returned my questions…my experience with Lost Empire Herbs.", "text": "This Company has returned my questions very soon after asked.I believe there products are of the finest supplements made on the Planet.", "rating": 4}, {"title": "I ordered on line and it showed up", "text": "I ordered on line and it showed up. Nothing else outstanding regarding service.", "rating": 4}, {"title": "SERVICE AND PRODUCTS ARE EXCELLENT BUT…", "text": "SERVICE AND PRODUCTS ARE EXCELLENT BUT SOME PRODUCTS ARE SOLD OUT SO CAN NOT ORDER", "rating": 4}, {"title": "Very informative", "text": "Very informative, great breakdown of herbs and their uses.", "rating": 4}, {"title": "I had to wait almost three weeks for my…", "text": "I had to wait almost three weeks for my pine pollen.  Otherwise you guys would have gotten a five.", "rating": 4}, {"title": "You run out of product way too often…", "text": "You run out of product way too often and for way too long of a Time", "rating": 4}, {"title": "Overall I’m very happy with Lost…", "text": "Overall I’m very happy with Lost Empire. I’ve been impressed with shipping times and the quality of products. Things are a little pricy however and my latest order did not arrive when expected. I’ll continue to give them my business and highly recommend them to friends and family.", "rating": 4}, {"title": "Could be better", "text": "Been taking Phoenix and spartan every morning in my smoothie its working for me but I tried spirulina and couldn't handle the taste only took a few tablespoons out of $60 tub I bought tried contacting customer service several times through website only response was try mixing it with juice even though it says satisfied or money back I ended up throwing the whole thing in garbage along with my $60", "rating": 4}, {"title": "BUT........................", "text": "BUT........................It  would  HELP A LOT  MORE....It  ALL the  Powdered  products  were in  capsules/gelules !!!!!!!", "rating": 4}, {"title": "sometimes shipping the products takes…", "text": "sometimes shipping the products takes longer than I expected", "rating": 4}, {"title": "Service had been fine", "text": "Service had been fine. Have nothing but good things to say.", "rating": 4}, {"title": "Like your products just wish you would…", "text": "Like your products just wish you would sell more in capsule form it's easier to take that way.", "rating": 4}, {"title": "Lost Empire Herbs", "text": "Very informative website and quick delivery.", "rating": 4}, {"title": "Products are good", "text": "Products are good. a little pricey and trying to figure out which testosterone and libido product works the best without spending too much money, can be a little overwhelming", "rating": 4}, {"title": "Top notch all natural herbs", "text": "Date of experience: November 02, 2018", "rating": 4}, {"title": "I tried some of the p[products and read…", "text": "I tried some of the p[products and read the material but I am still not sure that the herbal products actually had any effect on my systems. It may be different for others. I felt that my questions were answered well and the customer service was good. I may try other products based on this experience. I found much of the research done by the company very interesting and in depth, helpful and informative regarding herbal supplements and general health and exercise.", "rating": 4}, {"title": "I ordered the Tongkat Ali capsules in…", "text": "I ordered the Tongkat Ali capsules in the hope that they would increase my libido. Previous experience with horny goat weed was not successful. Effects were not immediately noticeable for me. It took about a week before I felt any effects but then it kicked in. I am in my fifties and diabetic but this has revived my sex life. I've been taking them for about a month now and have had  no adverse side effects.", "rating": 4}, {"title": "Amazing herbs", "text": "My cognitive health has been declining and I am afraid it’s just getting worse I run a small business and is unable to function properly  can focus , struggle to make decision And get real anxious around people I am  53 , but I run around my business like a teanager Now with the help of the lions mane  I am doing much better it really does help me to get some things done I want to  dive into taking some more herbs but I need an assessment of what’s going on with me   But already I can tell there is good things to come So glad I found empire herbs", "rating": 4}, {"title": "Excellent products", "text": "Excellent products, really enjoying the cordyceps and pine pollen. Will order again.", "rating": 4}, {"title": "all the product seemed to be of good…", "text": "all the product seemed to be of good quality and arrived well protected in resealable packaging", "rating": 4}, {"title": "I  am    alone ...", "text": "I  am    alone ...I do  not  need  much  for  lots of  purchases  but  I  appreciate    all the  tips  even if it's  not  possible to  try   them  all...", "rating": 4}, {"title": "great service", "text": "Date of experience: September 30, 2018", "rating": 4}, {"title": "I recently ordered Tongkat Ali", "text": "I recently ordered Tongkat Ali. It arrived quickly but I was disappointed that it did not contain a small spoon to measure the very small and otherwise difficult to measure recommended dosage.", "rating": 4}, {"title": "Good products", "text": "Good products. Saw more results by far with the powders vs. the pills.Pills don't have the same impact.Love the vids online and it helps me to understand your product line.The pure herbs in powder form don't taste very good but do work.Have ordered a lot from you and are a reputable company.", "rating": 4}, {"title": "Products are not always available but…", "text": "Products are not always available but good products and timely shipping", "rating": 4}, {"title": "great products and quick delivery!", "text": "Date of experience: September 14, 2018", "rating": 4}, {"title": "Products are good but you need more…", "text": "Products are good but you need more stock and it would be good for you to launch in the uk .So if your looking for partners or agents please contact me.Thanks Sadi kilinch", "rating": 4}, {"title": "Great products", "text": "Great products but items out of stock to often", "rating": 4}, {"title": "Thor's…Hammer WORKS !!!", "text": "I found what I needed with Thor's hammer , I plan on re-ordering when I can", "rating": 4}, {"title": "Great product offerings and seems run…", "text": "Great product offerings and seems run by people who care about their products and customers.  Not the most competitive prices, but reasonable.", "rating": 4}, {"title": "See for yourself", "text": "I wasn't expecting super powers nor did I get them with using their Supplements but I do feel they have helped. I am highly satisfied with the products, selection and quality. They really seem to be focused on what they want to provide.", "rating": 4}, {"title": "Constructive criticism", "text": "Good company and decent stuff. Although some of them the serving size dosis is not strong enough to feel all the beneficial. E.g. tongkat ali even though I take three doses at the same time I don´t feel  that boosts my testo. This herb once the bag opened after a few days becomes the powder lumpsy (I completely sealed after using and put it in a dry place). I don´t know if the concentration of your herbs are not as high as I wish. Well in any case, as I told at the beginning a good company and decent stuff!", "rating": 4}, {"title": "Always having energy makes it hard to…", "text": "Always having energy makes it hard to determine what effects the different herbs are having on me . I know i feel better and have lost at least 10 pounds of fat around my stomach which is hard to do when you are 58 .  Cycling pine pollen and doing he shou wu everyday along with maca and will give updates to see it my grey hair starts turning dark again , Satisfied with my purchases so far and my girlfriend says that the Athena formula gives her energy !!!", "rating": 4}, {"title": "Almost 5 stars!", "text": "I would have given you 5 stars, but you are out of the mental formulae which I need on a daily basis. Please get that back in!", "rating": 4}, {"title": "Nice product and good  customer service", "text": "Date of experience: August 08, 2018", "rating": 4}, {"title": "So far this seems like the real deal…", "text": "So far this seems like the real deal but it's a little hard to tell as experience with other brands is something I do not have.  In shopping around the prices seem a little high but I have no complaints with the product and am okay with paying more for quality items.", "rating": 4}, {"title": "Thanks anyway.", "text": "I like the company and the products but was disappointed that an email I sent was ignored and deleted.  I was seeking information for a problem I have and was hoping for an answer either way. This won’t prevent me from continuing to order the products.", "rating": 4}, {"title": "Impressive list of beneficial…", "text": "Impressive list of beneficial ingredients in Pine Pollen.Impressive list of claimed possible benefits of consumption.I perceived no benefit from this powder.", "rating": 4}, {"title": "Lost Empire Herbs Review!", "text": "Although only sometimes it feels a bit expensive especially on the shipping, most of the products are effective and amazing such as the Black Ants, Pine Pollen Tincture and Bacopa. The Black Ants and the tincture gave me my energy and overall health back while the Bacopa helped me to remember old memories and maintain new memories!", "rating": 4}, {"title": "i like lost empire herbs.......easy to…", "text": "i like lost empire herbs.......easy to shop , good products", "rating": 4}, {"title": "Easy peezy...no problems whatsoever.", "text": "Date of experience: July 24, 2018", "rating": 4}, {"title": "Herbs with a ‘ H ‘.", "text": "The service is always prompt and slick, you also get the feeling your’e dealing with a good company. I have only been taking the herbs for a a short while and so far I’m happy with the results.", "rating": 4}, {"title": "LostEmpireHerbs is trustworthy", "text": "LostEmpireHerbs is a great place to get quality herbs and good information on what you are interested in. I believe they truly have your best interest in mind!", "rating": 4}, {"title": "Awesome", "text": "Awesome! Easy to use and lots of good information", "rating": 4}, {"title": "Overall pretty good", "text": "Definitely good for men. Great to supplement instead of taking pre-workout all the time.  Downside is that it makes us feel itchy, so might not be the best for people with allergies.", "rating": 4}, {"title": "I like the product reviews and…", "text": "I like the product reviews and instructional videos.  Very informative.", "rating": 4}, {"title": "Great products and service", "text": "Great products and service. Also the articles are very informative.", "rating": 4}, {"title": "Great products and prompt delivery", "text": "Great products and prompt delivery, too much email", "rating": 4}, {"title": "Easy checkout process and good…", "text": "Easy checkout process and good information about the product on the website.", "rating": 4}, {"title": "I like it so far seem's to work", "text": "Date of experience: June 26, 2018", "rating": 4}, {"title": "Great service", "text": "Great service. Very fast delivery.", "rating": 4}, {"title": "The company is great", "text": "The company is great, my order was sent out in a timely manner, however I tried the Pine Pollen Tincture and didn’t have good results with it. As far as I can tell, my diet was the same but on the pine pollen I gained 10 lbs. now that I’m off the pine pollen my weight has dropped back to normal.", "rating": 4}, {"title": "Great job from purchase until deliver!", "text": "Date of experience: June 10, 2018", "rating": 4}, {"title": "I love He Shou Wu", "text": "I love He Shou Wu, as well as Hercules, Started taking Tongkat Ali & Pine Pollen tincture two months ago and starting to see results. 4 Stars leaves room for improvement need something to shoot for. Thank you, Donald Lambert", "rating": 4}, {"title": "No problems", "text": "I haven't had any problems with my orders. So have not had to deal with customer service.", "rating": 4}, {"title": "tried several products with no results…", "text": "tried several products with no results for E D.", "rating": 4}, {"title": "Good stuff", "text": "Good stuff, but sometimes too expensive", "rating": 4}, {"title": "Excellent quality and delivery but expensive", "text": "Excellent quality and delivery. Only reservation is the cost, can save 20 - 30% on similar quality by searching Amazon.", "rating": 4}, {"title": "Well I feel if you are on medication… Yes, but are there other herb,am not saying the herb is not good, I would like to know if there other herb that will help.", "text": "Well I feel if you are on medication like pressure pill and calculator pill. What herbs are the best one to use. Because the pine pollen and the tongkat,nettle root with the   pine pollen tincture, is not bad but it didn't work that well with me. Maybe because of the medication am on. If possible can you tell me of another one, that may work because of the medication.", "rating": 4}, {"title": "Black Macca Root", "text": "Quick service, quality product that fits what they say. I'm a fan and will continue to be a customer.", "rating": 4}, {"title": "The reason for this grade", "text": "The reason for this grade, is because I don't know if your products are glyphosate free. Please advise", "rating": 4}, {"title": "Lost Empire Herbs; REAL natural supplements!", "text": "Lost Empire Herbs offers incredible products at fair prices!  They make sure they are giving you natural products that are safe and of the highest quality.  They do research before releasing a new product to make sure that they are giving their customers the best!  The only small thing that keeps me from giving them 5 stars is that they don't offer overnight or 2nd day shipping, etc.", "rating": 4}, {"title": "Thor's Hammer formula", "text": "Thor's Hammer formula, wish I could get in capsule form.", "rating": 4}, {"title": "The herbs are good quality,excellent…", "text": "The herbs are good quality, excellent customer service and if you dont mind paying for quality, I highly recommend.", "rating": 4}, {"title": "Great products and insights", "text": "Great products and insights. A little pricey.", "rating": 4}, {"title": "Delivered in timely manner.", "text": "Date of experience: April 30, 2018", "rating": 4}, {"title": "Great product wish the delivery was a…", "text": "Great product wish the delivery was a little faster besides  that very happy", "rating": 4}, {"title": "Very knowledgeable", "text": "Date of experience: April 29, 2018", "rating": 4}, {"title": "Still in the beginning of using…", "text": "Still in the beginning of using product. I love the products and how detail website is. The only thing I would like is that with your first order of a product that you would include a card with details of uses and all the benefits of using the product. I like to keep notes with my supplements... to evaluate how it works for me.", "rating": 4}, {"title": "Just received my product today... I am very happy with the service...", "text": "Thanks Lost Empire Herbs. Much appreciated.", "rating": 4}, {"title": "My experience", "text": "I am a 61 year old male in good health but wanted a little help with energy and libido so last year I tried the Tongkat Ali and pine pollen tincture. It was helping some but not as good as I had hoped, but oddly when I ran out and quite taking it then my energy  and libido went through the roof and lasted about 3 months. So here I am again taking it for about 3 weeks now and again it is ok but not great, hoping it will do like last year and really kick in when finished. Can you give me an explanation of why this worked for me in this way?", "rating": 4}, {"title": "The first  week  I tried  a daily …", "text": "The first  week  I tried  a daily  evening  shake of maca tonk Kat Ali Nettle  and  Nettle  root.I could  tell  the  difference  by day  4. I had more energy  and stamina.  I am now cycling  weekly  between  the  tong Kat Ana the nettle  root.", "rating": 4}, {"title": "Pine pollen does its job.…", "text": "The pine pollen extract seems to have made a difference in my workouts i.e. strength and stamina increases.", "rating": 4}, {"title": "seems to help", "text": "Date of experience: April 18, 2018", "rating": 4}, {"title": "Availability sometimes sucks.", "text": "Now that you appear to have your delivery problems worked out, my only comment is the regularity with which you run out of products.", "rating": 4}, {"title": "this is the finest pine pollen I saw…", "text": "this is the finest pine pollen I saw online, very pure and effective yet very expensive Also, Thor hammer formula makes miracle use it wisly", "rating": 4}, {"title": "Impressed", "text": "I'm impressed. Especially the shilajit. The effects have me feeling great.", "rating": 4}, {"title": "Still enjoying the products which seem…", "text": "Still enjoying the products which seem instrumental in the maintenance of good health at age 72.", "rating": 4}, {"title": "Review", "text": "Good solid product.  One issue I had is that i purchased a decent size order and then a few days later they had a promotion for the product I bought and would not extend that to me.  I will continue being a customer.", "rating": 4}, {"title": "Anticipation", "text": "I give the product and information about the products a 4, but trying to go to website to purchase again was very difficult for me. I've been w/o product for over a month. Just received shipment yesterday so just started taking Pine Pollen & am looking forward to fantastic results!", "rating": 4}, {"title": "Good products", "text": "Great products good service. Not crazy about shipping charges", "rating": 4}, {"title": "they are good", "text": "they are good, but they should offer some kind of loyalty discounts", "rating": 4}, {"title": "Almost", "text": "Although I couldn't take these powered herbs as they didn't agree with my sensitive stomach I believe the quality is first rate and the return policy was easy and no questions asked I would of given them 5 stars if they would of worked for me.", "rating": 4}, {"title": "I do believe that you have did your …", "text": "I do believe that you have did your  research on your product but as with anything when there is money involved there is a certain amount of trust in saying I do hope that you really are doing the research on all of  your products.  Your client for life", "rating": 4}, {"title": "Quality is great", "text": "Quality is great, but prices are way too high. Also, should have options for loose powder or capsules for all herbs.", "rating": 4}, {"title": "So Far, So Good", "text": "The product is a little expensive. Also I do not like the idea of being forced to give to charity, especially ones that I have never heard of. Other than that I am hoping that I am starting to notice a change in my body. I will give the product that I have purchased an opportunity to do what I want. The orders that I have placed come quickly.", "rating": 4}, {"title": "I wanted to try a new product", "text": "I wanted to try a new product, but couldn't get a discount that I thought I offered. The responses were timely & informative, the way it was handled was great; just disappointed.", "rating": 4}, {"title": "I found your side to be very informative", "text": "Date of experience: April 01, 2018", "rating": 4}, {"title": "Great products, disappointing courier", "text": "Great business. Great products. Good honest service. Courier used for international deliveries very disappointing  -  very slow, unreliable and impossible to communicate with.", "rating": 4}, {"title": "Shipping takes an unusual amount of…", "text": "Shipping takes an unusual amount of time sometimes.", "rating": 4}, {"title": "high quality and high price", "text": "herbs are top qualityI realize quality is not cheap but I wish they would offer cheaper shipping on smaller orders.   The packages weigh almost nothing.", "rating": 4}, {"title": "All products are excellent", "text": "All products are excellent, just wish they were a little less expensive.", "rating": 4}, {"title": "Always a good experience...", "text": "Date of experience: March 30, 2018", "rating": 4}, {"title": "Good quality herbs", "text": "Date of experience: March 29, 2018", "rating": 4}, {"title": "Good produce", "text": "Good produce, but a little expensive. Still too early for an overall opinion.", "rating": 4}, {"title": "Only problem I see is never got an…", "text": "Only problem I see is never got an answer to a question I left concerning which item to purchase.", "rating": 4}, {"title": "I am seeing some good results", "text": "I am seeing some good results.  There are so many different herbs and it gets confusing.  Because everytime I receive an email with a new type of herb, it seems to me that it's repetitive to one herb to another.", "rating": 4}, {"title": "good to very good quality", "text": "i've purchased and used a broad range of herbs from LE. good to very good quality. prices on the high end though; many products generally not so exceptional as to offset the pricing; exceptions are the super fresh, very energetic schisandra berry and good quality, nicely priced maca. also impressed with the quality and smooth taste of their shilajit resin.  fast shipping, good customer service.", "rating": 4}, {"title": "Excellent customer service.", "text": "Date of experience: March 29, 2018", "rating": 4}, {"title": "They’re great gave me my sex life back", "text": "Date of experience: March 29, 2018", "rating": 4}, {"title": "Thank you and good continuation.", "text": "Thank you and good continuation.P&P", "rating": 4}, {"title": "Very good service", "text": "Very good service, quality of products i have yet to determine.", "rating": 4}, {"title": "Last night.....I went to check…", "text": "Last night.....I went to check out....and after inputting two cards, an error message said: \"Expiration date incorrect\"...which was not true!  This am, went to the site and it worked. So 3 stars for an Tech Gliche....but 5 Stars for how the products work for me!", "rating": 4}]