[{"title": "They found me an excellent agent.", "text": "They found me an excellent agent. ", "rating": 4}, {"title": "The agent did 3 open houses and I was…", "text": "The agent did 3 open houses and I was also able to do my own open house and A buyer came to my open and I sold it, my agent was very helpful", "rating": 4}, {"title": "6% commission to 4.5%", "text": "6% commission to 4.5%! It was great.  But, the realtor tends to push your house price lower for fast sales to gain more customers from Clever. Lots of conflicting interest. Clever is one of ways to against 6% mandatory fee.", "rating": 4}, {"title": "Saved us money and avoided trying to…", "text": "Saved us money and avoided trying to negotiate with different real estate agents. However, we got several emails that kept asking us why we left. ", "rating": 4}, {"title": "Saved money; got full service", "text": "I had a very good experience with Clever. They gave me 3 names of realtors in our area. I interviewed 2 of them, and they both seemed good, but I wanted a couple more, preferably from different realtor companies. That was taking a while, so my husband and I decided to go with one of the original 2 instead of waiting. It turned out to be a good decision, but it would have been nice to have been given more choices. Our agent provided full service while saving us a lot of money. I would use Clever again in the future. ", "rating": 4}, {"title": "I love the 1.5% fee", "text": "I love the 1.5% fee. You will get average to below average real state agent. We close on the house yesterday, and our agent never said a word of congratulations at all. It felt like she was working more for the buyer than for us. I know the 1.5% it doesn't feel like much, but at least show some more interest when participating on this king of programs.", "rating": 4}, {"title": "Our experience with Clever was great!", "text": "Our experience with Clever was great! Our Agent was awesome! The only issue is in the beginning we asked for just 3 agents to contact us and we would let Clever know if we needed more. They had way more than 3 contact me which was overwhelming, but we worked it out. Besides that hiccup, everything was perfect and we would use Clever again!", "rating": 4}, {"title": "Our agent was very knowledgeable about…", "text": "Our agent was very knowledgeable about the market and was able to take in our valuation bias and correctly guide us in a listing price.", "rating": 4}, {"title": "Its been wonderful experience", "text": "Its been wonderful experience. They made process so smooth that    I didnt face any issue. Employees are so empathetic that I m so happy and would recommend if you are looking for great service.Thank you", "rating": 4}, {"title": "Not entirely full service but a great option to save thousands!", "text": "Clever quickly connected me with 2 longtime agents to choose from. I did alot of elbow grease work myself but we were able to sell our house for just above asking price. We saved thousands on commissions and will get back a few thousand when we close on our new house. Well worth it!", "rating": 4}, {"title": "Reliability", "text": "Your team works with reliable realtors", "rating": 4}, {"title": "The realtor I found was great", "text": "The realtor I found was great, the process of wading through all the options wasn’t the best. Some of the other options sent didn’t stick to the fee structure, and some thought I was buying not selling. One was very aggressive and I had to tell them I went with someone else a few times.", "rating": 4}, {"title": "Obviously the lower commission is the…", "text": "Obviously the lower commission is the major selling point here, but you also get an experienced realtor not a new one. The texts and emails can get to be too much though.", "rating": 4}, {"title": "Great way to find a realtor at a good…", "text": "Great way to find a realtor at a good price. Minus 1 star because the persistent request to leave a review afterwards is annoying af.", "rating": 4}, {"title": "Found our forever Home Remotely", "text": "We were shopping via the internet and heavily needed to rely on support from our Realtor Dee Corbett. She worked with us as we narrowed down the exact city we wanted to relocate to... Dee and her team accommodated our unique needs and circumstances. We finally settled for a home in the city of Pepper Pike, Ohio. Areas that had a negative impacted on our home purchasing experience were: 1) Time zone differences which sometimes impacted our ability to get quick answers necessary. 2) The Sellers wanted a non traditional \"As-is\" Sale; this made the negotiating challenging and emotionally taxing. We definitely could have used a more guidance to help us and the seller anticipate the chain reaction that would arise as a result of the contract extensions etc.   The lack of clarity on how these issues impacted the original closing date,  negatively impacted our renovation loan program that we were building into our Mortgage... Other than that the overall experience was professional and accommodated our unique remote location & needs.", "rating": 4}, {"title": "Simple just contact Clever and start…", "text": "Simple just contact Clever and start saving money ! It would of been 5 stars but a little misleading ? Says 1.5 % commission BUT if house is under $200k flat fee of $3.000 to LIST house. So if house is $100k you pay $3.000 which is 3% etc.", "rating": 4}, {"title": "We saved a lot on commissions by going…", "text": "We saved a lot on commissions by going through Clever and the agent assigned to us was very good", "rating": 4}, {"title": "Trust worthy agent", "text": "Rich was very kind and had the willingness to help us. He's good at updating us every week.", "rating": 4}, {"title": "It worked like it should", "text": "It worked like it should. Sell your real estate and save on commissions..", "rating": 4}, {"title": "Land Purchase", "text": "Jeni Spagnoli was very helpful. We would be happy to use her for the sale of our home.", "rating": 4}, {"title": "Clever set me up with Shannon at Keller…", "text": "Clever set me up with Shannon at Keller Williams. She is great, responsive and has her clients best interest in mind. Only issue I had was when she decided to turn me over to her managing broker. Other than that, I would use clever again and I already told a friend of mine to use clever to save some money during the sale of his home.", "rating": 4}, {"title": "The Experience Was Great", "text": "The Experience Was Great, But Not Enough Open Houses. Also, The Final Walk Through Was Done By The Owners Friends and Realtor. Was Never Contacted By Our Realtor or There Realtor of This Situation. Need to Be Informed Of This Happening. The Friends Did Not Buy the House it Was the Owners Who Entered Into a Contract. Other Wise Eric was Great!", "rating": 4}, {"title": "Satisfied", "text": "We were paired with a local agent who was extremely experienced. Property sold in two weeks as well as for even more than the asking figure.Given the fact that this was a cheaper commission contract, the quality we received was not really discounted.", "rating": 4}, {"title": "The website was easy to use and we got…", "text": "The website was easy to use and we got exactly what was advertised. It was a great way to save money selling our home. The realtor chosen for us was very good at his job. The only downside was he kept reminding us that he wasn't being paid enough, even though realtors willing sign up to participate for this service. It was not very professional but we appreciated his service and all the expertise he provided us. Overall a great experience and I would use Clever again.", "rating": 4}, {"title": "Clever agent great", "text": "Clever agent great. Buyer not so great", "rating": 4}, {"title": "The agent was thorough and effective", "text": "The agent was thorough and effective. My only complaint was that for the flat fee quoted by Clever, the agent would only post 10 photos, would do no open house, etc., just the bare minimum required. I ended up paying more to get professional photos, 20 photos instead of 10 and she did do an open house. I felt the level of service should have been indicated up front. Otherwise a good experience.", "rating": 4}, {"title": "After contacting CRE they recomended Jenn Kerstetter", "text": "After contacting CRE they recomended two agents both of which I checked out on the internet. One of them didn't impress me very much so I went with the other one and she turned out to be great. She was competent, hard working, punctual and enthusiastic, a pleasure to work with and we got the house sold. Her name is Jenn Kerstetter with Howard Hanna real estate. CRE worked out well for me and helped me save a few bucks.", "rating": 4}, {"title": "Remarkable service", "text": "Remarkable service. I was able to sell my home in about five months despite it being a buyers market. Happy with clever in teaming me with a real estate agent and also about the seller agent’s flat rate commission. Saved us much! It may have been a personal experience but the agent could have been more friendly and accessible hence one star less ( the rest of their office seemed to make up for it). But mission accomplished and a big thanks to Clever!", "rating": 4}, {"title": "Knowledgeable and encouraging", "text": "Our agent was very knowledgeable and had a lot of experience to rely on.  He did almost weekly open houses and at different times to appeal to different buyers. He kept us positive when our house didn't sell right away.  Only minor negative was we would have liked a little more recommendations along the way.", "rating": 4}, {"title": "Felt like this was the first time for…", "text": "Felt like this was the first time for everybody selling a home, Underwriter on down seemed lost on transferring solar and I am sure it’s not the first time Tesla has transferred a solar lease. My agent Donna seemed like she was always trying to help but her hands where tied due to other people", "rating": 4}, {"title": "Brandon was responsive", "text": "Brandon was responsive, friendly, helpful, and knowledgeable. The only reason I didn't give him five stars is because some things were not completed at the house until the last minute (the actual day of closing). I really appreciated his patience and flexibility dealing with a seller (me) who was in Spain during the entire process.", "rating": 4}, {"title": "The revised fee approach to selling…", "text": "The revised fee approach to selling real estate is more in line with today's market. We successfully sold our home in 2 days at a price higher than our original estimate. We purchased another home 2 days later in a very quick negotiation at a reduced price. We would recommend using Clever for your real estate listings. One star off as there were a few hiccups in the paperwork throughout the process but one needs to remember it is the seller's job as well to closely watch all details so everything was sorted out successfully.", "rating": 4}, {"title": "Great price for the service provided", "text": "Great price for the service provided.  The agent was not very prompt about responding to any text or phone call. If you use this service be patient with them, you are the lowest paid commission they have and the lowest priority.  But overall I would still use them again it saved us about $6000.00", "rating": 4}, {"title": "Clever put me in touch with a awesome…", "text": "Clever put me in touch with a awesome agent. Lisa Strnad was a few minutes early for our appointment, came armed with a action plan. She arranged everything. Staging, professional photography and everything necessary. We negotiated the commission & I signed in less than a hour or so.", "rating": 4}, {"title": "Great working with Adam Golke", "text": "The first agent Clever had us contact didn't work out, but the second one, Adam Gohlke of Gold Bar Realty was one of the best I've ever worked with. Super calm, very patient, and very efficient. It could not have gone better. I would highly recommend him.", "rating": 4}, {"title": "Saving money!", "text": "Date of experience: March 29, 2024", "rating": 4}, {"title": "For the leads I was able to convert…", "text": "For the leads I was able to convert into listings the transactions were great. My issue is most of the leads are very skeptical of how this works and think its a scam. I feel that you should poll the agents you work with the see who wants to offer full service listings and advertise that it is a full service listing for 1%. The only think I am not offering with these listings are an open house. Mostly because in my market they are not needed and the house will sell quickly. Otherwise it is a full service listing with professional measurements and photos. I feel that if the people realize this then they wont be as skeptical.", "rating": 4}, {"title": "If this was a review for just our…I would highly recommend Clever Real Estate.", "text": "If this was a review for just our buyers agent, I would give it all 5 stars.  You found us the perfect agent in a different state.  Kevin Nell went above and beyond what was expected.  He was there for inspections, walk throughs, and even found us contractors since we couldn’t be there.  I hope to continue working with him in the future.Our sellers agent was good.  She had someone hold open houses and made brochures after I had asked.  She was very accurate on the price our home would sell for.  I worked mostly with her assistant, Lisa Her, who did an outstanding job. Using Clever Real Estate on both sides saved us significant money.", "rating": 4}, {"title": "Clever is a great concept, however.......", "text": "Clever is a great concept, however in my case the first two realtors that were assigned to sell my home weren't interested due to the low profit margin. Luckily the 3rd agent was interested and took it on. This is a good way to get your property listed on the MLS but don't expect your assigned realtor to spend a whole lot of time focusing on selling your home. Realtors can make 3 times as much money selling through someone not listed through Clever. I took it upon myself to take good pictures of the home and did a little Facebook marketing to get more foot traffic through our home. All in all it worked out great. We sold our home and saved about $8,000 in the process.", "rating": 4}, {"title": "Services are as good as hiring an agent…", "text": "Services are as good as hiring an agent for full commission. Was able to successfully sell our house, which all the previous agents couldn't, besides saving some money for our next one! Thank you Clever!!", "rating": 4}, {"title": "I contacted 3 agents and chose one to…", "text": "I contacted 3 agents and chose one to help sell our home. I believe we obtained the same level of service for 1% commission as we would have been given if we paid 3%.", "rating": 4}, {"title": "Amazing Experienced Realtor", "text": "Clever had realtors contact us and the first one that called was amazing! We went with him! He gave top dollar service for a bottom dollar price. We feel so lucky to have had his experience during the sale of our home. I think this type of discount service should be more common. Throwing away money on closing costs is just hard to swallow. The only reason I have this a four as because even after we had spoken with our realtor and selected him clever kept contacting us with other realtors even after we told them we were all set. It seemed like there was a lag in their system and we found it super annoying. Other than initially signing up and selecting our realtor we didn’t have any other use or need to contact clever. That is a testimony to our realtor...so not sure how much credit clever actually deserves. But overall we are happy and grateful we went this route. No regrets!", "rating": 4}, {"title": "Mixed Feelings on this concept", "text": "Not sure the realtor actually wanted to be engaged with the flat rate fee.  I assumed Clever had their own real estate agents but apparently not.", "rating": 4}, {"title": "Great service with low commission", "text": "Well, I have to work with multiple realtors, at least two. However, I found the best one.Thanks for finding best agent. Jesse was great!", "rating": 4}, {"title": "Your website was easy and the Clever…", "text": "Your website was easy and the Clever partner agent was experienced and knowledgeable.  My home sold quickly and for over asking price.", "rating": 4}, {"title": "wonderfully seamless", "text": "the agent Deedee that Clever connected me with was amazing. She made the house selling process easy, supported, and seamless", "rating": 4}, {"title": "Agent in the Villages", "text": "Date of experience: December 16, 2022", "rating": 4}, {"title": "To be honest with you", "text": "To be honest with you, I felt like I was asking all the questions when some of them should have been shared with me by the agent.", "rating": 4}, {"title": "clever saved thousands of $", "text": "clever saved thousands of $. Realtopia turned out very good.", "rating": 4}, {"title": "I have Experienced Clever Real Estate.", "text": "I have Experienced Clever Real Estate many times. They are really humble.", "rating": 4}, {"title": "Easy site to navigate", "text": "Easy site to navigate, and remembers your filters. Good pricing", "rating": 4}, {"title": "Clever put me in touch with a great…", "text": "Clever put me in touch with a great Real Estate agent.  Thanks Clever.", "rating": 4}, {"title": "Paige Prior", "text": "Paige Prior, our realtor was great. We would use Clever again.", "rating": 4}, {"title": "This was way better than I thought and…", "text": "This was way better than I thought and safe me money. Thanks", "rating": 4}, {"title": "i had a good experience with these 2…", "text": "i had a good experience with these 2 years ago.", "rating": 4}, {"title": "Home selling process", "text": "We had a good experience with this company. Thank you", "rating": 4}, {"title": "Saved me some money", "text": "Saved me some money. Agent was great to work with", "rating": 4}, {"title": "I am pleased with our realtor so far so…", "text": "I am pleased with our realtor so far so good.", "rating": 4}, {"title": "Great progress so far", "text": "Great progress so far. Awaiting closing.", "rating": 4}, {"title": "No problems", "text": "No problems, sold very quickly", "rating": 4}, {"title": "saved money using this service", "text": "Date of experience: October 29, 2019", "rating": 4}, {"title": "Tinker is great to work with", "text": "Date of experience: October 22, 2019", "rating": 4}, {"title": "Agent sent to us was great", "text": "Date of experience: July 01, 2020", "rating": 4}, {"title": "Great program", "text": "Great program. Recommend.", "rating": 4}, {"title": "Every thing was  smooth", "text": "Date of experience: July 30, 2019", "rating": 4}, {"title": "They were a big help", "text": "Date of experience: October 14, 2019", "rating": 4}, {"title": "Good referral", "text": "Good referrals", "rating": 4}]