[{"title": "Prompt but more care needed", "text": "Very prompt and helped knowing in advance when drivers would arrive. I would prefer a blanket on the sofa when laying on the dolly to keep stains off but I will check it when it returns from repair. The driver was very professional and courteous otherwise. ", "rating": 4}, {"title": "Amanda was very friendly and helpful", "text": "Amanda was very friendly and helpful through the process of finding what I needed and the check-out process.  I was looking for a mid-century modern sofa and found one in yellow, my favorite color.  Needed 2 and Home Zone had 2 in stock.  Amanda got the delivery set up and ready to go without any problems.  ", "rating": 4}, {"title": "Sales Associate Experience", "text": "Sales associate was friendly, helpful,informative, and knowledgable; yet let you look and shop at your own pace.  Didn’t follow you around the store.  Ended up making a purchase at the store. ", "rating": 4}, {"title": "Dornella was my sales person", "text": "Dornella was my sales person, she was very pleasant to work with, she seemed very knowledgeable about Home Zone Furniture and the many options to pay.She was very cordial, and attentive,She answered all of my questions, and explained in details ", "rating": 4}, {"title": "The service was very good but I don’t…", "text": "The service was very good but I don’t like that the clearance is not whitin the delivery service ", "rating": 4}, {"title": "Prompt with a small snafu", "text": "I liked that the replacement was delivered quickly. The delivery was early!I didn’t like that the delivery people didn’t reassemble the bed (I was told that was included) because they didn’t have an order to do that. This however was addressed immediately upon asking for clarification from customer service. They offered to send someone out to reassemble the bed. ", "rating": 4}, {"title": "Furniture ", "text": "I’m pleased with my furniture purchase and the delivery and setup was good, professional and courteous.", "rating": 4}, {"title": "Overall good experience ", "text": "Hassle-free and the process was easy. Quality furniture. Knowledgable team members. Good customer service. Only problem was being contacted before delivery. It is great that you can track the route however the time kept varying. I was told my delivery would be early and it ended up being at the scheduled time. May be best to call customer (not email) 20-30 mins before arrival.", "rating": 4}, {"title": "How nice everyone was.and even offered…", "text": "How nice everyone was.and even offered us refreshments.and helped us choose the right color.oh years the price was in our range ", "rating": 4}, {"title": "Impressed so far ", "text": "The store is set up beautifully and furniture looks like good quality and prices are good.I liked that there were some fabric options on several pieces, however it would be helpful if there were fabric samples to check out.", "rating": 4}, {"title": "I’m upset with the warranty but I guess…", "text": "I’m upset with the warranty but I guess not a lot you can do. Mattress is inly 2 years old and already has several .25 size dentions and they put more mattress pad under it.  I’m sure this continues til your warranty runs out the your out of luck ", "rating": 4}, {"title": "The customer service was great they…", "text": "The customer service was great they greeted you asked you what you had on your mind to purchase showed you a few things pointed you in the direction of other items and allowed you the time to browse in peace.", "rating": 4}, {"title": "Great prices", "text": "Great prices, clean store, helpful employees. I was told by the store manager, and one sales associate that I could have delivery the next day. But I waited and never received the delivery, then I received a notification that it would be three additional days before delivery.A quick follow up- I just received a call from the store manager who was very sorry about the delivery mix-up. He has made this right, and I appreciate his quick and generous response. I will definitely shop at Home Zone again.", "rating": 4}, {"title": "Employee Daniel was very helpful and…", "text": "Employee Daniel was very helpful and informative. Manager also. Very professional. Fair price for the product. The only thing I didn’t agree with, if I wanted to pick up the product I had to go to North Richland Hills. ", "rating": 4}, {"title": "Technician was fast ", "text": "Technician was respect, fast, and knowledgeable. We we quoted 2-4:30 pm and they were there at 1:50. I freaked out as I was on my way home but thankfully had a call from the company. I explained my time frame I was given and they told me no worries the tech would wait 10 min after 2 since that is the time I was quoted. I was thankfuly home in time and he was done in less then 10minutes! ", "rating": 4}, {"title": "Salespeople are great", "text": "Salespeople are great.  Good selection of furniture. Prices seemed to be below average.   Just screwed up the delivery date.  Items were scheduled for a Tuesday but did not make it until Saturday.  Was told that the salesperson did not confirm date with warehouse.  ", "rating": 4}, {"title": "Courteous staff: The floor staff were all genuinely nice…", "text": "The floor staff were all genuinely nice and welcoming. Our sales rep Alexander went above and beyond with courteous service, and all other associates he went to for any answers were courteous as well. ", "rating": 4}, {"title": "Great Service ", "text": "You have very friendly associates; however,  if you have a lot of customers - you will need to wait for about 10 minutes to get help!  ", "rating": 4}, {"title": "Our sales person Clayton was friendly…", "text": "Our sales person Clayton was friendly and knowledgeable.  He listened to what we we’re looking for and showed us great options.  He took his time to make sure we understood the furniture features, which were beyond our expectations.  Being Texans ourselves, made us so proud to purchase our bedroom furniture and awesome mattress!", "rating": 4}, {"title": "Don’t give up until you visit Home Zone. ", "text": "My friend and I were shopping for a sofa for our new house. We were greeted when we first arrived. We asked questions about another couch we saw and were not impressed with the limited options for making that specific model into sectional and minimal fabric options. The salesperson did show us other couches. We didn’t see anything we liked. We almost left until we saw another couch and enjoyed it. The salesperson worked with us through our fabric selection. The price was reasonable—plenty of fabric to choose from. We left the store feeling relieved to find a couch. We went shopping at five other major furniture/couch stores before Home Zone. ", "rating": 4}, {"title": "Manager was awesome", "text": "Manager was awesome, extremely helpful , New info on all the furniture we looked at. The biggest issue was after applying for the credit over 800 credit score more than 45 minutes for approval never once did the young lady say there was a problem with the computers being down just kept saying it just gonna be a few more minutesFrankly, after being there, two hours looking at furniture, finally deciding on some one of the items was not even available then having to wait for credit approval never been told that the computers were down, decided to leave  , and left the store Sadly disappointed", "rating": 4}, {"title": "True kindness and humility goes a long way", "text": "It was the salesmanship of Amado and how Courteous, professional and kind he was with us. He greet us at the door very politely and trust me we looked horrible from deep  cleaning the apartment. We just walked into to Home Zone to look not expecting to purchase an items. It was Amado personality and kindness also patiences that made us decide to become Home Zone Furniture customers. It was refreshing to have someone who understood what  customer service is truly about.", "rating": 4}, {"title": "Great with some small issues. ", "text": "After having my couches a little more than a month,the couches feel great and were delivered/assembled well. The wireless chargers are not consistent nor are they efficient in actually charging.", "rating": 4}, {"title": "The staff was friendly and greeted us…", "text": "The staff was friendly and greeted us upon entering the store. She wasn't to pushy or trying to push items off on us. She was willing to answer questions when we asked. The overall shopping experience was great and I would recommend this location to us. However, I feel like this location should keep furniture in stock instead of customers having to travel to another location to pick up furniture.", "rating": 4}, {"title": "Financing options are falsely…", "text": "Financing options are falsely advertised on furniture. While it was simple to set up, there should be no signs advertising “$24 a month” around the store. We will be paying close to $500 a month for our purchased pieces. While financing options are amazing to provide and were a great option for us, there should be no advertisements or signs anywhere suggesting customer will be paying extremely low monthly payments.", "rating": 4}, {"title": "The company is great the people who…", "text": "The company is great the people who work for the company are amazing including the delivery team. The only thing that kept me from a 5 star is that the colors of the items online of the furniture can be vastly different from the actual color of the item . I ordered online because I have a badly torn Meniscus and a fractured tibia so I can’t walk for long periods right now and have to rest my leg . The color of the colors of the club Artimis chairs appears online to be a periwinkle blue and a pink Coral color . When in actuality they are a darker almost Sapphire, blue and a rust orange . They are still great quality my favorite style because of the velvet and tufted features. I probably wouldn’t have gotten them based on colors but I will purchase a slip cover for the Rust one . I would highly recommend them as a company still and would purchase Again in the future because of the quality of the furniture and the people that work for the home zone. My only critique would be to update the way your furniture appears online because it’s definitely not true to color.", "rating": 4}, {"title": "Always friendly professional…", "text": "Always friendly professional knowledgeable people. Don’t push or suggest which items you need to go with what you are buying, but happy to answer questions honestly and quickly. It has become my go to store for furniture and accessories.", "rating": 4}, {"title": "Lake Worth ", "text": "Went to the Lake Worth store.  We were there looking around for 45 minutes without any help.  The employees were talking to other each other and never asked if we needed assistance like they did other customers who came in after us.  We were able to shop online while we were there, however.  Great product.  Just poor service.  Bought a large sectional and a dining room table with chairs.  Update: Got a call from Randy (a manger). Appreciate that he reached out.  Changed my rating due to that. Thanks you!  ", "rating": 4}, {"title": "Overall Happy With Purchase ", "text": "I have been happy with all the furniture I have purchased at Home Zone. All the staff have been fantastic. I would have given a five star review, but book case has odor from glue or varnish that still is taking a lot of airing out. The cabinet itself is wonderful and has a lot of storage space. I will actually use it for dishes in my kitchen when smell goes away. ", "rating": 4}, {"title": "The sales experience with Clayton was…", "text": "The sales experience with Clayton was great.  The delivery person Colton was very professional. The follow up to send a tech for some issues is appreciated ", "rating": 4}, {"title": "Good BUT....", "text": "Everything was good except for the fact that you literally have to clear your whole entire day for your delivery. I took a day off work to ensure that I'd be home to get my items and even still it came hours after the time frame. I understand things happen, but there has got to be a better process for deliveries. The delivery guys were awesome and very quick and so polite, shout out to them!!!", "rating": 4}, {"title": "Kat !", "text": "Kat was very helpful in showing us the different couches we were interested in. She did not pressure us into anything and was available to answer our questions. She also allowed us to roam the store at our own pace.", "rating": 4}, {"title": "When the furniture was delivered I…", "text": "When the furniture was delivered I noticed and pointed out a small flaw in the finish on the table top. The delivery guy wrote it into the delivery report and took pictures. He told me that a HZ technician would be contacting me to arrange a visit to address the issue. I have not heard from anyone. I am otherwise very pleased with my purchase.", "rating": 4}, {"title": "More info on the furniture would have been nicer!", "text": "There was no pressure from salespeople although they didn’t really explain the sofas or the materials. One finally explained the materials when asked which I feel it’s info the salesperson should make available to the customer. We figured it out on our own!", "rating": 4}, {"title": "Purchase & delivery was great", "text": "Purchase & delivery was great, would love to give 5 stars but after only a few days, we have an issue with the sofa and have not heard back from anyone. ", "rating": 4}, {"title": "Sandy was great", "text": "Sandy was great. Website and computers in store not so much. Came back a second day because no one could tell me how to add a warranty online. Two of the computers were down so the lady helping me had to run around while another customer was waiting behind me and sandy was with someone else. Naturally she was stressed. Very nice and helpful i just know how frustrating it is when things don’t work in front of customers.", "rating": 4}, {"title": "I wasn't able to use my credit card…", "text": "I wasn't able to use my credit card stored on my phone due to company policy.08/19: Got a call from the VP to discuss the situation and misunderstanding. As a courtesy he offered us a dinner gift card. We went into the store today and were provided the comp. Upgrading from 2 stars to 4 for follow up customer service.", "rating": 4}, {"title": "The website was user friendly and my…", "text": "The website was user friendly and my furniture looked exactly like what I ordered. The delivery guys could use some training in customer service. That’s the only reason I didn’t rate 5 stars.", "rating": 4}, {"title": "Both Denton and Richardson stores were…", "text": "Both Denton and Richardson stores were very helpful when I called. The sales person at the Denton store assisted me with everything I needed and emailed the Richardson store, making things more convenient for me so we would not have to make 2 trips to Richardson! Nick called and updated me on the time the item I needed would be delivered! Thank you for all the assistance even though my warranty had expired everyone was still very knowledgeable and helpful!", "rating": 4}, {"title": "Great service in store and delivery…", "text": "Great service in store and delivery love the fur4", "rating": 4}, {"title": "Service great-some company policys flawed", "text": "Staff is great.  Went out of their way to provide responsive service.  Company policy would not allow them to deliver one item and they offered to personally drive it to my house.Company Policy is MISGUIDED.  I tried twice to purchase a rug and take it while in the store.  Policy required it be delivered.  I ordered other merchandise for delivery and then was later told had to pick up rug!", "rating": 4}, {"title": "Helpful and not pushy", "text": "Aaron was incredibly helpful. The only thing we wish we'd known ahead of time was that a purchase couldn't be picked up at the store we were at and not the same day. We showed up to buy and bring home (already a 30 min drive for us), and now we have to drive even further tomorrow to go do the actual pickup.", "rating": 4}, {"title": "12 hours turned 17…", "text": "**UPDATE #2 - Just got home and unloaded, only received 1 of the three POWER packs needed for the furniture to work. 🫠 Will be calling in a few hours once the store opens to get them to mail them to us** **UPDATE - It took us 5.5 hours to get our furniture after being on site, however the regional manager did call and express this was not standard practice and it was not acceptable and is sending us a bonus battery pack to make up for our inconvenience. While our 12 hour trip turned into a 17 hour day… we are excited to get our section back home and into our new construction! ** Still sitting at the pickup location waiting for pickup after driving from Arkansas. Need firm appointment times for pickup. Is 100 degrees and we’ve been sitting in the truck for over 3 hours with no pickup time in sight.", "rating": 4}, {"title": "Found just what we were looking for right away.", "text": "The experience was great!  Would have a 5 star if both of the pieces we wanted to purchase had been in stock.  Waiting is not ideal but we love the sofa and loveseat we purchased so worth the wait.  The salesperson, Andrea Mendoza was wonderful to work with.  No pressure, just as the ads say, but knowledgeable and very helpful.", "rating": 4}, {"title": "Staff was attentive and well informed…", "text": "Staff was attentive and well informed on products. Store was well layed out. I do wish there were more fabric options for sofas. Everything that would be great for families was only available in light white, cream or beige tones. Not great for kids and dogs.", "rating": 4}, {"title": "Good service", "text": "Nothing I can write, very good services.", "rating": 4}, {"title": "Oversized Mattress Covers", "text": "Marcus was very professional and personable.  I didn't feel pressured.  Ni one followed me around.  I was comfortable with leisurely walking around shopping accessories.  Marcus assisted with my purchase of four bedding sets and ensured they had \"oversized\" sets to fit my mattresses.", "rating": 4}, {"title": "Went in for Black Friday deals not organized …", "text": "Went in for Black Friday deals not very organized for picking up the vouchers for the special items.Was given the wrong voucher and by the time I wanted to change it the color I wanted was gone even though I was one of the first people in.  Also vouchers was given out before the store was opened and did t realize it.", "rating": 4}, {"title": "My only complaint is I got a quote from…", "text": "My only complaint is I got a quote from three different people for the same set and they were all different. I looked at purchasing the furniture individually and it was cheaper than the quotes. I added tax and delivery into it as well. ", "rating": 4}, {"title": "I purchased a queen bed adjustable…", "text": "I purchased a queen bed adjustable frame. It is working fine. I was disappointed that if I had paid extra for delivery, they wouldn't have remove the old frame for disposal. I would have paid extra for that option as I didn't want to have to mess with the disposal myself.I understand that with todays work force, you are limited with your employees appearances at your work place. I just don't like to interact with a young person (female) who is covered in tattoos and facial piercing's or a young male who had painted fingernails, both with no knowledge of the item that I was interested in purchasing. I would suggest better training for your employees so they can better assist your customers with their purchases. When I'm willing to spend over $900 for one of your products, I want to speak with someone who knows more about the item than I do, which wasn't the case with my purchase. ", "rating": 4}, {"title": "I like all the helpful people at the…", "text": "I like all the helpful people at the store. I love our bedroom set. We had a bit of a problem with the mattress we bought. Should of been advise that with the set we bought a recommendation of a box spring would have been helpful. We finally got the box spring and made this so much better sleep.Thanks again and plan to continue to buy from Home Zone", "rating": 4}, {"title": "Courteous", "text": "Courteous - however would have had 5 stars if she had asked if she knew how to install the battery.", "rating": 4}, {"title": "Was informed that once set up with…", "text": "Was informed that once set up with kaolafi that could change from 24 months to 12 months now informed that I cannotWas very disappointed  😞  Spoke with sales rept Gilbert clarify nothing yet", "rating": 4}, {"title": "Quality products for a reasonable price", "text": "I went in just looking for a few pieces of furniture and maybe an idea or two. I walked out with a renewed life in my bedroom suite while starting on a collection for my son all by taking a look at what they had to offer in store.", "rating": 4}, {"title": "New sofa and love seat.", "text": "We have been looking for a new sofa and love seat for several years. Jacob, the salesperson answered all of our questions and made our purchase a pleasurable experience. ", "rating": 4}, {"title": "Home Grown", "text": "Loved the selection the made in America nice to shop without someone following every move but close to answer all questions", "rating": 4}, {"title": "Fun shopping", "text": "Large display of furniture, better choices and most of all, I appreciate their no pressure approach to sales.", "rating": 4}, {"title": "Very helpful in choosing my new sofa", "text": "Very helpful in choosing my new sofaHowever not too happy about having to pay an extra $100 to deliver it should be a service of the store to deliver or at least lower the cost", "rating": 4}, {"title": "damaged dresser", "text": "I appreciated the constant notifications about where and when delivery was. The guys were very polite and efficient.  The only thing I was dissapointed with and not checking the dresser before loading that it was damaged to get another one.  Taking days off is already hard to make arrangement and to have to do it again for the dresser is an inconvenience. I did not see it in person but appreciated that the driver showed me the picture. To avoid having to wait I should have asked for a discount to just leave it. Now I have to lose money again for taking off.  Other than this, the experience of buying with you was good.", "rating": 4}, {"title": "We like the furniture", "text": "We like the furniture, but there was one issue. There was a chair that went to the set we wanted. The sales person said that it was not available in the color we wanted. After we went home that day, my wife found the chair on your website and ordered it. Was the sales person incompetent?  Is the in store system unreliable?", "rating": 4}, {"title": "Home Zone is the place to buy recliners", "text": "Customer service  is good, sales person made us feel relaxed and not pressured to buy.  The atmosphere of the store is very conducive to buy furniture.  The prices are very compatible on most items.", "rating": 4}, {"title": "Furniture Repair", "text": "Repair service order/claim was taken, reviewed and approved timely.  Appointment went as scheduled.Individuals didn't have the addendum to my order whi was pd for in advance. Matter was rectified before they left my home.", "rating": 4}, {"title": "Thanks Vernon!", "text": "I thank Vernon for his exceptional customer service.  Although the dining room set I wanted wasn’t available, he helped me find one that was better.", "rating": 4}, {"title": "I went to the Lake Worth store first…", "text": "I went to the Lake Worth store first and they just were so uninterested in helping. So we left and went to the N Richland Hills store. Although my furniture will not be in for a few weeks at least they took time out to explain everything and talk with us.  ", "rating": 4}, {"title": "Sales person listened and took me…", "text": "Sales person listened and took me straight to the perfect chair & I bought it Saturday late afternoon.     Only problem is I preferred to take with and that was not possible.   Will have to return on Monday late afternoon.", "rating": 4}, {"title": "Best furniture buying experience in the area", "text": "No sales pressure or person following you around is nice. Good selection and good prices. Checkout could be a bit faster, but not bad. Wish delivery was a bit quicker", "rating": 4}, {"title": "The internet is slow so it takes…", "text": "The internet is slow so it takes forever to finish the application for credit , the employees would help but they would leave and we would have to go get them to ask questions ", "rating": 4}, {"title": " friendly staff, BUT…", "text": "the sales team were friendly and open about the store and their positions, BUT they were not open or sure about the products. we purchased a love seat, reclinder and a dining set.", "rating": 4}, {"title": "It would be nice to have more people on…", "text": "It would be nice to have more people on the floor that can assist with sales for a better experience in buying our furniture.", "rating": 4}, {"title": "I enjoyed the guy who helped us", "text": "I enjoyed the guy who helped us. James Williams the only thing I wanted a mattress that was like the floor model I was told it was in stock when they brought it out it was white instead of grey. I was told it was the same one but different color. I should have been told before I purchased it.", "rating": 4}, {"title": "It was a pleasant experience", "text": "It was a pleasant experience. I was allowed to browse freely and reps were available when needed. The purchase process went smoothly. ", "rating": 4}, {"title": "Wonderful", "text": "Wonderful, fun experience.  They have alot of rules that I got tired of listening to and delivery details were a pain and way too confusing.  Overall, the experience was positive and the staff helpful and friendly.", "rating": 4}, {"title": "Timely delivery", "text": "Timely delivery. Efficient customer service. You need to check on your transportation charges.otherwise everything else is awesome about home zone. I wouldn't hesitate referring my friends there", "rating": 4}, {"title": "Classy yet affordable furnitures.", "text": "They have all kinds of classy furnitures. I recommended to those who are planning to make thier house and office looks classy, visit this store.", "rating": 4}, {"title": "My in store experience was Excellent!!", "text": "My in store experience was Excellent!!I really appreciated the constant updates from Kelly on my Delivery!!  This was most helpful.I gave 4 Stars because I was a little disappointed in the interaction of the delivery personnel.  It could have been better.", "rating": 4}, {"title": "The people was so helpful and…", "text": "The people was so helpful and understanding my needs I wood have gave a 5 star but the parts was not in stock so I was not happy with the 3 months wait time", "rating": 4}, {"title": "Denton Homezone", "text": "Had great experience shopping at the Denton location. Very pleased with the attentive and detailed customer service delivered by the entire team at the Denton Homezone store. ", "rating": 4}, {"title": "Great Experience!", "text": "The sales associate and her manager went out of their way to find what we needed. Though not in stock at the store is was ordered and delivered within a week on time and as promised", "rating": 4}, {"title": "Customer Service", "text": "It was so nice to be able to browse without having salespeople hovering over me the whole time. If I needed info they would come and answer and then back off again. I did end up purchasing new furniture.", "rating": 4}, {"title": "Self pick up", "text": "We picked up the item ourselves instead of paying $150 to have it delivered. The warehouse is on Campbell. Not a smooth pick up. Check in at the front of the store then drive to the back of the building.  We waited a little while before someone opened the warehouse door on the back side of the building. It’s made for tall delivery trucks so the piece had to be dropped down a few feet to be able to put it into the back of our SUV. The warehouse employee was very helpful with this and had string to fasten down the back hatch.", "rating": 4}, {"title": "Bell our sales person", "text": "Bell our sales person!  She made everything go so smooth.  Bought it Monday and sitting in it Thursday.  Bell helped us find a nonprofit organization to pick our old furniture.", "rating": 4}, {"title": "Very good staff", "text": "Very good staff. Not pushy; yet engaging and helpful. The only problem I had was multiple items being out of stock; when it said it was in stock.", "rating": 4}, {"title": "Good selection of furniture", "text": "Good selection of furniture. Sales force was very helpful, but not overbearing. Allowed us to look the store over, and answered questions like a great team.", "rating": 4}, {"title": "Excellent customer service", "text": "The gentleman that helped us was friendly and informative. He answered all of our questions and showed us different options.", "rating": 4}, {"title": "She was excellent… to work with our…", "text": "She was excellent… to work with our transaction went very smoothly ", "rating": 4}, {"title": "Not happy at all with the 109.00…", "text": "Not happy at all with the 109.00 delivery fee. I could have gotten free delivery and put together free from Nebraska furniture mart.", "rating": 4}, {"title": "The salesman was very helpful", "text": "The salesman was very helpful The delivery drivers were very nice and efficient.The only bad thing I have to say is after they set up the bed they left plastic in the bedroom and in the front yard & driveway.", "rating": 4}, {"title": "Good", "text": "Don’t like sales people to hover after they have been told you are just looking.  They did nit,  we were left alone other than offering us water,  which I. This heat was nice.", "rating": 4}, {"title": "I was met by someone as soon as I came…", "text": "I was met by someone as soon as I came in which was a good thing.  I didn't have to search for someone to help.  The furniture I wanted to look at was still on the website.  But I was told that that furniture had been discontinued and they no longer had it.  It was disappointing to hear.  Please take it off the website if it is no longer available.", "rating": 4}, {"title": "Everything OK until purchase", "text": "Everything went fine up until I had to drive all the way back to store to make an online purchase.  Store personnel were very helpful.", "rating": 4}, {"title": "Happy but confused", "text": "The thing that made this experience great were the people who worked there . Very helpful, very friendly and professional. I would go back for the quality of your products and styles. It’s the process of purchasing and picking up products. The product I bought was almost the same price of the delivery fee. Which made it impossible to have it delivered. Then to pick it up , I had to schedule a date and drive to another city to pick it up. I live in Grand Prairie and had the choice of going to north Richland hills or to Richardson. The item was not that large , so it seemed weird that they did not have them in stock at the store I purchased it from. I had to plan a day and a route to get what I had already purchased. This will keep me from coming back to any home zone , because of all the different things I had to do to get your product home . Again, everyone I dealt with were great and professional, it was the process and procedures I had to go through.", "rating": 4}, {"title": "Good Shopping", "text": "In store was great, no hassle and help when needed.Delivery was good but rushed.  No paper work on power reclining sofa.  sofa seems 2\" taller than store display.", "rating": 4}, {"title": "The couch is amazing & comfortable", "text": "The couch is amazing & comfortable The delivery was smooth & quick The only downfall is the couch smells which will probably take a little while to go away & I’m not sure why it smells", "rating": 4}, {"title": "The store had all of the items on their sales ad…", "text": "The store had all of the items on their sales add available. The employees were friendly and helpful. The store is clean and nicely arranged. My only issue is the super strong smell of fragrance. Bring a mask!", "rating": 4}, {"title": "The help from the inside of store to…", "text": "The help from the inside of store to the delivery was an good experience. I would recommend them to anyone. Great job guys and gals...", "rating": 4}, {"title": "Our salesman Aaron was the best", "text": "Our salesman Aaron was the best. Didn't hover over us, but available to answer our questions", "rating": 4}, {"title": "Manager was polite", "text": "Manager was polite. He greeted us, offered something to drink, and was polite even though we are brown Muslims.", "rating": 4}, {"title": "Anthony and Sarah were very helpful…", "text": "Anthony and Sarah were very helpful during my visit made the experience great!! Thanks HZF team!", "rating": 4}, {"title": "The workers  Greets you as you walk in", "text": "The workers  Greets you as you walk in. The workers doesn't hoover over you, let you know  their name's and they're there if you have any questions or ready to make a purchase.", "rating": 4}, {"title": "Some sales staff are uninformed of delivery policies ", "text": "One salesman said it would cost 💲 120 for delivery.  Second guy said for a rug it was free.  All personnel should know all policies.", "rating": 4}, {"title": "You have the product we were looking…", "text": "You have the product we were looking for at a good price. Delivery was offered and not outrageous. would have liked not to have to wait 2 weeks but was told you only deliver Once a week ", "rating": 4}, {"title": "First time visiting", "text": "First time visiting. Polite, non pushy salespeople. Tried to purchase a bedroom set but not everything was in stock in the color I needed.", "rating": 4}, {"title": "Good other than having to go to a…", "text": "Good other than having to go to a different store to pick up, 25 miles away", "rating": 4}, {"title": "I was helped by a team member named Nini. …", "text": "I was helped by a team member named Nini. She was very patient and helpful. Most of all professional. ", "rating": 4}, {"title": "The store is nice and kept well", "text": "The store is nice and kept well. Issue is you can't pick up from this location. I had to drive 30min to pick up or they charge you $100.00 plus delivery.  This was on two dining chairs. ", "rating": 4}, {"title": "Doc was the man that helped me and he…", "text": "Doc was the man that helped me and he was not pushy and that allowed me to look around and then I could answer questions", "rating": 4}, {"title": "Great customer service", "text": "Great customer service!  We didn't feel like we were being pushed into buying anything ", "rating": 4}, {"title": "Salesman was very nice", "text": "Salesman was very nice, he did not tell me I had to assemble the furniture myself.  Other than that, everything went well.  Thank you.", "rating": 4}, {"title": "Love the furniture", "text": "Love the furniture! Sales people were wonderful and so helpful! The chase did arrive with a stain but we are trying to get that taken care of.", "rating": 4}, {"title": "Smooth transaction", "text": "Smooth transaction. Walked in, we were greeted, and left alone to browse the furniture. Made our choices and bought our furniture. We will be back again. ", "rating": 4}, {"title": "Staff is friendly but did not pressure…", "text": "Staff is friendly but did not pressure us. Allowed us to take our time and decide on the items we liked and wanted to purchase.", "rating": 4}, {"title": "The representative was personable", "text": "The representative was personable. She was meticulous in detail except sharing the price of the stain warranty. I might have purchased it if it was reasonably priced. I automatically decline warranties because of previous experience of unsuccessfully attempting to utilize them. ", "rating": 4}, {"title": "Good selection", "text": "Good selection, good prices, did have to wait most of day to pick up", "rating": 4}, {"title": "Excellent customer service!", "text": "Excellent customer service!! They helped me find the right stuff for my new home.", "rating": 4}, {"title": "Honestly everything was fantastic", "text": "Honestly everything was fantastic, customer assistance, communication and everything. Only think I would recommend is informing customers of delivery fees. All the times I went in, I was never informed on delivery fees. Otherwise it was a great experience", "rating": 4}, {"title": "The Sales clerk was very patient with…", "text": "The Sales clerk was very patient with my husbands barrage of questions. The couch i chose was very good quality and in stock.", "rating": 4}, {"title": "The sales rep was excellent", "text": "The sales rep was excellent. I knew what I wanted & she took me right to the area so I could make a choice.  Prices were decent.  I don't like wasting time & this was wasn't.", "rating": 4}, {"title": "Great design", "text": "Great design, but it arrived later than promised", "rating": 4}, {"title": "Thumbs up.", "text": "Quality furniture, great sales person in Davonte, fair price.  ", "rating": 4}, {"title": "No pressure  very polite sale person", "text": "No pressure  very polite sale person ", "rating": 4}, {"title": "Well came for recliner that lifts up…", "text": "Well came for recliner that lifts up and down. Thats what i needed buy guy said they stop them coming last year or so", "rating": 4}, {"title": "Price was very reasonable", "text": "Price was very reasonable.  Delivery was fast and done well.", "rating": 4}, {"title": "Missing adjustable foot", "text": "One of the chairs is missing the adjustable foot. Please ship one. ", "rating": 4}, {"title": "It was a Pleasure shopping at Home Zone", "text": "Home Zone Furniture impresses with its extensive selection of stylish and affordable furniture, catering to various tastes and preferences. The store's commitment to quality is evident in the durability and design of their pieces, making it a go-to destination for home furnishings. With attentive customer service and a welcoming atmosphere, Home Zone Furniture ensures a satisfying shopping experience for homeowners.", "rating": 4}, {"title": "No hounding from sales people", "text": "No hounding from sales people. Was there to answer questions.  Great place to buy furniture", "rating": 4}, {"title": "Very good", "text": "Guys who came to deliver were very nice and completed their job on time.", "rating": 4}, {"title": "Theo was amazing", "text": "Theo was amazing! Very knowledgeable and helpful through the process.", "rating": 4}, {"title": "Why should the purchaser get punished for not receiving what they paid for????", "text": "After buying a couch sofa sleeper where the sleeper was non-functional straight out of the box, we were reasonably upset. After contacting customer service, we were informed that because we did not purchase the warranty for the couch, we would be responsible to pay fo $109 for the exchange to receive a new one, we were out raged that when purchasing what should've been a functional item to find that it wasn't functional... only to be told that even though we opted to save money and pick it up ourselves, we were gonna have to pay the same price to have had it delivered to our house anyway??? That was absolutely ridiculous. If any customer ever buys a product and that product was non-functional from the very start, I'm sorry but NO CUSTOMER should EVER have to pay extra to get what they should've received the first time. All this to say, after we expressed our displeasure with this option, Lisa Williams took it on herself to reach out to the store manager and attempt to get approval to waive the $109 this single instance for the replacement delivery, which was approved. We are thankful to her for going out of her way to help us get what we paid for to start with.The only thing I would say is when presenting the options, at least include reaching out the the store manager for this as an option or make some sort of policy to ensure people who buy your products actually get what they paid for in the initial purchase, without an additional charge just to get it fixed. After the purchase sure, customer is responsible without a warranty... but at least give the customer the opportunity to enjoy your products the way they paid for them to be right out of the box. We love the couch, and Lisa was excellent. We are just upset that the couch arrived not functioning the way correctly, and that we were prompted to pay for an additional discounted delivery fee of $69 to get a replacement for what arrived already non-functioning BEFORE we were informed of the potential one-time waived fee from the store managerI am writing this review before the replacement has arrived, so the quality of the replacement is yet to be determined.", "rating": 4}, {"title": "Great Experience", "text": "Shay was professional, knowledgeable and helpful. I recommend shopping here and plan to return in the future.", "rating": 4}, {"title": "Everything was great other than the…", "text": "Everything was great other than the scheduling of delivery", "rating": 4}, {"title": "good variety", "text": "good variety, great prices, good quality furniture, great salespeople (rocky).", "rating": 4}, {"title": "Furniture was delivered today men were…", "text": "Furniture was delivered today men were nice . Kind of put furniture where they wanted it . Looked real nice in home", "rating": 4}, {"title": "I recently bought couches", "text": "I recently bought couches. They are of good quality and the price was reasonable", "rating": 4}, {"title": "I requested to re-schedule the delivery…", "text": "I requested to re-schedule the delivery date without a $25 fee after several attempts from phone calls to the store…  which was 1 day prior, I was able to talk to the delivery department and Erin (a guy) might not be spell correctly but he was extremely polite and helpful, I  was able to choose another date and made me a happy customer and didn’t charge me $25!!!!", "rating": 4}, {"title": "It was black Friday I thought they…", "text": "It was black Friday I thought they handled it well maybe more registers next time", "rating": 4}, {"title": "Great experience ", "text": "Sales person was great, addressed all my questions.", "rating": 4}, {"title": "The delivery guys failed to clean up…", "text": "The delivery guys failed to clean up after they finished.They did a great job but left a mess.", "rating": 4}, {"title": "Good customer service from sells…", "text": "Good customer service from sells person. Explained everything until everything was understood", "rating": 4}, {"title": "Thankful", "text": "Ms. Dornella was very friendly and patient. I’m enjoying my new king bed!Thank you!!!", "rating": 4}, {"title": "Customer service is amazing", "text": "Customer service is amazing, the products a little less.", "rating": 4}, {"title": "The only thing I’m concerned about is…", "text": "The only thing I’m concerned about is how it’s hard to open the recliner.", "rating": 4}, {"title": "The items that we really wanted weren’t…", "text": "The items that we really wanted weren’t in stock and would take a lot of time to get in.", "rating": 4}, {"title": "Bed and dining delivery and assembly", "text": "Status of order and delivery details were well communicated Delivery was as committed Package was assembled and job done professionally", "rating": 4}, {"title": "So sweet color and beautiful Wark nice…", "text": "So sweet color and beautiful Wark nice job and great experience", "rating": 4}, {"title": "Everyone was helful with all my…", "text": "Everyone was helful with all my question.", "rating": 4}, {"title": "9 week wait to get table lamps", "text": "9 week wait to get table lamps.   Then gave us ones off the floorBut the management helped make thing right", "rating": 4}, {"title": "Their furniture is quality", "text": "Their furniture is quality ", "rating": 4}, {"title": "Sofas are nice and good quality", "text": "Sofas are nice and good quality. I have some stains on stair walls by the handlers.", "rating": 4}, {"title": "You guys are awesome with a speedy…", "text": "You guys are awesome with a speedy response.", "rating": 4}, {"title": "people", "text": "Great price and nice people, but come in a box to put together.", "rating": 4}, {"title": "Choose the best quality to beautify…", "text": "Choose the best quality to beautify your home.", "rating": 4}, {"title": "They  were very  helpful  we got what…", "text": "They  were very  helpful  we got what were we looking for  and than  some.", "rating": 4}, {"title": "Found exactly what I wanted", "text": "Found exactly what I wanted. Everyone was friendly and helpful.", "rating": 4}, {"title": "No pressure", "text": "No pressure.  Allowed to browse until we found something interesting.", "rating": 4}, {"title": "The team was patient while we got…", "text": "The team was patient while we got information together with the finance company before completing our purchase.", "rating": 4}, {"title": "I knew what I wanted pretty much when I…", "text": "I knew what I wanted pretty much when I came in so it was a pretty easy process.", "rating": 4}, {"title": "I felt like they did fine", "text": "I felt like they did fine. We did find one small blemish on our furniture. ", "rating": 4}, {"title": "Employees are not friendly", "text": "Employees are not friendly ", "rating": 4}, {"title": "Jackie", "text": "Jackie Was a sweetheart very nice very helpful .", "rating": 4}, {"title": "Very helpful and understand the clients…", "text": "Very helpful and understand the clients needs.", "rating": 4}, {"title": "Customer service was very good and…", "text": "Customer service was very good and helpful enjoyed the visit", "rating": 4}, {"title": "Plenty of quality furniture--pleasant…", "text": "Plenty of quality furniture--pleasant sales persons.  Decently prcied furniture!", "rating": 4}, {"title": "Fast service ", "text": "Got what I needed quickly. Was in and out and loaded up within 30 minutes or less.", "rating": 4}, {"title": "Awesome sales rep with great customer service ", "text": "Awesome sales rep with great experience professionalism and attitude. Recommend Dornella to anyone and I will. ", "rating": 4}, {"title": "Indeed", "text": "Indeed, you have your customer’s satisfaction at heart", "rating": 4}, {"title": "Low pressure from staff", "text": "Low pressure from staff. Showed us what we wanted to see and then let us alone", "rating": 4}, {"title": "Salesman was very nice and…", "text": "Salesman was very nice and knowledgable. All items were in stock", "rating": 4}, {"title": "They were fast and ensemble the…", "text": "They were fast and ensemble the furniture!", "rating": 4}, {"title": "Good service", "text": "I was greeted and assisted and felt very special", "rating": 4}, {"title": "Pet bed", "text": "Good experience but had to order to another store.", "rating": 4}, {"title": "Liked the type of furniture", "text": "Liked the type of furniture ", "rating": 4}, {"title": "Tristan was very helpful and nice", "text": "Date of experience: August 26, 2024", "rating": 4}, {"title": "No pressure", "text": "No pressure , willingness to help answer questions", "rating": 4}, {"title": "this was a great experience!", "text": "Date of experience: October 18, 2023", "rating": 4}, {"title": "you offer variety of stylish and…", "text": "you offer variety of stylish and classical furniture at affordable furniture", "rating": 4}, {"title": "Product life time is high and good…", "text": "Product life time is high and good quality of product.", "rating": 4}, {"title": "Joshua was great!!!", "text": "Joshua was great!  Very professional throughout our interaction.", "rating": 4}, {"title": "This home zone furniture is very uniqe", "text": "Date of experience: July 21, 2022", "rating": 4}, {"title": "The staff was very polite n friendly", "text": "Date of experience: November 25, 2023", "rating": 4}, {"title": "Great prices on furniture.", "text": "Date of experience: November 25, 2023", "rating": 4}, {"title": "Pat was a pleasure to work with", "text": "Date of experience: January 15, 2024", "rating": 4}, {"title": "Great communication the entire process", "text": "Great communication the entire process.  Friendly and informative staff!", "rating": 4}, {"title": "Customer service was friendly", "text": "Date of experience: January 12, 2024", "rating": 4}, {"title": "Easy", "text": "They had what I was looking for", "rating": 4}, {"title": "Pat was very patient!", "text": "Date of experience: October 08, 2023", "rating": 4}, {"title": "Nice and helpful people", "text": "Date of experience: September 04, 2023", "rating": 4}, {"title": "Thank you amazing customer services ❤️", "text": "Date of experience: November 05, 2023", "rating": 4}, {"title": "The saleswoman was amazing", "text": "Date of experience: December 28, 2023", "rating": 4}, {"title": "best and reliable furniture", "text": "Date of experience: January 02, 2023", "rating": 4}, {"title": "Good app I like it", "text": "Good app I like it ", "rating": 4}, {"title": "Had a good experience", "text": "Had a good experience.", "rating": 4}, {"title": "Kind & courteous", "text": "When they did everything they could to solve it", "rating": 4}, {"title": "Experience at Home Zone", "text": "Great customer service and friendly establishment", "rating": 4}, {"title": "Home zone", "text": "I like home zone", "rating": 4}, {"title": "Great work", "text": "They got back to me fast", "rating": 4}, {"title": "Rocky was knowledgeable and…", "text": "Rocky was knowledgeable and professional.", "rating": 4}, {"title": "Very good experience", "text": "Very good experience ", "rating": 4}, {"title": "Satisfying quality furniture", "text": "Satisfying quality furniture ", "rating": 4}, {"title": "Great prices", "text": "Date of experience: May 26, 2024", "rating": 4}, {"title": "Good communication ", "text": "Date of experience: February 25, 2024", "rating": 4}, {"title": "The sales rep was very helpful", "text": "The sales rep was very helpful, knowledgeable and patient with us as we were indecisive on our bedroom set. I loved that they let you shop alone and not hassle you, you can request help when you you’re ready.", "rating": 4}, {"title": "The salesperson", "text": "The salesperson, Samantha, was very knowledgeable and friendly. She obviously knew her job and preformed it very well.", "rating": 4}, {"title": "Friendly sales associates", "text": "Friendly sales associates. Courteous to let me shop, rather than attempting to push me into buying something I really wouldn't want. Initial contact had to go to lunch, handed me off to another sales associate. Initial sales associate asked questions that I did not consider and made suggestions as well.", "rating": 4}, {"title": "Good customer", "text": "Date of experience: July 04, 2023", "rating": 4}, {"title": "So far so good.", "text": "Does not quite fill the same as it did in store or first few days of use.", "rating": 4}, {"title": "The conversation and the service was…", "text": "The conversation and the service was open and honest.", "rating": 4}, {"title": "Mattress purchase", "text": "Mattress delivery was on time.Salesman was knowledgeable", "rating": 4}, {"title": "Satisfying Service", "text": "Salespeople were very helpful and friendly.  Salesperson quickly answered questions about furniture pieces without pressure to sale.  They are knowledgeable about furniture materials.  Sales team made shopping experience enjoyable!", "rating": 4}, {"title": "Mismatched cushions", "text": "The pick up and delivery went great. Except they only wanted half the sectional, the piece that was broken. Seemed fine at pickup. Except when it was delivered, they over stuffed the seat cussions, sounds great right. Except now it looks awful all put together, bc it doesn’t match. Half is over stuffed and half is not. So I’m my opinion, all of the sectional should have been taken so it could all be fixed in proportion.", "rating": 4}, {"title": "Customer service sales lady was…", "text": "Customer service sales lady was professional and friendly I returned to the store due to my past experience bought my bedroom furniture few years ago.", "rating": 4}, {"title": "Great place to shop.", "text": "The warm reception we got as my daughter and I entered the store. Alexjundra was so helpful and informative with all our questions. She made my purchase very easy.", "rating": 4}, {"title": "Communication was very good and…", "text": "Communication was very good and helpful!  Delivery was fine but my delivery driver wasn’t very informative.  The blankets that the couches were wrapped in left a little orange dust in areas as I’m looking over things he wasn’t interested in making sure I was happy with the delivery just needed me to sign my name so he could go… it’s minor I guess that’s why I gave 4 stars.  Over I’m happy with the products the team in the store was helpful and now I’m ready to look at the matching chair for my couches!", "rating": 4}, {"title": "Great selection and pricing", "text": "Great selection and pricing. One recliner had to be replaced.Staff very helpful in getting exchange set up.", "rating": 4}, {"title": "We had a very pleasant experience with…", "text": "We had a very pleasant experience with Home Zone from purchase through delivery. My love seat has a small defect I noticed after delivery that I can report next business day", "rating": 4}, {"title": "Great employees.  Very friendly and helpful.   Pricing breakdown is a little confusing", "text": "I haven't received my purchase yet, but so far so good.", "rating": 4}, {"title": "Very helpful", "text": "Date of experience: May 28, 2023", "rating": 4}, {"title": "I like that you can browse around until…", "text": "I like that you can browse around until you are ready to talk about the furniture you like to buy.", "rating": 4}, {"title": "Friendly, helpful associates and great prices", "text": "Friendly, nonaggressive sales crew and great prices made this a good experience searching for (and finding) a great new sectional and recliner for my living room. My husband and I always have a hard time finding something we both like and Aisa, the woman who helped us, was very good at steering us towards the choice that made us both happy.", "rating": 4}, {"title": "Customer service was great", "text": "Customer service was great, the minute I walked in the door Coral was a host of information on the products I selected and took the time to ensure I  was we informed and satisfied", "rating": 4}, {"title": "Very helpful and didn’t hound us a lot.", "text": "Date of experience: May 24, 2023", "rating": 4}, {"title": "As soon as I walked in Desjia asked if…", "text": "As soon as I walked in Desjia asked if I needed any help with anything and didn't bug me while I was looking around. She also offered water and ice cream.", "rating": 4}, {"title": "I am a repeat customer", "text": "I am a repeat customer. the customer is service is great and you’re not stalked for a sale.", "rating": 4}, {"title": "With great staff I was able to find the…", "text": "With great staff I was able to find the perfect couch within my price range. Delivery is expensive figuring I only live 6 minutes away from the store. I did not appreciate the lady I worked with constantly mentioning that they don’t get commission and pressuring me into leaving a review and she wanted proof that I did it before I left the store. I already spent 1400 in your store so it should be up to me whether I want to leave a review. There was no pressure shopping so that was a plus and they give you soda and ice cream while you make an investment decision.", "rating": 4}, {"title": "Victoria G worked very hard for us once…", "text": "Victoria G worked very hard for us once we decided on the questions we had about the bedroom set, living room set and sleeper sofa that we ended up buying. She greeted us when we came in the store and pointed in the direction we needed. After we made the rounds, she came back to see if we had questions. She answered everything about colors, wood type, drawer bearings w/o having to look it up. She did all the paperwork and cleared my check in a reasonable amount of time, then went thru it all to confirm or explain the details. Delivery was set for Wed, so we are anxious to see how it all comes together. Excellent experience in every regard.", "rating": 4}, {"title": "They made everything right", "text": "Everything was ok", "rating": 4}, {"title": "Friendly staff", "text": "Able to shop and think without interference", "rating": 4}, {"title": "Affordable furniture", "text": "Finding a low cost couch in the clearance section", "rating": 4}, {"title": "The purchase was affordable", "text": "The purchase was affordable, easy, fast, and quick...", "rating": 4}, {"title": "Wishing that you had a service that…", "text": "Wishing that you had a service that would pick up old furniture and either or take it to somewhere for the customer", "rating": 4}, {"title": "The quick service I received", "text": "The quick service I received. The price was fabulous.  I wish the furniture was selected to be picked up at the store in Cedar Hill. TX.", "rating": 4}, {"title": "Everything in the store went good", "text": "Everything in the store went good, but had to wait for the items 6 months", "rating": 4}, {"title": "Excellent customer service shown &…", "text": "Excellent customer service shown & given by Maurice.", "rating": 4}, {"title": "After the third try finally received…", "text": "After the third try finally received our kitchen table , delivery guys did a wonderful job all of them received tips .Sales people need to on there toes get the orders right sales manager should review sales to in sure what items are being place in the buyers homes . All ended up fine Thank you’ll", "rating": 4}, {"title": "03/19 purchase", "text": "We visited the store knowing what we wanted to buy, at the time we were getting ready to place the order the sales person did not ask about times or dates that would accommodate our schedule also she put us on the premium delivery saying the door step drop off was not an option fir the last 6 months, when we just had a family member purchase a couch and order thst service weeks ago. I do not feel comfortable having a couple of men go to the last room in my house to set up furniture while being alone, however, I had to pay for a service I don't need or want", "rating": 4}, {"title": "We purchased a new bedroom set for a…", "text": "We purchased a new bedroom set for a very good price. Delivery was also prompt. Customer service is very kind. Great experience.", "rating": 4}, {"title": "The people are very friendly and…", "text": "The people are very friendly and knowledgeable.  I’m just not sure about the furniture.  It sounds like it’s made with cardboard in places.  It’s just weird.  I can’t sit on the couch it’s to deep and I wanted a shallower one.  The recliner is almost to small", "rating": 4}, {"title": "Excellent customer service but product is broken…", "text": "Everything about the purchase experience was outstanding. However, when I got the chair home and had my electrical engineer brother to put it together. He said it has a broken hinge and sure enough it makes a really loud pop/crack when I power the foot portion down. Please bring me another chair that works properly and pick this one up. I have all the faith that you will make this right. Thank you,Diane Dugan", "rating": 4}, {"title": "I am very excited about the items that…", "text": "I am very excited about the items that I purchased and the price. I'm very satisfied with the service and staff attention to detail", "rating": 4}, {"title": "I they were nice aND sincere in getting…", "text": "I they were nice aND sincere in getting what I needed not just trying to sell stuff.", "rating": 4}, {"title": "Got in and out.", "text": "Date of experience: March 13, 2023", "rating": 4}, {"title": "No pressure sales.", "text": "Date of experience: March 05, 2023", "rating": 4}, {"title": "I  have always used Home Zone as my…", "text": "I  have always used Home Zone as my furniture place.  But I do have one problem.  I ordered a full size bed, which I received, but the box spring is a queen size box spring.  I will get in touch with Home Zone today to get this corrected.  The salesperson was very helpful and the atmosphere was pleasant.", "rating": 4}, {"title": "Supply", "text": "Wish furniture was available at time of purchase.", "rating": 4}, {"title": "This was an excellent shopping…", "text": "This was an excellent shopping experience and our associate helped us without pressuring us to buy more than we were looking for. The reason for only four stars is that it was delivered today and was missing parts and now we are waiting for the parts.", "rating": 4}, {"title": "I liked how knowledgeable the employee…", "text": "I liked how knowledgeable the employee was about the store and furniture. Wish some prices would be flexible when spending a large amount of money.", "rating": 4}, {"title": "I’m so happy to shop at Home zone", "text": "I’m so happy to shop at Home zone. I’m always satisfied.", "rating": 4}, {"title": "Great Sales Staff", "text": "Sales staff left us along until we needed assistance.", "rating": 4}, {"title": "We had an sales associate that walked…", "text": "We had an sales associate that walked behind us and answered all our questions. He was very friendly.  The only issue was he told us the 2 sets we were looking at we in stock.  3 days later one set was clearance and sold.  Not real happy with it due to that was the one we were going to get.  Did not like that the manager stood over the sales associate when he was counting the money.  It seemed like there was no trust from management.  The manager could have been called over when the associate was done counting.  I understand society now.", "rating": 4}, {"title": "Relaxed and painless", "text": "Date of experience: February 25, 2023", "rating": 4}, {"title": "Friendly attentive without pressure…", "text": "Friendly attentive without pressure employee", "rating": 4}, {"title": "A hassle free experience no pressure to…", "text": "A hassle free experience no pressure to buy at all plenty of time to look around felt very welcome and when we did have a question the sales person was very knowledgeable about the furniture in question love this place definitely going to return in the future", "rating": 4}, {"title": "Clean environment", "text": "Great customer service Friendly environment", "rating": 4}, {"title": "Nice", "text": "Nice, friendly, no high pressure sales.", "rating": 4}, {"title": "I returned to Home Zone to purchase new…", "text": "I returned to Home Zone to purchase new furniture after my initial experience several years ago was pleasant and efficient. They did not disappoint.", "rating": 4}, {"title": "Good job on today.", "text": "Date of experience: February 14, 2023", "rating": 4}, {"title": "Sales person was outstanding   was very…", "text": "Sales person was outstanding   was very helpful with my purchase.  Will come back just for the customer service experience that Michaela gave me.", "rating": 4}, {"title": "I appreciate not being followed around…", "text": "I appreciate not being followed around the store but an employee is always around to answer any needed questions.", "rating": 4}, {"title": "Customer Service", "text": "The Sales representatives are always friendly and professional. They allow you to shop without hassle and are available when you are ready to purchase or have questions. The store is always clean, I enjoy shopping at this location.", "rating": 4}, {"title": "Rating", "text": "I had and ok experience", "rating": 4}, {"title": "The sales lady could have stayed a…", "text": "The sales lady could have stayed a little closer to us so we weren’t having to wait to get her attention", "rating": 4}, {"title": "My purchasing experience was fairly…", "text": "My purchasing experience was fairly awful but Izamar was able to set up an exchange and delivery quickly to correct the company’s mistakes.", "rating": 4}, {"title": "Doc was great a helping us pick a…", "text": "Doc was great a helping us pick a couch. After delivery I realized not only did they leave a huge scratch and rub mark on my front door the left ruts in my front yard from backing up to the stairs", "rating": 4}, {"title": "Friendly professional staff/ tip…", "text": "Friendly professional staff/ tip prevention hardware not installed", "rating": 4}, {"title": "Sales staff was knowledgeable and…", "text": "Sales staff was knowledgeable and friendly. Delivery was nearly three hours later than the delivery window.", "rating": 4}, {"title": "Problem solved quickly and efficiently", "text": "After talking on the phone and communicating through emails the problem got resolved. They came to pick up the sofa to have repaired in no time. Everything was very efficient.", "rating": 4}, {"title": "I stopped in to the Home Zone,Lawton,OK…", "text": "I stopped in to the Home Zone,Lawton,OK store with a list of needs. Devon,my salesperson was very friendly,knowledgable and professional,answering my questions but giving me some space to look around. I picked out what I wanted and we closed the deal quickly. Since I haven't received my furniture yet due to waiting on delivery,I can't review the delivery and/or set-up guys,but the in-store experience was great. If I had to make one fault about the entire experience,it would be the cost of delivery at $199. I bought $2800 worth of furniture all totaled,and paid cash,plus the delivery fee,which brought the grand total to $3010.00. I feel any total sale over $2000 should qualify for free or deeply discounted delivery. On an unexpected positive note though,I did get a Veterans Discount and it is deeply appreciated. Yes,I will shop at Home Zone in the future and recommend it to my family and friends.", "rating": 4}, {"title": "Easy to shop", "text": "Always easy to shop for what you need", "rating": 4}, {"title": "Salesman Lee was a really gracious help…", "text": "Salesman Lee was a really gracious help good experience", "rating": 4}, {"title": "The employee did not hep us at first", "text": "The employee did not help us at first.  I had questions.  As we walked around the store, I saw her again and asked for help.", "rating": 4}, {"title": "I felt I wasn’t hounded down by sales…", "text": "I felt I wasn’t hounded down by sales associates making my shopping experience more relaxing.Employees were kind and helpful", "rating": 4}, {"title": "Could have better attention to detail", "text": "The in-store experience was positive.  The sales person was not pushy, provided good information and didn't hover.  He did make a mistake in the check-out and had to go back and alter the transaction and run my card a 2nd time.  The delivery was on time, notified me before arrival, and was trackable online.  The delivery staff was polite and efficient, but seemed to be in a big hurry to move on.  They didn't get the sectional locked together completely and I had to make adjustments to correct their incomplete work.  It seemed like they were under high pressure to move on to their next delivery, and therefore didn't do as good a job as they should have.", "rating": 4}, {"title": "I liked that the salesperson did not…", "text": "I liked that the salesperson did not follow us around but was there to answer any questions and left us to look we felt comfortable to look around and make our decision", "rating": 4}, {"title": "Good customer service", "text": "Sales representative was very honest about everything we inquired on.  Quick service.", "rating": 4}, {"title": "What a mess...", "text": "Our bill got really messed up which we did not notice right away. The staff at the store was really good about resolving the issue. We are happy with the outcome and with the purchase we made. Would have rated five except for the issue with the bill.", "rating": 4}, {"title": "Beautiful Furniture", "text": "I love the furniture, selections, and prices are reasonable and fair. The sales persons are a delight to work with, and the furniture looks wonderful when installed.I did not get to take it home that day, but had to wait a few days and pick it up in another town from wherre I bought it.When I got my chair home, the legs needed to be screwed in, which is normal, but the holes were covered with the chair bottom fabric, and we had to remove it part way to find out where the holes were.  I wish the manufacturer could pinpoint where to screw the legs in.Otherwise, I am very well pleased.  It took a bit of work to get the furniture, but now it is in place and looks great!", "rating": 4}, {"title": "Very pleasant shopping experience", "text": "Very pleasant shopping experience. I even took my 5 and 3 year olds who are usually bouncing off the walls. Home Zone had an area to keep them busy with coloring and ice cream. The staff was very helpful and didn’t breathe down my neck like other places. I went to the Burleson l, TX location", "rating": 4}, {"title": "First time visit", "text": "Good sales personNot pushyVery helpful could answer questionsNice clean storeVery good selectionsOffered a drinkClean restrooms A+", "rating": 4}, {"title": "Allowed me not to be bothered while I…", "text": "Allowed me not to be bothered while I looked, Very appreciated.", "rating": 4}, {"title": "Customer service was very helpful to me…", "text": "Customer service was very helpful to me  good in polite representatives name Jasmine at the Mesquite locate.", "rating": 4}, {"title": "Lisa was very helpful and kind although…", "text": "Lisa was very helpful and kind although we weren’t able to get our money back she was able to arrange a credit so we could choose another product. Thank you", "rating": 4}, {"title": "Follow up on dissatisfied mattress purchase", "text": "Recently I wrote a review about our experience at Home Zone furniture store. We had a bad experience. However 2 days later Jason, the regional manager, contacted us by phone. He apologized about the bad experience and wrong product that was given to us. To make it right he offered to us a choice of any mattress in the store in exchange. I told him all we wanted was the mattress he sold us. He said he had to bring in two mattresses of our choice and when they come in for us to come down and try them. We got a call they were in and went there and laid on it and it was what we first experienced. Also too Jason offered to deliver them and take the current mattress out of there for free. Tomorrow we are getting the mattress we wanted. Kudos to Jason for listening to us and making it right! He is a man of his word and wants the customer to be happy. We will shop again at Home Zone because of this experience. Finding a dedicated person like Jason is rare these days and as a retired couple we are grateful! Thank you Jason and Home Zone! 🙂", "rating": 4}, {"title": "Jaden was great", "text": "Jaden was great. Very easy going and helpful.", "rating": 4}, {"title": "Great communication about our delivery…", "text": "Great communication about our delivery time. Delivered with an exception. The driver thought he was delivering a rug and we corrected him and he brought out our couch and two recliners. Thankfully they were on the truck! Overall good experience.", "rating": 4}, {"title": "It was just a “okay” experience", "text": "It was just a “okay” experience. We didn’t feel like the sales lady or the gentleman helping us really knew much about the beds we looked at. Otherwise it was overall a good experience. We like Home Zone and have purchased there several times.What I didn’t mention, because I didn’t have my contact with me at the time.  We were delivered a different model adjustable base than the one listed on our contract and the one we picked out at the store. The owners manual matches the store model but doesn’t match our two bases delivered. I would like to know if there is a remedy or explanation. In all fairness it might be me that is confused. Thank you.Will you contact me please?", "rating": 4}, {"title": "The prompt attention to our issue.", "text": "Date of experience: December 16, 2022", "rating": 4}, {"title": "Best Deal", "text": "I was torn between two different sectionals with a chaise. The sales person recommended a sales item that was not aware was on sale! I was able to step outside my box a purchase a blue sectional because the price was so great!!", "rating": 4}, {"title": "Customer service was great at the…", "text": "Customer service was great at the store. The delivery personnel were very rough with bringing the furniture in, and broke our mailbox off our brick wall, and did not even say anything to us. Other than that, we love the furniture, and we received our furniture within the week!", "rating": 4}, {"title": "The customer service in the store is…", "text": "The customer service in the store is beyond amazing.  What is big amazing is two pieces of furniture that we received has been broken. I got a fabric bed and the button in the tufted part was loose and the slats to support the bed were warped.  Yesterday I received a chair and the fabric underneath the chair is coming off. I have to say the staff in the store is very accommodating but it is annoying that the furniture is damaged and then I have to go online to fill in a service form.", "rating": 4}, {"title": "the young lady was great ive with you…", "text": "the young lady was great ive with you guys' 3rd time and the lady so nice and aways was around if we needed to ask a question", "rating": 4}, {"title": "Sales people were very helpful with no…", "text": "Sales people were very helpful with no pressure.  The reason I only rated 4 was due to not being texted to let me know my order was ready for pickup.", "rating": 4}, {"title": "Very helpful and properly explained…", "text": "Very helpful and properly explained options available for my purchase.", "rating": 4}, {"title": "We bought a complete set of furniture…", "text": "We bought a complete set of furniture (king bed, sofa, mattress) for our new home. The items were as shown in the floor model and look good quality. It was our first black friday in the US and we managed to grab some doorbuster items( dining table chair set, study table, book shelf)  which were of great quality. We could have given 5 star if only there were more options on the rugs and mattresses. Otherwise, overall a great experience. We appreciate the staff who were always willing to help us when we visited the store.", "rating": 4}, {"title": "Stephanie the saleslady was very…", "text": "Stephanie the saleslady was very helpful and her attitude is amazing. i pick up my desk on Tuesday so hopefully the loading dock is good.", "rating": 4}, {"title": "Ryland was great- he let us look…", "text": "Ryland was great- he let us look without pressure & helped us when we needed it.", "rating": 4}, {"title": "Great showroom with professional sales…", "text": "Great showroom with professional sales associates.Found exactly what we were looking for in a timely manner.", "rating": 4}, {"title": "Just wish they had more room to stock& storage.The people are great.", "text": "WE ARE REPET CUSTERMEN . Every time we go in rather to buy or just looking around We are greeted at the store. WOUNDERFULL PLACE TO SHOP.", "rating": 4}, {"title": "Buying was ok but they should resume…", "text": "Buying was ok but they should resume picking up at the store where purchased. I did not like driving several miles out of my way.", "rating": 4}, {"title": "Yesterday, Black Friday", "text": "Yesterday was Black Friday. The crowd was pleasant and the workers were helpful, I was greeted at the door and given coupons of the items I came to purchase. The wait was about 45 minutes to purchase since there were only two men checking customers out but there was plenty of donuts and soft drinks to be had while I waited in line.", "rating": 4}, {"title": "The store was displayed beautifully!", "text": "The store was displayed beautifully!! I can’t wait until my bedding arrives.", "rating": 4}, {"title": "Issue was resolved thanks", "text": "Issue was resolved, thanks", "rating": 4}, {"title": "The salesman was good but the delivery…", "text": "The salesman was good but the delivery rules didn't make sense to me. I was having a bed and tv stand delivered but I couldn't get the sale couch sent with it.", "rating": 4}, {"title": "Satisfied", "text": "Delivered on time", "rating": 4}, {"title": "I liked that no one bothered us they…", "text": "I liked that no one bothered us they just let us shop until we asked for help.", "rating": 4}, {"title": "Patience", "text": "Fred and company were very understanding of our need,  worked hard to accommodate us.  The store setup is very well done.  Overall, we were very glad to work with such helpful and friendly staff", "rating": 4}, {"title": "I didn’t like your store in Lewisville", "text": "I liked your store in Lewisville, TX, much better in 2018.  There was excitement and anticipation.  You had a great manager and a much better variety of furniture, colors and accessories.  Now, when I walk into the store, there is no excitement and 95% of the furniture and upholstery are all GRAY!!", "rating": 4}, {"title": "great service fast delivery", "text": "Date of experience: November 03, 2022", "rating": 4}, {"title": "Telephones calls were returned", "text": "Telephones calls were returned , as promised.  Each person I dealt with was very helpful.", "rating": 4}, {"title": "They are very friendly and ready to help", "text": "Date of experience: October 30, 2022", "rating": 4}, {"title": "Very nice the sales person help me out…", "text": "Very nice the sales person help me out to have a dinning table in less than a week.", "rating": 4}, {"title": "Sales girl was great", "text": "Sales girl was great.  First sales guys; not so much.  Broke tree limbs, stood in front of defect on sofa so I couldnt see it.  Second round of delivery guys were great with a good sofa.", "rating": 4}, {"title": "We found extra positive attributes that… I will definitely return t this store", "text": "We found extra positive attributes that we were not told about. Delivery men unable to speak enough English to make directions easy. They were professional and nice but difficult to relay info to.", "rating": 4}, {"title": "Employees were friendly and helpful", "text": "Date of experience: October 14, 2022", "rating": 4}, {"title": "Customer service", "text": "Juan assisted us. He was very helpful and gave us time to discuss with my spouse on the items we needed.", "rating": 4}, {"title": "Love the couches but I wasn’t impressed…", "text": "Love the couches but I wasn’t impressed with the way they sent us with them. In a light wrapping. Holes all over. Of course it was a rainy day when we got them and managed to make it home and beat the rain but after purchasing new furniture you’d like to see it wrapped properly for transfer.", "rating": 4}, {"title": "Ease of shopping", "text": "Ease of shopping, low pressure, nice selection. Wanted a couch, recliner and rocker. Chair and recliner selection was fairly limited and we didn’t find chairs at all. Ended up with a sectional which would not have been first choice, but we do like it and it is comfortable. Lack of a recliner may prove to be a problem long term, but the wife is happy with the sectional. Pricing was decent, mattress and bed set options were adequate though not immense.", "rating": 4}, {"title": "Everything about your store was a…", "text": "Everything about your store was a pleasure. The staff was great. Being greeted at the door was a nice change from other places we had been to.I will be back.Linda Schwartz817.907.7422", "rating": 4}, {"title": "The service was fair but not great", "text": "The service was fair but not great, and the same with pricing. Read the fine print about how long you can get interest deferred because it depends on how much you spend. Delivery was promised in a few days.", "rating": 4}, {"title": "mostly good...", "text": "Everything was good mostly except I had to order different chairs then I wanted because I needed them before the holidays and the ones I wanted wouldn't be here until after January or something like that. I really really hope the other chairs are good and strong and go well with my dining set", "rating": 4}, {"title": "Great experience, except for the fragrance smell", "text": "The furniture selection was vast and the customer service was great. I'm happy with the chairs we purchased. The only complaint I have is the fragrance smell that overtakes the whole store. I have allergies to fragrances, so it made walking through the store less enjoyable. I also did not want to stay as long because of the stench.", "rating": 4}, {"title": "Everything was great except they did…", "text": "Everything was great except they did not return my wife’s drivers license and I had to return to the store to pick them up.", "rating": 4}, {"title": "Have seen commercials on tv and was…", "text": "Have seen commercials on tv and was impressed with prices and in stock selections", "rating": 4}, {"title": "Tim is excellent", "text": "Tim is excellent. The stock is very nice and most of the prices are good. My only issue is I was told on my first visit that deliveries were typically 2-4 days. Went back to buy this weekend and was told it may be Nov - Dec until I get most of my furniture. Was told what I bought is popular and is now out of stock pending factory manufacturing new stock. I find this very disappointing.", "rating": 4}, {"title": "Love seat", "text": "Ryan was very helpful and knew right wear the items were I was looking for after I showed me the picture from on line.", "rating": 4}, {"title": "Buying a bed", "text": "Everything went great got what we needed.", "rating": 4}, {"title": "Shopping visit", "text": "The sales staff was very helpful", "rating": 4}, {"title": "Wonderful Experience", "text": "Want to say a big Thank You to Max as well as other staff. All staff made sure they were available to assist and answer product questions if our associate was needed elsewere momentarily. I appreciate that Max gave us time to talk amongst ourselves once he provided information and product recommendations. It was a good experience, thank you. The only thing I have semi negative to report is one of the items are not in stock and there is a wait that is subject to change.", "rating": 4}, {"title": "In 9/27/22 my husband and I were…", "text": "In 9/27/22 my husband and I were politely greeted us at the door by a gentleman named Max. He was very kind and asked what he could help us find and directed us in the right direction to freely look around. When we made our decision I asked for Max’s assistance from his co-worker named Jessica she let us know Max was with another customer but Jessica stepped in to assist with our questions and was very helpful and nice as well. Both of these associates were very polite,kind, and helpful. Max did finish up the sale with us but I will say they both did a very nice job assisting us and working together to get it all taken care of. Thank you!!", "rating": 4}, {"title": "They were very helpful and pleasant", "text": "They were very helpful and pleasant, it was very easy to purchase and go. No problems with delivery time, you can track them that was very helpful as well.", "rating": 4}, {"title": "Two different stores/two different types of service.", "text": "I have been to two locations- Waco and Marble Falls. The Marble Falls location wins hands down for sharing information and professionalism. The Waco store seemed to be short-handed and the manager who happened to be waiting on us, was very helpful but was interrupted 2-3 times by salespeople needing assistance with their customers’ questions. I did, however, make a large purchase at the Waco location because I was able to see the furniture I wanted in person.", "rating": 4}, {"title": "Robert the sale person was professional…", "text": "Robert the sale person was professional and calm and collected without any pressure .price good", "rating": 4}, {"title": "It was very good", "text": "It was very good. I had an issue with you not delivering things in the clearance section. Being a single woman of over 50 years of age- I can’t load and unload it myself…", "rating": 4}, {"title": "Pat provide us great customer service…", "text": "Pat provide us great customer service for our first visit to Home Zone.  My wife found exactly what she was looking for.  My favorite part was the hassle free shopping experience.  We will definitely be shopping there again.", "rating": 4}, {"title": "Everything was good.", "text": "Date of experience: September 18, 2022", "rating": 4}, {"title": "Check your cords.", "text": "Great and friendly service, but was lied to about a chair that I purchased that was supposedly routed there because it was on the floor to long, or was it because the customer had purchased one color and got another, pick one, I was given both!  Great condition, nothing wrong with it. Got it home to discover the cord was cut/ripped, stupid me, I forgot to turn it over. Lift up the back covering and ck them out in the store.(joke!)", "rating": 4}, {"title": "I buy all my furniture from home…", "text": "I buy all my furniture from home zone.very knowledgeable and professional sales team.", "rating": 4}, {"title": "This feedback is only regarding the…delivery", "text": "This feedback is only regarding the delivery. When the delivery came, there was a man and his son that was maybe 9 or 10 helping to carry in the furniture. The little boy carried my chairs over his head and I was shocked. The driver kept leaving my door open so I stood by the door so I could open and close it for him. When I looked outside, the man was trying to have his son help him carry my dining room table. I yelled out that I could help instead of the child, since the table was way to heavy for the child. I then saw another man in the truck who came and took the child's place. This was really shocking that a child was helping with expensive furniture that could have potentially been damaged or scratched.", "rating": 4}, {"title": "I was not pressured to make any…", "text": "I was not pressured to make any decisions and felt comfortable walking around and looking at all you had to offer. When I was ready for help your people were there and helped make my decision. That I appreciate very much. Malik was my go to person he was very professional and courteous. Great sense of humor. So I felt at ease.", "rating": 4}, {"title": "GREAT EXPERIENCE", "text": "We were looking for couches and were going to go to Dallas to go shop for them but thought we would stop in and just look.  We were surprised at the large selection and how we were not constantly bothered by staff.  Only draw back is having to wait 2 weeks to get them delivered", "rating": 4}, {"title": "Had what we wanted and did not try to…", "text": "Had what we wanted and did not try to show other things.", "rating": 4}, {"title": "Great service", "text": "Great service, really helpful staff.", "rating": 4}, {"title": "My furniture go-to!", "text": "This is my second time shopping with Home Zone Furniture. I like how they don't harass or stalk you through the store. Always helpful, knowledgeable and kind. I only have two small gripes. They sent us home with only 2 out of 3 correct pieces. We had to take the third piece back. Also, the selection rarely, if ever, changes. They don't get too many new pieces in. I saw a lot of the same stuff I saw years ago this time around, including the piece we were replacing.", "rating": 4}, {"title": "Mostly great", "text": "Everything is great. The sales person and the furniture. Only downfall is we bought the electric recliner and the batteries to use since we can’t plug the couches in. Well the battery doesn’t work with the lights on the couch and it’s disappointing since I spent a lot of money on them and was told that’s all we need.", "rating": 4}, {"title": "Good one", "text": "Loved the denim sofa and the coffee table. Reasonable price. Homezone could be environment friendly by taking and recycling our old couch.", "rating": 4}, {"title": "Customer service was good", "text": "Date of experience: September 05, 2022", "rating": 4}, {"title": "Venezia was whho  we worked with was…", "text": "Venezia was whho  we worked with was fantastic for the second time now we always enjoy working with here", "rating": 4}, {"title": "Everything was good except the delivery…", "text": "Everything was good except the delivery date. When we purchased, we were given a delivery date, took day off, and then was called to reschedule.", "rating": 4}, {"title": "Ms Gabby was very professional", "text": "Ms Gabby was very professional, knowledgeable, cordial & very helpful, because of her excellent customer service, I will likely refer my family & friends.", "rating": 4}, {"title": "Affordable / great service", "text": "Affordable / great service Ryland was great!", "rating": 4}, {"title": "Need more collection", "text": "Date of experience: August 26, 2022", "rating": 4}, {"title": "Good store experience and delivery - Issues w/Synchrony", "text": "Store experience was great.  Daniel took good care of us and got our recliners set for delivery (sooner than I thought we would get them).  Delivery was on schedule.  The only issue I have is that Daniel had to look up our account.  In doing so, this got charged to my Sweetwater Sound card (also Synchrony) instead of our Home Zone account.  I had to call Synchrony to get this switched over.", "rating": 4}, {"title": "Great experience!!", "text": "The staff was very helpful and friendly.", "rating": 4}, {"title": "My salesman Jesse was extra welcoming…", "text": "My salesman Jesse was extra welcoming and helpful. The only downside is that the bedroom furniture I chose the dressers won’t be here until November which is disappointing. The delivery and set up went timely and smooth.", "rating": 4}, {"title": "It was good a good experience.", "text": "Date of experience: August 16, 2022", "rating": 4}, {"title": "Sales man was very helpful", "text": "Sales man was very helpful, professional and was looking out for our needsDelivery - He was awesome did a good job", "rating": 4}, {"title": "I don't give perfect score even though…", "text": "I don't give perfect score even though they might derseve but there was only one perfect person in the world...Our expereience was wonderful", "rating": 4}, {"title": "The sales team was great and the…", "text": "The sales team was great and the delivery people were awesome.", "rating": 4}, {"title": "Great staff", "text": "Great staff with exception of technical issues with the financial company.", "rating": 4}, {"title": "I placed order & I was told a recliner…", "text": "I placed order & I was told a recliner was in stock & delivery scheduled for Wednesday 8-3-22.", "rating": 4}, {"title": "We had a great experience", "text": "We had a great experience, and our sales person Dawn V was wonderful.", "rating": 4}, {"title": "Friendly staff", "text": "The staff made our purchase easy and were efficient.", "rating": 4}, {"title": "Delivered broken item.", "text": "The buying process and delivery process was great but immediately after delivery one of the chairs wouldnt fold down and there was no phone# to call. My only choice was to fill out an online form. the choices were delivery or warranty issue. I dont think my issue was either category since I never received a working product that I paid for. they are ordering a part now but I think I should just get a new chair to replace this one. I purchased a brand new couch and that's what I think I should get. Not a broken piece in need of repair. Update: After I put this review up I was offered to have the chair replaced and they took care of everything. The new chair has an incorrect connector but I made it work. Couch is awesome.", "rating": 4}, {"title": "Not pushy like most sales people but…", "text": "Not pushy like most sales people but very helpful when you have a question", "rating": 4}, {"title": "Daniel Bed Issues", "text": "I purchased my Daniel Bed in November of 2020. I also purchased the Platinumn Warranty and I am glad I did. The bed frame broke twice in less than 18 months, both times for the same reason - joining two shorter pieces of wood with glue and then using that as siding to screw and support the bed frame and slats. The glue couldn't take the weight and broke apart with me on the bed. The second time they came to replace the side rails, I found out that the entire bed had been redesigned because of the issues I had experienced, and the new side rails would not work with my bed design. Thankfully, Abigail at Homezone Warranty was very helpful and she is helping get my entire bed replaced.", "rating": 4}, {"title": "Why I didn't give a 5 star review", "text": "I was very satisfied with the customer service Aisha provided. The only reason I did not give a 5 star review is because the website is very misleading. I was browsing the website for the location I purchased from and found a love seat I really wanted. The website stated is was \"In Stock\" but when I got to the location I was told that it was not in stock at that store and that \"In Stock\" only means it's actually available somewhere. Not necessarily there. I don't buy furniture that I can't see and touch so I ended up purchasing a different love seat which I really do love! So, all in all I was very pleased with how things went.", "rating": 4}, {"title": "First Timer with HZ", "text": "I am a first-time shopper with Home Zone.  My first-time experience has been surprisingly good.  I did not know what to expect the quality of the furniture to be, but to my surprise what I saw is of good quality.  I even saw the same set at another big-name store and the designer price was much higher, although the quality was not nearly as nice.   I do recommend Home Zone for your bedroom furniture needs.  Also, I have added many items from my initial order, and the friendly staff in Denton, TX took care of all my needs.", "rating": 4}, {"title": "Thanks", "text": "Thanks, helpful and nice!! Sad that my old store credit was not offered up to me, until I had to ask about it. Only after the reminder that the new warranty would also revert to store credit if not used.", "rating": 4}, {"title": "Went in looking for a certain type of sectional", "text": "Went in looking for a certain type of living room furniture. Robert greeted us and let us browse at our leisure. He was helpful and attentive when we had questions. My husband and I both had a great experience at Home Zone", "rating": 4}, {"title": "Seemed like the pickup dept", "text": "Seemed like the pickup dept. Were hungry and ready to go to lunch.Sales was outstanding.", "rating": 4}, {"title": "Walked in and got the set on my lunch…", "text": "Walked in and got the set on my lunch break. Was super fast and easy. Would give a 5 star but I had to take off a second day at work because the hardware wasn’t delivered with the truck and so I slept on the mattress on the floor for a week.", "rating": 4}, {"title": "I was really impressed with the lack of…", "text": "I was really impressed with the lack of high pressure sales tactics.  I was allowed to browse at my own pace yet when I had questions my salesman was right there.  My helper was Khari  Jackson  and he was great to work with", "rating": 4}, {"title": "Excellent customer service", "text": "Excellent customer service. It would be nice if some items would be in stock. Seems only thing that you could possibly get the same day would be a floor model.", "rating": 4}, {"title": "Very friendly and helpful staff - good selection of products", "text": "Shannon helped us pick out the furniture we wanted and days later we returned to purchase them. Shannon was not working that day so Abe helped us.He did a nice job, but must be in training as he asked several questions of others and going through the paperwork was excessively long.He did manage to complete the transaction and schedule a delivery date for us.Everyone was friendly and answered questions we asked.", "rating": 4}, {"title": "My salesman was fantastic", "text": "My salesman was fantastic, quick and knowledgeable with the product line. The store looked had a good selection and visual presentation was great.", "rating": 4}, {"title": "Quick", "text": "Quick, respectful, & professional, only hopped for a smaller window “time-time.” Other than that great delivery!", "rating": 4}, {"title": "On the fence", "text": "Experience in the store was very good. Mattress delivered was very different from in store. I have spoken with store manager and was encouraged to try it for 60 days. I’m praying it softens up from the hard, very uncomfortable it is now.", "rating": 4}, {"title": "Furniture quality", "text": "Furniture qualityDelivery was ok.", "rating": 4}, {"title": "First Time In & Will Return", "text": "This was our first trip into Home Zone and were promptly greeted by the salesperson.  He provided a layout of the store directing us to the area we were looking for.  The only issue was the fact he was the only person selling in the store and was having to help multiple people.", "rating": 4}, {"title": "Danny was most helpful", "text": "Danny was most helpful. We recently moved to town from far away and had to refurnish a home. We had bought some items at other stores only to be let down. Hopefully the process continues that Danny set up for us and we will be a customer for a long long while.", "rating": 4}, {"title": "Overall experience was good as far as…", "text": "Overall experience was good as far as shopping in store every one there was very helpful and kind. Also delivery was fast ordered Friday evening and received my delivery Tuesday. However once the sofa was delivered it was damaged one of the legs on the sofa is slanted and it appears to be a malfunction with how the sofa was constructed. However the claims department/ customer service was helpful and quick in assisting me in filling a claim and helping in resolving the issue. So we will see how quick the turn around time is with either getting the couch fixed or replaced with a new one.", "rating": 4}, {"title": "Tv console", "text": "We returned the first console due to it not being level.  The left side was higher than the right. We were granted an exchange which took place today.  Unfortunately the new exchange unit has a cracked wooden frame around the inside of the RHF glass door.  It evidently came out of the box that way and was unboxed in the warehouse at the store by a store employee because my husband wanted to be sure this one was good.  The doors were not opened/inspected as we were mainly concerned about the unit being level.   It doesn’t affect its use, but disappointing given the price we paid.  I’m not pursuing another exchange because I’m not sure that another one would be without issues.  I’ll just call it done. And rack this up to experience with Home Zone quality and NOT the store itself.  They’ve been kind and responsive to my problem.  Jan Goodwin7/11/2022", "rating": 4}, {"title": "dining room chairs", "text": "I picked up 2 dining room chairs. i was dissappointed they were not assembled.", "rating": 4}, {"title": "1st scheduled delivery had some issues…", "text": "1st scheduled delivery had some issues and the sofa had to be replaced.. but got it 3 days after and eveything was fine.. still happy with the purchase experience & the sofa that i got", "rating": 4}, {"title": "Everything was great except I really…", "text": "Everything was great except I really would like to be able to pay to have it delivered (I couldn’t on this purchase because it was on sale) I would have gladly paid extra to have it delivered.", "rating": 4}, {"title": "Alejandro Reyes was excellent", "text": "Alejandro Reyes was excellent! I am a unhappy customer at the moment I purchased furniture in cash November 5, 2021 and still have not received two pieces of my furniture, so I will call every chance I get until I get my furniture I paid over $2500 and the fact that Alejandro went above and beyond To make sure I was a satisfied customer speaks volumes to me. He was kind well spoken and well mannered and I believe he has my issue resolved by confirming a delivery date to me he has already sent the email in reference to confirm our conversation.  Thank you Alejandro for your excellent customer service skills to satisfy customers.", "rating": 4}, {"title": "Great customer service", "text": "Date of experience: July 08, 2022", "rating": 4}, {"title": "Seems like a nice recliner at a…", "text": "Seems like a nice recliner at a reasonable price. Delivery was smooth and on time.", "rating": 4}, {"title": "They are grate and kind", "text": "Date of experience: July 04, 2022", "rating": 4}, {"title": "They are always friendly and helpful…", "text": "They are always friendly and helpful and patient....never following you around and pressuring you.", "rating": 4}, {"title": "Celest was very helpful in answering…", "text": "Celest was very helpful in answering questions and was very polite and professional", "rating": 4}, {"title": "I generally like Home Zone", "text": "I generally like Home Zone. We have shopped there quite a few times and they have good quality furniture and a nice selection. Cheaper than the folks across the street from them. Always friendly. I feel like the last time we went our sales person was trying too hard. Overselling. We were purchasing a mattress and competitors offer a sleep guarantee that if you arent satisfied in you can return it in x amount of days. So we inquired about something similar. If you've ever shopped for a mattress,  sometimes its hard to get that right. We were told that \"because of the price, if you aren't satisfied you can just sell sell it or use it in your guest room or something its only $x. Or you can keep it and come back to buy something else\" nobody wants to be told how to spend their money. Especially if they aren't satisfied with the product. Just a huge overstep. Left us with a bad taste.", "rating": 4}, {"title": "I have been there several times in the…", "text": "I have been there several times in the past month to prepare for my apartment and each time the employees are friendly.", "rating": 4}, {"title": "I was the buyer", "text": "I was the buyer, your team had the opportunity to ask what other type of furniture I was in need of and did not.   I needed bar stools and a dinning room set.  Also Patio Furniture but I dont remember seeing anything on your sales floor.", "rating": 4}, {"title": "Celeste was helpful", "text": "Celeste was helpful.  However, we didn’t receive any information on how to set the couch up with the power cords or the battery packs.  It is frustrating that we do not know where the batteries even go.  Also we were told we could order a separate battery for the couch console power plugs however we were never told what kind to get or even shown where that would be plugged in at.", "rating": 4}, {"title": "I like the please", "text": "I like the please, lucks clean, nice personal 👌 works in there good to help customer's thank you all", "rating": 4}, {"title": "We have no complaints", "text": "We have no complaints, we thought we had an issue with our chairs but it was resolved. The personal in the store were very responsive and professional", "rating": 4}, {"title": "First time buyer at Home Zone…", "text": "First time buyer at Home Zone Furniture. I left a happy camper. The store is nice, the staff is lovely. There’s no pressure. The items in the store are of good quality. My only minor complaint is that one of the pieces in my order was on back order. But the issue was resolved quickly which I appreciated. I’ll definitely be back in the future for more items.", "rating": 4}, {"title": "Pleasant shopping experience", "text": "Friendly fast service. All questions answered.", "rating": 4}, {"title": "New to Home Zone", "text": "I paid cash for my sofa and loveseat. Perhaps consider a discount or free delivery to your cash-paying customers. I found your prices To be competitive and the quality seems good. The test will come when we see how long your products last. The sofa and loveseat I'm replacing have lasted almost 30 years.", "rating": 4}, {"title": "Would have been 5 stars", "text": "Would have been 5 stars - here's why it wasn't.  The pricing on their furniture was DIFFERENT from the invoice.  It all added up to the same amount but it NEEDLESSLY confused us and SLOWED DOWN the entire process.  If the price is \"X\" on the furniture, make sure the \"X\" is clearly reflected on the invoice.  DUH.  So simple and yet, it caused a needless 10 minute delay and frustration - for what?  Nit picky, maybe... but so simple to fix.", "rating": 4}, {"title": "My salesman was extremely thorough and…", "text": "My salesman was extremely thorough and provides EXCELLENT CUSTOMER SERVICE⭐️⭐️⭐️", "rating": 4}, {"title": "Frida and Abigail have been great", "text": "Frida and Abigail have been great. Looking forward to my sofa working again. :)", "rating": 4}, {"title": "I have no complaints i  regards to…", "text": "I have no complaints in regards to customer service! Everybody has been helpful and very professional  and quick  to help resolve the issues ive had.", "rating": 4}, {"title": "Great Service, not as great quality control", "text": "Customer service was excellent.  The only problem was the wiring was incorrect, which we didn't know until we transported the recliner to OKC, up a flight of stairs unpacked and set up.  Then trying to talk to someone in person on the phone wasn't the easiest.  Then we had to take back downstairs, haul back to Lawton.  The fix was less than one minute.  Then back to OKC  up a flight of stairs.", "rating": 4}, {"title": "Aaron with customer was friendly and…", "text": "Aaron with customer was friendly and helpful with replacing my purchase. Good person for the job.", "rating": 4}, {"title": "The service in the store was good", "text": "The service in the store was good, no one following us around trying to sell everything. We purchased a reclining sofa and loveseat and had them delivered. The loveseat had a recliner that lasted almost 24 hours before it quit working. It stuck fully reclined after being used the third or fourth time. I called the service department and was told it would be a month before they could send someone to fix it. I then called the sales lady we dealt with and told her what the service department said. She was able to get us a replacement loveseat a week later.", "rating": 4}, {"title": "Management easy to work with", "text": "Bought original sofa, got it home and just wasn’t the sofa for us. Spoke with local manager and we were able to return original and get another sofa more to our liking. Having to wait on new sofa but hopefully we will be happier with this one. Management was very easy to work with", "rating": 4}, {"title": "We're giving our SALESPERSON (we think…", "text": "We're giving our SALESPERSON (we think his name was ANDREW) a high rating because he answered all of our questions plus addressed pur needs in a mattress which ultimately led us to finding the timate mattress for us. However, yesterday when my husband went to check on the status of the base we also purchased, the manager on duty (JAMES) was incredibly condescending & dismissive towards my husband & speaking to him as if he were a child.My husband did nothing to provoke this type of highly unprofessional behavior & left the store before he lost his temper. Our hope is that the unacceptable behavior JAMES displayed towards my husband will swiftly be addressed & consequences be put in place.We are also dissatisfied with when the base for our mattress is expected to arrive. The emails & texts we have received have given us such vague dates.", "rating": 4}, {"title": "Great Customer Service", "text": "Date of experience: April 13, 2022", "rating": 4}, {"title": "The furniture is very nice.", "text": "Date of experience: April 08, 2022", "rating": 4}, {"title": "I like HomeZone got my whole apartment…", "text": "I like HomeZone got my whole apartment from there. At this location I feel the lady should of gave me my financing options first. I walked out the store thinking I didn’t get approved or couldn’t get approved. But I did through the 3rd party.", "rating": 4}, {"title": "Everyone was very friendly and it was…", "text": "Everyone was very friendly and it was surprisingly easy process the delivery people were very kind.", "rating": 4}, {"title": "I have purchased various pieces of…", "text": "I have purchased various pieces of furniture at Zone.I was happy in getting help from Sean. He deserves5 Stars! The dresser I purchased there only deserved 4 Stars. Sean and the gentlemen who deliver the furniture deserve 5 Stars.", "rating": 4}, {"title": "They gave me the wrong colored couch…", "text": "They gave me the wrong colored couch but allowed me to keep the one they originally  brought until they are able to bring me the right one.", "rating": 4}, {"title": "Couches", "text": "Home Zone had great product to choose from. We did lots of research, checked out every furniture store you can think of and even visited Home Zone 3 times before we finally made out decision. Every couch we sat on, we would compare to Home Zone, and none held up. Our sales rep Robert was amazing. He was very patient, answered all of our questions and went above and beyond to help us. The only reason I'm not giving 5 stars, is because the couch we chose was out of stock and we have to wait about a month to get. Otherwise, the experience was pristine.", "rating": 4}, {"title": "I was very impressed with the store", "text": "I was very impressed with the store and Paola was so friendly and helpful. The only reason I didn’t give 5 stars is all the ads boast about their furniture always in stock and the one we picked out was not and would be several months before it would be. We didn’t buy yet but will be back.", "rating": 4}, {"title": "Questions about leather", "text": "The only issue we had is that they were supposed to follow up with a call about the type of leather used on the chair and we had to call them. Also the financing should not bill us until furniture is delivered. We have to pay for something we have not received. The sales person Stephanie was excellent and extremely helpful.", "rating": 4}, {"title": "Kendra was very friendly and helpful", "text": "Kendra was very friendly and helpful. I am very pleased with our interaction. I thought this process would be more difficult. Thank you", "rating": 4}, {"title": "I love the quality of the furniture…", "text": "I love the quality of the furniture and the price. The sales associate, Justin, that helped us was very good looking into everything we asked and was very patient about it. The only reason I'm not giving 5 stars is because they do not deliver where we live and they failed to mention they do not take payments online or over the phone which is a problem since we don't live in town.", "rating": 4}, {"title": "Review", "text": "I purchased the Hermes sectional over 3 weeks ago and I still have not received it.  I am told it is still in transit.", "rating": 4}, {"title": "All is good and we understand the…", "text": "All is good and we understand the inventory issue.  So overall for our first shopping adventure and buying, we are very pleased.", "rating": 4}, {"title": "There was a mix up on a chair I had…", "text": "There was a mix up on a chair I had ordered so it was not delivered when first promised. However, they made it right and the end result so far has been great. I am waiting on the rest of the pieces which should be here mid-January. I will buy from them again! Love what I have received so far!!", "rating": 4}, {"title": "1st time ever dealing with Home Zone…", "text": "1st time ever dealing with Home Zone was good... Went on Black Friday... Only thing was that at loading dock my furniture was not inspected prior to loading.. due to remodeling at home... Furniture is still in store wrapping... But overall I will continue to do business with Home Zone...", "rating": 4}, {"title": "Positive Experience", "text": "I found my experience with Hone Zone to be positive. The sales person worked hard getting availability information & answering questions. We purchased and delayed our delivery until we moved. Everything came on time & in good condition. The delivery crew could not have been nicer or more cooperative.", "rating": 4}, {"title": "The sales associates were friendly", "text": "The sales associates were friendly, professional and patient.When they delivered the loveseat & rug, the wrong size rug was delivered. Customer service was contacted, they apologized and scheduled a date for exchange. Second delivery same thing. Third delivery was scheduled the day before Thanksgiving, again they delivered the wrong side rug. All I was hearing from customer service each time was an apology and promise the next delivery would be correct. I ask the salesperson to look into the problem. I ordered an 8 x 11 they delivered a 5 x 7. The right size was delivered Friday after Thanksgiving.This time the driver was rude & I had lost my patience.", "rating": 4}, {"title": "We had shopped on line and in the store…", "text": "We had shopped on line and in the store prior to purchasing our new sofa.  We walked in, told the sales person what we wanted, paid and we were out the door.  It was a simple and easy process.  Our new sofa arrived a few days later and was delivered and set up.  Everything worked very smoothly.  Thank you", "rating": 4}, {"title": "The customer service process for…", "text": "The customer service process for repairs is less than efficient, but the employees are very courteous and helpful. Lisa Williams did her best to resolve my problem quickly. I’m disappointed that this will be the 3rd reclining loveseat in a 6-week period after having to wait 6 weeks for it to be delivered when I purchased it.", "rating": 4}, {"title": "Would have given 5 stars but didn't…", "text": "Would have given 5 stars but didn't have the one advertised in stock.", "rating": 4}, {"title": "Very friendly and helpful staff", "text": "Very friendly and helpful staff. Not pushy at all.", "rating": 4}, {"title": "Customer service was great", "text": "Customer service was great! Just didn’t have what we wanted as far as a table and bedroom set.", "rating": 4}, {"title": "Prices are competitive", "text": "Prices are competitive, quality as well. A little disappointed that our bedroom set will remain incomplete (dresser on backorder for up to 5 months after purchase, but we WERE informed about the delay at the time).", "rating": 4}, {"title": "Good service", "text": "Date of experience: October 14, 2021", "rating": 4}, {"title": "No high pressure but was available when…", "text": "No high pressure but was available when we had questions.", "rating": 4}, {"title": "We bought a mattress from Home Zone and…", "text": "We bought a mattress from Home Zone and when it was delivered it was in the delivery guys left there was a couple of tears on the bottom of the mattress so I called the store and talk to Diego and he set me up with a new mattress to be delivered a week later. When that date arrived nobody showed up so I called the store again and they had no knowledge of that exchange. So they set me up for delivery of a new mattress today Tuesday, October 12 and indeed of the guys showed up and", "rating": 4}, {"title": "Having to wait over another for our…", "text": "Having to wait over a month for our furniture is a little long. Other than this issue everything was good.", "rating": 4}, {"title": "I was unable to pay for my purchase…", "text": "I was unable to pay for my purchase from home on my credit card.  I had to drive to Mesquite and I live in Hideaway, Tx.  There has got to be a better way.  Had it not been for my wife I would have canceled the order.", "rating": 4}, {"title": "One piece of furniture was chipped…", "text": "One piece of furniture was chipped during the move in.", "rating": 4}, {"title": "no pressure to buy", "text": "no pressure to buy, but they were there to answer all my questions. thank you Vanessa.", "rating": 4}, {"title": "Im satisfied with the purchase and also…", "text": "Im satisfied with the purchase and also how the financing was used to help me choose it my way.  Althought some of the furniture that was brought was damaged it waa redtified as stated and explained.  Me and my spouse did think it was of a higher quality but the purchase was good for the price. I was looking at the quality if wood that was used so you could use better screws to attatch legs to dressers etc. It seems as if was nailed and when moved it comea apart to easily. My wife is happy and again for the price the furniture it was a good purchase . Thank you for your friendliness and business minded staff.", "rating": 4}, {"title": "Broken furniture on display.", "text": "Date of experience: September 14, 2021", "rating": 4}, {"title": "Hello how are you im shezu from India…", "text": "Hello how are you im shezu from India we are manufacturing & expoter we make wood home decor products please contact me 91-9045508706 its my number ok message me what you need my price very good pleses order me thanks you", "rating": 4}, {"title": "In store service was great with the…", "text": "In store service was great with the sales person not hovering but she did check in and she was able to answer any questions we had. Placed our order and everything was delivered promptly and courteously. There was a hiccup which was taken care of quickly. I had ordered the power chair and love seat, so they had to be returned and redelivered a few days later. No problem, it was all handled quickly and corrected. Really like the new furniture. Really appreciate Nicholas.", "rating": 4}, {"title": "Pleasent friendly sales people", "text": "Pleasent friendly sales people, answered all questions and setup delivery promptly as promised.", "rating": 4}, {"title": "The wrong items where delivered", "text": "The wrong items where delivered. It was corrected and received the correct items.", "rating": 4}, {"title": "Store personnel very friendly and…", "text": "Store personnel very friendly and knowledgeable. Completely satisfied with purchase.  Delivery didn't come until 9:45 at night! Four and one half hours late! Really messed up our day! If not for that you would have gotten a five star rating from us!", "rating": 4}, {"title": "Great couch for a good price!", "text": "Great couch! Well made, good color and scratch resistant. Sales associates are friendly and knowledgeable without being pushy. I got a good price too with easy no-interest terms! My only issue was with the delivery guys and they messed up in every way.. they dropped the couch, broke a lamp, came when it was raining although I had called earlier to delay delivery and yep, they got stuck on my road! The issue was addressed immediately by management tho and they comped the delivery fee. Overall I would shop here again.", "rating": 4}, {"title": "Great help great customer service", "text": "Great help great customer service. It helped that I knew what I wanted! Went back in for additional pieces to bedroom set snd it was still available. The person who helped was very friendly and it was a smooth purchase experience.  The delivery team were very nice and professional as well.  They got my bed set up quick!!! Very impressed", "rating": 4}, {"title": "I appreciate the home zone employees…", "text": "I appreciate the home zone employees for going above and beyond on their service. Kat helped me through my entire process and I appreciate it. However the reason for 4 stars is not due to customer service  however due to the product I reviewed. When I picked out a table in the store the table was a ultra white and I loved it. However getting the table from the box the color was not like the one in store and more of a creme white which I did not like.", "rating": 4}, {"title": "The service manager Alyssa G", "text": "The service manager Alyssa G. has been a great help in meeting the the needs of my family.  The promptness in her communication says it all.  She was able to meet a try concern and need regarding pick up and delivery.  We buy from home zone often.", "rating": 4}, {"title": "I love my new furniture, but....", "text": "I love my new furniture!  I can't wait to go home every day and relax in it The only thing is the cord for the wireless charger was not included at delivery.  They called right away and were happy to send it to me, but I still have not received it.  It was supposed to be FedExed to me and arrive WI 24 to 48 hours.  That was last Wednesday.  That is the only thing that was not perfect.  The delivery guys were very helpful and friendly.  They cleared out the trash when done.  The only thing I would like to be different is that since the cord was not delivered, I would like to have been able to get it from the store here in WF rather that to wait for it in the mail.", "rating": 4}, {"title": "Though there were some…", "text": "Though there were some miscommunications by phone, once \"in-person\" I received more accurate information on the arrival of our chair. Pick-up in North Richland Hills went flawlessly.", "rating": 4}, {"title": "Love the furniture -leather", "text": "Love the furniture -leather. dual recliner with middle console. I thought the delivery fee $199.00 for approx 36 mile distance was too expensive.", "rating": 4}, {"title": "Victor was amazing", "text": "Victor was amazing. He has great customer service skills and assisted us in a manner that was appreciated. Nick was a great help as well and made us feel like we were wanted there and not rushed. The only down side of this visit and we almost left without purchasing is the lack of air conditioning on a HOT HOT day. Thanks for your assistance.  You are all amazing in Lawton,  Oklahoma Homezone.", "rating": 4}, {"title": "Alyssa was super helpful in answering…", "text": "Alyssa was super helpful in answering my questions on my issue and helping me open a claim. She was understanding and eager to help.", "rating": 4}, {"title": "It was good experience", "text": "It was good experience, it just that first day delivery they brought damage head board on arrival, next day brought the good one then mess the rails up .. other than that everything things looks good..", "rating": 4}, {"title": "Total review", "text": "The sales person, Kent, was exceptional! However, when they delivered my furniture, an essential power cord was missing.  I called the store and explained. Luckily,  the regional manager happened to be there and expediently deli ered a cord to me. The finance manager on the otherhand, failed to communicate with Synchrony as agreed and my terms were all messed  up. Good thing I'm a good customer there. I was able to call themand get it straightened out.  I think he needs a second course in contracting.", "rating": 4}, {"title": "Great sales associates", "text": "Purchased a bed and the sales person was great to deal with but the delivery was painful taking nine days to get it.", "rating": 4}, {"title": "We were pleasantly surprised at the…", "text": "We were pleasantly surprised at the prices and quality of all items on the showroom.  We had helpful but not pushy salespeople. They directed us to our areas of interest then left us to decide.  Delivery was quickly arranged, on time and pleasant delivery men.  Will include Home Zone in our next purchases.", "rating": 4}, {"title": "Good prices", "text": "Good prices, but unreasonable wait time.", "rating": 4}, {"title": "💘 love the dining room set", "text": "💘 love the dining room set. Good price. Delivered when said. Quick set up.i think they said once it's set up we couldn't return it, ask them to make sure. But good service in store.", "rating": 4}, {"title": "I got a great deal on a couch during…", "text": "I got a great deal on a couch during the tent sale. The employees seemed excited to help, which was different from previous experiences", "rating": 4}, {"title": "From the store to delivery truck they…", "text": "From the store to delivery truck they all were good,I will be back soon Thank y’all", "rating": 4}, {"title": "I would have given 5 stars", "text": "I would have given 5 stars, but was disappointed when I couldn’t take the end tables that were on the floor. (None in stock). Had to order!  Then when we picked them up, they were in boxes. I thought from a furniture store, I could pick them up assembled.  BUT, I want to say, the employees were VERY nice and helpful. And the store was beautiful and clean and smelled good!  Will be back!", "rating": 4}, {"title": "Had a good experience shopping at Home…", "text": "Had a good experience shopping at Home Zone. Lots of help and Lots of nice furniture. We bought a living room suit and tables. Delivered them when promised and delivery guys did good. We like what we bought and we will be back.", "rating": 4}, {"title": "Good in-stock inventory and quick…", "text": "Good in-stock inventory and quick delivery times", "rating": 4}, {"title": "Overall Great", "text": "The item itself is gorgeous and high quality especially for the price. The customer service at the store was also extremely helpful. My only complaint is that I could not find the dimensions for the package anywhere online so we were not prepared when we went to pickup. We ended up having to rent a Uhaul to get the final piece home. I took a risk on that to get free pickup, but it still would've been nice to have a little more information about package dimensions before ordering.", "rating": 4}, {"title": "I have no information at this time", "text": "I have no information at this time thanks a lot guys talk to y'all later well done job", "rating": 4}, {"title": "With one exception", "text": "With one exception, everything went fine with our purchase.  We bought a sofa and chair/ottoman.  We didn't like two of the pillows on the sofa (which comes with the purchase) and asked if we could change those, and we were told no, that wasn't possible.  Then, on delivery, they didn't even include those two pillows.", "rating": 4}, {"title": "The sales experience was very good", "text": "The sales experience was very good.   The next day, I learned that one of the items was not in stock.  I was offered an acceptable substitute.", "rating": 4}, {"title": "Loveseat delivery", "text": "The Loveseat was delivered in the timeframe projected.  The delivery personnel were courteous and careful in placing the furniture.  When inspecting the furniture, we noticed what appears to be a fabric defect on the side of the sofa.  The delivery man took a picture and said he would notify customer service.  However, to date, I have not heard from customer service.", "rating": 4}, {"title": "Ashley was helpful in helping me with…", "text": "Ashley was helpful in helping me with and exchange on an item. Even told us how to put the couch together and it worked. I order some other things that have not been unboxed yet but I am hoping that we don't have to exchange them either. Thank you Ashley for all your help.", "rating": 4}, {"title": "The buying experience was wonderful and…", "text": "The buying experience was wonderful and I would recommend the Hudson Oaks location any day. Our only negative experience was with our deliveries. The first delivery was wonderful and the installation went smoothly even with the hiccup on receiving an incorrect rug. The 2nd delivery included the correct rug and the warranty for our table. This was a different company that delivered than our first delivery. They did not want to open up the rug to make sure it was the correct product also not wanting to do the actual install that we paid for. Stating that the sales reps don't know what they do and they just say that the deliveries will include the full set up just to make their sales.", "rating": 4}, {"title": "Service and delivery", "text": "Service was quick and we received all the items purchase at the same time. The only thing one of the legs on the sofa is damage I didn’t get a chance to review the furniture while the delivery person were here because I was working from home at the time of the delivery.", "rating": 4}, {"title": "I was very pleased with my purchase…", "text": "I was very pleased with my purchase although I was slightly annoyed with the wait time for assistance and the purchase process due to only 2 people working in the store.  The delayed customer service happened both times I went into the store.", "rating": 4}, {"title": "Meagan was great", "text": "Meagan was great! And very helpful!Thanks to everyone who helped out!", "rating": 4}, {"title": "Everyone I dealt with was kind and…", "text": "Everyone I dealt with was kind and helpful. They had the will to assist.", "rating": 4}, {"title": "Bedroom furniture purchase", "text": "Entire experience was good overall. Really like our purchase and delivered on time. My only issue is that the free delivery was not offered to us. The very next day after purchase there was a mailer that came to the house offering free delivery for purchases above a certain amount that covered the time frame that we purchased. We were well above that amount. I get it, I didn’t ask for it. However, from the stand point of good customer service, if they were offering an incentive then I felt it could have been offered to us. Other than me paying 99 more than I could have, the rest of the experience was good.", "rating": 4}, {"title": "The furniture was perfect the delivery…", "text": "The furniture was perfect the delivery company not so great.  They knocked down down our power line to the house with the truck and then tried to say it wasn’t them.", "rating": 4}, {"title": "Great", "text": "Great, quick and efficient service. Everyone was nice and helpful.", "rating": 4}, {"title": "No sales pressure.", "text": "No sales pressure.CleanSeveral models", "rating": 4}, {"title": "The store over view.", "text": "The store was clean, had a good choice of furniture and color's to choose from.The staff was very friendly. The only reason I gave four star's is because, the delivery guy's setup everything, but, they didn't plug in the power cord's on the recliner's and they didn't check to see if everything worked before they left.", "rating": 4}, {"title": "Everything was satisfactory", "text": "Everything was satisfactory, but I did not receive any information about the warranty or care of the furniture when it was delivered.  Can I find this information somewhere else.", "rating": 4}, {"title": "Everything was great delivery was…", "text": "Everything was great delivery was awesome everyone was nice n ready to help thank you", "rating": 4}, {"title": "Buying experience of new mattress was…", "text": "Buying experience of new mattress was great. When I received my mattress though it was much firmer than what I expected. I contacted Home Zone to see what my options are and was told I need to sleep on the mattress for 60 days before an exchange could be considered. I'm hoping I can exchange it for a softer mattress sooner as I'm having difficulty sleeping and I'm waking up in pain.", "rating": 4}, {"title": "Found something we liked in the end", "text": "Found something we liked in the end. First choice was bed purchased online but color online was not visually accurate. Decided to go in store and choices were limited.  However the customer service was great and they helped us navigate with exchange for great bar stools.", "rating": 4}, {"title": "No pressure is what I like and no one…", "text": "No pressure is what I like and no one follows you around. The only thing was the delivery didn’t come till 4:30. Delivery men were nice.", "rating": 4}, {"title": "Overall", "text": "Overall, everything went fine . Other than the wrong size mattresses were brought out for the bed.", "rating": 4}, {"title": "The employees at the Abilene store are…", "text": "The employees at the Abilene store are nice but not very informed on product. I went there to get my sectional but when asked how long the sectional was they didn't know & couldn't measure correctly. I went back to see if I can change some pieces so it would fit in my living room, they informed me I could deny which ever ones I wanted to except for the corner piece because the other pieces wouldn't conecct. I denied the corner piece. I tried calling to have that piece taken off the price but no one has called me back.", "rating": 4}, {"title": "Great customer service and no pushy…", "text": "Great customer service and no pushy sales people, delivery associates are also very nice, however both times I've purchased here something was wrong with my item, first time they sent me the wrong mattress and second time the mattress was stained in multiple places, customer service did get it resolved next day for me though so that helped..", "rating": 4}, {"title": "The delivery people did a good job and…", "text": "The delivery people did a good job and everything went well. My only complaint is that when they finished, they left the protective material that covered the furniture in the hallway of the assisted living home. They should have taken it with them for disposal. I had to do it.", "rating": 4}, {"title": "Instore service was fantastic", "text": "Instore service was fantastic. delivery, not so much.Delivery was set by 7:30pm, they showed up at 9:30pm", "rating": 4}, {"title": "Wrong color furniture delivered.", "text": "Date of experience: March 22, 2021", "rating": 4}, {"title": "Good & Efficient", "text": "The delivery staff was very nice and efficient , but one of my dining room chairs broke in transit and they are having to send another chair.", "rating": 4}, {"title": "I received sufficient explanation on…", "text": "I received sufficient explanation on the assembly of the chairs, but still waiting for someone to contact me re nicks in the slats on a couple of the chairs.", "rating": 4}, {"title": "Good service overall", "text": "Great service overall.  Forgot my salesman’s name, but he was good.  We were in the market for a bedroom set and he explained the differences between the various sets fairly well.  Wasn’t pushy or anything and the whole experience felt good.  I was pleased with the whole shopping experience and would do business with them again.", "rating": 4}, {"title": "The delivery was fast and the delivery…", "text": "The delivery was fast and the delivery guys were very professional.", "rating": 4}, {"title": "Awesome service", "text": "Rush was super awesome. Answered questions and really helped us make a decision. The process was quick and easy as was delivery and set up.", "rating": 4}, {"title": "Cyndy was an awesome and knowledgeable…", "text": "Cyndy was an awesome and knowledgeable salesperson at the Marble Falls store.  The sofas came as scheduled and on time.  The only reason the rating is not 5 stars is that our ottomans did not come with the delivery and no one called to let us know when they would be delivered.  I had to call customer service, wait in the que for 25 minutes to find out they were at the distribution center but no one let us know.  If part of your shipment is delayed...get a new date up front!!!!", "rating": 4}, {"title": "Love the couch but leg of couch broke…", "text": "Love the couch but leg of couch broke off in a week. That was a bummer", "rating": 4}, {"title": "General Review", "text": "The movers did a great job of moving the bedroom set in and getting it installed for the most part. The only issue I had was that they did not screw in some of the handles tightly on the chest and dresser and so they came apart.", "rating": 4}, {"title": "Great customer service", "text": "Great customer service! I just wish delivery options will be for convenient to the customer.", "rating": 4}]