[{"title": "Love halara pants.", "text": "The clothing fits nicely, super comfortable. I orderd 3 pairs of pants in medium size, which is what I usually wear in other pants and everything fit perfectly except the shapewear that I recived as a free gift with my order. I orderd a medium and it was too small very difficult to get on and uncomfortable, I recommend sizing up if you decided to purchase one. Order was shipped right away and arrived quickly.", "rating": 4}, {"title": "A bit on the large size for petite ladies", "text": "The SpeedWave sports bra and sheer round neck thumb hole split asymmetric yoga sports top both fit well. The other items are a little big. I ordered XS for a petite 5 foot woman. The breezeful high waisted skirt and the contrast mesh long sleeve top are a bit roomy and long. I will try and tailor to my petite size.Fabrics are soft, breathable, and comfortable. Just wish there were petite sizes.", "rating": 4}, {"title": "I normally would give 4 stars…however…", "text": "I normally would give 4 stars…however there was an issue with trying to use 2 gift cards that never got resolved quickly enough. Love the product but not happy with customer service this time. ", "rating": 4}, {"title": "I like that they post helpful reviews…", "text": "I like that they post helpful reviews and sizing guides. When I contacted costumer service they helped. When I needed a return they offered my full money back to be used to buy new pants in the correct size and let me keep the old ones. I was only disappointed they didn't inform me how much it would cost to return ship or give me an address so I could look into it. They give you 24 hrs to decide if you want store credit or return ship and didn't feel like I knew enough to decide. Also keeping the old ones I wouldnt be able to wear based on the sizing issue. They were prompt and tried to resolve the issue and that made me happy. ", "rating": 4}, {"title": "Easy to place order but the tracking is…", "text": "Easy to place order but the tracking is a bit hit and miss. So was unaware when they would arrive on the whole a quicker delivery would be an idea but the goods are worth the wait. Which means less patience when waiting ", "rating": 4}, {"title": "Comfy pants ", "text": "The pants are super cute and comfy! They are stretchy and the petite fits me perfectly at 5’4” which is hard to come by. Only negative comment is about the smell. They have a strong chemical smell and even after washing once they still smell. Hopefully that’ll go away after another wash. ", "rating": 4}, {"title": "All in all this was a positive…", "text": "All in all this was a positive experience. My one issue is the leggings have crooked bottom seams that don't lay flat and crease at my ankles. It was a manufacturing issue. Otherwise everything seems comfortable and a good quality.", "rating": 4}, {"title": "Ordering snafu", "text": "Aside from a minor glitch (which was rectified) because of a problem with changing my address on an order everything went fine", "rating": 4}, {"title": "Timely delivery but smells funny", "text": "Received in timely manner, but pants smell funny- even after washing and using fabric softener. My whole closet smells like the chemical smell on my pants. ", "rating": 4}, {"title": "Pretty good from start to finish", "text": "Pretty good from start to finish. The tracking on the shipping isn't as detailed or through an actual carrier just their site. No issues just sometimes takes a while. ", "rating": 4}, {"title": "Comfy but too much dye", "text": "Pros:  These jeans are super comfy and well made and I like them a lot. Cons: The regular size was a bit too long for me but the short size is perfect. I'm 5'4\" and normally wear regular length in other jeans.  Also, even after 10+ washes these jeans are still turning everything in the wash (and my legs) blue!  I'd buy these again but definitely would not wash them with other clothes EVER and probably just hand wash to keep my washer/dryer also turning blue.  ", "rating": 4}, {"title": "Good quality. Bit small but pleased overall ", "text": "Arrived much quicker than expected. Uncreased which was great. Good quality. Quite small but wearable so kept, although wish had bought a size up.", "rating": 4}, {"title": "Great clothes, long wait time for delivery", "text": "My Halara experience was great overall. The only complaint I have is that the clothes took a long time to come - about one month. I am not sure why that is the case. One item was not satisfactory and Halara gave me the option of returning for a refund or a gift card. It was nice to have that option, however refunds require us to pay shipping, which is not the case for other clothing companies I have returned items for. The quality of Halara clothing is great and I will likely order from there again.", "rating": 4}, {"title": "Just as advertised", "text": "Just as advertised! Super stretchy and comfortable fabric! The only thing I didn’t like is the way the buttons are fastened as they appear tied on. ", "rating": 4}, {"title": "Surprisingly good quality and excellent…", "text": "Surprisingly good quality and excellent customer service. For a fast fashion brand, it's interesting to see them asking for feedback on their clothing. Really easy return process, but if you send it back you must pay for your own shipping. ", "rating": 4}, {"title": "The suit is really well made", "text": "The suit is really well made. I love it. The size fitted me good. Because they don't keep inventory, the shipping delay is longer than usual, which can help work on your patience.", "rating": 4}, {"title": "Making sure the sizing is right ✅️ . The sizing for me always seems a little big even thought I measure and buy accordingly.  😌 ", "text": "I am appreciative of the quality and the time invested to make the items perfect. However,  I believe the sizing is a little off. It seems a bit bigger than what the size range suggests. I still love and buy, and make it work for me. ", "rating": 4}, {"title": "Trousers are amazing feel great", "text": "Trousers are amazing feel great. I bought another pair they are so nice. Only down fall is the returns is a bit of a hassle. Took me a few days to sort out, but customer service is really helpful and sorted out problem quickly. ", "rating": 4}, {"title": "The product was for my wife", "text": "The product was for my wife, she really liked the material, and feel of the dress, but it was too long for her so had to return it. ", "rating": 4}, {"title": "Not exactly sure yet ", "text": "The top I received I loved! I haven’t worn it yet. I wish the leggings were a bit “cozier” fabric. I feel like they will be cold in the winter but the quality looks really good. It takes a longer than expected time to receive the products you order", "rating": 4}, {"title": "I was pleasantly surprised at the…", "text": "I was pleasantly surprised at the quality and the ease at ordering. The only thing I would say is it took longer than I would want it too, so when ordering keep that in mind  ", "rating": 4}, {"title": "Would appreciate faster shipping/better options for changes to order", "text": "I needed to make a change to the address right after the order was placed, and the only way to fix that was to cancel the order and make a new one. Pretty inconvenient. Also the shipping was pretty slow even though I paid for expedited. ", "rating": 4}, {"title": "Took longer than ad used longer debut once…", "text": "Took longer than ad used but once chased parcel I received within 3dsys of my complaint. I have to say love the purchase will probably buy more ", "rating": 4}, {"title": "Took along time for delivery", "text": "Took along time for delivery. In the meantime I got a SPAM TXT Ups wanted my address cause it was,incomplete.  DIDNT GO FOR IT!!!!  Didn't realize pants are from China. Think it was false advertising  with models. Won't buy again", "rating": 4}, {"title": "Great quality and look", "text": "Dresses are great quality and look fantastic. The maroon one is actually bright red which is a bit disappointing but still looks good.", "rating": 4}, {"title": "The quality is usually pretty decent…", "text": "The quality is usually pretty decent except at the seams i usually find a piece of clothing where there’s a hole in the seam somewhere and there was one in the black pants ", "rating": 4}, {"title": "Product is good quality and timely…", "text": "Product is good quality and timely delivery (arrived yesterday.) I have purchased numerous items and never experienced the odd “musty” smell before now. Very unpleasant and will require washing before use", "rating": 4}, {"title": "The material is amazing", "text": "The material is amazing. However I do not like the tight elastic at the very top of the dress pants it’s not flattering. It should be the same as the workout pants and not have a “string” or whatever it is at the top that’s so tight. ", "rating": 4}, {"title": "Clothes arrived and fitted perfectly…", "text": "Clothes arrived and fitted perfectly which was a relief as I had read some reviews that returns were difficult and as I hate that sizing is different in every shop and normally need to try things on before I buy. I took a chance on the website measuring and went for a large (uk 16-18) and they fitted perfectly, very comfy and soft stretchy, lightweight material. My only concern was that they were made in and sent from China where I worry about how employees are treated and paid. ", "rating": 4}, {"title": "Great quality!", "text": "Great quality!! The website was easy to navigate and order!! Onto downfall it’s that I did not get it by the expected delivery date, but still loved ordering from this website!! ", "rating": 4}, {"title": "the Jumpsuit is great!", "text": "The jumpsuit is exactly as described and looks great!  The sale made it more affordable.  The only complaint is that I had to pay so much in shipping to receive it in a reasonable time.  ", "rating": 4}, {"title": "I love the material and soft feel if…", "text": "I love the material and soft feel if these leggings.  I love the tummy control however they roll like crazy.  ", "rating": 4}, {"title": "Easy to use app", "text": "Easy to use app. Hard to be patient waiting for items to arrive but I respect the fact that they want to keepInventory low. Not loving supporting a Chinese app though. ", "rating": 4}, {"title": "Online experiments was simple", "text": "Online experiments was simple. The pants were a bit long but I did consult the sizing chart. ", "rating": 4}, {"title": "A button fell off right at taking it…", "text": "A button fell off right at taking it out of the bag - (cargo button) so that was disappointing however the rest of the quality was great ", "rating": 4}, {"title": "They live up to the hype!", "text": "The stretchy “denim” pants live up to the hype! I love how they look and how they feel. As a person who embraced tights for their comfort factor, but never really loved going out in them, these are my dream pair of pants. I must agree with others who mentioned the terrible smell (somewhere between mothballs and gasoline) which has not left despite 3 washings which is why I gave 4 stars, not 5. The waffle overalls are cute from the front, but quite frumpy from the back. Also 4 stars. Hopefully with a blazer or cardigan this will improve. But they are rather comfortable too. I wouldn’t purchase the overalls again, but would definitely purchase another pair of the high waisted wide leg jeans. I’m 5 2” and about 115 lbs. I got the XS petite. Good fit!", "rating": 4}, {"title": "Return Policy", "text": "I really like your clothes but not all items fit the same so I feel that you should have a better return policy if you want repeat customers. ", "rating": 4}, {"title": "Worth the Wait", "text": "I love the 2 items I purchased, these pants are unbelievably comfortable.  As an impatient person, I wish the delivery was quicker.  But, it was what I expected and worth the wait!", "rating": 4}, {"title": "It’s a nice fabric but I thought it would be thicker ", "text": "It’s a nice fabric but bonnet than expected. It is so long.  I like it but I have to gather the material to make it better.  On the positive … at least I can to make it shorter.  The boatneck is very flattering.  It will be good when I need a long dress", "rating": 4}, {"title": "Comfy and nice feel. ", "text": "I bought navy and green. Love the material and the fit!  Only drawback is there’s no tummy support. I’m 5’3 /120lbs fairly fit but I’ve had kids and have a “pouch” and I feel like I need to cover that as the pants aren’t flattering on the tummy.   ", "rating": 4}, {"title": "My first purchase at Halara were the…", "text": "My first purchase at Halara were the wider leg leggings.  I bought one pair and quickly bought a second pair.  then I purchased the blazer with the gold tone buttons and either side (in the cream color).  I loved it and bought another in dark blue.  I recommend ironing the blazer to make it look 'fresh'.  ", "rating": 4}, {"title": "Easy to order", "text": "Easy to order, good quality product. Unfortunately, I'll need to return because of fit. Not sure how that's going to go. ", "rating": 4}, {"title": "I absolutely loved my order..the only…", "text": "I absolutely loved my order..the only problem was it took over a month to get it and I had to contact the company..once I contacted them, they were quick to respond and immediately resolved the problem and had another order sent to me..it came very quickly..I was very satisfied with my clothes...I will definitely order again..", "rating": 4}, {"title": "The only complaint is POCKETS!", "text": "The only complaint is POCKETS!! The clothing is so well made but why not put real front pockets in all your pants! Its what us girlies really want. ", "rating": 4}, {"title": "Really like halara’s clothing as I was…", "text": "Really like halara’s clothing as I was able to find what I was looking for. Some of the clothing is a little tight in sizes that I would normally wear. ", "rating": 4}, {"title": "Easy shopping experience", "text": "Easy shopping experience, although I’m 5’4” and should have gone with the petite size rather than regular, which is what the sizing guide said to do. The pants are just a little too long.", "rating": 4}, {"title": "Really pleased with my leggings", "text": "Really pleased with my leggings.  So comfortable. I had a little problem with the stitching below the zip. After wearing for 2 hours, sitting down driving a hole appeared.  Not too much of a problem as I can repair it. (I'm not fat).", "rating": 4}, {"title": "Woulda had 5 stars if the top didn’t…", "text": "Woulda had 5 stars if the top didn’t roll down so badly! Anytime I sit down the top rolls down almost all the way! Other than that they fit perfectly! ", "rating": 4}, {"title": "I ordered the flex denim flared jeans…", "text": "I ordered the flex denim flared jeans and they fit oddly .. i did a return and got a credit to use but did not have to return the jeans.. this was odd but i cannot complain except that i now have jeans that don't fit .. ", "rating": 4}, {"title": "Shipping time a bit long but good product", "text": "I took a pair of ribbed velvet pants and two jerseys... the pants faithful to the description, comfortable and the same color as the one in the photo... the knits are cute and comfortable... the only flaw is the delivery times a bit long... but the positive thing is that the items were as described anyway.", "rating": 4}, {"title": "Not Perfect- Just OK", "text": "Actually- I wanted to order a plus size- not in stock and has been for quite awhile  shipping could be faster and there was no tracking on my order  ", "rating": 4}, {"title": "LOVE", "text": "I’m always satisfied with this brand clothing! So comfy, complements my style and so affordable! ", "rating": 4}, {"title": "i love my purchase but 1 pair of jeans…", "text": "i love my purchase but 1 pair of jeans has a hitch in them. Not sure how to go about doing a return or exchange. The other pair are great! They both are amazing and feel very comfy. ", "rating": 4}, {"title": "Great fast service to Canada", "text": "Great fast service to Canada. I got two pairs of pants and one was too long. They have a surprisingly fair exchange policy. But you can’t get a refund unless you pay to send it back to China, I think. The other item fit well, they are focussed on comfort, so mission accomplished.", "rating": 4}, {"title": "So soft and well made", "text": "It took a while to get my order buy I love the fit and quality. I was going to order a size larger but I am glad I trusted the size chart!", "rating": 4}, {"title": "Very comfortable material", "text": "Very comfortable material. Elastic band too high so it actually highlights the area you would like to compress, just below it. Otherwise, comfortable and looking like real jeans. ", "rating": 4}, {"title": "Loved my wide leg pants", "text": "Loved my wide leg pants! Clothing feels high quality, great customer service. ", "rating": 4}, {"title": "Overall good", "text": "Overall good. 1 star knocked off only because it’s slower delivery than some other brands but expectations were set after ordering. ", "rating": 4}, {"title": "I recieved 2 pairs of the pants", "text": "I recieved 2 pairs of the pants.  They both fit very well.  My only drawback is I am a plus size woman, but I have short legs.  I couldn't order them in the petite size.  I am definitely planning to purchase a couple more pairs.", "rating": 4}, {"title": "I love my Halara pants", "text": "I love my Halara pants I just wish there were more 3x/4x options and the special promotions/deals included those sizes.", "rating": 4}, {"title": "Customer service is easy to contact", "text": "Customer service is easy to contact. Helpful.   Pants are cute but I don’t live the material.", "rating": 4}, {"title": "Same pants, different material ", "text": "I bought the exact same pants, just a size smaller, and they are made from different material. I still like them but wanted the same soft material.", "rating": 4}, {"title": "Good value", "text": "Fabric nice and good customer service, but could use a pocket on shorts, skirt.  Long length pants good with flats for a long-legged lady, but not long enough for heels.", "rating": 4}, {"title": "the fit is always great !", "text": "I love everything I have bought from Halara thus far, the fit is Excellent. However the shipping is long, it takes a long time to receive anything ", "rating": 4}, {"title": "I love my soft yoga type pants", "text": "I love my soft yoga type pants. I'm not crazy about the cargo pants, though. The fabric isn't soft, and the waistband elastic is uncomfortable", "rating": 4}, {"title": "These silver leggings are lovely and…", "text": "These silver leggings are lovely and stretchy unlike the denim ones", "rating": 4}, {"title": "Amazing product!", "text": "Amazing product!! Quicker delivery would have been great but the pants were worth the wait.", "rating": 4}, {"title": "Bought as a Christmas present so not…", "text": "Bought as a Christmas present so not given or used yet. Delivery was quick ", "rating": 4}, {"title": "Absolutely love the jeans", "text": "Absolutely love the jeans.  My four stars would be 5 if you offered any of the plus size bottoms in a petite length.   ", "rating": 4}, {"title": "My only complaint is that these high…", "text": "My only complaint is that these high waist, tummy control leggings DO roll down. I had to mess with them all day! Other than that, they are great. Love the feel and the pockets. ", "rating": 4}, {"title": "Nice...but", "text": "Nice...but, I did buy the joggers and they already have a hole in the private area. I have worn them once. My daughter also bought a pair of leggins, same issue. I have not worn my actual leggins yet, so I will keep you posted. ", "rating": 4}, {"title": "The pants are incredible", "text": "The pants are incredible, the description and size is correct.The only downside is shipping takes longer then expect.", "rating": 4}, {"title": "I absolutely loved what I ordered", "text": "I absolutely loved what I ordered. Material is lovely. Fit great!", "rating": 4}, {"title": "Love them ", "text": "I love the way my medium black pair fit but the grey ones said medium but fit more like a small. And I would give a higher score if it wouldn't have taken over a week to get.", "rating": 4}, {"title": "The leggings are great", "text": "The leggings are great, they just roll down on me, but they are comfortable, and feel like butter ", "rating": 4}, {"title": "Clothes are good", "text": "Clothes are good, the mark down was because the unpredictable delivery time, my friend got her delivery nearly two weeks before me", "rating": 4}, {"title": "The cargo leggings are my all time favorite. ", "text": "Love the Halara cargo leggings so much! They fit perfectly and the color and design make these my favorite leggings. It did take a really long time to receive the leggings so I took away one star for that. ", "rating": 4}, {"title": "Soft and comfortable", "text": "I am a size 16 (190 pounds) and these pants are a great fit, so soft and comfortable. Being a size 16 and only 5 feet, it’s hard for me to find pants that fit. Even though I got the petite, they are still a little long on me but when I cuff them in once, they are the perfect length with flats. Will defiantly order again!! ", "rating": 4}, {"title": "Shipping takes long, bad return policy ", "text": "Shipping takes long, and the return policy is not good, we have to pay for return, not fair to the customer. ", "rating": 4}, {"title": "they weren't the pants I was wanting…", "text": "they weren't the pants I was wanting but they worked I need pants with more pockets so I could put my phone and keys in", "rating": 4}, {"title": "Takes a long time to deliver", "text": "Takes a long time to deliver, but so far pleased with product, good fit, but time will tell if quality good. ( wash and wear ) over time. ", "rating": 4}, {"title": "I’ve ordered two times both jeans", "text": "I’ve ordered two times both jeans. The jeans fit and feel perfect. I gave it 4 stars because of the lengthy shipping. The jeans are 5 star. I look forward to ordering more clothes.", "rating": 4}, {"title": "I wish all your pants came in petite", "text": "I wish all your pants came in petite. The sewing places in this town are minimal and for us short girls, we may have to waits weeks or even months to get pants hemmed. Otherwise, so far happy with pants!", "rating": 4}, {"title": "Recommend ", "text": "Received my order and these pants look really nice. Ordered two more pairs but ordered a shorter size. They run a bit long.", "rating": 4}, {"title": "Love the jeans and tops", "text": "Love the jeans and tops!  Great prices too. The only thing that kept me from giving a 5- star review was the fact that it took a while to arrive.", "rating": 4}, {"title": "Great product very good quality true fit", "text": "I made a mistake on my order and they corrected it for me without a problem. Thank you so much for your customer service. ", "rating": 4}, {"title": "Fits grea", "text": "Fits great but it rolls down when I bend over lol other then that comfy.", "rating": 4}, {"title": "Fine overall ", "text": "The fabric was a bit thinner than I anticipated. Overall, I like the leggings, but I’m not a fan of the seam up the butt crack. ", "rating": 4}, {"title": "Shopping experience was great", "text": "My shopping experience was great. The dress pants and shirt are super cute and fit great. I received my items in about two weeks. ", "rating": 4}, {"title": "Ordering was easy", "text": "Ordering was easy, but many items were not available in needed sizes", "rating": 4}, {"title": "I absolutely love these pants", "text": "I absolutely love these pants! The only negative is that they have a very strong chemical smell even after a few washes. ", "rating": 4}, {"title": "Surprised at the high quality of goods", "text": "Surprised at the high quality of goods. Only downside is they take a while to be delivered.", "rating": 4}, {"title": "The material is a amazing and the fit…", "text": "The material is a amazing and the fit is nice.  For a curve 12-14 size I would go XL very tight around the waist.", "rating": 4}, {"title": "The fit was great for the dress pants and jeans.", "text": "All items purchased were well made and the dress pants are suitable for work. There will be more coworkers ordering from Halara.", "rating": 4}, {"title": "Previous orders were long delayed", "text": "Previous orders were long delayed, but the most recent order was great, came very fast. Love the pants!", "rating": 4}, {"title": "I fought with the popups", "text": "I fought with the popups.  I am scared that , l8ke some online businesses, now you have my email you will punish me by sending dozens of emails.", "rating": 4}, {"title": "This is my 2nd time purchasing this…", "text": "This is my 2nd time purchasing this design it was a really comfortable and great design I really like it.", "rating": 4}, {"title": "I wish it came quicker and returns…", "text": "I wish it came quicker and returns and/or exchanges weren’t such a bear. But I do love these pants!", "rating": 4}, {"title": "Wide legged jeans…", "text": "Great fit and get lots of compliments when I wear my wide legged trousers 😄", "rating": 4}, {"title": "I like the leggings", "text": "I like the leggings.  But I was disappointed in the shallow cargo pockets.  I was hoping to use them to carry my phone, but they are too small.", "rating": 4}, {"title": "Happy ", "text": "I think the company is doing great I love all the Halara products I've bought. ", "rating": 4}, {"title": "Clothes were ok", "text": "Clothes were ok, not as expected. Disappointed that there is no free returns.", "rating": 4}, {"title": "Great for tall ladies", "text": "Pleased with my jeans. Feel so light weight and comfy. I am size18/20, 5ft10 so got 2xl. Great fit. However they did take 2 weeks to arrive. ", "rating": 4}, {"title": "The product is in good condition and…", "text": "The product is in good condition and the description on the website was quite accurate.", "rating": 4}, {"title": "Fit well", "text": "no issues, fitted well, good length for a small person", "rating": 4}, {"title": "These pants are quite nice but very…", "text": "These pants are quite nice but very long.I had a terrible time getting the hem stitching out to rehem.  Next time I mat try ordering petite.", "rating": 4}, {"title": "Good items", "text": "Good items, fit to size. However, the process of shipping is very slow.", "rating": 4}, {"title": "Great Quality and fit", "text": "Great Quality and fit.  Delivery takes awhile.", "rating": 4}, {"title": "Not everything was available in plus…", "text": "Not everything was available in plus sizes especially skirts which is odd.", "rating": 4}, {"title": "Comfortable", "text": "The products I ordered fit well and were pretty much as I expected. I did think that the weight of the fabric might be a little heavier.", "rating": 4}, {"title": "The pants I received weren't for me", "text": "The pants I received weren't for me. Customer service made it right. ", "rating": 4}, {"title": "Jeans", "text": "The jeans are very comfortable and the material is soft. I just wish they came in petite! ", "rating": 4}, {"title": "Love the products", "text": "Love the products, they are my new favorite jeans!!! 4 stars bc shipping is a little slow. ", "rating": 4}, {"title": "Great trousers, want more choice of lengths in plus sizes.", "text": "I love the trousers I've bought, 3 pairs over time. The only wish I have is that more of the plus sizes had choice of lengths - short, regular and long.", "rating": 4}, {"title": "I love the jeans and overalls", "text": "I love the jeans and overalls.  The material is light and flexible.  I did not expect it to take over a month to arrive.  But it’s worth the wait. ", "rating": 4}, {"title": "Good product/ LONG WAIT", "text": "Leggins are nice & soft. Could definitely be a little thicker. Too nearly a month to receive them.", "rating": 4}, {"title": "great product reasonably priced", "text": "great product reasonably priced - only issue is shipping time ", "rating": 4}, {"title": "Good products", "text": "Good products. Sometimes size variations are a little deceiving ", "rating": 4}, {"title": "Love the stuff", "text": "Love the stuff, but I am short and I have to keep chopping off the legs!! Petite sizes would be awesome! ", "rating": 4}, {"title": "Great service, more petites options please ", "text": "Great service.  Hoping for more petit options in the future", "rating": 4}, {"title": "I like the quality of the pants", "text": "I like the quality of the pants, all the way up to the buttons. The buttons are poorly sewn on and are not snap ons as the look to be", "rating": 4}, {"title": "Helpful customer service", "text": "I was not too sure about the trousers I ordered as the fitting wasn’t all that, however whilst making the returns the customer service team was extremely helpful and I received vouchers to make a further purchase that I’ll hopefully be more satisfied with ", "rating": 4}, {"title": "great quality but no return if discount used", "text": "it was essy to purchase. the clothes are good qualitybut it was my first purchase and I was worried it would not fit. it said I could not return them. so I dont like that. ", "rating": 4}, {"title": "Once again", "text": "Once again, with the exception of the shipping time - and tracking MIS-information - the products are nice!", "rating": 4}, {"title": "Loved my purchase (jeans)", "text": "Loved my purchase (jeans)Only complaint, took forever to get them.", "rating": 4}, {"title": "Love everything I ordered", "text": "Love everything I ordered! My only complaint would be how long it takes to ship.   I ordered pants & joggers & love them all!!", "rating": 4}, {"title": "Shipping was more or less quick", "text": "Shipping was more or less quick. And the clothing fits to size as stated. ", "rating": 4}, {"title": "So far I love 3pairs I bought the only…", "text": "So far I love 3pairs I bought the only thing is the pants are way too long. It cost me $45.00 dollars to have them hemmed. Also I just bought the jeans my size did not fit. For me too return them I have to pay shipping costs.", "rating": 4}, {"title": "I love the product I just don’t like…", "text": "I love the product I just don’t like having to wait so long to get it! If you can get a warehouse in the US that might help so much! ", "rating": 4}, {"title": "quality was great", "text": "quality was great, product arrived quickly.Only thing didn't like was the price", "rating": 4}, {"title": "Love the pants", "text": "Love the pants. The fit and quality are great. It takes a few weeks to get the order but as long as you are patient, these pants are worth the wait. ", "rating": 4}, {"title": "Timely delivery", "text": "Timely delivery, easy to order. Love the clothes and fit of pants and skirts.", "rating": 4}, {"title": "WAY too long", "text": "WAY too long! Otherwise fit is good. Comfy. Love the stretch. ", "rating": 4}, {"title": "Items as described", "text": "Items as described. Good fit. Reliable delivery", "rating": 4}, {"title": "Size was too big", "text": "Although there was no number to call.   Returning the wrong size was easy.", "rating": 4}, {"title": "Good quality", "text": "Good quality. The delivery to Norway takes time. It's ok, but little sad when you want the clothes 🤗🤗", "rating": 4}, {"title": "Shopping easy had what I wanted in…", "text": "Shopping easy had what I wanted in stock! The only thing is that shipping takes a little bit long", "rating": 4}, {"title": "The pants were delivered fast", "text": "The pants were delivered fast. They are comfortable", "rating": 4}, {"title": "Bought my first pair and I love them", "text": "Bought my first pair and I love them! I wish the delivery time was a bit quicker though! Only complaint! ", "rating": 4}, {"title": "The pants are very comfortable and…", "text": "The pants are very comfortable and lightweight for the summer ", "rating": 4}, {"title": "I like my tights ☺️ best tights I have…", "text": "I like my tights ☺️ best tights I have gotten. Make sure to get your size. Because they do snatched you lol. ", "rating": 4}, {"title": "Customer service is great and the…", "text": "Customer service is great and the quality of the  clothing is great. ", "rating": 4}, {"title": "I love your product an how easy it is…", "text": "I love your product an how easy it is to order an how fast to receive my items", "rating": 4}, {"title": "I really like these pants", "text": "I really like these pants. Super comfy and the color is nice!", "rating": 4}, {"title": "That there are no returns", "text": "Excellent product, but they do not except returns ", "rating": 4}, {"title": "Order does take some time to get to Canada", "text": "Great product, easy ordering system. ", "rating": 4}, {"title": "Very impressed with the fit of the…", "text": "Very impressed with the fit of the trousers, they are lovely. ", "rating": 4}, {"title": "Comfortable Pants ", "text": "The pants ordered are comfortable.  I will order again from Halara.  ", "rating": 4}, {"title": "The leggings are super cute and fit…", "text": "The leggings are super cute and fit perfectly. ", "rating": 4}, {"title": "I would go one size up if you don't…", "text": "I would go one size up if you don't want these pants to fit like leggings.", "rating": 4}, {"title": "Delivery ", "text": "Took about 10 days to get to rural Alberta ", "rating": 4}, {"title": "The easy way to order and the quickness…", "text": "The easy way to order and the quickness of the arrival.", "rating": 4}, {"title": "The jeans are cute but don’t worry for…", "text": "The jeans are cute but don’t worry for me. How do I return these?", "rating": 4}, {"title": "Too long for delivery", "text": "The product is great, but it took a long time to be delivered.  When your used to 1-3 days from Amazon, it seemed to take forever", "rating": 4}, {"title": "Quality is good ", "text": "The quality was good and it mixed with the hair very well ", "rating": 4}, {"title": "Nice quality but pockets not deep…", "text": "Nice quality but pockets not deep enough.", "rating": 4}, {"title": "Repeat customer…", "text": "Love the products but shipping times could be more clear. ", "rating": 4}, {"title": "The quality is not what I expected.", "text": "Date of experience: October 24, 2024", "rating": 4}, {"title": "Straight forward shopping.", "text": "Date of experience: November 05, 2024", "rating": 4}, {"title": "Great but slow shipping", "text": "Loved what I purchased but lord it took two moons to get here.", "rating": 4}, {"title": "They got here in a few weeks.", "text": "They got here in a few weeks.. not as slow as others were saying and they’re cute!", "rating": 4}, {"title": "Everything was good", "text": "Everything was goodOnly the shipping was very slow, it took almost a month…", "rating": 4}, {"title": "Nice quality", "text": "Nice quality ", "rating": 4}, {"title": "I was pleased with the products I got", "text": "I was pleased with the products I got.  They did take a bit to arrive.  Thanks", "rating": 4}, {"title": "Great quality", "text": "Date of experience: October 28, 2024", "rating": 4}, {"title": "Little too big", "text": "It was good but the sizing was a little off ", "rating": 4}, {"title": "Quality of clothing is really good", "text": "Date of experience: October 23, 2024", "rating": 4}, {"title": "The produkts are true to description", "text": "The produkts are true to description. Really good!", "rating": 4}, {"title": "Very happy with my shopping!", "text": "Date of experience: November 05, 2024", "rating": 4}, {"title": "Great fit", "text": "Very soft material. Nice pants", "rating": 4}, {"title": "Quick delivery", "text": "Quick delivery.  Happy with product.", "rating": 4}, {"title": "Really comfortable pants", "text": "Really comfortable pants. Would recommend ", "rating": 4}, {"title": "I really like their clothes", "text": "I really like their clothes, but shipping is slow.", "rating": 4}, {"title": "Just ok", "text": "It was fine. The quality of clothing is ok.", "rating": 4}, {"title": "Fab leggings", "text": "Fab leggings, only negative was delivery time ", "rating": 4}, {"title": "Great pants!!!", "text": "Great pants!!!! Just took almost a month to get but worth the wait :)", "rating": 4}, {"title": "The fit was not good", "text": "The fit was not good, but Halara dealt with the issue well", "rating": 4}, {"title": "Great work pants", "text": "Great work pants, but I exchanged them for the longer length.", "rating": 4}, {"title": "I didn’t like my pants and you sent me…", "text": "I didn’t like my pants and you sent me a credit", "rating": 4}, {"title": "New wide leg jeans!", "text": "Wait time for arrival was one month!", "rating": 4}, {"title": "Nice leggings", "text": "Nice leggings, snag easy though. 😌", "rating": 4}, {"title": "Product was great", "text": "Product was great, shipping took way too long", "rating": 4}, {"title": "Pants", "text": "Lots of pockets", "rating": 4}, {"title": "Love the clothing & fit well.", "text": "Date of experience: November 03, 2024", "rating": 4}, {"title": "Nice product got it quicker than I…", "text": "Nice product got it quicker than I thought", "rating": 4}, {"title": "Be prepared to wait", "text": "Great product but took too long getting here ", "rating": 4}, {"title": "I love the way the jeans fit", "text": "I love the way the jeans fit.  I just wish the shipping was faster!", "rating": 4}, {"title": "Every purchase ❤️", "text": "Date of experience: October 31, 2024", "rating": 4}, {"title": "Nice quality.", "text": "Nice quality. ", "rating": 4}, {"title": "Pants", "text": "Delivered on time.", "rating": 4}, {"title": "Great smooth n right size for my Ling legs", "text": "Good quality Right height as am a tall girl", "rating": 4}, {"title": "Good quality product.", "text": "Date of experience: October 31, 2024", "rating": 4}, {"title": "I love the stretch and feel of the pants", "text": "Date of experience: October 27, 2024", "rating": 4}, {"title": "Super fit", "text": "Super fit, super bequem! ", "rating": 4}, {"title": "Size", "text": "I wish I got a size bigger! ", "rating": 4}, {"title": "Quick and good products", "text": "Date of experience: November 04, 2024", "rating": 4}, {"title": "Very pleased with all", "text": "Date of experience: November 02, 2024", "rating": 4}, {"title": "Great product", "text": "Date of experience: November 04, 2024", "rating": 4}, {"title": "Good experience", "text": "Good experience ", "rating": 4}, {"title": "Very efficient!", "text": "Date of experience: October 30, 2024", "rating": 4}, {"title": "Satisfied with my order.👍", "text": "Date of experience: October 28, 2024", "rating": 4}, {"title": "Great pants", "text": "I have 4 pair of pants. Different colours but 3 of them have different top and pocket. The two I just received are snugger in the waist. I always order M regular length. The material is great never pills. They wash nicely and hang to dry. They also don't stretch after wear or bag at the knees. Just wish you would show the front and back of your styles not just side view", "rating": 4}, {"title": "comfortable and great sizing", "text": "Happy with my purchases, 2 denim jeans and denim skirt.Lightweight fabric perfect for warm weather.I gave 4* as I had to wait longer than i anticipated for my goods to be delivered.This was because one item was a pre-order so it holds every part of the order upI am not tall so having petite option made these fit without any adjustment required", "rating": 4}, {"title": "I love the quality of the clothes", "text": "I love the quality of the clothes. However, I am 4ft 11in so the petite was still long.  ", "rating": 4}, {"title": "Beautiful trousers, will buy more!", "text": "The website via Facebook was a little annoying and the delivery a bit slower than I would have thought but the quality of the trousers I ordered is wonderful! I would happily order again. ", "rating": 4}, {"title": "Slow shipping times.", "text": "Slow shipping times.  ", "rating": 4}, {"title": "I got a good quality one I love it so…", "text": "I got a good quality one I love it so much.", "rating": 4}, {"title": "I love the jeans I got but they are WAY…", "text": "I love the jeans I got but they are WAY too long for me. I’m 5’5. This is mind blowing g to me, seeing that the average North American woman is 5’4. ", "rating": 4}, {"title": "When I needed to return for another…", "text": "When I needed to return for another size, customer service was quick, helpful and knowledgeable.", "rating": 4}, {"title": "Nice clothes", "text": "Nice clothes, relatively cheap. I’m happy with my purchases. ", "rating": 4}, {"title": "I'm impressed overall.  But size was inconsistent.", "text": "I'm impressed with how flattering, comfortable and dressy looking the pants are.  I bought one style in a small, and a few months later bought same style different colour, but the smaller was significantly smaller (2 inches comparing waistbands).Also, not a recommended fabric for humid summer climate.", "rating": 4}, {"title": "Better than expected", "text": "Delivery was pretty quick. I picked up three pairs of pants, two styles but I got two colors in one of the styles. Very comfortable even more stylish. I don’t love the cut on one pair of pants but I think I’ll still get some use out them. ", "rating": 4}, {"title": "Pants fit great", "text": "Pants fit great! They are very comfortable and soft. And easy to move around in. Only complaint I have is the button does not feel very secure. But so far I have worn them a few times and it has stayed in place.", "rating": 4}, {"title": "These pants are actually fantastic quality", "text": "These pants are fantastic quality! I was so grateful for the long length… Sadly, the XL was quite generous, so I am having them altered…With the new length options, I would suggest these are true to size. No need to size up as a North American body type. ", "rating": 4}, {"title": "2 of my 3 pairs of pants were awesome!", "text": "2 of my 3 pairs of pants were awesome! ", "rating": 4}, {"title": "The pants are good but run big", "text": "The pants looks good but run big for the size so may I can give to someone that can fit better because I read de return policy and I have to pay for the shipping ", "rating": 4}, {"title": "Jeans fabulous ", "text": "Jeans fabulous Wish they could have been delivered quicker", "rating": 4}, {"title": "I always love everything I get from…", "text": "I always love everything I get from Halara. I had one pair of jeans though that had a pull in the leg and it takes too long to send everything back and get replacements. Delivery just takes pretty long with Halara. Also, prices are a bit high", "rating": 4}, {"title": "Great pants", "text": "Great pants. Very comfy. Easy and convenient website", "rating": 4}, {"title": "Just love the way they fit me", "text": "Just love the way they fit me.  The price is great. Love the colors. I have many pairs now. ", "rating": 4}, {"title": "Received package earlier than…", "text": "Received package earlier than anticipated. Clothes fit true to size. Overall a good experience.", "rating": 4}, {"title": "Nice pants", "text": "Nice pantsJust longer than expected even when I order a Petit size ", "rating": 4}, {"title": "Die Jeggings sind superbequem", "text": "Date of experience: October 29, 2024", "rating": 4}, {"title": "exactly as advertised", "text": "exactly as advertised, which is exceptionally rare these days. Will be buying again :)", "rating": 4}, {"title": "The website needs help for easier login…", "text": "The website needs help for easier login and returns.", "rating": 4}, {"title": "The jumpsuit is as expected", "text": "The jumpsuit is as expected, comfortable and really cute. Unfortunately it is also way too long so even if I'm 5'8\" the tall one will have you be adjusted and the seems redone... I could have taken the regular lenght... but the size Médium is thrue to fit. I'll be more carefull next time if I buy again.Thank you", "rating": 4}, {"title": "Love love the jeans", "text": "Love love the jeans, wish it was faster delivery. ", "rating": 4}, {"title": "Dress is beautifully made", "text": "Date of experience: October 19, 2024", "rating": 4}, {"title": "Great pants", "text": "I love the pantscomfy and fit great. Only problem not enough colors in petite size.", "rating": 4}, {"title": "Shipping/delivery takes some time", "text": "I loved the quickness of my return.  Shipping takes longer than I would like.  Also, it was very hard to find the return option.  When I clicked it, it said that I had to wait for my items to be delivered-and they had been.  I had to chat with someone to finally get it cleared so that I could initiate a return and get my new order on the way.  ", "rating": 4}, {"title": "Overalls nice, shirts not so much", "text": "I ordered twice, first two adjustable strap overalls, the second order included another overall (because I like them so much - they're cute, comfy and flattering) and two Henley shirts. The shirts were very disappointing. According to the description they are \"ribbed\". They are not. They are extremely see-through. You can't tell from the pictures. I can only use them as a layer underneath something else, because they're so sheer. ", "rating": 4}, {"title": "I love the jeans I ordered", "text": "I love the jeans I ordered.  Style was good with reasonable price.  The only thing that prevent me from ordering more is the shipping time. I'm spoiled by Amazon 2 days shipping.  ", "rating": 4}, {"title": "Love the outfits and material", "text": "Love the outfits and material. It is priced right given the quality of material and I do buy often. I wish it didn’t take as long, but will continue to shop here", "rating": 4}, {"title": "Good", "text": "They’re great. Customers services are nice and responsive. I didn’t order the correct size. Hopefully it’s successful second time around. Look forward to it. ", "rating": 4}, {"title": "Surprised by how good thet are…", "text": "The ad for the these jeans was really starting to piss me  off as it was in my social media feed constantly. However it worked, I caved and bought them. Wow!! I'm a curvy 14 so was undecided between the M & L, opted for the M (12-14) and they fit beautifully because of the stretch, yet don't look stretched. Very comfortable. Not exactly flattering around the tummy are, but the leg style is flattering and I cover the tummy with a T-shirt or jumper. Quite thin jegging material rather than denim so not particularly warm, and I don't know how long they will last, but I will likely end up buying more. ", "rating": 4}, {"title": "I loved her so much I fail to check all…", "text": "I loved her so much I fail to check all the details, the belted waist was not to my liking. I can live with it tho, I prefer a straight line", "rating": 4}, {"title": "Not as expected ", "text": "Tighter through the waist than I was led to believe by the size measurements. 🫤", "rating": 4}, {"title": "The color and the fabric were same as…", "text": "The color and the fabric were same as pictures and description but the size was a little bigger than I expected ", "rating": 4}, {"title": "Great communication and speedy delivery…", "text": "Great communication and speedy delivery 😊", "rating": 4}, {"title": "Your product is great but you need to…", "text": "Your product is great but you need to improve on your shipping method from China.", "rating": 4}, {"title": "Good fit", "text": "Good fit, nice fabric", "rating": 4}, {"title": "Fast delivery", "text": "Date of experience: October 29, 2024", "rating": 4}, {"title": "The order took over 2 weeks to arrive", "text": "The order took over 2 weeks to arrive, and the fabric quality was a little dissappointing.", "rating": 4}, {"title": "Great product", "text": "Love the product but it took quite a while to receive.", "rating": 4}, {"title": "Love all the products", "text": "Love all the products.   The items came within a reasonable time.   The updates on tracking were a little behind.", "rating": 4}, {"title": "Side zipper a problem", "text": "I purchased two pairs of pants from Halara on Instagram. The purchase was easy and the pants arrived in maybe about a week. No issues there. The pants themselves are quality fabric and construction but the side zipper on this particular style are very hard to zip. You need an extra hand to hold the bottom of the zipper while holding the top closed and pulling up the zipper. I had to get my husband to help me. I bought the pants for work and they're really cute but I haven't worn them because I'm afraid I won't be able to zip them by myself. I may try putting a hook and eye at the top to close the pants freeing up hands to hold and pull the zipper. The pants themselves are very cute with a side tie and wrap on one side.", "rating": 4}, {"title": "The arriving of your products takes…", "text": "The arriving of your products takes forever !!!", "rating": 4}, {"title": "Love the texture and feel of these…", "text": "Love the texture and feel of these jeans! I do wish the black pair that I ordered were more like a black denim than a black pull on pant. I ordered the petite but I'll still have to wear a heel or boot. I'm 5'3\"The flare might be a little \"too much\" for me?But, love Halara and the quality of their clothing and will continue to purchase other items ", "rating": 4}, {"title": "Easy to use website and delivery was…", "text": "Easy to use website and delivery was pretty quick considering how far my package travelled. ", "rating": 4}, {"title": "Great clothing", "text": "Great clothing. Sizing has been great on all but a couple of items. Only downfall is shipping is super slow. All my orders have taken between 3-4 weeks. ", "rating": 4}, {"title": "The pants i got are awesome.", "text": "The pants i got are awesome. ", "rating": 4}, {"title": "It was super cute", "text": "It was super cute! A bit small so I hope the return is not hard to do!", "rating": 4}, {"title": "Rec’d items timely and as described.", "text": "Date of experience: October 22, 2024", "rating": 4}, {"title": "Great fit and comfortable pants.", "text": "Date of experience: October 21, 2024", "rating": 4}, {"title": "If I could rate the product", "text": "If I could rate the product, it is typically a 5 star but the shipping times….less than 1 star! My order took weeks to come in!!", "rating": 4}, {"title": "I love the material of the shirts I…", "text": "I love the material of the shirts I got, and the quality.  It was exactly what I was looking and hoping for.  However, I did find that it took a little while before receiving it in the mail.", "rating": 4}, {"title": "Love the styles", "text": "Love the styles.  Quick delivery as well.", "rating": 4}, {"title": "Good experience ", "text": "Date of experience: October 21, 2024", "rating": 4}, {"title": "Adorable workout tops.", "text": "Workout tops are adorable, however it did take a while to receive items.", "rating": 4}, {"title": "Love the clothing from here", "text": "Love the clothing from here. Kind of longer to receive than expected but. It's so pretty. ", "rating": 4}, {"title": "The product was great", "text": "The product was great, but I give a 4 star because the delivery time was not timely at all. I think it took 4 to 5 weeks for me to receive my product and I felt like that was excessive. Again, the product was great!! ", "rating": 4}, {"title": "Comfortable ", "text": "Comfortable, affordable. Pockets more for look then function.", "rating": 4}, {"title": "Happy ", "text": "The clothes are great. They are very comfortable and look great. The only reason I didn't give 5 stars is because of the time between ordering and receiving my order. Approx 1 month last time. ", "rating": 4}, {"title": "Very nice jacket", "text": "Very nice jacket, quite in the large side . I got a medium , I’m a size 10/12 and 5ft 9", "rating": 4}, {"title": "Everything is very good and customer…", "text": "Everything is very good and customer service excellent. The only drawback is the distance things have to come from. It takes time! ", "rating": 4}, {"title": "trustworthy seller", "text": "Fast shipping, optimal product quality and pretty good customer service", "rating": 4}, {"title": "Great Quality", "text": "Both pairs of trousers are great quality and fit perfectly. They did take a while to get here but defintely worth the wait.", "rating": 4}, {"title": "Long Shipping Time", "text": "The pants are wonderful and so comfortable.  The only negative comment would be that it took quite a while to receive them.", "rating": 4}, {"title": "nice pants", "text": "nice pants! verry comfortable. not so vast delivery but love the items!", "rating": 4}, {"title": "Overpriced but comfortable", "text": "Date of experience: October 28, 2024", "rating": 4}, {"title": "Good quality.", "text": "Eaze of purchase", "rating": 4}, {"title": "Fits so good", "text": "Date of experience: October 28, 2024", "rating": 4}, {"title": "Love the styles and super comfy.", "text": "Love the styles that I picked and I have re-ordered in different colors. They are super comfy and look great on. I use them for the office w/a nice shirt and a jacket. The only reason I didn't give it 5 stars is because the sizes are not consistent. I've ordered 4 of the same pants in different colors, same size. Two of them were longer and I had to pay to have them hemmed shorter. The other two were perfect.", "rating": 4}, {"title": "So comfortable", "text": "So comfortable ", "rating": 4}, {"title": "Petite", "text": "I dont like the pants I ordered. I am petite and the pants don't look great on me. ", "rating": 4}, {"title": "I love the pants I ordered", "text": "I love the pants I ordered.  It did a while to receive them.  I have placed another order.  My biggest complaint is the CONSTANT messages I get.  I have to keep my phone on at work and the frequent messages can cause issues.  I asked for them to stop but am still receiving them.  If it continues, I will have to delete my app.  I hate to do that because I have ordered 6 items in the past two months. ", "rating": 4}, {"title": "Extreme comfort clothes :)", "text": "Extreme comfort clothes :) ", "rating": 4}, {"title": "Quick delivery of what I ordered so all…", "text": "Quick delivery of what I ordered so all good", "rating": 4}, {"title": "Great website", "text": "Great website. My only criticism is the colour name is not included in the cart descriptions and I'd like to be able to zoom into the photos including to get an idea of the material.", "rating": 4}, {"title": "Cute and comfy", "text": "The button pants I ordered are super comfortable and very flattering. O my downside is having to wait so long for them to arrive. ", "rating": 4}, {"title": "Pretty good", "text": "Pants are thinner than expected but fit well. Delivery was smooth and speedy.", "rating": 4}, {"title": "Product quality was great", "text": "Product quality was great.  Delivery was quick.  I was expecting the pant legs to be a little more tapered at the bottom but overall the size and fit are good. ", "rating": 4}, {"title": "Nice trousers and jeans", "text": "Nice trousers and jeans, i bought 2 pairs, im size uk12 I could do with L, jeanse a bit tight but will keep the M. Trousers a bit too big I could do with S, I did expect thicker jeanse material,but is not, light material for summer spring. Delivery too long to Ireland almost 4 weeks. Overall all good. Thanks!", "rating": 4}, {"title": "Somehow I received a duplicate order", "text": "Somehow I received a duplicate order.  Additionally delivery did not get to my house. The material of the joggers is more like a legging fit ", "rating": 4}, {"title": "Great quality!", "text": "Great quality products and good shipping updates! ", "rating": 4}, {"title": "Pants are very comfortable", "text": "Pants are very comfortable. Fits perfectly.id buy it again.", "rating": 4}, {"title": "No coupon, after it's offered ", "text": "Easy to order. But it didn't let me apply the code for signing up for email, text, alerts. I should have received 25% off my order. ", "rating": 4}, {"title": "Love the amaranth skirt I purchased but…", "text": "Love the amaranth skirt I purchased but the white leggings are see through! Will be returning them for another item.", "rating": 4}, {"title": "Product was great", "text": "Product was great. Point of sale was easy. If I had one critique it would be the shipping time. Still not terrible shipping time. ", "rating": 4}, {"title": "The pants I purchased fit even better…This never happens", "text": "The pants I purchased fit even better than it was claimed. I thought for sure I’d end up sending them back. They are flattering and so so comfortable. They are perfect for travel. I do wish shipping was faster so I could order more before my trip. It’s my only star I took off. The pants are a five. ", "rating": 4}, {"title": "Comfortable but terrible smell ", "text": "Quick shipping, comfortable pants but terrible smell in the material. Not sure I can wear these pants around other people.", "rating": 4}, {"title": "I ordered my 2nd pair of cargo pants in…", "text": "I ordered my 2nd pair of cargo pants in green. Am disappointed because these on have a big seam around the whole leg above the knees on both legs. My black ones I ordered didn't have that. Therefore it makes them too short", "rating": 4}, {"title": "Very pleased with the ordering process", "text": "Very pleased with the ordering process, delivery and returns. Refunded the full amount as I didn’t like what I’d ordered, hence the 4/5. ", "rating": 4}, {"title": "Very nice garments", "text": "Very nice garments, just a pity it takes so long to receive them", "rating": 4}, {"title": "All in all, a good experience", "text": "I found shopping on the app and website easy and fun. I love the clothes especially the jeans. It took awhile for the garments to arrive. I would probably buy from Halara again. Accessing the coupons while placing the order was a challenge. ", "rating": 4}, {"title": "Order times", "text": "It took a really long time.to get my product.", "rating": 4}, {"title": "The product was overall nice with one…", "text": "The product was overall nice with one small exception. The dress had a little “bumps” where the seams are.Shipping was a bit slow.", "rating": 4}, {"title": "First time purchasing from Halara", "text": "First time purchasing from Halara. The pants fit true to size.  I really like them.", "rating": 4}, {"title": "Most everything was great... inconsistency in size though.", "text": "Most everything was great. Ease of navigating the site, ordering, tracking.. However, I ordered 2 of the same size and type of leggings and one pair is shorter in length than the other by about an inch. I'm 5'7\" and 135lbs. I ordered a medium and full length. I wish the one pair didn't come shorter...I would also love more neutral color options because I'm a terribly basic millenial but I get that it's hard to suit everyone's preferences lol. ", "rating": 4}, {"title": "I likd the pants but shipping was slow.", "text": "Date of experience: October 19, 2024", "rating": 4}, {"title": "The shopping experience was great and I…", "text": "The shopping experience was great and I was able to exchange my first item. The second item was not the greatest. I would not be able to use that item to the office -- the intended purpose. ", "rating": 4}, {"title": "Happy with my order!", "text": "The 2 items I ordered arrived in about 2 weeks, both were good quality and fit to size.", "rating": 4}, {"title": "Quality is great but long shipping time from China", "text": "The quality of the items is surprisingly great. I thought Halara would ship from US but I got my tracking info and it said China. A bit disappointing as it took a while to arrive.", "rating": 4}, {"title": "worth the wait. ", "text": "The length of time it took for the products to arrive was much longer than I thought it would be.However the items are both fabulous and I love them ❤️ ", "rating": 4}, {"title": "All good", "text": "All good, just wish my order came a little quicker. Pants are super comfy!", "rating": 4}, {"title": "Sizes werent always available", "text": "Sizes werent always available, so was disappointed in that and the prices were not accurate in CAD or US on what said was on sale but plus sizes were not on sale.", "rating": 4}, {"title": "Loved my items", "text": "Loved my items, but took quite awhile to arrive.", "rating": 4}, {"title": "Nice Skirt, Needs Slight Improvement", "text": "Service was good. Received my item and although it fits fine, it's a bit short.  I ordered a skirt with the shorts underneath and even though there are shorts, it's still a bit short on a taller person, like myself.  Wish there was a slightly longer version.", "rating": 4}, {"title": "Amazing products", "text": "I am obsessed with the joggers and leggings I purchased! Both fit perfectly, keep their shape, wash well, and feel amazing. The price is right. I took away one star only because it takes a couple weeks to received the order.", "rating": 4}, {"title": "Worth the trial", "text": "Easier process to order and return than anticipated with a product coming from China. Very disappointed none of the fabrics or fits worked for me.", "rating": 4}, {"title": "Jeans are great", "text": "Like the jeans and they fit well and they’re really comfortable. Did not care for the joggers. They didn’t fit as well. ", "rating": 4}, {"title": "Slow delivery but it will get to you", "text": "My order took 3 weeks to arrive but I was informed of this when I placed the order. The app is good but the tracking stopped once my order arrived in the UK so I didn't know when it would be delivered. When it did arrive, I was very happy with the quality of the garment and the packaging. Although delivery is slow, I will buy from Halara again. ", "rating": 4}, {"title": "My experience was great", "text": "My experience was great. Wait time a bit slow", "rating": 4}, {"title": "Great selection of pants to choose…", "text": "Great selection of pants to choose from, I wanted a pair of jeans and there was quite a few styles to chose from. In the end I went for two, one wide leg and one narrow. I’m Very happy with my two purchases. Very comfortable, you can wear them all day! I look forward to buying more in the future ", "rating": 4}, {"title": "Good price-quality ratio.", "text": "Good price-quality ratio.Quick reply upon request for return.Given the option to return (but then pay costs) or keep item and get voucher.", "rating": 4}, {"title": "Leggings are very soft and comfortable", "text": "Leggings are very soft and comfortable. 1 star off as I find they roll in the waist, which can get annoying. Tummy control would be better if they didn't roll. Overall keeping and happy with my purchase. ", "rating": 4}, {"title": "You made my exchange easy.", "text": "You made my exchange easy. ", "rating": 4}, {"title": "The product is great and true to size", "text": "The product is great and true to size, but it did seem to take a bit long to receive the items.", "rating": 4}, {"title": "Petite Large", "text": "I like the fabric of the pants but they were  big. I re-ordered a smaller size which fit much better. ", "rating": 4}, {"title": "Need to down size.", "text": "Need to down size. ", "rating": 4}, {"title": "Clothes look like what was advertised", "text": "Clothes look like what was advertised. 4 instead of 5 bc the amount of time to receive my order, though I understand why, as it is explained. I wish the material has a bit more compression. A little too 'loose fitting'.", "rating": 4}, {"title": "Love ", "text": "The fabric and styles are elegant, simple and stylish. ", "rating": 4}, {"title": "Buttery soft and perfect fit!", "text": "The pants all are super soft and fit perfectly!  I’m a med petite and true to size. It was a process with the tracking, and I was able to see it along. But the fit is ideal and the pants are very comfortable.", "rating": 4}, {"title": "Generally really pleased with…", "text": "Generally really pleased with everything that I have ordered, the clothes are lovely material. The first time shipped really quick, unfortunately waited quite a long time for my second order. But I suppose that happens from time to time. Will certainly order more.", "rating": 4}, {"title": "Shipping was slower then I had expected.", "text": "Date of experience: October 25, 2024", "rating": 4}, {"title": "As comfortable as advertised!", "text": "The Reviews and influencers were for real! These trouser pants are just what I was looking for. As a teacher we need clothes that move with us as we run after kids. These are business casual to the best! Inseam options makes them perfect fit. ", "rating": 4}, {"title": "I would have given the trousers a 5…", "text": "I would have given the trousers a 5 star but the button fell off on the first day ", "rating": 4}, {"title": "Great product", "text": "The pants are amazing, but took quite a while to get to me!", "rating": 4}, {"title": "Didn’t know what to expect but was very…", "text": "Didn’t know what to expect but was very pleased with the quality and fit.  I ordered two pair of the straight leg style and plan to order a pair of denim.  Wouldn’t hesitate to recommend these pants.", "rating": 4}, {"title": "Really comfy leggings", "text": "Arrived in good time. Nice leggings but do have a mid thigh seam which seems unnecessary .Otherwise really comfortable. True to size. Great for petite length.", "rating": 4}, {"title": "I ordered pants love them", "text": "I ordered pants and love them they are soft comfortable and decently priced ", "rating": 4}, {"title": "Love the pants", "text": "Love the pants, love the fabric", "rating": 4}, {"title": "Nice products", "text": "Nice products, took a little while to arrive", "rating": 4}, {"title": "purchase is fantastic", "text": "purchase is fantastic, delivery time was not", "rating": 4}, {"title": "COMFY and cute!", "text": "The clothes are ridiculously comfortable. ", "rating": 4}, {"title": "Product sizing ", "text": "Some of the clothes ", "rating": 4}, {"title": "Dress material is very cheap", "text": "Date of experience: October 17, 2024", "rating": 4}, {"title": "Nonrefundable ", "text": "I didn't like the fact that it said non refundable AFTER they were on there way. 2 of the pairs I would return for a bigger size. But I guess I'll make them work.", "rating": 4}, {"title": "The quality was perfect", "text": "The quality was perfect. I got the size 16 in size regular and the fit and stretch was amazing. Only thing was that the shipment took a bit long but overall the quality is 10/10!", "rating": 4}, {"title": "Pet Resistant Works! ", "text": "Products really do work for pet hair resistance! However after one wear I already see pilling/fraying on seams of the pockets. Shipping did take a little longer than I thought as well. ", "rating": 4}, {"title": "The pants are too long", "text": "The pants are too long.  A 29 inch inseam would also help.", "rating": 4}, {"title": "Great quality products", "text": "Great quality products. Long shipping time with no status updates. ", "rating": 4}, {"title": "I love my pants but the shipping time…", "text": "I love my pants but the shipping time was a little long. I’ll definitely be ordering again though! ", "rating": 4}, {"title": "Luv the items I purchased", "text": "Luv the items I purchased, the shipping/delivery time took to long. ", "rating": 4}, {"title": "The pants are so comfy and I received a…", "text": "The pants are so comfy and I received a lot of compliments. The only down fall is how long it took to ship and receive them. ", "rating": 4}, {"title": "Cloth is good.", "text": "Cloth is good. ", "rating": 4}, {"title": "Would buy again. ", "text": "Prices were great. Love the sales and coupons. Items were soft, tall was long enough and fit was great. It took a long time for the items to arrive but other than that it was great. I would buy from your company again. ", "rating": 4}, {"title": "Love these leggings", "text": "Love these leggings.   Just wish they would have came in a little sooner!  May have to go down a size with my weightloss though!", "rating": 4}, {"title": "Comfortable and good looking", "text": "The pants were easy to order and arrived promptly.  The fit was good (large) and they are very comfortable, but they are a little too long and I will need to get them hemmed.  I did not notice if there was an option to order petite length, which would have been better.  ", "rating": 4}, {"title": "Great fitting jeans! ", "text": "The jeans fit perfectly. Soft material. Not too tight. I bought  three different types of jeans, and like them all. ", "rating": 4}, {"title": "New Favorite Pants", "text": "I do love these pa Ts.  Great feel.  Great fit.  The pocket is t great for a phone.  Other than that, my new favorite pants.", "rating": 4}, {"title": "Shipping could be better", "text": "Date of experience: October 25, 2024", "rating": 4}, {"title": "Very comfortable but had to hem them", "text": "Very comfortable but had to hem them. Wish you carried petites.", "rating": 4}, {"title": "Great product", "text": "Wonderful product, as described.  So comfortable!I hate anything tight across my middle and the crossover style means it doesn't dig in so makes these leggings really pleasant to wear.The only downside is the length of time it takes to deliver.I would happily recommend these leggings to others, really easy to wear, comfortable and soft.", "rating": 4}, {"title": "Im happy with Halara", "text": "Im happy with Halara, easy order, delivery sometime fast, sometimes take longer but i still get what i order and correct order", "rating": 4}, {"title": "Shipping takes much too long", "text": "Shipping takes much too long. However the merchandise I received was amazing!", "rating": 4}, {"title": "The only negative would be the length…", "text": "The only negative would be the length of time from order to delivery ", "rating": 4}, {"title": "Awesome pants, but smelly!", "text": "Ordering was easy, and secure, the products arrived in good time, and the pants were just as expected.  I really liked them, my only complaint being that they smell terrible, with an overwhelming smell of mothballs.  I have washed them three times, and they are now hanging outside to air.  I’m hopeful that a week outside will rid them of the smell.  It may be the smell of the fabric, I’m not sure, but for me it’s unbearable.  My daughter agrees.  We hope they smell better soon as we really like the pants. ", "rating": 4}, {"title": "Amazing pants and very comfortable.", "text": "Amazing pants and customer service. ", "rating": 4}, {"title": "True to size", "text": "True to size, good prices and quality. ", "rating": 4}, {"title": "Everything was fine.", "text": "Everything was fine. ", "rating": 4}, {"title": "Leggings ", "text": "I’m enjoying these Halara leggings, fit and feel great.  Took 3 weeks to receive with no updates during that time. ", "rating": 4}, {"title": "Shipping & Quality", "text": "The shipping was faster than expected, but the quality of the item I ordered was disappointing. I thought the material would be better, but it was really thin and not what I had anticipated. ", "rating": 4}, {"title": "Lost package :(", "text": "Unfortunately, I cannot provide a fact-based review on the products themselves as my package got lost after it arrived in my country. ", "rating": 4}, {"title": "I love the fabric and colors", "text": "I love the fabric and colors. Petite size is still a little large for me though, I’m 4’9", "rating": 4}, {"title": "Price  and quality ", "text": "Beautiful clothes and the price ", "rating": 4}, {"title": "Overall the fit is nice", "text": "Overall the fit is nice.  I was expecting a little thicker fabric. But they look nice on and wash well.  One thing to note is in your advertising, it says it will make your butt look good which is why I was expecting a little heavier, athletic type fabric that one would see in leggings.  I recently lost 60lbs and now have no butt, lol, so was hoping it would help with some support there.  I understand that is my issue but maybe edit the advertising a little?", "rating": 4}, {"title": "Pants run big ", "text": "Ordered based on size chart but the pants are too big ", "rating": 4}, {"title": "Sizes are a bit too big", "text": "Sizes are a bit too big, but still great", "rating": 4}, {"title": "Yoga pants are a good fit and good value", "text": "Date of experience: October 17, 2024", "rating": 4}, {"title": "Comfortable and stylish", "text": "Have bought 4 pieces from Halara now and will buy more. The only disappointment is that the elastic in the waistband of one pair of trousers has become twisted. All very comfortable.", "rating": 4}, {"title": "Delivery took a while", "text": "Date of experience: October 18, 2024", "rating": 4}, {"title": "Flares ", "text": "It takes far too long from purchase to delivery especially shipment.", "rating": 4}, {"title": "It’s was my first time shopping at…", "text": "It’s was my first time shopping at halara. I’m totally satisfied with my purchase I love the material and the colors. They fit perfect on me.", "rating": 4}, {"title": "Clothes are good quality for the price", "text": "Clothes are good quality for the price, shipment is quite fast, and sizing is spot on!", "rating": 4}, {"title": "the pants fit great and a true to…", "text": "the pants fit great and a true to size..   I'm 5'7\" and about 150 pounds.. I ordered a 10 and they fit great..  ", "rating": 4}, {"title": "Love them but order way before you need them! ", "text": "I have several pair of jeans, office pants and ivory jeans on the way! Love all of them, but it takes a long time to receive them. ", "rating": 4}, {"title": "Great fit", "text": "Great fit. Very comfortable ", "rating": 4}, {"title": "Great jeans", "text": "My order took quite a while to arrive but I loved the jeans I ordered. Love the look and they are so comfy", "rating": 4}, {"title": "Took longer than expected to receive my…", "text": "Took longer than expected to receive my order but extremely happy with what I ordered ", "rating": 4}, {"title": "Loved the pants and got many…", "text": "Loved the pants and got many compliments and  comfortable! Just need heels bc they’re long. ", "rating": 4}, {"title": "Great customer service ", "text": "It took so long to receive. I also gave up on this but thanks to the great customer service, I was able to receive my order. ", "rating": 4}, {"title": "Love my pants but I find the flare of…", "text": "Love my pants but I find the flare of the jeans to be a little much like boot cut", "rating": 4}, {"title": "I Will buy again ", "text": "I am extremely pleased with trousers although they were more flared than I thought they would be and longer than a petite size ", "rating": 4}, {"title": "I loved the fabric of the pants", "text": "I loved the fabric of the pants, unfortunately they were just too short.   The return was good and easy. ", "rating": 4}, {"title": "Amazon has us all spoiled with the 2…", "text": "Amazon has us all spoiled with the 2 day delivery so all things considered the timeliness was really good ", "rating": 4}, {"title": "so comfy", "text": "shipping was on time and the pants, tank top and dress feel wonderful on my skin.  Will recommend to all.", "rating": 4}, {"title": "Love these pants!", "text": "Love my pants in black, ordered in blue this time and they're great.  Delivery is slow but I understand about being conscious to waste and they communicate well.", "rating": 4}, {"title": "All the clothes fit well", "text": "All the clothes fit well. Quick delivery. The fabric is not excactly what I expected. Too much polyester.", "rating": 4}, {"title": "I loved everything ", "text": "I loved everything but the Jeans have a awful smell. I've washed them multiple times and the still smell weird. ", "rating": 4}, {"title": "Great value for money. ", "text": "Ordering process is quick and simple, the offers are fantastic and the quality of the items I've ordered is absolutely great, much better than I was expecting. The app is also easy to use. Only down side for me was my order took a long time to arrive, tracking said delayed beyond their control, however, I got in touch with them and my order arrived 4 days later. Will definitely be ordering again. ", "rating": 4}, {"title": "I was very pleased with the…", "text": "I was very pleased with the communication about my order. It was slightly delayed and the company informed me right away. The clothes I ordered were exactly as pictured, true to size and well made. ", "rating": 4}, {"title": "Jeans are great", "text": "Jeans are great. Just took very long for delivery. ", "rating": 4}, {"title": "The t shorts are not the same quality I…", "text": "The t shorts are not the same quality I saw on the pictural.", "rating": 4}, {"title": "Beautiful but a struggle", "text": "A beautiful wide legged jumpsuit however I expected this to have to be a little more stretchy as I can’t get out of it without help which is not great, the top has no give in it at all to allow you to pull your arms out of it", "rating": 4}, {"title": "Speedy and efficient delivery", "text": "Speedy and efficient delivery. Clothes for and have nice comfortable stretch.Reasonably priced", "rating": 4}, {"title": "Love the fabric", "text": "Love the fabric.  The waist was too tight.  ", "rating": 4}, {"title": "Lovely selections", "text": "Lovely selections. Good quality. True to size. I gave four stars because shipping was longer than I’d like. ", "rating": 4}, {"title": "I really like the color of the products…", "text": "I really like the color of the products and that the zipper is invisible. The shorts underneath are comfortable. My biggest complaint is that it takes a LONG time to get the product. ", "rating": 4}, {"title": "The quality of product is great", "text": "The quality of product is great ", "rating": 4}, {"title": "Pants", "text": "The packaging as always was perfection. The construction, color, and style were exactly as advertised. The fit was a true medium. The fabric was a bit thinner than I would have liked. The product is very comfortable and moves easily Wirth you. ", "rating": 4}, {"title": "Good", "text": "It was good!", "rating": 4}, {"title": "Good quality for the price", "text": "Items arrived very quickly and are of very good quality. I had a problem with the sizing of both items. The jeans are very nice and fit well but they are very long and will have to be hemmed before I can wear them. The jacket is lovely and flattering but it is too small for me to button up. I will have to wear it as an open jacket. In general I'm happy.with them.", "rating": 4}, {"title": "Top quality products but time consuming costumer service.", "text": "Top quality products!Deliver a bit too slow (over 15 calendar days) and costumer service with too many interactions (I.e., return process isn't straight forward, the link isn't available only upon request and it takes several emails and a few days to be available).A faster deliver and return processes will make me buy more products with no fear of return if they don't fit well. It's time consuming and it holds me back to put more orders and pass for all the processes again.", "rating": 4}, {"title": "I love my halara clothing", "text": "I love my halara clothing.  The only thing that could be better is deliveryntime faster.", "rating": 4}, {"title": "Wet good service and communication but…", "text": " Wet good service and communication but slow to arrive. ", "rating": 4}, {"title": "I ordered the high waisted joggers and…", "text": "I ordered the high waisted joggers and am very pleased with the quality.The prices are reasonable. I ordered from Sweden, it took approximately 3-4 weeks to receive my order, which was a bit of a disappointment. The long wait. ", "rating": 4}, {"title": "Love the pants", "text": "Love the pants, I need to figure out how to fold them like the picture😀", "rating": 4}, {"title": "Nice trousers, they just take a while ", "text": "Ordered quite a while ago and was advised, as they make items as needed rather than keeping big stocks, it would be a little while, so not an unexpected wait. They kept me updated throughout. 2 sorts of trousers, pretty nice and comfy, although the necklace gift is a nice touch it's nothing I'd ever wear. Quite impressed with the clothes just give it a month or so to arrive.", "rating": 4}, {"title": "The first order took so long to get…", "text": "The first order took so long to get here and none of them fit they re shipped my order what was really cool I only had to pay shipping again ", "rating": 4}, {"title": "The leg bottoms were a wider than they looked in the ad. ", "text": "It was shipped and received in short order. ", "rating": 4}, {"title": "Love everything I ordered", "text": "Love everything I ordered. Sizing was perfect and I will definitely order again. My only complaint was not getting updates on the tracking of my order and when I contacted Halara they were unable to help. ", "rating": 4}, {"title": "Happy overall", "text": "Shipping was a bit slow but I live somewhat remote, and I don’t love that you have to pay for return shipping, however you can opt for store credit and keep the item so that works instead of exchanges. ", "rating": 4}, {"title": "This is my first purchase", "text": "This is my first purchase. Arrived sooner than I anticipated and was precisely as described. Thank you!", "rating": 4}, {"title": "Amazing materiel and they seem like…", "text": "Amazing materiel and they seem like quality leggings. My only issue was that the light blue denim arrived with a bleach stain on the inner thigh. Where the stain is at, it is hard to notice, so they are still wearable and I enjoy them!", "rating": 4}, {"title": "As advertised ", "text": "Just received trousers, lovely material, have not worn yet so that's why only 4 star, true to size ", "rating": 4}, {"title": "Love the pants I purchased!", "text": "Love the pants I purchased. Not a fan of the delivery time but the pants were worth the wait. ", "rating": 4}, {"title": "Good fit", "text": "Good fit, arrived on time", "rating": 4}, {"title": "Really good quality products", "text": "Really good products, quality excellent. Glad I sized down as other reviews suggested. Delivery did take longer than expected. Will defo order again ", "rating": 4}, {"title": "Very comfortable ", "text": "Good fit and comfortable. ", "rating": 4}, {"title": "Shipping was a little slow but great experience! ", "text": "Shipping was a little slow but overall very happy with the experience ", "rating": 4}, {"title": "Overall good", "text": "Overall good ", "rating": 4}, {"title": "I love the look of the products", "text": "I love the look of the products - admittedly the shipping was a bit longer than anticipated - but I was happy when they arrived.  One other thing is that the colors are not all as vibrant as they appear on the website - but overall I'm pleased with my purchases.  They're comfortable and can be dressed up or down.  ", "rating": 4}, {"title": "Overall happy with my purchase", "text": "Overall happy with my purchase - a little bigger than expected. I’m gonna wear them often, though ☺️", "rating": 4}, {"title": "Nice trousers but took a long time to…", "text": "Nice trousers but took a long time to arrive ", "rating": 4}, {"title": "Shipping ", "text": "The shipping took much longer then I expected. A week after I placed the order - I got an email that said my order was processed and then it was shipped - even after that it took about 2 weeks to arrive. Now - to be honest - I am not one read the fine print so I might have been notified of long processing and shipping but I ordered in the past and it didnt take this long. ", "rating": 4}, {"title": "Great product ! ", "text": "I really like the product.  Great quality.  Arrived quickly and I got an amazing sale.", "rating": 4}, {"title": "Some of the sizing is really off", "text": "Some of the sizing is off. The pants fit me great but The shaper fit short onesie Was hilariously small - it said size small but it’s like an extra extra small. I couldn’t even get it over one leg and I am definitely a size small. My 12 year old niece might have fit it. I emailed to see how to send back and still no response 2 days later. ", "rating": 4}, {"title": "Shipping", "text": "Shipping takes forever!", "rating": 4}, {"title": "Love the tights, but...", "text": "I absolutely love the tights. However, the grey pair appears to have some discolouration where the folds were. I'm guessing when packaged. But I do love the material and everything about them. ", "rating": 4}, {"title": "Great quality products ", "text": "The quality of your products is consistent and comfortable, it does take a long time to receive a order, but worth the wait ", "rating": 4}, {"title": "Loooove these pants. True to size. ", "text": "Loooove these pants! I really could live in them. Will definitely be getting more of this specific style. They are so versatile and could be paired with so many looks. Lots of pockets that actually hold things and aren’t super shallow. The stretchy and light fabric is amazing. I also really love that there is no fly or anything in the front and they have a band inside for extra “smoothing” of the tummy area. I just wish this band was a bit wider/larger and extended a bit lower to make for a more seamless and smooth look in front. The sizes were a bit hard for me to figure out since I wear a 6-8. The sizes are 4-6 and 8-10. I got the larger size and the are great but a bit big. So next time I’ll be getting the smaller size which should work since they are so stretchy and soft. My advice if you are in between sizes like me is to get the smaller one because of the stretchy nature of the material. I think the waist band will work better too in a smaller size. I messed up when ordering and got the regular length instead of the petite and they are a bit long, but with a pair of higher shoes they are wonderful! Definitely recommend. ", "rating": 4}, {"title": "Excellent quality would just appreciate…", "text": "Excellent quality would just appreciate quicker delivery 📦 ", "rating": 4}, {"title": "Everything went smoothly and…", "text": "Everything went smoothly and quality&size were perfect.", "rating": 4}, {"title": "The website was great", "text": "The website was great. I had trouble tracking the shipping with Shop app. ", "rating": 4}, {"title": "Love your products east of wear", "text": "Love your products east of wear. Don’t like the lead time of your delivery ", "rating": 4}, {"title": "The trousers were a bit too big and too…", "text": "The trousers were a bit too big and too long.Ordered from the size chart. The delivery takes long time to Sweden.I'm very pleased with customer service.", "rating": 4}, {"title": "Easy to order", "text": "Easy to order, I like the free gift, really like the fit of the leggings. It just seemed to take a little long to arrive. ", "rating": 4}, {"title": "Great workout clothes", "text": "Great workout clothes! But takes a long time to arrive!", "rating": 4}, {"title": "I love the pants and they look very good for my body shape", "text": "I love the pants and they look very good on me. The only thing I didn't like is that it took very long for them to arrive. But they are super comfy and really nice to wear.", "rating": 4}, {"title": "Very comfortable", "text": "Very comfortable ", "rating": 4}, {"title": "Halara trousers/jeans", "text": "Halara trousers are so comfy, I wear them for work, Feels like I'm wearing my pyjama bottoms. The jeans are amazing best jeans I've worn they're so comfy & stretchy. ", "rating": 4}, {"title": "Delivery took to long other wise good…", "text": "Delivery took to long other wise good service I would like you to do more petite leg item I am 25\"leg I have to have them turn up which cost more money. ", "rating": 4}, {"title": "So long time for transportation in…", "text": "So long time for transportation in other way it's okay", "rating": 4}, {"title": "It exactly what I expected  !", "text": "Date of experience: October 23, 2024", "rating": 4}, {"title": "Sizing issues ", "text": "Ordered my normal size but should’ve sized down. Major camel toe and baggy in the legs. I can’t return a sale item so I guess I will find a long top 🤷🏻‍♀️", "rating": 4}, {"title": "I really like the pants", "text": "I really like the pants.  So comfy.", "rating": 4}, {"title": "It is a little bit too long and black…", "text": "It is a little bit too long and black is more dark grey. ", "rating": 4}, {"title": "Great overall!", "text": "Website is easy to navigate in order, the products are great quality and most fit as expected, and the customer service experience has been seamless and helpful so far. I would would give it a full five star rating if Canadians are offered free returns without shipping costs.", "rating": 4}, {"title": "The pants are great", "text": "The pants are great!  But it took WEEKS to get them!  WEEKS….", "rating": 4}, {"title": "I love that they are stretchy and they…", "text": "I love that they are stretchy and they do not look like sweat pants ", "rating": 4}, {"title": "I didn't like the color", "text": "I didn't like the color, it's different from the photo. The size is also big, although I always take xs and it's tight for me.", "rating": 4}, {"title": "ough it took…", "text": "Received as advertised although it took a very long time to get here.", "rating": 4}, {"title": "the cut of the pants are so cute", "text": "the cut of the pants are so cute!  the size feels too large however and they stretch out easily so I will probably need to get a smaller pair.", "rating": 4}, {"title": "Shipping was fairly quick and when my…", "text": "Shipping was fairly quick and when my jeans didn’t fit return was easy ", "rating": 4}, {"title": "Good pants at a good price, be wary of shipping timelines. ", "text": "Really good pricing and pants seem to be of quality and fit. I’m 5’0” for reference and nothing appears to be too long. The ankle pants are full length on me. Be wary of shipping. I ordered these on 10/3 with expectations they’d be here by the time I left for a 10/15 trip at 5am. The pants arrived at 3pm on 10/15 when I was already gone despite playing for shipping to be expedited. However I will wear them going forward. ", "rating": 4}, {"title": "Good quality right size prompt service…", "text": "Good quality right size prompt service possibly improve delivery timeline ", "rating": 4}, {"title": "Ok ish", "text": "Delivery is long, quality is good, style is great but sizing is oversized in my opinion.", "rating": 4}, {"title": "Love the look and feel of these pants", "text": "Love the look and feel of these pants. My only complaint would be the length. I ordered a tall, but the inseam does not seem like a tall. They hit at my ankle.  I’m 5’9 and normally size tall is plenty long enough. I’m wondering if these were accidentally marked wrong. ", "rating": 4}, {"title": "Love the pants", "text": "Love the pants. Took a little long with shipping. Would be great if they were on Amazon. Thx", "rating": 4}, {"title": "My absolute favorite leggings I have…", "text": "My absolute favorite leggings I have ever tried and I have tried every brand you can think of. My only complaint would be how long they take to ship. Other than that, I am very happy and will be buying again.", "rating": 4}, {"title": "Very comfortable and are slimming", "text": "Very comfortable and are slimming ", "rating": 4}, {"title": "Love the pants", "text": "Love the pants. They were super comfy and stylish. The only “complaint” I would have is that the waist band is a little tighter than I thought it should be based on size. ", "rating": 4}, {"title": "I mean surprisingly the quality was not…", "text": "I mean surprisingly the quality was not bad. I was surprised the sizing was almost good. ", "rating": 4}, {"title": "Feels good.", "text": "I really like the way the shirts feel.  I did order one shirt a size too big, but that won't stop me from wearing it.  I will order again.", "rating": 4}, {"title": "Comfortable pants", "text": "The pants I’ve ordered are so comfortable and are stretchy from top to bottom. I just wish the pants were made for shorter people as well. I am only 4’10 and they’re always a tad bit too long on me. ", "rating": 4}, {"title": "Good customer service and…", "text": "Good customer service and communication, unfortunately the items weren’t suitable for me on this occasion ", "rating": 4}, {"title": "They were comfortable but run small", "text": "They were comfortable but run small, would be nice if they had more tummy control.", "rating": 4}, {"title": "The website is easy to use and was…", "text": "The website is easy to use and was responsive about an over month delay in receiving my order. The products fit great and I love the material. Missed opportunity for pockets in the spandex of the skirts!", "rating": 4}, {"title": "It was easy to order my Pants/Overalls", "text": "It was easy to order my Pants/Overalls. They came in a timely manner. They have been comfortable and I have received a lot of compliments when wearing them. ", "rating": 4}, {"title": "Love the fit and material of pants", "text": "Love the fit and material of pants.  Only issue is with yoga pants they started piling after two or three wears in the inner thigh area.", "rating": 4}, {"title": "Great pants, bad logo placement ", "text": "I absolutely love these pants.  They fit great and are very flattering.   However,  the logo placement on the back of the leg is quite awkward.   It looks like a circle size sticker that I forgot to remove.  ", "rating": 4}, {"title": "I like the cut and fit of the trousers", "text": "I like the cut and fit of the trousers. Very true to the pictures", "rating": 4}, {"title": "The clothes are great", "text": "The clothes are great I should have ordered a larger size for the yoga pants. I'm 5 ft 114 lbs, ordered a small according to sizing bit should have ordereda medium l. Sweatshirt is very soft", "rating": 4}, {"title": "Good pants", "text": "It took the 11-15 business days for the pants to arrive but they are really good. I'll get more soon.", "rating": 4}, {"title": "Can't return wrong sized items!", "text": "I liked all of the items I received. However I purchased some in the wrong size, not realizing they cannot be returned! This is a terrible customer service plan. I would have been better to at least offer an exchange or credit towards other items. Hard to decide if I would order again based on this issue. ", "rating": 4}, {"title": "Site is easy to use though not so easy to find the product reviews", "text": "Site is easy to use.  Wish that there was a bit more focus on rating the products as this is pretty important for online clothing shopping.  especially deciding about sizing", "rating": 4}, {"title": "Good Quality", "text": "The clothes are off good quality, as described and fit well. ", "rating": 4}, {"title": "Great products and worth the wait but…", "text": "Great products and worth the wait but shipping does take some time and tracking notes are not very clear and are repetitive so never quite sure where your order is.   But it does always arrive.", "rating": 4}, {"title": "Very comfy material", "text": "Site is really easy to use. I love the product. I bought some flared jeans and the material is lovely stretchy. These are cropped but full length on me as only small. They are perfect. I do wish the delivery time was quicker. ", "rating": 4}, {"title": "Quick delivery", "text": "Quick delivery. Super comfortable. Lots of compliments. I probably should’ve sized down. ", "rating": 4}, {"title": "The clothes are lovely and well made", "text": "The clothes are lovely and well made. I was very pleased by the materials and the quality of the designs. The arrival of the order was reasonably estimated and communicated up front. Overall a very nice experience.", "rating": 4}, {"title": "I absolutely LOVE these pants", "text": "I absolutely LOVE these pants!  Can’t wait to order more colors.  Super comfy and very versatile (dress down with sneakers or up with heels).  My only “complaint” is that I ordered two colors in the same size but one was clearly larger than the other ☹️ I’ve made it work but hoping with my next order the same thing won’t happen.", "rating": 4}, {"title": "Runs Big!", "text": "Had to get a smaller size. When I asked for help in doing this, I was pleasantly surprised! I received my corrected order within a week! I love these overalls.", "rating": 4}, {"title": "I am 5’4” and I ordered the Medium", "text": "I am 5’4” and I ordered the Medium. They are really long. I will have to get them hemmed. Other than that I liked them. The feel is good and they fit good. ", "rating": 4}, {"title": "The product is absolutely top notch", "text": "The product is absolutely top notch! The fit and comfort are exactly as advertised. I give the product 5 stars. The 4 stars is for the shipping. I had to wait 21 days for my order. I'm a cheapo and don't spend on shipping so my bad, but most free shipping is like 8-10 days.  Otherwise love the pants I ordered and will be ordering more!", "rating": 4}, {"title": "I liked the product although I need to…", "text": "I liked the product although I need to return  one pair of pants.Having a difficult time logging in to my account", "rating": 4}, {"title": "I love these pants", "text": "I love these pants! They’re my new favorites. The only reason I didn’t give it a five star because shipping took forever.", "rating": 4}, {"title": "Quality is good and true to size", "text": "I found the pants that’s is true to size. And worth the price", "rating": 4}, {"title": "Pants were of decent quality and fit…", "text": "Pants were of decent quality and fit well. Order arrived on time. Thank you. Will be ordering more.", "rating": 4}, {"title": "Products have a good quality and…", "text": "Products have a good quality and attived as requested. Shipping was slow.", "rating": 4}, {"title": "The jumper shorts that I ordered are definitely cute. They are not slimming, however. They run very big and I will return And order a smaller size. The gathers in the stomach area are not slimming.", "text": "Very cute clothing however, I do not feel they are true to size. The excess material in the front is not slimming at all. I will order a smaller size and hopefully that will look better on me.I would also like to see more mid rise pants and jeans rather than the high rise As they are uncomfortable on my stomach", "rating": 4}, {"title": "Slow delivery ", "text": "Amazing  jeans ,fabric, look, feel , quality and worth every penny. I recommend this to everyone ", "rating": 4}, {"title": "Very comfortable pants!", "text": "I’m happy with the purchase.", "rating": 4}, {"title": "Quick and easy to order and really fast…", "text": "Quick and easy to order and really fast delivery. ", "rating": 4}, {"title": "The order arrived very quickly", "text": "The order arrived very quickly. The material is awesome. The only thing is the fit is a little big for my legs since its very wide! ", "rating": 4}, {"title": "Items were as expected!", "text": "Items were as expected!Just wish delivery was not quite so longGood communication though ", "rating": 4}, {"title": "The delivery was somewhat fast", "text": "The delivery was somewhat fast. The material is not bad at all. ", "rating": 4}, {"title": "They are leggings", "text": "These leggings fit nicely. They do roll but they are high enough that they do not roll too low to be an embarrassment. I do not see the hype as they are as nice as ones I have spent half as much on but if you are into wearing the into thing then these work.", "rating": 4}, {"title": "superb quality!", "text": "I ordered two pair of pants for work and I am very impressed with the quality and comfort.  I will definitely be buying more.  They did take a very long time to arrive though (1 month)", "rating": 4}]