[{"title": "Single Point of Contact for Entire Transaction", "text": "Understand your desire to use specialty teams for the phases of the transaction.  However, you need to have a single point of contact that spans all phases from start to finish.  Had that for the previous refinance but was woefully lacking this time around.  I suspect the initial contact for the refinance was actually doing that on his own initiative.  He made a big difference in the experience.  Missing in action for this transaction and a major disappointment.", "rating": 4}, {"title": "The experience was easy but the one…", "text": "The experience was easy but the one issue is the cashier checks you send to make payment...one of the checks was to pay off balance on a charge card but the check exceeded the balance owed...the store would not accept check as payment since it was more than owed...now i have to make charges on the card to match the amount on the check...", "rating": 4}, {"title": "Everything was great until it comes to…", "text": "Everything was great until it comes to actually funding the loan. Going on 3 weeks and I’m still waiting on Rocket Mortgage to pay off original mortgage. I guess that means I’m paying interest on both loans!  Not good. ", "rating": 4}, {"title": "Not great communication at closing.", "text": "The actual closing using notaries was a problem.  Notary cancelled appointment, no notification, and had to reschedule.  That changed wire/closing amount.  Rocket did correct their mistake though.", "rating": 4}, {"title": "My mortgage assistant at Rocket kept me up to the minute on my refi!", "text": "My mortgage assistant at Rocket kept me informed from the start of what I needed to do to keep things moving along.One problem that ended up delaying our closing was caused when I paid off a bunch of credit debt rather than have it paid off by the refi because I did not want to pay interest to Rocket for paying off my credit debt as it was all interest free. It delayed the closing because I discovered it was difficult for me to prove that the debts were paid off!", "rating": 4}, {"title": "Anthony was great", "text": "Anthony was great, knowledge, very helpful and patient. Very helpful getting through process.", "rating": 4}, {"title": "It was quite expensive just to change…", "text": "It was quite expensive just to change the interest rate.  This should be a much easier and less expensive process.  ", "rating": 4}, {"title": "Sam Farraj was better than good", "text": "Sam Farraj was better than good. He made this a pleasant experience for me and my family. He was awesome", "rating": 4}, {"title": "Looking for a reputable Mortgage company? Look no further….", "text": "I love Rocket Mortgage. They were extremely helpful when I got my first mortgage, they walked me through the process and made everything so stress free. In all honesty the refinancing process wasn’t as stress free for me, but I trust this company and find them to be very reputable and their rates were the best that I found. They were great in terms of answering my questions and navigating me through the process, they also worked well with my Realtor. I highly recommend Rocket Mortgage. ", "rating": 4}, {"title": "The professionalism and courtesy of all…", "text": "The professionalism and courtesy of all the members of your team made this experience much less stressful than it otherwise could have been.  Even though there were some unexpected hiccups, the process came to a successful conclusion with which we are very happy.", "rating": 4}, {"title": "At first I was given a rate of 6.75%…", "text": "At first I was given a rate of 6.75% and was told that if rates went down, they would automatically go down (due to my VA rating and outstanding credit score….. I went ahead and started the improvement on my house using my credit cards for materials…. When closing numbers came in my rate was higher and I was told if the rates went down I could file to refinance which would cost more money…… I was too far in with signing a contract with a contractor and couldn’t afford to have him quit then sue me!!!", "rating": 4}, {"title": "The entire process was professional.Our…", "text": "The entire process was professional.Our first contact was Misty Hopper,who performed great service.The only wrench in the experience was the closing. We were to use  an app to prepare for a much quicker closing,but ours was much longer.We could not operate the app and it was confusing and so frustrating we have up.At the closing,we were told many people had the same problems.", "rating": 4}, {"title": "While the everything went step by step…", "text": "While the everything went step by step , some of the steps seemed to be an afterthought. Last minute \"tasks\" showed up and I was expected to hurry to get them done. Some of the tasks, to me, seemed unnecessary but I was required to complete them at ever growing cost to me. I spent thousands on required tests and reports that in the end, some meant nothing. It seemed to me that I could not be trusted at my word and I was required to prove everything to the smallest detail which was really annoying. EVERY claim I made throughout was borne out to be true yet there was no apology. The rate was good I was given the cash I asked for so in the end, all is well in Camelot.", "rating": 4}, {"title": "The experience of the staff is awesome", "text": "The experience of the staff is awesome, happy with everything EXCEPT the interest rate, I think we could have done better. But overall, 4/5", "rating": 4}, {"title": "I thought that initially your…", "text": "I thought that initially your underwriting team was weak and did not understand all the forms and reports they received.  Seemed to focus all their attention on debt to income and ignored other important factors like total assets, liquid assets, and loan history of the applicant.  Those items should hold as much importance to the approval process.  Thankfully Robert Camp got involved and the approval process was much improved, and moved forward in a more normal fashion.  Thank you Robert.Joe Scarnato ", "rating": 4}, {"title": "I'm very disappointed right now", "text": "I'm very disappointed right now. I did a refinancing on the 3rd still waiting on my funds to get disbursed.  I always like Rocket but this blow my mind. My patience is coming to a end.", "rating": 4}, {"title": "Repeat customers and this most things…", "text": "Repeat customers and this most things went smoothly, it was a little frustrating at times as we were always being shuffled to a new rep, and they had inconsistent answers.  Had to really work on getting the rate we should have been given up front.  In the end, all things shook out and ended on a positive note.  ", "rating": 4}, {"title": "So overall things went well", "text": "So overall things went well. Really appreciated Mikel and our \"closer\" Lauren - They were very helpful but the reason I left off the last star off is because technology these days being what it is - there were at times quite a bit of confusion between different emails telling me that things were done and others telling me the things needed to be done and it was very frustrating at times.That being said it was a very good experience, and would definitely recommend ROCKET MORTGAGE. thank you Joanne and Robert Michener  ", "rating": 4}, {"title": "Our lender was the most reliable and I…", "text": "Our lender was the most reliable and I think having her was a very strong addition. ", "rating": 4}, {"title": "Overall I enjoyed my experience with Rocket Mortgage. ", "text": "Overall I enjoyed my experience with Rocket mortgage. Towards the end of closing things tended to get stressful as last minute documentation came up. It ended up coming from a finding during an appraisal which makes sense. Maybe having the appraisal done sooner would give customers more time to make corrections if needed. When it comes to help from Rocket mortgage agents I feel as if they did great explaining how the process works to buy a house. ", "rating": 4}, {"title": "Very helpful to my family thanks", "text": "Very helpful to my family thanks ", "rating": 4}, {"title": "LHJ and RBJ 2024…", "text": "We have been working with Rocket Mortgage for several years, the experience has always been painless! Our Loan Specialist was knowledgeable, however we never heard from him once we completed our first task.One of our task should have been to confirm each payoff instead of Rocket just using the numbers in the disclosure statement. Also, the Loan Specialist told us we could select our payment due date. However, when we Closed the Amrock Representative told us October 1st, 2024. Missed the email for changing the date, 1st-16th.", "rating": 4}, {"title": "Very good experience…", "text": "Frank, our banker, deserves 5 stars for all he did for us.  The app was easy to navigate and the processing of uploading was simple.  The only issue we had, hence the 4 star rating, was the unnecessary delay due to Rocket using an inadequate title company.  Amrock should have been used from the start. Just saying.We will most definitely use Frank and Rocket in the future if the need arises and would recommend this company to others.", "rating": 4}, {"title": "Everything was great until …", "text": "Everything was great until my personal banker quit, and I did not receive any notification.  I was left waiting and leaving messages to someone who was no longer available. It was not until I was voicing a compliant that I was told and received contact information on my new banker. This was a BIG miss on Rocket's end. ", "rating": 4}, {"title": "Although the process was not extremely…", "text": "Although the process was not extremely long, it took longer than it should have. I would have rated 5 stars for our experience but had some issues with the first person working on our case. Many times, we had to send multiple documents at least 2-3 times causing delays. Once we were assigned to Robert Camp, he made things happen quickly and efficiently. ", "rating": 4}, {"title": "The forced credit cards payments…", "text": "The forced credit cards payments triggered an issue with AMEX because the Rocket check amounts were so much higher than what was owed on the credit card. AMEX has now asked for a paystub and bank statement. It would’ve been preferred to not have to do the checks to the credit card company and consider alternate options. ", "rating": 4}, {"title": "It was done well", "text": "It was done well except for the closing which I asked to be done in person but had to do it over the phone", "rating": 4}, {"title": "I am very happy with Rocket Mortgage!", "text": "I am very happy with Rocket Mortgage!! While it took a little longer than I expected and there wasn’t always a clear path to find needed information or help I did complete the journey and so thankful to get this done!", "rating": 4}, {"title": "Easy to work with", "text": "Every team member I dealt with was wonderful.  They were very responsive and communicated with me every step of the way. They made it an easy, painless process.", "rating": 4}, {"title": "Andrew at Rocket was great", "text": "Andrew was a very helpful guide and was very transparent and reassuring. It was important to continually build trust, while getting phone calls from scammers who knew we were trying to refi. I think there was an overestimation of equity expectations painted by rocket mortgage At first which ended up being half of what we needed to take retire credit cards, but Andrew still had a plan that would enable us to move to a HELOC after our credit score rises from this initial payoff.  We will continue to work with Rocket mortgage toward financial freedom. Rocket mortgage and Andrew RoysterAnd everyone I dealt with were very professional. If you're going through this process, I recommend having only one point of contact, which was in our case Andrew. Software in the system is a little buggy, but we were always able to refer back to Andrew for advice on what to do next, and what to ignore. On the whole I give Rocket a 98%, which beats any other company I talked to.", "rating": 4}, {"title": "Very tailored service", "text": " The company representative took a lot of time with me to explain all different options and loan types to fit my needs very patient. Process went fairly smoothly with a few hiccups and some of the loan documents.", "rating": 4}, {"title": "The initial handler of everything was…great ", "text": "The initial handler of everything was great. Ana deserves 5 stars. She always answered questions.   Rocket mortgage was fast with their approval process and dispersal of monies. However their policy not to mail checks to credit card companies. Or giving customer the option. ", "rating": 4}, {"title": "The process of fairly easy", "text": "The process of fairly easy. Mostly digital, which is good for me. I did not like that I had to payout my debts on my own I wish they were just part of the process and the payment was sent after closing by the company or the closing team. The reps were quick to answer questions and easy to communicate with. I don’t appreciate all the extra calls from all the other companies that your information gets sold to. I don’t think it’s good or fair when we are customers to just have our information sold so that we get a ton of callers trying to get your business or sell you something after I did business with Rocket mortgage. ", "rating": 4}, {"title": "Refi", "text": "I felt a bit pressured to complete this refi before the 18 month offer expired even though the rates were not that much lower. The extra amount added to the mortgage was more than I had expected sense we were told there would be no fees for the refi. The Notary was very knowlegible and helpful with the signing. I have yet to receive any copies of the paperwork.", "rating": 4}, {"title": "Get more Jacob's", "text": "Our customer care representative was super!  I would have rated a 5 based on our experience with Jacob.  The processing team has some nags.  They called us for items that were already in the packet, instructed us not to contact Jacob (no way) and overall that department didn't seem to know the next steps....Overall Rocket rates 4.5...Thanks", "rating": 4}, {"title": "Rocket Mortgage Review", "text": "Overall, the experience was good. Our Executive Banker Brian Clancy did an excellent job. He was very friendly and kept us up to speed on what was going on and what the next steps were coming up. I didn't rate a 5 star because somewhere along the way there was a clerical error that delayed the closing which created stress because we had to push the movers out.", "rating": 4}, {"title": "Jose Bricena is a superhero!", "text": "Jose Bricena was my saving grace. He was there for me through this long process. He went to bat for me when underwriting was being difficult-which happened A LOT. My only complaint is that the entire process took so long. I realize underwriting is just doing their job by being extremely picky, but they often would contradict what rocket mortgage would tell me. That caused a great deal of stress in my part. All in all, Jose made everything right and I am VERY HAPPY with the end result. ", "rating": 4}, {"title": "Good communication poor task requests.", "text": "Good communication.  Wish all tasks could be loaded.  We were frustrated by some tasks; especially financial where you used the middle number from credit reports instead of the account numbers.  We wasted many hours trying to track down what was being requested.", "rating": 4}, {"title": "Good Experience", "text": "I am not a regular mortgage buyer so I do not know the process.  By having our own Rocket Specialist, it made the process seem easier.  She always answered the phone or got right back to us.  ", "rating": 4}, {"title": "Karla Heard was awesome and very…", "text": "Karla Heard was awesome and very helpful.  You need more like her.However your admin/credit staff and online system leaves a lot to be desired.  Common sense in some of your requests anxiously does t apply.  It was very annoying to be told “it’s our policy” was used as opposed to common sense when looking at my details.  Additionally the online requests were unclear more than a few times and yet you couldn’t get someone to explain in a reasonable timeframe.  I will have to seriously consider referring anyone to Rocket Mortgage without a warning to them of the hassle they should expect.", "rating": 4}, {"title": "Knowledgeable staff", "text": "Knowledgeable staff, Kory was great! There was just one thing that took place w/c caused the delay w/c was the picture that was submitted by the inspector that wasn't clear , reason why it took so long. The final paper work was great, can't remember his name but he was quick but  thorough.", "rating": 4}, {"title": "Our Mortgage banker was very supportive…", "text": "Our Mortgage banker was very supportive and did her best to move the application quickly especially when the underwriting stage was taking time. The closing process was very smooth. The entire process from application to closing took less than 2 months. The RM online site was great once we got to know it.", "rating": 4}, {"title": "A little better after contact with…", "text": "A little better after contact with broker", "rating": 4}, {"title": "William and Tiara were always quick to…", "text": "William and Tiara were always quick to respond and answer any questions I had. They were informative and knowledgeable. They gave me notice when something was due and options to provide. I would have liked to have gone over the closing document line by line to review and understand what each item meant. ", "rating": 4}, {"title": "Rocket Mortgage was great", "text": "Rocket Mortgage was great. Everyone was helpful and answered all our questions. I knew where we were every step of the way.The title company was horrible and we almost walked away from the loan due to them. I think they are a separate division from Ricket Mortgage and I had to blur the review but no one from the title company has asked us for a review and honestly Rocket Mortgage should be aware of their partners poor performance.", "rating": 4}, {"title": "They may take way to long to get you to the finish line but will get you there ", "text": "Quick to get started and take your deposit but slow to the finish line. Wasn’t the lowest rate compared to comparable companies. I had to do foot work for them that others didn’t ask me to do. All in all it took too much time and they stumbled were their competition  didn’t. But at the end of the day they finished we signed and still took them 5 days after signing before we officially closed and received funding. ", "rating": 4}, {"title": "The mortgage loan process was…", "text": "The mortgage loan process was relatively easy.", "rating": 4}, {"title": "My mortgage rep was great", "text": "My mortgage rep was great. There was a small delay in the execution of the mortgage, and with the closing, there was a double payment to my existing homeowners insurance escrow. I received a phone call two days later and was told I needed to pay over $4000 back, due to the overpayment and I would have to wait for my refund for at least two weeks on the overpayment. ", "rating": 4}, {"title": "Great process, if you get the right rep.", "text": "I’d give the mortgage process 5 stars.  Rocket makes the process quick & painless.  I didn’t give Rocket 5 stars due to the rep assigned to handle my account.  I had to return the paperwork to him way too many times for corrections.  When I pointed out multiple items on the same form for correction, it was like he didn’t bother to look further than the first correction.  And I don’t like playing 20 questions.  I expect a person in this position to be more forthcoming with information.", "rating": 4}, {"title": "We had an overall wonderful experience…", "text": "We had an overall wonderful experience other than our loan officer going on vacation without telling us. Normally this wouldn’t be a problem, except that we were on a time crunch to close. I will say however, the rest of the team jumped in and helped get everything handled for an on time closing! ", "rating": 4}, {"title": "Its not like any type of loan you have had before.  ", "text": "Very helpful.  Things change fast so they we're always quick to fix problems that came up.  Not like a regular loan which was surprising but I was able to get the loan approved.  Not as fast as I would have hoped but it definitely was a learning experience that my team was willing to help me with since I also needed to learn how things worked along the way.  ", "rating": 4}, {"title": "Overall very good experience", "text": "Overall very good experience, Katelyn  Haught was exceptional to work with. The closing was smoorh on 8/4/2024. My only complaint is the appraisal process. The paramaters used are terrible only good for areas with alot of homes to get a fair comparison. ", "rating": 4}, {"title": "We had an overall great experience with…", "text": "We had an overall great experience with the exception of the title research and the time it took to close on the last day of our locked in rate. ", "rating": 4}, {"title": "Overall experience", "text": "Our Loan Officer, Ryan, was very attentive and called or returned our calls promptly when we had questions.  Felt the whole process took longer than necessary.  Other than that, we are happy with the ending results.  ", "rating": 4}, {"title": "Great service from beginning to end of…", "text": "Great service from beginning to end of the loan process ", "rating": 4}, {"title": "Overall", "text": "Overall, it was a good experience.  Some of the document uploads were a lot of work but finallywere all accomplished.  People tried to be very helpful.", "rating": 4}, {"title": "Streamlined process was efficient", "text": "Streamlined process was efficient. Final disclosure could have been a day or two earlier. Request for rating every person you had contact with, even if it was a one sentence text, was a bit irritating. Overall very good experience.", "rating": 4}, {"title": "Great response when I had a question", "text": "Great response when I had a question. Sent info and communicated well. ", "rating": 4}, {"title": "Nick Campbell was fantastic", "text": "Nick Campbell was fantastic. He helped every step of the way. Thanks for everything, Nick! We had a few hiccups with the closing team, but it all worked out in the end.", "rating": 4}, {"title": "Great to work with!", "text": "This company was great to work with. They made the experience very easy and for the most part very straightforward.The reason I didn't give 5 stars is due to how they handle debt consolidation refinancing. It would have been 1000% easier with a direct deposit instead of having us wait for checks, and then having to mail individual checks out. I understand the process behind it and why it's like that. I'm hoping one day, it'll be a digital process that will be much faster. I think if they did a direct deposit, and then had us submit proof of payment, then that would be doable. ", "rating": 4}, {"title": "Representatives was great Ma Langford…", "text": "Representatives was great Ma Langford did a great job. I was disappointed in the number of time I had to resend information. The whole process was extended by your request of additional information at every turn. However I do appreciate your time put into thisCharles Townsend ", "rating": 4}, {"title": "That thing was able to be done online…", "text": "That thing was able to be done online except for the final signing and they came to my house", "rating": 4}, {"title": "Refi. Quick, Easy, & Overall Good Experience ", "text": "Mortgage bankers are friendly and knowledgeable.General customer service agents I found to be friendly, but gave generic responses and didn't answer my specific, simple. question.I did not like how Rocket pays off your credit debt. I was sent checks to mail to my creditors (vs Rocket paying electronically, as they did my old mortgage). I have 25 creditors. Meanwhile, I have had to pay the minimum monthly payment due, which of course will decrease the balance - leaving me to then to have to contact all 15 companies for a refund of the resulting overpayments. I believe if Rocket insist to pay the debts directly they should actually send the payments.Generally I would recommend.", "rating": 4}, {"title": "Fastest refi ever!!!", "text": "The people.However, I know my request for refinance was out of the ordinary time-wise, there seemed to be a little issue with communication.Many of the automated messages I received were asking for documents I had already provided.Hence the 4 *s.", "rating": 4}, {"title": "Service good, price rough", "text": "Service was fantastic! Prices are a lot higher than other areas in the market. Everyone was great to work with and they made the first time home buying experience a good experience. Would probably work with them again, but don’t plan on buying a new house.", "rating": 4}, {"title": "My loan officer was amazing", "text": "My loan officer was amazing. The process of getting the mortgage was made so much easier for a first time home buyer like my self. My loan officer Geoffrey Giest was really informative and made sure that I understood everything that I was signing and explained things that I didn't understand. I would recommend him to anyone who is looking.", "rating": 4}, {"title": "Much easier than the traditional…", "text": "Much easier than the traditional method. The agent was kind of pushy especially when we are busy with other things we have to do which are of equal priority.", "rating": 4}, {"title": "Best initial contact possible. Some waves after that.", "text": "My initial contact could not have been better. Mark Gustafson is an extremely valuable asset to your organization.  He was thorough, kind, and knew everything about all aspects of the process. I wish he would have been my guy for the entire thing. I did not like being passed along to folks who were not at his level. The Closing Specialist didn't know or confused the difference between escrow and principal/interest portions of the mortgage payment even when asked to recheck. Also had a Purchase Specialist who was not engaged. I was doing the reaching instead of her notifying me. Overall, the process is rock solid. The lack of confidence in one person and meh engagement of another tarnished my opinion. I would still recommend Rocket for the process with fair fees, organized documentation process and of course, Mark G.  ", "rating": 4}, {"title": "It was a pretty good experience the…", "text": "It was a pretty good experience the only snag we had was they didn’t tell us we didn’t have to do the pressign   And we were trying to with no success and it caused some confusion with our closure. Then it took a while to get done one on the phone while the closer was here. ", "rating": 4}, {"title": "ease of preparing", "text": "Everything went well except it took longer than I thought it would.  It could have went faster by having the water tested sooner.  A list of needed documents could have been requested earliet also.", "rating": 4}, {"title": "The client advocate at Rocket Mortgage…", "text": "The client advocate at Rocket Mortgage will take one through the VA loan process up to the closing. ", "rating": 4}, {"title": "Very good mortgage broker.", "text": "Very good mortgage broker.Very pleasant and helpful customer service. I liked the online status of the loan process; it helped to keep me informed every day.One suggestion, verify and check forms that may be expired or out dated.", "rating": 4}, {"title": "Loan process", "text": "The person I first worked with really earned my trust and listened to my concerns. He went on leave due to the birth of his child.  I wish him blessings.  The person who took over did not listen as well.  I got super nervous and anxious and decided I needed to call her to express the concern I was trying to convey with regards to my name update. She finally took a moment to understand but it was not the same give as the original person I worked with", "rating": 4}, {"title": "Overall satisfaction with re-do experience", "text": "Initial loan officer expertise. Great on line application process. ", "rating": 4}, {"title": "It took way to long to close and when…", "text": "It took way to long to close and when the first documents came in they were wrong. Took additional time to fix that. Other than that everyone was very helpful and polite throughout the process. ", "rating": 4}, {"title": "Cash Out Refinance", "text": "Our loan processor Josephine was very helpful. However, we took cash out to pay debt and the way we received the checks made it difficult to mail the checks easily. My husband and I have seperate accounts but the checks came with only his name on the and one check would have payments for both of us. Also, the checks did not have any account number on them, so we had to research balances and match account numbers, We also had to write letters to creditors explaining why only my husband's name was on the checks and not mine for all of my accounts.This took time and delayed payments. There has to be a better way to make these payments.", "rating": 4}, {"title": "Our home equity experience", "text": "Jordan Davenport was our contact person for starting the process of the home equity loan. She is very personable and enjoyed speaking with her. The only issue with the process with her was that she kept reassuring me that the closing costs would not exceed $1500 regardless of the numbers stated on the documents. The closing costs were $300 more. Jordan left the office for some time, I am assuming for vacation. A support person was made available, but was very difficult to make contact. Each time we called, we had to leave a message and the call was not returned until the next day. Even more frustrating was that she couldn't answer any questions and made no attempt to find the answers.The closing went well with the notary in our home and was on time.The only thing that left me with any real disappointment was the difference in the closing cost. $300 is not a lot of money, but its more about a promise not kept.  ", "rating": 4}, {"title": "Process was fairly easy", "text": "Process was fairly easy, a single point of contact would have been better. We had at least 3 people we were dealing with for different reasons. Sometimes that was a point of confusion.", "rating": 4}, {"title": "Change It", "text": "Mr. Davis is outstanding.  Keep him!!It is so difficult to change from paperless bills to mail-in payments.  I have tried, unsuccessfully, to request a paper bill monthly.  HELP!", "rating": 4}, {"title": "Very good company to work with ", "text": "They do go above and beyond for you at least my guy did , Sam Gerling , would’ve given 5 stars had it not been for the 4 times I had ti sign papers , but I can blame the notary’s for that ", "rating": 4}, {"title": "Ease of use and communication is a…", "text": "Ease of use and communication is a great value in processing a loan. Do your due diligence on rates and discounts.", "rating": 4}, {"title": "It was fairly smooth", "text": "It was fairly smooth.  Aggravation on some requests and the accuracy of the final closing dollar requirement.Rocket assumed that I wanted to buy down my rate.  Not given choice.....Not a good look....", "rating": 4}, {"title": "to always be able to communicate with staff  and having your questions answered is a plus", "text": "From the moment of the loan application and the loan banker Broderick Battle whom was very very helpful and very and concerning I had a good experience.  Broderick's knowledge and patient help me get through the process.  Being able to connect with Broderick to ask questions regarding the process with which he patiently answered was great.  Overall I thought the staff was great.", "rating": 4}, {"title": "Great Experience ", "text": "Samantha Glanz made the experience great. She went over and beyond in answering my questions and trying to make the experience flawless.", "rating": 4}, {"title": "Elizabeth was great through the process…", "text": "Elizabeth was great through the process but in closing we were both surprised that not everything we thought was to be paid off was.  A long time to get my credit score up and then to processing was quick and easy.  ", "rating": 4}, {"title": "Very good experience", "text": "Very good experience. Fast and easy. The only snag came at the end when the expiration of my mortgage payoff went unnoticed, causing my dispersement to be delayed on e day.", "rating": 4}, {"title": "a relieved customer", "text": "Moose made me feel safe. Like I mattered and wasn't just a sale. The signing didn't go as well. The actual signing, not so great. 3 times I waited to hear back just to set a time. Ordinally it was supposed to be the 11th, so that delay put off receiving any money which was mine and I was being charged interest. But everything is good now. Except getting overage paid back. Sorry 1 other matter. Property tax. No one was able to tell me if I needed to refile, so now I need to reach out myself.", "rating": 4}, {"title": "Initial rep was excellent", "text": "Initial rep was excellent. Another tried to take the negotiation from her. I objected to manager and insisted that it be returned to her. Not a good policy to allow this to happen.", "rating": 4}, {"title": "We had a great experience with James for a refinance of our first mortgage./", "text": "We had a great experience with James, our principal agent and his team. Our only compliant is how difficult it is to speak to the same Team Member!!In the end all went very well and we got what we were aiming for.  Great company and we would deal with them again in the future.", "rating": 4}, {"title": "Very friendly", "text": "Very friendly.  It took two months to close on refinance and I keep having trouble with their phone App.  Disappointing as it is, they do answer and try to resolve any problems.", "rating": 4}, {"title": "When I called to talk ", "text": "When I called to talk to Yaimee, my mortgage specialist, she was very nice but she always called me Ms. Davis - my name is Deans.  She assured me my mortgage would be done by the end of the month.  It wasn't done and I didn't get my money until July 11th.  I didn't get the checks until July 12th,  I just wish I had known.  Everyone I spoke to was very nice.", "rating": 4}, {"title": "I had a pretty good experience with…", "text": "I had a pretty good experience with rocket mortgage if I could change one thing it would be the discrepancy between department explaining things to us.  Almost every time we had a question the loan process department would say one thing and my loan officer would say another.  ", "rating": 4}, {"title": "Everything was explained very well and…", "text": "Everything was explained very well and at the signing the person who came to our house was very nice and helpful. The only issue is the system you use to do the documents online. Was not user friendly", "rating": 4}, {"title": "Please send us a hard copy with photos…", "text": "Please send us a hard copy with photos of our appraisal. We paid a lot of money for this and never received a copy!", "rating": 4}, {"title": "Good experience ", "text": "Good experience. Agent personable and helpful. Too much emphasis on lowering my monthly payment. Lower interest rate and consolidated debt was goal.", "rating": 4}, {"title": "My banker (Mathew Ross) did an…", "text": "My banker (Mathew Ross) did an absolutely outstanding job. He explained everything in a professional, knowledgeable, and easy to understand way and was always upfront about everything. I never felt like I was being led on and he was always able to answer any questions I had. He checked in regularly and anytime we reached a new milestone in the process he would always call me to check in. He is by far the greatest asset rocket mortgage had in my customer satisfaction. He is excellent at his job. My only complaint and the only reason for 4 stars instead of 5 is with the title work. My contact at Amrock did the best she could, but I felt like the underwriting at rocket mortgage kept giving me roadblocks and kind of led me astray. I ended up having to add my wife to the title which was a big decision and should have been told to me upfront. I also had to make adjustments to my survey. These unexpected surprises nearly killed the entire process. These required big changes and should have been told to me much earlier in the process, so I had time to work on them while I was waiting on approvals. This part was really frustrating and I was fortunate I was able to get my survey amended. My last complaint would be I was told this process would take 30-45 days and mine was closer to 70 or 80 days. your program made it seem I was nearly done after conditional approval and I was still over a 40 days away from closing with a lot of big changes being required still. The title work process took way longer than expected.  ", "rating": 4}, {"title": "Loan process went perfect as planned", "text": "Loan process went perfect as planned.  Electronic presigning documents was a complete failure.  Tried calling support … no one answered.", "rating": 4}, {"title": "I was pleasantly surprised at how easy…", "text": "I was pleasantly surprised at how easy it was to do everything online and not having to go into an office to get everything signed etc made it easy to schedule everything ", "rating": 4}, {"title": "Aracely was fantastic !", "text": "The people or person I work with were great. The process took longer than we thought it would. But all in all. Was great experience.", "rating": 4}, {"title": "Refinancing was a breeze", "text": "The process was incredibly simple and so straightforward that it made me pause, considering the abundance of scams these days. Unfortunately, my hesitation led to a delay in the process. Although I appreciate working with a team, having a single point of contact throughout the experience would have made me feel more at ease.", "rating": 4}, {"title": "I wish you all would tell your…", "text": "I wish you all would tell your customers to entire process. If I knew I was going to have to make so many repairs, I probably wouldn’t have done the loan ", "rating": 4}, {"title": "I was told my mortgage payment would be…", "text": "I was told my mortgage payment would be a LOT less after the refi than it actually is. Very disappointed. ", "rating": 4}, {"title": "Alex was phenomenal", "text": "Alex was phenomenal. The only issue I had was the address for the closing.  It was four states away at my sister in laws house.  Very confusing.  Found out it was a typo and was corrected thank goodness but scary for me.", "rating": 4}, {"title": "Everybody was great to deal with", "text": "Everybody was great to deal with.  The process was clear and ran smoothly with one exception.  It took too many days to be able to see the loan documents.  It wound up that we were forced to review them late at night on the day before closing.  Thanks!", "rating": 4}, {"title": "Great Loan Guy; Closing Team had a couple of issues", "text": "Jonathan Bonacci, my loan guy, was great.  He followed up on everything and was always available when I needed him.  The only issue I had was with the Closing Team.  They had my fiancé included in the loan as my husband, although we are not married and I never even mentioned him in any correspondence.  This was supposedly cleared up on 7/31, the day before the closing date, but at the time of the closing 2:30 PM on 8/1 the Notary from the title company said he was still listed on the documents. This resulted in a delay to 7PM on 8/1 to get the closing completed, which really was okay.  However, I then got a voicemail from Bradley from the Closing Team on Monday 8/5 asking me to reschedule my closing because they were showing it as canceled.  Meanwhile I had already received a \"Congratulations on your closed loan\" email from Rocket Mortgage on Friday, 8/2.  On Monday I also received text messages, and emails from the Closing Team members all asking me to reschedule.  I was in the hospital, so I could not return calls, but I replied to the texts and emails.  Then I never heard back from anyone again.  I was able to confirm that the funds were transferred to the requested account on 8/5, but just found it strange that no one ever followed up to say that everything was okay.", "rating": 4}, {"title": "I was disappointed they forgot a credit…", "text": "I was disappointed they forgot a credit card when doing my loan.  Not a big deal but surprised when i got my checks i was short one", "rating": 4}, {"title": "Everything was great with the exception…", "text": "Everything was great with the exception of the title company making me send the payment checks to my creditors. I feel the title company should have", "rating": 4}, {"title": "The procTHINGS TO DO LISTess was slow because of…", "text": "The process was slow because of incorrect information on the things to do list. It said you needed to do things that really didn't need to be done.", "rating": 4}, {"title": "Had a lot of steps to go through to get…", "text": "Had a lot of steps to go through to get to final close.  I was NOT given the closing statement 3days in advance so I didn’t get the opportunity to go through it.  ", "rating": 4}, {"title": "Talented and knowledgeable staff that…", "text": "Talented and knowledgeable staff that are always willing to help out!", "rating": 4}, {"title": "Everything was great until it was time…", "text": "Everything was great until it was time for disbursements. Checks did not arrive in time for me to make the payments when due. Water bill was 5 days late.", "rating": 4}, {"title": "It is a good company", "text": "It is a good company. It went very smooth and fast. The only thing I really don’t like about it is you can only pay your bill between the first and the 15th. Tree comes in after the 15th so I cannot use that so I can do an auto pay. I can’t do an auto pay because my Social Security check comes in after the 15th and the payments gotta be in before the 15th of the month, this part I do not like ", "rating": 4}, {"title": "Great Company to Refinance With", "text": "The ease of the process was great.  However, the sales reps can be overly aggressive!", "rating": 4}, {"title": "Mortgage he two", "text": "The two mortgage managers: Jeremy Sparkman and Colin Schroder. They were thoughtful, kind and knowledgeable. ", "rating": 4}, {"title": "every thing went fine except for the…", "text": "every thing went fine except for the disbursement of funds", "rating": 4}, {"title": "General ", "text": "Generally a good experience the only issues were I was originally told it would close in about 3 weeks but it was 7 weeks. Numerous items were requested several times including verifying my employment 3 times and HR said she talked to 3 different people and requested the last one verify by email that it was received. ", "rating": 4}, {"title": "Easy to work with", "text": "Easy to work with; very responsive. Annoyed with 3rd party solicitations for Life Insurance, Home Protection Insurance, etc. (quite a few!)", "rating": 4}, {"title": "refinacing", "text": "they did a good job with the refinancing, a little lax on explaining some of the stuff but all in all it was good.", "rating": 4}, {"title": "Daniel at Rocket Mortgage was…", "text": "Daniel at Rocket Mortgage was fantastic. Walked me through my loan process completely.", "rating": 4}, {"title": "Interest rate higher than initially…bit of a disconnect between mortgage broker and support.", "text": "Interest rate higher than initially quoted.", "rating": 4}, {"title": "Over all customer service was good", "text": "Over all customer service was good. Came up with closing numbers and payout that achieved what I needed ", "rating": 4}, {"title": "It was Great in the begining", "text": "It was Great in the begining. Then it was crickets. My CC are still not paid off. I have no idea when that may be accomplished. I am not happy with the process after closing. I have ZERO detils.", "rating": 4}, {"title": "my second mortgage", "text": "everything from the first contact to closing was handled by your staff with knowledge and efficiently. ", "rating": 4}, {"title": "Very easy to refinance our house!", "text": "It was easy for the most part. It was kind of annoying all the papers they needed so that took a long time. They also needed the documents for land we bought and sold for cash which made no sense. Everything else was a breeze. ", "rating": 4}, {"title": "It was nice to do most of it online.", "text": "It was nice to do most of it online.  ", "rating": 4}, {"title": "Great customer service", "text": "Great customer service, easy to understand instructions. A bit slow after closing to issue checks to creditors,", "rating": 4}, {"title": "Very easy process", "text": "Very helpful and made it super easy", "rating": 4}, {"title": "Sean was great", "text": "Sean was great.  We had to delay closing by 6 days because the “condo unit” was backed up which we found out the day we were supposed to close on.  Other than that very good.", "rating": 4}, {"title": "Easy and quick process", "text": "Easy and quick process, final closing didn't go well due to poor planning by individual coming to the house", "rating": 4}, {"title": "Very help personal", "text": "Very help personal. Very nice also. Time was a little long. Not a lot of communication. ", "rating": 4}, {"title": "It's always a pleasure working with…", "text": "It's always a pleasure working with such knowledgeable people. It was fast and easy. ", "rating": 4}, {"title": "robert luker was very helpful in…", "text": "robert luker was very helpful in obtaining this mortgage, he is very knowledgable and patient in explaining procedures", "rating": 4}, {"title": "Simplicity At Its Finest ", "text": "The app makes the process simple and easy. ", "rating": 4}, {"title": "Kyle was very helpful and made us feel…", "text": "Kyle was very helpful and made us feel comfortable ", "rating": 4}, {"title": "Pretty seamless experience", "text": "Pretty seamless experience. Ability to presign the paperwork so closing was short and sweet.", "rating": 4}, {"title": "Rocket Mortgage did a great job", "text": "Rocket Mortgage did a great job! Everyone was pleasant and very easy to work with.", "rating": 4}, {"title": "The process is seamless and easy but…", "text": "The process is seamless and easy but fees seem to be a bit high in my opinion. ", "rating": 4}, {"title": "Generally very efficient", "text": "Generally very efficient.  Was sent one incorrect closing statement with inflated figures but was rectified when called to your attention. ", "rating": 4}, {"title": " Trusts", "text": "Rocket should discuss issues related to irrevocable/revocable trusts to clients at time of initial contact so clients know what to expect. ", "rating": 4}, {"title": "Everyone was very knowledgeable", "text": "Everyone was very knowledgeable. Very kind and polite. The process is just a lot and hassle.", "rating": 4}, {"title": "Very helpful agents on Rocket Mortgage…", "text": "Very helpful agents on Rocket Mortgage team.  Always responded to inquiries quickly.", "rating": 4}, {"title": "Agency overall dedication to…", "text": "Agency overall dedication to Professionalism, and everyone was courteous. The process went smooth and faster than expected!!!", "rating": 4}, {"title": "They  will  take their time  with the…", "text": "They  will  take their time  with the customer  to get the job done ", "rating": 4}, {"title": "It was really stress free ", "text": "It was really stress free , faster I anticipate ", "rating": 4}, {"title": "Get your legal documents lined up first.", "text": "As long as you have your documents lined up this was a smooth process.", "rating": 4}, {"title": "Just submitted my paperwork and y’all…", "text": "Just submitted my paperwork and y’all did the rest.", "rating": 4}, {"title": "Everyone", "text": "Everyone, I doubt it was friendly, confident, and very helpful", "rating": 4}, {"title": "All of the people signed to help me did…", "text": "All of the people signed to help me did so with courtesy and promptness. ", "rating": 4}, {"title": "Everyone involved was super nice", "text": "Everyone involved was super nice. Communication could bd a little smoother, but overall a great experience ", "rating": 4}, {"title": "Overall", "text": "Overall, the process was fine. However, at times, we were not sure who is in charge.", "rating": 4}, {"title": "Most competitive rate.", "text": "Most competitive rate.It was inconvenient being moved to so many different brokers.", "rating": 4}, {"title": "Logan Mead was very informative and…", "text": "Logan Mead was very informative and always there to answer my questions. ", "rating": 4}, {"title": "Fast closing time", "text": "Fast closing time.  Great representatives.  Reasonable interest rates.  All around good experience.", "rating": 4}, {"title": "All went very smooth but felt a little…", "text": "All went very smooth but felt a little rushed signing agreement.", "rating": 4}, {"title": "The only problem I had with rocket…", "text": "The only problem I had with rocket mortgage was when the mortgage was done They sent me all the checks for the payoffs to all the cards and everything and I had to try to find the addresses print statements because I was online Bill pay for all of them and it was a lot of Bill pay for all of them and it was a lot of trouble to try to get all that done Disburse Refunds for me", "rating": 4}, {"title": "Home loan ", "text": "The people I worked with were professional. ", "rating": 4}, {"title": "Customer Service", "text": "Was great customer service", "rating": 4}, {"title": "Very professional and knew the answers…", "text": "Very professional and knew the answers to my questions ", "rating": 4}, {"title": "Great experience All of my questions were answered and…", "text": "All of my questions were answered and the process went smoothly", "rating": 4}, {"title": "Great Service", "text": "It was fast, smooth & seamless!", "rating": 4}, {"title": "We worked with James ", "text": "We worked with James , he was great kept us updated all the way through. ", "rating": 4}, {"title": "Fist time using ", "text": "Happy with process ", "rating": 4}, {"title": "Communication was good", "text": "Communication was good.  Closing was quick and easy.  ", "rating": 4}, {"title": "Too much communication", "text": "Too much communication, then not enough communication. overzealous agent requesting additional things that weren't needed, or applicable.", "rating": 4}, {"title": "They were great to work with ", "text": "They were so easy to work with and the process was very fast. Very friendly and helpful", "rating": 4}, {"title": "I just like the way Rocket Mortgage work", "text": "I just like the way Rocket Mortgage work ", "rating": 4}, {"title": "Helpful staff.", "text": "Helpful staff. ", "rating": 4}, {"title": "Fast and Easy", "text": "Quick and simple to refinance", "rating": 4}, {"title": "Ease of working with Rocket ", "text": "Good professional staff all around ", "rating": 4}, {"title": "The personal attention to this…", "text": "The personal attention to this transaction by my rep ", "rating": 4}, {"title": "Good Deal", "text": "Rocket closing is quick ", "rating": 4}, {"title": "Very easy and fast all on line", "text": "Very easy and fast all on line. Also no appraisal ", "rating": 4}, {"title": "Very quick and efficient process", "text": "Date of experience: July 19, 2024", "rating": 4}, {"title": "Be patient ", "text": "Everything went smoothly and was informed what I needed and when. ", "rating": 4}, {"title": "Excellent customer service provided…", "text": "Excellent customer service provided throughout the whole process. ", "rating": 4}, {"title": "They do what they say they will", "text": "Ton of activity at first and much less so at the end", "rating": 4}, {"title": "all were  very helpful", "text": "Date of experience: September 09, 2024", "rating": 4}, {"title": "The representative was detailed during…", "text": "The representative was detailed during the process and well informative. ", "rating": 4}, {"title": "Simplicity", "text": "It provided easy steps and a sigh of relief", "rating": 4}, {"title": "Helped with lack of internet experience", "text": "Date of experience: August 24, 2024", "rating": 4}, {"title": "Reasonable response time and relatively…", "text": "Reasonable response time and relatively smooth completion of the process ", "rating": 4}, {"title": "I need a copy of my mortgage please", "text": "Date of experience: June 09, 2024", "rating": 4}, {"title": "Staff was attentive and knowledgeable", "text": "Staff was attentive and knowledgeable ", "rating": 4}, {"title": "Everything went pretty  smooth and was…", "text": "Everything went pretty  smooth and was easy  to do  ", "rating": 4}, {"title": "Our experieince was good,", "text": "Our experieince was good, ", "rating": 4}, {"title": "It was really easy & quick", "text": "It was really easy & quick ", "rating": 4}, {"title": "It’s like refinancing !", "text": "Date of experience: July 14, 2024", "rating": 4}, {"title": "Everything went off without a hitch", "text": "Date of experience: June 09, 2024", "rating": 4}, {"title": "Great service", "text": "Fast and easy. ", "rating": 4}, {"title": "Easy to work with", "text": "Date of experience: August 31, 2024", "rating": 4}, {"title": "They worked with us", "text": "They worked with us ", "rating": 4}, {"title": "Fast", "text": "Fast, competetive", "rating": 4}, {"title": "Brian R.   Belmont", "text": "Brian. Royaine. Very professional ", "rating": 4}, {"title": "Responsive and communicated well", "text": "Date of experience: July 27, 2024", "rating": 4}, {"title": "Everything went fine", "text": "Everything went fine ", "rating": 4}, {"title": "All all very smooth", "text": "All all very smooth ", "rating": 4}, {"title": "Everything was good", "text": "Date of experience: June 15, 2024", "rating": 4}, {"title": "Pro people…", "text": "Date of experience: August 12, 2024", "rating": 4}, {"title": "Helpful and informative", "text": "Helpful and informative ", "rating": 4}, {"title": "Nice agents", "text": "Date of experience: July 27, 2024", "rating": 4}, {"title": "My experience was efficient", "text": "My experience was efficient. I would caution you to lock in your rate when YOU want to, not when your Rocket Representative wants to. In my situation, mortgage rates were on a downward trend and my rate remained locked while attempted contact with my rep went unanswered. ", "rating": 4}, {"title": "They would always reach out if I had…", "text": "They would always reach out if I had any questions and answered all my questions ", "rating": 4}, {"title": "everything went smooth and on time", "text": "Date of experience: July 05, 2024", "rating": 4}, {"title": "easy application", "text": "easy applicationGood follow up", "rating": 4}, {"title": "My loan officer was great", "text": "My loan officer was great. The only reason I didn’t give five stars was the lengthy time between starting the process and closing.  I really needed the cash sooner. ", "rating": 4}, {"title": "The process didn't work as planned", "text": "The process didn't work as planned.  The computer connection didn't connect, and it took about an 45 minutes to switch to an in-house visit.  The notary for the in-house was great and efficient.  It took only a few minutes to complete and we finished in one day.", "rating": 4}, {"title": "Home Sweet Home", "text": "I would definitely recommend Rocket Mortgage to others. They did everything they said they would do and more. My loan officer, Bill Ballard deserves five stars. Even after three years of my being unable to find a suitable home he hung in there and kept working on it.", "rating": 4}, {"title": "Quick response during the process", "text": "Quick response during the process, my only concern was the changes in numbers near the end.", "rating": 4}, {"title": "Good but could have better", "text": "My experience was good.  It could have been better.  I was told the APR range and the rate ended up being higher.  I feel the fees that were charged could have been lower.  The positive is communication was good and the loan closed on time.", "rating": 4}, {"title": "Rocket Dropped the Closing Ball", "text": "We started the process May.  When the time came for ua to get pay-off to the credit union on our to-do list, we did so promptly.   We kept waiting for a closing date.  Called Rocket and were instructed to call AmRock because you were waiting on them.  Called AmRock and were told they were waiting on Rocket.  Rocket dropped the ball.  If I had not contacted you about our closing I feel like we would still be waiting,  Enjoy working with Rocket but this time was a little exasperating. ", "rating": 4}, {"title": "Very knowledgeable and helpful people", "text": "Very knowledgeable and helpful people. Process was seamless. There were some extended periods where nothing seemed to be going on which caused a bit of stress.", "rating": 4}, {"title": "Rob wood was fantastic and an absolute…", "text": "Rob wood was fantastic and an absolute pleasure to deal with. When he had to take off for personal matters his team of Lo and Jacob stepped up and got the job done. My only gripe was the underwriting department. I understand their function but they are very unorganized no one communicates properly. I had 10 different people in my file  asked me for the same info multiple times. Luckily I was only delayed a week. If it wasn't for Rob , lo and Jacob this wouldn't have gotten done ", "rating": 4}, {"title": "Nothing more to share.", "text": "Nothing more to share. ", "rating": 4}, {"title": "Great refinance experience. ", "text": "The refinance experience was great. We lowered our interest rate which saves us money now and in the long run. The process was quick wirh Rocket and other things that were out of Rocket's control took a little time. I later learned there were other options I may have qualified for to refinance with zero closing costs however we are saving money.", "rating": 4}, {"title": "The whole team", "text": "Date of experience: July 06, 2024", "rating": 4}, {"title": "Very Helpful", "text": "Other than one unclear communication everything was great! ", "rating": 4}, {"title": "Make sure to get all information at the very beginning ", "text": "There was alot of good things that happened while my wife and I were going for a house with them. They were mostly upfront with things just needed to work on making sure that everyone is trained the same way so that way it doesn't get someone's hopes up that they can go with a certain type of mortgage and then fine out during the process that it wasn't the right one for them. Started out with a VA loan and had to switch part of the way through the process to a FHA loan instead due to not meeting the qualifications for the VA loan.  Which was ok, but make sure that you give all information when asking for their help.  Helped with getting credit to where it needed to be in order to get a house at all, so I am thankful for that.  Just make sure when talking to someone that you make sure that what your going for to get ALL INFORMATION AT THE BEGINNING. That way your not having to try to change it when you go to put an offer into a house.", "rating": 4}, {"title": "Experience went fairly well", "text": "Experience went fairly well. But I was asked to jump through hoop after hoop after hoop. And some was totally unnecessary. ", "rating": 4}, {"title": "It was an easy", "text": "It was an easy, straight forward step by step. ", "rating": 4}, {"title": "First of all Rocket Mortgage is top class-act ! …", "text": "First of all Rocket Mortgage is a class-act organization. Brynn Locke realtor sale manger is professional, honest,knowledgeable and helpful.She has a wonderful personality with a nice sense of humor.  Brynn assured me that the loan process will workout smoothly. She constantly kept me informed during the loan process. Especially with Military Arm forces she is very knowledgeable about VA loan and benefits. Thank you for your services. ", "rating": 4}, {"title": "Very easy experience.", "text": "Very easy experience. ", "rating": 4}, {"title": "My loan officer was great", "text": "My loan officer was great! It came down to the wire for me to close at the expected date and it was made possible. This was a stressful first time home buyer process but I’m glad I went with Rocket Mortgage. ", "rating": 4}, {"title": "Great customer service", "text": "Great customer service ", "rating": 4}, {"title": "Everything was done smoothly", "text": "Everything was done smoothly, the mortgage advisor was patiently with me. They did all the paperwork electronically. Time frame was fast. Definitely 👍🏿 recommender it.", "rating": 4}, {"title": "Great BUT", "text": "I was easy but the only think is they kept adding more and more for me to do. They would say I’m done then say they needed more info. I was court ordered time pressed for a refinance. Initially I was making it just in time. However, I believe ducks weren’t in a row (not on my end) I now have incurred  not only expedited fees to getting info they needed to close, but also, interest rate extension fees, and attorney/court fees because of the delay. It’s nothing I can’t handle but it is another $1,000 I didn’t need to pay if everything was laid out upfront.", "rating": 4}, {"title": "There was an issue with the final…", "text": "There was an issue with the final numbers and last minute information was needed. Then instead of me getting money back at closing I ended up oweing and my total mortgage payment went up to fix the error in the final numbers. Otherwise the rest of the process was ok.", "rating": 4}, {"title": "Quick easy pleasant experience", "text": "Quick easy pleasant experience ", "rating": 4}, {"title": "We closed within 30 days", "text": "We closed within 30 days. However you waiting to almost the end to ask for a well test. In my area there is only one testing lab within a 100 miles. Fortunately I paid him up front and practically beg him to come out. We found all people we interacted with to be very knowledgeable and very nice. I will definitely recommend your company to everyone that asks.", "rating": 4}, {"title": "I gave it a 4 because of their…non-judgemental ", "text": "I gave it a 4 because of their professionalism & helpfulness & non-judgemental. There was however a snag with the process, it took longer than we anticipated, might be because, the inspector didn't do so well w/ the pictures he provided.", "rating": 4}, {"title": "There is too much repetitive emails and…", "text": "There is too much repetitive emails and “things to do”. The closing could have been better… had to wait and have an actual person come to the house… just do it that way to begin with with!!!", "rating": 4}, {"title": "Zoe is great.", "text": "Zoe really helped all through the process.  The reason I didn't give it 5 stars is because things kept changing and I dealt with an agent in closing that was unprofessional. ", "rating": 4}, {"title": "Transparency", "text": "All information was transparent.  They were timely, and considerate.  There were tools on line to assist.  If you had questions and submitted late in the evening, the following morning you either had an answer or a call.", "rating": 4}, {"title": "Andrew was great ", "text": "Andrew was great . Last few days were horrible . A phone call I expected tge day before closing never came thru.  I was unable to make a wire transfer to the closing attorney.  I reached out to my contacts with no response . My five creditors weren't payed off in full as agreed.  ", "rating": 4}, {"title": "Nadine was great!", "text": "Nadine was great!! She took the time to explain what was needed from me and why.  Very understanding person. She listened to me.", "rating": 4}, {"title": "Very easy to work with.", "text": "Date of experience: July 01, 2024", "rating": 4}, {"title": "Got it done.things went smooth.got…", "text": "Got it done.things went smooth.got information as needed", "rating": 4}, {"title": "The experience was somewhat seamless", "text": "The experience was somewhat seamless, more from the beginning than towards the end. Intake and follow up team was great. Closing team needs some work.Overall I am happy and would recommend the Rocket Mortgage to my family and friends.  ", "rating": 4}, {"title": "Very friendly", "text": "Very friendly. Made you feel at ease", "rating": 4}, {"title": "I loved working with Rocket Mortgage", "text": "I loved working with Rocket Mortgage. They worked hard to make sure I was able to get approved for something. The only downfall was that you work with 3 different people throughout the process and sometimes there were inconsistencies with what was needed and how it was needed. However, nothing that ever hindered the progress of the loan! ", "rating": 4}, {"title": "Loan officer worked very hard to get us our loan. ", "text": "The staff was great to work with.  Communication was a struggle. At times I left voice mail messages which were not returned.  I also struggled with being passed between different staff members.  I was extremely impressed with the loan rate I received and how our loan officer worked to find the best finance options for our particular circumstances. ", "rating": 4}, {"title": "The loan process was quite easy and…", "text": "The loan process was quite easy and pretty quick. Our MB, Tom Savage, is always very helpful, goes above and beyond and knows his $h!t! He pulled some strings to explain logic to an UW that may have been pretty new. As I know that certain things can be waived or looked at with common sense or a good explanation, having worked for QL/RM.", "rating": 4}, {"title": " Refi closing", "text": "Eman who did all the loan stuff in the beginning was great. We didn’t really have communication when it got to be time to close. We felt VERY frustrated with trying to do the closing by mobile phone. ", "rating": 4}, {"title": "Everything was very well written out…", "text": "Everything was very well written out and upfront, the fees were a little higher than our normal bank, but since we already had our mortgage with rocket, we went ahead and stayed with them. Very smooth experience.", "rating": 4}, {"title": "All great until approaching Closing", "text": "All great until approaching Closing, then so many different entities that I couln't keep \"the players\" straight...too many different teams!!! Pls call me - Duncan Hoffman 917-687-4723", "rating": 4}, {"title": "The Experience wasn't all that bad but…", "text": "The Experience wasn't all that bad but it was a little difficult to work the technical end of it I had trouble with my phone and you had some very good Representatives but I had trouble understanding a lot of it and I had to keep calling in and find out more and for some reason I couldn't get on the pages that you sent me the document files and so on like that give me a lot of trouble other than that it was pretty good", "rating": 4}, {"title": "Like the first step with Mike", "text": "Like the first step with Mike. Like the step by step process and feedback at each step. Closing went smoothly. Two issues with Amrock. 1. Nobody at the office for two days. Didn’t get the closing attorney’s cell number. 2. Would/should have paid the bills directly rather than sending me the checks to send out causing a delay in the payoffs.", "rating": 4}, {"title": "The company was responsive Our agent…", "text": "The company was responsive Our agent was easy to work with and helped us to get our loan.", "rating": 4}, {"title": "Outstanding ", "text": "Outstanding help on making this loan happenThanks Again John Zocka. With out him this would have never came together.Thanks Kenneth P. Maxwell & Karman", "rating": 4}, {"title": "Refi was easy", "text": "Refi was easy, especially being a repeat customer. Only minor issue is the closing (online vs. in-person) was said to be able to be chosen at the scheduling of closing. Desired in-person, but apparently the selecting method was not clear, ended up online by default, never saw the option to choose. That said, the online closing went smooth and was painless.", "rating": 4}, {"title": "Great Experience", "text": "The people were very helpful, knowledgeable, with the whole process.", "rating": 4}, {"title": "The reason for the 4 is because of…", "text": "The reason for the 4 is because of longivity. 3 months to complete the loan. Too lonf.", "rating": 4}, {"title": "2nd Morg.", "text": "Instead of sending the checks to me to pay off my debts, you could have done it digitally and saved a lot of time. ", "rating": 4}, {"title": "They kept us up to date", "text": "They kept us up to date.  Also the closing kept getting pushed by..", "rating": 4}, {"title": "Everything went smoothly", "text": "Date of experience: July 01, 2024", "rating": 4}, {"title": "Julian was the rock that made it happen…", "text": "Julian was the rock that made it happen easily! Only problem was with the appraiser who under estimated the true square footage and only counted three of our four bathrooms. He should not be used again! Otherwise, the experience was a very good one.", "rating": 4}, {"title": "Overall a positive experience", "text": "We had a few issues along the process, but overall, it was a positive experience. The customer service team were quick to step in when the issues came up, and we got everything settled and moved forward with the loan.", "rating": 4}, {"title": "Landry walker was great he helped me…", "text": "Landry walker was great he helped me get through this I'm not computer wise and he made very less stressful for me ", "rating": 4}, {"title": "Easy process to get the loan done", "text": "Easy process to get the loan done ", "rating": 4}, {"title": "I believe the process was seamless", "text": "I believe the process was seamless. The closing did not go so well.  The closing was virtual and the notary internet connection was unstable and it was rescheduled several times.  I was told I would have to do my closing in person.  The rocket lawyer account showed the closing was completed.  It was confusing. I followed up for confirmation.  I did not receive one.  A few days later I received a few checks in the mail.  I never received an explanation to summarize what happened with the closing. ", "rating": 4}, {"title": "Szabo Loan", "text": "The Loan process from beginning to end was managed well and communication was clear throughout. The only negative was after the loan was closed and documents executed the communication was not consistent and there was no follow up by Rocket Mortgage providing an update or to answer questions.", "rating": 4}, {"title": "Loan Payoff's with physical check?", "text": "Everything about the loan process was seamless with the exception of the loan payoff's were made by sending us physical checks we had to then certify mail, rather than ACH being issued directly from Rocket Mortgage. In 2024 this just seems an unnecessary hassle.", "rating": 4}, {"title": "Moe Hassan was a pleasure to work with", "text": "Moe Hassan was a pleasure to work with. Very knowledgeable, patient and a good listener.", "rating": 4}, {"title": "Good Experience", "text": "Overall satisfied with using Rocket for my fiancée and I's first home purchase. The online dashboard was very helpful and monitoring our To-Do list really kept us updated on what needed to be done throughout the entire process. ", "rating": 4}, {"title": "Good communication", "text": "Good communication, prompt action", "rating": 4}, {"title": "Everything went well with the loan…", "text": "Everything went well with the loan process. Matt worked with me to get the loan we needed. The only problem was with the virtual closing. A little hiccup there.", "rating": 4}, {"title": "Efficient ", "text": "Providing updated information & requesting information via the website was extremely helpful. ", "rating": 4}, {"title": "Patient and caring for your needs ", "text": "I had a very caring loan officer who help me through the process,I will highly recommend him to any first time home buyer. And the staff from Rocket I had were very helpful and answered my questions even as silly as some were. In total they were very patient with me given the language barrier. Thank you Rocket Mortgage, I had you at the right time I needed.", "rating": 4}, {"title": "You have too many people looking at it…", "text": "You have too many people looking at it for too long a time.", "rating": 4}, {"title": "Easy to work app", "text": "Easy to work app. Made it easy to keep an informative eye on the process", "rating": 4}, {"title": "Good Experience", "text": "Good, efficient process.  Felt some fees could be lower. Overall, a good process.", "rating": 4}, {"title": "Great people to work with! ", "text": "Easy process & axing staff to work with! ", "rating": 4}, {"title": "Alex the person we had was Great ", "text": "Alex the person we had was Great always answered questions we had and got us what we needed and asked for. We have been with Rocket for years.Our only problem is Rocket doesn’t take that into consideration and took my wife off the loan when nothing had changed credit wise. ", "rating": 4}, {"title": "Very good", "text": "Very good. Took a little long, but thorough. ", "rating": 4}, {"title": "They helped us get the money we needed…", "text": "They helped us get the money we needed toake repairs on our home.", "rating": 4}, {"title": "Everything was great besides it taking…", "text": "Everything was great besides it taking 2 weeks to process equity loan.", "rating": 4}, {"title": "Our experience with Rocket mortgage…", "text": "Our experience with Rocket mortgage overall was a good experience. Kogmy and Randell were wonderful to work with. Our one difficulty was with the condo team. The issue was the insurance policy for the condo, they were looking at the old policy, even when a new one was submitted to them two weeks prior it was until our realtor Tina Dore who was wonderful to work with helped every step of the way. A good recommendation from Rocket stepped in took action and called herself and brought this to their attention. This could have caused issues in our closing. We were forced to pay rate lock. Fortunately we had a closing team that was helpful. ", "rating": 4}, {"title": "Slow to fund", "text": "Slow to fund", "rating": 4}, {"title": "Overall experience was good but…", "text": "Although the experience was good I felt like I was buying a used car in the 70s at times there was a high pressure feeling and a little uncomfortable. I know that time is important but when I mentioned shopping around” the pressure was on”", "rating": 4}, {"title": "Easy", "text": "Easy. Online.", "rating": 4}, {"title": "Eric was great he worked consistently…", "text": "Eric was great he worked consistently on our loan and kept me updated. He answered our questions thoroughly and was never impatient or angry. ", "rating": 4}, {"title": "Cody was very responsive every time i…", "text": "Cody was very responsive every time i had a question and explained the process thoroughly.He was quick in getting the process moving along and i closed pretty quickly.", "rating": 4}, {"title": "Pretty good except for the end closing", "text": "The loan officer was great. The process went smooth, but closing agent was unorganized and late. It takes a while to complete the process after closing too. ", "rating": 4}, {"title": "Creditors payoff", "text": "I'm not a person that do this type of transactions electronic but everything went smooth. The only problem we had was the checks that was printed for our creditors.  The credit report had a few of our creditors listed in different names.  I think we should have given them a copy of our statements, therefore they could have made the checks out to the right company and for the correct amount.", "rating": 4}, {"title": "They did a great job", "text": "They did a great job, but they kept asking for the the same information that they were already given ", "rating": 4}, {"title": "Smooth procedure throughout the process.", "text": "Date of experience: June 27, 2024", "rating": 4}, {"title": "You always on top of things to and the…", "text": "You always on top of things to and the todo list is great.the one thing that made me me mad is you checked my credit report 2 time and that dropped my rating You had no reason to do it in my opinion...", "rating": 4}, {"title": "Process was easy", "text": "Process was easy. Team was responsive", "rating": 4}, {"title": "Finally got it done after what I…", "text": "Finally got it done after what I consider to be an unusual amount of due diligence. ", "rating": 4}, {"title": "Always room for improvement", "text": "Always room for improvement ", "rating": 4}, {"title": "It was a nerve wracking experience.", "text": "It was a nerve wracking experience.But everyone was very helpful and made it A rewarding experience", "rating": 4}, {"title": "Fast", "text": "Fast. The process was fast.", "rating": 4}, {"title": "Took tooooo long to close", "text": "Date of experience: June 30, 2024", "rating": 4}, {"title": "EASY PROCESS", "text": "Nick Colucci, loan originator was very knowledgable and helpful, very good to deal with.The document collectors not so much. I told them ever time that I could not access my account on line to no avail, sure I'm missing some information.", "rating": 4}, {"title": "Had a great experience", "text": "Had a great experience! The problem is after  you close, don’t expect to hear back if you have any questions. When it’s done, it’s done.  Otherwise, during the process everything was wonderful!", "rating": 4}, {"title": "The loan process was fast", "text": "The loan process was fast. I was explained to about the process of the loan well. I'm pleased with the work that was done. ", "rating": 4}, {"title": "Rocket Mortgage is a machine", "text": "Rocket Mortgage is a machine. That being said it is a very efficient machine and they do an excellent job of keeping you on task and on schedule. I have one complaint and that is, like many other companies, the employees speak in the language of their industry and wrongly assume everyone knows that language. We don't. Being an online platform it is more difficult to make the human connection needed to establish a trust relationship, but most do and that is refreshing. ", "rating": 4}, {"title": "The whole process was easy and they…", "text": "The whole process was easy and they walked you through the whole thing.", "rating": 4}, {"title": "Loan is finally closed, and All is Well!", "text": "This is my second mortgage with Rocket, and it was not nearly as easy as our first mortgage was, mostly due to communication as to what, if anything, was happening.  We wanted to use some equity in our home to finance some dental damage that happened to my front teeth.  We were advised we could get the money by the end of Aoril, when it was almost the end of May when it was closed, plus no-one could tell us what was holding it up.  Nerve-wracking.  But then it closed fast and without a problem.  Teeth are fixed, waiting for healing before fina work is done, and paid for with the second mortgage from Rocket.  ", "rating": 4}, {"title": "Reps made sure they kept in touch and…", "text": "Reps made sure they kept in touch and up-to-date on most important information", "rating": 4}, {"title": "Very understanding and helpful.", "text": "So overall Rocket and their representative, Owen, did a great job. It was a bit of a slog to get to the finish line but I did get there. Very knowledgable rep's and patient as I needed a fair amount of direction to keep things going. Appreciate their professionalism and friendliness.", "rating": 4}, {"title": "The people were great!! paper work slow!!", "text": "The people were great!!only complaint is I asked for copies of all paper work and they said they would send them but it has bee a couple of weeks and I still don't have all the copies???? If you say I will then do it!!!! Don't send emails I can not reply to!!!!!", "rating": 4}, {"title": "Stayd on task", "text": "Stayd on task. Kept us up to date on process", "rating": 4}, {"title": "The ease and simplicity of the…", "text": "The ease and simplicity of the experience. ", "rating": 4}, {"title": "One of the best", "text": "Date of experience: June 23, 2024", "rating": 4}, {"title": "Ryan was the difference maker", "text": "Ryan was the difference maker. He was available to answer questions and was quick to reply. ", "rating": 4}, {"title": "Very knowledgeable about the information", "text": "Very knowledgeable about the information ", "rating": 4}, {"title": "The usual great experience", "text": "The thoroughness of making sure I got the best available rates and financing.", "rating": 4}, {"title": "Everything went very smoothly", "text": "Everything went very smoothly. Isaiah was excellent with customer service. Would like to have gotten a lower interest rate.", "rating": 4}, {"title": "The improve communication process was longer then our first…", "text": "The process was longer then our first mortgage. Communication could have been improved as things we needed to do, which was timely, could have been assigned early while Rochet was doing their investigation. ", "rating": 4}, {"title": "did good job", "text": "we were happy with the good work they did", "rating": 4}, {"title": "Easier than I expected", "text": "This refi was fast and essentially drama free. The system works well. Everyone was kind and helpful. My only beef was that something awful happened to to one guys family and another just vanished without warning to go on vacation.Otherwise I would recommend Rocket to anyone with a fairly simple refi to use them.", "rating": 4}, {"title": "The process was made fast and easy…", "text": "The process was made fast and easy due to the app and the communication from the people at rocket. I do wish that they sometimes explained some things better (ex: who I contact for what questions and such) but overall the process was smooth and I closed on the same day that I was estimated to. Would use again. ", "rating": 4}, {"title": "Home blessing ", "text": "Had some good experience and bad ", "rating": 4}, {"title": "The people was very professional and…", "text": "The people was very professional and nice ", "rating": 4}, {"title": "Closed on time.", "text": "Date of experience: June 27, 2024", "rating": 4}, {"title": "Overall Good Experience ", "text": "The experience was great because it was well organized and transparent. The staff were friendly and responsive. The process was easy. When we started, we were proposed a very bad loan, but they worked with us until satisfaction. 4 stars instead of 5 because there is room for improvement. For some of us who have to send checks to pay creditors, I wish there were a better way. Some of my checks payments got lost or reached creditors late.", "rating": 4}, {"title": "Easy Process", "text": "Easily done on the web.  Did take longer than anticipated but was smooth process.  When it was time to schedule closing we were able to do to so while on vacation.  They arranged everything, we just had to pick when and where.", "rating": 4}, {"title": "It was well mapped meaning each step…", "text": "It was well mapped meaning each step was properly timed and executed very well ", "rating": 4}, {"title": "It’s done", "text": "It would be five stars; however, the underwriting team dropped the ball which resulted in a lot of duplicate and unnecessary work for me. Really, you should be getting 3- stars. ", "rating": 4}, {"title": "Fairly easy to navigate", "text": "Fairly easy to navigate. Great help from my account manager Mike. He was good to work with.", "rating": 4}, {"title": "Rocket Mortgage does a great job…", "text": "Rocket Mortgage does a great job through the whole process. Very friendly, very prompt.  This is our second mortgage with Rocket.  Website is great too.", "rating": 4}, {"title": "After a bit of confusion", "text": "After a bit of confusion, our needs were met.", "rating": 4}, {"title": "Satisfied", "text": "A few bumps here and there but, overall, I am quite satisfied ", "rating": 4}, {"title": "The entire process is very simple and…", "text": "The entire process is very simple and easy to complete. ", "rating": 4}, {"title": "Quick", "text": "Quick, easy and knowledgeable agents⁸", "rating": 4}, {"title": "Everything was pretty quick and easy…", "text": "Everything was pretty quick and easy and everyone was extremely helpful and friendly. The closing costs were a bit higher than expected but all in all it was a good experience!", "rating": 4}, {"title": "It seemed like it took forever to get…", "text": "It seemed like it took forever to get what they needed from me. Mostly because I was working full time and at times was hard tracking down old W2’s and other things. But their people I was working with would wait till 7 or 8pm on me to call them with things they needed because I couldn’t do it during regular business hours. So everyone was patient and we got thru it. And they never got aggravated or out of line when it took me weeks sometimes to get things for them. Very professional and I’m glad to be with them. ", "rating": 4}, {"title": "Just wish the company had paid all the…", "text": "Just wish the company had paid all the bills and not mail the checks to me ", "rating": 4}, {"title": "This took too long to finish", "text": "Date of experience: June 20, 2024", "rating": 4}, {"title": "For an explanation of rating a customer…", "text": "For an explanation of rating a customer service rep should contact by phone. ", "rating": 4}, {"title": "Time management with your agent ", "text": "Good rapport , good teamwork", "rating": 4}, {"title": "Kory patient", "text": "Kory patient, and great to deal with.", "rating": 4}, {"title": "All and all a great process", "text": "All and all a great process. I just would have liked when the value of my home came in lower to receive a call and discuss options. I am still pleased with the overall process. However please take note of my issue above. ", "rating": 4}, {"title": "The complete process was flawless and…", "text": "The complete process was flawless and easy. My loan agent was a really informative guy!", "rating": 4}, {"title": "Our lender Kevin Bell made the whole…", "text": "Our lender Kevin Bell made the whole process effortless and least stressful as possible! ", "rating": 4}, {"title": "The process was quick and timely", "text": "Date of experience: June 21, 2024", "rating": 4}, {"title": "Helpful in all transactions.Easy to…", "text": "Helpful in all transactions.Easy to work with. Personable ", "rating": 4}, {"title": "Everything seemed to be planned out…", "text": "Everything seemed to be planned out well to facilitate a quick closing. It wasn’t quite as quick as was promised at the beginning. But still quicker than the last time we refinanced. And the communication throughout was good. We feel like we got what we wanted out of the deal. ", "rating": 4}, {"title": "My only issue was with the notary", "text": "My only issue was with the notary, he wanted to talk politics. ", "rating": 4}, {"title": "I had to find out when my dets was…", "text": "I had to find out when my dets was being paid and some information wasn't given correct to to loans , wasn't necessary Rocket mortgage think it was second party, but other than that everything was great ", "rating": 4}, {"title": "My rocket experience", "text": "Overall, my entire experience was extremely fast, Easy to follow, With great communication and follow up. ", "rating": 4}, {"title": "The only thing that would improve the…", "text": "The only thing that would improve the overall experience would've been to show the different mortgage options (i.e. 15 year vs. 30 years). ", "rating": 4}, {"title": "Everyone at Rocket was great from start…", "text": "Everyone at Rocket was great from start to finish.  I would give it a 5 star but the closing agent wouldn't let me sign for myself.  He just kept clicking and left.  I still don't have the paperwork.", "rating": 4}, {"title": "Speedy service!", "text": "The process speed increased only 18 days from 1st call to close,  getting humans to answer phone call not AI. All folks were pleasant not rushed to hang up.", "rating": 4}, {"title": "Process took longer than explained", "text": "Process took longer than explained. Asked for documents already submitted from the previous loan.", "rating": 4}, {"title": "Overall, a very good experience ", "text": "Overall, our experience was great; especially the friendly knowledge help from those we spoke with. There were however, several times where our progress was delayed when a different group asked for the same information and documentation we had already given to a previous group. This delayed concluding our final approval and getting payoff checks out to creditors. This caused us to be late on paying or having to dig deeper to make another payment. All groups should review a common set of documents before asking. ", "rating": 4}, {"title": "The reps' were very helpful", "text": "Date of experience: June 20, 2024", "rating": 4}, {"title": "Quick work and everything was well…", "text": "Quick work and everything was well organized at every step.", "rating": 4}, {"title": "It was easy to navigate the process and…", "text": "It was easy to navigate the process and was finished very quickly.", "rating": 4}, {"title": "You're people were helpful", "text": "You're people were helpful. And very nice to talk to. There wasn't any big hoops. To jump through. The closing fees were a bit higher than expected owe well but overall a pleasant experience. Thanks paul hewson ", "rating": 4}, {"title": "The appraisal came in much lower than…", "text": "The appraisal came in much lower than expected resulting in not being to get the amount of cash that we needed to complete our plan. Communication was very good and all were helpful during the process.", "rating": 4}, {"title": "Greg was great to work with", "text": "Greg was great to work with.  The process was straightforward and fast.", "rating": 4}, {"title": "Fast service to complete my refinance", "text": "Fast service to complete my refinance. Evan was awesome to work with ", "rating": 4}, {"title": "The people were easy to talk to and…", "text": "The people were easy to talk to and contact. Some of the documentation requests weren't clear on what was a needed. I also had to resubmit items I previously submitted. ", "rating": 4}, {"title": "Everything was great until it was to", "text": "Everything was great until it was time to pay off our credit cards. We didn’t have a lot of them in hand and received on line statements. Getting the full account numbers was not easy, we worked on this for 2 days. We delivered them to the post office and are still waiting to see if they were posted to our accounts.  That was the most difficult part and now we wait. ", "rating": 4}, {"title": "Easy process ", "text": "The process was easy. ", "rating": 4}, {"title": "Quick and nice people!", "text": "Fairly easy process and for us it was pretty fast.  People are nice and responsive.When we hit a couple of snags our rep got involved and helped out.  I felt like the snags should have been easier to resolve but the secondary characters are not as responsive or helpful so it starts to make the experience less positive.Then in the end all the online ease goes out the window in closing when paper checks and the mail gets involved.  I suggest they tweak the end process and get IT to figure out a way to make payoffs electronic.", "rating": 4}, {"title": "good service throughout the process…", "text": "good service throughout the process except for the 'final' steps.  The need for us to send out the payoff checks was annoying, understandable why, but an annoying step.", "rating": 4}, {"title": "Satisfied customer", "text": "I chose Rocket because they have made the process simple in the past.", "rating": 4}, {"title": "My Rocket mortgage experiencee ", "text": "Professional service friendly communication loan officer knew her job ", "rating": 4}, {"title": "Everything was great", "text": "Everything was great, and everyone that was involved answered our questions accordingly. However, there were a few accounts that Rocket Mortgage saw on the credit report that needed to be paid off and I informed closing that they were paid in full but now, we have checks for accounts without balances. Other than that, it would have given 5-Stars. ", "rating": 4}, {"title": "Nearly Painless Process ", "text": "Quick response, approval, and disbursement of funds.", "rating": 4}, {"title": "Smooth Closing", "text": "Each step was minimal as it relates to the final closing.  We never had to wait for a return call. The Processing and the Client Relations teams were there to answer all our questions and they both did it in a timely manner.", "rating": 4}, {"title": "Jacob Sapolin was great to work with", "text": "Jacob Sapolin was great to work with. He stuck with us until we got it done!  We had our fair share issues, he missed a couple deadlines so I call that all good. Dealing with the processor wasn’t that great. Communication wasn’t good, they would ask standard questions requesting information which made getting the information correct the first time very difficult so I feel like I had submit paperwork more than once because they were not clear on what they wanted. Dealing with them was very very frustrating and difficult. We went back and forth with Andrew over the word inspector vs contractor. He was requesting a bid from a contractor but kept using the term inspector. Jacob had to get involved just to get clarification and it took 2 phone calls from Jacob for clarification things like made it difficult. ", "rating": 4}, {"title": "Communication was excellent and speed…", "text": "Communication was excellent and speed of loan was great. Only draw back was appraisal wasn’t readjusted for closing. Price was lower than estimate and we ended up paying estimated cost due to the fact that we didn’t want to wait another week for a new closing date ", "rating": 4}, {"title": "Everyone was very knowledgeable and…", "text": "Everyone was very knowledgeable and lended the best option to meet our needs.  The process was quick and easy! ", "rating": 4}, {"title": "Overall the experience with Rocket…", "text": "Overall the experience with Rocket Mortgage went great. Only thing that  perplexed me was the amount of time it took to verify my employment.  At first I thought it was my employer that might be hard to reach but after conducting a verification myself that was not the problem.  ", "rating": 4}, {"title": "At the beginning", "text": "At the beginning, we said we wanted all our bills paid off.  All of them except for one our Home Depot account was not included, and no one bothered to tell us about it.", "rating": 4}, {"title": "Quick and knowledgeable people to work…", "text": "Quick and knowledgeable people to work with.", "rating": 4}, {"title": "Good!", "text": "Our Banker was awesome, she helped us through  the process we otherwise didn't understand.  One thing I would say if it's a refinance or money out that you need to make sure the home is in good shape which will make the process go much smoother.  Because once they come out and repairs need to be made that will delay the process!  ", "rating": 4}, {"title": "How quickly and smooth the process…", "text": "How quickly and smooth the process went. The experience could be better if Rocket Mortgage could pay off creditors directly online. ", "rating": 4}, {"title": "We had our loan really fast", "text": "We had our loan really fast. The team we worked with was very helpful and answered all our questions.", "rating": 4}, {"title": "Easy loan process, but disbursement issues ", "text": "Loan process was easy and my rep Trever  Hancock was amazing once again!My only complaint is the debt reduction process. To have to mail each creditor a paper check, and not even be able to take the check in person is archaic and inefficient in 2024!!!", "rating": 4}, {"title": "Simple and Easy", "text": "The process was simple and easy to apply. Much easier than dealing with big banks. We had one hiccup in underwriting but someone at Rocket Mortgage caught the issue and fixed it. It delayed closing but I was happy about the overall process.", "rating": 4}, {"title": "Y'all worked with us", "text": "Y'all worked with us and were timely with any questions. ", "rating": 4}, {"title": "Was fine", "text": "Was fine, Ashley was helpful for the entire process. Did not like the fact there was a security breach on my account. They fixed  it though", "rating": 4}, {"title": "Customer service ", "text": "Everyone was very helpful, just a few changes for better customer service.Suggestions: When my account was being handed off to the next person/process - communication was not good. Make that process more understandable.Also, relate to people of different levels better. Levels meaning: if someone has already purchased a home in their lifetime.", "rating": 4}, {"title": "I’m satisfied with the process of…", "text": "I’m satisfied with the process of little bit transparent even I had some issues different times about the interest rate and the number but I still put you on the top ", "rating": 4}, {"title": "My underwriter helped to adjust ", "text": "My underwriter helped to adjust my loan amount when the appraisal came in lower than expected.I thought that would've ended the loan process", "rating": 4}, {"title": "Good not great", "text": "The initial discussions were challenging because I was not receiving the service and attention expected. Luckily it improved over time.", "rating": 4}, {"title": "Communication was good until we signed…", "text": "Communication was good until we signed the papers on June 5. Disbursement was supposed to happen June 10. It did not occur until June 12 but we were charged daily interest from the 10th.  ", "rating": 4}, {"title": "Not impressed ", "text": "Was not impressed as to how long it took when I only wanted cash from equity but ended up a rewrite that took 2 months. Also communication was not very good, I ended up doing the calling and always talked with someone different. I’m just glad it’s done.", "rating": 4}, {"title": "We have been with Rocket Mortgage for over 10yrs.", "text": "We have been with Rocket now for many years. We have refinanced several times. The process is always easy and done in a timely manner. The only real complaint I have is being charged multiple times for an appraisal and the other charges that go along with the loan.  Since we have chose to stay with Rocket Mortgage there should be some compensation on the closing cost for customers who are long standing customers who always pay on time. We were told that was the best interest rate, but it seemed high. Otherwise we have been very happy with the people that we spoke to during the process.", "rating": 4}, {"title": "There was an adjust on the extra funds…", "text": "There was an adjust on the extra funds because of the appraisal. We received much less than we thought we were going to receive. I know the house is in need of repair but to go from 15K to about 2.3 K was quite a jolt", "rating": 4}, {"title": "Only complain is that Wayne and I have…", "text": "Only complain is that Wayne and I have been divorced for several years and they kept telling me they needed him to sign paperwork to release deed. He is not on my deed. Still I received paperwork for him to sign. ", "rating": 4}, {"title": "The loan officer(Levi Birch)was always…", "text": "The loan officer(Levi Birch)was always helpful if we had questions about something.", "rating": 4}, {"title": "We had a great person, BUT", "text": "We had a great person, but he didn't disclose that the rate included points. ", "rating": 4}, {"title": "It wasn't that great", "text": "It wasn't that great.  It seemed excessive fees were charged as they doubled from the initial estimate.  I've never met more persnickety underwriters in my life as I was only borrowing  $75,000 which ended up $55,000 on a house worth $550 000.  ", "rating": 4}, {"title": "I just talked to many people but they…", "text": "I just talked to many people but they were all very nice and helpful. ", "rating": 4}, {"title": "Well most of the time they answered all…", "text": "Well most of the time they answered all my questions , some of it was misleading ", "rating": 4}, {"title": " Ami saved me for Rocket Mortgage", "text": "Ami kept in touch with me the whole time always finding answers to any questions I had.  She had contacted me because I almost went with another company.  Her friendliness and upbeat personality made me comfortable ", "rating": 4}, {"title": "Timing", "text": "Timing, professionalism and clarity  was top of my priority and you delivered. ", "rating": 4}, {"title": "Fast and Efficient with a little hiccup.", "text": "Everything went well,  I had a person guiding me all the way.   There was only one thing that I found to be taxing.   I wanted to pay off two things with some of the monies borrowed.  But I had to wait for checks to come to me,  then I had to sign and send them off to the companies I wanted paid off.  In this day and age of computers and auto deposits, this seemed to be a bit unnecessary.  I had to take the payments to be mailed.  Made sure I got tracking numbers and had to pay $18.00 for each piece to be delivered.  THEN  by the time the checks get cashed,  the pay off figure it not the same.   SO then I had to pay the rest on line.    There has to be  a better way.  Don't you think?", "rating": 4}, {"title": "Good experience.The overall experience was quick and…", "text": "The overall experience was quick and relatively painless. There were a few times when some needed information was not given, but it didn't cause any delays in the process.", "rating": 4}, {"title": "The closing lady wasn t all…", "text": "The closing lady wasn t all together....we've been signing that she missed to this day...I don't understand what is going on..", "rating": 4}, {"title": "Everything went smoothly.", "text": "Date of experience: June 06, 2024", "rating": 4}, {"title": "Rocket Mortgage Comes Through Once Again", "text": "Everyone we worked with was very attentive and kept us up to date on changes.  We felt like they had our best interests at the forefront of what they were doing.  The software worked very well.  One thing that was a bit confusing was which person was doing what.  We got emails, texts and phone calls from at least 3 different people, and we weren't always sure which one to call, text or email for each document, question or answer.  Overall, it was a good experience and I would, and have, recommended Rocket to our friends.  We have always felt Rocket has done us right.", "rating": 4}, {"title": "Good service", "text": "I thought fees a kittle high but overall iy was good", "rating": 4}, {"title": "Ok overall", "text": "A little stressful at the end of the transaction with too many people involved and took longer to resolve it, but overall it was all good!", "rating": 4}, {"title": "Quality people", "text": "Date of experience: June 06, 2024", "rating": 4}, {"title": "Jesse Bryant went above and beyond…", "text": "Jesse Bryant went above and beyond helping me, her client. She is a blessing to your company.", "rating": 4}, {"title": "Patrick my original loan officer is…", "text": "Patrick my original loan officer is great!  He is through, patient, kind, and answers my many questions.", "rating": 4}, {"title": "Other than taking close to a…", "text": "Other than taking close to a month....which is sad...I could have got another loan for close to my amount in a couple days...this seemed to take forever. But other than that, all the people I worked with were professional and nice....Kevin ", "rating": 4}, {"title": "Everything went fine with the exception…", "text": "Everything went fine with the exception of recieving the checks to pay things off. It would have been better if either things were paid electronically by Rocket Mortgage or by me .  As I realize that some would use the money for  other things than what they were intended for . In todays world using checks is rather inefficient and slow . As a former Postal worker I know first hand how slow the mail is . I would have rather paid things faster that way(electronically)  than waiting 7 to 10 days for my payments to reach and clear my creditors .  In the process I have gotten several late fees of 35 to 40 dollars which could have been avoided . ", "rating": 4}, {"title": "Refinancing ", "text": "The closing process was efficient and timely. All representatives were helpful and gave information that was easy to follow.", "rating": 4}, {"title": "My experience with Rocket was good", "text": "My experience with Rocket was good. It was accurate and moved along as discussed. ", "rating": 4}, {"title": "To many different people answering…", "text": "To many different people answering emails not knowing the truth about the account ", "rating": 4}, {"title": "I was leary about working with Rocket…", "text": "I was leary about working with Rocket Mortgage vs my bank. Although there was a slight hiccup (mainly because I had a longer closing) the entire process was easy and convenient. Each step of the process has you with a different Team but everyone communicated great as we moved through the steps. My closing was 2 weeks ago but I had a post occupancy for 2 weeks after. Moving in 2 days. So at the end of the day the although the housing market is bad for new buyers using Rocket and having some buyer grants will get me a leg up on making this house my home!", "rating": 4}, {"title": "Very knowledgeable ", "text": "Marc H. was great. He was attentive, emailed or called back within minutes day or night. He was able to answer my questions and if not found the answers for me. The only reason I didn't give it a 5 was because the notary was very late and I had a stressful day moving all other things around to make it work. ", "rating": 4}, {"title": "Satisfied ", "text": "I needed to change mortgage company so here we are", "rating": 4}, {"title": "Instead of paper checks to pay things…", "text": "Instead of paper checks to pay things off. Should have been electric transactions. ", "rating": 4}, {"title": "This was our first time using Rocket…", "text": "This was our first time using Rocket Mortgage. We were paired up with an experienced person who was straightforward  and extremely helpful. He informed us of several programs that we qualified for and made our purchase go smoother than expected.  We utilized one program where we got a discount on closing costs by using Rocket realtors on both ends of our transaction. Although this saved us a sizeable chunk of money, the quality, professionalism and courtesy of the southern agents left much to be desired. Rocket had to change realtors several times which caused us a lot of unnecessary stress and aggravation in that regard. They however made up for the realtors lack of professionalism with quick and easy financing and title work. ", "rating": 4}, {"title": "Everyone was helpful and direct in all…", "text": "Everyone was helpful and direct in all communications. ", "rating": 4}, {"title": "Nahed Mouasher was fantastic & very…", "text": "Nahed Mouasher was fantastic & very helpful.", "rating": 4}, {"title": "Process was easy but communication could have been better ", "text": "The process was great, but communication was not so good. Overall I was thankful for everything that you guys helped me with.", "rating": 4}, {"title": "It was a bit confusing that there were…", "text": "It was a bit confusing that there were several people that were reaching out to us from Rocket Mortgage instead of a single point of contact, or that we were not told that others would be reaching out to get information.  Also, we had stated that my wife would be the one to gather and provide the documentation required and I was called several times.  ", "rating": 4}, {"title": "I really loved the customer service at…", "text": "I really loved the customer service at Rocket, and most things went pretty smoothly!  ", "rating": 4}, {"title": "The service is good however I didn't…", "text": "The service is good however I didn't like being passed from one person to another.  Would have been better to deal with one person throughout the process.", "rating": 4}, {"title": "Pleasure working with Mat", "text": "Date of experience: May 23, 2024", "rating": 4}, {"title": "Laurent was perfect", "text": "Laurent was perfect. Communication with others handling thing got repetitive.  Everyone was on top of it. Great job", "rating": 4}, {"title": "Everything went well", "text": "Everything went well, but there was a little bit of misinformation when it came down to what was needed or how it was to be obtained.", "rating": 4}, {"title": "My contact person Jason", "text": "My contact person Jason, was knowledgeable and easy to get ahold of.  He had the answers or let me know where to find them.", "rating": 4}, {"title": "Would recommend!", "text": "The process was simple enough. Mortgage agent was very helpful. The only issues I had was with getting a notary scheduled as they had messed up address with another company, and I felt closing fees were a bit excessive. But all in all got it done with relative ease.", "rating": 4}, {"title": "Closing went smooth for me, but ", "text": "It was nice not going downtown farilyand fighting the traffic.I didn't like the payoffs were handled. It was hard getting someone to complete the envelopes, I have fundamental neurological disorder and cannot write. ", "rating": 4}, {"title": "I had good conversations with Julian…", "text": "I had good conversations with Julian Jaku and Attorney come close loan in my house ", "rating": 4}, {"title": "The customer service I received was…", "text": "The customer service I received was very good.  I appreciated their help", "rating": 4}, {"title": "Great experience with the Rocket crew", "text": "Great experience with the Rocket crew. I’m giving you a four star because you could have given me a better rate. Lol", "rating": 4}, {"title": "It was A good experience", "text": "It was a good experience, a few things that got me by surprise, but all in all it accomplished what we were looking to accomplish!", "rating": 4}, {"title": "Overall it was a good experience ", "text": "Overall, good experience. There were a few hiccups along the way with a few emails directing us to the app and the app directing us to call. The call amounted to 45 minutes of hold time and hanging up without talking to anyone. Our loan facilitator/agent was always available to provide a solution. He was great!The morning of the closing was a ball of confusion but ultimately our path was made straight by a lovely woman who solved the “pre closing tasks” situation.The actual closing was seamless. I shared the above issues with the closing agent woman after all pages were digitally signed. She was a professional and welcomed our critique. If the need ever arose, we would choose Rocket Mortgage again. ", "rating": 4}, {"title": "Very easy to deal with the people and…", "text": "Very easy to deal with the people and web site. ", "rating": 4}, {"title": "Briana was extremely helpful and…", "text": "Briana was extremely helpful and understanding.", "rating": 4}, {"title": "You made the entire process easy and…", "text": "You made the entire process easy and understandable.", "rating": 4}, {"title": "Easy and Understandable ", "text": "The agent was very knowledgeable. He did not use pressure. He explained everything.  I was kept up to date on the dashboard. The only difficulty was having to personally mail checks to pay off some debts. Those companies still haven't shown acknowledgment of receiving the checks although they have been delivered.", "rating": 4}, {"title": "Great time response", "text": "Great customer service, helpful with making decisions ", "rating": 4}, {"title": "Application", "text": "Application, docs to underwriting, approval, and closing quick and pretty much hassle free. It took 10 days to receive our disbursement checks.", "rating": 4}, {"title": "Refi 2024", "text": "Some parts of my experience didn't go as smooth as I hoped.  You didn't like the font size of the pest control file.  The day of signing seemed to a little ruff getting started.  It seemed we waited longer then the promised 30 minutes.  We also had to get the ball rolling, because nothing was happening at your end.  ", "rating": 4}, {"title": "Great customer service", "text": "Great customer service. Could improve in not requesting the same information again and again when I already submitted. ", "rating": 4}, {"title": "Quick and easy home equity loan all…", "text": "Quick and easy home equity loan all online.", "rating": 4}, {"title": "Finding out we were approved right away…", "text": "Finding out we were approved right away gave us confidence to move forward and purchase a home quicker than we were expecting. The rocket team were all helpful and polite. An issue we were faced with was closer to the close date there were task that popped up and communicating wasn't as it was in the beginning process. I would have liked more communication through the whole process. In the end it was all worth it and thanks to the team at rocket for helping me purchase my first home. ", "rating": 4}, {"title": "My experience is mainly pleasant", "text": "My experience is mainly pleasant. Everyone was helpful to the best of their  ability. If they couldn’t help me then they found someone that could. The only negative thing was that there was a delay in the disbursement of funds and still not sure the outcome with the homeowners insurance I wish I knew if it was taken care of.", "rating": 4}, {"title": "Mortgage Loan Experie ce", "text": "Our 2nd mortgage loan (cash out) was submitted, underwritten, approved and closed in 6 days!  AMAZING.  The only problem we experienced was not being informed when and how the checks were sent out to us.  UPS, FedEx, USPS, overnight, 2 day?????  Life would had been a tad less nerve wracking if we had been informed.  Other than that, FANTASTIC.", "rating": 4}, {"title": "All’s well that ends well", "text": "All’s well that ends well. There were several people who contacted me continuously but some errors in closing documents seemed impossible to get right up to and including the day of closing. Each time I received a call and pointed out an issue, I was passed on to someone else. Some information required was redundant and blame was pointed at the underwriters. Frustrating but finally worked out. Zoom closing worked well ", "rating": 4}, {"title": "Hiccups processing our second mortgage", "text": "Our first mortgage process was great with no issues. Our second mortgage had some hiccups along the way. I'm guessing because of the automatic system we received multiple phone calls once we started the process for the first 4-5 days. Each time the person we talked to wasn't aware we had already talked to some else. We also had issues sending the requested documents and verifying income.  Just seemed like the whole process this time was challenging.", "rating": 4}, {"title": "Did not think it would take as long as…", "text": "Did not think it would take as long as it did because I was an existing customer. Kind of disappointed regarding fha loan", "rating": 4}, {"title": "I received credits from Rocket Mortgage…", "text": "I received credits from Rocket Mortgage and the seller. I'm disappointed that they are discontinuing the program. More programs should be available to earn credits. I hope I received the current/ lowest mortgage rate available on the market.", "rating": 4}, {"title": "The easiest mortgage process ever!", "text": "The process was easy to do online. Fairly fast and efficient, and found us a good interest rate.The only thing I would say is improving the communication when there is a slow down so clients know what the wait is can be helpful. I did reach out about a slow down, and received answers as to what they were waiting for. Very helpful to be able to communicate everything from that one website.I would definitely recommend Rocket Mortgage.", "rating": 4}, {"title": "Got the Job Done", "text": "Overall, the banker was too notch and did an incredibly excellent job digging deep and figuring out fixes to complicated issues.The main problems for me were communication issues between the banker and underwriter that made me make a few mistakes early on, and communication issues between myself and the underwriter that made it difficult to understand what was going on with my loan and what I needed to fix.", "rating": 4}, {"title": "I didn't even need to leave my home", "text": "I didn't even need to leave my home.  However, the paper checks to pay off other items is a bit outdated.  Would have preferred an EFT since those checks have still not posted to the respective accounts.Other wise, very exceptional experience!", "rating": 4}, {"title": "Even when it doesn’t go perfect, it’s great!", "text": "Aside from getting my documents together Rocket Mortgage did most of the work. I would have given five stars though, had my appraisal not somehow gotten messed up, which caused us some timing issues. Our first refi a couple of years ago was much smoother but we were not paying any bills off with that one so that is probably where the difference came in. I will use them again. Customer service was great. Everyone was knowledgeable and they all were apologetic of the delays that we experienced.", "rating": 4}, {"title": "Good except for snail mail", "text": "Overall the experience was quick and easy. I took away a star because everything is done digitally except paying off your debt. You have to buy envelopes and stamps and mail each creditor individually a check that was mailed from Rocket to them. It's the not knowing if they received it or not. All of my creditors are paid on auto payments so I just wish I could have paid the balances the same way. Still having to pay my bills until they receive their check, then have to wait to get your money back from overpaying. Its been over a week and I still don't know if any of the creditors received their payment. Balance is definitely still showing on ALL of my accounts. That process really should be done a little differently but outside of that inconvenience, if I needed to do it all over again, I would.", "rating": 4}, {"title": "Seamless process", "text": "Seamless process. Stress free. Easy ", "rating": 4}, {"title": "Sonny was super nice and helpful!", "text": "Sonny was super nice!I was handed off so many times.Tim Norland with Century 21 was very helpful.It was a very good experience overall.Thanks Rocket Mortgage!", "rating": 4}, {"title": "Smooth Experience For First Time Buyer", "text": "Everyone was knowledgeable and friendly. Process was clear precise and smooth ", "rating": 4}, {"title": "When you opt to go with V.A. loans you run into more roadblocks", "text": "Good communication but we should be able to get a hard copy of our contract for our personal files mailed to us. We're not all computer literate,nor do we want to be!", "rating": 4}, {"title": "The whole process went well until the…", "text": "The whole process went well until the virtual signing of the title. It was on a Friday, and during the ID verification process, there are questions to verify your ID. I failed them. I think I know myself pretty well but the questions weren't very good. So I had to either wait 24 hours before I could try again or wait 3 days until Monday for someone to come to my house. This all postponed my payout by a couple of days.", "rating": 4}, {"title": "Great!", "text": "Great!! Very helpful and easy to talk to", "rating": 4}, {"title": "Overall was good.", "text": "Overall was great.. ", "rating": 4}, {"title": "It was a little rough from time to…", "text": "It was a little rough from time to time. We got thru it. ", "rating": 4}, {"title": "Representative was was very…", "text": "Representative was was very helpful,undstandble,available when needed and very knowledgeable ", "rating": 4}, {"title": "2nd Home purchase, very satisfied!", "text": "Duy Vo was my rep and he did great! Was very easy to get ahold of when needed and checked in often. My only constructive feedback is that different departments did not communicate with each other as well but overall a great experience! This is my 2nd home purchase using Rocket and again I am very pleased!", "rating": 4}, {"title": "The roller coaster mortgage loan estimate. ", "text": "They did make sure I closed as scheduled. ", "rating": 4}, {"title": "Jaimee Risher is the best of Rocket Mortgage", "text": "Jaimee Risher, our original agent, was fantastic! Jaimee was very knowledgeable, helpful, friendly, respectful and professional. She was great! We took cash out & paid off a lot of creditors, which is going to save us a ton of money. The lady who came to the house to do our closing (through Amrock) was also great. But, we did not like the part of the process where we had to wait on checks to be delivered and then we had to mail those checks to our creditors ourselves. That is not a good process. We also received some messages during the appraisal process that were confusing, put undue pressure on us to hurry our repairs, were not helpful, and were even a little insulting. Hence 4, rather than 5, stars. We believe that, if Jaimee was in charge of the entire process, you’d be getting 5 stars, hands down. Overall, we’re very happy with our new mortgage. Thank you!", "rating": 4}, {"title": "Loved the smooth process", "text": "The process was very smooth, and our contacts were very knowledgeable and professional, and I would certainly recommend Rocket Morgage, however we felt with our very good credit bureaus, we could have gotten a better interest rate", "rating": 4}, {"title": "It was a good experience", "text": "It was a good experience, we have used rocket several times. It would have been better had there been someone monitoring the effort. I checked in every day and twice there was an issue that I fixed, I should have been contacted about. I was not. It took longer than I had hoped and there was an issue with the first notary and closing had to be rescheduled. Bottom line was not enough attention. If I had not been on top of it, it would have taken much much longer.", "rating": 4}, {"title": "Rocket Mortgage team was great my…", "text": "Rocket Mortgage team was great my suggestion would be to seek another title company that is more upfront and professional.", "rating": 4}, {"title": "Mr Kareem Sykes originated and…", "text": "Mr Kareem Sykes originated and facilitated alot of the actions regarding our loan.. his communication was excellent, he was patient, but consistent in reminders, very personable and relatable. Could talk to him like an old friend. His portion in our process was steady and efficient. I'd trust his guidance with my mother and/or sister. I immediately felt the difference in energy once his scope in our process had concluded and we'd been rolled over to the communal client relations agent. Was as consistent or steady with updates. Felt like I was working with A.I. that's the reason for it not being 5⭐️ rating. If Mr Sykes was our agent from start to finish it would've been perfect.", "rating": 4}, {"title": "Quick process.", "text": "Date of experience: May 28, 2024", "rating": 4}, {"title": "Fees are above industry average", "text": "Fees are above industry average", "rating": 4}, {"title": "Friendly people", "text": "Date of experience: May 24, 2024", "rating": 4}, {"title": "We got it done on time  ", "text": "We got it done on time for the closing ", "rating": 4}, {"title": "Things were great until we nearly…", "text": "Things were great until we nearly reached the end. The software would not accept which account I wanted funds forwarded to. I had to call it in. Then, processors messed up final rfi, and had me wondering what in the heck I was being required to provide. Otherwise, things went well, and Corey was very helpful.", "rating": 4}, {"title": "Thanks Rocket Team!!", "text": "Everyone we worked with on our mortgage team was super supportive and kind. They were accessible for any questions( even when the answers might have already been on your website) and were committed to helping clarify the process so we were more confident with our choices. Last but not least , they moved quickly to match the needs of our seller and we closed quickly, efficiently with everything in order.", "rating": 4}, {"title": "Deion was amazing he is a great helpful…", "text": "Deion was amazing he is a great helpful personable guy .The underwriter dept can eat a bag of Penis ", "rating": 4}, {"title": "Attentive staff", "text": "Attentive staff. Closing agency actually prefers working with rocket!My main complaint is that you try to quote loans with points automatically without asking the customer what they want. Explain to the customer how they work and then go over the differences in payment, interest, etc. Sometimes points don’t make sense for every buyer. ", "rating": 4}, {"title": "Rate went up slightly and pissed me the…", "text": "Rate went up slightly and pissed me the hell off other than that easy process", "rating": 4}, {"title": "Everyone I talked with was very patient…", "text": "Everyone I talked with was very patient and helpful. They responded quickly to my emails, texts, or calls", "rating": 4}, {"title": "Great options for repayment", "text": "Great options for repayment. The initial processing for approval could be improved. Maybe provide an FAQ about the relevant terms, e.g., what is debt to ratio and examples of what you're looking for, or maybe an interactive table so customers can see a target of what will be needed. Also, some streamlining to avoid repeated submission of the same documents would help. Overall, Rocket got me where I needed to be, but it was a bit stressful to get relevant information so I could make informed decisions. ", "rating": 4}, {"title": "The overall experience we had was very…", "text": "The overall experience we had was very good. The closing was done in our home and at a time that worked best for us. After closing, our documents were processed quickly. I would definitely recommend to others.", "rating": 4}, {"title": "loan process felt smooth.", "text": "Date of experience: May 23, 2024", "rating": 4}, {"title": "went well", "text": "went well, only problem we are an older couple and it was very hard to follow all of this online.  ", "rating": 4}, {"title": "Friendly", "text": "Friendly, courteous ,productive, professional.  Underwriting group needs to understand this area has large parcels often with two or more living structures with two or more mailboxes. In most cases these parcels are financed by on mortgage. Thank you ", "rating": 4}, {"title": "Excellent support", "text": "This is always a nerve wrecking process but my mortgage team was excellent.", "rating": 4}, {"title": "Lower rates and great service!", "text": "Date of experience: May 25, 2024", "rating": 4}, {"title": "EASE OF THE WHOLE PROCESS", "text": "Date of experience: May 25, 2024", "rating": 4}, {"title": "Clear communication!", "text": "Date of experience: May 25, 2024", "rating": 4}, {"title": "Except for the calls I got every day as…", "text": "Except for the calls I got every day as well as the weekends, all went well. I am still getting calls by the way. Aside from all that, it was fine.", "rating": 4}, {"title": "We were supposed to close but something went wrong", "text": "We were supposed to close with a certain amount down and 3 days before closing, they suddenly said we had to do a different type of loan with 3 times the money down and the final payment was still the same even with more money down and the rate went up more than 0.5% .  The positive was both Jenny V and the other jen never gave up and finally got it done.  More money down, higher rate but at least it is now ours.", "rating": 4}, {"title": "Every thing was great except the…", "text": "Every thing was great except the inspections    The things that we needed to have done on the inspection were what we needed the refi for   ", "rating": 4}, {"title": "The new updated mortgage", "text": "The gentlemen who worked on the mortgage took into consideration my needs and promised much and I will will wait to see how it all goes on..", "rating": 4}, {"title": "Quick and friendly.", "text": "Quick and friendly. ", "rating": 4}, {"title": "Rocket Mortgage deserves 5 stars", "text": "Rocket Mortgage deserves 5 stars, however the closing company, McDonnell & Associates, deserves zero stars. Still waiting on debt payoff checks to be sent to me so I can payoff debts before payments come due again. I have made numerous attempts at contacting them with no replies.  Any help you can provide will be appreciated.", "rating": 4}, {"title": "The process was very easy", "text": "The process was very easy. The closing was very interesting. I only wish I was warned that each closing attendant needed their own device. My wife is afraid of computers so needed help, the 2 devices next to each other created a bad echo making communication difficult.", "rating": 4}, {"title": "As far as the process of the…", "text": "As far as the process of the refinancing rocket mortgage was very good.  We stayed informed every step of the way.  The only negative thing about our experience is you better get ready for spam calls.  The day after we started with them we started getting 20 to 30 spam calls a day!  But even with the spam calls we were happy with rocket mortgage we were able to get ride of $87,000 of debt and open up a lot of monthly money in our pay to balance out the cost of living during these expensive times", "rating": 4}, {"title": "Rocket Mortgage Experience", "text": "When I called in to ask a question, all the agents were very helpful, friendly, and polite. I thought the final stage for the closing took a little longer than what we thought it would, but other than that we had a good experience.", "rating": 4}, {"title": "The process was handled quickly and…", "text": "The process was handled quickly and smoothly I do have one complaint and that was with the disbursement of funds.  They were unable to put my funds in my bank of choice which caused a delay in my receiving the money.", "rating": 4}, {"title": "Everything went well right up to…", "text": "Everything went well right up to closing on line.  Randomly, put our 3 names in places that we're not correct.  Found at least 3 mistakes and didn't even get to check in.We had to do an in-person closing which went fine. ", "rating": 4}, {"title": "First contact person was very helpful…", "text": "First contact person was very helpful getting started but after that I was turned over to the electronic monster and it was difficult to get any questions answered after that", "rating": 4}, {"title": "Rocket Mortgage is very affectionate", "text": "Rocket Mortgage is very affectionate. They work in a timely manner, making it easy to help you a long the way . Very pleasant hard working .Very detailed, helpful, and so easy to work with . I recommend Rocket Mortgage  to anyone who’s looking to purchase a home.", "rating": 4}, {"title": "I already did this but very good except…", "text": "I already did this but very good except for the time it took to complete, too long, and repeatedly asking for the same items multiple times. I really got annoyed with that. I also wish the credit card payments would have been direct deposit. ", "rating": 4}, {"title": "Customer service was very good", "text": "Customer service was very good. Several times we had messages that we had tasks to accomplish but none were listed. We would call and they would resend or we would log out and back in to get the tasks to appear ", "rating": 4}]