[{"title": "I'm a new customer so ensure is alright…", "text": "I'm a new customer so ensure is alright so far.", "rating": 4}, {"title": "Enjoyable initially had trouble getting through…", "text": "I initially had trouble getting through to a representative due to dropped call. I called back and was told that the young lady who I first spoke with would call me back. I didn't recieve a call back. I tried the 1- 855 phone number again and ended up speaking with Shuron Sloan. She went above and beyond! She was very pleasant and made the whole medicare enrollment experience bearable,and enjoyable!", "rating": 4}, {"title": "The agent was great.(Suheil Butler) …", "text": "The agent was great.(Suheil Butler)  Some issues with two dropped calls, not her fault.  Was given a call back number but it would not reconnect us.  Next day had a message from a different person (Donna) and given an extension to get through to that person but when I dialed the number I wasn’t given a prompt to press the extension.A lot of info, and lengthy signup but hoping this insurance is as good as it sounds!", "rating": 4}, {"title": "Kenny was exceptional", "text": "Kenny was extremely helpful and thoughtful and professional.Presentation way too long how many seniors actually follow this and understand all the different things covered at what point does one stop listening and just say yes/no to get to the end of all the legal stuff that probably is geared toward the insurer", "rating": 4}, {"title": "Thank You!", "text": "Thank You!! I Would Like For You To Send Me More Info And Books!! As Well As Keep Me Informed And Direct On Each Material And Matter!! I'm Looking For A Partner To Help Me Build And Rebuild Beautiful And Heinous Work. Items From A Tech Job I Have From School And From Working The Field Has Put Me Into Position To Make Some Very Important Moves For Myself As Well As For My Family!! I Would Also Like To Add Incentives Into The Equation. My Number Is 2315319791 If You Could Give Me A Call And Send Me Some Emails And More Packages On The Job It Would Be Highly Appreciated!! Thank You!!", "rating": 4}, {"title": "I recently visited this company and I…", "text": "I recently visited this company and I want to write a review about Ensurem.I was consulted by a wonderful manager who explained everything calmly and clearly. I had a lot of questions, especially about insurance coverage. But I got answers to these questions. And I really liked the first consultation at Ensurem , I learned a lot of useful information and decided to take out insurance here, it seems to me that I made the right choice.", "rating": 4}, {"title": "Your Professional Employee Mr.Dontay…", "text": "Your Professional Employee Mr.Dontay ..What a pleasure it was..I've been stressing going into retirement  kinda 😬 but I was able too do what I've been trying too do for 5months being undecided. Really overwhelmed by it all.Mr.D sesled the deal in about 30 mins.thxs you", "rating": 4}, {"title": "Dewayne Pauley the agent I talked to…", "text": "Dewayne Pauley the agent I talked to was very helpful in enrolling me into Medicaid program thru a different Humana Gold Plus D SNP H5619-136 program. I’m hoping that the benefits are as described. I’m looking forward to March 1when my new coverage begins", "rating": 4}, {"title": "Heather", "text": "My call was inquiring about changing and the customer service Heather went thru all my meds and doctors. She checked for me to have the better plan .I appreciate it when people give good service to try and help and not just give basic information! I’m waiting for my packet to come by mail still", "rating": 4}, {"title": "The agent that I dealt with was very professional and caring.", "text": "The agent that I dealt with was very very knowligable and extremely helpful.  She was very professional and helped me all the way through.  Looked up doctors, compared differences in my current plan. Even a few days later when I was concerned about a particular medication I was about to begin, I phoned her and she helped to aley my concerns.  Very glad I have her to rely on.  Thank you Yvonne Henderson for all your help and assistance.", "rating": 4}, {"title": "My experience was very good", "text": "My experience was very good. Sharon was a pleasure to talk to and she answered all my questions. I was a little surprised by the length of our conversation, but we did get the procedure finished. All in all it was a pleasant experience.", "rating": 4}, {"title": "I was diagnosed with Breast Cancer last…", "text": "I was diagnosed with Breast Cancer last week. My existing insurance wasn't going to cover my Chemotherapy or my surgery.  I was able to get a new plan with a new company that is happy to cover the treatments!   The agent made it easier to understand the coverage.Jonathan was friendly and thorough. Thank you 😁", "rating": 4}, {"title": "All the extra bentifits that i was not…", "text": "All the extra bentifits that i was not getting with my old company also the agent explained all my options. The best thing i liked is the ur card i can use for food with the cost in this day and time this is a blessing. I was really surprised with the dentle coverage where i can get extractions, Great! I feel i made a very wise choice. Thank you for the information you provided, the agent was very friendly and explained the plan all the way thru. Thanks again, Randy Jackson Ft Myers Fl.", "rating": 4}, {"title": "Ryan Morse(not sure of spelling) was…", "text": "Ryan Morse(not sure of spelling) was very thorough and took time to explain the coverage.  I felt comfortable asking questions.", "rating": 4}, {"title": "Health care insurance", "text": "My experience with Mr. Roman was good. He was very helpful and patient. He would explain things that I didn’t quite understand and made it clear. He did explained in detail the choices available and allowed me to make a decision based on the information and questions to my satisfaction.", "rating": 4}, {"title": "Informed and intelligent agent", "text": "This was my first experience with enrolling in a Medicare part C plan and the agent that I had Nicole was very pleasant, she was patient as I asked many questions and she helped ma to pick out the plan that best fit me", "rating": 4}, {"title": "Intake Review", "text": "The representative took the time to explain and search the policy that would meet  my needs. She also gave me her number and extension, in case I had some follow-up questions. Most of all she was very professional.", "rating": 4}, {"title": "Everyone has been very helpful.", "text": "Everyone has been very helpful  in explaining  what I need and telling about the difference between programs that I can pick from. Everyone has been nice and polite. It's nice to know that I can call people  if I have questions about anything.", "rating": 4}, {"title": "As far as I heard the different stages…", "text": "As far as I heard the different stages of the plans I'm 3/4 of the way there in the confidence of the subsidiaries but time will tell in the results. The Agent was very helpful of giving me info that I didn't quite understand.", "rating": 4}, {"title": "It was a long procedure", "text": "It was a long procedure.  I wasn't  aware of the  time needed to complete  it. The pe person helping me needed up to date equipment.  He was very polite and professional.  Answered question that I had, but just a long process!", "rating": 4}, {"title": "My agent Liz was amazing", "text": "My agent Liz was very patient, answered all my questions and explained all my benefits. The only thing i didn't like was she did tell me i would receive a call and that i would just have to answer a few more questions which i did, but after that i kept receiving calls for the same questions and i got upset and asked why they keep calling to ask the same questions i already answered than if finally stopped.", "rating": 4}, {"title": "The initial presentation was good", "text": "The initial presentation was good. The information shared was very on point and personal. It was very well explained and questions were answered and understood. I hope this will be a very positive decision and helpful for me.", "rating": 4}, {"title": "To have all the information", "text": "I am very happy with my agent on how he took the time to research for the best possible plan for my needs. He also took the time to explain everything to me so that I understood everything and answered all my questions. He also found a doctor who was taking new patients in my area. Thank you very much", "rating": 4}, {"title": "My experience was very informative I…", "text": "My experience was very informative I was satisfied with the plan explained to me. The  agent was knowledgeable of what he was doing and answered the questions I was concerned about,", "rating": 4}, {"title": "Enrollment", "text": "I had a good experience although very long.  I understand need for disclosures but many voiced didn’t apply to me.  Kim Kennedy", "rating": 4}, {"title": "Mr. Kevin Thorp", "text": "Mr. Kevin Thorp is always a jewel to speak to. He goes above and beyond to find me the best insurance for my needs.", "rating": 4}, {"title": "Franklin was a great help a big old…", "text": "Franklin was a great help a big old help he explained everything he gave me a feedback number to get back in touch with him just so helpful", "rating": 4}, {"title": "She was very helpful", "text": "She was very helpful. Wasn't pushy about what coverage to get. Very polite, listened to me about what I  wanted. She joked around some with me, asked about my family.  Lin Musa was very knowledgeable about the plans", "rating": 4}, {"title": "I have not received any information since the I talked to Robert LeClair", "text": "My experience has not been great.  I have not received any more correspondence since the initial call from Robert LeClair", "rating": 4}, {"title": "Elisabeth was very good with her…", "text": "Elisabeth was very good with her knowledge of insurance and what was available in my state. Thank Elisabeth for taking such good care of me.", "rating": 4}, {"title": "I find the company to be awesome  the…", "text": "I find the company to be awesome  the first agent  was very pleasant and answer every question iask took time to help me to understand when I didn't  I truly enjoyed  all the help thank you very much", "rating": 4}, {"title": "I spoke with a gentlemen by the name of…Lance", "text": "I spoke with a gentlemen by the name of Lance. He was very helpful. I have a hearing problem with aides in both ears. I was able to understand with him with no problem. He is very nice and helped me understand the different options.", "rating": 4}, {"title": "Excellent Service", "text": "Ahmed took the time to explain the plan in detail. Excellent communication and customer service. Agent was very knowledgeable and answered any question that I had.", "rating": 4}, {"title": "Making decisions?", "text": "Phillip was very patient and answered all my questions until I understood. Pointed out the advantages of each plan and let me decide on a plan.", "rating": 4}, {"title": "What people need in health care", "text": "The customer service was very helpful. Mr. FRY helped me a lot. Was patient and getting all my information.", "rating": 4}, {"title": "Crystal  Woodget gave me a good sercvice", "text": "I really had a good service from Crystal Woodget..She was very professional in giving me all the information that I need for my health insurance", "rating": 4}, {"title": "The agent I spoke with made sure that I…", "text": "The agent I spoke with made sure that I understood everything that we talked about and asked if I had any questions,he was pleasant to talk to.", "rating": 4}, {"title": "A Lasting Expression", "text": "The entire experience was very professional and fulfilling. All our questions were answered and explained. We gained so very much even over the phone line.", "rating": 4}, {"title": "Myra was the representative I spoke…", "text": "Myra was the representative I spoke with and she did an amazing job in explaining my benefits as well as my options are. I can't say enough good about her.", "rating": 4}, {"title": "The rep was courteous and polite", "text": "The rep was courteous and polite. He offered me what I was looking for and more. Took time and explain  as much  continue as possible about the health plan .", "rating": 4}, {"title": "Good customer service knowledgeable…", "text": "Good customer service knowledgeable people who are here to serve me. Get the best coverage available to me.", "rating": 4}, {"title": "Ensure was very helpful in explaining what was changing and making sure I understood the changes in my plans he was patient and very well tempered", "text": "How well he made sure I understood the situation. And how well he explained how the changes were going to benefit me.", "rating": 4}, {"title": "Professional", "text": "The agent was very knowledgeable very polite and respectful and got the job done", "rating": 4}, {"title": "So far so good", "text": "So far so good. I can’t give you a 5 star rating because I haven’t received all my information or card yet.", "rating": 4}, {"title": "The agent made me well informed of…", "text": "The agent made me well informed of policy and was very polite and helpful with any questions I was concerned with", "rating": 4}, {"title": "Everything and everyone was straight…", "text": "Everything and everyone was straight forward and treated me like an adult who could make his own answers and could see through any BS.", "rating": 4}, {"title": "Definitely would be a 10++but I found…", "text": "Definitely would be a 10++but I found out this morning that although my primary MD accepts Aetna she is out of network meaning a 50 dollar fee each visit.Im trying to decide which I will change..MD or ins.plan", "rating": 4}, {"title": "That their very helpful and they explain everything very well", "text": "It was a very good experience. I'm happy about everything. I will let other people know about Ensurem.", "rating": 4}, {"title": "My experience was great and wonderful I…", "text": "My experience was great and wonderful I am so glad I called the lady helped me was wonderful thank you so much", "rating": 4}, {"title": "The visiting agent.", "text": "The visiting agent was extremely knowledgeable and was very helpful.Glad I switch over from United Health!!!", "rating": 4}, {"title": "My Review", "text": "The information that was given out over the phone. I really understand everything that she talked about.", "rating": 4}, {"title": "Rita Forrest was very professional", "text": "Rita Forrest was very professional, thorough, and pleasant to work with. She was extremely patient with my many questions and helped me sort through the wealth of sometimes confusing information to help me choose a health care plan.", "rating": 4}, {"title": "Awesome agent!", "text": "I had a great experience! My agent was super awesome to deal with.  She was helpful, easy to talk to, and easy to understand!", "rating": 4}, {"title": "Very helpful with answering my…", "text": "Very helpful with answering my questions and helping me to choose what was right for my needs", "rating": 4}, {"title": "Jayme N", "text": "Jayme N. Was very professional and nice. I was very nervous and anxious about enrolling. He answered all my questions and calmed me down. He was great! 🙂", "rating": 4}, {"title": "Medicare advantage plan", "text": "The Agent Roberto was very thorough in explaining the plans and made me easy to select the plans that I want..very satisfied..", "rating": 4}, {"title": "Super Professional Rep", "text": "Super Professional Rep! She Did Everything For My Husband to get The Best Dental Insurance!", "rating": 4}, {"title": "My person was very knowledgeable and…", "text": "My person was very knowledgeable and has answers for all my questions.", "rating": 4}, {"title": "Less time on the phone to sign up would be nice.", "text": "The phone call was a little long for me. I hate being on the phone so long. I did like that everything was explained to me and any questions I asked were answered  to me so I could understand very well.", "rating": 4}, {"title": "My representative went to extreme…", "text": "My representative went to extreme lengths to answer all of my questions.  Made sure we understood our options!  Excellent", "rating": 4}, {"title": "Explained in terms I could understand…", "text": "Explained in terms I could understand and we're very helpful when I asked questions", "rating": 4}, {"title": "Operator made it easy to get sign up…", "text": "Operator made it easy to get sign up and was very helpful, made the whole process enjoyable.", "rating": 4}, {"title": "honesty,transparent,  pleasant", "text": "please send copies of all papers in the company's email of information by Postal Service.  I am not that proficient with making copies of many papers.  WJT", "rating": 4}, {"title": "I use it when I need a extra boost", "text": "I use it when I need a extra boost. But, flavor is important to me. I would like to see more flavors.", "rating": 4}, {"title": "First contact", "text": "Today I signed up for United Healthcare. The agent I spoke with was patient with scatterbrained me. The call ended with a good feeling on my end.", "rating": 4}, {"title": "Take care of business so your loved ones don't have to", "text": "I'm comfortable knowing that I have a plan in motion for my end of life", "rating": 4}, {"title": "Update my insurance", "text": "I love working with Rhonda. She makes it fun and simple. I added dental and eye to my account. Glad all is well.", "rating": 4}, {"title": "Rachael was a great insurance broker…", "text": "Rachael was a great insurance broker she explained in detail the benefits Ensurem offered in their plans.", "rating": 4}, {"title": "A good sales representative", "text": "Nothing in particular, the lady I talked to was a good sales rep.", "rating": 4}, {"title": "Agent Lisa Graham was amazing to work…", "text": "Agent Lisa Graham was amazing to work with!Follow up with other agent to get basic info not good.  Please send out initial info about the products selected promptly - email would be quicker & hard copy follow up.", "rating": 4}, {"title": "I have not received any of my paperwork…", "text": "I have not received any of my paperwork yet or my card. So I really don't know how to rate anything yet!", "rating": 4}, {"title": "Knowledgeable agent", "text": "Took the time to answer questions and use that to inform with appropriate responses.", "rating": 4}, {"title": "friendly", "text": "friendly. and knowledgeable thourghchecked details again and again to make sure ther are no surprises", "rating": 4}, {"title": "After I explained my health needs the too time to find what I required", "text": "How professional the agent was when tending to my needs made me comfortable with the questions I was asked", "rating": 4}, {"title": "Pharmacy convenience", "text": "My reason for choosing your plan was to get my prescriptions closer to my house. I currently have to travel to CVS Windham ME which is 5.7 miles .There is a Walgreens 1.8 miles from my house which would be more convenient for me.", "rating": 4}, {"title": "The representative SHARON DRNEK…", "text": "The representative SHARON DRNEK answered my call was extremely professional and went above and beyond to get me registered  with my New insurance made sure my pulmonologist and my PC were in the plan Sharon was very pleasant to deal with I would have given 5 stars but only allowed me to give 4 stars", "rating": 4}, {"title": "This plan sounds good", "text": "The plan was explained to me carefully.However I need to get the booklet to read more about the OTC plan", "rating": 4}, {"title": "I called regarding the $900 healthy…", "text": "I called regarding the $900 healthy grocery benefit, but was never told anything about it.  Did change my insurance carrier and was to have an appointment this week to go over plans for 2023. Made it sound like an in home appointment, but was another phone appointment.  My time zone was not taken in to account and was called an hour earlier than expected.  Was not told about any other plans available, so don't know what choices are out there.", "rating": 4}, {"title": "Explained everything in detail so I…", "text": "Explained everything in detail so I could understand", "rating": 4}, {"title": "Very understanding person", "text": "She did a great job help me with every thing I need she made sure I didn’t miss a thing helpful", "rating": 4}, {"title": "Happy Me", "text": "Jasmine Peterson your agent she helped me to find the Medical Advantage plan that was right for me", "rating": 4}, {"title": "Changed carrier", "text": "Andre was pretty helpful.", "rating": 4}, {"title": "The people where friendly and answer…", "text": "The people where friendly and answer any questions that I had and went over everything 2 time for me.", "rating": 4}, {"title": "Roberto did great in helping and…", "text": "Roberto did great in helping and explaining…with patience.  I gave a 9 because he had a slight problem with reading the script.  It’s early in the enrollment period though so I’m sure he will improve.  And, to be honest, I had no problem following what he was saying.", "rating": 4}, {"title": "Need to learn to listen", "text": "The agent was professional but didn't listen to me", "rating": 4}, {"title": "Pam was very thorough in presenting…", "text": "Pam was very thorough in presenting elements of coverage. My concern was if she was authorized from Humana. Later, I queried Humana and they did not recognize Ensurem. Later Humana contacted me and said they did have a relationship with Ensurem.", "rating": 4}, {"title": "Lady gave all the information", "text": "Lady gave all the information, as she said was required. So I know all of what I need to do.  She answered all the questions I had.", "rating": 4}, {"title": "He was through & answered all my…", "text": "He was through & answered all my questions.. was wrong.  I didn't get adequate info.", "rating": 4}, {"title": "Super agent", "text": "Super agent. Offered plan in a clear manner with out of pocket costs stated so we wouldn't be caught off guard. Elaine was a joy to talk to. Eliminated anxiety  over previous coverage leaving area.", "rating": 4}, {"title": "The agent that helped me was wonderful", "text": "Date of experience: November 12, 2023", "rating": 4}, {"title": "Customer service rep answered all of my questions", "text": "Date of experience: February 28, 2023", "rating": 4}, {"title": "The little things like most agents try to push", "text": "Patients, friendly with a voice I could understand", "rating": 4}, {"title": "Hopefully", "text": "Hopefully, I was able to get more benefits", "rating": 4}, {"title": "Relief", "text": "I was inquiring about a supplement that would help me with the cost of my health issues. I was directed to a young woman that explained how  & what was covered & assured me that I was in good hands.", "rating": 4}, {"title": "Everyone was friendly and very…", "text": "Everyone was friendly and very knowledgeable regarding my experience to pick a health insurance that was best for me!", "rating": 4}, {"title": "Nice", "text": "Great experience with lance , very patient with me", "rating": 4}, {"title": "Getting into the program", "text": "No Comment , I have nothing to say at the moment.", "rating": 4}, {"title": "Customer service was very nice and easy…", "text": "Customer service was very nice and easy to talk to. Gave me answers to my questions.", "rating": 4}, {"title": "Agents appear to be proficient.", "text": "Agents appear to be proficient.Definitely an oversell but that's the way it is", "rating": 4}, {"title": "I am looking for more affordable…", "text": "I am looking for more affordable medicare suppliment that included dental, vision and drugs. Deno was helpful in getting me a lower premium.", "rating": 4}, {"title": "The lady who assisted the call.Ashley", "text": "The lady who assisted the call. She had plenty of information great guidance.", "rating": 4}, {"title": "I felt the young man who was there to…", "text": "I felt the young man who was there to listen and hear  what I needed.   He explained the policy available for me and the benefits I was looking for.   He took the time to look for an exclusion to the policy also and could not find there was one.   he was very pleasant and certainly did his job very well.", "rating": 4}, {"title": "I’m not sure I am as pleased", "text": "I’m not sure I am as pleased. As a Medicare advantage it’s Hmo and hardly anyone takes the hmo. Frustrating as it is I’m going to look into something else", "rating": 4}, {"title": "Simple complete process!", "text": "The customer service agent was both thorough and understanding as we went through coverage and enrollment.", "rating": 4}, {"title": "My enrolling with Deborah was great", "text": "My enrolling with Deborah was great. She explained everything in detail and answered any question I had. The only reason for the 4 rating is that I have had at least 6 calls from associates to go over the same thing again and again. Sometimes it can be annoying.", "rating": 4}, {"title": "The representative was very informative…", "text": "The representative was very informative however, he was very hard to understand", "rating": 4}, {"title": "Wonderful", "text": "It was wonderful. So easy to enroll with the person I spoke to. He explained everything so clearly. Happy.", "rating": 4}, {"title": "Melissa was very informative and…", "text": "Melissa was very informatice and patient.  Only critique, when someone is familiar with PPOs and HMOs, no need to keep explaining the difference.  I know that is what she is trained to do, but some seniors, such as myself, come from a professional background and know the difference.   She also needs stop talking so fast.  Will keep her as my agent.", "rating": 4}, {"title": "The representative was very…", "text": "The representative was very knowledgeable in explaining the plan we acquired. Satisfied so far.", "rating": 4}, {"title": "Confusing Information", "text": "A lot of that information is confusing especially when it comes to co-pays & deductibles. I pay nothing now so when they say things like that it makes you think you are going to have to pay something from an already strained income. Being in that position allows you to understand why people have to choose between health care & food.", "rating": 4}, {"title": "Liz was very helpful", "text": "Liz was very helpful, kind, and caring. She answered all my questions and spent over an hour and a half on the phone with me. She was very patient.", "rating": 4}, {"title": "My agent was absolutely great", "text": "My agent was absolutely great! He answered all of my questions and even called the insurance company to verify the answer. I felt he really cared about getting me the best product for my needs. I would recommend him to anyone!", "rating": 4}, {"title": "Very good", "text": "So helpful,Very  nice person", "rating": 4}, {"title": "I wanted to change back to united…", "text": "I wanted to change back to united g3alth and they were very helpful", "rating": 4}, {"title": "Barry was very helpful but he kept…", "text": "Barry was very helpful but he kept repeating the same thing over and over it gets confusing.  He did help some but not sure I’m getting what I wanted will see if I get accepted and will make sure I", "rating": 4}, {"title": "Looking forward", "text": "I am not moving into my new address until Friday and haven't had the opportunity to review the new material yet", "rating": 4}, {"title": "Very informative", "text": "I do remember that Brian took time to inform me of benefits.He was very patient.", "rating": 4}, {"title": "Aseeking new insurance", "text": "Agent was well informed and pleasantly professional", "rating": 4}, {"title": "I was looking for a health insurance…", "text": "I was looking for a health insurance plan that would be cheaper than the one I previously had and the agent helped me find the right one. Her name is Cheyenne and found the right one that fit my budget. I really appreciate her help.", "rating": 4}, {"title": "They got me the help  I needed dental…", "text": "They got me the help  I needed dental work  and glasses  they were very helpful and concern  the never got off the phone  til they had me the best plan possible  I recommend to anyone  to make ensured their  first  choice", "rating": 4}, {"title": "I lost medicaid coverage and wanted to…", "text": "I lost medicaid coverage and wanted to keep my doctor's. Most all of my scripts and doctors are covered in network. One or two were not. As coverage changes goes very knowledgeable about what I needed.", "rating": 4}, {"title": "The best part was the representative…", "text": "The best part was the representative who was pleasant, informative, and very personable.", "rating": 4}, {"title": "Allow plenty of time to get through the process", "text": "They make sure you understand everything you need to know", "rating": 4}, {"title": "Answered all questions and had…", "text": "Answered all questions and had knowledge of all plans", "rating": 4}, {"title": "Josue did a very good job helping…", "text": "Josue did a very good job helping figure out my options", "rating": 4}, {"title": "My insurance company doesn't starr…", "text": "My insurance company doesn't starr until February 1st", "rating": 4}, {"title": "Representative was patient", "text": "Representative was patient, diligent, polite and respectful.", "rating": 4}, {"title": "Patricia Roston", "text": "The agent was very informative, pleasant and knowledgeable", "rating": 4}, {"title": "she was wonderful but still need to get…", "text": "she was wonderful but still need to get a additional dental plan didnt like the one she came up with at alll but i didnt have anymore time .", "rating": 4}, {"title": "Still working with you trying to find a…", "text": "Still working with you trying to find a good doctor", "rating": 4}, {"title": "Very helpful", "text": "Date of experience: June 22, 2023", "rating": 4}, {"title": "Representative was clear", "text": "Representative was clear, professional and helpful.", "rating": 4}, {"title": "VERY KNOWLEDGABLE AGENT", "text": "Answered all my questions and was very professional", "rating": 4}, {"title": "I had a person who was knowledgeable of…", "text": "I had a person who was knowledgeable of the plan", "rating": 4}, {"title": "Friendly and knowledgeable", "text": "Date of experience: May 01, 2023", "rating": 4}, {"title": "Well rounded and couteous", "text": "Date of experience: November 14, 2022", "rating": 4}, {"title": "Agent seemed knowledgeable and…", "text": "Agent seemed knowledgeable and explained well.", "rating": 4}, {"title": "Overall", "text": "Overall, well done, but I haven't received paperwork yet, so a bit uncomfortable until I can reveiw.", "rating": 4}, {"title": "I like that there is no copay", "text": "Date of experience: July 05, 2023", "rating": 4}, {"title": "Well  equipped representation", "text": "The representative was well equipped and knowledgeable", "rating": 4}, {"title": "More helpful to choose.", "text": "Date of experience: January 26, 2023", "rating": 4}, {"title": "Customer service was great", "text": "Date of experience: August 24, 2023", "rating": 4}, {"title": "I think it is a good service for next year.", "text": "The plan seems to offer more than my current plan.", "rating": 4}, {"title": "The agent was very clear and helpful on…", "text": "The agent was very clear and helpful on all the coverages He made sure I understood what he was explaining. I feel confident I have the insurance coverage I will need.", "rating": 4}, {"title": "Informative/thorough", "text": "Very informative, friendly and thorough. Explained any questions and how my new insurance works as well as giving me his information for future reference and questions.", "rating": 4}, {"title": "Explanation Effective!!!", "text": "Things were explained and I felt good about my choice. I just pray that there aren’t any problems with the policy.  For instance the rides.But as far as the call it was good!!", "rating": 4}, {"title": "Pleasant to talk to considered my…", "text": "Pleasant to talk to considered my conserns", "rating": 4}, {"title": "My experience with Troy Fernandez was very pleasant", "text": "My experience with Troy Fernandez was very informative with patience. He explained everything with understandable dialog.", "rating": 4}, {"title": "My experience with Ensurem.", "text": "The licensed Agent for Washington state (zip code 98275).Agent Chelsea Ryan was very knowledgeable of the Medicare heath plans. I currently have a health plan from Humana Honor ppo She reword my coverage for 2022 and recommend that I enroll for 2023 in Humana Honor ppo plan H 5216-315 because I will get $100.00 back in my Part B MEDICARE that is deducted from my Social Security Check each month. This new plans meets my needs very well. I am a TRICARE FOR LIFE military retiree.Much Thanks to Chelsea Ryan", "rating": 4}, {"title": "Process was relatively painless", "text": "Process was relatively painless. Agent considerate.", "rating": 4}, {"title": "Thorough research", "text": "Thorough research, good listening.", "rating": 4}, {"title": "VERY INFORMATIVE", "text": "SEEMED TOO BE HONEST & SINCERE !!!!", "rating": 4}, {"title": "Rep was very informative", "text": "Date of experience: August 11, 2023", "rating": 4}, {"title": "Thanks", "text": "Sharon was awesome, my only concern was I had 7 agents from Ensurem try to sell me after I signed up.", "rating": 4}, {"title": "Answered all my concerns", "text": "Date of experience: March 22, 2023", "rating": 4}, {"title": "He was very helpful", "text": "Date of experience: June 27, 2023", "rating": 4}, {"title": "Good", "text": "Just seems like trust worthy people", "rating": 4}, {"title": "Health care Insurance", "text": "The person who wrote up my insurance plan.", "rating": 4}, {"title": "They listen to every need you ask and…", "text": "They listen to every need you ask and get you the best plan with 0 premium and 0 co-pays for most everything.", "rating": 4}, {"title": "They were courteous and knowledgeable", "text": "Date of experience: October 21, 2022", "rating": 4}, {"title": "The customer service agent was polite", "text": "The customer service agent was polite, well informed and helped me make the best decision possible", "rating": 4}, {"title": "Agent was helpful,when over all…", "text": "Agent was helpful,when over all details.got me the best plan for me. Thank him for me.", "rating": 4}, {"title": "The experience was not without anxiety…", "text": "The experience was not without anxiety as everything was done on the internet and over the phone.", "rating": 4}, {"title": "I love iy", "text": "I really made me happy", "rating": 4}, {"title": "Good", "text": "Good , Ashley was very patient with me.very thing went well I give her a 5star rating.Thx,s", "rating": 4}, {"title": "It was a good report", "text": "Date of experience: March 16, 2023", "rating": 4}, {"title": "Very helpful and experienced and very…", "text": "Very helpful and experienced and very patient", "rating": 4}, {"title": "Great job in explaining the program", "text": "Date of experience: January 03, 2023", "rating": 4}, {"title": "Quality, products and services offered", "text": "Very professional and courteous and polite", "rating": 4}, {"title": "I keep getting calls from Cambodia.", "text": "Date of experience: December 29, 2022", "rating": 4}, {"title": "Agent was very poliet and helpful.", "text": "Date of experience: January 04, 2023", "rating": 4}, {"title": "I am not certain yet as I have not…", "text": "I am not certain yet as I have not received my paperwork to review.", "rating": 4}, {"title": "You did ok", "text": "You did ok, now just don't call or text or e-mail all the time.", "rating": 4}, {"title": "The agent Jayme Nagron was great", "text": "Date of experience: January 16, 2023", "rating": 4}, {"title": "Very good", "text": "Very helpful he explains everything", "rating": 4}, {"title": "There Heath", "text": "Need to take care of my health", "rating": 4}, {"title": "The voice response system", "text": "The voice response systemMakes it difficult wreach a live person", "rating": 4}, {"title": "No title needed", "text": "I don't do replys", "rating": 4}, {"title": "She made a Friend out of Me", "text": "Date of experience: January 20, 2023", "rating": 4}, {"title": "They put me in a dual plan", "text": "Date of experience: January 27, 2023", "rating": 4}, {"title": "Knowledgeable agent", "text": "Complicated and time consuming", "rating": 4}, {"title": "Simply GREAT", "text": "Simply GREAT, PATIENT AND VEEY KNOWLEDGE!!!!", "rating": 4}, {"title": "It took way too long", "text": "Date of experience: August 11, 2023", "rating": 4}, {"title": "Lady on phone", "text": "Date of experience: October 15, 2022", "rating": 4}, {"title": "The professional actions of employees", "text": "Date of experience: August 16, 2023", "rating": 4}, {"title": "Customer service was very good", "text": "Good customer service", "rating": 4}, {"title": "Very helpful and explain the information", "text": "Date of experience: July 24, 2022", "rating": 4}, {"title": "Everything was helpful", "text": "Date of experience: December 07, 2022", "rating": 4}, {"title": "Very Professional", "text": "Very Professional, Informative, And Helpful...", "rating": 4}, {"title": "Answered my questions seem nice", "text": "Date of experience: July 27, 2022", "rating": 4}, {"title": "Great customers service!", "text": "Date of experience: April 11, 2023", "rating": 4}, {"title": "Had trouble creating account", "text": "Date of experience: June 16, 2022", "rating": 4}, {"title": "Good", "text": "Very professional and informative.", "rating": 4}, {"title": "People were knowledgeable and caring", "text": "Appeared genuine", "rating": 4}, {"title": "So far so good …", "text": "So far so good…", "rating": 4}, {"title": "Nothing to adf", "text": "Nothing to say.", "rating": 4}, {"title": "informative", "text": "Date of experience: January 19, 2023", "rating": 4}, {"title": "This is stupid", "text": "This is wonderful.", "rating": 4}, {"title": "Work out good", "text": "Works out good", "rating": 4}, {"title": "Information", "text": "Date of experience: February 10, 2023", "rating": 4}, {"title": "Out of the blue", "text": "I’m not certain if this is the company that contacted me today. If it is, then I was pleasant surprised to talk with Andy Roman about my best options for selecting an Aetna Medicare Butler Prime HMO policy . He was very helpful and seemed to be quite knowledgeable", "rating": 4}, {"title": "John was very informative and did an…", "text": "John was very informative and did an excellent job going over my plan and answering my many questions.", "rating": 4}, {"title": "starla was very thorough", "text": "Date of experience: May 31, 2022", "rating": 4}, {"title": "Finally got some results that were…", "text": "Finally got some results that were favorable.  Planning to stick with this plan and see how it goes, until next sign up period", "rating": 4}, {"title": "My agent was informative and very…", "text": "My agent was informative and very concise I believe that I got the most from my benefits", "rating": 4}, {"title": "Didn’t like driving to Hagerstown to…Glasses", "text": "Didn’t like driving to Hagerstown to get my glasses", "rating": 4}, {"title": "Professional Services provided", "text": "Date of experience: May 19, 2022", "rating": 4}, {"title": "Courtesy with questions answered,when…", "text": "Courtesy with questions answered,when you somewhat thinks it might ihave been a little dumb", "rating": 4}, {"title": "I had a wonderful experience with…", "text": "I had a wonderful experience with Marleah, she patient and kind. She was very helpful along with explaining all the benefits. I have to really commend her wit patience because my medication was moved and she didn't seem agitated while I tried to find it. I appreciated that being as she has no idea of my situation. I did call back to find out where was my welcome letter, my insurance card,  my rewards card at. I spoke to one of her associate who told me would xall me back but she never did.", "rating": 4}, {"title": "The agent was pleasant and spoke well", "text": "The agent was pleasant and spoke well. Easy to understand.", "rating": 4}, {"title": "It was a very positive experience", "text": "It was a very positive experience.   No pressure and accurate information, even some non-positive facts.   I appreciated the honesty", "rating": 4}, {"title": "I love being able to order on line and…", "text": "I love being able to order on line and having it delivered to my house", "rating": 4}, {"title": "The man who helped me was great.", "text": "Date of experience: May 05, 2022", "rating": 4}, {"title": "Calling Aetna direct revealed I was…", "text": "Calling Aetna direct revealed I was missing or did not understand the prescription portion of the plan.", "rating": 4}, {"title": "I sent out the form formal complaint…", "text": "I sent out the form formal complaint and I had to be called and asked for my information and they said that they did not receive anything from me by mail and I know that I sent it out to them then it has taken nearly two months now to hear back from you", "rating": 4}, {"title": "Had a great experience with Marliegh", "text": "Had a great experience with Marliegh. Was a bit confused looking things over but she helped me to understand.", "rating": 4}, {"title": "I have used Ensurem's services multiple…", "text": "I have used Ensurem's services multiple times and each time they  advised the best medical insurance coverage for my needs and financial situation. The agent explained in detail what the Medicare Advantage Plan covered. It was much easier to have them do all the research for me.", "rating": 4}, {"title": "Somethings have not turned out as…", "text": "Somethings have not turned out as expected. Dental coverage is not what I expected either. All in all it was good. I don't intend to change any time soon.", "rating": 4}, {"title": "The people that I have talked to have…", "text": "The people that I have talked to have been very helpful", "rating": 4}, {"title": "Tell me who's acceptable!", "text": "I'm still wondering WHO I can go to for coverage of medical, dental, and eye  coverage. I would love to have a catalogue with acceptable businesses listed. I've surfed online a bit, but I get horribly lost sometimes.", "rating": 4}, {"title": "I called and the agent helped me get a…", "text": "I called and the agent helped me get a new advantage plan. He was very knowledgeable  and definitely  helpful. It was very much appreciated.", "rating": 4}, {"title": "This agency is good but prepare to follow up", "text": "Our agent was very helpful to my getting supplemental insurance. The reason I gave it 4stars is because he did not discuss the different options that are available to retirees. I have an HMO only to realize it has certain limitations, I would have liked to know the difference between that and a PPO.By the way, the first agent I used did not complete the transaction and I had to call again and was completed by a second agent. Not a good first impression, for both myself and my sister, she applied at the same date by my recommendation and had the same issue. It was a busy time but you’re dealing with peoples’ lives and it is important to be thorough", "rating": 4}, {"title": "Review", "text": "People are nice and informed.  Wading these waters if not certain is scary.  Hope you find one person to go the distance.", "rating": 4}]