[{"title": "It works quite good", "text": "It works quite good. At the beginning it takes a little bit of patience, about 1 or 2 minutes as the login repeatadly comes and disappears.", "rating": 4}, {"title": "Good service and quick.", "text": "No hassle,  fast and fees are ok (30 % of what you pay via credit card, However one point is not correct; the monthly limit of 1000 EUR. Sometimes - in emergency situations - you need more and then its getting complicated.", "rating": 4}, {"title": "You do your thing well and reliable and…", "text": "You do your thing well and reliable and affordable through the years, you're a life-line. ", "rating": 4}, {"title": "It was faster this time than last", "text": "It was faster this time than last. No complications or frozen interface. ", "rating": 4}, {"title": "It was simplified and easy to use. My only", "text": "It was simplified and easy to use my only problem with it is that it says debit card you you have to use urgent delivery and they charge you $8.95. I understand a fee being charged but then I'm told my transfer is on hold so why do I have to pay a fee if they're going to hold my transfer and not send it immediately or urgently.?", "rating": 4}, {"title": "Reliable.", "text": "Western Union is usually a reliable way to send money to far off places around the world. Recently I couldn't gain access to my account, either on laptop or mobile app. However, they are reachable by phone ( unlike some companies ). A quick phone call, and miraculously all was well after about 30 minutes,and I could do my transfer. So, apart from the occasional glitch, they are very reliable, and I will continue to use them.", "rating": 4}, {"title": "The best for sending money to Argentina", "text": "The WU service is fantastic, I've been using it for more than 5 years to send money to Argentina every month and is super! The exchange rate is also better than other alternatives, which makes WU one of the best options.  The sideways is the transference fees (around 12pounds for sending 500 pounds. ", "rating": 4}, {"title": "Thats nice to thrust you", "text": "Thats nice to thrust you, for doing a good job !", "rating": 4}, {"title": "Why the wait?", "text": "its convenient but I dont understand why there is a 30 min review of transfer when ive already done transfers thru you.", "rating": 4}, {"title": "The connection was slow at first.", "text": "Date of experience: November 04, 2024", "rating": 4}, {"title": "always swift and good service ", "text": "always swift and good service , even sent to africa, thumbs up", "rating": 4}, {"title": "The service is good", "text": "The service is good, particularly the recipient gets the money within a short period of time. Though they charge 99 p as the fee for transfer, the recipient gets 10% less from Western Union than the exchange rate of the day. This is unreasonable in my view.Dr Kumar Selvarajah", "rating": 4}, {"title": "Very good service but rates not the best", "text": "The exchange rate was competitive but not the best. I made a transfer just to experience the service which was outstanding. The transfer took almost 3 hrs to complete where in other service providers take much longer. I only wish the exchange rates were better.", "rating": 4}, {"title": "I’ve been a loyal costumer of Western…", "text": "I’ve been a loyal costumer of Western union for so many years . I have a good experience so far with them, although there is a lot of company offering good business transactions I remain to keep up my business to WU I do not think this will change.", "rating": 4}, {"title": "Very good system apart from one aspect", "text": "Very good system apart from one aspect, I am often able to complete all parts of the process until it comes to WU contacting my bank - this seems to be an issue quite often. I have contacted my bank to resolve the issue but they say they have no knowledge of a problem!! Otherwise your procedures are intuitive and straightforward.", "rating": 4}, {"title": "Security", "text": "Western Union sent debit card transfer with our asking for security code for the card.  This is a security error that should be corrected.", "rating": 4}, {"title": "That their money and transactions go thorough successfully personally so far I am very happy ", "text": "Happy customer That our monies go through successfully and on time and receivers are happy also.Thank you .", "rating": 4}, {"title": "I like that it is very easy now to send… directly bank to bank. ", "text": "I like that it is very easy now to send money via direct bank to bank transfers and that it is free to do so. But want deeply upsets me, and I find very, very, very personally insulting, is the questions that I keep getting asked none stop by western union, such has 1)what my job is, what's this got to do with anything? that's My business. 2) what is the source of your money/income. What's this got to do with anything, that's My business. 3) what is the relationship between the sender and the receiver. That's my business, what's that got to do with anything. I feel the Western Union needs to stop asking insulting and offensive questions. Other than this it's a very good and safe service. well worth using. I would highly recommend it. My reason for down rating their score is only due to the fact I find their none stop questions they ask every time you send money insulting. ", "rating": 4}, {"title": "So Quick !!", "text": "I use WU a lot helping my friend overseas. Most times it is easy and a quick experience but the recent security checks are a hold up buy no doubt essential. It's great that when I sign off the money is already 5000 miles away !!! 👏 AMAZING", "rating": 4}, {"title": "You are very clever to follow my change…", "text": "You are very clever to follow my change of location pity you had me jumping all over the place filling out forms that didnt  work...what is my home post code? You are not ready for Ai", "rating": 4}, {"title": "Mostly Superb rate and reliable services ", "text": "Mostly Superb rate. Reliable service. My profile is already updated and verified with you, But every time it is asked for proof of address and it causes delay. I hope that it will be resolved on permanently basis. Thanks.", "rating": 4}, {"title": "From the tip of a finger to your phone 📱", "text": "What makes it good is that one can send money from the comfort of one home to from the coffee shop to from the park by the touch of few buttons from one phone in an instant.", "rating": 4}, {"title": "I have always used Western Union", "text": "I have always used Western Union. I believe it is trustful. I have given the four stars because they stopped texting when the money has been collected.", "rating": 4}, {"title": "I always use Western union as its very…convenientt.", "text": "I always use Western union as its very competative and easy to use, also the money i send to my wife, the Western union is located in her Bank so she can call and have the money put into her bank account over the phone.I did not give a 5 star as i have sent many times and don,t recieve the 5 points towards sending money for free as its been saying they are doing a new loyalty scheme which never seems to have appeared.", "rating": 4}, {"title": "I find it a very fast and safe to send…", "text": "I find it a very fast and safe to send and receive money. However the fee can be high sometimes, which when payments are weekly, impacts my budget. As a whole good and practical options to transfer.  ", "rating": 4}, {"title": "Used Western Union several times now to…", "text": "Used Western Union several times now to send money, straightforward easy process with competitive exchange rates. Slight problem for the recipient to puck up the money but I think that was a local issue", "rating": 4}, {"title": "WU is Great in many aspects", "text": "WU is Great in many aspects. However, exchange rates should be improved in order to attract more customers. Thank you.", "rating": 4}, {"title": "Simple et rapide ", "text": "Simple et rapide Merci ", "rating": 4}, {"title": "Good currency exchange rate", "text": "Western Union now seems to have better currency excgange rates than in the past. Useful for quick mobile money transfers.", "rating": 4}, {"title": "Good service", "text": "Quick, easy, fairly cheap. The only downside is that the interface isn't always all that clear, but it's not too bad.", "rating": 4}, {"title": "good rate but still has problem doing…", "text": "good rate but still has problem doing the online which they have never fixed.", "rating": 4}, {"title": "Service review.", "text": "I have used your services for a few years now to pay my sons university fees and living costs in USA. The service is good value and is normally received within 3/4 days. The app is easy and safe to use.Highly recommended. Thank you.", "rating": 4}, {"title": "Could have been the 5 star", "text": "Occasional delays and won’t get actioned unless you call to make a query. Otherwise, would have awarded 5 star rating.", "rating": 4}, {"title": "Hi there very helpfull when I had…Best way to send world wide ", "text": "Hi there very helpfull when I had problems sending they called and sorted it out for me very efficiently and quick payment always go through in min usually with no problems ", "rating": 4}, {"title": "Other screens were presented from old…", "text": "Other screens were presented from old \"sending of funds\", hence I had to find the correct file.", "rating": 4}, {"title": "Useful but needs better app ", "text": "It is fast and easy, also not a big fee for each sending. However, it works a bit slow to navigate to next steps. Sometimes it freezes...etc. ", "rating": 4}, {"title": "It's fairly simple", "text": "It's fairly simple, but can you make it possible to do money transfer without a phone number of the receiving party. This is what held up the process. ", "rating": 4}, {"title": "college money to Indonesia", "text": "I send money to my Goddaughter every month. She can pick up the money at any post office in Indonesia.She is on track to graduate college in 3 years. ", "rating": 4}, {"title": "The rates are great and the funds are…", "text": "The rates are great and the funds are available instantly to the recipient, However the limits on the amount of funds transferred are a little too restrictive ", "rating": 4}, {"title": "everthing is ok but sometime it go for…", "text": "everthing is ok but sometime it go for review and then have to cance and try again thats make trouble", "rating": 4}, {"title": "SOUTH AFRICAN SIDE also charge…", "text": "SOUTH AFRICAN SIDE also charge commission which to me is wrong,so my money pays commission charged in England at £9.50 and again in SA  at R200.", "rating": 4}, {"title": "Transaction is very fast and very…", "text": "Transaction is very fast and very simple my family gets my transfer money very fast. Thanks a lot for good service", "rating": 4}, {"title": "Transfer was done but it took 2 days to…", "text": "Transfer was done but it took 2 days to confirm the date when the money would be available on the receiver account.", "rating": 4}, {"title": "Getting points", "text": "It is fast and very reliable, but why is still not introducing anymore the points when using the app?", "rating": 4}, {"title": "Good Service, very fast delivery for collection almost instant ", "text": "Very Fast delivery for collection ,I have used the service many times on line and shops .One problem in the past I had was the collector being refused because their ID didn't seem to match the middle name on the delivery note with it being added to the first name although other outlets accepted it and still do so it might just be that particular outlet/bank, and online the name is separate.", "rating": 4}, {"title": "This is a good application based…", "text": "This is a good application based service which generally works well.  I have no cause for complaint and I am appreciative of the service offered.", "rating": 4}, {"title": "Only ", "text": "Only , I dont like to much  personality question , Îm sorry this is my bisness , ", "rating": 4}, {"title": "The money went in without trouble", "text": "The money went in without trouble.  I'd like to ask a question? How do I remove debit cards that are saved if they are closed? I really need to delete most of them they have been hacked.", "rating": 4}, {"title": "It's convenient with the app instead of…", "text": "It's convenient with the app instead of looking for an agent and then being told the system is down.", "rating": 4}, {"title": "Because it delivered.", "text": "Because it delivered.My experience is it’s the only company I use so I don’t know any better.Keep up the good work ", "rating": 4}, {"title": "I want to special thank the officials…", "text": "I want to special thank the officials of Western Union for making it so easy to withdraw my earnings from my rental investment program with Binghatti Properties. The process was smooth, fast and reliable. Highly recommending both Western Union for seamless transfers and Binghatti properties for offering such great investment opportunities. A winning combination. ", "rating": 4}, {"title": "Great rates and quick customer service", "text": "Although, it takes extra security clearance to get money through, Western Union consistently gives the best exchange rates.", "rating": 4}, {"title": "Assistance ", "text": "Obliged for the fact how easy it could be if wu would take into consideration the humiliation one has to go through to send one’s own income to help realitives abroad having to provide evidence of sender constantly.", "rating": 4}, {"title": "Its always trusting and reliable.", "text": "Date of experience: November 03, 2024", "rating": 4}, {"title": "I find western union easy and quick to…", "text": "I find western union easy and quick to use their exchange rate is usually competitive and the system is very quick ", "rating": 4}, {"title": "promo code issues", "text": "Whenever I use promo code, the transfer won't go through. Embarrassing ", "rating": 4}, {"title": "Money Transfers", "text": "I have made 14 money transfers in the past year. 12 to Bahrain went smoothly,and good exchange rates.Just made 2 to Philippines,and rate less than you quote...So deducted a Star 😥😥😥", "rating": 4}, {"title": "I think you do your job well…", "text": "I think you do your job well considering we leave in very competitive world. ", "rating": 4}, {"title": "Reliable I find sending money with western…", "text": "I find sending money with western union, fast, safe and reliable that means a lot to me. It’s also cheap and easy to use.", "rating": 4}, {"title": "User friendly platform", "text": "Platform is user friendly, therefore easy to carry out transactions timely and efficiently ", "rating": 4}, {"title": "Ease of use ", "text": "The process is very easy to navigate. All the transfers are easy to use and the whole process takes seconds to complete ", "rating": 4}, {"title": "Fast money transfer", "text": "I transfer money to Ecuador to Banco De Guayaquil and it's usually fast and Easy.", "rating": 4}, {"title": "I would like to have the point system…", "text": "I would like to have the point system reinstated to pay a normal fee on the transfer.", "rating": 4}, {"title": "My mtcn not faund or unavilable", "text": "Date of experience: May 29, 2024", "rating": 4}, {"title": "the transaction was quick and straight…", "text": "the transaction was quick and straight forward ,my money was there in minutes awaiting pick up ", "rating": 4}, {"title": "I've used western union for many years...", "text": "I've used western union for many years to provide for my family and it's amazing and cheap and simple to use, although western union is great, the security can be ironic, but other than that I would recommend to anyone.", "rating": 4}, {"title": "I aa Great and safe Company to work with  very impressed with WU efficiency…", "text": "I am very impressed with WU efficiency and fast transactions and the fact that you have a UK London office gives me a lot of  security knowing I can contact you and speak to a real person - Thanks a lot for being there", "rating": 4}, {"title": "Website easy to use", "text": "Website easy to use. Money gets transferred quickly and with no problems and website is very clear on the exchange rate", "rating": 4}, {"title": "easy to use application..", "text": "easy to use application... only on the laptop becasue on the mobile, not working", "rating": 4}, {"title": "No issues or failures to report", "text": "No issues or failures to report. Great service. It would be nice if it were a little cheaper to send money. thank you for the service.", "rating": 4}, {"title": "Transactions there are fluid and clear…", "text": "Transactions there are fluid and clear but the problem I have is that in African countries their personnel is not quick in reacting toward customers ", "rating": 4}, {"title": "The transaction was very…straightforward & convenient ", "text": "The transaction was very straightforward.Easy to access.The transfer went quickly ", "rating": 4}, {"title": "The company is doing well in given good…", "text": "The company is doing well in given good exchange rate and fast in delivery ", "rating": 4}, {"title": "Cannot fault the speed of transfer of…", "text": "Cannot fault the speed of transfer of money.  Done in seconds.  I thought the exchange rate was poor . Cards like wise is a lot better exchange rate.  ", "rating": 4}, {"title": "The transfer was very quick within…", "text": "The transfer was very quick within minutes from the UK out to Turkey and the rate was pretty good ", "rating": 4}, {"title": "Simple, fiable et rapide", "text": "Simple, rapide et fiable. Je recommande", "rating": 4}, {"title": "The transfer took minutes", "text": "The transfer took minutes. The rate was acceptable. All in all a good experience.", "rating": 4}, {"title": "easy and fast", "text": "easy and fast, but exchange rate is not very good, thats why I didnt give full points. ", "rating": 4}, {"title": "Service transfer to my bank account was…", "text": "Service transfer to my bank account was good and at a very good price. I'll be using it in the future.", "rating": 4}, {"title": "The transaction was fast as always and…", "text": "The transaction was fast as always and without any hostle for the recipient. ", "rating": 4}, {"title": "It easy to send money to Botswana in…", "text": "It easy to send money to Botswana in minutes.. helps to pay bills and support family members ", "rating": 4}, {"title": "It's reliable ", "text": "It's fast and reliable way to send money to our love ones across the globe and it's safe too.", "rating": 4}, {"title": "Not that it was so great but it was…", "text": "Not that it was so great but it was quick.  I still have an issue with the rates when a person is not sending that much.", "rating": 4}, {"title": "Available at the Post Office. ", "text": "Got the job done.  Transaction went through smoothly but for the small amount u sent, I still had to pay fairly high charges. ", "rating": 4}, {"title": "Simple et efficace", "text": "Simple et efficace ", "rating": 4}, {"title": "It worthwhile having and it is a good…it's w good thing ", "text": "It worthwhile having and it is a good to send money to your family and friends ", "rating": 4}, {"title": "Money in minutes ", "text": "The transaction goes through very quickly but the only downside is the information required is repetitive and some information should be retained better on the original set up. ", "rating": 4}, {"title": "Quick an easy", "text": "Date of experience: November 06, 2024", "rating": 4}, {"title": "Easy to use website and quick…", "text": "Easy to use website and quick processing of transaction.", "rating": 4}, {"title": "Fast and efficient service delivery was…", "text": "Fast and efficient service delivery was right on time, hope this service will continue so improvement can adhere.", "rating": 4}, {"title": "The first go had a problem", "text": "The first go had a problem. It worked second time round. Thank you.", "rating": 4}, {"title": "Quick and easy just follow the…", "text": "Quick and easy just follow the instructions and it was sent in minutes ", "rating": 4}, {"title": "Decent exchange rate and the transfer…", "text": "Decent exchange rate and the transfer went smoothly and promptly. ", "rating": 4}, {"title": "Online transfers", "text": "Online transfers. Now just missing African countries like Angola, for online transfers", "rating": 4}, {"title": "Simple and easy way to send money…", "text": "Simple and easy way to send money direct into recipient account ", "rating": 4}, {"title": "Solving all my problems", "text": "Solving all my problems with sending money overseas. ", "rating": 4}, {"title": "Send money Western Union way ", "text": "Reasonable rates for sending the money in a few clicks ", "rating": 4}, {"title": "You don't tell me why I can't pay direct", "text": "You don't tell me why I can't direct into the account ", "rating": 4}, {"title": "Works very well", "text": "Works very well ", "rating": 4}, {"title": "Prompt and immediate", "text": "Prompt and immediate. It cannot be faster", "rating": 4}, {"title": "It was easy to follow the instructions…", "text": "It was easy to follow the instructions online ", "rating": 4}, {"title": "Easy to use", "text": "Easy to use, and quick responce", "rating": 4}, {"title": "Price for sending is very expensive", "text": "Date of experience: September 17, 2024", "rating": 4}, {"title": "I can trust that my money will reach my…", "text": "I can trust that my money will reach my family in time and it's safe.", "rating": 4}, {"title": "My experience was good", "text": "My experience was good. It was quick", "rating": 4}, {"title": "its very good  and very helpfull to…", "text": "its very good  and very helpfull to sending the money at home", "rating": 4}, {"title": "My money  got to my love one's in …", "text": "My money  got to my love one's in  time. And never any problems yet  with  them ", "rating": 4}, {"title": "Money Transfer ", "text": "Easy to use the app to send money and same day delivery ", "rating": 4}, {"title": "Awesome Experience ", "text": "Well, the rates are quite reasonable compared to competitors and quite efficient ", "rating": 4}, {"title": "Because it’s easy to see money for…", "text": "Because it’s easy to see money for family.", "rating": 4}, {"title": "It was trustworthy.", "text": "Date of experience: October 13, 2024", "rating": 4}, {"title": "GETTING BETTER NOT AS SLOW.", "text": "Date of experience: September 18, 2024", "rating": 4}, {"title": "Was very professional and was very…", "text": "Was very professional and was very polite", "rating": 4}, {"title": "The transaction went speedily.", "text": "Date of experience: September 21, 2024", "rating": 4}, {"title": "Rapide", "text": "Rapide, simple et efficace.", "rating": 4}, {"title": "All good.", "text": "All good.Exchange rate could be better.", "rating": 4}, {"title": "Great service!", "text": "Date of experience: October 08, 2024", "rating": 4}, {"title": "Only problem is limit sometimes", "text": "Only problem is limit sometimes ", "rating": 4}, {"title": "It's so easy to do on the app and quick…", "text": "It's so easy to do on the app and quick to get to tge country", "rating": 4}, {"title": "Good", "text": "Western union er good ", "rating": 4}, {"title": "Efficiency and easy to use.", "text": "Efficiency and easy to use. ", "rating": 4}, {"title": "Smooth and easy transactions", "text": "Date of experience: September 15, 2024", "rating": 4}, {"title": "Quick and easy..just a little expensive", "text": "Date of experience: September 14, 2024", "rating": 4}, {"title": "The process was flawless", "text": "The process was flawless ", "rating": 4}, {"title": "Fairly fast and efficient service.", "text": "Fairly fast and efficient service. ", "rating": 4}, {"title": "Took a bit of time to work out but…", "text": "Took a bit of time to work out but happy with the results ", "rating": 4}, {"title": "Reliable and quite fast", "text": "Date of experience: September 16, 2024", "rating": 4}, {"title": "Is fast and reliable", "text": "Is fast and reliable ", "rating": 4}, {"title": "Fast service", "text": "Date of experience: October 03, 2024", "rating": 4}, {"title": "Great services", "text": "Date of experience: September 29, 2024", "rating": 4}, {"title": "It was easy to do online", "text": "It was easy to do online. It save me going to shop.", "rating": 4}, {"title": "Easy for transfer money", "text": "Date of experience: October 08, 2024", "rating": 4}, {"title": "Entry and transfer done Quickly", "text": "Date of experience: October 05, 2024", "rating": 4}, {"title": "Easy easiest", "text": "Easy easiest ", "rating": 4}, {"title": "Very helpful", "text": "Very helpful ", "rating": 4}, {"title": "Good service", "text": "Good service ", "rating": 4}, {"title": "Spueer western", "text": "Date of experience: August 31, 2024", "rating": 4}, {"title": "Good service", "text": "Good service ", "rating": 4}, {"title": "Passé facile", "text": "Passé facile ", "rating": 4}, {"title": "Great service", "text": "Date of experience: August 28, 2024", "rating": 4}, {"title": "All services", "text": "Date of experience: September 17, 2024", "rating": 4}, {"title": "Easy to navigate", "text": "Date of experience: September 28, 2024", "rating": 4}, {"title": "The transfer was very fast and the rate…", "text": "The transfer was very fast and the rate was good. ", "rating": 4}, {"title": "Just the rate is high but service is…", "text": "Just the rate is high but service is very good.Thanks.", "rating": 4}, {"title": "Excellent Service", "text": "It was easy to send transfer on line", "rating": 4}, {"title": "Sending money is quick and high rate.", "text": "Sending money is quick and high rate. ", "rating": 4}, {"title": "Easy to navigate.", "text": "Easy to navigate", "rating": 4}, {"title": "I love it", "text": "I love it. I am using it for a long time.", "rating": 4}, {"title": "Fees is cheaper", "text": "Fees is cheaper ", "rating": 4}, {"title": "High efficency", "text": "Easy going app.", "rating": 4}, {"title": "Veloce e facile", "text": "Veloce e facile ", "rating": 4}, {"title": "Received on Time", "text": "Date of experience: September 13, 2024", "rating": 4}, {"title": "Easy to transact", "text": "Date of experience: September 03, 2024", "rating": 4}, {"title": "The transfer was done smoothly and fast", "text": "The transfer was done smoothly and fast ", "rating": 4}, {"title": "XP quick delivery", "text": "  XP quick delivery ", "rating": 4}, {"title": "A great service", "text": "A great service ", "rating": 4}, {"title": "I need the MCTN number", "text": "Date of experience: September 29, 2024", "rating": 4}, {"title": "Easy and secure", "text": "Date of experience: September 11, 2024", "rating": 4}, {"title": "In het nederlands please", "text": "Date of experience: September 19, 2024", "rating": 4}, {"title": "Super god service", "text": "Super god service ", "rating": 4}, {"title": "Fast ", "text": "Fast and reliable ", "rating": 4}, {"title": "Good service ", "text": "Very happy with service ", "rating": 4}, {"title": "The money get to the people who I want", "text": "The money get to the people who I want ", "rating": 4}, {"title": "Your service ", "text": "Fast and good service ", "rating": 4}, {"title": "Easy to do and cheaper on line", "text": "Date of experience: September 04, 2024", "rating": 4}, {"title": "Helpfull", "text": "The service is very simple to use", "rating": 4}, {"title": "Speedy and efficient service", "text": "Speedy and efficient service ", "rating": 4}, {"title": "Excellent tres bon service", "text": "Excellent tres bon service ", "rating": 4}, {"title": "Quick and easy and safe service", "text": "Quick and easy and safe service ", "rating": 4}, {"title": "Quick and simple to use", "text": "Quick and simple to use ", "rating": 4}, {"title": "My experience is great 👍", "text": "My experience is great 👍 ", "rating": 4}, {"title": "A very reliable service.", "text": "A very reliable service. ", "rating": 4}, {"title": "EFFICEINT SERVICE", "text": "So far so good the service :)", "rating": 4}, {"title": "It’s good very easy we send money", "text": "It’s good very easy we send money ", "rating": 4}, {"title": "Pick up is good ", "text": "Pick up is good But Gcash takes long .", "rating": 4}, {"title": "Good,faster but rates is low!", "text": "Date of experience: September 19, 2024", "rating": 4}, {"title": "Fee has gone down a bit.", "text": "Date of experience: September 13, 2024", "rating": 4}, {"title": "good job from yourside thanks", "text": "Date of experience: September 17, 2024", "rating": 4}, {"title": "Everything is quick and easy", "text": "Everything is quick and easy ", "rating": 4}, {"title": "Ease of use fairly quick", "text": "Ease of use fairly quick ", "rating": 4}, {"title": "Good customer service!", "text": "Date of experience: October 03, 2024", "rating": 4}, {"title": "easy to use to ", "text": "easy to use to send money..", "rating": 4}, {"title": "Super!", "text": "Application utile et efficace!", "rating": 4}, {"title": "quick transfer to recipient but transfer fee for gcash is high compared to other services", "text": "quick transfer to recipient ", "rating": 4}, {"title": "Communication and fast Service", "text": "Date of experience: September 29, 2024", "rating": 4}, {"title": "Very clear and quick", "text": "Date of experience: September 11, 2024", "rating": 4}, {"title": "It’s really good", "text": "It’s really good ", "rating": 4}, {"title": "fast and easy", "text": "Date of experience: October 01, 2024", "rating": 4}, {"title": "easy to send", "text": "Date of experience: September 28, 2024", "rating": 4}, {"title": "Too expensive", "text": "Date of experience: September 27, 2024", "rating": 4}, {"title": "Reliable and efficient service.", "text": "Date of experience: September 12, 2024", "rating": 4}, {"title": "Fast and works.", "text": "Date of experience: August 25, 2024", "rating": 4}, {"title": "Good and simple", "text": "Good and simple ", "rating": 4}, {"title": "Fast delivery", "text": "Fast delivery ", "rating": 4}, {"title": "Very efficient", "text": "Very efficient ", "rating": 4}, {"title": "Fast and efficient ", "text": "Quick and easy", "rating": 4}, {"title": "Quality service.", "text": "Date of experience: September 06, 2024", "rating": 4}, {"title": "It's so good", "text": "Date of experience: September 17, 2024", "rating": 4}, {"title": "Quick ", "text": "Great experience ", "rating": 4}, {"title": "GOOD EXPERIENCE", "text": "Date of experience: September 02, 2024", "rating": 4}, {"title": "very reliable and easy to use", "text": "Transactions cost a bob or two but overall very reliable and easy to use", "rating": 4}, {"title": "I am happy to your send and receive…", "text": "I am happy to your send and receive money.also good rate for exachange. Thanks.", "rating": 4}, {"title": "Fast and easy money transfer .", "text": "Fast and easy money transfer .Some time rates are very low,that's why I give 4 star not 5.", "rating": 4}, {"title": "It's great and helpful", "text": "It's great and helpful. Thanks ", "rating": 4}, {"title": "The money reach my family on time,which…", "text": "The money reach my family on time,which is good. Then my wife can take good care of family. I do really appreciate it. ", "rating": 4}, {"title": "Très bon application et facile à…", "text": "Très bon application et facile à comprendre", "rating": 4}, {"title": "Easy to use and reasonable price ", "text": "Easy to use, but you need to be patient sometimes, when system overloaded with transaction, WU tend to get slower Hope this could be resolve soon. But overall, I am happy with the service, sending cash to bank account with reasonable charge Thank you ", "rating": 4}, {"title": "Very good contacts 👌no problem 😊", "text": "Very good contacts 👌no problem 😊 ", "rating": 4}, {"title": "The process was a bit slow", "text": "The process was a bit slow. Otherwise it was excellent.", "rating": 4}, {"title": "Finished", "text": "It finally went.", "rating": 4}, {"title": "Payment from bank to bank is and works…", "text": "Payment from bank to bank is and works fine.", "rating": 4}, {"title": "Satisfaction of Western Union performance ", "text": "It facilitated the transferring money to my family in UAE ,I one minute they can receive the money cash .", "rating": 4}, {"title": "Western Union has been allowing me to…have the deposits made the same day I sent the money.", "text": "Western Union has been allowing me to transfer money to India the day I initiate it lately.  But many times before, it has taken more than a week to get there.  If they regularly delivered the day of initiation, I would certainly give a 5 star rating.", "rating": 4}, {"title": "I been using this western onion many…", "text": "I been using this western onion many years thankfully for supporting and faster respond also ", "rating": 4}, {"title": "Transfers are fine, but…", "text": "Transfers are fine, but I have been promised for many months that loyalty points or incentives were coming.  There should be a smooth transition from one incentive to another.  Instead, nothing is occurring.  Please advise.", "rating": 4}, {"title": "Its eady saves alot of time.had a few…", "text": "Its eady saves alot of time.had a few issues with spelling receivers name.Anyway solved.", "rating": 4}, {"title": "Was easy and fast", "text": "Date of experience: August 31, 2024", "rating": 4}, {"title": "I send money usually 5minutes…", "text": "I send money usually 5minutes delivered, but right now waiting 1day,, why like that?", "rating": 4}, {"title": "Good Overall", "text": "It was quick and easy to send money to a friend who really needed the help. The only issue I had was the transaction fee. A $4.99 fee is higher than I believe it should be. ", "rating": 4}, {"title": "The first transfer was cancelled and I…", "text": "The first transfer was cancelled and I did not get a notice for the status nor receive the reference number. I had to call customer service to find out the status. ", "rating": 4}, {"title": "I was able to change my debit card…", "text": "I was able to change my debit card number to my new card number easily so my bank would accept", "rating": 4}, {"title": "Western Union delivers money to the…", "text": "Western Union delivers money to the Philippines very quickly.However, entering information in your website is slow.", "rating": 4}, {"title": "You always deliver the money however it…", "text": "You always deliver the money however it is taking several days and it shouldn´t ", "rating": 4}, {"title": "I generally never have problems with WU", "text": "I generally never have problems with WesternUnion.com, but lately there has been some glitches that has caused delays when sending money.  The stopping of the points was another problem. I still have points I  can't utilize", "rating": 4}, {"title": "Fast service and an easy to use app", "text": "Fast service and an easy to use app ", "rating": 4}, {"title": "Getting better and more and most…", "text": "Getting better and more and most important reliable", "rating": 4}, {"title": "It made the transfer hastlefree.", "text": "Date of experience: September 12, 2024", "rating": 4}, {"title": "Good Initial Service", "text": "The initial service was good", "rating": 4}, {"title": "Easy to send the money it's great ", "text": "Western union are awesome!!!", "rating": 4}, {"title": "I like the alway put the money to pick…", "text": "I like the alway put the money to pick up the same day.", "rating": 4}, {"title": "Reliable with good rates, but slow", "text": "So of the different money transfer companies Western Union is great if you need to send cash, but if you are doing a bank transfer Western Union is very slow usually taking 7-10 days when including weekends. Other companies will do a bank transfer with the same rates in a few minutes.", "rating": 4}, {"title": "Add text alerts please ", "text": "Transferring money would be rated higher for me if I could get an added text alert that a money transfer has been initiated and another text that it has been completed.", "rating": 4}, {"title": "The transaction is very simple to do…", "text": "The transaction is very simple to do and user friendly and usually takes less than two days for the recipient to have access for their funds.", "rating": 4}, {"title": "Experiencing great on the services…", "text": "Experiencing great on the services serve since then, however sometimes we find difficulty on sending money coz of the new policy implemented. We understand the management is after on safeguarding our money sent yet to those who dont have  any bank account will resort sending it  to other money services that doesn’t need bank account. My concern that this WU money policy  be flexible. Yet overall  services rendered to us clients are realy great and are safe and our transaction is well protected.", "rating": 4}, {"title": "Service is great but would love to get…", "text": "Service is great but would love to get perks for using it, points/discounts.", "rating": 4}, {"title": "App is simple to use", "text": "App is simple to use.  Transaction was completed without errors.  Slight improvement of transaction time would be welcomed.  ", "rating": 4}, {"title": "Very convenient to send money from your…", "text": "Very convenient to send money from your devices.They can do without the ads in the app,  considering that where applicable, their exchange rates are not the best", "rating": 4}, {"title": "Ups and downs.  Up again", "text": "I rely on Western Union to send funds to countries like Malawi and the DRC to support people I know in their activities.  For some reason, WU decided to review my Malawi transactions and held them up for three days or canceled them, claiming it was the end provider.The good news is that I called and spoke to a live agent, who directed me to the wu.gcr site to request a review of my account.  I provided the requested information and my account was re-instated.  So far one smooth transfer completed.", "rating": 4}, {"title": "Simple and convenient.", "text": "Date of experience: September 02, 2024", "rating": 4}, {"title": "Some times here in the Philippines you…", "text": "Some times here in the Philippines you will find some of the sites take extra money from you because you are a American ", "rating": 4}, {"title": "Sending Money Using an Android Phone", "text": "It was easy to send money when using my Android phone. The advertisements or offers that get in the way before I can actually send money are very annoying. Also, asking for a review of a transaction that I completed three weeks ago my not always give you accurate review information.", "rating": 4}, {"title": "It’s good and great help", "text": "It’s good and great help. I feel like the best way to send money ", "rating": 4}, {"title": "Fast and easy", "text": "Fast and easy, and I believe it is secure.  ", "rating": 4}, {"title": "Affordable Transfer.                                       Easy to use but it only allowed me to…", "text": "Easy to use but it only allowed me to transfer money one time. The second time it asked me to visit a branch.", "rating": 4}, {"title": "Sending money to the Philippines is…", "text": "Sending money to the Philippines is quick and easy, but the exchange rate is at least $2 below the market.", "rating": 4}, {"title": "Sometimes the exchange rate is not updated,  which can be frustrating ", "text": "Getting frustrated with the exchange rate,  not updating,  can get frustrating.  ", "rating": 4}, {"title": "Always on time and prompt", "text": "Always on time and prompt. Dependable.", "rating": 4}, {"title": "It was easy to send dollars to a person…", "text": "It was easy to send dollars to a person in Argentina & for her to pick them up in pesos oerson.0 ", "rating": 4}, {"title": "Transferring with WU", "text": "Although I feel a bit pricey charge WU is very through service.  I've never had a problem with money transfer.  If you need a secure way to transfer your money plus periodic ID checks to verify who and why you are sending this money.  There is no better route to take! ", "rating": 4}, {"title": "It's quick and easy", "text": "It's very easy to send money. It's unfortunate that it's very expensive. ", "rating": 4}, {"title": "Nothing unusual happened", "text": "Nothing unusual happened ", "rating": 4}, {"title": "Easy app", "text": "Easy app, and fast pick up. ", "rating": 4}, {"title": "The process is easy the thing that is…", "text": "The process is easy the thing that is missing is that they used to give you points every time you used to send money but not any more, wish that was back", "rating": 4}, {"title": "My HONEST WU Review", "text": "The Good: The transfers are relatively fast. The website is easy to navigate. The rate and dollar amount converted is better than all the other money transfer apps and services.The Bad: I only send money to my relatives and one close friend. ALWAYS! I send money often but when the amount is in excess of say $500 USD, sometimes $1000 USD or more... for education, tuition and to pay contractors working on a relative's house in the Philippines, WU ALWAYS holds the transfer and makes me call customer service because they think it is fraud! I can understand the reasoning behind this BUT I am sending to the same people every month and WU has a documented history of me confirming who this money is going to and what for. YET, I still end up having to call customer service over and over again to clear the transfer. Can't WU keep the transfer contacts who are regularly used and who these people are (e.g. sister-in-law, wife, friend of myself and my wife? WHY do I have to continuously contact WU every month for the transfers to these same people??? It is annoying, time consuming, and frustrating to keep doing this over and over again every month! ", "rating": 4}, {"title": "With amounts larger than 2k I had some…", "text": "With amounts larger than 2k I had some problems resulting in the need to go physically to the branch. Other than that maybe reduce the commissions for recurring customers.", "rating": 4}, {"title": "Exchange rates", "text": "It worked well, exchange rates used are not fair", "rating": 4}, {"title": "My experience when sending large sums of money.", "text": "I have been a customer with you for a few years. When i send small amounts you are very quick in sending the money ,but when i sent a large sum over to France I had a lot of problems,which is a shame. I had to call your offices nearly everyday . On the whole otherwise my experience was good.", "rating": 4}, {"title": "Is good but some times Rmetly have better ratings ", "text": "Is good fast and easy but sometimes Remetly have a little more rates ", "rating": 4}, {"title": "Western Union, an extension of presence. ", "text": "In a world of unexpected twists and turns, Western union has been a gift in sending help to my family members within minutes when they most need it. I am with them, even when miles part. ", "rating": 4}, {"title": "You guys make the things harder for not…", "text": "You guys make the things harder for not reason at the time that the people  is going to pick the money, and this is the second time that you guys to the same to me", "rating": 4}, {"title": "Back there in my country (Ecuador) I…", "text": "Back there in my country (Ecuador) I used to pay child care in your locations but in the app  I can no see that option and I need to send someone else the money to pay that. I do not know if someday I will be able to pay from here ", "rating": 4}, {"title": "Easy to use and very trustworthy", "text": "The app is easy to use and very trustworthy. The only comlaint I have is the 'rate us' pop up after every transaction even after I have left a rating.", "rating": 4}, {"title": "Safety secure and fast service", "text": "Safety secure and fast service.  Easy to access online and the process is quick and reliable.  Staff are always willing to assist whenever there is a question or concern.", "rating": 4}, {"title": "Able to use my points to get a discount", "text": "Able to use my points to get a discount ", "rating": 4}, {"title": "Good but expensive. ", "text": " I would have given five stars but sending euros is quite expensive with Western Union.  I save around $200 going through the wire dept of my bank.  ", "rating": 4}, {"title": "Money was ready to pick up after I sent…", "text": "Money was ready to pick up after I sent it before but it took like a week to pick up now. ", "rating": 4}, {"title": "Good", "text": "You give best service", "rating": 4}, {"title": "It’s easy", "text": "It’s easy, but I think there needs to be a better system in place for frequent receiver. I send money to mom all the time, but direct deposit just takes longer even after the first 2 deposit. Am just pointing out just in case have control over that. Overall things are good so far. ", "rating": 4}, {"title": "Great service", "text": "Transfer of Money was easy and it got transferred as per estimated duration provided.I also can track it so I know exactly when it got transferred,", "rating": 4}, {"title": "better exchamge rate please", "text": "Try to have your exchange rate more competitive or better than any other remittance ctr", "rating": 4}, {"title": "Good online service ", "text": "Good customer service with", "rating": 4}, {"title": "My experience with WesternUnion has been positive", "text": "My experience with WesternUnion has been positive. I especially enjoy the ease use off use of the website. I like that I can type in the exact amount that I want my receiver to receive. I however, is not satisfied with the exchange rate. The exchange rate is not competitive with Moneygram. WesternUnion provide less payout.", "rating": 4}, {"title": "My transaction takes 5 days or more to…", "text": "My transaction takes 5 days or more to complete and for me that is too long when I have had it in a shorter timeline", "rating": 4}, {"title": "Fast", "text": "Fast and. Secure.", "rating": 4}, {"title": "Great", "text": "First of all it was great experience and peace of mind when ever we send money through WU. But Please don't increase your money transfer fees frequently.", "rating": 4}, {"title": "Mother", "text": "Is a nice company ", "rating": 4}, {"title": "You did well enough to do what I…", "text": "You did well enough to do what I requested ", "rating": 4}, {"title": "Facile de faire", "text": "Facile de faire, instructions sur les étapes à suivre, facile à comprendre", "rating": 4}, {"title": "The fee is cheap", "text": "Date of experience: September 09, 2024", "rating": 4}, {"title": "Fees are high, but worth it", "text": "Fees are high, but service is instantaneous and convenient.", "rating": 4}, {"title": "Rapid transaction", "text": "Rapid transaction, easy short steps to complete it.", "rating": 4}, {"title": "Very easy to use and track payments!", "text": "Very easy to use and track payments!  ", "rating": 4}, {"title": "Still not sending", "text": "Still not sendingI do know if I can send Because I here in Azerbaijan ", "rating": 4}, {"title": "fast no problems", "text": "Date of experience: September 05, 2024", "rating": 4}, {"title": "I love the service", "text": "I love the service! It's fast, reasonably priced. The thing that aggravates me often is their website. It's so slow, and often it cancels out and I have to start over.", "rating": 4}, {"title": "My experience sending money to…", "text": "My experience sending money to Indonesia or other countries has been helpful. It's been mostly quick and easy.  ", "rating": 4}, {"title": "After the first time the process is…", "text": "After the first time the process is very easy", "rating": 4}, {"title": "easy transfers", "text": "easy transfers, instantly available for pickup. Rates could be better and more options for receiver to pick up funds needed", "rating": 4}, {"title": "The site slowed down but a refresh…", "text": "The site slowed down but a refresh brought it back.", "rating": 4}, {"title": "Easy to make the transactions", "text": "Easy to make the transactions. I wish your new rewards program would begin or reenact your old one!", "rating": 4}, {"title": "So far So Good", "text": "I've transferred money 6-7 times and so far everything has gone smoothly.", "rating": 4}, {"title": "The security of the transaction is…", "text": "The security of the transaction is assured.", "rating": 4}, {"title": "It all went smoothly today", "text": "It all went smoothly today, paying through a QR code was easy and convenient.A small disadvantage, there was limited/no info on how to use the reward points", "rating": 4}, {"title": "Simple", "text": "Very easy to use", "rating": 4}, {"title": "Fast and efficient", "text": "Fast and efficient. Exchange rate could be better ", "rating": 4}, {"title": "I was able to send two amounts today", "text": "I was able to send two amounts today.  I have been able to send multiple remittances in one day.Unfortunately, the site was not responding after the two remittances today.  I will try later. ", "rating": 4}, {"title": "Easy to use and affordable", "text": "Date of experience: September 02, 2024", "rating": 4}, {"title": "Overall the site is great", "text": "Overall the site is great. But I have one complaint. You asked for and was granted permission to save my card number for future use. Instead of providing a list of the cards you have on file to choose from, you require me to reenter the information as a new card being entered.", "rating": 4}, {"title": "Its fast if you pay the fee dont care…", "text": "Its fast if you pay the fee dont care that a review is needed when i send some money.  I know your looking fir scams but sometimes its a lain when money is needed and fee is oaid then have to wait a couple hours for reviews. S", "rating": 4}, {"title": "Not that great your systems are super…", "text": "Not that great your systems are super slow and annoying .I have been using WU from a very long time .Never happened before now all of a sudden some thing is not working write .Especially when u require ID page .It does not stay steady ", "rating": 4}, {"title": "Very satisfactory", "text": "Date of experience: August 30, 2024", "rating": 4}, {"title": "Quick way to send money to family abroad", "text": "Date of experience: August 30, 2024", "rating": 4}, {"title": "They are big on protecting you from fraud. I have to go through all the steps every single time I use the app", "text": "It's very fast once authentication is done.", "rating": 4}, {"title": "I trust Western Union", "text": "I trust Western Union, as I have used it for a long time since I was young when I needed money, my mom would send me money through Western Union. Sometimes I was out of town working construction and needed the money until I could get my paycheck with the money she sent. I did not go hungry. ", "rating": 4}, {"title": "Convenient service", "text": "Convenient service. Many offices through the city. Though the rates could be lower especially for the transfers over 1k$. ", "rating": 4}, {"title": "On your end", "text": "On your end, it works great. The changing policies of Egyptian Banking law sometimes delays the transfer of USD, which is a nuisance.", "rating": 4}, {"title": "A LOT BETTER THAN MONEYGRAM!", "text": "Date of experience: August 28, 2024", "rating": 4}, {"title": "Very easy to use!", "text": "Very easy to use and I love the repeat transaction option!  ", "rating": 4}, {"title": "Thank you for Sending money faster to my family", "text": "They send money real fast like they life depends on it", "rating": 4}, {"title": "Easy to transfer, very cheap fees.", "text": "Likely, the least expensive way to send me.", "rating": 4}, {"title": "It’s great to use this app to send love…", "text": "It’s great to use this app to send love ones in the time of need thanks western union!!", "rating": 4}, {"title": "The system works very well", "text": "The system works very well. PLEASE tells us what is happening with WU rewards??????????", "rating": 4}, {"title": "Westernunion is fast and smooth", "text": "Westernunion is fast and smooth, but sometimes when you pay through Trustly, the money transfer is delayed from one to three days, which is absolutely troublesome, and also the last time, I had a transfer issue, I  found out that some of the employees at customer service are unprofessional  and they do not even know how to solve the issue. For example, I asked them about something by email, but they answered me totally something else, which was irrelevant to the question. I hope westernunion take this matter into consideration. ", "rating": 4}, {"title": "New Rewards Program???", "text": "I have been waiting for your rewards program to be revised.  It's taking a long time.  Are my recent transactions receiving awards?  They were easy to use previously.Today I did not receive a receipt the first time so I cancelled the order.  I put it through a second time and hope I do not get charged twice.  I will be watching my bank charges.", "rating": 4}, {"title": "Easy to resend and change amount.", "text": "Date of experience: August 24, 2024", "rating": 4}, {"title": "I appreciate your concern about…", "text": "I appreciate your concern about scammers.  However, I have been with this woman for 35 years, and I am her only means of support.", "rating": 4}, {"title": "that I can repeat sending", "text": "that I can repeat sending. I don't like I only get urgent sending! Is there another way?", "rating": 4}, {"title": "Fast and reliable", "text": "Date of experience: August 23, 2024", "rating": 4}, {"title": "The service is great but I have…", "text": "The service is great but I have accidentally sent money to the wrong person. I would like a second confirmation that it is the right person. Also when punching in the numbers is a bit finicky and the amount should always be zero before I punch in the numbers. Both these issues have been long running.", "rating": 4}, {"title": "Easy, fast way and low fees experienced for money transfers at anytime of the day", "text": "Rapidity, simplicity, clear steps to transfer money", "rating": 4}, {"title": "The instructions were quick and fast.", "text": "Date of experience: August 21, 2024", "rating": 4}, {"title": "Easy fast convenient ", "text": "I use to have to go to the store to send money now I just sit in my living room and do it so convenient.", "rating": 4}, {"title": "Simple & easy", "text": "Simple & easy ", "rating": 4}, {"title": "Please make it easier for international…", "text": "Please make it easier for international transactions", "rating": 4}, {"title": "Easy Process Once You Find A Pick-up Location", "text": "Went to several Western Union locations before I could find one that was able to facilitate a pick-up. Process was fairly easy once I found a pick-up location.", "rating": 4}, {"title": "It's really a comfortable way to send…", "text": "It's really a comfortable way to send money, though it works toooo slow in m9st cases.", "rating": 4}, {"title": "Because you changed is too much.", "text": "Because you changed is too much. ", "rating": 4}, {"title": "birthday wish", "text": "resolve quickly", "rating": 4}, {"title": "The application is user-friendly. But! ", "text": "The application is user-friendly and well-designed. The consistent improvements are commendable. However, it appears that the initial objective of the app, which was to facilitate faster service, attract consumers, and eliminate third-party fees, is not being fully realized. Specifically, I have observed that the fees for sending money within the United States are significantly higher on the app, sometimes even double or triple the fees charged by third-party services. This discrepancy requires attention and may hinder the app's overall effectiveness.", "rating": 4}, {"title": "Easy transaction", "text": "Fast, easy and secure transaction. It is available worldwide.", "rating": 4}, {"title": "Convenient money pick-up locations", "text": "Convenient money pick-up locations. Funds are readily available after transfer.", "rating": 4}, {"title": "The WU website is clear", "text": "The WU website is clear, fast, and easy to negotiate. The fees are exorbitant whether sending money domestically, to Haiti or overseas.", "rating": 4}, {"title": "Speed of pages loading has improved", "text": "Date of experience: August 18, 2024", "rating": 4}, {"title": "It's convenient.", "text": "It is convenient and fast. It was only once, or twice where the delivery was longer than two days. I've been using them for about 3 years now and I've been pretty satisfied.  ", "rating": 4}, {"title": "Online is way better than going to…", "text": "Online is way better than going to wollyworld!", "rating": 4}, {"title": "It is easy and quick when everything…", "text": "It is easy and quick when everything goes well, making it the better money wire option for me especially for international transactions.", "rating": 4}, {"title": "I've only used you guys 3 times", "text": "I've only used you guys 3 times.  The first 2 times went easy.  Then you changed your app.  The last time was more difficult, but I just need used to it.  Thanks for being available. ", "rating": 4}, {"title": "It was efficient and complete, but expensive", "text": "It was efficient and complete. The fee to send the money was quite high.", "rating": 4}, {"title": "Sending money at affordable price and…", "text": "Sending money at affordable price and good value. Sometimes there's technical glitch in apps, that needs to be improved. ", "rating": 4}, {"title": "Finally I got the website to work", "text": "Finally I got the website to work. I had tried three days with no success. ", "rating": 4}, {"title": "Easy to use", "text": "Easy to use, very reliable service.", "rating": 4}, {"title": "Sangat bagus", "text": "very fast delivery and very helpful even though sometimes there are network problems", "rating": 4}, {"title": "Great experiences always", "text": "Great experiences always ", "rating": 4}, {"title": "WesternUnion is good but needs to lower fees or offer monthly free transfers ", "text": "WesternUnion is a very good money transfer company however I wish you would offer a free transfer once a monthHaving family overseas and having to pay $80 every time we send money gets expensive", "rating": 4}, {"title": "Need more promotion to local people by Sponsoring", "text": "Need more sponsoring some local people ceremony for more people to know WU", "rating": 4}, {"title": "Easy", "text": "Easy. I use Remitly now.  The fees are less than Western Union. ", "rating": 4}, {"title": "Great service", "text": "Easy to do business ", "rating": 4}, {"title": "cost is a little too high", "text": "Date of experience: July 01, 2024", "rating": 4}, {"title": "A very simple transfer", "text": "Instructions are clear, transfer is immediate, and price is not too expensive.  4 stars as the exchange rate is a little crap, compared to midmarket value of currencies involved.", "rating": 4}, {"title": "Nothing", "text": " The security", "rating": 4}, {"title": "Good system but often locations are…", "text": "Good system but often locations are down so I am forced to send via internet which is more expensive. Frustrating. ", "rating": 4}, {"title": "all ok", "text": "all ok.  but slow speed even with high speed WIFI", "rating": 4}, {"title": "My first time use this", "text": "My first time use this.  I was worry if I made the mistake and will not get my money back.  But so far it went through.   Thanks!", "rating": 4}, {"title": "Relatively easy to use", "text": "Relatively easy to use. Fees are a bit high, but this type of transaction is the only choice for international payments.", "rating": 4}, {"title": "Overall good service", "text": "Overall good service", "rating": 4}, {"title": "Transactions expideted", "text": "Date of experience: August 15, 2024", "rating": 4}, {"title": "Quick and prompt to receive money.", "text": "Quick and prompt to receive money. ", "rating": 4}, {"title": "Easy", "text": "Easy, fast and professional. The exchange rate is ok.", "rating": 4}, {"title": "Happy with Service until Payment with Credit Card", "text": "Process was smooth until i got to payment with my credit card. After trying several times and failing, i tried another card which allowed the transaction to go through. Both cards were well under their total dollar limits. Appreciated the first time user's discount.", "rating": 4}, {"title": "Trustworthy & Fastest", "text": " I have experienced the fastest and trustworthy service.", "rating": 4}, {"title": "Western Union was able to help me but…", "text": "Western Union was able to help me but it took longer than I was expecting. My first card declined the transfer and when I tried to remake the order the system wouldn't take the card even though I cleared the transfer with my bank. I had to use a 2nd card which luckily didn't have any issues. The transfer got delayed and I had to call to have them approve it. So overall helpful but not completely smooth.", "rating": 4}, {"title": "The app is slow", "text": "The app runs in my cellphone slower than anyone.", "rating": 4}, {"title": "Good for sending money to other countries ", "text": "Usually arrives pretty quickly and has a higher currency exchange than some. ", "rating": 4}, {"title": "Fast, rapide , and sure money transfer by WU.", "text": "I have been using WU for years. The fastest,  more accurate, and surest way of transferring money to your siblings anywhere and any time in the world.", "rating": 4}, {"title": "my husband ", "text": "remember to be helpful and to notify me that i have any questions ", "rating": 4}, {"title": "All worked efficiently", "text": "All worked efficiently ", "rating": 4}, {"title": "Fast transfer without hidden charges", "text": "Fast transfer without hidden charges. It will be best for your company if the transfer fee can be reduced by 30% to be competitive ", "rating": 4}, {"title": "Funds made available immediately", "text": "Funds made available immediately. However, fees add up quickly.", "rating": 4}, {"title": "Easy to send money to Turkey however…", "text": "Easy to send money to Turkey however when transferring money to a Turkish based bank that takes dollars I was unable to send money in USD and was forced to convert to local currency ", "rating": 4}, {"title": "easy to use today", "text": "Date of experience: August 14, 2024", "rating": 4}, {"title": "fast to transfer money to over seas ", "text": "fast to transfer money to over seas Great and safe company very trusted ", "rating": 4}, {"title": "Pick up with test question option needed on app!", "text": "The only thing I can think of is allowing the option to send funds to my son in the US with just the control question. He was robbed and had wallet stolen while working away from his home and where no one knows him. I sent him funds but had to get him to find a total stranger for me to send to and to pick it up. I’m an hour away from closest WU agent so the ability to specify pick up without ID and with just the control question and correct answer could mean the difference in someone being ok or being wiped out by weather and not having funds to survive. ", "rating": 4}, {"title": "it’s easy to send money but it takes 2…", "text": "it’s easy to send money but it takes 2 days before my wife get the money thats why i only give you 4 stars ", "rating": 4}, {"title": "Service on app in general is good", "text": "Service on app in general is good, but the app sometimes experience freezing so then is not so good. Also on the rewards if you want to apply them it takes you out of the app, which is strange and then I have problems applying it to my transaction. Also the login can be a challenge at times. You need to check with the developer to fix these problems. ", "rating": 4}, {"title": "Your rewards are no longer working and…", "text": "Your rewards are no longer working and I am still waiting for them to be updated or become active. ", "rating": 4}, {"title": "More detailed funds tracking required", "text": "It would be helpful if you can provide a granular understanding of funds tracking. I just saw \"In progress\" the whole time and then after 5 days, it turned to \"Completed\". Some details in between would've helped.", "rating": 4}, {"title": "This is the best service I've used so…", "text": "This is the best service I've used so far. Moneygram is crap, xoom is crap, and the banks charge waaay too much in fees, etc. ", "rating": 4}, {"title": "Simple and fast", "text": "It doesn't require a long distance of transport. I actually appreciate de the speed and security of my account.Thank you for you attention the users' needs.", "rating": 4}, {"title": "Quick Tranfers", "text": "When the system works, funds get to the recipient quickly. ", "rating": 4}, {"title": "Able to send money to bank account", "text": "Able to send money to bank account ", "rating": 4}, {"title": "All went well", "text": "All went well ", "rating": 4}, {"title": "I love your \"Resend Feature\"", "text": "I love your \"Resend Feature\"!  Really easy!", "rating": 4}, {"title": "I had to wait... ", "text": "I was not able to create an account and send money the same day.  I had to wait 24 hrs. Then the transactions would not give an error. I would like the ability to send money to an individual by using their Western Union ID. ", "rating": 4}, {"title": "The web site is a little confusing when…", "text": "The web site is a little confusing when trying to send money to someone. ", "rating": 4}, {"title": "Fast pick up service ", "text": "I love how fast my mother can pick up her money..and send me notifications about the pickup!! Thanks WU", "rating": 4}, {"title": "need rewards and promo", "text": "Date of experience: August 12, 2024", "rating": 4}, {"title": "Someone kindly addresses my concerns and…", "text": "Someone listens to my concerns and addresses them. My transfers always made it to destination.", "rating": 4}, {"title": "I really wish for discounts of…", "text": "I really wish for discounts of transaction fees. I send money weekly and the fees are over 15 dollars per sending", "rating": 4}, {"title": "A bit complicated for keep filling up…", "text": "A bit complicated for keep filling up my ID  information.. over all ok", "rating": 4}, {"title": "It's great", "text": "It's greatVery much appreciated with the serviceI cannot remember specific dates of experience ", "rating": 4}, {"title": "Great service", "text": "Great service, I wish they'd charge less for it, thank you", "rating": 4}, {"title": "The process of sending was swift.", "text": "Date of experience: August 11, 2024", "rating": 4}, {"title": "Promptness", "text": "Fast service ", "rating": 4}, {"title": "The online money transfer service is…", "text": "The online money transfer service is seamless, user friendly and convenient. The only thing I would like to complain about is the fact that we don't earn points anymore with every transaction we make as was before.😲", "rating": 4}, {"title": "TRANSFER", "text": "The previous two transfers were transferred the same day.  For some reason this transfer is taking three days.", "rating": 4}, {"title": "Top notch", "text": "Quick and easy", "rating": 4}, {"title": "easy to deal with ", "text": "easy to deal with. has helped me out very much I wish I would get discounted rates on the transfers since I use it so much", "rating": 4}, {"title": "Always happy and remember this…", "text": "Always happy and remember this application service to fulfill what I needs. So pleasure and thanks so much 🙏", "rating": 4}, {"title": "A very good and fast way to send money.", "text": "A very good and fast way to send money.A good and very reputable company that has reasonable rates all over the world ", "rating": 4}, {"title": "The WU system lost the address and…", "text": "The WU system lost the address and banking info I had to ro type everything", "rating": 4}, {"title": "Easy to use and transaction collected OK", "text": "Date of experience: August 02, 2024", "rating": 4}, {"title": "Thank you it’s extant", "text": "Thank you it’s extant ", "rating": 4}, {"title": "The money was sent safe and quick", "text": "The money was sent safe and quick ", "rating": 4}, {"title": "There is room to improve on the rates…", "text": "There is room to improve on the rates please. ", "rating": 4}, {"title": "If I can anyone can ", "text": "It’s was smooth and I like how straightforward it is", "rating": 4}, {"title": "The charges was to much", "text": "The charges was to much, as it was smooth transaction to USA on the first of August 2024", "rating": 4}, {"title": "Quick delivery", "text": "Quick delivery ", "rating": 4}, {"title": "Very easy to use and kept inform of…", "text": "Very easy to use and kept inform of delivery and pick up by email ", "rating": 4}, {"title": "Efficient", "text": "Ease, effiency, secure. 👍🏼", "rating": 4}, {"title": "Rates and fees are good", "text": "Date of experience: July 19, 2024", "rating": 4}, {"title": "Great …….but?", "text": "Once you get to the point where you’re actually confirming the transaction, everything is very very professional, smooth, and efficient. The difficulty is that whilst it’s important that customers are verified, checked, and to be an appropriate user, it is very tiresome how many checks and verification stages are required. It seems to be more difficult sending money with WesternUnion, than some of the competitors.Having said that, great service once you have been accepted as an authorised customer.", "rating": 4}, {"title": "I was able to put the money in my sons…", "text": "I was able to put the money in my sons account without any real fuss", "rating": 4}, {"title": "The company send my funds plus l…", "text": "The company send my funds plus l received my fund on time. Easy to send on my iPod while relaxing at home.", "rating": 4}, {"title": "I worked at western union and I used…", "text": "I worked at western union and I used the app all the time to send money to my family and friends. It is very easy and fast to send money on the app.", "rating": 4}, {"title": "Quick and efficient for sending money", "text": "Quick and efficient for sending money, for collection in cash in Tanzania, where bank accounts are not so widely used. WU need to improve on the exchange rate though.", "rating": 4}, {"title": "I was informed correctly,money reached…", "text": "I was informed correctly,money reached on time and accessible to receiver. I enjoyed my choice of using this service and will again. The charge rate not sure how its calculated upon amount sending but it didnt affect my process.", "rating": 4}, {"title": "No Comments", "text": "No Comments ", "rating": 4}, {"title": "Efficient easy to use", "text": "Efficient easy to use ", "rating": 4}, {"title": "Easy send/safe", "text": "Date of experience: August 11, 2024", "rating": 4}, {"title": "I like that is user friendly but it…", "text": "I like that is user friendly but it doesn't save my personal data, i.e. address and it keeps asking me to enter it. Other than that it's a great way to send $$$.  ", "rating": 4}, {"title": "I am very pleased with Western Union", "text": "I am very pleased with Western Union.  I need to send money often to the Dominican Republic because I live there part time and it is the best way for me to send myself money..    The only criticism I have is that the Western Union office that is within walking distance to me often does not have enough money or any money if it is over $500 dollars and without having a car it makes it more difficult for me. ", "rating": 4}, {"title": "Short time with sending", "text": "Short time with sending ", "rating": 4}, {"title": "your service is the most secured site…", "text": "your service is the most secured site that I can use I don't use cash apps on my phone and I can talk to a person if I need to", "rating": 4}, {"title": "Fast and easy transaction.", "text": "Date of experience: August 09, 2024", "rating": 4}, {"title": "ease of use.", "text": "Date of experience: August 08, 2024", "rating": 4}, {"title": "The experience was fair though it would…", "text": "The experience was fair though it would be helpful to speak to agents that are fluent in English as requested. Western Union needs to update their history portal so that transactions are current.", "rating": 4}, {"title": "Western Union always makes my money…", "text": "Western Union always makes my money movement efficient and simplifies my financing of my world travels.", "rating": 4}, {"title": "Use for all your transactions ", "text": "I now use Western Union for all of transfers. It's quick and easy. Also the fees are within reason. ", "rating": 4}, {"title": "Works fine most of the time", "text": "Works fine, it's just a little annoying the language of the pages I get directed to changes into French now and then, while I prefer English and never requested to be adressed to in French.", "rating": 4}, {"title": "Company is doing well but you have made…", "text": "Company is doing well but you have made transfer little bit complicated. In the past we could send transfer straight with our Bank card , now you have introduce Paypal, which is wrong. I do not want to share my bank details with third party, Please look into it", "rating": 4}, {"title": "Quick.", "text": "Quick.The agent was kind and the transaction was quick. I got my receipt without delay. The recipient was delighted.", "rating": 4}, {"title": "Easy online", "text": "Date of experience: August 08, 2024", "rating": 4}, {"title": "Opinion service Western Union", "text": "Good customer service when you have questions.The transaction fee is a bit high (arround 10 % including profit exchance money).", "rating": 4}, {"title": "you need toimprove the process. Itgoes in loop, asking the same questions again and agai", "text": "you need toimprove the process.  you keep askingn then same questions again and again..", "rating": 4}, {"title": "Safe and secure ", "text": "It's easier and secure to send money to the love once ", "rating": 4}, {"title": "WU Ease of use ", "text": "Ease of use.", "rating": 4}, {"title": "Quick transfer and my family received…", "text": "Quick transfer and my family received it the same day.", "rating": 4}, {"title": "I am able to get market price better…", "text": "I am able to get market price better than other ones that I also use.I would like more easy bank transfer for free. Debit card is easy but cost about £2", "rating": 4}, {"title": "Money transfer review", "text": "No issues or difficulties with money transfer and the site is easy to navigate besides being user-friendly. One draw back is that comparatively with remitly money transfer company your rate is always not attractive, hence one would prefer to utilise remitly. ", "rating": 4}, {"title": "Fast service ", "text": "It’s a fast and reliable service. Very straightforward and fees for transfer are reasonable, however don’t change even with larger transfers. Currency exchange could be bit higher as it makes difference. ", "rating": 4}, {"title": "Easy to use and secure", "text": "So easy to use, especially if you’re making similar repeated payments or payments to the same recipient.Where, for AML/KYC purposes, further information and personal details are required, the requests and process for providing this is simple and easy. I’ve had some exposure to other similar service providers and I would use and recommend Western Union every time.", "rating": 4}, {"title": "Delivery to my account is very fast", "text": "Delivery to my account is very fast. I am impressed. But please give better conversion exchange rate in Naira", "rating": 4}, {"title": "Can do better .", "text": "Can do better . ", "rating": 4}, {"title": "Very good 👍 👍", "text": " Very good 👍 👍", "rating": 4}, {"title": "I found quite cheap sending fees and…", "text": "I found quite cheap sending fees and quick way to have received ", "rating": 4}, {"title": "I would gave western union 6 star but…", "text": "I would gave western union 6 star but they are prices are halendous, charges are expensive, but they are faster sending money, they are good 👍 ", "rating": 4}, {"title": "Safe method ", "text": "Quick and safe way to send money ", "rating": 4}, {"title": " The best online transfer", "text": "It is good, that we can use the online transfer which is the best option.... ", "rating": 4}, {"title": "Easy to use app and money sent…", "text": "Easy to use app and money sent immediately.  I’ve used WU many times and found it to be reliable and safe. However the exchange is not always the best in addition to the fees WU charge. ", "rating": 4}, {"title": "Money", "text": "Nice service.", "rating": 4}, {"title": "It is reliable and trustworthy", "text": "It is reliable and trustworthy. It needs to improve it's web site so that it is easier to work on.", "rating": 4}, {"title": "You can rely on western Union", "text": "I trusted Western Union l,customer also reliableAny problem they try to solved it.", "rating": 4}, {"title": "Good easy to send", "text": "Date of experience: August 01, 2024", "rating": 4}, {"title": "Good and very well", "text": "Date of experience: August 06, 2024", "rating": 4}, {"title": "Safe and reliable!", "text": "Date of experience: August 06, 2024", "rating": 4}, {"title": "The exchange rate. For regular client a better exchange rate should be offered.", "text": " convenient", "rating": 4}, {"title": "I love WU because I no need leaping the…", "text": "I love WU because I no need leaping the ship to send my money's back home.", "rating": 4}, {"title": "Quick money transfer.", "text": "Date of experience: August 05, 2024", "rating": 4}, {"title": "My family gat the  I send in good time", "text": "My family gat the  I send in good timeMoney is received with no problem ", "rating": 4}, {"title": "It is quick and simple", "text": "Date of experience: August 05, 2024", "rating": 4}, {"title": "It is very important that shipping payments do not increase because we work on ships, the salary of every Asian is not like that of Europeans", "text": "I hope the payment is like before, 3 dollars and the service is very good, that's all, thank you", "rating": 4}, {"title": "Quick service for last payee", "text": "Previous payee detail were available to reuse made it quick and easy to send money ", "rating": 4}, {"title": "VERY FAST THANK", "text": "VERY FAST.THANK", "rating": 4}, {"title": "It's nice that it's a quick way to get…", "text": "It's nice that it's a quick way to get money to someone's phone once it's setup. But it can be difficult if you have only one debit account and are supporting more than one student since (for good reason) the site doesn't like multiple transfers from the same account too close together.  I would like the ability to designate how much the receiver gets, rather than guessing at numbers until the received amount is about right. ", "rating": 4}, {"title": "I can always count on Western Union", "text": "I can always count on Western Union, even thou sometimes due to political situation in Venezuela they have to close.", "rating": 4}, {"title": "very quick and simple", "text": "very good, quick and simple", "rating": 4}, {"title": "A good service but online process not working", "text": "I have been sending money for years. WU new system is not working. I haven’t bee receiving the mail to check the transaction. I have had to ask for a photo with transaction information That needs reviewing ", "rating": 4}, {"title": "aa few clicks  and all is done", "text": "aa few clicks  and all is done", "rating": 4}, {"title": "Cost for Sending should be lower", "text": "Cost for Sending should be lower, if you are sending funds a few times a month ", "rating": 4}, {"title": "Good quick  reliable ", "text": "Reliable  service ", "rating": 4}, {"title": "this is good for recomendation send…", "text": "this is good for recomendation send money homebut some times have problem also ", "rating": 4}, {"title": "Nice people  and quick service", "text": "Date of experience: July 07, 2024", "rating": 4}, {"title": "Should give update or notify me when…", "text": "Should give update or notify me when the receiver already received the money on his or her bank account. ", "rating": 4}, {"title": "Some countries are easier to access than others ", "text": "Straight forward service easy to use however some countries are easier to access than others ", "rating": 4}, {"title": "Western Union has always efficiently…", "text": "Western Union has always efficiently transferred money for me to my friend in Gaza, within minutes.  Now - not I guess the fault of Western Union - when I send money to Gaza my friend can't pick it up immediately.  The terrible local situation seems to insist that the money is first transferred to a local bank account and is only collectable (for a fee) after 3-4 weeks.", "rating": 4}, {"title": "The exchange rate that the Brixton…", "text": "The exchange rate that the Brixton branch is giving compared to other is what keep me coming back. ", "rating": 4}, {"title": "good and fast", "text": "Date of experience: July 27, 2024", "rating": 4}, {"title": "It depends on were you  are sending…", "text": "It depends on were you  are sending money from some time the people are ok and other times they are not at all  helpful ", "rating": 4}, {"title": "Always live up to expectations", "text": "Always live up to expectations. Pleasant costumer/staff interaction. ", "rating": 4}, {"title": "Staff very helpful", "text": "Staff very helpful. Money received promptly. ", "rating": 4}, {"title": "The website is extremely buggy", "text": "The website is extremely buggy. I got so many different error messages, timeouts and just confusing behavior. Eventually managed to make the transfer but it was very painful and too hours.", "rating": 4}, {"title": "I have been using this Western Union…", "text": "I have been using this Western Union online almost 6 years and it would be great if the point for sending money can be started again. Almost 3 years since no more point apply. ", "rating": 4}, {"title": "Reliable and trustworthy.", "text": "Date of experience: July 29, 2024", "rating": 4}, {"title": "Secondary Verification Code Not Working", "text": "Everything went great with the exception of not receiving the verification code, twice. So, the secondary security is not working properly. ", "rating": 4}, {"title": "Fairly simple", "text": "Fairly simple. Website is a bit non-responsive sometimes. Maybe better than in the past though.", "rating": 4}, {"title": "The web page is very buggy", "text": "The web page is very buggy. It forgets the amount I entered, asks me to start again many times. Took too long.", "rating": 4}, {"title": "speed and fast", "text": "the best way to be satsfied", "rating": 4}, {"title": "I enjoy being able to transfer money…", "text": "I enjoy being able to transfer money from home. I'm grateful I don't have to drive anywhere to send money!!", "rating": 4}, {"title": "Things are smooth with the app", "text": "Things seem to be going smoothly with the app, which I greatly appreciate. ", "rating": 4}, {"title": "FAST and works always", "text": "Works always, Fast deliveryTo high fee, thats why 4 instead of 5 stars", "rating": 4}, {"title": "It was easy to use", "text": "It was easy to use. Although they had technical difficulties I was able to get it to work.", "rating": 4}, {"title": "Good ", "text": "Very easy and fast . Save of the time", "rating": 4}, {"title": "We have family and Business in Mexico…", "text": "We have family and Business in Mexico and this is the best way for us to help them", "rating": 4}, {"title": "WU is a good service…2024", "text": "WU is a good service and the money arrives in moments. The only gripe I have is that the charges are higher in comparison with some other money transfer services. However, overall I still think it is avery good service", "rating": 4}, {"title": "Repeat transactions simplify the…", "text": "Repeat transactions simplify the process.", "rating": 4}, {"title": "The benefits of Western Union", "text": "Good opening hoursProcess is simple and quick to completeGood availabilityHelpful staff", "rating": 4}, {"title": "The service was good however he…", "text": "The service was good however he requires more savvy it skillsHe constantly get name spelling wrong which he should delete incorrect and just tap in to correct.This is an it training issueThey are helpful kind polite", "rating": 4}, {"title": "Courteous service! ", "text": "Pleasant, helpful, courteous and professional staff at the outlet within Sainsbury’s in Canley. ", "rating": 4}, {"title": "The set up for sending money abroad is…", "text": "The set up for sending money abroad is excellent with very little form- filling required. My only experience with what I am not happy with is I send money to France to my stepson for medical help and some occasions he has been to collect cash and found it blocked ( only relatively small amounts 100- 200£ ) so then it means contacting western union to clear it as there had been a security block and then next time again it is blocked. I feel so sorry for him when I send him the transfer document and he travels to the pickup point and it is not available then goes home and has to come back again. ", "rating": 4}, {"title": "Great service", "text": "Great service ", "rating": 4}]