[{"title": "Great ring", "text": "I think the ring is really pretty, I wear it everyday. The weight of the ring is a lot lighter than I thought though but still a great ring. It’s wearing a bit already but I don’t take my rings off really ever so that’s to be expected at some point, just didn’t think it would happen so quick. Either way, I love the ring and would buy again. ", "rating": 4}, {"title": "I had a very good experience with…", "text": "I had a very good experience with Vanessa flair . The goods arrive on time and are just as described ", "rating": 4}, {"title": "I think they have a great selection of…", "text": "I think they have a great selection of men’s jewelry and I hope they will expand their collection- would love to see some red jewelry ", "rating": 4}, {"title": "I tried to advertise the brand and got…", "text": "I tried to advertise the brand and got zero feedback. Love the product but it was very tangled", "rating": 4}, {"title": "Generouse gift with the weel", "text": "Generouse gift with the weel. Quick arrival of the parcel. The quality isn’t very showing in a plastic bag. Sadly not enough silver choice. ", "rating": 4}, {"title": "CldT Studios Review", "text": "Hello!David from Cld.T StudiosMaybe size options for the jewelry.          My neck and wrist are bigger than most, does that mean that I can’t wear your good quality jewelry? AndPackaging upgrades           Maybe in the future, my suggestion would be to improve the customer experience in terms of the unboxing experience.Thank you for taking your time to read this, I look forward to continuing and building our relationship!Take care!David Palmer, Cld.T Studios", "rating": 4}, {"title": "The jewelry is beautiful", "text": "The jewelry is beautiful.  It's just the delivery that's a problem.  I got an email stating the jewelry had been delivered and it had not.  That happened another time, too.  And it takes a while to get the order.  I finally got it quickly after emailing you.  Really pretty.", "rating": 4}, {"title": "I liked my jewelry but some of them…", "text": "I liked my jewelry but some of them were a little off from what I was expecting based on the pictures. Shipping took longer than expected as well. However, I am satisfied with my experience.", "rating": 4}, {"title": "I wish the delivery package set can be…", "text": "I wish the delivery package set can be change. The product of necklace original price was $70. However, when customer receive products and open it, the item not looks like $70. Is there any chance you can change package product design into a small box?", "rating": 4}, {"title": "Jewelery is very nice but...", "text": "Jewelery is very nice, but I would like to see these items in silver as well.  Also I had to much problem with delivery and delivery to UK is expensive.", "rating": 4}, {"title": ":)))", "text": "everything was great, but jewelry was too yellow for my taste, also mens necklace was a little bit too short. I would suggest specifying the length of the necklaces.", "rating": 4}, {"title": "Delivery type", "text": "My only issue is that the items were not delivered to my shipping address and I still needed to travel to receive them at a drop off point", "rating": 4}, {"title": "Nice products!", "text": "Nice products!I loved wearing the three products that I received.Thanks a lot.The shipping was very slow so I took one star out.I have one suggestion that I wish you have more silver products so that people who have a pale/bright skin tone can have more options.", "rating": 4}, {"title": "I loved the jewels I definitely…", "text": "I loved the jewels I definitely recommend them.It took a 3 months but it finally arrived, well packed", "rating": 4}, {"title": "Beautiful", "text": "Long delivery time, however the jewelry arrived in order, they are beautiful and still shine after a month of wearing", "rating": 4}, {"title": "i love this brand", "text": "i love this brand! i’m so grateful! i didn’t receive the right earrings but it’s okey, i did receive an earring that isn’t even part of the shop yet! LOVE YOU", "rating": 4}, {"title": "It’s a reliable provider of jewelry", "text": "It’s a reliable provider of jewelry of quality, jet affordable for anyone. Good service, easy to order and effective delivery!", "rating": 4}, {"title": "I love my jewelry only a couple ever…", "text": "I love my jewelry only a couple ever have I not loved and I’ve bought a LOT of their stuff", "rating": 4}, {"title": "Very nice jewellery for many occasions!", "text": "Date of experience: June 25, 2022", "rating": 4}, {"title": "Was happy with my men’s rings and…", "text": "Was happy with my men’s rings and necklace ", "rating": 4}, {"title": "Nice products", "text": "Nice products, use them alot :) high shipping cost abroad- gives them only 4 stars.", "rating": 4}, {"title": "Beautiful jewelry", "text": "First of all, the delivery of the jewelry was fast. Then to make the product attractive it is necessary to have an adapted packaging (type: small box for the rings) according to me it is not necessary to put them in plastic bags. The jewels are beautiful, are the same as on the photos presented on the site however the ring was not with my size (much too large) whereas I had used the guide of the sizes thus according to me it is a point to be revised. On the other hand, the products seem qualitative and that's the main thing.", "rating": 4}, {"title": "I just received the jewelry in the mail…", "text": "I just received the jewelry in the mail so I haven't had a chance to wear any of it to see how it does. The earrings I ordered feel very heavy but that's to be expected. Everything is very pretty so I'm excited to wear it soon! I do, however, wish there were more options of pieces to buy. A lot of it just isn't my style.", "rating": 4}, {"title": "👌👌👌", "text": "The jewels are amazing, they are beautiful and they can be under water. However the packaging were not nice, it looked like Aliexpress and the earrings were not exactly the same as in the picture but still great!", "rating": 4}, {"title": "Absolutely Amazing Jewels", "text": "Amazing jewels! The lack of shipping updates was a little stressful for such expensive items, but receiving them felt like Christmas! Everything is so well made, and looks so amazing. Absolutely worth the wait and price!!", "rating": 4}, {"title": "Ring size was the only issue", "text": "Tracking was great, the pieces are lovely, but my ring is bigger than all of my other rings that are a size 7. I wear my earring pretty much every day though!! Overall a great experience!", "rating": 4}, {"title": "Problems with the shipping time", "text": "Thé jewelry is great ! But the order took a very long time to arrive… and there was no real way to track where it was… the website is beautiful.", "rating": 4}, {"title": "The jewelry is original", "text": "The jewelry is original. The packaging can be improved to be nicer. The choices of silver jewelry is very thin.", "rating": 4}, {"title": "Thank you very much", "text": "Date of experience: November 10, 2023", "rating": 4}, {"title": "The manager dust answer me", "text": "Date of experience: June 24, 2022", "rating": 4}]