[{"title": "Good Customer Service ", "text": "Very good customer service in helping me with returns. Only downside was that i said i couldn't print the label, they said it was ok and to take the downloaded label to the Post Office, but there was no QR code so Post Office couldn't help. Customer Service did then give me an address to send returns to, but i had had a wasted trip by then.", "rating": 4}, {"title": "Soshi was patient  and polite and…", "text": "Soshi was patient  and polite and appears to have  resolved my  questions,  except one with regard to the fasteners  on the dresses otherwise I'd have rented her a 5 star..", "rating": 4}, {"title": "Great service for returns. ", "text": "I received great service when came the time to send back items and receive new items of a different size.  The team was very helpful and I was able to return my items easily and received the replacement garments quickly.  ", "rating": 4}, {"title": "At 1st my transaction didn't go thru", "text": "At 1st my transaction didn't go thru. Tried a 2nd time & wouldn't go thru!!  Had to back out & resubmit again. (3rd try) plus they have my valid account on file. Must have been a glitch! I love past purchases & will continue to purchase in the future.. Thank You", "rating": 4}, {"title": "Swimming costume", "text": "Swimming costume.  I bought online, it was delivered fairly quickly, the size was fairly good and really looked good on.  It didn't get 5 stars for small reasons in the quality of the manufacturing, but I'm being picky, I like well made clothes.  But I would buy from them again for sure.  Very good value for money!", "rating": 4}, {"title": "Upon receiving my items and trying them…", "text": "Upon receiving my items and trying them on and found they did not fit, I email Rotita about this and asked if I could get a larger size. With no hesitation, they emailed back with the address to return the good and did there best to upgrade my garment. Alice can I say please keep up with the good work that you are doing. It was appreciated from me here in New Zealand.", "rating": 4}, {"title": "I love the clothes", "text": "I love the clothes, they are genuinely top notch and look far more expensive th they are. I started off with bathing suits, which are excellent, but now get the dresses and other outfits as they look so classy and fit me well. They have a wide range of styles and sizes. The only problem is the long wait, but the delivery is slow because they are not wasting their money on more expensive and fuel costly transport. So, cheaper and better for the environment if you don't mind the wait. It can be frustrating at times, but so far so good. The people on the chat box seem helpful.", "rating": 4}, {"title": "This is my first order and I received…", "text": "This is my first order and I received my 4 swim suits todays they all are very nice, good material. I am very happy with the suits, the only thingG is I ordered 2 anklet brackets that did not come ..I was offered a return or re-ship them straight away no issue what so ever so hopefully I will get my bracelets in the near future", "rating": 4}, {"title": "I had ordered too many items and my…", "text": "I had ordered too many items and my experience on correcting my error was very easy.  The representative was very helpful and polite even at 1:00 am eastern standard time.  Thank you", "rating": 4}, {"title": "Very patience & understanding with a…", "text": "Very patience & understanding with a return of an item. Ordered online but had difficulty with return instructions.  Customer Service was A1 an d solved the issue quickly.than k you", "rating": 4}, {"title": "Good value", "text": "Rotita tops are nice styling and lovely colors. They won't last forever but at this price you can refresh your wardrobe more often!! I did have an issue with a return order but it was resolved in the end and my money was returned", "rating": 4}, {"title": "Was having difficulty completing a…", "text": "Was having difficulty completing a return and exchange online. Used the live chat, Swoshi chatted with me and resolved my issue within minutes. Very helpful 😀", "rating": 4}, {"title": "Excellent products", "text": "Excellent products! Been ordering swimsuits for years! Probably have 15-20 pieces dresses, swim suits, cover ups.", "rating": 4}, {"title": "Refund for unsuitable item", "text": "Unfortunately my bathing costume was not suitable, the colour was not at all like the colour advertised. I returned it and have received a refund. Correspondence was good and I have received my refund.", "rating": 4}, {"title": "Great online shop", "text": "My first time using this site. Delivery was very quick. The clothing was great quality. The prices are great. The sizes are mostly true to size. I would recommend this site to anyone.", "rating": 4}, {"title": "I placed an order on Nov 5 and it…", "text": "I placed an order on Nov 5 and it arrived on Nov 16. The clothes I bought was nice out of the 4 only 1 did not fit. The sleeves were not proportioned to the rest of the garment. All the other clothes fit and looked beautiful.", "rating": 4}, {"title": "Lovely dresses", "text": "I purchase some dresses in the past and all of them was as described.  I really love their clothing but their return policy can be better.", "rating": 4}, {"title": "Was happy with swim suite and return…", "text": "Was happy with swim suite and return was only because of size, was a good experience.", "rating": 4}, {"title": "I ordered quite a few items from them", "text": "I ordered quite a few items from them. So far their communication has been great.", "rating": 4}, {"title": "They answered back really fast", "text": "They answered back really fast. I still need my stuff asap. It should not have to be redone just sent on from NC", "rating": 4}, {"title": "helpfull chat", "text": "Item didn't fit but the chat person was excellent", "rating": 4}, {"title": "So many options and great prices", "text": "So many options and great prices. Return was easy and efficient !", "rating": 4}, {"title": "Everything arrived and all material are…", "text": "Everything arrived and all material are fine.", "rating": 4}, {"title": "Thank you hopefully it’s right this…", "text": "Thank you hopefully it’s right this time.  ", "rating": 4}, {"title": "My order arrived promptly, but ....", "text": "My order arrived promptly, but unfortunately I had to return one top as way too small. The swim wear fitted fine. The Live Chats were helpful with explaining the return process. Sad the return postage cost nearly as much as the item. In hindsight I probably should have offered the top to a friend.", "rating": 4}, {"title": "First Time Customer", "text": "I ordered a dress for the first time from this company a few weeks ago for a party. I was pleased with the price as well as the dress, had to make a minor adjustment on the strap but other than that the dress was a perfect fit. Shipping was probably about a week. Overall I was satisfied with everything and I will definitely order again.", "rating": 4}, {"title": "Hi Quintas!", "text": "Hi Quintas!You've answered all of my email in a good timely manner, & I really appreciate it. But, the fact remains with the 1st order, that I haven't received. I paid in full via debit card 1038. I have recieved the 2nd order & I love it. PLEASE help me in recieving my order. Thank you in advance! Sheila Jarrell 249 Cherry Street box450 Marienville Pa 16239(814)229 7348Have a great day!!", "rating": 4}, {"title": "My experience on the app has been bad I…", "text": "My experience on the app has been bad I know apps can have glitches but as long as it’s resolved quickly I’m fine with it!! I have been working on this app for over two hours trying to pay for what I picked out and it took me a long time to pick it out so I want to be able to buy it now!  Now Sowshi has been really nice to chat with and helpful, I really hope to resolve this tomorrow this is what my husband has given me for my Christmas and I’m not even able to do it by Christmas!", "rating": 4}, {"title": "I have a chat live session with Sophia", "text": "I have a chat live session with Sophia, She was very nice and understanding. she understood my situation and offer to rush my order  I gave 4 stars because I'm going to wait to see if it's rushed and if it gets to me on time. If I do get it on time, I will definitely update with 5 stars.", "rating": 4}, {"title": "Vicky was very helpful in getting the…", "text": "Vicky was very helpful in getting the exchange set up for a swimsuits that was ordered.   I ended up needing a smaller size but they came through.  Even though it takes a bit of time, it happened without fail.   However, I would like to mention the site is a little tough to figure out where to go to so these things but got it figured out eventually.", "rating": 4}, {"title": "extremely poor clothing  Items are shipped from China and their helpline number is 🥺 seven60284 three one three one !!!!!!!! found the sizing is inconsistent between items and some of the fabrics are", "text": "extremely poor clothing  Items are shipped from China I found the sizing is inconsistent between items and some of the fabrics are poor I sent them several emails about return, getting no response from them  I went on the internet and I found this help which is  i contacted the customer service for refund and prepaid shipping label to return this clothes back to the company I returned two items and i received my refund", "rating": 4}, {"title": "The ordering process was easy", "text": "The ordering process was easy. Rotatable has lovely stuff.  I followed the size chart and ordered large in everything.  Unfortunately one of the bathing suit tops I ordered was too small and one of the tops I ordered was too large.  I don’t know yet what the return experience will be like.  I don’t know if I will have to pay for shipping the stuff back. It took a long time for me to get the stuff that I ordered.", "rating": 4}, {"title": "Prompt customer service", "text": "The customer service regarding my recent order with Rotita was excellent. Sumie, the representative was very prompt and responsive in getting back to me regarding the refunds and exchanges I wanted made. Although some tops did not fit me correctly (various products seem to have differently sized), Rotita was prompt in providing refunds. I wish there is an option to request customized measurements in the future.", "rating": 4}, {"title": "I enjoy shopping on the site", "text": "I enjoy shopping on the site. It is user friendly and easy to navigate. I just placed my second order and look forward to the new styles. The items received thus far were nice fabric, no need to iron, and felt good on my skin. I live abroad so returning items is expensive and difficult so I use caution when shopping online. Rotita has given me an opportunity to pump up my chic look without breaking the budget.", "rating": 4}, {"title": "Recent Purchase", "text": "I purchased 5 items all in the same size - medium.  They arrived as expected and I liked them all.  The problem is that they did not all fit the same. One top is more like a \"large\" but I have a friend I can give it to.  The others are all wearable albeit some a little bigger than I would like. I like the styles and will probably order from Rotita again.", "rating": 4}, {"title": "Pleasantly Surprised", "text": "I was a little skeptical when saw these beautiful dresses and the prices they were listed at but couldn't resist ordering & checking out for myself. I have now ordered 4 dresses and feel like they won't be my last. I like that the material on the ones I bought are easy to iron and felt good on. Beautiful dresses for weddings, galas, church, etc. Can't wait to try on other articles of clothing.", "rating": 4}, {"title": "I ordered a dress which had to be…", "text": "I ordered a dress which had to be returned as the sizing was wrong.  Ordered something else which was great.  I found the postage very expensive, nearly 17.00 English money to return the first order.Sara was very helpful and is arranging my refund.", "rating": 4}, {"title": "I was overall pleased", "text": "I was very pleased with the shipping (came a week early), the material and stitching is good and the sizing was exact. The only problem is that they forgot to ship the bottoms of one of the bikinis I ordered. The help I got on the 'chat' was very good, so hopefully I get the rest of the bathing suit shipped quickly.", "rating": 4}, {"title": "Sunflowers for Summer", "text": "I absolutely love sun flowers so this was the perfect bathing suit for me. I ordered one size up because so often things run small but it was true to size. So I easily contacted rotita and sent it back for the right size. The quality is great, which is always a risk when ordering online but I was quite pleased. And the shipping was right on time", "rating": 4}, {"title": "I ordered 3 tops and 1 pair of jeans", "text": "I ordered 3 tops and 1 pair of jeans. The tops were as I expected, regretfully I one the tops was too snug. But I have the okay to return & exchange that item. I was disappointment with the jeans the fabric was very lightweight and the length was so long if I shortened them to the correct length I would lose the shape of the pants. These are being returned and refunded, no problem", "rating": 4}, {"title": "i've had issues with the zippers on…", "text": "i've had issues with the zippers on both dresses, on the one the zipper freezes at the collar line but eventually can be worked free however i fear that eventually it will break.............on the other garment the zipper freezes along the waste line...........again with gentle coaxing it will unzip but again i fear eventually it will fail at that point.", "rating": 4}, {"title": "Losliya Took care of the issues with my…", "text": "Losliya Took care of the issues with my order, facilitating my logging into my account, refunding an item that was not received and providing a return label for other items.  Communication was not always clear, and sometimes she would say something, then minutes later say the opposite thing without acknowledging the contradiction. It was a little confusing, but she did provide customer service and solutions to my problems.", "rating": 4}, {"title": "3rd order still no bad experience", "text": "This is my 3rd time ordering from this shop and they again did not disappoint me. All items were present and I was pleased everything fit perfectly. even with the size charts saying some things might be a bit tight all items were perfect size. Quality wise it's somewhat depending on the item. Most things are really nice quality.", "rating": 4}, {"title": "There is only one thing I would love to…Ups and downs...🙂🙃", "text": "There is only one thing I would love to see is on the swimming suites. I bought me and my granddaughter  both one and either you get the tops right and the bottoms are to big or in her case the bottoms fix right and the top was to small. I wish you could do that differently. But she and I love the other clothing.", "rating": 4}, {"title": "Red cardigan", "text": "I bought this beautiful red cardigan as something to wear over Christmas as it's just the right colour. It looks lovely on and fits just right. I ordered a large as I'm between a size 14/16. The only down side is the material is a little thinner than expected and it looks better undone. I'd still recommend it though if you take that into account before buying", "rating": 4}, {"title": "Good customer service", "text": "I ordered a Tankini but it was very tight but I got a free return label and got my refund for that and a Dress. I got a bigger size but have to send it back too because it’s still too tight and another Tankini I ordered is nice BUT the Bottoms are too low so I need to look for a new pair of bottoms that are high waisted. Hopefully I can find another bottom? Rotita didn’t give me any problems with returning or getting my Refunds and they provide a Free Return Label which is great!!", "rating": 4}, {"title": "refund issue", "text": "I was chatting with an agent about a returned order that has not been refunded since January 2021. I have spoken to 2 other agents in the past couple of months and it still hasn't been taken care of. Sowshi was my agent tonight and she promised I would receive my refund within 7 work days. She was very helpful .", "rating": 4}, {"title": "Summer dresses", "text": "I ordered the clothes in December and did not receive til April. Don’t know what the delay was and never were able to get the delivery resolved until I contacted PayPal.  Received merchandise within one week.  Loved every item!", "rating": 4}, {"title": "Other reviews have put me off.", "text": "Other reviews have put me off, but my experience has been a good one. The sizing might scare some people but you just have to be honest with yourself. If you think you are an L then select XL. Shipping was incredible, but I wouldn't expect it to be this good during COVID-19.Estimated Receiving Date: Earliest Date:25 Sep,2020Latest Date:01 Oct,2020We got it on the 21st!", "rating": 4}, {"title": "Lovely suit fab customer service But!!!!", "text": "Good customer service express delivery, delivered on time. Lovely suit as described HOWEVER dropped a star because the bra cups (mine was underwired) no where near matches what you would expect for larger size swimsuit 18/20.. Cup size more like a 12/14 so I'm having to get mine altered.  the styles on offer are beautiful though but the bust size is making me think about whether to order again...", "rating": 4}, {"title": "The quality is excellent however the…", "text": "The quality is excellent however the items I order were to arrive Dec. 18/20 but only arrived yesterday, Jan 11/21. I was planning on wearing these tops over the Christmas season even though we were not getting together with family. So for that reason, I am disappointed. I will order again but will not be expecting  speedy delivery.", "rating": 4}, {"title": "Not happy with shipping", "text": "I ordered 2 dresses for my daughters wedding. Two weeks later I was told one dress is out of stock but still shows available on the website, and the other dress still has not shipped. I placed the order more than a month before the wedding giving an extra couple weeks for international shipping. Now I am fearful that the dress will not arrive on time.", "rating": 4}, {"title": "Plus size ruffle hem floral print T-shirt", "text": "Shipping was quick, I thought it would take longer. The top is as described in the picture and fits perfectly. The only fault I have with the top is the elastic is too loose around my waistline. I would have preferred the elastic a bit tighter to give me more shape to the body. The top should fit how the model is wearing it around her waist. Maybe it’s my body shape, I don’t know. I’m a bit disappointed otherwise it’s a nice top.Grace", "rating": 4}, {"title": "On my first order", "text": "On my first order, I ordered three bathing suits.  Two have arrived.  One had the wrong sized bottoms.  I'm waiting to see if the third comes in correctly before returning the wrong bottoms.  I am not looking forward to going to the post office to mail the wrong item.  I have a compromised immune system.  Having said all that,  I liked the suits so well that I have placed a second order for 5 suits for my daughter!", "rating": 4}, {"title": "I have ordered 4 times from Rotita.", "text": "I have ordered 4 times from Rotita. Everything has been lovely. I made a mistake with the size on one and had to return it. Heard nothing so called them and they reimbursed me immediately. A little blip but in general I was pleased with their service and loved the clothes. Not the most fabulous quality but the styles and designs are gorgeous and people ask where I bought them. I will definitely order again.", "rating": 4}, {"title": "Shopping on your site was pleasant", "text": "Shopping on your site was pleasant, the only challenge I had was that I did not know how to apply the available coupons.The moment my order was placed, I was pleasantly surprised by the dispatch speed of the items. Got my order after a few days and everything arrived in a good a decent shape.Thank you for a job well done guys.👍", "rating": 4}, {"title": "I love the Rotita website", "text": "I love the Rotita website. They have a great selection of products. I have bought several items from them. However, I have found the sizes are not consistant. When I order a size large, the item is eaither too big or too small. Sometimes it fits just right. Rotita has great customer service and I have had no problems with returns.", "rating": 4}, {"title": "1 out 2 items I ordered fit well", "text": "1 out 2 items I ordered fit well, one is not looking good. I want to return the second but I don't know how to do it....I'm a first time customer, I usually order through amazon because of easy return..second message : Customer service helped, I'm returning 1 item, everything seems fine now, thank you!", "rating": 4}, {"title": "The top I received was much too small", "text": "I've only received one of the six tops i ordered but I ordered a size 2XL and it was much too tight fitting.  If the rest fit like this one, I will have to send them all back.  I looked at the Plus sizes when I ordered and I didn't find any of the styles I liked.  I was concerned that the asian sizes usually are smaller and that was the case because I usually wear a 2XL in clothing made in the US.  I liked everything about the top except it didn't fit.", "rating": 4}, {"title": "Beautiful colors!!", "text": "First I'd like to say I love the look of the clothing; beautiful colors. Some of the items I ordered were on sale, which made me even more happy.! The shipping time was much shorter than I expected..very happy about that. My one and only complaint is that I did not realize the clearance items are non-returnable; too small..", "rating": 4}, {"title": "Satisfied New Customer", "text": "My initial order went well. 2 of the 3 items I ordered were smaller than I expected. All three tops were beautiful!. Processing the return & refund is underway just a couple days after opening my package. Everything so far seems easy & operating well.  Looking forward to interesting new items to enjoy in the future.", "rating": 4}, {"title": "Intimate Apparel", "text": "Way more beneficial than all the other waist and stomach girdies I have. This one holds and corrects my posture it's comfortable and I really like the way in which it is made. It is snug, which I like, I am still in the process of losing weight so it may not be snug for long. But it is worth $18.99.", "rating": 4}, {"title": "Beautifully made products", "text": "Beautifully made products, arrived promptly, true to size, dresses and swimwear I have purchased are exactly as advertised.My only suggestion is when making these in all sizes instead of AU 10-12, 14-16, 18-20 etc that they made in between sizes such as 12-14, 16-18 etc.", "rating": 4}, {"title": "Am very happy with my new swim suit", "text": "Am very happy with the swim suit I purchased from Rotita. Arrived in a timely manner and is very pretty. The top to the suit was a little more see through than I expected, but is pretty and the bra part fits perfectly. I really like the amount of length available on the straps too. The bottoms are not my usual style but fit well. Would like to be able to mix tops and bottoms. Aside from that am very satisfied with my purchase and will buy more items from the company. Think my daughter is going to order a swim suit as well.", "rating": 4}, {"title": "The first time i contacted the company…", "text": "The first time i contacted the company my chat tined out because i was waiting for a rep too long, 2nd time i did the chat, i advised that i was missing the bottom portion of the swimsuit i ordered, they are sending the replacement in 2 days. Rep was very helpful", "rating": 4}, {"title": "Issue was resolved", "text": "Issue was resolved, I need to wait a few days to see the refund reflected on my credit card.  There was no place to enter my coupon code so I did a live chat to get it resolved.  Sumi was helpful. It would be nice to have responses in correct grammar, capitalize \"i\" I.", "rating": 4}, {"title": "Confusing", "text": "The website is difficult to use, both in ordering and returns.  This has become such a major project.  It's a shame too because the dresses were gorgeous.  They were tight in my arms and shoulders.   I would like to order clothes again,  but this experience has made me wary.", "rating": 4}, {"title": "Flattering Tops But Slow Deliveries", "text": "Receiving items from Rotita gets mixed reviews. The website is easy to navigate, but I had to contact them regarding their reward program as I could not find the info readily on the website. Styles are very nice and flattering. The items, however, can take over a month to receive and one of my tops came rolled up in a plastic bag and very creased which was not very appetizing.Rotita was great at showing good faith. They replied to my complaint and immediately refunded me for this top. I changed their rating frim 3 to 4 stars for this reason. Thanks, Rotita!", "rating": 4}, {"title": "Easy to Order, some sizing problems", "text": "It was easy to find the swimsuit I had seen in an ad on Rotita's website. The order took 8 days to arrive which seems a little long but is acceptable. The order was accurate in that the swimsuit was labeled 1X as I had ordered. However, the fit was peculiar, with the bra band being the same length as the bust measurement. Standard sizing would have the band 4-6 inches smaller than the bust measurement.  I appreciate that Rotita carries Plus sizes. Rotita has the most creative, innovative and colorful designs I've ever seen. I love them.", "rating": 4}, {"title": "It took a little over a month to get my…", "text": "It took a little over a month to get my parcel, but it was well worth the wait.  I was so happy.  My garment is beautiful, well made and made out of nice material. I will be ordering from them again. Thanks to the customer service representative Sherry.", "rating": 4}, {"title": "I ordered three bathing suits", "text": "I ordered three bathing suits. They arrived fairly quickly. The only complaint is I had read reviews before ordering suggesting to order a size up, so I did. They are still small... If I order from here again I will order two sizes up next time. Otherwise, they are really nice!", "rating": 4}, {"title": "Customer service", "text": "Struggled with not giving the 5th Star, but website can use some TLC.. so many pop ups for savings if I clicked on texting advertisements and that I did! Bcz who doesn’t love to save, was sent the coupon code with a link to continue my shopping, as I did!! And when I was done I was ver cautious to not over scroll past this part ( bcz a lot of sights will disguise that part) it pretty much to me straight to check out ! In the end I was grateful to notice how to communicate and “Swoshi” was very accommodating w/out hesitations!! Will be waiting for my “REfund” 12 hours 🤞🏼", "rating": 4}, {"title": "I've shopped at rotita many times", "text": "I've shopped at rotita many times. I love their clothes! Shipping speed is the only real issue I have had, and really only recently.  Maybe related to covid. Otherwise the clothes are unique, stylish and wonderful. I'm still waiting on orders and dying to try them on.", "rating": 4}, {"title": "Great quality, Great price!", "text": "I am very pleased with my first purchase.  Better quality than I expected for the great price.  Only thing I'm not pleased with on a separate order I made is I paid extra for delivery by a certain date.  Now I'm being told it will arrive later than I paid extra for.", "rating": 4}, {"title": "Attractive Items, Easy Check Out", "text": "This web site has pretty items. The check out process is easy. The shipping time is long but Covid seems to be slowing everything down. But the communication is effective. The item that I ordered looked different than I pictured online but it is nice.", "rating": 4}, {"title": "Pleased with shipping", "text": "Pleased with shipping,  but missing shorts to the flower print swimdress onOrder W2008060014586319. I tried chat but I don't think my message was clear that I only received the swimdress. Would appreciate if XL shorts could be shipped to go with the swimdress.", "rating": 4}, {"title": "Pleasantly surprised", "text": "Pleasantly surprised.  It arrived fairly speedily...ordered on 4 March, arrived today 15 March...it fitted and also seems of pretty good quality.  Admittedly the material is not my favourite but hard to tell from a photo.Will definitely use again.", "rating": 4}, {"title": "Great bathing suit, setting up for a wonderful summer.", "text": "I ordered a bathing suit and a wrap. And I received it today and was super happy with how it turned out. The bathing suit is really cute, I'm so looking forward to going to the lake in it where I can relax and have fun. And look fabulous.", "rating": 4}, {"title": "I was asked by her to rate her 5 stars", "text": "I was asked by her to rate her 5 stars.  I would if not for that poor customer service move.  Perhaps better to say for future customers, ( Would you please rate my service today  It was a pleasure to serve you and we hope to see you again soon.)    My response:  \"I'm happy to rate you at the level I feel appropriate and not be told what that is.Thank u so much for your responsiveness and resolve\"  j The resolve was speedy, attention paid to my issue after questions and pictures of my issue were sent.  Thank you very much!  I appreciate it.  jGive yourself 5 stars!  w2009200503376375", "rating": 4}, {"title": "Bathing suits", "text": "I ordered 2 bathing suits. They both were lovely. True to size, great design and the material and stitching were good. I returned 1 to exchange for a different one. The only down fall that I see, is the process takes a long time.", "rating": 4}, {"title": "I placed an order and it was being…", "text": "I placed an order and it was being shipped to the wrong address. Luckily Sumie was my online rep, who immediately responded when I needed help. He/she changed the address and all is well. I am now awaiting the arrival of my order. Thanks Sumie!", "rating": 4}, {"title": "I look timeless", "text": "I love your style of clothing I am 66 and I will be 67 in April on the 14. Your style of clothing makes me feel as though there is no age barrier. Especial sence I done look my age. Alll my friends say Girl you look DivaYes I do!!!!!!", "rating": 4}, {"title": "pretty simple.", "text": "pretty simple.. I ordered my swim suite and waited and received it. No real problems. The tracking service is aweful until it hits the USA then it gets better. I did get my order sooner then I expected to get it considering its coming from China", "rating": 4}, {"title": "Placed my first order", "text": "Placed my first order. Did not see where you could add a coupon code and so the order went through without it. Contacted support and Suganya helped me through the process to get my discount refunded back to my account. Appreciate her help!", "rating": 4}, {"title": "NO SHIPPING FEES!", "text": "The clothes are quality, it just takes soooo long to arrive.  Also, most online companies waive the shipping fee if you spend over $50, which I do every time.  You might want to consider doing this for the amount of money that's being spent.", "rating": 4}, {"title": "Great bathers", "text": "Great bathers,  colourful and flattering. Woukd be good if you can make the cups for a bigger bust though. I'm a DD and the cups don't quite fit. It only works because of the material across the front, so you don't notice too much.", "rating": 4}, {"title": "Pleased customer", "text": "I am pleased with the swimsuits I purchased. The earrings are okay for the price. Since I like the suits, I also decided to purchase a shirt, and am waiting for it to arrive. As long as you have some patience with shipping, it's worth it.", "rating": 4}, {"title": "I LOVE Rotita", "text": "I LOVE Rotita! I'm focusing on bathing suits right now, and surprise, surprise, they are true to size! Normally I have to size up with bathing suits, but can wear my usual size medium.I've ordered other items, and am mostly happy with them, but that happens when you can't try them before you buy. It's mostly that they just don't suit me as far as body type,or don't like the particular material, etc. Shipping is quick, and so far the orders have been correct. I've ordered several times, and will do so again.BTW, just ordered THREE bathing suits and a really cool COVID bandanna yesterday! Yay", "rating": 4}, {"title": "My rating!", "text": "I did not give Rosita a five star, only because I did not care for the fabric of the items I ordered, nor did they fit…too large.  Sumi returned my money save shipping and I was leased with her service!Audrey Greenwell", "rating": 4}, {"title": "My experiences with this company was…", "text": "My experiences with this company was good especially working with Sumie who helped me through returning a couple of items and an exchange. She made the process easy. The only issue is the length of delivery time.", "rating": 4}, {"title": "Great dresses ..", "text": "Great dresses ... wrong Sizing I'm very disappointed and frustrated with CLOTHING I ordered a CLOTHING for an all-white party at the end of January 2021, I paid $14,99 to expedite shipping. My products did come in time, Two were the same shirt just different pictures on the front and they were so far off it was ridiculous. (Ordered more than 3 shirts) The stitching on all the shirts was horrible. i went online and i found this help4zero seven seven6eigtᶠᵒᵘʳ ᶻᵉʳᵒ ᵒⁿᵉ ᵒⁿᵉ the customer service was very nice and polite they help to return this item and my money is deposited into my account Do not order from them and do not trust that they will send you what you order!", "rating": 4}, {"title": "Fits perfectly.", "text": "I received my item.  it was just as the picture.  I made sure i took my measurements and look at size.  It fits perfectly.  I don't trust many of these sites.  At least it was a satisfying transaction this time.", "rating": 4}, {"title": "Very helpful service.", "text": "My queiry was answered and dealt with in minutes. Thank you for your time.", "rating": 4}, {"title": "I received my order quickly..everything…", "text": "I received my order quickly..everything was as promised..nice material on the bathing suits.I had to do a return as I ordered wrong sizes but it was very easy and convenient.I would order from here again.", "rating": 4}, {"title": "Quick response: Suganya was very helpful and Fast too😊…", "text": "Suganya was very helpful and Fast too😊 I appreciated that, but I sure wish all the material was not polyester: it is very hot where I live, so I would like to see their clothing designs in Cotton.", "rating": 4}, {"title": "Rotita's customer service respond time…", "text": "Rotita's customer service respond time is very satisfactory.  They do seem to go above and beyond to fix anything you are unhappy with which most on line companies do not do, especially those not in the USA.", "rating": 4}, {"title": "Very surprised after bad reviews", "text": "I looked at the reviews after I completed my order on 11/30/2020. I must admit after reading nothing  but bad reviews I wanted to retract my order and I even tried. I am happy to say I was very happy with my order. I received my order 7 to 9 days later. On the 7th day I missed the delivery, they made sure to deliver the package again on the next day and they also gave it to my neighbor as I requested on my front door with a note. I was given a Rotita bag for shopping with them for free. Although 2 dresses were really big. My daughter liked it so much she will have it taken in. Thank you Rotita for improving the quality of those clothes and working on getting the merchandise to customers in a timely  manor", "rating": 4}, {"title": "I received the garments earlier this…", "text": "I received the garments earlier this week, and I have been wearing one of them since.  I received two of one of them, I have already notified you about that.  They are very nice, and they look really good.", "rating": 4}, {"title": "I have found Rotita to be very helpful…", "text": "I have found Rotita to be very helpful when doing my online shopping because  of good communication from the seller and the products are of affordable and of good quality as advertised. I recommend Rotita.", "rating": 4}, {"title": "Order 2 swimsuits arrived on time and…", "text": "Order 2 swimsuits arrived on time and were of great quality unfortunately one had a problem, Rotita was quick to respond and fast to take care of the problem would reccomend  to my friends.", "rating": 4}, {"title": "Suits are beautiful and seem well…", "text": "Suits are beautiful and seem well constructed.  Wife likes them and looks good in them.  My only concern is their shipping.  No notification on shipping.  The only message I recieved was a label was printed.", "rating": 4}, {"title": "I love shopping Rotita", "text": "I love shopping Rotita. Beautiful clothing at fair prices.  Customer service is great. I would give 5 stars rating but feel there needs to be more selections to chose from. A wider variety", "rating": 4}, {"title": "I have just good words to say about my…", "text": "I have just good words to say about my experience. I rated 4 stars just hoping to catch your attention and maybe get you interested in opening a store in São Paulo, Brazil. Hugs for everyone!!", "rating": 4}, {"title": "Measure yourself", "text": "I expected to receive my item earlier than I did, but that’s ok. I was worried that the swimsuit wouldn’t fit right. But I did measure myself, and went by that. It actually fits great. I love it.", "rating": 4}, {"title": "I bought 5 pieces", "text": "I bought 5 pieces, they came very quickly. Unfortunately they were to big( first time ordered).Next time I have to go down in size.It felt good to give them away for charity as Xmas help.", "rating": 4}, {"title": "Refund on return settled", "text": "I had not previously talked with someone about my issues with return for a refund ,but I did speak with someone and I received a full refund very pleased with customer service thank you Rotita", "rating": 4}, {"title": "Customer service is great and great product.", "text": "They have amazing customer service. Ivy helped me and she saw me through each step. I was so happy with what I ordered and the quality. Will definitely be getting outfits from them again.", "rating": 4}, {"title": "I loved my swim suits I ordered", "text": "I loved my swim suits I ordered, very nice quality and we'll worth the price! Fits true to size! It took a while to receive them but I was so excited when they finally came in!!", "rating": 4}, {"title": "Sumie from Rotita was most helpful…", "text": "Sumie from Rotita was most helpful through their live chat application. They were very prompt with their replies and offered compensation for not being able to fully refund item.", "rating": 4}, {"title": "Overall, I’m happy!", "text": "Although the suits didn’t fit perfectly, they are nice & will work. The customer service person, Sumie was very helpful, responded promptly & solved my issues. Thanks", "rating": 4}, {"title": "Prosit!", "text": "I have only recently started shopping at you. What attracted me most was the scale of sizes you offered, mine generally being 2X in UK measurements. Delivery times proved relatively short; material quality good, especially the blouses; sewing generally neat. So, thank you for this positive experience. What I still haven't got to terms with, after several orders, is the differing sizing! 2X from one outlet suits me fine, but 2X from another is either huge or too tight! I know measurements are provided before the customer makes her choice, but still, sizing hasn't been accurate, in my case. Same with shoe size. Besides, your clothes are mainly honest and chic; they pride you, the firm, and dignify the ladies who wear them! Having said that, my final note is a positive one: Carry on like this and we shall deal business for years to come!", "rating": 4}, {"title": "Lovely dresses , good sizing and quality", "text": "The two dresses ordered look a little longer to arrive than expected(possibly due to Covid19issues  )however when they'd I was really pleased with both the quality and fit .", "rating": 4}, {"title": "Rotita has really cute clothes but they…", "text": "Rotita has really cute clothes but they did not fit me properly. My customer service was good though Sumie helped me and finally got me my refund. Thank you Sumie", "rating": 4}, {"title": "I love the products that I have…", "text": "I love the products that I have received.  The only thing is that on the black and white shirt it looked like the collar was a satin material but I love it just the same.", "rating": 4}, {"title": "Great customer service", "text": "I had to exchange a few items as I learned items run big, but the return process was easy. Alva, my rep, was amazing. She made sure everything went smoothly. Thank you!!", "rating": 4}, {"title": "Unfortunately I never received my order…", "text": "Unfortunately I never received my order I can only assume it's because of the pandemic going on . . Sue was great help with ensuring that I will get a refund for my order.", "rating": 4}, {"title": "Order tracking", "text": "Sue was able to track down my order and give me a time line for delivery. Unfortunately and this is not Sue's fault I have been waiting for an answer since September", "rating": 4}, {"title": "Dress is beautiful", "text": "My only complaint was the lack of tracking ability on the parcel.  The lateness of the delivery I am happy to attribute to hassles due to Covid-19.  The dress is beautiful.", "rating": 4}, {"title": "Give It a Try", "text": "Pleased with this new go-to online store. Takes a while to receive shipments however I'm hopeful that will improve. The items are unique and reasonably priced.", "rating": 4}, {"title": "I can't give it a 5 yet", "text": "I can't give it a 5 yet, I haven't tried it on.  I love it, it looks well made and certainly looks like a good fit.  It arrived promptly and in good condition.", "rating": 4}, {"title": "Responsive customer service", "text": "Part of my order was very delayed, but after contacting customer service I received the rest very quickly. I am very satisfied with their response and my purchases.", "rating": 4}, {"title": "I absolutely love the bathing suit", "text": "I absolutely love the bathing suit, however it is a bit small. I always wear a medium but in this particular design I wish I had known to get a large.", "rating": 4}, {"title": "I love all three tops I ordered", "text": "I love all three tops I ordered - I am usually a medium, and your tops do run a little small, but I do love them and they do fit. Will definitely order again!", "rating": 4}, {"title": "Ordered several items which were great…", "text": "Ordered several items which were great ..just missing one items.. customer service took care of the issue to my satisfaction. Will order again", "rating": 4}, {"title": "The experience was great", "text": "The experience was great.  I got prompt feedback and follow-up.  I would definately recommend Rotita to friends and family.  Keep up the good work", "rating": 4}, {"title": "Great fit", "text": "Great fit, great quality and great customer service from Flora!! Shipping is only reason I didn't give 5 stars... but that was Covid19 reasons.", "rating": 4}, {"title": "Love the bathing suits I've bought from…", "text": "Love the bathing suits I've bought from you 2 last year 1 this year I also bought a flag shirt that I haven't received waiting patiently", "rating": 4}, {"title": "The time the package took to be…", "text": "The time the package took to be delivered wasn't so bad. I am pleased with my purchase. I think I will be ordering from them again.", "rating": 4}, {"title": "I truly love my dress..", "text": "I truly love my dress... The sizing is a bit off & have to get it taken in a bit at the top... But my overall experience was great...", "rating": 4}, {"title": "I would like to thank Sumie for her…", "text": "I would like to thank Sumie for her fast response time and excellent customer service. Was able to get what I needed without any hassle.", "rating": 4}, {"title": "Great swimsuit but wrong size", "text": "Great swimsuit but wrong size. Would like to exchange xl for lg but can’t figure out how. Won’t be ordering again. Sad as really like suit", "rating": 4}, {"title": "Very helpful customer service", "text": "Very helpful customer service. Losliya was really fast at tracking my order for me. Rotita delivery is slow but I am overall happy.", "rating": 4}, {"title": "Good fit as described", "text": "The second time I have made an order and am very pleased with the quality and fit. Unfortunately delivery took longer than expected", "rating": 4}, {"title": "Green and Black blouse", "text": "Waited a long time for delivery but was advised of delay :-). When Blouse arrived it looked very like item ordered and Nice fit :-)", "rating": 4}, {"title": "Great Customer Service", "text": "Great customer service! They helped me find ways to go around returning a suit that was too small. That was very nice of them!", "rating": 4}, {"title": "Everything went real smooth", "text": "Everything went real smooth - easy to order, shipped on time. Clothing is a little off-size - a little on the shorter side.", "rating": 4}, {"title": "Dress is very long", "text": "Dress is very long. Had to cut off a lot to shorten.  Fits across but big in shoulders.Material OK.  I like the colour.", "rating": 4}, {"title": "I loved the long check dress I got from…", "text": "I loved the long check dress I got from Rotita. The quality is pretty good and is true to size. It’s really confortable.", "rating": 4}, {"title": "Excellent for shipping and tracking and…", "text": "Excellent for shipping and tracking and product quality although colour did match with pictures and no explanation offered", "rating": 4}, {"title": "I ordered this bathing suit and it was…", "text": "I ordered this bathing suit and it was delivered early and the material was great and the fit was perfect 👌", "rating": 4}, {"title": "Suganya was very quick and helpful", "text": "Suganya was very quick and helpful material of products very good quality sizes come up little bigger that usual", "rating": 4}, {"title": "Took a while to get here", "text": "Took a while to get here, nice swimsuit, sizing is a little small, ws more expensive as conversion rate was high.", "rating": 4}, {"title": "Wish you guys offered different sizes…", "text": "Wish you guys offered different sizes for the top and bottom my top is kinda small and my bottoms are very big", "rating": 4}, {"title": "Nice Clothing, But A Very Long Wait and Not All Are True To Size", "text": "I placed an order for 5 blouses/tee shirts from Rotita on January 11th. One blouse arrived a week ago and the final four arrived yesterday (Feb. 1st). I felt that this was a very long time to wait, however I realized by the postal return address that the items were shipped from China. I was not aware of this going into the order. I was able to \"track my order,\" but it was not very helpful.Four of the five blouses fit well and look pretty good (one is very long . . . more like a mini-dress), but one of the blouses is unusually large for a Medium. The sleeves are very long, reaching down to my fingertips, and the shoulder seams are off my shoulders. I will need to send this item back . . . I probably will not replace it. I am a petite sized woman (5' tall), and Rotita offers no availability for petite sizes. I realize that when I mail order clothing with no option for petite I am taking a chance. Suggestion: offer your clothing for Petite Ladies!All of this being said, the clothing is beautiful, most of the colors true to the colors in the pictures, and appear to be well-made. I will be wearing one today to church.", "rating": 4}, {"title": "products(3) were delivered within a…", "text": "products(3) were delivered within a week in 2 shipments. Was happy with 2, one went back for a larger size.", "rating": 4}, {"title": "The only issue", "text": "The only issueI had was the delay on shipping. I placed the order on 7/7 and didn’t receive it until 7/31", "rating": 4}, {"title": "Good experience & products are of good…", "text": "Good experience & products are of good quality. Only problem is the time it takes to receive.", "rating": 4}, {"title": "Love all my new shirts", "text": "Love all my new shirts. The styles is great. I do however recommend buying one size up. Thanks Rita.", "rating": 4}, {"title": "Thank you Sumie for your prompt and…", "text": "Thank you Sumie for your prompt and courteous service in assisting me with a refund .Ballery D", "rating": 4}, {"title": "Very pleased with these products", "text": "Very pleased with these products.  Good fit, quality.Delivery took longer than expected.", "rating": 4}, {"title": "💘 💘 💘", "text": "I 💘 💘 💘 the 2 dresses I ordered. They are true to size and really comfy.", "rating": 4}, {"title": "I discovered Rotita during lockdown as…", "text": "I discovered Rotita during lockdown as was for some reason bombarded with ads of their clothes...I finally caved in and spent way more than I shouldve. But despite this being shipped from Hong Kong it arrived less than a week later  when flights were already dropping off round the world. They have some stunning and very unusual tops..I got 5...have had positive comments about every single one of them. To be on safe side order a size bigger than u would normally as clearly made for an Asian Market I think. Was very happy with 4 of the 5 tops but I did order a med by mistake in one of them. Main drawback is the fabric..shirts that look like white cotton and lace are actually synthetic..however still look good..I ordered for summer and for the most part they fit that description tho being nylon in most of them makes them quite hot to wear on a hot day.  But overall v pleasantly surprised  and shipping was incredibly fast considering the global pandemic.  Would order again but check more closely the material used b4hand. Stunning from a distance tho and the quality of the construction pretty good. Also got some great tights  and a free necklace and pair of earrings were thrown in due to the amount I had spent. Shipping was free if I recall correctly. Genuine site in my view.", "rating": 4}, {"title": "Suganya", "text": "Suganya, was very helpful. She is going to resend my order out because I never received.", "rating": 4}, {"title": "Immediate feedback and now waiting on…", "text": "Immediate feedback and now waiting on reply to see if refund will go through.", "rating": 4}, {"title": "Placed my order", "text": "Placed my order, received email on hiw many days to delivery, they spot on, great service", "rating": 4}, {"title": "So happy with my products", "text": "So happy with my products, lovely service from Freya, would definitely use again", "rating": 4}, {"title": "Products arrived in a timely fashion…", "text": "Products arrived in a timely fashion and the quality was as expected from Rotita.", "rating": 4}, {"title": "Everything was great", "text": "Everything was great! The only reason I gave 4/5 is because the shipping was so slow.", "rating": 4}, {"title": "I like this site", "text": "I like this site. Good quality and price but it always take to long time for delivery.", "rating": 4}, {"title": "Colourful blouse.", "text": "What a beautiful blouse,and very well made.The blouse is exactly what was pictured.", "rating": 4}, {"title": "Favorite bathing suits", "text": "I'm missing one bathing suit, and one must be sized wrong, but love the others", "rating": 4}, {"title": "I love them", "text": "I love them, takes a bit for delivery, but it’s a trusty site. Quick responds.", "rating": 4}, {"title": "Review", "text": "Shipments come fairly quick and most have been true to size. I like the styles.", "rating": 4}, {"title": "Pretty Clothes", "text": "The clothes are pretty but sizes run about a size smaller so order accordingly", "rating": 4}, {"title": "Thank you Isha for your quick reply and…", "text": "Thank you Isha for your quick reply and clear explanation.", "rating": 4}, {"title": "Swim shorts nice quality but too big", "text": "Swim shorts nice quality but too big.  I have now ordered a smaller size", "rating": 4}, {"title": "The bathing suit is cute", "text": "The bathing suit is cute, but I don't like the fabric. The fit is great!", "rating": 4}, {"title": "Nice quality clothing", "text": "Nice quality clothing! Thanks to Quintus for great customer service!", "rating": 4}, {"title": "Items came in right and good", "text": "Items came in right and good. Took a lil more time then i thought.", "rating": 4}, {"title": "Overall, happy :)", "text": "Most of the swimsuits fit true to size.  Overall happy with my purchases.", "rating": 4}, {"title": "Quality swimsuits at a reasonable…", "text": "Quality swimsuits at a reasonable price.  I would order again from here.", "rating": 4}, {"title": "Sumie was excellent in customer service…", "text": "Sumie was excellent in customer service as I returned the products.", "rating": 4}, {"title": "Very good service and answered my…", "text": "Very good service and answered my questions to my satisfaction.", "rating": 4}, {"title": "Chat Services", "text": "Thank you Isha for your help in expediting my order.", "rating": 4}, {"title": "Suganya was very helpful in getting my…", "text": "Suganya was very helpful in getting my damaged order corrected!", "rating": 4}, {"title": "I ordered 3 bathing suits.", "text": "I ordered 3 bathing suits.One of them had a bra pad damaged.", "rating": 4}, {"title": "Great Service", "text": "Sumie did a great job in helping this first time shopping.", "rating": 4}, {"title": "Great products and sizes are pretty…", "text": "Great products and sizes are pretty much right on.", "rating": 4}, {"title": "SOWSHI KEEP IT UP", "text": "SOWSHI is so good according to the way we interacted", "rating": 4}, {"title": "Swimm top and bottoms 💜", "text": "I finally got the swim set that works great. Thank you", "rating": 4}, {"title": "Thank you Sowshi for the exchange…", "text": "Thank you Sowshi for the exchange information.", "rating": 4}, {"title": "so far so good", "text": "so far so good - wish prices were a little lower", "rating": 4}, {"title": "Shipping was slow", "text": "Shipping was slow.  Items were as described.", "rating": 4}, {"title": "customer service Sara was amazing.", "text": "Date of experience: March 06, 2022", "rating": 4}, {"title": "I am pleased with the items I purchased.", "text": "Date of experience: February 07, 2021", "rating": 4}, {"title": "Excellent", "text": "Excellent quality, colors and service .", "rating": 4}, {"title": "One swimsuit was good the other ehhh.", "text": "Date of experience: May 21, 2020", "rating": 4}, {"title": "Great service", "text": "Great service. Quality not so good", "rating": 4}, {"title": "Peek a boo shoulder back and white top", "text": "It was beautiful but small for size.", "rating": 4}, {"title": "A little different as the picture", "text": "Date of experience: August 17, 2020", "rating": 4}, {"title": "Top doesn’t fit as comfortable", "text": "Date of experience: August 13, 2020", "rating": 4}, {"title": "Liked my swimsuit fit good", "text": "Date of experience: May 07, 2021", "rating": 4}, {"title": "Love it and true to size!", "text": "Date of experience: August 14, 2020", "rating": 4}, {"title": "My question was answered", "text": "Date of experience: September 17, 2020", "rating": 4}, {"title": "Sofia was helpful", "text": "Date of experience: February 16, 2022", "rating": 4}, {"title": "I like it very much", "text": "Date of experience: July 31, 2021", "rating": 4}, {"title": "Very helpful", "text": "Date of experience: March 17, 2022", "rating": 4}, {"title": "Splendid", "text": "Great place to shop", "rating": 4}, {"title": "Clothes are great", "text": "Date of experience: June 04, 2020", "rating": 4}, {"title": "Good experience!", "text": "Date of experience: September 27, 2020", "rating": 4}, {"title": "Great bathing suits", "text": "Great bathing suits. I ordered two. I am so top heavy that the bottoms of my bathing suits are always too big. Wish I could buy the pieces separate. High quality, beautiful bright colors! Totally satisfied!", "rating": 4}, {"title": "Good quality", "text": "Good quality, always satisfied with the product.", "rating": 4}, {"title": "Top was much too big", "text": "Top was much too big.  Cannot return too expensive to send from Australia.  Rotita offered a 50% refund which was accepted.  I can take to a tailor and see if it can be made smaller.  Good service this time from Suri.", "rating": 4}, {"title": "Quick response on customer service", "text": "Quick response on customer service, although I'm disappointed that something went wrong with my order and the marketed discount was not applied.  I wrote immediately I placed the order to customer service, who said it was too late to apply it - even though it was immediately afterwards.", "rating": 4}, {"title": "My package was held up for a couple of…", "text": "My package was held up for a couple of weeks but coming fromChina it is expected during this time.Very happy with the product, exactly like the picture!", "rating": 4}, {"title": "Stylish & Conservative", "text": "I ordered 2 dresses which are very lovely & fit absolutely perfect as I was a little skeptical that they would. The only negative thing I have to say is that it took over 2 weeks just for them to get shipped out & the information said when the latest date would be which it went beyond that & I wondered if my order had been forgotten or lost. It took a full 6 weeks to receive but the dresses are stylish & conservative for which I was looking. I wish you had more of the same to choose from. The lengths were great as I am tall. Thanks Rotita for your good communication. And thanks to you Demi.", "rating": 4}, {"title": "Very Good Online Support", "text": "Judy was extremely polite and helpful.   She assured me that she was able to update my address and resolve my problem.", "rating": 4}, {"title": "As per usual, Order a Bigger size", "text": "As per usual, I have to order a size Bigger than I would get in an American store. It's a lovely top and I'll enjoy wearing it--being very cautious when I wash it", "rating": 4}, {"title": "Love the dress I ordered1  material is…", "text": "Love the dress I ordered1  material is nice quality for the price I paid.  but the other outfit still has not been even prepared to ship yet, I'm sure due to China? I ordered one month ago.", "rating": 4}, {"title": "Great customer service quick deluvery", "text": "Date of experience: March 10, 2020", "rating": 4}, {"title": "Very pleased with this dress", "text": "Very pleased with this dress.  Love the color and texture of the fabric.  Fits well.  Bought it to wear to a wedding in June.", "rating": 4}, {"title": "Refund of 2 dresses purchased.", "text": "Excellent customer service when dealing with return and refund request. Very approachable, helpful and prompt replies to my emails. Refund was made in 3 days. Very pleased with hassle free resolving of return.", "rating": 4}, {"title": "I was disappointed in the time it took…", "text": "I was disappointed in the time it took to receive my order but your responses to my inquiries were fast.  Overall I was very satisfied in the tops I ordered.  Sizing was accurate and I love them.", "rating": 4}, {"title": "Swimsuits run a little undersize but…", "text": "Swimsuits run a little undersize but they are very nice.", "rating": 4}, {"title": "I love the two tops", "text": "I love the two tops. But they were too small. I needed a 1-X.  But I ordered extra large.", "rating": 4}, {"title": "Rotita purchases", "text": "the garments chosen were as advertised and the sizes were great. my wife is pleased", "rating": 4}, {"title": "Happy with my purchase", "text": "Thank you my parcel was received 25th February 2020. The tops are very nice and fit perfectly.", "rating": 4}, {"title": "Item is nice but zip poor quality", "text": "Item is nice but zip on back is not the best. Also delivery and shipment is poor.", "rating": 4}, {"title": "This is my second review", "text": "This is my second review.  Both items were far too big and had to be returned.", "rating": 4}, {"title": "Very well made garments", "text": "Items are VERY well made. Some of the colours were different from the web site, e.g. A red lacy tunic top was a very bright red almost orange. I'm hoping it will fade with washing. I bought the black top with cold shoulder sleeves and sequins around the neck and arms. It was a bit gaudy and I removed one row of sequins from each area. It was lovely afterwards!  Very well priced for such well made items", "rating": 4}, {"title": "Fits great!", "text": "Shipping took quite a while but both of my swim suits fit great and look good!", "rating": 4}, {"title": "Too small", "text": "Pretty, but too small!Some others reviewed that it was too big in the bust, so I got XL rather than XXL.Big mistake! I guess I need the XXL!", "rating": 4}, {"title": "The dress I ordered fitted perfectly", "text": "The dress I ordered fitted perfectly. Really needs to be lined. Belt also needs some stiffening in it. Overall happy.", "rating": 4}, {"title": "The clothes are as they look and a nice…", "text": "The clothes are as they look and a nice quality", "rating": 4}, {"title": "Order Early", "text": "The products I have ordered are good (swimwear) however if you want anything quickly forget it as it takes roughly 8-10 weeks for the orders to arrive. They come from China. It is not the first time I have ordered from Rotita but it has always been long on delivery. Order early to avoid disappointment.", "rating": 4}, {"title": "inconsistent sizing of women's tops", "text": "the sizing of women's tops is inconsistent.  Some run much larger than others.", "rating": 4}, {"title": "I have to wait for a while and than is…", "text": "I have to wait for a while and than is finally arrived.I ordered 5 tops and all in size XXL (was recommended).One is really tight and the other 4 are very big. A normal XL where a better recommendation. All tops are beautiful except one! I have to sew a seam.Because of that my rating are 4 stars and not five.", "rating": 4}, {"title": "The dress is lovely", "text": "The dress is lovely and made well It’s a bit snug with it being high waisted but that won’t stop me wearing it I’ve bought it for my holidays as it is lovely light material but looks more expensive than it cost I’ve ordered another one Delivered well and in decent time frame will be ordering again soon", "rating": 4}, {"title": "I loved the bath suit I received", "text": "I loved the bath suit I received, ordered a couple more.", "rating": 4}, {"title": "Little tight", "text": "I do like the dress I'm big across the top so it fit a little bit tight. So the next dress I ordered I went up a size", "rating": 4}, {"title": "Great product and customer service. Long shipping times.", "text": "There was a delay in my order arrival and I could not find further tracking information on it past the original shipping facility. I ordered it Dec 14. When I finally wrote a ticket, Demi provided excellent customer service. She researched and found where the order was, provided me with the info and assured me of it's soon arrival. The order arrived soon thereafter as she had stated it would. The dress I ordered is beautiful and well made and of good quality and the price was so very reasonable. I still cannot believe the price for such a nice dress.  If you have the time to wait for the longer shipping time it was worth it to me. Thanks Rotita!", "rating": 4}, {"title": "Beautiful swimsuits", "text": "The suits I bought are really cute.  I have worn one to a water aerobics class. I did not feel secure in the bottoms.  They actually slipped down during the class.  They need to have more elastic in order to be suitable for this activity but the are fine for swimming", "rating": 4}, {"title": "Thank you for the updates on sales and…", "text": "Thank you for the updates on sales and all the cool items you have in stock. Thank all the helpers who make the outfits for your customers.", "rating": 4}, {"title": "Love the 2 items l have ordered the…", "text": "Love the 2 items l have ordered the first one it was perfect. The second one is beautiful fitted good except it was a bit tight across my bust. I decided not to send it back as l have given it to my sister and she was so happy and it fitted her perfectly.", "rating": 4}, {"title": "Be prepared to wait for your order", "text": "Be prepared to wait for your order. I ordered 11-30-2019 but didn't receive until 2nd of January. Quality is excellent! I would order next size up however.", "rating": 4}, {"title": "Really like your products", "text": "Really like your products. They fit well and the style is great for me.Shipping took a lot longer than stated on the purchase confirmation, due to postal service.", "rating": 4}, {"title": "The dress and top are so beautiful and…", "text": "The dress and top are so beautiful and both fit very well. I am ready to purchased again. The only problem is it took longer to deliver the products, that I didn’t get to wear my dress for Christmas and top to a concert. I guess I will wear them next year, if nothing happens.", "rating": 4}, {"title": "Prompt response", "text": "I found it very easy to order. The prompt response for my query was excellent from the support person Suri. The delivery did take more time than expected, however it was reasonable given it was the Xmas and public holidays. I would be happy to order from Rotita again.", "rating": 4}, {"title": "Love the colors", "text": "Love the colors! Sizing chart is very accurate!", "rating": 4}, {"title": "Longer Return Policy", "text": "I wish there was a longer time for returns. I have 2 blouses that I purchased between Thanksgiving and Christmas that don't fit me. I have many other blouses, dresses, and bathing suites that I have purchased that I absolutely love.", "rating": 4}, {"title": "Most of the clothes that I have…", "text": "Most of the clothes that I have received were great. Some came that were not pictured and another dress or blouse was sent that was not on the picture. One of the Halloween blouses that I ordered was not even close to what was pictured. The picture that was supposed to be on the front, was actually on the back. I finally got a refund for  that shirt after asking 2-3 times. They said that it had been worn, or was damaged. I only put it on for a few seconds. I don't know how it got damaged by sending it back but I was surprised that they had said that.", "rating": 4}, {"title": "Update..product finally arrived", "text": "Update... shipping is very slow. I ordered 3 holiday tops on November 26. Just received them on 12/30, the day after gave 1 for rating. Here is my update.. quality and fit 5 and shipping 1... overall a 4.", "rating": 4}, {"title": "Buttons", "text": "The quality of materials is very good but the buttons let the tops down.Length of tops very long if you are of short stature.", "rating": 4}, {"title": "The items were really nice", "text": "The items were really nice, they fitted really well", "rating": 4}, {"title": "Long delivery time  but my top was a…", "text": "Long delivery time  but my top was a good fit and good quality.", "rating": 4}, {"title": "Nice top", "text": "A good fit I was worried it would be too small ! My only problem with ordering again - and I do love some of the designs- is the length of time for delivery. Although it was tracked it just seemed to take over a month to arrive.", "rating": 4}, {"title": "Refund", "text": "I had not received my refund following returning an item 4 weeks ago I used chat on line and got Judy who sorted the issue in minutes", "rating": 4}, {"title": "Dress order", "text": "I ordered two dresses the one I kept was lovely and fitted perfectly. the other didn't suit me so I returned it. Both arrived promptly but it was a bit complicated to return. Overall very good.", "rating": 4}, {"title": "Christmas reindeer top", "text": "Thought I was buying a Christmas jumper but would class it more as a t shirt but it's lovely and came within a few days of ordering. Very happy. Was concerned when I read some reviews but glad I ignored and got a great top.", "rating": 4}, {"title": "Nice top for Christmas", "text": "Nice top for Christmas. Order in good time as shipping 2-3 weeks. Item as described.L is UK 14/16 & XL is 16/18Just right for Christmas parties!", "rating": 4}, {"title": "Rotita’s clothing styles are very…", "text": "Rotita’s clothing styles are very beautiful and trendy. The fitting on the models also very classy.However, the fabrics are of very low quality compared to the styles and display shown in the picture.I suggest that you improve the quality of the fabrics, even if it requires price adjustment.  Too much of polyester and spandex. Use cotton, linen, silk, satin, wool, rayon, velvet, chiffon, crepe, georgette, organza, and any other top quality and durable materials deem fit.If you do this, you will have many customers wanting your products as you have great taste for styles.", "rating": 4}, {"title": "I have bought 5 items from Rotita  and…", "text": "I have bought 5 items from Rotita  and not been disappointed i know delivery take roughly 3to4weeks but has been worth while the wait good quality garments that look stunning on the compliments from people asking where I bought them from", "rating": 4}, {"title": "Chat after placing order", "text": "After placing order, I was concerned about shipping time as this is a Christmas Eve outfit and order was placed on 12/11.I paid for expedited shipping which states 3-6 days. I couldn't find a separate processing time listed on the website.I spoke with Judy who was very helpful. She explained that the processing time was 6-10 days but she assured me that they would do the best they could to get the order to me on time.I will update this rating to a 5 star if I receive it on time.Website stated that orders must be placed by 12/15 to be received by Christmas. I hope that Judy pulls through for me! Hoping to update rating to 5 stars. Blouses look perfect for the occasion.", "rating": 4}, {"title": "Nice styles and designs", "text": "I have now ordered several blouses from Rotita. I love all the designs and styles available. The only thing I would say is not great, is the time it takes to get the items, and some of them have come very wrinkled.", "rating": 4}, {"title": "Awesome quality", "text": "Awesome quality - fit - design! The only reason I did not mark 5 stars is it takes a little long to receive but I still did on time :)", "rating": 4}, {"title": "The dress fit me perfectly and I…", "text": "The dress fit me perfectly and I receive them earlier than expected which was good for me. The service was also excellent cause I wasn’t at home but they call me to let me know the dress have arrived.", "rating": 4}, {"title": "the top is just as advertised", "text": "the top is just as advertised, and looks even better than the photo. Shipping was clearly stated as taking quite a long time from origin to UK, and I was expecting the top to arrive as late as 16 December after placing the order on the 4th November. Was delighted to receive the package on 14th November. I'm looking forward to wearing it a lot over the Xmas period as it is so smart and comfortable.", "rating": 4}, {"title": "tops sizes", "text": "Both blouses were beautiful but too small ,the sizes here run smaller than normal other than that I have bought many items and pleased very much with the quality", "rating": 4}, {"title": "The Best customer service", "text": "Judy is a great and wonderful customer representative. I ordered a dress and I sent a ticket and this lovey person called Judy helped me. In fact Judy is one of a kind.", "rating": 4}, {"title": "Judy was helpful in getting me a refund…", "text": "Judy was helpful in getting me a refund for two shirts that I returned. Thanks.", "rating": 4}, {"title": "Everything was great", "text": "Everything was great.  I am just not used to someone typing so informally.  \"u\" instead of \"you\".  No capital letters when appropriate, and incorrect punctuation.  Not a huge deal, but makes it more professional.", "rating": 4}, {"title": "Love the clothes and they fit well", "text": "Love the clothes and the fit well", "rating": 4}, {"title": "After reading the reviews I was…", "text": "After reading the reviews I was concerned.  I purchased two dresses and one swim suit 24 hours ago.   I have had good communication and confirmation the order has now been despatched within one working day. I have not received the garments yet but am very satisfied with the timely feedback and the livechat option.My clothes arrived during the time frame advised at time of ordering.  The quality of the dresses and swim suit was excellent.   The swimwear and one dress fits lovely.  Other one I am returning for refund which is a straight forward process.I have today ordered another 7 pieces and got 30% off.  I am a very happy customer.I cant believe at this stage the negative experiences some people have had then 5 star experiences.  It is like there is another Rotita that provides cheap nasty clothes.  This is a geniune review and I am wearing one of the dresses at work today and alot of compliments.Before you place an order for an garment there is a chance to read reviews of others that has purchased it.  Gives you an idea of the quality before you confirm the order.", "rating": 4}, {"title": "nice and amazing dress", "text": "nice and amazing dress. like delivery process", "rating": 4}, {"title": "I bought several items from this…", "text": "I bought several items from this company. I bought a pair of Jean's that were so cute and they fit perfect. Their shirts on the other hand are not comfy at all and I think it's the material they use to make them. I've had to send everything back except the Jean's and one shirt that was made out of a softer material. They were very quick to refund my money too.", "rating": 4}, {"title": "SELECTION and FIT", "text": "Great selection and if you factor in that in most cases you will likely want a larger size than you would normally order in Canada, you will enjoy the fit.", "rating": 4}, {"title": "customer service is not bad at all", "text": "I purchased 4 items from them, the sizes were not quite right. Some of them larger than they described, some of them are smaller than the description. To save trouble since the prices were low, I returned those I absolutely cannot wear and kept the rest. They did refund me immediately. Compared to \"Just Fashion Now\" and some others, their size and materials are better and at least closer to the description. I hope that give them time, they will finally get the concept of following the words in their description if they want to be successful in selling in America. Despite what I said before, I have decided not to order anything from foreign vender (meaning my orders are shipped from a foreighn contry) save save myself time and energy.", "rating": 4}, {"title": "Ordered blouse to test company products....", "text": "Ordered blouse to test company products. I was very happy with quality of material (nice weight, not flimsy) and very happy with quality of lace on bottom (tough, heavy duty). I am a plus size and found size matches 'Penningtons' sizes. My only disappointment is that all sleeves are 1/2 length, which is not flattering if you are top heavy. I will keep checking site to see if they start selling long sleeves and Vnecks styles.", "rating": 4}, {"title": "Navy Blue Lace Juumpsuit", "text": "Recently purchased a navy lace jumpsuit which arrived in approx 12 days but it was way too big. Used the ticketing system and requested exchange for a smaller size. Address provided by Rotita and I posted jumpsuit back. After posting I realized I put wrong st no so assumed It would be lost. Because i really wanted to get this jumpsuit I went online and purchased another in correct size. I contacted through the ticketing sytem and explained - several days later was advised that they received item I thought was lost due to my mistake, I asked for a refund instead of exchahge as originally requested. I received advise that they would  process refund. True to their word I received refund into my bank within 3 days.  Throughout the whole process i found communication excellent and their ticketing system effective. Today I received correct size garment in only 12 days. Quality is excellent and I am very happy with the communication, quality of item and the excellent customer service. Reviews have lots of negative but need to give credit where credit  is due. I am certainly confident to shop with Rotita again.", "rating": 4}, {"title": "Rotita review - good experience", "text": "I was quite nervous about receiving my 2 dresses. I ordered them due to the bargain price and look of them but after reading some reviews feared the quality and fit would be poor. However I received them today (quick delivery) and they are actually lovely and fit perfectly. I wouldn't hesitate to buy from Rotita again.", "rating": 4}, {"title": "The swimsuits are true to size", "text": "The swimsuits are true to size,  I ordered up thinking they would be small,  and they were way too big.  The bright colored ones,  that's a different story,  the colors are nothing at all like the pictures!! They really enhanced them.  But I returned all, I dealt with SURI, on chat, and she was amazing,  and refunded me within the hour!!", "rating": 4}, {"title": "I'd give you a 5 but", "text": "I'd give you a 5 but there are no clear wash/dry instructions. I'm going with hand wash in cold water just to be safe.", "rating": 4}, {"title": "Quick response to queries", "text": "Quick response to queries. Attentive and concerned. Greatly appreciated. Wish the product had not dissapointmented. Thankyou", "rating": 4}, {"title": "The item I bought I thought was not of…", "text": "The item I bought I thought was not of particularly good quality ,but the response from the firm was excellent regarding a refund b", "rating": 4}, {"title": "Very helpfull", "text": "Date of experience: September 09, 2019", "rating": 4}, {"title": "Love my swim suit & dress", "text": "I really was surprised that I got my items so soon as they were coming from China. I also expected everything to run small, so I ordered a 3X instead of  2X, but the swim suit & dress were big.so they run True to size... Well made, beautiful colors, I can't wait to order more merchandise. Thank You.Tricia", "rating": 4}, {"title": "It took a few sizing mishaps", "text": "It took a few sizing mishaps, but I learned their sizing and return system and  have had no problems on returns using online chat. It is awkward and clumsy but I do like the many purchases I have made. Requires patience and good manners.", "rating": 4}, {"title": "Pleased", "text": "I waited a month to get my order. I returned a shirt for a larger size and it has been nearly a month with no credit refund or new size.My concern was addressed immediately after my review.", "rating": 4}, {"title": "Bought an awesome bathing suit and it…", "text": "Bought an awesome bathing suit and it arrived within the delivery time and was true to size in the plus sizes. Lots of compliments. Taking a chance on a 2 piece dress and shirt today. Looking forward to receiving them", "rating": 4}, {"title": "I'd buy from them again if I can't find locally", "text": "I want to shop local, but couldn't find very stylish swimsuits so I ended up with Rotita.  I was nervous about the shipping and sizing.  My items actually arrived quite early and look great.  I wouldn't suggest ordering if you need them by a quick date because it does take a while, but I had no timeline.  The size seemed to run a little small for how they told me to measure, but I was in between so I ordered the larger size and it fits just about right, a little snug.  The reason I didn't go 5 stars is because there are some weird hooks on 2 of the suits I ordered (the bikini hook is normal).  One of them I can reach and isn't bad to hook, but the other I've had someone else hook for me--that isn't very convenient.  I'd rather not order from them again just because I want to support my neighbors, but I will if they are the only place to get what I want.  For the price and color they are great.  For the material and hooks, they are so so.", "rating": 4}, {"title": "Good experience!", "text": "I was a little apprehensive about my order of one top after I started reading reviews of this company. They gave me a long range date of delivery, but it came in much quicker. The quality was as good as many pieces of clothing I have purchased locally. There was one tiny spot on the front hem that looked over-sewn by the machine, but it isn’t noticeable. I wore the top to church today and got so many compliments. Even my husband told me it looked really nice. So maybe I got lucky, but it was definitely worth the price ( which wasn’t bad at all).", "rating": 4}, {"title": "Great prices", "text": "Great prices.  I received the first partial shipment about 10 days after I ordered.  About a week later I checked on the remaining items and received an email the next day saying it's on its way.", "rating": 4}, {"title": "Minus the time for delivery the price…", "text": "Minus the time for delivery the price and quality is great!", "rating": 4}, {"title": "This is the first time I have ordered…", "text": "This is the first time I have ordered something from this site. The bathing suits were very appealing however I had difficulty in receiving my order. I kept updating the customer service department by mean of tickets and they were always very prompt to respond.I must commend DEMI who issued a full refund to me for all the inconvenience and disappointment caused.I will definitely recommend them for her professionalism and efficiency in resolving the issue.", "rating": 4}, {"title": "I ordered 8 items", "text": "I ordered 8 items. The price is great, but it has been 3 weeks and I have only received 3 of the items ordered. They are nice and fit well, but where is the rest of my order? Also each item has shipped individually. FINALLY! All the items arrived 30 days after the order was placed. The final shipment from China took 2 weeks to arrive. Love the clothes! Hate the shipping. I'm rating 4 stars because of the shipping delays.", "rating": 4}, {"title": "Their great! super 😸", "text": "Their great!", "rating": 4}, {"title": "The product I ordered was advertised to…include swim shorts. I received regular swim pants.", "text": "The product I ordered was advertised to have swim shorts. The product I received had a swim pants. They are way too short to be decent on a size 3x lady. The top fits well and true to size.", "rating": 4}, {"title": "I have tried before to get someone to…", "text": "I have tried before to get someone to respond and today I tried again and Demi responded immediately. I got the address to return my order and get a different size. She was great!I do not like your system with an order as you do no put in any invoice with return instructions. I was ready to call my credit card company and contest the charge since I was not getting any response from your company.  Also, this is an inconvenience to return this merchandise for a different size since your company does not know American sizing.  You should have a size chart that is comparable to U.S. sizes.  I love the 2 blouses I am returning for the next size larger but I don't even know what to size I should order! I hope someone will actually read this!!  Thank you", "rating": 4}, {"title": "Good Company", "text": "Second Post...My first post was not a good one because they had not sent my refund and it had been since February, 4 months.  But once they saw the review, whoever is in charge, did right and refunded my return. The merchandise was good, it just did not work for me, hence the return. So I can no longer justify giving a low rating.  Glad someone is watching and reading and paying attention to the company.  So whoever that is, Thank you!", "rating": 4}, {"title": "Skeptical at first, delighted with the outcome!", "text": "I was skeptical to purchase clothing online, something I've never done before. However, I needed some new clothes for my first ever cruise & some of their items looked really darling. I ordered 5 items; a bathing suit which was really inexpensive and 3 tops to go with my blue capris and one long-sleeve sweater top.  It did take awhile for my order to arrive; didn't realize this was a Chinese company. I was certainly pleased when they all arrived - the bathing suit was perfect. I had tried styles & sizes on a store, had a good idea of what I wanted and it's fantastic!  The 3 tops looked fabulous on my cruise and wash great! I did send the sweater top back; it didn't look like the website & was too large. Returning was painful; have to get a reference number & include it on the pkg when you return it. I paid my own postage to send it; felt it was still worth getting my money back. Finally after the return process went through all its many phrases my money was refunded; took about a month. In their defense, Rotita kept you informed with emails of your progress ordering, shipping, delivery & returning. I would do business with this company again as I am very happy with the look & quality of my 4 purchases!", "rating": 4}, {"title": "I've had very good luck with items I've…", "text": "I've had very good luck with items I've ordered from Rotita.  On a couple occasions I returned something and received a prompt exchange or refund.  After a very bad experience and reading reviews on another online clothing company, I decided to look up reviews on Rotita and write my own review.  They have very cute dresses, jumpsuits and swimsuits.  Again, I've personally had good luck and have received very cute items.", "rating": 4}, {"title": "Clothes are good value and well made…", "text": "Clothes are good value and well made but not always the nicest material. Be realistic though...at about £25 on average for a dress you get what you pay for.The returns process can be a right faff too, but in fairness they really helped to sort the problem out and my refund was processed quickly.", "rating": 4}, {"title": "Rotita is not the nightmare some people describe", "text": "I have ordered about 4x from Rotita over the last year or so. I was very wary because of reviews I've read about similar sites that ship from China. Overall, I have been very happy with my orders. Some of the clothes do seem cheap, but that's to be expected for the low prices.I've ordered multiple dresses and swimsuits. I love the swimsuits and I've never found such unique styles anywhere else. I also love the huge selection of dresses. These probably aren't dresses that are going to last for years and years, but a lot of that depends on how you care for them. I wash mine in the machine on a gentle cycle, but I do not hand wash. Most of them have held up well.  The sizing can be hard to figure out but overall is pretty accurate. If you have a large chest, I would definitely suggest ordering up a size. I haven't returned anything yet, so I don't know how that process works.The shipping is much quicker than it was last year. I placed an order on 5/14 with free shipping and paid the $5.99 for the upgrade on processing/shipping time. I received my order on 5/20.", "rating": 4}, {"title": "I didn't read any reviews before…", "text": "I didn't read any reviews before ordering, but it's probably a good thing.  Based on the one star assessments, I figured if I did get the clothes they would be cheaply tailored and arrive next year.  However, within the promised month I'd received my blouses and the fit was not too bad as far as the sizing chart guide had indicated for me to order.  The quality of the clothing, while not bespoke (lol), was good and the materiels used were also of a good quality.  When the blouses arrived there was a fairly strong chemical smell which a bit of handwashing took care of.  Since I bought lacy blouses there is no way I'm washing them even on a gentle cycle.  All in all, shopping rotita was not the horrible experience for me it was for others.", "rating": 4}, {"title": "Before I read all the negative reviews", "text": "Before I read all the negative reviews, I ordered four swim suits - three have arrived and I am very happy with the quality of fabric and the fit.  I did order a size larger and that proved to work out well for me.  Since the prices were so good, I went a little crazy ordering so many swim suits.  The colors are just as displayed on the website.  Additionally when I had a question the company emailed me right back within 24 hours with my answer.  I'm extra cautious now having read so many terrible issues and very hesitant to order anything else .... will see if I get my fourth suit!  The only reason I didn't give this company a five star rating is because it's been about 10 day's wait for the last suit and the others arrived within a few days!", "rating": 4}, {"title": "Better Than I Imagined", "text": "Bought 3 bathing suits that arrived about 2 weeks after ordering. Way sooner than expected. All 3 fit as described, with only 3 minor defects in symmetry and stitching that are not noticeable to others, but make the fit slightly off. The material is decent for the price of the bathing suits. I had no issues with any part of my experience and will probably buy again, with the understanding these are not meant to be very high quality garments, but definitely wearable and fit fine for the price you're paying.", "rating": 4}, {"title": "Well I haven't had any problems with…", "text": "Well I haven't had any problems with them. I ordered a swim dress which took a week to arrive. I was so impressed with it that I ordered a different one which again only took a week to arrive. Sadly this was didn't fit as well and the material wasn't as good so I returned it, it cost me £8!! But I found the return policy absolutely fine and I've just received notification from PayPal that they have refunded my money. No complaints from me other than the cost of return.", "rating": 4}, {"title": "I found Rotita clothing good sizing,and…", "text": "I found Rotita clothing good sizing,and ok for the money,only down side was delivery, 4 weeks.I have repeatedly washed items I bought March last year.😀", "rating": 4}, {"title": "I have ordered two tops from Rotita and…", "text": "I have ordered two tops from Rotita and both are very good quality, fit as expected, arrived on time, and look exactly like the pictures.  I am about to order a dress from them for a wedding.  The only complaint I have is that neither garment came with any labels AT ALL so I don't know how to wash them.  Therefore, I am washing one on a gentle cycle, as it appears to be polyester, and the other I am handwashing as it has a lot of lace on it.  Both have held up fine through several washings.  (I got no response when I emailed Rotita about this problem.)", "rating": 4}, {"title": "I am happy with the purchases", "text": "I was hesitating after reading some of the reviews. But I bought 3 items (a Christmas sweater, a black top and a dress) in the past two months, Dec and Jan, the materials are comfortable, and the qualities  are decent and very good for all 3 items. They do look like the pictures shown on the website. I consider myself very picky so I am pleasantly surprised. I will buy more now since I have more confidence from my own experiences...", "rating": 4}, {"title": "Happy with service and quality.", "text": "Not sure about all the negative reviews. I took a chance in early December and ordered 1 top. I received it in about 2 weeks and it fits just fine. So about 2 weeks ago I ordered 7 more. They came today. Only 1 is a little tight. The fabric is good, not thin. I ordered 1size up and that was perfect for all the rest. I will order from them again.", "rating": 4}, {"title": "I ordered three blouses and then…", "text": "I ordered three blouses and then changed my mind, since the tops would not be in time to wear over the holidays. Rotita refunded my money in 24 hours without an issue.Good service.", "rating": 4}, {"title": "I ordered a raincoat from them off of…", "text": "I ordered a raincoat from them off of Facebook. It took a while to get to me in Madison WI. But when it came it was what I thought it would be. A basic light weight raincoat. I got a small because that is what I normally wear and it fit fine. It was really a cheap price and it isn't an expensive looking raincoat, but I wore it in the rain and it worked. I like it because it was cheap and it fits. No idea on returning things but you get what you pay for.", "rating": 4}, {"title": "I'd recommend", "text": "I saw these cute clothes pop up almost every time I was on line.  I was skeptical about trying them due to all the bad reviews.  I was in desperate need of white dresses so I decided to get a prepaid card and give them a try.  Surprisingly, my experience was great.  I received shipping confirmation and a tracking number within 3 days.  The dresses came in 2 1/2 weeks.  They were just as pictured, gorgeous.  The only two things I'd share....order a size up and if you're curvy, 2 sizes up.  Also, the quality is not bad but you will need a slip underneath as they are very thin.  I've since placed another order and received shipping confirmation within 3 days.  I haven't received the dresses yet but tracking has them in NY.  I'd recommend but lower your expectations!  Remember, you get what you're willing to pay for....and the price reflects that.", "rating": 4}, {"title": "I love Rotita Clothing", "text": "Date of experience: September 07, 2018", "rating": 4}, {"title": "Good experience with Rotita", "text": "I ordered twice with them. No problem at all. First time I had to return 4 dresses because the sizzing is different Wear medium normally but had to reorder large. Quality is ok for the price. No problem to get full refund. Just have to follow the instructions they give on the website, better to use ticket system than any other communication method.As the site clearly says the return fees must be assumed by the customer. For the second order, no problem.... one product sent back for full refund and 3 others for replacement. Quick and efficient. Both orders got reimbursed by PayPal the next day and items resent by rotita the following day. They always answer the ticket within 24 hours. Their time zone is different. Overall experience very satisfactory", "rating": 4}, {"title": "No issues with purchase", "text": "No issues with purchase. Happy with my dress. The material was not as expected but dress is flattering on nevertheless. I received complements wherever I went.", "rating": 4}, {"title": "Would order again", "text": "Placed my order July 24th and received my order August 13th.  Recieved all of my items in good condition and as described on website. Sizes were accurate. Despite all of the negative reviews, I didn't have any issues.", "rating": 4}, {"title": "Love the clothes and customer service!", "text": "Love the clothes. Quality is pretty good. Customer service is prompt and courteous. Bonus for me was that they took the extra step to confirm my order was not fraudulent and my credit card was not being used illegally. My shipment shipped pretty quickly and it was easy to track. Stylish clothes. Will definitely keep using Rotita for shopping online.", "rating": 4}, {"title": "I know a lot of people have had a bad…", "text": "I know a lot of people have had a bad experience with this company, and I'm sure it is all valid, however my recent shopping experience with them was pretty good. I ordered a bathing suit and romper, both were delivered BEFORE the estimated date; the items fit perfect; and Rotita communicated with me in a timely and professional manner. The quality of the material was not ideal, and I do wonder what the poor souls that made these clothes had to endure for it, but I did feel compelled to give them a good review because they did right by me. Ordering from this company may be hit or miss, but in my case, it was a hit.", "rating": 4}, {"title": "The swimsuit I ordered was awesome", "text": "The swimsuit I ordered was awesome, perfect fit too. I expected delivery to take much longer but it was quite fast. Thx Rotita, I will order more!CS", "rating": 4}, {"title": "I really enjoy ordering from Rotita", "text": "I really enjoy ordering from Rotita, the clothes are good quality with affordable prices.  Sometimes the items I order don't fit but they quickly refund the amount to my account.  I will continue to order more.", "rating": 4}, {"title": "Free shipping", "text": "Free shipping, good quality, but shipping takes forever.  Not a good site for ADD personalities.", "rating": 4}, {"title": "Not What You'd Expect", "text": "I placed an order from this site about 2 weeks ago and just received the items less one top.  In all honesty, I did not expect the quality to be what it is and I ordered two sizes up thinking the items would be small. However, I have been pleasantly surprised and cannot wait to place my next order. Quality was above average and ordering a size up would have been fine. But, everyone is different so pay close attention to their size chart and item dimensions.The only negative, so far, is their lack of communication. They respond rather quickly but only if you initiate contact. My order had already been shipped without my knowledge. They sent tracking info after I asked...within 2 minutes. Lastly, I wish they carried women's dress/office pants.", "rating": 4}, {"title": "Over all good experience even though 3 dresses did not fit my  arms.", "text": "Ordered 5 dresses all of them the same size 2 fit me and are absolutely beautiful. the other three One of them the sleeves were not the same length.and the other two are to tight on my arms (I do have big arms so not blaming the company) and I did get half my money back and was able to keep the dresses. My daughter loves them and they fit her.", "rating": 4}, {"title": "I just received part of my order", "text": "I just received part of my order. 3 dresses and a shirt. I ordered before reading all of the negative reviews.  I was nervous after that. However,  to my surprise all of the clothes fit well. I wear a 12-14, and ordered a Large. The material is fine. For the low prices, it's definitely worth it. They have really unique styles.  I love their website. Will probably order again if all goes well with the rest of my order.", "rating": 4}, {"title": "Although clear communication is…", "text": "Although clear communication is sometimes difficult, customer service is very quick to respond and always attempts to resolve an issue and work with the customer.", "rating": 4}, {"title": "Like my stuff thus far.", "text": "Date of experience: May 30, 2018", "rating": 4}, {"title": "Happy with the process", "text": "I read the reviews and bought about $200 worth of stuff for myself and my daughter knowing that sizing seemed small so i ordered larger.  Got part of my order within 3 weeks of the order being placed which i was happy with.  I had read that returning is a pain in the *ss so I ordered knowing i didn't plan on returning anything and knowing they make an offer so you don't return.  So there was two out of five items that didn't fit.  I logged in and got a 30% refund in paypal - they do it immediately and I was satisfied.  I think people need to do their homework and use common sense.  The clothing is cheap - that's what you get cheap clothing.  Mine was satisfactory but you can obviously tell its not high end.  And the sizing, there's plenty of warnings about that and it's really a chance you take ordering online.  Overall, the stuff that fit, I'm happy with and i wasn't expecting high end clothing.  The pictures online are deceiving in that they are young, small size models that look good in anything.  So do your homework and manage your expectations.", "rating": 4}, {"title": "I have ordered from Rotita three times…", "text": "I have ordered from Rotita three times and the clothing is very nice. My first two orders arrived faster than expected, and I just ordered for a third time a few days ago.", "rating": 4}, {"title": "I love this site", "text": "I love this site.  I love the bathing suits the most, which is what I ordered.  It took almost 2 months to receive it which I was not happy with but they got here just in time for swimming.  I had ordered the swimsuits too big not knowing how they would fit but when I asked for a return I got an offer instead which I accepted and that was something new to me and never had been done before. I thought that was really genius.", "rating": 4}, {"title": "I was sceptical but have been pleased with Rotita.", "text": "I have received purchases in a timely manner and the items are made of comfortable materials. The customer service has been very good!", "rating": 4}, {"title": "I love my dresses", "text": "I love my dresses. Im ordering swimsuits next👍", "rating": 4}, {"title": "Good quality", "text": "Date of experience: May 16, 2018", "rating": 4}, {"title": "Thank you", "text": "Nice merchandise at good prices.  Sometimes a little late.  Still waiting for one item ....", "rating": 4}, {"title": "Satisfied Customer", "text": "Almost every item I have purchased fits perfectly! The couple that did not were easy to return.  I have placed 3 orders with them so far and was extremely satisfied with most.", "rating": 4}, {"title": "I had a problem with my garment and…", "text": "I had a problem with my garment and they took care of me very fast.", "rating": 4}, {"title": "Love my new swimsuit and was very fast…", "text": "Love my new swimsuit and was very fast delivery. Will  definitely order again", "rating": 4}, {"title": "Deposit $3 in account:", "text": "Deposit $3 in account:Even though pant suit doesn't fit the person I bought it for, it will be gifted to someone who Who's body type can fit it😂", "rating": 4}, {"title": "I received my purchases and liked the…", "text": "I received my purchases and liked the products I bought.", "rating": 4}, {"title": "Nice stock", "text": "Nice stock, perhaps order one size bigger than you need in ladies shirts. Good prices great range", "rating": 4}, {"title": "Monthly Orders", "text": "I have ordered every month. I am happy but it takes so long to get the items. I try not to order close to birthdays or they will be late.", "rating": 4}, {"title": "DO NOT BUY ANYTHING FROM HERE PLS!!", "text": "DO NOT BUY ANYTHING FROM HERE PLS!!!  I promise it will NOT look like the photos!!! The worst quality ever and customer service is even worst. It comes from CHINA, there will be no response to your email, there will be no return address and there is NO Way to contact them👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾 SCAMReview would only take if I gave 3 stars or moreRIGGED!!", "rating": 4}, {"title": "Inexpensive Outfits", "text": "Inexpensive outfits.  Comfortable wear and nice dresses for the most part.   Some of the fabric choices look shearer or not as sturdy in person.  One dress that looked like it had a nude insert underneath the lace top portion of a dress, did not.  Hence:  nude!  Difficult finding a camisole to work underneath it.   Get what you pay for. Overall order a few items every few months.", "rating": 4}, {"title": "Clothes arrived earlier than thought", "text": "Clothes arrived earlier than thought. The quality of the clothing was great. Will continue to shop this site.", "rating": 4}, {"title": "This is my second review", "text": "This is my second review, I still have the same opinion, clothes are affordable and they look and fit great, besides I do not see anyone with the same design as me around my neighborhood. Just the delivery, takes a while.", "rating": 4}, {"title": "I have never ordered ladies clothing…", "text": "I have never ordered ladies clothing off the internet but have had health issues so I don't want to shop. The pictures that kept popping up on FB were cute so I decided to give it a go. Got confirmation that order went through but it took 4 days for tracking information to be on-line. Was dismayed at the delay of electronic information.I am used to very fast delivery on most things and was somewhat disappointed that this took 19 days from start to finish to be delivered. Was pleasantly surprised at the quality of material in the top I chose so overall, if you are not in a hurry for your item, this works!", "rating": 4}, {"title": "YOU must pay return shipping, even if item is not as described.", "text": "I haven't ordered yet, but I LOVE the style of their clothes!UPDATE:. I ordered and received black hooded jacket on 5/3/18.  It looked nothing like it did in pic.  Fabric was cheap looking, and even the style didn't look the same.  I had to open a \"ticket\" because I realized they expected me to pay for the return postage.  (I thought they'd pay it, because they advertise \"30-day easy returns.\").  Then, they replied to my \"ticket\" by offering me a 50% refund, and I could keep the item.  I replied \"Why would I want to keep an item I don't like and only get half of my money back?\".   Then, they offered an 80% refund ($22.60 for an item I paid $28 for), and I accepted.  I figured the return shipping would cost at least $6.  So...the customer service wasn't the worst, but I never like to pay shipping for items that aren't as described.  I don't think I'd order from them again for that reason.  But, in fairness, one crappy item doesn't mean they're all like that, and they could have just insisted I return the item at my cost in order to get a refund.", "rating": 4}, {"title": "Great customer service", "text": "Date of experience: April 25, 2018", "rating": 4}, {"title": "Shopping was fun and easy", "text": "Shopping was fun and easy!  We'll definitely shop again!  Only wish that our order arrived sooner.", "rating": 4}, {"title": "I enjoy shopping on this site and my…", "text": "I enjoy shopping on this site and my order always comes on time and they are beautiful items", "rating": 4}, {"title": "I love this site", "text": "I love this site. I received my merchandise last week and I was very pleased.", "rating": 4}, {"title": "I love the way Rotita tries to quickly…", "text": "I love the way Rotita tries to quickly resolve any issue to the customer's satisfaction. It's great customer service!", "rating": 4}, {"title": "Great experience", "text": "I bought a couple swimsuits and they arrived exactly when planned. One was too small in the bust, the other too big. I contacted rotita, they resolved the issue with a couple days of emails. I asked for a return, they offered a partial refund $27 back on a $55 order and I keep the items. I didn't want to spend that much on things that didn't fit, so I asked if they could either offer more back or I would ship back. They offered $47 back and I got to keep the items. I gave one to my friend and I kept one that is a little big in the bust, but worth it for the amount! I thought it was professionally handled and the quality was great! I don't understand how some reviews are so bad, my experience was great! I would order again if I knew the items would fit better!", "rating": 4}, {"title": "A satisfied customer", "text": "Delivery time a little too long. Fabrics of good quality and good size.Very satisfied with the product.", "rating": 4}, {"title": "Problem Solved", "text": "I ordered a bathing suit once I received it I wanted to exchange it. I really didn't read the exchange policy, but the service person was very helpful and polite about resolving my issue. I will be ordering again, when at first I didn't think I would.", "rating": 4}, {"title": "Wonderful blouses...fit to a tee and…", "text": "Wonderful blouses...fit to a tee and made me smile.Thanks Modilly!", "rating": 4}, {"title": "Love the fashion", "text": "Love the fashion! The fit is great too", "rating": 4}, {"title": "This website is easy and enjoy the…", "text": "This website is easy and enjoy the products. Will be purchasing again.", "rating": 4}, {"title": "Unfortunately I had purchased the wrong…", "text": "Unfortunately I had purchased the wrong size of the items I had ordered and needed to return everything. The staff at Rotita were very good to deal with...they were very quick to respond to the ticket I had opened and the return was resolved within a few days.", "rating": 4}, {"title": "I ordered 7 items from Rotita", "text": "I ordered 7 items from Rotita. They came in 2 shipments. The 1st arrived approx. 3 weeks after I placed the order. The 2nd arrived 2 1/2-3 weeks after the 1st shipment. All of my pieces were great once they arrived. I ordered up 2 sizes to make sure everything would fit & it did.  I had to make minor alterations, but that was no problem. I really enjoy ordering from this site. It will be even better if they would improve on their shipping times.", "rating": 4}, {"title": "Great top", "text": "I love the top its soft and comfy the only thing I dont like its the arms our not very wide but then I have bat wings as a lot of us older ladies have and you have to order bigger size (for the U S people) I normal take a medium and order a large which just fits--I may order 1 size larger next time and I will order again I already have another top I want", "rating": 4}, {"title": "Enjoying this site", "text": "Enjoying this site. The selections are great and pricing is even better. Just got my first order and quality of merchandise is very good.", "rating": 4}, {"title": "Nice merchandise.", "text": "Date of experience: April 11, 2018", "rating": 4}, {"title": "Happy to find you guys", "text": "Company is great, just that delivery takes a while. Clothes look great, excellent design, Fits as expected.", "rating": 4}, {"title": "Nurse on vaca", "text": "I just wish the color of the product was as bright as the original one I picked out..", "rating": 4}, {"title": "Some of the dresses fit me very nicely", "text": "Some of the dresses fit me very nicely.   My only problem was the length of time it took me to get the orders in.  I will surely recommend ithis company to my friends.Place your order when you don’t need it sooner.", "rating": 4}, {"title": "Amazing selection of stuff to pick from…", "text": "Amazing selection of stuff to pick from and many sizes", "rating": 4}, {"title": "I love the bathing suit I ordered", "text": "I love the bathing suit I ordered. It  looks just like the picture and seems to be well-made. Unfortunately, I ordered too big a size. I am going to give it to a friend and order another one for me.", "rating": 4}, {"title": "Happy with the purchase", "text": "Happy with the purchase , looks great on me.", "rating": 4}, {"title": "Fast response", "text": "Date of experience: March 29, 2018", "rating": 4}, {"title": "Great product.", "text": "Date of experience: March 28, 2018", "rating": 4}, {"title": "First time buyer and very satisfied…", "text": "First time buyer and very satisfied with my purchase.", "rating": 4}, {"title": "Love my swimsuit", "text": "Love my swimsuit. Got one last year as well as this year. Shipment time is longer than expected. Other than that no complaint's.", "rating": 4}, {"title": "Excellent clothing,prices are not…", "text": "Excellent clothing,prices are not high,takes a long time to deliver.", "rating": 4}, {"title": "Shopping and ordering was extremely…", "text": "Shopping and ordering was extremely easy to do with Rotita. I encourage everyone to give them a try!!!", "rating": 4}, {"title": "I love styles that Rotita carry's", "text": "I love styles that Rotita carry's, and prices are reasonable,  a lot of selections .to choose from.", "rating": 4}, {"title": "Some of the sizes run smaller and you need to order larger size up", "text": "Some of the sizes run smaller and you need to order a size up just to make sure it will fit.  I ordered 2 shirts and they said my size, but they were too tight.  I needed one more size up and am trying to return items now.  The 2 bathing suits I ordered fit perfect and look very good on.  Love the swimsuits!", "rating": 4}, {"title": "I have a positive experience with this…", "text": "I have a positive experience with this company all my dresses fit perfectly unfortunately it's does take an exceptionally long time to arrive 3-4 weeks", "rating": 4}, {"title": "I would have gave a 5 star", "text": "I would have gave a 5 star, but they had a holiday in February, and it is taking longer to get the items you order., but before the holiday, I was not having a problem, and the clothes are beautiful.", "rating": 4}, {"title": "Great service but takes to long to get", "text": "Date of experience: March 21, 2018", "rating": 4}, {"title": "I have had problems..but was able to…", "text": "I have had problems..but was able to resolve them. If you fill out a ticket they get right back to yoh.This is as of today!!", "rating": 4}, {"title": "Clothes for my daughter", "text": "I wasn't sure about ordering online but the clothes fit perfectly to my daughter and very satisfied with what I order.", "rating": 4}, {"title": "Was very happy with my purchase", "text": "Was very happy with my purchase.   Fit perfect.   Came fast,  and I love the suit I purchased.   Thank you.", "rating": 4}, {"title": "Good customer service", "text": "Good customer service. A Little delay on shipping and delivery.", "rating": 4}, {"title": "This is a real review", "text": "This is a real review! I've tried Chinese companies before and was taken for a ride twice. I don't know why I tried this one -- after being burned twice, but I thought the dresses were so pretty, I couldn't help myself! I decided to do a test order and ordered an inexpensive swimsuit first. The quality of the suit is excellent and it fits an American woman (ie it doesn't look like it was made for a Barbie doll!). I'm going to take the next step now and order a dress. FYI - of course I ordered up in size. Chinese clothes are notoriously tiny.", "rating": 4}, {"title": "Love the product and it fits…", "text": "Love the product and it fits appropriately but it takes forever to get items.", "rating": 4}, {"title": "I actually love the products this…", "text": "I actually love the products this company offers. The prices are phenomenal and the quality of the products are exceptional. My only drawback is the shipping and processing times as they are sometimes inaccurate; however I do understand that the products are being shipped from another country which requires a wait time.", "rating": 4}, {"title": "I like the selections available.", "text": "Date of experience: March 08, 2018", "rating": 4}, {"title": "I like there cloths never had no…", "text": "I like there cloths never had no problems with my items. Only thing shipping take a little longer. Other than that I will keep shopping with theme.", "rating": 4}, {"title": "Company keeps you informed about your…Good communication", "text": "Company keeps you informed about your order. Good communication", "rating": 4}, {"title": "perfect size and look", "text": "The order looked exactly it showed on the picture and the size was precise.Thanks", "rating": 4}, {"title": "I ordered two tops for the first time…", "text": "I ordered two tops for the first time from Rotita in Jan 2018.  I love the quality of the tops and they look awesome.  One is way oversized, but is still pretty.  I was beginning to become skeptical as to whether I would get my order at all, due to all the negative reviews on other websites.  It did take 35 days to receive.  It also came regular (snail) mail instead of UPS or FedEx.  I want to send back the oversized top, but afraid I won't get my money back.  I want to order a swimsuit, but kinda skeptical to try my luck again.", "rating": 4}, {"title": "Very receptive to any questions", "text": "Very receptive to any questions. Shipping is great! Love the products!", "rating": 4}, {"title": "A large variety of clothes & prices to…", "text": "A large variety of clothes & prices to match every type of income. Highly recommend!", "rating": 4}, {"title": "Really some nice bathing suits and…", "text": "Really some nice bathing suits and clothes on their website", "rating": 4}, {"title": "I love the product so much I ordered…", "text": "I love the product so much I ordered for myself as well as my daughter.  I wish it didn’t take so long to come but it was worth the wait", "rating": 4}, {"title": "Would recommend to friends", "text": "Delivery was fast. Customer Service us excellent. Just be sure to order 1 size larger than you would normally buy. Would recommend to friends.", "rating": 4}, {"title": "I ordered 2 bathing suits from Rotita", "text": "I ordered 2 bathing suits from Rotita.  When I received notice that 1 was no longer available, I thought, \"Oh no, I am going to have trouble getting my money back.\"  Especially after reading reviews.I have to admit that I had to search the website to find out how to get my money back and not just credit.  Rotita could look into making that easier.But I received my bathing suit, and I could not have been more pleased.  The quality was great.  An excellent buy at an excellent price.Rotita would have received 5 stars if it hadn't been so difficult to navigate their website.  I would order from them again", "rating": 4}, {"title": "I really am happy with the cloths", "text": "I really am happy with the cloths, everything so far that I have ordered fits.  The orders seem to come in a reasonable length of time.", "rating": 4}, {"title": "I like the dresses", "text": "I like the dresses. The styles are very contemporary.", "rating": 4}, {"title": "Love to Mobil shop", "text": "I have really liked all the items I have ordered. I just that is takes so long to receive.", "rating": 4}, {"title": "Beautiful tops", "text": "They have the most beautiful tops", "rating": 4}, {"title": "I have ordered 6 tops to date & am very …", "text": "I have ordered 6 tops to date & am very happy with all of them! :)", "rating": 4}, {"title": "Great looking clothes fits well", "text": "Date of experience: February 07, 2018", "rating": 4}, {"title": "Good products at cheap prices.", "text": "Good products at cheap prices", "rating": 4}, {"title": "So far I am pleased but I haven't …", "text": "So far I am pleased but I haven't received the clothes yet.", "rating": 4}, {"title": "The item that I received I love", "text": "The item that I received I love. I get many compliments on my blue sweatshirt and its design. If I have any complaint, I would like to receive the merchandise much sooner.", "rating": 4}, {"title": "I have ordered twice from the site", "text": "I have ordered twice from the site - some pieces were great and very worth the money, others I had to return, but the interaction was fast and efficient. Thank you!", "rating": 4}, {"title": "Quality and pricing of clothing good …", "text": "Quality and pricing of clothing good value.", "rating": 4}, {"title": "Some of the styles run small but have …", "text": "Some of the styles run small but have loved everything so far", "rating": 4}, {"title": "I received my jacket", "text": "I received my jacket.  I am very pleased.  Has a slight odor but that will go away!", "rating": 4}, {"title": "The only issue I have is that it took a …", "text": "The only issue I have is that it took a month for me to receive my items but once I received them I was very pleased.", "rating": 4}, {"title": "The sweater I got is really very cute", "text": "The sweater I got is really very cute. I ordered xxl and it fit!! I was pleasantly surprised. The sweater looks great on me and I’ve received many compliments", "rating": 4}, {"title": "I have made to purchase on …Rotita", "text": "I have made to purchase on Rotita.....the dress I purchased was fanatic....fabric and size was great.But I also brought a jumper that was nice but didnt look good on me...Rotita afford me half refund so i can the altercation....to fit the way i want ...I was very pleased with there suggestions.I will order again", "rating": 4}, {"title": "I have ordered 4 times from rotita", "text": "I have ordered 4 times from rotita. My first order of more then 9 items are perfect and nice fit with great quality I immediately decided to  order three more times. Thanks rotita", "rating": 4}, {"title": "Good Company and Goods", "text": "So far my orders from this company have been on point and as described. My only slight reservation is the time it sometimes take to receive the order.", "rating": 4}, {"title": "Great customer service and prompt …", "text": "Great customer service and prompt feedback", "rating": 4}, {"title": "Very easy ordering & shipping is pretty …", "text": "Very easy ordering & shipping is pretty quick.  Received my Sweatshirt and loved it.", "rating": 4}, {"title": "I love the different style of the …", "text": "I love the different style of the clothing and the material of the clothing is very comfortable!!", "rating": 4}, {"title": "Beautiful product!", "text": "Loved the blouse/top I received. Just took such a long time to get here. Maybe it was a  Christmas-related delay.", "rating": 4}, {"title": "I have ordered several items", "text": "I have ordered several items. As long as you go up in size they fit great.", "rating": 4}, {"title": "Item arrived and fitted awesome", "text": "Item arrived and fitted awesome. Compliments were given . Thank you", "rating": 4}, {"title": "Wrap design hoodie", "text": "Fit a bit small in the chest but the materials and construction were good.  I got compliments the first time I wore it due to its unique design.", "rating": 4}, {"title": "My orders always arrives on schedule", "text": "Date of experience: December 29, 2017", "rating": 4}, {"title": "The item was great", "text": "The item was great! However, it took quite some time to arrive.", "rating": 4}, {"title": "I love the two shirts I bought and nice …", "text": "I love the two shirts I bought and nice quality. Will definitely buy from this company again. Leca Mathews", "rating": 4}, {"title": "I love the clothes I have purchased", "text": "I love the clothes I have purchased, mostly tops.  The tops are original in decisgn.  The fit is good for me too.  The sleeves are long enough for talls.Returns are not too complicated. Thanks for your services.", "rating": 4}, {"title": "The items purchase was of good quality …", "text": "The items purchase was of good quality and did look like the advertised picture. We will definitely use Rotita again.Thank you", "rating": 4}, {"title": "Love the dress", "text": "Love the dress. The side slits make it even better.This item is made of a lighter weight material than what I expected yet when paired With the right shoes it looks nice.", "rating": 4}, {"title": "I've got good a quality swim suit from …", "text": "I've got good a quality swim suit from Rotita. Waiting time is a little long but this understandable due to customs. Put a new order for a dress, hoping to get it before Christmass and it's will be good quality as well.", "rating": 4}, {"title": "Most of the clothing fits well some of …", "text": "Most of the clothing fits well some of it the fabric looks a little richer online Overall, the price is small enough that it’s worth the risk", "rating": 4}, {"title": "Beautiful clothing.", "text": "Date of experience: December 06, 2017", "rating": 4}, {"title": "Lovely product.", "text": "Date of experience: December 01, 2017", "rating": 4}, {"title": "I like the product but it took longer …", "text": "I like the product but it took longer then I thought to arrive.", "rating": 4}, {"title": "My first order from Rotita was great", "text": "My first order from Rotita was great! The size was Perfect and workmanship was all I expected. Thanks Rotita.", "rating": 4}, {"title": "Great service!", "text": "Great service. I’ve used this site 2 times and the product is good quality. Also, the delivery time is within their listed date of arrival. Happy I gave them a shot.", "rating": 4}, {"title": "Would buy again", "text": "The outfit I bought came in looking exactly like the picture. Good quality. Size was a little snug- I might order a size larger next time. It did take a long time to ship however, but it was coming from China so that is ok. Price point is well worth it. Too many emails once you do sign up with your email address though. Would definitely order again and have told many of my friends to do the same.", "rating": 4}, {"title": "Great styles", "text": "I like the great styles. The fabric is light and the clothes fit well", "rating": 4}, {"title": "Finally got my purchase I made", "text": "Finally got my purchase I made on Oct. 21 on Nov. 25.  Love the shirt, especially the color!.", "rating": 4}, {"title": "Cute clothes!!!", "text": "Date of experience: November 17, 2017", "rating": 4}, {"title": "First time buyer...", "text": "I thought the website was easy to maneuver, there is a variety of selections and the cost of items was very reasonable.", "rating": 4}, {"title": "I did order a few items but none of …", "text": "I did order a few items but none of them fits me but the return policies are good. I wish that you change the sizing of your clothing since a 5xl is not a size 22 but more like a size 16.", "rating": 4}, {"title": "They are very fast to respond to any …", "text": "They are very fast to respond to any messages sent to them. Very co operative in their processes. Megan", "rating": 4}, {"title": "So far everything that I have purchased …", "text": "So far everything that I have purchased has been great.", "rating": 4}, {"title": "Rotita has the most unique fashions online", "text": "Rotita has the most unique fashions I’ve ever seen online. I can’t wait for my first order to arrive!", "rating": 4}, {"title": "I love this website", "text": "I love this website. No problems at all. Faster replies to your question.", "rating": 4}, {"title": "I love this site", "text": "Date of experience: November 15, 2017", "rating": 4}, {"title": "So far Rotita have been great to deal …", "text": "So far Rotita have been great to deal with. I’m hoping to exchange a top. So hopefully the experience will be painless. Rotita you rock", "rating": 4}, {"title": "This was my first time ordering from …", "text": "This was my first time ordering from this site.  I was impress with the quick delivery time without paying for expedited shipping.", "rating": 4}, {"title": "Great Value", "text": "Great value and quality in material.  sized exact per charts.  slow in delivery, but well worth the wait.  would recommend to others and will order again.", "rating": 4}, {"title": "pleasantly surprised 😌", "text": "Even though shipping was changed which wasn't an error on Rotita's end, I got EXACTLY what I ordered, expected and wanted! Looking forward to future purchases and already referred friends and family.", "rating": 4}, {"title": "They do compromise on returns.", "text": "I would not say it was friction.  I think that paying for all of the shipping cost when you want to return an item is a bit much.  However, they do offer to refund half of the price and you do keep the item.  That is reasonable.  Even though the item looked terrible on me I can give it to someone who may look better in it.  Great looking clothes though.  I already ordered another item.", "rating": 4}, {"title": "Happy with the service so far", "text": "Happy with the service so far. Easy to deal with and interesting/ colourful  choice of product.", "rating": 4}, {"title": "Love the blouse and it was as pretty as …", "text": "Love the blouse and it was as pretty as pictured on website !!!My only complaint is the weeks it took to receive the blouse !!!", "rating": 4}, {"title": "Over all very nice cloths for the money.", "text": "Date of experience: October 25, 2017", "rating": 4}, {"title": "My only complaint is the time it takes …", "text": "My only complaint is the time it takes to receive the order.  The clothes fit  very well and look great!  It would have been worth the wait if only I had known it would take so long because I had expected to get them in time for vacation and didn't.", "rating": 4}, {"title": "Really great selection of tops and great prices", "text": "Really great selection of tops and fancy clothes, great prices also!", "rating": 4}, {"title": "rotita have lovely clothes especially …", "text": "rotita have lovely clothes especially their blouses and their service is excellent", "rating": 4}, {"title": "I have received several nice pieces …", "text": "I have received several nice pieces from Rotita. I love this site. Shipping is fast and the prices are reasonable. The quality is great.", "rating": 4}, {"title": "I ordered a top from Rotita & i was …", "text": "I ordered a top from Rotita & i was pleasantly surprised at the nice quality & fit.", "rating": 4}, {"title": "Love the styles", "text": "Date of experience: October 11, 2017", "rating": 4}, {"title": "Great service  sizes fit right and …", "text": "Great service  sizes fit right and great fabrics.", "rating": 4}, {"title": "Great clothes!!", "text": "Date of experience: October 11, 2017", "rating": 4}, {"title": "Good service", "text": "I have ordered 3 times thus far.  My first order came really fast.  The sizes fit perfect and I am a larger woman.  I order the second for a speedy order and it came in time.  This last order is taking longer than expected.", "rating": 4}, {"title": "Loved my purchase", "text": "Date of experience: September 26, 2017", "rating": 4}, {"title": "Great selection", "text": "Great clothes, high quality and materials.  The clothes are very much as depicted in the pictures, sizes are all American sizes, fit very nicely.I did not appreciate to have to involve a third party (paypal) to make my payments.", "rating": 4}, {"title": "Cute outfits", "text": "Cute outfits, wish they were true to size consistently.", "rating": 4}, {"title": "Loved the top", "text": "Loved the top.  runs small and wrinkles too much.", "rating": 4}, {"title": "Extraordinary Value but Sizing Not Accurate by US Standards", "text": "The clothes I have gotten from Rotita are an extraordinary bargain.  Just be aware that the sizing is not reliable if you are used to US sizes.  I typically wear 2X sizes in US, but have been ordering 5X from Rotita to get a good fit.", "rating": 4}, {"title": "My first experience", "text": "My parcel reached it destination by the stated time and the dress looks just like the picture, material feels lovely", "rating": 4}, {"title": "Rotita has very nice and fashionable …", "text": "Rotita has very nice and fashionable dresses at affordable prices!", "rating": 4}, {"title": "Fast return process.", "text": "Date of experience: September 06, 2017", "rating": 4}, {"title": "my order was exactly as the picture and …", "text": "my order was exactly as the picture and material so very soft\\ and I got a lot of compliments on it, thank you and just wished I ordered sooner to wear it all summer long, thank you", "rating": 4}, {"title": "I absolutely LOVE the items I ordered", "text": "I absolutely LOVE the items I ordered!  Lately, I've been having a hard time ordering things online, I'm small, I'm 5\"4' & weigh approx. 110lbs, so most items of clothes I order, I end up sending back. The 2 shirts i ordered from Rotita got PERFECT!  I will definitely be ordering more from this site!", "rating": 4}, {"title": "Bought a tankini and love the …", "text": "Bought a tankini and love the look/price. It has a weak bra support and I wore a jogging bra and it look great. I have bought 3 more tops and have not receive them yet to evaluate.", "rating": 4}, {"title": "Very good site very helpful to people …", "text": "Very good site very helpful to people who wants cheap by good quality products. I want all to see  and select your choice. Very affordable, Come!", "rating": 4}, {"title": "I  was a bit nervous seeing the bathing …", "text": "I  was a bit nervous seeing the bathing suits were coming from China.  They arrived in good time, well packaged, and just as lovely as they looked online.  The sizing is a bit on the small size, but still OK for me.", "rating": 4}, {"title": "good purchase", "text": "I received my order within a reasonable time and I am satisfied with my purchases, the swimwear make me very well", "rating": 4}, {"title": "Awesome Swimsuits!", "text": "I purchased two swimsuits for myself from Rotita.  They were awesome!  A very good fit and the style was great!  I plan on purchasing more.", "rating": 4}, {"title": "The only problem I find is that it take …", "text": "The only problem I find is that it take too long for a shipment and need to express the fact that sizes are based on Asian women and you need to order a larger size as they are smaller people.", "rating": 4}, {"title": "Excellent Customer Service", "text": "I ordered a dress from Rotita and unfortunately I ordered the wrong size! Totally my fault.  Customer service was EXCELLENT and PROMPT.  I cant wait for my next order to arrive! Thanks Rotita Customer Service!", "rating": 4}, {"title": "I have had no problems with Rotita and …", "text": "I have had no problems with Rotita and the products I have ordered are most suitable. Thank you", "rating": 4}, {"title": "I like I quality and cost", "text": "Date of experience: August 09, 2017", "rating": 4}, {"title": "No chat available but quick response on …", "text": "No chat available but quick response on support ticket.", "rating": 4}, {"title": "Ordered bathing suits!!", "text": "Ordered bathing suits!!! They were great!!!", "rating": 4}, {"title": "Love the bathing suits!!!", "text": "Love the bathing suits!!!! Fit just right", "rating": 4}, {"title": "Two of the items I purchased did not …", "text": "Two of the items I purchased did not fit as I would like them to.  I requested a refund and was granted credit to my credit card within days of my request.  The other items I purchased, I am pleased with.", "rating": 4}, {"title": "Great style, true to size", "text": "The swimdress styles are great and true to size, and most of the time the order could be delivered quickly.", "rating": 4}, {"title": "Pretty Swim Suit!", "text": "Love the swim suit. Took quite some time to receive it, but it did ship, after I inquired about the delay. Suggest that you check the size charts. I did not, and thought I was ordering big, getting an XL, but should have gone bigger. I wore the suit once, but will be passing it off to a friend, and ordering me a larger one. That being said, I'm a repeat purchaser. I did not try to return because my friend loves the cute suit also!", "rating": 4}, {"title": "Good value.", "text": "The suits were fine, looked nice, fit well, delivered within the promised time, no complaints.", "rating": 4}, {"title": "Great site n clothing but have not …", "text": "Great site n clothing but have not received my order yet so that's all for now", "rating": 4}, {"title": "Happy ..i have had only good experiences …", "text": "Happy...i have had only good experiences with Rotita   i have purchased a couple of things and been happy every time..i like the way you model the clothes with the public .. good job..", "rating": 4}, {"title": "They honored their return policy and gave refund; size was too small", "text": "Easy to use website; cloths are cute but 2 sizes two small compared to U.S. sizes so if ordering based on US sizes order 2 sizes larger;They honored their return policy and refunded money.  They were quick to reply to my request.Thank you.", "rating": 4}, {"title": "The shopping is easy and checking out …", "text": "The shopping is easy and checking out was even easier. Now I am just waiting for my item.", "rating": 4}, {"title": "Great Prices", "text": "Great prices on all varieties of items.", "rating": 4}, {"title": "I'm pretty satisfied with one …", "text": "I'm pretty satisfied with one exception......since most of your merchandisecomes from China and if a person chooses for the cheapest delivery they might be waiting longer than expected but over all Rotita is pretty good.", "rating": 4}, {"title": "The stuff I get is great", "text": "The stuff I get is great. Just shipping takes for ever", "rating": 4}, {"title": "Love ❤️ their cloths", "text": "Love ❤️ their cloths! It is exactly as seen on the photo.  This was my first time for ordering on line great customer service, answer my question in a timely manner.  Their cloths are great and good pricing.   I will and have  recommend this site to my family and friends.", "rating": 4}, {"title": "I never reserved my order!", "text": "Date of experience: June 21, 2017", "rating": 4}, {"title": "Quick delivery", "text": "Quick delivery, great value and good products", "rating": 4}, {"title": "The top I got was cute the bottoms did …", "text": "The top I got was cute the bottoms did not fit like the pic I need to find some navy blue bottoms to buy", "rating": 4}, {"title": "I bought a bathing suit from Rotita", "text": "I bought a bathing suit from Rotita, two piece and a \"blousey\" top, my gosh is it figure flattering! I wish I had the tight bathing suit bod now, but at 57, 5'8\" and 150, I need the help. The price was right as well, takes a while to get for sure, but I was pleased with it.", "rating": 4}, {"title": "Good quality, super cute.", "text": "Good quality,, super cute. They look as  good on as I was hoping.", "rating": 4}, {"title": "Beautiful dresses ..", "text": "Beautiful dresses ... true fit but alittle short but easy enogh to add lace trim to underslip!", "rating": 4}, {"title": "I was a little worried about the …", "text": "I was a little worried about the purchase, since it is China, thinking it would be way to small. It fits perfect and I love the way it feels. My delivery was not as long as I thought either.", "rating": 4}, {"title": "I like the variety they offer.", "text": "Date of experience: June 08, 2017", "rating": 4}, {"title": "Very nice and great prices", "text": "Date of experience: June 07, 2017", "rating": 4}, {"title": "Do It Again", "text": "Great website,easy enough to navigate. Loved the clothes choices and the ones I ordered were as pictured. Sizing a bit of a problem...fair amount smaller than American sizes. Bit of a hangup in customs - not Rotita's fault - good communication and tracking however! Definitely recommend", "rating": 4}, {"title": "Bought a bathing suit and dress", "text": "Bought a bathing suit and dress. Products are made like the pictures show and order was shipped and arrived in timely manner. Only issue was the sizing. Ordered a Medium in a bathing suit and the bathing suit top was perfect but bottoms were too small. Ordered the dress in a large which shows the bust as 37 and I measure at a 36 and  the dress around the bust area was way too small but the rest of the dress fit fine.", "rating": 4}]