[{"title": "The customer service was good", "text": "The customer service was good.  Although the shirt ran small for the ladies size, Queensboro honored the sale to ensure the fit was good.", "rating": 4}, {"title": "I highly recommend Queensboro!", "text": "I appreciate the graphics team sending me the preview of my logo. It turned out so nice. It's high quality looking and I love it. It arrived super fast too.", "rating": 4}, {"title": "So I got a custom patch and hat…", "text": "So I got a custom patch and hat promotion they run for like a \"first time sample\" type deal.The patch came out perfect, hats quality was great. The only reason I haven't gave it 5 stars is the price is too rich for me (a guy who does yt part time and makes 14$/hr)But other than that it was awesome", "rating": 4}, {"title": "Order was redone and it turned out…", "text": "Order was redone and it turned out great, I recommend Queensboro for and thing that you wish to order. The embroidery is awesome.", "rating": 4}, {"title": "Excellent customer service!", "text": "Items that were originally ordered came in but embroidery was not straight. I reached out to customer service, sent in a few pics and the messed up items were redone and sent out. No hassles, no problems. Excellent customer service!", "rating": 4}, {"title": "itching excellent quality", "text": "The quality of the shirt and stitching is outstanding. I will be buying more. Working with the artists initially was very frustrating. I guess Queensboro.com can handle files that are large. Everyone I upped the original file that I use on app marketing material, it would only show up as a white  solid square.  I had to shrink the for size in order to submit it. ", "rating": 4}, {"title": "Embroidered Hats", "text": "Our hats are great quality and so is the embroidery.  Delivery was fast!", "rating": 4}, {"title": "Great! But 1 suggestion", "text": "As always, a great experience!  Very easy to navigate the website and to order.  One suggestion, though.  It would be very helpful to have a longer time to order once a promotion has dropped.  It takes time to contact employees to ask if they’d like to order and to get their information.  We want everyone to have the opportunity to order your top-notch products!", "rating": 4}, {"title": "Nice, but Pricey...", "text": "The garments are very nice.  They're quite overpriced, but they're nice.  The company stuck to their anticipated production date, and I appreciate that.", "rating": 4}, {"title": "Company Shirt/Hat", "text": "The shirt turned out really good for the price. This was the first product I ordered from the company but I’ll definitely give them other try and order a few more custom apparel pieces.", "rating": 4}, {"title": "So far, the replacements are looking good", "text": "So far, so good!  My previous 9 SportTek shirts all developed snags the first day I wore them, rendering them unwearable at work (embarrassing). Thankful your team offered to remake them with PortAuthority polos which your rep said was a more snag resistant.  The weave is similar but appears a bit tighter.  They just arrived yesterday.  I'll let you know how they perform.", "rating": 4}, {"title": "Better Communication", "text": "Enjoy Queensboro products and have ordered multiple times. I had expectations with an Order on Dec 1st, logo approved Dec 5th that it would arrive by Christmas. Unfortunately, it shipped Dec 30th and received January 4th. Would be nice to have more communication of when to expect versus just \"in line for production\" or \"in production\" as it was \"in production for what seemed like a week or more. Service has always been excellent.", "rating": 4}, {"title": "My Honest Feedback; Both Good and Bad", "text": "I found the website easy to understand and navigate, the support staff very helpful and the quality very high. The turnaround time is VERY SLOW. I'm sure you'll lost orders due to that one factor. I think the pricing is high to be honest, but because you stand behind your products and are very good about replacing items a customer's not fully satisfied with - with no arguing required - you replace it. That's unusual and highly valued by ME. All in all, I give you 4 of 5 stars.", "rating": 4}, {"title": "almost perfect", "text": "The embroidery quality is excellent. The sales and after sales support is fantastic. Your commitment to stand behind your products with your no-hassle guarantee is rare and exceptional. Your pricing may be a bit on the high side, but all things considered, I don't mind paying a bit extra for a quality product and experience. The one and only concern I have is with regard to turn-around time. It's quite long. If you could cut that in half, I'd be leaving 5 star reviews. Thank you!", "rating": 4}, {"title": "Top Notch!", "text": "I have ordered several items from queens boro and the quality is top notch! They did a fantastic job with my embroidered logo. One hiccup was quickly solved when a piece of clothing was damaged during production they quickly emailed me to let me know they would be sending out another one asap.", "rating": 4}, {"title": "Perfect", "text": "Perfect. Just as expected.  Thank you", "rating": 4}, {"title": "Great sale price", "text": "Great sale price. I don't like making a big order or normal price to try out a new company or a product so this sale price was an easier risk to try Queensboro out. ", "rating": 4}, {"title": "We are very happy with your product", "text": "We are very happy with your product, the quality and the service that you provide", "rating": 4}, {"title": "easy to order", "text": "easy to order/easy to follow through my only complaint is we no longer get the email showing what you have on special any more, would love to get them again", "rating": 4}, {"title": "Your Timeliness is Top Notch", "text": "Your Timeliness is Top NotchWaaohhhhh.... Haven made my enquiry and placed order for logo impression on some T-shirts, I was told it will be ready within 72 hours..And indeed they kept to their time and delivered withing 72 hours to my satisfaction...", "rating": 4}, {"title": "The embroidery is very good quality and…", "text": "The embroidery is very good quality and looks as expected. The shirts weren’t the best quality but I wasn’t expecting them to be top notch as they was very inexpensive. Overall happy with everything but if you are picky with material pick a better quality shirt that you know you love and trust the embroidery with your eyes closed because they are great.", "rating": 4}, {"title": "Great work again!", "text": "I've been a customer for Queensboro for years and once again because of their excellent work I will continue to order from them in the future.  The one thing I will request next time is that the chest logo on the polo shirts be 1/2'-1 inch bigger.  Other than that, outstanding work.  Also, their processing and shipping has gotten Much, MUCH faster than when I first use them years ago.", "rating": 4}, {"title": "Expensive but they finally got it right", "text": "Although it was an expensive venture for me, they finally got me the product I originally was trying to buy on the third try. I even sent them photos of what I was looking for and they said they do not sell that product. After two failed attempts, one of which was misprinted which I paid retail for both times, they finally sent me what I wanted from the start. Would have cost me about half if they had sold me what I finally received the first time.", "rating": 4}, {"title": "Ready to put the order in and ship it.", "text": "Ready to put the order in and ship it.However we had some number issues too many xl shirts not enough medium size. The other issue again minor but the white part of the Washington Memorial should have been stitched white as well as the Swiss flag cross!", "rating": 4}, {"title": "Product and pricing is always great", "text": "Product and pricing is always great, turnaround time is the main factor between using Queensboro or another vendor.  If we have all the time in the world we use you, if we need decent turnaround time we go somewhere else.", "rating": 4}, {"title": "Your help line was the most important…", "text": "Your help line was the most important to me because when I had an issue the were right on top of the situation.  Quick response and very helpful.  The product was very nice and the embroidery was beautiful.  Looking forward to future purchases. ", "rating": 4}, {"title": "my Experience are good with Queensboro…", "text": "my Experience are good with Queensboro if you want a good thing you may go tthere ", "rating": 4}, {"title": "My first experience", "text": "This was my first time ordering with Queensboro. Although it was frustrating at first, the people I interacted tried there best to be accommodating. I gave 4 stars because when i interacted with someone via chat, i was told to leave what i wanted in the comment section. Unfortunately it was not read. I opted to chat again to make sure what i was requesting was ready for the shirt, it was not. I was able to get it pulled before it was actually put on the shirt. In the end the package did not arrive on the date that i needed, this was not Queensboro's error, this was an error with UPS. Queensboro, Please add the option to add more then two logos when ordering custom embroidered shirts. Now that I know what to expect, I would definitely order from Queensboro again. The shirts were beautiful!!", "rating": 4}, {"title": "It seems like there might be a slight…", "text": "It seems like there might be a slight typo or incomplete phrase in your question. Could you please provide more context or clarify your question so that I can better assist you?", "rating": 4}, {"title": "You accommodated additions to the order…", "text": "You accommodated additions to the order and you honored the special offer while I was getting orders from club members. We had to adjust the number of shirts in given colors and size as we added to the order, but we got it right in the end.  Delivery was ahead of schedule.  You will have my business in the future.", "rating": 4}, {"title": "Just one suggestion..", "text": "Just one suggestion... make the size designation on the labels a little bigger so you can see them without a magnifying glass... small medium large extra large etc", "rating": 4}, {"title": "Queensboro excellent products and services", "text": "I recently had the pleasure of working with Queensboro, a company specializing in coustam logo apparel and promotional products. one of the standout qualities of Queensboro is their extensive range of products. From t-shirt and pens to mugs, key chain and drinkware, the offer ab wide verity of items that can be customized with your logo. Whatever your promotional needs may be Queensboro has you covered with an impressive selection.", "rating": 4}, {"title": "The Great Experience...", "text": "The experience was great I order 7 logo T-shirts at a great price and they made my logo pop with all the different color shirts that I bought. The only thing that I didn't like is how long it takes to get your delivery due to they do not work on the weekends. Other than that I am going to order more T-shirts and add hats to my order.", "rating": 4}, {"title": "The order is perfect however", "text": "The order is perfect however, my first order was lost ..expected to receive first week of Jan. I needed shirts for an event. The lost shipment was immediately replaced and received on Friday. Love the quality, color and look. Thank you.", "rating": 4}, {"title": "I chatted online with a rep before my…", "text": "I chatted online with a rep before my order. She helped me upload the logo and provided helpful info. I really liked being able to adjust the colors within the logo to better compliment the shirt color, that’s was awesome.", "rating": 4}, {"title": "Your sales and specials are very confusing", "text": "Your sales and specials are very confusing and seem a little misleading. It’s disheartening to make a purchase on sale, only to see the same item a week later for less.I like the products, quality of work and the no hassle customer service, but feel the bogo, sale, etc. are confusing.", "rating": 4}, {"title": "Fine logo reproduction", "text": "This is a repeat order for us of caps with our company logo. They produce high quality goods for reasonable prices, with excellent customer service. My only issue was that the original color for our company logo is no longer available, but they worked with us to find a substitute color. The logo embroidery is otherwise an excellent reproduction.", "rating": 4}, {"title": "The items look good and professional", "text": "The items look good and professional.  The time it took seemed a little long and the buttons on the woman's shirts aren't very flattering.  I originally ordered the v-neck shirts but I didn't see them in stock for this second order.", "rating": 4}, {"title": "Have used Queensboro for years so I…", "text": "Have used Queensboro for years so I went to them for a special project. Went back and forth a couple times but the end result was very good. Satisfied again and definitely recommend them. They always have special prices to entice me.", "rating": 4}, {"title": "Order System Needs Improvement", "text": "I should not have to put in a needed by date to keep my order from slipping out several weeks. I originally placed my order and the production date was 7 business days out. Then the date kept slipping by a few days each day as time went on until I finally reached out to say that I needed the order by a certain date (3 weeks after the original order date). then , and only then , did my order get put to the front of the production line and make it two me two days before the needed date. Either require a needed date or honor the first production date given, but don't push off already placed orders when you get in new rush orders. It's a bad look. The quality of the work however, was great!", "rating": 4}, {"title": "I love the work y'all do", "text": "I love the work y'all do.  I find that the mistakes that happen with the embroidery have more to do with my roots using your system than they do with the system...But, and this was addressed, i ordered two shirts and they were really snug, so maybe a review option about, did it fit as expected.  Or a caveat that says, these run a bit small.", "rating": 4}, {"title": "Very slow at the beginning of the…", "text": "Very slow at the beginning of the process. It seem to take a very long time to get the logo proof sent out for my approval. Then once I sent the approval, it seem to take a long time to get it into production. Once a reached out to Customer Service and complained, things went very quickly. I appreciate that.", "rating": 4}, {"title": "Excellent customer service", "text": "I have used Queensboro for many years.  The quality of work is almost always spot-on.  One recent article was not perfect, and they did what they promised and immediately processed a no-hassle replacement.  The service is excellent.  Fulfillment is not the fastest in the market, but the quality of service is exceptional.", "rating": 4}, {"title": "This was my first purchase…", "text": "This was my first purchase from Queensboro. When it arrived the shirts were too big. They replaced them immediately and the order was perfect and free as advertised.", "rating": 4}, {"title": "Some of the shirts did not fit…", "text": "Some of the shirts did not fit properly, however the agent sent me a replacement. One issue I did have is with my hats. The hat had my company name, but not my motto. So, that is frustrating. Although, I have to say overall I'm happy with the quality, and customer service of Queensboro.", "rating": 4}, {"title": "Oops happens !!!", "text": "Always a pleasure to do business with once your acct and logos are established.  Only once was my order not correct and after multiple orders that’s impressive.", "rating": 4}, {"title": "Great service & quality, slow shipping", "text": "I am a returning customer and didn't know which logos and thread colors that I used on a prior order and I wanted to be ensure I got my order straight.  I received quick and immediate guidance on it.  A day after ordering I received an email saying my order was ready for production and that the estimated ship date was 8 days later.  The order shipped 5 days later than estimated though meaning I received the order 15 days after ordering. This is the 2nd time my order has shipped later than expected, however I was not in a rush for the products so the 2+ week order delivery was not a problem for me; it was just unexpected.", "rating": 4}, {"title": "I have used Queensboro before and have…", "text": "I have used Queensboro before and have always been very pleased with the prproucts. My only issue is the limitations on the logos/pictures that I have wanted to have printed on things. The requirements are hard for me to meet.", "rating": 4}, {"title": "overall everything is good as marketning…", "text": "overall everything is good as marketing wise as well as quality wise .The only need is that we can add a good background in the logo to attract more customers.", "rating": 4}, {"title": "Always a Quality Product at a fair…", "text": "Always a Quality Product at a fair market price.The turn around time on this particular order was a little slower then the last few, but supply chain issues are effecting everyone.", "rating": 4}, {"title": "Quick to recover", "text": "We had a small hurdle where a line of text was missing on the final product. I let Queensboro know and they were right on it. They graciously worked with me to make it right, which was very much appreciated, even more so when the product arrived. I was very much satisfied with the quality of what I received, and now I'm waiting anxiously on my other orders.", "rating": 4}, {"title": "I enjoy this app", "text": "I enjoy this app, unlike other apps that say you can earn free cash and cash out and it’s up being just big scam well this app isn’t. Just got to play games or surveys which ever your offers of choice. Cash out is legit.", "rating": 4}, {"title": "Shirts are perfect", "text": "Shirts are perfect. Great material an fit.Just wish the order could have been completed sooner, as the weather has changed and too chilly for the shorts sleeves.", "rating": 4}, {"title": "Your employes are your real wealth", "text": "First I want to say that your employees are your real wealth. Their behaviour with the customer and bonding between each other shows this. I have ordered 5 times from your store and your delivery never fails to be appreciated. I also want to give you some advice that you should start your own carry bags so that when people buy from your store they advertise it for free it will be good for you and also for the customers. Second is that the quality is nice but you should focus on small things also like in t shirts we a tag around the temple neck area it irritates and many times it cuts the skin and when we pull it to remove then the threading their also comes out. In my opinion your store is nice going and I wish that you get more popularity in future and your brand gets value in market. That's all from my side.", "rating": 4}, {"title": "On of the best printed shirts selling…", "text": "On of the best printed shirts selling website which is providing a bettet gsm quality comparing to any other apps and clothing brand ", "rating": 4}, {"title": "The online graphics support really…", "text": "The online graphics support really worked fast and efficiently. The quality of the hat I ordered was up to my high standards and the embroidery makes for a very nice statement", "rating": 4}, {"title": "Queens pro is excellent", "text": "With only a few minutes deceptions including delayed items I have been very pleased with your service and products. I will continue shopping with you for sure.", "rating": 4}, {"title": "Logo embroidery was perfect", "text": "Logo embroidery was perfect! Initail order sent with one wrong color polo shirt, but mistake was quickly remedied!!", "rating": 4}, {"title": "They have the Best quality in town", "text": "They have the Best quality in town. There T- shirts are always  the most beautiful from the hole shop…but they are Very Expensive. I recommend them to reduce their price’s . That’s all", "rating": 4}, {"title": "good product. great price and customer service", "text": "good product. great price and customer service. Job took a little longer than expected. never got the email with the proof on it for a week (must have gotten lost in email) then there were minor changes. process took about a month. Client was happy however and that is what it is about.", "rating": 4}, {"title": "I thought your customer service was…", "text": "I thought your customer service was outstanding.  I was very impressed with how quickly you dealt with the problem on our order.", "rating": 4}, {"title": "My Shirt order was Great.", "text": "My Shirt order was Great. My bag order not so great. To get the proper logo colors I was ask to spend additional 100 dollars above advisement", "rating": 4}, {"title": "I like what I order when I order but…", "text": "I like what I order when I order but the turnaround time is very long. Andcthis last order sent I called after 15th day and order still wasn't shipped out.", "rating": 4}, {"title": "Unnrequested Thread Color Change on Re-Order", "text": "This was a repeat order and for some reason the colors of the threads changed from the original order. A bit frustrating but Queensboro is working to fix.", "rating": 4}, {"title": "Will continue to use Queensboro", "text": "Quality of the shirts is good, website is pretty decent. My only complaint was the time to fill the order. NOT HORRIBLE, and there is an option to expedite.", "rating": 4}, {"title": "Simply the best in collection", "text": "Simply the best in collection. A great shopping experience, considering the price vs worth factor. Do I recommend it? Hell-yeah!", "rating": 4}, {"title": "It’s my 4th order and the had been very…", "text": "It’s my 4th order and the had been very good in all of them except for one little mistake, but so far they are doing very good", "rating": 4}, {"title": "Great customer service", "text": "Great customer service, They resolved my order issue with no hesitation. To my surprise I was even able to get my problem resolved via online chat!👏🏾👏🏾👏🏾", "rating": 4}, {"title": "Queensboro has quite some quality…", "text": "Queensboro has quite some quality prints , good merchandise and I must commend them on their creativity too!!!", "rating": 4}, {"title": "The products were done very…", "text": "The products were done very professional. I only wish the embroidery was a little bit larger, so it stands out more. They are a little hard to make out unless you are close", "rating": 4}, {"title": "Above and beyond", "text": "A few mistakes, but they went above and beyond to make it right!  I recommend and look forward boy future orders with them", "rating": 4}, {"title": "Love to look", "text": "Love to look, Employees got back with me when I had a issue. Just wasn't happy with how long it took. Expected shipping was late", "rating": 4}, {"title": "Great company, great quality", "text": "Everything I've ordered so far has been great! My only complaint is shipping time, but i also understand that it takes time to do the embroidery.", "rating": 4}, {"title": "I gave 4 star because delivery times.", "text": "Date of experience: September 28, 2024", "rating": 4}, {"title": "We had a logo that needed updating", "text": "We had a logo that needed updating, no problem - great work. Shirts arrived as scheduled.", "rating": 4}, {"title": "Well done!", "text": "Thank you for correcting. Mishap on initial order but came thru huge making it right.", "rating": 4}, {"title": "They were great handled all concerns in…", "text": "They were great handled all concerns in a timely manner. I am not sure if the sizing after a large is true to size in a polo.We are getting ready to place a big order with the Queensboro. Thanks to the No Hassle Returns!", "rating": 4}, {"title": "Service was Outstanding", "text": "Service was Outstanding. I had several changes and they exceeded all expectations. However, Processing and shipping the order did take some time.", "rating": 4}, {"title": "My 1st order of 1/4\" zipper pullover…", "text": "My 1st order of 1/4\" zipper pullover wasn't what I expected. I emailed them and they made my next order perfect. Thanks guys!", "rating": 4}, {"title": "Thanks!", "text": "Thanks to their customer service for addressing a few issues with my hats! I will be ordering again!", "rating": 4}, {"title": "It was as  expected", "text": "It was as expected ", "rating": 4}, {"title": "The product is of good quality and the…", "text": "The product is of good quality and the process of selecting the product and using my own logo was easy enough. I just had to wait too long to receive it.", "rating": 4}, {"title": "Excellent product and the product has…", "text": "Excellent product and the product has received great local reviews.", "rating": 4}, {"title": "Great customer service", "text": "Great customer service! Disappointing that the first product had terrible sizing information and that expedited shipping wasn’t an option. Corrections to order were handled very well", "rating": 4}, {"title": "The shirt look nice and fabric is soft", "text": "The shirt look nice and fabric is soft. I usually wear XL, But I ordered 2xl, still feel’s like a medium size. ", "rating": 4}, {"title": "All was done as requested but thought…", "text": "All was done as requested but thought jacket would have been a heavier material. That was a disappointment.", "rating": 4}, {"title": "Good Online Customer Service", "text": "Easy to set up my logo and order clothing in an online/ virtual store.", "rating": 4}, {"title": "Happy", "text": "The material and quality of the embroidery is very high.  Love the shirts and am happy with the order.", "rating": 4}, {"title": "If The shipping where a lit faster it…", "text": "If The shipping where a lit faster it would be a perfect purchase, great quality and super professional looking", "rating": 4}, {"title": "Their trendly designs cater to diverse…", "text": "Their trendly designs cater to diverse tastes, making it easy to find something for every occasion.The exceptional customer service ensure a seamless shopping experience.", "rating": 4}, {"title": "Shirts are great", "text": "Shirts are great and the embroidery is wonderful.  Good value.", "rating": 4}, {"title": "The work is excellent and the material…", "text": "The work is excellent and the material is great. my only concern is the length of time it takes to get the product.", "rating": 4}, {"title": "Good quality", "text": "Good quality ", "rating": 4}, {"title": "Great product and rendering of our…", "text": "Great product and rendering of our logo.  I wouldn’t mind a little price break when ordering 20+.", "rating": 4}, {"title": "Everything is good but I it is annoying…", "text": "Everything is good but I it is annoying to have to make an appointment for a call to support.  I know chat is available but it takes way to long to convey a problem and have a discussion.  I unfortunately do not have that kind time.", "rating": 4}, {"title": "They sent a replacement order soon…", "text": "They sent a replacement order soon after I got the first order that was wrong", "rating": 4}, {"title": "Much improved!", "text": "Much improved!  The cap quality especially.  Thank you for your efforts!", "rating": 4}, {"title": "Product was as described and delivered…", "text": "Product was as described and delivered in a timely manner.", "rating": 4}, {"title": "The logo and brand name so match…", "text": "The logo and brand name so match perfectlyBuat the logi color and shape is less elegant", "rating": 4}, {"title": "Great shirt", "text": "Great shirt! A little expensive without promotion!", "rating": 4}, {"title": "The hats I received were great", "text": "The hats I received were great. In a time of instant gratification, the only thing that was disappointing was the wait time to receive products. My current order was placed on Oct 18th and my estimated ship date is Nov 2. Small price to pay for the low prices they offer. So plan ahead because it may take 3-4 weeks to get your order.", "rating": 4}, {"title": "You have a good affordable product and…", "text": "You have a good affordable product and I thank you for your professional service", "rating": 4}, {"title": "The service attitude of the staff is…", "text": "The service attitude of the staff is very good, and the quality of the clothes is also very good", "rating": 4}, {"title": "The shirt colors were on point!", "text": "The shirt colors were great! They did shrink some after washing. I will keep this in mind for my future orders.", "rating": 4}, {"title": "MY SHIRTS WERE LIKE I ORDERED AND MY…", "text": "MY SHIRTS WERE LIKE I ORDERED AND MY ORDER CAME IN EARLIER THAN IT SAID SO I WAS VERY HAPPY.", "rating": 4}, {"title": "I wish order turn around time was faster", "text": "Overall the quality of your products is outstanding! My only minor complaint is the order turn around time.", "rating": 4}, {"title": "FAST AND GREAT QUALITY", "text": "FAST, GREAT QUALITY PRODUCT. THE NEW SMALL I ORDERED THIS TIME IN A SHORT SLEEVE IS LIKE A MED OR LARGE. BIGGER THAN MY LAST. I AM 134 LBS AND 5'8\".", "rating": 4}, {"title": "Good quality embroidery and timely…", "text": "Good quality embroidery and timely services at a decent price.", "rating": 4}, {"title": "I loved the experience here", "text": "I loved the experience here! I ordered some printed T-shirts for my friend's business as her birthday gift:) She was very happy and surprised. The price was good, and I can see myself ordering from here gain.", "rating": 4}, {"title": "Welling to make us satisfied.", "text": "Welling to make us satisfied. ", "rating": 4}, {"title": "Truly a queen", "text": "Truly a queen. the best and affordable quality. Coming back again.", "rating": 4}, {"title": "It took a couple of try’s", "text": "It took a couple of try’s. I ordered exactly what the rep told me I needed and it wasn’t right. Then the redo was shorted by 2 hats. Lastly. It was perfect.", "rating": 4}, {"title": "My one complaint is my logo motto was…", "text": "My one complaint is my logo motto was cut out on my hats. Other then that I am happy with the company.", "rating": 4}, {"title": "I never regret choosing Queensboro…", "text": "I never regret choosing Queensboro perfect choice always my first option ", "rating": 4}, {"title": "The jacket was perfect the hat took…", "text": "The jacket was perfect the hat took longer than I expected but they came out just fine thank you.I’ll be back with some different designs looking forward to it thank you for all your help and all your phone workers they were very communicative. Darian", "rating": 4}, {"title": "Easy", "text": "Easy, quick customer service Josh was great to deal with", "rating": 4}, {"title": "Polos were great", "text": "Polos were great. Looked great. Great helpful customer service.", "rating": 4}, {"title": "Great service", "text": "Great price, quality of products, speed of delivery.", "rating": 4}, {"title": "Great Experience", "text": "The shirt I received was a much darker color than the image I approved. As a result, some of the embroidery could not be seen more than a few feet away. I reordered a lighter color, at no cost, and it was perfect. Thank you!", "rating": 4}, {"title": "I took a little too long", "text": "I took a little too long, but the embroidery was top notch quality! Loved new caps!", "rating": 4}, {"title": "Easy and nicely done", "text": "It was my first visit and my item turned out great. I’m not sure but I tried to add text to my hat but it only allowed a logo. It be nice if that was an option but overall experience was great .", "rating": 4}, {"title": "Shirt is great!", "text": "Shirt is great!! Good fitting and embroidery is real nice. I did not know the status of order until I had enquired. It had been a few weeks since I had placed the order. Queensboro did communicate back in a timely manner on the status. The shirt came two days after my enquiry. I will be ordering more shirts from Queensboro for our church staff and volunteer teams", "rating": 4}, {"title": "The order was fine", "text": "The order was fine, it just seemed to take a bit longer than usual to receive it.", "rating": 4}, {"title": "Shirts were of great quality and…", "text": "Shirts were of great quality and customer service was excellent", "rating": 4}, {"title": "Excellent embroidery work", "text": "Excellent embroidery work. Good quality material although it is a little pricy.", "rating": 4}, {"title": "quality products and service at a great…", "text": "quality products and service at a great price! what's not to like? I'll def'tly be back to pick up more!", "rating": 4}, {"title": "Good things come to those who wait!", "text": "PhilMySpice is100% impressed! The wait time, well. Good things come to those who wait! I'll order again in larger quantities. The return policy, if needed, is unbeatable!", "rating": 4}, {"title": "Navy Blue No Longer a Color Option", "text": "Last year I ordered polos in Navy Blue.  This year, Navy Blue was not an option I could choose so had to go with Royal Blue.  Although the quality of the shirts and the customer service is very good, I was disappointed I could not get the polo shirts is Navy Blue.", "rating": 4}, {"title": "For whatever reason this order took…", "text": "For whatever reason this order took longer than any of my previous purchases.  Not a big deal, just had hoped to have them sooner for a couple of our events.Plenty more opportunities coming up.As always quality was top notch.", "rating": 4}, {"title": "Great work!!", "text": "Great work!!! Took a little longer than expected but GREAT work", "rating": 4}, {"title": "Best place to order your Polo's", "text": "Hi,you are really on quality and service provider, no doubt about it. initially i had an issue with size and it was taken care of team and they send me an correct size. so actually your medium size polo is 44 size shoulder, now I got it. i expected little more shiny polo but not so that the reason i cut down 1 star.", "rating": 4}, {"title": "Great price", "text": "Great price, decent quality.", "rating": 4}, {"title": "Online Flowers Delivery in Singapore", "text": "Our top website now offers quick and easy Online Flowers Delivery in Singapore for every event, occasion, or mood. Flowers are affordable, sorted by colours, arrangements, and occasions, and can be ordered for Same Day Shipping with Roses in Singapore.", "rating": 4}, {"title": "Willing to remake when items were not…", "text": "Willing to remake when items were not satisfactory.", "rating": 4}, {"title": "I purchased some polo shirts with my…", "text": "I purchased some polo shirts with my company logo on them.  Unfortunately the first batch took a while to get and when I finally did, it was done incorrectly, but Queensboro made it right and shipped me replacements at no extra charge and they arrived very quickly.", "rating": 4}, {"title": "The fast shipping and quality", "text": "The fast shipping and quality ", "rating": 4}, {"title": "My Experience", "text": "Overall, really good.  So many choices are mind blowing to me!", "rating": 4}, {"title": "Though I ordered two hats with my logo…", "text": "Though I ordered two hats with my logo on them the colors I chose for the two different hats were the hard part. I really enjoyed the experience but to see what the actual colors on the surface of the hat in a more blown up picture would help to see what you will get.Sincerely,Lynn", "rating": 4}, {"title": "Product was as described and of good…", "text": "Product was as described and of good quality.", "rating": 4}, {"title": "Great Product", "text": "The product was great and exactly as I ordered it. However, I do wish they would just hold it and send the whole order at once instead of just a couple at a time. Understandable that embroidery takes quite a bit of time, as my wife embroiders as a hobby. I just would personally prefer to get my entire order at once rather than piece by piece. For reference I ordered 5 new embroidered shirts for work and tossed my old ones. Now I have 2 work shirts to wear for the week. Mostly my own fault for assuming my entire order would come at once.", "rating": 4}, {"title": "Great Responsive Customer Service", "text": "Order placed easily however when received there were errors. One shirt was the wrong size and another was missing lettering on the logo. No problem no hassles. Shirts were remade quickly and we're delivered perfectly. Way to go!!", "rating": 4}, {"title": "I love the polos I purchased they are…", "text": "I love the polos I purchased they are quality and affordable. I have a total of five now that I purchased from the Queen 👸. The only downside in my opinion is the timeframe. It takes weeks for them to arrive and I wish it was faster.", "rating": 4}, {"title": "Shirts look great", "text": "Shirts look great.  I was surprised the logo translated so well", "rating": 4}, {"title": "Everything is great", "text": "Everything is great! As always ", "rating": 4}, {"title": "Well done!", "text": "I am very satisfied with my purchase. The embroidery is great. The quality of the hat I chose is fitting for the price.I'm looking forward to ordering more customized products.", "rating": 4}, {"title": "Just the way I like it", "text": "You're the only site I have used that can get My logo just the way I like it. Thank you.", "rating": 4}, {"title": "Took to long", "text": "Took to long. But everything came in as ordered. Thank you. Will order again.", "rating": 4}, {"title": "“Customer service is top notch", "text": "“Customer service is top notch! I will be coming back as a customer due to a wonderful experience.”", "rating": 4}, {"title": "You guys have exceeded my expectations", "text": "You guys have exceeded my expectations. The quality and detail is phenomenal 👌. Good job great people excellent service. Keep up the good work  my next order is coming soon", "rating": 4}, {"title": "It is a comfortable clothing company", "text": "Date of experience: November 18, 2023", "rating": 4}, {"title": "jdkjsad f dsfdsf dsfon dfd", "text": "Date of experience: July 01, 2024", "rating": 4}, {"title": "Great but e-mails", "text": "Would give a 5, but the number of emails is very sad", "rating": 4}, {"title": "Passed Brief Inspection", "text": "Everything was good this time after a brief inspection. I didn't see anything that looked off at all.", "rating": 4}, {"title": "White was see-through, company replaced for free.", "text": "*Edit* I did contact customer service and they were happy to replace the shirt with a different color for free. 10/10 for their customer service. The price was $75 for 4 shirts (on sale) which was nice. The shipping took a little long but not horrible, they did arrive before my anticipated date. The logos have yet to bend, they do lay flat as advertised. I do have 2 complaints though. 3 of the 4 shirts I ordered have strings poking out of the embroidery (upon receiving them), and the white shirt is very see-through. I feel uncomfortable wearing it without an undershirt, which defeats the purpose of having a cool breathable shirt in the Texas heat. I defiantly do not suggest ordering white. The sample photo of the white shirt looks like it won't be see-through, its misleading. For $75 the shirts are good, not great. I wish I wouldn't have ordered the white one.", "rating": 4}, {"title": "The new shirt fits perfectly", "text": "The new shirt fits perfectly. Fist time I give a good place", "rating": 4}, {"title": "Staff is always very client oriented…", "text": "Staff is always very client oriented and works hard to make sure you are completely satisfied with The order.", "rating": 4}, {"title": "Price and shipment", "text": "Price and shipment ", "rating": 4}, {"title": "While my first Queensboro order had a…", "text": "While my first Queensboro order had a few flaws the new polo that was created has a quality look and feel that is made to last.", "rating": 4}, {"title": "Great quality products turn times are quicker now which is great", "text": "Quality and turn time", "rating": 4}, {"title": "Order was OK but it took a LONG time to…", "text": "Order was OK but it took a LONG time to receive.", "rating": 4}, {"title": "The design was perfect", "text": "The design was perfect. The fit of the shirt i chose was a little small. I ordered an XL, but it fit like a L. A little snug.", "rating": 4}, {"title": "What I wanted and came in a time", "text": "Date of experience: August 19, 2024", "rating": 4}, {"title": "Ease of ordering", "text": "Ease of ordering. Excellent quality. Beautiful embroidery.", "rating": 4}, {"title": "Everything was fine the second time…", "text": "Everything was fine the second time around ", "rating": 4}, {"title": "Happy", "text": "Great collection. the staff was really helpful. I will definitely shop again", "rating": 4}, {"title": "Great clothing", "text": "Great clothing! Must have in your closet", "rating": 4}, {"title": "Pleasure to deal with", "text": "Pleasure to deal with, Great communication.Excellent watch and customer service!would use Queensboro again.", "rating": 4}, {"title": "great product", "text": "Great Product , shirts are quality and fit well , this last order was a liitle slower , but worth the wait", "rating": 4}, {"title": "You must try Queensboro", "text": "You must try Queensboro. Satisfaction is Guaranteed. Perfectionist at its best.", "rating": 4}, {"title": "GREAT EXPERIENCE!!", "text": "Date of experience: November 14, 2022", "rating": 4}, {"title": "Didn’t realize the shirts had chest…", "text": "Didn’t realize the shirts had chest pockets. However some of where happy about. So I’ll good with it.", "rating": 4}, {"title": "The quality of work.", "text": "Date of experience: December 13, 2023", "rating": 4}, {"title": "Delivered Quality", "text": "Quality is as expected.", "rating": 4}, {"title": "Nice Store", "text": "Nice Store, def recommended!", "rating": 4}, {"title": "The help I received.", "text": "Date of experience: October 30, 2023", "rating": 4}, {"title": "Happy with the product", "text": "Happy with the product, just that it seems to take too long to process any order.", "rating": 4}, {"title": "First time ordering", "text": "Overall a great first time ordering apparel for my business! Good quality products. So excited!", "rating": 4}, {"title": "Hat was great !!", "text": "Hat was great !!! Just wish the had a work shirt the matching color to match !!", "rating": 4}, {"title": "Had a couple of snags but overall…", "text": "Had a couple of snags but overall pretty decent. Turnaround time is horribly slow!", "rating": 4}, {"title": "The only drawback was turnaround time.", "text": "Date of experience: October 20, 2022", "rating": 4}, {"title": "You always do a great job", "text": "You always do a great job, thanks", "rating": 4}, {"title": "Quality was excellent", "text": "Quality was excellent. My only slight issue was the turn around time.", "rating": 4}, {"title": "Did a good job online help was amazing", "text": "Did a good job online help was amazing!  Shipping took a while", "rating": 4}, {"title": "good product", "text": "A good product.", "rating": 4}, {"title": "Great people", "text": "Great people, easy to work with.  top quality products.", "rating": 4}, {"title": "fast and realiable with good quality…", "text": "fast and realiable with good quality thank you queensboro", "rating": 4}, {"title": "Loyal customer", "text": "Date of experience: September 19, 2024", "rating": 4}, {"title": "Excellent i love the quality of stuff.", "text": "Excellent i love the quality of stuff.Satisfied", "rating": 4}, {"title": "The order took longer then was estimated", "text": "Date of experience: July 25, 2022", "rating": 4}, {"title": "its product are very nice", "text": "Date of experience: June 10, 2022", "rating": 4}, {"title": "great product", "text": "great productvalue for money", "rating": 4}, {"title": "Excellent service", "text": "Excellent service, very receptive customer service", "rating": 4}, {"title": "Nice products for out business.", "text": "Very responsive company.", "rating": 4}, {"title": "Not bad at all!!", "text": "Date of experience: September 27, 2022", "rating": 4}, {"title": "I love this underwear", "text": "I love this underwear, thanks", "rating": 4}, {"title": "Good work,great support", "text": "Date of experience: September 12, 2022", "rating": 4}, {"title": "high quality clothes", "text": "high quality clothes! thanks", "rating": 4}, {"title": "Excellent experience 👏", "text": "Date of experience: July 19, 2022", "rating": 4}, {"title": "I liked the store", "text": "Date of experience: January 04, 2024", "rating": 4}, {"title": "items were as expected", "text": "Date of experience: July 19, 2022", "rating": 4}, {"title": "splitting shipping locations", "text": "the only complaint i have is the shipping, i had to order shirts for 7 different locations and i could not split the deliveries up instead i had to order multiple times one for each facility. if there was a delivery charge for splitting the order i would have paid that.", "rating": 4}, {"title": "So excited to receive my embroidered…", "text": "So excited to receive my embroidered shirts. I’m sure to make a positive impression with my clients while wearing these. Great colors and fabric at first touch and sight seem comfortable and the fit is true to size.", "rating": 4}, {"title": "Over all I'm happy", "text": "Over all I'm happy.  So the reason for the 4 star was because of shipping.  The shirts feel great and look great. My students loved how they fit as well.", "rating": 4}, {"title": "Great products", "text": "Great products. Shipping is a little slow", "rating": 4}, {"title": "everything is fine", "text": "Date of experience: May 23, 2022", "rating": 4}, {"title": "My first order was good but not…", "text": "My first order was good but not perfect. You quickly responded and suggested to correct entire order. Thank you for everything you’ve done!", "rating": 4}, {"title": "Friendly customer service", "text": "Friendly customer service! Quality of the product is superb! Overall, I am pleased with the transaction!", "rating": 4}, {"title": "Amazing products", "text": "The products are amazing. When i enquired about the delivery with the customer service, they ensured me about the product.The delivery service is good. The quality is great.", "rating": 4}, {"title": "good platform and good service", "text": "Date of experience: May 16, 2022", "rating": 4}, {"title": "Have made many orders for business…", "text": "Have made many orders for business apparel and swag. Have been 99% happy except a Nike hat I ordered for myself had the fabric was creased in the logo stitching and it was sent out that way. Otherwise everything is great quality and looks exactly as expected.", "rating": 4}, {"title": "Awesome to work with", "text": "Awesome to work with ! Talked to them about some stuff and immediately was handled", "rating": 4}, {"title": "Amazing", "text": "Visited today. Had a great experience in here. Will visit again!", "rating": 4}, {"title": "Very good quality shirts!", "text": "Very good quality shirts and embroidery! They had a good deal for new customers, but the prices for reorders are a little $$.", "rating": 4}, {"title": "Been using Queensboro for over 20…", "text": "Been using Queensboro for over 20 years. They are great for small businesses like mine. After a couple of year absence due to the global pandemic I finally had a need for some new shirts. I placed my order and had a little over 2 weeks lead time till in needed them. I received my order acknowledgment and the “ship date” was a couple days before my “need date” so I contacted on line customer service as it is so hard to get a real person on the phone any more. I simply asked if I could pay to get my shipment upgrade to an overnight delivery to insure I would have them on time? The on line customer service replied and stated that the “ship date” is not guaranteed and is an estimate…and then stated they could not change the shipping to overnight. Then they asked if I wanted to cancel or proceed with my order? Almost seemed as though they did not want my business anymore? I told them to move forward with the order but frankly I was not very happy with their answers or customer service and would think twice about placing future orders with them. Less than a week after I confirmed to move forward with the order I get another email stating my entire order was now 3 days ahead of the “schedule date” and that it would be shipping priority overnight at no additional expense to me. Guess maybe Fred Meyer or someone within the organization was made aware of my discontent and made an effort to make a 20+ year customer happy. Kudos to all and thanks for the “extra effort” to make a customer happy. Maybe next transaction it will be a 5 star rating.", "rating": 4}, {"title": "Always a great product at very…", "text": "Always a great product at very affordable prices.", "rating": 4}, {"title": "Authentic material.", "text": "I bought a bottle from Queensboro and loved it, then it made me buy more stuff from them, each and every item they made was authentic and the material was good. The products they make are of excellent quality.", "rating": 4}, {"title": "The box was slightly opened upon…", "text": "The box was slightly opened upon arrival.", "rating": 4}, {"title": "As usual everything was perfect.", "text": "Date of experience: April 25, 2022", "rating": 4}, {"title": "Good offers Great Jobs", "text": "Date of experience: April 24, 2022", "rating": 4}, {"title": "thanks", "text": "thanks! enjoyed your service", "rating": 4}, {"title": "Didn't even look twice when I came in…", "text": "Didn't even look twice when I came in with my robot wife.", "rating": 4}, {"title": "The Product was Great and loved by…", "text": "The Product was Great and loved by everyone However, I feel the process became a little frustrating when the design team couldn't get my design right. This delayed my order and I couldn't get it when I really needed it, but After speaking to someone, They updated and fixed my order  to my liking.", "rating": 4}, {"title": "The platform is so easy to use", "text": "The platform is so easy to use. I don't consider myself a creative person yet with Queensboro I feel myself a designer lolthe quality is good and the prices are fair", "rating": 4}, {"title": "I wasn't expecting the blue to differ…", "text": "I wasn't expecting the blue to differ so greatly based on the fabric.", "rating": 4}, {"title": "Only problem...no small t-shirts…", "text": "Only problem...no small t-shirts available", "rating": 4}, {"title": "Great product. Communication could be better", "text": "Very happy overall with my purchase of 40 caps. Only issues were on the communication side. A few days my order was purchased, I received a text notification that the items would be shipped sometime in Nov, which was 8 months away. I immediately emailed but received no response. It took me commenting on one of their sponsored FB ads to get a response. Made me a little nervous but they addressed the shipping date error and I received my order in a timely fashion. Good product and service. I will use them again.", "rating": 4}, {"title": "I would've given 5 stars", "text": "I would've given 5 stars, but the size 2XL shirt didn't arrive with the order, so I had to change personnel for the event.", "rating": 4}, {"title": "Quality of the merchandise was perfect…", "text": "Quality of the merchandise was perfect just wish it was faster", "rating": 4}, {"title": "The sweatshirts are great", "text": "The sweatshirts are great , but I wished they would have used a different color of stitching for the letters on the Heather grey sweatshirts instead of a darker grey stitching, thank you", "rating": 4}, {"title": "Satisfied 2nd time around", "text": "I was not satisfied with my first order. It seemed rushed and not handled well. Issues with scuffs, logo wasn’t filled in. However, when I reached out to CS, Melissa Taggett quickly jumped on the problem and I was sent new hats that were extremely well done. That was quality I was expecting. She made me a long term customer for sure. Hoping in the order I just placed for shirts the quality is as good the first time.", "rating": 4}, {"title": "Products were professionally completed", "text": "Products were professionally completed, but delivery was late.", "rating": 4}, {"title": "They always make it right and quick…", "text": "They always make it right and quick return, but we have had a few wrong orders lately.  Quality is fantastic and they are incredible to fix their errors.", "rating": 4}, {"title": "The time frame to receive merchandise…", "text": "The time frame to receive merchandise is a little long, everything else has been great, quality of polo shirts, excellent!", "rating": 4}, {"title": "quality products", "text": "quality products, consistent logo stitching and colors", "rating": 4}, {"title": "Everything looks good", "text": "Everything looks good! I wish we could have ordered our company t shirts with you, however, the logo I sent was not considered clear enough for your dept. for printing, although it works fine for other t shirt vendors. Also, your company will not print an additional logo on the sleeve.", "rating": 4}, {"title": "Fast, accurate and communicative", "text": "Fast, accurate and kept me informed the whole time. Nice job!", "rating": 4}, {"title": "Although the embroidery color used was…", "text": "Although the embroidery color used was incorrect.  The issue was quickly resolved with 100% satisfaction.", "rating": 4}, {"title": "Would love to repeat buy", "text": "Would love to repeat buy, but the prices are a bit too high for ordering, when they are prizes for a horse show.  But thank you for the order you gave me.  the product is super.", "rating": 4}, {"title": "I love Queensboro", "text": "I love Queensboro. Great quality and perfect embroidery.When ordering with different companies, I find the website a little clunky. On those occasions I turn myself over to customer service and everything comes together nicely.", "rating": 4}, {"title": "I'm impressed with the way they do…", "text": "I'm impressed with the way they do business.Recently had a small misunderstood with them, but solved all within 30 mins and 3 emails exchanged. These guys know what they're doing. Recommended. My rating: 4.60/5Why not 5/5? Well, I'm pretty demanding client. :))", "rating": 4}, {"title": "The process was a lot easier than I…", "text": "The process was a lot easier than I though and results were excellent! Will definitely us this product again!", "rating": 4}, {"title": "Making my Mind", "text": "I am just making up my mind to buy its product as viewing the reviews.", "rating": 4}, {"title": "Overall great experience for a great quality product", "text": "Overall great experience and product in buying from Queensboro. The reasons it is not a five star are the lead time on receiving the orders seems a little long and it is a little pricey. However, compared to the competition the quality is fantastic, price is acceptable, and lead time is understandable. I'll buy from them again.", "rating": 4}, {"title": "I always come back for more", "text": "I always come back for more.  That's my review. That says it all.", "rating": 4}, {"title": "Ordering was simple and easy", "text": "Ordering was simple and easy. We did have a small problem with a couple of items we received, but Queensboro was very quick and helpful with sending a replacement item. Will definitely use Queensboro again.", "rating": 4}, {"title": "Been using Queensboro Shirt Company for years!", "text": "Been using Queensboro Shirt Company since the early 90’s. They have been very instrumental in the success of my businesses for many years. I cannot began to tell you how many times I relied on them for events, trade shows, new market promotions and branding identity. And whenever there’s a hiccup they always strive to make it right. This is why I remain loyal to them. Please keep your new crew on point because my company likes the Queensboro Shirt Company.Sincerely,Charles CarollBlacksiht Communicationsand TheBetterTradesman.com", "rating": 4}, {"title": "Everything was OUTSTANDING...but one", "text": "Everything was OUTSTANDING...but one. My only unmet need was timing. I asked for the shirts to be in my office by a certain date and it was shipped early enough but was shipped ground so I was late.  I would have liked an option to speed up the shipping (even at my cost) to arrive before leaving to the event.", "rating": 4}, {"title": "I love my order", "text": "I love my order. I just wish it took shorter time to receive it", "rating": 4}, {"title": "it has always been a pleasure.", "text": "it has always been a pleasure.. Loved the way my hat fits me.", "rating": 4}, {"title": "Shipping was longer than I had hoped", "text": "Shipping was longer than I had hoped. Overall very pleased with the company and the products.", "rating": 4}, {"title": "Very nice shirt", "text": "Very nice shirt. Love it", "rating": 4}, {"title": "The products were beautiful and top…", "text": "The products were beautiful and top quality.I will continue to order my and my daughters business identity products from you, as long as process and quality all stay the same. One point is timing, which requires better accuracy. Thank you.", "rating": 4}, {"title": "Long sleeve polo shirt great to have", "text": "The zip up polos were just as ordered and the logo was very nicely done. We're glad to have a long sleeve top that we can wear as we are out promoting our non-profit.  I would, however, like to know if you have something similar that is a higher quality material?", "rating": 4}, {"title": "I just love it and I am obsessed with…", "text": "I just love it and I am obsessed with them and everything they have", "rating": 4}, {"title": "Despite me speaking the language as a…", "text": "Despite me speaking the language as a 45 yr. professional artist, we were unable to render one of my favorite original logos due to an apparent failure to explain why an unwanted feature was forced upon my design. Besides that, all compromises between my designs and embroidery's inherent constraints have been worked out satisfactorily and I have been pleased with the results.", "rating": 4}, {"title": "Nice looking hats", "text": "I would consider everything about the hats perfect other than the style of the hats themselves. Wanted a hat with a higher profile. The logos on the hats turned out perfect though.", "rating": 4}, {"title": "Very good.", "text": "Very good and fast service.", "rating": 4}, {"title": "I’m very happy with your product", "text": "I’m very happy with your product, quality, printed details  and quick service.I hope buy more in the near future.Good job guys!", "rating": 4}, {"title": "Sizing little off", "text": "Got the three vests and one of the xl was like a large.  They were embroidered perfectly. Thanks", "rating": 4}, {"title": "Great quality, but", "text": "Great quality, but late shipping.", "rating": 4}, {"title": "Amazing buying experience!", "text": "Great service, awesome watches", "rating": 4}, {"title": "Our first order was great.", "text": "Date of experience: November 28, 2021", "rating": 4}, {"title": "Order was delayed", "text": "Order was delayed, but Allen kept me updated, and offered a nice discount on my next purchase!!", "rating": 4}, {"title": "The sleeves on the free fleece jacket…", "text": "The sleeves on the free fleece jacket were almost 2 inches longer than expected - but my wife can hem that for me", "rating": 4}, {"title": "One of the cheapest stores I order…", "text": "One of the cheapest stores I order clothis staff at. I like the quality and price. There are often cool deals. Stop by to check.", "rating": 4}, {"title": "NO Issues", "text": "NO Issues, Would have gotten 5 stars but was out of the color I originally wanted.", "rating": 4}, {"title": "Always a quality product.", "text": "Date of experience: November 09, 2021", "rating": 4}, {"title": "Although it took us several tries......", "text": "Although it took us several tries to get the order exactly right, I could not be happier with the final results. And your customer service was beyond amazing. Thank you, Eric for working so hard with me to get it all right!!!! Amazing!", "rating": 4}, {"title": "Great responsive service", "text": "Date of experience: November 03, 2021", "rating": 4}, {"title": "The product and service was greatFor the great customer service!", "text": "The product and service was great! The one and only complaint I would have is I miss the days of getting all of the shirts in one box less all of the individual plastic bags. Seems like a lot of extra waste and possibly cost.Thanks For the great customer service!", "rating": 4}, {"title": "Their embroidery is First Class and the…", "text": "Their embroidery is First Class and the only reason I did not give 4 stars is because of the length in time to get the products is a little longer than my desire.", "rating": 4}, {"title": "Good people to do business with", "text": "Good people to do business with. The customer service is spot on and they get your order shipped out fast! I look forward to doing more business with the Queen in the near future.Thanks Queen!", "rating": 4}, {"title": "Loved the hats but there was still a…", "text": "Loved the hats but there was still a little backing paper for the stitching. Nothing that I can’t cut off though! Super hyped on my new hats!", "rating": 4}, {"title": "Slow Turnaround", "text": "The products turned out great as usual. The 3 week turnaround time is the only thing stopping this review from being 5 stars. If I am able to et the products faster, I will be able to sell more and generate more revenues for both companies.", "rating": 4}, {"title": "Always great!", "text": "Date of experience: October 26, 2021", "rating": 4}, {"title": "Perfect finish for my shirts, branding my new business", "text": "Shirts final finish/product came out PERFECT", "rating": 4}, {"title": "Good experience.", "text": "Products are always more than satisfactory, and embroidery quality is excellent. Ordering can be a bit clumsy, about a B-. Customer service, however, is always friendly and helpful. Overall, a good purchasing experience.", "rating": 4}, {"title": "Very long for shipping but the shirts…", "text": "Very long for shipping but the shirts are nice", "rating": 4}, {"title": "Ordered shirts that I believed to be…", "text": "Ordered shirts that I believed to be 100% cotton. When they arrived I found them to be a blend of cotton and another material. I let the representative know and they made it right for me by sending the exact shirts I originally wanted. They didn't asked for the original shirts to be returned although I said I would return them. I believe the Queensboro policy of making sure the customer is satisfied is one that all companies should follow. I rank Queensboro as a top company for standing behind their products and ensuring the customer receives exactly what they wanted. I will recommend this company to others.", "rating": 4}, {"title": "The start was ruff but everything…", "text": "The start was ruff but everything turned out perfect", "rating": 4}, {"title": "Slow ship times", "text": "One of the hats I initially ordered was a little messed up when it arrived. They replaced it without a problem. I appreciate the easy replacement, but it took a few weeks to get it, which means I didn't have my hat for several weeks from the initial order. Replacements should be top priority as it means my initial order still isn't complete.", "rating": 4}, {"title": "LITTLE PUCKERED AT THE LOGO", "text": "Date of experience: September 25, 2021", "rating": 4}, {"title": "Awesome work on the letter", "text": "Awesome work on the letter. Excellent shirts and vesh. I'm loving it‼️", "rating": 4}, {"title": "The production time to delivery was…", "text": "The production time to delivery was longer than expected. The items were needed for our annual meeting, and arrived 2 days after it was over.", "rating": 4}, {"title": "The Quality of the shirts were great.", "text": "Date of experience: September 14, 2021", "rating": 4}, {"title": "Tops were great", "text": "Tops were great! The brand we fit was cut on the smaller size. We could have ordered a size up on all shirts.", "rating": 4}, {"title": "The screen print is a little blurry but…", "text": "The screen print is a little blurry but overall good", "rating": 4}, {"title": "High quality products but slow in production", "text": "No issues with quality, everything is very well done. I didn’t know it would take so long for production until I completed the order. Products arrived 2 days after the event I needed them for. Over a month from order to delivery.", "rating": 4}, {"title": "A good outcome", "text": "There was an initial snag with the design for the order but customer service got it fixed and had the order remade promptly. Look forward to placing future orders!", "rating": 4}, {"title": "Recommended", "text": "Great experience, good products, the only thing I would wish it didn’t take so long to get and the if there was a way to try out the different types of clothing options", "rating": 4}, {"title": "Mistake corrected", "text": "My first order wasn’t correct but customer service helped me fix the problem and sent a new shipment out the way I wanted. Everything looked great. Thank you for everything.", "rating": 4}, {"title": "I would give 5 stars", "text": "I would give 5 stars, but the order was late, more than a month after placing the order. Otherwise, Queensboro offers the best products and price!", "rating": 4}, {"title": "Great work….just a week late.", "text": "Other than shipping a week late, the order was perfect.", "rating": 4}, {"title": "✔✔🦅", "text": "Was a slight delay in my order. But there was a credit added to my account for the small inconvenience. My order arrived and was wvwn better than I expected. It really brings out a whole new look to my company image. Great work and will be ordering again soon.", "rating": 4}, {"title": "I’m happy with the results…..", "text": "Although it took awhile to get the caps, I’m happy with the results.", "rating": 4}, {"title": "First order with your company", "text": "First order with your company and the products were all good. Your embroidery was excellent and the hats and polos fit great!It would have been 5 stars except it took a couple weeks longer then expected to receive the product.", "rating": 4}, {"title": "Love the quality of the Products", "text": "Love the quality of the Queensboro products that we order regularly. Trucker hats and polos. We recently got the tees too. We are very happy with their price point as well. The only improvement I can think of is the speed of shipment with shipping costs.  Even though takes a little longer (approx 2 weeks) it’s worth it for the quality and price!", "rating": 4}, {"title": "Could not be happier with order.", "text": "Date of experience: July 15, 2021", "rating": 4}, {"title": "Hats were done as requested", "text": "Hats were done as requested! Thank you", "rating": 4}, {"title": "Technicalities", "text": "I realize that there is a technical reason for the only direct print shirts to be so thick, but I would have really preferred a thinner shirt. Hopefully that process can be revised in the future.", "rating": 4}, {"title": "Everything went smooth just thought I…", "text": "Everything went smooth just thought I could offer promotional items as well in the online store.", "rating": 4}, {"title": "We’ll be back to order more.", "text": "It took a few try’s to get it right, but you guys nailed it.  We’ll for sure be back for more products.", "rating": 4}, {"title": "The order was great and came really…", "text": "The order was great and came really fast.  However when I ordered a bunch of colors the name of my company showed up all different which I wanted because come shirt color were light and many dark.  They all came in the same color and not like my first order.   I expected the name of my company to be lighter on the dark color shirts and darker on my light color shirts.  Other then that it I am still happy with the product.", "rating": 4}, {"title": "Love all I have received", "text": "Love all I have received.  I stupidly made a mistake when ordering sizes.  thought hit medium and large and accidently hit large and xtra large. but that was my error and sadly it cost me.", "rating": 4}, {"title": "I received four polo shirts with the…", "text": "I received four polo shirts with the logos embroidered. I was extremely please with the quality of the shirts! The service was quick and the delivery of the products was excellent! I will be making a order again soon!", "rating": 4}, {"title": "Prompt and professional!", "text": "It was a mishap on one of my shirts, I informed and they immediately fixed the problem and shipped me out another shirt. Prompt and professional!", "rating": 4}, {"title": "Great communication and customer…", "text": "Great communication and customer satisfaction orientation", "rating": 4}, {"title": "Top Notch Service and Amazing…", "text": "Top Notch Service and Amazing workmanship and shirt material. 4 Stars instead of 5 because I wish there was a way to add additional lettering, such as a Motto, to the design if it is not already apart of the logo file.", "rating": 4}, {"title": "Logo got swapped", "text": "This was my second order with Queensboro. It was for a different client than my first order. Oddly, the website applied the logo from my first order on the products for this one. I know I selected the right logo because it was a new upload. It was corrected as soon as I notified customer service about the error and everything was produced as intended.", "rating": 4}, {"title": "As ordered", "text": "Delivered as ordered", "rating": 4}, {"title": "Good Customer Service - A Few Hiccups", "text": "The initial order (embroidered hats) was about a week later than the schedule they texted, and there was some confusion — but they were quite responsive. Unfortunately the initial order used the wrong color thread in part of the logo (didn’t match the proof). However they did make it right immediately and the second batch was perfect and delivered quickly.", "rating": 4}, {"title": "I have used you all for a number of…", "text": "I have used you all for a number of different items. You go out of your way to make it right hands down. I have a slight criticism / suggestion. The last item I ordered was a drink bottle with my logo on it. I asked for suggestions on what color the printed logo would look best on a red bottle. I didn't get a response other then to go through and pick something that might look good. It looked okay but still not what I wanted 100%. All I am saying is tell me what color my logo will look best on a red bottle. That's all.", "rating": 4}, {"title": "Great product", "text": "Great product, fast, and looks awesome. Only wish the embroidery on the aprons could have been made bigger.", "rating": 4}, {"title": "The quality of the product and…", "text": "The quality of the product and embroidery is awesome but it took almost 2 weeks before my order shipped. I’d order again but not if I’m in a rush", "rating": 4}, {"title": "Product quality is excellent", "text": "Product quality is excellent. Customer Service Response is excellent. Pricing is good. Options are good.Opening up the store procedures has been a little bit different from overall experiences.", "rating": 4}, {"title": "Thank you for replacing the shirts that…", "text": "Thank you for replacing the shirts that were too small.", "rating": 4}, {"title": "I would have liked that the seal would…", "text": "I would have liked that the seal would have been a little larger. When I place the next order we need to increase size of seal.Thanks", "rating": 4}, {"title": "95% the same to the original logo", "text": "95% the same to the original logo. I understand it is difficult to match an embroidered design. Looks great to me, thanks for amazing job.", "rating": 4}, {"title": "Preference", "text": "Time for items to be ready and shipped. Too long. Should have options as for shipment type.", "rating": 4}, {"title": "Looks good", "text": "Looks good, feels good, fits perfect", "rating": 4}, {"title": "Nice hat", "text": "Nice hat. Good people to work with. Will use again", "rating": 4}, {"title": "All Purpose Performance Polo", "text": "I am very satisfied with the price, colors and style.  My only complaint is the material can easily snag, which causes the threading to unravel on the shirts.Great customer service with follow ups on status and delivery.", "rating": 4}, {"title": "You will be happy with this company", "text": "Easy to order from a little quirky online, but quickly remedied. Received order very nice, very happy. Will definitely order company outer wear again, looking at accessories now", "rating": 4}, {"title": "I HAD A PROBLEM WITH ONE COLOR", "text": "I HAD A PROBLEM WITH ONE COLOR ITEM WAS REPLACED IN A TIMELY FASHION. THANK YOU", "rating": 4}, {"title": "4 stars that turned into 5+", "text": "The only reason I didn’t give 5 stars is because my original order was not made quite right. The logo was not positioned perfectly on the hats. That being said, I am extremely satisfied with how my complaint was handled. Queensboro did an outstanding job of responding to me immediately and made me another 10 hats done to my satisfaction at no charge. I am very happy with the superb customer service I received and will recommend them to anyone I know that is looking for the products Queensboro sells. Thanks", "rating": 4}, {"title": "I ordered seven shirts with my business…", "text": "I ordered seven shirts with my business logo. I loved the color and the material of the shirts. I would have given a five rating if four of the seven shirts had not needed to be reembroidered. The customer service and reproduction was efficient. The end product was fabulous!", "rating": 4}, {"title": "It took very long time to get it right", "text": "Date of experience: April 12, 2021", "rating": 4}, {"title": "Thanks for ypur work", "text": "Date of experience: April 11, 2021", "rating": 4}, {"title": "The quality is amazing but.", "text": "The quality is amazing but their website makes it hard to order . I'm a computer science major and i know about computers , it took me a whole two days to be able and place the order , the logo will not work ..everytime i will try to add the logo to the shirt it will come up as empty and I had to redo the whole process all over , trying to see if the logo i wanted on the polo will com up .  4 starts do to this matter , otherwise i would give 5 stars .", "rating": 4}, {"title": "Great products and prices", "text": "Date of experience: April 08, 2021", "rating": 4}, {"title": "Customer Service Above All else.", "text": "We had to move a logo from the sleeve to the back of the shirt because, in an oversight, it would not fit. The first shipment, there was vast irregularity in the placement and straightness of the logo on the back of the shirt. Queensboro immediately redid the shirts and the replacement order was fine. This whole experience might have been stressful and frustrating; however, Anthony Palmer was an excellent customer service representative and made sure we got everything that we needed.", "rating": 4}, {"title": "Water bottles are great", "text": "Water bottles are perfect size for golfing, hiking any sports activity, look great", "rating": 4}, {"title": "Great Service", "text": "Quick, easy, good products, great work and exceptional service!  I couldn't ask for anything more.", "rating": 4}, {"title": "Thank you", "text": "Thank you.  Great products.", "rating": 4}, {"title": "Great customer service.", "text": "Date of experience: March 15, 2021", "rating": 4}, {"title": "Took one star off because of the delay…", "text": "Took one star off because of the delay in shipping and part of the order arriving in a separate shipment.", "rating": 4}, {"title": "I have used them several times", "text": "I have used them several times, their quality is the best and I still use their service.", "rating": 4}, {"title": "The only reason for the 4 stars is…", "text": "The only reason for the 4 stars is because the package arrived 3 days later than it was supposed to. Otherwise, the order was perfect and just as I expected for it to be.", "rating": 4}, {"title": "Everything that I have order has been…", "text": "Everything that I have order has been up to point", "rating": 4}, {"title": "took a little long but was way worth it", "text": "Date of experience: February 14, 2021", "rating": 4}, {"title": "I love the product", "text": "I love the product. I feel like I am ready to go represent my company to the fullest extent. The only reason I did not give 5 stars is because my logo had to be altered.  It wasn't exactly the same.", "rating": 4}, {"title": "The shirts that I purchased were…", "text": "The shirts that I purchased were exceptional quality. I'm definitely going to get more in the future.", "rating": 4}, {"title": "My order came out extremely the way I…", "text": "My order came out extremely the way I expected. Thank you and I will be using Queensboro going forward.", "rating": 4}, {"title": "Queensboro always stands by it's…", "text": "Queensboro always stands by it's product.  When this order came in unacceptably done they replaced it.  When it again came in incorrectly done they replaced it once more.  The last time it was perfect.Customer service is outstanding.", "rating": 4}, {"title": "Wonderful designed", "text": "Wonderful designed Thank you for the great job well done", "rating": 4}, {"title": "Very professional staff", "text": "Very professional staff, willing to address any issues. Great product line, really happy doing business with Queensboro.", "rating": 4}, {"title": "Overall good experience", "text": "This time I kept having issues with the website trying to select colors for the logo. Other than that it was easy.", "rating": 4}, {"title": "I appreciate that I can purchase great quality", "text": "I appreciate that I can purchase great quality branded apparel with the least amount of money", "rating": 4}, {"title": "Nice caps", "text": "Nice caps. Some of the stitch work in the embordered logo lacked the detail we were hoping for. But all in all, a nice product at a fair price.", "rating": 4}, {"title": "Greensboro is always treated me great I…", "text": "Greensboro is always treated me great I just wish it was a little faster and the reason I liked it was because there was no minimums but now you got to have a minimum of $65 for you to ship it", "rating": 4}, {"title": "Shirts look good", "text": "Thank you for replacing the shirts. Sizes all ran small and seller immediately replaced for free. Shirts are good quality and colors are true to pictures.", "rating": 4}, {"title": "Got two orders wrong but pulled through…", "text": "Got two orders wrong but pulled through in professional manner and did a great job 👏", "rating": 4}, {"title": "The shirts look great!", "text": "The shirts look great!! The logo is big enough to be noticed. The shirts feel like they’re comfortable. But have not been worn yet. I’m hoping they good with sweat.", "rating": 4}, {"title": "QB changed the colors on my logo…", "text": "QB changed the colors on my logo without checking with me. The hats looked bad. They did redo the order with MY logo and the hats look great. Customer service was good to work with and it was a fairly quick solution.", "rating": 4}, {"title": "While there was a hiccup in trying to…", "text": "While there was a hiccup in trying to get the order placed, customer service was responsive and the situations were dealt with in a timely and efficient manner. Quality of the product and embroidery was excellent. Look forward to working with them in the future.", "rating": 4}, {"title": "Good quality", "text": "Date of experience: January 13, 2021", "rating": 4}, {"title": "Great products only negative is almost…", "text": "Great products only negative is almost a month to receive orders", "rating": 4}, {"title": "Product quality was great", "text": "Product quality was great! Minor color mismatch With original logo. Overall satisfied.", "rating": 4}, {"title": "I have purchased many different items…", "text": "I have purchased many different items over the years from Queensboro and they are the most customer friendly experience.  I like that I can order small lots of several different items.  Overall the quality and price are as good as can be found.  Shipping is usually very quick.", "rating": 4}, {"title": "I have been ordering from this company…", "text": "I have been ordering from this company for a while now. Never been disappointed. Great customer service.", "rating": 4}, {"title": "Great quality", "text": "Date of experience: January 01, 2021", "rating": 4}, {"title": "Your designer fashioned a logo from my…", "text": "Your designer fashioned a logo from my rough sketch. The finished work truly superb. Your customer service people attentive. Thank you.", "rating": 4}, {"title": "Quality Experience", "text": "A very professional service with quick delivery and quality hats. The embroidery work on my hats is very well done.", "rating": 4}, {"title": "Review", "text": "My package was delivered to the wrong house. Luckily the family who loves there was kind enough to deliver the package to the rental office. Otherwise I wouldn’t have received it. After going through the stress of hunting down my package. My items were perfect! Wondering if you make the logos bigger.", "rating": 4}, {"title": "Quality and timely delivery", "text": "Date of experience: December 12, 2020", "rating": 4}, {"title": "Everything was great.", "text": "Everything was great.. shipping was a while but other than that I’ll be ordering again for sure", "rating": 4}, {"title": "Took longer to get here than my first…", "text": "Took longer to get here than my first order.   Was disappointed in production and shipping time.  Product is great, love it!", "rating": 4}, {"title": "Satisfied", "text": "Wished I could receive order faster. But overall FANTASTIC!!", "rating": 4}, {"title": "Had a great online experience and items…", "text": "Had a great online experience and items were received promptly.", "rating": 4}, {"title": "I would have liked to have seen a…", "text": "I would have liked to have seen a disclaimer on the website stating that an embroidered gradient color change is not recommended.", "rating": 4}, {"title": "anxiously awaiting my other items.", "text": "anxiously awaiting my other items.. But very satisfied with what I received so far.", "rating": 4}, {"title": "Headline", "text": "I hate your review methodology. Last time you'll get my feedback", "rating": 4}, {"title": "Took a while but we like the shirts", "text": "We had to change the logo a bit at the beginning, but once it was corrected and approved, the order still took a bit longer than expected to receive. The shirts seem well made though, and the printing is nice. We will be ordering more.", "rating": 4}, {"title": "There was a small issue on the first…", "text": "There was a small issue on the first proof as far as the thread color but after that everything ran smoothly. My order was shipped and received by my client quickly and he was very pleased.", "rating": 4}, {"title": "Overall good, but not perfect.", "text": "Overall, pretty good.  Asked for dark brown embroidery thread color, received a medium copper color.  Not bad but not perfect.  Great price on the promo however, so I'm going to keep the ball caps.  Thanks!", "rating": 4}, {"title": "We like to purchase from Queensboro but…", "text": "We like to purchase from Queensboro but there were too many delays with this small order which was the difference between four and five stars. The quality of the items was fine and we hope this was an isolated experience.", "rating": 4}, {"title": "Great services", "text": "Great services, satisfactory work", "rating": 4}, {"title": "great experience", "text": "Date of experience: November 16, 2020", "rating": 4}, {"title": "My only complaint is about the fact…", "text": "My only complaint is about the fact that the size M is bigger than standard size M.", "rating": 4}, {"title": "Great service", "text": "Great service. Great product. Met my expectations!", "rating": 4}, {"title": "It was fairly easy to navigate through…", "text": "It was fairly easy to navigate through the website. I opted-in for text messages; and I was notified every step of the way. I was able to see previews of what my logo was going to look like. My logo was embroidered and the prices were reasonable. I ordered 6 shirts and a light jacket. I was very pleased with my entire order! And I will be ordering from Queensboro’s again!!", "rating": 4}, {"title": "Great product, communication could be improved", "text": "Totally thrilled with the quality of the product, but was less than thrilled at the communication to tell me an item was out of stock and therefore my whole order was delayed. Didn’t find that out until I called three weeks after placing my order to get an update because I hadn’t heard anything.", "rating": 4}, {"title": "Blissful Car Care", "text": "Would like to have seen a full size proof. But very well done.", "rating": 4}, {"title": "Some blims on the hat bills", "text": "Date of experience: November 03, 2020", "rating": 4}, {"title": "Letters were a little crooked but all…", "text": "Letters were a little crooked but all in all good. Will order more but hope we can fix the lettering", "rating": 4}, {"title": "Customer Rep Craig was patient with…", "text": "Customer Rep Craig was patient with efforts to reach to the best art work. I am happy with all finals.", "rating": 4}, {"title": "Very happy with the product we…", "text": "Very happy with the product we received. Excellent customer service ensuring we received exactly what we wanted. We plan to order more promotional/branded products for our small business going forward", "rating": 4}, {"title": "Your costumers' rep namely Craigh has…", "text": "Your costumers' rep namely Craigh has been very cooperative , patiently helpful to get art works done satisfactorily.", "rating": 4}, {"title": "Great Overall Service & Product", "text": "The website is very easy to navigate, but had minor trouble uploading my logos. Customer service helped me upload, and it was smooth sailing from there. The edit/review process was simple. My logo turned out great; embroidery detail/work is excellent. The quality on the performance polo is high, though they were a little thin for my personal preference (but would be perfect for my employees). Sizes are true to fit.  I’ll definitely be a long time customer.", "rating": 4}, {"title": "Great aand timely service", "text": "Great aand timely service. I didn't realize that I was also signing up for twice daily e mail advertisements", "rating": 4}, {"title": "The guarantee is legit and the embroidery is better than my local place!", "text": "Their guarantee is legit! I placed my first order and the logo was not exactly correct, so they stopped the order in mid-process and got the logo correct and issued a re-order. When the shirts arrived, they were a little small based on the fit chart, so they immediately corrected the order and started another replacement order. The order finally arrived and I was very happy with the quality of embroidery, but not quite sure how long the shirt will hold up so only time will tell (hence the reason for only 4 stars). I am already looking to see what our next order will be from Queensboro!", "rating": 4}, {"title": "Website is fairly straight forward", "text": "Website is fairly straight forward. The download of a new logo went smoothly and embroidery was perfect. When I had a question regarding my order, even though I could talk to someone on the phone, the chat function was helpful.", "rating": 4}, {"title": "great stuff", "text": "great stuff always", "rating": 4}, {"title": "Merchandise and workmanship was…", "text": "Merchandise and workmanship was excellent. Communication and shipping were lacking. Customer service is outstanding.", "rating": 4}, {"title": "great service but really slow on the…", "text": "great service but really slow on the turn around time.", "rating": 4}, {"title": "Great quality work", "text": "Great quality work, fast delivery.", "rating": 4}, {"title": "items as described and look great....", "text": "Date of experience: October 06, 2020", "rating": 4}, {"title": "I’ve been stocking up for the past…", "text": "I’ve been stocking up for the past coupla weeks I still have quite a few items to purchase but I’ve been very happy so far.", "rating": 4}, {"title": "Can't stand having black dress shirts…", "text": "Can't stand having black dress shirts with the inside of the collars are white. Horrible looking.", "rating": 4}, {"title": "Great service and my company logo was…", "text": "Great service and my company logo was kept in the system for over a year which made reordering additional company shirts a breeze.", "rating": 4}, {"title": "Everything was perfect", "text": "Everything was perfect. However I was not told when the production was going to start or lead time, therefore the order arrived late", "rating": 4}, {"title": "Everything I ordered arrived and looks…", "text": "Everything I ordered arrived and looks great.  My only complaint is that one item arrived in the incorrect size.  I addressed this with Queensboro and they are sending a replacement.  Quick resolution to a minor inconvenience.", "rating": 4}, {"title": "corporate order", "text": "Queensboro is my \"Go To\" for corporate praphanelia", "rating": 4}, {"title": "Was able to correct a system error for…", "text": "Was able to correct a system error for logo selection on my order. Order arrived in a timely fashion.Team is pleased with results.", "rating": 4}, {"title": "I recently ordered shirts for my…", "text": "I recently ordered shirts for my Science Department members. I was sent the design for approval which I liked. However, when I received the order, I was really disappointed in how the final product can out. I emailed Queensboro and got a reply from Allen. He assisted me in creating a new design that would give me a product closer to what I had in mind. We went through the approval process again and the new order was shipped in a very timely manner at no additional cost to me! The new shirts look great! Thanks Queensboro!", "rating": 4}, {"title": "The polos are nice", "text": "The polos are nice, but the material is very thin.  In the past the material was higher quality.", "rating": 4}, {"title": "Warp Speed!!!", "text": "I need to make certain the shirts have \"Side Vents\" next time...other than that, \"Warp Speed\" service and shipping.", "rating": 4}, {"title": "Products were excellent but…", "text": "Products were excellent but disappointed on time it took to deliver.", "rating": 4}, {"title": "We received our order in less time than…", "text": "We received our order in less time than expected !!  Quality of the shirts are great !!  The presentation of the embroidered logo is Fantastic !!  The \"sizing\" just seems a little bit \"smaller\" on this order than on our last.  The only major comment we'd like to make is, the pocket (left chest) are very small - as we cannot even get a regular (or any size) pen to fit in them.  Overall - great shirt, crisp & bright in appearance.  We appreciate the speed in which we received our order !!", "rating": 4}, {"title": "great shirts and a great price", "text": "Date of experience: August 17, 2020", "rating": 4}, {"title": "They work great", "text": "They work great! Although it took a longer time than expected and could have been just a bit better, threads and backing trimmed... Love you guys and they are always the best way to go, thank you!", "rating": 4}, {"title": "Looking Professional", "text": "As always, I'm so excited to see what my products will REALLY look like when they get here. and today we had big SMILES. Thanks Queensboro, for helping us have our business looks so \"SHARP\" and professional.Juanita @ EurWay Tours & Jason H. @Wayward Walls", "rating": 4}, {"title": "Shipping was delayed substantially", "text": "Shipping was delayed substantially - not sure if due to Covid but it was a reorder of previously used Logo so thought that would be an easy order to fill.", "rating": 4}, {"title": "The product is perfect", "text": "The product is perfect. Shipping was horrible. I'm sure it was due to COVID 19.", "rating": 4}, {"title": "I have always gotten my purchased items…", "text": "I have always gotten my purchased items without any issues, I will consider this case as a one time deal due to the covid-19  pandemic. I will be ordering from you again. Thank you.", "rating": 4}, {"title": "Great products and prices, super slow production & shipping", "text": "Even pre-pandemic, the time it takes to receive my orders is the reason I don’t give 5 stars. Overall, I  am satisfied...but, I need the orders quicker than they are able to fulfill them. In this case, I ordered on 6/22 & was given an estimated ship date of 7/10. On 7/14, I inquired abt the order & was told on 7/15 that my order would be moved to the production queue to be fulfilled by the end of the week. The order shipped on 7/22 and arrived on 7/24, after a delay by the delivery company.", "rating": 4}, {"title": "Good product", "text": "Good product, good price", "rating": 4}, {"title": "Great quality and price on the polo…", "text": "Great quality and price on the polo t-shirt! Wish the order did not take so long, almost a month from the time of purchase.", "rating": 4}, {"title": "ordering is somewhat confusing with…", "text": "ordering is somewhat confusing with regards to placement of secondary logos as well as finding which items are actually on special when linking through email announcements", "rating": 4}, {"title": "Once again Queensboro made a mistake", "text": "Once again Queensboro made a mistake, but got it fixed.  Thank you.", "rating": 4}, {"title": "Suggest adding a text alert", "text": "Received email  job in production   Next email  was your order perfect?   Didn’t realize it was done   Suggest email  job is done  maybe picked up at xyz location      Or scheduled to arrive by x date     Thanks", "rating": 4}, {"title": "Good product and what was expected", "text": "Date of experience: July 13, 2020", "rating": 4}, {"title": "It took a while for the items to be…", "text": "It took a while for the items to be delivered", "rating": 4}, {"title": "Love the polo shirts!!", "text": "Date of experience: July 06, 2020", "rating": 4}, {"title": "Only 1 mistake in the size of 1 polo", "text": "Only 1 mistake in the size of 1 polo. That's the only reason I did not give 5 stars.", "rating": 4}, {"title": "Products are all great", "text": "Products are all great. However, purchase price of individual items is high and shipping costs are prohibitive of my employees from using the store.We wait for the sale and buy as a group.", "rating": 4}, {"title": "Quality is better than cost", "text": "Quality is better than cost. Mistakes were made right. Service is great.", "rating": 4}, {"title": "Quality and order was great. Delivery timeframe lacking", "text": "Quality and order was great. My only complaint is it took 3 weeks for order (payment) until I received my order. 3 weeks is a very big hang up and I will keep that in mind when I need to reorder in the future and will consider shopping around to other reputable embroidered operations and look into their delivery timeframe.", "rating": 4}, {"title": "Great experience with Queensboro, they try harder than most other sites!", "text": "Great experience with Queensboro.  However, their website needs improvements.  It is too hard to correctly create, and confirm to be correct, the exact items needed.  I.e. the product design that includes you provided logo.  It needs a smarter interface.  My average intelligence apparently is not good enough to correctly work through the needed steps to easily accomplish the order.   I also think that processing time for a new order is unnecessarily long.  Find a way to cut a week out somehow to make the turnaround time less.  Using technology, more people, fulfilling your existing backlogs, or whatever else you need.", "rating": 4}, {"title": "I was vary pleased with shirts and…", "text": "I was vary pleased with shirts and proses to order them. Very easy.", "rating": 4}, {"title": "My order had a mistake on colors but…", "text": "My order had a mistake on colors but Queensboro fix it at no extra cost, I will be ordering more stuff soon.", "rating": 4}, {"title": "Items in order were just as we ordered", "text": "Items in order were just as we ordered! We are very satisfied with the end result. The only thing we wished was that we would have received the items in a faster turnaround but all businesses are being affected in some way by this pandemic.", "rating": 4}, {"title": "Called several times and did the chat…", "text": "Called several times and did the chat to make sure order was going to arrive on time since we had a function planned and had to have the items. I was assured several times that it was not going to be an issue. They finally arrived a week late.", "rating": 4}, {"title": "The experience I had all around was…", "text": "The experience I had all around was with people who seemed committed to provide quality merchandise to the satisfaction of the client.", "rating": 4}, {"title": "Though delayed due to the virus", "text": "Though delayed due to the virus, my order looked great and the package came JIT.", "rating": 4}, {"title": "Great products", "text": "Great products, but the time it takes can be improved.", "rating": 4}, {"title": "Great overall experience!", "text": "Everything perfect! Timing could be improved though.", "rating": 4}, {"title": "Other than delayed shipping (probably…", "text": "Other than delayed shipping (probably Covid-19), the orders was made as specified. Decent material and good quality. Will order with them again.", "rating": 4}, {"title": "Entire process was easy.", "text": "Date of experience: June 09, 2020", "rating": 4}, {"title": "Great Customer Service!", "text": "I have used their services a few times and have been pleased with the quality and service.  Even when there was a dissatisfaction with color of the shirts, the company worked to resolve it quickly and send me new shirts.  Very much appreciated.  The only issue I recently had was I washed the polo shirt and it really shrunk, but maybe that was my fault.  Thank you for your services.", "rating": 4}, {"title": "Great company, great work. Great price", "text": "I would have liked to see a true mock up on the website then I would not have asked for a proof. But everything came out amazing and I was able to make my dream company into a true thing.", "rating": 4}, {"title": "Just that I placed my order one month…", "text": "Just that I placed my order one month too soon. Now the items are less! Maybe next order I can catch the sale. Y'all do quality work!Robert", "rating": 4}, {"title": "It took a lot longer than expected to…", "text": "It took a lot longer than expected to receive the order, but I guess that was due to COVID 19. Otherwise, everything was great.", "rating": 4}, {"title": "The logo looks good.", "text": "The logo looks good but the clothing were different then I thought.", "rating": 4}, {"title": "Beautifully done", "text": "Beautifully done. However, I will probably make the logo at least a quarter inch larger on next order. This company is great!", "rating": 4}, {"title": "While it took me a loooong time to…", "text": "While it took me a loooong time to finalize my order, that was my total lack of familiarity with the site, compounded by my difficulties with bringing up our logos and coming up with different color combinations than had been our standard order previously.  I was only able to get thru the process with giving up because of the great customer service person I was able to speak with on chat who saved the order.  Thank you.  I expect to be back on shortly, knowing I can get terrific assistance when needed.", "rating": 4}, {"title": "The order was very easy to place and…", "text": "The order was very easy to place and delivery was ahead of schedule.", "rating": 4}, {"title": "ALWAYS AWESOME", "text": "Always great products and quality is top notch!", "rating": 4}, {"title": "Been a customer for close to 18 years", "text": "I have been a customer for close to 18 years. I have never had anything but good experiences from Queensboro!", "rating": 4}, {"title": "The high end prices definitely match…", "text": "The high end prices definitely match they products they sell. Would purchase from them again, always trendy and up to dat.", "rating": 4}, {"title": "My offer was delayed for a week but…", "text": "My offer was delayed for a week but over all GREAT Job and Customer service Out standing as Always, Very Happy !", "rating": 4}, {"title": "Items purchased ere wonderful- Fit", "text": "Items purchased ere wonderful- Fit, colors and logo were all fine. Only question I have is that each item was charged $9.95 for shipping, 3 items cost $29.85 for shipping. Seams a bit much. Is this the standard method of pricing for shipping- unless a purchase is made on sale items that include free shipping?", "rating": 4}, {"title": "Great service", "text": "Great service, fast turn around, and the shirts we order was made with quality material", "rating": 4}, {"title": "Great prices", "text": "Great prices. I've had multiple orders, the last order one shirt the stiching was not centered on the left side, had a free replacement at the door with couple weeks. Customer service is great, will continue to do business with.", "rating": 4}, {"title": "Fast Service", "text": "Fast service. I really like this company I just find selecting the correct sizes difficult. The shirts I ordered are super Boxee even though I selected the women’s style- I would have liked them tapered (like pictured)", "rating": 4}, {"title": "There was a problem with my original…", "text": "There was a problem with my original order, but they were extremely quick to resolve the issue. Prices are good, so I’ll order again.", "rating": 4}, {"title": "Everything was great.....one may find…", "text": "Everything was great.....one may find it slightly confusing when you change your logo colors when selecting different colored shirts.  Otherwise it is very seamless process with great customer service.", "rating": 4}, {"title": "Great work", "text": "Great work on every item.", "rating": 4}, {"title": "T Shirt and Polos are good quality", "text": "T Shirt and Polos are good quality. Logo embroidery excellent. Ordered on new customer discount and will definitely re-order more shirts for our office.", "rating": 4}, {"title": "Most products have been excellent", "text": "Most products have been excellent. I did order embroidered Gildan zip-up sweatshirts, and the zippers didn't hold up - which was disappointing (teeth actually fell off). Overall decent garment quality and well-done embroidery.", "rating": 4}, {"title": "I was little disappointed this order", "text": "I was little disappointed this order. The shirt's were not placed into individual wrappings as was in  my first order. They were more or less just tossed into the box.  This was a little up setting as I had raved to my fellow club members about how professional or initial order was sent.  I was considering ordering other shirts for the other club I belong to. Hope they are handled more like my first order.  Greg", "rating": 4}, {"title": "Everything was great", "text": "Everything was great, just wish the shipping was faster.", "rating": 4}, {"title": "Quick, Cheap & Fast", "text": "Ordered with a great deal and got prompt service. They gave me a quick turnaround date and got my stuff to me before even that. I like these guys because you don’t have to order 50 million items. You can just order one or a few. And they’ve got deals for days. Check em out.", "rating": 4}, {"title": "Well done", "text": "The shirts fit perfectly. I will definitely order again", "rating": 4}, {"title": "Great customer service every time I…", "text": "Great customer service every time I call. Excellent product and response to mistakes.", "rating": 4}, {"title": "always do  a great job", "text": "Date of experience: February 15, 2020", "rating": 4}, {"title": "Everything I've ordered from Queensboro…", "text": "Everything I've ordered from Queensboro has been great. It takes a minute for items to ship, but the quality is way better than expected.", "rating": 4}, {"title": "Look no further", "text": "Great company, great prices exceptional product Something that's hard to find in today's society is a company that stands by its word and I believe that this company does exactly that. I highly recommend. And there is no doubt in my mind the next time I'm looking for any embroidery or  screen printing products,This is the company that I will choose and I will also recommend them to others.", "rating": 4}, {"title": "New Queensboro customer", "text": "The people at Queensboro were very helpful, their work is of excellent quality, and their prices (especially when items are on sale) are good.", "rating": 4}, {"title": "Nice hats and good embroidery", "text": "The hats are just as described and came out exactly like I ordered. The overall time was a little long, but not too bad. Overall, I am happy with them, I only wish they could have been lower on the hat. We did the front-right panel and the logo comes out above the sweat band, I was really hoping for closer to the seam, but I understand that it's a limitation of the machines.", "rating": 4}, {"title": "Will certainly order again", "text": "Date of experience: February 04, 2020", "rating": 4}, {"title": "little mix up", "text": "little mix up, but great other wise", "rating": 4}, {"title": "Good price for the products", "text": "Good price for the products, very easy to order. Quick service", "rating": 4}, {"title": "Good quality shirts and embroidering is…", "text": "Good quality shirts and embroidering is very good.", "rating": 4}, {"title": "I do miss being able to search for a…", "text": "I do miss being able to search for a certain product number up at the top of the web page.  But overall it's a pleasure ordering online and working with Queensboro staff/ customer service when needed.", "rating": 4}, {"title": "Smooth and professional process from …", "text": "Smooth and professional process from  ordering to shipping. Would have given 5 stars if short sleeved shirts had pockets and if we didnt have to email with shipment updates.  Would use again !", "rating": 4}, {"title": "shipping could have been quicker...", "text": "Date of experience: January 15, 2020", "rating": 4}, {"title": "Thank You Queensboro for Standing Behind Your Products!", "text": "This is my 4th order with Queensboro but I have to say, I am disappointed with the length of time it is taking to get my order.  I placed the order on December 2nd.  7 days later, I get an email asking me to confirm the order.  The expected delivery date was December 30th (4 weeks after the initial order date). On January 2nd, I call customer service to inquire about my order.  I was told there was some damage done and quality control requested a few items to be reproduced due to the threading not being up to standard.  I was also told they were waiting on a couple more items to be completed.  I understand with the holidays to be backed up, but my order just came in today and not only is it 9 days late, one of my orders is missing! 5 weeks for an order is simply too long for my business to wait for products and items are missing.I am undecided if I will order again due to the time it takes to get the products delivered, and also, the stitching is inconsistent in quality on this order.  I just downgraded my review to 1 star since items are missing even after I called to check on the delay.  Not good.***UPDATE***Customer service called to talk about my experience and made me feel a lot better about Queensboro.  Not only do they stand behind their products, but they also assured me the entire order will be replaced no questions asked.  They made no excuses and explained how things like this can happen. As a business owner, I have made mistakes and I own up to them.  This isn't my first order with them and have been satisfied every time up until this experience. After speaking with Erik, he told me what steps they are taking to speed up production time. Thanks, Erik for your phone call.  I will continue to be a customer!", "rating": 4}, {"title": "Really Happy with the service and…", "text": "Really Happy with the service and products Thank you very much", "rating": 4}, {"title": "thumbs up;", "text": "excellent workmanship;the product was a hit with my clientsthank you", "rating": 4}, {"title": "Not able to speak with someone about…", "text": "Not able to speak with someone about the material of products. My last order the embroidering was excellant, the material of the shirt I did not know it was nylon, needed heavy cotton for winter riding, must be able to speak with someone on my orders, thanks", "rating": 4}, {"title": "Logo in the center of apron is small", "text": "Logo in the center of apron is small, you should keep logo size visible and big in the top center of the apron.", "rating": 4}, {"title": "After an initial mishap", "text": "After an initial mishap, my order was perfect.", "rating": 4}, {"title": "Good items", "text": "Good items, happy with order. Time from order to receipt is slower than optimum.", "rating": 4}, {"title": "The items look great", "text": "The items look great! Great service.", "rating": 4}, {"title": "Thank you for the replacement.", "text": "Thank you for the replacement. You should note on your site that your sweatshirts runs small.", "rating": 4}, {"title": "Shipping date was revised and late.", "text": "Shipping date was revised and late.Shirts looks good.", "rating": 4}, {"title": "Product is always great", "text": "Product is always great, but it took 1 month to get the order and that seems to long.", "rating": 4}, {"title": "Logo colors vs shirt colors", "text": "The only problem I have with Queensboro pertains to logo colors.  I mainly buy black shirts and I buy several, I can only choose 1 logo color pattern which makes all the shirts identical.  Would be nice to be able to mix up the logo colors.   Other than that, I buy all my work shirts at Queensboro.", "rating": 4}, {"title": "Great stuff", "text": "Great stuff.  Takes quite a while to get product though..", "rating": 4}, {"title": "I love everything we have ordered but…", "text": "I love everything we have ordered but the Port Authority brand runs small and I have to special order a size 3xl which is annoying. I know it is a plus size but it is a very common size. Everything else has been great!", "rating": 4}, {"title": "Thought the hats would have a support…", "text": "Thought the hats would have a support behind the logo.", "rating": 4}, {"title": "Thanks for the shirt replacement", "text": "Thanks for the shirt replacement. The upper size made a difference.", "rating": 4}, {"title": "I would have given 5 stars...but it…", "text": "I would have given 5 stars...but it took quite awhile to get my products..", "rating": 4}, {"title": "Great price, LONG wait time!", "text": "Great price on a quality shirt and embroidery. However, the production wait is WAY too long! If you don't hold your breath waiting, you'll love the final product.", "rating": 4}, {"title": "Good products", "text": "Good products, timely shipping.", "rating": 4}, {"title": "It would be 5 stars except for the long…", "text": "It would be 5 stars except for the long manufacturing time. Product quality was excellent. After purchase customer service was exceptional when I was not 100 percent happy with my first purchase.", "rating": 4}, {"title": "THANKS AGAIN FOR A GREAT PRODUCT AND…", "text": "THANKS AGAIN FOR A GREAT PRODUCT AND SERVICE", "rating": 4}, {"title": "Great quality and prices....a little…", "text": "Great quality and prices....a little delay in delivery on the last order.", "rating": 4}, {"title": "Package arrived a week later than…", "text": "Package arrived a week later than stated.", "rating": 4}]