[{"title": "Professional communication", "text": "Professional communication. They shipped on time but received with delayed but it's not the company fault. Trustworthy enough, you feel safe, to do business with especially online. Watch was boxed and wrapped safely. Will buy again if opportunity occurs. ", "rating": 4}, {"title": "chrono is a trusted source matching…", "text": "chrono is a trusted source matching buyers with sellers.  looking forward to completing 10 transactions without any issues.", "rating": 4}, {"title": "Seller was just great!", "text": "Seller was just great!!  Ongoing communications and strong attention to detail.  I would recommend and buy from again.DHL shipping out of Japan to USA was horrible (for the second time) lost paperwork, no weekend movement, erroneous FINES for their own problems, constant delays--I will specify not to use them in the future or no sale-- ", "rating": 4}, {"title": "The watch was delivered promptly and as…", "text": "The watch was delivered promptly and as described The issue with this watch was in need of service.The power reserve was not maintaining accuracy. When this is was presented to the seller, they requested a service quote, which I provided, which was $200 The seller offered only $50 for this service and I reluctantly agreed to avoid returning the watch  ", "rating": 4}, {"title": "Good experience ", "text": "Positive: good browsing and purchase process, the shipment arrived in time, the communication with the seller was good and prompt. The watch came perfectly bubble wrapped and carefully protected. Not so good: after purchasing the watch, I received communication of a discount due to the fact that the wristband couldn’t be shipped to my address. And after receiving the package I had to pay customs separately. ", "rating": 4}, {"title": "Watch sale went well", "text": "Watch sale went well. Always buy from people with many reviews. I don’t think I would pay the $250 to have the watch verified because Chrono24 will not tell you where or who certified it. I brought mine to a retailer of the watch brand and paid half ($125) and got it verified and appraised ", "rating": 4}, {"title": "Quick ship", "text": "Quick ship. Watch looks great. However, sale was to include original owner's manual but a non-relevant manual was included.", "rating": 4}, {"title": "Watch platform review", "text": "Overall is good as the Chrono24 CS contact me proactively and explain details for me ", "rating": 4}, {"title": "I love my watch", "text": "I love my watch, and the experience with the company was great. However, I have been asking numerous times to get the missing links to the watch because it’s definitely too tight and have not gotten and resolved.", "rating": 4}, {"title": "My issue with Chrono24…", "text": "Although my experience was very good, I wish chrono24 did a little more on its end to ensure that the watches being sold on their site are legitimate. The fact that I had to take my watch to get it authenticated, within the limited time I have to return, takes away from the buyers experience. Sites like EBay have established an authentication process which at least provides another layer in a very expensive market that is currently being flooded with hard to distinguish replicas. This does make me hesitant to purchase from chrono24 when it creates a platform for replica dealers to potentially flourish. This was my second purchase from Chrono24 and won’t be my last, but they could still add some protection rather than basically being a slightly better Facebook marketplace.", "rating": 4}, {"title": "The watch is everything I expected", "text": "The watch is everything I expected. Shipping was a bit slow, and could def be improved.", "rating": 4}, {"title": "Dear Chrono24 Team,", "text": "Dear Chrono24 Team,I hope this message finds you well. I recently completed a transaction on your platform and wanted to take a moment to share my thoughts about the experience.Overall, I found the process to be smooth and efficient. The platform was easy to navigate, and I appreciated the security measures in place to ensure a safe transaction. The seller I interacted with was responsive and professional, which made the entire process even more pleasant.Thank you for providing such a reliable platform for watch enthusiasts. I look forward to using Chrono24 for my future purchases and sales.Best regards,Huzaifa Nisar Khokhar", "rating": 4}, {"title": "Platform is very easy to shop with", "text": "Platform is very easy to shop with. One thing that I wasn’t expecting is that a potential purchase from outside the state had taxes added from Chromo24. I like that they also guarantee authenticity of the watches sold. ", "rating": 4}, {"title": "Chrono24 is an excellent site for watch…", "text": "Chrono24 is an excellent site for watch purchasing. There are a number of listings, so one can easily get a sense of a good price. Communication with sellers is usually easy and fast. Watch verification allows for more certainty in purchasing. Filtering searches by new/used, condition, seller protection & etc are useful. One area of improvement is in the payment function. It seems payments late in the day US time or on the weekends can take sometime to clear. Understandable, but better communication of expected wait would be helpful.   ", "rating": 4}, {"title": "Process was very smooth and timely", "text": "Process was very smooth and timely. Basic appearance was outstanding. Only issue was that the watch had issues with some of the extra functions which weren't identified. Thought the \"certification\" would have ID'ed these. Planned on sending for a complete service anyway.  Overall very pleased.", "rating": 4}, {"title": "The only On-Line Luxury Watch website you should visit !", "text": "I can get lost, looking on Chrono24.  I often peruse through the endless listings, even though I am not in the market.  I've bought 2 watches on this site, so far, and have no buyer's remorse. There are 2 or 3 other websites that are competitors, but Chrono24 is the best of them all.", "rating": 4}, {"title": "Chrono24 could improve search function", "text": "Chrono24 offers its users access to a phenomenal number of online watch sellers. The one I bought was from a guy in Egypt! The site's search function is probably the only weak link. Despite being able to filter for various specifics, the search always includes watches that should not be there. Aside from that it's a great site. ", "rating": 4}, {"title": "Clean and efficient Trusted Checkout…", "text": "Clean and efficient Trusted Checkout system. Communication with sellers works well. Chrono24 can be a little harder to reach but automated processes and online tools work well.It's important to read T&Cs carefully before making a purchase, especially from private sellers.", "rating": 4}, {"title": "Potential to be a 5 start site", "text": "It's a great website to find a certain type of watches and ensure you are safe to buy them. However prices can be often hefty. Customer support is not very attentive. I wish the website would have better features to manage your watch collection bought trough page and app.  ", "rating": 4}, {"title": "Everything goes well until", "text": "Everything goes well, until the payment. It's not a big deal but sellers should be more aware of how long the payment takes to be finalised, instead of asking the buyer \"have you paid yet\", \"we only have one\"! ", "rating": 4}, {"title": "Poor packing", "text": "Proces was clear and easy. Delivery tme was a bit long, but delivery was done sooner than promised. Delivery was done by express DHL service. Packing of watch box was poor and because of that during delivery the original box was damaged, the watch itself stay intacked.It was very polite letter with promise to solve the issue, but no real actions happen. ", "rating": 4}, {"title": "This is Fine", "text": "This is Fine. Everything went well until the customs experience. DHL was switching their systems and my package and my customs forms were not being associated. I spent almost a week to try and resolve this and at one point the package was going to be returned. It would have been nice if there was some sort of support from Chrono24 to ensure the delivery was hassle free.", "rating": 4}, {"title": "Very smooth experience", "text": "The watch was securely packaged and delivered in a timely manner.Box and papers plus extra links were included", "rating": 4}, {"title": "Reliable Supplier.", "text": "They were negotiable agreed on a price . And executed the delivery as agreed .In conclusion I would buy from this dealer again.", "rating": 4}, {"title": "Apart from UPS, everything was greatverall I felt the experience was…", "text": "Overall I felt the experience was great. Plenty of choices, well organized and easy to navigate and purchase.Where things fell down badly was the unfortunate choic of UPS for \"free shipping\". UPS is notorious for exagerrated charges for \"Customs Clearance\" when, in fact, there is none Other carriers do not pad this service. I regularly in, Canada, receive pkgs  from many countries- pay the taxes- with NO customs clearance nonsense. UPS charged me $59 for my free shipping.", "rating": 4}, {"title": "A reverso ", "text": "The watch offered for sale was excellent The people we purchased the piece from were truthful in the representation.I am happy with doing business with Chrono24.", "rating": 4}, {"title": "Ended up getting a great dal on a great…", "text": "Ended up getting a great dal on a great watch from a dealer called Renzu halfway across the world and it was so worth it.  They had incredible customer service which took away any concerns I might of had.", "rating": 4}, {"title": "Crono24 is good app to buy watch", "text": "Crono24 is good app to buy watch, please try to show price with custom duty. Its bit confusing regarding actual pricing of product.", "rating": 4}, {"title": "Smooth transaction; taxes not displayed up front", "text": "Overall a very smooth transaction, which I had high confidence in.  My only recommendation is to show all taxes/fees up front.  It wasn't until after \"purchasing\" a watch that it became clear that local and state sales tax would also be collected.  That can be a substantial amount which could cause someone to not want to proceed with a purchase.", "rating": 4}, {"title": "The product is great, but shipment had problems", "text": "The product is great, but shipment was delayed, perhaps not fault of vendor. Vendor was in Hong Kong, but product shipped from Italy and FedEx bounced shipment back and forth in Europe, and local FedEx agent not as good also.", "rating": 4}, {"title": "Chrono is helpful insofar as comparing…", "text": "Chrono is helpful insofar as comparing references, but they’re what Zillow is to the real estate market, i.e., offer instead of bid of bid/transaction price focused (net of commissions), which adds to the hype at best and, at worst, misleads consumers. It works for now, though, because it’s the best we’ve got and offers a trustworthy escrow service that mitigates much of the risk with buying and selling between strangers.", "rating": 4}, {"title": "I have manny good experiences with…", "text": "I have manny good experiences with Chrono. It is smooth, simple to use, safe and reliable!", "rating": 4}, {"title": "Experience could have used some polish but overall satisfied", "text": "Watch was mostly as described though no emphasis was placed on use of Arabic for day window. Significant delay between purchase and shipping date. Overall a satisfactory purchase and I would buy from seller again but I would ask more questions up front.", "rating": 4}, {"title": "I had to pick up the parcel by myself…", "text": "I had to pick up the parcel by myself from the destination deposit after a week from it's arrival. My delivery address was ignored, while they displayed on the package my home address and also incomplete. Not even my phone number wasn't displayed, so I was out to reach.  I had to download an app (cargus) in order to find out where my parcel lies. You have to pay attention to delivery!", "rating": 4}, {"title": "Quick and clean experience for a buyer", "text": "Quick and clean experience for a buyer, good interface for tracking your shipping. You can find everything you need fast - there are good filter options for your search, the prices are usually better than in shops and the site is trustworthy. If there is a problem, the help team is quick to reply but process can take some time since there is a lot of them involved on the same dispute, depending on the shifts they are working.", "rating": 4}, {"title": "It is the safest marketplace for buying…", "text": "It is the safest marketplace for buying and selling watches. The processes are very straight forward and the dealers are all legitimate with only authentic watches. The only downside for which I took away a star is the search filtering, which is finicky and might sometimes not show all results, among other things.", "rating": 4}, {"title": "I would rate this transaction a 4 star", "text": "I would rate this transaction a 4 star. I was offer a nice product at a fair price. However when a merchant lists an item for sale with “negotiable “ next to the price, it signifies the merchant’s willingness to negotiate. However, the merchant would not budge. So, why have negotiable included? It’s misleading and it’s false advertising on their part. Other than that, I’m pleased but most likely not to buy from them again. ", "rating": 4}, {"title": "Experience was great", "text": "Experience was great. Allow for easy specific search for product based on many filters. Pictures and info of product are very informative. Sellers are also dependable, altho a minor few was not that informative of their product. Overall, great website..  ", "rating": 4}, {"title": "Remember if Seller us using Bank Transfer ....", "text": "I think the process around buying a watch is good enough. But I realized that if a bank transfer to the buyer is what the seller is recommend, then it will be with a international bank transfer. In DK that costs around 30 Euro which is a high price. ", "rating": 4}, {"title": "Good experience but no Certification in some EU countries", "text": "I had few options to order my Omega SMP 300 from, and Chrono24 offered the best price.Giving 4* because when you order a Certified watch, Chrono24 doesn't provide this service if you are located in certain countries in the EU, and this is not mentioned anywhere and even took Chrono24 support couple of days to discover that.", "rating": 4}, {"title": "The Best Way to Buy A Watch in the Secondary Market", "text": "Chrono 24 has produced a trustworthy way to shop for a watch on the secondary market. The format for the watch description is top-notch, and their escrow system and return policy gives me confidence in buying through them. And their global reach means I can have access to hundreds of thousands of watches from sellers all over the world.", "rating": 4}, {"title": "Some oddities...", "text": "First, the seller rejected the \"offer\" that was the price of the watch that the seller himself declared on the site. It was strange why I had to send an offer when the price wasn't negotiable. After I was rejected, I explained this situation to the seller, and then he offered the same price that he rejected. I then bought the watch for that (initial) price.", "rating": 4}, {"title": "My experiences with chrono24 have been…", "text": "My experiences with chrono24 have been good overall. The customer service team, while not always being the most enthusiastic to help, do get the job done. You must be careful when buying on here to stick with dealers, as they guarantee authenticity, but only from dealers, not privet party sales. Would recommend.", "rating": 4}, {"title": "Good spot, could be better.", "text": "The market place is a good spot to shop for beautiful watches. The shipping needs to be better, if I return an item because it is not as described on the listing, it should not cost the person hundreds of dollars to do the return. The shipper should be responsible for returns of a certain nature without a doubt as it was dishonesty that caused the return.", "rating": 4}, {"title": "Great company, average courier", "text": "The company I bought my timepiece from was prompt, and the item arrived in great condition. I have no complaints about the company.The delivery service, however, left my new AUD$5000 watch at the front door without a signature, during work hours. This meant my new timepiece was left in a publicly accessible place and was at risk of theft for part of the day. I'm disappointed by the courier and would not recommend them for high value purchases.", "rating": 4}, {"title": "They work. But why so slow?", "text": "Chrono24 generally does their job, and is reliable and trustworthy. But their communication with customers is very, very, slow. Sometimes you have to way several days to get a meaningful response to even the simplest question. This can be very frustration if there are complications (and there often are, that's just the nature of this game).", "rating": 4}, {"title": "the message button is directly adjacent…", "text": "the message button is directly adjacent to the buy now button on the desktop site that was reported before and still not changed. this is very silly and bad website design. please change!on the app, i cant change the order or edit my favourites list. i also cant find all categories on the app. only watches but not parts, bracelets etc. please fix! thanks james ", "rating": 4}, {"title": "As a pensioner", "text": "As a pensioner, I looked for many investment platforms to occupy my pleasant time and benefit from some decent profits.Chronovalor gave me what I was looking for.The contact with the broker was the most important for me. I was in contact with brokers who knew how to explain and make me understand what this trading means and what risks I am taking, they give me assistance all the time when I need it and they taught me how to trade.I am satisfied with the gains obtained and I would not have thought that I could make such a profit in such a short time. Special thanks to Antonio Andeson for making me understand and enter this world.Thanks Antonio and I hope you help as many people as possible.", "rating": 4}, {"title": "Omega watch", "text": "4 stars for a very good website & the impressive number of luxury watches available. Ordering was relatively easy although had a hiccup paying for my watch as my credit card company flagged the transaction as suspicious & froze my credit card - had to phone them & get them to unfreeze my account & approve the purchase which took over an hour. Took one star off as the Chrono24 website states that the escrow payment wouldn't be released until after I'd checked to confirm the watch was as expected. I found that the payment had already been made before I'd had time to inspect the watch. ", "rating": 4}, {"title": "This was a good way to purchase and…", "text": "This was a good way to purchase and transact high value items.  Gives you confidence that monies wont change hands automatically without both parties being satisfied.", "rating": 4}, {"title": "It was Ok.", "text": "It was Ok.All was safe and clearly explained. The negotiation was faster. I just didn’t get to use my credit card. I tried more than once, and all times the Chrono24 site was saying my bank didn’t autorize the transaction, but in contact to bank, they didn’t have receive the request. I did they payment through wire transfer. ", "rating": 4}, {"title": "Unfortunately", "text": "Unfortunately, sellers from Ukraine do not have access to the service safe transaction, so the probability of selling goods more expensive than 1000$ is close to zero.There is also a problem: when bidding a few hours. After exhibiting the first, when trying to exhibit the following fields model and reference are already filled and have to go in incognito mode.", "rating": 4}, {"title": "The transaction was easy", "text": "The transaction was easy.  The receiving of the watch was another story.  It took almost 10 days to actually see the watch.  The people at Chrono were good once I actually got someone on the phone.  The actual seller was non responsive until the Chrono people reached out multiple times.  Watch is exactly what I was expecting.  I would do business again.  Think the seller was not on their game", "rating": 4}, {"title": "Great watch and better than photos suggested.", "text": "Great watch, better than the pictures suggested. Very poor experience with UPS but not the sellers fault. Seller provided good support in contacting UPS. Would recommend and purchase again from here. cheers", "rating": 4}, {"title": "Great service and still the best site…", "text": "Great service and still the best site for locating unique pieces. The search feature could use some work and I don't like that you're discouraged from negotiating on price. ", "rating": 4}, {"title": "Buying from Chrono24 was an easy…", "text": "Buying from Chrono24 was an easy process. I would like to see their try it on feature be more adjustable. The wire transfer could have been easier to use, so I  gave up. The biggest issue was the safety key feature, as the only card that uses it is Amex, and they add 2% for using it.", "rating": 4}, {"title": "Seems OK", "text": "The seller said there would be certificate of authenticity, instead I received a certificate of origin issue by the store itself. Other than that, everything is good. Feature wise, I wish the website has a feature to show custom tax in the page.", "rating": 4}, {"title": "The watch arrived as described", "text": "The watch arrived exactly as described. For safety sake it I took it too an Omega store and had it checked. It’s fine. Ordering it and receiving it took longer than anticipated however this transaction worked just fine. ", "rating": 4}, {"title": "Good first experience.", "text": "I had a pretty good first-time watch buying experience on Chrono 24!  I was looking for a very specific Panerai and found it in Singapore.  After some negotiations, we arrived at a price and the watch was purchased.  All went smooth except the correct Customs declarations forms were not completed by the shipper and I was not aware that I had to also furnish information.  This added about a week delay, and me having to work back and forth with FEDEX, but eventually I got the watch.  I was a little disappointed that the watch was not cleaned prior to sale, as the case and rubber strap were filthy.  Other than that, Chrono 24 kept me abreast of the status of the purchase the entire way through.  I will definitely buy from them again, but will likely keep it a domestic purchase!", "rating": 4}, {"title": "Fast delivery", "text": "Fast delivery. Watch appearance as it showed in the picture. Good document to clear custom", "rating": 4}, {"title": "Dealer was helpful communication was…", "text": "Dealer was helpful communication was great. But to ship to an address different than my home was problematic. I am working for several months out of state so I wanted delivery to my son’s house. Cumbersome process", "rating": 4}, {"title": "Overall a good experience", "text": "Overall a good experience. Bought a vintage watch from this seller.- it’s functional -as described (as per the photos etc) -delivery time was excellent My only complaint was the watch band it came with. Looked a little nicer in the photos.It’s cheap, and barely fits a small child. I’ve ordered a new one, so all good. Would definitely recommend the seller", "rating": 4}, {"title": "Nice to know you have a middle man when…", "text": "Nice to know you have a middle man when purchasing something sight unseen .watch arrived and was as expected . Alarm not working but it came with a warranty card so will get it serviced.", "rating": 4}, {"title": "Great platform for the most diverse…", "text": "Great platform for the most diverse sourcing of timepieces. Only issue is due to non-US based banking, wire transfers are more complex than if US financial institution", "rating": 4}, {"title": "Mostly good…", "text": "There are alot of dealers that really care and have great people and service, however there are also some not so good. There are far more good dealers then bad and it is pretty easy to tell who cares and likes watches vs people selling things.", "rating": 4}, {"title": "Chrono24 was supportive but actual…", "text": "Chrono24 was supportive but actual seller was a bit slow. Never the less -the ordered watch came after a little push from Chrono's side with no such a long delay.", "rating": 4}, {"title": "The order arrived promptly.", "text": "The order arrived promptly.Unfortunately, if I want to return the goods it is very difficult which is not good business dealings.", "rating": 4}, {"title": "Just read everything before it’s too…", "text": "Just read everything before it’s too late. First time is scarey trusting thousands to someone you don’t know very well but it all worked out as there are safeguards in place.", "rating": 4}, {"title": "Secure Transaction", "text": "First time purchase. For the watch I bought, the seller offered the best price compare to other platforms. Secure transaction, no hassle. Clear and detail communication from seller.", "rating": 4}, {"title": "First online watch purchase -- Positive experience.", "text": "It was my first watch purchase online. The seller shipped very quickly, pretty much immediately and communication was quick too. The platform made that possible, so I appreciate it. ", "rating": 4}, {"title": "Watch dealer Ok", "text": "Good watch dealer as per all the review and I am ok with that. The Watch is what I was expecting that was very nice. But not the strap!  In the Add, they did not show photos of the full length of the strap, so I was not able to see the difference in the color due probably of one side being under the Sun or Light for a long time. The result is that one side of my wrist is black and the other side gray. Also, I am in Canada and the Dealer is in Singapore, so I was not expected to have to pay the US tax on the watch that was over $500!  I guess it's my fault, I should have known better.", "rating": 4}, {"title": "it is a great platform for watch lover", "text": "it is a great platform for watch lover, where you can source and find your dream watch. I feel safe to buy watch here, i have purchase a few watch via this platform as i cannot source the one i like in local. however, it would be nicer if the  currency exchange rate could be lower.", "rating": 4}, {"title": "Other items/objects", "text": "To proceed with a purchase order is easy and the follow up from Chrono24 is professional. I was looking for a specific rubber bracelet and found it difficult to get the available listings in the searches. You had to enter rather specific details in order to get objects listed and you had to scroll through various search results as they were not connected to each other.", "rating": 4}, {"title": "Amazing Platform for all watch lovers…", "text": "Amazing Platform for all watch lovers to find whatever they wish. Maybe if they introduce discount rates and promotions for regular customers from their their platform it will be amazing ", "rating": 4}, {"title": "The biggest surprise to me was that I…", "text": "The biggest surprise to me was that I bought my clock from company with domain address ending .CA (Canada) but the clock came from Turkey and I was exposed to duties, taxes, brokerage fees etc.", "rating": 4}, {"title": "Very happy with watch", "text": "Very happy with watch. Will have to replace strap. As a 10 yo plastic strap it has cracks I wasn’t aware of from the listing. Plastic degrades over time. I wish IWC had more of a rubberized replacement that I could buy. They don’t. I’ll have to go aftermarket. ", "rating": 4}, {"title": "Great service", "text": "Great service, quick reply and security about payment. The only negative was that you can't pay in the agreed currency, but needs to pay in local currency and to a bad rate.", "rating": 4}, {"title": "I consider Chrono 24 reliable", "text": "I consider Chrono 24 reliable, and it is most important. It is also convenient, which also matters.Only thing ,what could be better, sometimes, are the photos of watches.", "rating": 4}, {"title": "They responded quite quickly when I…", "text": "They responded quite quickly when I asked them something, although they didn't fully answer everything I asked.", "rating": 4}, {"title": "Chrono was great", "text": "Chrono was great, the watch is pristine with a new box. I did have to pay $333 in customs, but it was still cheaper than buying from the US. I didn't like dealing with UPS, they wasted a week for my husband and me. They said it would be delivered \"tomorrow \", then it would be changed to \"tomorrow\" every day for 1 week. We tried not to leave the house because of this. Maybe use another carrier who can give a proper date of arrival. Thank you Chrono", "rating": 4}, {"title": "I’m very happy with my purchase", "text": "I’m very happy with my purchase. That being said I did go through a lot of people before I had one I thought I could trust. I think it would be better if the seller had to send the watch in for verification then chrono holds the watch and sends it to buyer. I think it would be easier to trust everyone that way. ", "rating": 4}, {"title": "Good transaction.", "text": "Overall, the experience was good. I emailed them about an issue with a seller and didn't get a reassuring answer. Fortunately, everything went well.", "rating": 4}, {"title": "Good but missing watch manual", "text": "Everything was shipped as expected. I think the process was pretty straightforward. I didnt receive the original manual with the watch. Wasn't expecting that to be missing", "rating": 4}, {"title": "Using a credit card proved to be very…", "text": "Using a credit card proved to be very difficult. Unreasonable automated verification system. Delayed completion of the transaction.", "rating": 4}, {"title": "Rolex 116238…", "text": "Shipping was fast and the watch is beautiful, however it is not keeping accurate time. Will take it to Rolex for servicing to see if that takes care of it. ", "rating": 4}, {"title": "I liked the number of choices available…", "text": "I liked the number of choices available and the fact that I felt safe dealing with the company.", "rating": 4}, {"title": "Very reasonable prices and a variety of…", "text": "Very reasonable prices and a variety of watches . Streamlined website with good support, makes buying with peace of mind easier.", "rating": 4}, {"title": "The communication from Chrono24 and the…", "text": "The communication from Chrono24 and the vender Miyaran was very good.   The delivery service using Fedex Express was extraordinary; the item arrived in 3 days.  The watch, a CITIZEN PROMASTER Marine BJ7111-86L, was mostly as expected -- brand new, with full boxing, tags, wrappings and after 2 weeks is functioning normally.  However, I was expecting an international warranty card; there was only a IPPO Japan card (no product instructions in English either) which plainly said, \"warranty is valid only in JAPAN\".  Very disappointed in that but as this watch is no longer carried on the manufacturers website (Citizen), a full warranty obviously could not be had.  The price was 25% lower than competitors and probably the warranty situation would not have been better with another dealer.  I now consider Miyaran to be a grey market and not an authorized dealer and am less likely to deal with them again.  I am less likely to use Chrono24 again either unless the item is just not available elsewhere.  Overall I'm satisfied and keeping fingers crossed the watch will be good for an extended time period.  ", "rating": 4}, {"title": "⭐⭐⭐⭐", "text": "Chrono24's fee is too much, but I am pleased with their service. I have purchased watches through them on several occasions.", "rating": 4}, {"title": "Good but not perfect.", "text": "My experience was very good… Except for one thing, the price of the watch, I purchased changed after I bought it. Not by a lot, but still, it cost more than I originally agreed to pay.", "rating": 4}, {"title": "Went well but no authentication", "text": "My experience went well. However i wish Chrono24 offered a 3rd party verification to make the buyers feel safer in their purchase.", "rating": 4}, {"title": "Good range", "text": "Good rangeA word of caution: the platform stings you with hidden and unavoidable FX fees when transacting with overseas sellers.", "rating": 4}, {"title": "Exceptional Experience - Trustworthy and Reliable!", "text": "I recently had the pleasure of purchasing a luxury watch through Chrono24, and I can confidently say that it was an exceptional experience from start to finish.Chrono24 provides an impressive platform with a vast selection of timepieces, making it easy to find exactly what I was looking for. The website is user-friendly, with detailed listings and high-quality images that allowed me to make an informed decision.What truly stood out to me was the level of security and transparency throughout the entire transaction. The Trusted Checkout service gave me peace of mind, knowing that my payment was secure and held in escrow until I confirmed the watch’s condition. The communication with the seller was seamless, and I appreciated the regular updates from Chrono24 regarding the shipping status.The watch arrived exactly as described, in perfect condition, and within the expected delivery time. It was clear that both Chrono24 and the seller prioritize customer satisfaction and take great care in ensuring a smooth transaction.I highly recommend Chrono24 to anyone looking to purchase a luxury watch online. Their commitment to quality, security, and customer service is truly unmatched. I will definitely be using Chrono24 for future watch purchases!", "rating": 4}, {"title": "It was very straightforward and simple", "text": "It was very straightforward and simple.  I appreciate both the escrow service to give time to review the purchase as well as the seller rating and info.", "rating": 4}, {"title": "Very fast shipping", "text": "Very fast shipping, watch in great condition.Bracelet screws were glued and it can not be resized.", "rating": 4}, {"title": "it should be checked more of the seller…", "text": "it should be checked more of the seller because they don't always tell the difference I'm not very happy with a last purchase", "rating": 4}, {"title": "Very good customer service and fast…", "text": "Very good customer service and fast shipping. However, I was unaware that there was no additional links to the watch as it was only written in german", "rating": 4}, {"title": "All as expected ", "text": "The watch was as advertised. It came within promised time. There were good communication by the seller. Overall great experience. ", "rating": 4}, {"title": "The seller was easy to deal with", "text": "The seller was easy to deal with, and I would describe the watch as better than advertised.  The 4 star rating reflects the delivery, with DHL transferring to a local carrier for delivery, watch arrived a day late with no explanation, and was left without signature although the sellers instructions clearly stated it was required.", "rating": 4}, {"title": "Clear information, great turn around time ", "text": "Easy to follow, quick turn around, accurate product.", "rating": 4}, {"title": "Not quite clear", "text": "My only complaint is that a seller can say he is the US, and that he has the watch in stock, but that is not true.The seller is a broker in the US.He is brokering a watch in stock in another country. Thus he gives the impression of sending the watch directly,... but he isn't. And the watch gets held up by customs.Other than this", "rating": 4}, {"title": "Very good communication with the…", "text": "Very good communication with the vendor, and the watch was delivered in beautiful condition. Canadian customs and DHL were not great to deal with.", "rating": 4}, {"title": "Happy with my 3 tranactions", "text": "I have done a few transactions through Chrono24 and been happy with communication and clarity. They are doing a good job", "rating": 4}, {"title": "Everything was great except the custom…", "text": "Everything was great except the custom duty amount, which was high and not expected ", "rating": 4}, {"title": "very good website except for direct…", "text": "very good website except for direct marketing....its a bit too much", "rating": 4}, {"title": "Easy negotiation with seller and fairly…", "text": "Easy negotiation with seller and fairly seamless checkout. Unfortunately the delivery was delayed to to transport and customs but once it arrived I was certainly happy with the quality", "rating": 4}, {"title": "Rolex purchase ", "text": "Great platform to compare dealers and to filter on certified sellers. Quick transaction and appreciate the buyer’s protection policy. Would be nice though to have dealers provide a paper certificate of authenticity or appraisal. ", "rating": 4}, {"title": "the interaction with the store i found…", "text": "the interaction with the store i found it positive-also the products and services are uniqe", "rating": 4}, {"title": "I try to avoid buying from Chrono24…", "text": "I try to avoid buying from Chrono24 when possible. I rather buy from a jeweler out of state that doesn't charge me taxes. ", "rating": 4}, {"title": "Super. But inform about taxes", "text": "Super - but please inform better about cost of customs. They were very high and suprising.", "rating": 4}, {"title": "Safe shopping with worldwide access to markets", "text": "Best platform with broadest market access. Chrono24 also is well balanced for customer and vendor safety, security and protection.", "rating": 4}, {"title": "All my means are sane, my motive and my object - mad.", "text": "It was my first time purchasing a watch from an international dealer.  I've had my eye on an Omega 2538.20 for some time.  Really it was the watch that got away from me and I've been waiting for an excuse to buy one. I looked around here and found one in great condition - fantastic! I was crushed hhen the watch arrived damaged.  The second hand had fallen off.  When I contacted the dealer they were very quick to respond and offered to ship it back and fix it free of charge.  I had suggested getting it fixed here and just have them cover the cost, but they wanted to make it right.  I shipped it back, but it was subsequently returned due to forms not being filled out or what have you.  When I contacted the dealer again they agreed that I could have a local shop do the repairs and they would cover the costs.  At the end of the day I got the watch I wanted and it was in great condition.  Was it a perfect experience and transaction? No. which is why I'm not giving it 5 stars. I will say that the dealer and chrono24 were VERY responsive and I would absolutely purchase from this dealer in the future.  I've got some bad luck so I'm sure the damage that was caused during shipping isn't a normal occurrence.", "rating": 4}, {"title": "Excellent service and experience", "text": "Excellent service and experience.  The “Notepad” of saved watches is screaming for additional features like group by manufacturer, group by model, group by seller, sort by price/manufacturer/seller", "rating": 4}, {"title": "Wish the photos were more clear as the…", "text": "Wish the photos were more clear as the watch appeared much bigger in pictures", "rating": 4}, {"title": "Chrono24 should standardize watch condition better", "text": "Chrono24 is a great platform that needs to promote worry-free buying and selling of relatively expensive items. Eliminating fraud and unscrupulous sellers is why most buyers like me purchase on Chrono24 at higher prices than can be found elsewhere.  While my recent negative purchase experience was supported by Chrono24 with financial assistance, policing sellers who lie about the condition of their watches should be priority #1. I believe more should be done to provide better transparency of a watch condition on the platform and eliminate seller fraud and exaggeration of condition and operation.", "rating": 4}, {"title": "1st time to purchase a watch from…", "text": "1st time to purchase a watch from overseas and learning the import tax issues but overall it was good. And I’m pleased with my watch.", "rating": 4}, {"title": "Chrono24 has good participants in this…", "text": "Chrono24 has good participants in this platform. I think there is still room for improvement. It is my goto platform .... great site.", "rating": 4}, {"title": "Watch was sent but store wasn't very…", "text": "Watch was sent but store wasn't very responsive. Watch was recieved In a quick manner though.", "rating": 4}, {"title": "First time using Chro24 and went well", "text": "First time using Chro24 and went well. Good selection of watches and competitive pricing.", "rating": 4}, {"title": "First time watch buyer from this site", "text": "first watch purchase went off without a hitch. Happy with the response time from the seller and the platform was easy to navigate.", "rating": 4}, {"title": "Good", "text": "Very good and easy to use app/website got my watch easily without any difficulties.", "rating": 4}, {"title": "Very happy with my watch and the…", "text": "Very happy with my watch and the purchase. The dealer was very slow to ship the order. That was the only disappointment. ", "rating": 4}, {"title": "Fast and efficient delivery", "text": "Fast and efficient delivery, excellent packaging seamless communication with the seller and distributor while the order was in progress. Also, first class, easy-to-follow tracking setup and security features.", "rating": 4}, {"title": "My watch as received matched closely…", "text": "My watch as received matched closely with the description of it. Service was fast and precise. Thank you.", "rating": 4}, {"title": "Escrow account.....clear photos....user…", "text": "Escrow account.....clear photos....user friendly payment process....", "rating": 4}, {"title": "Chopard Buckle ", "text": "The Euro/USD conversion rate and fees were not explained.", "rating": 4}, {"title": "All went well but tariff or duty wasn't…", "text": "All went well but tariff or duty wasn't paid  by seller so I paid $104.00 to have watch delivered.", "rating": 4}, {"title": "images dont show up as good on mobile", "text": "images dont show up as good on mobile; otherwise amazing site!", "rating": 4}, {"title": "Good first time experience ", "text": "Chrono24 ensures that you are updated every step of the way as you await your timepiece. ", "rating": 4}, {"title": "High levels of trust factor.", "text": "High levels of trust factor.Cons: Response to queries to Chrono24 team via email is slow or lacking", "rating": 4}, {"title": "This is my third watch buying on…", "text": "This is my third watch buying on chrono24.com, great experience over all.", "rating": 4}, {"title": "Great and safe platform for buyers…", "text": "Great and safe platform for buyers around the world. A little expensive to sell though", "rating": 4}, {"title": "Ask more into the watch youre going to buy", "text": "I have been using the platform for several years, with no bad experience", "rating": 4}, {"title": "My experience with Chrono24", "text": "Worked well with good commuication.  Seller was excellent and the transaction smooth.", "rating": 4}, {"title": "communication is good in touch with the…", "text": "communication is good in touch with the buyer all the way.", "rating": 4}, {"title": "as a buyer.it was a smooth transaction", "text": "Date of experience: August 09, 2024", "rating": 4}, {"title": "The sellers were honest and helpful to…", "text": "The sellers were honest and helpful to deliver their product", "rating": 4}, {"title": "Good price", "text": "Good price, escrow of purchase until received.", "rating": 4}, {"title": "Great service for selling & purchasing ", "text": "Fantastic secure service for both purchasing and selling watches", "rating": 4}, {"title": "3 day deadline during holidays and…", "text": "3 day deadline during holidays and weekends when offices are closed is inflexible", "rating": 4}, {"title": "RevueThommen_AirspeedBig_MarcoF.", "text": "The seller was on time and precise in the description of watch characteristics.", "rating": 4}, {"title": "Experience and Products Enhancement", "text": "Some items hard to find alone for example if I want the watch box only not with the watch", "rating": 4}, {"title": "Process was fairly smooth", "text": "Process was fairly smooth, item was received on time.", "rating": 4}, {"title": "Safety to shop online is important.", "text": "I chose this site because of reputation, Fast communication, and so far Safety of personal information and money transfer.", "rating": 4}, {"title": "Great service", "text": "Great service.   Fast and efficient.  ", "rating": 4}, {"title": "Smooth process ", "text": "It was easy transaction I used Amex so had to deal with cc for safe key ", "rating": 4}, {"title": "Good followup and delivery", "text": "Good followup and delivery, watch and box in perfect condition", "rating": 4}, {"title": "Good price easy system to use", "text": "Good price easy system to use, safe for buyer and seller.", "rating": 4}, {"title": "Would buy again", "text": "International shipping was smooth, watch was in advertised condition. Would buy again.", "rating": 4}, {"title": "Great platform", "text": "Great platform. Good service. Great tools.    ", "rating": 4}, {"title": "Good support for the HK represent", "text": "Date of experience: February 26, 2024", "rating": 4}, {"title": "Good selection of watches from all over…", "text": "Good selection of watches from all over the world.", "rating": 4}, {"title": "A great financially safe way to buy…", "text": "A great financially safe way to buy watches.", "rating": 4}, {"title": "Product as described", "text": "Product as described. Quick turnaround; overall good service and communication.", "rating": 4}, {"title": "Large selection of watches", "text": "Large selection of watches to choose from", "rating": 4}, {"title": "Good seller", "text": "Good seller. Beautiful watch ", "rating": 4}, {"title": "Smooth transaction once sale negotiated", "text": "Well designed site, ease of creating advert, secure negotiation process and trustworthy financial mechanism", "rating": 4}, {"title": "Was good to use the site.", "text": "Good selection of watches to choose from.", "rating": 4}, {"title": "Good service", "text": "Prompt response to my enquiry.", "rating": 4}, {"title": "Excellent experience", "text": "Excellent experience. Communication w vendor was fluent and efficient", "rating": 4}, {"title": "Trustfull company", "text": "Good help by contact and service", "rating": 4}, {"title": "Prompt response and helpful.", "text": "Date of experience: December 06, 2023", "rating": 4}, {"title": "Proper updates in shipments were given", "text": "Date of experience: March 05, 2024", "rating": 4}, {"title": "Good response and helpful", "text": "Date of experience: December 04, 2023", "rating": 4}, {"title": "Great communication", "text": "Great communication. Product exactly as described", "rating": 4}, {"title": "Very good shopping…", "text": "Very good shopping experince.communication is soomth, Meet my expactations.", "rating": 4}, {"title": "Seems straight forward", "text": "Date of experience: June 30, 2024", "rating": 4}, {"title": "You have to get used to the process", "text": "The process is fast and smooth once you get used to it", "rating": 4}, {"title": "Everything was easy to deal with i had…", "text": "Everything was easy to deal with i had no problems", "rating": 4}, {"title": "Great Experience", "text": "I love how quickly the watch was shipped and of course I love the watch.Thank you!!!", "rating": 4}, {"title": "Perfect item", "text": "Date of experience: April 02, 2024", "rating": 4}, {"title": "Good overall", "text": "Good overall ", "rating": 4}, {"title": "Great place to find amazing watches.", "text": "Date of experience: May 27, 2024", "rating": 4}, {"title": "God og ordenlig.", "text": "God og ordenlig.  ", "rating": 4}, {"title": "Delivered as promised", "text": "Date of experience: March 23, 2024", "rating": 4}, {"title": "It works as is says it does", "text": "It works as is says it does. No problems ", "rating": 4}, {"title": "Overall good experience", "text": "Ordering worked okPayment process non-intuitiveOverall good experience", "rating": 4}, {"title": "Did their job", "text": "They got my watch here.", "rating": 4}, {"title": "Bought a watch from chrono and it went…", "text": "Bought a watch from chrono and it went smoothly.", "rating": 4}, {"title": "Issues with delivery addresses only", "text": "Date of experience: March 18, 2024", "rating": 4}, {"title": "Good communication and help…", "text": "Good communication and help troubleshooting the shipment", "rating": 4}, {"title": "Website user experience can use…", "text": "Website user experience can use improvement. ", "rating": 4}, {"title": "Good communication", "text": "Good communication and fast shipping", "rating": 4}, {"title": "Authenticity", "text": "Authenticity, reliability, worth trust ", "rating": 4}, {"title": "Overall buying experience was nice", "text": "Date of experience: February 15, 2024", "rating": 4}, {"title": "Good", "text": "Good trusted experience ", "rating": 4}, {"title": "efficient and precise", "text": "Date of experience: July 29, 2024", "rating": 4}, {"title": "Good deal", "text": "Good deal , friendly to use,", "rating": 4}, {"title": "Helpful and knowledgeable", "text": "Helpful, knowledgeable and responsive representative.", "rating": 4}, {"title": "Goodwills", "text": "Good service, polite, efficiency", "rating": 4}, {"title": "Simple efficient process", "text": "Date of experience: May 23, 2024", "rating": 4}, {"title": "Can trust to this shop", "text": "Buyed a lot of watches", "rating": 4}, {"title": "Highly recommended", "text": "Easy to deal with.", "rating": 4}, {"title": "Very easy and fast", "text": "Date of experience: January 19, 2024", "rating": 4}, {"title": "Arrival time and date", "text": "Actual arrival date", "rating": 4}, {"title": "Safe and easy", "text": "Date of experience: May 24, 2024", "rating": 4}, {"title": "Transaction was uneventful.", "text": "Transaction was uneventful. ", "rating": 4}, {"title": "Review", "text": "Fast delivery", "rating": 4}, {"title": "Good site.!", "text": "Date of experience: March 26, 2024", "rating": 4}, {"title": "Will probably buy again.", "text": "Satisfied.", "rating": 4}, {"title": "Payment options", "text": "Smooth handling of the transaction overall. Payment options could be improved: for the bank transfer option for example, for very expensive watches, it cannot be wired in one time but split into several operations (depending o the bank limit). In the end it works as the system asks for the rest of the amount if payment cannot be made in one transfer. Still it should be explained during the payment method selection to avoid confusion and delay.", "rating": 4}, {"title": "Still checking", "text": "I believe they have the best and most affordable watches in the market.", "rating": 4}, {"title": "It wasn't completely clear about the…", "text": "It wasn't completely clear about the import taxI think prices should be shown inclusive of tax", "rating": 4}, {"title": "Everything was simple and as expected", "text": "Everything was simple and as expectedThe watch arrived in perfect conditions.Chrono support was very good and helpful during the process", "rating": 4}, {"title": "Had no issues thisg time using chrono24", "text": "Had no issues this time using chrono24, can recommend,just make sure the seller actually has the watch", "rating": 4}, {"title": "My first deal with Chrono24", "text": "For the first time I bought a watch with Chrono24. The watch was said to be sold in good condition with original box and original papers. The delivery was made by DHL within a very short time. It is greatly appreciated. I found the watch, the original box and the international guarantee. But the user manual was missing and the watch was not running properly for more than one hour or two. I think more details should to be given as to the condition (checked and tested by the manufacturer, CPO, quick check by our in-house department, with or without additional guarantee, etc) and to the papers (guarantee and/or user manuel and/or invoice, etc). I brought the watch to the repair department of the manufacturer and I'm waiting for their feed-back. I asked for a copy of the user manual.", "rating": 4}, {"title": "Convenient and secure transaction.", "text": "Date of experience: October 01, 2023", "rating": 4}, {"title": "It wasn’t so much a Chrono24 problem", "text": "It wasn’t so much a Chrono24 problem, as much as it was “nature of the beast”.  For the most part I really like the site.  I have purchased 4 watches from the site and plan to continue using Chrono24.  As for “.Nature of the beast”, because you work through a website you don’t get a personable experience.  You read information on a screen and never see the person you’re spending so much money with. When something came up with my last watch I wanted to speak with a person and not through email.  In the end I was able to speek to the seller and everything worked out great.  I did however trust that if things had not worked out I could fall back on your company to make things right.", "rating": 4}, {"title": "Delivery took a lot of time", "text": "Delivery took a lot of time, current sending status was often not correct. Very kind and professional service and support from chrono24, thank you!", "rating": 4}, {"title": "good sale", "text": "good sale. good communication. everything is perfect except the delivery times", "rating": 4}, {"title": "Customs pitfalls", "text": "The watch was exactly described and in great condition.  My biggest compliant relates to the clearing customs process.I had to guess at the value of the watch movement, watch band, battery type and several technical items.  It would be great if dealers could include a document with the shipment containing this information for US Customs clearance.  Going forward, I may be hesitant to import a watch, given the delays dealing with DHL, to get the watch through customs.", "rating": 4}, {"title": "Great selection and value", "text": "Great selection and value, the watch was everything I wanted and more. Quick shipping and and good pictures.", "rating": 4}, {"title": "a nice way to find merchandice for your…", "text": "a nice way to find merchandice for your watch.", "rating": 4}, {"title": "Bought a watch from Chrono 24", "text": "Bought a watch from Chrono 24. Price was great would be nicer if there was a calculator that adjusted for customs. Overall the price difference didn't compensate the risk to buy from a physical store", "rating": 4}, {"title": "Great seller, Chrono24 info missing", "text": "The seller was great, however, this is my first purchase. It rather hard to understand the rules, what to do when you watch arrives. I cant tell if Chrono24 certifies each watch, or if there is a guarantee and for how long. more info should come from Chrono24 when you purchase something.", "rating": 4}, {"title": "convenience,straightforward and easy to…", "text": "convenience,straightforward and easy to use ie to perform transactions. the escrow account is very much a source of comfort in transactions. your huge inventory.", "rating": 4}, {"title": "Great Experience", "text": "Great experience and communications was excellent. However, the phone number provided was a Sprint mobile service number that I was not able to get through to talk with someone. All communications with my transaction was via email.", "rating": 4}, {"title": "Great communication", "text": "Date of experience: October 01, 2023", "rating": 4}, {"title": "Excellent service", "text": "Fast and reliable service.  Refund is quick as well.", "rating": 4}, {"title": "Authentic", "text": "Recently purchased a Seiko watch from chrono24. The dealer, Shipping agency, Chrono24 all are good. I am satisfied with my purchase", "rating": 4}, {"title": "The experience was fine", "text": "The experience was fine. A basic transaction. This is the second time you asked me for this. Next time, one star.", "rating": 4}, {"title": "Overall is fine", "text": "Overall is fine, the seller is responsive.However, the description on the ads of the production month doesn’t match with the actual date. The ads says it was 2022, but the actual is 2021. Not v happy with that.", "rating": 4}, {"title": "The exchange rate I paid was higher…", "text": "The exchange rate I paid was higher than the actual rate and I would have preferred to pay in the same currency as the seller. DHL delivery was very slow and was stuck in customs 2 weeks over a relatively minor purchase for myself.", "rating": 4}, {"title": "creates confindence", "text": "Date of experience: September 20, 2023", "rating": 4}, {"title": "Reptilian watch strap and Canada Customs.", "text": "So far, I have not received the watch I purchased from Chrono 24. This is not the fault of the retailer but of Canada Customs and FedEx brokers in Canada. It is the issue of a watch band that looks like alligator/reptilian skin which may or may not be CITES listed. The leather strap was not stamped officially, (i.e., Cartier-France) and because it looked like alligator, it was considered inadmissible unless further tests were conducted ( not sure if one can separate an legal from and illegal alligator on the CITES list) and if found (who knows) that it is listed I, the purchaser, would be penalised for importing an illegal animal skin. The manufacturer of these upscale watches should provide the required documentation. An authorised Cartier dealer in my home does not provide any form of documentation for a reptilian leather watch strap. So, bottom line I can not resell my yet-to-be watch. Heads-up buyers in CITES-agreed countries, It sucks.", "rating": 4}, {"title": "The webpage needs a little refinement", "text": "The webpage needs a little refinement, otherwise I believe this is the best watch shop online ever.", "rating": 4}, {"title": "Nice watch from Reliable seller", "text": "Seller ('Gallery Rare' from Japan) was great communicator and prompt with answers to questions and prompt with Delivery.Exchange rate was not so great as I paid more than I should have for the watch according to exchange rates.  But this is a Chrono 24 issue not the sellers issue", "rating": 4}, {"title": "It’s a great website but their call…", "text": "It’s a great website but their call center and customer service needs improvement. When you call , you come across someone with broken English and it is really difficult to communicate. I get much better responses for amazing when buying 10 dollar products", "rating": 4}, {"title": "Chrono24 is great BUT…", "text": "Chrono24 is great for selling high-value watches and spares with its Escrow service, which keeps scammers to a minimum.  Scammers will still try to get folks to complete transactions with PayPal or Bank Wire, outside the service, so don't do it!  Unfortunately, they can't eliminate dreamers and time wasters but overall the service works very well and the fees are about half of those of eBay and similar sales intermediaries.  One thing they should offer is shipping insurance for sold items because nearly every courier will not insure jewelry and watches in transit, so that is a problem where they instruct you to insure the item to its full value as part of the Escrow process.  That isn't actually possible it would seem, so there is a flaw in the process that they can fix with a shipping insurance product.", "rating": 4}, {"title": "Chrono24 is and operates very well", "text": "Chrono24 is very good - the reason I provide a 4-start review rather than a 5-star review is due to the fact that Chrono24 charges a currency exchange rate (used by the payment service provider) of a maximum of 2.5% above the price set by the European Central Bank (ECB).  I look at it as an Administrative Fee but this should be disclosed to the buyer before actually purchasing the watch and this should be included/itemized in the Chrono24 Certificate of Purchase.  When questioning a Chrono24 representative about the final cost of my watch - I was informed that this fact is not disclosed until questioned.", "rating": 4}, {"title": "Watch Arrived In Good Shape", "text": "Watch arrived in good condition, tracking was a bit off.(USPS)Could have shipped a bit faster.", "rating": 4}, {"title": "Dealer products", "text": "Dealer products. Hard to find the right source. Try to click on the dealers selling other products, I wish I can see more from a specific dealer can offers.Additional more options while searching specific watches. While I was surfing on the discover tab, I wish there is more options to choose such as gender, local location to prevent from customs and taxes and weight as well.", "rating": 4}, {"title": "Trusted check Out vent well", "text": "Trusted check out vent well.Where was a delay of 3 days before payment was registed at Chrono24 acount.Custermer service by phone worked very well, but by mail no answer.God expiriece overall, it is my second purchase at Chrono24.", "rating": 4}, {"title": "Second time around watch company was…", "text": "Second time around watch company was very nice and great communication.  UPS delivery service was awful though.  They delivered my extremely expensive watch to a gas station and let a random person sign for it!  Unacceptable and embarrassing.", "rating": 4}, {"title": "Easy trade", "text": "Easy trade, inspire confidence that is very important considering expensive watches can be bought here.Only con I have is that I had a question not in the FAQ and I never received an answer. That's unfortunate.", "rating": 4}, {"title": "Overall a great experience with some minor things to mention", "text": "This transaction went fairly well but there are a few things I experienced which is the reason why I'm giving 4 stars. The first thing I discovered was the condition \"Unworn\" doesn't necessarily mean unworn. I was told by the dealer that Chrono24 doesn't provide them with a \"Mint\" condition which is why the watch I purchased was marked \"Unworn\" condition. The second issue was I was not going to be home the day the watch was to be delivered, I then requested the watch be left at the FedEx location closest to my home. It turns out they could not do that. If I wanted to have the watch delivered to the FedEx drop off, I would need to have the dealer cancel the order and run it through again. These are minor things which occurred and I was overall very happy with the experience. I will continue to do business with Chrono24 because I feel it is a safe place to do business and I have been happy with each of the dealers I have purchased from.", "rating": 4}, {"title": "Good experience", "text": "Date of experience: July 14, 2023", "rating": 4}, {"title": "The watch is perfect", "text": "The watch is perfect.  Exactly as advertised.  I will buy from Chrono24 again.  Would have given a 5 star but there were some shipping delays.", "rating": 4}, {"title": "Fiarness", "text": "i found that your company doesn't allow a dealer in South Africa to entitle return and money eschew service is grossly unfair to it.  I see no reason why you do that.", "rating": 4}, {"title": "First time using Chrono24 with my…", "text": "First time using Chrono24 with my purchase after years with them! Quality is good as expected. The only downside is that the cost is not entirely transparent because I dealed in Japanese Yen with the Japanese seller and the amount appeared on Chrono24 was also in Japanese Yen. However, upon item being transacted, and my credit card was charged in USD and the rates differentiation is a lot more!(JPY281k, the bill came out to be SGD2864.) I was charged US$2050.This is not acceptable.Please consider it with one single charge and be more transparent.", "rating": 4}, {"title": "Some delay in payment authorization…", "text": "Some delay in payment authorization from Chrono’s end but overall good experience.", "rating": 4}, {"title": "Incredible service and clear communication", "text": "I was worried about buying such an item as a watch online, but wanted to try it. And what an incredible experience, everything from the start was just well communicated and clear. Highly recommend this site to anyone who wants to buy a watch. Just be careful of private sellers", "rating": 4}, {"title": "I found what I had been searching for", "text": "I found what I had been searching for, a Leonidas Chronograph like one I had in the 60’s.", "rating": 4}, {"title": "Good service", "text": "Good service . Farst delivery", "rating": 4}, {"title": "Very good platform for used watch all…", "text": "Very good platform for used watch all around the world. Make all the watch buyer more easy to connect to the world seller. Great experience.", "rating": 4}, {"title": "Chrono24 is a company that can be…", "text": "Chrono24 is a company that can be trusted (escrow service like Pay Pal).  It is like the NY stock exchange where many traders meet.  Only downside is for USA residents since their bank is in London and the HQ is in Germany USA banks take extraordinary security steps which makes it very difficult to pay for your watch", "rating": 4}, {"title": "I like that chrono24 has dedicated time…", "text": "I like that chrono24 has dedicated time on there reputation,  so that no matter 300$ or 30,000$ I know the watch is real. I like how you can make an offer instead of just accepting the price. good job.", "rating": 4}, {"title": "Great platform for watch selling and…", "text": "Great platform for watch selling and buying. Bought and sold watches through them a couple of times and all were good", "rating": 4}, {"title": "the follow-up is excellent in each step…", "text": "the follow-up is excellent in each step which made me very happy and feel safe that the money would not lose", "rating": 4}, {"title": "Great website", "text": "Great website, regular updates, good facilitation of exchanges between sellers and buyers, offered insurance.", "rating": 4}, {"title": "Straightforward transaction.", "text": "Straightforward transaction.Good communication from the seller.Will be better for buyer and seller if we are able to choose to pay in the seller's local currency instead of going through multiple conversions.", "rating": 4}, {"title": "Satisfied but people in new york office…", "text": "Satisfied but people in new york office abrupt ....but efficient", "rating": 4}, {"title": "Well it can be a little overwhelming…", "text": "Well it can be a little overwhelming and it takes a lot of time to pick and compare the watches to make a good deal, but they provide the option which is good. Their service surrounding the purchase makes it easier to buy across borderd.", "rating": 4}, {"title": "Chrono24 is responsive to queries.", "text": "Date of experience: June 02, 2023", "rating": 4}, {"title": "I like the web site", "text": "I like the web site.  I recommend improving the filter feature.  It is not working for saved favorites.", "rating": 4}, {"title": "Great First Experience", "text": "A bit of back and forth with the Japanese dealer, which might some translation issues.Chrono24 customer service was really efficient when I asked questions.First purchase as I was afraid of been scammed but the Escrow Account are perfect.", "rating": 4}, {"title": "The company doe’s most everything very…", "text": "The company doe’s most everything very well. Improvements could be made in the process - some details are difficult to understand such as replying to a message from a buyer or seller.  Otherwise a very fine experience.", "rating": 4}, {"title": "Jumped the gun on payment release", "text": "Jumped the gun on payment release. Watch was delivered to my mail drop as I was out of town and signature required. Funds were released at mail drop delivery. I did not have the opportunity to retrieve or check the watch to authorize payment.Seller needs to properly fill out a US customs declaration. It was faulty and resulted in hassle and delay.", "rating": 4}, {"title": "Good communicate platform", "text": "Date of experience: May 29, 2023", "rating": 4}, {"title": "We had a bit of a hickup with the…", "text": "We had a bit of a hickup with the client not releasing payment and your staff were able to wait a bit for my commission to be paid. So only thing I dont like is client can delay payment on PayPal even if goods are shipped and received. I was paid a week after he received the watch.", "rating": 4}, {"title": "The reach of the listing", "text": "Date of experience: June 07, 2023", "rating": 4}, {"title": "Luxury watch buying experience", "text": "The watch was delivered in perfect condition, but the taxes were very high for import. The crocodile strap was delivered in a different parcel due to legislations but nevertheless it arrived 20 days later. Overall I’m happy with the experience.", "rating": 4}, {"title": "I'm happy with the the waych and the…", "text": "I'm happy with the the waych and the deal I got from the company. I was looking for a good brand watch and cheap in same time ,and  the  chrono site recommended one that ticked all the boxes.Many thanks to chrono24 and i recommend the site to  deal with for  who is looking for brand name watches.", "rating": 4}, {"title": "Deleivery time is rather fast and watch…", "text": "Deleivery time is rather fast and watch quality is same as descriptions on Chrono page.", "rating": 4}, {"title": "Good but could have been better", "text": "Easy to find the watch I was looking for.  The item was posted to be 'new with papers' but it turned out to be 'used with papers'.  After further negotiation, I received the watch later than expected.  Thus 4 and not 5 stars.", "rating": 4}, {"title": "The watch was received as shown on the…", "text": "The watch was received as shown on the pictures, very well packaged. However, it took an unreasonably long time to arrive and noone could tell me where it was during that time.", "rating": 4}, {"title": "Delivered the correct product in a…", "text": "Delivered the correct product in a timely fashion, that’s about all I need.", "rating": 4}, {"title": "Was simple transaction overall", "text": "Was simple transaction overallJust lil expensive on the customs", "rating": 4}, {"title": "Great site", "text": "Great site, I enjoyed buying from it.Somewhat hard to find dealer chat, at least for me (this is my first time using this site), so I had to reply to dealer going to e-mail notification first, and then, from there I went to chat.", "rating": 4}, {"title": "Fluid", "text": "Fluid, easy, good experience.I suggest Chrono24 to nudge its dealers to propose different alternatives to DHL carrier, since DHL is very expensive and the service is not that good.", "rating": 4}, {"title": "Delivery time is very fast ,packaging…", "text": "Delivery time is very fast ,packaging is very good. The watch I  receive is good conditions and cmpleted box and documents.", "rating": 4}, {"title": "Had to ask refund for first watch", "text": "Had to ask refund because one of the dealers actually didn’t have the watch in stock. Makes watch hunting a bit more difficult.", "rating": 4}, {"title": "Everything was almost great", "text": "Everything was great. I would just like to let you know, it would be helpful if you could inform at the time of order how much duty and charges shall be applicable.", "rating": 4}, {"title": "All good but I sent a question to the…", "text": "All good but I sent a question to the consultant and never got a reply back.", "rating": 4}, {"title": "……………………………..", "text": "………………………….", "rating": 4}, {"title": "good service", "text": "Date of experience: April 06, 2023", "rating": 4}, {"title": "Beware of secret sales tax", "text": "The browsing and database function of the app is very well designed. Pretty easy to find anything you are looking for. The buying experience is smooth and easy, the only negative is I was hit with a 10% sales tax. Normally sales tax is payed to the seller and usually not when buying a used item. But this was charged by C24. I'm assuming it's a kind of fee they charge. This should have been clear before I committed to buy.", "rating": 4}, {"title": "Love looking and learning about watches", "text": "Date of experience: April 17, 2023", "rating": 4}, {"title": "The watch is wonderful albeit expensive customs post purchase", "text": "The watch is wonderful. Brand new with tags and labels as advised. Packaged very securely and safely- Thank you. Disappointed about the expensive customs/taxes charged to me by the courier upon arrival. This was an extra large expense I had to pay even after the watch was paid for. So I would advise customers to calculate customs/taxes before ordering !", "rating": 4}, {"title": "A success overall", "text": "The watch purchase I made through the Chrono24 site was a success. However, they can adopt a rather intimidating tone: within 24 hours of my purchase (which was on a Sunday) they sent a message saying payment had not yet been received and that the purchase risked falling through within 3 days. It seemed heavy handed as I am not personally responsible for the international banking system; and it was plain unsettling. In fact, the money went through just fine and the delivery took place immediately, so Chrono24's own processes were efficient. In addition, Chrono24's instructions on international bank transfers were easy to follow.", "rating": 4}, {"title": "not so good and good", "text": "The vendor did not flag that the address would not work with FedEx (P.O.Box). Caused a significant delay in delivery.The packing was good, It arrived in good condition.", "rating": 4}, {"title": "High transaction fees.", "text": "Date of experience: April 15, 2023", "rating": 4}, {"title": "Trusted", "text": "Nice experience", "rating": 4}, {"title": "I purchased two links for my Omega…", "text": "I purchased two links for my Omega Planet Ocean. I paid with credit card and received confirmation. However, my “order status” continued to show “awaiting payment”. I tried to message the seller but the only choice it gave me for sending the message was “pay now”. Chrono 24 said it was a vendor problem. It was eventually rectified but caused a delay of a few days.", "rating": 4}, {"title": "I used Chrono24 to buy my first Swiss…", "text": "I used Chrono24 to buy my first Swiss watch. The watch looked better than described and I was very satisfied with the purchase. With that said DHL got my address mixed up and I almost didn't get the watch. I talked to DHL 5 times and each time they said the problem was resolved but it was still sent to the wrong address", "rating": 4}, {"title": "Make sure you research the dealer…", "text": "Make sure you research the dealer before you buy - I would not recommend non-domestic sellers. This is not StockX; you will have to verify the authenticity of your purchase when the watch is sized. If you do your homework you could be going home with a beautiful time peice.", "rating": 4}, {"title": "Purchase", "text": "Escrow service is key to a purchase on Chrono24.  My only complaint is that funds were released before I even opened delivery package.  I would have liked a day to make sure watch was in \"as described\" condition.  Otherwise it was a very good experience.", "rating": 4}, {"title": "A comprehensive collection of…", "text": "A comprehensive collection of watch-selling information globally.", "rating": 4}, {"title": "I think Chrono24 did a reasonable job…", "text": "I think Chrono24 did a reasonable job at sorting out the slow delivery due to poor detailed information on packaging. Sellers MUST be advised how important this is, due to ridged customs regulations. Not only in my country but I suggest around the world. Am well pleased with the item. Kind regards William Bourke.", "rating": 4}, {"title": "4⭐️ for seamless transaction (Trusted…", "text": "4⭐️ for seamless transaction (Trusted Checkout Order).  Would be 5⭐️ if Chronos had a valuation profile for same model watch. (Only steel model, not steel & gold). Perhaps not enough sales to track?", "rating": 4}, {"title": "Review", "text": "Confidence in safety and reliability of product.", "rating": 4}, {"title": "It’s a good platform", "text": "Date of experience: April 02, 2023", "rating": 4}, {"title": "I appreciated Chrono's efforts to…", "text": "I appreciated Chrono's efforts to contact the seller to clarify issues.", "rating": 4}, {"title": "grat site for safe purchase of whatces", "text": "grat site for safe purchase of whatces, only catch is that the payment has to be in your local currency with a un specified exchangrate markup, would rather have had the option of an open ‘safe payment fee’", "rating": 4}, {"title": "The platform is very easy to navigate…", "text": "The platform is very easy to navigate and get what you are looking for. Sometimes the listing is not properly photographed and or described but other than that you can weed out the nonsense and find what you need.", "rating": 4}, {"title": "Trustful site", "text": "A lot of options", "rating": 4}, {"title": "Had a weird experience with a private…", "text": "Had a weird experience with a private seller asking personal questions. After reporting it, I did not feel it was taken seriously.The app is good as far as the inventory and wide selection of quality brands. However, the suggestions algorithm needs a little fine tuning.My purchases on the app have gone well. I truly recommend the app but further recommend buying from dealers over private sellers. The sale feels more secure and less likely to go awry with your purchase.", "rating": 4}, {"title": "The watch appeared to be in good order", "text": "The watch appeared to be in good order. However there were no instructions that came with it on how to operate the date or the winder or how the watch works in general. That to me was a little surprising.", "rating": 4}, {"title": "Just a good professional process from…", "text": "Just a good professional process from start to finish.", "rating": 4}, {"title": "Service is Good", "text": "Service is Good . They just chargé too much on exchange rate", "rating": 4}, {"title": "Pretty good experience", "text": "Overally, I am very satisfied~ I was trying to reach their New York office them since I messed up the billing and shipping address, got too excited buying my first watch~ LOL. Unfortunately, no reponse~ but I did received an email in less than 1 hour to ask me regarding on the correct address and it was verified before they say yes. Proud of them.", "rating": 4}, {"title": "Easy transaction", "text": "Easy transaction, room to negotiate, good user experience. However, watch was older than indicated and in desperate need of a service. Returning a watch is a hassle, so always make sure or verify that dealers put in correct info and calculate a service in the price, despite the condition stated by the seller.", "rating": 4}, {"title": "Swift & easy", "text": "Easy ordering and impressive delivery time. Arrived a day early. The case, dial and bracelet was in better condition that expected. The movement needed service, but considering the low price for a +20 yrs watch, this wasn't much of a surprise.", "rating": 4}, {"title": "Fast and reliable", "text": "Fast and reliable. Money-back guaranteed, though exchange rates vary.", "rating": 4}, {"title": "PANERAI Watch received", "text": "PANERAI Watch received. Looks new but original black rubber strap with Panerai original buckle that must come with watch was replaced with non original rubber strap and cheap buckle. Not happy.", "rating": 4}, {"title": "Good", "text": "Vers good og no problems", "rating": 4}, {"title": "Good experience,secures transactions", "text": "Date of experience: February 26, 2023", "rating": 4}, {"title": "No Middle Ground for Escrow", "text": "If there's something wrong with the watch, it's either you keep or return it, the latter at my own cost for shipping. There is no middle ground allowed by the Escrow system to withhold the payment beyond 14 days to the seller until the issue is resolved.In my case, it is a brand new watch that has been kept for years. So wearing it alone, even for 10 hours or more per day everyday, will not sufficiently wind it. The watch will stop after about 3 days. I had to send the watch in under the manufacturer's warranty to address this issue.Chrono24 response to this issue is I can choose to return the watch at my own cost for shipping. There is nothing they will do to help outside of this return option.I asked the seller for a discount for this issue and the seller agreed. So a partial refund was arranged by Chrono24.", "rating": 4}, {"title": "Good communication", "text": "Good communication, most of the problems were from me not being used of using app", "rating": 4}, {"title": "Fast delivery - great service from the dealer", "text": "Excellent service - Received the product I ordered quickly within a week from Japan. Excellent freight packaged", "rating": 4}, {"title": "Great way to find a specific watch.", "text": "The only issue was the watch passing through customs. That’s not Chrono24’s problem, that was the only issue. I would be happy to use Chrono24 again.", "rating": 4}, {"title": "Thrust website", "text": "Date of experience: February 21, 2023", "rating": 4}, {"title": "I had a great experience with Chrono24", "text": "I had a great experience with Chrono24. They had provided me with updated information of my purchased package every step of the way. The only downfall was that I had to pick up my package an hour away from my house. This posed to be problematic due to the long commute and it was just an overall inconvenience. Furthermore, there were duties that were charged when arriving to pick up the parcel but that was to be expected. It would of been excellent if the package arrived to my house but maybe next time. Regardless, I did appreciate the updated communication from Chrono24. I would strongly be purchasing another watch or product in the near future.Thank you! Wesley", "rating": 4}, {"title": "Reliable", "text": "Reliable, fast, trustworthy (so far).", "rating": 4}, {"title": "It would be nice to find a way how…", "text": "It would be nice to find a way how would watch look like on your hand before buying it", "rating": 4}, {"title": "Chrono24", "text": "Chrono24, I had read several articles and saw several YouTube reviews on them and it was mixed reviews. I was a bit hesitant to move forward with Chrono24. After much searching , I found this platform to have an amazing assortment of vintage timepieces vs some others. I found a beautiful 60s Omega in outstanding condition and decided to make an offer which was accepted. I made payment but encountered a slight hiccup, my payment wasn’t recorded but after several emails and a few phone calls, it was all resolved and the transaction was completed and processed and shipped quickly from Japan. My experience thru this process was best handled by Chris at Chrono24, he was the transaction manager who was polite, efficient in his communication with me. I felt like I had someone who was going to see this thru completion. The first guy who answered my original email regarding the hiccup was ok but what I saw was he wasn’t really addressing or reading my email and my concerns. I would use Chrono24 again for future purchases and I would recommend them to others. My vintage Omega was exactly as described, arrived quickly and I’m very pleased.", "rating": 4}, {"title": "ok ok ok ok ok ok", "text": "Date of experience: February 09, 2023", "rating": 4}, {"title": "Great service!", "text": "Great service and regular updates on shipping. The one thing that would make my particular buying experience 5 stars in my opinion would be the seller/website being able to provide a rough calculation of customs & tax of watch being imported, that would really aid in the purchasing decisions. Otherwise all went well, purchased a phenomenal seiko king turtle!", "rating": 4}, {"title": "Everiting was perfect.", "text": "Date of experience: February 07, 2023", "rating": 4}, {"title": "Very good service", "text": "Very good service. 2 days delivery from Italy to Denmark !👍🏼", "rating": 4}, {"title": "It is important for the buyer to be sure and determined to make a purchase. this area is not for fun but for serious deals.", "text": "Chrono is very helpful with people who don't know in the beginning how to use this platform.Chrono24 also helps correct mistakes that users have accidentally made.", "rating": 4}, {"title": "So far so good but a small suggestion", "text": "In recent months I sold and purchased few watches here.  My experience has been good so far as a newbie.  My comment at this time is that there is no direct navigation to the Purchased items except through the message. It takes too many steps to check the shipping status of a brought item.", "rating": 4}, {"title": "Newbie watch enthusiast", "text": "Newbie watch enthusiast; it is a great place to view, learn and purchase watches safely", "rating": 4}, {"title": "Overall positive experience", "text": "Overall positive experience. Watch had minor issue but was rectified after some back and forth. Chrono24 helped resolve the situation and would do business with again.", "rating": 4}, {"title": "Got what I paid for.", "text": "Got what I paid for.Felt like I got a good deal.", "rating": 4}, {"title": "Very good service.", "text": "Date of experience: January 10, 2023", "rating": 4}, {"title": "Getting accustomed to your system was a…", "text": "Getting accustomed to your system was a bit cumbersome and the lines and possibilities of communicating not right clear.Anyway, we received the watch in good order but with delay.", "rating": 4}, {"title": "Easy thank you", "text": "Date of experience: January 01, 2023", "rating": 4}, {"title": "Chrono24 review", "text": "Helpful experience.", "rating": 4}, {"title": "Trustworthy and positive", "text": "Overall great communication and support, only issue I’ve had was with a payment to a seller but this was a standalone issue and it might have been my bank", "rating": 4}, {"title": "Review", "text": "It need's to have a better page layout.", "rating": 4}, {"title": "No.1 watch market.", "text": "Watches are expensive and I can rely on this site for my only watch I looked forward to buying.They should have a mechanism to punish the store that cancels the order because of the posted watch had been sold or unavailable. The buyer should be able to review this kind of transaction as well.", "rating": 4}, {"title": "Operative in communication", "text": "Date of experience: January 02, 2023", "rating": 4}, {"title": "Overall excellent, except for a customs issue", "text": "Overall the experience was excellent--I like the number of listings and the relatively seamless links to sellers, as well as the fact that the sellers are validated. The only glitch was the shipping. Since my watch came from outside the US, it was held up in customs for documentation both from the seller and myself. I did not know they needed anything, and I only found out when I asked what the hold up was. Better handling of imports including having the appropriate documents identified in advance would give the experience 5 stars.", "rating": 4}, {"title": "Offshore Glitch but Stunning Watch", "text": "The transaction went great once my credit card stopped blocking the vendor. It was flagged bc of the overseas address, even though the actual seller was in New Jersey. It took me a couple of days to get it to go through. Not Chrono24’s fault, but vendors should maybe have American entities for America sales. The watch is beautiful, and it shipped within an hour or two of payment. WOW", "rating": 4}, {"title": "First Experience", "text": "First ExperienceAll in all, I'm very happy with my first purchasing experience using Chrono24.  My only reason for not giving this 5 stars is a small (but annoying) issue I had with the user interface.  I initially setup a profile under my name, when my wife and I decided to make a purchase we used her credit card.  It was at this point we figured out there are no seperate 'billing' and 'profile' names.  Entering her name during the payment changed the profile name to her name.  I'm guessing this could have been alarming to the vendor I was dealing with as my pre-sales communication was under one name, post sales were under a different name...", "rating": 4}, {"title": "Communication on questions arising…", "text": "Communication on questions arising during buying or selling can be hard to come by", "rating": 4}, {"title": "Good place to buy", "text": "I was looking at different watches, but was hesitant because I thought I might loose my money; I decided finally for a watch I loved and purchased it. The process was super easy and the watch was shipped the next day and arrived very fast. What was advertised including the price was what I git and payed.", "rating": 4}, {"title": "Attentive staff and impressive reaction…but...", "text": "Attentive staff and impressive reaction and response time.Pros:The order come in good conditions and in the assumed time frame  Cons:in order to fill-up the warranty card, the original box was opened. I did not understand why the protective plastic foils have been removed from the objects (watch and bracelet). When put in box again and prepared for shipment, the reattachment of the protective foils was done unprofessional --> very bad  visual impact", "rating": 4}, {"title": "The company 5a has very clear policies…", "text": "The company 5a has very clear policies and very strong and straightforward communication skills", "rating": 4}, {"title": "The communication with the seller was…", "text": "The communication with the seller was really great & Chrono24 made that possible.", "rating": 4}, {"title": "Good my only criticism is that when a…", "text": "Good my only criticism is that when a price reduction is asked it is so little hardly worth asking !", "rating": 4}, {"title": "Good communication as to the details of…", "text": "Good communication as to the details of the purchase and tracking.", "rating": 4}, {"title": "Good product and delivery was quite…", "text": "Good product and delivery was quite quick. Just careful checking for importation fees as they can be quite expensive (Australian in my case)", "rating": 4}, {"title": "The received watch is in the same…", "text": "The received watch is in the same condition as the advertisement. Fast delivery and regular updates on the shipment process. Feel secure buying watch from Chono24", "rating": 4}, {"title": "Ive bought several items with this…", "text": "Ive bought several items with this vendor. I have been very pleased with every transaction.", "rating": 4}, {"title": "My first premium watch purchase", "text": "This was my first time with a notable international purchase, the platform is well presented and communication effective to a point. Working with the Escrow service left a little to be desired as the visbility from funds outgoing to reciept wasn't ideal. Once the funds were confirmed it also took quite some time for the seller to ship the goods, so my comfort of the platform was not the best at that stage. In the end I received the goods quickly and would use Chrono24 again, though I think the process of tracking funds and dealers shipping information should be a little clearer for buyers.", "rating": 4}, {"title": "Product shipped from China even though…", "text": "Product shipped from China even though ever indication was that it was not coming from China - took several weeks to ship", "rating": 4}, {"title": "Everything was just fine as usual", "text": "Everything was just fine as usual. It would be perfect, if there would be no extra cost with AMEX....", "rating": 4}, {"title": "Very good experience", "text": "Date of experience: November 14, 2022", "rating": 4}, {"title": "Good experience with the seller", "text": "Good experience with the seller, the credit card fee is bad.  Would use this platform again.", "rating": 4}, {"title": "This is the 2nd watch I purchased from…", "text": "This is the 2nd watch I purchased from this website. There are a lot of good dealers but there are some bad ones as well. Chrono24 should do a better job of vetting dealers out. Not just the trusted ones, but all dealers rather than leave it to the consumer.", "rating": 4}, {"title": "A very decent platform for connecting…", "text": "A very decent platform for connecting watch buyers and sellers.  It facilitates global transactions quite well and offers an escrow service.  The currency conversion fee is over 2.5% though.", "rating": 4}, {"title": "Who really knows", "text": "This site is great for finding what you want.I do wonder what the criteria is to receive the title of \"professional dealer\". How do you really know if the watch you buy is authentic or a fake, you don't. You just hope the title \"professional dealer\" means no fake watches. It truly is a false sense of security. I feel safer buying from jomashop.", "rating": 4}, {"title": "Everything about the purchase was good…", "text": "Everything about the purchase was good until the watch arrived at customs in England where the watch sat for more than one month before it was processed…initially I thought there was a paper work issue but it was held up because they were “too busy”…phone calls were unanswered or were answered with “we are too busy” and then they would hang up.  I guess I shouldn’t be surprised for a country that had a rail strike, a postal strike and 3 prime ministers while my watch waited, and waited and waited…..I certainly don’t understand what the British are so “haughty” about.", "rating": 4}, {"title": "The quality of the products", "text": "The quality of the products, authenticity and variety of seller.", "rating": 4}, {"title": "It was good experience", "text": "Date of experience: November 10, 2022", "rating": 4}, {"title": "Very smooth transaction", "text": "Very smooth transaction.  Product as advertised.  Fair price. Would have been nice if import duty was disclosed before purchase, and not a surprise after purchase.", "rating": 4}, {"title": "You feel Chrono24 is a trustworthy and…", "text": "You feel Chrono24 is a trustworthy and honest party.At this moment my bying of an Alpina watch is not yet concluded, because its exactness was faulty. I returned it to the jeweler in Paris who will exchange it for a new one. Chrono24 helped to have this process run smoothly. I am sure this end with 100% satisfaction!", "rating": 4}, {"title": "Great place to buy watches", "text": "Date of experience: November 07, 2022", "rating": 4}, {"title": "Absolutely fine", "text": "All in order Quick and in the State expected .", "rating": 4}, {"title": "Overall good experience", "text": "Overall, the experience was good and mostly seem less. There were two delivery attempts made because I was not home during the day. My only concern was that during both attempts I got scam text messages saying there was a problem with my shipment. I suspect a leak of information is happening at some point. It could be FedEx, but that’s my only negative experience.", "rating": 4}, {"title": "The dealings and transaction was very…", "text": "The dealings and transaction was very smooth and safe.", "rating": 4}, {"title": "Erroneous description", "text": "My engagement with the seller was very positive.  Unfortunately their description of the watch was not accurate.  They describe the watch movement as automatic.  Unfortunately on arrival and after examination, it was determined to be a manual movement.", "rating": 4}, {"title": "I bought few watches from chrono24 no…", "text": "I bought few watches from chrono24 no huge issue soo far ecxept few little issues recently which i think not taken seriously. I am still digging so my 4stars can be change in future. Ta", "rating": 4}, {"title": "All good and I am in contact with  the…", "text": "All good and I am in contact with  the company for a long time!", "rating": 4}, {"title": "great website and app with loads of…", "text": "great website and app with loads of choice, just not sure about whether the prices are always correct", "rating": 4}, {"title": "Product was as expected.", "text": "Product was as expected.The address of the shipment was not written correctly; made me have to go to the main Fedex warehouse to pick up.", "rating": 4}, {"title": "I am surprised Chrono 24 has good…", "text": "I am surprised Chrono 24 has good customer support.  Better than I expected.", "rating": 4}, {"title": "The check out time to selling a little…", "text": "The check out time to selling a little bit long time. That is all. Thank you .", "rating": 4}, {"title": "A solid buying experience.", "text": "Purchasing on Chrono24 is a straightforward experience. I had no issue purchasing the item I wanted. The website interface is a bit cumbersome and the buying steps can be difficult to follow. Overall, I am pleased with the transaction.", "rating": 4}, {"title": "Great platform. Currency quirks.", "text": "Great platform for gauging market prices. Purchase experience as good, but know that returns aren’t as straightforward due to currency fluctuations and international sales. Customer service was communicative, but it took some back and forth to assess that the discrepancy wasn’t a “transaction fee” from my bank.", "rating": 4}, {"title": "Overall good experiences using C24", "text": "Overall good experiences using C24. As a buyer, I appreciate their offered escrow service (on most professional dealer listings). That said, they have once or twice cleared payment to the seller on my behalf prior to me receiving the item & confirming that it was \"as described\".. In both cases there was no issue, but this has certainly raised some concerns for me.Regarding customer service, when I have had concerns I was able to contact a representative both in the US and overseas (Asia) depending on my location at the time. Their international presence is an useful benefit. As a seller I find their service fee's a bit unreasonable compared with other marketplaces. Their built-in message app to correspond between buyer / seller is clunky and lacks some basic features.. would like to see this improve in future. Lastly, they need better diligence when it comes to filtering and removing counterfeit listings.", "rating": 4}, {"title": "Hi the seller failed to inform me of…", "text": "Hi the seller failed to inform me of the duties or that it had to be collected", "rating": 4}, {"title": "Buying from Chrono24", "text": "Bought several watches from chrono 24, no problems at all.Talked with their customer service once and received full information that needed.All watches were exactly as described and arrived very fast.", "rating": 4}, {"title": "I wanted to cancel my order and then I…", "text": "I wanted to cancel my order and then I regretted my decision. Chrono24 was compliant and professional the whole time. They advised about return policy as well as refunds on escrow service. Cancelation email arrived immediately upon my request and later when I chose not to cancel anymore, chrono re-established the purchase process as equally fast.", "rating": 4}, {"title": "Trustworthy and secure way of…", "text": "Trustworthy and secure way of purchasing a watch with very convenient search and sort features. They will gouge you a bit on the exchange rate for foreign transactions and service fees though so security and convenience come at a cost. Would use again though.", "rating": 4}, {"title": "Overall okay", "text": "Overall okay - pictures didn't fully show the band which was somewhat worn.", "rating": 4}, {"title": "A great platform if you prefer…", "text": "A great platform if you prefer purchasing online. My transaction went smoothly, because I chose a highly rated dealer but there were a few hick-ups along the way, as some dealers reply late or the item was sold on other platforms… not Chrono24’s direct fault but still, they could improve this aspect", "rating": 4}, {"title": "great app", "text": "great app, easy to use just all around a good app", "rating": 4}, {"title": "Watch purchase", "text": "Seller was prompt in responses. Had a wonderful experience with Chrono 24. I do wish method of delivery was expressed at time of purchase as some are better in terms of receiving than others, especially for international.", "rating": 4}, {"title": "The seller was great", "text": "The seller was great.  My issue was with Chrono24.  I sent credit card information in a fast timely manner.  Then this next step is where things broke down, Chrono24 asking for partial copy of credit card and driver's license, I had to send this information no less than 5 times.  I do not know what the issue was, however the seller was getting impatient and so was I.  I hope I will not need to go through that process again", "rating": 4}, {"title": "Great job with shipping for Saturday…", "text": "Great job with shipping for Saturday delivery. But just be cautious with the statement “shipping in 24hrs after the chrono24 confirms payment” - this has exceptions. Original shipment has missing instruction manual and another object given in the description. The manual was sent later but was only in French (i think) and only an explanation was given for the other missing piece.", "rating": 4}, {"title": "overall good experience but could have been better", "text": "overall good experience and I was pleased with the quality of the web site and experience overall. One issue with the whole experience was that I was charged for exchange rate by my credit company because the source of the transaction was outside the U.S. I will Chrono24 had told me this as I would have used a different credit card for the transaction.", "rating": 4}, {"title": "good service and good dealer", "text": "i am not very good in writing an English chrono24 is great and this dealer is good", "rating": 4}, {"title": "Excellent watch market place", "text": "Chrono24 website worked wonderfully up until the seller shipped my watch. At that point my ability to message the seller was restricted and I could only click a button verifing I had recieved the package.  When a customs issue arose needing information and forms from the seller, I had no way to contact them through the website.  Luckily, the staff at Chrono24 were easy to reach and handled the customs problem quickly.  I'll definitely buy through Chrono24 again.", "rating": 4}, {"title": "Great selection", "text": "Great selection, reliable transaction, what more do you need?", "rating": 4}, {"title": "Traser P68", "text": "Efficiency, and with clear statistics for delivery.", "rating": 4}, {"title": "Good timely correspondence with the…", "text": "Good timely correspondence with the watch seller and product was \"as described\".The watch crystal fell out upon arrival but the seller made an adjustmentI am generally satisfied", "rating": 4}, {"title": "My experience was quite OK only the UPS…", "text": "My experience was quite OK only the UPS courier service that needs improvement.", "rating": 4}, {"title": "Excellent experience with Chrono24", "text": "Date of experience: September 08, 2022", "rating": 4}, {"title": "I asked a question during the shipping…", "text": "I asked a question during the shipping process and I did not receive a response for 38 hours. When I did receive a response, It was incorrect.", "rating": 4}, {"title": "First purchase with your app", "text": "First purchase with your app. I made a few mistakes with shipping and and billing addresses, and was unsuccessful at editing for the seller. Payment process was a little confusing at first. I was able to communicate successfully with the seller. Overall a good experience.", "rating": 4}, {"title": "My funds initially could not be found", "text": "My funds initially could not be found, once found and deposited into escrow account the transaction was seamless, seller very good and watch is an excellent piece, will buy again", "rating": 4}, {"title": "Easy transaction but Chrono24 is a…", "text": "Easy transaction but Chrono24 is a foreign company (outside USA for me). When Chrono24 held my $ in escrow I was charges a sizable $350+ fee by my bank for a \"foreign transaction fee\". I was able to get my bank to remove the fee but it was a hassle.Other than that, Chrono24 was east, fast and secure.", "rating": 4}, {"title": "Great watch!", "text": "The watch was exactly as advertised and well wrapped.  There was very little communication from the seller.  There was a little communication from the shipper and I had to pay some duty before the watch was released for delivery.", "rating": 4}, {"title": "Great watch at a great price", "text": "Picked out a bargain dream watch and when it arrived was in perfect condition. Price came through an annoyingly higher price than advertised and when asked did not really explain it.", "rating": 4}, {"title": "Great app", "text": "Great app - it’s legit and loads of great options to find the watch you want.", "rating": 4}, {"title": "It is the go-to platform for pre-owned watches", "text": "It is the go-to platform for pre-owned watches with the best selection and thus health price competition.  The dealers selling on the platform are all top notch from my experience. The moonswatch flippers however are unreliable - I would like to see Chrono24 have more of a think about how to manage this group.", "rating": 4}, {"title": "Chrono 24 were excellent throughout my purchase experience.", "text": "Chrono 24 were excellent throughout my purchase. Communication was quick, the sale was secure. I highly recommend Chrono 24 to watch lovers and enthusiasts like me. Thank you Chrono 24.", "rating": 4}, {"title": "Great service but watch arrived some…", "text": "Great service but watch arrived some weeks after the suggested delivery time", "rating": 4}, {"title": "Happy about the service", "text": "Happy about the service, less so about the fact that Chrono24 has increased pricing for sellers substantially and now hides the names of boutiques/sellers, which means less transparency for buyers ...", "rating": 4}, {"title": "Thank you chrono24 for finding my…", "text": "Thank you chrono24 for finding my favourite watch.", "rating": 4}, {"title": "Easy and fast deal.", "text": "Easy,reliable and very fast delivery", "rating": 4}, {"title": "Apart from the delivery (PostNL…", "text": "Apart from the delivery (PostNL International 3S) everything was OK. I can say only good things about Chrono24 and FAB Timepieces, they managed all the concluded duties and the anomalies well! Thanks for everything.", "rating": 4}, {"title": "my  Fauld", "text": "I was disappointed because the error was mine. It was my first purchase from chrono24 and i didn't realize that was a woman watch i have ordered .", "rating": 4}, {"title": "Excellent watch for the price", "text": "The watch looks and feels excellent and keeps the time well enough for the price.The included NATO strap looks and feels good, although the leather strap is slightly big for my wrist.The packaging was slightly underwhelming but fits with the military theme.However, the shipment tracking provided by DHL was rather strange and almost gave me a heart attack a few times (randomly saying the watch was shipped to another address and such).Overall more than worth the price", "rating": 4}, {"title": "Complicated n troublesome need renew…", "text": "Complicated n troublesome need renew all the time.", "rating": 4}, {"title": "The proces was without any problems.", "text": "Date of experience: September 01, 2022", "rating": 4}, {"title": "Tudor Black Bay Steel - EW Spain", "text": "This Site is well organised and offer good buyer protection.", "rating": 4}, {"title": "Great", "text": "Great, very accomadating to my purchases.", "rating": 4}, {"title": "experience is good", "text": "Date of experience: August 28, 2022", "rating": 4}, {"title": "one of your seller simply ignore my…", "text": "one of your seller simply ignore my purchase request, otherwise I would give a 5-star", "rating": 4}, {"title": "Nice watch", "text": "Nice watch. Good seller.", "rating": 4}, {"title": "There should be a much easier way to…", "text": "There should be a much easier way to verify authenticity of a watch without having to face extra expenses, ie, rely on an indépendant adjudicator (jeweller, watch expert) in one’s countryOr, a certificate of authenticity with the productFake warranty cards are not acceptable nor are wrong shipping documents", "rating": 4}, {"title": "Everything is perfect except the hands…", "text": "Everything is perfect except the hands are black for my watch instead of blue.", "rating": 4}, {"title": "Was decent easy", "text": "Date of experience: August 21, 2022", "rating": 4}, {"title": "Great experience, 2% extra charge for paying with AMEX.", "text": "Great experience purchasing a timepiece with Chrono 24. The watch is better than shown in the photos. Authentic per my AD. They get 4 stars for charging a 2% extra when using American Express Cards.", "rating": 4}, {"title": "Chrono 24 has been great", "text": "Chrono 24 has been great. They have an unbeleivable Range of watches at various price points and the sellers I have dealt with have always responded quickly.So far I have never had an issue...BUTThe watch I purchased from America arrived in Australia within a week.My only reason for 4 stars on this occasion is that my Horologist has checked the watch, which has now gone to Rolex Australia to be evaluated for prior water damage. The watch may not be quite was was represented to me and I did ask the seller some specific questions about polishing of the case and the authenticity of the Bezel.I was away when it arrived, so the 14 day escrow had expired. If the watch is not what it seems, I will contact the Jeweller/Seller from Texas that sold it to me, and Chrono 24, but the seller does offer a 12 month warranty. I will then see what the outcomes is, and be better equipped to improve or reduce this rating.", "rating": 4}, {"title": "Chrono 24 is a great platform but I had…", "text": "Chrono 24 is a great platform but I had a negative experience with a private seller who dragged their feet even though I offered full price. They claimed the shipping was not possible but I found my own carrier and the seller still did not cooperate. I wish that there were rules that prevented that and I think Chrono 24 could administer those. But the dealer I bought my Hourangle from was a class act.", "rating": 4}, {"title": "Good experience!", "text": "Good experience!I recomand!", "rating": 4}, {"title": "Lots of offerings", "text": "Lots of offerings, but, similar to Zillow, part of the pricing problem. What makes things work is the escrow service.", "rating": 4}, {"title": "Everything was communicated and my…", "text": "Everything was communicated and my concerns where addressed. I was happy with the deal.", "rating": 4}, {"title": "Minor Shipping Glitch - Fixed", "text": "Overall this was a positive buying experience. I am very happy with the watch I purchased and the customer service. Initially there was some confusion with DHL and the tracking number I was provided did not indicate any shipping activity from Japan. After about 10 days a asked them to sort it out and they provided me a new FedEx shipping number and this package then send to originate from Hong Kong. I thought that was strange because I don't know why it would ship from Hong Kong and not Japan. After they shipped it via FedEx it promptly arrived. The watch company was responsive.", "rating": 4}, {"title": "My first purchase on Chrono24", "text": "This was my first purchase on Chrono24 and I found the experience to be fairly straight forward but with one or two areas for improvement.  Primarily in the offer followed by final pricing.  It would seem more logical to have the final pricing before offer to purchase like on other sites such as Amazon.com.  But overall still a positive experience mostly because the seller was very communicative that made the transaction smooth.", "rating": 4}, {"title": "All was good except for the delivery…", "text": "All was good except for the delivery information provided by Fedex, which was misleading at times regarding the expected delivery date and time window.  It is difficult to make sure you will be home to sign for a delivery when the delivery time keeps changing.", "rating": 4}, {"title": "When I had questions about the watch…", "text": "When I had questions about the watch Chrono24 could not answer but referred me to the seller. If Chrono24 is allowing this seller on their site, they should be able to answer simple questions. The seller Natiluxia LLC could not answer any of the questions I asked. The video they sent me regarding my question about the band was not one I could open. No help from anyone. I don't think I would purchase another watch from Chrono24 or Natiluxia LLC since neither seemed to know much about the watch I purchased. Very disappointing and a little scary.", "rating": 4}, {"title": "Good service!!!", "text": "Good service", "rating": 4}, {"title": "TIME,", "text": "these days of the uncertainty of normal shipping you have to exercise more patients with the delays", "rating": 4}, {"title": "Overall good service with thanks", "text": "Date of experience: August 04, 2022", "rating": 4}, {"title": "confidence in Chrono 24", "text": "it was a bit stressful it took a lot longer to arrive than expected but knowing you are going threw Chrono 24 really does give you more confidence", "rating": 4}, {"title": "Exellent experience.", "text": "Date of experience: August 01, 2022", "rating": 4}, {"title": "1small glitch then perfection!", "text": "I had an initial question about a watch band/strap and it was never answered by Chrono or the seller.  Other than that my experience buying a watch was very good and I recommend this internet company!", "rating": 4}, {"title": "Effortless", "text": "Effortless, product arrived was quoted accurately as far as quality and condition", "rating": 4}, {"title": "Great", "text": "Great.keep it up!", "rating": 4}, {"title": "Great app", "text": "Great app, works perfectly, makes transactions easy. Wasn’t aware of the foreign transaction fee for being in Berlin, now that I know I’ll use a card that doesn’t charge foreign transaction fees.", "rating": 4}, {"title": "Collector of Raymond Weil Parsifal…", "text": "As a collector of Raymond Weil Parsifal watches; Chrono24 has been a good / safe site to purchase a number of Raymond Weil watches. They will help to negotiate with the seller,  if there's any problems with the watch. They'll keep all funds in escrow until the buyer is satisfied with their purchase.", "rating": 4}, {"title": "5 stars from me.", "text": "Delivered watch as shown on website, good packaging and timely delivery... only negative is that they do not include import duty charges in shipping and one gets a rude surprise when item reaches home country. Not a fault of Chrono24, the shipping services should take care of this. All in all very satisfied with the watch.", "rating": 4}, {"title": "Quick response", "text": "Date of experience: July 28, 2022", "rating": 4}, {"title": "The buying proces what very good.", "text": "The buying proces what very good.After I recieved the watch I found I dificult to contact the seller with questions regarding the whatchOnce the watch was dilevered I couldn’t use the “contact seller” notifikation bar, I had been using  during the buying proces.I had to Google the seller, and afterwards e-mail them.", "rating": 4}, {"title": "Very good apps", "text": "Date of experience: July 25, 2022", "rating": 4}, {"title": "Good and bad", "text": "The whole process was smooth, and felt easy and calm. The product itself is as described, but the accessories came with it was not as listed. Buyer felt disappointed.", "rating": 4}, {"title": "I received my product on time and in…", "text": "I received my product on time and in perfect condition. Chrono24 gives a very good platform for watch lovers. I have only one issue with them is that they marked my product as delivered depending on the courier companies feedback. They should wait for the buyers to receive the product and confirm in the website before marking it as delivered.", "rating": 4}, {"title": "Item availability system", "text": "Item availability should be more  precise.All good the rest.", "rating": 4}, {"title": "The watch is excellent and beautiful, but....", "text": "The watch is excellent and beautiful, exact that I was looking for. Communication with the seller was good. However, I really asked a seller not to mention the price of the watch inside the package, but he did. As a result, I paid almost $100 to free the package from the custom service. Thus, the price of the watch become the most expansive that any other site is providing. It was really sad, especially because I contacted the seller before and he promised not to mention the price.", "rating": 4}, {"title": "Average experience", "text": "Date of experience: July 21, 2022", "rating": 4}, {"title": "Glitch in Customs paperwork delayed…", "text": "Glitch in Customs paperwork delayed delivery, but otherwise the experience has been as good as it could be.  Merchant shipped the watch very quickly, and the watch arrived in excellent shape and exactly as described.  I wouldn't hesitate to do business with Chrono24 again.", "rating": 4}, {"title": "smooth transaction & great product for…", "text": "smooth transaction & great product for the price point", "rating": 4}, {"title": "It was a fast delivery", "text": "Date of experience: July 13, 2022", "rating": 4}, {"title": "Great website and customer service", "text": "Great website and company the only comment I would make is that they have processed a charge to my card even though transaction was cancelled overnight and acknowledged as such on my account .Awaiting refund", "rating": 4}, {"title": "Annoying website that sells good watches", "text": "Chrono24 is a reliable website that uses an escow service to make sure that you get the watch you paid for, and the dealer gets the funds you sent. It works very well and is at no cost to the buyer.The bidding system puts you in direct contact with the sell, so you can negotiate directly and easily.The only problem with the website is far too many popups and far too many marketing emails. It's very off-putting and a few times I have clicked away from the \"Submit Order\" button because I found the site too annoying. Very bad website design", "rating": 4}, {"title": "The watch as advertised but it took…", "text": "The watch as advertised but it took some time to arrive", "rating": 4}, {"title": "In an Amazon world, speed up!", "text": "In an Amazon world, transactions should happen faster and offer more assurance. It seemed as if I had lost contact with the seller but it was because of the elapsed time between placing the order, notification of shipping and receipt of the watch. Speed up the process.", "rating": 4}, {"title": "This was my first time using CHRONO24…", "text": "This was my first time using CHRONO24 and overall the experience was very, very good. The only issue I had was communication, being my first time with CHRONO24 I had a few questions. I called the international number (Germany) several times to no avail, and when I called NY the lady that answered wasn't much help and gave me the impression that either she didn't know the answers or didn't want to be bothered. When I did communicate by message it took a little long for them to answer and didn't correct an issue I had with the proof of purchase related to language. I do still have some unanswered questions, but otherwise will recommend.", "rating": 4}, {"title": "There was a minor miscommunication…", "text": "There was a minor miscommunication betweenChrono and myself as to what shipping address was and when to ship the watch.", "rating": 4}, {"title": "Thank you for facilitating my watch…", "text": "Thank you for facilitating my watch purchase....   have ordered 6 watches and every purchase has been accurate and prompt. From Japan to Finland the watch got to me without problems.    Was vary hesitant at first but more confident now.", "rating": 4}, {"title": "Both experiences have been more than…", "text": "Both experiences have been more than satisfactory.  The first dealer is repairing a faulty mechanism, and the second dealer has stated he is sending a second band.", "rating": 4}, {"title": "Good online marketplace with wide selection", "text": "Good interface with excellent search, notification and messaging functionalities. Payment and transaction mechanism are also built to ensure trust in the process. I find that professional sellers are safer to deal with, on that platform, as it keeps track of their ranking and previous buyer feedback. However, private individual sellers' quality and reliability remains difficult to ascertain, so buyer beware. And always do your research, regardless. Still, if you stick with reputable sellers and well-known brands, Chrono24 is an excellent world-wide marketplace with a huge and eclectic selection of timepieces to choose from.", "rating": 4}, {"title": "The staff at C24 were helpful overall", "text": "The staff at C24 were quite friendly and knowledgable.", "rating": 4}, {"title": "Overall ok but very cumbersome getting the ok…", "text": "Overall ok but very cumbersome getting my IDvalidated. Sent 3 times the documents!", "rating": 4}, {"title": "The seller is promptly responsive", "text": "The seller is promptly responsive. They just need to improve the performance of their Finance dept, which took more than a week to locate my wire transfer.", "rating": 4}, {"title": "Good and quick", "text": "Date of experience: June 28, 2022", "rating": 4}, {"title": "Surprise extra charge from shipping", "text": "Date of experience: June 28, 2022", "rating": 4}, {"title": "Good", "text": "Trust & keep following this page and recommend to friends as well", "rating": 4}, {"title": "Recommended dealer", "text": "Good quality product same as photos given by dealer. Quick feedback on enquiry.", "rating": 4}, {"title": "Pretty good overall.", "text": "Date of experience: June 27, 2022", "rating": 4}, {"title": "Good collection with reliable sellers.", "text": "Date of experience: June 27, 2022", "rating": 4}, {"title": "Quite nice delivery and quality", "text": "Delivery is quite fast. The watch is wrapped nicely.", "rating": 4}, {"title": "Good site for watches however some…", "text": "Good site for watches however some things need to improve some more options on search would be better. Also customer services is very slow to respond and needs to improve they should have some type of live chat as calling them is also dificult as they are overseas and take way too long to respond to emails.", "rating": 4}, {"title": "I have bought 2 watches through…", "text": "I have bought 2 watches through Chrono24. Both have been easy and pleasurable.", "rating": 4}, {"title": "Private sellers often offer poor…", "text": "Private sellers often offer poor products. Chrono24 should be able to ascertain the authenticity of the product. Also some private sellers don’t know how to arrange for shipping. These two areas are essential for Chrono24 support to both sides.Kindest Regards", "rating": 4}, {"title": "Interesting", "text": "Some small points, I didn't know I was going to pay an additional $1,100 for the box it came in, but I understand.  Also, shipping was a nightmare.  This is not the fault of the seller or Chrono24, but Fedex was very unorganized.  After I received the watch I sent the watch to Ulysse Nardin to be validated, that cost another $575. Overallnot bad, but may stay away from overseas sales.", "rating": 4}, {"title": "Good service shop", "text": "Good service, will consider purchase again in the future", "rating": 4}, {"title": "I have bought a Rado watch via Chrono24…", "text": "I have bought a Rado watch via Chrono24 and their service is good.", "rating": 4}, {"title": "Selling well", "text": "Selling well, but why do buyers have to pay import tax?", "rating": 4}, {"title": "Good communication and excellent service", "text": "Date of experience: June 20, 2022", "rating": 4}, {"title": "Good and satisfy whole order", "text": "Overall satisfied the whole process", "rating": 4}, {"title": "Really good platform for buyers and…", "text": "Really good platform for buyers and sellers. However, we do need a way to discuss, and ask questions before/during/after the sales. Not just using the chat. I may wish to inquire about a detail, trade offer, etc., without wishing to further the purchase process", "rating": 4}, {"title": "The watch came on time and looked like…", "text": "The watch came on time and looked like the picture.", "rating": 4}, {"title": "Timely,responsive,accurate.", "text": "Date of experience: June 15, 2022", "rating": 4}, {"title": "Thes new tax collection for overseas…", "text": "Thes new tax collection for overseas sales is no good. Now we get hammered twice.", "rating": 4}, {"title": "Terrific selection, search could be better", "text": "Chrono24 had the most extensive selection I could find of watches for sale around the world, and by searching their site I was able to find just what I was looking for right in my neighborhood. Searching was slower than it needed to be though, I wish there were more detailed criteria (bezel type, numerals, etc.) I definitely appreciated the escrow payment service and authenticity guarantee, and the whole purchase processing on the website worked very well.", "rating": 4}, {"title": "Not bad", "text": "The overall purchasing was problem free. I got the product as advertised. No defects, properly packaged. I was disappointed with DHL's service. They took several days longer than anticipated and had me fill out paperwork to have the product pass customs. I've never had that issue with other logistics carriers before. Overall, 4/5 starts for Chrono24. 2/5 stars for DHL.", "rating": 4}, {"title": "Great process", "text": "Great process. Definitely felt that chrono24 took the risk out of the purchase. Vendor was great to deal with. Item was exactly as described and shipping was quick and efficient.", "rating": 4}, {"title": "Good seller", "text": "Good seller, fast response", "rating": 4}, {"title": "My only complaint", "text": "My only complaint, and it is a big one, is that one has to compute the customs costs into every watch, which considering most of them appear to be in Europe. The costs are considerable if you are buying a fine watch ! about 100 dollars per thousand. This adds up quickly, so it makes my enjoyment of the site, somewhat limited.", "rating": 4}, {"title": "My watch didn’t ship right away", "text": "My watch didn’t ship right away. Once there was a follow up by chrono24 it shipped immediately. Great service from chrono24.  Seller sent everything as promised. Watch is exactly as expected.", "rating": 4}, {"title": "BUYING WATCHES CAN BE A MINEFIELD, BUT CHRONO24 MAKES IT LESS SO", "text": "I welcome the safety net that Chrono24 provides.", "rating": 4}, {"title": "order process and shipping process was…", "text": "order process and shipping process was great. The cost of the product could be aa little less.", "rating": 4}, {"title": "I really liked this watch", "text": "I really liked this watch, but I had to send it back, to small for me", "rating": 4}, {"title": "Very convenient", "text": "Very convenient, smooth transaction using the escrow payment system which insures the safety of buyers. Bought 2 watches through Chrono24 and both transactions have been pleasant and had no issues.", "rating": 4}, {"title": "Decent experience - Not exceptional", "text": "Overall, the process was smooth and the technology enabled an easy way to make a purchase. Regrettably, I would have hoped that the vendors would be vetted a bit more than what they appeared to be (maybe no background checks at all?). When I ran into an issue with my purchase I was able to resolve the matter quickly and directly with the vendor; had there been expectations conveyed to vendors about the types of products to be sold, I hope this issue would not have occurred.  Would I use Chrono 24 again? Yes. In summary, I suspect the quality of the transaction and the ability to remedy situations are similar to purchases being made on Ebay.", "rating": 4}, {"title": "Price comparison is definitely…", "text": "Price comparison is definitely something you guys should consider a little bit more however I am extremely excited about other purchases I am going to make with you guys...I'm just all about fair-value with the market being the way it is, I must shop around!", "rating": 4}, {"title": "I've purchased multiple watches through…", "text": "I've purchased multiple watches through Choron 24. As a mediator between the business selling the watch and the purchaser, they are responsive and prompt. The only issue I had with this purchase was that a boxing item advertised as part of the purchase was not included initially. Ultimately I did receive the item in separate mail delivery. All good.", "rating": 4}, {"title": "Still the best platform for Selling and…", "text": "Still the best platform for Selling and buying. Fee is too much though.", "rating": 4}, {"title": "Good platform for buying watches", "text": "Date of experience: May 28, 2022", "rating": 4}, {"title": "Great platform & safe", "text": "Great platform & safe. Lots of opportunities for buyers & sellers.Like everything else, everyone need to do their own research to narrow down from which dealer that is suitable to one's parameter, price, location, etc.", "rating": 4}, {"title": "Excellent customer service and response", "text": "Date of experience: May 26, 2022", "rating": 4}, {"title": "So far so good", "text": "So far so good. Only the messenger is a bit slow.", "rating": 4}, {"title": "Excellent", "text": "Excellent, safe and secure place to shop for watches. You just need to do abit of research into the seller past history and reviews.", "rating": 4}]