[{"title": "The Loan agent was great to work with", "text": "The Loan agent was great to work with!  She had me approved and in closing in record time!  There were some small hiccups along the way but, she never waivered and kept me updated all the way through!", "rating": 4}, {"title": "Happy Newday customer.", "text": "Our loan expert was very good in getting us information at each step in the process. However, your computer system kept sending us new contracts each week that were not close to what we were asking for. Please update your system. ", "rating": 4}, {"title": "Mr Nigel P Strickland and NewDay USA", "text": "Mr. Nigel Strickland of NewDay USA was with us through the whole process of refinancing our home.  He called 2-3 times a week as well as emailing us and always portrayed a positive attitude.The only surprise in the whole process was the lender cut checks for our debts and sent them to us overnight for us to mail out.  I can understand why but the lender in past refi's had always taken care of paying the bills off at closing.By us mailing the checks and waiting for them to \"post\" - left us with a \"residual\" balance on the accounts.All in all a good experience.  Would recommend NewDay USA.", "rating": 4}, {"title": "Info and keep me informed", "text": "Info and keep me informed ", "rating": 4}, {"title": "First off", "text": "First off, every member of your team was great.  They were all very helpful and walked me through the entire process.  The only reason I am giving 4 stars instead of 5 is the closing costs.  I paid over 10 grand in closing costs, and I believe that to be high.  I am still happy with how your people handled the entire process, but I just wanted to voice my concern with the closing costs.", "rating": 4}, {"title": "I thought after I signed my mortgage…", "text": "I thought after I signed my mortgage that is be able to get questions answered. Apparently, once signed they delete from their memory. ", "rating": 4}, {"title": "Stuart Lindquist Helped us the entire…", "text": "Stuart Lindquist Helped us the entire way.The only complaint is that the commercials said no out of pocket money and I had to borrow $32K for closing costs.  Other than that the assist was outstanding.", "rating": 4}, {"title": "The people who worked with me are…", "text": "The people who worked with me are professional and courteous. The one problem is that with NewDay the right hand doesn't know what the left hand is doing. Going through this process I'm still receiving mail trying to get me to refi with them. For me at least, this is an irritant and a waste of my time.", "rating": 4}, {"title": "New Day is a \"God Send\" for Veteran's…", "text": "New Day is a \"God Send\" for Veteran's like me. I spent the greater portion of my adult life placing the mission first, never taking the time to settle in one place and call it \"Home\". After 45 years serving in the Federal Government retirement came and it was time to \"buy\"... New Day's Team of experts understood where I was in my life and what I had sacrificed all these many years. Mitch was the perfect match for us and he made the entire process both comprehensive and smooth from start to finish. New Day's willingness to stay on task with us through some slight changes (location, home value, and rising home interest rates); was an unexpected delight. Kudos to the entire team (Mitch, Jake, and the Realtor assigned to us \"Dakota\"); they worked well together through the entire process. Many Thanks...", "rating": 4}, {"title": "NewDay (ND) wasn't a great experience…", "text": "NewDay (ND) wasn't a great experience for me.  I appreciated the efforts of my loan officer, Matt.  He was responsive and a reliable communicator.  It seemed (by ND policy) he was directed or compelled to reach out nearly every day during our refi process.  That got old very quickly.At the end of the process, NewDay' best interest rate was a full 1 point higher than where we actually ended up (not at ND).  In addition, they were not able to provide me with the cash I needed to realize via our refi transaction.Further, they insisted on my paying off a vehicle, which I co-signed on for my daughter, who had been making regular monthly payments for almost 2 years with no late or missed payments.  Ridiculous!I was not convinced ND had my best interests as a priority.  If so, their rate would have been much more competitive and citing corrections to the above noted issues, I would have \"done the deal\" with them.", "rating": 4}, {"title": "Was very pleased with the overall…", "text": "Was very pleased with the overall outcome so far. It took longer than expected due to being out of State. Brandon kept us informed and worked hard to get us the best results possible.  Would/have Recommended you to friends looking to do debt consolidation.", "rating": 4}, {"title": "Everything was excellent up to and…", "text": "Everything was excellent up to and including closing. The pay offs however were not clearly communicated. The old mortgage was paid off by wire. That was excellent. The checks for the other payoffs were FedXed to us. They were delivered and LEFT on the front porch without notice. You seem to fall in a hole after closing. Why not wire all payoffs and then send notifications of when and where the payments were sent?Just a suggestion.", "rating": 4}, {"title": "The process was seamless & quick", "text": "The process was seamless & quick.  My officer (Blaine Rutledge) kept me well. Informed & only called/when necessary ", "rating": 4}, {"title": "Would have been 5+ Stars", "text": "Would have been 5+ Stars, but due to the many closing dates, that slowed things down/up, which was not my or their fault this time. Love our New Day Team, and will be keeping them, forever and always. Before New Day, we bought our Lot and house in July 2020, we had two other mortgage companies with that we had many bad relationships and cases. Our New Day took over in 2021, and we have never been treated so wonderfully and fair New Day has been the best for my wife and me.", "rating": 4}, {"title": "Wilmer; Refinance Specialist ", "text": "Wilmer; was professional, polite, and very knowledgeable!!  As well as his team, the experience was rather smooth…and my expectations were met completely.  ", "rating": 4}, {"title": "Mr bowman was very helpful throughout…", "text": "Mr bowman was very helpful throughout the process and as paper work was needed he gave us guidance where to get it the whole process was very simple ", "rating": 4}, {"title": "Successful loan", "text": "It was sometimes difficult to get my counselor on the phone.  After submitting documents several times, there always seemed to be one more thing.  My counselor was very caring and did return calls.  Closing costs were very expensive.", "rating": 4}, {"title": "My property taxes never went up prior…", "text": "My property taxes never went up prior to financing with New Day. I’ve been at this residence for 7 years but the last 2 years with New Day and my mortgage goes up every year. Not sure if this is just a coincidence, but it just don’t sound right to me. Update… Thanks for clearing this up. I will attempt to appeal locally", "rating": 4}, {"title": "It was slow going for awhile", "text": "It was slow going for awhile, I agreed with everything except when they told me my 1st pmt would be the 1st of May they changed it to April, They said I could save 2 month's pmts this way I'm  not saving a Damn thing. I know you won't get this but it's a shot", "rating": 4}, {"title": "Every thing went well at first up to…", "text": "Every thing went well at first up to the closing. After that it reminded me of buying an rv. They got my signature and did not hear from anyone about what was supposed to happen next. Had know idea of exactly when we would close and distribute funds. All of a sudden checks arrived and mortgage paid off. Otherwise it was ok.", "rating": 4}, {"title": "I feel I had NO control what so ever on…", "text": "I feel I had NO control what so ever on the decision of refinance. I was told how long the mortgage was going to be, how much money I would be allowed, or where it would go or who would receive my money. I was cornered, not reel comfortable. This has gone from affordable, to scary, raising my rate from 2.75 to 7.75 is not helpful, raising my mortgage $800 is going to make it tough and stressful.", "rating": 4}, {"title": "honesty.  patience. kindness. ", "text": "This young man that helped me is great at what he does but he should work on patience when dealing with seasoned customers. ", "rating": 4}, {"title": "The personal attention I received was…", "text": "The personal attention I received was outstanding. All my needs were met on record time. As a 20 yr. Navy veteran, I felt I was in the best of hands. I was assisted from start to finish. Thankyou Admiral and Matt Huss for the best experience of my life!", "rating": 4}, {"title": "The New Day representatives were very…", "text": "The New Day representatives were very professional and extremely helpful. The whole loan process wascompleted in a very timely manner. The New Day representatives were always available for questions or concerns throughout the loan process. I sincerely felt that these representatives did their best to provide us with the best loan experience.", "rating": 4}, {"title": "Was satisfied up to the last week when…", "text": "Was satisfied up to the last week when all of a sudden they needed all this information that should have been found out earlier in the process.", "rating": 4}, {"title": "Jordan was awesome and very helpful", "text": "Jordan was awesome and very helpful.  He explained the process wonderfully and ensured that all the paperwork I don’t need to see was managed so it was very seamless.", "rating": 4}, {"title": "the person that i worked with was…", "text": "the person that i worked with was cordial, answered all my concerns and helped me through this whole process with courtesy.  the tone of his voice was especially comforting.", "rating": 4}, {"title": "Excellent Employees ", "text": "We are giving this review not because of the company and the tons of paperwork and constant request  on a daily basis for new information, but because of the professionalism and courtesy of the employees. Especially Mr. Michael M. His professionalism and pleasant demeanor made the process much easier.We truly appreciated Michael M's obvious knowledgeand guidance, and would not hesitate to recommend him in the future,   ", "rating": 4}, {"title": "From start to finishyou speak to a person", "text": "    I was impressed that it was easy each step of the way right up to completing the process and The person I worked with was able to answer all my questions.", "rating": 4}, {"title": "Berdan's experience", "text": "Seemed easy and staff were helpful", "rating": 4}, {"title": "All in all the experience was very…", "text": "All in all the experience was very good.  There was a few issues that popped up that needed to be taken care off.  I worked with Joesph Delgado and Christopher Lee.  They were very helpful in completing the process.", "rating": 4}, {"title": "Matt was very professional and also…", "text": "Matt was very professional and also seemed to genuinely concerned. He was helpful and explained things very well.It was a pleasure to have him help guide us through this process.", "rating": 4}, {"title": "Overall it was an easy experience", "text": "Overall it was an easy experience.  Towards the end my loan advisor took an unexpected leave of absence and his manager covered the closing.  The communication could have been better but, under the circumstances, it went well.", "rating": 4}, {"title": "You are kept up to date all the way…", "text": "You are kept up to date all the way until the loan is approved and even after if there are questions they get answered ", "rating": 4}, {"title": "New Home and a New Day", "text": "Considering losing the earnest money in the 1st home I planned on purchasing. I was very leary of trying again. This one a few hiccups but all in all very happy. And happy in my home", "rating": 4}, {"title": "I don't know what happened to their…", "text": "I don't know what happened to their previous spokes person, maybe her contract was up....but this lady that you have now is like a bag of wet leather. Sorry to all involved. She just doesn't cut it. You better keep looking or better yet bring our girl back. And give her a pay raise.", "rating": 4}, {"title": "\"My\" NewDay USA Representative.", "text": "\"My\" NewDay USA representative assisted in every step by keeping me informed throughout the process.All questions were answered honestly and truthful, regardless if it was good or bad.The relationship was business with a touch of personal, which I thought was extraordinary professionalism.", "rating": 4}, {"title": "With being a veteran", "text": "With being a veteran, I finally found someone to help my family with our mortgage, and to help get rid of our second mortgage. Also to pay off some debts.", "rating": 4}, {"title": "as always it is wonderful to deal with…", "text": "as always it is wonderful to deal with a company that knows how to deal and work with the v a system getting us vets what we r entitled to", "rating": 4}, {"title": "Overall a great experience and…", "text": "Overall a great experience and assistance.   Wish interest rates lower.  Also if there a way to make biweekly payments.", "rating": 4}, {"title": "Our account representative was very…", "text": "Our account representative was very knowledgeable and easy to communicate with.  Answered all of our questions in a very timely manner. ", "rating": 4}, {"title": "Varefi", "text": "Entire process was quick and professional. Craig Burris enjoyable to work with. I'm stopping here because I don't enjoy surveys", "rating": 4}, {"title": "Rapid action to initiate", "text": "Rapid action to initiate,  approve and issue mortgage loan.  Easy access to, and replies from my agent.", "rating": 4}, {"title": "RELEIVED!!!!", "text": "Helpful and fast Service ,  Very Polite .Joe is the MAN!!!", "rating": 4}, {"title": "From the beginning to closing they…", "text": "From the beginning to closing they really took care of me and needs and answer every questions. Mr. Buscher was a big help. Everything that I asked of him, he his best to do it or gave me a better way in doing it.", "rating": 4}, {"title": "Quick fast simple", "text": "Quick fast simple, rep new what he was talking about and attentive during the process", "rating": 4}, {"title": "Nick provided a good experience by…", "text": "Nick provided a good experience by being available when we had questions.", "rating": 4}, {"title": "We appreciated the professional manner of the company", "text": "We had a good experience with our representative,Joe Crowley. He was helpful, courteous and understood our concerns.", "rating": 4}, {"title": "Colsom the man in charge of my case was…", "text": "Colsom the man in charge of my case was very responsive", "rating": 4}, {"title": "Easy to talk to always answered my…", "text": "Easy to talk to always answered my texts right away. Ryan has been awesome. ", "rating": 4}, {"title": "…2024", "text": "My account representative was very patient as we encountered many roadblocks mostly with the VA and Military Archives.", "rating": 4}, {"title": "The NewDay USA representative was…", "text": "The NewDay USA representative was extremely helpful. He maintained daily contact and kept me up-to-date throughout the entire process.", "rating": 4}, {"title": "Questions were answered", "text": "Questions were answered. Some things were hard to get done that needed done to the house, due to the weather. But Gino after about 2 months it is fine. Thank you. ", "rating": 4}, {"title": "Everyone was an absolute pleasure to…", "text": "Everyone was an absolute pleasure to work with!", "rating": 4}, {"title": "This process was very easy and they…", "text": "This process was very easy and they were very helpful, Colin went over everything step by step", "rating": 4}, {"title": "People who are concerned about journey.", "text": "The experience was very pleasant.  My team was courteous, professional, concerned and attentive insuring each step was understood and completed in a timely manner.  My experience was pleasant.", "rating": 4}, {"title": "The information that I was given kept…", "text": "The information that I was given kept changing and some of the information I sent did not was not accepted but overall experience it was quick and it was fast", "rating": 4}, {"title": "always let me know when they needed…", "text": "always let me know when they needed something", "rating": 4}, {"title": "New Day Agent", "text": "The agent handling our process was helpful, keeping in touch and responded to the information/data that we submitted. He answered all of our questions as we went through the process. He always responded to every call that we made to him and answered/or found the answer to our challenging questions. The process, for the most part was smootn.", "rating": 4}, {"title": "It was explained in a way we could…", "text": "It was explained in a way we could understand.", "rating": 4}, {"title": "Dylan was a great help all the way…", "text": "Dylan was a great help all the way through closing!  Sad thing is after that, no follow up to see if things were good. When my wife called for a question, it sounded like he was annoyed (per my wife).", "rating": 4}, {"title": "The process was quick and without any…", "text": "The process was quick and without any upfront cost and no risk if the loan was unable to be done. I won't use another lender for home financing in the future", "rating": 4}, {"title": "I would suggest that your personnel who…", "text": "I would suggest that your personnel who controls the VA loan requirement's get updated information for home repairs prior to the VA approving the loan. I was required to spend $1000 to do repairs that did not need to be done. I spoke with the VA regarding this matter and was told that the lending company could setup an escrow account for repairs on the home or proceed with the loan and require that the needed repairs are completed within 90 days. This is the straight from the regional office of the VA.With me suffering from multiple surgeries on my spine and two heart attacks over the past 4 years. I did not need to have the stress or strain on my body completing the repairs. Other than that, the gentleman that was assisting me through the whole process was amazing.", "rating": 4}, {"title": "Alec lasalle was great and made our…", "text": "Alec lasalle was great and made our refi smooth and easy to get through", "rating": 4}, {"title": "These people need to learn how to apply…", "text": "They are doing better today, still need some better communication. ", "rating": 4}, {"title": "Thank you for your professional job", "text": "Thank you for your professional job. Its very nice to be here. Liked", "rating": 4}, {"title": "New Day Experiences", "text": "Our experience with New Day has been exceptional. Most of our dealings were with Andres Lopez but I cannot ignore Lester Hooker, the Notary who was completely professional during the time he was in our home. If there is any comments I would suggest that New Day be more specific in the disbursement of funds along with the timeline of release of said funds.", "rating": 4}, {"title": "Thanks to the:VA in charge to many…", "text": "Thanks to the:VA in charge to many issues took two months to close.not at all happy w/ them", "rating": 4}, {"title": "The attention to detail and the pride…Satisfied", "text": "The attention to detail and the pride they do their work with are outstanding. Matt did a great job", "rating": 4}, {"title": "We recently refinanced our home.", "text": "We recently refinanced our home through New Day. James Murphy helped us through the whole process, from beginning to end.  His knowledge and experience helped us get our loan processed in a timely efficient manner. Thank you Jim for your help.", "rating": 4}, {"title": "Up until the closing", "text": "Up until the closing, the loan went fine.  Then I noticed that in the closing document I had paid 7,000 approximately with no knowledge of doing so.  There was a lot of reasons why it happened, however new day took the funds anyway. The question is; what I can do about it. I need help!", "rating": 4}, {"title": "95% went very well", "text": "95% went very well. I did find discrepancies in the Home Appraisal and had to get demanding to have the appraisal corrected. It fell in my favor by a positive $10k. Alot went on behind the scenes and required very little effort on my part. That is almost a 5 star   ratting alone. A little confusing on who was paying for the inspections since most required payment up front. So the disclaimer of no up front expenses is not totally accurate. I had to pay for my well and termite inspections but they were refunded during closing.", "rating": 4}, {"title": "Lots of Paperwork", "text": "It seemed to me that there was way too much paperwork. Our closing papers were 169 pages! Also, we did a cash out refinance to pay off some of our bills. On the credit card accounts and auto loan, Newsday does not pay the creditors directly. They sent the checks to us for us to mail to our creditors. That makes absolutely no sense to me.The refinance process itself was fairly quick and communication was timely and consistent.", "rating": 4}, {"title": "For the most part my experience was…", "text": "For the most part my experience was good. However, I felt there should have been a bit more personal touch to the conversations. Felt a little cold. But I have received the money. I am very appreciative for all of that.  Thank you.", "rating": 4}, {"title": "I am complaining about being forced to…", "text": "I am complaining about being forced to pay an additional $6,928.00 to get a mortgage from NEWDAYUSA, LLC.  I never approved this transaction. I reportedthis to Mr. Sipler, my executive advisor, and he put the blame on my former realtor, Mr. Kelley. This problem was placed in an E-MAIL", "rating": 4}, {"title": "Stay the course!", "text": "Mary and I appreciate NewDay's commitment to veterans and their home loan needs. Our experience during this refinance was almost disheartening; however, the decision to alert senior management was the turning point. Craig Burris did a good job to bring the process to full closure. We still have an important detail to resolve with Equity National, but we don't anticipate any difficulty.", "rating": 4}, {"title": "Responded timely to our financial needs", "text": "Responded timely to our financial needs ", "rating": 4}, {"title": "Renew", "text": "Original process was smooth until an issue with the contractor sent things spiraling. Dylan made contact with me and the process started moving again  and pretty much went smoothly from there.  I appreciate Dylan's keeping the process moving and keeping me informed. Thank you Dylan and I thank your team for helping me reach my goal. P.s. my neighbors approve of the updates and upgrades.", "rating": 4}, {"title": "Surprisingly fast", "text": "Surprisingly fast, efficient, and informative. That is the best way to describe this company and the process. It may also be a bit of a turn off for those really looking to process the home buying experience without feeling some pressure. The staff and all those agents involved, internally and externally, were professional, courteous, supportive, and patient. I would definitely recommend New Day USA especially for a refi.", "rating": 4}, {"title": "Mr Disher was helpful in every step.", "text": "Date of experience: May 15, 2023", "rating": 4}, {"title": "Was not informed enough as the loan…", "text": "Was not informed enough as the loan went on was told money would be wired but was sent in check and yes the right routeing number was sent but don’t thank someone in the team took time to check the paperwork", "rating": 4}, {"title": "Cash Out Refinance", "text": "Our experience was excellent and accomplished what we needed. But the account rep didn't really explain the exceptions for an 100% refi (needing to justify through obtaining written estimates. Had we known, we could have obtained estimates for all work on the house before submitting first application. The transaction was delayed some but not bad in our case. Thanks so much for helping.", "rating": 4}, {"title": "Easy to understand", "text": "Easy to understand ", "rating": 4}, {"title": "fast and efficient", "text": "fast and efficient . Issues up front with my lock in rate . Other than that I would recommend this to my Veteran friends . Thank you .", "rating": 4}, {"title": "A lengthy experience.", "text": "This was a very lengthy experience for my husband and I and one that I wasn't prepared for.  I was used to having a person come to the house, gather all the info needed, and sign the papers.    Having to do all of this correspondence thru the computer was very taxing for me.  I do not understand a lot of the terminology that is used but Colby did his best to explain it to me.  He returned my emails and calls promptly and was always courteous.", "rating": 4}, {"title": "PHGA", "text": "PHGA! I truly had a good experience this time with New Day. The team worked very hard to help me and they were very helpful in explaining items to me even if I would ask the same question more than once. Would I recommend New Day USA/Finance to fellow veterans? That is a strong possibility. I intend to list them as a resource on our community roster. God Bless!", "rating": 4}, {"title": "Very professional and courteous…", "text": "Very professional and courteous customer service. My representative kept me updated and informed throughout the entire process.  There were a couple of minor issues, but, were quickly corrected.  I would have liked a more favorable interest rate and APR % based on my credit rating and income level, especially, on the advertised rates offered in the numerous commercials.  I was a bit surprised on the overall cost of my VA re-finance loan.", "rating": 4}, {"title": "Rough Sailing", "text": "I would like to think my Account Executive Austin Krauss. Doing the refinance process, we ran into quite a bit of snags. Austin kept an optimistic frame of mind. I almost gave up and cancelled the deal a few times. I felt that the underwriting team was asking for thing that they had the answer to. Austin stayed positive and kept me in the game.", "rating": 4}, {"title": "Recent closing", "text": "At times was a bit confusing and difficult to complete and return documents or information as I do not have a fax machine or all new technology as far as a cell phone is concerned.  Was very disappointed that only a notary conducted the closing and could not answer our questions.  However, Kevin was very helpful and tried his best to assist me in getting everything accomplished.", "rating": 4}, {"title": "Up to this point it's been great", "text": "Up to this point it's been great. James Conley has helped us a long the way.But right now I have been expecting payoff checks, and I understood that I should of had them about three days ago.  I have called him several times and he has yet returned my phone call.  Maybe he took some time off or is sick, I don't know, and possibly I misunderstood.", "rating": 4}, {"title": "Over all things went well in the end", "text": "Over all things went well.  The only reason I am giving only 4 stars is it seemed like our mortgage agent kept changing and there seemed to little communication between the one leaving and one taking over.  The last person we dealt with was Brittney Darmsted who was absolutely awesome.  She took over and it felt like we were the only clients she had.  Brittney communicated with us regularly and she was interested in us and getting us to the closing table.  If its possible as you start down the road to home ownership and you can request one person to work with make it Brittney.", "rating": 4}, {"title": "It was good except for how long it took.", "text": "It was good except for how long it took. ", "rating": 4}, {"title": "Our loan officer wasn’t as attentive as…", "text": "Our loan officer wasn’t as attentive as we would have wanted. For example, we needed multiple private well water tests (3) because of contaminates, and he assured us all costs ($70 each) would be considered in the final payout. We only saw one $70 charge documented. I called him on 2/23 in the AM to question the figure. As of 2/25 in the PM we still haven’t heard back. Not happy…", "rating": 4}, {"title": "Started the refinance to get equity and…", "text": "Started the refinance to get equity and a lower rate. In fortunately the guy that I stared with quite or got fired or somthing and I went unnoticed until I called back, by that time the rates were going back up. But the over all experience was easy and didn’t take very long.I am happy😁", "rating": 4}, {"title": "We appreciate all that was done", "text": "We appreciate all that was done.  However, it would have helped to be provided a checklist of any and ALL items required of us during this process.  It seemed that every time we thought we were close to the end we would hear there is one more thing we need, time after time.  You can't foresee some things maybe, but most things are on any refinancing.", "rating": 4}, {"title": "Everything went well and moved quickly", "text": "Everything went well and moved quickly. Was a great experience. The only reason I didn't give them 5 stars was bill paying. Rather than giving me the money directly. So I could pay off bills instantly on line. They sent me checks that had to be mailed to each creditor. Makes the pay off process take longer.", "rating": 4}, {"title": "There's Very Little Time Wasted", "text": "Well, the first representative was a total incompetent.  I understand that he's no longer with New Day.   The next rep who stepped in to make things right was very professional.  However, on a couple of occasions he asked me to provide information and I did with text messages and email.  But then I get a call asking for the information.  Who knows, perhaps he's twirling lots of plates.  Not a big thing, but you asked.  But ultimately it was really a seamless.experience.", "rating": 4}, {"title": "Very Helpful", "text": "Everything was great during the process except the availability of my agent conflicted with my schedule. I felt they should've switched me to someone who worked my avaliable days to make communication a little better.Overall everything was still taken care of in a timely manner, and professionally.The one thing that almost made me change the current rating is the pressure of getting the signing done during days I work. I would tell agents repeatedly that I work Tuesday through Friday 7am to 8:30pm, then they would ask me if they can schedule the signing on Wednesday. This was rather irritating because it happened multiple times. Agents need to realize we're people too sometimes, and we have to put food on the table regardless if they have vacation or deadlines coming up.", "rating": 4}, {"title": "New Day did a good job and came through…", "text": "New Day did a good job and came through with a quicker closing than originally anticipated. One suggestion would be to pre-qualify your borrowers before asking them to spend money taking properties out of trusts and ordering termite inspections.  A borrower deserves to know that their debt to income ratio is in line with qualification guidelines before being asked to spend money and provide countless pieces of documentation.", "rating": 4}, {"title": "Best mortgage experience", "text": "We've had an amazing experience. Our loan officer was very responsive and helpful. The close process was simple and we did not even have to leave our home. The notary that came to our house was helpful and pleasant to work with. I have had some horrible mortgage processes and this was the complete opposite. I am so glad we refinanced with NewDay USA and simplified our mortgage and lowered our interest rate. Thank you NewDay USA.", "rating": 4}, {"title": "New Day USA and Gabrielle", "text": "New Day USA and Gabrielle Garza did a fine job for me.  Gabby was friendly, professional, courteous, and kept me informed through the whole process, either by phone and/or email.  I believe that she did her very best to get me the best deal possible.  This is the second time that I have used New Day USA to refinance my home, and if the opportunity or need arises again over the years, I will have no problem or hesitation in using New Day USA again.Bob in LouisianaVietnam Era Veteran", "rating": 4}, {"title": "James", "text": "James, my contact person, was professional in all respects lacking only in two areas; 1: He is too serious, with knowledge of compliance, a bit of humor is ok, and 2: taking several attempts to reach him was concerning but then again, he did express that his illness prompted him to work from home. All in all, James and the organization performed very well.E5 Sargent,Michael Ayotte", "rating": 4}, {"title": "Great service from the Representative, but to much paperwork required for the Tax Filings.", "text": "Great service from the Representative Sarah, but provide some of thepaperwork required was not the best. Providing 2 years of Full Tax Filings was a real Delay, when I provided the two page report that My Tax Acct. had me sign to submit to the IRS. 50+ Pages needed by NewDay USA than the IRS needed.", "rating": 4}, {"title": "Contact before closing was awesome", "text": "Contact before closing was awesome.  We have not received any contact after signing.  We were told that it would take a few days and we would receive the checks for paying off things,  It would have been nice to here that you received the signed documents from the Notary and exactly what happens after that.Kind of seems like once you got our signature you quit communicating.", "rating": 4}, {"title": "Customer Service is Alive & Well at New Day USA!", "text": "Being a veteran is very important to me.  I am proud to have served and consider myself a patriot which is why I sought the services of New Day.My transaction was handled by your Asher Malik.  Not only did Mr. Malik make this an extremely smooth process, the loan closing actually took place two weeks earlier than the projected target date.I know that I can depend on New Day for my future financial needs.Thank you for making this a pleasant and successful transaction.", "rating": 4}, {"title": "Everything was a good experience, except", "text": "Everything was a good experience. The only issue was the funding. We signed paperwork and provided a voided check for a wire transfer then received a check 3 days after the account was funded. This caused another expense for the items we needed the funding for. Other than that our experience was good to go", "rating": 4}, {"title": "We hit some snags along the way", "text": "We hit some snags along the way. It took 5 months to get to closing. The people we bought the house from stated there was a septic tank/system which turned out not to be true. Although in my eyes, the previous owners should of paid for new septic system and tank (which would of took boat loads of money and lawyers) I am so grateful that New Day USA was there for us with the refi cash out.  I now have a new septic system and tank and paid off some bills as well. Thank you Admiral for what you do for veterans!", "rating": 4}, {"title": "Agent was very helpful and answered any…", "text": "Agent was very helpful and answered any questions I had. He explained the steps in the process and there were no hidden items or items required at the last minute. Also he provided me with a direct telephone line to him and kept in touch throughout the entire process.", "rating": 4}, {"title": "Good rates but", "text": "I liked the rates however we ran into many issues when dealing with the company. I was in the hospital and we told them this at the start. When we got to the signing they said I had to get discharged.  We couldn’t get a notary in the hospital. Turns out that was not true. It worked out but we had to jump through many hoops to get the paper notarized.  My second issue is that my loan was approved and they kept asking for paperwork up until the last day that we had to sign the paperwork. It was the worst experience we have had with a loan company.", "rating": 4}, {"title": "I thank you for taking a Second look at…", "text": "I thank you for taking a Second look at my loan application after the first was turned down and Curtis worked real hard to get me approved my credit is pretty good but debt to ratio was holding me back and I thank you guys very much for all that you did for me and my family and now you have a good bunch of people working for you and all I can say is thank you very much I have never had KeyBank to work for me the way that you folks did and I have never had another financial institution look twice and work it out and to give me the money that I needed thank you guys so much is all I can say", "rating": 4}, {"title": "Payout Checks, really?", "text": "Towards the end, there was some confusion about payouts. We received 3 checks and didn't know what to do with them. One was made out incorrectly and took an extra week to remedy. The information we were provided for that third check was still incorrect but after a couple of phone calls to the payee, we got it all straightened out. Had we known the payouts would be in the form of a check, that we would have to in turn mail out, we would have just received the funds ourselves electronically with the other equity payment and dealt with the payouts ourselves.", "rating": 4}, {"title": "Great people, website not as good", "text": "Working with Neil was a pleasure. He became a friend during the process. If he wasn't immediately available when I had a question, he called me back shortly thereafter. I felt comfortable and well-informed throughout the process because of his efforts.The borrower's portal is what kept me from giving five stars. The design is lacking, but, more importantly, my documents weren't available throughout the process. The loan estimate and closing disclosure would be there one day and gone the next. I had to call Neil multiple times to get documents that should have been on the portal.", "rating": 4}, {"title": "HOME IMPROVEMENT REFI WITH CASH OUT", "text": "Zachary was very nice and professional, and everything went fairly smoothly.And then we closed...The cashout funding was to be deposited in our bank on Oct 15th, but that day came and went- no money. After phone calls to the bank and New Day on the 18th,  it was determined that the checks were mailed to us- just what we requested not to happen. It adds a whole new layer of inconvenience by driving 45 minutes to our credit union and then waiting for the hold to be lifted from the deposit before we can use that money for improvements.  Otherwise I guess it went fine.", "rating": 4}, {"title": "NewDay USA deliveres", "text": "It is not easy deciding who to trust when financing a home, may I recommend NewDay USA. The NewDay USA team delivered. NewDay USA quickly responded to my online query, help understand a best fit, and minding every detail provided a successful experience. In the end NewDay USA was great.", "rating": 4}, {"title": "Ted Preaster was very helpful and…", "text": "Ted Preaster was very helpful and knowledgeable. The hole process to longer that I thought but he kept me calm and patient till the end. Thank you all for having confidence in my wife and I to take over our loan.", "rating": 4}, {"title": "NewDay reaction time to requests kept…", "text": "NewDay reaction time to requests kept me confident through my entire refinancing process. They were very professional, honest and accommodating. I would recommend them to anyone who is starting a new journey of home purchasing or refinancing.", "rating": 4}, {"title": "Everything went great through to the…", "text": "Everything went great through to the closing, but after we close the cashout check was sent to my house by mail. We requested direct deposit and voided a check for that purpose. now there is a five day hold on the money that we need.", "rating": 4}, {"title": "Sometimes the third party credit review…", "text": "Sometimes the third party credit review company was not updating my point of contact. I would get multiple phone calls and when I returned the call they would say I was good? It was frustrating at times.", "rating": 4}, {"title": "Very smooth Erik was a great person to…", "text": "Very smooth Erik was a great person to work with. Had trouble with closing documents not being signed and the person i delt with on this matter was less than ideal would always cut you off when you were speaking and a demeaning attitude.", "rating": 4}, {"title": "It was pretty good and very fast", "text": "It was pretty good and very fast. I had some difficulty with getting documents returned so quickly as they requested. Also, the staff assumes that its customers are very computer savvy and for many of us this is not true.", "rating": 4}, {"title": "Overall an excellent organization", "text": "Overall an excellent organization. There were some communications gaps between their “selling” me the product and then actually following through. All that is likely related to the affiliates that process the paperwork.", "rating": 4}, {"title": "Did a refi with cash back and from…", "text": "Did a refi with cash back and from another refi some years ago this one went very smooth.  BROOKS KNIGHT was awesome to work with. We will and have recommended you guys to other people.", "rating": 4}, {"title": "after i signed my loan documents i left…", "text": "after i signed my loan documents i left a couple of messages for my loan officer to call me back but still no calls. i also received a call from your                              \"funding    \" department regarding a number on the dayte of one of the documents after my cancellation notice was over and when i asked why they waited until my 3 day cancellation was over he couldn't tell me why. i then left a message for my loan officer to call me and still have had no call back. it just seems to me that after your company gets the loan signed you don't really care about your clients. i am happy you were able to fund my loan but not happy about afterwards.", "rating": 4}, {"title": "From worst to First", "text": "I was referred to New Day from an internal employee, James Wombles, and my initial contact from Isiah went very well. I knew he was working from a script which is often the case with a new company. His follow up call the next day is where things \"went off the rails\" as he basically asked the same questions as the initial contact. Frustrated, I voiced my displeasure to my real estate agent whom was referred by New Day and she got me in contact with Destinee Stice. Destinee took full hold of the process and righted the sinking ship. My hats off to her, Emily Harper her processor and the Team that assisted in getting our mortgage with a great rate!", "rating": 4}, {"title": "The experience with NewDay was one of…ease and assurance", "text": "The experience with NewDay was one of professionalism and courtesy I'm a veteran and it was greatly appreciated to know my lender's options on refinancing my home. Thank you admiral and the NewDay family!", "rating": 4}, {"title": "The process was a bit clunky at times", "text": "The process was a bit clunky at times. Matt was very polite and helpful, the clunkiness was out of his control. There were several new requests for additional documents which is my rationale for the 4/5 rating.", "rating": 4}, {"title": "The service provided by Colin Hall was…", "text": "The service provided by Colin Hall was as good or better than his handling my original mortgage (superior). The first was as professional as one would expect. The 4 star rating reflect your IT dept. When the original package was emailed to me there was a question which did not have an online signature making it impossible to complete and submit the package. The information given to me was it was a problem with my computer. I have owned my own site, taught Website development at the college level, and developed web pages for several individuals. It appeared to me that a line was not placed in that page. The solution should have been to copy and insert the line on that page.", "rating": 4}, {"title": "This was both the best and most…", "text": "This was both the best and most frustrating experience ever. I truly appreciate Javonte for all his help.", "rating": 4}, {"title": "From initial phone call to close the…", "text": "From initial phone call to close the process was simple.   I had Mr. Morgan to assist me through the procedures and Mr. Acosta to assist with the application and they made everything work.  I was quite impressed.", "rating": 4}, {"title": "Smooth process; communication lacking", "text": "The process ran smoothly.  I was able to refinance in very short amount of time, but communication was not great.  Basically, two conversations and no follow up.  I received the money in my account, but I am still not sure if checks are being mailed to my creditors, to me, or done electronically.  The loan processor that I worked with went on vacation during the transaction.  I completely  understand because it was during the holidays. I received an email from him providing his alternate’s information, but no forewarning or I would have likely waited until his return.  I was contacted by the alternate to resign a document and I have not heard a word from anyone and the payout was on 5JAN.  I have reached out to both, but no response as of yet.", "rating": 4}, {"title": "VA had an awful time dealing with…", "text": "VA had an awful time dealing with Appraiser, it was not New Day's issue or fault, just made the process drag out and very painful. All dealings directly with New Day was awesome and Corey was great!!!", "rating": 4}, {"title": "Entire process was smooth, but.....", "text": "Entire process was smooth, until closing. In our situation I am the only person ever listed on the mortgage, deed, insurance etc. My spouse was forced to sign a single document with NewDay USA acknowledging that I was making changes to the mortgage, and she was informed she would have to sign that single document at closing. When closing occurred, NewDay USA was unaware of the Laws in my state that required her to sign that single document, PLUS 6 additional documents that required her PII (Personal Identifiable Identity) to be added to complete the refinance. Needless to say, neither of us were happy about this occurring at closing. NewDay USA needs to be forthcoming with all documents that a spouse not on the mortgage will need to sign with the Title Company in that State and advise the client prior to closing, so it's known prior to the closing process and not a surprise. Our Loan Originator Nigel was OUTSTANDING though, great clear and fast communication via any preferred method of call, text, or e-mail.", "rating": 4}, {"title": "everything workout smoothly", "text": "everything workout smoothly for the process, only dissapointment i had with nwday was all ads i see offered cash out, but when i tried to do this i was told it couldn't be done in texas", "rating": 4}, {"title": "Nothing went wrong at all everything…", "text": "Nothing went wrong at all everything was taken care in a timely matter and our rep was very respectful and courteous. No complaints", "rating": 4}, {"title": "Great and timely cashout options", "text": "Great and timely cashout options. I wish they worked more closely with my creditors to send them their checks directly but all was done securely and to my satisfaction personally.", "rating": 4}, {"title": "Maybe some SOPs?", "text": "Good afternoon,                      This is the 2nd time I have used New Day, the first (and original) was to get my mortgage under the VA, and the 2nd (current) was originally only to lower the interest rate. The current loan changed however, from an IRR loan to a cash out. My original amount was supposed to be for enough to do an addition at my house, but ended up with my interest rate, payment going up and my cas out going down. The only real frustrating problem is that there are (on both loans) a lot of last minute requirements that pop up… my closing changed by nearly a month both times due to last minute requirements that came up literally the day before we closed. Being retired Military it’s just another day at the office, but If I were a military oriented organization, I would make an effort to know the procedure and documents required better.", "rating": 4}, {"title": "It was a good experience", "text": "It was a good experience, Although the first offer was almost $4000.00More expensive to me than Freedom Mortgage offered. But then NEW DAY USA. matched it and I went with them..Thank You", "rating": 4}, {"title": "I would have given 5 stars but there…", "text": "I would have given 5 stars but there was a mistake on my Wife's  name  that was suppose to corrected early in the process and when we closed the mistake was still there", "rating": 4}, {"title": "Timely processingLoan", "text": "Timely processing", "rating": 4}, {"title": "4 stars instead of 5 due mainly to…", "text": "4 stars instead of 5 due mainly to sometimes poor communication between myself and my contact agent @ New Day.....Otherwise, I was satisfied w/ my experience w/ New Day.", "rating": 4}, {"title": "Good, not necessarily great", "text": "Great service, good customer support. Loan costs were a little high, I feel taken advantage of by the fees heaped into the loan. But overall the product served its purpose.", "rating": 4}, {"title": "Your representative needs to keep the client informed in a timely manner", "text": "Your representative needs to issue/give more feed back by keeping the veterans up to date. We received last minute information such as our final closing cost. We didn’t know that the amount jumped from $9100 to 10100 until the week of the initial closing. We had to borrow money to meet that amount and change the original closing date because of late information. Had we known this in advance we could have handled things differently. Keeping the buyer informed works better. Kevin Mullen kept us guessing about what was going on. I’ve already informed others to be careful of this last day information. Kevin raised his voice to me, didn’t keep us informed in a timely manner, and at times was not professional. Had it not been for our realtor Markita Lyons, we were ready to quit and use another lender. But, we trusted her to look out for our best interest.", "rating": 4}, {"title": "Just a number!", "text": "I would get updates and messages throughout the process, but once the closing was done, I never heard back from you guys. Seems like I was just a number, not a client.", "rating": 4}, {"title": "My only disappointment was I could not…", "text": "My only disappointment was I could not refi for 100% because I have only been with my company for a year even though I have been in this roll for 25 years", "rating": 4}, {"title": "I'm not good at this new technology so…", "text": "I'm not good at this new technology so every day was a new problem thank God for miss Megan b I couldn't of done it without her", "rating": 4}, {"title": "Great experience overall", "text": "Overall, our experience with New Day USA was great.  The main issue we had was not always getting a timely response when we contacted our New Day representative.", "rating": 4}, {"title": "Great customer service ", "text": "Constant communication and updates along the process.", "rating": 4}, {"title": "Had a great experience with this…", "text": "Had a great experience with this company.  Straight forward, great customer service. These folks are excellent to work with for your mortgage needs", "rating": 4}, {"title": "representative Phillip", "text": "representative Phillip, was extremely helpful and accommodated all of my questions expeditiously.", "rating": 4}, {"title": "new loan", "text": "brooks knight was very attentive to our needs ansered our phonecalls and was very nice   i think  howerver the closing costs were a little high  bb", "rating": 4}, {"title": "Good Experience", "text": "Fantastic customer service from beginning to end.   Someone was always available to answer questions.   Everything went step by step as described.", "rating": 4}, {"title": "Everything was going good my acct", "text": "Everything was going good my acct. Rep. told me I was going to have to see a probate attorney. I stressed about that through the weekend.", "rating": 4}, {"title": "Very simple painless process", "text": "Very simple painless process.  Only item we were not informed when closing was.  Had to check old mortgage company to see that account closed.", "rating": 4}, {"title": "I felt like the service was very good.I…", "text": "I felt like the service was very good.I felt like the appraisal was low.No mention of the great landscaping or the beautiful pollinator garden.", "rating": 4}, {"title": "The whole experience was great", "text": "The whole experience was great,  all questions and issues met timely. Everything played out nicely and closing happened very quickly.", "rating": 4}, {"title": "REFINANANCE IS NOT SO HARD", "text": "FRIENDLY AND HELPFUL", "rating": 4}, {"title": "There was some initial confusion", "text": "There was some initial confusion, but once the right rep Thomas got involved, things went great", "rating": 4}, {"title": "Service review", "text": "I received excellent service from Mr Gatewood.  All my questions were answered and he made himself available.", "rating": 4}, {"title": "Everything from the beginning up to the…", "text": "Everything from the beginning up to the closing went extremely well. It worked like a well-oiled machine. We are very satisfied.", "rating": 4}, {"title": "Everything went smoothly", "text": "Everything went smoothly. It got a ĺittle overwhelming sometimes, but I could just call and somebody would walk me through it. Good job!", "rating": 4}, {"title": "It was stress at the beginning but it…", "text": "It was stress at the beginning but it started to get better,the credit report is what I hate but other wise everything what great.", "rating": 4}, {"title": "To interested in my other land that is…", "text": "To interested in my other land that is paid for, needed to know too much. But everyone was very helpful and stayed on top of it.", "rating": 4}, {"title": "Where’s the cash?", "text": "Everything went smooth until it was time for money to be deposited in our account. Still haven’t seen the cash we are due.", "rating": 4}, {"title": "I never received the paperwork for the…", "text": "I never received the paperwork for the 1st payment. I had to call many different numbers to finally get my payment set up.", "rating": 4}, {"title": "Griffin Bell was very considerate and…", "text": "Griffin Bell was very considerate and professional", "rating": 4}, {"title": "The loan process was faster than I…", "text": "The loan process was faster than I expected and also easier.  All the people I spoke with were polite and professional.", "rating": 4}, {"title": "First time I reached out to New Day I…", "text": "First time I reached out to New Day I was not followed up with. This cost me real money and months of time.", "rating": 4}, {"title": "Excellent", "text": "Excellent, courteous, Helpful, easy. Is how I would  describe my experience with New Day USA. And Fast. Very knowledgeable.", "rating": 4}, {"title": "The purchase was complicated by VA's Watertide clause nonsense", "text": "The purchase was complicated by VA; however, NewDay Navigated the problems and saw us through to the end and the purchase.", "rating": 4}, {"title": "Very responsive and always keeping us…", "text": "Very responsive and always keeping us updated and explaining when we weren't as computer wise as we needed to be.", "rating": 4}, {"title": "Happy with the professionalism of New…", "text": "Happy with the professionalism of New Day.  I would have given 3 stars because of Daniel Fleming.  Barbara Wilson", "rating": 4}, {"title": "Great during the process", "text": "Great during the process, closing was actually earlier than set.  Trying to contact them after closing not so good.", "rating": 4}, {"title": "Good Experience", "text": "Overall good experience, only issue was trying to register on Servicing Center website.", "rating": 4}, {"title": "simple process with professional help…", "text": "simple process with professional help from New Day staff.", "rating": 4}, {"title": "Great help from everyone", "text": "Great help from everyone.  It was a smooth process getting all the forms completed,and no delays.", "rating": 4}, {"title": "Wire Transfer Routing number", "text": "Don't forget to notify of obtaining certification for routing number not on che k", "rating": 4}, {"title": "Satisfied", "text": "Well, my husband and I have purchased about 9 homes over our lifetime. Three of those home loans were VA’s. This was our first experience with New Day. It was a fast and easy transaction. We are prime clients-excellent credit, with a house that has built up tremendous equity over five years. It was a clean loan. Our objections is just one thing: we are getting a refund from our old lender and part of that refund is an overpayment in the payoff amount. To us we feel that if the figures New Day had received-taking our best interests in mind, we would have had a new loan amount minus what we overpaid. Yeah, everybody’s out to make money, but I still think New Day should be above the curve-taking all the detail in mind-dates clients make monthly payments on existing loan,, clients fixed income, etc into account to really save the client the most money-especially now. What would our new loan have been minus $749 ? It’s stuff like this that adds up. Maybe not to the provider, but definitely to the client. Also, notaries in town charge $65- New Day doubled that fee. What else did they double?Its too late now.  Well, that’s our take on all of this. Some things never change.Hopefully when we elect auto payment things will run smoothly. Hoping so!", "rating": 4}, {"title": "Our process went very smoothly and…", "text": "Our process went very smoothly and closed within 2 weeks.That said, New Day regularly stated that they had better rates when in fact they did not.They presume that the borrower is ignorant when it comes to buying interest rates down. On multiple occasions our agent offered lower interest rates only to find out he kept adding points into the equation. Even after I asked that he not do it.Ultimately, each borrower should seek information from experienced people to walk them through the pros and cons associated with a refinance.New Day is in the business of making money (nothing wrong with that) but they do so by inferring great deals when oftentimes they are anything but great deals.If the borrower is not acutely aware of the pros and cons, they may actually be conned by New Days disingenuous lending practices.To be clear, I am acutely aware and made an educated and informed decision because in my unique circumstance, it made financial sense.For most people it would not.The best part of this experience was the speed by which New Day was able to complete the transaction.If you are well educated and understand the process in its entirety, then New Day is above average with their cash out refinance product.", "rating": 4}, {"title": "RESPONSE TO NEW DAY", "text": "We have been in process for a Cash Out Refi with New Day, since 9/8/2021.  In their portal we are listed as \"Cleared to Close\" since 10/29/2021.  We have  been contacting our Account Exec. since Thursday, 10/28/2021.  We have left voice mail messages everyday, including two today.  We have not received one return call back from Connor Gray.  This lack of communication has left us confused.  We have attempted to be patient with the process, however, we are at a loss as to this total silence from our acc't exec.  To date we still have not seen a final HUD Financial Statement to approve before closing.  We don't even know if or when we will have a closing.Does anyone have an explanation about this terrible customer service?Karle & Palma Kunkel   Loan # 1743930My account executive just called at 3:00PM to advise that we will be receiving final closing docs to review either later today or tomorrow.  I asked when we will be closing and he told me that it looked like either Friday or Saturday.  I am sorry that it took, what I consider, drastic measures to get this information as he has always been a very polite person and easy to work with.  Hopefully, we are on better footing and things will go smoothly from this point on.", "rating": 4}, {"title": "Process was great up to the closing…", "text": "Process was great up to the closing part, that part was not explained very well", "rating": 4}, {"title": "got people not machinesTed was helpful…", "text": "got people not machinesTed was helpful and kept me in the loop at all times. thanks", "rating": 4}, {"title": "Wonderful company", "text": "Wonderful company. Only issue I had was kept moving my closing date about 4 times.", "rating": 4}, {"title": "We've used New Day before and no…", "text": "We've used New Day before and no complaints.  Everything went fairly smoothly.", "rating": 4}, {"title": "Professional attitude and ability of…", "text": "Professional attitude and ability of loan officer", "rating": 4}, {"title": "Outstanding service", "text": "Outstanding service. Polite, answered all our questions.", "rating": 4}, {"title": "Loan Process snd Finalization", "text": "All in all, I felt that I was making the correct decision to refinance with NewDay. The process was pretty much easy to do with some minor exceptions. Those exceptions didn’t interfere with completion of my new loan but they were a bit frustrating, especially for a 78-year-old male. My account executive was very competent in finalizing my loan but failed to return a few of my calls when I left voice messages for him. My calls were about processing g problems that left me somewhat confused but, even though it may have taken awhile to get back to me, he eventually did and then helped me through the process. Another issue I gave is dealing with the loan registration process whereby I’ve tried to go online to mortgage questions.com and went through the process of completing all the required information and, in the final analysis, got a message that there was no record of my loan. I even called the help number snd the woman I spoke with said the same thing / no record of my loan. I have yet to register to begin making automatic payments. I’ll be leaving my home for more than a week to deal with a family medical issue snd will not be able to deal online with this issue because I won’t have a secure network to complete this process. I believe there’s been more than sufficient time to get my loan data on line so that I can finalize my ability to set up automatic payments. The lack of being able to do this is more than a bit worrisome and frustrating.", "rating": 4}, {"title": "Overall New Day was excellent", "text": "Overall New Day was excellent.  Honest, fast and easy for me to understand.", "rating": 4}, {"title": "Purchase", "text": "I’m a bit disappointed that I did not get a better interest rate.", "rating": 4}, {"title": "Refi with Equity Cashout", "text": "I worked with Brendan Cavanagh for the just completed equity refinance on my residence, and I was very pleased with the attention I received during the approval process. We hit a bump in the road during the process on my homeowners insurance. The annual premium was not paid in a timely manner, admittedly this was partly my fault, but I did make it known in time for action to be taken. This did not happen and the result was that my insurance was suspended, my insurance lapsed, then the payment was schedule for December 2022 rather than December 2021. I noticed this immediately, but it took intervention from Brendan to get the issue resolved and my closing was delayed for several weeks. A big thank you to Brendan for his proactive involvement!!I also have a recommendation for the future. The main reason I took out equity in the refinance was too eliminate credit card debt. Checks I received to pay creditors were made out to the creditor names listed in my credit reports, not the actual payee information in my monthly statements. All payments are now successfully completed, but two payments took longer to clear than the others. I mailed all payments on the same day, all had payment coupons with them, and several went to the same city/state. I do realize that some creditors are slower to process than others, but I can't help but think that having the payee name be exactly correct would help. My recommendation is that part of the process include getting correct payee information.Closing signing was excellent and the documents I signed were well explained.My overall rating is 5 stars to Brendan and 4 stars to the process.", "rating": 4}, {"title": "My wife and I contacted NewDay12/8/2021…", "text": "My wife and I contacted NewDay12/8/2021 and we closed on 3/12/2022. A representative reached out to us on 12/9/2021.  Our main purposes of the refi was to obtain a lower interest rate, eliminate the mortgage insurance cost and capitalize on the equity in our home.  Shortly after the initial application and document collection process we locked in a interest rate slightly higher than our original loan but acceptable.  On12/9/2021 I was then asked to provide my divorce decree from 30 years ago.  I complied but then I was asked to provide every document including court orders from that divorce. I thought this was rather odd as I've never been asked this before for any other mortgages before.  However, I contacted the Delaware Court on 1/12/2022,  I finally received and provided 87 pages to our representative. (Roughly a 30 day delay in processing).  Our date of interest rate lock again had passed and consequently our interest rates rose again.  We completed both an appraisal and Wood Destroying Insect inspection/report.  I tried several times in as many days to contact our representative by phone leaving voice mails and by email but to no avail.  On or about 2/25/2022 a new representative contacted me and got things moving forward once again.  Because of the new representatives outstanding hard work and customer service he pulled things together and achieved closure therefore, I rated 4 stars.   I can't help but feel if James OConner was our representative at the begging of our quest the final interest rate would be lower, closing would have been sooner and I would rated it 5 stars.Thank you for all you do and giving me this opportunity comment.", "rating": 4}, {"title": "Service was excellent thanks to all who…", "text": "Service was excellent thanks to all who helped.", "rating": 4}, {"title": "It was harder than it needed to be!", "text": "We started our application with New Day In the second week of January. We had a very nice representative helping us. We provided all documentation that was requested and were told we would qualify for a loan . The next week was signing all the required paperwork and checking credit reports. During this time we were in contact with our assigned account person who once again told us things were moving forward and we would have a closing date in February. We were very excited and started to make plans for some needed home improvement projects. Two days before the closing date we get a call stating our loan was denied based on a vague credit report that was over 5 years old. Needless to say we were totally caught off guard and so disappointed. We were not given any other options at that time.My husband is a veteran of the Viet Nam war and felt New Day understood veterans and their issues better than any other lending agency so we were totally at a loss. The following day we got a call from Kris who wanted to know how we were doing. We were quite surprised! I let him know how disappointing the denial decision was and proceeded to tell us that their finance team wanted to take another look at our file if we would agree . We said yes and the process started all over again. This time I felt that Kris and his team were really looking out for our best interest. The policies and procedures of New Day differ greatly from most other lending agencies and that caused a few anxious moments but we worked through them with The help and guidance of Kris and his team. We closed our loan last week and received our check after the 3 day waiting period. I would suggest direct deposit to make it easier on your customers. Over all we were very pleased with  the second application process . Kris was a joy to work with and made us feel comfortable and important. Thank you Kris for helping us to make it happen!!!", "rating": 4}, {"title": "No complaints so far", "text": "No complaints so far. Application was easy enough.", "rating": 4}, {"title": "Everything went fine.", "text": "Date of experience: September 12, 2022", "rating": 4}, {"title": "Professional", "text": "Professional, knowledgeable staff.", "rating": 4}, {"title": "Very helpful and fast", "text": "Date of experience: March 11, 2022", "rating": 4}, {"title": "Keep up the good work", "text": "Date of experience: February 16, 2022", "rating": 4}, {"title": "My 2022 Refinance", "text": "This was my third time to refinance with New Day and it will probably be my last. Primary reason is that I need to start building equity in my home. Secondary reason is that I have experienced a few issues in the processing of the last two.Positive comments:Joe Delgado, my Account Executive, did a good job.  Generally, he was timely in his responses and kept me informed on the status of my loan application.  I realize my account was probably not the only one he was assigned. He answered all of my questions, even if I didn't always like the answer. I am satisfied with my monthly mortgage payment, this time.  Being able to bundle my personal and auto loan payments, will help me tremendously. My previous refinance had an issue (loan estimate did not include my Windstorm and Hail Policy in my estimated monthly escrow payment) that I was able to identify during the application process. Adding the cost of this policy resulted in a higher monthly mortgage payment.  This was an issue for me as I was under the impression that a lower monthly payment was New Day's primary marketing point to veterans. Negative Comments:During the application process, from the first phone call to the last phone call on 3 Jan, I had been told that I would receive a significant cash payment at closing.  During the first phone call from Joe, I believe I was told something to the effect that based on my finances I may receive as much as $20K. The exact statement(s) can be confirmed in your recorded phone calls with me.  My 2 Dec Loan Estimate showed a reduced cash payment amount of $11,846 but still significant to me nonetheless. I didn't retain copies of the other loan estimates I reviewed but believe they too showed me still receiving a cash payment at closing. I can't recall the actual amount but believe it was $3K - $4K. On 3 Jan, Joe contacted me that the cash payment at closing was being completely eliminated.  And while I somewhat understand the rationale used by your management team, my expectations had wrongfully been raised since the initial phone call with the proverbial rug being pulled out from underneath me. While I realistically never believed the $20K cash payment would ever happen, follow on discussions with Joe continued leaving me with the impression that I would still receive something. That was until Joe called me on 3 Jan and told me no cash payment would be paid at closing. As I told Joe, I would have preferred that a cash payment not even be mentioned until a complete and more accurate assessment of my finances could have been done. I have no reason to believe that the management team was not doing everything possible to make the numbers work but I don't feel real good about how this ended.", "rating": 4}, {"title": "Good service.", "text": "Date of experience: May 11, 2022", "rating": 4}, {"title": "Quick and perfect", "text": "Date of experience: November 30, 2021", "rating": 4}, {"title": "Burkett loan review", "text": "Steve Murphy and Tyler Nolan were super easy to with with. They were responsive and kept me in the loop at all times. The only issue I have is that my numbers were messed up and different from the final numbers I signed the Monday before my closing! I was very disappointed as this cost me nearly an extra $1000 in closing cost and added nearly $400 to my monthly mortgage payments. I thought this was huge bc earlier New Day refused to cut any of their cost to help lower my payments or reduce the amount of money I'd have to spend at closing but ended up making a mistake that cost me $400 over what I had expected and budgeted to pay for monthly mortgage payments.", "rating": 4}, {"title": "NewDay USA representative did not support me after closing.", "text": "NewDay USA representative did a great job of completing the paperwork for refinancing my home. He did a great job completing the closing, but after closing there was not help. I called to verify a payment to my insurance company, but did not get a response from the representative.", "rating": 4}, {"title": "I thought it went well", "text": "I thought it went well - so far.  That being said, I can't imagine that providing your customers with completed documents (signed by both/all parties) is not part of this process.  Electronic or hard copies - those should be provided without having to ask", "rating": 4}, {"title": "Refinancing took 2 tries", "text": "Refinancing took 2 tries, but got it done. 1st time was originally told 2.5%, then when it came to locking in the rate it was up to 2.75%. Then we ran into a problem as my current mortgage company was due to pay the property taxes. I was about to just say forget it, then was told NewDay didn't want to wait. I was told maybe next month. The following month I was told we could now do it for 2.25%. When it came time to lock in rate it was now up to 2.49%. We lowered our payments by about $80.", "rating": 4}, {"title": "The refi is not go without a few…", "text": "The refi is not go without a few hiccups. However, it funding and close was quick and that alone made it a positive experience. Kyle did a fantastic job often working past his normal working hours and you just don't find that type of dedication. Just a great effort by Kyle and the new day team.", "rating": 4}, {"title": "Awesome service mr nick barth is very…", "text": "Awesome service mr nick barth is very honest and made exceptional time of my loan process. He brings great credit upon himself and NewDayUsa. Thank you.", "rating": 4}, {"title": "I think the paperwork was a little to…", "text": "I think the paperwork was a little to much.  We were passing paper back and forth for a few weeks and most was the 2nd time for the same papers. The price of the house was $117,000.00 but now I noticed they paid them $119,000.00.  So I'm wandering what was going on.", "rating": 4}, {"title": "I was very pleased with USA process", "text": "I was very pleased with USA process. Ashley Phillips was there at ever step to help me. Your company was able to get me a much better rate than my former mortgage company. Thank You,Robert Ficker", "rating": 4}, {"title": "We had a good streamline experience…", "text": "We had a good streamline experience experience and the agent was very helpful", "rating": 4}, {"title": "I was nervous with some of the…", "text": "I was nervous with some of the smoothness of Mr Clayborne, I was thinking it seemed more like a \"con\" rather than a true offer. Then the original closing date came and went with Kyle being sick and no other representitive to speed with, I came close to bailing out of the deal..Finally after a week and a few days it all came together..I am pleased to know that I have help close to home and not tranfered to California to answer a Pa. question.", "rating": 4}, {"title": "Great help", "text": "Great help in getting me a new mortgage rate and money to pay off credit cards", "rating": 4}, {"title": "Very helpful and professional team", "text": "Very helpful and professional team. We should have been locked in the original rate at 2.75% instead of 3.25%.", "rating": 4}, {"title": "New Day", "text": "Loan officer I worked with (Dylan Moran) was helpful and professional. Only complaint I have is I thought my loan was with New Day it was not. The loan was transferred to PPH mortgage services. I would have liked that information so I could have researched PPH at the start of loan process.", "rating": 4}, {"title": "Kyle and Emily were great very helpful…", "text": "Kyle and Emily were great very helpful but your appraiser under appraised the property. it cost us $40,000 down.  so much for a zero down VA loan.   Don’t use that appraiser!", "rating": 4}, {"title": "For the most part", "text": "For the most part, this was a pretty easy and simple process. Jacob did a great job with me and Jessica did her best, although my realtor and the closing company had some issues with her. Glad the process is now over and looking forward to moving into our new home. Thank you New Day,Don Kappel", "rating": 4}, {"title": "We found the process was fairly easy", "text": "We found the process was fairly easy. We know there were things that   were  not always in New Days control; eg; The appraisal .I thought it was insulting, I guess location matters,", "rating": 4}, {"title": "Exceptional service but confused on why…", "text": "Exceptional service but confused on why my first payment is due in May when I was told that I would be able to skip one payment which should been May 2021. Please call to verify.", "rating": 4}, {"title": "My overall experience with New Day was…", "text": "My overall experience with New Day was a good one.  The representative was knowledgeable and kept me informed all the way through the process.  The process itself was easy and relatively painless.  My only negative is that I am still receiving letters from New Day every day in the mail encouraging me to refinance my home... which is what I just did... please take me off the mailing list.", "rating": 4}, {"title": "started off good", "text": "started off good. lost some contact as we went along. inaccurate information regarding the servicing of the loan upon completetion", "rating": 4}, {"title": "Well done!", "text": "First of all, the man who handled my application was quick to respond, cheerful and honest with me all the way.  Second, the process was as simple as advertised and I wasn't hit with surprises.  Third, the whole thing was done in a much shorter time than I expected.  Thank you for your service!", "rating": 4}, {"title": "My experience with NewDay USA was quite…", "text": "My experience with NewDay USA was quite motivating the staff was very professional at all times. As, we know the purchasing of a home can be quite stressful. I want mention any names but the young man and his staff was amazing from the start to the end of my home purchase.They made the process very simple with the new technology they used with the signing of electronic forms ect. On a couple of occasions they went outside of their expertise to bring either my agent or Law firm online to expedite the process.The NewDay group that supported me was outstanding!!! Keep up the wonderful work relationship with the Veteran's and please know we appreciate You!!!SFC (R) Curtis CurryUS Army, Airborne All The Way!!!", "rating": 4}, {"title": "The process was very smooth", "text": "The process was very smooth, and faster than expected. Communications with the two associates was pleasant, and answered my questions completely.The closing was also very uncomplicated, as the notary came to me, rather than having to leave home to sign paperwork.Thus far everything seems to be going well.The only issue I have is that NewDay USA does not offer Mortgage insurance.This insurance not only protects the borrowers, it protects the lender as well.Other than that I would recommend NewDay USA for refinancing to a lower rate.", "rating": 4}, {"title": "Great process ti refinance.", "text": "Great process to refinance. Hayden was very pleasant to work with.", "rating": 4}, {"title": "Overall I was very pleased", "text": "Overall I was very pleased. I understood that it took several months rather than just 30 days because we did need to get my legal name change taken care of and the name on the title correct. However it was a bit frustrating to have my person of contact keep changing. In fact the last time it changed from Erica, she did not even mention anything about that when she spoke to me the evening before and the next morning when I tried to email her back I got an automatic email that her email was no longer monitored. I think some way of letting me know before hand that my person handling the refinance was going to change would have been a bit better customer service. But overall I was very happy - specially with Matt who finally finish things up for me. And I definitely will recommend new day USA to friends and family.", "rating": 4}, {"title": "Less than stellar service.", "text": "This is the second time I've used your company and I was fairly disappointed with the service I received from the finance officer and her supervisor. There was a large lack of communication and a delay from the finance office. When I questioned it her supervisor blamed me for the issues and it wasn't until I reached out to the past officer that I received satisfactory service. I would not recommend the team I had to work with.", "rating": 4}, {"title": "The paperwork people need more…", "text": "The paperwork people need more training. Signed all the documents twice and there were still mistakes.", "rating": 4}, {"title": "refinance", "text": "Overall, the whole process went pretty smooth.", "rating": 4}, {"title": "I'd give you five stars", "text": "I'd give you five stars, except just before lock-in you went up 1/4 points. I felt this is a ploy you use to get more customers. Give a low rate, then up it just before closing and after all the work has been done by us to finish the loan.Overall, Sean was great and we ended up locking up the rate in just 30 days and closing 3 days later.", "rating": 4}, {"title": "All in all it was an easy process", "text": "All in all it was an easy process. Brendan was courteous and professional.The closing happened approximately a week later than projected. I understand in this world events aren't always predictable.It would have been nice to have an extra month with no payment.My wife was sent many letters as her being the veteran which was inaccurate.We are still be bombarded with solicitations. Please have this stopped!!   Very good experience overall.", "rating": 4}, {"title": "It wasn't much trouble getting approved…", "text": "It wasn't much trouble getting approved for the loan and I especially liked the fact that I was able to get money to pay off other loans. Thanks NewDay!", "rating": 4}, {"title": "Kyle Graver was awesome to work with", "text": "Kyle Graver was awesome to work with. He really helped me understand the proses and kept me informed every step of the way. The only problem had nothing to do with him. After we started the refinancing I received the original invitation at least 2 times a month. Other than that everything was great Thank you Kyle", "rating": 4}, {"title": "The NEWDAY USA staff was excellent", "text": "The NEWDAY USA staff was excellent, provided clear and precise information, the representative was very professional and courteous, answered questions and returned calls promptly. The agreement was very favorable for both parties, I saved a good deal of money on the refinancing. Mr. Silva reviewed my primary intake information and provided the best option for my situation. He went over every detail to make sure I understood, the initial information he requested was clear and easy to provide, his follow up phone calls were to inform me of the process and just to ask how I was doing. Excellent customer serviceMy only displeasure was with the notary company NEWDAY USA employs, I had a confirmed date and time to meet with the notary and on the day of the appointment, I was informed the notary was not going to make it and another notary needed to reschedule, threw off my day, and to make matters worse, they did not even inform the NEWDAY USA representative. This is bad customer service.", "rating": 4}, {"title": "way too much paper work", "text": "Date of experience: March 26, 2021", "rating": 4}, {"title": "Not completely honest", "text": "The closing date kept getting pushed back. The longer it takes to close the more interest I pay on my existing mortgage. Also I was told the appraisal would be free because it does not include an estimated cost. In the end I was charged and still do nothing know the value of my home. In my opinion, I am fine being charged if it was part of the agreement. It was not part of the agreement and I was charged regardless.", "rating": 4}, {"title": "Save me money", "text": "Experience was wonderful and everyone was so courteous.Made the process very easy!", "rating": 4}, {"title": "Mandatory escrow?", "text": "Admiral:  Our loan assistant, Daniel Shea, did a fine job with the refi application.  My only concern is that he told me that the VA required that we establish VA escrow for insurance and taxes.  I know that this is not true because I did not have escrow on the loan we're replacing.  In fact, I haven't had escrow on our home loan for the last 35 years!   I believe that this mandatory escrow is a NewDay USA policy, not the VA.   So how do I request the waiver of escrow?   I look forward to your response.  V/RColonel Roy Harrington, USAR, Retired", "rating": 4}, {"title": "All of the people we worked with were…", "text": "All of the people we worked with were 5*s. However we had some difficulty working with your online systems. Logging in was particularly frustrating.", "rating": 4}, {"title": "Great experience, fast closing", "text": "Had a great experience refinancing with NewDay.  Thought it would be a painful and drawn-out process due to an IRS lien on my property, but it took only a couple of weeks for all the paperwork and title search (and IRS lien subordination) to come thru.  Dropped my interest rate by almost 50%, from 4.375%.  Highly recommend NewDay.", "rating": 4}, {"title": "The closing date was delayed twice", "text": "The closing date was delayed twice. Also your marketing team is not in synch with your agents and their customer's status. During and after the closing of the home loan, I continued to receive advertising (7 mailings) of unnecessary literature to start a loan with NewDay USA. Newsflash, the loan was already initiated so when does marketing at NewDay USA discontinue its annoyance? Someone in NewDay USA needs to correct that problem. Customers are not satisfied when you annoy them! NewDay USA gets 4 stars for Jeremy's personalism and professionalism. Thanks Jeremy!", "rating": 4}, {"title": "We really liked to be with just one…", "text": "We really liked to be with just one person instead of being handed of from one to another person during the process for each step.You as well can tell the loan officer’s experience with VA loans and veterans.", "rating": 4}, {"title": "The whole experience with New Day…", "text": "The whole experience with New Day wasvery easy and Kyle was very pleasant to work with.", "rating": 4}, {"title": "Service was Ok", "text": "Service was Ok.  There were some problems with the subcontractors used by New Day.", "rating": 4}, {"title": "The process was very lengthy and rather…", "text": "The process was very lengthy and rather sporadic as multiple documentations were needed. Anthony was very helpful and easy to work with in gathering the necessary paperwork.", "rating": 4}, {"title": "The pre-close experience was excellent", "text": "The pre-close experience was excellent. I am surprised, though, that I haven't heard anything from NewDay in the week+ since closing. I'd really like to now how to set up autopay, etc. But I do have some time before my first payment. You might want to add some post-closing touchpoints. I don't know even know if the closing documents have been submitted...somewhere or whether to cancel my March auto-pay to the old servicer.", "rating": 4}, {"title": "Our agent Julian has been super…", "text": "Our agent Julian has been super professional and helpful with the whole process and the notary that came to our house for the final documents signing could not have been more helpful and was a pleasure to meet.The reason for the four stars instead of five is the fact that we had to spend out of pocket to move the property out of our trust and will have to cover the costs to put it back into the trust, a cost of over seven hundred dollars.  It would ha been more convenient to have this taken care of by NewDay and added to the loan.Now we’re just waiting for the funding to take place.  Overall it has been a very good process.", "rating": 4}, {"title": "Very helpful …", "text": "Everyone was very helpful and professional in explaining what I was doing in refinancing our home. The rates are great and very low so i was hoping I did not had to buy discount points to meet the desired rate.", "rating": 4}, {"title": "It was an easy and fast process.", "text": "It was an easy and fast process (about 40 days from contact to closing) throughout the entire process with one exception;  At the very end of the refinancing process my representative Mr. Rozati dropped the ball on two occasions which pushed the closing date back snd could have effected the closing mortgage rate.  Fortunately it only pushed the closing day back 2 days snd the mortgage rate was not changed. Equally as important to me was Mr. Rozati owned it, admitted it was his mistake snd he made it right.  I would without a doubt us NewDay and have Mr. Rozsti as my representative again.", "rating": 4}, {"title": "The first leg of my time with new day…", "text": "The first leg of my time with new day was terrible. My rep never called back ended up leaving the company and leaving me and my application hanging. I also receive countless marketing materials even after I’ve closed with the company. Anthony was a great rep and the rest of the process went well.", "rating": 4}, {"title": "Great experience", "text": "Great experience. The gentleman that worked with me was professional, courteous, and prompt with his communication. I appreciate being treated this way!", "rating": 4}, {"title": "Overall great experience!", "text": "Overall great experience. I think the current volume of mortgage refinancing has overwhelmed New Day at times. A little over-promising in regard to closing dates. That being said, all the New Day personnel I dealt with were extremely cordial, knowledgeable and professional", "rating": 4}, {"title": "My only irritation is that there isn't…", "text": "My only irritation is that there isn't any CALLER I.D. from you so many times I didn't answer thinking it was a robo call.Correct that, please.", "rating": 4}, {"title": "We found the entire process very…", "text": "We found the entire process very helpful and responsive until the final signing. All came through as promised and before the end date projected. However, we’ve been trying to get a confirmation of closing and left 2 messages but no follow up! We’re surprised but hope since we’re receiving this message it closed!", "rating": 4}, {"title": "It was very nice and fast experience", "text": "It was very nice and fast experience. I just didn’t receive as many messages on the progress of my refinance . I had to call to make sure it was all complete ,done and final. Other than that it was excellent service", "rating": 4}, {"title": "Overall it was a great experience", "text": "Overall it was a great experience. The only setbacks were a couple emails requiring additional documents after we thought all was completed. All responses were immediate and appreciated.", "rating": 4}, {"title": "Almost let this low rate opportunity…", "text": "Almost let this low rate opportunity pass. We refinanced several years ago - no cash out - just convert to VA from conventional Jumbo to reduce interest/monthly payment/years or term, the original was with Wells Fargo and the refi conversion to VA was also through Wells Fargo. The experience was so aggravating and unprofessional I was reluctant to refi again even though the rates are so low, but decided to give NewDay USA a shot and we are very glad we did, the process was professional, easy to navigate and fast, we closed in a little over 3 weeks! I will recommend them to any Vet I know.", "rating": 4}, {"title": "Matt Zagwadski was pleasant and…", "text": "Matt Zagwadski was pleasant and thorough.  He answered all questions,  and was a good guide throughout the entire refi process.  I  did experience some trouble signing documents online,  and got writer's cramp signing in person the inch thick pile of legal papers.  I wish all of the documents could have been signed online except 1 or 2.", "rating": 4}, {"title": "From process start to closing in 15 days . . .", "text": "I have considered my home refinancing process in four steps: marketing; qualification; execution/closing; and follow-through. Since interest rates have been constantly falling, I have been inundated with offers to complete a VA Refinance (refi). Almost all offers in the mail from other companies were poorly constructed. NewDay USA did the absolute best job of clearly presenting what they were offering. However, their marketing approach is where I downgraded them from five to four stars. I have a hearing impairment and I avoid phone calls. I requested information from NewDay on their web site explaining my hearing problem and asked for more information by email instead of phone. I received a response by PHONE and email within 24 hours. I did not answer the phone call and by e-mail again explained my hearing problem. I got no response. This happened twice. Finally, the third different account executive (AE) agreed to proceed by email and from that point forward the process went smoothly. I can only assume that some NewDay AEs do not know how to type. After I had begun the refi process with them, NewDay continued to bombard me with mailings and phone calls. I can understand the mailings due to the latency of the USPS. However, I must have received over ten phone solicitations from NewDay AFTER I had agreed to refi with them. I knew it was NewDay because the callers left voice mail messages. They need a better tracking system to call off the hounds!!! Once I was connected with the AE who handled my refi, the qualification and paperwork phase was outstanding! My AE honored my request to work primarily through email. She gave me frequent updates throughout the process and patiently answered all of my questions. The closing was painless. NewDay scheduled a closing notary to come to our house and she arrived on-time and was very competent. The closing took one hour to complete. My initial contact with the AE who handled my refi was on Jan 5. The closing occurred on Jan 20 and I confirmed my old mortgage was paid off on Jan 25. I cannot comment yet on the follow-through. Although I have received notification that my previous mortgage has been paid off, I have not yet received instructions for beginning payments on the new loan. This is not a criticism since I realize the first payment due date is over 30 days away. Overall, the entire refi process with NewDay was highly efficient and painless (with minor irritations of consistent marketing phone calls.) In addition, through research on the web I have not found a lower interest rate than the one I obtained. I would highly recommend NewDay to any veteran eligible for an interest rate reduction refi.", "rating": 4}, {"title": "My only complaint was that I asked for…", "text": "My only complaint was that I asked for everything that I needed to supply for the loan be told to me up front. There were multiple times that I was asked for some other documents, which in turn caused the closing to be pushed to the right. The agent should be more familiar with what is needed for the loan early on to avoid delays,  especially when dealing with Naval personnel that may be deployed.  Other than that,  it went relatively smooth.", "rating": 4}, {"title": "Other than the 3 1/2 months it took to…", "text": "Other than the 3 1/2 months it took to get the refi complete, our experience was positive.", "rating": 4}, {"title": "Great advisors i feel did a good job…", "text": "Great advisors i feel did a good job little to no hassle thank you for that.", "rating": 4}, {"title": "Only issue was them not telling you…", "text": "Only issue was them not telling you what you needed for the loan ie paperwork or inspections.", "rating": 4}, {"title": "Fast and generally proficient", "text": "Applied initially and had a loan officer. After the application the guy quit or was terminated so another took it over and rewrote the entire thing. Things happened fast and furious. Came time to close, I had an appointment with the notary at 9am. Never was called by the company or the notary until i called the company 1 hour before time to close. Got the notary name and called her. Was told by her our appointment was at 9pm not 9am. Ended up closing later in the day with another notary but all of it could have been avoided with a little follow up. Overall a great experience.", "rating": 4}, {"title": "Everyone was very friendly and answered…", "text": "Everyone was very friendly and answered any questions I had.", "rating": 4}, {"title": "Everyone we dealt with was great", "text": "Everyone we dealt with was great. Because of an error in not checking on my annual taxes being paid we had to sign closing documents twice.", "rating": 4}, {"title": "Cody Dennis was excellent", "text": "Cody Dennis was excellent and very helpful with the information provided,", "rating": 4}, {"title": "Taking care of veterans…", "text": "Taking care of veterans by making sure they can get easy financing with low interest My first home, thank you.", "rating": 4}, {"title": "Could Do Better", "text": "The process missed the opportunity to go from great to excellent in my rating. The process caused me frustration because I received questions of miscommunication internal to New Day news. It was if the right hand didn't know what the left was doing. AND the numerous telemarketing calls I have received because New Day released info on this loan!!", "rating": 4}, {"title": "The loan process went great, until.........", "text": "The loan process went quickly and very smooth.  Ian was great.  Then, it came time for the closing.  The closing attorney was at my house on 12/23/2020, we were signing papers.  He noticed that some papers were missing.  We had to set a new closing date for 7 days later.  Now my payment is about $3.00 a month higher, due to no fault of my own.  New Day messed up, I’m paying the consequence.  Mistakes happen, but New Day should have wrote this off.John F.", "rating": 4}, {"title": "A few gaps in communication left us…", "text": "A few gaps in communication left us wondering were it was at.  But the worst and I don't know how much control NewDay has on this, but the notary that showed up to close reeked so badly of cigarette smoke that it made both my wife and I ill.", "rating": 4}, {"title": "New Day helped us a lot with the paper…", "text": "New Day helped us a lot with the paper work. i wish we could have dropped the % a little lower.", "rating": 4}, {"title": "Good Company", "text": "There were quite a few changes with my closing date, which was frustrating. However, Joshua was outstanding with his communication and efforts.", "rating": 4}, {"title": "I (we) were hesitant to commit to a…", "text": "I (we) were hesitant to commit to a re-fi, as we have never completed one before. I kept receiving annoying notices in the mail from NewDay USA. I decided to call. I am happy to say, so far, so good.  Angelo was very helpful and answered all our questions. We were very happy with our new rate and the savings we hope to experience. We closed on time (12/21/20). The disbursement phase was recently completed on our previous mortgage.  Now the new monthly payments begin 2/1/21.  Our only concern at this time are the unknowns, such as, if/when our loan will be sold. We are accustomed to having our banking services available where we can actually speak in person, if required. I guess our concern is, customer service after all is said and done. Overall, at this time, we are happy with our decision to accomplish this transaction. Thank you.", "rating": 4}, {"title": "Generally Satisfied", "text": "We found the overall refinancing of our mortgage to be efficient and satisfactory. We are also very pleased with the interest rate that you were able to secure for us. Our only disappointment was the amount of information and especially our income verification that was required to be submitted. In your televised commercials, it clearly states that no income verification, appraisal, etc. will be required. We were required to submit a great deal of verification of all sorts of information.I understand the reasoning for all the verification but it shouldn't be misrepresented in your marketing materials.", "rating": 4}, {"title": "Overall, a good experience", "text": "Overall it was a good experience. The people I talked to were very helpful, friendly, and understanding. Jacob, my agent, was especially understanding and patient given my situation. Josh, also, was instrumental in getting everything finalized so I could close on my refinance. An area of improvement is inter-departmental communication. There was an item I needed to close, then I didn't, then I did, then I didn't. I know regulations change sometimes, but this one item definitely delayed my close. Regardless, I will recommend NewDay USA to others. The electronic paperwork was easy and quick, and my interest rate is amazing. Thank you all, for everything you did for me. I appreciate it.", "rating": 4}, {"title": "The process did not go as smoothly as I…", "text": "The process did not go as smoothly as I had hoped.  It seemed as though we did a lot of repetitive e-signing over the same documents we had already signed.  The underwriting dept appeared to be very persnickety regarding our HOA or lack thereof.  Very pleased with Alex Herrara our primary contact person.  He stayed in constant contact with us the whole way and answered all of our questions.", "rating": 4}, {"title": "Every thing went fine", "text": "Every thing went fine even though it was difficult  for me to qualify having steady income.", "rating": 4}, {"title": "this was my fourth attempt to get…", "text": "this was my fourth attempt to get refinanced by New Day and it finally happened. Mostly because you couldn't cut my rate by at least 1/2%. I went from a 3.5 to a 2.65. I didn't save $3000 but i'm still satisfied.thank you,Marde Gideon361-249-3036", "rating": 4}, {"title": "They sold our loan", "text": "We took a VA loan through New Day USA. Good experience, great people, easy process.  However, within a month, they sold our loan to Planet Home Lending. It’s ok, this is a good company too, but no one told us they might sell our loan. Very disappointed in New Day for that. They advertise that they are there for the veteran and then immediately sell the loan.", "rating": 4}, {"title": "Outstanding service", "text": "Outstanding service, quick response time, very helpful people, explained everything I needed to know.", "rating": 4}, {"title": "The only problem I have is I was told…", "text": "The only problem I have is I was told to pay my December mortgage payment . The day after I paid it I got a call that my closing had been moved up and I shouldn't have paid it . I am sure this error is going to cost me and not NewDay USA.", "rating": 4}, {"title": "Process", "text": "The individual I was working with was very informative and answered all my questions in a very timely manner. The only issue we had was some how my title information/documents was lost for weeks delaying the closing. He even had supervisors working on it. I don't know what happened, but in the end we finished the process.Thank you", "rating": 4}, {"title": "New Day process review", "text": "For the most part, my re-fi process went very smooth. Unfortunately, New day ordered multiple pay-off's on my loan with Freedom Mortgage and it ended up costing me an additional $300 in fee's on the final payoff. I'm not sure what the need was for 10 payoff inquiries, and not sure why I was charged for that.", "rating": 4}, {"title": "Everything went well until closing", "text": "Everything went well until closing. We closed on a Monday night. Newday didn't get it funded until the following Monday.  I was told d that it only takes 3 business days to fund.", "rating": 4}, {"title": "you guys did a fine job on my refinance…", "text": "you guys did a fine job on my refinance ..any delays from the original closing date were the fault of the VA..", "rating": 4}, {"title": "My refinancing", "text": "Mr Belk was very professional,  knowledgeable in assisting me with refinancing of my home. He is an asset to your company.", "rating": 4}, {"title": "Streamlined ReFi was just what I was…", "text": "Streamlined ReFi was just what I was looking for.  Simple process, minimal paperwork.  Elliot was a pleasure to work with and responsive whenever I had a question.", "rating": 4}, {"title": "Great service!", "text": "Date of experience: November 30, 2020", "rating": 4}, {"title": "Seamless from beginning to end.", "text": "Date of experience: November 30, 2020", "rating": 4}, {"title": "Process took to long", "text": "Process took to long, we had to submit several forms more than 2 times over even though the forms did not change nor the info we submitted.", "rating": 4}, {"title": "I was disappoint with the original…", "text": "I was disappoint with the original person contact and they were near available or never returned my call, When it was turned over to another account executive they were much more user friendly.", "rating": 4}, {"title": "Ease of using New Day", "text": "Taylor made our experience easy and quick. She explained the process so we understood each step. The closing was done at our house, which was convenient and much safer than trying to go somewhere where we were not sure of the environment. Thank you for your service.", "rating": 4}, {"title": "The rates were great", "text": "The rates were great!  Better than the 3.7% that the US Bank offered and laughed when I told them that I could get somewhere between 2.5-2.7% elsewhere.  I was told \"good luck with that.\"  The only thing that has not gone well was that we were told that we did not have to make a payment to US Bank as New Day would take care of it.  As it turned out, US Bank took a payment anyway.  So don't know if there was a communications breakdown on your end or if US Bank just decided to take it anyway.", "rating": 4}, {"title": "Even though we had a busy schedule and…", "text": "Even though we had a busy schedule and hard to get things done Rakeem guided us through the process and made it as easy as it possibly could thank you", "rating": 4}, {"title": "After finally getting in touch with a…", "text": "After finally getting in touch with a specialist, the process was extremely easy - the initial contact is what prevented this from being  a 5 star rating", "rating": 4}, {"title": "service i", "text": "The service is great the time it took to competed it wawhy to long If you have any ? CALL ME 719 510 8683.", "rating": 4}, {"title": "The only bad thing that happened was…", "text": "The only bad thing that happened was the length and time it took, was told October 1st, ended up being more around Oct 22", "rating": 4}, {"title": "Celester Reliford", "text": "I Celester Reliford state, Mr. Silva did an excellent job working myself and Mrs. Reliford through the whole process. Very diligent young man, and very respectful.  He did his best to accommodate our needs. The only thing that what upset me was the documents that were with the notary.  My wife and I were very patient, and thought we were ok.  Like I said your very diligent employee always kept in touch. Whether talking to myself or Mrs. Reliford.  My hat goes off to him and all of you helping our military veterans. Thank you Sir, proud to be apart of your organization.", "rating": 4}, {"title": "Newday is the way for Veterans", "text": "I am very pleased with the way things were handled from first contact to closing. Everyone I spoke to was very professional and very knowledgeable about their area of the process. The process itself was very streamlined and very well managed. If I have one suggestion it would be that communication could be better. Contact was sufficient to arrive at the conclusion of the process but there were times when I felt more communication would have benefited both parties.", "rating": 4}, {"title": "Communication is key.", "text": "Communication from our loan servicer was great.  We had a small hiccup in our loan with NewDay USA changing our process server and old emails were going to the incorrect server, thus creating some delays in our finalization. We were able to have a conversation with the loan servicers manager and he was able to verify the issue and get our loan closing back on track. Overall an easy experience.  I would recommend signing all documents at an actual closing company because VA paperwork can be confusing for a traveling notary whos never dealt with it before.", "rating": 4}, {"title": "I would have given five stars except…", "text": "I would have given five stars except that I could not complete anything on line.  I use Ubuntu software which is not compatible.", "rating": 4}, {"title": "I personally contacted Newsday from a…", "text": "I personally contacted Newsday from a mailer. Armi was my agent and provided us with excellent customer service from the very begin. He was diligent in calling me once a week with up dates. The only negative thing we experienced was closer to the closing. I did not think this was going to happen,  communication and paperwork had me second guessing my decision.  Miscommunication within their organization made me a bit concerned.  Also we did not feel comfortable with first person they sent to do our closing at our home. However in the end the results were positive and we are happy.", "rating": 4}, {"title": "Very Satisfied", "text": "Overall, we were pleased with our NewDay USA experience. The mortgage rate was excellent, the sales reps were professional and knowledgeable and the process steps were efficient. We did not give it 5 stars due to the closing date got bumped several times to where our \"locked in rate\" date expired and we had to resubmit several of the forms. But they did honor the original rate that was quoted and we would recommend this company.", "rating": 4}, {"title": "Great service", "text": "Great service. They kept me in the loop and made sure there were no surprises. Ease of service was phenomenal.", "rating": 4}, {"title": "Overall great support", "text": "Overall great support from Xavier Cunningham.  He was timely with his follow ups and made sure we knew what was going on.  The only minor issue was the response for our home insurance declaration.  I don't know which end the problem was on, but once I forwarded an email from New Day to my insurance agent, things seemed to go more quickly to close.I am very happy we chose to go with New Day. Thanks for your help with refinancing our mortgage.", "rating": 4}, {"title": "Efficient and courteous", "text": "Date of experience: October 26, 2020", "rating": 4}, {"title": "We first contacted New Day on August…", "text": "We first contacted New Day on August 25. We were assured that we would close by September 28. We actually closed on October 23. Even though our contact kept us informed us frequently, it seems that some other group was not as efficient with our loan steps as we were told. We are satisfied that the loan is properly concluded, but the lengthy process should be quicker. We have bought several ad l houses over the years and the process was not this long.", "rating": 4}, {"title": "Great service", "text": "Great service! I like it!", "rating": 4}, {"title": "The overall experience with New Day was…", "text": "The overall experience with New Day was very good. The only issue was a dribble of documents during the escrow. They caused several hold-ups in the process and caused a second closing and the necessity of making an additional mortgage payment to the old company. That will cause an indeterminate amount of time to receive the overage paid to the old mortgage company. At one point, I was told the paperwork was complete and a close expected at the end of September. I was out of state when I was notified by phone of 'one more document' that needed to be signed and returned or another hold-up would occur. We tried to comply and signed an electronic document. We were told it was not acceptable. That caused the re-close.  A very frustrating chain of events to be sure.", "rating": 4}, {"title": "Satisfied with our experience", "text": "Some hiccups at both ends of the process, but otherwise a painless process with a very satisfactory outcome.  In the beginning, NewDay  asked for a bunch of documentation already on file with them.  Not a big deal, just a bit frustrating.At closing, the agent insisted on coming into our home to witness our signatures, and insisted we sign everything in blue ink.  Although this person is not a NewDay employee, her unprofessional conduct reflected poorly on NewDay.  I had anticipated being handed a package of documents with a big sticky note on every page needing a signature, and smaller sticky notes pointing to the appropriate line for our signatures and dating.  Instead, she physically handled every single page at least once before telling us where to sign.", "rating": 4}, {"title": "made it happen", "text": "excellent!!", "rating": 4}, {"title": "Oh no! more documents", "text": "Overall working with New Day was great.  However, I did not like that I would sign something on docusign and a few days later the same thing would come in the mail.  When the notary came to close, I had to complete the same paperwork again.  Very invasive amount of paperwork.", "rating": 4}, {"title": "Easy Refi", "text": "Megan was great to work with. Easy refi and loan was completed quickly. Thanks for the great service!", "rating": 4}, {"title": "The long refinance", "text": "Decided to refinance from your ad on tv. Called and everything went smoothly until they said they needed dd214. After 50yrs since e of e from USMC I could not find dd214. Talked to local VA and they sent me 180 or something form to fill out and send to archives in St. Louis to request a copy of dd214. However since covid the archives have only been doing death forms, so I was put on hold for 6months. Then one day cleaning out closet all my service records were found and once more paperwork for loan were started. Austin Uhrig ,my loan officer had no idea how long this had gone on and so had to put up with my impatience. Then on closing day there was a mixup with the closing time and paperwork, thus we and notary did a closing outside by lamplight, but Martha Leech was a jewel and we had a pleasant and informative evening.", "rating": 4}, {"title": "All in all", "text": "All in all, I felt the refinance of my home went very smoothly.  The representative I spoke with for the majority of the refinance, Megan, was very courteous and professional. I received the rate I was looking for and although the closing cost were more than I originally expected to pay, I felt i received a fair deal.  My only con was the amount of time I had to wait for this refinance to be finished.", "rating": 4}, {"title": "The process was was fast and easy to…", "text": "The process was was fast and easy to accomplish. However I am still waiting to complete my automatic payment plan.", "rating": 4}, {"title": "Excellent service Clarence Tran was…", "text": "Excellent service Clarence Tran was great with assistance to me throughout the entire process . I will recommend your company to all my veteran friends.", "rating": 4}, {"title": "Great service", "text": "Great service. Great follow up. I haven't closed yet hence the four instead of five star rating. Perhaps you should request the rating AFTER closing? So far so good.", "rating": 4}, {"title": "Good Service", "text": "We had some difficulties as our solar company had a lien, when according to our contract they were not supposed to. Once it was figured out, we had to redo some paperwork and start over as the original 3 month time frame expired. Our loan agent, Jason was very helpful and kept us updated on what needed to be done and where we were in the process. Overall good service with the time delay set aside.", "rating": 4}, {"title": "SMOOTHIE, VERY SMOOTH!", "text": "The entire process went so smoothly! I am happy to be part of the NewDay USA! Dawit Garma was very helpful & kept me posted all the way through! Being a disabled Vet, I am thankful to be associated with a organization that helps so many vets!", "rating": 4}, {"title": "Took a month longer than told at…", "text": "Took a month longer than told at beginning the process", "rating": 4}, {"title": "Thanks I was satisfied with the service", "text": "Date of experience: October 01, 2020", "rating": 4}, {"title": "Had multiple documents of the same form…", "text": "Had multiple documents of the same form over all very easy to refinance my home.", "rating": 4}, {"title": "Overall", "text": "Overall, the digital process in obtaining re-financing of my mortgage went very well.  There was a slight hesitation in going thru with process due to thevery high cost of the loan.  But again, it was a job well done.", "rating": 4}, {"title": "The initial loan had to be cancelled…", "text": "The initial loan had to be cancelled because a document was signed that shouldn't have been .so that added another two weeks to the process .after a new loan was started it happened reasonably fast .my mortgage agent was very professional and on top of everything .helped us a lot .i didn't get the 3 thousand dollars, more like 2 thousand I got one months skipped rent and my escrow money to come .with that said it was quick and professional .i could give a more detailed review once my escrow and other monies are satisfied and in my bank account ? probably within 25 to thirty days?", "rating": 4}, {"title": "Overall the process was excellent", "text": "Overall the process was excellent. Well delivered and explained and easily completed. I would have preferred more frequent updates as we progressed through the loan application. Maybe every 3rd day instead of weekly. We have yet to be informed that the loan has been recorded, the funds were distributed Sept 18th, I think. An excellent process but room for improvement.", "rating": 4}, {"title": "Working with Cori was a delight", "text": "Working with Cori was a delight.  Howver, some of the requests from the Booker was a nightmare and uncalled for.  The request for a divorce decree that had noting to do with this refinance was ludicrous.  My last divorce was in 2001.  This house was purchased in 2013.  how could my ex have anything to do with this action?   Ridiculous.", "rating": 4}, {"title": "Could not do streamlined refi", "text": "I was ready to do the streamlined refi but when I called to start the process I was told because I had a second mortgage from a different company than my primary I could not.  I have to admit I found this strange because my house was the collateral for the second mortgage.  I have more than enough equity to cover it and my house was not going anywhere.  So still do not understand this position by New Day.  So I was forced to roll the second into first and go with the extra charges that created with the refi.  The rest of the refi had no real issues and went smoothly.  The closing was easy but with no real notice after a long weekend ( labor weekend ).  Was called on Tuesday and told closing at 1 pm on Wednesday.  That was issue because wife works and could not get time off with no notice.  The company doing closing agreed to meet at wife’s workplace so worked out on in the end.", "rating": 4}, {"title": "NewDay", "text": "Thank you setting up an easy refinance process for Veterans. The process flowed well. Jake did an outstanding job guiding me, and informing me throughout the process. No issues with his performance. However, i felt a tremendous amount of anxiety moving through this online process, because traditionally, this is a more face-to-face process. Online marketing and the people who make the process tick are two different things. Here,  I did not know anything about NewDay with the exceptions of the pictures on your website. Therefore, i have two recommendations for your consideration:  1. Overcoming anxiety in a totally online and voice process, especially with Veterans with PTSD. Senior Leaders conduct outreach with customers at a certain point in the process. Hey, this is a real Company, and I'm here to help (i am not referring to Sr. Leaders taking calls to help people with financial issues) Availability on Linkedin (example). An organization is more than just the face and the words on it's website.2. Customer support. I had nobody else but Jake to call on closing day. I did not know Jake's work schedule, or the work schedule of another person who called me the day before closing. He was reading from a script. You lose all credibility when you stumble reading a script. On closing day, I had a question on a Florida requirement. I called, and emailed. The only voice i could connect to was voicemail. Fortunately, i was able to connect with the State of Florida Attorney General office to discuss the Florida requirement. I didn't understand the purpose of the Florida requirement since i do not live in a HOA. I got my answer prior to the Notary showing up at 0900.I hope these two recommendations are somewhat helpful.", "rating": 4}, {"title": "The overall process was fairly quick…", "text": "The overall process was fairly quick and easy especially with e-signature. We where lead to believe only a few documents had to be hard signed at closing.  This turned out not to be the case. The closing process turned out to be very long. It took 1 1/2 hours signing a lot of documents by hand. Our names were listed correctly during the e-sign process. However the printed out hard documents which need signatures had both of our names listed in two different spellings. This required my wife and I to sign numerous documents twice due to the different name format.  The title representative didn't know why the printed names came out this way. She stated its just how she received the documents. Shouldn't somebody review the final documents for errors or incorrect format prior to sending to the closing title agent?", "rating": 4}, {"title": "Va refinance was quick", "text": "Va refinance was quick.  Representative was knowledgeable.  However the day before the signing, another different rep called.  I asked a few questions and this guy had no clue and could not answer my questions.  Loan did close smoothly.", "rating": 4}, {"title": "I had to call for updates on the loan…", "text": "I had to call for updates on the loan process including the closing since the prior mortgage company had not received any notification.Other than that service was vey good.", "rating": 4}, {"title": "Easy refi", "text": "I feel that there could be a little more communications and on several occasions I called and did not get a call back for several days . Overall it was a good experience and the refi went fairly smooth", "rating": 4}, {"title": "New Day was fantastic have no problem…", "text": "New Day was fantastic have no problem with your company.  The signing agent was another story. She forgot to have us sign the Right to cancel documents. Instead of coming back to get the doc's signed we had to jump through hoops to make copies of the doc's that she text to us, sign them then send them back to her on a non secure email. Not the way I use to do closings when I was a signing agent.", "rating": 4}, {"title": "The mortgage consultant was great!", "text": "The mortgage consultant was great!. The only hang-up was completing the close. Two scheduled close dates were missed. Could be caused by Covid-19. 3", "rating": 4}, {"title": "Once Corey got involved things went…", "text": "Once Corey got involved things went along as expected. Corey was a great help.", "rating": 4}, {"title": "HOME REFINANCE", "text": "For the most part, everything went well.  I was kept informed of the process, and it mostly happened as I was told.There was an issue with the closing in regards to getting it scheduled, but that was finally worked out.  In regards to the closing, the closer was very nice, but did not have her hearing aids in and it was difficult to communicate during the closing.  Plus, she removed her mask to make it easier for her to talk and asked me to remove mine so she could hear me better.  I refused and spoke louder.  Her husband remained there and played translator.Other than that, my old loan was paid off early, and instead of just missing one loan payment, I was able to miss two!Overall good job, and kudos to Phillip!", "rating": 4}, {"title": "it was easy to re-finance", "text": "it was easy to re-finance, but i had to raise my loan and lose my equity for a better interest rate", "rating": 4}, {"title": "This is my second time financing with…", "text": "This is my second time financing with New Day USA.  It couldn't be easier from start to finish.  All banks and lending companies should take a cue from their process.  The staff are informative and always able to speak to when necessary.  A great company!", "rating": 4}, {"title": "Wonderful experience from calling Jade…", "text": "Wonderful experience from calling Jade to apply and to the closing and Michele coming to notarize.  I would recommend your company.", "rating": 4}, {"title": "Quick and easy.", "text": "Date of experience: July 24, 2020", "rating": 4}, {"title": "The end outweighs the means", "text": "The results of the experience is pleasant, however the response from the account representative, Robert Samuel Steinweg,  was subpar. I had emails with questions that seemed to go ignored. I am a paper trail type of person, so a phone call does not give me anything to refer back to other than memory. I had to resend more than one email that did not get a response until the last moment with a phone call. I nearly cancelled everything because of his lack of response to my questions.", "rating": 4}, {"title": "LOOKING FORWARD TO THE FUTURE.", "text": "LOOKING FOEWARD TO THE FUTURE.", "rating": 4}, {"title": "Very responsive", "text": "Very responsive, smooth process!!", "rating": 4}, {"title": "I wish I knew about this earlier", "text": "I wish I knew about this earlier, no problems so far", "rating": 4}, {"title": "We were very satisfied with Neil…", "text": "We were very satisfied with Neil O'Neil, our representative. Overall, it was a good experience; however, there were two points that lead me to reduce it to a 4 star experience. First, it took way longer than it should have to come to closing/funding (late Feb. until June 30). Part of this was delays due to COVID-19 and to the state of North Carolina/Housing Dept.'s delay in certifying the subordination of their loan, but part was long delays that appear to be from the title department. The second point was the poor performance of the Notary chosen by NewDay. He was a very nice young man, but failed to get signatures on parts of the closing documents. We depend on him knowing what and how it needed to be signed, and he did not, causing a day's delay and a bunch of extra work on our part to get to the closing on time. It is the first time I've been through the notary process where he did not have flags set up for each signature place.", "rating": 4}, {"title": "Improve your internet interface", "text": "Improve your internet interface. other than that the service was outstanding.", "rating": 4}, {"title": "Joe was excellent", "text": "Joe was excellent, but we had some problems with 3d party vendors. I found that a bit annoying and time consuming. It, however, was not NewDay's fault.", "rating": 4}, {"title": "Non Titled", "text": "The representative was knowledgeable,courteous, and helpful during the entire process.Made it all very easy.", "rating": 4}, {"title": "felt left out of process at times", "text": "felt left out of process at times.  Very high tec. to keep up.", "rating": 4}, {"title": "Overall was great", "text": "Overall was great. There was a communication problem when they found an issue with my wife's credit. But it got resolved and all went well. Very satisfied overall.", "rating": 4}, {"title": "The overall experience with New Day was…", "text": "The overall experience with New Day was good. However, it was much slower than we were first told. Originally we were told it would take two weeks, it ended up over eight week.It seems that there was always one more thing needed. I had to call many times to check on the status to keep things moving along.", "rating": 4}, {"title": "Overall the rep answered my questions…", "text": "Overall the rep answered my questions very effectively and quickly.  However once my loan was E signed and committed, I feel I didn't get the same response time or friendliness.", "rating": 4}, {"title": "Fair and Honest", "text": "New Day was fair and honest and I like that when doing business. I told what I looking for in my loan and they went to work. Being a Veteran that's goes along ways now days with the world being what it is.", "rating": 4}, {"title": "Slow process", "text": "Originally I was told it was going to take 14 days to close on the loan. It took more than 6 weeks to finalize But in the end they lowered my rate so I'm a satisfied customer", "rating": 4}, {"title": "Long Term Savings", "text": "Took longer than promised from the initial call but I got it done. Closing fees were a little higher than expected as well but overall Im saving", "rating": 4}, {"title": "I refinanced with you guys about one or…", "text": "I refinanced with you guys about one or two years ago. It went without any problems and very fast with great communication. I decided to refinance again to take advantage of lower interest rates. It did not go nearly as well this time. On my end I submitted everything required very quickly, but did not receive very good communication back. Seth McFall was my consultant, and I hate to say it, but he was terrible about returning phone calls. I had to call multiple times ,leave numerous messages and still not hear back. Same with most e mails, most never answered. I was not happy at all with the cooperation of Mr McCall. All in all, in the long run everything worked out, but your consultants need to follow up in a more efficient way. Thank YouRonald &  Susan Colley", "rating": 4}, {"title": "It was confusing after awhile because I…", "text": "It was confusing after awhile because I changed agents in the middle of the process and then other people (processor) got involved and I had never heard of them so at first I ignored them.", "rating": 4}, {"title": "Overall I'm happy with the service but…", "text": "Overall I'm happy with the service but due to the covid 19 situation and other circumstances my refinance took almost two months to complete. Staff was very helpful and responded well with my questions.", "rating": 4}, {"title": "Good response but short on the…", "text": "Good response but short on the information and workings of the loan and the large fee that they want.", "rating": 4}, {"title": "Our agent assigned to our application…", "text": "Our agent assigned to our application process was Joshua Lee Denson, was fantastic. He was there for us the whole way. He was kind, patient and attentive to our process. He is a true gentleman and should be recognized as a great asset to the New Day USA company. We can't say enough good about Mr. Denson. Some people go to work and some people SHOW UP to work. We would like to recognize Joshua Lee Denson as a great team member of the New Day Family. Thank you Joshua for all you help in making our experience truly a good one. The Tobias", "rating": 4}, {"title": "Great rates, great customer service", "text": "My loan officer was a great help. The only reason they don’t get 5 is we were given an unrealistic timeline. No hold-ups with application or document returns. Expect 4 weeks like usual refinancing. Great rates that nobody else could match. I will use them to refinance again in the future.", "rating": 4}, {"title": "Neil was very helpful and persistent in…", "text": "Neil was very helpful and persistent in insuring my documents are completed properly, correctly and submitted accordingly i a timely manner. He notified me immediately when changes, updates, or additional documents needed to be submitted. Well done Neil.", "rating": 4}, {"title": "My loan officer", "text": "My loan officer, Cody Dennis, has done an excellent job in helping to facilitate my refinance. He's been easy to get in touch with whenever I had questions. The process actually took just a little longer than I thought it was going to and I'm still getting payment due notices from mortgage solutions financial. A little confusing since we actually closed on May 18, but I'm sure everything will work out for the best. Thank you so much to all those involved in processing my loan and I'm totally pleased with the great rate that we got. Thanks so much,Mike Phillips", "rating": 4}, {"title": "Amanda was very helpful", "text": "Amanda was very helpful.  The settlement agent was sub-par.", "rating": 4}, {"title": "I had a great experience working with…", "text": "I had a great experience working with Lucas. His ability to make the refi process go smoothly was very nice. I would recommend New Day USA.", "rating": 4}, {"title": "We rate was great but information was hard to come by", "text": "We received what we asked for. I was told several times that I would receive a call with updates which usually did not happen. The last was a call when it funded. Wells Fargo notified me that my old mortgage was paid in full on the 13th. I still haven’t heard from your representative but I don’t really need to.", "rating": 4}, {"title": "Everything went smoothly and quickly", "text": "Everything went smoothly and quickly. Francis Peter DeAugustine III was outstanding.  Only gave the 4 stars because I was not aware until the last day that we had to actually sign paperwork in front of Notary.  The client should be told that up front.", "rating": 4}, {"title": "all was as expected", "text": "Date of experience: May 05, 2020", "rating": 4}, {"title": "a bit slow but iI think amidst all this…", "text": "a bit slow but iI think amidst all this cornavirus  mess, understandable", "rating": 4}, {"title": "going by your commercials and after…", "text": "going by your commercials and after going through the process, I would say that there are some very misleading statements made by newday", "rating": 4}, {"title": "The employee that worked with me was…", "text": "The employee that worked with me was very professional and flexible during these unsettling times.", "rating": 4}, {"title": "Well it hard to say what happen for…", "text": "Well it hard to say what happen for there was  a lot problem  that had to be handled  and  my agent took  the time to get it done", "rating": 4}, {"title": "Great rates!", "text": "Date of experience: May 04, 2020", "rating": 4}, {"title": "Simple and straight forward process", "text": "Simple and straight forward process.  Everything has gone as smoothly as could be expected given the current situation.", "rating": 4}, {"title": "Been exceedingly pleased with NewDayand…", "text": "Been exceedingly pleased with NewDayand especially Kyle Graver.  Kyle has been more than helpful through the entire process, both the first time and also the latest refinance.  My only problem occurred when my loan was moved to Planet Home Lending.  Some of that was of my own doing.  Again, I am more than satisfied with your service.", "rating": 4}, {"title": "Rep was Great.... Not certain I saved all I should have, but the process was fairly painless.", "text": "Joe Freed was Great! He kept me informed through the entire time my refinance was being worked! I am very appreciative of that! I do think, had I take the time, I may have found a refinance option that may have been less expensive. Approximately $10k in fees were rolled into my new refi. This resulted in no out of pocket expenses, however, Those fees seemed a little high based on my past experiences with mortgages. I may have saved more monthly but the process may have taken longer with other companies.... Not certain if I could have done better at this point. I do not, however feel that my military service played any special part in the process other than having the VA loan option at my disposal. This would have been the case with other lenders as well.", "rating": 4}, {"title": "Hard to catch first go on phone but…", "text": "Hard to catch first go on phone but always returned call and had answers", "rating": 4}, {"title": "It was almost two months to get the…", "text": "It was almost two months to get the refinance completed.", "rating": 4}, {"title": "My coordiinator did an awesome job", "text": "My coordiinator did an awesome job! some of the behind the scenes people some great some questionable.", "rating": 4}, {"title": "NewDay USA", "text": "My overall experience with New Day USA for a VA home re-fi was good. All requirements were correctly processed and accomplished on time. My loan officer was professional and kept me up to date on the status of the loan at all times.", "rating": 4}, {"title": "For the most part", "text": "For the most part, it was a pleasant experience. I would suggest you find a way to prevent the constant duplication of email requests for matters of attention. It generates unnecessary confusion between your client and the other co-signer.", "rating": 4}, {"title": "Joshua Lee, Loan Originator", "text": "Joshua Lee was our loan originator.  He was very helpful in processing our loan due to our loan being a split signage.  The process ran very smoothly.", "rating": 4}, {"title": "Great", "text": "As a veteran of the Marine corps and Navy its good to know someone looking out for my best entrance. Thank you New Day USA", "rating": 4}, {"title": "Nick was informative and helpful thru…", "text": "Nick was informative and helpful thru out the process", "rating": 4}, {"title": "My experience", "text": "It just seemed that when we were asked to fax or take care of something , we would be told that everything was good and that would be all. But then we would get a call saying they needed something else or that the paper we sent was not right,  It happened a few times.", "rating": 4}, {"title": "Very pleased with the ease of…", "text": "Very pleased with the ease of refinancing with newday usa.", "rating": 4}, {"title": "Overall it was a smooth process", "text": "Overall it was a smooth process.  As we approached the closing there were last minute items that were requested that it seemed should have been caught earlier in the process and not making us feel we had to rush to complete.  This was especially important to us as we were traveling at the time and not always having access to printers, scanners, etc. to make up, sign and return documents", "rating": 4}, {"title": "Everything went pretty smooth with the…", "text": "Everything went pretty smooth with the process.  The only thing I could say negatively was there was a  minor detail  I didn't know about.  One being the witness for the closing. The other being a few last minute notifications to hurry up and get things signed by a deadline. Other than that it went well.", "rating": 4}, {"title": "Newday team was great.", "text": "New was great. Your rep , Peter, was very helpful but, your underwriter was a big pain. It took 4 months to close. Every time we were ready, they would ask for something else. I was not happy with this and the things they asked for were ridiculous. Even the new day team were tired of it. New day team was Peter, Kyle, and Jacob. They were very helpful and would have gone elsewhere if not for them.", "rating": 4}, {"title": "The refinance was indeed streamlined…", "text": "The refinance was indeed streamlined and relatively easy...was ok with the loan percentage rate but our existing company called just about 3 days before we closed offering us .5% less interest rate and a savings of almost $1,000 in closing costs this savings would have been significant for 2 handicapped senior citizens with a very limited income...oh well...it was too late...but your representative Bill Wingo was pleasant and efficient and I would deal with him again.", "rating": 4}, {"title": "The account manager Justin Abrams was…", "text": "The account manager Justin Abrams was wonderful. He helped in every way possible and explained the whole process in detail for us in our language to understand properly.       New day in general tends to drag their feet and that creates much unnecessary stress that is not needed through this process. I am very happy with new day USA so don’t take me wrong. I thank you for believing in us        I will admit I say THANK YOU JUSTIN ABRAMS for making this bearable with the stress. I would highly recommend New Day to anybody for a mortgage", "rating": 4}, {"title": "Process seemed to take a long time for…", "text": "Process seemed to take a long time for a refi, but the rep was very knowledgeable and quick to get back to me about things. Great customer service", "rating": 4}, {"title": "Unfortunately", "text": "Unfortunately, our loan took 60 days to complete, which is the longest it has ever taken us.  Our loan officer was friendly and always responded promptly, the approval process was smooth!!!", "rating": 4}, {"title": "NewDay USA", "text": "NewDay USA is very good. They worked with us and our Loan Officer Alex was very patient with every question sometimes explaining more than once. We are very glad to have succeeded in the process and happy to have it completed successfully!", "rating": 4}, {"title": "I was thrown between 3 different loan…", "text": "I was thrown between 3 different loan officers for a single loan could not seem to get in contact with either one had to wait for call back and even though loan has closed still have not received money back owed to me by new day for an inspection that I paid for and did not need the inspection was advised by loan officer I would be reviewing a check back after closing and lastly still have no idea who to make my payments to", "rating": 4}, {"title": "Overall the process wasn't bad at all", "text": "Overall the process wasn't bad at all. My calls and questions was always answered and returned within a timely manor.Would refer New Day to others looking to refinance.", "rating": 4}, {"title": "Some good points and some not so good.", "text": "Was helped by Sara Sakhi and Joseph Shortlidge, received duplicate requests for documents from them. When I received information from them both the information varied somewhat. The underwriter came very close to me cancelling the project and going elsewhere because they missed the original closing date. Sara did work very hard to get the appraisal finished with the VA.", "rating": 4}, {"title": "The process was easy", "text": "The process was easy, and stress free.", "rating": 4}, {"title": "Great experience", "text": "Great experience! The only thing I would have changed is how you receive your money. I was given two separate checks; one for me and one for a payoff for a vehicle. But, instead of getting one check that I can deposit, then payoff what you need, I was given two as if my mortgage company was my money manager.", "rating": 4}, {"title": "Good solid people", "text": "Good solid people.  Great help.", "rating": 4}, {"title": "The process took more time than I…", "text": "The process took more time than I expected, but the out come was almost exactly as the  agent originally stated.  A lot of the documents that we provided were requester piecemeal.  The process would have been foster if we had received a list of required document in advance to gather up before we started the process.Our New Day agent was courteous and understanding for the most part.  There needs to be a better way of explaining why they won't take my word as a 75 year old retired USAF veteran on many of the questions.  All I ever got was \"The VA needs it\" that seemed weak and as if I was being passed off as a total fool.  I realize that the agents have hundreds of customers that have questions, but there needs to be some understanding that we as customers do not do this everyday.All and all the refinancing process at New Day met all the requirements and looking back they did what the said they would do.", "rating": 4}, {"title": "Our agent was very helpful &…", "text": "Our agent was very helpful & knowledgeable..", "rating": 4}, {"title": "Great sales rep", "text": "Great sales rep. Fairly smooth process, not as advised on tv with the no points. No appraisal Still overall good experience.", "rating": 4}, {"title": "It was a long process for a streamline…", "text": "It was a long process for a streamline refinance it took almost 2 months to close other then that very good", "rating": 4}, {"title": "Everything has been great up to the…", "text": "Everything has been great up to the point of getting the paperwork signed. Someone hasn't been able to get my wife's name correct on the some of the paperwork but thanks to a very smart notary, she got it done for us. Thanks", "rating": 4}, {"title": "OBest", "text": "Outstanding", "rating": 4}, {"title": "The only problems that arrived for me…", "text": "The only problems that arrived for me was getting the exact documents needed to close, back and forth now good enough. Which in turn I had to borrow more than I really needed.  I requested that if they used my bank statements it would clearly show that the close to 30000 in debt because of me being co-signer would prove that from the time account (s) we’re open they were not being paid by me .   The statement would of clearly showed money was being deposited by a check (s) from 3rd party then I would pay it out of my account.   No additional debt was created by this but yet it (debts) went against me. Which I fill it shouldn’t have thus I wouldn’t have to exhaust my Equity in my home just to pay off some debt", "rating": 4}, {"title": "Very happy,Tyler did a good job,the…", "text": "Very happy,Tyler did a good job,the paperwork was long but in the end it all worked. I would recommend New Day Tomy friends!", "rating": 4}, {"title": "The people ,from the start", "text": "The people ,from the start, that helped me through out the whole process where and are the best. In particular Chris Khokhar and my realtor Sasanna Stozier  helped me every step of the way. I can not thank them enough. Closing how ever was miserable, but Sasanna helped me through it. Again thank's for everyone's help,almost forgot to thank Mary Grinnell  who handed me over to Sasanna .Sasanna is the best! Thank's again to everyone who helped me and my wife find a  wonderful home", "rating": 4}, {"title": "Lot of work", "text": "Lot of work, but worth it.", "rating": 4}, {"title": "All in all a good experience.", "text": "Date of experience: September 06, 2019", "rating": 4}, {"title": "Overall I thought the process was…", "text": "Overall I thought the process was rather long. There was a lot of paper work and a lot of it was repeat. Had to be selective.I will say that Seth was always ready  to answer any questions and help by explaining.Overall the process was timely but in the end well worth the effort.", "rating": 4}, {"title": "It was a journey", "text": "It was a journey. Lots of personal information about yourself. At times I thought I was just going to give up but, I needed to get a house so I picked up my sticks and kept fighting. At the end I received my house. Thanks to Sarah & Brittany for all that you done for me and my wife.", "rating": 4}, {"title": "Although there was some mis…", "text": "Although there was some mis communication along the wayall in all I would recommend to others.  Thank you for assisting me in making my life a little morecomfortable.", "rating": 4}, {"title": "The whole experance went well", "text": "The whole experance went well, untill closing, then we had to \"re-do\" many of the signatures. also sent more info which caused us to close later than the closing date.", "rating": 4}, {"title": "Lancaster, Ca", "text": "Overall a great experience. slight suprise at closing that was not explained to me, but not a deal breaker.", "rating": 4}, {"title": "Working with Sam was a positive…", "text": "Working with Sam was a positive experience.  I have two suggestions:1)  a list of total documents needed at the beginning would have been more efficient2)  a more thorough review of outstanding credit balances would have been in order.  I now have two checks that I don't know what to do with; one for $1800 to Capital One USA  and another to a community bank for $24.00.  I cannot contact the Capital One USA because I don't have an account number and do not receive statements from them  The $24.00 one was for a purchase that I had immediately paid for.", "rating": 4}, {"title": "First VA loan is 50 years.", "text": "This was my first VA loan in 50 years of purchasing a total of 5 houses.  My originator was knowledgeable and proactive, however, the closing process left much to be desired.  A last minute, day of closing, request for a bank verification is unacceptable.  A delayed closing because of a systems failure is also unacceptable.", "rating": 4}, {"title": "I only had good things happen to me…", "text": "I only had good things happen to me with new day thanks for all u done for me and I would like to thank J My leaning official who was a big help", "rating": 4}, {"title": "The agent worked with me very…", "text": "The agent worked with me very professional manner I would recommend your company to other veterns", "rating": 4}, {"title": "It was unexpectedly easy process", "text": "It was unexpectedly easy to process the refinance loan with New Day. Some of the fees, especially the VA fee, caught me off guard but Daniel worked with me until I completely understood all of them. I We made a last minute change and Danie and went back and had it worked out before we were off the phone.", "rating": 4}, {"title": "Process was simple and easy.", "text": "Process was simple and easy.. loan specialist was very helpful. Communication could have been better. Was told my emails were going to spam folder so they were never seen", "rating": 4}, {"title": "They did what they said they was going…", "text": "They did what they said they was going to do!", "rating": 4}, {"title": "We were very happy with the whole…", "text": "We were very happy with the whole experience. The agent we had was so polite and helpful, everything went so smooth, and just like he said. I would be happy to work with him again. I'm new to computers, and he walked me thru it all.", "rating": 4}, {"title": "Very friendly people", "text": "Very friendly people. The process was uncomplicated, easy to understand, and took less time than expected. Overall it was a very pleasant and worthwhile experience.", "rating": 4}, {"title": "The account executive that I worked…", "text": "The account executive that I worked with was fabulous. Alex Quail was very helpful and responsive to questions that I had. If I had any complaints, it would be the speed of of the title company in completing tasks.  Alex and I experience many delays waiting on responses, which contributed to unnecessary delays in the process.", "rating": 4}, {"title": "Great Experience", "text": "The experience was great. It was overwhelming at times but expected. Had great help from Zack and his Team.", "rating": 4}, {"title": "Very satisfied", "text": "Anthony is quite an eager go getter and on top of his game. We ran into a few issues but he got them resolved fairly quick.", "rating": 4}, {"title": "Overall very pleased with the service…", "text": "Overall very pleased with the service received. Our original agent Aaron Jacobson had great communication with us.  Then we were assigned a new agent, Sean Waller, and communication broke down both between us and the loan processor. Again, we did reach our ultimate goal, thank you.", "rating": 4}, {"title": "Closing issue", "text": "While the service I received from Colin and Abby was exemplary, I was disappointed in the final closing issues. They had added my wife onto the deed documents but I was  never informed that she would have to be there for the closing. So I came on my own and my wife stayed in Florida. Well Colin And Abby work to get this straightened out it was very frustrating to say the least. Also I was unaware that the homeowners insurance was not include  in the closing costs while I paid it on my own I thought I would be getting that amount back as well as our security deposit. It was my understanding that when we asked the seller for $8000 in closing cost that that alone would cover everything needed and we would not need to provide any out of pocket expenses. So, we paid $1800 (security/EMD) and $980 (home owner insurance) for a total of $2780. At the closing I received a refund check for $1,630.24, which meant our out of pocket expenses were actually $1,149.76. Again I thought we were not going to have any out of pocket expenses. I would like a written response l explanation for this and if possible a refund of the out of pocket expenses ($1149.76). Thank you.", "rating": 4}, {"title": "Very structured", "text": "Very structured, very professional.  A lot of confusion about interest rate.  Would recommend a sincere committment to obtain the best rate possible for the veterans.  Secondly, changing my contact person mid stream was confusing, time consuming and most unprofessional.  I was never told why this happened.  Over three weeks of heated discussions attempting to increase my interest rate.  To your credit, after numerious reviews, appeals, you agreed to the original promised rate which unfortunately was still higher than market rates.  Third, most of the specifics of the contract, terms and amounts and funding were discussed up front in detail but sad to say, to this day, a detailed brief did not occur before closing.Overall good.  Keep it personal", "rating": 4}, {"title": "Collin Copenhaver  was excellent to…", "text": "Collin Copenhaver  was excellent to work with.", "rating": 4}, {"title": "It was a longer process than…", "text": "It was a longer process than anticipated but Anthony with New Day did a great job of taking care of us, answering our questions and getting the loan processed.", "rating": 4}, {"title": "Counselors always kept me informed of…", "text": "Counselors always kept me informed of the process and was very simple and convenient.", "rating": 4}, {"title": "It was a easy process with only very…", "text": "It was a easy process with only very minor setbacks. I was very pleased with the service from Kyle.", "rating": 4}, {"title": "New Day USA loan representative", "text": "New Day USA loan representative, Jonathan Archer delivered an exceptional service guiding us throughout the loan process and explaining some issues we don't quite understand such as what   dd240 form is and who can be eligible for a veterans mortgage loan.He goes out of his way to suggest what other loan possibility is available if the requirement is not met. Mr. Archer is very knowledgeable, patient, caring , understanding and most specially efficient and thorough. So pleasant to work with. Great and Intuitive person/ Thank you .", "rating": 4}, {"title": "new day made it very easy for me to do…", "text": "new day made it very easy for me to do the home loan.", "rating": 4}, {"title": "The process as a whole seemed long but…", "text": "The process as a whole seemed long but was worth it.  My representative was great at communicating and explaining everything to me in a way I understood.  I appreciate their help and was happy with the end result.", "rating": 4}, {"title": "Was surprised it took 4 weeks to tell…", "text": "Was surprised it took 4 weeks to tell me I needed a termite letter and also about the same time to tell me about an appraisal, these delayes also delaid the closing", "rating": 4}, {"title": "The Admiral really does care!", "text": "I am definitely sure that without the help from New Day USA, I would have had a much longer time with trying to acquire a home! My team of people lead by Colin Hall were instrumental in my ability to make this happen! Not all went as planned and that is why I didn’t give a 5 star rating, but Colin worked tirelessly and beyond the call of duty and for him I give my utmost gratitude! Thanks for all your help and hard work, and to all veterans, if you need help in acquiring a home check this company out!", "rating": 4}, {"title": "I worked with Mr", "text": "I worked with Mr. Mat Ahern to complete my refi.Mat made contact with me within minutes of my request for information. He maintained contact all the way through the process. Mat's professional attitude and extensive knowledge base are to be commended. He helped my wife and I through a couple of issues by explaining what was needed and whose  actions where required nextAll in all we felt at ease dealing with Newday and would not hesitate to recommend your service to other veterans.", "rating": 4}, {"title": "Chad Stewart", "text": "Your representative Chad Stewart is wonderful.  He was very patient with me.  He worked with my schedule and I can not thank him enough. He was on top of all details and kept me up to date. There were very minor hiccups with my loan and I would recommend New Day to anyone (especially my fellow vets).", "rating": 4}, {"title": "Not exactly on up and up.", "text": "The whole experience went flawlessly and was easily a good experience.  However, at the end, when the checks came in, they were all “short” of the funds to pay off each creditor, even tho we were told that these bills would be paid off when we closed.  We expected the bills to be paid in full, but they fell a little short.  Other than this, it was a good experience and I would recommend New Day.", "rating": 4}, {"title": "Pretty good experience", "text": "The loan originator was great. He gay s promotion and I was switched to another originator what was also good but there was some delay. The appraisal was quick and fair. The underwriting was a little slow but the closing was quick and easy. The settlement company made an error on two small closing checks but corrected the error within a day and issued new checks.  All in all it was a pretty good experience with a few areas to improve.", "rating": 4}, {"title": "The convenience was wonderful", "text": "The convenience was wonderful.  would have liked to have a rate comparison with average market rates.  Would also have enjoyed different loan types to compare.  Overall great service.  Still have not had anyone actually tell me the name of my new mortgage company.", "rating": 4}, {"title": "some of us are disabled so it would be…", "text": "some of us are disabled so it would be very helpful if NewDay would direct pay creditors that are being paid off instead of send us the veterans a check for x company then have to turn around and send it out. In most cases cannot send to anything but a P O Box number therefore cannot send via UPS and get a tracking number. This is the only thing I have an issue with during the entire process.", "rating": 4}, {"title": "Refund", "text": "My experience was fine through the whole process except for one or deal which I am not happy with I paid for the water test for my house and sent the receipts to Peter who was doing my mortgage. I'm still out $140 for the water test and he wants me to chase it around don't think that's fair. I think Peter should follow up on this and get me a refund.", "rating": 4}, {"title": "a few hick-ups but over all apretty…", "text": "a few hick-ups but over all apretty good expirence", "rating": 4}, {"title": "Refinance Loan Review", "text": "The operator I was working with (Evan M.) was very helpful but constantly had to wait for decisions from his higher ups to process paperwork or grant permissions to continue the process of granting a home refinance loan. This resulted in delays that caused the loan process to be extended and not meet the stated refinance closing date. It was delayed almost one month from the original date that was stated. Also, I submitted a voided check at my final closing and was told I would receive a wired deposit to my bank account. Instead I received a check which had to be cleared by my bank resulting in an additional delay of over a week before funds were available. I understand wire transfers cost money but when the customers are told they will receive a wire transfer they should receive one, not a check. Overall I was very pleased with the ease of the loan process and the end result but certain portions of the process need to be fine tuned to help meet closing deadlines and loan payment requests.", "rating": 4}, {"title": "Excellent treatment", "text": "Excellent treatment, kept me informed at all times and made sure I understand each detail.", "rating": 4}, {"title": "Good but expensive.", "text": "New Day got us a loan when others might not have given it to us.  That being said this loan was expensive.  Service was good.", "rating": 4}, {"title": "I've found New Day USA to be a…", "text": "I've found New Day USA to be a friendly, comprehensive and considerate lender. I had very little problem getting documents signed and faxed, even though I live in Oregon, and you're on the East Coast, and have Non-24, a circadian disorder that makes appointments and time deadlines particularly troublesome. I have had some issues with Service Link, NDUSA's escrow processor, but we are currently working to iron those wrinkles out, and I expect everything to be fully resolved shortly. Thank you for your help with my refinancing! It'll be nice to start the New Year solvent, for the first time in 30 years! ;oD", "rating": 4}, {"title": "I kept up with the process of the load", "text": "I kept up with the process of the load, very informative and polite.No hassle in the closing, everything went as planned.", "rating": 4}, {"title": "It took 6 months to finish the process", "text": "It took 6 months to finish the process.  I am still waiting to receive my check. Through it all they stuck with me.", "rating": 4}, {"title": "i think my interest rate is too high …", "text": "i think my interest rate is too high  i've seen them lower but the guy told me that there is no way to get that rate and i bought down 2 points", "rating": 4}, {"title": "Not So Easy", "text": "We went through paperwork process for a mortgage on line. The closing date set up. And we were denied because we had a trust. We should have been told about this before it was finished. We had to start over completely again after removing the trust. The same paperwork was redone. Annoying & slow. It is finally done.", "rating": 4}, {"title": "It’s too early in the Process for me to…", "text": "It’s too early in the Process for me to give a real good assessment of what is just transpired regarding this restructuring in my home", "rating": 4}, {"title": "Excellent", "text": "Excellent service!  The process took quite a bit longer that originally indicated but all in all Daniel was great to work with.", "rating": 4}, {"title": "Mr Novsk helped me through the process", "text": "Mr Novsk helped me through the processWas patient with me", "rating": 4}, {"title": "A process was a  little bit long but I…", "text": "A process was a  little bit long but I got the results I was looking for", "rating": 4}, {"title": "Our experience was long but made easier…", "text": "Our experience was long but made easier due to the great people who were handling our loan.  They explained everything and always were helpful.", "rating": 4}, {"title": "Kurt Seiders was wonderful", "text": "Kurt Seiders was wonderful! If everyone your company was like him, that’ll be 5 stars!", "rating": 4}, {"title": "Everything was wonderful until we went…", "text": "Everything was wonderful until we went to underwriting. I felt they were very nitpicking and really slowed down the process.", "rating": 4}, {"title": "Our refinance was a very easy and…", "text": "Our refinance was a very easy and straight  forward deal..thank you", "rating": 4}, {"title": "New Day USA was very helpful and fast…", "text": "New Day USA was very helpful and fast at helping us with our refinancing", "rating": 4}, {"title": "REVIEW", "text": "Overall1. The person doing my paperwork needs training. He did not lock my rates in so it went up before the closing.2. As of today i still have not received the checks to pay the bills for the consolidation loan. Was told ot would be here no later than yesterday. Other than those 2 major things the loan will help me out drastically and i really appreciate the performance.", "rating": 4}, {"title": "I found the overall experience to be…outstanding", "text": "I found the overall experience to be very exceptional. From the initial contact to the signing of the forms. Went very smooth, with just a few minor hiccups, but that's life in a nutshell. Truly appreciate the helpfulness of our agent Jon Reilly. He worked hard for us and I am very appreciative. The only downside is having to lock in at a rate higher than I had going into the deal, but at least it's a locked rate. Thanks for being here for veterans and their families.", "rating": 4}, {"title": "Our refinance was complicated and took…", "text": "Our refinance was complicated and took more time than I would have liked but NewDay USA delivered.", "rating": 4}, {"title": "Very well organized", "text": "Very well organized, no surprises.", "rating": 4}, {"title": "Glad I did it through NewDayUSA", "text": "Glad I did it through NewDayUSA.  I did not give 5 stars because two main reasons:  I was not offered a free appraisal by my agent, even though I had received DOZENS of offers for a free appraisal right before I called.  I had to ensure the fee was waived or I would have had to have paid the $450-500 fee.  Also, my agent was not aware of the waiver or appeal process when I was confronted with possible expensive repairs/upgrades for my older home.  I had to research and do the entire process myself.  I told the agent the information, and then he became aware of it, after he did research. It should have been the other way around.", "rating": 4}, {"title": "The experience was overall good however…", "text": "The experience was overall good however the lack of communication within the company really needs to be address and fixed.", "rating": 4}, {"title": "Very Professional", "text": "Elena was very professional and answered all my questions.  The estimated closing cost versus the actual cost did over exceed my expectations, but other than that the experience was very good.", "rating": 4}, {"title": "Worked with Spencer McHargh and helped…", "text": "Worked with Spencer McHargh and helped us out very well.  I am not very tech savvy and he helped me  with what I needed to do to get all information necessary to move forward.  Kept us updated on the steps we had to complete to move forward.  All very much appreciated.", "rating": 4}, {"title": "Sean was great", "text": "Sean was great, its when it got to underwriting, they took money to pay off my credit cards, which I do every month, so it wound up being a credit, I think I should have a say in that matter, other than that a little confusion sometimes having to repeat stuff. overall very satisfied.", "rating": 4}, {"title": "Would have given 5 star accept for one…", "text": "Would have given 5 star accept for one part of transactions.  Two Bill's showed on credit report that already were settled but received two checks to pay them off . Was with a debt solutions company that had already settled those two. Now they are both paid the full amount. Accept for this the company is fantastic and polite to deal with.  My contact person was helpful when called with questions.", "rating": 4}, {"title": "Sean Kelly was very helpful throughout…", "text": "Sean Kelly was very helpful throughout the process.  The only thing that was upsetting was the fact that they would not let me take as much money out as they initially said :-(", "rating": 4}, {"title": "Sean Kelley was an excellent…", "text": "Sean Kelley was an excellent associate... he made the transition effortless on our part … thank Sean", "rating": 4}, {"title": "I'm glad I called!", "text": "Our Account Manager and contact, Emmanuel Tsoflias, was the saving grace of the entire process. Because he kept us informed and worked hard to ensure that we were able to get approved for the loan, we chose to be patient and let NewDay be our lender of choice. I was not pleased with the amount of time it took, but in the end, I am happy with the final result and looking forward to maintaining a good relationship with NewDay USA.  We appreciate everything!!", "rating": 4}, {"title": "be prepared to submit numerous docs", "text": "be prepared to submit numerous docs, a clear prerequisite to apply ....", "rating": 4}, {"title": "Refinanced with New Day", "text": "I really appreciate Darren from New Day helping me out and getting my loan done. The only reason I gave it 4 stars and not 5 stars is because there was some issues getting my closing done and it took a little longer where the amount they got to pay off my existing mortgage was higher so I had to pay a little, not much though. Besides that issue  I had a pleasant experience with New Day and again I really appreciate Darren keeping in contact with me.", "rating": 4}, {"title": "My Account Executive", "text": "My Account Executive, Mark Kietzke, was great to work with. He was very knowledgeable and do not hesitate to inform me when I wasn't. He did a great job getting me through the process.", "rating": 4}, {"title": "Joe Rosati", "text": "Joe Rosati, the financial advisor was extremely helpful. Answered every question I had without hesitation. Fully explained each and every step of the process by informing what documents I needed, what part each document did. Was friendly and courteous and respectful. Joe was a breath of fresh air. V/rKevin M Shelton", "rating": 4}, {"title": "Staff was very polite and helpful.", "text": "Date of experience: August 20, 2018", "rating": 4}, {"title": "My New Day rep", "text": "My New Day rep, Jason Fields, did an excellent job.  Very courteous, professional, friendly, returned calls promptly, stayed on top of all transactions, handled problems efficiently.  Very satisfied.", "rating": 4}, {"title": "Overall experience was pretty good", "text": "Overall experience was pretty good, end result was a blessing.", "rating": 4}, {"title": "Everyone was very helpful and curious", "text": "Everyone was very helpful and curious.   The information NewDay needed along the way for the refinance, I thought, could have been initialed in a more timely manner. They asked for one thing they needed, then a whole day went by and they needed another thing. Then another. This happened on a daily basic only to delay the refinance by over 2 weeks. A list of things they needed would have been helpful during this process.", "rating": 4}, {"title": "Quick and easy", "text": "Date of experience: July 31, 2018", "rating": 4}, {"title": "None", "text": "The process took longer than it should have.", "rating": 4}, {"title": "I can say that working with Christopher…", "text": "I can say that working with Christopher Hoffman was a great experience. No pressure no nonsense professional that this Countryneeds more of.  The notary that came to ourhouse -  to receiving in the mail days after our checks and info on how to pay off our credit cards. Please keep doing a great job for ourVeterans..", "rating": 4}, {"title": "First Admiral", "text": "First Admiral, you really don't have an accessible email address even though the emails show up like you do have a public email address.Second, why is (was) it so hard to respond when being emailed with questions? If I wanted to speak with someone I would have called. I wanted a response by email yet I wasn't getting replies, I was getting phone calls. Third, it would have been nice if I had received an email outlining every step in the process, showing those steps that I needed to handle.If you haven't figured it out yet, I don't like talking on the phone when an email would answer my questions.Other than what I have written above, the process really was quick and easy. I would recommend New Day to others.", "rating": 4}, {"title": "Overall it was good", "text": "Date of experience: July 18, 2018", "rating": 4}, {"title": "New day is  a joke", "text": "New day is  a joke,  is a joke. I am a vet and I was in the service for 9 and half years. And I try to get a loan form new day and I got the round around. And then the loan officer told that I did not qualify for the loan and I had a 635 credit score. And NEW DAY USA is 0 star in my book. But that is all good THANK YOU Mr. SOS. Have A Good Day NWE DAY USA.", "rating": 4}, {"title": "Satisfied", "text": "Good company", "rating": 4}, {"title": "We had an excellent Account Executive", "text": "We had an excellent Account Executive, Spencer Wilkins Mchargh, guide us through the tedious refinancing process resulting in a successful outcome.  As a USMC Vietnam Veteran, I was pleasantly surprised that I would be able to obtain a 30 year mortgage to settle our existing Home Owners Line of Credit.  The entire process took under two months to close the NEW DAY USA 100 VA Loan.  Th VA Appraisal process and our ability to comply with the Appraisers noted deficiencies  was the biggest hurdle.", "rating": 4}, {"title": "While I had a good experience", "text": "While I had a good experience, there was a lot of back and forth to present paperwork.  It seemed a little excessive to validate employment.  Did it once, then had to do two weeks later.  Just ask for it close to loan closing to verify we still work were we say.  We took proceeds from our equity to consolidated debt.  Having us mail checks to each creditor is a pain, time consuming and not keeping with current technology.  Recommend New DAY wire transfer or pay creditors themselves to ensure payoff and not shoulder the burden on the consumer. Additionally, New day would have validated the balances with the creditors and pid the exact payoff.  not only did I have to mail the checks, now i have to have the creditors mail me checks for the overpayments.", "rating": 4}, {"title": "My overall experience was good", "text": "My overall experience was good. The two associates that I began the process with were great. They were in touch every step of the way and explained every process. Rob and Ebone were extremely helpful in completing the application. However,  the final process leading to the closing left us at the closing unaware of having to pay a closing cost.  This was not explained by Pratavia the supervisor. Other than that our experience was great.", "rating": 4}, {"title": "I found New Day to be very friendly and…", "text": "I found New Day to be very friendly and non judge mental about my credit history. Had a great procsssor in Brendan L. Everything went very smoothly and closed in less than 30 days. I would use them again and would highly recommend them.", "rating": 4}, {"title": "promised a free VA appraisal later told…", "text": "promised a free VA appraisal later told only applies to refinances. Cost me $450 dollars I hadn't planned on", "rating": 4}, {"title": "New Day USA is a very reputable…", "text": "New Day USA is a very reputable company. We were so amazed at how smoothly this program took to open up some doors that we did not think possible.  Mr.  Zachary Bean, was such a Jewel in dealing with us as a matter fact,  I kind of miss him. THANK YOU NEW DAY USA....", "rating": 4}, {"title": "After a bad experience with the last…", "text": "After a bad experience with the last refinance we went through, I wasn't sure about trying again New Day made the process very smooth. Anthony Giesler was great, the only problem was with the underwriters, it seemed that every day they needed something different, we must have spent at least $50 faxing things, that's an unnecessary expense for us. Maybe you could put a package together that has a list of the things you need and send it out.", "rating": 4}]