[{"title": "Very friendly", "text": "Very friendly, professional English speaking representatives. Process took a month, but they made good on our unfortunate claim. Only reason not 5 star is website would not cooperate necessitating several extra phone calls. ", "rating": 4}, {"title": "What redeems you folks is the…", "text": "What redeems you folks is the performance of Andrea without whose help the tedious process of reimbursement would not have been possible.She was loyal to your company's standards, but honest in dealing with me.  I am indebted to her.", "rating": 4}, {"title": "A Suggestion", "text": "The person helping me was wonderful; she answered my questions.  One challenge - I called because I didn’t receive any confirmation letting me know my claim had been received. I emailed everything as requested, but no acknowledgement.  Even an automatic reply saying it was received would have saved 15 minutes on the phone waiting.  ", "rating": 4}, {"title": "Representative was great, the software wasn't", "text": " The representative answered promptly and was able to  answer my questions. That said, the reason I needed to call is that your claims software did not let me proceed past step five after I had saved the claim and returned to it.  I could also not submit my paperwork by uploading  to your site and had to send things in via email.", "rating": 4}, {"title": "Glad for Cancel for Any Reason Provision", "text": "We were able to use the cancel for any reason provision of our policy after our daughters dog was diagnosed with cancer 3 days before departure.  We were thankful we added this on.  The claims process is clunky and I feel like Seven Corners makes this process complicated and convoluted on purpose.  Like not requesting all the documents needed up front, but asking for documents one at a time week after week in the process and then taking a week to respond back.  But we able to get it done.", "rating": 4}, {"title": "Frustrated but happy!", "text": "We received an email stating our claim would be paid.  But, only after nearly 6 months of numerous phone calls and emails sent. Each time seven corners would keep requesting additional information taking months, and only after we had contacted them. Most info. had already been sent with earlier documentation and receipts.  Really felt like they were hoping we'd give up? But we kept resending until we finally were notified of payment coming.  Except for additional frustration, we are happy with result.  We did receive our payment and though having to jump through many loopholes would definitely use seven corners again as they are a reputable company!", "rating": 4}, {"title": "Good policy, not super fast with a claim", "text": "I don't like trip cancellation insurance because there are too many limitations about what qualifies as a legitimate cancellation.  Besides, most tour companies will postpone your trip with little or no penalty and most airlines will give you a flight credit.  Seven corners offers a policy that is primarily medical coverage with excellent limits for somewhere between 1/10th to 1/15th the cost.  I had to recently make a claim with them for trip delay.  The claim process is pretty slow, but they paid the maximum coverage.", "rating": 4}, {"title": "Apply early!", "text": "I didn't need to use the insurance so I can't speak to how well it works. The brochures and other material appeared clear and self-explanatory. It did take a while to register (done by the organization sponsoring my overseas stint). They said there was some complication particular to the state I am from (New York). So you may want to register early to be sure you are covered from day one of your travel.", "rating": 4}, {"title": "Issue Resolved", "text": "This is an update to my previous review/complaint titled \"Very Dissatisfied.\" The issue has been resolved to my satisfaction. Laura M. at Seven Corners took my case and resolved it. She was courteous, helpful, and responsive.Thanks, Laura!", "rating": 4}, {"title": "But it wasn't a good experience…", "text": "But it wasn't a good experience overall.... I tried to file a claim for by case being damaged with Qantas- but I should have done that within 7 days upon my return. It was 10 days after my return that I got around to trying to submit the claim.  The claim against the carrier is a prerequisite of my claim with Seven Corners.", "rating": 4}, {"title": "I would recommend Seven Corners travel…", "text": "I would recommend Seven Corners travel insurance.  Our trip had to be cancelled due to illness a few days prior to our departure.  I found the staff to be helpful as I made my claim and provided information and once the claim was established in their online system, it was easy to email or upload supporting documents.  The only reason I did not give 5 stars was the length of time the claim took - 6 months.  However, I am pleased and would use them again.", "rating": 4}, {"title": "I found Seven Corners responsive", "text": "I found Seven Corners responsive, organized, and helpful.  My only problem was that I am not good at dealing with electronic devices, partly because I am 82 and did not grow up with these devices.  I did need a physical copy of the form I needed in order to fill out the application for repayment of the costs of an unexpected medical emergency.  I had to call a couple of times before receiving these forms, but they were sent to me eventually.  However, no one acted impatient with my lack of expertise and finally, we figured out how to print the online version of the form which we had been sent initially.  This is a really good company!! In addition, the agents I spoke with spoke clearly and understandably, without difficult-to-understand foreign accents.", "rating": 4}, {"title": "Long but satisfied with the result", "text": "The process of making a claim was a lot (months) longer than it should have been, but I will say that the specialist that I ultimately ended up working with worked really hard to process the claim. Satisfied with the result.", "rating": 4}, {"title": "Easy to understand and buy, didn't need to file claim", "text": "The site made it easy to choose what insurance to buy and gave helpful details about coverage. We got online ID cards to print and carry so didn't have to wait for them in the mail. One suggestion would be to make the print on the cards larger and easier to read. We didn't need to file any claims so have no feedback on that.", "rating": 4}, {"title": "Excellent Customer Service", "text": "Your company has handled my claim very timely and approved the claim as submitted.  Your customer service staff is very knowledgeable and helpful. I really appreciated the emails that were sent.", "rating": 4}, {"title": "Seven Corners came through for me when…", "text": "Seven Corners came through for me when I was unexpectedly diagnosed with AL Amyloidosis and was unable to travel to the Galapagos Islands and Ecuador.  They were courteous, helpful, and refunded the cost of the trip according to the travel insurance contract.  I'm very happy with their service!", "rating": 4}, {"title": "back up medical coverage", "text": "We were fortunate to not need to seek any medical attention while we were in Florida. I'm holding back one star just because I can't speak to how they come through when the coverage needs to be  used.", "rating": 4}, {"title": "The best thing about 'Seven Corners'…Customer Service", "text": "The best thing about 'Seven Corners' travel insuranve was their agent: Joshua De Jong.  This was most important as I did not find the organization's website to be 'User Friendly' which it ought to be as many seniors like myself enjoy travel and feel the need to be protected.  I can't thank Mr. De Jong enough for always being able to reach when I had questions.  Fortunately, I had no need for making a claim but felt comfortable that I was insured to the max.  I look forward to using his service with Seven Corners in the future.   Improvements need to be made in accessing one's insurance on the web and finding it easy to work through.  This is the reason on star (above) is not green.   I was insured for 4 months of travel abroad.", "rating": 4}, {"title": "Seeking General Claims information", "text": "Was able to get information about how to file a claim, however, representative, could have sought to help me with general information about how to file a claim instead of telling me she could not help me without a release from the person I was seeking the info for.  My question did not require any personal or private information, just how soon a claim had to be filed, since in the coverage doc it talks about 20 days and 90 days.  Bottomline, please seek to be as helpful as Seven Corners typically is, before trying to shut someone down and create unnecessary anxiety and work.  In the end, it was fine and she was nice and helpful once we got to what I really needed to know. i.e. \"I can't answer specific questions regarding your mother-in-law's policy without her authorization, but policies provide 90 days from the event date to file a claim.\"", "rating": 4}, {"title": "Excellent service and a good plan", "text": "I shopped for plans at many companies and found the Seven Corners Roundup Choice to be the best for me. Seven Corners was great about answering the phone promptly and answering my questions clearly and directly. You have to read the fine print on contracts to really understand the pros and cons, and they helped with interpretation of the rules. Also, they provided me with everything I needed before the trip. We ended up having to file a claim, and they were helpful with that. The only reason I didn't give them five stars is that they were backed up on processing claims (due to Covid), and it took almost two months to get my refund. However, they were up front about the delay, and sent periodic emails assuring me that I wasn't forgotten.", "rating": 4}, {"title": "Great on buying end, didn't experience claims process", "text": "Obtaining the policy was easy and phone staff was very friendly and helpful. But, unfortunately -- or fortunately -- we didn't have to file a claim, so I have no idea how well Seven Corners does with ease of claims and reimbursement.", "rating": 4}, {"title": "They were helpful in getting me the help I needed, and I had a contact there who was good to work with and gave me the help needed.", "text": "I appreciated getting the high dollar amount coverage that Seven Corners provided. They were helpful to me in getting everything taken care of this in time for obtaining my visa and being able to fly out of the country on time and as planned.", "rating": 4}, {"title": "So far everything has been quick and…", "text": "So far everything has been quick and efficient. Customer service has been excellent Claim not finalized yet. But feel confident it will.", "rating": 4}, {"title": "Great Travel Insurance Options", "text": "The agent offered a more viable and economical package for me and my husband based on what we needed. I rated it one star down because when I had a follow-up inquiry, the agent did not return my call.", "rating": 4}, {"title": "The agents were friendly and helpful", "text": "The agents were friendly and helpful, and very willing to help me switch the dates on my travel policy. The whole conversation only took about 10 minutes. However, I was told my new policy would arrive in email in about 2 minutes, and that was an hour ago. I'm a little worried about whether it actually got changed, but I'm sure there is a reason why it didn't come.  CN # 2RTB22-AOS-118133", "rating": 4}, {"title": "Cancel for any reason insurance", "text": "Purchased “cancel for any reason” insurance on a themed cruise. Unfortunately, we did have to cancel. It took about 3 months, but our claim was paid. I did check in for status updates every month.", "rating": 4}, {"title": "Did not use insurance so can only…", "text": "Did not use insurance so can only comment on ability to purchase--which I have been doing for many, many years. Their site is user friendly and ease to access.", "rating": 4}, {"title": "Awaiting a response to my claim.", "text": "Well, this is a good time for me to write one of two reviews.  I have used Seven Corners many times before, but I have never put in a claim.  Today I did because my flight from Italy back to the US was outright cancelled after being delayed for six plus hours.  We had to spend another night and had to leave the next morning.  The airline paid for the hotel so I did not add that to my claim.  Only food, taxi transportation and one clothing item because I was cold. The claim was fairly easy to input although I had to send the validating documents separately because it kept deleting them (file was too big which I found odd since it was just a few receipts).  I sent them directly to their customer service email. I chose 4 stars for good phone customer service and some direction on the site that I had difficulty using. What remains to be seen is the ease of getting the few hundred dollars I submitted paid to me.  It was actually roughly the cost of the policy itself.   I am not a fan of and have not had good experiences with insurance companies to date.  I'm hopeful this will be different, and I'll upgrade and provide a review once I see how it goes.  Stay tuned!", "rating": 4}, {"title": "Reimbursement information ", "text": "I didn’t realize I would only get 75% of trip cost if cancel. Only saw that trip interruption would be reimbursed 150%.", "rating": 4}, {"title": "Well I’m still waiting on my refund…", "text": "Well I’m still waiting on my refund check, but the last person that I spoke to was very helpful so that’s the reason why I gave it a four stars.", "rating": 4}, {"title": "It was easy to purchase but the cost…", "text": "It was easy to purchase but the cost for limited coverage with many exclusions was no bargain. It seems that the travel insurance industry has as a whole excluded many conditions making coverage very limited for retired travelers.", "rating": 4}, {"title": "Covid travel insurance at a reasonable price", "text": "You offered travel insurance with covid coverage at a reasonable price. Fortunately, I didn't have to use it on my recent trip.", "rating": 4}, {"title": "Nice people being always prompt to answer any questions", "text": "I would highly recommend this to anyone willing to do a little of the work themselves that has the ability to negotiate without letting emotions get involved.I had the great pleasure of dealing with this company. They answered all questions and provided me with the best plan for my needs. Thanks!", "rating": 4}, {"title": "Claim", "text": "In the beginning, there was a delay in the answer, but when they submit an escalation for the claim. The service was excellent.", "rating": 4}, {"title": "Great communication!", "text": "I really appreciated the emails to assure me that my travel insurance was inplace, and I could call up a recent email if I needed quick assistance, aside from my travel ID card I had printed.", "rating": 4}, {"title": "My good luck charm", "text": "Prompt and good response from sales executives.I am unable to add more because, although I have got my policies from them thrice, fortunately for me, I have never (touch wood) had any reason to avail their other services.I guess they are my good luck charm when travelling to the USA.", "rating": 4}, {"title": "About your good service", "text": "They are very approachable and easy to talk with every time I have a question since the day I started working with them.", "rating": 4}, {"title": "Experience was fine", "text": "Experience was fine. Documents clear and concise.  I cannot comment of claims, since I had none.", "rating": 4}, {"title": "Communications", "text": "Communications.  They should ID company  and not just say claims. A person may not open email.", "rating": 4}, {"title": "Easy to purchase", "text": "Easy to purchase. Instructions reasonably clear. Price seemed reasonable.  I did not need to talk to any staff or to make any claims, so I can't address how Seven Corners would correct errors or deliver actual service.", "rating": 4}, {"title": "Positive…", "text": "Other with signing up via the website with no flaw, we don’t have much experience", "rating": 4}, {"title": "Easy to register and buy insurance very…", "text": "Easy to register and buy insurance very informative send emails I did not have to use it on this trip !", "rating": 4}, {"title": "Clear response to questions", "text": "Date of experience: August 27, 2024", "rating": 4}, {"title": "Fast and good phone service", "text": "Fast and good phone service. Long delays in processing claim and constantly asking for additional information.", "rating": 4}, {"title": "Jona Keller was very responsive", "text": "Jona Keller was very responsive, professional and knowledgeable and also very cordial to work with.She is an asset to your company.  The only reason I did not choose 5 Stars is because I have not had to file a claim and need to see how that turns out.... She helped me on numerous occasions between Oct 26-Nov 2, 2022.", "rating": 4}, {"title": "had difficulty getting a e response", "text": "had difficulty getting a e response,  Once i got an individual the response time was great.", "rating": 4}, {"title": "Our situation was a bit complicated", "text": "Our situation was a bit complicated, so it required a few contacts to make sure we were getting what we needed. They were patient with me through all these difficulties, which are all caused on our own end of the transaction.", "rating": 4}, {"title": "Seven Corners helped me to build an…", "text": "Seven Corners helped me to build an insurance plan to match my trip", "rating": 4}, {"title": "Good Service, Helpful People", "text": "Everyone we dealt with was very helpful and the price was fair for the insurance that we got. We did not actually have to make use of the insurance (our vacation went off without a hitch), which is why I have only given them four stars. I don't know how they respond when there is a problem, but if it is anything like they treated us when buying the insurance, I am sure you can count on them.", "rating": 4}, {"title": "They should get in contact with…", "text": "They should get in contact with customers more frequently", "rating": 4}, {"title": "Glad we didn’t need the insurance but…", "text": "Glad we didn’t need the insurance but not sure I would spend that much again.", "rating": 4}, {"title": "The agent was very helpful and…", "text": "The agent was very helpful and explained my options to me. She even tried to help me save money.  As it turned out, we did not need to make a claim but I had everything I needed to do so had it been necessary.", "rating": 4}, {"title": "Kept informed", "text": "Fortunately we did not have any medical issues to use the services, but we got constant reminders and emails from seven corners, which is a good thing. Felt as if we are not forgotten after a policy was sold. Thank you!", "rating": 4}, {"title": "Fast, simple application process", "text": "Thankfully I never had to use the insurance I purchased through Seven Corners, but it was recommended to me by an independent insurance agent I've worked with for years and who has travelled extensively, and I found the enrollment process to be simple and clear, the coverage was great, and the price was reasonable.", "rating": 4}, {"title": "Easiest thing to do", "text": "Easiest thing to do. Can’t give five stars because I have never filed a claim", "rating": 4}, {"title": "Very pleased", "text": "Thankfully, we did not have any issues that would have caused us to file a claim. I have used Seven Corners for several trips and the only time I had to file a claim, they were very prompt in processing it to my satisfaction. Will continue to use Seven Corners as my travel insurance provider.", "rating": 4}, {"title": "Trip", "text": "We had to buy medicine,, because someone took it off the plane with a CPAP machine.  We got it back.  The trip was over.", "rating": 4}, {"title": "Did not need to use the coverage", "text": "Did not need to use the coverage, but in my research Seven Corners provided the best coverage for the cost of the premium.  Details stated clear in regard to coverage and easy to obtain.", "rating": 4}, {"title": "Updated Review", "text": "My husband and I submitted extensive documentation regarding receipts, flight information, and documentation to support that our luggage was delayed significantly on our trip mid June. Even so, we are still waiting to hear back regarding what else is needed to receive some form of reimbursement for our policy (which was not cheap). I attempted to email seven corners again asking for an update, only to find that they blocked my email address. I would recommend finding a different insurance provider that does not block customers' messages.Update: Fortunately I received an email after submitting the review - hence the change on the rating. I’ll updated as needed but I appreciate the quick resolution that happened after submitting this review!", "rating": 4}, {"title": "We did not have to used it!", "text": "We did not have to used it!! That was the best ever", "rating": 4}, {"title": "Originally good coverage, but age restrictions reduced value.", "text": "Originally liked the coverage and customer service. However due to age related reductions in medical care coverage, other policies became more attractive (more generous age-related coverage).", "rating": 4}, {"title": "Claim delays?", "text": "Purchasing the travel insurance was smooth and easy, and there was good communication leading up to the trip.  We did have problems with baggage delays and potentially a lost bag as well, and have been told that it could take over 90 days to process and resolve our claim(s)!  We sure hope it ends up being quicker than that or it will leave us with a less than satisfactory overall experience.", "rating": 4}, {"title": "Purchase process was easy", "text": "Purchase process was easy. We had one claim but the Claims processing was longer with resubmissions of the forms multiple times. Overall the coverage was as listed in the policy and services were good.", "rating": 4}, {"title": "Great value", "text": "Great value !! No complaints. Great sales support on the phone and coverage for wind surfing and kite boarding lessons. Once I paid for the policy it took a couple days to get a few questions answered, but all in all a great product. Did not need to use the insurance, so it was both peace of mind and required for some of my family’s activities.", "rating": 4}, {"title": "Seven corners has been a great…", "text": "Seven corners has been a great insurance provider for my many international trips! My only suggestion is that they communicate more directly with their customers during the claims review and payment process. I have received very little communication after filing a claim, am left wondering when my claim is being processed, am unsure whether or not my claim has been approved until I see the reimbursement in my bank account. It would be helpful to receive more contact with a Seven Corners representative during the claims process.", "rating": 4}, {"title": "There is little to tell", "text": "There is little to tell.  We insured our trip.  The representative we worked with was very good. We were satisfied with the terms, notifications, etc.  In the end, the trip presented no problems so there was no need to make a claim.", "rating": 4}, {"title": "Satisfied with the Health coverage", "text": "Thankfully, we did not fall sick during our stay in the US. So, not in a position to offer comment on prompt claim settlement and other issues pertaining to actual execution of the contract. Felt that the premium for Covid coverage was quite on the higher side at a time when severity of the disease unlike in past is less and therefore less requirement for hospitalization.", "rating": 4}, {"title": "Fortunately", "text": "Fortunately, we did not require their services.Although, it was very easy to apply over the phone and the representative was helpful and kind.", "rating": 4}, {"title": "Very efficient and friendly", "text": "Very efficient and friendly. I used them because I needed a 60-day pre-existing medical window. They were the only ones who offered this and I'm glad they did. It was expensive, but necessary. They probably would have been right in line with all the others if they had a 180-day window.", "rating": 4}, {"title": "Hello.", "text": "Hello.I'm Japanese and I'm not good at English yet.I would appreciate it if you could make the terms of use a little easier to understand.", "rating": 4}, {"title": "Seven Corners trip protection", "text": "Seven Corners provided us the peace of mind we needed for the trip.", "rating": 4}, {"title": "4 stars because of wonderful agent", "text": "I'm giving 4 stars simply because of the agent with whom I dealt - Joshua De Jong. He was extremely helpful, gave me his direct line for any further questions, and sold me the coverage that I asked for. Since I didn't have to use the insurance, I have no idea how successful I would've been in collecting any money due me.", "rating": 4}, {"title": "No way to extend", "text": "Didn't file a claim. The buying process was straightforward and I have contacted an agent through chat that actually got me to a live person. My main issue was I cannot extend the insured days after I start the trip. So if I wanted to make my trip longer even by one day I don't have the flexibility without buying a whole new policy. I also would like options to increase coverage amount for COVID quarantine related expenses.", "rating": 4}, {"title": "Claim pending", "text": "I'll be better able to provide an adequate review if and when my claim for cancellation is complete. It has been 4 weeks thus far and no word from the company.", "rating": 4}, {"title": "Good peace of mind", "text": "Good insurance! Especially with Covid, I found that the Traveler Liaison Plus option gave me peace of mind. It's very easy to use and set-up. Filing a claim could be slightly easier since it does involve filling out forms that could have been automated vs. doing it more manually in .pdf (although glad it's all still electronic).", "rating": 4}, {"title": "travel issues during covid.", "text": "We had no issues with our travel, thus no need to involve this insurance. But, our adult kids, with whom we traveled,  and a grandchild came down with Covid, while in Europe and, getting both information with respect to what was needed to rebook and get reimbursed for travel expenses, as well as receiving conflicting information about getting dr reports and certification of illness…in a foreign country was quite a hassle for them. It worked out in the end, but was stressful! Clearer contact information would have been helpful. as well as better information with respect to what constituted medical certification of illness.", "rating": 4}, {"title": "Third Time Purchasing Seven Corners Insurance", "text": "I have purchased Seven Corners insurance 3 times.  I always chose them because I like speaking to real agents and have agents who are quick to return calls.  The price for the policy was more than others I saw, but I opted for Seven Corners due to service and because they are registered w/ Lloyds of London.  Like others, I submitted a small claim in June for my second policy.  It is August and I have only had limited communication .   I have not pushed the matter...but, am waiting for their response.  In spite of slow claims response, I purchased my third policy simply because France accepts Seven Corners insurance policies for their Visa and Titre de Séjour medical coverage.", "rating": 4}, {"title": "Good morning to you all at seven seas", "text": "Good morning to you all at seven seas. Well the response i got from you about my policy when i ask is quite responsive and professionally done like for example to roll back my policy date and reset for another i was satisfied with all i ask of you and i thank you for that.  So in saying all of that i will look forward in doing business with you again ok . Thanks Garth", "rating": 4}, {"title": "Beneficiary for AD&D missing... called to fix it quick!", "text": "Purchased the AD&D for flight cuz I'm flying on a Boeing plane... Oddly, I noticed there was no beneficiary input when purchased so sure enough it was BLANK upon receiving it in my coverage summary. I called the 1-800-335-0611 number and was immediately connected to a very helpful person who manually entered my beneficiary information as well as sent me a new copy of the summary. EXCELLENT!", "rating": 4}, {"title": "Review policy renewal under flight cancellation", "text": "I did not need to use the insurance, but as always the quote, purchase and confirmation process was easy. The thing that I did not like is that my flight was cancelled, so I needed to stay one more day in Germany. It was not possible to extend my coverage for that day. I think you should review this policy under force majeure situations. For a flight cancellation it does not make sense to request a 5-day policy extension.", "rating": 4}, {"title": "Affordable Safety Net", "text": "Fortunately, I didn't need to submit a claim. However, I felt, in these times when flights are being severely delayed or canceled often, safe just having purchased the insurance. I also liked the medical coverage.", "rating": 4}, {"title": "Covid Flexible", "text": "They were very flexible with moving our dates due to Covid. The only issue we had was that we couldn’t get a straight answer about the coverage when the country we were traveling to required specific coverage to enter the coverage. If not for that, it would have been 5 stars.", "rating": 4}, {"title": "There really isn't a report that I can…", "text": "There really isn't a report that I can give as I did not have to use Seven  Corners.  In favor of this company, I was Super Happy they worked with me regarding the Covid situation and the shift in my reservations.  The telephone correspondents were wonderful helping me with questions.In the future, I will try Seven Corners once again-I have been using a competitor for 15 years and will be happy to use Seven Corners in the future.Thank you,Nancy Holmes", "rating": 4}, {"title": "Traveling is a real challenge now", "text": "Traveling is a real challenge now.  It is frustrating receiving directions from countries during covid.  Time constraints and mandatory travel insurance now needed for trips, is annoying.   Seven Corners allowed us to get the basics and a certificate to get us to thru the AP gates.   Honestly, the barest necessity.   We were talked thru the process and appreciate the simplicity.    Travel requires lots of $$ to pay for the incidentals, testing, etc.   The easier you make it for us to acquire, the better.", "rating": 4}, {"title": "The representative is wonderful", "text": "The representative is wonderful, pleasant, knowledgeable. I would love to have an employee like that.Unfortunately- due to your current numbers of issue and constraint, it took me 3 weeks to reach her, by calling, messaging, talking to answering service people, and emailing.Thank you. I did get the help that I needed.", "rating": 4}, {"title": "A Welcome Change from Other Providers…", "text": "My previous travel insurance provider required speaking with four people before I could get a quote which was eleven times higher than the year before. At Seven Corners I spoke to a knowledgeable salesperson who found the right policy for me  in under ten minutes. The cost was a fraction of what my previous provider charged.", "rating": 4}, {"title": "We have used your insurance for a…", "text": "We have used your insurance for a number of years,this year we found it harder to get a representative on the phone to renew our service,we did it online and had to email back to get receipt and new enrichment card.We never used the actual insurance,so we don’t know what the service is like to evaluate.It seems it has become more expensive", "rating": 4}, {"title": "Well", "text": "Well, what can I say - I didn't need to use the insurance on my trip, or the last trip, or the trip before that. I don't think it is a good luck charm but I might give it 5 stars if I got a 25% off coupon for my next policy", "rating": 4}, {"title": "We had no need to use our insurance…", "text": "We had no need to use our insurance policy so I can't speak to that. As far as buying policies, it was an easy process. I would like to have had a better understanding of what was covered as far as CoVid restrictions. Next year when I purchase this insurance I will ask more specific questions of the agent I am working with.", "rating": 4}, {"title": "Knowledgeable agent. Friendly", "text": "Did not have to use insurance", "rating": 4}, {"title": "Preferred policy for travel insurance", "text": "I booked the policy through the assistance of Mr. Tristan Schllings. He helped in making the right choice, especially regarding the cover for pre existing ailments. Later I had some hick ups in accessing the policy through the app. This was promptly resolved. Finally I had some doubts of answering some questions on insurance status while taking Covid vaccination and tests in the USA. These also were resolved.", "rating": 4}, {"title": "Peace of mind during a time when travel…", "text": "Peace of mind during a time when travel plans - can get complicated.With shifting and unclear travel restrictions, something as little as a poorly timed (false) positive test can derail a trip connection or a hotel stay. Knowing that someone has your back in these awkward times is both financially and emotionally ensuring. Allowing you to focus on enjoying the experience of the trip.", "rating": 4}, {"title": "I was in need for insurance for a…", "text": "I was in need for insurance for a single trip only. I contacted Seven Corners and was helped promptly by Sven. Only drawback was that he insured me from 15 to 19 March at a cost of $55.  I thought that I heard $35.00 for 18 - 19 March. So I suppose that it was a misunderstanding.", "rating": 4}, {"title": "I've used your insurance 4-5 times and…", "text": "I've used your insurance 4-5 times and I've never had to use it, I'm a 54 year old man who's in great shape never had covid and an avid surfer, the first time I bought the insurance it was $87 then it went to $120 and the last time was $187 I feel it a bit to expensive!", "rating": 4}, {"title": "This medical insurance in Japan", "text": "This medical insurance in Japan was decent and gave me a sense of safety. I knew I didn't need it, but during the COVID I liked to have some security since Japanese medical cost is very high for non-Japanese.The process of getting this insurance was easy and to extend it was not so bad, except they kept \"reminding\" me to extend it even after I extended it.I recommend this insurance for any traveler going to Japan for more than a month.", "rating": 4}, {"title": "Great! (but I have never made a claim)", "text": "I don't feel like I can leave 5 stars because I have not made a claim to have the full experience.Other than that, everything has been great. They are very quick to communicate through web chat or phone. The price seems competitive with market rates for the coverage. I felt safe using them, mostly because they have responded within minutes 100% of the time. I have contacted them about 6 times to provide coverage and to get extensions.", "rating": 4}, {"title": "It’s a little hard to write a review…", "text": "It’s a little hard to write a review for insistence that we thankfully did not end up needing to use but here goes! We were looking for travel insurance for medical and quarantine expenses while traveling out of the United States during Covid. Kendra was very helpful in guiding me in what we would need and helping me buy the insurance. Immediately after I purchased insurance, I received an email with all of the information we needed in case we had to file a claim along with insurance cards and information about the various ways to contact them if needed.", "rating": 4}, {"title": "Overall, good product", "text": "I have bought their travel insurance several times. Overall they offer good service for reasonable price. If there is any area that I could point out for improvement is the communication when it comes to the reimbursement: It took a some time to get back the money I have paid for medical services, but I got it. Nevertheless I didn't receive any communication informing that my request had been accepted, that any payment was sent back to my, etc. I just received some money quantity similar to what I had paid (it had some variation, I suppose due to the volatility of the currency).", "rating": 4}, {"title": "Great experience from start to finish", "text": "The person I spoke to about insurance was extremely helpful and honest about what would be the best coverage. We had to call during our trip and the agent was extremely helpful.We never used it, but the peace of mind having this insurance was well worth it.", "rating": 4}, {"title": "Extending a polciy", "text": "I’ve used Seven Corners to insure several trips and it was easy to get a policy quote and get the policy purchased. What wasn’t so easy was to get insurance when my trip was extended after the trip already started. Since I was overseas when I needed to extend the dates, I used the chat feature and gave up after waiting an hour when my request was transferred to a sales agent. The second time I tried, I was able to get additional insurance, but it was a lot more time than should have been necessary.", "rating": 4}, {"title": "AVOID this company at all costs!!", "text": "Update: They finally reimbursed the full claim and I’m very thankful to them. They had prompt response and processing after I posted my review here and at FB as communication was scant prior to that. I will recommend it since they reimbursed the whole amount of claim without putting any fight, but I wish, they were more communicative and accessible after the claim was submitted. Initial Review: AVOID this company at all costs!!! We submitted the claim after my hospitalization in Peru in April and so far, (it’s August), nothing came out of it! Haven’t received any communication since June! No response to Email inquiry and if you call, despite 20+ min wait time, customer agents are available to talk! Extremely regrettable to pour money into this scam! Please avoid!", "rating": 4}, {"title": "Very easy and smooth experience", "text": "Date of experience: September 01, 2023", "rating": 4}, {"title": "I was satisfied with Seven Corners…", "text": "I was satisfied with Seven Corners InsuranceI felt everything was straightforward in terms of getting the coverage appropriate for my situation. I just wish I would have found out that I could have extended my travel insurance when my circumstances changed. Anyway, I will use Seven Corners again in my future travels.", "rating": 4}, {"title": "Amazing service", "text": "The main thing in every trip is to know that you're in safety. I don't take out long insurance contracts, I prefer to take out certain travel insurance contracts for certain trips. Moreover, I would note that I always change companies which help me to take out an insurance contract. So, recently I applied to this company in order to take out an insurance contract for my future trip abroad. I was amazed by the service of this company, because the staff seemed to me very polite and responsive, because they explained me everything in details.", "rating": 4}, {"title": "GOOD", "text": "CORONO VIRUS IS NOT COVEREDIN MY OPINION WHEN GOVERNMENT RELAXED THE RESTRICTIONS. SO MEDICAL COMPANIES NEED TO COVER CORONO VIRUS FOR ATLEAST FULLY VACCIANATED PEOPLE.", "rating": 4}, {"title": "Gave me peace of mind", "text": "My coverage was exactly what I need it to be and it was inexpensive, which is good because I was working with a budget. I was traveling to a country that would send me to a quarantine facility if I tested positive, so I really wanted to make sure the insurance covered this specifically. It covered this and more, and when I called the company to double check it was easy to talk to someone. I met with them without waiting very long and they answered all of my questions well. I am giving it four stars because I never had to use it (thank goodness!) so I can't speak to the reimbursements or anything- but it made me feel comfortable to travel.", "rating": 4}, {"title": "Policy wasn't updated with new trip dates as I was assured would happen", "text": "My trip dates were changed due to the pandemic. I requested that the policy be updated to reflect the new dates for 2022, and was told that would happen. but evidently it didn't since I just received notification that my policy expired. I also receive this request for a review. I sent a message inquiring about this issue and haven't heard back yet. Hoping this can be resolved.Update, issue was resolved today. Seems an email got lost in cyberspace leading to a miscommunication. They were very responsive.", "rating": 4}, {"title": "Efficient service in buying the…", "text": "Efficient service in buying the insurance.  We had no need to file a claim although Seven Corners did reach out to explain the process if necessary.", "rating": 4}, {"title": "Would use again", "text": "Took a long time, but it worked out in the end! Would definitely recommend. The person I spoke to when purchasing was extremely helpful! Quick and painless.", "rating": 4}, {"title": "Our rep as very informative and…", "text": "Our rep as very informative and knowledgeable Explained everything Easy to understand Thanks", "rating": 4}, {"title": "Disappointing when extending coverage", "text": "Great initially.  When we needed to extend our coverage we were required to add 5 days when we only needed 2 days.  Unnecessary and disappointing. Why charge the existing customer more than necessary?", "rating": 4}, {"title": "Quick easy and efficient", "text": "It was very quick and easy to obtain a policy. Thank G-d I didn't have any reason to claim and as such cannot comment about claim payouts but in terms of obtaining a policy was super easy, smooth and efficient and i would look to use them again  !!!!", "rating": 4}, {"title": "Covid Protection", "text": "Investigated extra protection due to Covid and Heather K. was very helpful reviewing plan options. She deserves 5 stars but gave only 4 because I did not have to use the travel insurance (fortunately) to test the coverage/reimbursement process!", "rating": 4}, {"title": "Easy to understand and enrol", "text": "Date of experience: August 06, 2023", "rating": 4}, {"title": "Somewhat confused", "text": "Somewhat confused.  I purchased the insurance while in Bali, Indonesia.  I am a resident of the US.  Most travel insurance must be purchased before departure to a foreign country.  Is Seven Corners the exception?", "rating": 4}, {"title": "great website for ordering insurance", "text": "the website for ordering insurance was very well designed and thought out.  inevitably, i had to back track, to adjust some dates i had entered earlier, and this site kept most of what i had entered, once i returned back to the later stages of processing.  very good !i have no information on how competitive their insurance rates are, because i didn't shop around.  (too time consuming, after already finding one good website)i refrained from giving 5 stars, because i did not get sick, and therefore could not test any aspects of having to get re-imbursed by the insurance, thank god !  if this would work as smoothly as the website interaction, it would definitely be 5 stars.  but this is for somebody else to comment on.", "rating": 4}, {"title": "Easy to apply.", "text": "Coverage is at a reasonable price.", "rating": 4}, {"title": "I am a bit hesitant to give 5 stars…", "text": "I am a bit hesitant to give 5 stars simply because I did not have to use the insurance coverage.  I would like to reserve the rating based on my actual experience with its use.  Thankfully, this trip was without incidents.", "rating": 4}, {"title": "Cost", "text": "You need to increase coverage amounts as people age. If you finally have the time and money to travel overseas it’s too bad insurance coverage is so limited.", "rating": 4}, {"title": "The service obtained was satisfactory", "text": "The service obtained was satisfactory. The only concern was that it would be great if any refund to be made a little quicker.", "rating": 4}, {"title": "Choosing and paying was very clear and…", "text": "Choosing and paying was very clear and easy.  Have never had to use the service so no experience if it works well.  Pricing is reasonable for all options that are offered.", "rating": 4}, {"title": "Comparable price for the coverage", "text": "Comparable price for the coverage we chose. Easy to purchase online. We had no need for a claim, so I can’t really review the company in that important area.", "rating": 4}, {"title": "Exception Granted!", "text": "Re: Certificate #9RTC19-14999UPDATE:  I commend Seven Corners for the quick response to my review.  The company replied within hours of posting to say they would review my situation.  This morning they extended the life of my policy until the end of 2023.  I appreciate them reaching out and resolving my concerns so quickly.ORIGINAL REVIEW:  I am disappointed Seven Corners puts a time limit on the life of the policy while the pandemic is ongoing.  International travel is spotty at best.  We purchased coverage for travel to Israel before the pandemic started and that country is currently closed to all visitors.  I understand a company cannot keep a policy open forever, but it seems appropriate for Seven Corners to refund the policy purchase price if they decide not to provide the coverage for a trip yet to be taken.", "rating": 4}, {"title": "happy customer", "text": "Policy choice, selection, and enrollment is easy and each step clear and concise.  Fortunately, we had no claims so can't comment on that process.  Peace of mind was important.", "rating": 4}, {"title": "The process was very easy to complete", "text": "The process was very easy to complete. Could use some information guides on options available as in are they necessary or not. Only purchased due to Covid requirements.", "rating": 4}, {"title": "I did not have to use any Seven Corners…", "text": "I did not have to use any Seven Corners services, but did find their application process easy to access and understand plus their coverage options were excellent.", "rating": 4}, {"title": "Short visit of 3 months to USA", "text": "I had visited USA to meet my daughters and availed of this policy. I visited the doctor once and didnt have to pay for the visit. So I am satisfied. Thank you", "rating": 4}, {"title": "I never used the insurance during my…", "text": "I never used the insurance during my travel, so don't really know if it's providing a good service but setting up the account was easy and the price is good", "rating": 4}, {"title": "The customer service is fantastic", "text": "The customer service is fantastic, as far as going through the process.  Fortunately, I have not had to make a claim, therefore it would be hard to rate a 5 star.", "rating": 4}, {"title": "It was easy to apply for and obtain…", "text": "It was easy to apply for and obtain insurance.  Everything went well on our trip so we did not have a need to interact with the Seen Corners staff. sign up was easy", "rating": 4}, {"title": "fortunately we did not have to call on…", "text": "fortunately we did not have to call on Seven  Corners for any  assistance but  it was a comfort  to know  they  were available should we need  them.", "rating": 4}, {"title": "Obtaining trip insurance was easy", "text": "Obtaining trip insurance was easyThe representative reviewed the key provisions of the policy and how it fit our specific needs", "rating": 4}, {"title": "Purchased the insurance", "text": "Purchased the insurance, but did not need to use - I'm assuming they would live up to the agreement - glad I had it", "rating": 4}, {"title": "Some hiccup getting refund for trip cancellation…", "text": "Trip didn't happen due to Covid. SevenCorners chose to not refunding at first. But after a few communication, they decided to make it right.", "rating": 4}, {"title": "Fortunately we didn't have a need to…", "text": "Fortunately we didn't have a need to file a claim, but gave us some security for \"Just In Case\".  Thus the 4 * rating.", "rating": 4}, {"title": "I didn't need to use my insurance", "text": "I didn't need to use my insurance but found it easy to purchase.  The 4 stars reflect the ease of purchase.  It provided peace of mind.", "rating": 4}, {"title": "Good price", "text": "It got 4 because it was a good price for the coverage although we did not use it at all.", "rating": 4}, {"title": "Since we had an uneventful", "text": "Since we had an uneventful, safe trip, no claims were submitted. I did appreciate knowing we were covered...it was easy to enroll!", "rating": 4}, {"title": "Attentive, flexible and reasonable", "text": "The company is attentive and easy to work with. They were particularly accommodating and flexible given changes in travel plans given Covid.", "rating": 4}, {"title": "Easy Plan Purchase", "text": "Sign-up process was relatively simple resulting in my not encountering any difficulties in purchasing a plan. Plans were affordable.", "rating": 4}, {"title": "We didn’t have to use any of the…", "text": "We didn’t have to use any of the coverage, but the cost to coverage is reasonable.", "rating": 4}, {"title": "Making the Right Decision for Travel Insurance!! :)", "text": "For my original policy I purchased online by the recommendation of our group scuba dive leader to Maldives. That was easy enough but wish I knew more about your options of plans including the Wander Frequent Traveler. Since I have another international trip this month, I wanted to learn more so I called Customer Service. Unfortunately they could not help me after a long wait and then having them call me back. They tried to transfer me to Sales but that did not work so I called the Ph# she gave me. Again a long wait to get a call back but finally was reached by Kendra who was immensely helpful and patient to explain the benefits of the program and eventually signed me up for the year!! I am glad that we worked thru the differences of Liaison Travel Plus so I could make my decision to be covered for all my trips for the next year as I do travel internationally quite often. Even though I had some frustration, I accomplished what I needed and very happy with my results and resolution!! :)", "rating": 4}, {"title": "Good service with a real person", "text": "Good service.  Reps that answer the phone are helpful and know the answers to my questions.  Nice to talk to a real person.", "rating": 4}, {"title": "I never get to use it but I'm glad I've…", "text": "I never get to use it but I'm glad I've got it in case my trip gets canceled  for different  reason.", "rating": 4}, {"title": "They helped me fix my problem", "text": "They helped me fix my problem, but the attitude of the person that I was talking to could’ve been better", "rating": 4}, {"title": "I was helped by a very pleasant girl…", "text": "I was helped by a very pleasant girl over the phone, who was proficient and explanatory and provided me with the service I needed.", "rating": 4}, {"title": "Answered all my questions did a good…", "text": "Answered all my questions did a good job on explaining the benefits and what was included", "rating": 4}, {"title": "Great communication and professional…", "text": "Great communication and professional employees available to help.", "rating": 4}, {"title": "I'd use the services of this company…", "text": "I'd use the services of this company the second time exactly as my experience was quite good than bad one.", "rating": 4}, {"title": "Most of the staff were helpful during…ups and downs", "text": "Most of the staff were helpful during the Covid process. A couple didn’t want to take the time and I knew it immediately.", "rating": 4}, {"title": "Didn't Need the Insurance", "text": "Date of experience: August 26, 2023", "rating": 4}, {"title": "I truly can not thank this company…", "text": "I truly can not thank this company enough because where others have failed me they helped me out, thank you once again", "rating": 4}, {"title": "Now nothing but emails that I don't…", "text": "Now nothing but emails that I don't want to see. STOP", "rating": 4}, {"title": "I received the contract in a timely…", "text": "I received the contract in a timely manner. Fortunately, I did not have to use it. Thanks!", "rating": 4}, {"title": "Good service", "text": "Good service! Haven't had to use the insurance yet, but it's easy to buy.", "rating": 4}, {"title": "Affordable travel insurance solutions…", "text": "Affordable travel insurance solutions for international travelers, accessible and understandable to all", "rating": 4}, {"title": "Seven Corners always kept me updated of…", "text": "Seven Corners always kept me updated of my benefits. Didn`t face any problem with their services.", "rating": 4}, {"title": "Your service was quick and very…", "text": "Your service was quick and very efficient thank you and I will be using you in the future if needed.", "rating": 4}, {"title": "The price of the insurance was pretty…", "text": "The price of the insurance was pretty reasonable with an adequate coverage. Looks good overall.", "rating": 4}, {"title": "Very Helpful", "text": "Very very helpful and extremely nice in adjustments to my policy that i needed", "rating": 4}, {"title": "Web site did not work when I needed it.", "text": "Web site did not work when I needed to extend. Had to make an overseas call.", "rating": 4}, {"title": "Good", "text": "Not 5 stars because didn't respond to email! Other then that they were great", "rating": 4}, {"title": "I’m really not sure", "text": "I’m really not sure, it’s easy to join, but I didn’t have to use the insurance.", "rating": 4}, {"title": "Organise and easy access", "text": "Organise and easy access. Documents also clear and easy understanding. Good services", "rating": 4}, {"title": "Reasonably priced", "text": "It was cheap. Didn't need to use the insurance but it was reasonably priced.", "rating": 4}, {"title": "No hickups this trip", "text": "No hickups this trip.  Good to have backup.", "rating": 4}, {"title": "Reliable shipper on time and the ring…", "text": "Reliable shipper on time and the ring was as stated in the description", "rating": 4}, {"title": "The best part of it", "text": "The best part of it, is that I never need to use your service. Thank you.", "rating": 4}, {"title": "They attend to all queries right away", "text": "They attend to all queries right away. I never had to wait long.", "rating": 4}, {"title": "Helpful customer service associates.", "text": "Date of experience: June 11, 2024", "rating": 4}, {"title": "Great for travel to Costa Rica", "text": "Great job and followed up promptly with questions I had about coverage.", "rating": 4}, {"title": "I will always choose them for my…", "text": "I will always choose them for my international travel.", "rating": 4}, {"title": "Quick reply to claim.", "text": "Quick reply to claim. ", "rating": 4}, {"title": "good for continuing J-1 visa as well as…", "text": "good for continuing J-1 visa as well as travel.", "rating": 4}, {"title": "Great responsiveness.", "text": "Very quick response and flexibility.", "rating": 4}, {"title": "I had trouble with the website.", "text": "Date of experience: July 18, 2022", "rating": 4}, {"title": "Good insurance", "text": "It's reliable insurance", "rating": 4}, {"title": "Overall a good experience", "text": "Date of experience: August 20, 2022", "rating": 4}, {"title": "She was informative and respectful", "text": "Date of experience: June 03, 2022", "rating": 4}, {"title": "Good experience", "text": "Thanks for good experience using the service", "rating": 4}, {"title": "Excellent service", "text": "Excellent service and followup by Tristan", "rating": 4}, {"title": "Fair price", "text": "Fair price. Good covid coverage", "rating": 4}, {"title": "Only a 4 because I have not traveled yet", "text": "Date of experience: October 31, 2021", "rating": 4}, {"title": "Trip cancelled", "text": "Trip cancelled.  Thank you anyway.", "rating": 4}, {"title": "👍🏽", "text": "👍🏽 Recommend.", "rating": 4}, {"title": "Great price - Great product", "text": "Great Product - Great Price", "rating": 4}, {"title": "It was good experience.", "text": "Date of experience: June 24, 2022", "rating": 4}, {"title": "Good job", "text": "They have good customer service.", "rating": 4}, {"title": "quick", "text": "quick. efficiont. easy. thanks!", "rating": 4}, {"title": "i am satisfied with seven corners", "text": "Date of experience: April 26, 2021", "rating": 4}, {"title": "Excellent customer service!", "text": "Date of experience: November 02, 2021", "rating": 4}, {"title": "Quick response", "text": "Date of experience: July 17, 2022", "rating": 4}, {"title": "Very prompt service ...", "text": "Date of experience: December 01, 2021", "rating": 4}, {"title": "Thanls for the service", "text": "Date of experience: November 29, 2021", "rating": 4}, {"title": "Quick response", "text": "Date of experience: May 30, 2022", "rating": 4}, {"title": "Excellentseven corners  service", "text": "Excellent service", "rating": 4}, {"title": "my trip", "text": "ok， it was nice", "rating": 4}, {"title": "Satisfactory", "text": "Date of experience: March 01, 2022", "rating": 4}, {"title": "good service", "text": "Date of experience: February 01, 2022", "rating": 4}, {"title": "No problems.", "text": "Date of experience: September 14, 2021", "rating": 4}, {"title": "Laura from Customer service was able to…", "text": "Laura from Customer service was able to assist me.  The first person I called at the beginning of the week was not able to complete the task, but at the same time they did not offer to get someone else to complete the task, nor did I receive any follow up phone calls to complete the task.   But Laura Sr Customer Service Advocate was competent and complete today.", "rating": 4}, {"title": "Fairly easy to use", "text": "Fairly easy to use.  Rates and navigation are reasonable.Will definitely use again", "rating": 4}, {"title": "We had no issues but felt confident in…", "text": "We had no issues but felt confident in our trip if some need did arise.", "rating": 4}, {"title": "It was a little confusing as to what I…", "text": "It was a little confusing as to what I needed to do, I had to ask 5 times to get a clear answer. Felt a little evasive.", "rating": 4}, {"title": "I had a good experience with Seven…", "text": "I had a good experience with Seven Corners. Thank you", "rating": 4}, {"title": "I Get Good Vibes", "text": "I had purchased a Travel Insurance package for a vacation that I cancelled due to covid.  I contacted SC via email when I booked another trip, to see if it was possible to move the policy to the new trip. I waited a few days and did get a response.  There were additional charges, but they were easy to work with and agreed to move the policy to the new trip.  I am now reviewing their options for a new cruise booking.  I need CFAR and a pre-existing condition waiver, which few companies offer in combination.  Seven Corners will do it and their price is clearly the most competitive, with flexibility of choices and very competitive coverage.  I like these folks.", "rating": 4}, {"title": "It’s convenient with great options to…", "text": "It’s convenient with great options to choose to fit your needs.", "rating": 4}, {"title": "Appreciated being able to  get", "text": "Appreciated being able to  get medical/covid19  insurance coverage whilst already traveling, even though rather more expensive. Didn’t need to use it thankfully but reassuring to have. Polite helpful personnel guided me through the process.", "rating": 4}, {"title": "Reasonable and Responsive Insurance", "text": "Reasonable pricing for a year long trip abroad. Very quick to reimburse medical bills. A little bit of back and forth regarding issues to repatriate during the COVID crisis when we were stuck abroad but Seven Corners pulled through in the end. Overall my partner and I are pleased with the coverage and we felt protected and secured in any situation. I highly recommend them.", "rating": 4}, {"title": "COVID-19 PCR test", "text": "I took this insurance because of COVID and it did approve of the PCR COVID TEST which would cost me $150 per person. Thumbs up", "rating": 4}, {"title": "The Time to process claims was super…", "text": "The Time to process claims was super slow. It took months in my case after I submitted the paperwork. The rest was good.", "rating": 4}, {"title": "Would give a 5star if she would have…", "text": "Would give a 5star if she would have let me know i needed the QCR Code at the Airport", "rating": 4}, {"title": "Hope I never use it", "text": "I have not needed to use the policy, but feel secure knowing if something tragic happens overseas I will have the insurance to assist with any problem. I do wish the company would send a reminder of renewal earlier than a week before renewal. We were traveling during renewal time so I purchased a new policy two weeks before we left for Mexico. Please send renewals a month in advance so I may maintain coverage without double coverage or lapse.", "rating": 4}, {"title": "my agent is amazing", "text": "my agent is amazing, however had no claim yet, luckily. That is when you see how good an insurance really is....", "rating": 4}, {"title": "I recommend using seven corners", "text": "I recommend using seven corners. They had helpful customer service and it was relatively straightforward to file a claim. I think the CX for filing a claim could be improved. It was a little messy with email correspondence.", "rating": 4}, {"title": "Sevencorners is expensive but very good - especially during COVID", "text": "Sevencorners is a good travel / health insurance company. Its one of the few companies that provides cover for COVID. I am a Spanish resident traveling around the world during COVID. Sevencorners is the only insurer that can offer me insurance cover based on my complicated situation. Sevencorners  are  very expensive BUT its very easy to get a quote (you can speak to an online adviser - they are excellent), to adjust a quote and to buy insurance. I wouldn't always use Seven Corners as they are so expensive but for the moment during COVID they are are the only solution for an intrepid traveller like me.  Also making a claim is easy. So for the moment during COVID Sevencorners are a really good solution", "rating": 4}, {"title": "Easy to obtain insurance", "text": "Easy to obtain and to renew this insurance.  We never had a claim so don't know how it would be to utilize.", "rating": 4}, {"title": "I had a kidney infection 5 days I…", "text": "I had a kidney infection 5 days I arrived in Denmark and had to be in hospital for 5 days. The claim took a while to be processed, about 50 days, but they refunded the GP consult and the hospital bill, which was around CAD5.000. The only bad thing was the delay and the fee of DKK60 for transfer they charged. The customer support was very good. I'd recommend.", "rating": 4}, {"title": "Thoughtful Customer Services", "text": "Knowing that most people will not be able to travel internationally due to the pandemic, Seven Corners should have been more proactive with social responsibility in mind, to refund at least partial insurance costs paid by her customers, just like most insurance companies.However, Seven Corners decided to take this windfall of profits and do nothing. Rather shameful!!!!Further Comment:After my above review was posted, Seven Corners reached out to me very quickly and requested more information on my dissatisfaction. I replied with additional details and within 2 weeks, they provided and I received about half the amount I paid as refund. I believe this is a reasonable settlement and their timeliness in addressing my concerns should be complimented.Thank you to Seven Corners in light of the many travel disruptions due to the pandemic.", "rating": 4}, {"title": "No events", "text": "No events so I had no experience using the service other than purchasing the policy", "rating": 4}, {"title": "Great Service", "text": "Have not had the occasion to use the insurance yet but purchase was easy and Heather was helpful and very well versed in the products they sell.Also appreciated that Seven Corners is very well priced compared to many others.", "rating": 4}, {"title": "Seven corners has been easy to use and…", "text": "Seven corners has been easy to use and reliable. I must reserve the 5th star until and unless I have to submit a claim which I hope doesn't happen.Thank you", "rating": 4}, {"title": "I bought this insurance purely for…", "text": "I bought this insurance purely for COVID coverage while traveling outside the US. While the process was super easy, because I never had to use it it’s hard for me to say anything on the other side of service of actually using the coverage. I’m glad I didn’t have to use it, so it was great peace of mind.", "rating": 4}, {"title": "We felt safe knowing we were covered…", "text": "We felt safe knowing we were covered for our medical while we were away!", "rating": 4}, {"title": "Sales personnel is top notch", "text": "Sales personnel is top notch. They know what they’re talking about and are willing to help. However, after sales service suffers and needs help. I don’t know if they are understaffed or just that busy. Getting someone on the phone is virtually impossible.", "rating": 4}, {"title": "I actually did not use my insurance at…", "text": "I actually did not use my insurance at all so I am not sure what can I say about it.", "rating": 4}, {"title": "We believe in you", "text": "We never got to make any claims. However, we always feel that we are well taken care of.", "rating": 4}, {"title": "Good service", "text": "Good service, prompt response. However call center is not so friendly. Sometimws hard to get with a representative.", "rating": 4}, {"title": "Great service thanks", "text": "Date of experience: July 30, 2020", "rating": 4}, {"title": "Trip Coverage", "text": "Trip was uneventful and went as planned.  Therefore insurance claims were not needed.  At our age it is better to have coverage as a peace of mind then going on a wimp.", "rating": 4}, {"title": "Good experience", "text": "Good experience. However, web site is not so friendly and communication through the posted phones have been in some cases complicated to get with a representative.", "rating": 4}, {"title": "Great customers service", "text": "Date of experience: July 13, 2020", "rating": 4}, {"title": "Good service, just have to be patient with reimbursement", "text": "Seven Corners always reimbursed me, only it took months to reach my bank account", "rating": 4}, {"title": "Update on claim status", "text": "On March 10th we had to cancel a trip to Egypt.  We immediately filed on our Cancel for any Reason with Seven Corners.  It was difficult to get in touch with them.  On May 7th, I reviewed them on this website and our claim was immediately settled.  We got a check today for the correct amount.  I realize that they are overwhelmed with claims-my only suggestion is that they send out updates just so you know they have the claim in their system.  We are satisfied with their handling our claim.", "rating": 4}, {"title": "Long covid backlog", "text": "Had cancel for any reason coverage, and was forced to cancel a trip to Australia due to Covid restrictions. The claims process is slow at this time with the increased volume of claims (took about 7 weeks in all). However, after submitting lots of documentation, making a few calls, and waiting my claim was processed and paid in full. Be willing to wait and have lots of documentation, but claims are paid if you have the appropriate coverage. Customer service can be hard to get a hold of, but I always got through eventually, and they were always nice even if not able to due much to expedite the process.", "rating": 4}, {"title": "Easy purchase", "text": "Fortunately didn't have to use the service after purchasing,but the purchasing process was simple, easy to understand and quite quick.", "rating": 4}, {"title": "Did the right thing and helped out", "text": "UPDATE:  Did the right thing and helped out given the current situation.   Thanks!Says will stick with $25 cancellation fee as \"that is part of the contract.\"   Well, we don't have a contract anymore as it is in force majeure due to the pandemic.   Had the unfortunate happen:   returning home from an extended trip due to the pandemic. Thus, had to cancel Seven Corners.", "rating": 4}, {"title": "Convenience and Relaiablity", "text": "It was convenient for me to purchase the plan online. Additionally, my insurance certificate was acceptable for the Italian Visa Application without any question and hesitation.", "rating": 4}, {"title": "I recently travelled to Germany and the…", "text": "I recently travelled to Germany and the Canary Islands for 2 1/2 months. I'm 66 years old and got the insurance for a piece of mind. Didn't need it, so it's hard to rate it.", "rating": 4}, {"title": "Good travel insurance with car rental insurance option for days car is hired not on days whole trip is insured", "text": "Seven corners provided comprehensive travel insurance with lots of additional options. What I especially liked is that you can bundle in car rental insurance calculated on the actual amount of days you are hiring a car and not calculated on for the whole trip which other insurances automatically do.", "rating": 4}, {"title": "We had no issues that required the use…", "text": "We had no issues that required the use of the insurance.  It was reassuring that had we needed it, it was available.  It is always better not to require benefits from insurance.  We will be buying insurance from seven corners for future travel.", "rating": 4}, {"title": "Probably Excellent Given CoVid Chaos", "text": "Weeks ago I had renewed my Wander Frequent Traveler because I have loved this policy (and the notably excellent customer service I've received in the past).  Last week I realized that since I would not be traveling internationally until Nov., perhaps my renewal could take effect just prior to the Nov. trip rather than now.  Agents were busy and not able to take my call.  I left a message with my question.  Within a few days, I received a cancellation of policy.  This leaves me uncertain if the policy will go into effect in Nov. or whether I need to call again and get a new policy.  So the 4 rather than 5 stars reflect the lack of clarity regarding what is happening with the renewal.  However, given the quantity of pressing inquiries and claims Seven Corners is now facing, I do appreciate the speed of their response that has saved me the costs of a premature renewal.  (I also wonder if reviews in this tumultuous time should even be published given the many, unexpected challenges caused by the virus.  In prior exchanges with Seven Corners, my responses were always \"5 stars!\")", "rating": 4}, {"title": "I called for hours and emailed support…", "text": "It seems, like any other company that Seven Corners got a huge volume of calls and emails due to COVID19  which explains why my emails or calls were never answered. I received an email that answered all my questions.", "rating": 4}, {"title": "My experience was quite pleasurable the…", "text": "My experience was quite pleasurable the insurance was affordable the only thing I did not realize that it was in u.s. dollars other than that I would highly recommend this company", "rating": 4}, {"title": "Great Value for piece of mind", "text": "Good communication. I did not need to make a claim.", "rating": 4}, {"title": "Great, So Far...", "text": "Fortunately for both me and Seven Corners, the trip had a successful conclusion.  I enjoyed my trip with the peace of mind that I was protected while Seven Corners collected the fee (which was very competitive) and won the bet that they would not have to pay out anything.   The signup experience and communications before and during the trip that Seven Corners provided has been very good. But... the most important function they could provide, the servicing of a claim, was not needed so \"Great, so far\".  I will continue to use Seven Corners as my first choice for trip insurance and will be sure to leave  more comments if I ever have to file a claim.", "rating": 4}, {"title": "Well I never had to actually access the…", "text": "Well I never had to actually access the Insurance during my travel but all the documentation and details shared by Seven Corners were up to the mark. Thanks for the same.", "rating": 4}, {"title": "Sense of security", "text": "Four  reasons why I purchased a travel protection from Seven Corners, first of all, since we are flying out of east coast winter time, I wanted to secure the cost of our trip in case of inclement weather. Second, my sister needed medical coverage, third, I wanted  to cover the cost of our trip in case of unforeseen circumstances, and lastly Seven Corners cover both US citizen and non US citizen and their rates are lower than the others I have looked at.", "rating": 4}, {"title": "Inbound  Immigration Insurance Extension", "text": "Certificate #: 12BB16-106265  and I got a notice from Seven Corners canceling my service after I extended it to June 2020 and having also paid. What is that about?", "rating": 4}, {"title": "Simple and clear documentation of policy", "text": "A true test of any insurance, and thus a real rating, requires experience in making a claim. I did not have that opportunity so my rating is based solely on cost and communication, both of which seemed great at Seven Corners. My policy for 10 days of foreign travel was under $50 and the documents which both explained the policy before purchase and detailed it after purchase were clear and useful. So for what I experienced, and for that alone, i rate them as 'great.\"", "rating": 4}, {"title": "I can't really say much beyond the fact…", "text": "I can't really say much beyond the fact that your customer service has been attentive since I did not need to make a claim. I'll be using you again in the future. Thanks.", "rating": 4}, {"title": "We didn't have to use the coverage but…", "text": "We didn't have to use the coverage but it was nice to know it was there.", "rating": 4}, {"title": "I've had some minor events in the past…", "text": "I've had some minor events in the past and they were well taken care of by Seven Corners, but I think the fees are a bit too expensive. All and all, I'm satisfied with the service up until this day.", "rating": 4}, {"title": "Quick & Simple to understand", "text": "Date of experience: February 24, 2020", "rating": 4}, {"title": "Easy to sign up", "text": "Easy to sign up - good rates", "rating": 4}, {"title": "Good service - Did not loke the cost increase", "text": "The service was perfect, but it is not acceptable that you rise the price of the plan more than 25% from one year to the other.All good, but Im already looking for alternatives for the next renewal.ThanksNicolas Valdes", "rating": 4}, {"title": "Was pretty good coverage", "text": "Was pretty good coverage, especially considering the cost", "rating": 4}, {"title": "We just had the insurance but never…", "text": "We just had the insurance but never used any of the services. I believe they are good.", "rating": 4}, {"title": "Went great, just one small detail.", "text": "Except for one detail, that I will address in this review at the end, I found my experience with Seven Corners positive and I will probably buy insurance from them again.I visited the USA for 2 months and bought the \"Explore North America\" Insurance. After one month vacation, I started to feel pain in my right ear, which is not normal for me. So, after 3 days and still feeling the same pain I went to an Immediate Clinic to rule out infection, after making sure I chose a clinic within the policy PPO network,. To do so, I checked out clinics on their webpage and also called Seven Corners Assistance to confirm, and by going to this clinic I didn't have to file a claim later myself (it was automatic), and they ended up paying most of the claim. I believe the insurance company and the clinic agreed on a value to close the claim. So far, I only paied the co-pay amount for that doctor's visit, which was 20$ in accordance to policy regulations. I was pleased with that, things went well and I didn't have an infection - just inflamation...!The only thing I didn't like with this whole experience was the fact that I received the very day before my trip an e-mail from Seven Corners with some quick links to access (Emergency Assistance, Common Questions, File a Claim), and I was surprised to find that none of them worked! This was unsettling as it happened just before my trip. I e-mail them back with this complain and they never answered, which was completely unprofessional.Also, the APP doesn't work in USA territory.To sum up on a positive note, they were quick to resolve the claim, paid the amount, helped me when I called them to address my questions. I believe that this is more important, although there's room for improvement on the tech support side.Thank you Seven Corners!", "rating": 4}, {"title": "I was very satisfied to be able to find…", "text": "I was very satisfied to be able to find the type of coverage that I wanted.", "rating": 4}, {"title": "Good response to all the questions.", "text": "Date of experience: January 27, 2020", "rating": 4}, {"title": "Insurance for every part of our trip", "text": "Seven Corners allows us to make sure our whole trip is insured (or at least as much of it as we want). I think the prices might have gone up in the past few years, but overall, it's a great amount of coverage for what you pay.", "rating": 4}, {"title": "Great service and personalized…", "text": "Great service and personalized attention.", "rating": 4}, {"title": "The 1st part of our trip is past", "text": "The 1st part of our trip is past, but we haven't gotten anything about the last part, back to US.  We would appreciate a message.  We might wonder if were not covered.We have not had to use this insurance, thank God.  Violetta was VERY helpful when we spoke with her on the phone getting the traveler's insurance.  2 different times.", "rating": 4}, {"title": "The service was so so", "text": "The service was so so. I mean, I didn't experience any kind of disturbance during my travel. So my review is kind of neutral.", "rating": 4}, {"title": "Straight forward process", "text": "Straight forward process. Easy to sign up", "rating": 4}, {"title": "Flexible and affordable.", "text": "Fortunately, I didn't have cause to use the insurance while I was abroad for 5 months, so I can't speak to the experience of filing a claim, but the coverage and price options were flexible and affordable, and I was grateful to have coverage in place. I would use them again.", "rating": 4}, {"title": "Simple and easy", "text": "Date of experience: January 03, 2020", "rating": 4}, {"title": "We purchased what we needed and you…", "text": "We purchased what we needed and you provided what we needed, excellent.", "rating": 4}, {"title": "I had to get a CT scan done in Thailand…", "text": "I had to get a CT scan done in Thailand which cost around $700. Although I had to pay out of pocket at first, I sent all the documents in to seven corners and they issued my money a few months later. They are slower than other insurance companies but for the price of 6 months of travel insurance (around $250) I was impressed with the service. Would recommend", "rating": 4}, {"title": "Gave me peace of mind ...", "text": "Date of experience: December 19, 2019", "rating": 4}, {"title": "I didn't have to use the insurance…", "text": "I didn't have to use the insurance because my trip went smoothly so I can't review the customer service but the purchase experience was great - easy and simple.", "rating": 4}, {"title": "the buying experience was good", "text": "the buying experience was good, but cant rate how good it is until we have a claim which I certainly dont want.  Margaret", "rating": 4}, {"title": "It's hard to review since we didn't…", "text": "It's hard to review since we didn't have to use it", "rating": 4}, {"title": "Website was easy and received policy…", "text": "Website was easy and received policy documents quickly.  Did not have to invoke policy so cannot comment on the company's responsiveness or willingness to pay out coverage.", "rating": 4}, {"title": "Good", "text": "Good coverage", "rating": 4}, {"title": "it was a great experience very recomended", "text": "it was a great experience, how ever one name was misspelled, and ask to fixit but it was not, excellent attention, and quick response.I recommend it plenty to others needing  assistance.", "rating": 4}, {"title": "Great service", "text": "I had a good experience although I didn't need to claim. I was expecting a reminder about the expiry of my policy but didn't get one. Would definitely use them again", "rating": 4}, {"title": "Fine experience", "text": "Disappointed my computer tablet in lost backpack was not covered.Office staff was responsive to my questions.", "rating": 4}, {"title": "Good price", "text": "Good price. Didn't have to use the insurance on my trip so can't really attest to their service.", "rating": 4}, {"title": "The plan was good for a 6 month visit…", "text": "The plan was good for a 6 month visit to Austria. I did file 2 claims. Problem was I was told that any Dr. or hospital would take my insurance ID card. False. They just laugh and say take that to your insurance when you return to the states. Second they have only U.S. phone numbers to contact them. I did not have international phone  service, which made communication impossible.They need to set up phone  number in each country. I had to whatsapp my son to go through them. Extremely complicated. First $1k comes out of your pocket for them to reimburse. Now for the good part. I did finally get the forms to download and reimbursed in a 2 month time span. Just fyi for new 6 month overseas travelers , like myself. That is why I gave them a 4 star rating.", "rating": 4}, {"title": "First experience so I can only comment…", "text": "First experience so I can only comment on customer service and not a claim. I will probably go to Israel next year and might use your services for other international trips.", "rating": 4}, {"title": "The best review would be that we did…", "text": "The best review would be that we did not have to use the insurance for a claim. In any event we were glad to have the coverage", "rating": 4}, {"title": "Reliable \"Cancel For Any Reason\" if you need it.", "text": "Went through the claim process for \"Cancel For Any Reason\" insurance, and there's a slight delay about 3 weeks between back-and-forth for documents due to the increased amount of claims (according to the support). But after getting what they needed, we got the whole claimed payment pretty straightforwardly.I'd use Seven Corners in the future!", "rating": 4}, {"title": "MIxed Feelings", "text": "Travel insurance is expensive. It's not an auatomatic must have decision anymore. This trip there was no need to seek service therefore I have nothing to comment on. A year ago I was displeased to learn in the fine print there was no coverage for an air traffic controllers strike in France costing lodging, transport and food for 24 hours delay.  I had to dig deep with Seven Corners to learn the bad news. Self insuring for some items covered is where I examine items carefully. Medical and evac are the areas that are rare but costly and insurance makes sense to me at least.", "rating": 4}, {"title": "I needed travel medical insurance", "text": "I needed travel medical insurance. Simple and easy to use the site to get what we needed.", "rating": 4}, {"title": "EASY TO OBTAIN AND DECENT PRICE.", "text": "Date of experience: October 14, 2019", "rating": 4}, {"title": "We were feeling quite safe with Seven…", "text": "We were feeling quite safe with Seven Corner while traveling in USA", "rating": 4}, {"title": "Since I didn’t require any medical…", "text": "Since I didn’t require any medical services I don’t have any way to evaluate Seven Corners.", "rating": 4}, {"title": "Successful Claim Review", "text": "My claim was processed relatively quickly after uploading supporting documents. I had a multi-stop trip with multiple bookings. The customer service line wasn't particularly helpful when I had called to find out about the claim process. Ultimately I was paid for my claim, which is the most important point and why we buy travel insurance in the first place.", "rating": 4}, {"title": "It was Great", "text": "It was Great, I didnt need to use it.", "rating": 4}, {"title": "The trip is over and glad we didn’t…", "text": "The trip is over and glad we didn’t need to use the insurance but having it provided peace of mind. We researched multiple companies and Seven Corners seemed to be among the best. The online enrollment was painless and their follow-up communication was good.", "rating": 4}, {"title": "It is an easy to buy insurance", "text": "It is an easy to buy insurance, they send you the insurance documentation and additionally they notify you to your email when your insurance is about to end so that you acquire an extension. Fortunately I don't need it but I would definitely buy it again.", "rating": 4}, {"title": "It was not easy to find plan that had…", "text": "It was not easy to find plan that had been selected by our Human Resource manager.  Navigation on web site needs to be improved.", "rating": 4}, {"title": "Everything was good but the room…", "text": "Everything was good but the room smelled bad.", "rating": 4}, {"title": "Expiration notice", "text": "I received an e-mail that my year long policy had expired, so I was left without coverage for a few days.  It would have been nice if they sent a 30 day notice before expiration.  That way, I could have set up the replacement policy to start after the old policy without being left without coverage for a few days.  Not sending a notice before it expired is my only complaint.", "rating": 4}, {"title": "Healpful", "text": "As another shop owner this shop was good to deal with. Our customer broke down because the alternator we installed failed.  They were willing to stay late and get our customer back on the road.  They even let me pay for it over the phone. Thanks.", "rating": 4}, {"title": "Price was more than fair however since…", "text": "Price was more than fair however since I didn't have to use this insurance ( no mishaps) I can't give it a 5 without a test run. Of course, no one really \"wants\" to use it, but it did give me peace of mind.  Being a senior Medicare doesn't cover across Canada's border and one small slip could be devastating at my age.", "rating": 4}, {"title": "Scheduling the coverage was very…", "text": "Scheduling the coverage was very simple. Fortunately I didn't have to use it for my trip but I did feel secure knowing it was there. I cannot give anymore information since I did not make use of it but I would hope that the coverage would do what was intended. I will use Seven Corners again on my next trip.", "rating": 4}, {"title": "Great coverage but too much paperwork", "text": "Date of experience: August 26, 2019", "rating": 4}, {"title": "Good", "text": "Easy and good", "rating": 4}, {"title": "Purchasing the coverage online was easy.", "text": "Purchasing the coverage online was easy.  I only gave a 4 star rating because I didn't need to make a claim, so don't know how effective this process would be.", "rating": 4}, {"title": "I never got hurt", "text": "I never got hurt. So I didn't really need it. But, when I had a question early on in the process, they were extremey helpful.", "rating": 4}, {"title": "Great for travelers.", "text": "Date of experience: August 17, 2019", "rating": 4}, {"title": "Service was good", "text": "Service was good. Fortunately, we did not have to use it.", "rating": 4}, {"title": "Coverage", "text": "Covered in most clinics.", "rating": 4}, {"title": "Good options in coverage.", "text": "Date of experience: August 06, 2019", "rating": 4}, {"title": "Had a non-urgent health issue that I…", "text": "Fairly good...I had a non-urgent health issue that I needed help figuring out the day before flying back home from Spain. I was able to reach a Seven Corners customer service rep easily outside of the U.S. business hours, and he was able to tell me how to handle a reimbursement and sent me providers in the area. However, it would have been helpful if the rep were more knowledgeable about the country's healthcare system, or general medicine/health. Good for the price, but I would consider it excellent if there were a hotline service or liaison with more medical background to walk through the issue with me and how to best handle it.", "rating": 4}, {"title": "Good services.", "text": "Date of experience: August 03, 2019", "rating": 4}, {"title": "We did not have to make use of our…", "text": "We did not have to make use of our travel insurance so it’s hard to rate based on any experience with dealing with claims, but buying online and the cost we thought was ver reasonable and easy to use.", "rating": 4}, {"title": "Great customer service....", "text": "Date of experience: July 27, 2019", "rating": 4}, {"title": "Good experience", "text": "Date of experience: July 24, 2019", "rating": 4}, {"title": "I had no experience just glad I was…", "text": "I had no experience just glad I was able to afford insurance.  Hoping that when I visit the USA next year I willl have similar price same exierience", "rating": 4}, {"title": "Great customer service getting me…", "text": "Great customer service getting me registered.  Hard to give a 5 star until I actually see how the insurance responds to crisis (which I hope never.)", "rating": 4}, {"title": "10 out 10 I would choose it again", "text": "I give it a 4 stars out of 5 because I did got the chance to used despite that the process of purchasing the insurance was fast and extremely cheap and I like that a lot, definitely gonna buy it again.", "rating": 4}, {"title": "Customer service was excellent", "text": "Customer service was excellent, knowledge about services and professional. I have been recommending your services 👍🏽👍🏽for sure!", "rating": 4}, {"title": "Easy to purchase", "text": "Easy to purchase, email of info received, easy to find details to print. Didn’t need to use thankfully :)", "rating": 4}, {"title": "Very good for traveling purpose", "text": "Date of experience: July 10, 2019", "rating": 4}, {"title": "Righly rate", "text": "Righly rate the service and the price that it offers", "rating": 4}, {"title": "I think the deducable amount could have…", "text": "I think the deducable amount could have been clearer.", "rating": 4}, {"title": "I was happy that I did not need to use…", "text": "I was happy that I did not need to use the medical coverage while traveling to South America. I am super relieved that I did not have to worry about medical coverage. I am thankful for Passport Health to recommend this coverage.  I will be using this company from now on as i travel abroad.", "rating": 4}, {"title": "I never made a claim", "text": "I never made a claim.  So my review is limited.  I would buy again.", "rating": 4}, {"title": "It's worth it even if you don't have to use it.", "text": "I've purchased coverage through this company twice and have been pleased.  I haven't had to use it, but the peace of mind is important to me.  It was easy to obtain medical coverage for international travel, and preexisting conditions are covered.  The price is very affordable (much lower than other places I looked at), and their customer service was friendly.   The only reason I am giving 4 stars instead of 5 is because the plan I purchased was supposed to have a free renewal of the plan for up to 3 years.   I went to renew it and there was a cost.   (I may have read the fine print wrong, but they also shouldn't put \"free renewal\" if it's not free).I will continue to use Seven Corners when I need international medical coverage.", "rating": 4}, {"title": "user-friendly", "text": "The procedure was really easy and clear. Premiums and packages are understandable and user-friendly.", "rating": 4}, {"title": "Peace of mind", "text": "I have become older but still love to travel.At my age things can happen health or family Wise that we just feel so much more comfortable with trip And international health insurance. Seven corners was easy to work with. The staff was very nice and price reasonable.Gave them four stars because I have not had to make a claim.  But feel they would be good to work with!", "rating": 4}, {"title": "Satisfied customer with one recommendation.", "text": "I am very happy with everything except claims procedure which requires us to file claims/explanations even after doctors office submitted the claim. It would be more convenient if SC representatives call patients directly to confirm, get explanation or ask additional questions over the phone which can be confirmed or authorized with one page. This in the only reason for 4 not 5 stars review.In general, customer service, respond time, website, coverage and flexibility are excellent characteristics of Seven Corners.", "rating": 4}, {"title": "The only reason I didn’t give a 5 is…", "text": "The only reason I didn’t give a 5 is because nothing went wrong on my trip so I didn’t have to make a claim. The signup was easy and inexpensive.", "rating": 4}, {"title": "Fortunately I never use the service of…", "text": "Fortunately I never use the service of Seven Corners, I only bought insurance, 3 times, but never use it. So I have nothing to say how it works. Have asked several questions over email, but answers were not clear for me. I plan to buy it again since I have no insurance coverage in USA.", "rating": 4}, {"title": "Fortunately, no delays, but clarify receipts required for claims.", "text": "Fortunately we did not need to file a Claim on this trip. In the past we seem to often experience flight delays due to bad weather at JFK. Two years ago  We filed a claim with a well known travel insurance company that did not honor the several taxi rides we had to use for two days because they were not formal receipts. most of the taxi drivers do not give out receipts and instead wrote on pieces of paper the amount we paid. This is how they make a living and do charge more for shorter rides for tourists. So should we need to bring a receipt book to be able to file a claim?   What would seven corners honor if we needed to file a claim?", "rating": 4}, {"title": "Easy to buy", "text": "Easy to buy, I did not need to use, therefore I can not say anything about that.", "rating": 4}, {"title": "Quick and simple to purchase", "text": "Quick and simple to purchase.  Luckily didn't need the coverage but having it reduced worries and stress.", "rating": 4}, {"title": "Easy peace of mind", "text": "Easy to purchase insurance offers great peace of mind on my vacation. Telling me that my insurance is expiring and offering to extend it, before I even start my vacation is irritating.  I know it is probably an automatic feature of the software, but it shows a \"good enough\" mentality in programming and customer service, and is a little too aggressive in the sales department. 4 stars for easy peace of mind and a painless purchase experience.", "rating": 4}, {"title": "Bob Alford, Thailand", "text": "I have not had to make a claim however the service and communications by Seven Corners have been excellent.", "rating": 4}, {"title": "Always easy to reach & get our…", "text": "Always easy to reach & get our questions answered.  Wish the renewal options would have been clearer.  That would have earned 5 stars!  We really think you are very good.", "rating": 4}, {"title": "Just purchased the travel insurance…", "text": "I just purchased the travel insurance for a future travel on 2/2019. I’m giving 4* with regards to the process of purchasing it , as well interaction with representative. Also, price wise and benefit is competitive compared to the travel Insurance I usually purchase. This is the second time this year we have purchased from Seven Corners.", "rating": 4}, {"title": "Representative helpful but seemed in a…", "text": "Representative helpful but seemed in a hurry. Had to call back and correct a couple of things. It’s all good. The correction even lowered the cost of my premium. Slow and steady wins the race!", "rating": 4}, {"title": "Technology Issues", "text": "I had difficulty filling out the form online.  It kept telling me I needed to fill in a space that I had already filled in.  I called and Violetta did an excellent job filling in the form for me.  I would give her 5 stars.", "rating": 4}, {"title": "Response from your customer service is…", "text": "Response from your customer service is great.", "rating": 4}, {"title": "Excellent", "text": "Excellent, fast service, friendly agent, answered all questions", "rating": 4}, {"title": "it was good but the name of my kids was…", "text": "it was good but the name of my kids was written with mistakes. It was corrected, I don't know about your service yeat.", "rating": 4}, {"title": "Easy to use once you worked out the…", "text": "Easy to use once you worked out the dates.", "rating": 4}, {"title": "The buying of the policy was…", "text": "The buying of the policy was satisfactory except that I had to type all the information twice because at the end was not accepting things like the date of birth.  I do hope that the service if I have problems turns to be a five stars service.", "rating": 4}, {"title": "Customer service was very helpful in…", "text": "Customer service was very helpful in completing my application.  My travel begins late in October in Italy.  Hopefully, I'll have no need to file a claim.  If I do, I'll review my experience after all of those negotiations are complete.", "rating": 4}, {"title": "The agent Tanisha Elkins was very…", "text": "The agent Tanisha Elkins was very efficient and friendly but did not return a response to an email I had sent her regarding pre-existng conditions.Otherwise very satisfied with Seven Corners.One suggestion.. it would be nice to have more options between $100Mand $500Mfor emergency medical coverage.", "rating": 4}, {"title": "Only complaint is the cost", "text": "Only complaint is the cost - for Canadian travelers", "rating": 4}, {"title": "Easy Online Purchase", "text": "I'll echo 1 Hawk.  This was my first time purchasing a temporary policy and the online procedure was easy, understandable, and quick.  No issues encountered. Like 1 Hawk stated, the proof is in the ease, speed, and complexity of filing claims. No experience there yet.", "rating": 4}, {"title": "I’m back with seven corners", "text": "Had 7 corners a few years ago tried another company but this year I’m back for my annual policy! The true test is when claims have to be filed. Fortunately I haven’t had that experience!", "rating": 4}, {"title": "I have not  Accepted the final card…", "text": "I have not  Accepted the final card after I have completed the final payments half of one month before.", "rating": 4}, {"title": "My father said the insurance price was…", "text": "My father said the insurance price was increased compared to the last year and compared against he paid for the my sister insurance", "rating": 4}, {"title": "It's easy to enroll the insurance.", "text": "Date of experience: August 31, 2018", "rating": 4}, {"title": "Comment", "text": "The service was fine.", "rating": 4}, {"title": "Excellent so far", "text": "Insofar as the coverage and purchase of Seven Corners medical insurance go, I'd give it 5+ stars, especially for older travellers. However, I can't honestly give it more than 4 because my wife and I haven't had to claim yet after several years of use - hope it stays that way! - so I don't know how Seven Corners responds to claims.", "rating": 4}, {"title": "There was a problem with the system", "text": "There was a problem with the system, so I had to talk to somebody to help me with the purchase.They told me that they would call me back, but they didn't do it.In spite of that, they did all the process.", "rating": 4}, {"title": "viola was very helpful and kind.", "text": "Date of experience: August 24, 2018", "rating": 4}, {"title": "The first representative seemed…", "text": "The first representative seemed knowledgeable, but gave me one erroneous answer and did not volunteer  help. The second one was truly outstanding and almost made up for it. A bit cumbersome to get a hold of a representative.0", "rating": 4}, {"title": "Good value, website could use a little work", "text": "I bought an annual (multitrip) policy. The brochure states that the cost would be $195 but then I was quoted and paid $200. I don't know why the discrepancy. There are several coverage items that are not explained (except for the brochure which I am sure many people don't see). It would be a good idea to attach a little pop-up to those terms so you can see what they mean. But overall this is reasonable coverage for a reasonable price.", "rating": 4}, {"title": "Process was easy and simple", "text": "I think process was easy and simple, however, product offerings are limited. I would suggest they should add ticket or traveling cancelation insurance with the travel medical insurance as a bundle.", "rating": 4}, {"title": "The website was easy to navigate but…", "text": "The website was easy to navigate but lagged a little at times.", "rating": 4}, {"title": "New customer", "text": "Since we've just purchased our first travel insurance policy from Seven Stars, I have very little basis for a rating other than the man I spoke to on the telephone,  Jeremy, was very helpful and able to answer all my questions to my  satisfaction.", "rating": 4}, {"title": "Quick and easy", "text": "Quick and easy. Although I have never had to make a claim", "rating": 4}, {"title": "Good and fast booking service", "text": "Good and fast booking service, 4 stata for the price a bit more expensive compared to others", "rating": 4}, {"title": "Good and very friendly", "text": "I am from Europe, first time travelling with Seven Corners. I have not seen yet the treatment but I want to star for the rapidity in sending all the necessarry documents", "rating": 4}, {"title": "Hope", "text": "I haven't had to make a claim. Using it has been easy. I am hoping SC comes through if something bad happens.", "rating": 4}, {"title": "4 star rating is based on the website…", "text": "4 star rating is based on the website and conversations I have had with customer support personnel.  I have not had the need to file a claim so I can not rate that very important facet of the insurance business.", "rating": 4}, {"title": "Clear and detail", "text": "Clear and detail information online, the customer representative was excellent listening and advising.", "rating": 4}, {"title": "its good", "text": "its good to buy seven corner health insurance. but how can we redeemed the health coverage, if provided by this service than than it will be a great exp.", "rating": 4}, {"title": "i had problems with your website both…", "text": "i had problems with your website both while purchasing the policy as well as while downloading details of my policy once i had purchased it . the nature of the problem was same as reported by your client Satya Talwar who also purchased policy recently.Please arrange to send the details of my policy as an attachment so that i can take a print out for ready  reference. thank youNEELIMA TALWAR", "rating": 4}, {"title": "The service was fast and…", "text": "The service was fast and comprehensible...", "rating": 4}, {"title": "Obtaining the insurance policy on line…", "text": "Obtaining the insurance policy on line was easy and straight forward. I have not had to use my policy as yet, so I cannot rate how 7 corners will respond to a claim.", "rating": 4}, {"title": "Easy to purchase on line I did call…", "text": "Easy to purchase on line I did call twice first time sounded like I woke up the person hard to get info from her. The second time I got someone who was able to answer my question without any issues.", "rating": 4}, {"title": "Respond to request", "text": "So far, I can tell you that only after second request someone gave me the answer.", "rating": 4}, {"title": "In my case", "text": "In my case, i paid for 6 months but while choosing the date  mistakenly i selected for 3 months. When i mailed, there is no proper solution.", "rating": 4}, {"title": "Good service and website.", "text": "Date of experience: July 08, 2018", "rating": 4}, {"title": "Reinstatement’s following inadvertent cancellation", "text": "Service particularly over the phone was good. The one concern I have is that my policy was inadvertantly cancelled. I was transferred to another person who issued a new policy. However this policy was not effective until the next day. So I was left without coverage for a day. Given that the cancellation was your error I would have preferred a reinstatement without the one day lapse. I am formerly a Vice President of claims for a Canadian insurer therefor very ‘insurance conscious’...a big believer in covering off my bases. The one day sans medical insurance made me nervous. I think you need to consider this type of circumstance and not consider a person as a NEW risk and leave them vulnerable in the middle of their travels, after all that’s why I got it in the first place...for peace of mind.  Bob Doiron", "rating": 4}, {"title": "Your online service is much better than…", "text": "Your online service is much better than some similar online service, e.g.: NoMads/Trip Mate.  You were responded quickly and friendly.  The only thing not felt good is: your benefit coverage list is not as many as NoMads listed.  I don't know are there significant difference or not.  Hopefully my Schengen Visa would passed without problem.", "rating": 4}, {"title": "Good", "text": "Good, till now. No more questions or problems now.", "rating": 4}, {"title": "Insurance cost is comparably higher.", "text": "Date of experience: July 05, 2018", "rating": 4}, {"title": "Phone assistance excellent", "text": "Phone assistance excellentYour new website is somewhat confusing.", "rating": 4}, {"title": "I wasn't able to renew my insurance…", "text": "I wasn't able to renew my insurance over the phone, but I was able to manage it online", "rating": 4}, {"title": "We had trouble purchasing our plan…", "text": "We had trouble purchasing our plan through the website, so we ended up calling and speaking with a representative who was very helpful in getting us our policy.", "rating": 4}, {"title": "I compared quite a few companies and…", "text": "I compared quite a few companies and Seven Corners was easily the best, in terms of the features, clarity of the policy and value for money. My claims experience in the past has been good too. They are fairly responsive and friendly to queries. However, I was disappointed they did not respond to a specific request, which needed some follow up for resolution. Otherwise, they would deserve an Excellent rating.", "rating": 4}, {"title": "Quick and easy purchase", "text": "The buying experience was quick and easy. The proof for the fifth star would be on service and coverage should I need medical treatment.", "rating": 4}, {"title": "Fair health coverage", "text": "This policy was good value.", "rating": 4}, {"title": "very good", "text": "very good, quick efficient and cheap", "rating": 4}, {"title": "User Friendly", "text": "Date of experience: June 22, 2018", "rating": 4}, {"title": "Knowledgeable and Friendly Agents", "text": "I would highly recommend.  The only reason I didn't give 5 stars is because I called a couple of times with questions and I received the answers and passed them along to traveler.  When I called back to purchase the agent I spoke with had different information (quote was much higher).  I opted to wait and purchase when the agent I originally spoke with clocked in.  All good.", "rating": 4}, {"title": "The helpline was very good at…", "text": "The helpline was very good at responding and provinding solutions to my problems", "rating": 4}, {"title": "User Friendly site", "text": "User Friendly site. Helpful agent. Only issue was that when applying for 2 different age brackets you need to do it as 2 separate applications on site.", "rating": 4}, {"title": "It was quick and easy experience to buy…", "text": "It was quick and easy experience to buy the poliicy", "rating": 4}, {"title": "Hard to get a live voice!", "text": "Seven Corners was good once I got through to them!  It took numerous calls and messages --which they never returned!, before I finally got through to someone.  The reason I persisted and got the insurance I required in spite of this difficulty was because I have dealt with them before and had a claim which they resolved quickly.  I hope they improve on their phone service!", "rating": 4}, {"title": "No claims so far, but confident in quality of coverage", "text": "I cannot personally vouch for the claims process of Seven Corners as I have luckily never needed to file a claim, but I do feel secure in my coverage. The only reason I didn't give 5 stars is because the renewal process has been a bit difficult a few times, but I plan to continue to purchase policies from them as needed for the foreseeable future.", "rating": 4}, {"title": "Price is very reasonable compare to…", "text": "Price is very reasonable compare to other travel insurance.", "rating": 4}, {"title": "Very helpful telephone agent Leila.", "text": "Date of experience: June 05, 2018", "rating": 4}, {"title": "When we take a policy for self plus…", "text": "When we take a policy for self plus spouse PL give option of different per accident choice.2. When printing policy the plan A or applicable plan details need to be printed3. In case possible, try and introduce a ' no claim - partial refund of premium too?\"", "rating": 4}, {"title": "helpful", "text": "Staff was helpful and responded to my questions very quick .", "rating": 4}, {"title": "Easy to understand for coverage", "text": "It's easy to understand coverage option.But, no idea for the practical service!", "rating": 4}, {"title": "we were given good help over the phone…", "text": "we were given good help over the phone by Leila in Indiana.", "rating": 4}, {"title": "Good on-line purchasing system", "text": "Date of experience: May 27, 2018", "rating": 4}, {"title": "Nice service but I don't have that much experience...", "text": "I can speak only about the process of purchasing insurance, since until now, I haven't had the need to use the actual insurance services. I have purchased travel insurance from this company twice and it was very easy and smooth  I found it a bit expensive but have no clue about the prices and services from the competition. Because I wasn't asked any questions about my health status, I wonder if I wouldn't be able to get a better deal from an insurance company valuing information on that. But again, have no idea of this type of product from other companies...", "rating": 4}, {"title": "I have not traveled yet so I can't give…", "text": "I have not traveled yet so I can't give a 5 but the ease of the on-line purchase and the answers to my questions by a real person on the phone do deserve a 5. I have no idea how easy or difficult a claim might be.", "rating": 4}, {"title": "Great insurance coverage for visitors to the US", "text": "It is a very helpful website for travel insurance for visitors to the US. So far there has been no occasion for actually utilising the insurance cover. It is therefore not possible to assess the rating regarding insurance claims.", "rating": 4}, {"title": "A little confusing on the web site to…", "text": "A little confusing on the web site to purchase but customer service helpline was very clear and helpful.", "rating": 4}, {"title": "I used to chat with one agent before…", "text": "I used to chat with one agent before she was wonderful, but the last one I chatted with, was less helpful, but he was ok", "rating": 4}, {"title": "Generally a great service at a very…", "text": "Generally a great service at a very reasonable price.  Staff very helpful, especially Tiffany Webster.  Had a little trouble using the online application, and ended up having to telephone to make the purchase.", "rating": 4}, {"title": "- GoodCustomer service", "text": "-Customer service waiting time >2 minute.-Competitive price-If I travelling out of country, I buy travel insurance from Seven Corners.", "rating": 4}, {"title": "Easy to choose and nice interface", "text": "Date of experience: April 22, 2018", "rating": 4}, {"title": "Had been customer with Seven corners…", "text": "Had been customer with Seven corners since 4 years . These guys are fantastic . Excellent customer service and excellent plan programs . Recommend it to friends", "rating": 4}, {"title": "Quick response and helpful assistance…", "text": "Quick response and helpful assistance in questions arising during purchase of a policy. I have yet to make any claims.", "rating": 4}, {"title": "Jeremy was great", "text": "Jeremy was great, helping me because your Quick Quote drop down box online was confusing. On the line Trip Information you have a box with \"Prim\" to the left which I assume is the Primary traveler. The box to the right has \"Trip (\" with no explanation as to what information was needed. Jeremy told me it was trip costs to be covered. Not at all clear on the page. Then although I entered correct credit card info, I received repeated message the number was too long. Again, Jeremy was great, not so the website page.James F. Larkin", "rating": 4}, {"title": "Easy to Buy....Fortunately We've Not Needed to Use It!", "text": "This is the second time we've purchased travel insurance from Seven Corners.  The purchase process is easy!  They also do a very good job of staying connected with us while the policy is in force and making sure we don't need to extend it.  We go with a high deductible policy - this is really in case we have a serious problem.  Having said all that, we've (knock wood) never needed to access the insurance so I can't speak to that.", "rating": 4}, {"title": "The Lady I talked to was very nice", "text": "The Lady I talked to was very nice.  I am still waiting for printed copies of the insurance we purchased. a copy of the policy.  My printer is broken and I would like a hard copy of the coverage I bought.", "rating": 4}, {"title": "Getting the right number to call a real…", "text": "Getting the right number to call a real person was a bit of a challenge, but once I got through, the person was warm, friendly and easily took care of my question.", "rating": 4}, {"title": "4 stars because I've never had a…", "text": "4 stars because I've never had a problem.  5th star will be earned IF I ever have an issue and how it is resolved.", "rating": 4}, {"title": "Good experience sorting through the…", "text": "Good experience sorting through the options.", "rating": 4}, {"title": "good experience", "text": "good experienceThe purchase was easy and quick. The only problem was with the portal itself because I was not able to login in with my previous account and I had to do the entire process again.", "rating": 4}, {"title": "Good online service", "text": "Date of experience: March 22, 2018", "rating": 4}, {"title": "Would Use Again", "text": "Thankfully we didn't need to use the insurance, but great price for an extra piece of mind!", "rating": 4}, {"title": "I like the ease of purchasing online", "text": "I like the ease of purchasing online. My experience in filing a claim several years ago was so-so. I did get reimbursed but only after a long process of submitting all kinds of documents and forms.", "rating": 4}, {"title": "Nice but expecting smooth claim pass if…", "text": "Nice but expecting smooth claim pass if any comes", "rating": 4}, {"title": "User interface is good with more…", "text": "User interface is good with more flexible options to choose a plan", "rating": 4}, {"title": "very helpful staff", "text": "very helpful staff.  I got a policy based on one that expired months ago easily by email.  only reservation is that i'm not sure how their price compares to others.", "rating": 4}, {"title": "I had problems signing into my account", "text": "I had problems signing into my account. I 'chatted' with a representative who reminded me that I didn't have to sign in and furnished me the site to use. I completed my purchase without any problems.", "rating": 4}, {"title": "very good  customer service", "text": "Date of experience: March 12, 2018", "rating": 4}, {"title": "I received excellent customer service…", "text": "I received excellent customer service from the service rep.", "rating": 4}, {"title": "Well to be honest I have not had to use…", "text": "Well to be honest I have not had to use the insurance we buy yet, however purchasing it , the contacts that I have had have all been very helpful. I like the notion that we are covered for medical expenses in a different Country when we travel and it is good that we have not had to use it. When it comes to actually using it however I can not rate it that part. We have been buying insurance from here for years. It is very affordable.", "rating": 4}, {"title": "Haven't had to use their service but…", "text": "Haven't had to use their service but the rest of selecting the plan I need was awesome", "rating": 4}, {"title": "Great and easy to use.......", "text": "Date of experience: February 28, 2018", "rating": 4}, {"title": "My initial review is great as I got…", "text": "My initial review is great as I got wonderful support and guidance to all my questions via emails.  However, the true review I am reserving for the after care service should I need it.", "rating": 4}, {"title": "So far we had only bought insurance", "text": "So far we had only bought insurance, and not used it. So I cannot tell about a full experience. However, buying and getting information was very good.", "rating": 4}, {"title": "Purchase was easy", "text": "Purchase was easy, straight forward.", "rating": 4}, {"title": "Purchase process review…", "text": "This is the 2nd policy I've purchased within a year. The buying process was easy as you would expect for an online sales environment. I have NEVER had a claim which is where the true value of the product will come into play, so I cannot give it 5 stars since I've never experienced the claim process.", "rating": 4}, {"title": "Excellent sales person.", "text": "Excellent sales person.. she helped me understand the details of vary products.", "rating": 4}, {"title": "General review", "text": "Good service, clear and efficient", "rating": 4}, {"title": "Haven't Made Any Claims - Review based solely on the customer service, website ease and cost of the policy", "text": "I haven't been unfortunate enough to have made a claim in the time I have had this insurance ... so this rating is based solely on the customer service, website ease and cost of the policy. All the best I have found in my search for reasonable insurance for time abroad.", "rating": 4}, {"title": "Trust worthy..", "text": "Easy and trust worthy.", "rating": 4}, {"title": "Very easy to complete", "text": "Date of experience: February 11, 2018", "rating": 4}, {"title": "Thank you", "text": "Thank you for all your support.", "rating": 4}, {"title": "The proof is in the pudding", "text": "The proof is in the pudding, as they say, so I'm not sure how to rate this company. This is my third time using Seven Corners but I've never had a claim so I'm not sure how impressed I would be if I really needed to use the policy. My traveling companion on my last cruise did have a claim and payment was very slow.", "rating": 4}, {"title": "Easy to compare available products", "text": "Easy to compare available products. I liked the ability to choose among levels of coverage and deductibles. Completing the purchase was easy.", "rating": 4}, {"title": "Very helpful.", "text": "Date of experience: January 31, 2018", "rating": 4}, {"title": "Violetta was very helpful because I had …", "text": "Violetta was very helpful because I had problems with the website.I have purchased insurance from Seven Corners for several years and fortunately have not had to make a claim.  However, there was a situation where we thought my husband would have to go to the hospital so I called Seven Corners.  I live in a small French city where the doctors don’t speak English.  The doctor would have to talk to  a French speaker from Seven Corners.  There is a 6 hour time difference and the doctor didn’t want to be bothered with getting approval before treatment.  It was not an emergency but my husband needed treatment.  Fortunately, the charge was minimal as costs are controlled by the state - unlike the U.S.  so, we paid it as we didn’t want to have the hassle of filing a claim.I understand that an extreme emergency would require treatment and approval (or not) would come later.  I don’t know of anyone who goes to the hospital, doctor, or ER for the joy of it.  I also realize the same thing happens in the U.S. but it’s a different  story in a foreign country where there is additional stress when one is ill. In the U.S. one goes to the doctor or ER when they are ill without prior approval.  Why can’t it be like that when one is ill in a foreign country?Thanks.", "rating": 4}, {"title": "Review me when I come back.....", "text": "I really need to review the over all experience when I come back from my trip incase of something happening.  A review should be done on my return.", "rating": 4}, {"title": "Good service and meets our traveling …", "text": "Good service and meets our traveling insurance needs.", "rating": 4}, {"title": "Too early to rate.", "text": "Too early to rate.Website and selection easy to navigate.", "rating": 4}, {"title": "Good choice", "text": "Very easy to get it ! Price is reasonable and plan is great", "rating": 4}, {"title": "So far", "text": "So far, so good...Ronald", "rating": 4}, {"title": "The website is pretty good !", "text": "Date of experience: January 15, 2018", "rating": 4}, {"title": "It was difficult to purchase on line", "text": "It was difficult to purchase on line. Completed the form 3 times without it being processed. When I called it was completed quickly and easily.", "rating": 4}, {"title": "It was easy to apply", "text": "It was easy to apply. And great deal!", "rating": 4}, {"title": "Good and fast to hire.", "text": "Date of experience: January 05, 2018", "rating": 4}, {"title": "Fairly user friendly", "text": "Fairly user friendly.  We won't know how their service is until we need it (hopefully won't!) but our experience so far has been fine.  Website works fine and I did have to call in with a question and they were helpful.", "rating": 4}, {"title": "My sales person was great", "text": "My sales person was great.  You had a glitch in your computer system and it delayed me from getting my documents.", "rating": 4}, {"title": "Still waiting on reimbursement from …", "text": "Still waiting on reimbursement from documents I filed in August...", "rating": 4}, {"title": "no complaints but did not shop around", "text": "have no complaints but did not shop around much to know how prices compare.  enjoyed working with the rep.  nice job", "rating": 4}, {"title": "This is the third time using Seven …Good prices, good service", "text": "This is the third time using Seven Corners. Easy to use website. The first trip, baggage was delayed. Sent receipts in and received my reimbursement quickly. Prices are very competitive. Will use them again.", "rating": 4}, {"title": "Good quick services thanks.", "text": "Date of experience: December 23, 2017", "rating": 4}, {"title": "Good experience", "text": "Date of experience: December 20, 2017", "rating": 4}, {"title": "Great experience", "text": "The policy was nicely explained to me by the agent", "rating": 4}, {"title": "Good option i hope i will never use it .", "text": "Date of experience: December 07, 2017", "rating": 4}, {"title": "the customer service is good for now.", "text": "Date of experience: November 30, 2017", "rating": 4}, {"title": "Good reliable company", "text": "Date of experience: November 30, 2017", "rating": 4}, {"title": "Very slow and impossible process to …", "text": "Very slow and impossible process to purchase a policy on the web.  Had to call and work with sales person.", "rating": 4}, {"title": "Easy to use", "text": "The process was easy to use and helped me get the travel insurance I needed.", "rating": 4}, {"title": "Very reasonable", "text": "Seven Corners is more reasonable than any trip insurance group I have found over the past 25 years. I do wish, however, you would consider basing your \"existing conditions\" policy on the number of days before the beginning of the client's trip, not \"within 20 days after the deposit is paid.\"", "rating": 4}, {"title": "Somewhat Confusing", "text": "I found the online quote area of the website to be informative, but not so easy to register when I was ready to make a purchase. Please change the date of birth section of the registration from a drop down menu to a simple entry. Once registered, I was getting a higher than expected quiote price for international travel insurance, based on the provided chart stating the daily rate compared to the number of days I would be traveling. I finally had to call customer service to get this straightened out. My representative was extremely helpful, and stated that I needed to select ‘no’ when asked if your trip includes the United States as a destination, which I also found to be confusing since I live in the U.S. and will be flying back here on my return trip. The website needs to give an explanation as to what that statement (which is mandatory in order to get a quote) means. I have not begun my trip, so I am unable to comment on the plan itself, but I will say that the insurance is affordable and will hopefully cover me in case it’s needed.", "rating": 4}, {"title": "Good online transaction", "text": "Good online transaction experience", "rating": 4}, {"title": "Seven Corners staff are very helpful in …", "text": "Seven Corners staff are very helpful in explaining the different policies and guidances on how to create an account. To truly rate this company is after you have a claim.", "rating": 4}, {"title": "So far so good", "text": "So far so good. Trip has not started yet!", "rating": 4}, {"title": "easy to get", "text": "easy to get, great coverage, affordable", "rating": 4}, {"title": "Initial Purchase…", "text": "Had a little trouble buying my policy online because I kept missing the spot where you indicate the destination of your trip.  This part is important enough that it should be included with name, dates of birth, dates of travel, etc. rather than buried further on in the format.  My trip is not until July, 2018.  Hope I do not have to file a claim.", "rating": 4}, {"title": "Good coverage plans with reasonable …", "text": "Good coverage plans with reasonable price", "rating": 4}, {"title": "Good deal for international travel …", "text": "Good deal for international travel insurance!Thank you.", "rating": 4}, {"title": "Had a few adjustments in the insurance …", "text": "Had a few adjustments in the insurance covrage to be taken care of right before leaving on a trip and everyone I talked to was very helpfull", "rating": 4}, {"title": "It was fairly easy to follow", "text": "It was fairly easy to follow, answered most of my issues or questions. Was able to get the COverage needed.", "rating": 4}, {"title": "Signing up process", "text": "Signing up was easy enough, even though my pre-existing account wasn't accessible any more after a short break in coverage.", "rating": 4}, {"title": "I had no difficulty in buying it.", "text": "I had no difficulty in buying insurance. I bought it online for my mom who is staying with us here for 5- 5 1/2 months. There are a lot options available to choose from. I have not used this insurance before so not sure about claims settlement and contacting the customer service.", "rating": 4}, {"title": "They're good", "text": "They're good, but they answer emails not that fast.", "rating": 4}, {"title": "Seven Corners is great!", "text": "Date of experience: October 10, 2017", "rating": 4}, {"title": "the experiences I bought the insurance …", "text": "the experiences I bought the insurance from Seven Corners were good, the services and the staffs were nice. But one thing was not so good, I don't kown what's wrong with the monment I paid the fee that most time showed wrong, was it due to the time or the website?", "rating": 4}, {"title": "Seven Corners insurance is good for travel to the US from India", "text": "last time i came to the US I used seven corners insurance and ended up needing to use it for an ear infection. the processing was smooth and reimbursement was done as per claim.", "rating": 4}, {"title": "Great service.", "text": "Date of experience: October 01, 2017", "rating": 4}, {"title": "Easier Booking of Trip Insurance--Suggestion for Seven Corners…", "text": "Book trip insurance for all international trips.  Would be helpful if my profile could be saved, and only the destinations and dates could be modified to save time in booking.", "rating": 4}, {"title": "Initially the policy documents were not …", "text": "Initially the policy documents were not sent so I had to reach out and request for them to be emailed a week or two after initiating contact with a representative.", "rating": 4}, {"title": "Simple straight FWD insurance", "text": "Fulfill your needs .", "rating": 4}, {"title": "I just purchased your insurance for …", "text": "I just purchased your insurance for traveling within Italy.  I wont know how good you are until I have to file a claim for medical/accident.  I will let you know upon my return.", "rating": 4}, {"title": "Majestic Confusion", "text": "Difficulty understanding how the Majestic plan works covering multiple trips over the course of 364 days. All else fine.", "rating": 4}, {"title": "Good service", "text": "Date of experience: September 13, 2017", "rating": 4}, {"title": "Most helpful agent Violetta Wooster.", "text": "Date of experience: September 11, 2017", "rating": 4}, {"title": "I just bought this insurance for my …", "text": "I just bought this insurance for my elderly in-laws travelling to USA for vacation. Buying process was simple and convenient. Nicely explained coverage with examples where needed.", "rating": 4}, {"title": "Great service.", "text": "Date of experience: September 06, 2017", "rating": 4}, {"title": "Inputting data on the website was …", "text": "Inputting data on the website was cumbersome in some of the fields.", "rating": 4}, {"title": "Benefits", "text": "BenefitsShould have something balanced between standard and comprehensive", "rating": 4}, {"title": "Fortunately I've never had to use the …", "text": "Fortunately I've never had to use the insurance I purchase, but I had to change the dates of coverage (due to travel date change) once and they allowed me to do that.", "rating": 4}, {"title": "Good Job!", "text": "Your company was attentive to our needs and Leila did a fine job getting us ready for our trip.  In all, the material as well as the representation of your company was excellent .", "rating": 4}, {"title": "wasn't able to increase the amount of …", "text": "wasn't able to increase the amount of the policy Found it difficult to open certain areas", "rating": 4}, {"title": "Very easy to navigate the website", "text": "Very easy to navigate the website, examine, and choose which plan best meets my need. It wasn't immediately obvious that to apply online you needed to choose the box on the left which offered an immediate quote, but a phone call to customer service quickly helped with that. Got my plan documents promptly after applying.", "rating": 4}, {"title": "4 Stars", "text": "4 Stars. So far, I have been insured but never used any service. I can only say 4.", "rating": 4}, {"title": "Purchasing experience was easy", "text": "Purchasing experience was easy. No hassle to browse and choose from. All the info (coverage, deductible, etc.) is understandable.", "rating": 4}, {"title": "A very friendly experience", "text": "Date of experience: July 29, 2017", "rating": 4}, {"title": "First things first", "text": "First things first. Hello and how are you to Kathy in customer service. I understand she has moved on to other duties within the company. Initially had trouble getting someone to pick up the phone. Called back and received excellent service from, think, Valerie. Valerie was attentive very courteous, eager to meet my needs. Asset to the company.", "rating": 4}]