[{"title": "I need support in Spanish", "text": "I need support in Spanish ", "rating": 4}, {"title": "I believe when I first signed up the…", "text": "I believe when I first signed up the agent was very helpful,and when I needed a question answered I feel she was just there to get m e started or signed up!then I got transferred to a different country where I dealt with a call center that did not understand,the language barrier was poor.thanks Freddy Muschamp.", "rating": 4}, {"title": "The process of signing up for life insurance ", "text": "The process of signing up for life insurance with TruStage was easy to get through.  I didn't need to speak to a representative but there was one available.  The only negative thing I have to say is all life insurance companies are too expensive for the elderly with low income.", "rating": 4}, {"title": "Trustage", "text": "It was easy, great company and people ", "rating": 4}, {"title": "Fast Easy Affordable", "text": "Took little time to learn about, complete application, and get coverage. Extremely simplistic and highly affordable. If there's a downfall, it's that they do not have this option for regular life insurance. It is often unaffordable dor people 60+.", "rating": 4}, {"title": "Onboarding was easy waiting for more…", "text": "Onboarding was easy waiting for more information to confirm how great of a company they really are ", "rating": 4}, {"title": "Contented Customers' Reviews", "text": "My husband at age 77 felt he could trust Mark Kent to be honest and reliable when it comes to sorting out details involved with a life well planned and executed.  I had no life insurance above basic Canadian government (which is enough for me); however, I was thrilled when Mark explained TruStage would pay for xtra details in the event of my Death and I would not have to worry so much about leaving my husband Raymond in a place of hardship.  My husband's policy was paid in full and mine should be in 10 years when I am 75.  We are grateful for your dedicated service.", "rating": 4}, {"title": "A Bang For My Buck !", "text": "I am very pleased with the amount of coverage my family has for a great premium monthly fee. I also like how quick customer service is to attend to any changes or issues on the policy. ", "rating": 4}, {"title": "Competitive Pricing on Whole Life for Seniors!", "text": "This company offered competitive pricing on a life insurance policy for my age group (60+). I was glad to find it. The conditions are fair (lesser payout amount if I die within the first two years, unless by accident). I was able to set up automatic payments after receiving my policy documents in the mail.", "rating": 4}, {"title": "This company made thing easy and…", "text": "This company made thing easy and convenient.I didn't have to upload any information or medical records. Nor did I have to answer a million questions.", "rating": 4}, {"title": "The experience was great because it let…", "text": "The experience was great because it let me give my honest opinion on the policy. Trustage insurance is a great start for insurance young adults.", "rating": 4}, {"title": "Am glad they gave me instant approval.", "text": "Date of experience: September 27, 2024", "rating": 4}, {"title": "This is my first policy", "text": "This is my first policy, I never had life insurance. The process was straight forward. The representative answered all my questions and took the time to explain my policy. In addition to my policy I added the accidental death and dismemberment policy. This policy is  a game changer for me.", "rating": 4}, {"title": "I like your service very much and…", "text": "I like your service very much and you're very professional when I call you on the phone. However, as I said earlier, I just can't understand how you can charge me 3 × 2 jump up to a higher rate. Cause when you're on social security. That amount you're asking for is impossible to pay.", "rating": 4}, {"title": "Finally Paid Claim.", "text": "Updated Review: I am changing my review of Trustage to 4 stars in the final update 7-27-23.They have finally paid out after almost 4 weeks wait. The delay was from the fact that my mom passed out outside the US.After reading my initial review where I gave 1 star, they reached out to me, asked for a couple more documents, and they finally paid out.I would have given 5 stars, had it not been initially delayed but overall, they are good company to buy insurance from.", "rating": 4}, {"title": "2040 cheers to new start on life", "text": "Honestly. This was a hard time. I was working got hurt at work, my identity got stolen and my life fell apart. This las year i lost my kids, my home, and almost my life. ", "rating": 4}, {"title": "No comment I just want to thank you and…", "text": "No comment I just want to thank you and others ", "rating": 4}, {"title": "For accidental death only ", "text": "Read the policy and to understand what you are reading ", "rating": 4}, {"title": "The process was very easy", "text": "The process was very easy. My bank recommended me so I did nothing except write my information and send it to the mail. My only issue is that they incorrectly added my name on the certificate which hopefully can be updated soon.", "rating": 4}, {"title": "Well Furnished ", "text": "I am happy to be a part of Trustage life insurance company .I hope everyone who is looking to get a life insurance should go with Trustage .", "rating": 4}, {"title": "Simple to get", "text": "I was able to do all of this online didn't have to answer a phone call or return a call. PerfectEverything was accurate an correct. Payments are simple and I wouldn't have done it if phone calls were required..", "rating": 4}, {"title": "I had no problems with the application", "text": "I had no problems with the application. Everything is precisely clear 👌. I've checked other companies and their offers are far less satisfactory. ", "rating": 4}, {"title": "Understand", "text": "When the customer rep change me from term life to whole life after thinking that is what I had for the past 4 years without a hassle", "rating": 4}, {"title": "I have been with the company for years …", "text": "I have been with the company for some years. I have recommended my family members and they take care of their customers without hesitation. I trust them completely", "rating": 4}, {"title": "Not as invasive as other insurance…", "text": "Not as invasive as other insurance sites, more straightforward and offers various payment scale and frequencies. The only issue I had was an error that came up when trying to submit a page early in the application process, which delayed the submission of the application, but it worked when I tried the next day and the important part was that it went through and was approved.", "rating": 4}, {"title": "Offered through Navy Federal credit…", "text": "Offered through Navy Federal credit Union... Whom I trust... Plans were affordable for me...easy to apply. I decided to finally get one of the plan that fits, glad I did...", "rating": 4}, {"title": "Cecil`s review", "text": "Well for one is a well organized company it looks after its customers and it's been a pleasure working with your people.", "rating": 4}, {"title": "From experience", "text": "When my husband passed he had three different life insurance and trustage paid out the fastest. Very polite customer service", "rating": 4}, {"title": "Shopping for insurance ", "text": "Based on the wonderful reviews l have read, l tried to fulfilled up the application form online and l got to where I was asked to set up my payment but I had abort the process because I haven't seen if the policy covers 20 or 30 years.  ", "rating": 4}, {"title": "New member ", "text": "I'm a new member and I think the rates are ok to afford and seems trusted like my credit union. ", "rating": 4}, {"title": "Great first time experience", "text": "I was originally signing up because I trust my credit union and it seem to be fair rates, but when I spoke with customer service they made me feel at ease with my decision to choose this company.", "rating": 4}, {"title": "Everything thing was good except the…", "text": "Everything thing was good except the telemarketer calls to upgrade before I even got the policy. ", "rating": 4}, {"title": "I Just Applied And I Want To Make Sure…", "text": "I Just Applied And I Want To Make Sure That I Made The Correct decision In Choosing Trustage Insurance Company.", "rating": 4}, {"title": "Caring", "text": "This is great for families. It takes a little pressure off families!!", "rating": 4}, {"title": "Easy to apply", "text": "Easy to apply, reasonable rates, coverage grows 50% over 10 years with no rate increase", "rating": 4}, {"title": "The application was pretty simple and…", "text": "The application was pretty simple and straightforward which I believe helps a lot people make the decision. ", "rating": 4}, {"title": "Just to know", "text": "Just reticent ly looking into the means for life insurance. Yes it is due necessary.", "rating": 4}, {"title": "Nothin much I just think I like this…", "text": "Nothin much I just think I like this page very much thx to it's responsible opportunity thank you.", "rating": 4}, {"title": "TruStage Whole Life Insurance is easy to apply", "text": "TruStage was responsive to my inquiries and made it easy for me to apply for whole life insurance.", "rating": 4}, {"title": "Because I have not receive a physical…", "text": "Because I have not receive a physical documents ", "rating": 4}, {"title": "True stage got your back", "text": "The warm welcome I got from the agent   Just make me go  ahead  and get my insurance.   True stage make it easy give you time to understand  so I could go a head", "rating": 4}, {"title": "All is good", "text": "I have had no problems with this company, neither with my past or present dealings. ", "rating": 4}, {"title": "Ty  it gghbvbnv bjb c be v be cc…", "text": "Ty  it gghbvbnv bjb c be v be cc jbvbkbb TI vcr IV f do He", "rating": 4}, {"title": "My over all experience was great and…", "text": "My over all experience was great, my over plan was priced great and that spoke volume within itself.", "rating": 4}, {"title": "Credit union member", "text": "It was recommended by my credit union. Paper work was easy. Cost is affordable.", "rating": 4}, {"title": "Good people to work with in the u.s.I…", "text": "Good people to work with in the u.s.I don't like talking to people from a different country there hard to understand ", "rating": 4}, {"title": "The process was fast & easy", "text": "The process was fast & easy. The paperwork was clear & easy to understand. The payments are very affordable.", "rating": 4}, {"title": "Coverage", "text": "Everything went smooth when filling out my application", "rating": 4}, {"title": "I haven't worked with the company…", "text": "I haven't worked with the company enough to know for Sure Whether I can stand behind it or not", "rating": 4}, {"title": "I have no complaints at all", "text": "I have no complaints at all. Over all it was easy and didn’t take a long time. I suppose I reserve 5 stars for really out of this world service. And I was torn over giving 4 or 5 stars here. So take that for whatever its worth.", "rating": 4}, {"title": "Simply Trustful", "text": "It was very easy to apply. I understood the services and what mattered to me. ", "rating": 4}, {"title": "It was easy and cost effective", "text": "Date of experience: September 30, 2024", "rating": 4}, {"title": "Easy to apply", "text": "Easy to apply. Only thing I would like is a representative to explain the policy.", "rating": 4}, {"title": "Great Customer Service!", "text": "So far so good.  People make or break a company.  The representative was excellent.", "rating": 4}, {"title": "I appreciate Golden 1 offering Trustage…", "text": "I appreciate Golden 1 offering Trustage policy. It was easy with flexible options. ", "rating": 4}, {"title": "Appreciation ", "text": "I appreciate this opportunity to be able to recoup what my family lost in the event of my demise ", "rating": 4}, {"title": "I called and received information …", "text": "I called and received information  about AD&D .everything went well. I still have questions", "rating": 4}, {"title": "Brand new client.", "text": "As a brand new client, the process was easy to understand and complete.", "rating": 4}, {"title": "The CSR was most kind and explained the…", "text": "The CSR was most kind and explained the answers to my questions.", "rating": 4}, {"title": "Your company will explain well", "text": "Very good customer service.", "rating": 4}, {"title": "whether or not their premium will go up or stay the same", "text": "The advisor was very knowledgeable and helpful in providing the information I needed so that I could make an informed decision.", "rating": 4}, {"title": "I'm satisfied with my policy", "text": "It made it great because of the turn around of submitting my paperwork.", "rating": 4}, {"title": "Good Customer Service", "text": "The customer service was great, which is what we all look for in a company.", "rating": 4}, {"title": "Protection for All", "text": "The price is right for the protection we purchased. ", "rating": 4}, {"title": "no comment", "text": "I have being with San Juan Credit union for along timethat's  why I trust  company", "rating": 4}, {"title": "Good price for life insurance ", "text": "Good people that care about you and your family coverage and good price ", "rating": 4}, {"title": "Anthony ", "text": "I was comfortable with the agent who assisted me concerning this matter ", "rating": 4}, {"title": "Trusted reliable company", "text": "The whole experience was easy and helpful.  The lady I spoke to was friendly and very knowledgable", "rating": 4}, {"title": "Good company ", "text": "Easy to apply for and understand ", "rating": 4}, {"title": "Tried", "text": "Company only took out what they were supposed to.  It was very affordable also", "rating": 4}, {"title": "Pretty easy and straightforward", "text": "Pretty easy and straightforward. Would rather do this in person. ", "rating": 4}, {"title": "Understandable policy", "text": "This policy is easy to understand and I trust my credit union", "rating": 4}, {"title": "I guess it was the way the…", "text": "I guess it was the way the representative did her job.", "rating": 4}, {"title": "Great Expereience", "text": "My experience was great because the employees at TruStage were knowledgeable about the contents and were very helpful.", "rating": 4}, {"title": "Trustworthy", "text": "TruStage comes through a highly trusted credit union.", "rating": 4}, {"title": "Unique", "text": "With very assessable ways of being there through a phone call.", "rating": 4}, {"title": "Easy to get the survey done but the…", "text": "Easy to get the survey done but the links in your email are not working for me.", "rating": 4}, {"title": "Associate was very nice", "text": "Associate was very nice, questions were too lengthy", "rating": 4}, {"title": "Easy process and willing staff to help.", "text": "Helpful organization for you and your family.", "rating": 4}, {"title": "Because they accepted me at my age 84", "text": "Because they accepted me at my age 84, thank U", "rating": 4}, {"title": "It doesn’t have a age limit it’s for life", "text": "It was easy to apple and good customer service ", "rating": 4}, {"title": "Easy process ", "text": "Process easy and painless. Good value for my dollar.", "rating": 4}, {"title": "trust age review", "text": "The product is worth the.money", "rating": 4}, {"title": "Easy to Qualify", "text": "It was easy to apply and be accepted.", "rating": 4}, {"title": "The benefits", "text": "Navy Federal is offering this policy to there members.", "rating": 4}, {"title": "Simple and quick to the point ", "text": "Ease of use and pretty straight forward signing up.", "rating": 4}, {"title": "Great company and affordable ", "text": "Affordable and reliable and navigation is easy and the information is very helpful and they provided through my credit union ", "rating": 4}, {"title": "I just signed up with this company so I", "text": "I just signed up with this company so I don't have to much info to write about them. But so far so good.", "rating": 4}, {"title": "Very simple to apply and cost very…", "text": "Very simple to apply and cost very reasonable", "rating": 4}, {"title": "Good company ", "text": "Very easy to communicate and prompt response", "rating": 4}, {"title": "Questions and request were easy to…", "text": "Questions and request were easy to answer", "rating": 4}, {"title": "Good ", "text": "It's something that I had to have an ya'll were a lot of help ", "rating": 4}, {"title": "It was a simple straight forward…", "text": "It was a simple straight forward approach to everything.", "rating": 4}, {"title": "Bath", "text": "Please come get me at my house and I can get some rest for the weekend ", "rating": 4}, {"title": "Great price", "text": "Offered at a great price through my credit union cfcu", "rating": 4}, {"title": "this company is doing well", "text": "Date of experience: May 19, 2024", "rating": 4}, {"title": "Easy and direct info", "text": "Date of experience: September 20, 2024", "rating": 4}, {"title": "It was very easy to read and understand", "text": "It was very easy to read and understand ", "rating": 4}, {"title": "Representative  was very knowledgeable…", "text": "Representative  was very knowledgeable & helpful", "rating": 4}, {"title": "Great", "text": "Great to  deal with a company that care about people ", "rating": 4}, {"title": "Easy to apply ", "text": "Decent price and easy to apply ", "rating": 4}, {"title": "Care from you guys", "text": "Offering this at the rate they are", "rating": 4}, {"title": "I'm happy with the fast process I…", "text": "I'm happy with the fast process I received.", "rating": 4}, {"title": "Every one needs like insurance", "text": "It was helpful having my mom help me.", "rating": 4}, {"title": "From me", "text": "Good and satisfied right now", "rating": 4}, {"title": "Knowing your loved one will have a little something when you’re gone ", "text": "My agent was wonderful ", "rating": 4}, {"title": "simple and easy", "text": "simple and easy, no complications", "rating": 4}, {"title": "Great customer service", "text": "Great customer service. Very detailed in explaining your options", "rating": 4}, {"title": "Good", "text": "I'm glad that I'm getting these reviews", "rating": 4}, {"title": "Every thing was easy and affordable", "text": "Date of experience: July 12, 2023", "rating": 4}, {"title": "Except for the withdrawal of payment schedule all other aspects were fine", "text": "The knowledge of the customer service rep.", "rating": 4}, {"title": "The easiest of the process", "text": "The easiest of the process ", "rating": 4}, {"title": "Great insurance at a great price", "text": "Excellent customer service and great insurance and a great price.", "rating": 4}, {"title": "N/A maybe at another time", "text": "Date of experience: November 20, 2023", "rating": 4}, {"title": "It was clear to understand.", "text": "It was clear to understand", "rating": 4}, {"title": "Insurance needs", "text": "I trust the credit union as a good product", "rating": 4}, {"title": "Fast and east service.", "text": "Fast and east service. ", "rating": 4}, {"title": "Excellent insurance company", "text": "I like their honesty & accuracy", "rating": 4}, {"title": "Feeling great about the coverage", "text": "Date of experience: November 15, 2023", "rating": 4}, {"title": "it was easy to understand and very fast…", "text": "it was easy to understand and very fast to", "rating": 4}, {"title": "Keeping to your promises", "text": "The customer service was good.", "rating": 4}, {"title": "Easy process", "text": "Easy process to enroll", "rating": 4}, {"title": "TruStage", "text": "Received invite thru my Banking system.", "rating": 4}, {"title": "your good service", "text": "company is awesome", "rating": 4}, {"title": "Easy process", "text": "Easy process ", "rating": 4}, {"title": "Easy Process", "text": "The process was very easy. The policy was offered through my bank.", "rating": 4}, {"title": "Taking care", "text": "Nothing yet", "rating": 4}, {"title": "The services", "text": "Date of experience: May 23, 2024", "rating": 4}, {"title": "Trust", "text": "Trusting people", "rating": 4}, {"title": "great service", "text": "great service ", "rating": 4}, {"title": "The application process was…", "text": "The application process was straightforward and easy to follow. ", "rating": 4}, {"title": "Great company", "text": "Date of experience: February 05, 2024", "rating": 4}, {"title": "Overall good process.", "text": "Date of experience: May 10, 2024", "rating": 4}, {"title": "Good Company ", "text": "They Are perfect ", "rating": 4}, {"title": "Cheerful", "text": "Cheerful, explain, prompt", "rating": 4}, {"title": "Best life insurance coverage!", "text": "Best offers hands down.", "rating": 4}, {"title": "It came at the perfect time.", "text": "Date of experience: June 12, 2024", "rating": 4}, {"title": "Easy to apply.", "text": "Date of experience: April 18, 2024", "rating": 4}, {"title": "Gratitude", "text": "I just signed up with you, please. I'm happy.", "rating": 4}, {"title": "Credit union", "text": "Simple to understand", "rating": 4}, {"title": "Good value and meets needs of clients.", "text": "Date of experience: July 09, 2023", "rating": 4}, {"title": "Easy and accessible", "text": "Date of experience: December 19, 2023", "rating": 4}, {"title": "The filling process was simple.", "text": "Date of experience: February 24, 2024", "rating": 4}, {"title": "Read what you sign", "text": "They where honest", "rating": 4}, {"title": "Reenie’s", "text": "Ease of process", "rating": 4}, {"title": "Good experience with everything.", "text": "Date of experience: February 02, 2024", "rating": 4}, {"title": "The process was simple.", "text": "Date of experience: February 01, 2024", "rating": 4}, {"title": "Security for your future", "text": "Date of experience: April 12, 2024", "rating": 4}, {"title": "Good value for the price", "text": "Good for my life as long as I pay.my premium", "rating": 4}, {"title": "Lots of detailed and helpful…", "text": "Lots of detailed and helpful information!", "rating": 4}, {"title": "Be clear on autopay vs monthly bill", "text": "Providing affordable prices for life insurance coverage ", "rating": 4}, {"title": "Insurance", "text": "Easy to apply and a good value", "rating": 4}, {"title": "Great service ", "text": "Great communitive attention to customers ", "rating": 4}, {"title": "You just asked for a rating.", "text": "Date of experience: November 10, 2023", "rating": 4}, {"title": "Decent", "text": "I cannot complain", "rating": 4}, {"title": "I am generally satisfied with the…", "text": "I am generally satisfied with the TruStage experience", "rating": 4}, {"title": "Easy to apply", "text": "Very easy to apply", "rating": 4}, {"title": "Very important.", "text": "Price and easy to apply.", "rating": 4}, {"title": "easy to use and follow", "text": "Date of experience: February 21, 2024", "rating": 4}, {"title": "Too easy", "text": "Very easy to apply!", "rating": 4}, {"title": "No comment to make", "text": "Date of experience: July 07, 2023", "rating": 4}, {"title": "The sales representative was wonderful", "text": "The sales representative was wonderful, polite and informative.", "rating": 4}, {"title": "No customers service ", "text": "They need more attention and communication with customers. ", "rating": 4}, {"title": "Excellent service ", "text": "Excellent prices, customer service ", "rating": 4}, {"title": "Quick and easy good product for the…", "text": "Quick and easy good product for the money", "rating": 4}, {"title": "A good experience", "text": "A good experience ", "rating": 4}, {"title": "The information and the service.", "text": "Date of experience: January 28, 2024", "rating": 4}, {"title": "I have a great policy at a great rate", "text": "Date of experience: September 17, 2023", "rating": 4}, {"title": "You have been real nice to me", "text": "Date of experience: December 14, 2023", "rating": 4}, {"title": "Good rate ", "text": "Easy to fill out form ", "rating": 4}, {"title": "They offered a great policy ", "text": "Date of experience: April 21, 2024", "rating": 4}, {"title": "Difference between term and whole life", "text": "Idk yet I’m new to tru", "rating": 4}, {"title": "Quick & easy", "text": "Quick & easy. How I like it", "rating": 4}, {"title": "It was easy to set up", "text": "Date of experience: February 13, 2024", "rating": 4}, {"title": "Swnior Insyrance", "text": "Offering insurance to seniors", "rating": 4}, {"title": "Representative was clear in explaining", "text": "Date of experience: November 14, 2023", "rating": 4}, {"title": "Fair price", "text": "Easy and a fair price", "rating": 4}, {"title": "My experience was quite satisfactory.", "text": "Date of experience: October 21, 2023", "rating": 4}, {"title": "Customer service was awesome!!", "text": "Date of experience: September 14, 2023", "rating": 4}, {"title": "SIMPLE AND EASY AND NEEDED", "text": "Date of experience: November 14, 2023", "rating": 4}, {"title": "FRIENDLY REPS", "text": "Date of experience: July 25, 2024", "rating": 4}, {"title": "great customer service", "text": "Date of experience: February 22, 2024", "rating": 4}, {"title": "The policy is concise.", "text": "It's a good policy", "rating": 4}, {"title": "value and service", "text": "customer service great", "rating": 4}, {"title": "Great customer service", "text": "Date of experience: December 07, 2023", "rating": 4}, {"title": "the price is good", "text": "Date of experience: February 21, 2024", "rating": 4}, {"title": "Honest program ", "text": "I Understand ", "rating": 4}, {"title": "Easy information and instructions.", "text": "Date of experience: September 12, 2023", "rating": 4}, {"title": "Everything is Good", "text": "Date of experience: February 10, 2024", "rating": 4}, {"title": "Life Insurance ", "text": "Date of experience: March 12, 2024", "rating": 4}, {"title": "Quick and easy ", "text": "Date of experience: February 13, 2024", "rating": 4}, {"title": "Experience as a new customer", "text": "Excellent customer service", "rating": 4}, {"title": "Quick and easy", "text": "Date of experience: January 25, 2024", "rating": 4}, {"title": "Easy and quick", "text": "Date of experience: December 19, 2023", "rating": 4}, {"title": "Completed", "text": "That’s enough", "rating": 4}, {"title": "Affordable.", "text": "Affordable. ", "rating": 4}, {"title": "customer service", "text": "Date of experience: April 09, 2024", "rating": 4}, {"title": "Cheap", "text": "Affordable ", "rating": 4}, {"title": "Good", "text": "Thoroughness", "rating": 4}, {"title": "Communication", "text": "Date of experience: September 13, 2023", "rating": 4}, {"title": "The process was easy", "text": "Date of experience: June 13, 2023", "rating": 4}, {"title": "Everyone was professional", "text": "Date of experience: May 02, 2023", "rating": 4}, {"title": "Great Insurance Company", "text": "Great Company", "rating": 4}, {"title": "New member", "text": "I'm a new member. No comment for now", "rating": 4}, {"title": "Pleasant staff & helpful.", "text": "Pleasant staff & helpful.(Pls. use my first name, no last name for review purposes).", "rating": 4}, {"title": "As of now", "text": "As of now. I am pleased.", "rating": 4}, {"title": "Outstanding", "text": "Date of experience: June 07, 2023", "rating": 4}, {"title": "It's very important for every family to have this insurance", "text": "It's because of navy federal credit Union have been with them for more than 15 years, they are strong, reliable and trustef.", "rating": 4}, {"title": "Easy to apply online. Low cost term life insurance.", "text": "The online application was easy and fast. Automatic payments are convenient. No medical exam required. Good till age 80.", "rating": 4}, {"title": "The importance of good service", "text": "The company offers affordable price rate for this particular term life insurance policy.   The customer service agents is helpful and patience.", "rating": 4}, {"title": "My Policy", "text": "It was easy and seamless.", "rating": 4}, {"title": "Choosing this AD&D Ins policy was easy.", "text": "The insurance agent we spoke to was very helpful, knowledgeable and kind. He took his time to explain things and answer all of our questions. Of course we haven’t made a claim. We just received our policy. We have the premium set up to automatically withdraw from our credit union account. That way we will never let our premium lapse. Everything was easy.", "rating": 4}, {"title": "Great value for a small price", "text": "Great insurance company", "rating": 4}, {"title": "Awesome Company!", "text": "Date of experience: April 01, 2023", "rating": 4}, {"title": "Efficient and easy to apply", "text": "Everything was processed and sent back quickly.", "rating": 4}, {"title": "Aokay", "text": "At the age where life insurance is important", "rating": 4}, {"title": "Trustworthy, good company and understanding", "text": "Good and trustworthy company Life Insurance Companies that  pay detail to the insurer.", "rating": 4}, {"title": "Havr recieved numerous applications…", "text": "Havr recieved numerous applications since signing up. Do not need anymore. Thank you.", "rating": 4}, {"title": "Great", "text": "How it's was responsible for me when I raised my 5 grkids", "rating": 4}, {"title": "AD&D policy", "text": "Ease of completion.", "rating": 4}, {"title": "Ease of signing up & accepting of…", "text": "Ease of signing up & accepting of clients with minor health issues with no complications.  Good value (ie payout vs premiums).", "rating": 4}, {"title": "easy to understand", "text": "Date of experience: April 19, 2023", "rating": 4}, {"title": "A D &D at a great price!…", "text": "Ease of payment and clarity of documents make this the ideal policy for me!", "rating": 4}, {"title": "Make it Easier for Seniors to set up an account.", "text": "Don't make this process more difficult than it needs to be.", "rating": 4}, {"title": "Easy to understand.", "text": "It was easy to understand the questions were easy to read.", "rating": 4}, {"title": "Happy with the emails and…", "text": "Happy with the emails and communication. Not happy that I’ve not received my policy yet.", "rating": 4}, {"title": "It is good for what they offer.", "text": "Date of experience: April 19, 2023", "rating": 4}, {"title": "Great price for the coverage!", "text": "Great price for the coverage!!  Easy to apply!!!", "rating": 4}, {"title": "Very easy to talk to each operator", "text": "I was connected to the right people along the steps I had to take smooth and sound", "rating": 4}, {"title": "my rating", "text": "it was an easy process", "rating": 4}, {"title": "Good", "text": "Good experience. Thanks", "rating": 4}, {"title": "......", "text": "................", "rating": 4}, {"title": "Added insurance", "text": "Was an OK experience.  Offered through my credit union.", "rating": 4}, {"title": "Helpful and hope", "text": "Easy and helpful", "rating": 4}, {"title": "Recommended", "text": "Recommend by my mom", "rating": 4}, {"title": "my experience was top of the line", "text": "my experience was top of the line. and I appreciate your expertise.", "rating": 4}, {"title": "Like I said before my policy is very…", "text": "Like I said before my policy is very new so I don't have any experience  or problems at this time", "rating": 4}, {"title": "Life insurance", "text": "Very smooth and self explanatory", "rating": 4}, {"title": "It was easy and I got what I was…", "text": "It was easy and I got what I was looking for", "rating": 4}, {"title": "Fair enough to all", "text": "Date of experience: April 05, 2023", "rating": 4}, {"title": "Life Insurance", "text": "Representative was very knowledgeable and helpful.", "rating": 4}, {"title": "How I feel", "text": "It was very easy to sign up for the policy and it did not discriminate against me", "rating": 4}, {"title": "Mailed Documents", "text": "I like the fact that I received my sensitive documents 📄 in a timely manner.", "rating": 4}, {"title": "the process was simple and easy", "text": "Date of experience: April 04, 2023", "rating": 4}, {"title": "The policy was easy to apply for and…", "text": "The policy was easy to apply for and receive.  So far, things are happening as expected.  The only think I didn't fully appreciate was that the amount would increase on my birthday.", "rating": 4}, {"title": "Survey", "text": "The ease of the application", "rating": 4}, {"title": "The ease of a TruStage pilicy", "text": "It was easyto understand and apply.", "rating": 4}, {"title": "I didn’t have a lot of time but the…", "text": "I didn’t have a lot of time but the person on the other end of the phone was very helpful and pleasant", "rating": 4}, {"title": "There's nothing great about the…", "text": "There's nothing great about the experience.  I submitted the application, it was approved, and the ccompany sent a policy to me.  Payments began.", "rating": 4}, {"title": "Great process for immediate coverage.", "text": "The process was quick and easy to manage. You could improve that I received the same paperwork three times for a missing signature. A simple phone call or a detailed letter would close the loop more efficiently.", "rating": 4}, {"title": "My review of signing up for insurance", "text": "I was looking for more life insurance to go to my son.", "rating": 4}, {"title": "TruStage was offered through a company…", "text": "TruStage was offered through a company I have worked with for years.  They made the process of applying very simple and I had insurance needed very quickly.", "rating": 4}, {"title": "Wait and See", "text": "Comfortable with product because Credit Union recommended.On-line login issues with poor resolution, and inability to access electronically = four stars", "rating": 4}, {"title": "Easy process. Too expensive", "text": "The process is very easy and intuitive and I appreciate that my credit union is trying to keep their fees as low as possible by partnering with other product providers. But the quoted premium turns out to be too much compared to other offers from (for instance) AAA and AARP.", "rating": 4}, {"title": "Easy to fill out and price is low", "text": "Date of experience: March 03, 2023", "rating": 4}, {"title": "It is not term but while life", "text": "The agent was great/ but my auto pay date should y been the 3rd day of the month/ not the first of the month", "rating": 4}, {"title": "It was so simple", "text": "It was so simple. I actually did it on my phone.", "rating": 4}, {"title": "It has really helped me to decide how…", "text": "It has really helped me to decide how to help my son when I am gone. Thank you!", "rating": 4}, {"title": "Good", "text": "Just give me the comfort of knowing i will be taking care of", "rating": 4}, {"title": "Insurance thru 1st members CU", "text": "Easy and quick to fill out the form. Reasonable price and easy process for payment.", "rating": 4}, {"title": "Insurance", "text": "Easy navigate", "rating": 4}, {"title": "Making me less worried for my family", "text": "The information given was good enough to make me feel secure for my family", "rating": 4}, {"title": "Great price!", "text": "Great price and service!", "rating": 4}, {"title": "Life insurance", "text": "It was easy to understand and I was pleased with the cost", "rating": 4}, {"title": "The convenience", "text": "Date of experience: February 14, 2023", "rating": 4}, {"title": "easy to understand", "text": "Date of experience: February 09, 2023", "rating": 4}, {"title": "Great customer service", "text": "Date of experience: December 14, 2022", "rating": 4}, {"title": "Easy of use when I need information", "text": "Easy of use when I need information, agent was very knowledgeable", "rating": 4}, {"title": "Aig was cheaper on their price,but…", "text": "Aig was cheaper on their price,but truestage customer service and patience won the day!", "rating": 4}, {"title": "Great experience", "text": "Date of experience: January 30, 2023", "rating": 4}, {"title": "Phases", "text": "Easy and accessible", "rating": 4}, {"title": "I don't know what I'm doing", "text": "I don't know what I'm doingI got a current checking account for a direct deposit let me know if you need the card number or whatever", "rating": 4}, {"title": "Easy process", "text": "Not sure, but the process was easy and took less time than expected to start.", "rating": 4}, {"title": "Simple and coverage complete", "text": "Date of experience: January 14, 2023", "rating": 4}, {"title": "That there is always hope and resources out there that can secure the future of your love family.", "text": "I am happy and content with their services. Thank you for the offer.", "rating": 4}, {"title": "Really think it the right coverage.", "text": "I really think its the right coverage to help out if god forbid something would happen. For me it was easy to understand on what all it will cover. Thank you again", "rating": 4}, {"title": "Ease of starting a policy and ease of…", "text": "Ease of starting a policy and ease of payment", "rating": 4}, {"title": "Everything so far is great and I hope…", "text": "Everything so far is great and I hope it stays like that.", "rating": 4}, {"title": "Acknowledging ways to conquer the real from the fake..", "text": "Do to my self being away from incarceration I now continue to breath and move forward without me family worring bout me as I continue to find work to support my self and a creation i do love that won't love me back so I continue to try to do my best not to forget to do better in life. Even tho I know those that think highly of me to be locked up I one day got to get sober and do better for my sons and thoseb I love and need now. Hoping the father in heaven forives my heart of thoughts I think eachday to happen ahead of time as G0D himself judges my lost heart.", "rating": 4}, {"title": "The low payments", "text": "The payment was very affordable and the benefits were great.", "rating": 4}, {"title": "Was recommended by the credit union I…", "text": "Was recommended by the credit union I use. No problems.", "rating": 4}, {"title": "I really appreciate everything", "text": "Date of experience: January 05, 2023", "rating": 4}, {"title": "RegularInsurance for people who really can’t get it anywhere else life insurance", "text": "Regular life insurance policies would not accept me because I am on blood thinners and blood pressure pills due to atrial fibrillation. This policy is a guaranteed policy I got it for a low value just to have some money after I’ve gone to take care of expensive services. Did not feel that I could afford a. Higher face valuepolicy due to expense", "rating": 4}, {"title": "Coverage", "text": "It was through our credit union and easy to set up.", "rating": 4}, {"title": "Make things easier", "text": "Date of experience: December 14, 2022", "rating": 4}, {"title": "the whole process was great and very…", "text": "the whole process was great and very detailed.", "rating": 4}, {"title": "Ease of applying and cost for someone…", "text": "Ease of applying and cost for someone on a fixed income.", "rating": 4}, {"title": "That the rates will never increase", "text": "The whole process was easy.", "rating": 4}, {"title": "Keep giving all you got talking and…", "text": "Keep giving all you got talking and explaining your policy to you when your in doubt", "rating": 4}, {"title": "The ease and speed of the process", "text": "Date of experience: November 11, 2022", "rating": 4}, {"title": "Trust", "text": "All of my questions and fears were taken care of.", "rating": 4}, {"title": "Much easier then anyone else", "text": "Date of experience: November 16, 2022", "rating": 4}, {"title": "Very easy review to complete", "text": "Very easy to complete review.", "rating": 4}, {"title": "Reading all the above 05", "text": "Date of experience: November 15, 2022", "rating": 4}, {"title": "Good company", "text": "I appreciated the knowledge and sincerity of the agent.", "rating": 4}, {"title": "Clarity", "text": "The fact that it came from a credit union that I respected gave the credibility", "rating": 4}, {"title": "It is early on in my association with…", "text": "It is early on in my association with Trustage but I remain hopeful.", "rating": 4}, {"title": "Im to young with the Co", "text": "Im to young with the Co. To make a estimate..", "rating": 4}, {"title": "Process was very easy.", "text": "Date of experience: October 14, 2022", "rating": 4}, {"title": "Great service", "text": "Great experience. I recommend the service.", "rating": 4}, {"title": "Thanks for the experience.", "text": "Date of experience: September 26, 2022", "rating": 4}, {"title": "Simple application", "text": "Very easy to get, just filled out some paper work", "rating": 4}, {"title": "Good insurance", "text": "Not applicable", "rating": 4}, {"title": "Good Experience", "text": "The experience was good and professional and pleasant.", "rating": 4}, {"title": "I'm good and know I made the right…", "text": "I'm good and know I made the right decision.", "rating": 4}, {"title": "Helpful", "text": "It was easy to understand and not expensive today we have to stay with in our budgets.", "rating": 4}, {"title": "I had a very good experience purchasing Whole Life Insurance", "text": "I had a very good experience", "rating": 4}, {"title": "Insurance", "text": "NothingAt all the", "rating": 4}, {"title": "Great insurance company!", "text": "Date of experience: September 11, 2022", "rating": 4}, {"title": "Policy information is according to what…", "text": "Policy information is according to what I purchased can't see any changes. Very Happy with the services I received.", "rating": 4}, {"title": "So far so good", "text": "So far, I'm happy with my policy. I'm fairly new, so I have to give it some time in order to rate properly.", "rating": 4}, {"title": "Happy with this policy", "text": "Seems to be a great policy", "rating": 4}, {"title": "Change over", "text": "It was a fast and efficient. Call with a rep. To change my payment options.", "rating": 4}, {"title": "I was very happy with the material I received", "text": "I was happy with the policy I did not read the whole picy yet. However I will. And if I have questions I will call.", "rating": 4}, {"title": "My Life Policy Survey #1", "text": "I dont have anything additional to add at this time", "rating": 4}, {"title": "Experience was alright", "text": "Experience was alright, pretty easy.", "rating": 4}, {"title": "One of the best experiences", "text": "I needed additional coverage because I want to make sure my family is ok if I leave this earth and the process was extremely easy.", "rating": 4}, {"title": "Our First life Insurance application", "text": "Everything was easy to understand. We both need to talk about what type of life insurance best suits our life at this moment", "rating": 4}, {"title": "I had no problems understanding or applying for TruStage Life Insurance.", "text": "I had no problems understanding or applying for TruStage Life Insurance. The process was easy to understand and the insurance was simple to apply for. The payments were easy to set up online.", "rating": 4}, {"title": "Good and easy to apply for", "text": "Date of experience: September 07, 2022", "rating": 4}, {"title": "J K K U", "text": "I hope this is a good company", "rating": 4}, {"title": "A real person would be helpful.", "text": "Date of experience: September 07, 2022", "rating": 4}, {"title": "It was an easy proceess", "text": "It was an easy proceess. Short application. Not a lot of fluff. I recieved what I requested and paid for.", "rating": 4}, {"title": "I am quite satisfied with Trustage", "text": "I am quite satisfied with Trustage. Payments good.", "rating": 4}, {"title": "Change my policy, I thought I had filled out for life insurance", "text": "Need to change my policy", "rating": 4}, {"title": "Nice non-intrusive questionnaire.", "text": "Date of experience: August 12, 2022", "rating": 4}, {"title": "Good service", "text": "Date of experience: August 12, 2022", "rating": 4}, {"title": "very good rates", "text": "Date of experience: August 12, 2022", "rating": 4}, {"title": "I’m satisfied with the policy", "text": "Date of experience: August 12, 2022", "rating": 4}, {"title": "Good people Good service", "text": "Date of experience: August 10, 2022", "rating": 4}, {"title": "Good insurance company", "text": "Good insurance company, they seem to really care about their customers unlike all the other insurance companies i had contacted before Trustage.I am very happy with Trustage and would highly recommend them to anyone thinking about getting life insurance.", "rating": 4}, {"title": "Easy and accurate.", "text": "Date of experience: August 10, 2022", "rating": 4}, {"title": "Life", "text": "helpful and quick", "rating": 4}, {"title": "Would recommend TruStage to my family…", "text": "Would recommend TruStage to my family and friends.", "rating": 4}, {"title": "from the two of us", "text": "Date of experience: July 24, 2022", "rating": 4}, {"title": "Too many personal questions", "text": "Date of experience: July 23, 2022", "rating": 4}, {"title": "Easy pay out experience and helpful…", "text": "Easy pay out experience and helpful client service.", "rating": 4}, {"title": "I GOT LIFE INSURANCE", "text": "THE PROCESS MWAS EASY TO APPLY", "rating": 4}, {"title": "I think it's a fair price and deal for…", "text": "I think it's a fair price and deal for today's society and the inflation problems were having now", "rating": 4}, {"title": "True life so far seems easy and helpful…", "text": "True life so far seems easy and helpful will have to see show things go.", "rating": 4}, {"title": "Very cordial and fit my needs that my…", "text": "Very cordial and fit my needs that my Credit Union offered", "rating": 4}, {"title": "every thing was fine", "text": "Date of experience: July 14, 2022", "rating": 4}, {"title": "excellent service", "text": "Date of experience: July 14, 2022", "rating": 4}, {"title": "In Conclusion", "text": "All in all, the process to purchase coverage was easy and did not require a large amount of time.", "rating": 4}, {"title": "The agent was very clear", "text": "The agent was very clear, cocncice, educated, patient, thorough and kind. The coverage is rather low for what I am paying.", "rating": 4}, {"title": "Hoping this is as great as a company as…", "text": "Hoping this is as great as a company as they say they are. Only time will tell", "rating": 4}, {"title": "Awesome", "text": "Awesome and thorough", "rating": 4}, {"title": "Easy to apply for", "text": "Easy to apply for. Loved it for that reason.", "rating": 4}, {"title": "I have life insurance I pay $50 a month…", "text": "I have life insurance I pay $50 a month for my life insurance", "rating": 4}, {"title": "Being this is my 1st policy", "text": "Being this is my 1st policy, it was an easy process. After taking the survey,  I feel like there are some things I need to clarify regarding the policy.", "rating": 4}, {"title": "9:32am ET", "text": "My spouse have Life Insurance with Trustage so I got coverage for me. I don’t remember the contract in detail nor am I able to acces it at this moment therefore I skipped questions. I guess we’ll see how well the product and customer service is.", "rating": 4}, {"title": "Good policy for the money.", "text": "Date of experience: June 17, 2022", "rating": 4}, {"title": "Great Service Representatives", "text": "Great Service Representatives, horrible Sales Representatives.  Sales Reps are tone death.No means No or not now.  Be patient and professional.  Play ti long game, even when selling death policies … lol.", "rating": 4}, {"title": "Easy setup and inexpensive through my…you never know", "text": "Easy setup and inexpensive through my credit union.", "rating": 4}, {"title": "Always leave room to improve", "text": "Date of experience: June 17, 2022", "rating": 4}, {"title": "Would have definitely given 5 stars but…", "text": "Would have definitely given 5 stars but my actual policy hasn't arrived after 2 months, however, they tell me it is definitely on the way", "rating": 4}, {"title": "I have not had it long but they process attaining the policy was easy. I trust my Credit Union and TruStage!", "text": "I have not had it long but attaining", "rating": 4}, {"title": "Customer Conract", "text": "My only request is Patience ! I didn't like having to ask over n over ,to slow down!", "rating": 4}, {"title": "Applicant", "text": "I am happy with my insurance plan.", "rating": 4}, {"title": "This is new. Looking forward to the future with confidence and security!!", "text": "Always a plus when you can add coverage with peace of kind and reassurance. Rainy days come along without advanced warning. My family needs to know we're going to be ok...", "rating": 4}, {"title": "The overall experience was good", "text": "The overall experience was good. The people were kind and helpful.I felt that they cared about my needs and affordability.I have peace of mind for my wife and any end of life costs.", "rating": 4}, {"title": "New with TrueStage.", "text": "No thank you!", "rating": 4}, {"title": "Good and helpful policy", "text": "Date of experience: June 15, 2022", "rating": 4}, {"title": "Employees are polite and take the time…", "text": "Employees are polite and take the time to make sure you understand your policy", "rating": 4}, {"title": "So far, so good.", "text": "As a fairly new customer, there hasn’t been much back and forth as yet with the company about the policy.  But based on the information you provide, and the fact that you’re partnered with my credit union—so far, so good.", "rating": 4}, {"title": "Excellent customer service with…", "text": "Excellent customer service with detailed information", "rating": 4}, {"title": "It is still new to me", "text": "Date of experience: June 10, 2022", "rating": 4}, {"title": "GRATEFUL", "text": "Affordable, EASY and comforting!", "rating": 4}, {"title": "Good plan", "text": "Good plan offered", "rating": 4}, {"title": "I have been through so much hard ship I…", "text": "I have been through so much hard ship I have 2 children passed away 3sisters passed away 2 older brothers and my hero my dad I'm so depressed I don't want my son to worry about taking care of me when I am gone away but he is my only living child I have left so I want everything to be done for him just give me a good Fair well", "rating": 4}, {"title": "Trustage is awesome and good affordable…", "text": "Trustage is awesome and good affordable rates for life insurance.", "rating": 4}, {"title": "I wish that my scheduled payment would…", "text": "I wish that my scheduled payment would come out of my account on the said date,  instead of a few days later.", "rating": 4}, {"title": "easy application and quick approval", "text": "Date of experience: May 20, 2022", "rating": 4}, {"title": "Life insurance", "text": "Easy to apply.  I like the fact that my rate will not increase with age.", "rating": 4}, {"title": "none", "text": "Thank you for being a good and understanding company.", "rating": 4}, {"title": "I'm OK with the company as long as there aren't any sudden…", "text": "I'm OK with the company as long as I get my bills in a timely manner.", "rating": 4}, {"title": "Very informative.", "text": "Date of experience: May 13, 2022", "rating": 4}, {"title": "I recommend insurance for every one…", "text": "I recommend insurance for every one especially if you have family or love ones. This Insurance company came recommended by my credit union.", "rating": 4}, {"title": "I haven’t had any other dealings with the company", "text": "I haven’t had any other. Dealings with the company Spence I started my policy", "rating": 4}, {"title": "Just let the people know that price…", "text": "Just let the people know that price might change upon review. And what someone put on the application like Beneficiary leave it the way the person write it... Other then that... I like the overall company and the fact they take the money out like they do... No complaints yet on extra money coming out without my permission... I would say.. Join the team....", "rating": 4}, {"title": "Life insurance", "text": "Easy and friendly", "rating": 4}, {"title": "They’re great", "text": "They’re great. Very easy to access and convenient to use. Great price too", "rating": 4}, {"title": "Time will tell if this was a good…", "text": "Time will tell if this was a good decision.", "rating": 4}, {"title": "Rating", "text": "I don't know to much about this company but I will see how it goes.", "rating": 4}, {"title": "Operators were very helpful", "text": "Operators were very helpful. Answered my questions. I trusted their opinion", "rating": 4}, {"title": "Easy to apply for", "text": "Easy to apply for, they take the money out of the account and leave me with no responsibility to remember to pay the bills.", "rating": 4}, {"title": "I needed to change payment to come from…", "text": "I needed to change payment to come from savings not checking account", "rating": 4}, {"title": "Losing all my life insurance during the…", "text": "Losing all my life insurance during the recession in 2010 I needed something affordable to at least help a little as our only asset is the equity in our home. At 74 it becomes quite expensive and the $500,000 policy I lost from nonpayment is now financially impossible to replace. A little is better than nothing.", "rating": 4}, {"title": "More information", "text": "Date of experience: April 28, 2022", "rating": 4}, {"title": "Simple", "text": "Simple, easy application, seems to be good coverage", "rating": 4}, {"title": "Just keep it simple an pay out on time…", "text": "Just keep it simple an pay out on time just like you received your payments", "rating": 4}, {"title": "Excellent and clear insurance", "text": "Excellent and clear insurance, the agent who helped me took his time to explain everything into detail.", "rating": 4}, {"title": "As I said earlier in this survey", "text": "As I said earlier in this survey, my second beneficiary's name is misspelled on the document.  I hope it has been corrected now; I sent in the necessary paperwork to have Melanie Mahoney's name spelled correctly.  Thank you.", "rating": 4}, {"title": "My review", "text": "Thanks for oppunity to complete this survey", "rating": 4}, {"title": "A Good Start", "text": "The company offered a good deal on a accidental death and dismemberment policy that clearly had it's rules for what counted as accidental, minus the fact that death from illness cannot be counted as accidental, on the initial sign-up form as well as what counted towards dismemberment and how much would be payed out for certain types of accidental deaths and dismemberments.", "rating": 4}, {"title": "I'm not used to not talking to an agent…", "text": "I'm not used to not talking to an agent driçt", "rating": 4}, {"title": "True stage life insurance I will give…", "text": "True stage life insurance I will give you a call in the middle of next week and discuss it prices with you thank you", "rating": 4}, {"title": "I need to read my policy but there was…", "text": "I need to read my policy but there was a deadline and I was not going to give this opportunity up so I submitted the information right away. Right now, it's a policy that I though was needed for my husband and myself.", "rating": 4}, {"title": "Quick", "text": "Quick Easy Simple", "rating": 4}, {"title": "Easy to apply", "text": "Wish the coverage was higher", "rating": 4}, {"title": "I think the product offered is just what we needed..", "text": "I think the product offered is a necessary. I think the service is excellent and the terms and conditions of the policy to be very fair, clearly written and understandable.  From start to finish the process is very quick. And overall I feel much safer with the policy I’ve selected.", "rating": 4}, {"title": "I was not given the chance to chose the…", "text": "I was not given the chance to chose the specific date for my payments to be deducted from my checking account", "rating": 4}, {"title": "Additional insurance", "text": "So far so good", "rating": 4}, {"title": "They are very helpful and very nice…", "text": "They are very helpful and very nice people. When I applied they helped me get a quote that fit my budget.", "rating": 4}, {"title": "I was happy with the explanation the…", "text": "I was happy with the explanation the Agent gave me. She explained the different type of insurances offered. It made it easy for me to decide which one was best for me.", "rating": 4}, {"title": "I like that a rep called to let me know…", "text": "I like that a rep called to let me know I can increase the face value of the policy.", "rating": 4}, {"title": "I don't understand what you're saying", "text": "Date of experience: April 15, 2022", "rating": 4}, {"title": "They need to give more details", "text": "Date of experience: April 02, 2022", "rating": 4}, {"title": "So far a great experience it will be up…", "text": "So far a great experience it will be up to my beneficiaries to give you the 5th star and hopefully that will many years down the road... But i have all the trust in the world in you guys thanks again...", "rating": 4}, {"title": "Happy with results", "text": "Date of experience: March 18, 2022", "rating": 4}, {"title": "Great customer service & great rates.", "text": "Date of experience: March 17, 2022", "rating": 4}, {"title": "The process was fast and easy from…", "text": "The process was fast and easy from start to finish.", "rating": 4}, {"title": "Mart", "text": "I don't know much about insurance so, I'm not sure I have all I need.", "rating": 4}, {"title": "I was contacted by the agent", "text": "I was contacted by the agent. He explained the difference of the two types of insurance and which would be most beneficial for me. I took his advice and asked him to find me a policy with the best rate, which he did. He then took my application and told me he would contact me with the approval and information about the payment plan. Several days later he called me and we completed the process of setting up the payment plan. He told me when to expect the policy in the mail and to contact him if I have any questions or concerns. This was the best Insurance application process I have ever experienced and the most simple.", "rating": 4}, {"title": "I had a good experience with the survey", "text": "Date of experience: March 11, 2022", "rating": 4}, {"title": "The application process and price for…", "text": "The application process and price for coverage was good.", "rating": 4}, {"title": "Good service", "text": "Date of experience: March 02, 2022", "rating": 4}, {"title": "The representative I spoke to about my…", "text": "The representative I spoke to about my insurance did not advised me they were taking out 2months instead of one.  More clarity or be more specifics.", "rating": 4}, {"title": "Thank you and I recommend to my friends", "text": "Date of experience: February 24, 2022", "rating": 4}, {"title": "Thank you", "text": "Thank you. So far neither of us has had to use the insurance. \"Knock on Wood\"😂 Have a safe warm and Covid-less day", "rating": 4}, {"title": "Just a new member", "text": "Date of experience: February 21, 2022", "rating": 4}, {"title": "Easy application process", "text": "Easy application process,  with a few options to choose from. Could play with amount, term, and type of insurance product to find a premium amount that fits your personal budget. Although I had sticker shock at my monthly amount, it is understandable, based on age. My policy documents arrived slowly so I did not know if I really had coverage. Someone did touch base via email twice, which I found reassuring.", "rating": 4}, {"title": "I didn't receive any paperwork from the…", "text": "I didn't receive any paperwork from the first time I signed up for the free$2000 of insurance from my bank. Then I was sent another one for accidentally death I believe it was free too through my credit union but I did not receive any paperwork. Can someone please send to me? Thank you. Y'all are great and easy to understand", "rating": 4}, {"title": "I have been very pleased with TruStage…", "text": "I have been very pleased with TruStage thus far.  I have had very pleasant and courteous conversations with three representatives, two within the last month.  Each immediately interpreted my requests and correctly addressed them.  One request I feel has not been completely executed.  I still need a complete copy of the first policy.", "rating": 4}, {"title": "Seems like good insurance", "text": "Seems like good insurance.  Just have to make sure you are not buying accidental death by accident", "rating": 4}, {"title": "So far I am a happy customer", "text": "I have to say, so far I am a happy customer..Applying for insurance has been made so easy.. 😊", "rating": 4}, {"title": "Rates offered differ with Credit Union.", "text": "Date of experience: February 17, 2022", "rating": 4}, {"title": "Questions answered", "text": "I had some questions and the representative was very nice and helpful. I have been looking for life insurance for awhile and this met all my needs. I am very happy with my decision!", "rating": 4}, {"title": "Very easy to read and understand", "text": "Very easy to read and understand, they also have good rates", "rating": 4}, {"title": "Happy and insured", "text": "Very good service and patient with me throughout the whole time applying. Very good at setting up my auto pay.", "rating": 4}, {"title": "Love the way the company follows up.", "text": "Date of experience: February 11, 2022", "rating": 4}, {"title": "In-Person Customer Service I Miss, Though Times Has Changed.", "text": "Application was sent by mail, and so far the application survey has been sent out and I will need to review the policy, yet no real person to clarify till I’ve  ASUMED I either understand or not understand the policy.   Miss the One-On-One People Contact.", "rating": 4}, {"title": "The experience was good but I think you…", "text": "The experience was good but I think you keep asking the same question over and over", "rating": 4}, {"title": "Easy to apply for the policy I need.", "text": "Date of experience: January 21, 2022", "rating": 4}, {"title": "The prices are good compared to others…", "text": "The prices are good compared to others although i don't like that they increase every 5 years.", "rating": 4}, {"title": "Right to the point", "text": "Date of experience: January 19, 2022", "rating": 4}, {"title": "Great company", "text": "Great company. Great products. Affordable.", "rating": 4}, {"title": "Easy process", "text": "Process was easy", "rating": 4}, {"title": "Im still getting to know this company…", "text": "Im still getting to know this company but the application process was easy.", "rating": 4}, {"title": "Good company", "text": "Good company and I like the way things are layed out", "rating": 4}, {"title": "Satisfied", "text": "Talking to customer service was very positive uplifting. It was very helpful understanding and what I was trying to do for my family", "rating": 4}, {"title": "Trusted company by my credit union with…", "text": "Trusted company by my credit union with an offer coming to me from them. An option a chose to take in the event of death in an accident as well as dismemberment.", "rating": 4}, {"title": "OVERALL I WAS SATISFIED WITH HELP FROM…", "text": "OVERALL I WAS SATISFIED WITH HELP FROM THE REPRESENTATIVE ON THE PHONE. AND OVERALL I WAS SATISFIED WITH THE ONLINE ACCOUNT SETUP.", "rating": 4}, {"title": "Clearly information", "text": "Clearly information, comfortable months rate and my husband been with the same bank for years and I really trust this bank to get the best insurance for they costumer.", "rating": 4}, {"title": "I trust that my Credit Union helped me…", "text": "I trust that my Credit Union helped me choose the best policy for my family", "rating": 4}, {"title": "The person who gave me the information…", "text": "The person who gave me the information on the phone she was very patient and explain everything about whole life insurance procedures she was very nice and very kind I ask a lot of questions she took her time and answered all my questions.", "rating": 4}, {"title": "Value and service assessment", "text": "The staff was very helpful and genuinely concerned for my best interest.", "rating": 4}, {"title": "The representative was professional and…", "text": "The representative was professional and very knowledgeable about my needs and provided me with the option for my personal needs.", "rating": 4}, {"title": "I wanted a secondary insurance", "text": "I wanted a secondary insurance. I wanted something separate from my job. When I received this offer, it was simple and easy to apply. Trusted by my credit union.", "rating": 4}, {"title": "My rating for Trustage ins.", "text": "I do have a couple of other policies. I felt it would best to have this policy as well due to the service that I have had with my Credit Union. Even in very difficult times for us. and I find this as a way to help support my Credit Union.", "rating": 4}, {"title": "Simple,Quick and easy‼️ Credit union…", "text": "Simple,Quick and easy‼️ Credit union membership and was offered an amazing deal.", "rating": 4}, {"title": "Hassle free", "text": "If you want to get a policy without having the hassle of taking an exam or given blood this is the company to go with.", "rating": 4}, {"title": "Very helpful and informative", "text": "Date of experience: December 16, 2021", "rating": 4}, {"title": "Great Process", "text": "Date of experience: December 15, 2021", "rating": 4}, {"title": "Glad I have the policy numberPolicy good", "text": "Glad I have the policy number", "rating": 4}, {"title": "Instructions were clear and made it…", "text": "Instructions were clear and made it easy for me to understand.", "rating": 4}, {"title": "Very easy process and affordable", "text": "Very easy process and affordable. Needed additional life insurance  outside of my job.", "rating": 4}, {"title": "Good Insurance", "text": "Good offers and rates", "rating": 4}, {"title": "So far so good", "text": "So far so good!  My whole life policy is low and the rate is a little more expensive than I expected, but it is ok.", "rating": 4}, {"title": "I felt the coverage offered was a great…", "text": "I felt the coverage offered was a great deal. Once I receive my policy and read all of the fine details, I can better assess the policy and your Company.", "rating": 4}, {"title": "Satified Customer", "text": "easy and understandable process", "rating": 4}, {"title": "Affordable whole life coverage", "text": "Affordable whole life coverage. Easy application process. Overall very satisfied. My only complaint is that it takes several days for my payment to actually process and be deducted from my account. Otherwise a great company to do business with.", "rating": 4}, {"title": "Glad I have insurance through trueStage…", "text": "Glad I have insurance through trueStage just in case. I got my form in the mail filled it out n that was it no problems.", "rating": 4}, {"title": "TruStage made the application simple …", "text": "TruStage made the application simple  and easy. It was also within my budgetary concerns.", "rating": 4}, {"title": "Not sure about the company yet I trust…", "text": "Not sure about the company yet I trust them because of my credit union", "rating": 4}, {"title": "The representative was very informative…", "text": "The representative was very informative about the product. Took the time to walk me through all of my concerns.", "rating": 4}, {"title": "Very pleased", "text": "Date of experience: November 17, 2021", "rating": 4}, {"title": "I searched and found A insurance…", "text": "I searched and found A insurance company that I could afford And one that met my  Needs", "rating": 4}, {"title": "Everything was OK", "text": "Date of experience: November 17, 2021", "rating": 4}, {"title": "good insurance", "text": "good insurance, great people to work with.", "rating": 4}, {"title": "I really don't know enough about it…", "text": "I really don't know enough about it Yet!, but i'm glad to have it... Every thing went very well during the buying process!", "rating": 4}, {"title": "I\"m still doing research on this.", "text": "Date of experience: November 13, 2021", "rating": 4}, {"title": "Great company", "text": "Date of experience: November 13, 2021", "rating": 4}, {"title": "So far so good 👍", "text": "Date of experience: November 13, 2021", "rating": 4}, {"title": "I’m not sure how to answer this", "text": "I’m not sure how to answer this. As of right now I’m ok with everything.", "rating": 4}, {"title": "Peace of mind", "text": "Fortunately, I have never had a claim, but I have been with Trustage for years and I believe they will be there for my family, so I can  have peace of mind.", "rating": 4}, {"title": "Very good life insurance policy", "text": "Date of experience: November 13, 2021", "rating": 4}, {"title": "I purchased a TruStage policy so I am…", "text": "I purchased a TruStage policy so I am able to help my family members if something God forbid may happen to me. They will have some help.", "rating": 4}, {"title": "Super easy with a really fast response.", "text": "Date of experience: November 10, 2021", "rating": 4}, {"title": "I am happy at this point with the Rep", "text": "I am happy at this point with the Rep, Premium and the company", "rating": 4}, {"title": "Will Work with TruStage Again", "text": "Fast, simple process and clear terms", "rating": 4}, {"title": "They are a little pricey and younger…", "text": "They are a little pricey for younger people but otherwise I love❤ it", "rating": 4}, {"title": "Policies are written in simple English", "text": "Policies are written in simple English. With rates that fit my budget and policies that fit my needs. I would reccomend!", "rating": 4}, {"title": "Seems like a good policy", "text": "Seems like a good policy.  After seeing other offers coming in - some other companies' payouts are larger for the same premium - or less.I won't REALLY know how good the policy is, until I'm dead.", "rating": 4}, {"title": "Their service was on time", "text": "Their service was on time. I got to speak with a real person. My questions was handle and answered", "rating": 4}, {"title": "Very impressive", "text": "Very impressed with the call and the application process was easy for me to understand", "rating": 4}, {"title": "Great company", "text": "Great company, the process was fast, and easy.", "rating": 4}, {"title": "Cost and explanation of my coverage should have…", "text": "Explanation of my coverage should have been better. You need to read your policy thoroughly. You may be sent an offer for additional coverage after you are approved at a reduced rate but the expiration is a quick turnaround and if you miss the date, no matter the reason, you lose out. Why not offer those rates to begin with? Makes no sense.", "rating": 4}, {"title": "Mind over matter benefits anyone is over live over till 1971", "text": "Know honey I don't need anything like that but other than that I just was born before 1970 when I'm just trying to get the benefits that it's entitled to us you know so other than that I don't need each have insurance", "rating": 4}, {"title": "I originally selected the $5,000…  HAVE NOT RECEIVED THE POLICY", "text": "I originally selected the $5,000 benefit but added $2,000 more to it after a phone call from a TruStage representative.  I have yet to receive the policy in the amount of Seven Thousand and 00/100 Dollars ($7,000.00) for my file.  I would appreciate receiving a copy of this life insurance policy. Carolyn S Peters", "rating": 4}, {"title": "Nice and friendly people to work with.", "text": "The coworkers were nice and friendly. They gave you the chance to relax and enjoy what your doing. It meant a lot as a customer.", "rating": 4}, {"title": "I need more information.", "text": "Date of experience: October 13, 2021", "rating": 4}, {"title": "Thanks for your help l like to talk to…", "text": "Thanks for your help l like to talk to my husband about this", "rating": 4}, {"title": "It is good  and I reily like it", "text": "It is good  and I reily like it Yahhb", "rating": 4}, {"title": "I was able to get coverage where no one…", "text": "I was able to get coverage where no one else would offer me anything.", "rating": 4}, {"title": "Better whole life insurance rates", "text": "Date of experience: October 09, 2021", "rating": 4}, {"title": "Cause I saw things I did not think…", "text": "Cause I saw things I did not think about on the survey", "rating": 4}, {"title": "Happy with my policy", "text": "Sign up was easy and easy to understand", "rating": 4}, {"title": "Stacy Luttrell", "text": "Simple and easy and was offered thru my CU", "rating": 4}, {"title": "Pleased with the Policy  I purchased…", "text": "Pleased with the Policy  I purchased and  Happy to know that my family won't have to worry about this when my time comes.", "rating": 4}]