[{"title": "2023 Colorado ZR2 sold", "text": "I recently sold my truck to Driveway.com and I am happy with the transaction. I quoted different rates with other online car selling sites and Driveway was the best. First time using driveway to sell my vehicle but the process was pretty smooth. I definitely recommend driveway.com and hopefully will be using again in the future. Thank you.", "rating": 4}, {"title": "It was a simple process and they made…", "text": "It was a simple process and they made it painless. Edward really helped getting everything together and he did a great job with everything for me the able to purchase this car ", "rating": 4}, {"title": "Almost 5 stars ", "text": "I would have given them 5 stars if not for the fact that I had to redo some paperwork making it take that much longer. Other than that, everyone’s been very professional, courteous and willing to help. I would definitely recommend them.", "rating": 4}, {"title": "Positive Car-Buying Experience with Room for Improvement", "text": "Overall, Driveway provided a great car-buying experience. I really appreciated their consistent communication throughout the entire process. However, I did encounter a couple of issues. First, even after making a down payment, the vehicle isn’t automatically held until all paperwork is completed and submitted, so you need to ask your representative to contact the dealership and request a hold on the vehicle.Another issue I’m facing is with the vehicle registration. I only have about two weeks left on my temporary tags. I’ve submitted all required information and have emailed a representative multiple times, requesting a status update or any steps I could take to expedite the process, but I have yet to receive a response.", "rating": 4}, {"title": "Purchasing selection", "text": "Purchasing selection, flexibility and support were excellent. Made a number of changes along the way and the Driveway representative was a true advocate. The only cautionary note is, high costs for shipping and uncertain delivery scheduling with multiple changes.", "rating": 4}, {"title": "Great customer service, not so great delivery quality", "text": "The responsiveness in all areas of customer support was great and everything was handled within a timely manner. However, the condition that the car arrived in was not what one would expect when purchasing a car. The car did not seem to be professionally cleaned prior to delivery (2 dead flies on the back dash, and there was dirt surrounding where a magnet was that the previous owner had), there was less than a quarter tank of gas in the car when it was delivered, and there were no bolts to attach the license plate to the car. ", "rating": 4}, {"title": "I felt everybody I spoke with was…", "text": "I felt everybody I spoke with was helpful and trying to make the experience easy. The only downfall is that the car came a day later than was scheduled for and we were not notified. I don’t believe this was the fault of the delivery driver as I am convinced he was communicating with somebody at the office, but I was not hearing back. Besides that everything was smooth and easy. ", "rating": 4}, {"title": "Good service with struggles occurring ", "text": "A lot of good communication at the beginning but once car was delivered, communication lacked for awhile  You can tell they don’t work with a lot of Washington customers or maybe they don’t check the Washington licensing rules oftenAfter more than a month of getting our car, we still couldn’t drive it because of not having our registration or new license plates sent to usAfter they heard I had issues with all my things, they reached personally to fix the issues and deliver my plates quicklyI am now able to drive my new car!", "rating": 4}, {"title": "Very pleased with the service!", "text": "Very easy process representatives responded in a timely manner. Jennifer came to inspect and test drive my vehicle. She was very professional and kind. She walked me through the entire inspection process. Shout out to Tyler also who assisted me over the internet.", "rating": 4}, {"title": "the whole process was very smooth and…", "text": "the whole process was very smooth and the pick up crew were very nice and explained each step of the process, Thank you Dallas hub guys! before they picked up the car, I call to find out how the payment worked, but the person at the answer desk had no idea, may want to train  the whole process to that team. ", "rating": 4}, {"title": "Overall, it was OK", "text": "Overall, my experience with Driveway (so far) was “Just OK”. Not great, not terrible. Definitely agree with the sentiment of most people here that communication between departments is lacking. MASSIVE shout out to Cheyenne, my delivery coordinator, for being the only person assigned to me that I could get a reply from. She was extremely helpful, prompt to reply, let me know when she was going to be out of office… 10/10 there. The other departments, especially contracting, could use some improvement in their communication. I reached out to my contracting agent several times for questions and never heard back. My car was delivered 4 days ago and I still haven’t received my retail contract. Online chat support was helpful in giving me updates and adding notes to my account, but couldn’t do more than ensure someone would follow up (and most of the time, they didn’t).The process was straightforward. Put in request for car, got approved, sent $500 deposit. Uploaded all of my documents (insurance, ID, etc.). Waited for overnighted paperwork that took 3 days to deliver. Got that notarized at UPS and sent it back. Wired the rest of the down payment, and then waited to hear back. Stay communicative to keep the ball rolling. You might not hear back, but patience is definitely key here. You wouldn’t buy a car online if you wanted it instantly. After a few days my contract was approved and delivery was scheduled. The car/delivery itself is also just OK. I didn’t live near any Lithia dealers, so a 3rd party delivery service brought it to me. They gave me a 10 minute heads up that they were about to be at my address, which is a little short notice but thankfully I was already home. About 10 minutes for them to take their pictures and inspect, sign the delivery confirmation on their phone, and done. Car had a few problems I’ve noticed so far. For reference, it’s a 2021 Civic with 39k miles. I’ll be taking it to get a PPI today and will update my review depending on that. No issues/accidents were listed on the listing/CARFAX. However, both key fobs were completely dead, and one of the physical keys won’t fit in the door. The skid plate under the car is partially hanging. It seems to pull left and has something rattling in the back. Additionally, one of the tires was significantly under-inflated, so I’m assuming a leak, and all but one of the valve stem caps on the tires were missing. Needs new wipers and it was pretty dirty too, but that’s an easy fix. Overall, an OK experience so far, and we’ll see how long it takes to get my plates/registration as I know that’s a later roadblock for lots of folks. Just try to stay in contact the best that you can, but expect some delays and have some patience. The agents have 2 days off a week that you might hear nothing, that’s normal. My time from request to delivery was 10/20 to 10/31, so only 11 days. ", "rating": 4}, {"title": "They did a good job", "text": "They did a good job.  After the offer was made they kept in communication.   Only suggestion I would have is to say up front they will be requiring a notarized signature on a duplicate title just in case the original goes missing.   Just helps you plan better.  ", "rating": 4}, {"title": "Definitely worth the headaches", "text": "Overall my experience with Driveway has been good. However there a few frustrating instances during this whole endeavor that kept me from giving that 5th star. Overall I dealt with about 4 different people throughout. I'm not going to name names or point fingers but 3 of them were absolutely stellar at their job. 1 was pretty good but was also misinformed on a few things. That created more than a few bumps in the road. However overall they were fine to deal with. I would definitely use Driveway again based on this experience. Even with the hiccups ultimately the end experience was worth the headaches. ", "rating": 4}, {"title": "Everything was great", "text": "Everything was great. Gave the best price for the vehicle. Third party pickup was delayed a couple times and on final pickup they just showed up out of the blue. Luckily I was just thirty minutes away, otherwise process was straight forward ", "rating": 4}, {"title": "Overall good experience", "text": "Everything went well buying the vehicle. You have to reserve it and then they send papers you have to notarize and send back. But over all pretty easy. I took off a star because from arriving at the local dealer to getting to my house took a week. It came from across country so I expected that trip to take time but not once it's at the dealership.", "rating": 4}, {"title": "Good follow-up (updated)", "text": "Car came unwashed with bird poop and pollen coating the vehicle, even the delivery driver remarked of the condition. The lack of a temporary tag included as well made for another headache. It's unfortunate because the first part of the process went smoothly. *** Updated - Driveway made it right which I can respect. Helpful follow-up that was swift and understanding. Thank you for making the process better, just wish the initial delivery had been a better experience and it appears it's a rare exception. Thank you again, love the car!!", "rating": 4}, {"title": "For the most part good experience!", "text": "The overall buying process was good and relatively seamless.   There were some hiccups with the title work that I would think would be done on the front end but ended up delaying to process for 3 weeks.  Communication was tough at times and when calling the main line to get an update I would be put off because the person I needed to speak with was unavailable.  It seems that there is too much segregation of information so the customer service department is unable to provide any useful information.  Besides my complaint about the communication they have been otherwise super helpful in the couple of instances where the truck needed repairs before delivery and after delivery within the 60 day window.I will definitely use this company again for future car purchases!", "rating": 4}, {"title": "Great followup to resolve an issue", "text": "There was some confusion regarding the registration of my Rav4. Once I brought it to Driveway's attention, Patrik was very helpful in figuring out what needed to be done and regularly following up until it was resolved. Thank you! ", "rating": 4}, {"title": "Performs as they say they will", "text": "Helpful, much better price for my car than from Carvana. A bit more work on sellers part, ( but worth it IMO). Payment very promptly.", "rating": 4}, {"title": "Funds Transfer Angst! Everyone was excellent and the process…", "text": "Everyone was excellent and the process went very smoothly until the very end. I was told my RTP would take minutes once the car was loaded and pictures were sent to the Drivetime contact person. I started to panic when my car was gone and no money was transferred into my account. I sent 2 emails & 3 texts to various contacts with whom I was dealing but no response. If someone could have responded that the payment was delayed for some reason, I would have understood. But no response from anyone resulted in some wasted angst. Up until the transfer of funds, everything was perfect.", "rating": 4}, {"title": "Everything went smoothly except for", "text": "Everything went smoothly from the initial setup to the delivery. The only problem I had was when delivered the car wouldn't start. We had to jump start it to get off the delivery truck. Both batteries had to be charged before it was usable. You would think the dealer would have checked the car over before it was sent.", "rating": 4}, {"title": "Everything went well much better than…", "text": "Everything went well much better than going to the dealership. Everyone was helpful and any issues or concerns they took care of it right away. ", "rating": 4}, {"title": "Seamless straight forward…", "text": "Seamless straight forward transaction..love the car. Customer service was goodJust a note: If your from NY buying a car check state regulations as states like CA does not provide a registration when you take delivery of your vehicle. I was stranded for 7 days without a vehicle to drive meanwhile I had a perfectly good vehicle sitting in my driveway! No registration! Couldn't move the vehicle!Other than that hiccup everything else went well...Thank you Driveway", "rating": 4}, {"title": "The process was seamless", "text": "The process was seamless. It's the first time making a major purchase like this basically sight unseen. Being able to look and compare prices without someone pressuring you is awesome. I believe I got the best price for a new vehicle possible. The only complaint I had was despite repeated requests for  pictures of the flaws on the vehicle, I never received any and found that the previous driver had a dog that scratched the paint on the rear drivers side door and little effort was made to remove the hair and stains it left in the inside. Otherwise, I am satisfied with the process, thanks Kassandra and Jessica. ", "rating": 4}, {"title": "I got my car fast", "text": "I got my car fast. It only takes 3days to get my car when everything done on-line. Only complaint is communication manager from driveway told me if I can pick up the car from the dealership is will be faster way to get the car. I have to request day off from work to drive from Napa, California to pick up my car in San Francisco. Then a guy from dealer call me that the car is here delivering to me at home in Napa. But I am already arrived at dealership in SF!  end up I have to wait for my car and it takes more time for me to wait at the dealer ship.I wish the company improved the way to communicate better. ", "rating": 4}, {"title": "Very nice staff take a little time but…", "text": "Very nice staff take a little time but holiday had something do with it but they a very very nice people to help you 👍👍👍", "rating": 4}, {"title": "Good at Start, Need to Follow Through", "text": "Things started out well, with the team responding quickly and efficiently to my questions about the vehicle.  Once I took possession of the vehicle for the 7-day trial period, they did not adequately respond to my information requests.  Also, there was a significant blemish on the vehicle that I felt should have been hilited in the photos, similar to what I have seen other online car retailers post.  In the end, I got a great vehicle at a really good price.  Just wish the customer follow up would have been solid from start to finish.Amended.  I initially rated Driveway 3 stars, but have amended it to 4 stars based on the follow up care I got after I submitted my review.", "rating": 4}, {"title": "Feedback: Good + Improvements", "text": "What was done well:Quick response when I first submitted my request to purchaseNice to speak to humans!At first, nice to know I have a case agent (see improvements below)Customer service agents always pleasantAltogether a good experience, bought 3 other cars from Carvana before this one.Opportunities for Improvement:Upfront, explain that customers will be talking to first agent, then contracting dept, then logisticsI was contacted by more than one agent in one dept sometimes, seems one agent doesn't stay on the case.Seems Logistics team's notes did not always sync with my instructions - I was out of state and could not receive the car until I returned, but agent tried to get me to offer options to leave keys somewhere, without me being present. Finally, I got all on the same page.", "rating": 4}, {"title": "Everything was easy and smooth until it…", "text": "Everything was easy and smooth until it was time to register the car. Then all communication stopped and I was told for the first time that I was not able to receive a temp tag for possibly 27 weeks! That was never mentioned in ANY of the conversations prior to receiving the vehicle.", "rating": 4}, {"title": "Good car, poor communication", "text": "Process was smooth and car was great, but communication was poor after receipt of car. Don’t know where I was in the process and didn’t get replies to emails regarding car registration status. After posting this review, the team followed up with me and provided status updates each day. I would definitely use Driveway again and each representative was great to deal with. However, there should be a status page with details about next steps, or improved communications. ", "rating": 4}, {"title": "i will sell here again ", "text": "agent called me right away - quick & easy about a day later another agent assisted me - quick & easy , sent the paperwork off on friday got it tuesdaysent the paperwork back they received it the next business day available , processed them , took them about a week to get me a driver got a pickup scheduled - driver never showed up , lack of communication on their end , i had to call every few hours just to get an ETA but the agents were nice & i understood it was the drivers fault got a message this morning , a driver reached out to me about 40 mins ago said he could pick it up in 20 mins & he did , payment was initiated 5 mins later (this just happened today (lol)", "rating": 4}, {"title": "I initiated the purchase process on…", "text": "I initiated the purchase process on 9/23 and received my car on 10/10. It's true you get bumped to a new \"specialist\" at every turn and step of the way, but at least everyone on my team was fast acting and responsive. I felt everything went smoothly EXCEPT for the actual delivery, which I believe could be improved on as an overall process:  1. The first driver missed the originally scheduled pickup. I wasn't informed of this until the day before delivery was supposed to occur. I could have been informed the day after it was missed.  2. I received an email when the vehicle was picked up stating my delivery date and time of 9am. I stayed home from work. 9am came and went and I called driveway and was told \"the system\" sends random times. Isn't that something you can just remove from your automation and/or repair?  3. Asking for a more specific time frame was impossible because of how many departments between Driveway and the shipper needed telephoned through for any information. Ultimately the driver didn't arrive until 8:30 pm. The policy of them calling you when they are 1-3 hours away is also too narrow of a time frame - not everyone has a job they can just run off from at a moment's notice and go home to receive a vehicle. If I had better communication throughout the day, I could've gone to work and not waited all day and evening.   Anyway, delivery issues aside, the vehicle is in good condition, and the dealership sent me photos of some paint damage before I committed to purchasing it, which I appreciated the integrity there. The damage is insignificant, especially after a detail, and I find Lithia to be a reputable dealer. I'd do it again, but I'd still be prepared for another delivery headache. ", "rating": 4}, {"title": "Got a new car at a good price", "text": "I had a mostly positive experience with Driveway. I purchased a 2020 Toyota Camry LE at a price that was better than anything I was able to find on similar platforms like Carvana. There was a delay in when the car was supposed to initially be delivered to me but Driveway always kept me updated each step of the way. The car finally arrived and was just as described. This was my first time ever buying a car online and I must say that overall the process was fairly easy. I am very satisfied with my purchase.", "rating": 4}, {"title": "Would sell th driveway again", "text": "Was skeptical of selling on line but there were 1100 dollers above carmax and 100 dollers below carvana so we went with driveway. Every one along the way was very helpful and was willing to handle every question we had. The only negative I can see is the process took 13 days and the driver came from New York. I live I  illinois.", "rating": 4}, {"title": "Communication and scheduling ", "text": "I loved always having a contact. Texting was very convenient. It would have helped to have a list of steps and the anticipated length of time each would take along with scheduling options so that I didn't feel pressured to drop everything every time I received a call.", "rating": 4}, {"title": "Good process just lost me when the…", "text": "Good process just lost me when the final deal went down I was kinda lost on when the payment would be submitted and kinda got the run around and couldn't get a true response on where payment was at but someone did get back with me and payment was made. Wasn't a deal breaker but was just a lil concern. ", "rating": 4}, {"title": "Contract Team", "text": "My sales woman Ms. Angie B was the best part of my sale. Everything after that went down hill. I did not receive the car for over 2 weeks due to me getting the wrong link to pay the downpayment. I had to wait 10 full business days to receive a refund from the lien holder whom received my downpayment by mistake, due to me getting the wrong 😑 link from the contracting department. There should be options to pay the downpayment other than a debit card. I received information for wire after the mistake. ", "rating": 4}, {"title": "Overall experience was GREAT !!", "text": "Overall experience was GREAT !!Few improvement suggestions: Stop using cell phone numbers to communicate with customers. All of my communications were through text messages. This makes it harder to trust/verify the business. I was also asked for sensitive information like last 4 SSN visa texts. It doesn’t look and feel right. Otherwise, Rose, Matt and Richard were great to have worked with.", "rating": 4}, {"title": "Process was pretty slow and cumbersome…", "text": "Process was pretty slow and cumbersome at times and could be streamlined. Communication wasn’t as smooth as it should have been. Eventually everything worked out well . ", "rating": 4}, {"title": "Selling my car was easy and they paid top dollar", "text": "Selling my car was easy with Driveway and they offered far more than a leading competitor who made me bring the car to them to get an appraisal, took hours to do so, then offered me over $3,000 less than Driveway’s offer than I got in five minutes online. I didn’t like having to wait five days after they picked the car up to get the check for it though. That payment should’ve been overnighted with tracking info like all the other paperwork was during the process.", "rating": 4}, {"title": "Working with driveway is always good", "text": "Working with driveway is always good, have done the process about 5 time and I keep coming back because of the experience. It would be nice if that could be taken for consideration as returning customer, but the syste does not show that. Transportation could be cheaper, and other fees, 1800 dollars for cross country delivery on a company that ships multiple vehicles is too much, is understandable if they are only shipping 1 car every few months, but I know a major company as Drive is shipping multiple vehicles at the same time.Florida 1200 fee with no brakedown or what is the fee for is too much, and hard to understand.Due to the way the company is set up, trying to do the paperwork was a little challenging. I had people calling from Florida, Texas, and Oregon in different time zones was challenging. I did notice Driveway does not provide Veteran discounts. It could be nice the one of the biggest car companies to offer something to military service members.", "rating": 4}, {"title": "Satisfied Overall", "text": "Process was a bit more difficult than I expected. However, they did follow up with me and corrected the situation. ", "rating": 4}, {"title": "Driveway Used Car", "text": "Everything was smooth and the process was easy. Why it’s not 5 is because of a few things: Delivery time and detailing issues.I received my car, understanding it was used, it smelled like someone had smoked in it before. Granted, they provided a history of the car and what it was used for prior to. Knowing it was a fleet vehicle that had an accident, I kinda knew what to expect but nothing else was mentioned other than the repair and the accident. Steering wheel has a worn joint or bearing, making a slight scraping sound when turning the wheel. Used a refresher for the interior to hopefully get rid of the smell and it did, but I know the upholstery will need to get cleaned as well.In addition, the wheel alignment was not done properly or properly inspected. After driving a couple of miles, the steering wheel would slightly jitter as I’m driving, especially on a straight road.Delivery time. Timeframe was given for an hour. Waited at my residence before the time of delivery just to get it almost 30 mins after the timeframe. Although 30 mins is pretty short, it defeats the purpose of the time slot window to deliver the car.Otherwise, pretty simple and easy process. Would recommend if you’re considering other car buying options aside from Carvana, True Car, and others. If anything just be cautious with the used car inventory and thoroughly check the info as the buyer.", "rating": 4}, {"title": "Communication was mostly done through…", "text": "Communication was mostly done through texts and emails.  Sometimes hard to get a real person to talk to.  I'm 62, so still like to actually talk.  Something you might consider for us older customers. Didn't like the pickup happening on Sunday.  Otherwise not a bad experience.", "rating": 4}, {"title": "Updated my review", "text": "Updated my review. Driveway has made a concerted effort to correct the issues we had previously. Contact personnel could probably use some instruction on how to deal with non-profit buyers (Maybe have a non-profit specialist or two in the office.) to streamline some of the paperwork. Not all buyers are the same, so be flexible. Work with the buyer rather than the Driveway \"playbook.\" Improvements greatly appreciated.", "rating": 4}, {"title": "I thought buying a car online would be easy", "text": "I thought buying a car online would be easy, but it's NOT. I appreciate the depth of security, but it is not an easy process. My initial rep went ghost on me after dropping the down payment, the efforts to contact someone with so many steps involved gave me a bad taste. I also expected that my car would be delivered on a truck, not by a guy with big boots that left marks on the drivers side bay and probably drove it like a getaway car.  That burnt me out. The registration and plates is a nightmare experience if buying out of state, and they charge and hold your registration for up to 60 days.  ", "rating": 4}, {"title": "Prices are very competitive", "text": "Prices are very competitive.  Staff and staff assistance are great.  The only lacking point is that payment can be very difficult.  Driveway was very nice to allow a check to be cut for me to receive when i dropped off the car; however, it was only achieved due to staff willing to go up line to management.  There should be a simpler solution for those of us who live in remote areas - like requiring bonded third-party pickup agents to carry a check.", "rating": 4}, {"title": "Choosing a car is simple with driveway", "text": "Choosing a car is simple with driveway. But don’t expect customer service like your typical dealership. Everything is online and you require notary for certain documents. There’s a number  of different people that you deal with during the buying process.  And emailing them doesn’t always get results. But overall I would definitely recommend them. ", "rating": 4}, {"title": "Everything about went well with the…", "text": "Everything about went well with the exception of an address typo on the first set of dox that were overnighted to me.  Replacement sent, received, notarized a second time, and returned.  Another set of eyes on those important dox to ensure that all information is correct would eliminate these types of issues and a delay.  Other than that, all went well.", "rating": 4}, {"title": "Good team, but lack of handoff", "text": "The process worked and I was able to get the vehicle I was interested in, even with the massive computer outages.  All the staff were friendly and helpful.  Why not 5 stars?  Lack of handoff.  One person would be done with their part, and another driveway person would take over.  Since we're texting and calling, it would have been helpful for the person to message something like \"I'm now handing you off to 'name' for the next step\", rather than getting radio silence and then someone new reaching out.", "rating": 4}, {"title": "The process of finding my vehicle was…", "text": "The process of finding my vehicle was easy. The time that it took to get the car delivered was somewhat frustrating and the paperwork/registration process is lengthy. I had to ask to get a 2nd temporary tag after getting notice that it was submitted to a local DMV, not knowing if that meant my local DMV or where the vehicle came from. It has now been over a month (it's now July 18th) and I still have no idea as to the status of my paperwork. This process and the communication could improve.", "rating": 4}, {"title": "Overall good, despite a some duds on my \"team\"", "text": "Most of the people at driveway were great, but my \"main point of contact\" Trinity stopped  returning any  calls or messages about two weeks ago. Same with the person in charge of my paperwork, Maria Johnson, I sent her 10 emails and got one reply, and then none despite me begging her for updates. I honestly started to wonder if these people were in some sort of accident? The amount of people who text you from different numbers can sometimes be confusing.However, if you have questions, the folks at the main number are always extremely happy to help, and very nice, helpful and capable. Despite those two people on my \"team\", the rest of the people on my team, especially the delivery coordinator Noemi, was wonderful, and so helpful. The car arrived yesterday, and is great! It took awhile from buying the car to get it, but so far seems to be worth the wait! It's just as described and drives great. Taking it to a mechanic today before the 7-day return window closes, but honestly it's  great! I did receive a concerning letter from my unsurance about the VIN being incorrect, and someone did reach out to attempt to solve this. Hopefully all goes smooth. ", "rating": 4}, {"title": "TRUST", "text": "TRUST. Doing a transaction with driveway online for the first time that I knew nothing about them and was afraid but driveway delivered my vehicle just as I saw it on their site. Driveway has earned my trust and I will do all I can to recommend Driveway to friends and family. Driveway is the best.", "rating": 4}, {"title": "Good experience purchasing a quality…", "text": "Good experience purchasing a quality vehicle at a fair price, however getting the run around getting the vehicle registered and receiving plates. Driveway says it is the responsibility of the local dealership, the dealership says it is driveways responsibility. Bottom line is six weeks went by with no registration. Update: Driveway successfully registered my vehicle through the local dealership. It took a little longer than it should have, but I have to say overall the experience with Driveway was quick and easy, with a little hiccup involving registration. I would use their purchasing service again in the future, over going to a dealership in person. ", "rating": 4}, {"title": "Better experience than anticipated", "text": "Transaction was smooth, communication was there with all the reps I spoke with. Though I wish they delivered the car via a delivery truck instead of driving it to my residence which is the only downside. Unfortunately the car I purchased has issues with it and will look to return within the 7-Day time period. Overall though, would recommend this to a friend or colleague.", "rating": 4}, {"title": "Overall went well", "text": "Overall went well; confusion with so many different people to deal with. Being online there was skepticism with the revolving contacts and locations.  In the end it all worked out. Rating a 4 out of 5 is more about my inexperience in selling a car online than Driveway.com.  ", "rating": 4}, {"title": "Don't rely on the Carfax report ", "text": "We love the concept of Driveway and we will most likely use them again. Our experience is that structural damage was not disclosed and prior to purchasing the vehicle, it was difficult to identify the sratches, scuffs and dents based on the pics. The Carfax report is only as reliable as the person reporting.In the future, we will make a personal call to the dealership to inquire if there is any structural damage or rust etc...Although it will cost us to fix the cosmetics of our vehicle, we are grateful for Sara from Driveway advocating on our behalf.In the future, Driveway should emphasize disclosures of any and all defects, so there are no surprises upon delivery.", "rating": 4}, {"title": "Parker from Driveway was able to solve some issues.", "text": "I initially rated this 3 stars but I changed it to 4 stars after being contacted by Parker from Driveway. He was able to clear up some the issues I had and reimburse the fee for the vehicle that was supposed to be delivered. I appreciated him working with me and reaching out quickly to make the experience better.", "rating": 4}, {"title": "Driveway was very good about staying in…", "text": "Driveway was very good about staying in contact with me via text, email, and phone calls as the process moved along. Doing things online sight unseen made me nervous but they were very reassuring, and patient with walking me through how to download documents.", "rating": 4}, {"title": "Got the car I wanted", "text": "Got the car I wanted, but paid more as my initial offer sheet I signed was missed.  I had to go for the same model at a higher price.  Also, communication could have been better.   They would ask you for documents, you'd send them and the no acknowledgement they received them.", "rating": 4}, {"title": "The little things ", "text": "It went smooth and the car was shipped to my location fast. Communication was decent. I would just prep the vehicle better before delivery like take it through the car wash maybe take the yellow mark off the back bumper and pop the bumper into place before delivery. Scuff on the front bumper or dent on the driver door. Maybe find a driver floor mat 😆 you are a car dealer.  My car came with every floor mat but the drivers. A front license plate bracket. It’s just attention to detail and thinking as if you just purchased this vehicle. ", "rating": 4}, {"title": "Best quote and communication ", "text": "Best quote! Great communication! Packet that is mailed could have a checklist of what to mail back.  Also, having to wait for the hard copies to be mailed and having to mail back was inconvenient.  Carvana doesn’t do this. ", "rating": 4}, {"title": "The drivers that picked up the car very…", "text": "The drivers that picked up the car very prompt polite and professional and on time.The paperwork process leaved a lot to be desired.  Had all he paperwork in for one sale the Friday before Memorial day but the deal expired on that Monday anyway.  Had to start all over again.", "rating": 4}, {"title": "Great company with lithia", "text": "Our agent Chris made it very easy for us to get the car we wanted at a very low and affordable cost. We got a 2024 Hyundai Elantra SEL and Chris helped us get to every point we needed to even lowering our rate by nearly 50 dollars. Very good customer service rep. Had a little issue getting a hold of certain departments but the car arrived 2 days early and the loan and tags will arrive 2 months after the car. Very happy with this purchase and will recommend to a friend. Highly recommend staying in touch every day/ other day in order to fully stay in the loop.", "rating": 4}, {"title": "The contact and guidance throughout the…", "text": "The contact and guidance throughout the experience was very reassuring. Each step if the purchase and delivery had a communicative specialist that walk us through the process. Car itself was represented fairly. End local delivery was somewhat out of Driveways hand and could have had better touch points. I have seen reviews on here about timeliness of title transfer. Too soon for me to comment on that and my thoughts on this is that states often don't work well between themselves. Fingers crossed on that. I live in a western state and encourage others to do diligence researching a vehicle but, I did save money even after shipping ", "rating": 4}, {"title": "The only thing I'm disappointed about…", "text": "The only thing I'm disappointed about is I wish I could have gotten a better offer since the vehicle was still in perfect condition and well maintained. But the service and the people were great you guys made it pretty easy to sell my car.", "rating": 4}, {"title": "The transaction was pretty straightforward", "text": "The transaction was pretty straightforward. However, I had some issues receiving payment. The link to the payment center didn't work for me. Not a big deal--they sent a form for ACH, but I had difficulty emailing it back. Tried twice and neither time did it go through. Someone from Driveway did reach out to me at that point and we worked out a way to get them the form. After that, payment came through immediately.", "rating": 4}, {"title": "Good buying experience", "text": "Good buying experience, definitely better than sitting in a dealership for 4 hours. Only complaint is I had like 6 different people texting me and calling me throughout the process. Need 1 account manager that is your point of contact through the whole process.", "rating": 4}, {"title": "My only issue with selling the car was…", "text": "My only issue with selling the car was the picture app is very sensitive to damage. It picked up on my dirty floor mats and marked interior damage so brought down the pricing. ", "rating": 4}, {"title": "My car was delivered Thursday", "text": "I am updating my review as Sarah from Driveway has met my expectations following the purchase of my car.  A couple of items needed attention and she has looked into them and made them right.  I would recommend Driveway and especially Sarah.", "rating": 4}, {"title": "Got a car after it took forever", "text": "We were able to get our car in a timely manner. Unfortunately we were not able to get the car we initially had wanted. However we were able to have a salesperson work with us and find us a car that had a very similar down payment to one we had already made so that we were able to get a car that was similar to what we wanted originally. Randy says what time do you want to start", "rating": 4}, {"title": "I really enjoyed purchasing my vehicle…", "text": "I really enjoyed purchasing my vehicle from Driveway. There was one hiccup in the beginning where the vehicle that I originally wanted after I put my down payment; they told me that it was no longer available. However, they worked quickly to find another vehicle that fit my needs and wants and within my budget, I am 100% satisfied with this vehicle and I would highly recommend Driveway. From start to finish the process took about two weeks!", "rating": 4}, {"title": "Our 1st car online purchase experience…", "text": "Our 1st car online purchase experience with Driveway was good! The employees were responsive at times and provide good service. The paperwork requirements were streamlined all done online and Fedex mail. Just didnt like that paperwork needed to be notarized and i had to pay for it. Receiving the car was couple days early than expected. Only thing i didnt like was they drove the car from pleasanton to our house, thought it will be on a tow truck and car was not thoroughly clean, very dusty/dirty. Also, was not informed that the license plate will be delayed. I had to inquire about it because the car came without it and the guy who dropped it off didnt know anything other than ‘oh i only drop off cars and that’s it.’ Also, the guy from the dealership didnt tell us about the blue link, that we get 3mos free membership etc. i had to call and ask about it.Overall experience was good, just minor things. Thanks!", "rating": 4}, {"title": "Great experience just had issues with one person", "text": "I had a pretty good buying experience. Reserved the cars on a Thursday, signed documents on Friday, and the car was delivered within 10 days  from original reservation. I'm loving the car and its everything that I wanted at a great price. Everyone that I worked with were super helpful and accommodating except for one person. My one negative experience was with W.R. from contracting. He wasn't very professional in his communication in my opinion. He stated that we was going to sign and send a form that same day that  the bank needed but he never did it. I had to call in and someone else , who was extremely helpful, had to fill out the form to preventing delaying the process. Another issue was that he failed to get my plates transferred like I asked. I called about it and someone else was able to explain the situation and we came up with a  solution where I would be reimbursed once I did the transfer at the DMV myself. Overall I had a great experience and would buy and recommend them. I would just say to switch to someone else is W.R. is your contracting guy.  ", "rating": 4}, {"title": "There is an inspection upon pickup!", "text": "Overall good experience and quick responses.  Issue during pickup and they didn't say they do a test drive and inspection.  If they find an issue they offer you less.  If you get it fixed they honor the offer.  I think this is not as clearly documented as it should be.  ", "rating": 4}, {"title": "Everything was great except that it…", "text": "Everything was great except that it took a really long time from start to finish. If you have a lien on your title, even if the car is paid off, it's a huge pain because they request a title lien release that has to be notarized by the company you bought your car through. Waited about 5 weeks before they came and picked up my car. ", "rating": 4}, {"title": "Buying the vehicle was a smooth and…", "text": "Buying the vehicle was a smooth and easy experience.  The only negative aspects were that the vehicle was equipped with only 1 key and no charging cable.  On a vehicle with less than 3,000 miles ", "rating": 4}, {"title": "Started bad…Ended good", "text": "Initially the experience was not good. On a Tuesday I agreed to a formal proposal including my $500 deposit. The following Saturday I got online with Driveway in their chat room and asked the representative if he could give me a rough idea as to when my vehicle would be delivered. After about a 5 minute wait he responded informing me that my vehicle had been sold at the dealership. Obviously I was very disappointed. My biggest complaint regarding this situation was…At what point was I going to be informed that the vehicle I was waiting for had already been sold?However, the same day I was connected to a Driveway supervisor (Sorry I forgot her name). She worked diligently to find me another vehicle pretty much identical to the one I lost. From that point on all Driveway personnel were very responsive and worked hard to complete our deal. The vehicle was delivered 10 days after I lost the one one I originally agreed upon. So all in all, the experience turned out to be good.", "rating": 4}, {"title": "I’ve purchased two cars with driveway", "text": "**EDIT**I moved the score up one star as I was contacted after my first review by a representative who helped me resolve some communication issues and he stuck with me through the entire process. I am sure buying just one car is a bit easier to keep track of than two. We are very happy with our cars.I’ve purchased two cars with driveway. In the beginning, the customer service was great and everything seemed to go very quickly. Once my check was sent in and the paperwork was signed, communication just seemed to drop. My first car was delivered without warning or notice from the delivery company. Good thing I was there to sign for it. I was told to expect my second car today. After waiting around and two more calls, I find out that it’s delayed three more days. No heads up. All communication is done through text by many different people so following up with one person is difficult. I still have the titling and license plate process to wade through. Other revieeers say that takes a long time.", "rating": 4}, {"title": " Driveway offered $3k more than Carmax", "text": "It was easy and Driveway offered me $3k more than Carmax. I was disappointed they took the car and I had to wait five days for them to pay me though. Where else would the buyer expect to take possession without paying for a car? ", "rating": 4}, {"title": "Great experience and communication was great", "text": "Start with the issue with tags.  CA to MT the tag for new vehicle was a bit of a hassle dealership helped me out though. Other than that it was pretty painless.  There are some anxiety not knowing what your getting without test driving but couldn’t be more impressed with the outcome.  They give a 7 day test period to make sure it’s a fit as well.  Saved money buying from driveway than dealerships and other sites.   There was constant contact throughout the process and everyone was helpful.", "rating": 4}, {"title": "The whole experience was simple and…", "text": "The whole experience was simple and easy! At the beginning everyone I interacted with was responsive and friendly. Towards the end whoever took ever would not even respond back to me at all. Otherwise, it was quick, easy, and offered me the best price for my vehicle. Would recommend! ", "rating": 4}, {"title": "Easier than I expected", "text": "Easier than I expected. Everyone was very helpful. Christina and Diane have been particularly helpful. Truck is great so far. Issues I have had, truck smells  like cigarettes, cannot smell online. Working on that. The secondary website they use for identification would not accept photo of front if my drivers license. Took 30-40 tries, was annoying. Finally they do not send you the title until AFTER the 7 day return period. Makes sense but I don’t recall that being mentioned. I tried to register the truck on an off day but couldn’t because I did not have the  title. Overall better than expected, smooth with couple bumps along the way.", "rating": 4}, {"title": "Company is legitimate. I bought a truck. I got a truck", "text": "I was a little hesitant to use Driveway.com until I did some research and discovered the company is owned by Lithia. The purchasing process was easy and low pressure. On the first truck I put a deposit on I asked for pictures of the under carriage because I was worried about potential rust as it was located in New Jersey. They sent thorough pictures and my fears were confirmed. Far more rust than I was comfortable with. I backed out and Driveway cancelled the purchase, no questions asked. The second truck I also asked for pictures and all looked good. I'm officially the owner of a damn near spotless 2017 Tundra with low miles. The only reason I didn't give Driveway 5 stars is because there were some logistical mixups getting me paperwork to sign that slowed the process down by 8 days. The Driveway team seemed to prefer text messages but were often slow to respond and occasionally didn't reply at all requiring me to call into their office. Other than that this was a really positive experience and I wouldn't hesitate to buy my next car from Driveway.", "rating": 4}, {"title": "Slightly better than a dealership", "text": "UPDATE BELOW The buying side was easy. Communication was good at first. Taxes were wrong. They did tell me I would not receive a temporary tag due to NC rules, but that if I received a ticket they would take care of it, but then sent me paperwork that said they were not responsible. Typical car sales talk that I was trying to avoid. But overall, it has been smooth. Transport is a 1 star. Transport never called me for arrangements. I received a text 330pm the day before saying Driver will be there at 8am tomorrow. Umm, I work. So on delivery they did this. I complained, so on pick up of my vehicle a week later, they did the EXACT same thing. Both times I had to scramble to take care of it which was not convenient as I was out of town for work. I told driveway ahead of time and they assured me Transport would call in advanced. Also the car was delivered dirty inside and less than half tank gas. I called dealership directly and complained. Supposedly sending me a check for $150. I have not seen it yet. Patrick a customer service rep did reach out and sent me tracking for the check which I did receive and he was able to get a temp tag for me. So not a terrible experience, just know it will take longer than you'd expect. ", "rating": 4}, {"title": "Dealing with this company has exceeded my expectations.", "text": "Dealing with this company has been a very positive experience. I received regular emails, text messages and phone calls keeping me in the loop of each and every step taken to complete the purchase of my vehicle. The purchasing and delivery only took a couple of weeks to complete. All the associates were very kind and helpful when I had questions. I would definitely buy another vehicle from them again. To top it off I found exactly what I was looking for and in my budget. Thank you Driveway for the positive experience.", "rating": 4}, {"title": "overall a good experience.", "text": "The transaction went smoothly.  I was concerned about shipping my title off and still having the car in my \"possession\", but that all worked out in the end.  I was shocked to get an email several days AFTER the transaction had been completed from Driveway.com claiming that I had not sent my paperwork in.  Yet, I had sent my paperwork in, the car had been inspected, taken away and paid for.  All was wonderful. Then I got that strange email.  I replied to that strange email asking for more details (exactly what paperwork was missing?) and explaining that the transaction had been completed.  I never heard back after that.  That strange email made me wonder, did my paperwork get lost on someone's desk?  etc.  It really hurt my driveway.com experience.   ", "rating": 4}, {"title": "My experience was great. ", "text": "My experience with Driveway was overall great. The process was straight forward and it made selling my car easy. The one thing that was of concern to me was the pickup company did not pickup on the day that Driveway told me they would. Otherwise, the process of communication and payment was very good. ", "rating": 4}, {"title": "Customer service was very good all the…", "text": "Customer service was very good all the way through.  Might want to review the final step, which is delivery of the vehicle.  Vehicle sat at the pre-delivery for several days.", "rating": 4}, {"title": "I was leary at first", "text": "I was leary at first, but as the process went on it was pretty straight forward. I would certainly do it again. My situation was a litte rushed as I bought the truck 2 days before I was going out of town. They sent the documents to where I was going, but they didn't arrive until after I left for home. There was another set in the mail the day after I got home. Just waiting on the tags now", "rating": 4}, {"title": "I like em", "text": "Driveway was very competitive with pricing when it came to selling my car. They however needed time to get the car processed and picked up. It took about a week and a half for paperwork, e-signatures and for a tow truck to pick up the vehicle. The process of paperwork was pretty simple and the car pickup was quick when they arrived. All in all I’m happy with their service. Just wished they moved quicker with the process.", "rating": 4}, {"title": "Communication was excellent with your company.", "text": "Communication with your staff was great. Price paid for my car was the best of the online companies. A bit unnerving to hand over title and car and not having the money in the bank. Check did clear a week later. My two local banks did not have access to your fund transfer option. Driver who picked up car showed up unannounced while I was an hour away. He also didn't speak English.", "rating": 4}, {"title": "The experience all around wasn’t bad", "text": "The experience all around wasn’t bad, but some hiccups. First car I chose I gave a down payment and all but seems Driveway employee did not verify if that car was still available turns out it was not so I had to look for another car, needing 3 pages notarized costed $45 that came out of my pocket, communication during the delivery process was lack luster with not eta provided was always “I will update you” and never did I had to keep checking in. Turn around was a little over 2 weeks when I finally did get the car it was empty gas wise which was disappointing. Being that it was a out of state car now I need a vin verification and a smog done this was never mentioned to me so it’s definitely becoming a long process that isn’t as simple as just online shopping for a car is said to be. But I would still say it was an ok experience ", "rating": 4}, {"title": "The process was really good overall", "text": "The process was really good overall, the only reason for 4 stars is because i think it would be easier to only have one overall contact for the process, from ordering to delivery. Dealing with multiple people adds a lot of confusion on the buyers part.", "rating": 4}, {"title": "Communication was good", "text": "Communication was good. Got paid on time. The only thing you should improve on is your phone numbers… some come out as scam. And getting phone calls from different numbers each time seems suspicious… ", "rating": 4}, {"title": "I received a good price for my car", "text": "I received a good price for my car.  Easy to follow the process.  The only negative is that it takes time.  It was about 3 weeks from receiving the offer to completing the deal.  Otherwise, it was a wonderful experience.", "rating": 4}, {"title": "Being a first timer to this way of…", "text": "Being a first timer to this way of selling a vehicle, I was mostly impressed of the streamlined processes. From the beginning, I was reached out to, explained to and followed up with. This made me feel confident that I had made the right decision. I was truly impressed with the whole process from beginning to end. The reason I didn’t give it 5 starts was because of the hand off process. I feel that’s where you want it most. Not knowing who would pick up my car and then when I realized who, I had to verify, left me feeling unsure. Although the end result was successful, there was a few moments where it was shakey. But allIn all, a fairly smooth process ", "rating": 4}, {"title": "The Unsatisfied part first !!", "text": "The Unsatisfied first, The Registration (Tag/Tittle) was very frustrating, No one would/could answer my 3 emails or my 5 text messages !!?!! Now on to the Good, I love my car, great deal and easy to work with. I traded my car and got a new car, my experience with this part was great, I worked with Monica and Amanda, both were awesome people, they were very helpful and also respectful they responded quickly and had the answers I was seeking. Brett was my DMV contact the only reason I know this is because he did send me one email which stated he/she would keep me posted on the process which Never Happened even after me reaching out SEVERAL TIMES Via Message and Email. Overall I am very happy with my Trade experience and my new vehicle !!  Byron Loveless.", "rating": 4}, {"title": "I didn’t come out with vehicle and…", "text": "I didn’t come out with vehicle and that’s due to personal finance reasons. But if all was aligned well I would have continued with the vehicle. With all the conversations I had with reps I have not had a bad experience. They’re very knowledgeable in their field and again if everything was aligned I would have been buying more than 1 vehicle. But I appreciate the staff, keep doing what you’re doing!", "rating": 4}, {"title": "It was a fairly quick process to get my…", "text": "It was a fairly quick process to get my vehicle. No real issues at all. It was just a little odd that I never talked to the same person twice. Other than the delivery coordinator, he kept in touch until my car was delivered. Other than that it was a smooth process. Delivery was strange, the man didn’t speak very good English, but he was kind and quick. I would definitely consider purchasing from them again. ", "rating": 4}, {"title": "Great communication, quick service!", "text": "The associates I worked with had amazing customer service and communication. Any questions I had were answered as quickly as possible. Everyone made sure I understood every step and made the whole process a breeze. My car actually arrived a few days earlier than I expected and on a holiday weekend at that. I didn’t hear any communications during the 7 day trial period. Personally I would’ve appreciated a “how are things going? Are you satisfied with the purchase?” And more communication about next steps after the car arrived. But that is not enough for me to take away from how smoothly everything else went for me. I’ve already told my friends about how upfront, honest, and efficient my car buying experience was with Driveway. I’d definitely buy with them in the future.", "rating": 4}, {"title": "Price was fair", "text": "Price was fair. Process was clunky getting started with your app. and paperwork had to be sent twice because of error in spelling of my wife's name.  But pick up was a breeze. Richard K, and his companion (nice guy dark skin and dreads) were both great..super friendly and efficient ", "rating": 4}, {"title": "Not a speedy process but once you get…", "text": "Not a speedy process but once you get the ball rolling it goes by quick. Easy communication through text, email and phone if needed. Everybody I spoke with was incredibly helpful. ", "rating": 4}, {"title": "Fast transaction and mostly without issue...…", "text": "Our transaction was fast and mostly trouble free. There were a few things that could have gone smoother. #1. Knowing further ahead of time that a notary would be required for some of the paperwork would have allowed us to plan ahead for that and complete the packet sooner. #2. A better explanation of how we would be able to procure plates since temp plates were not an option would have been helpful. This precluded us from driving the car for almost all of the 7 day return period.#3. I realized after we the 7 days that the car had been shipped with one tire that didn't match the other 3. This is a fairly big issue with an AWD vehicle because now tire shops won't rotate, or replace the odd tire because it won't have the same wear as the other three. Our only option is to deal with it ourselves or buy a full set of new tires. I intend to take this up with Driveway and/or Lithia where the car came from.", "rating": 4}, {"title": "Delivery option is amazing and great…", "text": "Delivery option is amazing and great service. I live hours away from all but one brand of dealership and didn't have a trade-in, so having a delivery option was a godsend, and being able to browse online until I found the deal I wanted was also great. Everyone I dealt with at Driveway was courteous and helpful, and overall they've got the system pretty well streamlined. But it was hard to get an overview of the entire process -- I got handed off to a new person at each step and never really had an idea of how long it would take to get my car until we were several steps in. And when we got close to delivery, a crucial step (the transporter calling me before they put the car on their truck for delivery) was skipped and I had to juggle a work trip at the last minute to be available for delivery. I love love love my car and my overall experience was really positive -- without that hiccup and with a better up-front overview of the process, I could easily have given five stars.", "rating": 4}, {"title": "I love my new car and the process was interesting:", "text": "I love my new car and any very happy with it.  About my experience with Driveway:First, be prepared to speak/text/email with at least 5 different people/departments.  They were nice but not always quick to respond.  Also, the CDK Global software glitch happened in the middle of this which slowed the process down.  Second, there was a significant change in the price of the vehicle.  It went up $1,498 from what was listed on the site.  I was told the dealership has final say on the price and they had added a \"package\" on the vehicle I wanted.  I was basically told that any of the vehicles I looked at on the Driveway site could be a different price when they contacted the dealer.  I found this to be very close to fraudulent.  Third, the trade-in process was pretty easy except for using the software provided while the car was in direct sunlight.Fourth, delivery of new and pick up of trade-in went very well, but they don't give you any paperwork (like a bill of sale or receipt of delivery).  Fifth, it took another 2 1/2 weeks to get the new license plate and registration, but I thought that was reasonable.  ", "rating": 4}, {"title": "The car is wonderful, but…( +update*)", "text": "The car is wonderful, I love it. And it got here pretty quickly! It was a lot more scuffed up than I anticipated, but I plan on getting my own paint repair kit. That’s where the positive part of my review ends. Everything else was awful… The customer service was garbage. My car didn’t get cleaned as promised, no one responded to my emails within the 7 day/400 mile period, so good thing I didn’t want to return my vehicle. They forgot paperwork and I kept having to overnight things back and forth. Rude phone call with one woman. Others ignored my calls, emails and texts. Gave up trying to have the busted key fob replaced. Once phone call went on 10 minutes before the guy realized he was looking at the wrong profile and wasn’t talking about my car at all. It felt like no one wanted to do their individual jobs, dumping me on the next person again and again. Maybe they’re overwhelmed with business or short staffed… I’m still waiting on my plates/registration info when my temporary plates expired 2 days ago. (they just finally sent them today, not sure when I’ll receive them) Driveway will sell you a car! You will get the car! Just don’t expect any proper follow up outside of the required seemingly automated email updates. EDIT: update as of 10/3/2024Moved from two stars to four stars. Driveway reached out to me to help rectify the situation. Sarah Wolf was very diligent in meeting my needs. I wish my entire experience went as well as it did with the after care. I am satisfied and would definitely purchase another car through driveway again! Love my Mazda. ", "rating": 4}, {"title": "My Driveway Experience", "text": "I had a great experience with Driveway! I love my vehicle. Issues arose but Driveway did everything they could to make resolve the issue. Shipping took a bit but it was definitely worth the wait. And in the loan apply process Driveway and it’s partners were nice enough to lower the down payment for me to secure my vehicle.", "rating": 4}, {"title": "1st time seller", "text": "Overall the experience was good.  You followed through on everything.  My only feedback is more clear communication of expectations and timeframes upfront. There was some miscommunication throughout the process but it did work out in the end", "rating": 4}, {"title": "great communication", "text": "great communication, but some calls can be done with emails / text instead of calling every single time", "rating": 4}, {"title": "Great service", "text": "Great service! Taylor is so trustful, she is so helpful! Really taking care the customers.", "rating": 4}, {"title": "Customer service was really good", "text": "Customer service was really good. The process was easy to follow. The pick up took longer than expected due to a 3rd party carrier that had to be scheduled.", "rating": 4}, {"title": "FAST RESPONSE", "text": "Date of experience: October 30, 2024", "rating": 4}, {"title": "Car buying with Driveway was easy", "text": "Car buying with Driveway was easy. I loved the pre-approval process. It gave me a budget that I could work with. I also loved how I didn’t have to pay the shipping fee upfront. The only thing I did not like was the shipping of the vehicle. Took a month just to receive the vehicle. Overall, I love and enjoy my car! I would definitely recommend Driveway. ", "rating": 4}, {"title": "A straight forward uncomplicated and seamless sale. ", "text": "The company is honest and open with the process and the valuation of your vehicle.  I would like to be able to negotiate the value at some point. The process was easy and the online submissions were uncomplicated and worked without issue.  I was impressed and pleased with the process. ", "rating": 4}, {"title": "Communication was a little slow. ", "text": "I wish the communication was a little better. The texting is nice but I did have to send emails and make phone calls to figure of status at different times. Besides that everything was very easy. Would do this again. ", "rating": 4}, {"title": "The process is a little disjointed but…", "text": "The process is a little disjointed but if explained correctly how the system works it would have been less stressful as a first time online buyer of a preowned car sight unseen.The dealership may have a protection plan associated with the car I purchased but it is me doing the leg work to understand instead of it having been shared upfront as part of the transaction process. I don’t believe driveway went the extra mile to explain what would come with the purchase. I am also not confident that the title was correctly completed to move to an existing license plate and then the it is me that will need to follow the refund process as a title transfer is less costly than a new plate and registration ", "rating": 4}, {"title": "Lack of candor I received…", "text": "The car roof was dull when I received it. You couldn't tell in photos. The delivery person told me it was a wrap and I should call them about removing it. I did that right away but there was some lack of candor when it came to that phone call. This was my first online vehicle purchase I'm not sure if I would do it again. When I said I might return the car the lady said they would probably charge me the $620 delivery fee. That wrap on the car should have been replaced before I purchased the car.I would like to update my statement and thank Sarah for working on a resolution.  I'm very happy with the outcome.", "rating": 4}, {"title": "Driveway has been great from start to…", "text": "Driveway has been great from start to finish! All of the reps have been SUPER NICE and patient!! I spoke with Lydia today and Patrick earlier this week. Both agents were AMAZING, Lidia took time today to explain everything and reassured me that they are on it! The attention to detail and support has been top notch!! Thank you You all for your genuine care and concern!! The reason for 4 stars is just the long delay with getting my state tags. The customer service is unmatched!", "rating": 4}, {"title": "Selling a car.", "text": "Was a bit reluctant going through the process of selling my car. Given the fact that I had to hand over my title before I saw any of the money (Though, I guess its standard). And given the fact that the offer I got was higher than most places quoted me. And given the fact that the person handeling my case was retiring the next day. Seemed a little fishy and too easy to be true. Though, other than the pickup process, which was a bit finicky, It went without a hitch. Took pictures of my car, and they locked in the value. Got my money the same day they picked it up. Only thing keeping it from 5 stars is that they let someone retiring the next day take my case, and the unprofesional 3rd party tow services they use to pick up the car. Over all, I would use them again to sell my car.", "rating": 4}, {"title": "The customer support was great and very…", "text": "The customer support was great and very responsive. It was easy to work with them. The only reason I graded 4 out of 5 is because of the transport being rescheduled so many times ", "rating": 4}, {"title": "It took them a couple times to explain…", "text": "It took them a couple times to explain how the system works, the introduction with the first CSR was not as clear as the second person I worked with. The second person was very good and walked me through the process. ", "rating": 4}, {"title": "Legit", "text": "A legit company I went with them because money was instant another company offered more money but 2 to 5 days to get money.", "rating": 4}, {"title": "Driveway was very easy to work with in…", "text": "Driveway was very easy to work with in selling my car. All I had to do was sign some electronic and hard copy documents. Didn’t have to go anywhere. Would use again. ", "rating": 4}, {"title": "Paid higher than others; Super poor communication though", "text": "I first engaged with Driveway to sell my car in March. They gave me a quote and said somebody would get back to me to make arrangements for the paperwork. I went on Driveway chat twice to check-in since I never heard from anybody. They always said they were very busy and somebody would get back to me soon.About 3 weeks went by and I finally called them. They said somebody tried calling, texting, and emailing me the day I first reached out to them. I never received any of these communications.Unfortunately because \"I didn't respond back\", the quote expired and when they re-quoted me, the price they were willing to pay had dropped about $600, even though the miles were less than I estimated in my original quote. They said there wasn't anything they could so since \"I didn't respond\" to their replies.Once I got on the phone with them, everything went smoothly, the car was picked up quickly, and the payment went through promptly. So if you're doing business with Driveway, I suggest doing it over the phone, because their automated system and chat is very poor and caused me to loose money on my car sale.", "rating": 4}, {"title": "at in person dealerships i was…", "text": "at in person dealerships i was struggling to find a specific car that i wanted and it was very frustrating so i decided that i should try shopping for a car online. i searched up the car i wanted and it was available on driveway, i did research on driveway and i got a lot of mixed reviews. these people were very helpful with the purchase of my car and they answered all my questions. i got my car 14 days after purchasing and the car is amazing and in good condition. the wait was worth it and i would recommend this website to many people who are struggling to purchase their cars at close dealerships. The only “issue” was that it took an extra day to get my temp plates so i had to wait a day to drive the car but it wasn’t a huge deal for me.", "rating": 4}, {"title": "7-day return?", "text": "UPDATE: 6/27/24. Driveway reps reached out and we came to a resolution that was fair to both parties. Since it did still happen, I'm dropping one star.ORIGINAL: 7-day return? Our car was coming from Nevada to New York. Driveway gives buyers 7 days to drive the car and return if it isn't satisfactory. Problem was while the paper they gave you while waiting for plates was good in Nevada, it isn't in New York. Our 7 day window is far far over and we still don't have plates. We can't drive the car legally weeks after delivery. ADDED: We purchased a car financed on May 24, 2024. Not only have we made the initial insurance payments, but we are due to make the first loan payment on July 7 - and we HAVE NOT BEEN ABLE to drive this car. The tags are stuck in a holding pattern and since the requirements to drive a car in Nevada without tags are not the same as New York, it is literally illegal for us to have this car on the road. After a month. We will never recommend Driveway to anyone after this fiasco. Paying already for a car sitting in our driveway. The \"7-day\" test period promise was violated nearly immediately. I called about it and was told, that's the way it is, we can't do anything. They hadn't even sent the tag/registration information to New York yet! ", "rating": 4}, {"title": "Sales Nathan is helpful ", "text": "Sales Nathan is helpful He go through all the process with me clearly, I do feel confident about buying car from the website ", "rating": 4}, {"title": "Happy buyer", "text": "I experienced a couple of issues during the buying process. But working with salesman Kris through the delivery with Harley, I am quite happy with the end result and am loving the car I chose.", "rating": 4}, {"title": "Less than idea offer but better than…", "text": "Less than ideal offer but better than what the dealerships were offering. Process was pretty easy and required only one out of pocket expenses, a notary.", "rating": 4}, {"title": "Best choice youve made this year", "text": "There customer service is great. They were quick to get back to me, which was nice and made my stress level low. All in all you should give them a try. They will surprise you and make your new car buying experience easy.", "rating": 4}, {"title": "First Time DriveWay Buyer (Michigan)", "text": "So I decided to buy a 2020 Honda Accord 2.0T Sport from Driveway. Overall I can say that the buying experience was relatively seamless. There were definitely moments where I felt hesitant about how exactly the process would work but my team of Driveway reps were very communicative. (Kasandra-Post Delivery, Corey-Delivery Coordinator, Marco-Shop, and Tijerra-Vehicle Registration/DMV)The reason I give this a 4/5 instead of a 5 is due to issues with shipping and a bit of undisclosed damage on my vehicle. At the time of writing this review they are investigating the damage and seeing if it was in the original vehicle photos or not. It’s very minor but from everywhere I searched it was undisclosed in both the CarFax and the contract. However they seem to be very good about getting it fixed if it actually wasn’t disclosed. Now when it comes to the shipping I can’t really blame Driveway as they do use a 3rd party delivery system. However my driver went to initially drop off my vehicle when the location was closed. This caused a delay and confusion about here my vehicle actually was.Thankfully the team and the dealership manager communicated to me the second it hit the lot.With this in mind maybe as DriveWay grows it would be beneficial to have some type of vehicle tracking portal. Where you can see exactly where your vehicle is just to alleviate some of that worry.All in all this was a nice process and id recommend if you are looking for a vehicle and Driveway has it you should do it!", "rating": 4}, {"title": "No problems.", "text": "At first it went smoothly. Everybody was great. Then I thought there would be a problem because of my financial issues. Nope, no problem. Thought there would be a problem shipping the car because I couldn't get insurance right away. Nope, no problem. Thought getting the temporary tags/registration after I produced the documents they needed. Nope, no problem. They sent a copy through email and the USPS. Called about an issue I had with the car even though it was sold as is. Nope, no problem. They fixed the issue after receiving a copy of the paid receipt. I can't think of any problems with them. The only thing I have left is them sending the documents to my state so I can receive my permanent plates. I can't see a problem with that but I will keep you updated. I can't think of a single issue I have had. As long as you send the information they need they will bend over backwards to help you'll have the same experience I did.No Problems.", "rating": 4}, {"title": "It took a little longer than I was hoping……", "text": "It’s a little longer than I was hoping… There was some confusion with the documents being sent out… UPS or someone changed the delivery… And when I called driveway for an explanation left two messages for Antonia no one got back to me with an explanation was a little frustrating so I was waiting to fly back to the UK to leave my trip .. otherwise, everyone was very helpful and I would recommend", "rating": 4}, {"title": "Too many hoops to jump through", "text": "Too many hoops to jump through. Way too much paperwork. Great customer service and contact. Very professional. Would recommend. ", "rating": 4}, {"title": "Easy to sell", "text": "Easy process, friendly agents, get it done quickly. Only downside is the value slightly below what i was expected.", "rating": 4}, {"title": "Overall positive experience ", "text": "Overall a positive experience. When i first got the car, there were several mechanical issues, but driveway was incredibly responsive and helped me get everything on the vehicle fixed", "rating": 4}, {"title": "Would Buy Here Again", "text": "The process was simple and easy. Our rep was super helpful in getting the deal done. Only reason not a 5 star is that I felt it should’ve been more clear that there was only 1 key fob and also the one that was given to us had a low battery alert.", "rating": 4}, {"title": "Selling in the age of digital literacy.", "text": "We chose to sell our 2023 Toyota highlander with driveway.com as they offered us the best price. There were many different people that I spoke with, emailed with and texted with to finish the deal. Start to finish it was about 2 weeks. There were several technical issues  at the start, which delayed the deal for a couple days. Once uploads were functioning things began to move along.All of the people I worked with at driveway.com were pleasant and effective people. I don't live in a large enough town for them to have their transport collect our vehicle. They hired a 3rd party who arrived at 11:45 pm! I was happy to have it done, so I agreed to stay up and meet them - in the dark, etc. I was concerned that if I said no to the time frame, it would be additional days before they could send someone to pick it up. I took a photo of my vehicle on the transport truck and texted it to my contact at driveway.com. The following day, the money transferred quickly into my account. Thank you Driveway!", "rating": 4}, {"title": "neutral", "text": " For the most part it went pretty well. It's been 9 days since the car was delivered. I still don't have plates for the car. Plates should not have been part of it. I could have went to my own DMV. So I have been driving illegally for 9 days, and counting. The Driveway people who handled everything else did a great job though. (very thorough)!  The car lot didn't do a very good job cleaning the car.  And the chip in the windshield was a nice surprise!", "rating": 4}, {"title": "Overall this was an excellent…", "text": "Overall this was an excellent experience. Couple of little hiccups along the way but all in all it was a pleasant experience. ", "rating": 4}, {"title": "Mostly good experience…the dispatch…", "text": "Mostly good experience…the dispatch process needs to be sured up a bit more as I had to contact them several times.", "rating": 4}, {"title": "Employees I spoke to were great", "text": "Employees I spoke to were great.  .  ", "rating": 4}, {"title": "Slow to pay", "text": "Slow to pay, otherwise everything was ok", "rating": 4}, {"title": "The whole process was overall pleasant", "text": "The whole process was overall pleasant, uncomplicated and very reasonable with regard to the time it took from start to finish.", "rating": 4}, {"title": "Very informative", "text": "The company was very informative and keeping me updated", "rating": 4}, {"title": "The process went smoothly but keeping…", "text": "The process went smoothly but keeping me in the loop was not the best. After the vehicle was loaded and gone I received my money quickly. All and all a good experience. ", "rating": 4}, {"title": "Good overall purchase", "text": "Customer service stayed in touch very well the entire process. Pricing was competitive without negotiating, and delivery was faster than expected.", "rating": 4}, {"title": "Don’t expect a quick sale…", "text": "The offer was fair and the experience was both great and exhausting.  Let me say first, that every person we dealt with was helpful and respectful and knew their jobs well. I also had an unusual situation in that I was leaving the country for the middle of the Serengeti in Tasmania. I was not prepared for the length of time that it took to get all of the documents signed and notorized and to schedule the pickup.   I was used to driving to a location, signing some forms, handing over the keys and walking away with a check. The fact that the driveway offices are in Oregon and the car was in NJ and the paperwork kept being sent to my PA address even though I was living 2 hours away in NJ didn’t help the situation. When it became clear that that the pick up was not going to occur until I was  back home and that if we waited until we were back for the pick up, the whole process would have to start over Inarranged for my mother to be here with the car .  I was told that wasn’t a problem.  I gave her all of the bank information and gave her contact info to the driveway agent. A few days later ingot a text from my mom saying that the pick up driver couldn’t proceed with the exchange unless he had a signed note with that days date on it. I texted or emailed driveway asking for a pathway forward.  I was told that it just had to be a hand written note saying that she was my authorized agent. Again, I was in the middle of the Savannah with sparse cell service and power.  I eventually wrote a note and took a picture of it and texted it to her.  Apparently that was acceptable.  I mean, after all of the forms that needed to be notarized and fedexed etc. it came down to a note in a text?  Seriously? My mother could have forged something or had the neighbor write a note.  Individually and in theory, the experience was simple. It just was a lot of hoops to jump through. ", "rating": 4}, {"title": "Slow payment ", "text": "I feel like I got a good price for my car but it took a long time to actually get the payment", "rating": 4}, {"title": "Everything was good until the pickup…", "text": "Everything was good until the pickup stage. Communication was lacking and there was a delay by several days. ", "rating": 4}, {"title": "its good on the most part could be…", "text": "its good on the most part could be improvements... i think have a tracking for the shipping make it better but over all iam happy ", "rating": 4}, {"title": "Payment", "text": "We opted for check payment and didn’t receive our check until 4 days after the car was picked up.", "rating": 4}, {"title": "Things started off great, then got frustrating, then better again", "text": "Things started off great. I was approved for financing easily. The original car i chose had problems so we had to start over with a new one. No big deal. Then i had to sign my documents twice because there was an error on what i was sent. This caused a small delay but still not a big deal. Then it got to my delivery. My coordinator was not helpful. She refused to communicate. I reached out to my salesman for help and he never got back. I had a delay of 5 days total and could barely get an default as to what was going on. I went from feeling valued to feeling like i did not matter at all very quickly. I was very transparent about this and nothing changed.  It was a horrible experience for me. Not one i ever want to ever go through again.  I finally received my car 16 days after the process began. I do like my car though. It’s very clean…except got the butt pillow and blanket that was left in the back seat. That was strange_____________________________________The customer satisfaction team reached out to me shortly after I received my car to discuss my frustrations. They were very concerned and did a great job at making me feel much better about the entire process. They were apologetic, understanding and eager to make it right. Thank you", "rating": 4}, {"title": "Car arrived with undisclosed dent", "text": "Car arrived with undisclosed dent, they fixed it in 2 days and everything was perfect from there.", "rating": 4}, {"title": "Went pretty well considering we have…", "text": "Went pretty well considering we have never sold or bought a vehicle online before.", "rating": 4}, {"title": "AWESOME!!! Great staff & immediate replies to ?s.", "text": "The staff were fabulous, even though I had never done anything like this before. They made signing the contracts easy access and sign, and make payment, etc. A bit difficult to get in touch with certain staff b/c it seemed they had different schedules, but Ryan, Shante, Dama and Sarah deserve 5 stars!! The only issue was the detailing was not great, and when I asked they said the care team would charge me an additional $50 to clean. I declined. I can get cheaper seat cushions. There was also an issue with the car not coming with a paper tag as mentioned, HOWEVER, they got right on it, and e-mailed me a temp tag. Last night I had a regular temp tag in a UPS package by my door. The delivery people were nice but didn't really stick around and show me how to use the car although she did show me the gas and tailgate levers. (Never had anything like this CRV) Had a mechanic check it today and said there was absolutely nothing wrong with the car that if he needed a car and saw this, he would buy it in a snap. He is a very good friend of my friend and a generational mechanic, so that made me feel good. Your service is awesome!!!!!!! I have been referring people....don't do Carguru, Carvana or Carmax, they are way over priced. Use Driveway.com!!! THANK YOU GUYS! You are the best! Cathy Rawlings.  Oh, still trying to figure out gender and a name. My sister thinks it's a guy, I feel like a girl. So far I've come up with Olly. Heh. Thanks again for a wonderful experience!", "rating": 4}, {"title": "I had a great experience overall but…", "text": "I had a great experience overall but the reason it was not a 5 star is because there were a few parts of the process I think could have been smoother. -during the docs and photos process, I had photos not get accepted and had to retake them 3 times, seemed like I was taking the exact same photos so not sure how they could of been rejected -during the doc and photo process there was a lag in communication from Driveway and I had to reach out to finalize the confirmation that I wanted to move forward with the sale after not hearing back from the coordinator who was originally assigned -lastly during the pick up process, driveway confirmed a date/time for my vehicle to be picked up and the local dealer who was going to be taking care of that did not seem to get the dispatch information and didn’t arrive during my pick up window. I had to call driveway and ask for an update. When the person arrived to pick up the vehicle, the person seemed inexperienced and not aware of the process and did not know I was supposed to receive the real time payment before they drove off with the vehicle. When I did reach out to Driveway the team answering the phones were always helpful and helped resolve the issues immediately which saved my experience and still made the process pleasant. ", "rating": 4}, {"title": "You did what you said you would do in a…", "text": "You did what you said you would do in a timely manner ", "rating": 4}, {"title": "The whole process was so easy", "text": "The whole process was so easy! Find a car and then they have a team of people that make it happen. It was fast and with the 7 day money back it made it easier to try it out. ", "rating": 4}, {"title": "Very good service", "text": "Very good service and the process is pretty much streamlined. Team is very responsive. ", "rating": 4}, {"title": "I had a great experience with driveway", "text": "I had a great experience with driveway! They were very friendly and very fast with the process. My only complaint would be that it would be nice if they provided a means to track the shipping of the vehicle. All in all I was very pleased with the process. ", "rating": 4}, {"title": "FIRST TIME BUYING ONLINE", "text": "I received my car 3 days ago, and it was just as pictured.  The process was easy, they stayed in touch with me.  The only reason for 4 stars, I was told I would have my car in 14 days and it took 23.", "rating": 4}, {"title": "Everything was great. ", "text": "Everything was great. Except the car carrier vendor has to have a better timeline for pick up. ", "rating": 4}, {"title": "Great service the only improvement…", "text": "Great service the only improvement would be to improve time to processing time", "rating": 4}, {"title": "Everyone was very helpful and very…", "text": "Everyone was very helpful and very patient with me and all of my questions. ", "rating": 4}, {"title": "Richard delivered the suv this morning…", "text": "Richard delivered the suv this morning at the designated time.  He explained many of the options on the car.  I expressed my concern to everyone involved with the purchase and finance process that it would be great to have someone that followed the process all the way through..  I undertand that it would take longer to get the car but everyone involved turned the cog a little and then did not know who to ask about questions I had.  Miguel from All american chevolet had the most information about the actual car and who traded it in .. I wanted some history. The suv was transported to Michigan arrived on the 20th Jan, Left Texas on the 17thh Jan.  I was told it would be 1to 2 days before delivery.  The car arrived today the 27th,  Especially when I was told the car had a broken mirror when it arrived in Michigan from Texas.  Miguel had photos of the car when it left.  Cheyenne, concierge, had not idea if it was broken or when it happened,  I sent her the photos so she knew it was in transit. Cheyenne was the person who was there for many of my questions and concerns.  She was very patient  I feel she should not have had to be the brunt of my questions when she did not have all the details. Dawn in finance, I think,  was helpful also. I still have questions about my temp title and plates for the state of michigan.  I did do a notary for the plates. As for service, that is an unknown.  I will be going to a Benz dealer because Texas is too far. The car arrived in perfect shape today.  I really love it.", "rating": 4}, {"title": "The experience with getting issues…", "text": "The experience with getting issues resolved during the 7 day trial period was fantastic. Lidia was very prompt and quickly provided resolution and reimbursement for getting the rear climate control module replaced.", "rating": 4}, {"title": "They followed through with what they…", "text": "They followed through with what they promised. The only problem I had was how u r rushed to get everything done ", "rating": 4}, {"title": "Setting Expectations IS KEY!", "text": "Setting Expectations IS KEY!If you purchase a car from this company, you can expect the following:- All actions like paying, signing, documents, etc flowing into driveway.com has an army of people trained expertly to execute flawlessly. They must have 20 people chasing their customers.- All actions informing the customer who has already paid them, supplied all the documents, and is just waiting for their car. You might as well sit on your front porch and wait for the aliens to land or sasquatch to appear.Lots of promises for updates. Lots of false statements about what's happening. They have your money, they have your limited power of attorney. AND they have your car! What more do they need?So my wife was promised her new car, today. They promised today. Ken promised today. We will see. IF they deliver the car today, I will upgrade this review. IF they break their promise and not deliver today, then I will down grade this review and write a new review wherever I can until it is delivered.2024 Honda Accord Hybrid Touring SilverTraded in a 2021 Honda Civic - VIN ending in ME007347Wilde Honda of East Town Madison WisconsinWe had to drive up to Madison to pick up our car. When we picked it up there was 2800+ miles on our new (used) car, and we only put 500 on our trade in, to drive it up to Madison. Yet we were not notified that we will get the delivery fee of $600, back. Ken never provided a delivery driver like he promised. So the day before my wife's important need, we drove the 6 hours to Madison and the 6 hours back, paying for our own delivery, with a 1300 extra miles on a car we anticipated would have 1500 miles on it (advertised as 1100).On top of that, we put in 28k on the initial trade in valuation, then we updated it to 23k, as I misread the odometer filling out the original order. Yet our trade didn't go up a dime after the original 5k miles error was noticed. Grrrr. It's all on tape.--So, hat-tip to Trustpilot to make feedback honest, trust worthy and confidence-inspiring, so that the voice of the customer is heard! Due to this venue, driveway.com responded and is working through some of our bigger issues. We will keep you posted when this whole process is done. We have some distance to cover yet. Thank you Sarah. Thank you Silas. Thank you Wilde! Special thanks to TrustPilot for connecting us in a meaningful way.", "rating": 4}, {"title": "Took longer than I thought it would.but…", "text": "Took longer than I thought it would.but overall a great experience ", "rating": 4}, {"title": "Driveway Worked With Us / Dealership Bought From Was Difficult", "text": "We did have a few bumps along the road but were able to buy our dream car. Originally we bought it and were told it was secured, only to be told someone at the dealership it was being held at was purchasing it so we were pretty upset since we thought it was ours. About three days go by and we see the vehicle is back up online and we call the dealership it was held out to find out it was still available. My representative at Driveway Tavion and his manager worked tediously and made the process super quick and easy, and thankfully about 2-3 days later the vehicle was secured and we signed all the contracts to officially make the vehicle ours, which we were told the dealership pulled the vehicle aside for us! We got the vehicle delivered to us and were supposed to transfer plates, but when we received the car there were no temp tags and we were told our registration would be mailed after the 7 day money back guarantee was done. We attempted to reach out to Driveway for temp tags and were told they would email us a PDF of them but we have yet to hear back from them (it is the weekend so I understand if nobody is available). We have called the dealership for 5 days now with nobody helping us to get temporary tags, the dealership is Doral Hyundai in Miami, FL. Every time I would call asking for temp tags, they would transfer me to the finance department and I would get sent to voicemail. I left multiple voicemails and nobody responded to me. I texted their chat line and was told someone would call me, only for 3 days to receive no calls. The texts were an automated system, I advised them I'd be leaving a complaint with the dealership, only to be told \"We value your feedback and will let our team know, somebody will respond to you shortly.\" Three days of this, 5 days not being able to drive our new car. It's been very stressful and we wish the process and end results would be easier, since we have a wonderful vehicle but are unable to legally drive it due to the miscommunication and lack of providing us with tags to drive our new car. **Update: I emailed the GM of Doral Hyundai & he had the finance manager and his assistant mailed temp tags which will be at our address tomorrow morning. Glad they were able to rectify the situation after such issues these past few days.", "rating": 4}, {"title": "I still have some questions that need…", "text": "I still have some questions that need to be answered/addressed.", "rating": 4}, {"title": "Aways had good updates on the vehicle", "text": "Aways had good updates on the vehicle ", "rating": 4}, {"title": "Relatively fast and convenient process. Honest company.", "text": "The communication was clear and consistent for most of the process. I especially enjoyed the inspection process and immediate payment at the end.", "rating": 4}, {"title": "Pleasant experience ", "text": "Very fast and communication was excellent . Got what I ordered.", "rating": 4}, {"title": "Very professional ", "text": "I dealt with a professiobal well informed specialist for each step of the experience. ", "rating": 4}, {"title": "Efficient", "text": "Great customer support loved working with her.", "rating": 4}, {"title": "Vehicle was a few thousand less than…", "text": "Vehicle was a few thousand less than carmax, carvana, etc. ", "rating": 4}, {"title": "I put my deposit down on a 2019 gmc…", "text": "I put my deposit down on a 2019 gmc terrain on 6/21 and by 6/28 I received paperwork to fill out and return, I received the car by 7/05 delivered to Arkansas which I purchased the car from Lithia Chevrolet of Redding which is in  California of course my main concern when I got the vehicle was where are the tags and registration or a temp tag, I had to reach out to driveway myself instead of someone already telling me that the tags can take up to 4-6 weeks to come and because I am an Arkansas resident I could not get temp tags of course I drove the car anyways luckily I didn’t get any tickets and the tags came earlier than I thought it took about 2 weeks for them to get my tags and registration over nighted to me after delivery I had a small problem with the battery which they said they couldn't cover it but I just went ahead and just bought a new one which put me behind from paying my first car note but overall my experience was scary at first because it was my first time purchasing a car online and out of state at that but driveway came through for me I will be making another purchase in the future I would like to thank Michaela, Kris, and Lidia from the post delivery department for all their help thanks!", "rating": 4}, {"title": "My process was very fast and very…", "text": "My process was very fast and very affordable ", "rating": 4}, {"title": "Good experience", "text": "Great customer service from Wally Ramos and others", "rating": 4}, {"title": "Kind and knowledgeable staff easy to…", "text": "Kind and knowledgeable staff easy to work with ", "rating": 4}, {"title": "Good value and great customer support.", "text": "Date of experience: May 03, 2024", "rating": 4}, {"title": "Nice price a fairly seamless process.", "text": "Date of experience: June 11, 2024", "rating": 4}, {"title": "This process has been a nightmare ☆☆made better after my trust pilot review got action☆", "text": "☆Update...No sooner than I posted this review was I contacted by Driveway and assigned to me was Sarah. Sarah stayed in contact with me throughout the remainder of my transaction. We were on our way to pick up the car within a matter of days. Sarah has been right there everytime I reached out to her and she has made sure to delay my first payment, to reimburse me for insurance while I didn't have the car, even to arrange for us to be picked up from our AirBNB. Driveway, and in particularly Sarah, turned this entire negative experience around and into a more positive one. And my new car is perfect for me. If I could give one piece of advice to Driveway it would be to get a Sarah on every transaction before they go so deeply in the wrong direction. Or train everyone that works there to do the things that Sarah did. A huge thank you to Sarah & the rest of the people at Driveway for taking the time to make things right. It means alot to me. ☆☆☆☆updated on 5/15/2024 from ☆ to ☆☆☆☆.This process has been a nightmare. I am posting this review with the hopes that someone from Driveway will see it & take action. So I started the car buying process with Driveway over 30 days ago. The original vehicle I had picked out & placed a $500 deposit on was sold to someone else. I thought that's why I paid a deposit in the 1st place, but no big deal. However, the person who called to tell me was not the person I had been working with for a week on this. I picked out another vehicle, mainly because they already had my $500. We began the paperwork process on the new vehicle and I waited & waited. After the 2nd week, I was told to get insurance and pay an additional $700 down, so that was done. And then they finally said I could go get the vehicle, only to immediately send me a text to hold off. (I was flying out to get the car to save the 1800 delivery fee because the 1st car had a 600 delivery fee but driveway would do nothing about the 1200 difference even though they sold the 1st car after I paid a deposit to hold it). I was in the process of buying a plane ticket & had I, I would have been out that money too. I had to speak with someone from the finance company who assured me they had everything they needed from me. Then another week went by. I have rarely been called & informed of what's happening during this time. But on this occasion I was called & told that the sales manager wanted to hold the vehicle until they had been paid. I guess my 1200 is just chump change to them. So finally they released the vehicle again, & I begin searching for a plane ticket for the 2nd time. Then believe it or not I get a text to hold off once again. Driveway has made errors on the GAP portion of the contract & the whole deal has to be re-contracted. I only know this because I called the finance company to find out. The finance company has again assured me that they have all they need from me. They were actually under the impression that I had possession of the vehicle. At this point I'm just in shock. I've been told one thing then another throughout this entire deal. I have not had the same person call or text me since that 1st week so who knows who I'm sulposed to call & ask for. It is now over 30 days since I started this. My insurance is due tomorrow for a car I can't drive and I have a payment due on the 26th that I will have to pay. And Driveway thinks they need to hold on to the car until they get their money, yet they can't do their jobs to make sure they do. Meanwhile I'm out over $2000 at this point, still don't have a car to drive, and nobody over there gives a s@it or will do a damn thing about it. People these days just think it's OK to take other people's money and hold it as long as they want while they all sit around not doing their jobs. I wish I had never started this process with them because we're still driving a borrowed car & no money to pay down somewhere else. I would be ashamed if I ran my company this way.", "rating": 4}, {"title": "Great help ", "text": "Great help . Upfront no gimmicks. ", "rating": 4}, {"title": "I like the timely response and process.", "text": "Date of experience: June 26, 2024", "rating": 4}, {"title": "Go With Your Purchase!!!", "text": "So This Is My First Time Purchasing A Car Online Through A Website! I Was A Little Skeptical At First Because We Were In Desperate Need For A Second Vehicle && I Did Not Want To Waste Money! So I Read Some Reviews && That Made My Decision No Easier Because I Was Reading Some Of The Issues They Were Having && I Was A Nervous Wreck Throughout The Entire Process! I Finally Took A Chance && Found A Toyota Highlander That I Loved! I Put In My Request On The Website For The Vehicle && The First Person To Contact Me Was Rayne! She Was Great Talking To! She Got The Vehicle Financed For Me Within My Price Range && The Process && Payments Were Effortless Processing. I Also Spoke With Her Supervisor Who Assisted Her With Getting All The Paperwork Sent Over To Me! The Only Thing I Did Not Receive Was Real Time Photos Of The Truck Before I Received It! Once Everything Was Processed With Securing The Truck, I Worked With Wally And Ken Myers To Get Final Paperwork Sent Out To Me To Have It Signed Notarized And Sent Back! Got All Of That Done And So Far I’m Only Three Days In And I’ve Fully Secured The Vehicle! YAYYY! Okay Now As I Am Working With Ken To Get Transport Situated, It’s The New Year Weekend So I Am Not Expecting The Delivery Right Now Due To Transport Is Through An Individual Contractor And They May Take Off For The Holiday! Thats Fine! By Tuesday, I Havent Heard Anything Regarding An ETA. It Was Outside Of Ken’s Office Hours So I Called Driveway And Megan Gave Me An ETA Of January 4! Okay! Great! I’ll Be Off From My Second Job That Day So If It Gets Delivered That Evening I Will Be Home! Okay, I Received Text Messages And Phone Calls While At Work Around Almost 7 On January 3 From The Transport Driver Saying He Was Two Hours Away! That Was No Problem! I Get Off From My Second Job At 9pm So That Gave Me Time To Get Off And Make It Home! So I Get Home And I Havent Heard Anything More So I Start Doing My Nightly Routine! I Receive A Message Around 9 Something That Evening Saying He Had A Flat And He Would Be Delayed Another Two Hours And Wouldn't Make It Until Around 11/11:30pm! Okay! Now I Am Getting A Little Agitated! But I Agreed To Wait! So 11:30 Comes And I Still Have Not Heard Anything! So I Sent A Message And He Texted And Said He Is Having Truck Problems And Wont Make It! So Now I Am Upset Because I Could Be Asleep! I Was Okay With Him Showing Up On The 4th To Begin With! I Explained I Had To Work At 7 The Next Morning! He Said He Would Try To Make It Before 7! So 7am January The 4th Is Here And I Still Have Not Heard From The Driver! So I Send A Text! No Reply! So I Receive A Call Around 9:30 From The Transport Company Saying The Driver Is Still Having Problems With His Truck And He’ll Contact Me When He Is An Hour Away! Okay! I Go On With My Day! As It Nears My Lunch Break I Start Receiving Calls && Messages! I Can’t Answer Because I Am At Work In the Middle Of A Call! So He Is Now Outside With The Vehicle! && I Cant Go Out For Another 15/20 Minutes! So I’m Finally Able To Go Out To Get The Vehicle! I Realized The Top Luggage Rack Is Missing A Piece On The Rear Passenger Side! I Reached Out To Ken And He Sent A Request In For Someone To Reach Out To Me Regarding Getting The Replacement Part Sent Out! Jake From The Customer Resolution Team Reached Out To Me && Requested Pics! I Sent The Pics And He Got The Replacement Sent Out ASAP And Provided Me With A Tracking Number! The Replacement Was Suppose To Arrive Today Through UPS! But It May Be Some Delays Due To Inclement Weather! So I May Receive It Tomorrow! Overall! Working With Driveway Was Amazing! But The Independent Contractor Chosen Was A No For Me! Which Is Why This Rating Isn’t 5 Stars!This Is An Edit: I’m Replying To The Comment On My Review! I Am Not Sure If You Are Authorized To Reveal My Location As You Just Did! But I Will Be Looking Into That As You Could Have Left That Part Out Of Your Comment!", "rating": 4}, {"title": "Very responsive to all questions", "text": "Date of experience: June 27, 2024", "rating": 4}, {"title": "Transaction was easy", "text": "Transaction was easy, communication was consistent and clear.", "rating": 4}, {"title": "Workable company", "text": "We came to an agreement", "rating": 4}, {"title": "The staff were helpful and nice", "text": "The staff were helpful and nice ", "rating": 4}, {"title": "Great prompt service", "text": "Great prompt service ", "rating": 4}, {"title": "Glad I sold the Sonic", "text": "Glad I sold the Sonic. Thank you.", "rating": 4}, {"title": "People is very nice to talk to", "text": "Date of experience: July 02, 2024", "rating": 4}, {"title": "Delivery of vehicle acceptable", "text": "Date of experience: August 07, 2024", "rating": 4}, {"title": "Good help comunicación", "text": "Good help comunicación ", "rating": 4}, {"title": "Friendly", "text": "Friendly, informative, ongoing contact. ", "rating": 4}, {"title": "Competitive prices", "text": "Date of experience: May 23, 2024", "rating": 4}, {"title": "Started off rocky, ended up happy", "text": "At first my buying process started rocky. Driveway will assign specific people to work with you at specific stages of your transaction. So the first person you work with is the initiation. They get your information, your down payment, and tell you that you must now wait for the next stage which is contracting and someone will get in touch with you. The specific person who initiated the transaction was off for a few days and whenever I tried to get a hold of someone about my transaction they told me that I needed to wait for him to come back. The customer service rep told me that he could check my transaction and said he saw that the car was already sold at the dealership. I was very frustrated hearing this since the only reason my car transaction was not moving was because the person I was working with was on vacation. I waited to hear back and when the person came back from vacation he told me he needed his manager to look into this. At this point I've already started my transaction a week and a half ago. His manager looked into it and said that they would make sure that the car was not sold to someone else. I was not feeling confident since there were so many reviews of this happening to people and being told they should pick another car. I decided to wait and a few more days and I got contacted by the contracting team. They had me sign a purchase agreement and all necessary documents. This is now 2 weeks after I started to purchase of the vehicle. Keep in mind that if you decide to do business with them it will be slow. I kept the transaction going with this car because I wanted the specific car due to the features, price point, and color. I've done business with Vroom and Carmax both online and you're able to get things moving the same day you pick a car. This was very unusual and a little stressful since I needed a vehicle due to moving. My assigned contracting employee was a game-changer. She was quick to respond, very friendly, and worked hard to make my transaction as painless and easy as possible. I would appreciate it if Driveway's management would reach out to me so I can let them know her name and what she has done for me. She was the reason that I was happy to walk away from my experience. I would have given this review 5 stars if it wasn't for the start of getting this transaction going. I think it would be best if Driveway had a better flow and security for getting their vehicles sold. Customers do not like hearing that their $500 deposit has no basis to hold the vehicle, especially when it is not their fault that they cannot purchase it the same day. Overall, I would consider doing business again with Driveway but only if I want a specific vehicle. I'd rather buy from Carmax.", "rating": 4}, {"title": "Get what you want not just whats available but be patient!", "text": "My experience with Driveway.com was very good overall. I was looking for a specific vehicle at the price I wanted to pay but I couldn't find it at the local car lots. They had vehicles available on their lots but not the one I was looking for. I started looking online and found Driveway.com. I was amazed with the vast selection available. I used their filter to narrow down what I was looking for and found several close ones.  I continued monitoring their site over time and finally there it was the one that everything I was looking for.  Traditional vehicle shopping at a car lot is usually spontaneous and reactionary. You test drive something that is available and then want to drive it home a couple of hours later.  Using Driveway.com I knew it would take time and this was difficult for me but it was the right thing to do and get what I really wanted. The vehicle I purchased from Driveway was an Out-of-State vehicle for me. This took more time to get delivered, then processing the registration took another couple of weeks. So I had to be patient, another difficult thing for me. In the end I have the exact vehicle I WANTED parked in my garage at a fair price. Also very pleased with everyone I dealt with at Driveway through the purchasing process, the delivery and getting it registered in my state. Thank you", "rating": 4}, {"title": "Company is responsive and easy to work…", "text": "Company is responsive and easy to work with. The people were friendly and helpful too. Overall I am pleased with my experience.", "rating": 4}, {"title": "The best way to sell a car", "text": "That I could sell them my car from the comfort of my home, get a great price and they picked it up at my convenience.", "rating": 4}, {"title": "Slow delivery process, good communication", "text": "Slow, good communication and great certified used honda", "rating": 4}, {"title": "Great people to work with", "text": "Great people to work with, fast to answer questions. Extremely fast delivery. Only thing that keeps the review from being a 5 star is that car did not come with a temp license plate. Arrived on a Friday afternoon. DMV not open on weekends. I have 7 days to review a car I cannot drive. My only ask for drive way and lithia is to find a way to get the temp plate to customers with the car so that we can actually drive legally to check out our cars more accurately. Other than that the team at driveway is awesome. I recommend these people. They will work hard to get you what you are looking for.", "rating": 4}, {"title": "I'm happy with my Driveway.com purchase…", "text": "I'm happy with my Driveway.com purchase and would do it again! Got a great deal on a slightly used 2023 SUV and everything was as expected (mileage, condition, etc). I'm giving 4-Stars because it was the easiest car I ever bought and it was delivered to my driveway exactly 1-week from checkout. Afterwards, there were some hiccups with registration, but this is a new car buying process and I'm sure they (and the States) will improve over time. I'm a Satisfied Customer and recommend Driveway.com if you find a good deal!", "rating": 4}, {"title": "I purchased a car through Driveway", "text": "I purchased a call through Driveway. I did have to jump through a few hoops, but nothing that Driveway was not trying to help me out with. I did go through approx. 5 individuals in the buying process with all the paperwork, but all in all smooth process.I would buy another car with them.RIck", "rating": 4}, {"title": "Improved Customer Service", "text": "To Driveway's credit, after this post, I was put in contact with a representative who was quick to address all of my concerns. The title arrived before my temp tag expiration, I was reimbursed for the temp tags, and I received the appropriate paperwork to file the IRS used vehicle clean credit. I'm leaving off the final star because I wish I didn't have to take this step to get done what should have been done without a complaint, but I'm now satisfied. Thank you.", "rating": 4}, {"title": "Don't use Driveway: revised", "text": "I purchased a vehicle through Driveway last month. I have been checking my mailbox religiously to look for my new tags. Only to never receive it. I am now driving with an expired temporary tag. The dmv paperwork was not sent in for several weeks following the sale. This seems to be a common practice with Driveway. Despite this no one submitted for another 30 day tag. I have called several times to inquire about it. I've been lied to with the reassurance that someone would call the dealer and request it be emailed to me. NO ONE has called, NO ONE has emailed.  The urgency that was there before my money went into their hands, no longer exists. This is what irritates me the most. I have had to reach out to DMV myself. This is not something I've ever had to do in a car purchase. Like the saying goes \" you get what you pay for\". I am going on record in saying the following:1st. Purchase your vehicle locally if at all possible. Local dealers have to remain accountable. If they choose not to answer the phone,you can always pull-up to the dealer. Because of this, Ive never experienced anything like this in all my 50 years.The worst thing is that prior to receiving my money, Driveway was in constant contact. Now that they have the money...it's crickets. If I get a ticket and/or my insurance rate is impacted by this, Driveway will be paying it.Update: Rachel with the resolution department did reach out to me a few days later. She was delightful. She tracked the entire process from the point of her contacting me, until both my temp tags and permanent tags arrived.  Also, the 1st gentleman I reached had apparently started the process, I appreciatehis help also. The only employee I had a bad experience with was Ranisha, and fortunately the others made up for her. However, I do encourage you to be proactive and to reach out to Driveway a week before your temp tags expire, just to be safe.  The process takes about a week.", "rating": 4}, {"title": "I would’ve given this review five stars…", "text": "I would’ve given this review five stars but Driveway sent the check for my payoff to the wrong bank. Actually I would’ve given this less than four stars. My lender was calling me about my payment for a truck I didn’t have. BUT with that being said, Chris Savage in customer service was amazing getting this handled. He made calls, emails to my lender immediately. Called my lender to explain that it was a driveway mistake and the funds will be there asap. Chris restored my faith in Driveway, and I’ll use them again in the future. Thanks again Chris!", "rating": 4}, {"title": "Overall a positive and pleasant experience", "text": "There were a few small hiccups where communication could have been a little better. Most of the confusion centered around the company changing the information required. These were small things that were more aggravating than substantive. I'd do it again.", "rating": 4}, {"title": "My experience was great from start to…", "text": "My experience was great from start to finish up until communication. I was waiting on my contract which was promised in 24-72 hours and I received the contract in a week.", "rating": 4}, {"title": "Shopping for the car is great no…", "text": "Shopping for the car is great no pressure. Best part is no dealer markups over MSRP (at least the ones I was looking at). The “salesman” that was assigned was below average. Communication was atrocious, but we got it done. Once it was time to schedule delivery it was awesome. Toni was professional and got the delivery done within an hour of speaking to her. The delivery driver was prompt and professional as well. I think that driveway could have a team that gets the temp plates ready or they have the ability to access the system at the delivery level so when the vehicle is delivered it’s ready to go. I did buy another vehicle through driveway and so far it’s been smooth. Hopefully I get same delivery team. Give them a raise.", "rating": 4}, {"title": "Toni made my experience great", "text": "Toni made my experience great! The car is great! Although, the first car I had put a down payment on was sold out from under me, the second one was wrecked in transit, third one is beautiful but I was not made aware that I needed to purchase my own temporary plates due to it being an out of state car. Overall I am happy and that is due to Toni from driveway of Houston.", "rating": 4}, {"title": "They two guys that came to pick up the…", "text": "They two guys that came to pick up the car,  Dillon and one whose name I can't remember were so nice.", "rating": 4}, {"title": "I had a wonderful experience", "text": "I had a wonderful experience. As a first time online car buyer, everyone at driveway was communicable, professional, and punctual.", "rating": 4}, {"title": "Great and easy experience", "text": "I had a really great and easy experience with Driveway.com!  Their customer service was really great in all areas!  From the beginning of the car purchase to drop off of the car Driveway.com provided excellent customer service!  They stayed in constant contact with me by text message or email to let me know what the next step would be and what they needed from me!  I actually got my car delivered in about 10 business days and I received a beautiful used car!  Very happy!  I would definitely recommend Driveway.com for your next new or used car!", "rating": 4}, {"title": "It takes one person to turn a bad situation around…", "text": "Update 7/19/23On Sunday, 7/16, I received a call from one of the managers(Eli). Eli asked if we could discuss the issues.  Eli was distressed to hear what I was going through and took immediate action. He said he would inform me of the update Monday morning, which he did. The outcome was a loaner vehicle that I can use until my permanent plates come in. It was delivered to my home. I didn't expect this and I think he went above beyond to rectify the issue. I'm very happy with the solution and I can drive to work with a clear mind. So, I have to update to 4 stars because of his outstanding customer care and follow-up/ follow through!!!!!Driveway is a badly run business when it comes to vehicle registration and after your 7 day trial has expired. I can't understand why a big business like this can't get their stuff together. They give these fake insincere apologies and they really could care less after you have signed on the dotted line.My temp plates expired on 7/8/2023, but at least 2 weeks up to the expiration I reached out numerous times and never got a definitive answer as to what is the hold up. I finally spoke to someone today 7/11/23 and was told because of some supposed error on their end, my plates will not be available until 6-7 weeks from 7/7/2023. In good faith  I gave my deposit, got all of the paperwork done expeditiously , so there wouldn't be a holdup. They keep giving some bogus excuse of it being because it's out of state. The vehicle was from NJ and I live in Pa. It was from Eatontown Ford in Eatontown NJ. Got the vehicle without the remote start that was advertised in listing. All of the wheel sensors were bad(which after a few days- Driveway did replace ) and the vehicle had cosmetic issues and reekes of cigarettes. Every time I went in the vehicle I got a headache and a tingling on my tongue. They never detailed the car or noted that it was received from a very heavy smoker . I've purchased vehicles out of state before without this issue. The lack of follow-up is ridiculous. I'm still waiting for a key fob that I still haven't received. So now, I can't drive my car and I have no way to get to work and they expect my payment and I'm paying insurance. All they can say is it's out of their hands, you know what -- so is the car payment. Horrible , lack of follow up and no accountability. Pass the buck company. Everybody needs to be fired ! I filed a complaint with my  states Attorney General and will file one in their state .  In reading the reviews , I see this a reoccurring issue, which smells of fraud. Just like Carvana .As you can see by their textbook response - no real answer. They had more than 2 weeks and according to their rep, she said an error was made which pushed back my registration 6-7 weeks from 7/7/23. It was recorded, so I'll be requesting that transcript. They always say the same rehearsed lines, just changing out the name. How come everybody is experiencing the same delays? They could care less about one person's dissatisfaction because they will continue to get customers.A copy of my DMV paperwork/ sales transaction does not take the place of a valid registration. It's ridiculous that you encourage customers to drive illegally.", "rating": 4}, {"title": "update", "text": "this my 1st time doing online car and right no its a horrible.I order june 28, sent deposit got lender approval information sent to dealership which is in the same state as me.got told car was pulled by dealership also seen dealership did a hard inquiry on my credit. reached out multiple times to representatives who was texting me and got told they will reach out to dealership because that who they are waiting for with contracts.here it is august 6 and i have yet to know whats going on i see online that the car has completely been removed. which is kinda crazy to me that it takes this long when it doesnt even take this long when you go buy a car in person.Update:ended up going down to the dealership to pick car up.wait time for this whole process was a headache because its long but overall pretty easy experience going thru driveway", "rating": 4}, {"title": "Received compensation for issues", "text": "**edit: Elias from Driveway reached out to me and offered me compensation for the nails in the tires. I am therefore changing my review.Also, shout-out to Brooklyn who was my very sweet and helpful salesperson. Complaints: delivery person was 3 hours late, nasty stickers all over the car, car delivered without temp tags - had to waste an hour at DMV.", "rating": 4}, {"title": "It’s great", "text": "They’re great to work with. Communication could be better", "rating": 4}, {"title": "Was great to choose just what kind of…", "text": "Was great to choose just what kind of make, model, color, price and additional features from an app!Only drawback was it didn’t arrive for a week. But my car arrived clean and in excellent condition!", "rating": 4}, {"title": "Delivery went well", "text": "Easy. They delivered right to my door.", "rating": 4}, {"title": "All of the people I have worked with…", "text": "All of the people I have worked with have been incredibly responsive and truly wanted to help me get the vehicle I wanted. They have been understanding of all circumstances which have caused me setbacks through this process and made it possible for me to get my dream car.", "rating": 4}, {"title": "The team at driveway.com was very helpful", "text": "The team at driveway.com was very helpful especially Sarah H and Angelique!  I bought my car with ease and these ladies were there to answer my multitude of questions and help me resolve my problems.  The status of the order web page could be improved by adding more stages of progress.  Overall I am a happy camper with my car purchase from Driveway.", "rating": 4}, {"title": "Patience are needed!", "text": "Patience are needed!  The start of the process was great ( working with the sales guy ) but when I transferred to Karen ( my paperwork person, IT WAS EXTREMELY PAINFUL! She had very little sense of urgency and isn’t what I would want as a customer facing employee.  At one point she actually got nasty with me! From that point on I wasn’t sure if I even wanted the car, even after it arrived.  When it showed up I had concerns and that is where Sarah comes into play! ( I believe she is in customer satisfaction ) I had ONE simple conversation with her and ALL my issues went away.  Her customer service skills are exemplary and her care for the customer amazing! She is the exact type of person I would want if I had an app to purchase products.  Because of her I would definitely recommend Driveway.", "rating": 4}, {"title": "Haven't received the title ...", "text": "Edit: Received it on the May 26th via. mail.I paid off the loan on April 17, 2023. It's May 20, still haven't received my title. Called Driveway on April 19, they told me to check in with the DMV. Now they don't pickup the calls anymore. What's going on?", "rating": 4}, {"title": "It was Easy…", "text": "I read almost all the recent reviews and true enough you don’t just get one person through the whole experience but Noemi, Jesus, & Bobby were amazing when it came to helping out( aquanetta was pretty cool she was the 1st to answer the phone I just ask for future customers she hear them out before talking over or proving information). Noemi even checked on me after the deal was done with Hyundai to make sure it was smooth. Needless to say I love the car and I recommend anyone this service just have a little patience and document the information you get when on call so you don’t get confused (: thanks driveway🙏🏾", "rating": 4}, {"title": "Saved the day", "text": "I read some other reviews about customer service and driveway. They are spot on they have some bad communication! BUT if you have someone great to save the day it’ll be a great experience. Stephen was outstanding and quick! Definitely saved my purchase!", "rating": 4}, {"title": "Communication", "text": "The communication is very good, although it seems like there are too many people trying to handle one transaction. This can get very confusing.You start dealing with one person and then another person takes over.Soon after that another takes over.Then when you think you're talking to someone to get the deal completed another person contacts you.There is not just one person to deal with.It would be helpful to have a way to follow up to make sure payments have been submittedConfirmation of payment would be great.", "rating": 4}, {"title": "Very nice car with great customer service", "text": "I had an issue with the convertible top when it was delivered. I contacted Tanya (who I believe takes care of shipping the vehicles and did a great job keeping me informed during the shipping process) about the issue and she forwarded the issue to Angelique. Angelique contacted me within a couple of hours and has been a shining light in her professionalism, empathy, and friendliness. She made this difficult issue much easier to deal with and I would give her 10 stars if I could. The issue was taken care of to my complete satisfaction and I am sure we will enjoy the convertible for many years to come.", "rating": 4}, {"title": "Better prices than Carvana", "text": "I purcahsed a 2020 mitsubishi mirage from them in march of 2023. When it arrived it smelled as if something had died in it had fabric tears and cigarrete burns in the seet that weren't in the photos. There was also rust on the undercarriage frame. The return was swift and they ended up charging me the shipping cost twice over. The 7 day return is a several thousand doller scam and I wouldn't recommend it. fastforward a month and I have the financer calling me daily for unpaid payments, and a lack of any effort on the dealership to resolve it. 06/05/23 Update: I did get my deposit back after writing this review, so I was never charged twice for delivery. However the financing still hasn't been canceled. My credit score has dropped 150 points, and I'm still getting hounded for payments for a car I returned. I've been in contact with an agent at Driveway who has assured me its been canceled. I just wish the bank knew that.06/10/23 Update: Driveway canceled the loan! My credit score bounced back more or less, and I couldn't be happier at the lack of permananent damage. Having come through the return process almost unscathed, I can change my rating to reflect that.", "rating": 4}, {"title": "My experience was okay", "text": "My experience was okay. I shared my concerns and thoughts about the company with a customer service representative in a follow up call after I sold my car. I am sure this company will be dominating the market soon. Highly Recommended!", "rating": 4}, {"title": "I was kind of iffy after reading some…", "text": "I was kind of iffy after reading some of the reviews about driveway but decided to give them a try anyways. Quavon who was my rep helped me from the jump and didn’t give up until I was satisfied with the offers. I traded in my car and got more than what the dealership had quoted me on plus a hood prices on a 2021 Honda passport with low miles. The part I was iffy on was getting my tags. It seems like everyone had ran into that issue in some way or another. I got my registration and plate 2 weeks after my car was delivered. My cons are is I wish the process was a little more streamlined. Too many phone calls to check in on things. No tracking number once you car has been shipped. I also don’t know how it is in other markets but I expected my car to be delivered on a truck and not the 3rd party company guy driving it 40ish plus miles to my house from their location. Over my experience was pretty good.", "rating": 4}, {"title": "100% Happy With My Purchase!", "text": "100% Happy With My Purchase!Thanks to driveways guarantees!!My vehicle came with no floor mats & broken tailgate. That was after the vehicle took a month to get to me because of an anti theft device being left on the vehicle from the dealer. It also needed a new starter and battery. DRIVEWAY took care of ALL of these issues that were really that dealership’s fault. It was an exhausting situation but thanks to Sarah Chambers and Johnny in delivery I now have a great van that’s exactly what I wanted!!!The best part is I didn’t have the best credit and since they did the financing I was approved! Including shipping and they took care of all of the bmv issues taxes included, just added to my loan! Literally sent me my plates with stickers!", "rating": 4}, {"title": "They delivered my vehicle to my house", "text": "They delivered my vehicle to my house, and never rushed me. They answered all of my questions.", "rating": 4}, {"title": "Experienced Delivery delays otherwise it was easy to work with Driveway.com", "text": "New Update:Initially I was anxious as I was trying driveway.com very first time.  But after some communication issues because of delay in delivery. I finally received car. Car was working fine and exterior was just fine.... Car was driving just fine without any issue.... Because of some issue I checked with Eli and Brittany for terms and conditions to return Car. I was surprised to see the process was very smooth.  I requested for car return and they initiated my car return quickly and refunded initial deposit on time.  I would say..sometimes they run into delivery issues like transit delay otherwise it was easy to work with...I only had trouble connecting dots on delivery delay...Everything else worked fine...I will definitely try again driveway.com for my next car.  Old Update:More and more frustrating process.  After my initial review Eli contacted me and help improve experience.  It turned out to be more frustrating.  It contacted me had really good discussion but after that he disappeared and didn't improve he experience I expected.  My transport coordinator Nancy disappeared as well.  I sent multiple messages and messages but no response.  Her manager Dimitri did talk to me well and I hoped for better experience after my initial discussion and after that he is not attending my call.My car was expected to deliver on 20th of March, and I am still waiting. Big purchases like car has emotional values. I was expecting it to be before my birthday and that is gone as well and ruined my birthday.  I am loosing rental everyday and now it feels like they do not care about their customer's emotion. They words do not transform into action.  Please please do not ignore reviews this and try to buy with local sellers and avoid Driveway.com as much you can.  I am regretting why did I visited Driveway.com. I am so much emotionally down with this purchase and planning to cancel the order if I do not get my car by tomorrow end of day.Update 03/27:I was informed Car had reached hub on March 23rd so I just can't accept wait days for car that is just 200miles away.  It is just not acceptable. And I was assured it has been escalated and still the same slowness remains the same that means to me there was not enough done to increase customer experience.  Words need reflection in action and outcome which is not reflecting in my case.", "rating": 4}, {"title": "It was a good experience the…", "text": "It was a good experience the communication could have been a little better but other than that it was a really good experience", "rating": 4}, {"title": "I really like the concept but they have some communication issues", "text": "Update:Finally my issues were resolved..Eli and Brittany helped me answer my queries and resolved my queries.------------I really like the concept but they are not executing properly. This resulting in frustration. I was expecting to get my car delivered on 03/20/2023 but I got the call again stating there is delivery delay.  Since they are charging almost double external transportation it is totally not acceptable. Here I am not getting benefits of overpriced transportation charges.  External transportation providing guaranteed delivery window which is not the same. Also my car needs local state inspection and then final delivery. They do not book the driver in advance so it will add more delay.. They are estimating 3 days for car delivery for 200miles away. This is not acceptable. I needed car on time and now I have to pay extra for renting car for almost a week. I am in total loss here.Update:I have been in contact with Nancy but she says there is nothing she can do based on what procedures are in place.  So it is not satisfactory to me... when you are charging more than regular transportation companies there should be responsible and timely delivery for the same.  Also it seems like I will have temp tag less than 15day and I don't believe that will be enough time as well.  So first I am still waiting for car beyond estimate delivery time and then I will not be able to use it if temp tag expires. On top of it I am loosing money for rent.  If I had bought locally there would not be such issue.Driveway.com experience is really not satisfactory and up to mark when compared with other online car buying experience. Will Driveway.com refund for inconvenience because of late delivery?  Will I get refund for rental?", "rating": 4}, {"title": "Great price for my trade in better than…", "text": "Great price for my trade in better than any local dealer offered. Car arrived as advertised my wife is loving it. No registration yet but it’s only been three weeks hopefully it’s here before too long. Overall a good experience thanks to the Driveway staff.", "rating": 4}, {"title": "Driveway made it right in the end!", "text": "I made a purchase of a used vehicle through them in February 2023. Although there were some difficulties through the purchase process and initial issues with the condition of the vehicle upon receipt, their team worked closely with me to remedy the situation to the best of their ability. Things don't always go smoothly and sometimes you've just got to hope that it gets made right in the end. Such was my experience. I do recommend them for those looking for a good deal on a new or used vehicle. Their team is careful, considerate and will go above and beyond for you.", "rating": 4}, {"title": "What was great was the relative speed…", "text": "What was great was the relative speed and accuracy of the transactions.  I was not impressed with Nissan Fresno; they seemed to know nothing about the car, said service details were \"private\" which is b.s.I also thought it was deceptive to claim there were two key fobs.  Yes, there were.  But one doesn't work; had old dried fruit juice inside, which undoubtedly shorted it out.", "rating": 4}, {"title": "Eli is the BEST EVER!", "text": "UPDATE 3/27/23:  Today we finally received our registration and the plate has been transferred to the new vehicle. The only reason we are upgrading to 4 stars is because of Eli. He really was the one that finally fixed the problem!!! Driveway needs to put him in charge of customer experience to deal with these issues upfront. Overall he was the only honest person we talked to!!! We thank you again Eli!!UPDATE 3/25/2023: WE NOW CANT DRIVE AT ALL!!! Promised our 3rd temp tag that we never received and now are being told there is no temp tag being sent, that now they sent our registration on the 22nd. How is that even possible when usually the registration comes from our local county??  Eli @ driveway has been great as he has gotten more accomplished than anyone! And driveway covered a monthly payment and that’s awesome and very much appreciated however it doesn’t solve the problem, because now we can't drive at ALL!  At this point I would suggest buying somewhere else!!", "rating": 4}, {"title": "Ordered a vehicle February 13", "text": "Ordered a vehicle February 13. Here it is March 10 still no vehicle. Paid deposit and anything else that was suppose to be paid. Received a letter in the mail regarding a payment that’s coming up for the first month but still don’t have the vehicle. Nobody knows anything. Just stick with Carvana or Vroom. I would’ve been had my car if I chose to go with themUPDATE: I received the vehicle as stated in the comments! And I love it!! They are also sending me a check for the inconvenience! Thank you!", "rating": 4}, {"title": "Overall very satisfied with the…", "text": "Overall very satisfied with the process.   There was a minor incident with delivery involving debris that was run over, however the tire & rim were replaced  and your team kept us in the loop throughout until the the car was finally delivered.", "rating": 4}, {"title": "Really appreciated the actual human…", "text": "Really appreciated the actual human interaction throughout the process. Although it felt like I talked to several different people. Would have been nice to be paired with a specific person.Also the amount of time from start till receipt of delivery was 13 days. Felt really long when you can be in and out of a dealership in a few hours.Overall very good experience though", "rating": 4}, {"title": "This was my first-time buying a vehicle…", "text": "This was my first-time buying a vehicle on line. The vehicle was delivered much faster than anticipated. There were a few issues after the delivery but Lidia from customer care solved the issues so I feel much better about my experience at driveway.  Thanks Lidia your the best!", "rating": 4}, {"title": "I would have liked at the end of the…", "text": "I would have liked at the end of the deal if my loan approval was ok.They didn’t call but I figured everything went ok since they scheduled delivery of the new truck.Also I noticed that Driveway says free delivery of a purchased vehicle but I think I paid 900.00 to get mine delivered from Texas.", "rating": 4}, {"title": "Very positive", "text": "Everybody was amazingly responsive, courteous, helpful and pleasant!  The offer was great....more than I expected. The negatives were that it took two weeks from beginning (my acceptance of the offer) to end (pick up of my vehicle) and there were a lot of different people involved and a lot of texting....and I'm a slow texter!  All in all, I highly recommend Driveway but only if you have a few weeks ( which I did ) to close the deal.", "rating": 4}, {"title": "Customer Service", "text": "The customer service experience was outstanding. We had to back out of the transaction due to an imperfection in the car that we discovered when requesting additional pictures, however the representative Ib was extremely patient and helpful through the application and approval process. Communication was clear, fast and efficient and she would respond to text messages right away with any questions. She was also very gracious when we shared our change of mind.", "rating": 4}, {"title": "Customer service was great", "text": "Customer service was great.  That fact that you didn’t honor your previous offer when I had already started the process was very disappointing.  That’s $900 out of my pocket because of a few days. If I go to sell another car in the future that will probably be what I remember. Other than that good experience.", "rating": 4}, {"title": "Fair price offered on our vehicle", "text": "Fair price offered on our vehicle, friendlypersonnel, prompt attention.  Kristina from Troy MI location was extremely helpful!", "rating": 4}, {"title": "Had some damage done to my truck by…", "text": "Had some damage done to my truck by delivery team but driveway was quick to get it fixed. Took a little over 2 weeks to get my truck which is a little longer than I expected but everything worked out well in the end.", "rating": 4}, {"title": "Very professional and timely process", "text": "Very professional and timely process. One minor issue was not disclosed and I wish it would have been. Paint chipped on fender. Not a major thing though.", "rating": 4}, {"title": "Christina was the best!", "text": "Had no issues buying the vehicle.  The problems came with getting the paperwork, or check, for registering the vehicle with the state. Christina M. has been great through everything and super helpful.  Even when she didn't have all the answers, or even the best of news,  she still made sure to stay in touch with me to keep me updated on everything she could.", "rating": 4}, {"title": "Appreciate Rayne Betts", "text": "I just want to say thank you so much to Rayne Betts for everything. Thanks for always being prompt and on top of everything. Seriously because you kept in contact, I didn't ask for my money back and go to another company. I hope your supervisor knows that. Communication is EVERYTHING!!!! As long as people are in contact  it makes the process way better. Who would have thought the car was gone at the beginning then out of the blue I looked up a car and the same one was back for sale. I appreciate everything you did to help me purchase the vehicle and thanks for all you patience for explaining the process esp not feeling totally comfortable purchasing a huge item online. Because of you I'll recommend drive way again. Everyone should know how professional you were", "rating": 4}, {"title": "Although it was a bit off-putting…", "text": "Although it was a bit off-putting sending everything in before picking up the car.The offer was fair and you stuck to it.", "rating": 4}, {"title": "So far so good!", "text": "So far so good!I was a little skeptical about Driveway at first because I had never did any transactions like this for a vehicle. But after working with Sarah I became a little more comfortable with the process. She has been awesome with taking care of the needs that I have addressed. Not to leave anyone out the team that was my point of contact was always available when I reached out. Sarah thank you for all your help. I do love my Lexus!!! 1/07/2023.", "rating": 4}, {"title": "I like buying things online and decided…", "text": "I like buying things online and decided to buy my first truck with Carvana. Needless to say, after getting screwed by them I tried driveway, which was a better experience all around. They can improve the car search feature and following through, but it's clear there heart is in the right place. Several reps including Alex and Sarah seemed to really care. When Sarah was on the caee she worked hard to resolve my issues. If anyone from driveway reads this look at uniformity the car search/image tool and keep the financing flexibility.", "rating": 4}, {"title": "Great costumer service", "text": "They live up to their claim. Very fast and courteous. Overall a great experience.", "rating": 4}, {"title": "NOT BAD, JUST NEED BETTER COMMUNICATION", "text": "I purchased a vehicle from driveway.com 11/7/22, everything was going decent, every step was a little delayed but other than that it was moving along smoothly. I was told that I'd have my plates within a couple weeks, its been 3 weeks so I decided to call the state DMV to get the status of my plate, they have no record of anything being filed! Where I live in order to get a temp tag MVD needs the title, so no temp tags for me. I call driveway.com to see what is going on in their end and they tell me they don't even have the VIN inspection or the title yet and may take up to 3 months to receive it. SO WHY IS DRIVEWAY SELLING A VEHICLE WITHOUT HAVING THE TITLE IN THEIR POCESSION?? Also I was told if I go and get the VIN inspection done that it'll speed up the process so I did and apparently speeding up the process still means \"at least 2-3 months and in some cases it may take longer\". Now I'm left with a vehicle just sitting in my driveway that cannot be driven legally and insurance to be paid. WHAT A JOKE!! I wish I would've seen these reviews instead of the fake ones on their website before purchasing from them. IF YOU'RE READING THIS TAKE MY ADVICE AND BUY LOCALLY OR ATLEAST AVOID DRIVEWAY.COM. They get 2 stars instead of 1 because their customer service agents did answer quickly and were very nice, at the end of the day it is not their fault, Its the horrible company they work for. I will update my review and rating if anything changes. Fingers crossed.UPDATE: I contacted customer service on January 2nd and was connected to driveway mvd agent and they were able to give more details and an ETA, eta was January 27th. I received my license plate on January 5th! Exactly 1 month after my vehicle delivery date, I’m not sure if this review helped speed up the process but it was quick. I recommend getting connected to their mvd agents and ask them for an update, request for them to look up the status of the registration and they will let you know if anything is missing and will hopefully provide and ETA.", "rating": 4}, {"title": "Great Truck", "text": "Very happy with my truck. The plates and registrations took longer than I would have liked, but they did make sure I had temp plates.", "rating": 4}, {"title": "all in all a great experience and you…", "text": "all in all a great experience and you do good work!", "rating": 4}, {"title": "Great Company", "text": "I first want to say though this company is great. Of course every company has some things that they need to work on and do better. I’m glad they’re reaching out for reviews just to see where they can work on things or just see where they’re doing great on. From the beginning of dealing with this company, they were cool. The communication was OK. I felt like it was kinda overwhelming when it came to them pressuring for payment. I was not OK with paying for something that I wasn’t going to receive for almost a month I was not informed about a $500 deposit that of course goes towards the down payment that I wasn’t sure that I was going to have to pay prior to receiving the car. But nonetheless that wasn’t too much of a big deal. My issues that I have is due to the fact of them already reporting to the credit reporting agencies, before I even got my car not quite sure how that’s even possible. But I’ll handle that at a later date. I also didn’t like the fact that the contract and other legal paperwork that I need to sign was dated at the time that I actually ordered my car which was September 28, 22, but didn’t actually sign paperwork till October 7. The other issue that I have is that they’re basically trying to force me to sign a power of attorney for “DMV paperwork” but as stated before this will be something that I will handle later. Outside of that, this company has been fine. I will say when it comes to issues though they are trying to either help or there’s someone that will within the company.", "rating": 4}, {"title": "Simple, easy, done.", "text": "This process was fairly straightforward and simple. I enjoyed the ease of the PAVE inspection and submitting the required documentation. I wasn’t the biggest fan of the changing of hands for each of the steps of the process. Having one point of contact and one reference would be preferred. The handoffs were not seamless and caused questions and delays where there needn’t be any.", "rating": 4}, {"title": "Easy Process", "text": "The whole process was quick and easy. Everyone was helpful.", "rating": 4}, {"title": "Almost 5 stars", "text": "I see they have a rating of 3 stars. I read reviews before I committed to doing business with them but I had no choice even though the time it took was a lot longer than what was stated. With that said, they honored everything thing with respect to buying my vehicle and closing out the account with my finance company. A huge weight was lifted off my shoulders and I can finally breath again knowing my vehicle is gone and my obligation to my finance company is over. Thank you so much for everything. Had it not been the delay of 2 months Va the 3 weeks I was told this would take, I would have given 5 stars but 4 is still a good score.", "rating": 4}, {"title": "A few kinks to workout with the process but overall good experience", "text": "The front-end team was a bit disjointed and took awhile to respond to inquiries; however, the back-end portion of the process (once all paperwork was returned) moved efficiently and promptly!", "rating": 4}, {"title": "I recently sold me car to Driveway", "text": "I recently sold me car to Driveway.  The offer was extremely competitive and the transaction was smooth.  The loan was paid off within a few days.  The check was given at the time of sale, the inspection was not tedious and the employees were kind and considerate.  The only complaint I had was that my first offer was great and I tried to accept it, but could not get anyone to respond to my texts or emails.  I therefore had to resubmit and the offer price dropped.", "rating": 4}, {"title": "Good experience", "text": "Overall, I was happy with my Driveway experience. I would have appreciated a little more communication along the way and the process took a little longer than I expected but otherwise everything was very smooth and convenient. I have already recommended Driveway to a friend.", "rating": 4}, {"title": "There were long delays but customer service was helpful", "text": "I am updating this review.Driveway makes it super easy to buy a car.But, (1) the site did not indicate the vehicle I bought was not yet at the dealership.  It was in fact in transit so it was a couple months before I received the vehicle, and (2) it took 4 months to receive the plates from the time the vehicle arrived.On the positive side, the Driveway folks were super helpful in resolving the problem with the plates, which I appreciate.", "rating": 4}, {"title": "I thought my experience was very good", "text": "I thought my experience was very good. I believe I received a fair price for my vehicle. The process was really slow, however. I would recommend Driveway to others.", "rating": 4}, {"title": "Some misinformation but Tim was excellent!", "text": "There were many people at Driveway who gave me incorrect information and that was frustrating.  The process took longer than expected but when Tim started helping me it all went very smoothly", "rating": 4}, {"title": "Overall smooth with a couple of…", "text": "Overall smooth with a couple of caveats. It seems they recruit the sale of your car, it is assigned to an agent to transition you to submit your inspection. I had issues with their link, my account was dropped out of loop for follow up. I was left to make a few calls to finally schedule an in person inspection, which was very easy. The actual pick up and payment was so easy, but there was no email/ text confirmation of the pick up appt until 20 minutes before Driveway arrived to pick up my car and deliver check. I would have given 5 stars if communication was better or if a single agent could handle the transaction from beginning to the end…", "rating": 4}, {"title": "The upfront experience was fast", "text": "The upfront experience was fast, responsive and the quote provided was the best I received. The back end process was a little slower than I would like. It would be great if their was a tracking process that showed where your documents were along the timeline.", "rating": 4}, {"title": "Easy and simple but…", "text": "Easy getting a quote and finalizing the transaction with payment within 24 hours. The waiting between the quote and finalizing the transaction took a while with little communication. I had to call multiple times to get status.", "rating": 4}, {"title": "Is driveway.com a real company lol???", "text": "Update:  a supervisor called me back to explain that they are super backed up but that the paperwork is on its way.  I’ll continue to update the process.Selling process lack of follow up:I’ve been chasing driveway.com trying to get the status of the sale of my vehicle to them. They made me an offer- I accepted same day- received a text from Chloe- responded immediately-. Completed the link for the online inspection… been crickets for days since. No follow up, no response, no sign of any progress. I’ve called 4 times… been given the run around.  Go with a reliable buyer like carmax or anyone else- these people waste your time-and these reviews are a testament to that.  Also- I finally thought I was receiving a response at 6:17AM this morning- nope.  It was driveway.com, but a sales guy asking about my interest in buying a car!!??? What???? I’m shocked at this company.  You guys- get it together.  I’m going with carmax.  This place is a joke.", "rating": 4}, {"title": "Selling my car", "text": "Just take extensive time to complete the sale", "rating": 4}, {"title": "Driveway was a good first experience…", "text": "Driveway was a good first experience selling a vehicle on line. We agreed on a price around three weeks ago. It took about three weeks for us to bring the car to a dealership, sign the paperwork and receive a direct deposit into our account. We received a fair price for our Acadia and selling to Driveway was a good experience.", "rating": 4}, {"title": "Buying process was easy but…", "text": "Buying process was easy. The temp dealer tags however were only for a month which isn’t nearly enough time for us to actually get plates from our home state. Buyers should be informed of this at time of sale. Delivery was May 13 but dealer didn’t mail license registration until 6/23rd. That need to be done faster. That being said we worked with Christina from customer satisfaction who was SUPERB in her response and efforts to get this rectified asap. Kudos to Christina!!!", "rating": 4}, {"title": "Good Experience", "text": "The overall process was relatively easy and Driveway took care of most of the paperwork, which was helpful. The turnaround time to process that paperwork was slower than advertised due to high demand which is the reason for 4 instead of 5 stars. If I had a friend looking to sell their car, I would recommend Driveway", "rating": 4}, {"title": "Great!", "text": "Process takes awhile but they are always there to answer questions. If you are looking to sell your car but don’t need to rush, driveway is a great way do it.", "rating": 4}, {"title": "Lovely selling experience till they…", "text": "Update: Contacted by another agent and was able to complete the selling experience.  Every person I interacted with whether online, on the phone, or the person who came to my home to pick up the vehicle was notably positive and friendly.  Overall, I'd recommend using Driveway to sell your car as long as you're not in a rush to get paid.Lovely selling experience till they dropped off the map.   Offered me a competitive price for my car so I went through process of submitting title pics, driver’s license, registration etc.  They then sent a link to a cool app used to take detailed photos of the car matching superimposed outlines of the car in the camera viewfinder.  I completed that process and was sent a congratulatory text saying I’d completed all the steps and they’d be overnighting paperwork to sign.  It said they were backlogged a couple of days, but I’d receive it shortly and bank deposit would follow in 3-5 days. That’s was June 24th and haven’t received anything in the mail and the previously responsive agent hasn’t responded to my update queries. Maybe he’s left the company, but I assume they have a process for replacing him if so?", "rating": 4}, {"title": "No temp tag or paperwork", "text": "I would give it 5 stars but we have yet to get a temp tag or anyone called to inform me about a temp tag.  We need that to drive.", "rating": 4}, {"title": "I'm giving this a 4 out of 5", "text": "I'm giving this a 4 out of 5. If there were no bumps in the road, it would have got a 5, but also if every person I dealt with at driveway wasn't pleasant, it would have got a 3. Every single person I dealt with over the past couple months, which had to be about 20 different people, they were all very kind, respectful and trying to help me get what I needed. The true and simple fact of my only dissatisfaction was the time it took to do this process. Other then that everything went pretty well", "rating": 4}, {"title": "Terrific service! (… but don’t be in a rush).", "text": "Driveway made a very competitive offer for my used BMW.   Sending documents by email and arranging a pickup appointment when very well.  And on the appointment date their rep took an UBER to my house, and after paperwork was completed and plates removed he handed me a check for the original offer amount and drove it away!  The only niggle was some lost time for about 4 weeks before hearing about my scheduled appointment (sent docs on April 6; car picked up June 1).  Its busy in the used car market and you may need some patience.", "rating": 4}, {"title": "Hassle-free and efficient sale", "text": "After a quiet day or so, the offer came in a little higher than competitors' offers. The communication lagged a bit due to the company being very busy, according to the people I spoke with, but they picked up the vehicle with a quick inspection and the check in hand. The whole process took less than 2 weeks, I didn't have to pay to list the vehicle, and I didn't need to answer a thousand calls or questions. I'm happy with this process and the result.", "rating": 4}, {"title": "Every thing Driveway said the would do…", "text": "Every thing Driveway said the would do the did. Easy pick up - the \"inspector\" was great. Brandi (a manager) was super. Other staff  not so much. Responses slow, sometime no response or vague. The \"direct pay\" process was very bad - finally paid  by check which worked out great. \"do to heavy activity and lack of personnel wait times may slow\" of how I hate to here that when i call", "rating": 4}, {"title": "It was a pretty smooth process", "text": "It was a pretty smooth process. Until we got to the delivery process. It all came to a hault and I didnt have any communication from anyone. I called twice and expressed my expectations and they were on top of it after that. They went above and beyond to get me my car asap. Thanks to Tanya T and Lue who worked together to make this happen!", "rating": 4}, {"title": "How fitting that the tags would show up on Friday the 13th.. It really has been a nightmare and a dream come true. See how.. PS -You’ll need patience, prayers, and alternate means of transportation…", "text": "I had a lot of problems and it took me a few days shy of 150 days to get hard plates for the vehicle. 6 months ago I bought the vehicle. Got the tags today. It only took me one attempt with my down payment ($500) and inventory.Some people would say run, however based solely on my experience I would say tread lightly, the vehicle was overall a good deal and in great condition..Breakdown in communication full spectrum, primarily all of which is done through email chain, call centers, and 3rd party companies.Rewind:Nor driveway or five64 asked for my POA or the car inspection until nearly 90 days had passed since buying the car..I pestered them eternally despite their continued negligence.I then had to do 3 notarized POAs due to various issues, despite me correctly filing out the first one correct they somehow lost (they claimed I didn’t need to fill out the top portion - which I wouldn’t have if it had been properly communicated to me in the first place). The third POA was necessary thanks to a notary error with the second one.On top of having to go through all this, I was now tasked to go to the BMV, for the vehicle inspection that wasn’t done. The BMV, incorrectly sent me to the title agency, where I waited cramped for nearly 3 hours only to find out they couldn’t help me since driveway had not sent any information to BMV, the BMV sent me there not understanding I intended to let the nearly hopeless 3rd party “Five64” procure them.Naturally, the vehicle also had a common issue / code with the model / year within the 2nd day of taking possession. Maybe I’m a pre-cog clairvoyant man, because the night before they delivered it I dreamed it had a $600 repair and I made them take care of it, the reality was not far off. ($706.32), and I had to argue with the Chevrolet dealership about lowering the bill the second time around since it was their fault I was back again for the same issue.. A piece of rubber was lodged inside thermostat, which it to stay open, causing multiple other issues with the vehicle. First (Chevrolet) incorrectly replaced the coolant thermostat sensor The problem was causing battery drain (fan running after vehicle turned off due to safety feature to keep from overheating), not allowing functionality of the A/C (or heat), and caused me a LOT of stress, and time consuming visits to the Chevrolet dealership..Driveway and Five64 made me so angry I tried everything from threatening legal action and consumer protections and actually getting smart with employees. I don’t like to be this way as it’s not my nature and I found it very disheartening that this coupled with persistently pestering their customer service reps proved to be the ONLY way to get results..Furthermore, we even had problems with the guys delivering the car, since they tried to deliver it to the wrong house at a faraway street and neighborhood.. AND they drive the vehicle from wherever it gets hauled to for “safety inspection”. So ~150+ extra miles. But it came with a full tank..Purchased a 2011 Chevy Equinox LT1 AWD with 72K for under $13K delivered to the door. I am grateful, and possibly gray haired now from the process. How fitting that the tags would show up on Friday the 13th.. It really has been a nightmare and a dream come true. Literally.Driveway really needs more honest open clear communication and timelines..I am not sure if there is legality problems with their practices in regards to plate procurement. The lawyers were about hopeless too. Probably not worth protracted arbitration..I am totally averted to buying cars online now.Carvana is not worth the markup & lies, they approved me fully but I backed out because it was a bad deal and then they had the nerve to pretend to have denied me in the first place. Carmax however did not give me any issues in person several years ago. The experience was “lackluster” however the car itself in some ways exceeded my expectations.Also was not provided with a temp tag. I was able to procure one on my own, so that eased the pain a little — I guess.", "rating": 4}, {"title": "Driveway did the right thing", "text": "Update: Driveway reached out and offered to refund the shipping fee due to the omission of the damages on the vehicle I was buying. Driveway started out great. Gave me a great offer for my trade. My vehicle was shipped to a local Driveway hub where I went to inspect it. Deep paint scratches to two doors, poorly touched up, Worn Bridgestones on the rear paired with two new low end Goodyears on the front, a damaged side step they tried to blame the  carrier, who had proof that it was damaged at pickup, rear seat leather was badly worn and a new Ford Battery was installed that was much smaller and lower than recommended CCA for this Lexus V8. Im out $500 to ship the vehicle after I foolishly took the word of the dealership that there were no issues with the vehicle. I asked for pics before the vehicle shipped that were not taken. Buyer beware.", "rating": 4}]