[{"title": "Prompt and professional service", "text": "Prompt and professional service.  Competitive pricing.  Experienced staff. ", "rating": 4}, {"title": "Brian was very helpful", "text": "Brian was very helpful, and the service was great. We are waiting for 3 items to be here on a deadline and hopefully that does happen. ", "rating": 4}, {"title": "Search for kitchen equipment", "text": "They die not have the items I needed in stock and were not expected before another 6 weeks or so. The supply chain issue so not their fault. The sales person was helpful and patient with me.", "rating": 4}, {"title": "I recently purchased a dishwasher from…", "text": "I recently purchased a dishwasher from ACityDiscount, and I was very impressed with their service. The staff were knowledgeable and helped me choose a model that fit my needs and budget perfectly. The delivery process was smooth and efficient, and the installation team did a great job setting up the dishwasher and making sure everything was working properly before they left. Overall, I had a great experience with this company, and I would definitely recommend them to anyone in the market for a new dishwasher or other home appliances.", "rating": 4}, {"title": "Placed order online and it was…", "text": "Placed order online and it was delivered in a timely manner. I did have questions while shopping online and logged in to chat and was never answered.", "rating": 4}, {"title": "A city Discount is awesome I just…didn't like the person that waited on me", "text": "A city Discount is awesome I just didn't like the person  that waited on me. Service was great delivery was awesome", "rating": 4}, {"title": "ACityDiscount is a great site", "text": "ACityDiscount is a great site. This is a very nice place to buy cheap products! I love it! The prices are amazing, and I can get my product within a few days. This is the best site for me to get things like this because I don't have time to go shopping or visit stores. They have everything I need at an affordable price.", "rating": 4}, {"title": "Easy to Work With!", "text": "Easy to purchase product. ACityDiscount shipped out product timely. Item arrived as advertised.", "rating": 4}, {"title": "Ordering was easy and efficient", "text": "Ordering was easy and efficient Shipping was not so good. The package was not delivered when they said it would be. Two days later", "rating": 4}, {"title": "over all i am satisfied still not used…", "text": "over all i am satisfied still not used my wok once i used it will update more", "rating": 4}, {"title": "Josh was very helpful and knowledgeable…", "text": "Josh was very helpful and knowledgeable about the equipment. Good experience over all.", "rating": 4}, {"title": "Really contented with the furniture", "text": "Really contented with the furniture. Very helpful staff reasonable prices & good quality.", "rating": 4}, {"title": "Great, customer service", "text": "Mike was the associate that helped and he was very knowledgeable and helpful.", "rating": 4}, {"title": "all in all a great experience and you…", "text": "all in all a great experience and you do good work!", "rating": 4}, {"title": "i have a great experinced i bought a…", "text": "i have a great experinced i bought a philip screw, it is past and easy", "rating": 4}, {"title": "Good communication", "text": "Good communication, fair price, shipped at a reasonable time ", "rating": 4}, {"title": "Leslie Great Job!", "text": "Great Kob by Leslie, she went out of her way to find a machine for me.", "rating": 4}, {"title": "Timely", "text": "Timely, good quality and brand new!", "rating": 4}, {"title": "Sales Person . Luis Diaz", "text": "Ease to process the order.", "rating": 4}, {"title": "Roof fan", "text": "Had what I was looking for and delivered on time", "rating": 4}, {"title": "goods delivered before promised", "text": "goods delivered before promised. Fair pricing.", "rating": 4}, {"title": "kitchen products wide variety...", "text": "Date of experience: April 23, 2022", "rating": 4}, {"title": "Georgia peach plumbing is my hero", "text": "Georgia peach plumbing is my hero love Noah", "rating": 4}, {"title": "very helpful,was quick delivery", "text": "Date of experience: June 30, 2023", "rating": 4}, {"title": "I have not received my purchase", "text": "I have not received my purchase, as of yet.  I see that it was shipped USPS, so I am expecting it any day now.  I saw what appeared to be a tracking number, but the site did not have the tracking number set up as a link to track my items.  Other than that, I was very satisfied with my purchase.  Again, I have not received the package to see the condition of the items that I purchased.", "rating": 4}, {"title": "Our buying experience was amazing but delivery was not", "text": "Our buying experience was amazing and the oven is perfect. The only issue we had was with the delivery : the oven was unexpectedly delivered. We had received no tracking number, and no appointment taken (despite clear instructions on the packing slip) and the +100lb package was left in full sun on the parking lot, not even close to our door. We actually received a shipment email and tracking number 1 week later...", "rating": 4}, {"title": "Need to change the prices on the display boxes to match the computer prices", "text": "Buy the knifes set but was priced $150 and they charge me$175 .i ask they why and say the price was change on the computer but not on the display box so they still charge me $175 even if i show them the box was marked $150", "rating": 4}, {"title": "Good selections of electronics…", "text": "Good selections of electronics available at very reasonable cost. Premium quality products. Offers amazing deals and discounts on every product which we bought from their site. Happy with the quick shipping process and attentive customer support service. Satisfied with my purchase.", "rating": 4}, {"title": "Everything was amazing!!!", "text": "Date of experience: May 15, 2024", "rating": 4}, {"title": "Acitydiscount good deals", "text": "Acitydiscount provides one on one consultation catered to the clients needs.You may have to call a few times but they will give you advise in the right direction. They also will provide written quotes.They also ship direct to wherever you are in the U.S so don't worry if you are not located near them.", "rating": 4}, {"title": "From start to delivery very efficient", "text": "From start to delivery very efficient. Great experience.  ", "rating": 4}, {"title": "All the staff I spoke with were polite…", "text": "All the staff I spoke with were polite and helpful when I was trying to complete the order and payment. We are a Church that utilizes out kitchen for a weekly community dinner, other meals on weekends and a Thanksgiving community meal so we needed the refrigerator ASAP. You had my order ready to deliver in less than a week.  We will be doing business with you again soon. Thank you, Barbara Smith, Willow Praise Church", "rating": 4}, {"title": "Purchased a sliding top cooler ...", "text": "I did my homework before purchasing so I didn’t need a lot of help.  The shipping company seemed to have the unit a long time before scheduling delivery after I was told it was out for delivery.  I was asked to do a review 4 days before receiving the cooler.  The unit itself is well built, looks and operates good so far, and was purchased at a very fair price.", "rating": 4}, {"title": "Shipment was fast, UPS abused the shipping carton.", "text": "No problems with their service as the shipment went out the next day after purchasing online. The only issue I had was with UPS abusing the microwave carton by apparently dropping it at least once and puncturing the box in three places.  It’s a miracle the microwave arrived unscathed and functions well. I would highly recommend ACD shipping department place FRAGILE stickers on these shipments to at least hope someone with UPS will take care in S&H.", "rating": 4}, {"title": "I had a great experience buying my …", "text": "I had a great experience buying my convection stove eye . Salesmen told me you could use any cookware on it . On outside of box when I received it , it says you have to use certain kind of cookware . Could you clear that up for me ? I haven’t opened it yet to read about it in case I decide to return it . I certainly hope I don’t . Thank you !!!!👍👍", "rating": 4}, {"title": "So far so good.", "text": "This single transaction worked out fine. I got a email when it was shipped and the item has been delivered in good shape.   I also ordered a much more expensive item from them the same day on a separate order-----(Ice Machine) but so far have not gotten a email as to whether the second order has shipped yet or not, or when it is expected to arrive.", "rating": 4}, {"title": "TurboAir-M3 series", "text": "Overall I was pleased with my purchase of the turbo air refrigeratorAdam was very helpful in helping me select the right unitthe reversing of the door was quite involved-much harder than I expectednot your problem turbo airIt's been running since last Thursday(19th)We are experiencing an issue with door sensors-found out this is ajust released new model--It's having some issuesHaving to replace the control panel unitall covered by warranty", "rating": 4}, {"title": "Good product; poor packaging. WT", "text": "Appears to be a good quality product. Packaging was very poor with absolutely no padding between the box and the product. Miraculously, there was only very slight damage during shipping. The seller advised me in advance to check the product before accepting; I expect the poor packaging has been a problem for them before.  Any heavy metal object should be packaged better than this before it is given to truckers and package handlers to toss around. Overall I am very pleased with the product.", "rating": 4}, {"title": "Not bad", "text": "Everything was prompt and quick. My only issue is the lack of clarity on the website about returns. There needs to be a clear tab or option that details how to get into contact with the returns process. (To note, return not needed because of ACityDiscount) But everything else was as expected and delivered correctly the first time.", "rating": 4}, {"title": "This store surprized by the assortment of furniture here.", "text": "In my opinion, it's very important for human to find the time in their tight schedule in order to dedicate it to household chores. That's why I once have decided to start finding a proper store to decorate my room with new stuff and replace the old furniture with a new one. This store surprized by the assortment of furniture here. You can easily find the most suitable option of couch for example and you won't actually spend too much time on it. This is the main feature, that everything goes very fast here. Customer support is on a solid level, mostly because they are very responsive and I guess quite responsible.", "rating": 4}, {"title": "Overall very good service and quick to…", "text": "Overall very good service and quick to answers questions. I also appreciated the email confirming the power supply thing.The only point of improvement I would add to that is featuring pictures of the plug. While we had a three phase set up with 50 amps the plug was slightly different which delayed us a bit.", "rating": 4}, {"title": "Pros (and cons I think I can live with)", "text": "I didn't expect the shipment to arrive so quickly.  The price was 2/3 of what I would have paid to Vitamix for this particular blender carafe.  I only wish that I had received the exact model shown on the online page, which had the original rubber ergonomic handle--as opposed to this thin plastic one; also, the lid jiggles around as if it will fall off when I'm blending.  The original lid has a special lip that secures the seal.  I will see if my original lid will fit the new carafe.", "rating": 4}, {"title": "Quick Fix for Old Chairs", "text": "The seats were perfect for replacing our two old chairs and they arrived very quickly.  I would give 5 stars, but one seat has a tiny vertical stress tear (1 inch) in the very front.  We don't care enough to send it back, but maybe it snuck past quality control.  Or perhaps it tore during shipment?", "rating": 4}, {"title": "I would give 5 stars", "text": "I would give 5 stars, except for the delivery information.  One appliance was coming by Fedex and because I set it to go to my business address, there is no way to get notified as to when it might arrive. The only information I was given is that it could arrive between 8:00am & 8:00 pm.  For the other, the tracking number wasn’t identified, on the invoice, and I had to contact the shipping company to get an idea as to when it would arrive. Being that I am in a rural area, deliveries take longer than usual.  Still waiting on the oven to arrive.", "rating": 4}, {"title": "Ice machine arrived with a dent in the…", "text": "Ice machine arrived with a dent in the side. Shipping box wasn't damaged, so it was boxed that way from the manufacturer. Wasn't a big deal for me as the machine is under my island and the dent isn't in view. Everything about the purchase went smooth and item arrived promptly.", "rating": 4}, {"title": "Excellent customer support service", "text": "Excellent customer support service provided by ACityDiscount. Bought one Electric 6 Burner Restaurant Range with Standard oven which can be used for commercial as well as house purpose. Liked the quality of the product very much.", "rating": 4}, {"title": "Ice Maker Scotsman 65lb Undercounter", "text": "First, I paid $50 to have it brought into the house.  That did not occur.Second, the condenser is loud.  Is that common with this model.  I did not have this issue with the previous ice maker.  Any idea why it is so loud???", "rating": 4}, {"title": "The experience in placing and receiving …", "text": "The experience in placing and receiving my order was very easy and I received what I ordered in a timely manner. There was no shipping damage to the equipment which means that it was packaged well and the shipping company that delivered it took care in handling it.", "rating": 4}, {"title": "The ice machine I ordered took a little …", "text": "The ice machine I ordered took a little longer to get to me than originally discussed but my salesman, Ned followed up as best he could, I think the issue was with whom the distributor was for this particular machine. Good prices and good communication.", "rating": 4}, {"title": "I am very satisfied with the speed of …", "text": "I am very satisfied with the speed of the delivery, but the driver failed to give me a call even though it was stated on the slip. I was called from another site, by the time I arrive in 20min, the driver was gone after dropping off the equipment.", "rating": 4}, {"title": "Normally would be five stars", "text": "Normally would be five stars.  Product and shipping are still good quality and fast.  Packaging this time was in a much larger box, had some concern about product integrity, but appears to be in good shape.", "rating": 4}, {"title": "The thermostat Control is in the way of…", "text": "The thermostat Control is in the way of installing the legs on Deep fryer have to remove thermostat control in order to secure them too unit ...... Have not used fryers yet we'll get back with you on how they function at a later date.", "rating": 4}, {"title": "Delivery from purchase to front door…", "text": "Delivery from purchase to front door was wonderful. However the product itself is in question. The cooler doesnt seem to be cold enough and it's been on for 3 days now. Gonna give a little more time and see what happens.", "rating": 4}, {"title": "Quick service.", "text": "Date of experience: November 15, 2023", "rating": 4}, {"title": "The product ordered is as advertised…", "text": "The product ordered is as advertised and was delivered in a timely manner. The shipping box was damaged and noted as such by the USPS and the item was not damaged. However, the shipping charge was excessive.", "rating": 4}, {"title": "drain pan", "text": "The item was good, only problem in shipping, ups had to have me sign for the package, I missed them 3 times and had to drive 20 miles to pick it up at the ups hub. Don\"t know why  I had to sign for a 20 dollar item.", "rating": 4}, {"title": "quality products....", "text": "Date of experience: April 21, 2022", "rating": 4}, {"title": "Update on ACity's response", "text": "Well, ACity finally came through.  They covered the service call and gave a little extra for the inconvenience.  They did have to fight with the manufacturer like I did but guess they had more leverage and won out.  Got the check today.  Bad thing is, the other unit I bought from them (same manufacturer) now went down. Must be something about getting close to end of warranty. They said it should be no problem reimbursing me this time as they straightened things out with the manufacturer. I would have gone to 5 stars but with all the initial problems, no call backs etc I went with 4 due to their fighting for me with the manufacturer.  I'd buy from them again but will ask more questions also. Just good business practices.", "rating": 4}, {"title": "Individual pieces", "text": "They arrived before the expected date and were exactly what was needed.  Thank you for your assistance.  I liked that I could buy them as individual pieces instead of packs of 12.", "rating": 4}, {"title": "I recieved my order today and haven't…", "text": "I recieved my order today and haven't had a chance to put it to work. So far it looks sturdy enough to do what I need to do. Would like to put it to work before i give it five stars.", "rating": 4}, {"title": "It was quite impressive experience", "text": "It was quite impressive experience. Thanks", "rating": 4}, {"title": "Great place to shop", "text": "I shopped around for six months and A City Discount had the best over all prices.  Customer service was fantastic my only regrets was not ordering before they started charging sales tax", "rating": 4}, {"title": "the products I ordered were delivered …", "text": "the products I ordered were delivered on time and in perfect condition. This company sent enough information for me to track and know within an hour of delivery. I will be ordering again.", "rating": 4}, {"title": "good services", "text": "Date of experience: April 27, 2022", "rating": 4}, {"title": "Quick Delivery", "text": "Had what we wanted and was able to deliver it quickly. Ordering on the phone took longer than I would have liked. Overall, I am happy to continue doing business wit ACityDiscount", "rating": 4}, {"title": "Fast shipping & great selection", "text": "Fast shipping great selection although the lid arrived slightly dented I would say it was the shipping companies fault it wouldn’t prevent me from purchasing from Acitydiscount again", "rating": 4}, {"title": "Positive experience, excellent customer service", "text": "First experience I had issues with the order I had placed however they were very quick and helpful in rectifying the issues I had. I placed a second order and it went flawlessly.", "rating": 4}, {"title": "Good price Really fast delivery    Only…", "text": "Good price Really fast delivery    Only problem was that the shipping company did not call us they just showed up on Friday night luckily we were at work.", "rating": 4}, {"title": "Ordered a part for my wife's mixer", "text": "Ordered a part for my wife's mixer, was able to use Amazon Pay which made things nice and easy. The part arrived earlier than expected and in good condition.", "rating": 4}, {"title": "more detailed instruction on connection…", "text": "more detailed instruction on connection more detail on shipping other than that fast delivery very easy to work with will do business with company again as needs arise", "rating": 4}, {"title": "The item was ship promptly and although…", "text": "The item was ship promptly and although the aprons are of ecellent quality, the pinstripes on them are larger than they appear . I was looking  for thin pinstripe aprons.", "rating": 4}, {"title": "Every time kitchen cleaningI am Upendra I have belong Odisha Jajpur I am very punctuality I am very sincere I have work hard", "text": "Every time kitchen cleaning. Every time let's on kitchen insi. Everytime second gas cylinder. Kitchen room every time clean", "rating": 4}, {"title": "But for the fact that I was not told…", "text": "But for the fact that I was not told when my dough mixer was shipped, and the expected delivery date and time, I would have given ACITY DISCOUNT fivw stars.", "rating": 4}, {"title": "One of the 6 burner not working", "text": "One of the 6 burner not working,  contacted to salesperson, got the telephone number for manufacture support, the mechanic came within two days and got it fixed.", "rating": 4}, {"title": "Water Filters for Ice machine", "text": "Not now.  I said all I had to with rating above", "rating": 4}, {"title": "Online prices are good", "text": "Online prices are good, but don't send me a catalog that says \"call\" for all the prices. That just gives me ideas to Google and look elsewhere.", "rating": 4}, {"title": "It was quick", "text": "It was quick, easy, and the product was delivered fast. The only draw back is the shipping cost was almost two times higher than the item I ordered.", "rating": 4}, {"title": "Good customer service", "text": "Good customer service. The sellers are very knowledgeable and there is a focus on making sure you get the right equipment at the best price.", "rating": 4}, {"title": "There could have been a better …great quality", "text": "There could have been a better description as far as the measurements of the item between the actual basket size and the total size of the basket.", "rating": 4}, {"title": "Unit is great and a good value", "text": "Unit is great and a good value. Shipping company didn't deliver on the day they were supposed to, and I took the day off work to wait for it.", "rating": 4}, {"title": "I gave it a 4 star", "text": "I gave it a 4 star because you failed to say in the description that it was being shipped from outside the US and causing an international fee", "rating": 4}, {"title": "Great service", "text": "Great service, fast delivery.  Could communicate quicker initially.  We did not know if the item was in stock for three days after ordering.", "rating": 4}, {"title": "Rudy was very helpful for the time I…", "text": "Rudy was very helpful for the time I purchased it to the time I got the item delivered. The delivery company was not very communicative.", "rating": 4}, {"title": "Item was needed quickly", "text": "Item was needed quickly, would have liked the option of next day delivery, but still arrived within a few days, repair was made and all is good", "rating": 4}, {"title": "on target.....showed up when they said…", "text": "on target.....showed up when they said and is just as represented....look forward to getting it up and running with the rest of our kitchen!!", "rating": 4}, {"title": "I love trying new things!", "text": "Date of experience: January 06, 2023", "rating": 4}, {"title": "Got new ovens from this guys", "text": "Got new ovens from this guys, and they are sure quality as it look like. Delivery took a longer time from the expected ETA.", "rating": 4}, {"title": "The process was smooth at the very…", "text": "Date of experience: November 16, 2022", "rating": 4}, {"title": "I haven't received my murchendise yet.", "text": "I haven't received my murchendise yet. Wrong information was provided to me about the delivery date and I am still waiting.", "rating": 4}, {"title": "Thank you for your help and please be…", "text": "Thank you for your help and please be sure to send me a catalog.  I didn't like your website its not easy to navigate.", "rating": 4}, {"title": "I was thrown abit back by the prices to…", "text": "I was thrown abit back by the prices to be honest, will be returning. thought id leave a review as it so good.", "rating": 4}, {"title": "Order didn’t arrive on date it was…", "text": "Order didn’t arrive on date it was supposed to had to call multiple times and was suppose to be called back but wasn’t", "rating": 4}, {"title": "The boxes for the hood ducts", "text": "The boxes for the hood ducts, were too small by 5 to 6 inches. They had to be rebuilt. Everything else was find.", "rating": 4}, {"title": "Great Service", "text": "Adam, provided us with great customer service. We appreciated the equipment arriving in a timely manner.", "rating": 4}, {"title": "The ice machine works great but", "text": "The ice machine works great but, there was a little damage to the unit. Either in shipping or lading idk", "rating": 4}, {"title": "The seller is happy to work with you if…", "text": "The seller is happy to work with you if you have any problems. I will buy from him again.", "rating": 4}, {"title": "Only problem I had was they insist on …", "text": "Only problem I had was they insist on adult signature and it is not convent as I work 6 days a week.", "rating": 4}, {"title": "Good service and affordable prices", "text": "Good service and affordable prices. With delivery coped very quickly. It was nice to cooperate.", "rating": 4}, {"title": "I made one call to my salesman and I…", "text": "I made one call to my salesman and I had my equipment I needed . Great customer service.", "rating": 4}, {"title": "Staff was friendly", "text": "Staff was friendly. I made my selection, loaded quickly, and got on with my day easy process.", "rating": 4}, {"title": "Great customer service", "text": "They were really helpful to me, took time to tell me about products and online ordering", "rating": 4}, {"title": "Dishes are beautiful- cobalt blue diner…", "text": "Dishes are beautiful- cobalt blue diner style. Only one mug out of 36 arrived broken.", "rating": 4}, {"title": "Only issue I had was a damaged package", "text": "Only issue I had was a damaged package.  Fortunately, the contents made it undamaged.", "rating": 4}, {"title": "The sales people were attentive to my …", "text": "The sales people were attentive to my needs and always got back to me with answers.", "rating": 4}, {"title": "They had most things that I needed to…", "text": "They had most things that I needed to start my business. Good attitude.", "rating": 4}, {"title": "Friendly customer service", "text": "Friendly customer service. Knowledgeable folks about their work and what they do", "rating": 4}, {"title": "They were friendly and flexible to my…", "text": "They were friendly and flexible to my needs. I would recommend them to a friend", "rating": 4}, {"title": "Salesperson knew very little about the…", "text": "Salesperson knew very little about the product from some of the questions I had.", "rating": 4}, {"title": "amazing service the order we placed was…", "text": "amazing service the order we placed was completed quickly and perfectly.", "rating": 4}, {"title": "We received a good price on a…", "text": "We received a good price on a proofer/warmer and very speedy free delivery.", "rating": 4}, {"title": "Great Job!", "text": "Easy to order! Quick shipping! Love the ability to connect through Amazon!", "rating": 4}, {"title": "easy to find and check out.", "text": "Date of experience: October 17, 2023", "rating": 4}, {"title": "Pkg arrived promptly and was well …", "text": "Pkg arrived promptly and was well packed, no invoice was included however.", "rating": 4}, {"title": "Wish I knew when ordering online you…", "text": "Wish I knew when ordering online you didn't bring into the building", "rating": 4}, {"title": "Cost, Quality, Delivery", "text": "Cost: amazing! (Low)Quality: seems quite goodDelivery: arrived quickly", "rating": 4}, {"title": "Excellent service", "text": "Excellent service. i was shock on the return call to check on my order..", "rating": 4}, {"title": "William Little's honest effort got the sale", "text": "Arrived ahead of schedule well packagedas described and functional", "rating": 4}, {"title": "Staff was great and very…", "text": "Staff was great and very helpful.Excellent Service, Great selection.", "rating": 4}, {"title": "The timing was impeccable however the…", "text": "The timing was impeccable however the shipping was too high", "rating": 4}, {"title": "As described", "text": "As described, good price, promptly delivered. Will order again.", "rating": 4}, {"title": "The timing was impeccable however the…", "text": "The timing was impeccable however the shipping was too high", "rating": 4}, {"title": "It was very easy to place this order …", "text": "It was very easy to place this order and it was fast and efficient.", "rating": 4}, {"title": "Excellent service", "text": "It was quick delivery. Unit is excellent and working good so far.", "rating": 4}, {"title": "Rating the support", "text": "The support was good and we are looking forward to our product.", "rating": 4}, {"title": "I was pleased with the fast response…", "text": "I was pleased with the fast response and quality of the product.", "rating": 4}, {"title": "It's the best", "text": "It's best so far. And I request anyone to try this out!", "rating": 4}, {"title": "Products arrived in a timely manner", "text": "Products arrived in a timely manner, fair pricing, no complaints.", "rating": 4}, {"title": "Always helpful", "text": "Always helpful.  I have bought from ACityDiscount several times.", "rating": 4}, {"title": "It would make ordering easier if you…", "text": "It would make ordering easier if you accepted Purchase Order", "rating": 4}, {"title": "First time order", "text": "First time order thats why a 4 other wise excellent experience", "rating": 4}, {"title": "Would have given 5 Stars", "text": "Would have given 5 Stars - S&H high by most standards", "rating": 4}, {"title": "Just what I was looking for and could…", "text": "Just what I was looking for and could not find elsewhere.", "rating": 4}, {"title": "Great customer service", "text": "Great customer service, and assistance with my concern.", "rating": 4}, {"title": "Staff is friendly", "text": "Staff is friendly. Got discounted items and didnt even know.", "rating": 4}, {"title": "Had item that I needed at great price", "text": "Had item that I needed at great price.  Quick delivery.", "rating": 4}, {"title": "Shipping a little slow .", "text": "Shipping a little slow .. 2 weeks to get them ..", "rating": 4}, {"title": "Order came in on time and was the…", "text": "Order came in on time and was the product needed.", "rating": 4}, {"title": "Review", "text": "Great product, speedy shipping, would shop here again.", "rating": 4}, {"title": "Very happy with the quality of the…", "text": "Very happy with the quality of the replacement seat.", "rating": 4}, {"title": "Product was reasonably priced and the …", "text": "Product was reasonably priced and the quality is good", "rating": 4}, {"title": "Part got out and arrived sooner than…", "text": "Part got out and arrived sooner than expected", "rating": 4}, {"title": "Good product", "text": "Good product.  One inpt: spout is too high.", "rating": 4}, {"title": "Got what I needed for tea party event…", "text": "Got what I needed for tea party event this weekend.", "rating": 4}, {"title": "FAST SHIP GRAT PRODUCT", "text": "Date of experience: May 09, 2022", "rating": 4}, {"title": "Great store cool price's nice staff!!!!", "text": "Date of experience: July 08, 2021", "rating": 4}, {"title": "Great Customer service & reasonable…", "text": "Great Customer service & reasonable pricing.", "rating": 4}, {"title": "everything is good but delivery too late.", "text": "Date of experience: June 26, 2021", "rating": 4}, {"title": "This one I highly recommend to everyone…", "text": "This one I highly recommend to everyone !!", "rating": 4}, {"title": "Nice folks", "text": "Nice selection", "rating": 4}, {"title": "Everything was good", "text": "Everything was good, and delivered with care.", "rating": 4}, {"title": "Good experience", "text": "Good experience.  Quick reaction to our order", "rating": 4}, {"title": "good on both sides", "text": "good on both sides, still waiting for product", "rating": 4}, {"title": "Good products good prices", "text": "Good products good prices, shipped fast.", "rating": 4}, {"title": "Quick turn around.", "text": "Date of experience: July 19, 2023", "rating": 4}, {"title": "Arrived as expected and in a timely …", "text": "Arrived as expected and in a timely manner", "rating": 4}, {"title": "I like the discount", "text": "I like the discount. Thank you.", "rating": 4}, {"title": "My item arrived ontime and great …", "text": "My item arrived ontime and great product.", "rating": 4}, {"title": "Good Price Quick to ship quality item", "text": "Date of experience: August 30, 2020", "rating": 4}, {"title": "Fair pricing for the product we needed.", "text": "Date of experience: October 18, 2018", "rating": 4}, {"title": "ICE O MATIC", "text": "Equipment came as promised no defects.", "rating": 4}, {"title": "Good customer service and great prices", "text": "Date of experience: October 16, 2018", "rating": 4}, {"title": "Everything you need for your business.", "text": "Date of experience: January 27, 2018", "rating": 4}, {"title": "Competitive Pricing", "text": "Competitive Pricing - quick shipping", "rating": 4}, {"title": "GREAT PRODUCT AND VERY FAST DELIVERY.", "text": "Date of experience: September 20, 2018", "rating": 4}, {"title": "Good fast exactlywhat I ordered", "text": "Date of experience: August 22, 2021", "rating": 4}, {"title": "Good people great service good prices", "text": "Date of experience: February 10, 2018", "rating": 4}, {"title": "I received the part that I ordered.", "text": "Date of experience: February 09, 2020", "rating": 4}, {"title": "Love your food", "text": "Date of experience: July 31, 2022", "rating": 4}, {"title": "Good price’s and delivery on time", "text": "Date of experience: August 06, 2019", "rating": 4}, {"title": "good selection", "text": "good selection, delivered quickly", "rating": 4}, {"title": "Communication", "text": "Item on stock", "rating": 4}, {"title": "everyone was profetional and nice", "text": "Date of experience: January 30, 2018", "rating": 4}, {"title": "Great price and timely delivery", "text": "Date of experience: March 10, 2020", "rating": 4}, {"title": "Great service and fast delivery", "text": "Date of experience: November 27, 2019", "rating": 4}, {"title": "Fair priced ,well packaged", "text": "Date of experience: April 20, 2021", "rating": 4}, {"title": "Great Shopping Experience", "text": "Date of experience: November 16, 2022", "rating": 4}, {"title": "great help easy on line order", "text": "Date of experience: July 11, 2018", "rating": 4}, {"title": "Quick response and delivery.", "text": "Date of experience: August 26, 2019", "rating": 4}, {"title": "Very good customer service", "text": "Date of experience: January 16, 2020", "rating": 4}, {"title": "Great service and sekection", "text": "Date of experience: November 12, 2018", "rating": 4}, {"title": "Great service and prices...", "text": "Great service and prices", "rating": 4}, {"title": "Excellent customer service", "text": "Date of experience: July 09, 2018", "rating": 4}, {"title": "great service", "text": "great service. good people", "rating": 4}, {"title": "Review", "text": "Good turnaround time", "rating": 4}, {"title": "NO hassle", "text": "NO hassle. fast delivery.", "rating": 4}, {"title": "Good price and delivery", "text": "Date of experience: May 28, 2019", "rating": 4}, {"title": "Good customer services", "text": "Date of experience: August 31, 2019", "rating": 4}, {"title": "Always helpful", "text": "Date of experience: January 09, 2022", "rating": 4}, {"title": "Good inventory stock.", "text": "Date of experience: December 28, 2018", "rating": 4}, {"title": "Great place to shop.", "text": "Date of experience: August 06, 2018", "rating": 4}, {"title": "good and qualtiy", "text": "Date of experience: May 23, 2021", "rating": 4}, {"title": "Good experience", "text": "Date of experience: July 20, 2021", "rating": 4}, {"title": "Excellent service", "text": "Date of experience: October 03, 2019", "rating": 4}, {"title": "Awsome service!", "text": "Date of experience: December 04, 2020", "rating": 4}, {"title": "Good!", "text": "Good! Very good!", "rating": 4}, {"title": "Good", "text": "Worked out well!", "rating": 4}, {"title": "Awesome products", "text": "Date of experience: May 07, 2018", "rating": 4}, {"title": "Good product", "text": "Date of experience: May 15, 2021", "rating": 4}, {"title": "great service.", "text": "Date of experience: September 30, 2017", "rating": 4}, {"title": "Good service", "text": "Date of experience: April 06, 2020", "rating": 4}, {"title": "Third appliance purchased from …", "text": "Third appliance purchased from ACityDiscount and everything has been 5 star worthy until this last delivery (first time fedex was the carrier). I had requested a call be made before delivery and provided a cell phone plus backup landline. After never getting a call on either and seeing the status change from delivery on Thursday to pending, I decided to call fedex. After a 20 minutes of transferring to different departments I was told that someone did call and when I disputed this was promptly hung up on. I went and got phone records from my cell provider after this, and those proved to me there never was a call. Back to calling fedex and twenty more minutes of shuffling around and I get a supervisor and the best they can do is 5 days later even though the shipping center where the item is is within 15 miles of the destination. The shipping portion of this particular order was incredibly frustrating, and completely unlike the previous orders from AcityDiscount.com. Removing fedex from the equation would bring this rating back up to 5 stars", "rating": 4}, {"title": "This message is to the freight company you used for my delivery...", "text": "Every person I talked to was very helpful and pleasant to deal with.  Your people are customer service oriented.  The one think I didn't liked is that the freight company you used from GA to RI, never bothered to give you the delivery date of my purchase.  I actually called to cancel the order and was put on hold, then the sales rep told me that the item was already in transit.  Had I known, I could've pass that info along to my client who was nervous about not having his item on time.  I also spent some time looking for an alternative.  I think the freight company you hired could have done a better job.  I thought of letting you know to see if you'll pass my message along to them.  Maybe they need some feedback.  Thank you!", "rating": 4}, {"title": "Fast shipper", "text": "Date of experience: August 26, 2017", "rating": 4}, {"title": "Excellent..But", "text": "Excellent. Would rate five stars if the product would have been packed with more protection. The legs came loose and dented the product in transit. Not major enough damage to endure the hassle of refusal, return and replacement, but nevertheless a disappointment. Repairable damage. Happy with the product and the buying experience otherwise, especially followup and perceived concern about the buying experience.", "rating": 4}, {"title": "I received a quality product at a …", "text": "I received a quality product at a reasonable cost. The shipping via UPS was lousy which delayed the receipt considerably. I would recommend you to a friend. Have questions about the shipping", "rating": 4}, {"title": "The merchandise was delivered on time …", "text": "The merchandise was delivered on time but was severely damaged. The driver took it back and I contacted the merchant to replace or refund. The merchant promptly sought for a replacement unit and secured one and shipped it as soon as they could. The kitchen project was delayed a little but overall the merchant did good job following up with the customer. I will recommend the merchant to others for their after service.,", "rating": 4}, {"title": "good job at helping me and setting up …", "text": "good job at helping me and setting up delivery for my purchase.", "rating": 4}, {"title": "They were very helpful when ordering …", "text": "They were very helpful when ordering and got our order very quickly", "rating": 4}, {"title": "very good price", "text": "very good price. a little confusion on product knowledge.", "rating": 4}, {"title": "fridge working well", "text": "fridge working well. only complaint is with the delivery company. had to unload the fridge on my own out of a huge truck. extermely painful", "rating": 4}, {"title": "Ordered thru eBay 7/19/17 AM shipped day PM", "text": "Ordered thru eBay 7/19/17 AM shipped same day PM", "rating": 4}, {"title": "Very good people fast service", "text": "Date of experience: July 17, 2017", "rating": 4}, {"title": "Quick", "text": "Our 6 door reach in coolers broke down on a Tuesday July 4 and we ordered 3 2 door artic air coolers the next day and had them by Friday afternoon.. would of been 5 * if carrier lift gate was working, I had to rent a forklift to unload them", "rating": 4}, {"title": "Customer service was great", "text": "Customer service was great. Prices are fair", "rating": 4}, {"title": "Service was fast and I got just what I …", "text": "Service was fast and I got just what I ordered.  Great job.", "rating": 4}, {"title": "Great customer service", "text": "Competitive price,  excellent customer service and staff will go above and beyond in offering additional discount.", "rating": 4}, {"title": "We have shopped in store and online and …", "text": "We have shopped in store and online and have always had great experiences", "rating": 4}, {"title": "shipping seems pricey...took a little …", "text": "shipping seems pricey...took a little longer than expected to receive order.", "rating": 4}, {"title": "All fine except I got the email about …", "text": "All fine except I got the email about it being on its way about 30 minutes before it arrived and driver was not happy waiting for me to meet him.", "rating": 4}, {"title": "Best price I found on this", "text": "Best price I found on this.  Waited a little longer, but worth it.", "rating": 4}, {"title": "Everyone was very helpful", "text": "Everyone was very helpful. Had a little trouble with the checkout but all in all a good experience.", "rating": 4}, {"title": "I would have given a 5 star", "text": "I would have given a 5 star, but the delivery company  that was used, didnot get to our school until almost 6 p.m.", "rating": 4}, {"title": "A City is great, their shipper is NOT.", "text": "A City was great, their shipper was NOT.  Averitt shipping, was terrible.  I will only buy from A City again if they can use another carrier.", "rating": 4}, {"title": "Reliable", "text": "As described and prompt shipping.", "rating": 4}, {"title": "Worked well with me and got it to us …", "text": "Worked well with me and got it to us fast. Thank you", "rating": 4}, {"title": "Nice steam table good price.", "text": "Date of experience: May 20, 2017", "rating": 4}, {"title": "good", "text": "good, a little faster on the whole process would have been great...over all thank you!!!Bill W.", "rating": 4}, {"title": "Everything was good except sales representative", "text": "Price was excellent, delivery was very fast & kind, one thing I don't like the sales representative:( who taking care my order. He kept rushing me to order and I was asking about expecting delivery hour but he just hang up the phone  he didn't even say thank you or good bye. I disappointed his attitude", "rating": 4}, {"title": "Great", "text": "Great, just bring a jacket if you're buying from the freezer department", "rating": 4}, {"title": "Great vendor.!!", "text": "Date of experience: May 08, 2017", "rating": 4}, {"title": "I have purchased it for the usage of …", "text": "I have purchased it for the usage of our domestic purpose. We have been using it occasionally when we serve around 30-40 folks. It has been working well until these days. I am recommending my relatives to buy it. Let me see how will they be able to share their experiences with me.", "rating": 4}, {"title": "Very good customer s", "text": "Very good customer service", "rating": 4}, {"title": "Item came on time and as described.", "text": "Date of experience: April 17, 2017", "rating": 4}, {"title": "Quick and got the right part", "text": "Date of experience: April 17, 2017", "rating": 4}, {"title": "Fast service.", "text": "Date of experience: April 15, 2017", "rating": 4}, {"title": "I'm getting old the Sales man gave me …", "text": "I'm getting old the Sales man gave me his name even though I don't  remember even though I made a small purchase everyone was helpful!!  I was pricing equipment I definitely will return there !!!", "rating": 4}, {"title": "Great communication and price.", "text": "Date of experience: April 07, 2017", "rating": 4}, {"title": "vert good store", "text": "Date of experience: April 03, 2017", "rating": 4}, {"title": "1st time I used you for our business-  …", "text": "1st time I used you for our business-  great shipping time and a great product packaging-   thanks", "rating": 4}, {"title": "Satisfied", "text": "Nice quality!", "rating": 4}, {"title": "These folks did everything they could to work with me to make sure I was happy with my order!!", "text": "We are a Wilderness Club that is VERY active in our community...always hosting charitable events for wildlife organizations, churches, terminally ill children, and veterans...so, having the right equipment to serve the number of people we do is very important.  The folks at ACityDiscount were so willing to help out and make sure we got exactly what we needed in a timely manner!!!  We will feed over 500 people in 3 days next week for a veteran's event and our new range/oven will be here today!!!  Can't ask for better people to work with!!  Thanks so much for all you guys do!!", "rating": 4}, {"title": "Freezer Delivery", "text": "Overall, my experience was great.  Though I was not informed until the delivery was on its way that the freezer did not have caster wheels (something that I believe to be standard on large cooling units).  So I had to run out and buy wheels to place underneath the unit upon arrival.", "rating": 4}, {"title": "Everything was great.", "text": "Talking to the employees was very satisfying. Only when I needed to speak to a person regarding an item in transit I kept getting the same message the was cut off. On the sixth call I got a person and was well taken care of.", "rating": 4}, {"title": "Perfect for now ! Hoping to conclude with you in the best conditions !-)", "text": "Bernard did a very good job.He advises me very well.The team is very friendly and very professional !Good company", "rating": 4}, {"title": "Great customer service", "text": "Very knowledgeable sales staff.", "rating": 4}, {"title": "several purchases", "text": "I have made several purchases from \"A City Discounts\", thus far my experiences has been a win-win.", "rating": 4}, {"title": "Overall good,  inventory laid out nicely", "text": "Good.......", "rating": 4}, {"title": "Fast Service", "text": "Everything shipped faster than I expected. I ordered first thing Monday morning and we had all of our products which had to ship truck Freight by Wednesday afternoon.", "rating": 4}, {"title": "Supernatural shipping and great price", "text": "Great price on what I needed supernatural shipping", "rating": 4}, {"title": "Delivered quickly.", "text": "Price was reasonable.", "rating": 4}, {"title": "great service and delivery", "text": "I had a good experience with the sales person .Very helpful with my questions .Item was delivered on time.", "rating": 4}, {"title": "Get to know this establishment", "text": "I  know what i was looking for, i placed my  first order, i got it a few days later , installed and bingo! That sink is working again. Everything went smooth, thank ypu guys!", "rating": 4}, {"title": "Everything was great with one exception.", "text": "Variety of product and customer service was fantastic. My only issue is process. I really do not like having to fill out a form to buy things. I would have saved myself about 10 minutes if that step were able to be avoided. Also later in the day I received two emails. One told me my order was ready, about 15 minutes later I got another telling me I had picked up my order, meanwhile I had been gone with order in hand for about an hour and a half. This seems like an inefficient way of doing things that is wasting your time, probably much more than the ten minutes it wasted of mine. Again, really liked your store and everyone was super friendly and helpful, I just think you might want to revisit your process.", "rating": 4}, {"title": "Quick delivery", "text": "Product as stated, no problems so far.", "rating": 4}, {"title": "Gotham Coffee Roasters says the ice bin is Chill.", "text": "Well made, perfect for our needs.", "rating": 4}, {"title": "Helpful and quick.", "text": "Everything moved smoothly, quickly, and securely.  There was a problem on my end as far as credit card confirmation, but they remained polite and helpful.  It verified identity security for me.  Thanks.  Delivery was personalized and good.  One slight issue...the unit I ordered was requested to be as pictured (color and header board graphics).  It was not.  The header board was blank.", "rating": 4}, {"title": "Side job saver", "text": "My order came in fast and they both fit very well. As for my customer was happy with both faucetsides", "rating": 4}, {"title": "Quick and honest service", "text": "ACityDiscount shipped my order promptly and responded to my questions very quickly and appropriately. I ordered a pair of salad tongs, and they sent me what I ordered, but I realized it wasn't exactly what I wanted. Good service from ACityDiscount though, and good prices.", "rating": 4}, {"title": "Great product! 4 stars", "text": "Great sealer but the fact that the seals were loose in the box without installation instructions took it down one star. Excellent ship time and packaging.", "rating": 4}, {"title": "the service was great, the delivery was fast, but the tracking, wasn't able to track the package to see when it was going to be delivered", "text": "Need to fix your tracking information", "rating": 4}, {"title": "Quick, Easy and Reliable Service", "text": "My order was processed quickly and my mixer ended up showing up a day earlier than originally projected.  When the unit arrived it was packaged securely and everything was in good working order.", "rating": 4}, {"title": "quick, easy, and accurate", "text": "They worked well and quickly got my request passed through.", "rating": 4}, {"title": "First purchase great service and product.", "text": "All parts arrived in great condition and very quickly.", "rating": 4}, {"title": "Great selection and price.", "text": "In and out. Customer service representative was great.", "rating": 4}, {"title": "Great store!", "text": "Outstanding customer service. Would like to see more bakery products though", "rating": 4}, {"title": "Good. Fast", "text": "Pretty good price for what I needed. And pretty fast.", "rating": 4}, {"title": "Price was right", "text": "The price was great. I received the Ice Machine much sooner than expected. There is a small dent in the side but the way it is being set up it will not be seen.", "rating": 4}, {"title": "Great Service.", "text": "Just what I ordered. Arrived timely.", "rating": 4}, {"title": "Good experience", "text": "Prompt service w/ good competitive pricing", "rating": 4}, {"title": "Great", "text": "Shipping was fast", "rating": 4}, {"title": "Quick delivery, painless", "text": "A little smaller than I expected, but that was on me.  They will still work.", "rating": 4}, {"title": "Great product, fast shipping, but shipping was frustrating", "text": "The item we purchased is excellent and priced lower than anywhere else. It arrived quickly, but the shipping company they used caused us to wait hours after we were closed and keep people here on overtime because the arrival time kept being pushed back.", "rating": 4}, {"title": "Great – decent treatment and very little friction.", "text": "Got what I paid for promptly.", "rating": 4}, {"title": "wide selection of products , well displayed", "text": "broad selection - can get most everything you needeasy to see displays- can touch and measuremost sales staff helpful - some have to be asked to helpsome items not priced on floor-0 hard to shopsome items in boxes do not have a display model- difficult to make selection", "rating": 4}, {"title": "get two quotes", "text": "They don't always give you the best price, never pay the listed price.Call back a day later and speak with someone else to see if they will give you a better price.", "rating": 4}, {"title": "Good Service!", "text": "Good service from the representative.  Just wish that he had suggested purchasing the faucet components when I ordered my commercial sink.", "rating": 4}, {"title": "1st visit was a great success!", "text": "We were directed to them by a restaurant equipment store in Metro Atlanta. The sale representative was very pleasant and informative. He made our experience worth the mileage and was concerned with us purchasing the correct items. This was our first time purchasing our items, but definitely not the last.Thank you!", "rating": 4}, {"title": "Ice machine filter", "text": "Got a fair price and very quick and free delivery.", "rating": 4}, {"title": "Just the product we were looking for.", "text": "Found the refills we needed.", "rating": 4}, {"title": "Placing order and making payment was simplicity itself.", "text": "Not much to say other than I first made telephone contact in order to clarify something.   While still on the phone, I placed the order and made payment.  The shipment (to my residence) arrived within a week.", "rating": 4}, {"title": "Italian ice cart", "text": "Service at the Atlanta store was excellent. Only drawback was we were told we would know when the order was placed and we could track the item. We weren't given a tracking number until it reached Charlotte.  We live in Charlotte so we were to track it from warehouse in Charlotte to our house. Ok. Glad item arrivedescription with no dents. :)", "rating": 4}, {"title": "#212", "text": "Ordering was easy and they were very helpful in giving the right information", "rating": 4}, {"title": "decent price and order staus communication A+.", "text": "found what i needed at the right price, order status was communicated well. thank you ACD.", "rating": 4}, {"title": "Great Price on Blendtec Jars", "text": "Buying from ACityDiscount was very easy. Some concern was the reviews, but I noticed the General Manager addressed them all so I decided to give them a chance. I'm glad I did because my item came new as listed, in a timely manner, and I saved money.", "rating": 4}, {"title": "great deal", "text": "shopped around for these plates and found the best deal with you guys thanks again", "rating": 4}, {"title": "Great job", "text": "Product delivered in pristine condition and looked/works as expected.  Delivery was quicker than expected - overall wonderful experience!", "rating": 4}, {"title": "Happy customer", "text": "Very rapid delivery of my order, good value.", "rating": 4}, {"title": "Just as promised.", "text": "ACity had a good price and free shipping on the item I needed.", "rating": 4}, {"title": "Good prices friendly staff", "text": "Had all items in stock , prices were good n the staff is very friendly and helpful.", "rating": 4}, {"title": "The product seems OK but the FedEx delivery was not", "text": "My complaint is with FedEx delivery and interface to customers. I waited at home on the day of the scheduled delivery but no delivery was attempted. At ten tht night the FedEx website indicated that the addressee was no available to accept the delivery. I tried contacting the FedEx customer service and had a bad experience with their on-line chat forum with an agent with poor English mastery and apparently no more information than what appeared on the website. The next day was much like the first except that the tracking feature indicated that the package would be returned to Norcross because no one was available to receive it. I drilled down into the FedEx website and found a phone number for customer service. I gave them my phone number for the driver to call if he could not fine my house. The following day the package was delivered without incident. The driver denied all knowledge of previous failed attempts at delivery. In short, I had to wait at home for 3 days before the delivery was made and was quite frustrated with the FedEx website customer interface.", "rating": 4}, {"title": "Very good", "text": "Very fast delivery", "rating": 4}, {"title": "Great Product", "text": "I was impressed by the quality of the product that I received.", "rating": 4}, {"title": "Cleaned up", "text": "I have purchased products from ACityDiscount for years and this was a first for maintenance and was very pleased with their product and quickness in getting it to me; 'will be back and their price and shipping beat the rest by a long shot!!!!!!!!!!!", "rating": 4}, {"title": "Great product good service.", "text": "It was a good product I'd recommend it to anyone looking for a steam table the delivery date was one day earlier than suggested I had to make other arrangements. But other than that I gave him a great review.", "rating": 4}, {"title": "Communication", "text": "My experience with A-Team has improve. Communication is the key to making a great salesperson or a \"Great A-Team\". I'm very please!Scott RaginAccount Executive 864-569-2621 | Cell /TextKingswood Leasing", "rating": 4}, {"title": "Great Deal, Delivery could of been better", "text": "Had some confusion over whether to schedule a delivery appointment or not.  In the end, it was necessary to schedule the appointment.  Knowing this before would have gotten the delivery to us one day sooner!Other than that, everything was very smooth.  From placing the order with the salesman, to entering all the details, to getting the machine installed.  I would say this is an excellent company with which to do business.  Just heed my advice about delivery appointments. :)", "rating": 4}, {"title": "Purchase of IR heaters", "text": "Easy to register on the site, and checkout went smoothly.", "rating": 4}, {"title": "Commercial freezer purchase", "text": "Working with Acity discount proved to be very easy, with helpful service during the ordering process and follow-up customer service in helping to track and deal with minor shipping damage. I would recommend Acity discount.", "rating": 4}, {"title": "Great help", "text": "Great support and help", "rating": 4}, {"title": "Good customer service, great selection of products, price is fair.", "text": "Date of experience: July 11, 2016", "rating": 4}, {"title": "Very affordable prices.", "text": "Affordable prices...", "rating": 4}, {"title": "Quick delivery", "text": "It took almost a week to order due to our tax exempt status.  Once we ordered, we had the product the next day.", "rating": 4}, {"title": "Good Selection", "text": "Shipping was a bit higher than other places, but they had what I wanted. It took a few days for it to ship, but it was fast from there.", "rating": 4}, {"title": "Ice Machine", "text": "Very good support with great price.", "rating": 4}, {"title": "Service", "text": "Good Service and helpful staff", "rating": 4}, {"title": "Good item", "text": "Item was at a good price delivery was within a few days but time of day that we were told was off by 6 hours, causing us some over time.", "rating": 4}, {"title": "No issues", "text": "No Issues with the order and we received it before it was scheduled to arrive.", "rating": 4}, {"title": "Nice Place", "text": "Very helpful.  Even went to another location to pick up a purchased item which was out of stock, so we could take it with us that day!  Brian was extremely helpful.", "rating": 4}, {"title": "Thank you", "text": "Had no issues with my order. Parts arrived as promised.", "rating": 4}, {"title": "Great service and fast delivery!", "text": "The only think that would be nice is if the driver would actually bring the equipment inside, or at least give us an option to pay for that service. Especially because I had put the casters on the refrigerator, and that took a long time. But, other than that it was all great and ACItyDiscount is very reliable. :)", "rating": 4}, {"title": "LIFE Progressive Services Group Inc", "text": "Great job guys.", "rating": 4}, {"title": "fast service", "text": "The Migali refrigerator I purchased shipped the same day it was ordered, and in my city ready for pickup the next day. I am using it in our remodeled and enlarged kitchen.    There was a little problem getting warranty registered.  The warranty statement did not indicate that warranty did not apply for residential use, while other brands specifically state no warranty for residential use.  By the way, the Migali web site does not state this either, in fact, the instruction book that came with the unit has the warranty statement.  It does not indicate no residential use.  Management at Migali had to OK warranty.  We really like the huge refrigerator.", "rating": 4}, {"title": "Easy and fast", "text": "Everything went well with my purchase.", "rating": 4}, {"title": "Table", "text": "The service was GREAT!  The item was just what I wanted, a wonderful sturdy table for my mixer.  I received the item quick.  In shipping the shipper ripped the box and I lost 8 screws that came with the it.  The only thing that I would suggest is to package the screws rather than have them free in the box.  Otherwise everything was great.  Thank you.", "rating": 4}, {"title": "Offset Spatula Order", "text": "The site was easy to use.  I knew what I was looking for and found them quickly.  I thought the shipping charge was high, but the prices of the items offset the charge.  Simular items locally were about 4 to5 dollars higher.", "rating": 4}, {"title": "Flaker Ice Machine", "text": "Easy to work with and prompt delivery", "rating": 4}, {"title": "Dundee's", "text": "Quick easy buying experience", "rating": 4}, {"title": "Good", "text": "Shipping was good but to expensive, I have to pay and extra $23.00 to ups to drop box in front of my business. Price of the item was good, but shipping fee raised up, if was not for that I will give them 5 stars.", "rating": 4}, {"title": "First time shopper", "text": "Very satisfied with wide variety of restaurant equipment. Prices are competitive. Received order on timely manager. Would definitely use again.", "rating": 4}, {"title": "Great product great service", "text": "I brought a Blendtec Stealth blender from ACity discount with the lowest price o the internet. The product arrived on time and as advertised. Need I say more.", "rating": 4}, {"title": "fast delivery", "text": "The delivery was very fast and the glasswasher was just as describe", "rating": 4}, {"title": "Good Business to do Business with", "text": "I was very pleased with the online process that ACityDiscount has set up on their site. You know exactly what is going on throughout the purchasing process. I give them 5 stars for this.\rWith that being said, I was kind of upset at the way it was packaged. The unit was just set on the bottom of a very well constructed box with bubble wrap all around it. There was however, no protection whatsoever on the bottom. The bubble wrap could have been put to better use by at least wrapping the unit in bubble wrap and not just laying it on top of the unit itself. The only damage to the unit itself was that the clips that were on the bottom got stretched out a bit. When I get ready to use the unit, I will see if I can fix it.\rOther then that, it was a pleasurable experience with them and yes, I will buy from them again, but this time I will call in my order and give instructions as to how to pack a box. LOL", "rating": 4}, {"title": "Good Company", "text": "Prompt easy to work with quality product", "rating": 4}, {"title": "I'll buy again", "text": "Great prices and helpful placed a large order and they did everything they could for me and are really helpful.", "rating": 4}, {"title": "good service and fast shipping", "text": "Good service", "rating": 4}, {"title": "very fast service....", "text": "delivery was fast and staff was very curteous", "rating": 4}, {"title": "Good Price and Fast Shipping", "text": "Good Price and Fast Shipping.", "rating": 4}, {"title": "why 50.00 for a fork lift", "text": "When the stove was delivered it was not on a lift just a skid", "rating": 4}, {"title": "great product!", "text": "The sink came in perfect condition. Freight delivery company called day before with delivery time frame. They were courteous and on time.", "rating": 4}, {"title": "High Quality Espresso Thermometers @ the best price", "text": "Good product, fair price, reasonable and timely shipping.", "rating": 4}, {"title": "Fast delivery", "text": "Everything is good but tube", "rating": 4}, {"title": "Great", "text": "First Item shipped Quick and was received in great shape. Second item was delayed but updates on status were frequent and appreciated.", "rating": 4}, {"title": "Great product/Great Price/Horrid Delivery service", "text": "A City Discount sold us an excellent refrigerated until at a great price!  Shipping was very quick!  The delivery agent they used was EXTREMELY rude AND damaged our door by taking large chunks out of the wood while he complained about bringing the refrigerated unit inside our establishment.  Basically he wanted to leave the item outside and let my friend and I (two women) to fend for ourselves on how to bring the unit inside out of the elements.  Mind you, the item was on a dolly and he could just have easily wheeled it (gently through the door) and about 20 feet with ease.  Oh and I paid $50 extra  for him to lower it off of his truck and put it in our parking lot - that was ridiculous as well.  I suggest using a different shipping company A City Discount if you want to keep customers coming back for more items because that is the one and only thing that would prevent me from buying from you again.", "rating": 4}, {"title": "Excellent Knowledge and Service", "text": "Excellent product knowledge and service.", "rating": 4}, {"title": "Thank You", "text": "I did not run into any problems when ordering and received my merchandise when promised. Thank you!", "rating": 4}, {"title": "Lp steam table", "text": "Great transaction", "rating": 4}, {"title": "big purchase", "text": "I was desperate to get a new oven before my next catering - ACity had it in stock and I ordered it from them.  My first email query was answered right away but followup emails were not answered.  So, I called.  Initially, I was dissapointed in that experience.  The phone rep had a lot of difficulty getting the info right and I had to correct it a few times.  I didn't have a lot of faith that things were going to go well.  HOWEVER, I was wrong.  The oven was shipped in record time, everything was correct, and I will receive it before my deadline... at least, I'm supposed to.  I would recommend.", "rating": 4}, {"title": "I call with concern snd need some direction and advise Rudy was helpfull. Thanks Rudy", "text": "I call with concern and need some direction and advise On a prep cooler and Rudy was helpfull. Thanks Rudy", "rating": 4}, {"title": "Good purchase", "text": "Very prompt.  I received my item within few days.", "rating": 4}, {"title": "Good Service, Could be better.", "text": "Good Service, Could be better.  Use your best judgment.", "rating": 4}, {"title": "Smooth transaction", "text": "Found exactly what I wanted and received it quickly. Great prices and service!", "rating": 4}, {"title": "Very Reliable", "text": "I bought a used refridgerator for my cafe. I was hesitant as you can imagine, but the company was great to work with. Though the fridge arrived with a broken plug, it was easily replaced and the fridge seems to work well. (It has only been a few days.)", "rating": 4}, {"title": "Easy ordering process.", "text": "Ordering process was very easy. Good description of products and spec.", "rating": 4}, {"title": "very professional", "text": "They are honest and very knowledgeable about what they are selling.", "rating": 4}, {"title": "Excellent way to save when opening a new business", "text": "I really appreciate the quality of the used products I purchased. I wish the delivery guy could have brought the refrigerator into the store because it took us over an hour to get the right equipment to bring it in but the items were just what I needed, they were in great shape (just needed cleaning), and I saved a lot of money by not having to buy new. Thanks so much!", "rating": 4}, {"title": "Not Bad But...", "text": "faster shipping would get 5 stars.", "rating": 4}, {"title": "Great product", "text": "Excellent product...excellent service!!", "rating": 4}, {"title": "Past experience was better", "text": "I shopped there when the used items were 50 % off. I lone for the recently passed \"good ole days\".", "rating": 4}, {"title": "Extremely helpful", "text": "We are new to concession business and Hap was very helpful in sharing his knowledge and giving suggestions of what we needed.  Gave us options and things to think about that we had not thought of.  \rBeing new \"you don't know what you don't know\"", "rating": 4}, {"title": "customer service was great but limited. Prices decent", "text": "Krista assisted us from beginning to end and gave us best prices and discounts she could. Only problem was she had to assist multiple customers at the same time, so took longer than I would have liked", "rating": 4}, {"title": "Easy purchase and pickup", "text": "Ordered a piece of equipment and picked it up the next day, easy, no hassle.  Would have been nice if an employee had greeted me while I was in the store though.  Will shop with them again.", "rating": 4}, {"title": "great sale person to help new customers.", "text": "Very helpful when new customers are trying to get information on what equipment will  work best in there kitchen and given different options to work best for then. Very happy we call a city discount to get started.", "rating": 4}, {"title": "we got what we wahted", "text": "The faucet was high Quality.", "rating": 4}, {"title": "Had my doubts, but my purchase was in perfect shape", "text": "After my purchase I received a phone call stating that since it was residential delivery my article may not arrive in perfect condition. I was advised to open and inspect before signing for it. I worried for four days until it arrived in perfect condition. It was well worth the worry.", "rating": 4}, {"title": "One of restaurant equipment places to go", "text": "This place definitely represents its name and they are willing to work with your needs and conditions.", "rating": 4}, {"title": "It is as advertised.", "text": "At first i was kind of reluctant to purchase, because it was a used product, but i bought it and ever thing was intact and working properly.", "rating": 4}, {"title": "Very Knowledgeable staff and they Gave me a great deal on a Fridge.", "text": "I found this place out of coincidence while driving and look to see what they have and we were greeted so kindly by staff. They showed us a great catalog of they're items and gave us the convenience that if they don't have the item in their store, but at another they can bring it here.I would recommend this place to any restaurant owner,", "rating": 4}, {"title": "Very onest sales rep.", "text": "To begin with the people that works there; I got there just at the closing time, and they still let me go in the store to browse. (5stars)😍. I went the next day to buy the SP8stand mixer and the representatives told me about a 5% off during the weekend on that idem. (5stars). 😍  I went back the next day and I got the 5%off to. 😍 The mixer is New , but the only think that's been bothering me a bit was that they give me the floor model,\rNo box  or any other paperwork, but what was attached to it. I don't know if it was a sale on that particular idem from the store or from the manufacturing of the idem.😐 But all in all was a good price any way😉. In all this 3 days experience there ware Not the same salespeople. But they ware Nice too.😏", "rating": 4}, {"title": "good overall", "text": "Shipped fast and hustle free. They do offer the same product with different warranties for the same price which is confusing", "rating": 4}, {"title": "fast very helpful", "text": "I placed my order over the phone the guy I talked to was very help didn't have to wait on the phone for hours and I actually got my ice maker delivered to the house before they a couple of days before they predicted", "rating": 4}, {"title": "Good Customer Service", "text": "After e-mailing ACityDiscount to ensure that the 3 VITA-MIX containers that I wanted to purchase would work on My blenders, I purchased them from ACityDiscount through AMAZON.com.  The containers fit the blender base, but would not allow the noise reducing cover to close, because the 64 oz containers were to tall. I would have been out of luck, but I shipped them back for a refund minus the shipping and handling charges. I then purchased Advanced XP Blades for my blender containers from ACityDiscount. Their Customer Service Personnel are professionals. Thanks ACity Discount.", "rating": 4}, {"title": "Definitely buy from here", "text": "Have had no problem buying from a city fast shipping products bought no problem. Would purchase again for deals they offer. Now I received product I can complete project Tnx acity", "rating": 4}, {"title": "very happy with the service.", "text": "Called in for a used commercial refrigerator and was in stock. Make the payment and later that day I got the tracking number. Just that simple. I will called them again in a heart beat if we need any food service equipments.", "rating": 4}, {"title": "We are thrilled with our purchase.", "text": "After a year of \"making do\", we have been able to replace the sandwich prep table in the deli. Not only is it awesome, we are able to make sandwiches and pizzas from the same place. Wonderful!", "rating": 4}, {"title": "They were very patient", "text": "Great customer service and friendly.", "rating": 4}, {"title": "would buy again", "text": "Extremely fast shipping.  Great product. Great prices. Only problem was shipping tracking site did not work and they did not call ahead of time like it stated to do on the invoice", "rating": 4}, {"title": "Good microwave, good price, quick ship.", "text": "So far so good, seems sturdy, works well, price was less than other vendors, staff happy with it so far. If it lasts a few years this will have been a great buy.", "rating": 4}, {"title": "Very Fast & Timely", "text": "It is great.  I just wish you could have worked with us using a P.O. from our company.  If we could have done that then we could have doubled, even tripled our order with you.  Unfortunately the way our system works we can't go over a certain amt on our credit card and we can't separate the purchases because it looks like we are doing something illegal.  With your organization not working with Purchase Orders you lost out on a $3384 order compared to the $997 we made.  \rSorry.", "rating": 4}, {"title": "Great Service", "text": "No problems with service; we will be installing this equipment very soon.", "rating": 4}, {"title": "The prices were good, the parts arrived at a descent time.", "text": "Ordered the faucet, initially disappointed that we were told it would not ship until the first but we received it on the first instead.", "rating": 4}, {"title": "Very Helpful", "text": "A City Discount has good variety and is very helpful.", "rating": 4}, {"title": "Good Price, Fast Shipping !", "text": "Easy doing business with them.  I had to call customer service before my I placed my order and they were friendly and helpful.  I got a good price on my product and they shipped fast.", "rating": 4}, {"title": "A (budding) restauranteur's dream come true.", "text": "What I love about this store is the back room, warehouse style with unbelievable finds. Odds and ends at unbeatable prices for your restaurant (or home) if you're big on entertaining...\rI particularly enjoy the \"surprise\" 50% off at check out.", "rating": 4}, {"title": "Good quality, good price and good delivery", "text": "Excellent quality with good pricing", "rating": 4}, {"title": "Excellent service", "text": "Had some hiccups during checkout, but after calling direct the people on the phone were very friendly and helpful. Although my knife arrived safely, it could have been better packed.", "rating": 4}, {"title": "People their are great and fun!", "text": "Overall customer service is good. I feel this is a good resource in the food industry.", "rating": 4}, {"title": "One stop shop", "text": "You can find almost everything you would need for your restaurant needs as far as equipment. The only complaint is the prices aren't as competitive as other venders in the area. Other than the prices, customer service is great. They really try to help you find everything you might be looking for.", "rating": 4}, {"title": "So far everything's Peachy!", "text": "Great service, best price and (speedy) delivery included.  I just installed my ice maker - so far all is good!", "rating": 4}, {"title": "Was very patient with me", "text": "I had difficulty completing my purchase because my bank had placed a security hold on my account due to recent out of town purchases I made while visiting a friend in another city. They always gave a number to call along with a name to reference. Eventually the problem was taken care of. I will never forget the patience that was given. Thumbs up!!!", "rating": 4}, {"title": "I was kept informed all the way from purchase to delivery", "text": "The only issue we had was when I was phoned to tell me that there would be an additional charge to deliver to my home rather than a business because they would need a lift truck which did not make any sense since they would need a lift truck to deliver to my business location. The customer service rep inquired with management to waive the fee since I said I would just purchase the product locally then, they waived the fee and I would do business with ACity again. When you advertise free shipping on ebay it needs to be free(we all know it is built into the price anyway).", "rating": 4}, {"title": "Very good.", "text": "They have always been good", "rating": 4}, {"title": "Excellent Teams they deliver", "text": "First time dealing this company has been and excellent experience. And I don't think I have any hang ups using them again.", "rating": 4}, {"title": "good stuff !!", "text": "ordered a commercial stove and griddle. was very pleased at the price and attention given to me through the process. good experience.", "rating": 4}, {"title": "Nice one stop shopping for restaurant setup", "text": "Has everything you need to start a restaurant or keep it going.  Friendly and helpful staff that's not always trying to sell.  Very competive prices .", "rating": 4}, {"title": "Like my purchase", "text": "Works well with no complaints.", "rating": 4}, {"title": "Great price. Welding lines prominent", "text": "I would probably order from here again, I know I'm a bit picky, so the welding lines stand out to me, but over all a fantastic bargain for the item.", "rating": 4}, {"title": "Overall a good place for restaurant supplies.", "text": "Easy to find the items I need for my restaurant.", "rating": 4}, {"title": "Great service and nice location", "text": "People are very helpful and easy to work with! Will definitely use them again!", "rating": 4}, {"title": "good prices on new items", "text": "helpful staff, esp the woman that sits at the front desk", "rating": 4}, {"title": "One stop shop for all needs and budgets", "text": "A well thought out concept for the Atlanta area at an economical and outstanding customer service", "rating": 4}, {"title": "Very Clean! Miss Haynes All-Pro", "text": "Shop here First!", "rating": 4}, {"title": "Lovely environment", "text": "Friendly customer service", "rating": 4}, {"title": "Good service and friendly customer service staff", "text": "Bought several things here over the past and have been satisfied every time.  The customer service staff stands out as professional and very helpful.", "rating": 4}, {"title": "3rd Try Contac Was Successful", "text": "When my husband and I initially went into the store we were greeted and offered assistance.  I expressed an interest in a smoker and the salesperson seemed interested in assisting me.  He even told me of the current sale that was being offered by the manufacturer.  Since this item was going to be a Christmas present for my husband, I told him that I would get back with him the following day.\r At that point I found that the service was lacking.  The next day I placed two (2) telephone messages for the salesperson without a response.  On the second day from the initial visit to the store, I sent two emails directly to the salesperson; again without a response. I called and was left on hold for over ten (10) minutes.  Finally, I called again and when answered by another salesperson,  I went forward with the order with the new salesperson answering the telephone.\r Once I explained to him my interest in purchasing the item, the order and preliminary purchase of the item went smoothly.  The initial salesperson called me and said he tried to contact me, however I did not get his voice message. We both agreed to a miscommunication situation.", "rating": 4}, {"title": "reasonable n affordable and good customer service", "text": "Recomended to anybody and find anything you could think of for your restaurant...", "rating": 4}, {"title": "great alternative to Atlanta fixture!", "text": "terrific customer service\r competitive pricing\r knowledgeable staff\r good showroom\r quality used equipment", "rating": 4}, {"title": "Busy place..", "text": "Great values... order desk was busy with customers but knowledgeable and willing to help  .. paid with cash .. obviously their system for accepting cash has recently changed which caused delays in making change ..", "rating": 4}, {"title": "I'll order from then again", "text": "Easy to order, easy to track. Shipped and called when they say they would. 1 flaw tho, driver drops item off and leaves. Other drivers have help w/ getting an item into the store and not leave it on the side walk. Other then that, good experience.", "rating": 4}, {"title": "Beats all prices & very nice sales person Robert was joy", "text": "I wasn't to impressed with Roberts boss but I sure thought Robert my sales person was the best. He even took the time to find me the best cooler in the wherehouse. I bought a dishwasher from him because I like him so. Much and a convection oven from him also very nice.", "rating": 4}, {"title": "A good experience with a good company", "text": "They worked with me to stay in my budget while getting me what I needed.", "rating": 4}, {"title": "great product, great service", "text": "Buy from this place.", "rating": 4}, {"title": "Stand up Customer Service and Follow through", "text": "I'm opening a small place in Chicago and found ACity view a google search. I was very happy with the equipment I found and immediatly began to put it in my shopping cart. When I went to check out, things got a little hairy and I had to call in. It seems even though I opened an account, \"booked\" all the equipment to buy, the system wouldn't le me. The guy helped me out - and of course he had to go through and re-do everything I just spent an hour doing online. It was a little frustrating, but the guy was great and was able to rebuild it. \rI highly recommend if you want to buy something, look at it online then call. They get 4 stars for great customer service and line of product. They'd have 5 if they're online purchasing system was functional.", "rating": 4}, {"title": "Good customer Service!", "text": "They always have the lowest prices, out of the other stores.", "rating": 4}, {"title": "Cudos to Krista", "text": "Krista Haynes was an excellent representative for your store as she both assisted us in getting the equipment we needed as well as steered us to resources in the community to resources that were not available in your store.", "rating": 4}, {"title": "knowledgeable sales staff and prompt service!", "text": "I was surprised with their selection of products and their low prices.", "rating": 4}, {"title": "Great service....this is my second time buy items from them.", "text": "Bought a Blendtec from them price was good plus free shipping", "rating": 4}, {"title": "Large selection of new and used equipment", "text": "They have a large showroom north of Atlanta full of new and used equipment.", "rating": 4}, {"title": "Good substitiute recommendation", "text": "After installation of a new oven, I was lef with an 18\"w space between the fryers and new new oven under the fire suppression canopy. Ideally, I felt that space should be filled by ss cabinet that could house the griddle accessories and at the same time provide some table top work area for the fryers and the overn.  Local dealers and AtCity could find no such \"animal\", but AtCity was willing to have one made. But as we worked through the cost benefit analysis together, it became apparent that a standard 18'w ss tabel with bottom shelf and casters would be the most cost effective solution. My outfitting was complete within a week after order.  Thanks again AtCity.", "rating": 4}, {"title": "Great service", "text": "Was very pleased with the product and the timely manner in which it was delivered. Also, the prices are very reasonable for the items we purchased.", "rating": 4}, {"title": "High quality products", "text": "You can find supplies that you can't find locally. And good quality.", "rating": 4}, {"title": "Although I recieved an order  filled incorrectly  it was quickly refilled and sent  with genuine concern.", "text": "I had a problem with an order that was filled incorrectly by the manufacturer. Both A City Discount and the manufacture corrected the error within the day I received the shipment . I highly recommend both companies in their genuine concern and prompt action. Their integrity is trustworthy.", "rating": 4}, {"title": "Website was user freindly. Quick Service. Thank you.", "text": "I was very please with the website.  It was comprehensive and user friendly.  If we have further needs for our Culinary Arts program, I will be sure to check A City Discount again.  Our merchandise arrived quickly.  Only one complaint, I stated on the order that i wanted someone to contact us. I never received that call to prepare our Plant Operations staff to be ready at unload.  Other than that, we are pleased customers.", "rating": 4}, {"title": "Used item seems to be in great condition, Shipping was wonderfully fast.", "text": "I purchased a used ice machine from ACityDiscount (Scotsman 525Ib Cube Style Air Cooled Ice Machine w Bin). The item was received in very good condition and in short order shipping via Fedex Freight. The removal of the packaging revealed the ice machine head to be visually in great condition and the bin had very few cosmetic signs of wear. The interior of the ice bin held no off putting odor for which I had concern. Our  ref. technician gave it a visual inspection and found nothing to be questionable. However, even though ACD found it to be in working order, we have yet to employ it for ice making. If it produces ice as well as it looks, we will be very be happy with our purchase and will do business with ACD in the future. \rNed W. Roush II\rMoon & Raven Public House\rWilliamsport, Pa.\rp.s. I only gave it four stars because we haven't connected it to make ice yet. If it is found to be in great working order, five stars will be my upgraded rating.", "rating": 4}, {"title": "Great Prices! Easy to Order...Quick Shipping", "text": "I found ACityDiscount to be one of the best value online sources for work tables and equipment stands. The website is easy to navigate, easy to see the specs on the items I want to buy. I got spec sheets and all the info easily on the ad pages. The order process was easy and my items were shipped very fast.\r I would give 5 stars, except that one of my items arrived with dings, dents and scratches which were not due to shipping. The boxes were in perfect condition, but the equipment stand inside was dinged up and scratched as if it had been a floor model or second. I don't care enough to send it back. It still functions fine, but I would have liked to have known this before purchase.\r Otherwise, great experience!", "rating": 4}, {"title": "Not  bad.", "text": "I've made several purchases from here now and am usually pleased with the price and the product or I wouldn't purchase from them again. Every experience has been a good one. The only difficulty that  I've had this time has been with getting emails that I was told I would get. I still haven't gotten a tracking number for this last purchase. Those aren't any big problems though. I will definitely be back.\r Don", "rating": 4}, {"title": "great!!", "text": "great service!!", "rating": 4}, {"title": "Great site for One Stop Shopping", "text": "I needed two new fryers in my Bar so I searched the sites and found ACD to be very competitive and better priced in a lot of instances. I bought a two Imperial Fryers to go with my used Imperial and got rid of some old Vulcans.  My Cooks love them and it was actually a moral booster to get the new Imperials installed. They work great, esp under loads on our Friday Night Fish Fry's. \r    The Rep on the phone was a bit agitated with me because I couldn't remember which Rep. I had talked to previously about the fryers, but he chilled out when I asked to speak to a different Rep. LOL \r    I would order from them again, they shipped pretty quick out of GA.  I ordered on Mon. and the fryers showed up in N. Mich Thurs. morning.  The Imperial IFS 75 Deep Fat/Fish fryer is the whip for Friday night fish frys. I can do 12 pieces of Cod at a time in the 18x18 cook area. Time is Money.", "rating": 4}, {"title": "Fantastic!", "text": "I purchased a 40 lbs gas fryer at the beginning of February 2013.  I was charged $595.00.  When I received the item the price tag was marked $570.00.  I went back to the store on several occasions and found out that the price of the gas fryer was indeed less than $595.00 in the store.  I communicated my concerns to the staff at A City Discount because the price was reduced and it was within a two week time frame. After addressing my concerns to the Customer Service Department, I was offered a price modification on the fryer. I am pleased with the customer service.", "rating": 4}, {"title": "Received product packaged well for safe transport and delivery.", "text": "ACityDiscount was very easy to work with, and packaged my product well to ensure safe transport. The delivery took longer than what was showing on tracking, but that was due to the transport company, not ACityDiscount.", "rating": 4}]