[{"title": "Denise", "text": "Setting up the insurance was great with Denise but the rating of insurance should be once you MUST use it.  If it performs and covers you as you expected - if so, then you will get a 5 star rating!  Hard to rate when we are using it or hope not to.", "rating": 4}, {"title": "have used AARDY in past", "text": "have used AARDY in past; Satisfied;This time, the link to \"MyAccount\" was expired, it took me 13min, vrs the tokens 10min !   I would suggest they allow more time, or use a website that allows other type login's;  Nonetheless, I would use them again.", "rating": 4}, {"title": "Had online chat help to determine best…", "text": "Had online chat help to determine best rate and policy. Very efficient and satisfied with results of selection", "rating": 4}, {"title": "Easy to find the best policy for my…", "text": "Easy to find the best policy for my trip. I like the compare feature. I didn't like the too frequent email reminders to choose a policy.", "rating": 4}, {"title": "…Best price for the service", "text": "For what you are covered for the price cannot be beat.  Was understandable, clear in what was provided and again great price.", "rating": 4}, {"title": "I won’t know how positive this company…", "text": "I won’t know how positive this company is until I actually travel with them. It seemed to go well with applying process.", "rating": 4}, {"title": "It was quite easy to get quotes", "text": "It was quite easy to get quotes. You could select what you wanted and compare and if you have questions they have a chat that will answer them for you . So as far as getting insurance it was simple. ", "rating": 4}, {"title": "Easy to experience ", "text": "The website is excellent, as always. For this trip I had questions and so used chat. All my questions were answered. I love the ability to download the transcript. I purchased the recommended policy.Purchasing a good policy is the easy part, I have never had a claim on a policy. The testament would be how you handle a legitimate claim. I only hear nightmares about help and reimbursements.", "rating": 4}, {"title": "Easy to use and convenient", "text": "Easy to use and convenient ", "rating": 4}, {"title": "Web site didn't work well", "text": "Web site didn't work well. The person a spoke to on the phone was very helpful (Denise)", "rating": 4}, {"title": "It was easy", "text": "Christina J and Felicia F Customer Service managers were really helpful and patient with me.  They made the process of understanding and purchasing travel insurance.", "rating": 4}, {"title": "Best coverage for the money", "text": "Best coverage for the money, easy to understand and simple application process.", "rating": 4}, {"title": "Great quotes", "text": "I was happy to find a company where I could receive quotes from all the major companies to view different rates for travel insurance.   It was an easy process for me and a great price.   So far so good.   ", "rating": 4}, {"title": "Good way to compare policies and rates", "text": "Good way to compare policies and rates.  All of the policies are quite detailed and you have to look carefully at the specifics and exclusions and AARDY seems to simplify the process a bit.", "rating": 4}, {"title": "Agents were friendly, but missed an important detail", "text": "Agents were responsive and friendly; I gave minus one star since when I finally decided to purchase from them and sent exact details of my flight and cruise; I noticed my coverage starts on the day of my cruise, vs. my flight which leaves a day prior.  They did correct after 24 hours; but still having to wait for them to correct and respond and not double-check my trip details, before finalizing the policy, was a bit frustrating.", "rating": 4}, {"title": "Excellent Site - Minor Tweak Recommended", "text": "Easy to use. Information provided in plain language. Have used many times before. This time I noticed some new insurance companies whose names and reputations I did not recognize nor have familiarity. Would be great help to make customers aware of new insurance companies and their reputations when they become part of Aardy's stable. ", "rating": 4}, {"title": "Insurance for international travel. ", "text": "I wanted an insurance for an upcoming international trip of mine. I looked around on the internet and came across AARDY. I believe they gave the best deal, so I signed with them. ", "rating": 4}, {"title": "Agent was great, but Aardy's IT system was poor.", "text": "The agent, Destiny, was great.  I give her 5 stars.The reason that I gave the experience 4 stars is due to Aardy's system.  The dates that were entered into the system - departure, return, date of first payment - were all correct.  However, when the policy was issued, all 3 dates were change by one day. Your  system has a real problem.  Destiny then had to send an email to IMG to issue a corrected policy. ", "rating": 4}, {"title": "It was easy to compare the various…", "text": "It was easy to compare the various choices. Friends have utilized this so I was trusting.Unfortunately, I only saw policies where one can cancel for medical reasons. There are MANY other reasons for cancellation that I'd like to see covered.", "rating": 4}, {"title": "Customer Service…", "text": "Both the Customer Service Representatives I spoke to (Amanda and Silvia)were courteous and helpful and most importantly knowledgeable. The only reason I did not give a 5 star rating is I was not informed of one of the deadlines to be included in my policy which was really important to my trip. Hopefully, it will not be needed.  ", "rating": 4}, {"title": "AIG Travel Insurance", "text": "Good insurance that gives us peace of mind.  Unfortunately, all such insurance policies have gone up in cost.  It makes it almost not affordable for retired couples with limited means, however the Standard AIG policy was less expensive than many others and offered reasonably good coverage.  Destiny, the Agent, was very knowledgeable, friendly and helpful.", "rating": 4}, {"title": "Good information and support", "text": "Good information and support.  I can't speak to anything further unless I have to use it.  Then, I can speak to the insurance company and how well they perform based on what I have been told.", "rating": 4}, {"title": "My representative was amazing.I believe…", "text": "This is definitely a 5 Star Review !  My representative is amazing. She is patient, easy to understand, and fluent in trip insurance detail. She happily guided me until I understood what to buy (I'm a first timer).                      I believe her name is Melanie. (starts with a \"M\")Thank you", "rating": 4}, {"title": "I found their process for selecting a…", "text": "I found their process for selecting a travel insurance policy easier than some other sites I've used. I knew something about the companies listed for earlier research, so I trusted the recommended policies. I haven't needed to file a claim, so I can't comment on the company I selected.", "rating": 4}, {"title": "Great experience shopping for travel…", "text": "Great experience shopping for travel insurance. What would make things better for my family is to be able to specify the  coverage we desire. For example I do not need reimbursement for cost of trip. What is critical is coverage for evacuation and medical costs in foreign country. Thank you!Collette", "rating": 4}, {"title": "Overall seems like good options but difficulty with payment", "text": "Overall seems like good options were offered. Unless I actually need to use the insurance, it will be impossible to tell how good of an option it is. I struggled multiple times with error messages when trying to buy and pay for the plan. Finally, payment went through. ", "rating": 4}, {"title": "The many options I was given to choose…", "text": "The many options I was given to choose from after entering my information. The only glitch was that I had to reenter all my information at least 4 times because I kept getting a response saying invalid trip cost. I had a period at the end of the number that was not allowed apparently which would have been nice to know when entering the figure. ", "rating": 4}, {"title": "Quick, no frills ", "text": "This only took 10 minutes at most. The agent was professional and courteous.", "rating": 4}, {"title": "Agents plus finding the policy.", "text": "Always someone to talk to if any questions about the quote. They spoke my language and were very knowledgeable about the insurance options.Regarding finding the actual policy to review - the light blue very small font was not helpful.", "rating": 4}, {"title": "Shauna", "text": "Shauna, the phone rep was very helpful and informative.  She answered all my questions and concerns.", "rating": 4}, {"title": "I was looking for travel insurance as I was visiting USA", "text": "Since I'm traveling to the USA, I was browsing for travel insurance. As an Indian national, I was unable to afford a significant sum due to the low value of Indian rupees relative to the US dollar. The fact that AARDY had one of the most affordable premiums of any insurance I could find.Regards, AARDY  ", "rating": 4}, {"title": "Easy to purchase but uncertain just…", "text": "Easy to purchase but uncertain just what you are getting unless you actually use it. Fortunately for me, my brother actually had to use Trawick purchased here after many trips and they did properly stand by their protection.", "rating": 4}, {"title": "Melanie took time to explain things to…", "text": "Melanie took time to explain things to me. I felt reassured by her knowledge that in the very unlikely even I had a claim she would be there to explain things to me. Your policy summaries I found very lacking. Melanie had to take time to fill in what had a 3 hour delay minimum, what had a 12 hour, if dental was included etc. ", "rating": 4}, {"title": "Melanie was a great rep", "text": "Melanie was a great rep, however the phone system was terrible.  On my return all, the call could not be transferred to Melanie.  Easy fix, and an unacceptable issue for customer.", "rating": 4}, {"title": "Great Policy Selection and Information", "text": "  The website is very helpful, because it offers a variety of policies from several insurance companies. My reading of policies left me with questions, but I was able to call an AARDY representative who had lots of information, and clarification. She helped me choose the right policy for our overseas trip.      I ", "rating": 4}, {"title": "While I find the representatives very…", "text": "While I find the representatives very nice. I first called about only Medical travel insurance and was quoted prices adding all these extras, not just Medical travel. So the price was 12x’s what I expected. I had to really explore with the representatives to get it down to what I really wanted. Maybe start with the travel insurance and add policies.", "rating": 4}, {"title": "Positive experience with AARDY", "text": "I haven’t heard of AARDY Insurance before so I was skeptical at first but after talking to Peter I felt more comfortable. Peter was so helpful, very professional and  he was so thorough in answering my questions and explaining the coverage in detail. Because of these , I give 5 stars. ⭐️ ⭐️⭐️⭐️⭐️", "rating": 4}, {"title": "Waiting on a promised call back.", "text": "Dropped to 4 stars due to on line chat promising a phone call back the next day at a specific time which never happened. Was able to answer my own questions researching quote and insurance documents.But having used AARDY on several other trips in the past with immediate and positive results on having to cancel travel for one trip and change details on another, purchased the recommended coverage anyway.", "rating": 4}, {"title": "Cost of trip changes", "text": "Original trip cost couldn’t be corrected, so had to submit multiple requests.", "rating": 4}, {"title": "Left hand and Right hand had different answers", "text": "Agent on chat said there were no options for the policy I was considering ... but when I allowed a call to be made to me,  it was said not to be the case.  I knew this because I had researched the policy extensively before I attempted to purchase the policy", "rating": 4}, {"title": "Felicia was my agent", "text": "Felicia was my agent,   very patientand so informative with info on plans offeredA very helpful knowledgeable Agent!", "rating": 4}, {"title": "Made it easy to choose the best policy…", "text": "Made it easy to choose the best policy for my circumstances", "rating": 4}, {"title": "It was easy and very explanatory", "text": "It was easy and very explanatory.  The question I did have was answered right away when I called the customer service number.When I purchased the policy, I was surprised that the program created a picture of my credit card as I typed in the number.  I'm hoping that the graphic of my card does not stay within the system as that made me nervous.  ", "rating": 4}, {"title": "The representative was very helpful…", "text": "The representative was very helpful over the phone and pleasant. Having said that, she did need to ascertain responses to questions I had, but did respond the next day.", "rating": 4}, {"title": "Customer service agents Maranda and…", "text": "Customer service agents Maranda and Shana were both helpful and professional.  I was surprised how quick and simple the process to sign up for travel insurance was.", "rating": 4}, {"title": "I prefer the website of…", "text": "I prefer the website of InsureMyTrip.com, on which one can compare various policies and their different coverages in different areas all on one screen.Having said so, this was an easy site to navigate and purchase to make. ", "rating": 4}, {"title": "Great and professional service", "text": "Great and professional service. Very helpful person at the other end of the line. My suggestion to improve the coverage for travelers is to have the choice of prolong your coverage at a later date if you happen to want to extend to stay in a foreign country for another month or two and not having to go thru the entire new application for a new policy.", "rating": 4}, {"title": "Nice idea but the Compare Feature is lacking.", "text": "It’s nice to see several travel insurance companies at one time. I wish the compare feature was a bit more robust, comparing each company by category rather than having to look at each separately.", "rating": 4}, {"title": "I spoke with Melanie who was very…", "text": "I spoke with Melanie who was very patient and informative. This insurance stuff is so complicated, but she was very sweet and friendly. I found this site thru my AARP. I would definitely recommend you give a try.", "rating": 4}, {"title": "Serenity was very pleasant", "text": "Serenity was very pleasant, patient and kind in her assistance in explaining to me the available plans.  She has a good personality and I appreciate her customer service.  The process did not take a long time to complete.", "rating": 4}, {"title": "Destiny was professional", "text": "Destiny was professional, knowledgeable and very pleasant!  However, though I was told that I would receive the insurance materials within two hours, two days later I had not.  I emailed, and received most but not all of the materials.  I emailed again and received the insurance policy.  Unfortunately, the excellent experience with the agent was marred by the poor follow-through.", "rating": 4}, {"title": "Customer Service Agent was helpful", "text": "Customer Service Agent was helpful, polite, and professional.  She thoroughly explained the benefits of the policy I purchased for my wife and I.", "rating": 4}, {"title": "Hawaii 2025", "text": "It was easy and affordable and coverage was what I was looking for.", "rating": 4}, {"title": "Agent answered all questions", "text": "Agent answered all questions. took time to insure everything was correct. ", "rating": 4}, {"title": "African Travel", "text": "Insurance covers our expenses for our overseas travel. The process was easy.", "rating": 4}, {"title": "The online site was very helpful", "text": "The online site was very helpful, but I had other questions and I called your agency and spoke with a human being but unfortunately I found her not very helpful as she just sent me back to the site to figure things out myself.", "rating": 4}, {"title": "fast response online and by phone", "text": "fast response online and by phone; live chat available; many options presented", "rating": 4}, {"title": "Policy purchase", "text": "The policy was easy to read and understand. Good coverage options and easy to apply for. I have not had to use it as my trip is far in the future, so I can't rate how the process of making a claim goes. This review is simply for the process of purchasing the policy.", "rating": 4}, {"title": "So far, so good!", "text": "I would have given 5 stars but I don't know if the service is good yet. I would like an opportunity to review the product after our trip as well. ", "rating": 4}, {"title": "Fast, friendly, professional service", "text": "Fast, friendly, professional service.  I only wish that you had policies with lower medical limits.", "rating": 4}, {"title": "I was able to compare different…", "text": "I was able to compare different policies all in one place, which made the process of choosing a policy very easy.", "rating": 4}, {"title": "Did Not Wish To Leave Without It", "text": "Having trip insurance takes the \"What If\" out of the conversation. My wife & I never take a holiday without travel insurance.", "rating": 4}, {"title": "Got travel insurance and glad I did.", "text": "Interaction with phone associate was good.  Person was honest and helpful, but didn't seem to want to provide other options or plans.", "rating": 4}, {"title": "Your team was very knowledgeable", "text": "Your team was very knowledgeable, thorough, and demonstrated caring patience with answering all of my questions and concerns while matching us with the perfect plan for our needs.", "rating": 4}, {"title": "Good selection of policies", "text": "You get a good selection of policies to choose from. Once you decide, purchasing is easy. I only wish that the comparisons showed mor detail ", "rating": 4}, {"title": "The website was easy to navigate and…", "text": "The website was easy to navigate and use, especially when comparing policies.  I would like to have seen other companies represented, since I had to go to individual websites to compare (e.g., Alianze)", "rating": 4}, {"title": "Easy to find policy for my need", "text": "AARDY was well reviewed by AARP. Melanie in an online chat helped me find a good policy for my travel needs. She arranged for an agent call; Amanda helped make the purchase a very simple process.", "rating": 4}, {"title": "Easy to compare plans.", "text": "Date of experience: October 30, 2024", "rating": 4}, {"title": "Ease of picking a travel insurance ", "text": "AARDY made it easy to chose a travel insurance. All information that are needed to make an informed decision was provided.", "rating": 4}, {"title": "Don't forget to read the fine print before you buy!", "text": "It's nice to be able to do comparison shopping of policies in one place. Being able to see the policy documents before deciding on which to purchase was very helpful since one of the policy's actual medical benefits was half of the amount shown in the comparison details.", "rating": 4}, {"title": "First time website user", "text": "It was easy to obtain quote and read policy coverage. The prices quoted were very reasonable. ", "rating": 4}, {"title": "Great staff", "text": "Great staff, very helpful in all areas.A little confusing for a first time cruiser. Great time. ", "rating": 4}, {"title": "Good selection of insurance companies", "text": "Good selection of insurance companies.  Gave a 4 star because for me it would be easier to compare the chosen companies if the comparison was presented side by side with all the details.", "rating": 4}, {"title": "Good choices", "text": "Difficulty in determining date that policy needed to be purchased for last minute purchase of cruise", "rating": 4}, {"title": "It's overwhelming to look at all the…", "text": "It's overwhelming to look at all the companies/options.Wondering if AARP could narrow the choices down??", "rating": 4}, {"title": "On the phone - Peter", "text": "On the phone, Peter was very helpful answering questions and making sure I was purchasing the best policy for my trip. ", "rating": 4}, {"title": "I called Travel Insured International…", "text": "I called Travel Insured International customer service and was able to talk to a live representative. I'm not sure about contact on the weekends while traveling.", "rating": 4}, {"title": "I'll know better upon my return", "text": "I'll know better upon my return, but finding a company via your quote made this step easier.", "rating": 4}, {"title": "Quick and easy to apply", "text": "Information provided about the policy was clear and helpful. Application process was quick and easy. Affordable.", "rating": 4}, {"title": "User friendly.", "text": "User friendly.I was disappointed in not knowing the name of the company until after I decided on the plan.", "rating": 4}, {"title": "Silvia was very helpful with the…", "text": "Silvia was very helpful with the initial contact.  She was unavailabile on Sunday when I completed my transaction. ", "rating": 4}, {"title": "I haven’t left on my trip yet", "text": "I haven’t left on my trip yet, but putting the insurance in place was easy & affordable", "rating": 4}, {"title": "This is the first time I used this…", "text": "This is the first time I used this insurance and don't know more after the trip completion. The web was easy to read and understanding ", "rating": 4}, {"title": "Just purchased", "text": "hard to give an eval because I just bought it.  Trip isnt until next july", "rating": 4}, {"title": "If you could either include Allianz or…", "text": "If you could either include Allianz or be able to compare their policy with many of yours that would earn a 5 star rating.  Thank you", "rating": 4}, {"title": "Cruise Ins.", "text": "We purchased cruise insurance for a family of ten. No issue and a flawless procedure. Cost was competitive and fair.", "rating": 4}, {"title": "The shirt I ordered is just what I…", "text": "The shirt I ordered is just what I wanted. I would have given the order five stars but it took a long time to get here. I would order again, but now I am aware of the time it may take to get here.", "rating": 4}, {"title": "Was able to compare policies from…", "text": "Was able to compare policies from different companies without having to listen to any salespeople. ", "rating": 4}, {"title": "Easy to review insurance options and…", "text": "Easy to review insurance options and recommendations. Purchasing policy is easy as well and emailed to me quickly. ", "rating": 4}, {"title": "Good pricing", "text": "Liked the pricing for insurance.  Good access to info and easy to navigate.", "rating": 4}, {"title": "Haven’t needed to use yet", "text": "Haven’t needed to use yet. Hopefully it will be a seamless process if I need to file a claim. Very easy to view coverage and purchase.", "rating": 4}, {"title": "there are so many choices and the way…", "text": "there are so many choices and the way it was presented to my by email and then choice made it easy. The only thing I had to call to get more details.", "rating": 4}, {"title": "I just have the insurant from your…", "text": "I just have the insurant from your company today, I have nothing else to say. Bad or good wait until I finish my trip.", "rating": 4}, {"title": "It was very easy to see all the offers…", "text": "It was very easy to see all the offers and then chose 4 to compare.  What would have been better was to see the offers side by side, feature by feature.", "rating": 4}, {"title": "It was easy to maneuver this sight &…", "text": "It was easy to maneuver this sight & pick my travel insurance.", "rating": 4}, {"title": "It seems very straightforward  the…", "text": "It seems very straightforward  the policy was just what I was looking for at a reasonable rate  hopefully I will not need to use it but it is reassuring to know that I have insurance in case I need it", "rating": 4}, {"title": "Online process great Chat could be improved", "text": "the online process was straightforward and fast.  However when I had some questions and moved to the online chat the information was not particularly informative and the person quickly went into salesman mode", "rating": 4}, {"title": "Good comparison", "text": "Web site enables you to make good choices in insurance.   Prices were a bit less than other websites.   Of course price is based on age.  ", "rating": 4}, {"title": "Was able to get all my questions…", "text": "Was able to get all my questions answered by Chating but I don't have her name.  She was responsive and quick on getting back to me.", "rating": 4}, {"title": "Agent is very helpful in registering…", "text": "Agent is very helpful in registering the travel policy. ", "rating": 4}, {"title": "Finding travel insurance", "text": "I liked that several options came up and I could pick the one that best suited my needs.", "rating": 4}, {"title": "Easy to interpret the legalese ", "text": "Easy to interpret the legalese and the cost was very good.  no opinion yet on customer service.", "rating": 4}, {"title": "Amanda was excellent and response time ", "text": "Amanda was excellent and response time was greatSerenity help direct me easily and quickly", "rating": 4}, {"title": "Easy to get the coverage", "text": "Easy to get the coverage, even though it seems expensive but necessary.", "rating": 4}, {"title": "Decent rates", "text": "Decent rates, but I wish that you had options just for travel health insurance that was separate from trip interruption and cancellation.", "rating": 4}, {"title": "so far, so good", "text": "I was able to find a range of policies and identify which one I wanted.  However, I wish the site had search filters like some other sites do.", "rating": 4}, {"title": "You give all the information up front", "text": "You give all the information up front. No hassle.  Never have had to file a claim thank goodness but if we ever do I hope it is as simple and quick . ", "rating": 4}, {"title": "Everything want smoothly", "text": "Everything want smoothly. The agent answered all my questions and helped me with the online registration", "rating": 4}, {"title": "Best customer serbice", "text": "Your follow-up is fantasticI send an email I get an answerAMAZINGMelanie Maranda THEY ARE GREATThank you", "rating": 4}, {"title": "coverage information was straight…", "text": "coverage information was straight forward. policy doc, of course, a nightmare to read but expected.", "rating": 4}, {"title": "Friendly well knowledgeable agents", "text": "Friendly well knowledgeable agents, fast efficient service by Melanie and George earlier", "rating": 4}, {"title": "Clear response to questions", "text": "Clear response to questions ", "rating": 4}, {"title": "Great customer service", "text": "Great customer service, all 3 agents I dealt with were very helpful and knowledgeable.", "rating": 4}, {"title": "Quick and easy", "text": "Quick and easy. Best price I could fine fit the type of policy I wanted. ", "rating": 4}, {"title": "Both ladies I dealt with were very…", "text": "Both ladies I dealt with were very efficient...Denise who I booked with and Christianna J. who I first talked to.", "rating": 4}, {"title": "It’s easy to spend money with them but…", "text": "It’s easy to spend money with them but who know how they will be if I file a claim.  If that happens I will be back to review them again.", "rating": 4}, {"title": "Professional & Friendly service.", "text": "The cost, coverage and service. Amanda was very professional, helpful and friendly.  She was very informative and patient. ", "rating": 4}, {"title": "agents were very helpful and explained…", "text": "agents were very helpful and explained the travel coverage.", "rating": 4}, {"title": "Lots of options", "text": "Lots of options, but purchasing insurance is always a pain.", "rating": 4}, {"title": "Knowledgeable customer service folks …", "text": "Knowledgeable customer service folks to help with the insurance details and responsive to messages. The downsides were the 2-step process to get approval for the optional benefits for the Travel Insured International coverage and the mistake in the Aardy summary description of the AIG coverage--which was eventually corrected.", "rating": 4}, {"title": "Great Customer Service", "text": "She was knowledgeable and very nice. She was able to answer all my questions and help me pick the right plan for my travel needs.", "rating": 4}, {"title": "The Agent Peter was very patient and…", "text": "The Agent Peter was very patient and explained everything. ", "rating": 4}, {"title": "It was easy and your personnel were…", "text": "It was easy and your personnel were very helpful", "rating": 4}, {"title": "Dan was very helpful", "text": "Dan was very helpful. Really appreciate his help.", "rating": 4}, {"title": "Very helpful!", "text": "Gal that I was emailing with was very helpful. She offered to talk over the phone with me if I had any questions!  Very helpful.", "rating": 4}, {"title": "Great response to questions and promGood servicept…", "text": "Great response to questions and prompt service", "rating": 4}, {"title": "Quick", "text": "Quick, simple to use.I recommend this site for your travel ins. needs.", "rating": 4}, {"title": "Your agent is available by phone and I…", "text": "Your agent is available by phone and I received good advise. ", "rating": 4}, {"title": "helpful and quick and spoke English", "text": "Date of experience: September 08, 2024", "rating": 4}, {"title": "Appreciate the Wendell's patience in…", "text": "Appreciate the Wendell's patience in walking me through options.", "rating": 4}, {"title": "Very transparent", "text": "Very transparent. Easy to navigate and compare. More competitive pricing than the other travel insurance brokerage sites. ", "rating": 4}, {"title": "Very helpful agent", "text": "Very helpful agent. She told me the options and let me make the decision.", "rating": 4}, {"title": "easy to use website", "text": "easy to use websiteactual person answers phone", "rating": 4}, {"title": "I received an error message while…", "text": "I received an error message while enrolling and a representative called me to resolve it.", "rating": 4}, {"title": "Prompt response", "text": "Prompt response, agent thorough and helpful", "rating": 4}, {"title": "AARDY is the place to shop for travel insurance.", "text": "Very helpfull and easy to find travel insurance.", "rating": 4}, {"title": "The customer service person", "text": "The customer service person, Sylvia, was very patient and helpful.", "rating": 4}, {"title": "Easy and Clear", "text": "Web site & plan-related information is clear and easy to navigate/understand.", "rating": 4}, {"title": "Everyone I spoke with has been very…", "text": "Everyone I spoke with has been very helpful ", "rating": 4}, {"title": "Was easy to purchase online", "text": "Date of experience: August 02, 2024", "rating": 4}, {"title": "Okay insurance ", "text": "Okay insurance and easy to purchase ", "rating": 4}, {"title": "Shanna was responsive", "text": "Shanna was responsive, knowledgeable, pleasant customer service provider with all my many questions.", "rating": 4}, {"title": "Excellent work by Melanie & Maranda!", "text": "Date of experience: May 31, 2024", "rating": 4}, {"title": "Amanda was patient", "text": "Amanda was patient, kind and available ", "rating": 4}, {"title": "Clear language I could understand", "text": "Clear language I could understand. Gave information and guidance. ", "rating": 4}, {"title": "The site was easy to use and it gave me…", "text": "The site was easy to use and it gave me lots of choices for my needs.", "rating": 4}, {"title": "Haven't made a claim but the sign up…", "text": "Haven't made a claim but the sign up process is easy.", "rating": 4}, {"title": "Everything was clear on the website &…", "text": "Everything was clear on the website & easy to compare.", "rating": 4}, {"title": "I have been buying from them the last…", "text": "I have been buying from them the last few trips.  They answer ?s well.  ", "rating": 4}, {"title": "Good site for comparing multiple travel…", "text": "Good site for comparing multiple travel insurance companies and policies.", "rating": 4}, {"title": "It was easy to sign on", "text": "It was easy. I am not certain I got the right policy.", "rating": 4}, {"title": "Great experience and provided me with info I need versus what they would like to sell.  ", "text": "Providing many options and listen to your needs.  ", "rating": 4}, {"title": "Ease of use of website and many options", "text": "Date of experience: June 26, 2024", "rating": 4}, {"title": "The representative was great", "text": "The representative was great!  Felicia was wonderful she had the answers!!!", "rating": 4}, {"title": "Representative is friendly and…", "text": "Representative is friendly and knowledgable .  Answered questions and confirmed request.", "rating": 4}, {"title": "Sereniti was very helpful and polite!", "text": "Date of experience: May 02, 2024", "rating": 4}, {"title": "Information and telephone agent was good", "text": "Date of experience: July 16, 2024", "rating": 4}, {"title": "Convenience", "text": "Convenience, of being able to compare many different options", "rating": 4}, {"title": "Expedient", "text": "Expedient, easy, clear.", "rating": 4}, {"title": "Overall experience was good", "text": "Overall experience was good, had some communication issues at first.", "rating": 4}, {"title": "Nice person", "text": "Date of experience: August 14, 2024", "rating": 4}, {"title": "Easy comparison ", "text": "Straightforward and clear", "rating": 4}, {"title": "Considerate", "text": "Don was very informative & patient....", "rating": 4}, {"title": "Agent Don was very helpful", "text": "Date of experience: September 03, 2024", "rating": 4}, {"title": "Agent was friendly and knowledgable.", "text": "Date of experience: August 13, 2024", "rating": 4}, {"title": "Aardy was a great place to compare…", "text": "Aardy was a great place to compare policies and prices", "rating": 4}, {"title": "Very helpful agent!", "text": "Very helpful agent!Thank you!", "rating": 4}, {"title": "easy to navigate", "text": "Date of experience: July 27, 2024", "rating": 4}, {"title": "Easy to compare.", "text": "Date of experience: July 07, 2024", "rating": 4}, {"title": "ease of use", "text": "ease of use. clear info", "rating": 4}, {"title": "Lowest cost.", "text": "Date of experience: April 08, 2024", "rating": 4}, {"title": "accurate information", "text": "accurate information, good opinion from chat person", "rating": 4}, {"title": "Easy to use", "text": "Easy to use, good links within the form.", "rating": 4}, {"title": "The process was relatively simple.", "text": "The process was relatively simple and straightforward.", "rating": 4}, {"title": "Website was user friendly", "text": "Date of experience: May 10, 2024", "rating": 4}, {"title": "timely information good comparrison…", "text": "timely information good comparrison view.", "rating": 4}, {"title": "Pleasant experience", "text": "Your customer service representative was very pleasantand knowledgeable. ", "rating": 4}, {"title": "Purchased what I needed!", "text": "Date of experience: April 19, 2024", "rating": 4}, {"title": "The ease of getting comparative quiotes.", "text": "Date of experience: June 19, 2024", "rating": 4}, {"title": "Ease of use on websites", "text": "Ease of use on websites ", "rating": 4}, {"title": "Patience and friendliness", "text": "Date of experience: September 30, 2024", "rating": 4}, {"title": "Good  web site", "text": "Good  web site. I got what I needed  ", "rating": 4}, {"title": "Easy to navigate", "text": "Easy to navigate, competitive cost.", "rating": 4}, {"title": "Great service ", "text": "Friendly, professional & helpful associates.  Very responsive. Easy. ", "rating": 4}, {"title": "The representative was very…Helpful", "text": "The representative was very knowledgeable and helpful", "rating": 4}, {"title": "Easy to use and choose.", "text": "Date of experience: August 16, 2024", "rating": 4}, {"title": "Easy to use the web site", "text": "Easy to use the web site.  Thanks", "rating": 4}, {"title": "Good Exprience", "text": "Date of experience: September 04, 2024", "rating": 4}, {"title": "It was quick and easy", "text": "Date of experience: June 11, 2024", "rating": 4}, {"title": "Straightforward website info", "text": "Date of experience: June 09, 2024", "rating": 4}, {"title": "Ease of use to site", "text": "Ease of use to site ", "rating": 4}, {"title": "Smooth", "text": "Everything went smoothly ", "rating": 4}, {"title": "Everything went well.", "text": "Date of experience: May 17, 2024", "rating": 4}, {"title": "Easy to set up", "text": "Date of experience: April 30, 2024", "rating": 4}, {"title": "Simple transaction!", "text": "Date of experience: April 23, 2024", "rating": 4}, {"title": "Good selection", "text": "Good selection ", "rating": 4}, {"title": "Convenience", "text": "Convenience ", "rating": 4}, {"title": "Easy to use.", "text": "Date of experience: April 04, 2024", "rating": 4}, {"title": "Appropriate and helpful,", "text": "Date of experience: May 13, 2024", "rating": 4}, {"title": "easy comparisons", "text": "Date of experience: July 12, 2024", "rating": 4}, {"title": "Agents were thorough and helpful.", "text": "Date of experience: March 13, 2024", "rating": 4}, {"title": " Survey", "text": "Melanie was thorough, courteous, informative and professional and associated documents were received immediately while still on phone with this agent.    Reason for 4 of 5 stars (1) 4.5 not available (2)  did not receive hubby's ID PDF card in the package.", "rating": 4}, {"title": "decent rate for decent coverage.", "text": "I had many options to choose from. However I could not get everything I wanted in coverage.", "rating": 4}, {"title": "Ease of use and speed.", "text": "Date of experience: March 05, 2024", "rating": 4}, {"title": "comparison of travel insurances made it…", "text": "comparison of travel insurances made it easy to choose which fits my need.", "rating": 4}, {"title": "Destiny helped me by answering all my…", "text": "Destiny helped me by answering all my questions in a kind and efficient way.May I suggest having help assistance in Spanish? I would have much preferred that. That is the main reason of not getting the 5 stars.", "rating": 4}, {"title": "Good information provided by Denise and…", "text": "Good information provided by Denise and Shanna.  I'm rating 4 at this time because this is just the booking process.  Have not had any experience regarding claims or follow up", "rating": 4}, {"title": "Your Rep’s were patient & informative.", "text": "Date of experience: February 24, 2024", "rating": 4}, {"title": "Policies were presented nicely", "text": "Policies were presented nicely.  Anne policy was what I expected.  No hidden costs or limitations.", "rating": 4}, {"title": "Site is easy to use", "text": "Date of experience: February 20, 2024", "rating": 4}, {"title": "Response was fast", "text": "Date of experience: February 20, 2024", "rating": 4}, {"title": "Easy to navigate website.", "text": "Date of experience: February 19, 2024", "rating": 4}, {"title": "Good prompt service", "text": "Good prompt service.  I like the live chat.  Only complaint, if you call it that, is that the chat person always wants to have someone give me a call and I don’t like telephone calls even though some people probably like asking questions.", "rating": 4}, {"title": "No big issues", "text": "No big issues. No one is perfect. Just was difficult to get to the coverage we were wanting, but we did find it. Chat really did not help, though agent was very polite and courteous.", "rating": 4}, {"title": "Your representative Destiny was nonweldable, helpful, patient and pleasant to deal with.", "text": "Your representative Destiny", "rating": 4}, {"title": "more primary options", "text": "Love the fact that available options are listed in one location along with coverage.", "rating": 4}, {"title": "Ease of use helpful and friendly…", "text": "Ease of use helpful and friendly assistance", "rating": 4}, {"title": "I rated 4 stats", "text": "I rated 4 stats. because I haven’t. yet needed. the. service they provide.  The chat room was helpful. The response was fast.", "rating": 4}, {"title": "Great prices for comparable products", "text": "Great prices for comparable products. However the “compare products option” isn’t the best I’ve seen.  It would be better if all the plans to be compared were displayed in a table format for easy comparison. I found I just had to scroll back and forth.  Finding the link to the actual policy was also challenging so I could read the “fine print”. In the end I purchased thru AARDY!", "rating": 4}, {"title": "Website", "text": "Website is easy to use for quote.  Agents were helpful, but a little impatient with my questions.", "rating": 4}, {"title": "Quick and easy, not always best for groups", "text": "It was quick and easy to compare policies, but I regret bundling the travelers together as we had different totals that weren't reflected in the actual insured trip costs that I didn't see until I had my policy.The carrier was very helpful in modifying the policy immediately but it took a lot of time.", "rating": 4}, {"title": "Knowledgeable guidance through the…", "text": "Knowledgeable guidance through the process of selecting an insurance carrier. Melanie was especially patient.", "rating": 4}, {"title": "I was pleased with the various choices…", "text": "I was pleased with the various choices and recommendations.  Very easy versus looking up each company individually and comparing policies", "rating": 4}, {"title": "Awesome customer service", "text": "Well there seem to be a IT problem when I paid for my policy but the team over Aardy was more than helpful and we finally got the issue fixed. I spoke with 4 different people over there. And they were all very pleasant and helpful.", "rating": 4}, {"title": "haven;t used it yet", "text": "haven;t used it yet. let you know in a couple of months", "rating": 4}, {"title": "It was very easy to get my insurance…", "text": "It was very easy to get my insurance for are trip", "rating": 4}, {"title": "The representatives", "text": "The representatives, Kiwi and Destiny were knowledgeable, courteous, and informative. They were able to give insight and clarity to questions that I had.", "rating": 4}, {"title": "Simple and to the point.", "text": "Date of experience: January 07, 2024", "rating": 4}, {"title": "It makes it easier to decide which…", "text": "It makes it easier to decide which insurance to choose.", "rating": 4}, {"title": "good 'compare' function", "text": "Date of experience: December 25, 2023", "rating": 4}, {"title": "Appreciate Jenet for her services", "text": "Date of experience: December 21, 2023", "rating": 4}, {"title": "Good customer service", "text": "Date of experience: December 14, 2023", "rating": 4}, {"title": "Quick and fairly straightforward", "text": "Quick and fairly straightforward. A little tricky to get good reviews on the insurance companies themselves unless you check elsewhere (doesn't seem to be an AARDY specific issue).You do get very frequent emails as soon as you search a quote. Definitely useful if you need that added pressure to make you decide already! Hoping we don't need to actually utilize the insurance in any way.", "rating": 4}, {"title": "Response was swift and follow through…", "text": "Response was swift and follow through even Multiple agencies were provided with descriptions and ability to compare.", "rating": 4}, {"title": "AARDY offered best rates", "text": "Easy to use Website offering many choices/quotes and ability to review the policy. Chat feature and customer service phone number are offered if questions or clarifications needed.  However, not all insurance carriers are signed on to AARDY to be part of the comparison (e.g., Allianz, Generali), so I had to go to their websites to get quotes.  AARDY offered best rates!", "rating": 4}, {"title": "Helpful", "text": "Agent was reasonably knowledgeable and helpful; did not answer one of my questions directly but instead went through an entire spiel explaining parts of the policy I already understood and did not ask about. Not a tragic flaw, but made the process take way longer than necessary", "rating": 4}, {"title": "Quality customer service", "text": "Quality customer service. I really like the fact that I could call and speak to a live person rather than automated responses.", "rating": 4}, {"title": "Travel insurance", "text": "She answered all our questions and was patient with us!", "rating": 4}, {"title": "The Representative was clear and precise to what needed to be done", "text": "The representative  was very clear and did a outstanding job providing all the information needed to be done and helped with getting the cards printed.I definitely appreciate her help. The next time I travel I  will go with you. thank you very much", "rating": 4}, {"title": "Simplified and comprehensive…", "text": "Simplified and comprehensive presentation of facts and final recommendations on the best options. Although, I gave a 4 star rating, it should be more close to the 5 star. Wish there was an option to do so. Also, I was in a hurry and trusted their decision as an independent agency.", "rating": 4}, {"title": "Easy and informative with competitive…", "text": "Easy and informative with competitive rates", "rating": 4}, {"title": "multiple quotes that are easy…", "text": "Getting multiple quotes that are easy to evaluate and then purchasing the right product couldn’t be easier.  The only drawback was that price seems a little high for a one week cruise.", "rating": 4}, {"title": "Your sales staff are always patient", "text": "Your sales staff are always patient, extremely friendly and very knowledgeable about our trip needs. Your staff is great!Earlier this yr we dealt with Felecia for our first cruise.And this time we dealt with Amanda", "rating": 4}, {"title": "Professional exceptional service A++", "text": "Well, I promised another gal that I would get my policy through her but I sped up my trip by 5 days and wanted to start the plan before I set foot in Thailand. Just happened to be on her day off and the policy would not generate automatically. I am very pleased with the service provided by both of your professional agents. Thank you they both are above average. A++", "rating": 4}, {"title": "Easier to understand the coverage and…", "text": "Easier to understand the coverage and limitations. I feel like I’m missing the fine print.", "rating": 4}, {"title": "Poland Trip 2024", "text": "Helping us to understand and choose the right coverage for our international trip.", "rating": 4}, {"title": "Easy set up .", "text": "Date of experience: October 17, 2023", "rating": 4}, {"title": "Information was quick and reliable", "text": "Information was quick and reliable.  When compared to other sites, AARDY seemed to have the best prices for the same coverage.", "rating": 4}, {"title": "Sylvia was very patient in explaining…", "text": "Sylvia was very patient in explaining the policy differences.", "rating": 4}, {"title": "I appreciate the patience each person…", "text": "I appreciate the patience each person I’ve spoken with gives to answer my questions. It’s easy to travel but these insurance policies are challenging without AARDY’s help.", "rating": 4}, {"title": "The agent or customer rep is very helpful in getting the information.", "text": "The agent or customer rep is very helpful in answering and clarifying questions regarding the travel policy.Assist in selecting the proper coverage based on my travel plan and needs.", "rating": 4}, {"title": "Good to view comparisons", "text": "Nice website to compare prices and plans.  It was easy to review the coverages and make a decision.", "rating": 4}, {"title": "Ease of Comparison", "text": "I like the ease of comparison between companies and benefits.  We have used AIG before and had a very good experience.  We recently used Trawick and I would never use them again. I have found it impossible to get a Trawick claim paid.", "rating": 4}, {"title": "Aardy is an excellent travel insurance…", "text": "Aardy is an excellent travel insurance marketplace, with an easy-to-navigate website, excellent and clear pricing, and very helpful customer service representatives.  The only reason I didn't give Aardy 5 stars is because once you request a quote, they hound you with marketing emails until you buy a product, which is annoying and not helpful to me.", "rating": 4}, {"title": "Getting the insurance coverage was…", "text": "Getting the insurance coverage was easy. However I am having a problem accessing the coverage document. I have tried all the numbers that I have but they want certificate or group number. All I  have is a policy number.The AARDY rep reached out to me after reading my review. They were very helpful in helping me get the documents I needed. I was never able to access them through the IMG website. A big thanks to AARDY.", "rating": 4}, {"title": "So far so good", "text": "So far so good, the process to buy was easy.  We don't travel for a week yet...", "rating": 4}, {"title": "I was able to talk with a rep each time…", "text": "I was able to talk with a rep each time I called.  Phone answered immediately and pricing information e-mailed shortly after our conversation.  However, I had to call a second time to request that the policy be e-mailed to me.  This is the second time I have used AARDY and have been satisfied especially as I prefer to do things by phone rather that chatting on the computer.", "rating": 4}, {"title": "fast and easy", "text": "Date of experience: September 19, 2023", "rating": 4}, {"title": "Highly Rated Site", "text": "Site was easy to use and made it easy to select and purchase the travel insurance best suited for us", "rating": 4}, {"title": "Personal contact was ok", "text": "Date of experience: September 10, 2023", "rating": 4}, {"title": "No complaints", "text": "No complaints. The information provided seemed fairly straight forward.", "rating": 4}, {"title": "Easy and affordable senior coverage", "text": "It was easy to compare plans and explanations were clear.  Great prices compared to general travel insurance.", "rating": 4}, {"title": "Fast responses after updating the…", "text": "Fast responses after updating the estimate of our overall travel expenses.", "rating": 4}, {"title": "The agent knew my needs.", "text": "Date of experience: September 08, 2023", "rating": 4}, {"title": "The quotes gotten were quick and…", "text": "The quotes gotten were quick and thorough.", "rating": 4}, {"title": "Easy to talk toon the phone", "text": "Easy to talk toon the phone. No chat robots for me.", "rating": 4}, {"title": "Terrific representative in Denise", "text": "Terrific representative in Denise Positive responses to all of my questions and extremely informative!!", "rating": 4}, {"title": "I got better rates for some of my trips…", "text": "I got better rates for some of my trips at other sites.", "rating": 4}, {"title": "Easy and quick.", "text": "The information was easy to find and receive several reasonable quotes for travel insurance.", "rating": 4}, {"title": "Reviews several policies to determine the best", "text": "The agent was very helpful in helping me determine which policy I should obtain.", "rating": 4}, {"title": "Very helpful represetative", "text": "Date of experience: August 25, 2023", "rating": 4}, {"title": "Easy to use for us.", "text": "Date of experience: August 31, 2023", "rating": 4}, {"title": "Christiana answered all of my questions…", "text": "Christiana answered all of my questions in detail.   She did not pressure me to purchase the travel policy.   I was told what the deadlines were and she said to call anytime if I have further questions.", "rating": 4}, {"title": "Great service spelling of address was…", "text": "Great service spelling of address was incorect", "rating": 4}, {"title": "Patient", "text": "Patient, answered my concerns.", "rating": 4}, {"title": "The representative was patient", "text": "The representative was patient, personable and answered all my questions.", "rating": 4}, {"title": "Few options", "text": "Few options, easy to use", "rating": 4}, {"title": "I appreciate the A+ rating from BBB", "text": "I appreciate the A+ rating from BBB. I furthermore like the ease of the application process.", "rating": 4}, {"title": "Website was easy to use", "text": "Website was easy to use. Compare feature was useful.", "rating": 4}, {"title": "The price of the policies were very…", "text": "The price of the policies were very good. Many were less expensive than the same policy on other sites. However, the quote I was given on my 1st inquiry was almost $200 less than when I went back on to purchase.", "rating": 4}, {"title": "Autumn in Provence", "text": "Number 1, we shall see how the coverage works if there is a need.Number 2, this was a better set of coverages for the money that some of the other sites I have been viewing.", "rating": 4}, {"title": "All I did was give my age and how much…", "text": "All I did was give my age and how much entire trip and got the quote", "rating": 4}, {"title": "Good customer service", "text": "Date of experience: August 13, 2023", "rating": 4}, {"title": "I called and got a person!!!", "text": "I called and got a person!!!!  She helped me with information  about the insurance and what I should get for medical , about trip cancel and trip interrupt.  She answer most all of my question, even before I asked.  Very helpful and professional.", "rating": 4}, {"title": "Easy to navigate/get insurance coverage…", "text": "Easy to navigate/get insurance coverage online.Affordable rates.Hopefully would veceasy to get/acail claims!", "rating": 4}, {"title": "I wanted to see some reviews from…", "text": "I wanted to see some reviews from people who had had claims. The the reviews all reflected a great experience buying the travel I insurance of course they were the seller wanted your business but none had had a claim to resolve", "rating": 4}, {"title": "I spoke to 3 agents", "text": "I spoke to 3 agents. The 2st was great bit I was cut off, on my side. The 2nd was awful. The 3rd was also great.", "rating": 4}, {"title": "Easy sign up for Insurance", "text": "Easy sign up for Insurance.  Fast receipt of documents.", "rating": 4}, {"title": "This was my first experience with travel insurance", "text": "This was my first experience with aardy.com.  The agent I worked with, Christianna, was very helpful and friendly.  This was new terrain for me, and she was very patient.  Thank you!", "rating": 4}, {"title": "Website and application easy to follow", "text": "Website and application easy to follow.  Chat with customer service - responsive and timely answer.", "rating": 4}, {"title": "Miranda was kind. I don’t trust insurance companies", "text": "I still don’t trust any insurance company, including this one. Hopefully we won’t have to make a claim. But Miranda was very nice, and did her best to answer all of my questions.", "rating": 4}, {"title": "AARDY TRAVEL INSURANCE", "text": "All I can rate as of now is the EASE or purchasing and the support from the AARDY web site.  My trip is coming up and hopefully I wont have to use the policy!  I decided to go with AARDY due to EMMA CRUISES.", "rating": 4}, {"title": "The only disappointment I had was the…", "text": "The only disappointment I had was the agent I spoke with didn’t tell me that if I use points to buy my flight tickets for our trip it won’t be covered by the insurance so now I have to pay out of pocket for the flights. Where the other 2 couples who we are going with us on the trip spoke to someone else and those agents asked them the question about how they were paying for their flight tickets so they could choose to cover them or not.", "rating": 4}, {"title": "Fast reply with many good choices for…", "text": "Fast reply with many good choices for travel insurance.", "rating": 4}, {"title": "Insurance for trip cancellation and…", "text": "Insurance for trip cancellation and medical was priced fairly reasonably, compared to other plans I looked at.  A lot of good reviews.", "rating": 4}, {"title": "It took two tries but it got done to my…", "text": "It took two tries but it got done to my satisfaction.", "rating": 4}, {"title": "Ease of comparing coverage made…", "text": "Ease of comparing coverage made selection easier. Thanks!", "rating": 4}, {"title": "Simple straightforward way to buy…", "text": "Simple straightforward way to buy insurance. There were numerous policies to choose from and were explained throughly. Based on their information given and my needs I found the policy that was best for me.", "rating": 4}, {"title": "Reasonable price", "text": "Date of experience: July 25, 2023", "rating": 4}, {"title": "Fairly easy to use.", "text": "Date of experience: July 22, 2023", "rating": 4}, {"title": "Good help", "text": "Good help. great price. Would have been a five; except, I could not open the policy to look at it when my 3 emails, that I was expecting arrived. Called about it and George sent me another copy. Also walked me through the directions to pull the policy up. Neophytes do have problems. I had misunderstood the directions. Could be plainer for beginners.", "rating": 4}, {"title": "User friendly site.", "text": "User friendly site. Easy to compare packages based on our needs. Thank You.", "rating": 4}, {"title": "Customer service was excellent", "text": "Customer service was excellent. Explained everything so it was easy to understand.", "rating": 4}, {"title": "Easy", "text": "Easy to compare plans and prices for some plans I hadn't heard of even.", "rating": 4}, {"title": "The wide variety of plans was very…", "text": "The wide variety of plans was very helpful to be able to compare", "rating": 4}, {"title": "Just in case", "text": "Easy to work through the website", "rating": 4}, {"title": "Easy to deal with", "text": "Someone always available to answer questions in a polite and helpful manner.", "rating": 4}, {"title": "Depeneds who you speak with", "text": "I first called to ask about a specific coverage.  I spoke with George, he tried to be helpful, but didn't really understand my question, and when I tried to ask it again, he lost patience with me.  However, I called again and spoke with MELANIE.  She was awesome - she gets 5 stars.  She called the insurance company to make sure the question I had was covered.", "rating": 4}, {"title": "I was referred to AARDY by a friend", "text": "I was referred to AARDY by a friend. after getting my online quotes for travel insurance I called AARDY to get additional details. The agent took the time to explain the content of the travel insurance I was looking at. It is very hard to know what insurance to select but this was a good experience.", "rating": 4}, {"title": "so far so good", "text": "so far so good. All information available on website was helpful", "rating": 4}, {"title": "Listening to our needs.", "text": "Date of experience: July 05, 2023", "rating": 4}, {"title": "Ok to date but will follow up when full…", "text": "Ok to date but will follow up when full policy is in hand for review and if there is a need to file a claim or claims.", "rating": 4}, {"title": "The agents @ AARDY were very courteous…", "text": "The agents @ AARDY were very courteous & helpful from the get go! There’re so many policies options from excellent insurers and the agents navigated me through the whole process with ease and without any pressure!!", "rating": 4}, {"title": "I couldn’t select five stars for some…", "text": "I couldn’t select five stars for some reason.   Definitely, a five star experience.", "rating": 4}, {"title": "I needed travel insurance", "text": "I need to travel insurance, so I contacted a representative and I got the travel insurance that I want it, needed, and I am satisfied with it.", "rating": 4}, {"title": "The process was easy and straight…", "text": "The process was easy and straight forward.", "rating": 4}, {"title": "Aardy was very professional and…", "text": "Aardy was very professional and informative. Thanks to his assistance we were able to get our travel insurance.", "rating": 4}, {"title": "Able to compare insurance companies", "text": "Able to compare insurance companies, somewhat. Important items such as what happens if flight is delayed for x, y or z options vague.    Must read extensive policies which burden the customer.  Simple Q&A of usual travelers should be available. Prices offered are competitive", "rating": 4}, {"title": "I gave it four stars", "text": "I gave it four stars. I will not be writing a review. I am too busy to give written reviews of every service I use", "rating": 4}, {"title": "Easy Selection of Policy and Communication", "text": "Purchased a travel policy for an upcoming trip to Europe, and was offered a number of policies from which to choose.  Once I had made a selection, the application process was simple and straightforward.I was told after filling out the application that I would receive my policy by email within about 2 hours from the insurer.  When I did not receive the email within a few days, I contacted AARDY and they asked if I had checked my SPAM folder.  I admitted that I had not, so I was immediately sent the policy by email.  Suggestion: when looking for return email, check your inbox as well as spam. The delay was, in all likelihood, my fault, so I was treated well by AARDY.", "rating": 4}, {"title": "so far all is going ok", "text": "Date of experience: June 15, 2023", "rating": 4}, {"title": "Excellent customer service rep", "text": "Excellent customer service rep Joe.  Wish there were more available options for travel insurance companies though, otherwise great experience!", "rating": 4}, {"title": "Clear answers to questions", "text": "Travel insurance seems very complicated. Christiana was extremely helpful in answering many questions that I had. However, I never did feel very clear about how benefits that I already had such as medical benefits, flight tickets that could be rescheduled and hotel reservations that could be cancelled should impact my travel insurance needs. The main consideration seemed to be total trip cost. I feel like I have very good coverage which was explained well, but I wonder if I may have bought too much.", "rating": 4}, {"title": "Was seamless in obtaining several…", "text": "Was seamless in obtaining several quotes and making a quick determination.", "rating": 4}, {"title": "Working with Joe Pangilinan was a pleasure", "text": "Working with Joe Pangilinan was a pleasure. There was one slip up on dates (error on Joe's part--thus the 4 instead of 5 stars), but he was very straightforward about the mistake and took (loads) of time to reassure us and to very patiently field our many questions.", "rating": 4}, {"title": "Good explanation of pros/cons of…", "text": "Good explanation of pros/cons of various plans.Helpful advice to make sure that the right plan was chosen.", "rating": 4}, {"title": "We did speak to an agent last week", "text": "We did speak to an agent last week, Sarah.  She was informed and helpful.  She answered all our questions and gave us comparison plans,  Her follow ups were timely and clear.", "rating": 4}, {"title": "quick easy and understandable customer…", "text": "quick easy and understandable customer service and policy receipt", "rating": 4}, {"title": "The agent was very helpful in choosing…", "text": "The agent was very helpful in choosing for my trip.The coverage and price of the policyWe’re perfect for my needs.", "rating": 4}, {"title": "Good travel insurance is a must have", "text": "My rep(s). Amanda and Miranda was well versed in their products and offered me some valuable information while seleting a plan.They highlighted the plans in detail and was very thorough to mention all caveats of most plans offered, etc.Per this writing I am happy with my selection and can only hope I will not have to use my plan, but glad I have a trusted partner in IMG just in case.I went with my gut when purchasing this plan contrary to several...many negative reviews about some relevant issues and other not so relevant issues.I will update my review if to 5-stars if all goes according to plan.", "rating": 4}, {"title": "Didn't realize I have to print my own…", "text": "Didn't realize I have to print my own policy which is 60 pages. I thought it would be mailed to me.", "rating": 4}, {"title": "good choices", "text": "It was clear and gave good choiced", "rating": 4}, {"title": "Easy to use if you don’t make a mistake.", "text": "Very simple to use but I made a mistake on my friend’s year of birth. A pop up box appeared showing the price change. The only choice given was to proceed with the wrong year. I had to close the page I was working on and start again in order to correct the information.", "rating": 4}, {"title": "They were very helpful on the phone and…", "text": "They were very helpful on the phone and online and very responsive.", "rating": 4}, {"title": "Web site easy to use", "text": "Web site easy to use. Price was right.", "rating": 4}, {"title": "Cindy thoroughly answered everyone of…", "text": "Cindy thoroughly answered everyone of my questions.  The only reason I am giving 4 instead of 5 stars is since I have never had to make a travel insurance claim and am unable to review the part of the process.", "rating": 4}, {"title": "I requested copies for all covered…", "text": "I requested copies for all covered travelers and only received one for CS.Thanks for attending to thi matter.RG", "rating": 4}, {"title": "Easy way to get the options available.", "text": "Date of experience: May 06, 2023", "rating": 4}, {"title": "I immediately received numerous options…", "text": "I immediately received numerous options which all appeared good.  The difficulty was that some appeared to be duplicates and it took time to sort thorough those!", "rating": 4}, {"title": "Using AARDY once again!", "text": "The data and information presented were clear and easy to read and understand, plus I have worked with you  previously. I presume there were no cheaper offers! The comparison aspect is very good! Makes doing a search easier after booking airfare, cruise and hotels.", "rating": 4}, {"title": "Stacy was polite", "text": "Stacy was polite, professional, knowledgeable, efficient and friendly.", "rating": 4}, {"title": "I was happy with the information I got…", "text": "I was happy with the information I got from the service representative. It took longer than I thought it should, but I did purchase the insurance the agent recommended.", "rating": 4}, {"title": "Very patient", "text": "Kayla was very helpful with all of are questions", "rating": 4}, {"title": "The agent was very helpful", "text": "The agent was very helpful, providing us with all of the information that we needed, since this was the first time purchasing travel insurance for overseas.", "rating": 4}, {"title": "great service by Denise", "text": "denise was the agent who assisted me over the phone,  she was patient in answering my questions and a pleasure to work with", "rating": 4}, {"title": "easy to compare policies.", "text": "easy to compare policies.common questions easily explained.very helpful.plans significantly less than the plans offered by the cruise line.", "rating": 4}, {"title": "trip to Mexico", "text": "I had some trouble connecting to someone at first. When I did get through, the woman answering was polite helpful and calmed my stress. We found a reasonably priced policy that she explained and I feel will meet my needs.", "rating": 4}, {"title": "This is a search engine", "text": "I expected this to be the Insurance agent not another search engine.They were comparable to other search engines.", "rating": 4}, {"title": "Identify best coverage for your trip", "text": "Don was knowledgeable while helping me acquire travel insurance for a trip in late 2024.  He provided quotes from three different travel insurance companies.  All three companies were highly rated on my pre-research list.  In addition, several of our trip/travel friends contacted AARDY for travel insurance.  I was able to compare which type of policy our trip/travel friends chose against my quotes.  I will see how the rest of this process goes when I add additional pre-paid expenses like flights to the policy.", "rating": 4}, {"title": "Fast and easy however there is no a way…", "text": "Fast and easy however there is no a way to upgrade the quoted policy..", "rating": 4}, {"title": "Price was best I found", "text": "Date of experience: April 12, 2023", "rating": 4}, {"title": "Purchased for our Cruise", "text": "Very easy to communicate with, great offers I'll probably use AARDY for all my travel insurance needs.", "rating": 4}, {"title": "The process was quick and easy", "text": "The process was quick and easy. The best option Is shown first. You have a quick overview for every policy and can review each on in detail, then choose what works best.", "rating": 4}, {"title": "Travel insurance", "text": "The agent we worked with (Lyle) was knowledgeable, patient and helpful in providing information we needed to make an informed decision on travel insurance", "rating": 4}, {"title": "We suThank God for AARP and it's supportdddenly realized we had made our…", "text": "We suddenly realized we had made our cruise reservations, but forgot to get our trip insurance.  Went to several locations, then checked with the AARP site.  It gave us several options that would work, and the quotes were less than other sites.  Easy to use, with one exception.  The site does not allow for multiple stops (ie, cruising) so we had to select only one of the stops.", "rating": 4}, {"title": "Great service!", "text": "This is the second time I have used Aardy.  I found the website easy to use and the insurance prices were more reasonable than the offers when I was booking.  I had to phone them last time with a question b/c my flight got changed. The lady who called me back was pleasant and answered all my questions.", "rating": 4}, {"title": "I found the right plan for my trip…", "text": "I found the right plan for my trip without too much difficulty. The plan that was recommended as best was the plan I chose.I would have liked more info in the description box regarding baggage and flight delays as well as missed connections.  I had to go into the plan, then find my state, then open the specifics to find what I was looking for.  These lines could have been easily included in the summary.", "rating": 4}, {"title": "Easy to use and choose", "text": "The choices listed came thru in order of price. Each choice was easy to open and review the travel insurance particulars.", "rating": 4}, {"title": "Pretty Good", "text": "Chatted with your rep Roy. He seemed to know his stuff. Answered a lot of questions, just as I was getting ready to sign up the chat seem to freeze on his end. I was able to figure it out on my end, and process everything. Lucky me. All is good.", "rating": 4}, {"title": "The ease of getting a quate and ranking…", "text": "The ease of getting a quate and ranking the quate.", "rating": 4}, {"title": "helpful agent", "text": "Date of experience: April 04, 2023", "rating": 4}, {"title": "Your company is not covered trip to…", "text": "Your company is not covered trip to Russia", "rating": 4}, {"title": "A little confusing to receive a thank…", "text": "A little confusing to receive a thank you for signing with IMG. I was looking for Aardy.  However, after reading carefully, I saw what you did there. 😎", "rating": 4}, {"title": "Very helpful when I had to cancel.", "text": "Date of experience: March 29, 2023", "rating": 4}, {"title": "It provided a complete summary of all…", "text": "It provided a complete summary of all the better choices and identified the best option for me.Perhaps can cut down on the daily email reminders!", "rating": 4}, {"title": "All went well", "text": "All went well.  Got the insurance I needed.", "rating": 4}, {"title": "Good service", "text": "Very helpful nice service people", "rating": 4}, {"title": "I rated 4 stars based on the…", "text": "I rated 4 stars based on the price/value for outlined coverage when compared to other travel insurance policies. I have not had to file a claim so I am not able to rate customer support.", "rating": 4}, {"title": "The agent was very helpful and made…", "text": "The agent was very helpful and made sure she checked with her supervisor on issues to make sure there was no confusion.", "rating": 4}, {"title": "Easy to use and well priced.", "text": "Date of experience: March 27, 2023", "rating": 4}, {"title": "It was nice to be able to compare…", "text": "It was nice to be able to compare policies side by side and have some personal help as well.  She didn’t try to upsellna policy and said that the lower price policy sounded like it would fit our needs", "rating": 4}, {"title": "Denise answered all my questions…", "text": "Denise answered all my questions thoroughly.", "rating": 4}, {"title": "Site was very user friendly", "text": "Site was very user friendly, clear with comparisons", "rating": 4}, {"title": "Could have been better", "text": "Could have been better the gentlemen  I  talked to seem preoccupied  had to ask a few times if he was still on the phone line  other then that  was very good", "rating": 4}, {"title": "Excellent", "text": "Very Professional agents!!", "rating": 4}, {"title": "Stacy was very nice and answered all my…", "text": "Stacy was very nice and answered all my questions quickly in a manner that I could understand.  thanks so much", "rating": 4}, {"title": "cutting thru the differences", "text": "your agent taking the time to explain options and making suggestions that were on the spot.", "rating": 4}, {"title": "Easy to use.", "text": "Sight was easy. Little trouble paying", "rating": 4}, {"title": "Guidance in choosing from many options critical for Sr. citizens.", "text": "I had not travelled internationally for some time and needed to get policies that were appropriate for my 67 year old brother and myself.  I find all the choices truly confusing.  Nicole was very patient  - especially when I decided to change policies at the last minute before paying.  Then I had one further question on the weekend and George was very helpful in putting my mind at ease that we had made the best choices for us.", "rating": 4}, {"title": "Fair price and good service", "text": "After getting my quote online, I had a question about the trip destination I had used for the quote. The agent Sylvia, got back to me in a timely manner and not only answered my question , but gave me suggestions on the amount of coverage I needed for my destination. She also amended the destination in my quote which did not change the price.", "rating": 4}, {"title": "Jamie was extremely helpful with…", "text": "Jamie was extremely helpful with explaining the differences in the policies that would best fit my needs.Good experience.", "rating": 4}, {"title": "Jamie did well.", "text": "Date of experience: March 16, 2023", "rating": 4}, {"title": "Trip to Europe planned and this morning…", "text": "Trip to Europe planned and this morning we planned to buy Travel Guard essential after talking to agent. Your computers were down so we planned to call back this afternoon.  This afternoon I was informed that the Plus Plan was more appropriate for European Travel.  I purchased it and was grateful to the agent.  There was a negligent difference in price.", "rating": 4}, {"title": "Service online was fine", "text": "Service online was fine - but the cost of this insurance is too high.Also, I noted that the term on the policy ends 6/26/2023 - why not 6/30/2023?  Please advise.Thanks and kind regards,Shirley Ann StuckyI DON'T WANT A TRUSTPILOT ACCOUNT AT THIS TIME.", "rating": 4}, {"title": "The two AARDY agents I've dealt with…", "text": "The two AARDY agents I've dealt with for my last two trips were very knowledgeable and patient about explaining all the ins and outs of policies to me. I felt very confident that I had all the information I needed and would not have any unpleasant surprises with the policies, down the road.", "rating": 4}, {"title": "They answered my questions over the…", "text": "They answered my questions over the phone as I was not able to print the exact document.  The only portion that was a bit confusing was the \"Pre-existing conditions\" section.  Let's hope I don't have to use it.", "rating": 4}, {"title": "COVID", "text": "First time purchasing travel insurance all due to covid. Learned what conditions to cover and how much. Fair price.", "rating": 4}, {"title": "TRAVEL INSURANCE", "text": "Obtained Travel  insurance", "rating": 4}, {"title": "Friendly, Knowledgeable", "text": "Friendly, helpful and knowledgeable people. There are a lot of websites out there, and possibly I may have found lower or slightly lower prices for plans.  However, I was satisfied with my experience.", "rating": 4}, {"title": "Website was easy to work with and…", "text": "Website was easy to work with and response after applying was quick.", "rating": 4}, {"title": "Travel insurance", "text": "The process of learning about and buying insurance for our trip was seamless until I pushed the \"Buy\" button. Then nothing happened and I had to contact an agent for help. Everyone was super friendly and helpful.", "rating": 4}, {"title": "easy website to maneuver…", "text": "easy website to maneuver through--multiple choices of travel policies to compare and choose the best for us.  Quick purchase of policy and timely email from the insurance company's policy's info.", "rating": 4}, {"title": "Easy to compare and easy to purchase", "text": "Date of experience: March 03, 2023", "rating": 4}, {"title": "Pleasant agent- -not pushy", "text": "Pleasant agent- -not pushy, made helpful suggestions.", "rating": 4}, {"title": "Good comparison of options on website…", "text": "Good comparison of options on website and were able to talk with a representative for further clarification.", "rating": 4}, {"title": "The process was easy and convenient", "text": "The process was easy and convenient.  I liked the compare feature.", "rating": 4}, {"title": "Got someone on the phone right away", "text": "Gt someone on the phone right away. They have many  choices depending on need, age, type of travel. One problem is they sometimes had conflicting answers to some questions, when I called back and spoke another rep.", "rating": 4}, {"title": "Fast and straight forward.", "text": "Date of experience: March 01, 2023", "rating": 4}, {"title": "My experience was fine,but I asked for…", "text": "My experience was fine,but I asked for Policy papers to be sent to me and I have not received them yet?", "rating": 4}, {"title": "Very easy to understand and fill out.", "text": "Date of experience: February 27, 2023", "rating": 4}, {"title": "Quick and easy to get a quote and then…", "text": "Quick and easy to get a quote and then the travel insurance", "rating": 4}, {"title": "Easy to obtain online", "text": "Easy to obtain the policy online. Purchased from a highly reputable insurance provider. Recommended by our travel agent but also through AARP.", "rating": 4}, {"title": "AARDY.com is very helpful for choosing…", "text": "AARDY.com is very helpful for choosing a travel insurance company.", "rating": 4}, {"title": "Easy cost and cost breakdown experience", "text": "Date of experience: February 13, 2023", "rating": 4}, {"title": "My overall experience was excellent, but be sure to check for the accuracy of your information before confirming the purchase.", "text": "My overall experience was excellent and Lyle was very knowledgeable and patient.  He explained things very well and answered all my questions..  However, when I opened the trip confirmation e-mail after the transaction was complete and I had hung up, I saw that Lyle had the wrong dates for one of my policies.  I then had to call back because the policy purchase had been completed.  Another associate assisted me, but now I need to wait two weeks for an amended policy, keep checking to be sure it arrives, and pay more because the incorrect dates were for a shorter cruise.  This may seem like a small thing, but it is one more item to add to my To Do list and a waste of my time.", "rating": 4}, {"title": "It was difficult to print the…", "text": "It was difficult to print the comparisons as a cohesive document. Also difficult to find full details of coverage, at first. In he end, the info obtained was very helpful and nice to have it all in one place. I purchased insurance thru the links here based on my search and comparisons.", "rating": 4}, {"title": "Travel Insurance", "text": "I appreciate Amanda B, Sidney and Cynthia.   All three of these ladies were very helpful in getting the most economical travel insurance for us, especially Amanda B.  They were all cordial and polite.  On 2/17/23, Cynthia had a hiccup finding what Amanda quoted on 2/4/23.  Eventually she was able to successfully resolve the issue at hand.  Go Aardy!!!!😊👍🏽", "rating": 4}, {"title": "It was easy and compared a number of…", "text": "It was easy and compared a number of companies.  I won't give it more stars until we've completed our trip. If we have to use it, that will be the true test of whether it was a good product.", "rating": 4}, {"title": "It was easy to complete purchase.", "text": "Date of experience: February 15, 2023", "rating": 4}, {"title": "Antarctica", "text": "1. People pick up the phone without a touch tone menu2. Look things up by my email and phone is very fast and convenient3.  Agents in general were very knowledgeable and helpful and easy to work with.4. web site is excellent5.  In my case, I have a $5000 deposit on a much larger trip.  It turns out the best policy has a max of $10,000 so I would have been in trouble when I went back to insure the remaining balance at the time it is due.  I luckily asked the agent about this and think they should be trained to ask this.", "rating": 4}, {"title": "I am a novice traveller", "text": "I am a novice traveller. I did purchase travel insurance through Aardy in 2021. I was happy with the guidance from them at that time. So I contacted Aardy again to review and purchase travel insurance for a trip this June. Again I had a good experience. George discussed the options and elaborated on the distinctions between the suggested plans. This enabled me to make a more informed choice.", "rating": 4}, {"title": "I have not had to utilize my coverage", "text": "I have not had to utilize my coverage. My travels are months away. How can I know if I am satisfied with your product?", "rating": 4}, {"title": "ease of use and number of options were…", "text": "ease of use and number of options were very helpful", "rating": 4}, {"title": "Customer service was excellent", "text": "Customer service was excellent Tosha was very helpful in telling me how to get a refund and changing my policy amount however it requires writing to another department and probably waiting for refund for awhile", "rating": 4}, {"title": "Agents are very knowledgeable", "text": "Agents are very knowledgeable, patient and willing and able to answer any questionsOnly problem was that i had to call insurance co. for copy of policy; it did NOT come by email within 2 hours as specified", "rating": 4}, {"title": "It was not too difficult to use the…", "text": "It was not too difficult to use the program.", "rating": 4}, {"title": "The filters helps to narrow down the…", "text": "The filters helps to narrow down the selection.  I was able to compare 3 policies and then make a choice based on cost and coverage.  I was also looking at a couple of other sites and you offered the best price for the same coverage.", "rating": 4}, {"title": "The service was prompt and in line with…", "text": "The service was prompt and in line with fee charged by other vendors.", "rating": 4}, {"title": "Website posting was clear", "text": "Website posting was clear;  called to answers and clarifications to questions.  Chase (agent) was quite upbeat, concise and and pleasure to work with.", "rating": 4}, {"title": "explained policy well", "text": "Date of experience: February 06, 2023", "rating": 4}, {"title": "Very happy so far…", "text": "Finding the right trip insurance can be a daunting task, especially for seniors making an international trip during the era of Covid.  How much is too much, or not enough? What’s actually covered and what isn’t? AARDY helped demystify all this with good recommendations and coverage comparisons, and when I had a question and called customer service, the response I received was both prompt and helpful. We haven’t taken our trip yet, so I have no experience with making an actual claim, which as with all insurance will hopefully be unnecessary. It’s also the reason for a four-star rather than five-star review. As of now, however, we feel we’ve made a good choice for good coverage with a reputable and responsible company at a fair price.", "rating": 4}, {"title": "Good array of choices, quick response to query.  A quick response in terms of listing…", "text": "A quick response in terms of listing appropriate options for my request.  I liked seeing the letter-ratings of all the plans and appreciated the range of prices provided.", "rating": 4}, {"title": "Great reviews", "text": "Great reviews. Easy to navigate, and the cost was reasonable", "rating": 4}, {"title": "Travel Insurance Aggregation Site - Aaardvark", "text": "I was presented with multiple travel insurance plans, was able to compare and selected the right plan for our needs.", "rating": 4}, {"title": "Quick and easy", "text": "Quick and easy01", "rating": 4}, {"title": "I hope I don't have to use this…", "text": "I hope I don't have to use this insurance but it is nice to have!  Thanks for making this easy.", "rating": 4}, {"title": "Amanda R and Amanda B were very…", "text": "Amanda R and Amanda B were very informative and easy to work with .Thanks Ladies.Donna", "rating": 4}, {"title": "ACTION", "text": "I find all that I was looking for with this insurance policy  as it stands.", "rating": 4}, {"title": "Lyle was wonderful on my", "text": "Lyle was wonderful on myChat and veryHelpful with myQuestions….keep up the good work lyle", "rating": 4}, {"title": "Hopefully everything was explained…", "text": "Hopefully everything was explained honestly. Darren, & Don we very personable & answered all my questions. Hopefully, I will never have to put any claims into motion. I was told I would get the policy, cards, etc within 2 hours of payment. Did not get it after 3+ hours. Called & Stacy and she sent it immediately.", "rating": 4}, {"title": "Niot bad for a travel insurance company", "text": "Do be confused. All travel insurance compnies will do their best not to pay.  AARDY like all of them put you through a bunch of hoops to document your claim, then picks in any possible fine print to deny you some part of it.This conpa y wasn't as bad as some.  They did communictae in a timely way, which I appreciated and understand is unfortunately unusual with most travel insurnace.  And they adually did pay my claim in a resonbloy timekly way--somwhat less than I felt I was owed-- but not bad.  Given the terrible reviews most companies get, I would likely go with them again.", "rating": 4}, {"title": "Quick and easy", "text": "You’ve made it very easy to review and pick the perfect plan", "rating": 4}, {"title": "Easy. Very good customer service", "text": "The website was easy to use. Customer service rep was very polite and knowledgeable", "rating": 4}, {"title": "First person I spoke with was not clear…", "text": "First person I spoke with was not clear about pricing of a policy. I said my wife and I were spending 6k but she quoted a policy as if I had said 3k. I caught the mistake when I called to pay for the policy after seeing the email prior to paying. The actual cost was explained more clearly.", "rating": 4}, {"title": "Good comparison of policies and ease of…", "text": "Good comparison of policies and ease of buying.", "rating": 4}, {"title": "Fast", "text": "FastComprehensive Website background materials", "rating": 4}, {"title": "I only picked you because the price was…", "text": "I only picked you because the price was right. I never talked to anyone. I tried to chat once but gave up. I hated all the emails I received just because I explor3ed your product.", "rating": 4}, {"title": "what am i reviewing", "text": "what am i reviewing? i bought trip insurance. only way to review would be after someone puts in a clam.  an insurance policy is an intangible thing. how can u review. i went on line, bought it, end of story so far", "rating": 4}, {"title": "Documentation was reasonably clear and…", "text": "Documentation was reasonably clear and comprehensive", "rating": 4}, {"title": "Website was easy to use", "text": "Website was easy to use.  Intuitive", "rating": 4}, {"title": "Prices were comparable to other…", "text": "Prices were comparable to other companies.  A little difficult to choose because there were so many to look through.", "rating": 4}, {"title": "Last minute insurance", "text": "The prompt response.", "rating": 4}, {"title": "easy to use!", "text": "It was a very clear and easy to use program", "rating": 4}, {"title": "Pretty easy use this site.", "text": "Pretty easy to find the policies and prices; it would be good to have a link to the page with what's covered/payout if needed. I had to hunt for that, but finally found it. I'll return to check for other travel insurance; the prices are competitive.", "rating": 4}, {"title": "Easy to follow and details required…", "text": "Easy to follow and details required were given. Price was very good.", "rating": 4}, {"title": "This was one of the easier purchases.", "text": "Date of experience: January 13, 2023", "rating": 4}, {"title": "She was very polite and informative.", "text": "Date of experience: January 11, 2023", "rating": 4}, {"title": "Great Insurance Comparison", "text": "Their recommendation for the best plan was spot on", "rating": 4}, {"title": "Knowledgeable People", "text": "Great knowledge of products", "rating": 4}, {"title": "So far, so good", "text": "So far, so good. Prompt replies, good customer service and good pricing compared to others. Our European trip is not for 6 months, and buying early gave us a discount,as well as your ages are locked into the time you signed up as opposed to the actual travel period. Important when you are seniors as medical coverage does rise according to age. Hope to not have to use this insurance, but if we do I'll be sure to come back and post more", "rating": 4}, {"title": "Easy and Rapid Services", "text": "Rapid clear quotes-Able to compare multiple plans at same time-quick email responses and info delivered as promised. Only negative-a little pricey", "rating": 4}, {"title": "Well maintained website with great…", "text": "Well maintained website with great comparisons and choices", "rating": 4}, {"title": "Domari", "text": "Domari, was very knowledgeable and did a good job guiding me and suggesting what insurance would be good for me and my travel needs.", "rating": 4}, {"title": "The chat worked well", "text": "The chat worked well, but I thought the cost was too high for a 4 month period.", "rating": 4}, {"title": "Good variety of plans.", "text": "Date of experience: January 02, 2023", "rating": 4}, {"title": "Great price", "text": "Great price!  It took me several tries to get the quote through, but maybe because it was on Jan 1.  Went straight through on Jan 2. Otherwise very simple  and great value!", "rating": 4}, {"title": "First time travel insurance", "text": "I have only just started my relationship with ASRDY for some travel insurance, but they seem to be easy to work with and pricing was similar to other companies that I checked into. Hopefully we won’t have to actually use the insurance and travel will be smooth with no difficulty.", "rating": 4}, {"title": "I only gave 4 stars because the…", "text": "I only gave 4 stars because the traveler names and birthdates were incorrect on the policy issued.  I called and the correction was made within about an hour.", "rating": 4}, {"title": "Insurance is very hard to understand", "text": "Insurance is very hard to understand.  This process was easy and was explained as well as can be explained without a human.  That is the only reason I gave 4 stars instead of 5", "rating": 4}, {"title": "Great interaction with Sarah", "text": "Very happy with my interaction with Sarah.  She answered my questions and helped me to enroll on line.", "rating": 4}, {"title": "spoke to a representative from your…", "text": "spoke to a representative from your company and she was knowledgeable and very helpful.", "rating": 4}, {"title": "Easy to use", "text": "Easy to use, completed required information and number of options presented specific to State one resides. Compare option helpful.", "rating": 4}, {"title": "Thank you working on computer was fast…", "text": "Thank you working on computer was fast and easy", "rating": 4}, {"title": "It was helpful to see the comparison…", "text": "It was helpful to see the comparison chart.", "rating": 4}, {"title": "One on the best airline company", "text": "One on the best airline company. Recommend!", "rating": 4}, {"title": "Friendly and pleasant service", "text": "Friendly and pleasant service.   Jamie was wonderful.", "rating": 4}, {"title": "George was very helpful", "text": "Date of experience: November 27, 2022", "rating": 4}, {"title": "It was a good experience they were very…", "text": "It was a good experience they were very helpful", "rating": 4}, {"title": "Friendly agent", "text": "Friendly agent, who sent my policy to me right away.", "rating": 4}, {"title": "It was not clear to me whether I was…", "text": "It was not clear to me whether I was insuring a cruise", "rating": 4}, {"title": "Good comparison shopping", "text": "Date of experience: November 09, 2022", "rating": 4}, {"title": "They explained your insurance policy…", "text": "They explained your insurance policy and answered all my questions. The only problem I had was that your phones do not work well and the conversations break up on me. I had to try 3 times", "rating": 4}, {"title": "Thorough explanation", "text": "After getting a human to answer my questions it was a good experiance", "rating": 4}, {"title": "Excellent information", "text": "We had lots of choice and clear information to make that choice", "rating": 4}, {"title": "Positive Experience.. So Far!", "text": "You have an easy-to-navigate web site and the price is competitive.  What I do not know is how you would respond to an actual claim in the remote event I would need to file one.  We do several cruises per year and always buy insurance... this is the first time purchased with y'all.  So, we'll see.", "rating": 4}, {"title": "I have only purchased a policy", "text": "I have only purchased a policy, it is not in effect yet. Until my vacation, I will not know if this insurance was good or bad.", "rating": 4}, {"title": "Quick easy even with our poor internet…", "text": "Quick easy even with our poor internet service", "rating": 4}, {"title": "Except for the waiting time evrything…", "text": "Except for the waiting time evrything is very good", "rating": 4}, {"title": "Provided explanations of insurance…", "text": "Provided explanations of insurance coverages.  Indicated which coverages were the most important.Easy to use website.", "rating": 4}, {"title": "I have not received any problems with…", "text": "I have not received any problems with your program.Peace", "rating": 4}, {"title": "Could have done better regarding…", "text": "Could have done better regarding voucher credits protection. waited to long to provide information", "rating": 4}, {"title": "Answered all my questions", "text": "Date of experience: October 19, 2022", "rating": 4}, {"title": "Customer friendly agents", "text": "I spoke with two agents during this process and they were very courteous and helpful.", "rating": 4}, {"title": "Aardy", "text": "Easy web site", "rating": 4}, {"title": "Purchase of travel/cruise/medical insurancs", "text": "This was a very positive experiencs!!!  I gave 4 stars because I always think that there is room for doing better.  Both Sarah on Chat and Jamie on the phone were very pleasant and informative.   I would recommend them to anybody.   Thankyou to both", "rating": 4}, {"title": "This was quick and easy to compare…", "text": "This was quick and easy to compare plans and efficient in booking.", "rating": 4}, {"title": "Getting insurance quote and comparing…", "text": "Getting insurance quote and comparing other insurance companies was helpful. Only deducted one star, because, when you make the final payment, you don't see the policy details.  This would have been helpful to have the policy conditions and terms spelled out before making the final payment.  Immediately after payment, I did get the AIG Travel Guard policy details.", "rating": 4}, {"title": "Very Good Experience", "text": "Stacy was a pleasure to deal with.  Very courteous and knowledgable.  Listened attentatively to my needs and recommended a particular policy.  She explained the coverages and answered my questions about them.  Very good experience.", "rating": 4}, {"title": "I really want to make this a 4.75+ Star Rating!", "text": "I really want to make this a 4.75+ Star rating, so I want to make that clear!  The only glitch was the need for a couple of corrections relating to the quote and policy documents.  First of all, the basic approach of offering comparative policy options is extremely useful and helpful.  Secondly, Darren, with whom I had two telephone conversations and a series of email exchanges, was incredibly responsive, patient, thoughtful and informed.  I really appreciated his help and can't thank him enough!", "rating": 4}, {"title": "Easy to buy", "text": "Easy to buy. Offered several plans.", "rating": 4}, {"title": "A quick and easy way to get a few…", "text": "A quick and easy way to get a few estimates for travel insurance.  There really isn't much perspective on what makes 1 company better than another so making the final call felt like I was just going with the name I knew.", "rating": 4}, {"title": "It was easy to get travel insurance…", "text": "It was easy to get travel insurance information", "rating": 4}, {"title": "AARDY and Trip Insurance to Ecuador", "text": "AARDY made it very easy to choose the right insurance.  The Chat person was very helpful.Thank you", "rating": 4}, {"title": "Good!", "text": "Thanks Don. Very helpful", "rating": 4}, {"title": "I received 19 quotes for travel…", "text": "I received 19 quotes for travel insurance very promptly via email. When I called to ask a few questions I got through to a live person and got answers right away.  However, once I picked and paid for a particular plan, I did not receive any communication/verification directly from the chosen company as promised.  I had to email AARDY the next day and their agent sent me a link to the purchased plan.  They assure me that the company I selected is reliable but the lack of direct contact from that company is a bit worrisome.", "rating": 4}, {"title": "Won't know until I need it.", "text": "Date of experience: September 29, 2022", "rating": 4}, {"title": "“Consistently great service and…", "text": "“Consistently great service and competitive prices. Good value for money. Lots of choice and arrived in one week”", "rating": 4}, {"title": "Louis was very helpful and kind", "text": "Date of experience: September 28, 2022", "rating": 4}, {"title": "easy to understand", "text": "it was nice to have comparison companies,hopefully we will not have to make a claim but it is nice to know we have back up", "rating": 4}, {"title": "Very good", "text": "Very good. I have taken one star off because I was hoping that I would be asked for my AARP membership and get some discount.", "rating": 4}]