[{"title": "Joint account possible ...or no??", "text": "Customer service was stellar, however, we were expecting to be set up with a joint account (two names) and I was the only one on it. I think we figured it out though.", "rating": 4}, {"title": "My expérience credit union I discovered…", "text": "My expérience credit union I discovered how à financial institution can genuinely for it's membres by offering personalized services that meet or unique needs", "rating": 4}, {"title": "Too many people to work through", "text": "I had two orders of business to take care of. The first could be handled by one person but couldn’t take care of my other without going to another. I was told there were two individuals that could help but the first one who was freed up didn’t help. I had to wait for the other person to get finished with the member before getting finalizing my business.", "rating": 4}, {"title": "DuGood has always been good people to…", "text": "DuGood has always been good people to deal with; professional and polite, as well as, kind.  When I had to close my account and open a new one - the only negative comment I can make is they didn't tell me the suffix for ACH payments (for my bills) had been changed from 010 to 009; therefore, when I changed all my payment methods, I used what I had always used - 010 and my bill payments got returned.  Then when they set up my three accounts to transfer between them - they didn't tell me that you have to click a tab called \"Move Money\".  In the past I have always seen all the different accounts on the same page as the checking and savings, loans, etc.  So - they need to include those two pieces of information - especially with long established customers.  It took getting in touch with the lady over the digital dept. to tell me when it should have been customer service.  Otherwise, everything was great and I thank you all.  ", "rating": 4}, {"title": "Wing ", "text": "Hi good luck on the train and ", "rating": 4}, {"title": "What do you want me  to say  to people…", "text": "What do you want me  to say  to people lies when l haven't seen nothing l am not a woman that tell lies to people  if l seen  what  your  company is doing is real am ready to give good  news  of your  company", "rating": 4}, {"title": "The only complaint I have is the choice…", "text": "The only complaint I have is the choice of music playing overhead. I believe it was Christian rock/pop. I don't understand why something so personal such as religious belief was necessary for my experience. It had me wondering if the company was limited in its inclusion based on religion or possibly even other factors.Otherwise, my experience was great.", "rating": 4}, {"title": "All stuff are careful taking care the…", "text": "All stuff are careful taking care the business and customer needs.but it make so hard  to get approve that make me feels doesn’t want to do it anymore .to do any loan in future.I do thank you just to save me this once. I won’t do it again.", "rating": 4}, {"title": "Ashanti (I hope I spelled her name…", "text": "Ashanti (I hope I spelled her name right) was so helpful, patient and accommodating. I am new to the bank and my experience so far has been great.", "rating": 4}, {"title": "Professional …", "text": "The experience of the loan officer and the ease of filling out the paperwork. I didn’t really want to get a loan , but events and conditions made it a necessity.", "rating": 4}, {"title": "Waiting time", "text": "The customer service was okay but I was waiting in line for quite awhile and I think they should have more workers or be quicker!", "rating": 4}, {"title": "Very friendly and very understanding…", "text": "Very friendly and very understanding about everything..Heard a lot about credit unions but never had the chance to join one thanks for everything!!!", "rating": 4}, {"title": "Dugood credit union", "text": "Dugood credit union, had stood the test ok f time and pay wisely. A financial institution with difference.", "rating": 4}, {"title": "Need to give more options but other…", "text": "Need to give more options but other wise good ", "rating": 4}, {"title": "Everyone Was Friendly!  Everyone was friendly and spoke up to…", "text": "Everyone was friendly and spoke up to say Hi when I came in.  I returned the next day and the lady who had taken care of me was able to speak with me again.  She quickly looked something up for me and I was on my way.", "rating": 4}, {"title": "Very Kind", "text": "The tellers we're very friendly, I enjoyed setting up my account. Thankyou DuGood FCU!", "rating": 4}, {"title": "Very helpful loan officer", "text": "Very helpful loan officer. She set everything up for me to meet at a branch in another city. Went very smooth ", "rating": 4}, {"title": "The lady was very professional and very…", "text": "The lady was very professional and very informative need more people like her.", "rating": 4}, {"title": "Life Happens", "text": "They all were very welcoming with their greetings and prompt services", "rating": 4}, {"title": "Great Customer Service ", "text": "The staff was knowledgeable with the transactions I want to make.  Greatly customer service and satisfaction ", "rating": 4}, {"title": "DuGood Credit Union provides…", "text": "DuGood Credit Union provides competitive rates, simple online banking, and personalized service that has genuinely improved my financial situation. I strongly recommend DuGood Credit Union to anyone seeking for a trustworthy and dependable banking partner who prioritizes its members.", "rating": 4}, {"title": "Customer Service", "text": "First of all friendly,attentive, polite and very knowledgeable , I was impressed by my experience, and will recommend Dugood to other's.", "rating": 4}, {"title": "How a few difficulties with my account…", "text": "How a few difficulties with my account Customer service was very helpful respectful and the problem was Resolved", "rating": 4}, {"title": "Good experience", "text": "Good experience. I would prefer better faster communiciation via email.", "rating": 4}, {"title": "All the ladies were kind and friendly", "text": "All the ladies were kind and friendly. The staff assisted with all items and all questions I had.", "rating": 4}, {"title": "Windee Ashmore and approval of my loan", "text": "Date of experience: June 29, 2023", "rating": 4}, {"title": "Good good good good", "text": "Date of experience: October 15, 2024", "rating": 4}, {"title": "The person I dealt with was nice and…", "text": "The person I dealt with was nice and courteous. The problem I have is with the signing into my account. I get errors about my Id, password, recognizing my device that I'm accessing my account. I have to do too much of maintenance to keep me able to.login. I put the right I'd in and it says it does not recognize it. I retype the exact same thing and it goes through.", "rating": 4}, {"title": "The questions were well asked", "text": "The questions were well asked, no complaints from me.", "rating": 4}, {"title": "Quick service and a big help", "text": "Quick service and a big help.  Responded to my inquires quickly with candor and professionalism.  Wait time on call queue is a bit long when dialing the main line but direct lines to employees (if you know their ext) is always fast.", "rating": 4}, {"title": "Quick& precise loan process", "text": "Date of experience: November 20, 2023", "rating": 4}, {"title": "Great Staff and Helpful Service", "text": "Date of experience: September 01, 2023", "rating": 4}, {"title": "Dugood is a great Credit Union to use…", "text": "Dugood is a great Credit Union to use for--", "rating": 4}, {"title": "Take too long to clear online banking", "text": "Take too long to clear a check before letting me set up my online banking. I wanted to move money from MN credit union but had to wait 9 days - then 2 more days to get account setup.  Seems like everything I did required a day or so to be approved.  Suggestion: Let me setup online banking immediately - just disallow withdrawals until the 9 days are complete -- would have allowed me to get everything in place and move money into the account much quicker. Hopefully when I set up Bill Pay and other features I don't have to wait again.", "rating": 4}, {"title": "Opening a new account", "text": "I was able to open and confirm my account via the phone. This made it quick and easy. I spoke with Audrey at DuGood and she was extremely helpful. I am looking forward to utilizing my account with DuGood!", "rating": 4}, {"title": "Very nice and respectful.", "text": "Date of experience: August 04, 2023", "rating": 4}, {"title": "Very friendly and efficient", "text": "Date of experience: April 26, 2023", "rating": 4}, {"title": "Effective use of technology to execute loan process", "text": "Team did a great job with processing the loan (start to finish) using email, phone, and online application portal. Improvement opportunity: Slow down and clarify the home equity loan expectation and requirements. Use email instead of overloading the conversation on the phone. Use email to compliment the phone conversation.", "rating": 4}, {"title": "Dugood FCU is there for me in hard…", "text": "Dugood FCU is there for me in hard times and good times. Loan department is very knowledgeable about loan information. Representatives are very polite and don’t waste time with services. Dugood should consider expanding their great business. Keep up the good work.", "rating": 4}, {"title": "Dugood had been top line banking for…", "text": "Dugood had been top line banking for me. any time i need move money or do a wire or even a loan they are helpful walk me thru it all and make sure i understand and want to do whatever it is im doing.the jasper office is very friendly and helpful.all the staff there are ready to help with warm smiles on their faces.they are a unique group thank u dugood", "rating": 4}, {"title": "Employee was VERY helpful", "text": "Employee was VERY helpful.  I am sure she was doing her job as trained.  Just seemed a little \"overboard\" with some of the requirements needed to complete our business.  I am sure it is \"this\" credit union's policy, but since we have been a customer in good standing for so many years, with multiple accounts: loans, savings, checking, businesses, that ,maybe, some of the \"norms\" could have been more flexible.", "rating": 4}, {"title": "DuGood Credit Union is the Best of the…", "text": "DuGood Credit Union is the Best of the Best!!  Always helpful and friendly.  My only reason for not giving 5 STARS is the fact that DuPont Credit Union was smaller and was a big family and DuGood is so large it isn't often that you know everybody there nor do they know you personally.  Thank You for Brenda Franks who is our \"go to\" for help.  She is the \"Old School\" family & friend!!!  She goes WAY ABOVE and BEYOND!!!", "rating": 4}, {"title": "Fix 2 issues, then everything would be great", "text": "I don't like the fact that the Major Drive location doesn't open the inside on Saturday. Safety Box access on the weekend is needed. Improvements have been made to the online system which helped a lot. One more improvement is still needed which is the ability to modify the date on reoccurring bill pay for a series change . Only the amount can be changed. All can be changed for one time.", "rating": 4}, {"title": "\"A\" Rating", "text": "The only thing I've ever been disappointed in DuGood about was their inability to handle the extra work load involved after Hurricane Harvey. My insurance company contacted them TWICE to initiate pay off of my auto loan & they were \"too busy\" to call me & let me know they needed my permission before responding. Otherwise, they've always been very polite, efficient & timely.", "rating": 4}, {"title": "Business Lending sucks,  normal banking great", "text": "i’ve tried to get in touch with and set up a meeting with the business lending department for months now, and am never able to talk with anyone except the branch manager. No returned calls or messages.   that being said,  each experience walking into the branch has always been very pleasant .  I’m always greeted by a friendly and welcoming staff  tellers are always  competent.", "rating": 4}, {"title": "Update your mobile app", "text": "I am completely happy with the customer service experience but am somewhat disappointed in the payment methods for auto loans.  It needs to be a simple method as other financial institutions have a pay now button on their app that directly takes from the checking account.  I can only give a 4 star rating and hopefully changes will be made to make it not a hassle to pay DuGood money owed", "rating": 4}, {"title": "The New 24 Hour Hold Policy is A Major Inconvenience", "text": "The new policy that doesn't allow me to access my funds until 24 hours after they are transferred from my direct deposit from my social security is very inconvenient and causes a hardship for me.  I hope that DuGood will consider reinstating the old policy.  The 24 hour hold makes things difficult for me, and I'm sure that it's the same for other of your clients as well.Other than that, I really do love doing business with DuGood.", "rating": 4}, {"title": "Loan process is fairly strightforward", "text": "Loan process is fairly strightforward. The extra costs per month are unexpected. insurance fees and changes in interest rates.Statements are needed more frequently to track re-payment plan. They are not as competitave on interest rated as other credit unions. Otherwise they are a decent organizatiuon that provides a service better than commercial banks.", "rating": 4}, {"title": "Great experience", "text": "Had a great loan officer helped me out a lot and was very polite and professional, fast service, overall awesome experience. Good and fair rates. Only thing i didnt like is that i could only get financed for 36 months due to the age of the truck. I find that a little ridiculous but everywhere was like that.", "rating": 4}, {"title": "Recently refinanced our home", "text": "Recently refinanced our home and consolidated other debts. This was all done online and a few phone calls. My loan officer(Ms. Reynolds) was extremely helpful, considerate, and a joy to work with. She made the process very painless by alleiving my fears of the loan process and making it easy to do. I would never hesitate to recommend Dugood CU to any of my friends or family, even your regular banking people are a joy to work with. Keep up the great work!!!", "rating": 4}, {"title": "I've been with DuPont for a number of…", "text": "I've been with DuPont for a number of years. I have recommended DuPont to my children. I have problems from time to time with on line banking but I'm quite a bit older than my children. My children tell me that Mobil Oil FCU is easer to use. I do not know about this but I do know the problems I have from time to time at DuPont. I'm not going any ware, I have My account and seven grand children's accounts that I track monthly as I help them to watch their money grow.Thank You", "rating": 4}, {"title": "Excellent", "text": "Excellent, friendly and professional. Service is swift and atmosphere was calm and welcoming.  The only problem I've had is checking my balance.     Thank you DuGood      Michael Edmond Swisher      Satisfied Customer", "rating": 4}, {"title": "Best credit union or bank I have ever …", "text": "Best credit union or bank I have ever been with. Professionally run but with a small town heart. Courteous and prompt. My suggestion is, drive-thru tends at times to be slower than going inside, but as I am handicapped, it's still worth the wait for the smile and the thank you.Russell E. Proctor", "rating": 4}, {"title": "Don’t like the fact when I bring in…Cashier checks", "text": "Don’t like the fact when I bring in cashiers checks from another credit union in town Every month get treated like I am bringing in fake ones. You may have suspect members that do that but as long as we have been members and the fact we have cd’s already with y’all. It’s annoying.", "rating": 4}, {"title": "All was smooth and easy", "text": "All was smooth and easy.  My only complaint was I had to leave work because I was told I had to sign papers at one of your locations. When I got to the location to sign the papers they told me I didn’t have to sign the papers. That process could be improved somehow.", "rating": 4}, {"title": "Customer Service", "text": "The customer service rep at the DuGood CU Edison Plaza was wonderful. She made our experience (my wife and I)well worth the time and effort. She treated us with the utmost respect and that goes a long way as to whether or not customers keep coming back.", "rating": 4}, {"title": "I am having a very hard time enrolling…", "text": "I am having a very hard time enrolling in online banking and trying to enroll in the app.It states something I entered in registering is incorrect but there isn't anything incorrect. I am unabe to leave my job to get someone to help me. Its frustrating.", "rating": 4}, {"title": "Anavel was a great help and was very…", "text": "Anavel was a great help and was very considerate of my situation. No matter what has happened to me in the past, they take the time to ask question pertaining to me, it’s nice to feel like your are someone and not just another customer!", "rating": 4}, {"title": "They make you feel like a priority.", "text": "Very awesome people who will try their hardest to meet all your needs, along with trying to make any issues you may have a priority to fix. Overall a great credit union and I always recommend them to anyone who is searching for their 'home bank'", "rating": 4}, {"title": "they do work with you", "text": "they do work with you. just not what you go in to  get. we went in to ask for a certain amount on a loan we knew we could afford. but  was offered less, so  something is better than nothing to help balance your budget better", "rating": 4}, {"title": "Products? Great! Fees? Not so much!", "text": "I have been with DuGood  for 11 years now. Every time I have banking needs they are quick to accommodate and assist and the products offered are wonderful. My biggest qualm  is specifically with the service charges that are associated to some of the conveniences they offer such as debit card replacement, account research, and fraudulent claim filing. I’ve considered moving my assets elsewhere on the principal of how inconvenient the fees are in addition to a less than ideal situation such as experiencing fraud on an account, however their flexible credit products and deposit interest rates have provided enough value to remain a client.", "rating": 4}, {"title": "Almost painless", "text": "Almost painless.  My loan officer was very kind, understanding, then quickly worked to determine how she might help me. I had her full attention, until my business was completed. I felt quit comfortable as I was walked thru the process.", "rating": 4}, {"title": "Okay interactions", "text": "The few interactions I had with the office representatives were dry and not warm but helpful, the drive up employees are helpful and warm. Overall, my experience has been okay. My interactions do not reflect my opinions of Dugood overall.", "rating": 4}, {"title": "New Account Set Up", "text": "The lady that set up our account was very knowledgeable about the products and services that DuGood offer. She answered all of our questions. We are very satisfied with the service she provided in getting our account open.", "rating": 4}, {"title": "Lunch time matters", "text": "Went in around noonish, there was only one teller taking care of drive thru & lobby. I would think between 11 & 1 there would be more than just one teller.  Still it was better than my experience at another local bank.", "rating": 4}, {"title": "DuGood has always treated me very good", "text": "DuGood has always treated me very good, they have been very helpful in financing and loaning me the money at a very good rate. Always have treated me with respect, thank you DuGood.SincerelyBarry Uptigrove", "rating": 4}, {"title": "Overall the credit union is great.The …", "text": "Overall the credit union is great.The only thing I disapprove of is the term limits on share loans A member should have an option on the amount of time of a share loan since the money is held for collateral.", "rating": 4}, {"title": "Quick ", "text": "Quick and helpful ", "rating": 4}, {"title": "Everyone is always very helpful and…", "text": "Everyone is always very helpful and friendly!The only complaint I have is not being able to pay bills online due to it being a different bank debt card so I have to call every time to pay my bills.", "rating": 4}, {"title": "My experience with DuGood started off …", "text": "My experience with DuGood started off poorly but by the time I got to Jessica Pitts thankfully she improve my perception drastically..  Her desire to help me was above and beyond expectations.", "rating": 4}, {"title": "Very helpful!", "text": "Very helpful!Thanks WB", "rating": 4}, {"title": "Amazing institution", "text": "Everytime I go into DuGood with any sort of issue the problem is resolved almost instantly. I definitely would recommend banking with  DuGood if you enjoy fast and friendly service!", "rating": 4}, {"title": "Everyone was nice", "text": "Date of experience: December 29, 2023", "rating": 4}, {"title": "The loan officer Tara Baloney did an…", "text": "The loan officer Tara Baloney did an excellent job meeting my needs and getting the loans I asked for.  She kept me informed as the processing was being done and did things speedily.", "rating": 4}, {"title": "Generally very good service", "text": "Generally very good service.  The process to complete transactions when inside of the bank is slow but I believe that may be a function of the government regulations imposed upon banks.", "rating": 4}, {"title": "Good; not great", "text": "I did not realize 4 stars would be great. I wanted the ratings of good; maybe a little less. I thought the process was very disorganized. They seem confused at times.", "rating": 4}, {"title": "WONDERFUL STAFF", "text": "WONDERFUL STAFF I HAVE USED THE BRANCH IN JASPER TX  FOR OVER 20 YEARS AND HAVE HAD THE BEST EXPERIENCE TRUSTING AND HELFUL STAFF WITH ALL MY LOANS AND NEEDS", "rating": 4}, {"title": "Exceptional service along with great …", "text": "Exceptional service along with great savings opportunities. The professionalism makes dealing with the credit union a relaxing experience..Thank You,  Dugood", "rating": 4}, {"title": "I enjoy your staff and how they are…", "text": "I enjoy your staff and how they are willing to help out. I also like the fact you send out updates on what is going on with DuGood. Thanks,Michael Steward", "rating": 4}, {"title": "My experience has been great couldn’t…", "text": "My experience has been great couldn’t ask for a better group of people. Your  professionalism is above and beyond anything  and it’s much appreciate it.", "rating": 4}, {"title": "The person i dealt with directly was…", "text": "The person i dealt with directly was decently informed but couldn't answer my detailed questions like i wanted. We had to ask her boss over to help.", "rating": 4}, {"title": "Always great service", "text": "Always great service. Except when I have to travel to China on Business them my debit card will not work. I have tried to have this fixed with no results", "rating": 4}, {"title": "Need text notifications and transfers", "text": "I don't like having to log in to check balance notifications. A text with this info would be better and easier  Transfers by text would be nice also.", "rating": 4}, {"title": "Have been with Dugood for many years …", "text": "Have been with Dugood for many years and have no complaints with the services. The people have always been egear to help with all me financial needs!!!", "rating": 4}, {"title": "Not sure I'm finished", "text": "Date of experience: July 07, 2023", "rating": 4}, {"title": "I refinance my truck note and it was a…", "text": "I refinance my truck note and it was a very easy. I have been with dugood for years and always easy to deal with. I will be there for my lifespan.", "rating": 4}, {"title": "Good Place and GOOD People!", "text": "Good Place and GOOD People!Need to pay a decent saving Percent..  Your rate is unacceptable considering the Fed has raised rates several times..", "rating": 4}, {"title": "I thank Dugood Credit Union forthe loan…", "text": "I thank Dugood Credit Union forthe loan that was approved. It was at a time of need Thanks again                  Thanks! Claudine Chavis", "rating": 4}, {"title": "the young lady was very good", "text": "the young lady was very good, and made us feel at ease, did not takelong to process the loan. We enjoyed the experience with her", "rating": 4}, {"title": "I'm happy with the service I receive by …", "text": "I'm happy with the service I receive by credit union employees/representatives. They always fulfill my needs, communicate with me well.", "rating": 4}, {"title": "I am a new customer and therefore…", "text": "I am a new customer and therefore reserve 5 stars after i have been with you awhile.  Looking forward to a great relationship.", "rating": 4}, {"title": "Good So Far", "text": "Very good service so far, however, some very petty experiences that could have easily been resolved are hindering my 5 star review.", "rating": 4}, {"title": "I have been with Dugood for years and…", "text": "I have been with Dugood for years and wouldn't think of ever leaving them. They are always helpful and very professional.", "rating": 4}, {"title": "I have enjoyed my credit union", "text": "I have enjoyed my credit union.  I think new members should not have to wait so long before they can cash two party checks.", "rating": 4}, {"title": "Great Service and Banking", "text": "Great credit union to bank with. Only reason I did not give 5 stars is it takes too long to get their EOM statements out.", "rating": 4}, {"title": "Friendly staff that knows me by name", "text": "Friendly staff that knows me by name. They always help me to make the correct choice for what I’m trying to achieve.", "rating": 4}, {"title": "Good Job", "text": "I haven't been banking with you all for long, but as of right now, I have no complaints.  Keep up the good work!!", "rating": 4}, {"title": "DuGood was very easy to become a member …", "text": "DuGood was very easy to become a member of  with no hassles. They helped and advised me on how to improve my credit!", "rating": 4}, {"title": "Great & Simplified Experience!", "text": "Tara I think her name is.She was very pleasant,professional and prompt which made this process very simple!", "rating": 4}, {"title": "Car Loan", "text": "I opened my Car loan financing with the Dugood credit union and my experience with them is pretty good till now.", "rating": 4}, {"title": "Car loan", "text": "Thanks for the experience and accepting my loan. Low monthly payments and interest. Definitely affordable.", "rating": 4}, {"title": "I received quick response to my purpose…", "text": "I received quick response to my purpose and the experience was very professional and address all my needs", "rating": 4}, {"title": "I love DuGood Credit Union", "text": "I love DuGood Credit Union, my only complaint is that they charge for everything now, just like the big banks.", "rating": 4}, {"title": "Good people", "text": "Good people, low costs, reliable service, support community.Newest site software has some kinks, slow to fix", "rating": 4}, {"title": "Dupont Goodrich", "text": "have been a member of Dugood since it was called goodrich, ive been happy and well served in all these years", "rating": 4}, {"title": "I would recommend this credit union", "text": "I would recommend this credit union to anyone. They are professional, courtesy and pleasant to deal with.", "rating": 4}, {"title": "Account", "text": "Very personal and they test for fever I like that. Very nice place glad to meet you all. God. Bless", "rating": 4}, {"title": "We love Dugood FCU", "text": "We love Dugood FCU. If I  ever have any problems you are always quick to solve them and very courteous.", "rating": 4}, {"title": "Online Banking is Great…", "text": "I especially find their online banking to be easy. The employees are always helpful while in the bank.", "rating": 4}, {"title": "They were quick and efficient", "text": "They were quick and efficient,  and answered any questions I had...Very respectful and polite...", "rating": 4}, {"title": "The people is very nice and friendly..", "text": "The people is very nice and friendly... Had a problem and they helped me by explaining it to me...", "rating": 4}, {"title": "I always have a good experience they…", "text": "I always have a good experience they are always there when I need help no matter what it may be", "rating": 4}, {"title": "We received conflicting information…", "text": "We received conflicting information initially, but after that, the experience was good.", "rating": 4}, {"title": "Typically get great service", "text": "Typically get great service. Jasper office is, by far, our favorite with friendly at.", "rating": 4}, {"title": "Thank You!", "text": "I appreciate that DG was sincere about me becoming a member. Thank You DG!Rodney", "rating": 4}, {"title": "Come on Jada", "text": "Come on Jada, You over do this COVID thing.  Embarrassing and sad.  Doug Carrier", "rating": 4}, {"title": "From the beginning", "text": "From the beginning, they helped explain the process and everything went as planned.", "rating": 4}, {"title": "Vehicle titles", "text": "They were very kind and helped us get 2 vehicles in our name!", "rating": 4}, {"title": "Always very helpful specially living in …", "text": "Always very helpful specially living in a different state with my banking needs.", "rating": 4}, {"title": "Great service terrific employees who…", "text": "Great service terrific employees who will make sure you get the job done", "rating": 4}, {"title": "Good credit union", "text": "Have had some good experiences with customer service and the lending department", "rating": 4}, {"title": "Great friendly and courteous service", "text": "Great friendly and courteous service. Also courteous accurate service.", "rating": 4}, {"title": "Costumer Service", "text": "Has great customer service and location are very comfortable and clean", "rating": 4}, {"title": "The employees at the Jasper branch are …", "text": "The employees at the Jasper branch are dedicated to helping their customers!", "rating": 4}, {"title": "None", "text": "I got my debit cards here and I like it that I didn't have a hard time", "rating": 4}, {"title": "Good", "text": "I recently filled out online for a car loan and haven't heard anything", "rating": 4}, {"title": "I have no complaints", "text": "I have no complaints Dugood Credit Union has always treated me great", "rating": 4}, {"title": "When I went to the branch the workers…", "text": "When I went to the branch the workers were very nice and helpful.", "rating": 4}, {"title": "Very nice people", "text": "Very nice people. They explain things very well. Thank you again", "rating": 4}, {"title": "Hometown friendliness is the best", "text": "Hometown friendliness is the best. Always available and amenable.", "rating": 4}, {"title": "Great people no hassle easy to get …", "text": "Great people no hassle easy to get financing with low interest", "rating": 4}, {"title": "Started out asking for one amount and…", "text": "Started out asking for one amount and got a different one", "rating": 4}, {"title": "Very easy", "text": "Very easy. Friendly staff", "rating": 4}, {"title": "prefer to bank local,refi truck,easy…", "text": "prefer to bank local,refi truck,easy -helpful-no stress", "rating": 4}, {"title": "Always great service and quick to help…", "text": "Always great service and quick to help when needed", "rating": 4}, {"title": "Decent union", "text": "Decent union. Nice and friendly staff! Very helpful", "rating": 4}, {"title": "Dugood has great customer service and…", "text": "Dugood has great customer service and customer support!", "rating": 4}, {"title": "Bad start debit card would not work.", "text": "Date of experience: April 17, 2022", "rating": 4}, {"title": "I had a great experience the service…", "text": "I had a great experience the service was perfect", "rating": 4}, {"title": "Good customer services", "text": "Date of experience: October 27, 2023", "rating": 4}, {"title": "My experiences with DugGood have been…", "text": "My experiences with DugGood have been very good.", "rating": 4}, {"title": "Very nice people has been a great …", "text": "Very nice people has been a great experience", "rating": 4}, {"title": "Seems to be a really great group of…", "text": "Seems to be a really great group of people.", "rating": 4}, {"title": "Dugood has been nothing but Great to us", "text": "Date of experience: May 04, 2020", "rating": 4}, {"title": "Very helpful", "text": "Very helpful, and great customer service!", "rating": 4}, {"title": "It is very easy", "text": "It is very easy, fast and reliable.", "rating": 4}, {"title": "Great Staff", "text": "Great Staff. Very welcoming.", "rating": 4}, {"title": "Good enough", "text": "Good enough. I don't like banks.", "rating": 4}, {"title": "DUGOOD IS AWESOME AND VERY HELPFUL", "text": "Date of experience: July 05, 2018", "rating": 4}, {"title": "Cool bank", "text": "Cool bank I’m in a hurry", "rating": 4}, {"title": "Excellent help", "text": "Excellent help. Friendly people.", "rating": 4}, {"title": "I like DuGood credit Union", "text": "Date of experience: October 25, 2021", "rating": 4}, {"title": "Review", "text": "No complaints all good experience", "rating": 4}, {"title": "Got a loan,quick and painless", "text": "Date of experience: January 06, 2021", "rating": 4}, {"title": "Great service and fast response", "text": "Date of experience: June 29, 2019", "rating": 4}, {"title": "I have been with you since 1973", "text": "Date of experience: February 18, 2018", "rating": 4}, {"title": "Good helpful associate", "text": "Date of experience: July 11, 2023", "rating": 4}, {"title": "DuGood has nice friendly staff", "text": "Date of experience: March 01, 2018", "rating": 4}, {"title": "Gud experience", "text": "Gud experience ", "rating": 4}, {"title": "Great communication!", "text": "Date of experience: October 20, 2021", "rating": 4}, {"title": "Great customer service", "text": "Date of experience: May 04, 2021", "rating": 4}, {"title": "They were very helpful", "text": "Date of experience: August 15, 2019", "rating": 4}, {"title": "Great Customer Service!", "text": "Date of experience: November 20, 2017", "rating": 4}, {"title": "Service was great.", "text": "Date of experience: June 26, 2020", "rating": 4}, {"title": "nice friendly bank", "text": "Date of experience: March 27, 2018", "rating": 4}, {"title": "It was great I would honestly…", "text": "recommend. 10/10", "rating": 4}, {"title": "Friendliness", "text": "Date of experience: July 31, 2023", "rating": 4}]