[{"title": "Process to Renewal CG Bond ", "text": "Easy To Complete the Process but still waiting for my Bond email. Other than that, is a good, I recommended ", "rating": 4}, {"title": "It got better…", "text": "I still cannot communicate via telephone with this company. However, a great CSR helped me by handling my issue via email and text.  I got a rider for the bond, which stated the correct bond amount, and all went easily today.", "rating": 4}, {"title": "They were fine", "text": "They were fine, efficient, and inexpensive. I was perturbed over being contacted several times up to 2 mo before the current expired and pushed to renew. ", "rating": 4}, {"title": "I had a very good  experience with…", "text": "I had a very good  experience with Surety Bonds. However  I was not able to receive my emails because for some reason they went to my spam folder. After waiting for a call I called and discovered the problem. After not receiving a reply from me, it would of been better to give me a call. It stopped the process and I was on a very tight window to complete the bond. Nevertheless you came through with flying colors to get me my bond on time. Thank you very much!", "rating": 4}, {"title": "Emailing your bond", "text": "Most of the information it was easy to follow the instructions.  It was when I had to email the bond back; it would been helpful to know you had to go back into\"Reapply\" to find the upload document box.  ", "rating": 4}, {"title": "The service received by SuretyBonds.com…", "text": "The service received by SuretyBonds.com was excellent. I appreciated how quick and professional the service was. I would recommend this business and use you again. ", "rating": 4}, {"title": "Need volume discount", "text": "1. There is no scope to buy it for over three years and get an additional discount.2. The price has gone up without additional service included with the new price hike. ", "rating": 4}, {"title": "Great bond not so great customer service on the phone", "text": "I had no trouble finding the bond I wanted, however once I called in and spoke to the lil guy from your company I had thought of going with another company.   Why do the reps on the other end of the phone feel they must talk over me?", "rating": 4}, {"title": "Service is good quick and efficient", "text": "Service is good quick and efficient. Unfortunately, the price doubled this year so not sure what happened and so may explore other opportunities. Been with this company for multiple years though and has worked fine thus far.", "rating": 4}, {"title": "I was very happy with this site", "text": "I was very happy with this site.  It is User-friendly, and very easy to follow.  I would have liked a little more direction and explanation on what all the forms were, and if they all needed to be sent in to the state; but other than that, it was a good experience.", "rating": 4}, {"title": "Trouble on dektop browser", "text": "Had some trouble using the purchase part of the website on my computer (mac/chrome). Go tme to the screen right after I clicked the purchse button, but then just sat there spinning the cursor. Had to go to my phone (android/chrome) and it worked perfectly.", "rating": 4}, {"title": "It was a refreshing experience because…", "text": "It was a refreshing experience because it took less than 30 minutes to receive my bond after dealing with my tag local tag office for almost a year. Thank you Suretybonds.com!     Michelle", "rating": 4}, {"title": "The agent was very professional", "text": "The agent was very professional, very relatable, as well as humble. He made it very easy for us to understand what type of bond we needed...even went as far as to look up what counties bonds were needed in which allows our company to be successful!", "rating": 4}, {"title": "Quick and easy though more expensive…", "text": "Quick and easy though more expensive than I anticipated, the trade off was fair. Thanks for making it easy. ", "rating": 4}, {"title": "Good experience so far", "text": "Can't speak for needing them for any claims, however the process of obtaining a bond was transparent and quick. Much appreciate that piece and the pricing.", "rating": 4}, {"title": "The process was easy", "text": "The process was easy, but I wish that we did not have to go court for certification. Would that not be easier if we had an option to pay the court fee at the same time we pay for the surety and it would be sent to state treasury directly ?", "rating": 4}, {"title": "Quick response with email", "text": "Quick response with email. Just a mistake by online system with arrangements of the vin number and body type printed on form. Very nice customer service. Will recommend", "rating": 4}, {"title": "Always glad to get this easily handled…", "text": "Always glad to get this easily handled through Surety.  This year we were asked to provide some information that turned out to be unnecessary.  Otherwise, all good.", "rating": 4}, {"title": "I needed a document from you guys a…", "text": "I needed a document from you guys a continuous contractor Surety Bond and could not find it in paperwork. There were some problems but they worked really fast to resolve the issue and help me get where i need to go. They did a pretty good job.", "rating": 4}, {"title": "It is easy to apply for a bond and the…", "text": "It is easy to apply for a bond and the forms that come out for the cities applies appropriately. It would be nice for a discount for continued use if there were no claims from the year before", "rating": 4}, {"title": "Quick and inexpensive and responsive", "text": "I am executor of my mom's estate, and doing it without an attorney.  SuretyBonds.com was nonetheless willing to issue a bond.  Even though the bond was for a relatively small amount, the only overhead beyond the 0.5% charge was a modest $10 for 3-day shipping.  The Account Manager, Zack, was extremely responsive to any e-mail I sent.  I did not have to unfreeze our credit reporting for them to approve the bond.I with I could ding them only 1/2 star for a small problem, but can't quite give them a perfect score.  They did not include \"Executor\" after my name on the bond, and the court rejected it.  We were about to go on a 2-week trip, so I wanted to resubmit a revised bond before we left.  I e-mailed Zack, and they not only issued the revised bond the same day, but also paid for overnight shipping at their own expense.I would definitely use them again.", "rating": 4}, {"title": "Quick and fast service", "text": "Quick and fast service and I loved the ability to download and print the bond docs quickly. I wish the service provided a more concise definition/distinction of the insurance company name. This is the only reason I rate it a 4 star vs. 5 star. Other than that the service online was great.", "rating": 4}, {"title": "Overall good experience", "text": "Overall good experience; paperwork was missing some important words i.e. probate judge (company used only the word judge)", "rating": 4}, {"title": "While the application process was easy…", "text": "While the application process was easy and quick, I have not received my bond yet.  When can I expect it?  I received this email request for a survey before I even received my bond.I increased my rating from a 3 to a 4 because they were quick to respond and get me my bond.", "rating": 4}, {"title": "Got Bónd Cert ón same day", "text": "I got my bond very  right away. As it is I am late in applying beç I ran into some constraints. I'm 65 and decíded tó stop doing ÑP, but thought it óut and decided to recert. Yx u", "rating": 4}, {"title": "The process was SUPER quick and easy", "text": "The process was SUPER quick and easy. I should mention that my bond was priced great. Way cheaper than I expected. I would definitely recommend surety bonds.com to anyone in need of a bond. ", "rating": 4}, {"title": "E&O/Bond", "text": "I only needed E & O and a Bond for my Notary Public Certificate. It took me 5 mins to complete my selection and it was a much lower rate than most were offering online.", "rating": 4}, {"title": "Support Emails Not Answered", "text": "Sent several emails to customer support that were never answered. I had to call them on the phone to get my bond reshipped after FedEx lost the overnight package.", "rating": 4}, {"title": "I bought the wrong type of bond", "text": "I bought the wrong type of bond. I need a cancellation & refund. Update: excellent customer service the matter is resolved, I am changing my level of stars.", "rating": 4}, {"title": "Quick, Cost Effective and Simple", "text": "SuretyBonds.com was quick, cost effective and quite simple. Had my bond in moments. My only thought is that, on the website, I did not see an explanation that the state required form would be completed and included with my bond. I called and Robert answered right away and explained that it would be included. Fine work. I will return next time.", "rating": 4}, {"title": "Do NOT get the overnight shipping", "text": "Do NOT get the overnight shipping.  It is a joke.  Though they did get the package ready overnight, FedEx had no intention of getting it anywhere that fast.  Money down the drain.I hope they can refund that part.Other than that, it seems that everything else is as-advertised.  Now I can drive my new vehicle!", "rating": 4}, {"title": "Only issue I had was I didn't get an…", "text": "Only issue I had was I didn't get an original copy mailed to me. I had to call and pay extra for shipping to get them. The process of contacting them and getting that done was smooth and friendly. ", "rating": 4}, {"title": "City Bond", "text": "Having the reminder was great.  Otherwise, I would have forgot it, again.Thank you.", "rating": 4}, {"title": "The service was fast and efficient", "text": "The service was fast and efficient. the only short fall was that my county (Paulding County, GA) also needed a Car Fax, and I have no reason why. But that cost me an additional $45", "rating": 4}, {"title": "Got a bonded title", "text": "I got the title I needed without any hassle but I will not buy a car without a title again I'm not blaming Surety. I'm blaming Kimbro Recyclers, they were not giving the real info.", "rating": 4}, {"title": "Great customer service", "text": "I called with a couple of questions I had regarding the bonds and they were extremely  helpful. They went above and beyond and guided me to choose the plan that better fits my needs.", "rating": 4}, {"title": "Mark was friendly and very helpful.", "text": "Mark was friendly and very helpful.The only problem the stamped signature was place where I signed.So the certificate has to redone and re mail the correct certificate.", "rating": 4}, {"title": "Company has been easy to work with", "text": "Company has been easy to work with - and I appreciate the reminders e-mailed to my inbox.  I have not had to use my bond yet, so son't know how easy this would be...", "rating": 4}, {"title": "Bond renewal", "text": "What makes our experience great with Surety bonds. We know exactly what our cost will be no surprises. When we need a problem solved the surety bonds rep response is quick and easy to deal with thanks!!", "rating": 4}, {"title": "Was super easy.", "text": "Was super easy.My only issue was the info took forever to come into my email but that was probably me just being inpatient.", "rating": 4}, {"title": "The process worked fine", "text": "The process worked fine, it seems we needed to sign up earlier than when our previous bond expired.", "rating": 4}, {"title": "Fast and easy", "text": "The process was very easy and the instructions were clear.", "rating": 4}, {"title": "Simple and easy to follow instructions", "text": "Simple and easy to follow instructions. Prices were what they said they'd be. Only suggestion would be better laymans terms for explaining bond.", "rating": 4}, {"title": "Surety Bond revisited my request and…", "text": "Surety Bond revisited my request and made the necessary adjustments that were required.Thank great fully.", "rating": 4}, {"title": "Really not sure I just needed this fun…", "text": "Really not sure I just needed this fun event for my peanut stand and I appreciate it", "rating": 4}, {"title": "Good process", "text": "Helpful information and web page design to find product easily. Clear and fast purchase processing.", "rating": 4}, {"title": "Great customer service told them what I…", "text": "Great customer service told them what I needed and quick they got on it and it's cheap price .", "rating": 4}, {"title": "Very good and enjoyable experience", "text": "Very good and enjoyable experience. Decided to go with them because they were the only ones that help me find the right plan for my company. The most cost-effective one too. The other companies were upselling me and didn't offer more economical options. I am very satisfied with my experience.", "rating": 4}, {"title": "Just being able to take care of this…", "text": "Just being able to take care of this online was perfect. It was quick and easy to fill out the application. I was able to purchase and confirm my bond in just a couple hours.", "rating": 4}, {"title": "The only issue I had was that the bond…", "text": "The only issue I had was that the bond amount listed was higher than need and that cost us additional funds that we did. It have to spend", "rating": 4}, {"title": "U guys are outstanding", "text": "U guys are outstanding I really appreciate the lady that transact the business with Thank you so much", "rating": 4}, {"title": "Most of it was good", "text": "Process was seamless with paying you but why the delay in getting my license ? ", "rating": 4}, {"title": "Quick and easy", "text": "Quick and easy, only issue was finding an online site that provided this service.", "rating": 4}, {"title": "What made my experience great", "text": "What made my experience great? Was it was easy to understand and short . ", "rating": 4}, {"title": "Information what easy to find on the…", "text": "Information what easy to find on the internet, easy to understand and the process was easy and very user friendly.", "rating": 4}, {"title": "Mark was responsive and timely", "text": "Mark was responsive and timely.  He made sure I received what I needed.  I appreciate his time.", "rating": 4}, {"title": "Exactly the requirement. Precision specialist..", "text": "Got it done as well as we had a history ofPurchasing. First time with your service and this is a breeze.", "rating": 4}, {"title": "The support staff was friendly and…", "text": "The support staff was friendly and efficient in helping me get the right type of bond.", "rating": 4}, {"title": "Quick and easy!", "text": "Very pleased with the ease and speed my bond was activated. I was on a time crunch and needed it right away. Thank you surety bonds!", "rating": 4}, {"title": "I appreciate the prompt reminders ", "text": "I appreciate the prompt reminders to keep me compliant and the customer service when I have questions. ", "rating": 4}, {"title": "A company  you can trust and depend on", "text": "Good people quick service excellent follow up what more could I ask for .What more can anyone ask for", "rating": 4}, {"title": "The ease of order placement.", "text": "The ease of order placement makes this the best service available to our firm.", "rating": 4}, {"title": "Everything went well", "text": "Everything went well. Fed Ex delivery was late but overall satified.", "rating": 4}, {"title": "Better luck the second time around", "text": "The original bond was written with incorrect information, through a combination of confusion on my part with what was required and the web system allowing a bond to be issued with incomplete or incorrect info. And although my original call with Brandon didn't resolve the issue, a follow-up call initiated by Brad was fruitful and the issue was resolved.", "rating": 4}, {"title": "Everything was super easy", "text": "Everything was super easy.  I've never had a bonded title before.  ", "rating": 4}, {"title": "you were very responsive and got what I…", "text": "you were very responsive and got what I needed", "rating": 4}, {"title": "A little confusing", "text": "Other than I got a message that said I needed to complete my order. ??", "rating": 4}, {"title": "Great job", "text": "Did a great job was very helpful and I appreciate the help ", "rating": 4}, {"title": "Fast and reliable", "text": "Fast and reliable. No wait you will get your determination response promptly.", "rating": 4}, {"title": "Good quality service rendered", "text": "Good quality service rendered.  Attended to my issues quickly and timely.", "rating": 4}, {"title": "Fast and clear to the point", "text": "Fast and clear to the point. They helped me a great deal in selecting the bond I needed , friendly and courteous. Would recommend to my friends", "rating": 4}, {"title": "I would like  to be able to make the…", "text": "I would like  to be able to make the payment online by being able to schedule it.", "rating": 4}, {"title": "The ease of completing application once…", "text": "The ease of completing application once I found it online", "rating": 4}, {"title": "Easy access and step by step…", "text": "Easy access and step by step instructions to completing the task", "rating": 4}, {"title": "Easy to use site", "text": "Easy to use site. Prompt response. Correct paperwork.", "rating": 4}, {"title": "Quick process", "text": "Quick process, easy to complete.", "rating": 4}, {"title": "Good customer service", "text": "The representative was knowledgeable and courteous and help me out", "rating": 4}, {"title": "Simple", "text": "Simple, Fast, and Efficient ", "rating": 4}, {"title": "Easy use of the website", "text": "Easy use of the website. A seamless process", "rating": 4}, {"title": "It was nice that we were able to take…", "text": "It was nice that we were able to take care of everything over email, although it took a few emails for them to understand that was my preferred method of communication. In the end, we were able to get the bond we needed within a small amount of time and just a couple of emails.", "rating": 4}, {"title": "I received my bond in a matter of…", "text": "I received my bond in a matter of days!!  Pretty seamless!!", "rating": 4}, {"title": "The sales Rep ", "text": "The sales representative was nice and courteous. ", "rating": 4}, {"title": "Ease of online access.", "text": "Ease of online access. ", "rating": 4}, {"title": "Execution went well", "text": "Execution went well, yet forgot to deliver the bond documents in a timely manner.", "rating": 4}, {"title": "Thank you!", "text": "Thank you for making this an easy and enjoyable experience.", "rating": 4}, {"title": "First time doing one of these… you guys…", "text": "First time doing one of these… you guys made it surprisingly easy. Thank you.", "rating": 4}, {"title": "It was very user friendly and receiving…", "text": "It was very user friendly and receiving the title in no time.", "rating": 4}, {"title": "Very efficient & knowledgeable", "text": "Very efficient & knowledgeable. Process from application to bonded was quick.", "rating": 4}, {"title": "Service  experience and excellent", "text": "Constructive  and extremely informative  service fees are  very  competitive", "rating": 4}, {"title": "The process was easy enough", "text": "The process was easy enough, and the response time was exceptional. What I'm not sure of is why our cost wasn't at 1% as we have never had a claim (38 years) and our credit score is excellent.", "rating": 4}, {"title": "Would have been 5 stars except I didn't…", "text": "Would have been 5 stars except I didn't receive my bond on the same day even though I had my request in before deadline. It did come in the next day before 10am. Other than that it was really easy and convenient.", "rating": 4}, {"title": "Online renewal was quick and simple", "text": "Date of experience: July 11, 2023", "rating": 4}, {"title": "Easy to understand and quick service", "text": "Date of experience: June 16, 2023", "rating": 4}, {"title": "I was able to get it very fast and easy…", "text": "I was able to get it very fast and easy not kind of trouble in any kind of way", "rating": 4}, {"title": "I had a difficult time downloading my…", "text": "I had a difficult time downloading my certificate.", "rating": 4}, {"title": "You were pleasant and helpful until i…", "text": "You were pleasant and helpful until i received the bond in the mail .I emailed and left a voicemail with my quick and easy questions and never got a call back . I called back about 5 days later snd finally got someone to explain what i needed and told the gentlemen that this should have been included in the packet . Seems simple to me", "rating": 4}, {"title": "Would have been a 5 star.", "text": "I have been happy with my bond   through your company.that being said only reason you didn't get a 5 star is because you start hounding me 3.6 months before my renewal date I refuse to pay for a service that is supposed to be a year bond early ,I guarantee  you don't pay a dmv fee three months before it expires.also after we had renewed someone called from your company to let me know my coverage  was about to lapse,which was weird because I had a renewal paid conformation. Guess  your renewal hounds didn't get the memo.", "rating": 4}, {"title": "First time", "text": "First time, so waiting on my order", "rating": 4}, {"title": "Fast ", "text": "The response time.", "rating": 4}, {"title": "Well it seems that I paid for another…", "text": "Well it seems that I paid for another surety bond ($100) for no reason. I went to the MVD here and they already had their copy of my bond. I presume it was the last one I paid for like 45 days ago. Should that be the case I would like to have $100 refunded to me. Thx", "rating": 4}, {"title": "Easy to deal with but a little pricey", "text": "Date of experience: September 18, 2024", "rating": 4}, {"title": "Super easy to work with", "text": "Super easy to work with, fast process.", "rating": 4}, {"title": "A customer advocate from Surety…", "text": "A customer advocate from Surety resently saw my previous review and contacted me and helped me resolve my transfer of guardianshiop issues to my satisfaction.  I really do appreciate that follow up and assisting to close my account.Thank you!", "rating": 4}, {"title": "website was very easy to maneuver.", "text": "Date of experience: May 03, 2023", "rating": 4}, {"title": "Thanks for a great experience.", "text": "Date of experience: March 11, 2024", "rating": 4}, {"title": "Actively assisted", "text": "Actively assisted, with prompt service.", "rating": 4}, {"title": "Easy", "text": "Easy , fast and accurate.", "rating": 4}, {"title": "Bond Renewal", "text": "It  was fast and easy to renew online", "rating": 4}, {"title": "Easy access", "text": "Easy access and payment options", "rating": 4}, {"title": "Zach was very thorough and answered all…", "text": "Zach was very thorough and answered all my questions. While the prices doubled from last year I received my bond quickly. I hope the FLSMH takes it.", "rating": 4}, {"title": "Easy to use", "text": "Easy to use. Very fast.", "rating": 4}, {"title": "Handled the problem and cared about the issues.", "text": "Fixed the issues and were very polite. Thanks", "rating": 4}, {"title": "Good ok", "text": " Good, missed a info error had to make 2 DMV trips!!", "rating": 4}, {"title": "Thumbs up", "text": "Quick, easy and efficient", "rating": 4}, {"title": "Satisfied Customer", "text": "The experience was seamless and efficient.", "rating": 4}, {"title": "Easy", "text": "Got what i needed same day one less stressfull thing", "rating": 4}, {"title": "You guys were quick to renew my bond.", "text": "Date of experience: June 17, 2024", "rating": 4}, {"title": "Great service", "text": "Great service ", "rating": 4}, {"title": "It was an easy process turn over time…", "text": "It was an easy process turn over time was great.", "rating": 4}, {"title": "Easy and quick service", "text": "Date of experience: July 16, 2024", "rating": 4}, {"title": "Quick and easy", "text": "Just made everything simple.. so it was a quick and easy process.. thanks", "rating": 4}, {"title": "pretty straight-forward.", "text": "pretty straight-forward.Got a notice to renew. Looked over, noticed no changes, sent my payment.", "rating": 4}, {"title": "Quick service and good response", "text": "Quick service", "rating": 4}, {"title": "Simple process", "text": "Date of experience: October 13, 2023", "rating": 4}, {"title": "Honest ", "text": "My friend talk about how great you are guys ", "rating": 4}, {"title": "Owner ", "text": "The return time was great. The price was good as well. ", "rating": 4}, {"title": "Quick response", "text": "Date of experience: April 25, 2023", "rating": 4}, {"title": "So far they help me with my mistakes", "text": "Date of experience: December 25, 2023", "rating": 4}, {"title": "Was quick", "text": "Was quick, effective.  ", "rating": 4}, {"title": "Team was responsive and helped me thru…", "text": "Team was responsive and helped me thru the whole process since it was my first time. Very helpful and quick with response times!", "rating": 4}, {"title": "I only gave 4 ratings because of the…", "text": "I only gave 4 ratings because of the mistake that had to be corrected which will cause longer time for me to get my notary renewed", "rating": 4}, {"title": "I needed to get a title bond cert", "text": "I needed to get a title bond cert. And this site was pretty self explanatory.Very helpful", "rating": 4}, {"title": "quick", "text": "quick, easy, and fast", "rating": 4}, {"title": "Answered all my questions.", "text": "Date of experience: March 11, 2024", "rating": 4}, {"title": "Fast and efficient.", "text": "Date of experience: March 06, 2024", "rating": 4}, {"title": "Very good", "text": "Very good - one little mistake - bond wasn't mailed until 5 business days later - but no big deal", "rating": 4}, {"title": "I wish I could get this done before…", "text": "I wish I could get this done before 3/15/2023", "rating": 4}, {"title": "Very easy and quick turnaround", "text": "Very easy and quick turnaround ", "rating": 4}, {"title": "Excellent service ", "text": "Quick, easy and understanding ", "rating": 4}, {"title": "Insurance Agent", "text": "Fast and accurate.", "rating": 4}, {"title": "That costs have really gone up", "text": "I was pretty shocked at the prices.  They have really gone up", "rating": 4}, {"title": "As it turned out", "text": "As it turned out, I didn't need it.", "rating": 4}, {"title": "Was great and helpful", "text": "Date of experience: April 15, 2024", "rating": 4}, {"title": "Thanks ", "text": "Thanks Fast and Simple process", "rating": 4}, {"title": "Bond purchase done right", "text": "It was smooth process.", "rating": 4}, {"title": "Easy", "text": "It was easy to file out and did not have any issues", "rating": 4}, {"title": "Easy to access", "text": "Easy to access. I would have liked to see a response on a timeline as I wait for the status of my bond.", "rating": 4}, {"title": "Simple and efficient.", "text": "Date of experience: June 26, 2023", "rating": 4}, {"title": "Good and ", "text": "Good and Fast service ", "rating": 4}, {"title": "It was easy to get signed up", "text": "It was easy to get signed up for this group.", "rating": 4}, {"title": "Very easy and fast", "text": "Very easy and fast! Using surety for years 👍🏻", "rating": 4}, {"title": "easy", "text": "It was an easy process", "rating": 4}, {"title": "Super fast and simple", "text": "Date of experience: November 16, 2023", "rating": 4}, {"title": "Easy to follow instructions", "text": "Date of experience: December 28, 2023", "rating": 4}, {"title": "Easy to complete the form and pay", "text": "Date of experience: January 27, 2023", "rating": 4}, {"title": "Download my certificate right away I pay", "text": "Date of experience: December 02, 2022", "rating": 4}, {"title": "SMASHING EASY RENEWAL PROCESS", "text": "PERSONABLE FRIENDLY AND QUICK RENEWAL PROCESS.", "rating": 4}, {"title": "Great service", "text": "Good service No need to look further.Go with Surety Bonds", "rating": 4}, {"title": "Easy straightforward and reasonable cost", "text": "Date of experience: March 20, 2023", "rating": 4}, {"title": "The price and the response time", "text": "Date of experience: October 31, 2023", "rating": 4}, {"title": "Great", "text": "I THINK I SPOKE TO TWO DIFFERENT GUYS. BOTH WERE FANTASTIC!", "rating": 4}, {"title": "Got everything done quickly.", "text": "Date of experience: August 08, 2024", "rating": 4}, {"title": "It’s very easy and fast", "text": "It’s very easy and fast. I love it. ", "rating": 4}, {"title": "Phone Call Voice Mail", "text": "No written review.", "rating": 4}, {"title": "straightforward website with easy…", "text": "straightforward website with easy instructions ", "rating": 4}, {"title": "Fast and Reasonable Service", "text": "I was impressed with the quick service I received at a reasonable cost.", "rating": 4}, {"title": "Ease of renewing the policy", "text": "Date of experience: October 05, 2022", "rating": 4}, {"title": "all good I dont have time for this", "text": "Date of experience: January 25, 2023", "rating": 4}, {"title": "Was a very quick process", "text": "Was a very quick process. Not sure what more I needed. Thank you.", "rating": 4}, {"title": "Quick and easy", "text": "Date of experience: September 04, 2024", "rating": 4}, {"title": "Renewals reminders were helpful.", "text": "Renewals reminders were helpful.Thanks", "rating": 4}, {"title": "Hassle free", "text": "Hassle free, user friendly and fast.", "rating": 4}, {"title": "Got me a title for my car", "text": "Date of experience: October 09, 2023", "rating": 4}, {"title": "Very knowledgeable and great customer…", "text": "Very knowledgeable and great customer service experience!", "rating": 4}, {"title": "Fast and friendly will use again", "text": "Fast and friendly, will use again.", "rating": 4}, {"title": "Online ability", "text": "Online ability, reminder needed.", "rating": 4}, {"title": "Ease of use", "text": "Easy to get through screens", "rating": 4}, {"title": "Renewal ", "text": "Quick and easy ", "rating": 4}, {"title": "Unique and unbelievable", "text": "Unique and unbelievable , time saver...!", "rating": 4}, {"title": "Fast and what I needed", "text": "Date of experience: January 06, 2023", "rating": 4}, {"title": "Prompy repronse and deliverance.", "text": "Date of experience: June 26, 2023", "rating": 4}, {"title": "It seems pretty simple", "text": "Date of experience: December 21, 2023", "rating": 4}, {"title": "We got it right away.", "text": "Date of experience: February 24, 2023", "rating": 4}, {"title": "Quick and exactly what I needed to get me on the road with my new vehicle. ", "text": "Quick and easy!!", "rating": 4}, {"title": "The professionalism and convenience.", "text": "The professionalism and convenience. ", "rating": 4}, {"title": "I got what I needed", "text": "Date of experience: May 15, 2023", "rating": 4}, {"title": "Great customer service", "text": "Date of experience: August 15, 2023", "rating": 4}, {"title": "Fast & easy set up.", "text": "Date of experience: August 01, 2022", "rating": 4}, {"title": "Fast Service helpful staff", "text": "Date of experience: July 04, 2022", "rating": 4}, {"title": "Completing the information quickly.", "text": "Date of experience: April 03, 2023", "rating": 4}, {"title": "Great communicator ", "text": "Great communication ", "rating": 4}, {"title": "Quick an easy", "text": "Date of experience: February 20, 2023", "rating": 4}, {"title": "great experience", "text": "Date of experience: June 12, 2024", "rating": 4}, {"title": "Quick and easy", "text": "Date of experience: February 07, 2023", "rating": 4}, {"title": "Quick and easy", "text": "Date of experience: March 03, 2023", "rating": 4}, {"title": "Good process", "text": "Date of experience: July 20, 2022", "rating": 4}, {"title": "]juneverison7@|Ive.com", "text": "Date of experience: January 21, 2023", "rating": 4}, {"title": "Good", "text": "...................", "rating": 4}, {"title": "Nonapplicable", "text": "Date of experience: April 17, 2024", "rating": 4}, {"title": "1234567890", "text": "Date of experience: September 07, 2023", "rating": 4}, {"title": "Respond quick and good communication", "text": "You guyas Respond quick and good communication I happy to work with you guyas", "rating": 4}, {"title": "My Surety agent originally had no…", "text": "My Surety agent originally had no response from my lawyer last year who he needed to contact to initiate the bond. After discussing this lack of contact from my lawyer I told the bond agent he needed to be more aggressive in contacting my lawyer. My bad...the fault was with my lawyer for not returning his call. I call my lawyer, he called your agent and all went well after that....thank you Surety for your service.", "rating": 4}, {"title": "Excellent job in helping me achieve my…", "text": "Excellent job in helping me achieve my bond certification. The online tool was very convenient . I did everything at my desk in less than 10 minutes. I only had to leave my office to get sworn in but other than that I really appreciate the online tools.if and when I needed assistance there was a live very knowledgeable person that was eager to assist. That you great experience.....", "rating": 4}, {"title": "Bond and errors and omissions", "text": "I ordered my bond and errors and omission insurance and it was quick, and easy. Thank you for the prompt email with my bond, now I can continue the process of becoming a notary public.", "rating": 4}, {"title": "The service was very good.", "text": "Date of experience: May 12, 2022", "rating": 4}, {"title": "This was the 3rd bond I had purchased", "text": "This was the 3rd bond I had purchased.  Overall everything has gone smoothly overall except for one little glitch.  I have two companies, both with the same name.  The difference is between them is that one is a corporation and the other is a Limited Liability company. I had to send back one of the bonds because it had Inc and should have had LLC.", "rating": 4}, {"title": "Great Job", "text": "Great job in providing the bond needed to further my intrests", "rating": 4}, {"title": "Good service used this company many time", "text": "Date of experience: April 16, 2022", "rating": 4}, {"title": "When ordering the bond it would have…", "text": "When ordering the bond it would have been nice if the person would have told me the dates of the bond needed to be exactly as stated on the commission letter. Customer service was excellent in fixing the problem.", "rating": 4}, {"title": "Other than one small snag", "text": "Other than one small snag, that was handled immediately, they did a great job!Extremely fast and efficient.", "rating": 4}, {"title": "SuretyBonds.com is reasonably priced…", "text": "SuretyBonds.com is reasonably priced and their renewal system is easy to use. I would have given a 5 star review however they called and emailed numerous times well in advance of renewal and that became very redundant.", "rating": 4}, {"title": "This site was good I was able to get…", "text": "This site was good I was able to get information I needed and then make my decision on using this product. Thanks", "rating": 4}, {"title": "People are busy", "text": "People are busy, way too many emails for the system that is to simplify the experience.", "rating": 4}, {"title": "This is my first time applying for a…", "text": "This is my first time applying for a bond so I didn't know the process.  I went to several different website and yours was the easiest to navigate.", "rating": 4}, {"title": "Wanted too much additional information…", "text": "Wanted too much additional information on the Oh bond on increase. Smooth process other than that.", "rating": 4}, {"title": "This site was fast and easy to use", "text": "This site was fast and easy to use. Thank you", "rating": 4}, {"title": "Good job", "text": "Great experience", "rating": 4}, {"title": "Thank you", "text": "Thank you, was wick and easy. Very nice Service", "rating": 4}, {"title": "The process to obtain a Surety Bond was…", "text": "The process to obtain a Surety Bond was easy after getting all of the correct information needed. Our only trouble was when the agent did not check to make sure the name on the form was the same on the drivers license.", "rating": 4}, {"title": "Only disappointment is the check out…", "text": "Only disappointment is the check out process online.  I am promised a renewal price of $125 in an email and then online it looks like I have to pay $250.  Aggravating!!", "rating": 4}, {"title": "Zero problems with customers service.", "text": "Date of experience: February 14, 2022", "rating": 4}, {"title": "pretty quick turn around time on your…", "text": "pretty quick turn around time on your part  Now if the state would just het a move on in processing this stuff   But tyypical givernmenrt BSHury up andwait.", "rating": 4}, {"title": "The only inconvenience part of the…", "text": "The only inconvenience part of the software was the \" from\" date. For examplewhen I put 02/09/2022 on the application they showed me 02/08/2022 as a result but because I wanted the start day be from 02/09/2022 so I put 02/10/2022 on the application to get the right date but at the end when I got the paper it was the exact date that I put on the application means 02/10/2022 and it was so weird other than this everything was good. Thank you", "rating": 4}, {"title": "Saved money!", "text": "Asked for a quote online. Received a call and an email the next business day. Once I got in touch with someone the process was very easy. The quote was fair and the paperwork clear. The only reason I didn't give 5 stars is that it took 3 calls to get in touch with one of the guys that called. Once we made contact everything was smooth sailing.", "rating": 4}, {"title": "It was fast and easy with no…", "text": "It was fast and easy with no complications", "rating": 4}, {"title": "Fast convenient way to purchase a bond", "text": "Fast convenient way to purchase a bond, quick delivery...information in delivered policy to be signed and notarized before turning in was a little confusing with instructions of needing a licensed insurance agency to notarized being isn't that what I purchased from? Not sure why that was in the instructions 🤔", "rating": 4}, {"title": "Great Job", "text": "Easy and fast. Nothing to be stressed about. Easy as 1.2.3", "rating": 4}, {"title": "The website was very informative and…", "text": "The website was very informative and easy to use.", "rating": 4}, {"title": "The surety bond was easy to obtain and…", "text": "The surety bond was easy to obtain and the customer service representatives were very helpful in understanding the process. The only flaw I found was I had to call 4 days later to see why I had not received the electronic digital surety bond, and the promptly emailed it again.", "rating": 4}, {"title": "Thanks for always reminding us of the…", "text": "Thanks for always reminding us of the due date and although we've never had to use your service for any type of fraud in our club, we appreciate your professionalism always.", "rating": 4}, {"title": "They made it easy for me to pay my bill…", "text": "They made it easy for me to pay my bill over the phone when I was overseas. Hustle free", "rating": 4}, {"title": "Easy", "text": "Easy to pay policy renewal.  Not sure what would happen. If we actually had to use this policy but payment process is easy", "rating": 4}, {"title": "Very covenant and professional.", "text": "Date of experience: January 03, 2022", "rating": 4}, {"title": "Good fast and efficient.", "text": "Good fast and efficient.Nothing more", "rating": 4}, {"title": "I emailed Matt the night before asking…", "text": "I emailed Matt the night before asking about a Bond to become a NYS Car Dealer.The next day he called, asked a few questions, in two days I had a 20,000.00 Bond and was working on my application.", "rating": 4}, {"title": "Customer Service was great.", "text": "Date of experience: December 10, 2021", "rating": 4}, {"title": "They do great service and fast about about getting your paper", "text": "They do great service and fast about getting your documents to you will recommend them. From Donnies cleaning and painting service.", "rating": 4}, {"title": "Person I spoke with was fast and…", "text": "Person I spoke with was fast and helpful, only not 5 start because I had to buy another bond but that was my own fault, just eating the transaction", "rating": 4}, {"title": "Relatively easy to renew", "text": "Relatively easy to renew.  Wish the website was easier to use and could grant us an ability to download our contract.", "rating": 4}, {"title": "I do not like being contacted in…", "text": "I do not like being contacted in October for a mid December renewal. The actual renewal is very easy and quick.", "rating": 4}, {"title": "the response very quick & prompt and…", "text": "the response very quick & prompt and was able to finish my work within a day", "rating": 4}, {"title": "Thanks", "text": "Thanks for the assistance", "rating": 4}, {"title": "Everything went smoothly", "text": "Everything went smoothly. Easy to print out bond and other papers. Transaction was done in an expedient manner. papers were sent in . Will wait to see if the end transaction is smooth.", "rating": 4}, {"title": "I spoke with 3 people at this company…", "text": "Tier II support was fantastic.", "rating": 4}, {"title": "Link to certificate does not work", "text": "It was impossible to renew my bond without calling even when the link was sent to my email. And after calling and renewing, I am unable to print the certificate. The link to the certificate does not work. However, I got to work with Jordan who sent me the files and also to some time to reach out to me.", "rating": 4}, {"title": "Clear and good customer service!", "text": "Date of experience: October 29, 2021", "rating": 4}, {"title": "After buying my notary bond through…", "text": "After buying my notary bond through your company I was told other companies include packages where they mail you your stamp and things included with your purchase of the bond. It would be nice if you offered packages as such.", "rating": 4}, {"title": "repeat customer", "text": "I chose Surety Bonds because I have used you in the past. Only issue is the renewal process seemed to be more complicated than need be. I received multiple calls and emails when all I needed was 1 email reminder to complete before exp date.", "rating": 4}, {"title": "We did not understand the process…", "text": "We did not understand the process before and explaining everything would have made things easier for us.", "rating": 4}, {"title": "Just wanted to try and keep anyone else…", "text": "Just wanted to try and keep anyone else from using this service. They have a disclaimer on there website that states you can not raise the amount of the bond once purchased. No where does it state that you can't lower it. I paid for a 3000 dollar bond on a car and paid 100 dollars. When I went to the DMV. They said I only needed one for $1950. So, I called them and they wouldn't do anything to help. No bond reduction and no refund. This is a scam!!! They take your money and do nothing in return. If any kind of mistakes are made anywhere. They claim no responsibility. They are thieves!!! Will spread this everywhere and anywhere that will listen. Just an update to show these reviews really do work!  So, about an hour after I posted the review. I received a phone call from a member of there staff. Who had read the review and decided that wasn't the way they wanted to do business. Ànyway, they lowered the bond for me and took care of my needs. So, I would like to resend my previous rating. And, say I would recommend them and would use them if the need were to arise again.", "rating": 4}, {"title": "Easy on line renewal process", "text": "Easy on line renewal process. Thank you.", "rating": 4}, {"title": "Easy process", "text": "Date of experience: October 18, 2021", "rating": 4}, {"title": "Takes a bit of stress away", "text": "This was the least stressful part of the whole mess", "rating": 4}, {"title": "Very professional and thorough.", "text": "Date of experience: September 23, 2021", "rating": 4}, {"title": "Process to purchase my bond was simple…", "text": "Process to purchase my bond was simple and easy. My only problem was that the site seemed to freeze up when it came down to me making my payment. It was probably due to the browser I was using, which is Chrome. I tried it on my phone using Safari and I was finally able to get in.", "rating": 4}, {"title": "I love how easy it is originally to…", "text": "I love how easy it is originally to start and to renew. I think an email before a call would be great as a reminder!? Other than that it's smooth.", "rating": 4}, {"title": "Professional and Helpful", "text": "The process of getting the bond was very smooth and the agent was very professional and helpful.", "rating": 4}, {"title": "2 times I tried to purchase a Perpetual…", "text": "2 times I tried to purchase a Perpetual bond and you sent me a Performance bond.  Both times I explained that the county of Fort Bend in Texas MUST have \"Perpetual\" written on top of the bond and not Performance.", "rating": 4}, {"title": "I think a follow up call would be nice…", "text": "I think a follow up call would be nice to understand everything about this surety bond.  I purchased the bond because told I had too but I really do not understand exactly what I purchased, I believe I have a general idea but I am not 100% sure and believe you should be 100% of what purchased.  A live person always helps and better customer service so I do believe there should ALWAYS be a follow up call", "rating": 4}, {"title": "simple and quick", "text": "Easy to use very good", "rating": 4}, {"title": "We stick with Surety because they get…", "text": "We stick with Surety because they get us what we need.  Each year I find I have to jump through quite a few hoops for the very same thing (certificate of insurance) I need each year and that can be a little frustrating.  Overall, you eventually get me what I need and I'm glad for that.", "rating": 4}, {"title": "Very good excellent", "text": "Date of experience: August 09, 2021", "rating": 4}, {"title": "Thank you for making the process of…", "text": "Thank you for making the process of purchasing a bond very easy.Xiomara Ibarra", "rating": 4}, {"title": "Quick response..", "text": "Quick response... I would use them again.", "rating": 4}, {"title": "I would def use them again", "text": "Date of experience: July 26, 2021", "rating": 4}, {"title": "Another great job", "text": "Date of experience: July 26, 2021", "rating": 4}, {"title": "The process was easy", "text": "The process was easy! However, the bond did not show up in our email or spam folder.  A simple phone call was all that was necessary though.", "rating": 4}, {"title": "Everything was good except i was…", "text": "Everything was good except i was needing a bond for a boat which is not on the website which made me have to call in. Need to add boats to the list on the lost title inventory.", "rating": 4}, {"title": "The only reason I gave a 4 instead of 5…", "text": "The only reason I gave a 4 instead of 5 is because when I read the instructions it said to make sure I bought a bond before I started the process so I did.  But then when I started the process on your website it had me buy another bond.  Other than that it was smooth and simple process.", "rating": 4}, {"title": "It was fast easy and affordable", "text": "It was fast easy and affordable. I gave them 4 stars because nobody's perfect.", "rating": 4}, {"title": "Why no 5 star", "text": "The only reason I didnt leave a 5 star review is the simple fact I absolutely cant stand when companies leave messages that my policy is up for renewal 4 months before it is, if you are going to give me some discount or other great reason to renew early all it does is irritate me almost to the point of useing another company.very irritating.other than that no complaints about your service thus far.", "rating": 4}, {"title": "I paid $20 for fedex overnight…", "text": "I paid $20 for fedex overnight delivery.  As of this writing they are more than 1  1/2 days late.  Tyler was hyelpful but fedex is not reliable", "rating": 4}, {"title": "Never spoke to anyone", "text": "Never spoke to anyone. Just renewed on line.", "rating": 4}, {"title": "yes it's all good", "text": "yes it's all good, it went fast. love it", "rating": 4}, {"title": "I appreciated the quick access I…", "text": "I appreciated the quick access I received in obtaining my bond! It made things the process easy.I had been hoping for a $5,000 bond rather than the $10,000, but having it taken care of within 48 hours made it worth it.Thank-you!", "rating": 4}, {"title": "Renewal", "text": "We just renewed our bond. Great experience. They send you frequent reminders and call often to make sure that you don't miss your deadline. Easy to do online.", "rating": 4}, {"title": "Customer Service was great", "text": "Customer Service was great.  I just wish the amount of the Bond wasn't so expensive.", "rating": 4}, {"title": "Bought an IFTA bond", "text": "Bought an IFTA bond. Quick & Easy.", "rating": 4}, {"title": "this is my first ..thank you for making…", "text": "this is my first ..thank you for making it easy", "rating": 4}, {"title": "It was very simple to fill out the…", "text": "It was very simple to fill out the information and get a call right away.", "rating": 4}, {"title": "Surety Bonds thank you", "text": "Surety Bonds thank you. I appreciate getting my information to you and you getting it done as quickly as possible appreciate all your help and look forward to doing business with you in the future thank you so much", "rating": 4}, {"title": "The renewal for the bond was very time…", "text": "The renewal for the bond was very time consuming and slow, mostly due to our side. We used a DBA and that seemed to monkey up the process. For the benefit of others, figuring out an easier way to transfer info would be beneficial to you customers", "rating": 4}, {"title": "Good", "text": "Good very professional and great with order handling", "rating": 4}, {"title": "Had problem purchasing online as the…", "text": "Had problem purchasing online as the PURCHAS NOW button wasn't working.  Staff responded immediately to my email and got it taken care of.", "rating": 4}, {"title": "Good service", "text": "Date of experience: April 26, 2021", "rating": 4}, {"title": "Everything went amazing", "text": "Everything went amazing, I just thought my quote was going to be in the ballpark of the mock estimate $120, instead my quote being $300 for the general contractor bond.", "rating": 4}, {"title": "Expedited Service!", "text": "It took several calls before I finally got in touch with an agent, but after that, the expedited service   was great! Thank you, Bob Wolf for your help!", "rating": 4}, {"title": "Great experience", "text": "Great experience! quick and easy to obtain a bond. Thank you!", "rating": 4}, {"title": "SATISFACTORY", "text": "Date of experience: April 05, 2021", "rating": 4}, {"title": "Happy overall with Surety", "text": "Happy overall with Surety.  Only complaint  is the persistent and very early reminder to renew.", "rating": 4}, {"title": "Business in a timely manner great job…", "text": "Business in a timely manner great job thank you very much.", "rating": 4}, {"title": "This company was very polite and…", "text": "This company was very polite and courteous during the time I was applying for my surety-bond. The gentleman that I spoke with took his time and explained in great detail to me what exactly I needed to do and what was going to happen once I finished.", "rating": 4}, {"title": "I was given great service", "text": "I was given great service. My purchase was explained well and the agent made sure I understood completely what I was getting before I purchased. I recommend them", "rating": 4}, {"title": "Good service right on point with…", "text": "Good service right on point with delivery", "rating": 4}, {"title": "great job on sending my bond out on time", "text": "Date of experience: March 26, 2021", "rating": 4}, {"title": "Timely and efficient processing of the…", "text": "Timely and efficient processing of the bond renewal for my business.", "rating": 4}, {"title": "Overall experience was great", "text": "Overall experience was great, I had no issues and the process was hassle free. I would it give it five stars however I had questions I needed answers to for clarity and was unable to get the help I needed. It wasn't a big deal, I highly recommend this website.", "rating": 4}, {"title": "Quick and responsive", "text": "Quick and responsive. Loved working with them.", "rating": 4}, {"title": "Used for three years and counting", "text": "I have used SuretyBonds.com for about three years now. I found them to be very helpful especially in the beginning as I was new to bonds, but they patiently explained and answered all my questions. They worked hard to get me fair rates from the bond providers and their online tools make staying in compliance with States much easier.  One thing I would like to see are bonds that can be electronically signed and notarized from those States that allow these measures.  It would save on FedEx costs and allow SuretyBonds.com to send the bonds directly to the States and eliminating days of waiting.", "rating": 4}, {"title": "Paid the money and never received the…", "text": "Had an issue not receiving my bond but the team worked diligently to get the problem resolved. Come to find out it was a shipping issue. I would definitely recommend using this service. Thanks guys", "rating": 4}, {"title": "Overall a good experience.", "text": "As a new business owner they did a great job explaining to me what I needed and why.  There was a bit of a lack of communication when they were not getting what they needed from my end it wasn't communicated and I was sent a bond termination letter.  It was quickly resolved once I was aware of what they were missing.", "rating": 4}, {"title": "It is very easy to do and quick…", "text": "It is very easy to do and quick response.", "rating": 4}, {"title": "Easy to use to get my security bond for…", "text": "Easy to use to get my security bond for my state. No hassle and fast and easy and secure.", "rating": 4}, {"title": "They actually called me", "text": "They actually called to remind me that my bond was expiring I had renewed with another company but did need a special form for the state license I was renewing. I called the company who issued my existing bond, and they could not even find me in their system!  I called back and they Surety Bond had my bond on my desk waiting my signature in 2 days. Seamless and effortless. I highly recommend them.", "rating": 4}, {"title": "Blake was really nice", "text": "Date of experience: January 08, 2021", "rating": 4}, {"title": "Good service but left bad taste", "text": "Overall I am pleased with the service BUT thought it was pretty busy league to force you to use FedEx for delivery And the cheapest is 20 when they will get a volume discount from FedEx and really are only be charged probably 12IF YOU NEED THE EXTRA REVENUE JUST RAISE PRICE OF BONDdon't nickle and dimeAnd allow regular mail for your delivery", "rating": 4}, {"title": "Cool", "text": "Cool, nothing much here", "rating": 4}, {"title": "Quick service", "text": "Quick service to", "rating": 4}, {"title": "Surety Bonds delivered fast bond", "text": "Surety Bonds delivered fast bond. Competitive rate of minimum $100 for $2500 bond. Wish it was less as I bought a $300 non running scooter that the owner lost the title.", "rating": 4}, {"title": "Pain Free bonds", "text": "Everything from acquiring the quote, to purchasing a Bond was fast easy, and effortless.  I made a mistake and input the wrong address on the bond, within minutes their customer service team helped me fix the mistake and had my bond out to me the next day.  I only rate them for stars because you cant do portions of a star or id give them 4 and 3/4 stars, only because my bond premium was a bit steep.  I understand it's because of my credit but still, help a guy out haha. I would recommend them to anyone and use them again.", "rating": 4}, {"title": "good experience", "text": "Date of experience: September 16, 2020", "rating": 4}, {"title": "Customer service follow up was perfect", "text": "Customer service follow up was perfect, Hsd to call twice with questions and a return call within 20 mins. Not bad in this day and age. Only reason giving a four is because their forms should have a highlighted area where to sign.", "rating": 4}, {"title": "Awesome experience!", "text": "Awesome experience!! I just wish the notary bonds were cheaper.", "rating": 4}, {"title": "The experience I had with…", "text": "The experience I had with suretybonds.com was excellent from begining to printing out my bond at home couldn't have been easier. They were quick affordable and most importantly accepted by my DMV I now have a title and registration for this abandoned vehicle and am beginning to restore it. Thank you suretybonds as I couldn't have done it without you.", "rating": 4}, {"title": "Quick easy and hassle free put info…", "text": "Quick easy and hassle free put info gives you price pay just that easy.!!", "rating": 4}, {"title": "Fast and affordable service", "text": "I'm very impressed with how quickly service is provided every time we make an attempt to contact them they are always available so very good response time. The company rates for bonds are very affordable.", "rating": 4}, {"title": "Easy process", "text": "Easy process , my only complaint is having to pay for shipping when you email the documents , I could of saved my money on shipping had I known I could just print the documents", "rating": 4}, {"title": "SuretyBonds is an easy company to work…", "text": "SuretyBonds is an easy company to work with.  All customer services representatives are very friendly and helpful.", "rating": 4}, {"title": "Easy simple way to get insurance bonD", "text": "Date of experience: July 23, 2020", "rating": 4}, {"title": "I Can Recommend, Quick and Easy", "text": "I can recommend. I was struggling to find somewhere to secure a surety bond locally, so I looked into options online. SuretyBonds.com is legit, they got me set up quickly and easily. Scanned some documents, sent some info; they had my bond mailed to me in a few days, easy.I would give five stars, but I had to send a follow up email after a couple days with no response. That got the ball rolling and it was smooth sailing from there.", "rating": 4}, {"title": "The bond’s signature is blacked", "text": "Date of experience: July 15, 2020", "rating": 4}, {"title": "This was as easy as it gets", "text": "This was as easy as it gets, professional help and no hassle", "rating": 4}, {"title": "Quick & Easy", "text": "Knowledgable, The Rep knew what Bond I needed based on my business and location", "rating": 4}, {"title": "The whole experience for me happened so…", "text": "The whole experience for me happened so fast that it made my head spin.  The young man was knowledgable and efficient. I just told him what I needed, and Boom, just like magic, I had it.", "rating": 4}, {"title": "Everything was smooth and effective", "text": "Everything was smooth and effective I appreciate this site and how it helped me in my notary career.", "rating": 4}, {"title": "Satisfied Customer", "text": "Surety Bonds was really good they got me a fast quote and then still kept looking and got me a lower quote. They were very promt on getting documentation to me and getting processed.", "rating": 4}, {"title": "Easy and quick way to obtain my surety…", "text": "Easy and quick way to obtain my surety bond for notary public application.", "rating": 4}, {"title": "SuretyBonds.com was very fast and…", "text": "SuretyBonds.com was very fast and efficient. My bond came as promised and covered what my business needed.", "rating": 4}, {"title": "Easy and efficient", "text": "Easy and efficient. A real life saver.", "rating": 4}, {"title": "That was easy!", "text": "Easy process, very responsive and lower than other quotes I received.", "rating": 4}, {"title": "Service was prompt and thorough", "text": "Service was prompt and thorough. Everything went quickly and happened as promised. Only thing I wish would have been different was to make sure the customer knew what they were getting. I knew what it was called but not necessarily what it meant.", "rating": 4}, {"title": "quick easy", "text": "quick easy everything you need within 24 hours", "rating": 4}, {"title": "Quick and easy", "text": "The whole process was quick. I just wish they gave you better instructions when you’re filling out your information.", "rating": 4}, {"title": "Great service in a timely manner.", "text": "Date of experience: October 17, 2019", "rating": 4}, {"title": "Customer service team provided useful…", "text": "Customer service team provided useful answers to all questions, and made the process very simple.  We were approved with a great rate!", "rating": 4}, {"title": "Easy to use.", "text": "The site was easy to understand and use. It was a quick and easy process. I would recommend the use of this bond company.", "rating": 4}, {"title": "The purchase of my bond was very easy", "text": "The purchase of my bond was very easy. It was fast service and now I feel very well covered. Thank you.", "rating": 4}, {"title": "Great Experience with Surety", "text": "I had the easiest experience with SuretyBond.   Everyone was so courteous and professional.  The customer service was awesome.", "rating": 4}, {"title": "Excellent Service", "text": "Mr. Hannah was really kind and helpful with getting the bond set up and I really appreciate him.  Would've rated 5 stars, but the price of the bond was more expensive than we were expecting.", "rating": 4}, {"title": "quick and simple", "text": "quick and simple. didn't take long to get bonded", "rating": 4}, {"title": "The people who helped me over the phone…", "text": "The people who helped me over the phone was very friendly and professional, he knows what to do.", "rating": 4}, {"title": "Tax preparer surety bond", "text": "The information for my tax preparer bond was efficiently prepared by SuretyBonds.com.  Mark Karr was asked on three separate occasions to insure my business phone number was shown on the bond.  He assured me that he would take care of it.  However, when the bond was issued the incorrect phone number was shown.  The customer care team made the correction and reissued the bond.", "rating": 4}, {"title": "quick", "text": "quick, easy and fast...just like a notary service should be.", "rating": 4}, {"title": "My broker agent with Suretybonds.com…", "text": "It was a pleasure working with these guys. They filed my surety bond faster than I expected, answered all of my questions, followed up with me a few times by phone and email to make sure I understood everything, were very professional and on top of their game. Happy customer!!", "rating": 4}, {"title": "I started to fill out an online…", "text": "I started to fill out an online application, but it was a tad confusing because I don't understand surety bonds very well or the processes you need to go through to get one, and I didn't really understand what the application was I was filling out only. I called, and it was a much easier/more comfortable process over the phone. The whole process, from first call to having the approved bond in hand took just a few hours. I wasn't on the phone long at all. I got called back when I replied with a question via email, and then I just waited and received what I needed rather quickly. I would rate the person who helped me at five stars and the whole experience at 4. I would choose to use them again hands down. It was a solidly good experience. Suggestions for an even better one follow:1. More information up front about what you are filling out online-- why, how, and what to expect when applying for a surety bond for a bonded car title online.2. Connect your automated email system with your recent purchases, as I got a marketing email from you to finish my online application after I'd already completed everything with the gentleman on the phone.3. Ask if you can send marketing emails. Have a check box I can choose no. Unrequested marketing emails are a huge turn off.4. Have employees be more conservative on the turn around time of applications. It was super fast, which I was super happy about, but the customer service rep (who was overall fabulous) said it would be done faster than it actually was done, and I was in a time crunch that particular day. It was still super fast, and I would have been totally impressed even if he'd said longer than he did.Overall great experience. I will use you again, and I hope you take my suggestions into account, so I can feel like I can recommend you to others without, \"but be aware of this and this and this\" caveats. Thx!!Stephen", "rating": 4}, {"title": "It was a slow start but they came…", "text": "It was a slow start but they came through in the end!Thank you!", "rating": 4}, {"title": "Great Customer Service", "text": "Thank you all for understanding and helping me with getting my Title Bond. The agent was very nice and had great customer service. I received my title bond in a timely matter and I thank you all.", "rating": 4}, {"title": "Expensive but prompt.", "text": "Date of experience: July 03, 2019", "rating": 4}, {"title": "Convenience inconvenience", "text": "Well, I appreciate the service I got... the help when I checked status. The customer service is absolutely amazing! However, when I received my process server bond I was notified that the stamp from Surety Bond Notary Public was stamped sloppily. This caused an issue with my county clerks office. I had to have it re done, or pay an additional fee to make it legible. This costed me more than it should have if the stamp was neatly placed and not over the word a of the document. Everything else was very neat. That however, will not keep me from coming back and also recommending this company if ever asked! Very quick & seamless! Just wanted to share my experience.", "rating": 4}, {"title": "Super simple", "text": "Date of experience: June 25, 2019", "rating": 4}, {"title": "Had a great experience dealing with…", "text": "Had a great experience dealing with this company... No hiccups or beating around the bush .. Up front and catered to my needs", "rating": 4}, {"title": "Simple & quick!", "text": "from start to finish the process was super quick. The man that helped me was very nice and made sure i got what i needed.", "rating": 4}, {"title": "Customer service was helpful and…", "text": "Customer service was helpful and friendly. I wasn’t expecting a 6 month premium to be paid after the bond was set. In my initial call this was not mentioned. When following through with the process this was mentioned and was a surprise to me. Service was good overall, but did not expect this format.", "rating": 4}, {"title": "First company to actually call me back…", "text": "First company to actually call me back within 1 hour,friendly, courteous and professional, although the price was a little high in my opinion, but service was good never the less.", "rating": 4}, {"title": "The site was easy to use", "text": "The site was easy to use, but the directions afterwards are unclear. I don't understand what I am supposed to do with the bond now. I might sound a little naive, but this is the first time I've dealt with something like this. Overall, good experience with the site.", "rating": 4}, {"title": "SuretyBonds.com", "text": "I found SuretyBonds.com to be quick and easy to use. The one small quirk I had was that the agent thought I said $15,000 monthly payroll when I said $50,000.  We tried to change it on-line but I guess the bond had already been sent.  The bond was for the correct amount. So like I said, very quick and easy.Thanks.", "rating": 4}, {"title": "Swift and proffesional service", "text": "Swift, and professional service.", "rating": 4}, {"title": "the web site kept freezing and not…", "text": "the web site kept freezing and not allowing me to continue.  I called and gave all info to manager who answered phone, he said it's no problem and asked all necessary questions to write bond and billed c/c.  bond came very fast fed-ex.  only one problem, my name was not on the bond and business name was written where my name goes so dot wouldn't take it.  I called surety bonds and explained, they said no problem and transferred me to an agent who said mail bond back, once received they would issue new one and I have to pay for fed-ex shipping once again.  after 1/2 hour of problems on phone I hung up and called manager who took my original info.  he said it was his mistake and they will take care of it. transferred me to agent again who said the same thing, mail it back and pay new shipping.  we went round and round for some time.  I said talk to manager whom I spoke to and he would confirm the mistake was no fault of my own and I shouldn't have to pay again.  Finally the right hand spoke to the left hand and got to the bottom of the problem and issued a new bond in 24 hours.  a whole lot of headaches for a simple fix.", "rating": 4}, {"title": "Right off the bat they inspired me with…", "text": "Right off the bat they inspired me with trust and gave the peace of mind I need to do my job.", "rating": 4}, {"title": "Friendly staff and fast service.", "text": "Date of experience: April 22, 2019", "rating": 4}, {"title": "We are new to Surety", "text": "We are new to Surety. It was easy to sign up.  We will see service.  :)", "rating": 4}, {"title": "The site was fairly easy", "text": "The site was fairly easy.  I think just a little clarification on exactly what they want as far as the sample signature.  Whether they could use the signature on the Bond App, itself, of if it needs to be a separate page with just the signature on it.", "rating": 4}, {"title": "Very professional at what they do", "text": "Date of experience: April 02, 2019", "rating": 4}, {"title": "Very simple and easy to get this task…", "text": "Very simple and easy to get this task done", "rating": 4}, {"title": "Fast service and friendly service.", "text": "Date of experience: March 06, 2019", "rating": 4}, {"title": "Easy and affortable", "text": "Date of experience: February 28, 2019", "rating": 4}, {"title": "Quote and service", "text": "Quote spoke for itself. Service was also excent! Johnathan worked with me via email as I was traveling and there was no delay in response time.", "rating": 4}, {"title": "Courteous service and very prompt", "text": "Date of experience: January 30, 2019", "rating": 4}, {"title": "Very fast service!", "text": "Date of experience: January 30, 2019", "rating": 4}, {"title": "I like the option of a 4yr term", "text": "I like the option of a 4yr term. I am new to this company , but it is less that what I was paying with my old company", "rating": 4}, {"title": "The Original price of the bond went up…", "text": "The Original price of the bond went up quite a bit when we had to get re-quoted. Which was a downer. Otherwise everything else was fine. The sales rep was helpful and responsive and they filed electronically very timely.", "rating": 4}, {"title": "Very impressed with service", "text": "I am very impressed with the help I received and the quick response and output of me request.", "rating": 4}, {"title": "first time used", "text": "first time used, I took a day to get my bond, but overall great", "rating": 4}, {"title": "Fast", "text": "Fast, accurate, good to deal with.  If you need the service then this is a company to contact.", "rating": 4}, {"title": "JohnCNorkus", "text": "The whole experience was great and very professionsl", "rating": 4}, {"title": "Relatively simple process", "text": "Relatively simple process. Good communication with the agent. Overall, I was very pleased with the issuance of the Surety Bond as well as the delivery of it.", "rating": 4}, {"title": "I was able to get what I needed quickly and easily", "text": "My rating is based on several factors: They had a product I needed at a fair price (other sites had the same product for more). The site was user friendly and easy to navigate in order to acquire my desired product. In short I was able to get what I needed quickly and easily without complicated links, forms or ads.", "rating": 4}, {"title": "Was quick and easy", "text": "Was quick and easy, very few boxes to fill out, making the process very smooth and understandable. Only thing I wasn't clear on in the process was if I needed to have the Bond notarized after I bought it - until I finished the purchase and saw the section, I wasn't sure if I would have to make a trip to another Notary to finish the process.", "rating": 4}, {"title": "Very good", "text": "Very good. I received my bond fast and ho hassle.", "rating": 4}, {"title": "Quick & easy.", "text": "Date of experience: September 20, 2018", "rating": 4}, {"title": "Quick and easy process", "text": "Quick and easy process.  Only issue was when I took the paperwork to the county to become a notary - county wanted my commissioned name and not the application name on the bond.  So back home to correct it print it, and another trip into town.  Fast service though, and easy to work with.  Just would have been better if the correct name was on the bond to begin with.", "rating": 4}, {"title": "The Bronx Surrogate court required that…", "text": "The Bronx Surrogate court required that I obtain an Administrator ‘s Bond in connection with my late husband’s estate. I went on line and found Surety Bond website, called the number and was immediately connected with one of the company’s representative, Mr Brian Russell. Mr Russell was EXCELLENT! He patiently explained the process to me and handled my Bonding needs in a professional manner. The entire process took less then 20mins !!! Thanks to Brian Russell and the Surety Bond team. I truly appreciate the great service you provided.", "rating": 4}, {"title": "Worked well and quickly", "text": "This was handled quickly and relatively easily.", "rating": 4}, {"title": "What an easy process", "text": "What an easy process.  I selected what I was looking for and within minutes I had verification to complete my notary application.  Thank you.", "rating": 4}, {"title": "Surety Bonds,", "text": "Surety Bonds,Surety Bonds were very easy to work with. They made the experience very smooth.If we ever need a bond in the future, we will be sure & use SuretyBonds.", "rating": 4}, {"title": "Quick, Easy, and some of the best CSRs in the industry!", "text": "Application was quick and easy. Once my information was submitted, I knew within a week that I had been approved. Customer service was more than happy to answer my questions about the paperwork I received (I actually read the directions - baffling, I know - and there is a rather confusing bit in the SoS directions for sending in the notary public application). The representative I spoke with was polite, funny, patient, and - once I had explained my question (I had to give context so that he could understand the issue) - he was one of the most understanding and helpful customer service representatives that I have ever had the pleasure of dealing with. [Being in the CS industry myself, I’ve dealt with quite a few of them!]", "rating": 4}, {"title": "I made a mistake on my request even…", "text": "I made a mistake on my request even though I thought I was careful and read the directions a couple of times I contacted you and appreciated the help and consideration I received I would use Surety Bond again I shared my helpful experience with my Secretary of State office and they too were impressed Thank you Doug Johnson", "rating": 4}, {"title": "This company was actually great and…", "text": "This company was actually great and very fast at getting bond done, however the bond needs to have the exact name on it as the driver's license. Just had to have a rider done to fix it. I would still recommend this company to anyone that needs a bond. Extremely nice people. Thank you Bob Wolf for your help and kindness.", "rating": 4}, {"title": "Clearer pdf of Bond", "text": "It would be nice to have a more clear pdf of the bond instead of 7 pages, just so I can send to clients to prove I have the bond. Other than that the process was easy!", "rating": 4}, {"title": "There were a few issues at first", "text": "There were a few issues at first, but Mark was able to quickly help fix them and I had my bond within a week!", "rating": 4}, {"title": "I acquired a bond from SuretyBonds…", "text": "I acquired a bond from SuretyBonds roughly one week ago.  My original review says it was posted three days ago, which would mean on 20July18, under the name 'BRAD.'  Today, 23July18, I received a call from Suretybonds.  They wanted to discuss my review of their service.  No other company has ever called me to discuss my posted review, good or bad.  The caller (also named Brad by coincidence) informed that SuretyBonds adds no fees to the bonds, or at least, not to the type of bond I was ordered to acquire. If this is true, then it was wrong of me to make a statement to the contrary (I have only their word for this).Brad also informed me that I had been charged only .5% of the amount being bonded.  To that I say, charging m anything for a bond I neither want nor need is going to leave a bad taste in my mouth, regardless of the cost because it still represents an unnecessary expenditure of money out of my pocket.Brad also stated that I could not get the bond form the insurance companies except through a broker (or at least he gave me the impression that I could not if I used any company they represent), which was not completely true based on my understanding of his statement.  I called two other companies, but they took too many days to get back to me. One wanted more than SuretyBonds.  The other finally told me I had to use one of their agents who was in the same state in which I needed the bond, meaning I had to start over and wait again to receive a quote.  This was the same issue I had with the company that gave me the higher price; it took two days to receive a quote, so I was in a bind.  I will give credit to SuretyBonds for being able to issue the bond the same day and on the first phone call.Brad asked me to call if SuretyBonds could do anything for me.  The only thing they could do is issue a refund.  However, if they made no money from charging me fees, there would be nothing to refund as I doubt the insurance company is going to refund my money without cancelling the unnecessary bond I was court-ordered to acquire.Based on their concern about their company's reputation and the fact that they took the time to call me about my review, I felt it only fair to raise their rating and let others know that they do actually pay attention to their customer reviews.", "rating": 4}, {"title": "Quick and easy.", "text": "Date of experience: July 05, 2018", "rating": 4}, {"title": "just went on line to obtain the bond", "text": "when will I receive confirmation on my bond", "rating": 4}, {"title": "Rather painless but affordable", "text": "Rather painless. But I received my clear title shortly after I started the process.At a reasonable price!", "rating": 4}, {"title": "Great experience with your company", "text": "Great experience with your company, prompt and complete.", "rating": 4}, {"title": "Fast easy process", "text": "Fast easy process, would recommend this site to anyone looking to purchase a surety bond.", "rating": 4}, {"title": "fdoh", "text": ";'aigagav ava aija v", "rating": 4}, {"title": "This insurance offers a good coverage…", "text": "This insurance offers a good coverage but it is a little more expensive than the average in The Las Vegas, NV area.", "rating": 4}, {"title": "great service except the bond didn't…", "text": "great service except the bond didn't come in overnight and I was late on sending my bond in to the state and the rep knew that", "rating": 4}, {"title": "Service was good", "text": "Service was good.  I didn't receive the first email with the bond attachment and had to call a day later, but then received it right away.", "rating": 4}, {"title": "Surety Bonds did a great job of issuing…", "text": "Surety Bonds did a great job of issuing my bond.  The only thing that I didn't care about was the shipping. Part was because of the holiday weekend but FedEx had it a the local distribution center for days and just marked the tracking as \"not scheduled for delivery\" rather than deliver it.", "rating": 4}, {"title": "Alex was very helpful and patient with…", "text": "Alex was very helpful and patient with us. Great Customer Service!We unfortunately had a bad experience with someone else when Alex was absent that almost made us not use SuretyBonds.com. We got to the point of asking for a refund, but ended up working everything out when Alex returned.", "rating": 4}, {"title": "Quick to respond", "text": "Date of experience: May 24, 2018", "rating": 4}, {"title": "first time getting a surety bond", "text": "first time getting a surety bond. It was easy and painless. All questions were answered and I received the bond in a timely manner.", "rating": 4}, {"title": "simple process, polite folks", "text": "Have had a little trouble in the past reaching them by phone, but not recently.  It's been a very smooth, easy experience to get the necessary bond.", "rating": 4}, {"title": "Very easy and quick process!", "text": "Date of experience: May 14, 2018", "rating": 4}, {"title": "First time with Surety Bond", "text": "First time with Surety Bond. I was amazed how fast I received my bond especially since I live in Hawaii. I was quite impressed.", "rating": 4}, {"title": "Great customer service", "text": "Great customer service, quick and precise. Thanks for your help with getting my company bonded!", "rating": 4}, {"title": "Simple & fast.", "text": "Date of experience: April 23, 2018", "rating": 4}, {"title": "Fast and Reliable", "text": "Date of experience: March 22, 2018", "rating": 4}, {"title": "It was a very easy process to complete", "text": "It was a very easy process to complete. The representatives were knowledgeable and respectful. Very good experience.", "rating": 4}, {"title": "Great Service", "text": "Service was great and I had no problems with the process, except I had to call for a follow up.  I do recommend the company.", "rating": 4}, {"title": "Highly recommended 😊", "text": "I would choose no other company", "rating": 4}, {"title": "I thought I did everything right...", "text": "I thought I did everything right when I purchased bonds for 2 states. The first was correct but the second was not. I called the number listed and was helped right away. 5 stars for customer service and 3 for the website and results.", "rating": 4}, {"title": "Quick service.", "text": "Date of experience: March 06, 2018", "rating": 4}, {"title": "Easy", "text": "Surety bonds process was quick and painless", "rating": 4}, {"title": "The process was easy and straight…", "text": "The process was easy and straight forward. The only thing I didn't like was there was no option to have the bond mailed via USPS, I ended up paying $10 for 3 day FedEx when I didn't need it that soon.", "rating": 4}, {"title": "Excellent and quick!", "text": "My only complaint, is the lack of Bond choices. I had to choose for my tax payer bond between a 3 and 5 year. I would have preferred a one year choice or even two year.  Other than that, the website looks great and the process was very quick and easy!", "rating": 4}, {"title": "Very easy process", "text": "Very easy process. Took a few hours longer than promised but was due to ensuring documents were correct.", "rating": 4}, {"title": "Thanks Brad Bullerdieck", "text": "It’s nice to work with an actual human being who listens and works with their customers— Not only did Brad listen & understand the specifics regarding my bond, he resolved my issues promptly & effectively resulting in a very happy customer.", "rating": 4}, {"title": "Simple process", "text": "Date of experience: January 18, 2018", "rating": 4}, {"title": "I was very satisfied with the process …", "text": "I was very satisfied with the process of obtaining a surety bond.  the only issue i had was when entering payment and clicking the button to pay now, it kept going to a page that said internal server error...so i assumed payment did not go through and I made two more attempts.  the following day, i noticed it charged my account three times.  the issue was resolved, however, your website still directs you to a page that says internal server error.  Thankfully, my bank knows me very well and i was not charged any overdraft fees and the charges were left in pending status until the issue was resolved.  The error page was not on my end as i was able to process my payment for other purchases on other sites for different services without that issue.  Thought you might want to know so that can be fixed and avoid others from leaving your site and going elsewhere to make a purchase for surety bonds.", "rating": 4}, {"title": "It was pretty easy", "text": "It was pretty easy, I made an error and called and in that very moment they resolved the issue.. Great customer services", "rating": 4}, {"title": "Great info on website  and easy check …", "text": "Great info on website  and easy check out!", "rating": 4}, {"title": "+ A good experience", "text": "+ A good experience. + Very expidient process. - No availability to check status.", "rating": 4}, {"title": "easy to use web site but still have not …", "text": "easy to use web site but still have not received my documents", "rating": 4}, {"title": "The process was very easy and fast", "text": "The process was very easy and fast. When I not received the email with the information I asked and you responded very fast and esactly how I needed. Thank you so much.", "rating": 4}, {"title": "I was absolutely satisfied with this …", "text": "I was absolutely satisfied with this service . It was professional , prompt , and practical . The agent was pretty knowledgeable  answering all the questions that I needed answer. I would refer a friend or family member without  any hesitation.Best Regards,Daninett Devenport", "rating": 4}, {"title": "They were very helpful", "text": "They were very helpful.  I am so glad they were able to help me not get one bond but 2 different types of bond.  Forever grateful!", "rating": 4}, {"title": "Wrong name was listed on bond", "text": "Date of experience: November 30, 2017", "rating": 4}, {"title": "You made the process very simple and …", "text": "You made the process very simple and quick. Thank you", "rating": 4}, {"title": "Customer service", "text": "Levi was great at helping us. He was patient and very helpful.", "rating": 4}, {"title": "Convenient and easy process", "text": "Convenient and easy process, thanks", "rating": 4}, {"title": "Title Bond", "text": "Professional. Easy to work with.", "rating": 4}, {"title": "They were very easy to work with and …", "text": "They were very easy to work with and were quick in getting this done.However, the company didn't do certain other things that are required for Georgia to get complete title and tag, so we weren't able to get our tag until more stuff was done. That was a disappointment as I spent money on the title and insurance to get the tag. It would have been nice if we were made aware of the entire process so we would know what to expect and plan accordingly.", "rating": 4}, {"title": "The process was quick and painless", "text": "The process was quick and painless.  The rate was higher than I had hoped, but very much within my expectations.", "rating": 4}, {"title": "Needed A Bond Quickly", "text": "I had contacted my insurance agent to get a bond after seeing Surety Bond's web page.  She didn't know much about it or what kind I needed and the amount she quoted was $250.00.  I went back to suretybonds.com and purchased the bond I  needed for $100.00.  It was quick and within 3 days I had the bond in my hand.  I appreciate Surety Bond being online and so easy to deal with.  I am usually on the road and don't have time to deal with business issues that go on for days to complete.And I recommend them highly.", "rating": 4}, {"title": "Very easy process and representative …", "text": "Very easy process and representative was pleasant and helpful", "rating": 4}, {"title": "The process was painless and very fast", "text": "The process was painless and very fast.  The bond was delivered to me quickly by email and appears very professional.", "rating": 4}, {"title": "I needed a notary bond", "text": "I needed a notary bond.  The process was easy to understand and I received my documents quickly.  I would use Surety Bonds again in the future.", "rating": 4}, {"title": "Shipping charges too high", "text": "Shipping charges too high. Offer USPS first class mail as an option.", "rating": 4}, {"title": "Very clear and simple site to navigate", "text": "Very clear and simple site to navigate. Prices are average and I felt secure processing my purchase.", "rating": 4}, {"title": "I was able to get my surety bond via …", "text": "I was able to get my surety bond via email the same day I ordered it, but it was a little slower than I had anticipated.  I called in to see when it would be sent, and Customer Service was great in looking it up (which was quick) and very friendly.Same day service was great, and probably hard to find elsewhere.", "rating": 4}, {"title": "Was really easy to get a bond for our …pretty easy... go for it", "text": "Was really easy to get a bond for our dealership. Not really sure why they need to Fed Ex and charge back $10- $20 for mailing papers Would us again though", "rating": 4}, {"title": "I was able to purchase my bond online …", "text": "I was able to purchase my bond online easily, and the purchase flow as fast. Your sales pages could be a little bit more clear about what is offered in each tier. The email with my bond took a bit of time to arrive.", "rating": 4}, {"title": "Very painless process", "text": "Very painless process, which was wonderful in the interest of time. The cost though, was 1/3 to 2/3 higher than other companies.", "rating": 4}, {"title": "SuretyBonds", "text": "It was an easy process essentially and the bond was a fair price but you are overcharged for the shipping so it balances out.", "rating": 4}, {"title": "I checked with three other bond …", "text": "I checked with three other bond companies and SuretyBonds.com was the most responsive, pleasant, and offering the best value.", "rating": 4}, {"title": "Satisfied with services", "text": "Satisfied with their quick responses", "rating": 4}, {"title": "It was very easy and quick to get mt …", "text": "It was very easy and quick to get mt bond.", "rating": 4}, {"title": "Fast", "text": "Fast, simple, easy, reasonably priced.", "rating": 4}, {"title": "I thought the application for the bond …", "text": "I thought the application for the bond was very customer friendly and easy to use and the response time to confirm the bond was very expedient.", "rating": 4}, {"title": "Bob helped walk me through the process …", "text": "Bob helped walk me through the process this is my first time becoming a notary so it was a learning experience for me. My friend referred me to him.", "rating": 4}, {"title": "The  name speaks for itself", "text": "The  name speaks for itself. I  received  such  impeccable service from  one of the account manager by the name of  Johnathan Pearson. He provided  prompt and  efficient service. I would definitely recommend Surety Bond.com", "rating": 4}, {"title": "Quick turnaround with next day shipping.", "text": "Date of experience: June 14, 2017", "rating": 4}, {"title": "Great service", "text": "Great service. Quick and easy. Could improve by making it possible to return to edit information on the final bond confirmation page when making the purchase. As it currently stands if you approve you cannot return to the page and edit before paying.", "rating": 4}, {"title": "The Sales Rep that helped knew what I …", "text": "The Sales Rep that helped knew what I was asking for right away and was able to provide with all the help I needed even after purchasing. Great Customer Service and one on one I Totally recommend this services .", "rating": 4}, {"title": "it was very easy.", "text": "Date of experience: May 25, 2017", "rating": 4}, {"title": "good", "text": "good. waited a little longer than expected had to call to confirm my order but email they initially sent wAS never recvd in my inbox. However when i called it took less than 2 minutes for confirmation and an email. extremely polite and quick customer service rep who took my call. he was great", "rating": 4}, {"title": "My bond was ordered by National Notary …", "text": "My bond was ordered by National Notary of America and it took 3 weeks! However, I think the hold up was mostly the fault of NNA.  When I received my bond, my middle initial was not included, I called Surety Bonds and that was corrected and my new bond was available in just minutes!!", "rating": 4}, {"title": "Quick Process", "text": "I like that I can renew the bond without any hassles.  The process is quick and effective.", "rating": 4}, {"title": "conduct surety bond", "text": "We needed to obtain a conduct surety bond for a BG permit in Texas.  The process was so easy and it was one-third the cost I found anywhere else!  We had it fed-exed to us and received it the next day.", "rating": 4}, {"title": "Very Professional and expediated the …", "text": "Very Professional and expediated the paperwork.", "rating": 4}, {"title": "Estate Bond - Grays Harbor County Superior Court", "text": "The electronic copy of the bond I received revealed typographical errors so I emailed the representative who had initiated it for me.  The bond had already been sent via FedEx so the representative immediately had a correcting rider prepared and had it overnighted to me so I had it the following day.The bond documents were presented to the Court and found to be adequate and acceptable allowing my filing to be completed.", "rating": 4}, {"title": "I have had multiple purchases thru …", "text": "I have had multiple purchases thru Surety Bonds - my only request would be that paperwork could be a bit more streamline - perhaps using recent data (3 - 6 months old) - rather than completely new forms - but then for all I know that could be some government deal that needs to be handled - let's change the government regs!!", "rating": 4}, {"title": "Our dealings with SuretyBonds.com has …", "text": "Our dealings with SuretyBonds.com has been very satisfactory.  We have 3 separate bonds and have had to amend and adjust 2 of them.  The work was done with little issue.", "rating": 4}, {"title": "Excellent service", "text": "Fast , easy and professional, seamless experience, thank you for your service.", "rating": 4}, {"title": "Jonathan was very repsonsive I had my …", "text": "Jonathan was very repsonsive I had my quote and bond in a very timely manner.I'm pleased!", "rating": 4}, {"title": "Awesome service", "text": "Date of experience: April 03, 2017", "rating": 4}, {"title": "Service Success", "text": "Very Simple process! Quick, easy and fulfilled my business needs!", "rating": 4}, {"title": "Pretty simple", "text": "The online application was pretty simple but I thought the rate may be a little high or not offering enough options.", "rating": 4}, {"title": "Fast service", "text": "Was surprised to find it in the mail the following day", "rating": 4}, {"title": "Easy and fast!", "text": "Thanks for the quick response and service!", "rating": 4}, {"title": "Very affordable", "text": "Staff was knowledgeable and understood what my company was looking for.", "rating": 4}, {"title": "Bob did my title bond in 2 hours", "text": "I didn't think I be able to get a bond but bob didn't waste my time or money every one else was 250 bob was 100 thanks for everything got my car title", "rating": 4}, {"title": "Awesome", "text": "Thank you very much", "rating": 4}, {"title": "Fast and Easy", "text": "Great experience!  Highly recommend.", "rating": 4}, {"title": "Very Responsive", "text": "I emailed a request for bond and was immediately contacted by Blake Oliver who was knowledgeable, inquiring and provided all I needed to be compliment with my state laws", "rating": 4}, {"title": "Easy to complete", "text": "Direct, to the point, got what I needed quickly.", "rating": 4}, {"title": "easy process", "text": "The process was very easy. very reasonable pricing and when requested for a quote i got a quick response.", "rating": 4}, {"title": "Pleasant to work with", "text": "They are pretty quick to respond and very willing to help.", "rating": 4}, {"title": "Hassle-free Company to work with.", "text": "Working with SuetyBonds.com, was fast and easy and straight to the point. Hassle-free Company to work with.", "rating": 4}, {"title": "So good so far...", "text": "So good, so far", "rating": 4}, {"title": "Overall very easy to work with", "text": "The one issue I had was that we ordered 2 day bond delvery and customer service put it in the mail.  BUT They made it right by overnighting the bond to us.", "rating": 4}, {"title": "Service Experience", "text": "The service was pretty good!", "rating": 4}, {"title": "Good experience all around", "text": "In general I will say that I had a very good experience.  The customer service rep called me very quickly, sent me everything I needed and processed my purchase very quickly.  My only complaint would be that if I had know that I was going to get a copy of the Surety Bond within a day (and actually I think it was same day) of purchase I would not have bothered paying the extra $12 to have it Fedexed to me.  Other then that the experience was excellent.", "rating": 4}, {"title": "Bond Purchase for Oregon", "text": "Because this was our first purchase of a Bond, we were very clumsy at knowing what to expect.  But, in the end, SuretyBonds.com did get us a price that was less than half of what the other companies offered.  So I guess in the end, that really helps the bottom line for any business!", "rating": 4}, {"title": "Great experience!! Good people..maybe 5 stars in future..", "text": "Very responsive to my request..quote received within hours. Rep explained options and provided updates to FMCSA as promised. Maybe 5 star's in months to come .. we will see.\r Jeff T", "rating": 4}, {"title": "Great Service", "text": "An agent contacted me right away when i emailed. He gathered the needed info, answered my questions and had a quote for me next day.\r It would be 5 stars, but i took one off because of the lack of a web payment option. It would be 5 stars if there was a secure online way to make payments, instead of sending checks or m oneyorders in the mail, or a credit card number via (totally unencrypted) fax.", "rating": 4}, {"title": "Ummmmm...", "text": "Haven't heard back from them to correct the Bond Document.  I need to correct the VIN# and our Business Name and have not had any contact with the rep since the initial contact...\r Update...\rI have been contacted by the sales rep and have updated my Bond Document.  I judge a company by how well they handle things when they make mistakes(We all make them!).  I am impressed by the response to this post and actions taken to correct it.  This company cares about their customers.  I will recommend using SuretyBonds.com to other Title Clerks.", "rating": 4}, {"title": "bonded title", "text": "Things went very smoothly, very satisfied.", "rating": 4}]