[{"title": "Excellent customer service", "text": "Excellent customer service. Beautiful product, just as pictured. Really happy with the entire process. But quite expensive.", "rating": 4}, {"title": "  Rhinestone horsebit zip…", "text": "Purchased the  rhinestone horsebit zip tall boots. I love them, glad that I followed my first mind and went up a size making them very comfortable. I suggest go up a size in these boots for a more perfect and comfortable fit.", "rating": 4}, {"title": "Rainbow did it for me!", "text": "I gave a four star rating only because I felt that most of the \"shipping\" time was spent in the warehouse. For almost two days package was still at the warehouse. Otherwise, I would have given a five star rating. Rainbows application is fantastic and very user friendly. Also, their selection is outstanding. Rainbow does stand alone!", "rating": 4}, {"title": "More clothes from almost famous and…", "text": "More clothes from almost famous and boom boom quality and affordable pieces  that last and don’t start raising the price or I will shop elsewhere. And it would be nice if you guy sent me a gift card I rock rainbow clothes and you would never know my clothes came from rainbow by the way I style them.Just more quality affordable pieces that can last being  wash more than once or twice.", "rating": 4}, {"title": "Rainbow Great Deals. Move Quick when you see a Gem", "text": "I’m a new rainbow shopper and the prices are amazing. If I move quick I can get my size. There has been a few occasions where items sell out fast. I find that the stores have tones of materials but often very small a crowded.  Overall my shopping experience has been great. I will look to use the online platform moving forward. ", "rating": 4}, {"title": "My shopping experience was almost…", "text": "My shopping experience was almost perfect. I only wish the graphic skirts I bought had been available in regular women sizes. I bought the 1X plus size, but I plan to have the garments altered to make them a size large like I originally wanted. ", "rating": 4}, {"title": "Need to get more quality things", "text": "I do appreciate your sales but you need to get more quality stuff cuz I know my material very well and I know what would last and hold up but your earrings is at Shein $1.50,and at Temu, also at Fashion Nova the jewelry is much cheaper so sometimes it would be nice to check that out.", "rating": 4}, {"title": "Coats 4 Kidz", "text": "I found some beautiful girl's coats at a great price. I work with a nonprofit organization that gives coats free of charge to underpriviledged children in Mississippi. i shop early for the best bargains and you have some fantastic ones. The more I save on a coat, the more I can buy.", "rating": 4}, {"title": "Good experience", "text": "Order came fast *shipped to a US address) and the quality of the clothes were what I expected. The small could have been a bit smaller, so maybe have more size ranges. The app such is a pain to use, it just freezes or just doesn't load. Otherwise, happy with the purchases and will be ordering again. ", "rating": 4}, {"title": "I am giving 4 stars as the items have…", "text": "I am giving 4 stars as the items have not yet been delivered as yet. So far the purchasing experience is very good. The site is user friendly, My purchase was effortless. I was able to find what i was looking for at reasonable prices, i will be shopping again, already started to add more items to my cart.", "rating": 4}, {"title": "Love the affordable plus sizes!!", "text": "Love that you have plus sizes at reasonable prices!! However, your search feature often takes us to the wrong items. Also, the way things are laid out is confusing and the pictures and descriptions need to be done better. For example, I need a hoodie with pockets. I ordered a few pieces but sometimes couldn't tell if it has pockets or not?! That's not very helpful.", "rating": 4}, {"title": "Rainbow impresses with its remarkable…", "text": "Rainbow impresses with its remarkable affordability. The wide range of products they offer doesn’t compromise on quality despite the budget-friendly prices. I’ve found that their pricing strategy makes it accessible for a diverse audience without sacrificing the value or style of their items.", "rating": 4}, {"title": "Shopping on line at rainbow.", "text": "It was very easy shopping on line, I received everything I ordered.The deliver took about a week and the return policy is very easy as well. I find that the garments run small, so be aware when purchasing clothing items.Overall, I enjoyed my shopping experience with Rainbow.", "rating": 4}, {"title": "I saw what I like and hopefully it will…", "text": "I saw what I like and hopefully it will fit first and foremost that my order get received in my mail box 9. Gate code to get in is #23 * 1907 I live right side long the way down to the corner. I have issues with resident stealing delivery thank you very much have wonderful bless day.", "rating": 4}, {"title": "Keeping on with tradition & tecnology…", "text": "This is my first time buying in your store by Internet we have the store here in P.R. but this was one of my Daughters favorite store and so I picked her and my Grandaughter Christmas gift to be shipped to Florida,I enjoyed the experience and the helped given to me by your Customer Service Rep.", "rating": 4}, {"title": "Affordable and Cute Merchandise", "text": "I love the merchandise that Rainbow offers! However, the website and the app can be quite buggy; I had to refresh the app three times before I was able to place my last order. When the technical issues are fixed it will be a much smoother process to order from Rainbow.", "rating": 4}, {"title": "Most of my purchases were great and…", "text": "Most of my purchases were great and prices were even better, but the sizing information on the boots I bought was incomplete. Sizing information and chart say 9, but boots say 9/ 39. I donot wear 39, so I had to return. I was so disappointed, because I had purchased it for my birthday.", "rating": 4}, {"title": "I love your deals I wish u have more…", "text": "I love your deals I wish u have more online discount codes I deserve it this my third time this month purchasing would have gave 5stars but no give back code", "rating": 4}, {"title": "The clothes are usually great however…", "text": "The clothes are usually great however the Rogue shoes are not made for plus size women. I have several that have broken or collapsed after one wear. I would love Rogue information to write them and complain since you guys won't do it.", "rating": 4}, {"title": "It’s always easy to order from rainbow…", "text": "It’s always easy to order from rainbow but receiving my order is a different story. FedEx is the worst delivery service and I wish rainbow would find a different carrier. If I don’t receive my package this time I will no longer order from rainbow online. Also free shipping at $35 was wonderful and I wish afterpay was an option instead of the company that’s offered now. ", "rating": 4}, {"title": "Comfy and affordable ", "text": "As a plus size girl in a world made for smaller women, I love having a store that doesn't cost the soul of my first born to shop at. I got 3 pairs of jeggings, I may size up next time they are a little snug and a bit thin, my child said she couldn't see through them. 1 pair of jeans and I'm sold they are soft and fit amazing. 1 pair drawstring cargo pants, I'm tall 5'10 so they are a bit short but I'm going to roll them up at the bottom. 1 shirt soft and form fitting, I would order up if you want it a bit looser. If I order nothing else I will always buy my jeans here. ", "rating": 4}, {"title": "Great selection and pricing", "text": "Great selection and pricing.  Little bit disappointed that some items not available in my size.Not sure if my card was charged for the full amount or if it processed the \"pay in 4\" payment structure.  Little bit confused about that process.", "rating": 4}, {"title": "Navigation was comprehensive and I love…", "text": "Navigation was comprehensive and I love that I can find items that have sold out in the store. Feedback would be to reduce the spending limit for free delivery or it defeats the purpose of shopping online for items not found in store.", "rating": 4}, {"title": "Overall I would give 4 out of 5 because…", "text": "Overall I would give 4 out of 5 because they prices are always great shipping is pretty fast on thing I don’t like is when you put an item in your cart it doesn’t say unavailable until you get ready to check out.", "rating": 4}, {"title": "No reviews on items in app(?)", "text": "Maybe I didn’t look close enough but there doesn’t seem to be any reviews on the items, when using the app at least. Otherwise pretty good and easy experience ordering some stuff.", "rating": 4}, {"title": "Size availability was great", "text": "Size availability was great! I was able to purchase all of my daughters favorites. I would like to see sizes extended to 4xl for all items offered in plus sizing.", "rating": 4}, {"title": "Bad service all the way around ", "text": "So I've been shopping at Rainbows stores here in San Antonio since forever I've even shipped on line a few times,but this last time was a hot mess. I ordered 2 things my address on my account as been the same for yrs now. But somehow my order was generated with an address in Philadelphia and my ordered was returned I was so livid because customer service on the phone are as rude as they come even though the mistake was on rainbows side not once was I offered an apology or anything, and in order to reorder my stuff I had to wait till be refunded in which each item was returned separately so that was stupid, 2nd I wasnt even offered a simple sorry let me give you a small discount on your reorder... This is the worst online Custer service I've ever had to deal with shein does a lot better than what this company offers. But please do learn to offer an apology to your shoppers when it's the company's fault. Word of mouth and reviews goes a long way. Needless to say I did reorder what I wanted but I shouldn't have gone through so much hassle because of an error generated by rainbow. But now I'm not sure if I will ever order on line again. ", "rating": 4}, {"title": "I was looking for an item that I had…", "text": "I was looking for an item that I had bought previously a few years ago. It was a little harder to find them, but I believe I did find the right thing.I like the website because it’s pretty easy and the description of the clothes helps me remember which of the things I’m looking for", "rating": 4}, {"title": "Good selections", "text": "I’ve always liked Rainbow Shops, just not the prices so much. Still, the styles and clothing are for me so it’s worth it. I would like to see more of the products I usually buy because the shorts and summer clothing are always sold out in 3/4 of the sizes offered.", "rating": 4}, {"title": "Your stuff is GREAT at Rainbow!", "text": "I always like to shop at Rainbow for accessories, shoes and clothes. Get great deals with great selection and variety...very affordable! I love to shop with Rainbow because I am a plus-sized woman and the things that you have really are modern and chic.", "rating": 4}, {"title": "Lots of options", "text": "The items were easy to view, there are lots of options, and I can easily find my size. I also appreciate the option of offering multiple pickup locations for orders.", "rating": 4}, {"title": "I love Rainbow and I love how…", "text": "I love Rainbow and I love how affordable the prices are. I would love to see more jewelry (specifically bangle bracelets) Please add boot cut jeans and jeans in darker washes. If possible we could use 4x sizes", "rating": 4}, {"title": "I love shopping on Rainbow but I find…", "text": "I love shopping on Rainbow but I find lately the clothes aren't that cute, but I still give you all a four based on past shopping experience.", "rating": 4}, {"title": "Great experience overall but… ", "text": "The plus size section needs a little freshening up, and the check out process isn’t as intuitive when you’re using a gift card as payment, it took a little while to figure out ", "rating": 4}, {"title": "I am not sure that I got my discount…", "text": "I am not sure that I got my discount with the promo code FOMO please make sure you apply that and deducted from my credit card. Thank you cause I am a regular shopper with rainbow.", "rating": 4}, {"title": "The clothes are great. Make it easier to find Klarna option.", "text": "The clothes on the site are great but it was difficult to find the klarna option for payment. I had to click multiple times on the various payment options to find it. ", "rating": 4}, {"title": "most items came in the sizes I needed", "text": "most items came in the sizes I needed.  8/10 was almost totally out in all the selections I wanted  But I ended up with a sufficient amount of clothes for my daughters regardless", "rating": 4}, {"title": "The price and style of the clothing is…", "text": "The price and style of the clothing is superb, but the website does not update well. It lists clothing as available and when you put it in your cart and try to purchase it, it may say \"out of stock.\"", "rating": 4}, {"title": "My only thing was that if you had the…", "text": "My only thing was that if you had the merchandise in the store, which I saw it online, I could have just picked it up from the store and not pay for shipping. Because if I see it online, I expect for it to be in the store not having to get it shipped to me. Your store charges more to ship it to your home than to the store pickup.", "rating": 4}, {"title": "Easy to find online", "text": "While I like the ease of online shopping I would also like to know if items are available in store near me without having to call each store.", "rating": 4}, {"title": "I gave a 4 stars because I first had…", "text": "I gave a 4 stars because I first had gone on rainbowshop.com through Facebook and put items in the cart. When I  later went directly to the website, it had all the items except one in my size; the one was sold out in the color I wanted in my size.", "rating": 4}, {"title": "It was easy to navigate your system and…", "text": "It was easy to navigate your system and find what I was looking for.  It also had several variety of shoes in my size which was uncommon for me.  Thank you!", "rating": 4}, {"title": "I have lymphedema in one arm( swelling…", "text": "I have lymphedema in one arm( swelling due to mastectomy). It is hard to find tops that fit both arms. I like the option of return to store when ordering online.", "rating": 4}, {"title": "Shopping was easy the reason I only…", "text": "Shopping was easy the reason I only gave 4star is because I signed up for email in I never received the 10% off promo code ", "rating": 4}, {"title": "Great prices; cheap clothes ", "text": "Prices are great but the quality is reflective of the pricing. I don't expect these clothes to last more than a couple of seasons, but for these prices, that's OK. ", "rating": 4}, {"title": "Love the items", "text": "Love the items, but when using a gift card your unable to use complete amount with all taxes so I had to put some items back. ", "rating": 4}, {"title": "Please improve the quality of online shopping…", "text": "Great but I hate the way in store accessories are not available online like cosmetics strange but true. ", "rating": 4}, {"title": "Payment process…", "text": "It was good until the Apple Pay wasn’t available unless I logged out my account and continued my purchase as a guest that was annoying.", "rating": 4}, {"title": "The price point is good", "text": "The price point is good.  I really appreciate the free shipping after spending a reasonable amount which was $50.  Thanks", "rating": 4}, {"title": "The employees were very polite and…", "text": "The employees were very polite and helpful.Was a bit disappointed that the store did not allow access to dressing rooms", "rating": 4}, {"title": "It was ok", "text": "I’m a first time customer so I spun the wheel and got 15% off if I signed up for emails. I did and then when I went to order and checkout, I never got a code or email. But I’m getting a tons of emails from your site.", "rating": 4}, {"title": "The best thing rainbow has done within…", "text": "The best thing rainbow has done within the past year, was lowered the free shipping price form $75 to $35. One of the best things they've done in awhile. the selection is ok. Just wish there was more clearance items.", "rating": 4}, {"title": "My First Purchase", "text": "It was my first time purchasing from Rainbow.com. I don't have any complaints just available sizes. My items arrived & I'm pleased with the purchase.", "rating": 4}, {"title": "Was able to purchase most of what I…", "text": "Was able to purchase most of what I liked in the correct sizes. Good assortment. Easy to navigate online.", "rating": 4}, {"title": "Couldn’t find exactly what I want but…", "text": "Couldn’t find exactly what I want but hopefully this will be big enough and more comfortable to wear", "rating": 4}, {"title": "I love shopping at Rainbow Shops…", "text": "I love shopping at Rainbow Shops however the shipping fee can be a bit too much.", "rating": 4}, {"title": "I've Ordered In The Past Service Was…", "text": "I've Ordered In The Past Service Was Good. I'll Take Another Survey When My Order Return On Time.", "rating": 4}, {"title": "Loyal customer", "text": "Rainbow is very afordable! I been loyal customer since,  I was a teenager. Rainbow should provide coupons.", "rating": 4}, {"title": "Because I love shopping at rainbow…", "text": "Because I love shopping at rainbow Because you can find some nice stuff online ", "rating": 4}, {"title": "I love the choices...and for…", "text": "I love the choices...and for versatility in my clothes and accessories I can Always count on RAINBOW!!!!", "rating": 4}, {"title": "Quality jeans - but......", "text": "I have shopped Rainbow for years, and really like their jeans. But recently there has not been the selection in size 13 jeans as there has been in the past. It's very limited.", "rating": 4}, {"title": "I loved the shopping experience", "text": "I loved the shopping experience . I just wish the site had more regular than Plus size.", "rating": 4}, {"title": "I love shopping with rainbow they keep…", "text": "I love shopping with rainbow they keep you informed on your purchases ", "rating": 4}, {"title": "I love your jeans", "text": "I love your jeans. If I take my time I find a lot of hidden gems for a great prices. Thank you for keep us current in style and also at an economical price.", "rating": 4}, {"title": "It was good and I don’t know if it was…", "text": "It was good and I don’t know if it was user error or not but every time I looked at something it took me back to the top of the list of the items I was looking at so it was very frustrating but otherwise an overall good experience", "rating": 4}, {"title": "Need to allow reviews", "text": "Easy to navigate. Smooth checkout process. It would be great if you could see reviews. ", "rating": 4}, {"title": "Quick and easy shopping", "text": "Quick and easy shopping. Affordable pricing and stylish designs that cater to all sizes.", "rating": 4}, {"title": "I wish size xs was available or there…", "text": "I wish size xs was available or there was better young girl skirt selections", "rating": 4}, {"title": "The prices were great…", "text": "The prices were great and site is easy to maneuver. The only reason I didn’t give 5 stars is because a few of the items I wanted were out of stock. ", "rating": 4}, {"title": "There need to be more updated variety…", "text": "There need to be more updated variety and choices. Size selections are very limited", "rating": 4}, {"title": "that you get charge for shipping even it go to the store", "text": "Company does ok, need to greet customer when coming into store.  ", "rating": 4}, {"title": "The fact that they restock quickly", "text": "The fact that they restock quickly, these sandles had run out, but was replenished  quickly", "rating": 4}, {"title": "Shop at rainbow all the time I like the…", "text": "Shop at rainbow all the time I like the store and I mostly like it is affordable with the prices and they have very cute thing that on trend and unique items.. great store", "rating": 4}, {"title": "I love Rainbow..I'm a older woman who…", "text": "I love Rainbow..I'm a older woman who love comfort and i love long tops..And I hate yall shirt with Queen and messages on them..So cheap looking..", "rating": 4}, {"title": "Can’t believe how cute they are!", "text": "I am pleasantly surprised by the quality of the sandal and the fit. Happy with my purchase.", "rating": 4}, {"title": "Nice selection & easy to navigate site", "text": "Nice selection & easy to navigate site, but discount codes weren't easy to use.", "rating": 4}, {"title": "Everytime we are looking for an item…", "text": "Everytime we are looking for an item and can't find it, Rainbow always seems to have it.", "rating": 4}, {"title": "I feel that you should let people know what is in stock for as what can be put in the cart", "text": "I enjoy the clothes and they just really need to get better stuff for the plus sizes females", "rating": 4}, {"title": "Great looking clothes and affordable…", "text": "Great looking clothes and affordable prices… I hate being offered it told you won free items , and when you try to access/ retrieve it , it’s not free your ask to pay a discounted price for the said item listed as free, I think that’s a deceptive practice… free means free, discounted is a totally different thing ,,..", "rating": 4}, {"title": "Easy find categories just not many…", "text": "Easy find categories just not many options for toddler boys.", "rating": 4}, {"title": "The ease in ordering", "text": "The ease in ordering and the variety of styles wins me over every time! The order comes ", "rating": 4}, {"title": "I was able to get more designs", "text": "I was able to get more designs. I was able to get better selection. I was able to overview the website outside of the store.", "rating": 4}, {"title": "Verity", "text": "I like the verity of products but the limited sizes could be enhanced. ", "rating": 4}, {"title": "very fast shipping outside state and…", "text": "very fast shipping outside state and alright fitting! ", "rating": 4}, {"title": "Different Prices for the same shoe!!!", "text": "I saw the same shoes as one of your stores in N Miami Beach FL but they were charging $19.99. On-line if I buy 2 or more, they’re $10 each! That’s not fair.", "rating": 4}, {"title": "I just had trouble putting my order in…", "text": "I just had trouble putting my order in with my card. I have to go to Paypal.Other then that everything was ok..", "rating": 4}, {"title": "Easy process which is very helpful …", "text": "Easy process which is very helpful  nice plus size clithing", "rating": 4}, {"title": "I've been shopping with rainbow for a…", "text": "I've been shopping with rainbow for a long time love the jeans and the t-shirts and the dresses and boots 🥰😊", "rating": 4}, {"title": "The sales persons helped me out alot…", "text": "The sales persons helped me out alot while I was looking for a certain items. They took they time with me", "rating": 4}, {"title": "I can't give accurate feedback until I…", "text": "I can't give accurate feedback until I receive my items.!", "rating": 4}, {"title": "I am mostly happy with my purchase.", "text": "For the most part, the items I ordered were nice and fit well. A couple of things were a little snug and I did return them. The shoes fit well but the boots were way too heavy on my foot!", "rating": 4}, {"title": "Your websit website easiness on the eyese was easy to read for…", "text": "Your website was easy to read for someone that is visually impaired and I found it easy to use and your other options such as whether to use a card or PayPal or very easy to use and entering my address and information was also easy to use and was very quick and very easy thank you", "rating": 4}, {"title": "I am a regular customer with Rainbow…", "text": "I am a regular customer with Rainbow for years on I have never get any gift cards from Rainbow are anything,  I be spending so much money over years with Rainbow, And No recognition Rainbow should show customer appreciation,   like Shein give gifts card, butother west from that service is good", "rating": 4}, {"title": "I love the sale prices and that I…", "text": "I love the sale prices and that I didn't have to spend a lot of money to get the free shipping.", "rating": 4}, {"title": "I found some cute clothing on clearance…", "text": "I found some cute clothing on clearance for newborn boys.", "rating": 4}, {"title": "Keeping prices down in order for people…", "text": "Keeping prices down in order for people be able to purchase", "rating": 4}, {"title": "I glad I find found a XL in clothing", "text": "I glad I finally  found a XL in clothing  in the rainbow shop ", "rating": 4}, {"title": "Website could have been easier to…", "text": "Website could have been easier to navigate through ", "rating": 4}, {"title": "You don't have a good selection for…", "text": "You don't have a good selection for plus size and the shoes are not what I would buy.", "rating": 4}, {"title": "I love the prices and the ease of…", "text": "I love the prices and the ease of shopping with you online. Wonderful!", "rating": 4}, {"title": "Love the clothes and it was easy to…", "text": "Love the clothes and it was easy to navigate through the website", "rating": 4}, {"title": "Great variety of clothes and sizes", "text": "Great variety of clothes and sizes. Very reasonable prices!", "rating": 4}, {"title": "I can always find what I'm looking for…", "text": "I can always find what I'm looking for and they're shipped on time.", "rating": 4}, {"title": "It was a good experience ", "text": "It wasn’t hard to navigate but it wasn’t as easy as it should’ve been", "rating": 4}, {"title": "Call the customer service number for help", "text": "It was good customer service to the online customer service telephone number. Use them!", "rating": 4}, {"title": "Great customer service n I loved yall…", "text": "Great customer service n I loved yall clothes", "rating": 4}, {"title": "Placed my first order", "text": "Placed my first order. Ordering was easy. ", "rating": 4}, {"title": "The price is alway right very reasonable", "text": "The price is alway right very reasonable ", "rating": 4}, {"title": "Better safe than sorry", "text": "I prefer to shop in the store, you get to see and feel your selections.  It would be wise to try on your choices.", "rating": 4}, {"title": "The site was user friendly", "text": "The site was user friendly, appreciated that.", "rating": 4}, {"title": "I like rainbow's selection and ease of…", "text": "I like rainbow's selection and ease of use.", "rating": 4}, {"title": "Shopping for my grand-daughter", "text": "The items I purchased were fashionable and reasonably priced.", "rating": 4}, {"title": "Great", "text": "It was easy to make my order!! My package came in ample amount of time like 1 week at the most!!", "rating": 4}, {"title": "The ez of the website made the…", "text": "The ez of the website made the experience great", "rating": 4}, {"title": "Needs to update how you can add other…adding new cardyes", "text": "Needs to update how you can add other cards for pay", "rating": 4}, {"title": "Great products", "text": "Great products, great prices, great quantity and also the website was easy to search", "rating": 4}, {"title": "I haven’t received order yet", "text": "I haven’t received order yet, can’t say. But the web site was great, easy to use. ", "rating": 4}, {"title": "Good deals ", "text": "Good deals on comfortable clothes ", "rating": 4}, {"title": "Great products at  reasonable prices.🙂", "text": "Date of experience: April 30, 2024", "rating": 4}, {"title": "One pair of my sandals the buckle…", "text": "One pair of my sandals the buckle doesn’t want to stay fastened ", "rating": 4}, {"title": "The online rates a good but shipping is…", "text": "The online rates a good but shipping is way too high.", "rating": 4}, {"title": "Requested items available and in stock.", "text": "Date of experience: December 23, 2023", "rating": 4}, {"title": "Great Prices", "text": "Great Prices,  Prompt Delivery and Verification, Call center operators are always friendly. ", "rating": 4}, {"title": "I couldn’t change my delivery  to pick…", "text": "I couldn’t change my delivery  to pick up in store", "rating": 4}, {"title": "It was great but expensive", "text": "It was great but expensive ", "rating": 4}, {"title": "Satisfied everything I wanted", "text": "I found everything I wanted, wasn’t happy about the shipping fee ", "rating": 4}, {"title": "Would not accept discount codes", "text": "Date of experience: January 13, 2024", "rating": 4}, {"title": "You have Beautiful Clothes", "text": "Date of experience: May 01, 2024", "rating": 4}, {"title": "Casual,comfy clothing.", "text": "Inexpensive, comfortable clothing with helpful workers who make you feel you belong.", "rating": 4}, {"title": "Need more 4X+ Sizes", "text": "Need more 4X, 5X, 6X size swimsuits and clothing. ", "rating": 4}, {"title": "Enjoyed the easy of purchasing will…", "text": "Enjoyed the easy of purchasing will definitely order again", "rating": 4}, {"title": "It was smooth transactiom", "text": "Date of experience: April 23, 2024", "rating": 4}, {"title": "Easy to find merchandise", "text": "Easy to find merchandise ", "rating": 4}, {"title": "Site was very easy to maneuver", "text": "The site was very easy to navigate through", "rating": 4}, {"title": "I couldn't get out to go shopping.", "text": "Date of experience: December 17, 2023", "rating": 4}, {"title": "The skirts were just what I was looking…", "text": "The skirts were just what I was looking for. Love the color.", "rating": 4}, {"title": "Decent clothes", "text": "Decent clothes, decent prices.", "rating": 4}, {"title": "LOVE RAINBOW STORES", "text": "Fast and efficient and good prices", "rating": 4}, {"title": "I guess because I shop here all the…", "text": "I guess because I shop here all the time and just use to it", "rating": 4}, {"title": "Is general good online store", "text": "Date of experience: December 18, 2023", "rating": 4}, {"title": "Items that are not available should not…", "text": "Items that are not available should not be on the site", "rating": 4}, {"title": "By offering a nearby pick location", "text": "Date of experience: February 15, 2024", "rating": 4}, {"title": "I would've given 5 starts if the promo…", "text": "I would've given 5 starts if the promo code would've worked!! :(", "rating": 4}, {"title": "Customer First", "text": "Speedy checkout ", "rating": 4}, {"title": "Most of my size in sweats was not…", "text": "Most of my size in sweats was not available ", "rating": 4}, {"title": "Very good and Customer Service was…", "text": "Very good and Customer Service was excellent ", "rating": 4}, {"title": "Service great.", "text": "Date of experience: May 01, 2024", "rating": 4}, {"title": "Great prices! Too many high rise", "text": "Wish you offered more low rise bottoms. Great prices!", "rating": 4}, {"title": "Well", "text": "Well. I  want the olive color but was sold out in my size", "rating": 4}, {"title": "Great web site and great prices", "text": "Great web site and great prices.  Can’t wait to get my order😎", "rating": 4}, {"title": "I love the product for women that range…", "text": "I love the product for women that range 2x to 4x. Nice styles.", "rating": 4}, {"title": "Always cute.", "text": "Fun variety.", "rating": 4}, {"title": "They have the sizes I need and the…", "text": "They have the sizes I need and the fashion I love. ", "rating": 4}, {"title": "Somethings were out of size I wanted to…", "text": "Somethings were out of size I wanted to order.", "rating": 4}, {"title": "I’m very pleased with my purchases.", "text": "Date of experience: April 13, 2024", "rating": 4}, {"title": "Variety too choose from", "text": "Variety too choose from", "rating": 4}, {"title": "Not too happy with the survey at the…", "text": "Not too happy with the survey at the end. ", "rating": 4}, {"title": "Plus size active wear.", "text": "Good price for plus size active wear.", "rating": 4}, {"title": "It was okay nothing to brag about", "text": "It was okay nothing to brag about ", "rating": 4}, {"title": "Looking", "text": "Looking at the shoes were really easy.", "rating": 4}, {"title": "Easy shopping and had my size", "text": "Date of experience: May 11, 2024", "rating": 4}, {"title": "It was alright", "text": "It was alright ", "rating": 4}, {"title": "Many things are out of stock in most…", "text": "Many things are out of stock in most sizes.", "rating": 4}, {"title": "Ok.priced items ok", "text": "Ok.. the promo coupon codes never work..", "rating": 4}, {"title": "Shipping was fast", "text": "Date of experience: December 24, 2023", "rating": 4}, {"title": "Satisfied ", "text": "Easy access to items ", "rating": 4}, {"title": "you have a number of choices", "text": "Date of experience: April 17, 2024", "rating": 4}, {"title": "Great experience", "text": "Great experience. Sections easy to follow", "rating": 4}, {"title": "My order went through.", "text": "Date of experience: March 11, 2024", "rating": 4}, {"title": "It was easy to connect with Klama", "text": "Date of experience: January 04, 2024", "rating": 4}, {"title": "Awesome Store!", "text": "I love the service and pieces ❤️ ", "rating": 4}, {"title": "Experience wasn't GREAT it was okay. Jumped from a 19.99 price tag to over $30.", "text": "Experience wasn't GREAT, It was ", "rating": 4}, {"title": "Not a lot of tunic tops", "text": "Not a lot of tunic tops ", "rating": 4}, {"title": "selection in larger sizes", "text": "Date of experience: April 08, 2024", "rating": 4}, {"title": "Experience was good", "text": "Experience was good. Easy to understand.", "rating": 4}, {"title": "Great products great price great quality", "text": "Date of experience: February 29, 2024", "rating": 4}, {"title": "Easy to order and choose items.", "text": "Date of experience: December 08, 2023", "rating": 4}, {"title": "Amazing easy to use", "text": "Date of experience: January 27, 2024", "rating": 4}, {"title": "Easy.peesy", "text": "It is easy and simple to find what you want.", "rating": 4}, {"title": "Easy to navigate website.", "text": "Date of experience: January 13, 2024", "rating": 4}, {"title": "Easy to access & navigate.", "text": "Date of experience: December 11, 2023", "rating": 4}, {"title": "It was easy to use ", "text": "It was easy to use, I might use it again", "rating": 4}, {"title": "THE ITEM I BROUGHT WAS A GREAT PRICE.", "text": "Date of experience: May 16, 2024", "rating": 4}, {"title": "Range of plus size clothes offered", "text": "Date of experience: April 03, 2024", "rating": 4}, {"title": "The clothes are super cute and fit nicely!!", "text": "The clothes are cute and fit nicely!!", "rating": 4}, {"title": "That the merchandise is quality!", "text": "What I ordered was in stock!!", "rating": 4}, {"title": "It was very interesting and informative", "text": "Date of experience: December 30, 2023", "rating": 4}, {"title": "affordable great quality clothing", "text": "Date of experience: April 29, 2024", "rating": 4}, {"title": "Easy to find", "text": "Easy to find. Great prices.", "rating": 4}, {"title": "Hurry they sell out fast", "text": "Date of experience: March 02, 2024", "rating": 4}, {"title": "Easy navigation and checkout.", "text": "Easy navigation and checkout. ", "rating": 4}, {"title": "Very good store", "text": "Very nice clothes ", "rating": 4}, {"title": "Experience was ok", "text": "Date of experience: March 03, 2024", "rating": 4}, {"title": "If you can't find in store definitely online", "text": "Inventory  options,  Convenience", "rating": 4}, {"title": "Love the prices", "text": "Date of experience: March 05, 2024", "rating": 4}, {"title": "Good service", "text": "Fast check out", "rating": 4}, {"title": "Fast and easy", "text": "Date of experience: February 09, 2024", "rating": 4}, {"title": "Easy shopping experience.", "text": "Date of experience: January 31, 2024", "rating": 4}, {"title": "Nice clothes 😍 ☺️ 😌", "text": "Date of experience: December 26, 2023", "rating": 4}, {"title": "Great deals", "text": "Date of experience: December 05, 2023", "rating": 4}, {"title": "Clothing Sizes Were Off", "text": "I ordered my normal size and some of the sizes of the jackets and tops I ordered were too big and too small. Overall, it was ok, though, and I kept around half of the items I ordered.", "rating": 4}, {"title": "Great sale and variety of items…", "text": "Great sale and variety of items available in my size.", "rating": 4}, {"title": "Nice to shop on line without going…", "text": "Nice to shop on line without going outside in the cold.", "rating": 4}, {"title": "Just love your variety of items and how…", "text": "Just love your variety of items and how easy it is to maneuver on your website. Also your products are very reasonably priced and of value. Thank You for thinking of those of us who don't have much, but love to have up to date items. We appreciate You.", "rating": 4}, {"title": "Nice selection", "text": "Availability of desired merchandise", "rating": 4}, {"title": "Site is user friendly", "text": "Site is user friendly. I would suggest adding product locator.  It woukd be nice to knownif something is in stock locally.", "rating": 4}, {"title": "It was good", "text": "It was good, just wish employees could use their discount number.", "rating": 4}, {"title": "i found a lot of things that i liked…", "text": "i found a lot of things that i liked and wanted to purchase. the shipping was not long nor was there a problem with getting my items. thank you", "rating": 4}, {"title": "Easy to order", "text": "Date of experience: November 27, 2023", "rating": 4}, {"title": "Good price good quality", "text": "Date of experience: November 27, 2023", "rating": 4}, {"title": "Fast and easy", "text": "Date of experience: November 26, 2023", "rating": 4}, {"title": "Pretty good experience", "text": "I found pieces I love at an affordable price, but the app was very glitchy. I closed multiple times while I was shopping and was rather laggy. I was able to ultimately successfully find what I wanted and place the order though. So my only suggestion is to work on making the app run smoother.", "rating": 4}, {"title": "Great prices", "text": "Great Prices and beautiful clothing", "rating": 4}, {"title": "Not the correct size", "text": "I saw these shoes in Rainbow today - and came home as you didn't have them in my size and still don't - so I was disappointed - I'd love to get the ones I ordered in size 9/ in a size 10 and so I might have thrown away $20 - but who knows - I wish I wish I wish - Happy Holidays~!~ Adrian Mallin 407 924 5258", "rating": 4}, {"title": "Easy to navigate website", "text": "Easy to navigate website. Stylish looks good prices.", "rating": 4}, {"title": "The sales were great", "text": "Date of experience: November 25, 2023", "rating": 4}, {"title": "Did Not Receive My Additional 10%", "text": "I Did not Receive order yet just ordered 11/25/23 @2am. I’m giving this rate experience on placing of my order. I Did not receive my additional 10% off of total purchase price. I was rather bothered by it that’s the reason for a 4 star review.", "rating": 4}, {"title": "I love it", "text": "They had what I was looking for and it was cheap", "rating": 4}, {"title": "Enjoy selection of sizes and selection…", "text": "Enjoy selection of sizes and selection and prices", "rating": 4}, {"title": "I love buying in Rainbow stores and I…", "text": "I love buying in Rainbow stores and I love more the fact that i can buy online too 😊", "rating": 4}, {"title": "Great on trend coat in my size", "text": "I found what I wanted in the size that was not available in my local shop", "rating": 4}, {"title": "Easy to shop but some size are sold out", "text": "Date of experience: August 01, 2023", "rating": 4}, {"title": "Easy to oder, easy to checkout", "text": "Easy to oder. Easy to checkout", "rating": 4}, {"title": "Excellent styles", "text": "Wide variety of clothes and also plus sizes", "rating": 4}, {"title": "Great prices", "text": "Great prices, wished there was more variety.", "rating": 4}, {"title": "Style and affordability.", "text": "Date of experience: November 18, 2023", "rating": 4}, {"title": "You guys did easy ordering hope gets…", "text": "You guys did easy ordering hope gets here quick lol!!!", "rating": 4}, {"title": "Easy", "text": "Great prices.", "rating": 4}, {"title": "I like the selection", "text": "Date of experience: November 15, 2023", "rating": 4}, {"title": "Love the discount code to apply", "text": "Love the discount code to apply. Good selection of clothing available.", "rating": 4}, {"title": "Ordering was easy can’t wait to receive…", "text": "Ordering was easy can’t wait to receive my merchandise", "rating": 4}, {"title": "Most of the stuff was easy to find but…", "text": "Most of the stuff was easy to find but some stuff was only in plus size but still great bargains", "rating": 4}, {"title": "I found stuff that I liked for my…Stylish Wardrobe", "text": "I found stuff that I liked for my Granddaughter's and myself.", "rating": 4}, {"title": "Great Purchase but Need to Know this About Returns", "text": "Good quality and accurate sizing.  There were 2 drawbacks, though.  The first one was partly my fault.  I had purchased 2 bras.  I was unaware that you could not return certain items, bras being one of them.    I had to keep them, even though they do not fit right. The second drawback was that I did not know that if you send returns back with the pre-addressed label, there is a  deduction of  $7.99 from the amount being returned.  I was under the impression that there were free returns through the mail.  I returned at a store, though, and there were NO problems and the women working were VERY pleasant and helpful.  I felt very comfortable returning the items without any hassle in the store.  If you are confident in what you are purchasing and it isn’t difficult for you to go to a store, I highly recommend Rainbow Shops.  Their clothing is affordable and good quality, as well as “on-trend”!!", "rating": 4}, {"title": "App was very user friendly", "text": "App was very user friendly Great variety", "rating": 4}, {"title": "pricing of the clothing", "text": "pricing of the clothing.  But one thing I dont like is that you dont sell wide width shoes", "rating": 4}, {"title": "Decent customer service", "text": "Date of experience: November 10, 2023", "rating": 4}, {"title": "Everything was good and came in great condition", "text": "I placed this order on 11/3/23 and received it today so it took about a week to come which is great. The only issue is that the orange chevron I ordered is a x2 came in a x3 and fits kinda big but I’ll just throw it in the dryer to shrink it a bit. Other than that I am happy with my order.", "rating": 4}, {"title": "Your merchandise is great for the…", "text": "Your merchandise is great for the prices   Quality is good. Sometimes the sizes run smaller than stated.", "rating": 4}, {"title": "I like rainbow clothes and the website", "text": "Date of experience: November 07, 2023", "rating": 4}, {"title": "Great prices and fast check out.", "text": "Date of experience: November 05, 2023", "rating": 4}, {"title": "More styles and reasonable prices", "text": "Date of experience: November 04, 2023", "rating": 4}, {"title": "Great ordering was extremely easy to…", "text": "Great ordering was extremely easy to order. Only problem I had offer 30 days hula for my order but it wouldn't allow me to enter information to get it started", "rating": 4}, {"title": "Delivery was fast", "text": "Delivery was fast, didn’t like that my shoes did not come in their original box, instead of a bag. but I like them a lot.", "rating": 4}, {"title": "Cute clothing", "text": "This company has a lot of cute stuff.  I wish that the length on shirts, etc were provided because a lot of things I've bought are too short and I have to resell them.. not all of your customers want to let everything hang out! Also why don't you sell size 12 in bottoms?", "rating": 4}, {"title": "Quick ordering", "text": "Quick ordering, quick delivery and if needed easy returns. But never any promo codes", "rating": 4}, {"title": "I've brought many items most have been…", "text": "I've brought many items most have been great... there should be coupons for returning customers", "rating": 4}, {"title": "Options on picking up merchandise", "text": "Date of experience: October 22, 2023", "rating": 4}, {"title": "great sales", "text": "i enjoy shopping at rainbows.they have awesome clothes and great sales.", "rating": 4}, {"title": "Shopping at rainbow.com", "text": "Shopping at rainbow.com is fun and easy. I like your search engine. It makes it quick and easy to find the items you’re looking for. I also like Rainbow.com multiple payment options. Shopping online can make it difficult to know how an item may fit. I took off a star because I would like to see customer reviews about how the shoes and clothing fit. The items on the wishlist keep changing location. It can be challenging to find some of the more recent additions to the list.", "rating": 4}, {"title": "This is my first experience I don’t…", "text": "This is my first experience I don’t know yet", "rating": 4}, {"title": "Clothes in stocks in my size", "text": "Clothes in stocks in my size. Smooth order transaction. Clothing reasonably priced and cute.", "rating": 4}, {"title": "i like the shop but i think you should…", "text": "i like the shop but i think you should allow more free deliveries", "rating": 4}, {"title": "Easy to find my brand of shoe", "text": "Date of experience: October 20, 2023", "rating": 4}, {"title": "Love that I can purchase clothes…", "text": "Love that I can purchase clothes online. My code wouldn't work for savings. The app is very easy to use.", "rating": 4}, {"title": "The clothing I purchase is always fits…", "text": "The clothing I purchase  always fits true to size, your sale is amazing and I receive my orders in a timely manner.", "rating": 4}, {"title": "Lots of plus size options", "text": "Lots of casual plus size options. Would have liked to pick more than one size on the filters.", "rating": 4}, {"title": "Security when shopping online.", "text": "The fact that the statement (secure) was a huge plus for me no cookie consent. People want to be able to trust a website, especially with transactions.", "rating": 4}, {"title": "Everything was great", "text": "Everything was great, just wish it filtered down a little easier. Great prices.", "rating": 4}, {"title": "First shoe order", "text": "I was able to put in my size and color so I can find just what I needed. It was easy to go to the site and make my order.", "rating": 4}, {"title": "Size availability was very scarce.", "text": "Date of experience: October 15, 2023", "rating": 4}, {"title": "I like the convenience", "text": "I like the convenience,  although I wish things could be available in more colors and cheaper", "rating": 4}, {"title": "All about the shoes!!!!", "text": "Easy process however I was disappointed the shoes were on sale for 19$ ended up being 30$", "rating": 4}, {"title": "price quality delivery", "text": "Date of experience: October 10, 2023", "rating": 4}, {"title": "I wish you had ship to store option", "text": "Date of experience: October 12, 2023", "rating": 4}, {"title": "It was easy to find the things I need I…", "text": "It was easy to find the things I need I just hate that I have to get most online items are not in stores", "rating": 4}, {"title": "User friendly website", "text": "Date of experience: October 09, 2023", "rating": 4}, {"title": "The whole shopping experience is easy…", "text": "The whole shopping experience is easy access, But I don't think you should ask for personal information without giving the Customer the total sum of their purchase.  I like to know the total before I completely check out, knowing your total enables you to add or subtract some items,something.", "rating": 4}, {"title": "Nice style on sale", "text": "Pink for October refresh my look", "rating": 4}, {"title": "I first went to my local store for the items to which they don’t have so my online purchase was easy. It would be nice to know if items are available in stores when purchasing.", "text": "Easy online purchase experience", "rating": 4}, {"title": "Love the originality!", "text": "Date of experience: October 06, 2023", "rating": 4}, {"title": "Ouick and easy", "text": "Ouick and easy! Should have free shipping for members though.", "rating": 4}, {"title": "Convenient way to shop quickly.", "text": "Date of experience: October 06, 2023", "rating": 4}, {"title": "Prices always awesome with wide…", "text": "Prices always awesome with wide varieties and styles.", "rating": 4}, {"title": "Ease of use", "text": "The ease of the website was great. Navigation with the filters was on point, I didn't have to go back, went directly to what I selected. I definitely recommend using the website!", "rating": 4}, {"title": "Great prices for what I’m looking for", "text": "Needed some jumpsuits at a reasonable price, I love the value", "rating": 4}, {"title": "The experience so far has bee good no…", "text": "The experience so far has bee good no problems… once I receive my boots will determine a five star rating….", "rating": 4}, {"title": "Great bargains.", "text": "The site is easy to navigate and there are lots of sales.", "rating": 4}, {"title": "Smooth process", "text": "Easy access and everything was explanatory..", "rating": 4}, {"title": "Convenient", "text": "Great convenient option for picking up package. Mobile website needs more options for filtering and sorting items for specific size color etc. when using the search bar.", "rating": 4}, {"title": "Very good found what I was looking for", "text": "Date of experience: September 30, 2023", "rating": 4}, {"title": "It was a good experience however they…", "text": "It was a good experience however they could have rang the doorbell to notify me that my package had arrived.", "rating": 4}, {"title": "Best clothes on a budget.", "text": "Date of experience: September 28, 2023", "rating": 4}, {"title": "Excellent sale prices.", "text": "Date of experience: September 28, 2023", "rating": 4}, {"title": "👍🏾👍🏾👍🏾👏🏾", "text": "👍🏾 👍🏾 👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾👏🏾", "rating": 4}, {"title": "Sell items @ a good price but shipping…", "text": "Sell items @ a good price but shipping is extremely expensive", "rating": 4}, {"title": "Rainbow offers a unique shopping experience", "text": "Rainbow offers a unique shopping experience online. Their website has trendy fashion clothing at an incredibly low price point. I appreciate the websites ability to bring up different styles that are similar to current searches and suggest matching items for an outfit. In addition, the return process is simply because your items come with a prepaid return label. One area they could possibly improve on would be just modifying their search engines to include more detailed search options.", "rating": 4}, {"title": "Simple easy only thing the size wasn’t…", "text": "Simple easy only thing the size wasn’t available I had to choose a different size", "rating": 4}, {"title": "I would have given 5 stars but a lot of…", "text": "I would have given 5 stars but a lot of stuff I wanted was out of stock.   I wouldnt shop in the stores as well in the Greater Cleveland, Ohio area.  Clerks are rude.  Move them out of there and replace them or have it strictly online.  AI will soon replace these clerks, anyway.", "rating": 4}, {"title": "I get good products for good prices", "text": "Date of experience: September 17, 2023", "rating": 4}, {"title": "Great validating website", "text": "Very easy to navigate & the online shop has some really cute clothing.", "rating": 4}, {"title": "Got my sizes", "text": "Date of experience: September 13, 2023", "rating": 4}, {"title": "Great Sale", "text": "The website is very user-friendly and I love the affordable prices!!", "rating": 4}, {"title": "Still Hip like it was 20 years ago!!!", "text": "Date of experience: September 12, 2023", "rating": 4}, {"title": "Price is right", "text": "Date of experience: September 11, 2023", "rating": 4}, {"title": "I'm giving a 4 Stars because I've been a…", "text": "I'm giving a 4 Stars because I've been a customer almost 20 years. I couldn't retrieve my cart 🛒 items and had to keep starting over. Only 2 items I really liked I couldn't find once I was ready to pay.", "rating": 4}, {"title": "The quality of products", "text": "Date of experience: September 11, 2023", "rating": 4}, {"title": "I love it", "text": "Prices are great as well as products. Just needs to have more products in stock...they sell fast!", "rating": 4}, {"title": "Quality in fast shipping", "text": "Date of experience: September 09, 2023", "rating": 4}, {"title": "Love the selection of clothes!", "text": "Love the selection of clothes.  The website is easy to navigate.  Haven’t received my order yet and I can’t wait to get my order!", "rating": 4}, {"title": "Very quick and easy process.", "text": "Very quick and easy process. I would love to see a quick add option where I can just  add from the main page instead of going into the product.", "rating": 4}, {"title": "Good Experience!", "text": "My experience is always good online.They always have good fashion for me. Also they stay in contact with you through email pertaining to sales that have good affordable prices.What I would like to see with the online shopping is to fix an issue with me. When it comes to picking a size in the options why not blank out a size if not available instead of it being highlighted.  This makes me think it is available....then I get excited....then disappointed!Otherwise I am a happy customer ALWAYS. OH ...I love that the shipping is super fast.Your loyal Customer...Ms D❤", "rating": 4}, {"title": "Not all shoe choices had my size…", "text": "Not all shoe choices had my size available.", "rating": 4}, {"title": "Good experience but the website…", "text": "Good experience but the website wouldn’t accept my virtual card", "rating": 4}, {"title": "Great selection", "text": "Date of experience: September 06, 2023", "rating": 4}, {"title": "Everything !", "text": "Date of experience: September 03, 2023", "rating": 4}, {"title": "Decent prices!", "text": "My experience was a bit frustrating. Ayer I found the items I liked, I favorited them as I continued looking. When I was ready to make my purchase, my items weren't on my wishlist. I had to go back through to find the items again.", "rating": 4}, {"title": "La qu Lia fast great purchase payment method thank you both and Capital One", "text": "Beautiful fashion week work up and purchase 3 outfits driving the show. Precise payments and shipping tell you more when it comes in. Trendy", "rating": 4}, {"title": "online experience was good", "text": "online experience was good, was shock that shipping to the store was not an option.", "rating": 4}, {"title": "I love Rainbow", "text": "I really enjoy shopping on the rainbow website. The sale items are my favorite!", "rating": 4}, {"title": "Great discounts, BUT...", "text": "Great discounts, find things fairly easy, but where is the chat assistance when needed.  I would have loved to know how to get my packages to my local store on the site, but couldn't find the option, also too high cost for shipping.  I like Rainbow, but keep me as a more consistent customer on and offline PLEASE.", "rating": 4}, {"title": "I consider the check out process should had been just that checkout. However, many pop ups regarding survey and offers were included to proceed.", "text": "To many questions and offers during check out time.", "rating": 4}, {"title": "Great buys", "text": "I like the style and price of some of your merchandise", "rating": 4}, {"title": "I was looking for a few items for my…", "text": "I was looking for a few items for my vacation. I found a good selection of outfits I liked", "rating": 4}, {"title": "Ship to us 🇨🇦", "text": "Wish they would ship to Canada, atlease in the Niagara Region. Close to the border. 🇨🇦", "rating": 4}, {"title": "Perfect 👌🏾", "text": "Hey good night. I got exactly what i wanted thanks much see you'll soon.", "rating": 4}, {"title": "Love that you stock my fav designer …", "text": "Love that you stock my fav designer  mlle Gabrielle.  In wrap dresses and other dresses", "rating": 4}, {"title": "I love Rainbow low prices!", "text": "Great price for boots!", "rating": 4}, {"title": "Easy to order", "text": "Date of experience: August 20, 2023", "rating": 4}, {"title": "I liked that I received an email…", "text": "I liked that I received an email regarding the sale. Although my size sold out quickly in some of my liked items.", "rating": 4}, {"title": "It was a good experience and I like the…", "text": "It was a good experience and I like the options", "rating": 4}, {"title": "Affordability and stylish clothing is…", "text": "Affordability and stylish clothing is why I think this is and was a great shopping experience. Lots of choices would like to have see or read a lil more reviews but I was able to make somewhat informed decisions.", "rating": 4}, {"title": "Prices for sure", "text": "Prices for sure. Available. Delivery time.Need to see more sizes available", "rating": 4}, {"title": "Very easy app to use", "text": "Date of experience: August 17, 2023", "rating": 4}, {"title": "great prices great fabrics wash and dry…", "text": "great prices great fabrics wash and dry well no cleaners need only wish the shipping was faster spoiled with Amazon next day or most 3 days", "rating": 4}, {"title": "shipping is too high", "text": "Date of experience: August 16, 2023", "rating": 4}, {"title": "Did not have the color I want in my size", "text": "Date of experience: July 07, 2023", "rating": 4}, {"title": "I love the site and will continue to…", "text": "I love the site and will continue to shop!", "rating": 4}, {"title": "Good experience and nice sales clerks ⭐️", "text": "Date of experience: August 15, 2023", "rating": 4}, {"title": "Cute clothes just not enough choices", "text": "Date of experience: August 15, 2023", "rating": 4}, {"title": "Ordering was easy", "text": "Ordering was easy, including using credit card.", "rating": 4}, {"title": "Very easy to navigate and prices were Great..…", "text": "Very easy to navigate and prices were great..", "rating": 4}, {"title": "Customer request :)", "text": "Been shopping with Rainbows since forever, great prices, quality clothes however I did notice that majority of the style of clothing we're crop tops and night club styled outfits. Rainbows PLEASE step the style up. You used to have all of the fly fashions. It's a lot of sexy pieces which is ok, but can we get more sexy with a touch of class? Please bring back the grown and sexy style. Your store could use more than just the \"Junior\" style fashion. Thank you.", "rating": 4}, {"title": "Shopping Online Availability", "text": "Shopping online and having a large variety of shoe sizes available is awesome! I will be ordering again.", "rating": 4}, {"title": "I have been invited to an Engagement…", "text": "I have been invited to an Engagement All White Party.  I've been searching for a pretty white dress, and you have it.  So, I placed the order.  The web site was user friendly.  Hopefully, it will fit and look great.  Thanks!", "rating": 4}, {"title": "Awesome prices!", "text": "Awesome prices!! Easy payment choices . Except u ask for payment plan and the next day the whole amount comes out of ur checking account!! Not happy about that! Some things repeat too much when ur shopping.", "rating": 4}, {"title": "Love", "text": "I love the variety of clothes! I wish we had a store in Roanoke, VA.", "rating": 4}, {"title": "wish their was a 15 percent coupon at…", "text": "wish their was a 15 percent coupon at chevk out", "rating": 4}, {"title": "Did not get the 10 percent discount…", "text": "Did not get the 10 percent discount other then that its fine.Thanks", "rating": 4}, {"title": "Site was easy to use.", "text": "Site was easy to use.There were great prices!!!!Check out was fast and easy as well!!Can't wait to shop here again!!!", "rating": 4}, {"title": "Ease of purchase you should put more…", "text": "Ease of purchase you should put more stores out.", "rating": 4}, {"title": "Everything fit perfectly..and I like…", "text": "Everything fit perfectly...and I like every items in one bag good for because I live overseas I don't pay much for customs When they are ready for pickup", "rating": 4}, {"title": "Great sale!!", "text": "Date of experience: August 04, 2023", "rating": 4}, {"title": "Everything was incredibly easy", "text": "Everytjing was incredibly easy to use on the internet., but the 10% dicount. I could not find out how to it. Thank you though, it was awesome!!!...", "rating": 4}, {"title": "The shoes were really nice", "text": "The shoes were really nice; however, I wish they had my size for the sandal I was looking for.", "rating": 4}, {"title": "Having decent prices", "text": "Date of experience: August 03, 2023", "rating": 4}, {"title": "IT IS EASY TO VIEW", "text": "Date of experience: August 03, 2023", "rating": 4}, {"title": "OVERALL I HAD A GOOD EXPERIENCE WITH MY…", "text": "OVERALL I HAD A GOOD EXPERIENCE WITH MY ONLINE PURCHASE FOR IT TO BE MY FIRST TIME I WILL ORDER AGAIN", "rating": 4}, {"title": "IMy Search have been searching for Green Sandals…", "text": "I have been searching for Green Sandals all Summer Thanks Rainbow 🌈", "rating": 4}, {"title": "It could have been better if there was…more plus size options", "text": "It could have been better if there was more plus size options. 3x and 4x please.", "rating": 4}, {"title": "Great selection", "text": "Date of experience: August 01, 2023", "rating": 4}, {"title": "Love the variety", "text": "I use Rainbow most of the tine so the experience has not wavered in any way from my past experiences.", "rating": 4}, {"title": "Sometimes you find the right size and…", "text": "Sometimes you find the right size and other things", "rating": 4}, {"title": "I didn't have to drive to the store to…", "text": "I didn't have to drive to the store to view my favorite jeans. I guess everyone loves them....most of everything I looked at was out of stock.", "rating": 4}, {"title": "It’s always a pleasure to shop with…", "text": "It’s always a pleasure to shop with Rainbow.Quick and easy affordable prices", "rating": 4}, {"title": "Nice variation of fashions for plus…", "text": "Nice variation of fashions for plus sized women….", "rating": 4}, {"title": "I had no issues ordering my items.", "text": "Date of experience: July 28, 2023", "rating": 4}, {"title": "The website is helpful and designed…", "text": "The website is helpful and designed well. It as easy to find what i was looking for. Wished that \"shop by occasion\" was in every category. I wanted to shop for work clothes only for example.", "rating": 4}, {"title": "Great shopping experience", "text": "Website was easy to use, and felt very secure.", "rating": 4}, {"title": "Always on time!", "text": "My experience was fine. I have enjoy shopping with or at Rainbows stores for many years it has always been my store, there’s always something for me! You have catered to the big girls for quite sometime, and it’s much appreciated!💋❤️🥰", "rating": 4}, {"title": "Never really had any issues ordering…", "text": "Never really had any issues ordering from rainbows been a fan of the in-store places so glad the online lives up", "rating": 4}, {"title": "Free shipping", "text": "The prices are good but the shipping is not!!!", "rating": 4}, {"title": "It was good and will order again as long as my order ships on time since I paid extra", "text": "It was good and will order again", "rating": 4}, {"title": "It’s a lot easier then going to the…", "text": "It’s a lot easier then going to the store", "rating": 4}, {"title": "Good prices", "text": "Good prices, variety cloth and colors.  Shipping expensive to be in US.", "rating": 4}, {"title": "perfect fit!", "text": "yeah well this company is where I shopped at in warwick when I was actually with someone who use to shop here with his children!", "rating": 4}, {"title": "On line shopping", "text": "I like going  the web and finding things  that I didn't see in the store", "rating": 4}, {"title": "Great experience", "text": "Date of experience: July 25, 2023", "rating": 4}, {"title": "Everything was good but when it came to…", "text": "Everything was good but when it came to getting a receipt for my in store return was a little confuseing", "rating": 4}, {"title": "User friendly", "text": "Date of experience: July 22, 2023", "rating": 4}, {"title": "Dress for Less", "text": "I got good deals on some dresses for the summer. My sizes were in stock I can’t wait to receive them.", "rating": 4}, {"title": "Affordable trendy items", "text": "Love the prices and some of the selections, only issue is the shipping takes a while before I receive my order.", "rating": 4}, {"title": "good selection love the prices.", "text": "Date of experience: July 19, 2023", "rating": 4}, {"title": "I found what I needed", "text": "Date of experience: July 16, 2023", "rating": 4}, {"title": "Good reminders", "text": "Date of experience: July 15, 2023", "rating": 4}, {"title": "Quick Find", "text": "I’m usually able to find something cute and colorful to wear while hanging out with friends and family.", "rating": 4}, {"title": "My delivery was on time and I got what…", "text": "My delivery was on time and I got what I ordered. Thank you", "rating": 4}, {"title": "Easy to sort and find what I needed", "text": "Easy to sort and find what I needed.  Very good prices.", "rating": 4}, {"title": "Larger Sizing Availability Request", "text": "The only reason I gave my overall experience four starts versus five is due to a lot of the clothing items I wanted were sold out in my size. I’m a 3X/4X. My size is usually one of the first to sell out. I would really love to see more availability in that size range or offer a restock alert option if it’s a great seller!", "rating": 4}, {"title": "Awesome", "text": "My experience with online shopping Rainbow for the first time was great. I'd rather shop online. In store never hardly have my shoe size, but online did. So I will be shopping more online.", "rating": 4}, {"title": "Variety of low-cost women's clothing", "text": "Variety of women's clothing at a fair price", "rating": 4}, {"title": "I love your guys clothes they are cute…", "text": "I love your guys clothes they are cute and comfortable but the one thing I don’t like about your store is that you don’t have winter clothes such as hoodies, Uga boots and sweats. But overall a 4/5 for me..I feel like if you add a winter clothes section with hoodies,boots,etc you would definitely be a 5/5", "rating": 4}, {"title": "My experience is always good shopping…", "text": "My experience is always good shopping online with you but I hate that I just can't go back to the original page to just see more clothing I have to almost log out and come back in", "rating": 4}, {"title": "Need More 4X Sizes Please", "text": "The clothing line offers a lot of great styles, but the sizing of the clothing is not exactly true to size. It would be great if the local store in my area would carry more items that go up to 4X.", "rating": 4}, {"title": "Easy movements through the site", "text": "Easy movements through the site.  Easy checkouts.", "rating": 4}, {"title": "I tried to used the coupon online and…", "text": "I tried to used the coupon online and was not possible, no idea why", "rating": 4}, {"title": "I like Rainbow Shops items because they…", "text": "I like Rainbow Shops items because they are inexpensive and decent quality, however I would love if they had cuter fashion for Plus Size women in different age ranges. It's difficult to find cute, casual and comfortable clothing for Plus Size women.", "rating": 4}, {"title": "It's always a pleasure shopping with…", "text": "It's always a pleasure shopping with you guys 😊", "rating": 4}, {"title": "Prices are great how ever being first…", "text": "Prices are great how ever being first time the code would not accept should be standard code", "rating": 4}, {"title": "Prices were great however when I tried…", "text": "Prices were great however when I tried to enter a discount code it would not accept. It should be a easier standard code to enter.", "rating": 4}, {"title": "I received all of my items", "text": "I received all of my items. However, I could not fit either pair of the shoes I purchased. They were too small. I returned them to the store.", "rating": 4}, {"title": "A size 12 women shoe.You need more in the stores please", "text": "Need more size 11wide shoes in store and on line. Size 12 women shoes in stores in Richmond va please", "rating": 4}, {"title": "The checking out process was really good", "text": "Date of experience: June 29, 2023", "rating": 4}, {"title": "Love that my size was available in what…", "text": "Love that my size was available in what I wanted. The site is very friendly user.", "rating": 4}, {"title": "Great service", "text": "Great experience", "rating": 4}, {"title": "I made a purchase w Rainbow shop", "text": "I made a purchase w Rainbow shop , ordering was easy I order 2 pairs of sandels, I'm waiting to see about the shipping and quality of the shoes", "rating": 4}, {"title": "I love shopping at Rainbow shops", "text": "I love shopping at Rainbow shops. However as a long term customer I would love to receive coupons.I would also love to see more tops for the office workers.", "rating": 4}, {"title": "It was easy to order from your website.", "text": "Date of experience: June 29, 2023", "rating": 4}, {"title": "Sometimes it’s hard for me to find…", "text": "Sometimes it’s hard for me to find shoes my size. I’m a woman who wears size 12 shoe. Usually my shoes are never comfortable or cute. So thank you rainbow for making me a little bit more fashionable for my cruise.", "rating": 4}, {"title": "I dont expected Tax spending over $75", "text": "I dont expected Tax after I've  spent over $75", "rating": 4}, {"title": "Most of the stuff I saw on instagram…", "text": "Most of the stuff I saw on instagram I'm not finding on the website", "rating": 4}, {"title": "I think there should have been an…", "text": "I think there should have been an option to pickup at stores.", "rating": 4}, {"title": "Great place to find something quickly.", "text": "Being a former employee and still a customer, I know Rainbow has a good selection, especially when your looking for something to wear when others stores don't quite have what your looking for. It's my go to place when I'm in a hurry and need something to wear thats cute and affordable without having to go i to multiple stores or a mall. I'm glad online ordering is available now, when I worked there only certain stores had certain items, im so happy the company has grown.", "rating": 4}, {"title": "Meme", "text": "Love the options just wish some of the popular items make returns", "rating": 4}, {"title": "So easy to buy and great deals", "text": "Date of experience: June 27, 2023", "rating": 4}, {"title": "Pricing is great", "text": "Pricing is great, definitely affordable. I would appreciate not only more options, but more MODEST options in the women's department.", "rating": 4}, {"title": "Everything went well", "text": "Everything went well. I just think you charge too much for shipping.", "rating": 4}, {"title": "Clear and concise direction", "text": "Clear and concise direction, sizes clearly qualified and simple to use.", "rating": 4}, {"title": "Price reasonable", "text": "Them price is affordable clothes good material", "rating": 4}, {"title": "Don't know yet 1st order!", "text": "Date of experience: June 21, 2023", "rating": 4}, {"title": "They have nice clothes", "text": "They have nice clothes, but the problem is you can't try the clothes on in the fitting room.", "rating": 4}, {"title": "Well done had lots to offer", "text": "Date of experience: June 21, 2023", "rating": 4}, {"title": "Easy to maneuver", "text": "Easy to maneuver, easy to pay and easy to view. However I gave 4 stars because I want this company to allow reviews of the items. There's no reviews.", "rating": 4}, {"title": "You had my comfortable sandal size in…", "text": "You had my comfortable sandal size in all but one. I just ordered my actual size.", "rating": 4}, {"title": "Everything I wanted they had in stock", "text": "Made checkout quick and easy", "rating": 4}, {"title": "Nice  Work", "text": "Good. Nice work", "rating": 4}, {"title": "Great experience!", "text": "Date of experience: June 18, 2023", "rating": 4}, {"title": "Wishlist?", "text": "Too confusing accessing my account through the email or just through a search engine. Wishlist would not be there unless I logged in through the email. When I logged in through Safari my wishlist was not the same. I eventually was able to place my order. A percentage may have been user error. Nevertheless I was able to place my order.", "rating": 4}, {"title": "I love the low prices alone whith the…", "text": "I love the low prices alone whith the styles of clothe you offer I can look on line take my time and choose what I want to buy without the long long and all the hustle and bustle.        Thank you", "rating": 4}, {"title": "You the best!!", "text": "Great products and affordable prices.", "rating": 4}, {"title": "Got everything i want the price is…", "text": "Got everything i want the price is amazing", "rating": 4}, {"title": "Alike the dresses", "text": "Date of experience: June 15, 2023", "rating": 4}, {"title": "A lot of items but only for 1body type", "text": "Date of experience: June 14, 2023", "rating": 4}, {"title": "Happy with my selections", "text": "My experience was great because my size was available in multiple colors, variety is important. I would love to see a better selection in sizes 5x and 6x there's very little too choose from in those sizes.", "rating": 4}, {"title": "Hello I've really never shop @Rainbow…", "text": "Hello I've really never shop @Rainbow Shop nice items you can make looks like hundreds bucks outfits I'm a customer online stores too crowded no walking space enjoy online BETTER.", "rating": 4}, {"title": "Thank you for offering Klarna", "text": "Thank you for offering Klarna. It was not possible to join your mailing list from the home page of rainbowshops.com so that was disappointing as a friend had indicated that discounts on first orders were possible? I completed my first order and I love how everything I ordered shows up with my confirmation number by email. Thank you for indicating sizes shown on models in photos of items on your website and multiple angles. I was sad many items were not available in my size (M),(L).", "rating": 4}, {"title": "Fairly good variety", "text": "Fairly good variety; however, clothing is more geared to the younger consumer. There are not very many choices for the older customer.", "rating": 4}, {"title": "My honest opinion", "text": "The site was easy....I just wish there were better choices for boys clothes.....the girls have plenty of cute stuff while the boys stuff looks like Salvation Army style... like y'all said \"here you go..it is what it is 🤷🏾‍♀️\"", "rating": 4}, {"title": "Wish there were reviews to assist with…", "text": "Wish there were reviews to assist with purchasing", "rating": 4}, {"title": "RAINBOW HAS A LOT OF CUTE CLOTHES FOR…", "text": "RAINBOW HAS A LOT OF CUTE CLOTHES FOR EVERY OCCASION AT REASONABLE PRICES,HOWEVER SOMETIMES THE SIZE IS A LITTLE OFF.A LARGE IS SOMETIMES AN EXTRA LARGE AND A MEDIUM REALLY IS A SIZE LARGE AND THESE ARE U.S AMERICAN SIZES.OFTEN I HAVE TO SIZE DOWN BUT THE CLOTHES ARE REALLY NICE.", "rating": 4}, {"title": "Good clothes with an okay online shop", "text": "Good clothes with an okay online shop. They still have a room to improve so right nos it's 4 for me.", "rating": 4}, {"title": "Satisfied", "text": "My shopping experience on this site was pretty good. There isn't any lag and like there is on other sites.I was. Able to find my size in other options which I like.", "rating": 4}, {"title": "Out of sizes", "text": "Out of sizes in plus size", "rating": 4}, {"title": "You finally have an online store!", "text": "You finally have an online store. You can have lower prices though. There are things in the store that are not online as well, like the various colored tank tops I usually purchase In the stores. Overall, I had a good experience  with the online shopping and plan to do it again.", "rating": 4}, {"title": "Great clothes", "text": "Date of experience: June 06, 2023", "rating": 4}, {"title": "Decent prices quality as well", "text": "Decent prices quality as well. The only complaint is pay later is a rip off tells you one price then went up on it after checking out", "rating": 4}, {"title": "Rainbows has the best clothes but the…", "text": "Rainbows has the best clothes but the shipping is too much", "rating": 4}, {"title": "Great store", "text": "Good store good plus size products", "rating": 4}, {"title": "Untitled", "text": "Some items I wanted wasn't in my size, had to go with others options.  It's hard to order items when work schedule makes it hard. When I come back to cart items are gone or sold out. Great selection on clothes.", "rating": 4}, {"title": "So far my experience was great", "text": "So far my experience was great! Found everything I needed and site was easy to navigate. Just waiting on my shipment!", "rating": 4}, {"title": "I really love the idea that my items…", "text": "I really love the idea that my items were affordable and of great quality.  The Rainbow shop has many different categories you can choose from to select affordable products. The prices are great, even if you're not buying the items on sale. My delivery date was off,But otherwise I'm satisfied. Thank you!", "rating": 4}, {"title": "The first time I tried to place my…", "text": "The first time I tried to place my order it kept declining my card I dot know why then the second time which was today an item I had sold out", "rating": 4}, {"title": "i found what i want.", "text": "Date of experience: June 03, 2023", "rating": 4}, {"title": "Great items", "text": "Great items. Hard time finding a Dress with a Name and Item number,but I eventually found it.", "rating": 4}, {"title": "The initial shopping experience was…", "text": "The initial shopping experience was fine . Otherwise the website was a little difficult to navigate, but that may just be my inexperience. I’m very sure I’ll be shopping again.  Thank you, WMS", "rating": 4}, {"title": "The Online Shopping Process", "text": "I appreciate that it is remarkable easy to order items on Rainbow Shops online website. What I do not like is that free shipping is not extended to totals up to $25.", "rating": 4}, {"title": "I had trouble logging in and I already…", "text": "I had trouble logging in and I already have an account but I had to create a new one then it would not let me log in.", "rating": 4}, {"title": "Experience was good", "text": "Experience was good. Wish that the prices were a little better. They were just ok. The styles are nice. Thank you.", "rating": 4}, {"title": "So far so good.", "text": "Date of experience: May 31, 2023", "rating": 4}, {"title": "Ease of shopping and check out process.", "text": "Date of experience: May 28, 2023", "rating": 4}, {"title": "All my items came in as ordered", "text": "All my items came in as ordered. I wasn't aware of the store policy that wouldn't accept items for return or exchange by using the order number from the phone. As much as I order from Rainbow I've never had an issue and now I don't think I will continue to do online business with you.", "rating": 4}, {"title": "Rainbow have all sizes", "text": "It was fast.the clothes was good quality", "rating": 4}, {"title": "The availability of the merchandise is…", "text": "The availability of the merchandise is very good.", "rating": 4}, {"title": "Great!", "text": "I like that it’s a wide variety of options to choose from as a customer.", "rating": 4}, {"title": "My size was available", "text": "Date of experience: May 22, 2023", "rating": 4}, {"title": "Low stock", "text": "I had a item in my cart didn't know it was out of stock till I was ready to check out so I had to go back and shop for something to replace that item..So I wish it showed out of stop before I was ready to check out", "rating": 4}, {"title": "Happy Customer", "text": "Easy to order and the prices are reasonable.", "rating": 4}, {"title": "Very nice for the low price", "text": "Very nice for the low price. Shipped quickly.", "rating": 4}, {"title": "Need more clothes that doesn’t look see…", "text": "Need more clothes that doesn’t look see through and not looking hoeish clothes . Add more class", "rating": 4}, {"title": "They are quick and from what I see good quality.", "text": "I would have given 5 stars unfortunately one of my items wasn't the right size I rechecked to be sure it wasn't my mistake but not sending it back for one item I'll absorb the loss. Besides that it is a terrific company fast service, they keep you notified about  your order. Will definitely shop here again!", "rating": 4}, {"title": "No problems", "text": "No problems, but it would be easier if you all had more filters", "rating": 4}, {"title": "The only issue I have is the images in…", "text": "The only issue I have is the images in my order is not what I ordered", "rating": 4}, {"title": "Found some cute styles for my grand baby", "text": "Date of experience: May 15, 2023", "rating": 4}, {"title": "It gives you a variation of similar …", "text": "It gives you a variation of similar  products similar to what you're searching.    I can purchase clothing, shoes and accessories to match and then go to kids and pick out a outfit and sandal to match", "rating": 4}, {"title": "Great for finding JUST the right clothing and accessories!", "text": "I really enjoy shopping on Rainbow.com, almost as much as I love to browse in the store... But when you have a busy schedule like mine, its great to know that I can get the same great items for the same amazing prices. I only caution that you know exactly what you need, or you'll get more than you originally meant to... but with the savings, how can any fashionista pass these amazing prices by?", "rating": 4}, {"title": "Easy shopping experience", "text": "Easy shopping experience. We'll see what the quality is.", "rating": 4}, {"title": "Usually easy", "text": "Fast easy.  But did nit tell me what item I added that could not ship to my address would have been nice not to havr to guess", "rating": 4}, {"title": "You guys need to offer more free…", "text": "You guys need to offer more free shipping or provide discount codes", "rating": 4}, {"title": "I LIKE RAINBOW ONLINE WITH THE…", "text": "I LIKE RAINBOW ONLINE WITH THE EXCEPTION OF NEEDING A BIGGER SELECTION FOR PLUS SIZE WOMEN. I FOUND MORE ITEMS ONLINE THAN I DID IN STORE! CHECK OUT WAS EASY TO.", "rating": 4}, {"title": "Great variety", "text": "I really enjoy the variety of merchandise you have. I’ve purchased from you before and was not disappointed!!", "rating": 4}, {"title": "I love shopping at Rainbow", "text": "I love shopping at Rainbow, but a lot of times you don’t have the size I want. You would have the pants but not the shirt or you’ll have the shirt and not the pants in the right size", "rating": 4}, {"title": "I’ve always loved Rainbow, the bargain store", "text": "I’ve always loved Rainbow, good, reasonable store!", "rating": 4}, {"title": "Great prices easy on line ordering and…", "text": "Great prices easy on line ordering and so far delivery has been on time and correct..", "rating": 4}, {"title": "Where can you get a neat pair of…", "text": "Where can you get a neat pair of sneakers just for few days of walking? Hitting Vegas walk ways! You'll need comfort out there I'm told..lol", "rating": 4}, {"title": "The price", "text": "The price, and the style of what I was looking for, not old fashioned.", "rating": 4}, {"title": "I was able to find what i was looking…", "text": "I was able to find what i was looking for when it was not in the store in my size. I often found that what i was looking for was cheaper online. sometime i had to be creative at times to find what i was looking for because I didn't have the right description.", "rating": 4}, {"title": "very good", "text": "very good , easy to use", "rating": 4}, {"title": "My sizes run out to fast 14", "text": "Date of experience: May 06, 2023", "rating": 4}, {"title": "It’s also easy and good quality clothes", "text": "Date of experience: May 05, 2023", "rating": 4}, {"title": "Out of several items in my size.", "text": "What made my experience good was the fact you have so much to offer. But what I was disappointed with was my size was not in stock for several things I wanted. But overall the sight was easy to use unlike some others I've been on.", "rating": 4}, {"title": "Thank you Rainbow Shops", "text": "Thank you Rainbow Shops. Good prices and stylish clothes. Shipping cost is a little high.", "rating": 4}, {"title": "Just the price", "text": "Date of experience: May 03, 2023", "rating": 4}, {"title": "Very easy shopping and easy placing…", "text": "Very easy shopping and easy placing order online", "rating": 4}, {"title": "Can always find what you need.", "text": "They pretty much have what you need for any occasion. Decent prices.", "rating": 4}, {"title": "Love the plus size", "text": "Date of experience: May 04, 2023", "rating": 4}, {"title": "Best clothes ever", "text": "I really love rainbow clothing for my daughter and I.n my favorite store.", "rating": 4}, {"title": "It was very easy to navigate the site", "text": "It was very easy to navigate the site. The plus sizes are stylish on like other sites I have seen. Rainbow plus sizes are sexy not boring.", "rating": 4}, {"title": "Kids clothing", "text": "I was happy to see the selection available,  but wish you had more of the styles in boys sizes 8-10.", "rating": 4}, {"title": "My go to retailer", "text": "Rainbow always have cute little outfits and shoes. Always my go to when I need something quickly. Sometime you don't have my size or color but I can get past that. I get my purchase on time and I'm never disappointed when I receive it.", "rating": 4}, {"title": "Affordable", "text": "Love the discounted prices and was able to find several things in my size.  Also free shipping on orders above $75.00.", "rating": 4}, {"title": "My blue and orange sandal's will make a difference …", "text": "I like rainbow shop things great prices and value in your products. I will shop with you again, I will get some coupons. With my new order. Thank you happy spring in 2023.", "rating": 4}, {"title": "I love Rainbow but a few things that I…", "text": "I love Rainbow but a few things that I have ordered was missing strings or looked irregular but over all most of my stuff I love.", "rating": 4}, {"title": "It's was a good experience", "text": "Date of experience: April 30, 2023", "rating": 4}, {"title": "Looking for comfy cute outfits for work…", "text": "Looking for comfy cute outfits for work and play. Found a few items, would have loved to find a active wear jacket that would have matched up with the sleeveless active wear top and leggings. Shoes I wanted size was sold out. Other than, I enjoy shopping with Rainbow, low price for quality apparel", "rating": 4}, {"title": "So far, so good", "text": "So far, so good.  You received my order quickly.  Now we'll see how fast it ships.", "rating": 4}, {"title": "I’m glad Rainbow now offers discounts…", "text": "I’m glad Rainbow now offers discounts however I wish shipping wasn’t so expensive or if there was at least a free “ship to store” option.", "rating": 4}, {"title": "I like the low prices and variety of…", "text": "I like the low prices and variety of clothing available", "rating": 4}, {"title": "Wide variety of selections and sizes", "text": "Wide variety of selections and sizes.  Especially the collection of size 12 shoes for women.", "rating": 4}, {"title": "Love shopping at rainbow on line", "text": "Date of experience: April 26, 2023", "rating": 4}, {"title": "I enjoyed shopping online", "text": "I enjoyed shopping online just wished yall  had coupons", "rating": 4}]