[{"title": "Fast", "text": "Fast, no hassle, polite, all on all a very good service...", "rating": 4}, {"title": "Had an issue, but it was resolved", "text": "Received no help in obtaining my NIE. I specifically requested to be helped at getting an appointment at my local comisaría. Received a badly filled-in and incomplete form and no further assistance, despite having tried to contact them. A waste of 35 euros.Update: The misunderstanding has been resolved. I had sent an email on the date of my application, which had ended up in their spam folder. E-residence promptly set the refund in motion, which resolved the situation for me.", "rating": 4}, {"title": "The service was done quick, but informing is bad", "text": "The service was done really quick, I appreciate this.But when I pay almost 400 euro for the service with express delivery, I expect, that I will be immediately asked about the address of delivery, or at least will be asked about this when online version of documents will be sent. I had a very tight deadlines and wrote address without questions and said I need it ASAP. On that they replied, they understood. They didn't sent me a tracking number until I asked them. It's not okay to take extra 100 euro for express delivery and not tell you anything! However, they did the job and delivered it quick. Just would be nice a better service with deliveries, especially for such a high price.", "rating": 4}, {"title": "It took twice the promised time", "text": "I needed the translation for the tax representative NIF request. I asked if they know translation services and got no reply. I searched for other services and after a couple of days found some. only when I asked for some information for the other service I was told that e residence has a translation service as well. I accepted the offer with the information that it would take 7 days. I canceled the other service. Then it took 7 days longer means two weeks for the translation! The result I needed to make operations without NIF and have financial and medical impacts.------Edit update:The NIF number is now received and I also received follow up calls if all is fine. As we say in German \"Ende gut alles gut\"", "rating": 4}, {"title": "Seems to be good to be true... but it's not ! ", "text": "I was a little concerned about using these guys as their offer seemed almost too good to be true. However, it turns out that they do live up to their own hype. For a little over £150 GBP I obtained an NIE from my desk ! Even better, their promised 6 weeks turned into 10 days !  This won't suit many people as you can get an NIE much cheaper if you're already in Spain or live near a Spanish Consulate elsewhere in the world. For my own reasons it suited me to use this very convenient service. Two things to be aware of... they don't tell you in advance that you need a pdf of your whole passport ( luckily I have a friend with the right software ) and also the application requires a Spanish address. ( again, luckily I had a work-around) You only find this out once you've paid & are going through the application. So a little more transparency would be good.  This is why they're not a 5 star in my opinion. Otherwise, happy to recommend. ", "rating": 4}, {"title": "Quick Correspondence", "text": "I contacted them through WhatsApp and asked my questions prior to applying, and they answered all of my questions quickly, and accurately. Now, I'm just waiting to get my password from them. Thanks e-residence. Keep up the good work!", "rating": 4}, {"title": "Quiet impressive!!", "text": "I was quiet impressed by the thorough professionalism of E-residence while going through the processes to obtain a NIF, I was kept updated throughout and all my queries were promptly replied by the team. I have now applied through them  to obtain a Bank account, I am not very happy with the process till now.", "rating": 4}, {"title": "Overall good experience with e-residence", "text": "We had good experience with e-residence.com staff during our application for NIF and opening a bank account. The staff was very thorough, polite and responsive. We didn't pay for expedited service but we got the NIF in just a couple days via email. We paid extra to have the NIF certificates sent to us but that took many weeks and much longer than expected for them to send the certificates to us. The e-residence part of the opening a bank account was took about a month and right on e-residence's schedule. However, the contact at the bank has been very slow to respond to our communications and not what we expected. The bank contact has advised that the account is blocked for about 2 more months after opening while the bank does their due diligence. This is out of e-residence's control but their web site gave no indication of the two month block and the poor support from the bank contact. Overall, e-residence service was very good.", "rating": 4}, {"title": "Nif is going to be done exactly in a chosen amount of days", "text": "Everything was done in time. I would add some more information when and how shall I wait for my niff after request. Otherwise in sounds like - Your request is ready, and then you don't know whether everything goes well.", "rating": 4}, {"title": "good, not great.", "text": "The experience was relatively frictionless, though I did run into a few issues with the site which took about 24 - 48 hours to resolve. Here are a few things you should know ahead of time:- don't order the 50 euro delivery of your NIF if you plan on printing it out on a computer. I assumed the mailed version would be a formalized version of the NIF. It's not. It's been printed, put in an envelope, and sent to you for 50 euros. It is exactly what you would print out if they emailed it to you. - I gave myself the 10 day NIF option and it arrived in 24 hours (after my initial issues were solved), not sure if you really need the faster option. Good news though, it came super fast!- The chat help service option is actually a WhatsApp phone number that can take up to 12 hours to respond, so don't count on a quick chat response if you have any pressing questions. - You do need to use biometrics to verify your identity to acquire your NIF. This isn't explained prior to purchase, only after you purchase. It requires some photo matching and identification, but didn't ask for any further biometrics. It's a third party biometrics company and seemed safe and secure.", "rating": 4}, {"title": "Easy to use but what about security?", "text": "It feels very risky to submit all of my identification and digital signature to an online portal. But, the e-residence site was easy to use and was a referral. But, I might recommend more security assurances in the application process. It would be great to know who officially receives and processes my documents and how the info is stored or handled after the NIF is processed. It would also be great to have a specific representative to speak to about the security of my application documents.", "rating": 4}, {"title": "Very professional and helpfull along…", "text": "Very professional and helpfull along the whole process.", "rating": 4}, {"title": "Deeply appreciate for your prompt…", "text": "Deeply appreciate for your prompt replay and apology based on my previous review. Appreciated. I wish you all the best and thank you for support.", "rating": 4}, {"title": "Process was a little tricky but the outcome was positive", "text": "Some initial difficulty in signing documents using a mouse but once overcome, the NIF was received earlier than expected.  I would prefer it if payment was collected just before submission rather than at the beginning just in case it proves impossible to complete.", "rating": 4}, {"title": "Fast advices", "text": "Fast advicesBut many asks about address and language documents.You must Know that some countries are french speaking.", "rating": 4}, {"title": "e-residence has come through for me…", "text": "e-residence has come through for me several times now. No nonsense, fast, friendly service. And they get things done.", "rating": 4}, {"title": "Great service", "text": "Great service - fast response. Application process is kind of stressful, since there's a limited amount of time to do a lot of identification verification really quickly.", "rating": 4}, {"title": "Faster then expected", "text": "Faster then expected, got my FIN within 3 days, while i applied from Pakistan. This website can be trusted", "rating": 4}, {"title": "I understand that you represent me a…", "text": "I understand that you represent me a long the year but I don't understand in what exactly, please rply, regardsBenny", "rating": 4}, {"title": "It was fairly seamless process", "text": "It was fairly seamless process. However, would have loved it if they would have collected documentation first before charging the fee.", "rating": 4}, {"title": "Great experience", "text": "I'd really appreciate Telegram instead of WhatsApp as communication channel with the service. Or any other free option.Everything else is great.", "rating": 4}, {"title": "The timeline was fine but I requested…", "text": "The timeline was fine but I requested the online password and so far I received no information as to when I will receive ot", "rating": 4}, {"title": "Straight  forward communication", "text": "Straight  forward communication.  All happened on time and not a bad price ", "rating": 4}, {"title": "A good service overall", "text": "A good service overallCan shorten the waiting time for the 99£Option but overll a good service", "rating": 4}, {"title": "Do not answer for 3 weeks", "text": "I contacted with e-residence via WhatsApp for making a notarized power of attorney. We discussed what I needed and a manager promised to get in touch with me after consultation with attorneys but It hasn't happened for 3 weeks. I tried to communicate with them twice but they ignored my messages and didn't response.UPD 11/08/2022: The manager Dina contacted me after this review and suggested to solve all my issues that I described above.", "rating": 4}, {"title": "Quite costly but very effective", "text": "Quite costly (you know that in advance) but very effective and quick.", "rating": 4}, {"title": "We had some problems with to send the…", "text": "We had some problems with to send the form but it was solved by WhatsApp.", "rating": 4}, {"title": "Recommended", "text": "Very quick service and good customer service as well", "rating": 4}, {"title": "Nice support via WhatsApp.", "text": "Nice support via WhatsApp.Firstly NIF was with the mistake and only I checked this, not the company. Corrections were made in 1 week.", "rating": 4}, {"title": "Very good but not cheap", "text": "Everything was delivered very promptly without any complications but the price is very high so it is not for everyone.", "rating": 4}, {"title": "Timely and efficient", "text": "Timely emails.  Only issue the signature which must match the Personal ID documentation can be difficult to match when signing via a phone as their is little room when one has a long name to sign.", "rating": 4}, {"title": "Thks.for your help.", "text": "Thks.for your help.Good experience.", "rating": 4}, {"title": "Great communication and help from…", "text": "Great communication and help from e-residence. Thanks very much. Great service", "rating": 4}, {"title": "It would be great to have an online…", "text": "It would be great to have an online tracking process.Service was fast but having a way to check the status would've made the experience better.", "rating": 4}, {"title": "Smooth process", "text": "Smooth process. We did need to chase our NIFs at 10-days but it was done quickly after that.", "rating": 4}, {"title": "This is my second time using this…", "text": "This is my second time using this company. The first time was excelent but this time took longer that is why i did not gave 5 stars.", "rating": 4}, {"title": "No customer contact", "text": "Not very transparent about how to contact with additional queries. Otherwise very efficient. Would recommend.", "rating": 4}, {"title": "Process went mostly smoothly but would…", "text": "Process went mostly smoothly but would recommend a more detailed list of what steps to expect. For example, the biometric verification process is a little tricky. Would suggest detailed explanation of how the passport photo should look. I had to resubmit multiple times. Thank you.", "rating": 4}, {"title": "easy to use service", "text": "Good, quick turnaround user-friendly service!", "rating": 4}, {"title": "The service has been timely delievered…", "text": "The service has been timely delievered (which is rare case in Portugal). The onboarding is 100% online and fully automated. The WhatsApp online support is human-run, fast and efficent. The only drawback is that the online form for ordering services is somewhat confusing (so in may case the order needed to be corrected after placing and took some extra time and effort for follow-up e-mail correspondence)", "rating": 4}, {"title": "Getting our NIF made easy.", "text": "We used this service and received our NIF numbers within the 10 days. We went through the whats ap chat to get the NIF documents in PDF. If we had not had Whats Ap we wonder how we would get them as they were not in the email that said our NFR were ready.  Maybe they were going to forward later and we were just impatient. Anyway we will be happy to use them again for our NHR's when the time comes.", "rating": 4}, {"title": "quick and efficient service", "text": "Really quick and efficient service. Paid for the 5 day service and got my NIF in 4. Using WhatsApp to answer queries was really helpful. Only reason for not scoring 5 is that I didn’t receive a confirmation email when I placed my order, so I was a bit nervous if my order had actually been received.", "rating": 4}, {"title": "It'll be great to get more information…", "text": "It'll be great to get more information about process during it", "rating": 4}, {"title": "Great service that takes all the…", "text": "Great service that takes all the hustle, and saves you hours.The only problem that I experienced was it took much longer than the 3 days that was advertised.", "rating": 4}, {"title": "A few documents to be signed but other…", "text": "A few documents to be signed but other than that a straight forward service , got my NIF within 48hrs. Thank you", "rating": 4}, {"title": "Happy with service!", "text": "Date of experience: May 22, 2023", "rating": 4}, {"title": "I got a NISS in five working days:)", "text": "Date of experience: December 02, 2022", "rating": 4}, {"title": "Average", "text": "Image of document was very pale. When I asked how can get original I had to wait an answer for to long.", "rating": 4}, {"title": "Change your verify system", "text": "HiYour service is nice But your verify  is too hard , you have to easer your system.", "rating": 4}, {"title": "Good communication but still waiting…", "text": "Good communication but still waiting the password.", "rating": 4}, {"title": "Accurate and fast.", "text": "Web page was good and got all info needed.", "rating": 4}, {"title": "Helpful!", "text": "Helpful!It really helps me.", "rating": 4}, {"title": "My payment was accepted before I was…", "text": "Process for opening a bank account not entirely smooth but currently progressing.", "rating": 4}, {"title": "Hard to communicate", "text": "Hard to communicate. They do not reply for mails and phone calls.", "rating": 4}, {"title": "Good", "text": "Good, rapid respose. The facial recognition software did not work for me.", "rating": 4}, {"title": "Great Service", "text": "Applied for a service that was delivered time scales and as requested", "rating": 4}, {"title": "good and quick and no fuss", "text": "Date of experience: May 28, 2024", "rating": 4}, {"title": "Getting NIF was fairly simple with…", "text": "Getting NIF was fairly simple with e-residence.com. Recommend.", "rating": 4}, {"title": "Satisfactory service", "text": "Satisfied with the services. Very timely.", "rating": 4}, {"title": "fast service", "text": "Date of experience: October 19, 2022", "rating": 4}, {"title": "Thanks  for your help  👍", "text": "Thanks  for your help  👍. Good service  .", "rating": 4}, {"title": "good job thank youu", "text": "Date of experience: April 12, 2023", "rating": 4}, {"title": "Thanks.👍🏾", "text": "Thank you very much", "rating": 4}, {"title": "E residence", "text": "Efficient informative and helpful", "rating": 4}, {"title": "Very good experience", "text": "Date of experience: February 14, 2023", "rating": 4}]