[{"title": "We took out a loan for renovations…", "text": "We took out a loan for renovations using our home equity. The process was straightforward, the representatives were friendly and helpful. The whole process took less than 2 hours and the bank transfer came through in a week. After just two months the loan was sold to another bank however and already they are changing terms. ", "rating": 4}, {"title": "Application Process Hiccup but otherwise Great", "text": "Once the application process was complete it was smooth and effortless.  However, during the process there was a period of about a week when nothing was happening.  I checked the dashboard everyday and no new information was available. Everything was ticked off as completed and just waiting for the notary appointment. I then called and was told that Figure needed a copy of the deed.  I didn't see that on the dashboard otherwise I would have responded had I seen that note, nor did I receive a call or email telling me that the process was being held up until the deed was received (at least I don't remember a call or email).", "rating": 4}, {"title": "Was an easy process to follow", "text": "Was an easy process to follow.  Only complaint would be the time it takes to get the funds.  But a good experience ", "rating": 4}, {"title": "Exceptional customer service", "text": "The friendliness of the staff was refreshing.  No matter who I spoke to, the customer service agent took their time with me to answer my questions.", "rating": 4}, {"title": "Smooth and easy with security concerns ", "text": "Application and approval process using the Credit Karma app is easy and quick. Funding was also done within a week. I did get a phone call and mail from fraudulent parties. Unsure if that is Credit Karma’s doing or Figure’s, but it taints the overall experience with an uneasy feeling about your collective security.One was a phone call claiming I applied with their firm (I didn’t). The other came via USPS with a fake mortgage number.", "rating": 4}, {"title": "Great experience", "text": "Everything happened fairly quickly and everything happened as we were told it would.", "rating": 4}, {"title": "Really fast turn around", "text": "Really fast turn around. Easy to do paperwork via online and fund. Only draw back was they are not able to answer questions about the loan. You need an atty to review anything you may have a question about. ", "rating": 4}, {"title": "Almost perfect ", "text": "Very easy process. Was hoping the money would be a little quicker. I thought 5 days from when papers were signed. But it's 3-5 days once it's recorded. Still quicker than most places but puts me in a bit of a spot. Still recommend 100%", "rating": 4}, {"title": "100% satisfied..after getting jerked…", "text": "100% satisfied..after getting jerked around by banks,who kept moving the goal posts,and negatively affecting my credit score every time..Figure was a blessing..would recommend them to anyone..took my monthly payments from $3,200.00 down to $950.00 !! Looking forward to making my first payment  ! Thank you. ", "rating": 4}, {"title": " Go Figure! ", "text": "What a great process at Figure to apply. Fast, and all online. Very purposeful and understandable application questions. Processing speed on the front end was like lightning. My only holdback from giving a five star was incomplete communication on money release date and who the servicer will be once funded. Small nitpicks overall. I would highly recommend Figure to homeowners looking to withdraw some equity at low rates and fees. 👍", "rating": 4}, {"title": "neat business model.", "text": "neat business model.upside: everything is upfront in writing, including interest rate and termsdownside: you gotta call every step, and it's set up for internet savvy peeps.  I'm an analog bro and I really didn't like all the weird quirks that come with a \"verified digital\" interface.  plus, you really gotta stay on them on the phoneoverall: if you want a fixed rate HELOC, who else you gonna call?", "rating": 4}, {"title": "Very responsive when I called", "text": "Very responsive when I called, was able to speak to operators in the USA, no language barrier. Very easy and straight forward process which only took a few days. ", "rating": 4}, {"title": "Loan approvals may take longer than advertised", "text": "This company advertises approvals in 5 minutes and funding in 5 days.  This is a best case scenario.  For whatever reason, approval for our loan took several days.  After funding approval, because of local laws where I live, it required a visit from a local notary to sign the documents which added several more days.  The loan was funded within 5 days after the documents were signed and sent back by the notary.  All told, the loan process took about 2 weeks.  Figure certainly made it easier than other loan processes that I've gone through in the past but be aware that it will probably take longer than their advertising would have you believe.  I am happy with my overall experience.", "rating": 4}, {"title": "2nd home equity loan was smooth and…", "text": "2nd home equity loan was smooth and painless except for one major issue.   Rate was fair, not great, expensive origination fee too.But, after the 3 day rescission period was over, the company told me I was required to have flood insurance on my home.  Thankfully I had it, but if I didn't have it, it would have been a big problem as they have already funded the loan and had been paid the origination fee.   This should have been verified prior to closing/funding to avoid this issue.", "rating": 4}, {"title": "Convenient and Quick", "text": "The process was easy, entirely online and we were able to complete with an eNotary on-demand which was very convenient.  The chat assistants were very helpful.  The only area of improvement would be for them to be better about emailing if there is a hang up.  I had to chase down the delay through Chat to find out they needed additional documents.", "rating": 4}, {"title": "Nice associates ", "text": "The process was frustrating the 1st time I did the loan because Figure had the wrong ssn and I had to apply over.  The second time was pretty easy and the communication was was spot on.  Only thing I did not like was the id process.", "rating": 4}, {"title": "We really enjoyed the streamline…", "text": "We really enjoyed the streamline technology process Figure has put together. The process eliminates so much of the wasted time in the paper process and time expended in most other traditional loan companies. We felt the rates were on the high side which account for 4 out of 5 stars.", "rating": 4}, {"title": "Everything went well until", "text": "Everything went well until it came time for the secondary signer had to do her enotary. It took several days for your people to figure out the problem was on their end before she was able to get it done.", "rating": 4}, {"title": "Everything went well", "text": "Everything went well. Paperwork signed in a timely manner. A little more correspondence after paperwork signed would be nice. That way there’s not a void until funds are deposited.", "rating": 4}, {"title": "So far so good", "text": "So far so good. I couldn't give them a five-star rating because I've only been involved with them for about 2 weeks. When I finally put my application in last week I got approved by the weekend and my money is expected to be in my account by the end of this week. That is comforting because with a child in College, needing funds right away was critical. My BMO bank said it would take 6 weeks or longer to give me a HELOC. Compared to that this seems like a total winner for us. Now we have the peace of mind that everything will be taken care of. Because everything happened so fast and smoothly, unfortunately in this chaotic world, it makes a person raise eyebrows and question, \"is this really legit?\" But maybe they just got it right. I hope so because I'm all in.", "rating": 4}, {"title": "The qualification process was…", "text": "The qualification process was incredibly smooth. I had a major headache with the first notary they sent, and that delayed the process over a week which was very frustrating. ", "rating": 4}, {"title": "A-1 Figure", "text": "I had to jump through a lot of loopholes in the beginning with bank verification, but figure was always on the other side of the phone to help me along. It was very appreciated. Figure is a great company to work with and has a great staff.", "rating": 4}, {"title": "Don't believe what they advertise!", "text": "Third Update: Once funding came through, everything was seamless... so far.Second update: The funding is in my account. The process was relatively painless, but slightly frustrating. It took a lot longer than I believed it should have, based on the communication that I received from the beginning. They started with a one star rating from me. But, things continued to improve as time progressed.Update: While no progress has been made to obtain funding, I will say that every time I speak with someone at Figure, they are very professional. I have slightly raised my rating because of this fact.So far, not been a great experience! The dashboard shows that my loan has been approved and funded. After waiting for the 3-day rescission period, I received an email stating that I would receive the funds in about 2 to 3 business days, or longer depending on the institution where the funds were deposited. When I called (after waiting three business days) to ask when I might see the funds in my account the person told me that they are having \"funding issues\" (even though my dashboard shows that it is funded) and that I might see the funds in 3 to 14 business days. That's not what they advertise (promised)!", "rating": 4}, {"title": "Not quite finished.", "text": "So far, fairly easy to work through requirements. Responses have been fairly quick and very professional. Still don’t have funding yet. We signed everything a week ago today. I guess Labor Day caused delay.", "rating": 4}, {"title": "Quick and straight-forward interface…", "text": "Quick and straight-forward interface and clear feedback made the process quick and painless. I've never felt so in control of my financial future than when I received my notification that my HELOC loan was approved and I could start consolidating my unsecured debt under a much better APR", "rating": 4}, {"title": "Lower interest rate would of been…", "text": "Lower interest rate would of been better. ", "rating": 4}, {"title": "The Best & Most Simple Way To HELOC", "text": "The entire process was very easy, all steps were explained in easy to understand detail and from start to finish was kept informed of the progress…very quick & professional ", "rating": 4}, {"title": "struggled a little at first", "text": "struggled a little at first, but the staff that help me were great, and mad it easy to finish the application.", "rating": 4}, {"title": "Settled", "text": "Update: Just after writing this review I received notification that my funds posted. I increased my stars and would have given a 5 star review had they communicated they were a few days behind in posting funds. Other than trying to get an answer this was one of the easiest processes. I do see from reading other reviews that Figure is trying to make their system better.  The process for our HELOC from application, approval and notary signing was excellent. It is after this that things don't appear transparent from Figure. The funding time is not as promised, I am okay and understanding of delays if I knew I was still getting funds. It has been five days since my right to cancel period and no word on why my loan hasn't funded or why it has been delayed. The dashboard showed my loan funded and gave a balance due of my draw after fees. All of the sudden my dashboard says 0.00 amount due and the loan has funded. I have called, live chat and emailed their HELOC loan email and can't get an answer except I got a replica of the Congratulations your loan has funded and I will receive funds in 2-3 days only this email now says 3-14 days. I can work with the delays if I knew my loan was still funded and their was just a delay but I can not get confirmation and like others I have lined things up based on their time frame quote. 3-14 day funded is still fairly quick to standard just wish their was transparent information in the delay that would ease the unsettling of not knowing if there is something wrong. It also ties me up from moving forward with someone else. Do I want to start this process again if I know their is a funding delay not an issue with the approval.I will update this review accordingly to receiving my funds or not.", "rating": 4}, {"title": "Quick and easy", "text": "Quick and easy. Also felt safe with transaction. It was a big decision for me. ", "rating": 4}, {"title": "Great response and customer service", "text": "Great response and customer service! I think the apr could be lower and that is the only reason it’s not five stars", "rating": 4}, {"title": "Very friendly customer service", "text": "Very friendly customer service. Extremely helpful. Very happy with them", "rating": 4}, {"title": "Very quick process", "text": "Very quick process. No pressure.", "rating": 4}, {"title": "The process was very simple but finding…", "text": "The process was very simple but finding took a bit longer than I was told", "rating": 4}, {"title": "Easy application and process", "text": "Easy application and process. Also fast acceptance and deposit of funds! 👍👍", "rating": 4}, {"title": "Figure loan process was such a PLEASANT…", "text": "Figure loan process was such a PLEASANT experience.( I did say plaseant). Approved without a lot of jumping thru hoops. Our loan came as we are going through higher gas prices..food..etc. We are feeling secure and safe because of our Bank account bottom line. Thanks Figure for the help when it was needed MOST!", "rating": 4}, {"title": "Truly great, would be five stars, except.....", "text": "Website very easy to navigate. Personnel extremely professional, excellent response times, always followed up to make sure we were still engaged and taking care of our end of the process.Would be five stars, except for difficult verification process, and the time from application to funding took much longer than represented in the marketing materials.Overall, truly great, free of stress and anxiety, better than any banking transaction we have previously experienced.", "rating": 4}, {"title": "Professionalism", "text": "During the loan application process up to  the e-notary signing, everyone involved acted very professionally. They were very cooperative, answered our questions and during the e-notary process we encountered a few glitches, which were eventually overcome.PS: We will reread the respective disclosures and call Figure with any questions, which might come up, and if we are still satisfied, we will move forward. Thank you.", "rating": 4}, {"title": "We recently got a HELOC with Figure", "text": "We recently got a HELOC with Figure.  The process required a lot less documentation and effort in our part than other loans I have had over the years and moved much faster than other HELOCs are currently moving (about two weeks for us because they couldn’t get our deed online and we live in a county that requires in-person notary).  The rate is also higher than others, but is better than credit cards and has no prepayment penalties.  They are very quick to respond by chat and reasonably fast by phone if you have questions.", "rating": 4}, {"title": "There were a lot of technical…", "text": "There were a lot of technical difficulties communicating with an enotary. Connor was outstanding in helping with getting connected.  At some points in the process I was  asked to upload things I had already done. Not as smooth as advertised but went well overall. The glitches had to do with your company never having done a loan with a trust property in my state.", "rating": 4}, {"title": "Efficient with questions", "text": "Process is amazingly easy, fast and very efficient (5 stars), but the advertised rate was 4% higher and the reps only explanation is everything is automated, the algorithm determines the interest rate. Btw, my credit score is near 800. I'm sure there are other factors, but the reps should be able to explain it to the consumer, 4% variance is significant.", "rating": 4}, {"title": "Easy enough process for the most part", "text": "Easy enough process for the most part.  They need to be a bit more proactive in explaining that if more information is needed you need to call them. It will not let you continue an appointment but it will let you make one. Kind of backwards... They have some bugs to work out, other than that I would recommend. Watch your interest rate, even with excellent credit they do not negotiate after the fact. So choose your options wisely.", "rating": 4}, {"title": "Very fast with one exception", "text": "Very fast, Cooper and others were very helpful. However your company lets them down by their system not being able to accept scanned forms of ID. They would have the transaction wrapped up in 15 - 20 minutes except for the systems not accepting scanned ID's. This forced me to have to take a photo of the ID's and email and IM the images. This added 2-hrs to the process as I never took photos with my phone before. This almost caused me to drop the whole loan process altogether.", "rating": 4}, {"title": "Good to work with.", "text": "Purely online process. Did make me a little uneasy at first as you have to give authorization to your accounts. Once notary was done and the waiting period for you to rescind is over, it was funded the next day. I did appreciate the live support via phone and if using the chat, they email you with a synopsis of the conversation. I called after using the chat and actually talked to the same person I chatted with. That was very nice to know they staff the chat and support from within. So far, I'm very satisfied with Figure and would recommend them to a friend:)", "rating": 4}, {"title": "Service was good", "text": "Service was good, Process was quick < 15 days start to funding. The e notary process was not as simple as it should have been. Mobile notary messed up and caused a problem with my 19th century county offices. Plaid needs to expand their network. Doesn't include E*Trade Bank ??Was an early customer so still some bugs had to be worked out.", "rating": 4}, {"title": "The online process is quick and easy", "text": "The online process is quick and easy. The team members respond fast and are very helpful. If the rates on investment properties were a little cheaper I would definitely give 5 stars. All and all they have a really good product I recommend them to friends and family and would not hesitate to use them again in the future.", "rating": 4}, {"title": "Easy and fast, but you don't know where you might end up.", "text": "We took out a loan for renovations using our home's equity.  The process was straightforward, the representatives were friendly and helpful.  The whole process took less than 2 hours and the bank transfer came through in a week.  After just two months, the loan was sold to another bank however, and already, they are changing terms.", "rating": 4}, {"title": "Easy and fast process, as long as you don’t use CapitalOne 360 checking", "text": "I had several issues because of trying to use a CapitalOne 460 checking account. I wish there would have been some kind of a notification that told me CapitalOne 360 wasn’t an option. I wasted a bunch of time. I had to open a new checking account. That had some challenges as well, because it was brand new. Other than that, the service was really good. Every time I had to call, I got to speak with a person really fast!!! That was shocking! Kudos to your team for being patient with me and going through all of my questions.", "rating": 4}, {"title": "This is not the company for everyone", "text": "This is not the company for everyone. My personal experience at first was a bit intimidating but once we got the ball rolling it was a very quick process. If you are leary of doing anything online this is not the company for you. But if you are somewhat technologically savy, have sufficient equity they can verify and have good credit I would recommend this company. The overall customer service both via chat and phone was top notch. The reps were helpful and made sure things went smoothly from start to finish.", "rating": 4}, {"title": "It was fairly easy but there were some…", "text": "It was fairly easy but there were some technical issues regarding connection to the notary agents. We had a man who was excellent and then a woman whom we couldn't hear and we believe she disconnected us and we had to wait altogether a long time, but otherwise it is pretty easy.", "rating": 4}, {"title": "Great Customer Service", "text": "Even though I have had difficulty with some of the online submission tools the live customer service representatives have been wonderful.  They have been friendly, patient and knowledgeable.  All in all, the process was still pretty easy with their assistance.", "rating": 4}, {"title": "All lending institutions shouid be as Professional as this !", "text": "I've had more loans over the last 40 years than I could count ,  not only was this one almost scary fast , but this Company didn't play any stressful paper games , like all of the other institutions do . That is huge these daysFigure is top notch in my book .", "rating": 4}, {"title": "Very Impressed", "text": "I really would give this company 5 stars however I did feel that the process was a bit cryptic. The company definitely delivers as promised and this has been one of the fastest and easiest home mortgage loan processes that I've ever experienced. The thing I loved most was not having to upload 50 documents as proof of...whatever, and how efficient everything was. After being denied by a big bank lender, I was a little skeptical but Figure worked with our huge DTI due to student loans and thanks to them, we are able to reduce our monthly payments on a personal loan!", "rating": 4}, {"title": "Fast & Easy", "text": "Once the ball got rolling the process was fast and easy.", "rating": 4}, {"title": "Your wonderful staff", "text": "Brandon, John, Helena and, I think, one other male member of your staff whose name may have been Trevor all provided unbelievable courteous and patient service. All day I was trying to work around my cellphone, which seemed to want to provide foreign alphabet characters (umlaut, German sharp s, Spanish  n with a tilde) and numbers though I was using the English alphabet screen. It was extremely frustrating for me and your representatives. Then your system was giving Helena and me lots and lots of problems all afternoon. It's not a five-star review because of the problems with your system. Your reps were great!", "rating": 4}, {"title": "The process was okay", "text": "The process was okay, fast and not too cumbersome. I find their website a bit of a challenge, but their rates are pretty good. The first payment comes due in under 30 days, which is new to me. Overall, I'm satisfied with Figure and would recommend them.", "rating": 4}, {"title": "So far so great", "text": "So far so great!  We were just approved and now waiting on the loan to hit my account.  It was crazy simple, the staff (John and Diedre) were awesome, answered all my questions and the e-notary, Audrey, was efficient and had a good sense of humor.", "rating": 4}, {"title": "I’m currently happy with Figure", "text": "I’m currently happy with Figure. I couldn’t imagine a smoother application process. With other traditional lender we had to fill out reams of paperwork and whatever we filled out seemed to lead to more questions. We also had to wait 4 & 6 weeks to hear back from underwriting. With Figure I filled out the form, talked to a notary online and 3 days later we had our approval! The one reason I give 4 stars vs 5 is because figure charges a $2000 origination fee on a $100,000 loan where traditional lenders don’t charge any origination fee. If they didn’t charge that fee, I would actually go around wearing the Figure t shirt I was sent and tell anyone who would listen about this never and different lender!", "rating": 4}, {"title": "The application process was fast and…", "text": "The application process was fast and easy. Totally online. I was hesitant at first, but it was such an easy process. I am so pleased with Figure and the people who served me. Super Cool Figure! Thank you!", "rating": 4}, {"title": "Because nobody is perfect so I gave…", "text": "Because nobody is perfect so I gave Mike 4 stars. The whole process was fairly easy to do and Mike was friendly.  Mike was patient  with both us since neither of us are really computer savvy.", "rating": 4}, {"title": "The process was very smooth and at…", "text": "The process was very smooth and at home. All my questions were answered promptly. The best part of all was that the funds were available the following day after enotary.  Great job!!!!", "rating": 4}, {"title": "I was very pleasantly surprised", "text": "I was very pleasantly surprised by my experience with Figure.  In the past, when I wanted cash out for home improvement, I have refinanced my mortgage, and have found that to be a hassle, with outcomes controlled Not By Me.So this time, decided to try Figure (I had received numerous mailings), and applied online. Very easy, competent, personable Figure reps were readily available for email and telephone assistance. Only once did the ball get dropped when I didn't get responses to my email correspondent, who had invited me to communicate my questions and concerns anytime.  But that was quickly remedied when I called the 888 number for assistance.I would recommend this service.PS  Figure recently sent me a high quality fine combed deep purple tee, a nice little thank you surprise.", "rating": 4}, {"title": "trouble entering info on the application", "text": "I had some trouble entering information,such as my address, on the online application.  The auto-fill feature would only accept information that it already had in it's database, so I couldn't enter my correct address or proceed with the application.  I did talk with someone on the Chat Line, but that did not resolve my problem. I then called your support team and spoke with someone who admitted that the problem I was having had happened to others before, but she explained a couple of things I could try to make it work.  Eventually I got all my information entered and the application was submitted.  After a couple of false starts, it all seemed to flow perfectly, and my equity loan was approved, And I received my money very quickly,--- within 3 days,!   I am eternally grateful for your financial help when I needed it most.", "rating": 4}, {"title": "Very good service very professional…", "text": "Very good service very professional staff. My only complaint is the repayment dates that fall on the 23rd of each month, I would prefer them on the first of the month.", "rating": 4}, {"title": "Very happy with the outcome", "text": "Very happy with the outcome! The electronic process was something I had to work out but help was immediate when I contacted customer service. Thank you so much.", "rating": 4}, {"title": "Figure.com saved my life when another…", "text": "Figure.com saved my life when another lender almost cost me my new home purchase. From application to funding took 11 days. Very easy to navigate through the process and everyone I spoke to was beyond helpful and professional. Also, an almost immediate response to email, and every time I called the help desk I got a live person who answered my questions on the spot. The only reason for the 4-star review is their rates which are much higher than traditional lenders. You can get better rates by buying points but even then they are still not as competitive. Also, if you are interested in a HELOC, note that it does not work quite like the usual HELOC. You will receive the entire amount requested upfront and your payment will not go down until the loan is paid off.  They also do not offer a HELOC for investment properties. I wish they did. I would use them again and recommend to others.", "rating": 4}, {"title": "Great application and approval process…", "text": "The application and approval process was straightforward. Great experience.", "rating": 4}, {"title": "Great service", "text": "Great service! will recommend!", "rating": 4}, {"title": "So far so good", "text": "So, far everything has gone smoothly. Still waiting to receive my funds but, everything and everyone has made this an easy process thus far", "rating": 4}, {"title": "Application;They were very easy to follow and not…", "text": "They were very easy to follow and not nerve racking at all. Waiting was challenging but that's normal.", "rating": 4}, {"title": "Couldn't be happier with the new rate…", "text": "Couldn't be happier with the new rate and savings I'm experiencing as a result, nor with the speed at which it all happened.  My only criticism would be that the system is almost TOO automated in that there is no way to \"check in\" within the app itself to just see what your status is or review anything you have submitted.  The help received from Crystal Johnson was UNSURPASSED and made up for any concerns or questions I had with the automated systems aspect.  I fully understand this is a new offer and new software and growing pains are a natural part of that.  Fortunately I understand that and it didn't bother me, but I know someone less comfortable with such systems may have gotten discouraged along the way (I think of my older mother for instance).  However, once your product and process is fine tuned a bit, it's a five star rating for sure.  Overall my experience was positive enough that I have told half a dozen or more people about it and I know at least two of them are refi'ing with you currently!", "rating": 4}, {"title": "Kept me well informed throughout the…", "text": "Kept me well informed throughout the process giving the opportunity to make the decision that fit my needs.", "rating": 4}, {"title": "Quick", "text": "Quick, simple, and easy! Great customer service. A little higher rate than others, but as streamlined as possible.", "rating": 4}, {"title": "The way that documents are transferred…", "text": "The way that documents are transferred could be easier. A lot of people do you use the Android system", "rating": 4}, {"title": "Great service so far", "text": "Great service so far. We haven't gotten the deposit yet but so far so good. Very simple process.", "rating": 4}, {"title": "Easy online process", "text": "Easy online process. The only issue I had was the instruction for the online notary appoint was unclear.", "rating": 4}, {"title": "incompetency fixed, updated", "text": "Update 7/8/21 from 1 to 4 stars.They fired their 3rd party vendor who does the drive- by PCRA assessment and removed this step from the process.  Now it is fully digital.Even though they canceled my loan, I was told if I reapplied I would get through very quickly and there would be no waiting for a drive-by assessment. I thought, what the hell and tried it. It took 2 days to get to the notary signing and then they did fund it 3 days later so it did take about 5-6 days which would otherwise have been fast.Lol, I signed closing docs 9 days ago, they say they will void the loan in 5 days if they do not get their PCRA (drive by appraisal) completed. It's their responsibility to get their vendor to do the job. Loan was supposed to be funded days ago. Customer service is opaque and will not answer questions. If you want to waste your time, Figure.Update: They did indeed cancel on me for their own failure. Just see the canned response below shirking responsibility and blaming their own vendor. Hey guys you hired them so take responsibility. You could have easily fixed this by just leaving yourself an option in your contract with the vendor to hire someone else if they fail to reach a certain deadline. Looks like others are having this problem as well on the reviews.", "rating": 4}, {"title": "So far, so good", "text": "So far, so good with the process. I did have problems with the app, but not the website.", "rating": 4}, {"title": "Friendly people", "text": "Friendly people , easy process, I would recommend it 👍", "rating": 4}, {"title": "Great experience", "text": "Great experience.  I plan to continue to use my HELOC in the future without issues.", "rating": 4}, {"title": "Some mishaps took paces", "text": "Some mishaps took paces - pages did not come up accordingly after clicks", "rating": 4}, {"title": "Not sure how to see my balance on my…", "text": "Not sure how to see my balance on my account", "rating": 4}, {"title": "quick and easy transaction for tapping…", "text": "quick and easy transaction for tapping into my equity", "rating": 4}, {"title": "Very transparent,helpful and  patience.", "text": "Very transparent,helpful and  patience", "rating": 4}, {"title": "Very helpful and easy process", "text": "Date of experience: December 14, 2019", "rating": 4}, {"title": "Decent", "text": "It was alright.", "rating": 4}]