[{"title": "Easy process", "text": "All process from start to end was very smooth without any issue.I'll use again!!!", "rating": 4}, {"title": "PayPal instructions were off-putting", "text": "I can’t review the product because I haven’t received it yet. It looks great, or I wouldn’t have purchased it.My only complaint is that I pay with PayPal and your directions for doing so were very confusing.  I almost cancelled my order because I couldn’t pay for it.", "rating": 4}, {"title": "Easy site experience, but \"Help\" not helpful", "text": "The website is fairly intuitive to use. I found it easy to filter the specific categories I was interested in, making my time quick on the site. The one thing I found problematic was, I have no way of knowing if my Credit Card information is visible to the Seller, or if my Credit Card data is being store on either the Seller's site or the Ruby Lane site. I tried to find out on the Ruby Lane site, but got nowhere. Very frustrating!", "rating": 4}, {"title": "A great site with one exception", "text": "my only complaint about ruby lane is how time consuming it is to check out.  each item has to go through PayPal or my credit card separately, instead of just paying for it all at once. I understand there are different vendors and so on, but couldn't ruby lane figure out a way to distribute the money to each vendor, to speed up the process.  when I buy 3 or 4 pieces, it's a long story to check out.  otherwise, a great site, fast posting, and pieces are always as described.", "rating": 4}, {"title": "Vendor cancelled order", "text": "Initial vender experience was great.  Found something I wanted and PayPal worked smoothly.  Then, vendor may not be as good as I first thought. Vendor cancelled order claiming damage but original picture showed no damage.  Would like to see photo of damaged item to preclude feeling seller changed mind on price. Would like to complete original purchase and write a much better review. The following observation was directed to the Ruby Lane site software:The cookie preferences experience was a disaster, at least on my i-phone screen. This needs to be simplified and functional. Thanks for any updates and corrections. Bob", "rating": 4}, {"title": "Generally a good site", "text": "Generally a good site. I was excited when they finally separated the antiques from collectibles. Then the \"Antique\" button disappeared AGAIN. So I am back to sifting through. A real pet peeve.Also, the Wish List should be alphabetized by shop to make items easier to find.", "rating": 4}, {"title": "I love Ruby Lane", "text": "I love Ruby Lane. I’ve made over 100 purchases. Only a couple of glitches  Shop owners have been very responsive to any questions or concerns I have had.  Why only 4 stars?  Because. I am up at 5am pacific time and look at my daily wish list at about 5:15. Often, things I would have purchased, are already sold. I suspect that the East coast receives notifications earlier, due to the time zones. Only complaint ", "rating": 4}, {"title": "Handling experiences", "text": "Very good and frequent informations concerning new finds.Timely reference to \"Red Tag\" is very good.\"Red Tag\": Start time and time end also in CET is perfect.The page with the individual offer contains nearly all the necessary information for the purchase. Sadly missing: The information about the country of the seller.After having closed a site the order of the offered items has changed when reopening the same site. Finding a certain item again is difficult.", "rating": 4}, {"title": "A little confusing that invoices say…", "text": "A little confusing that invoices say “don’t forget to make your payment” (?) I thought I did. So then I had to check PayPal to make sure I did. It would be better to keep viewing items without having to tap the next page, page after page and then it’s a real drag if you tap wrong spot. Makes shopping inconvenient and not efficient.", "rating": 4}, {"title": "Was able to get all the items from my…", "text": "Was able to get all the items from my wish list easily via paypal. Used 4 different vendors. What is needed is a way to get back to my cart from Ruby Lane site after I'd paid one vendor and gotten the transaction notice, without having to pull up their site again.", "rating": 4}, {"title": "I got return emails quickly on my question.", "text": "I got return emails quickly on my question about paying without a PayPal account (I had given mine up) and fortunately the item purchased was still in my \"basket.\" Sometimes it would be nice to have a search window for something seen in the past that one wants to recall. This is my third or fourth purchase from Ruby Lane. Ruby Lane has a nice variety of interesting objects.", "rating": 4}, {"title": "Great antique and vintage dealers!", "text": "Great antique and vintage dealers from across the globe and at all price points. I enjoy the format for searching for items Ruby Lane offers. The sales you hold periodically are a big incentive to search, shop and buy. I wish your search engine would recognize misspelled words like other on line platforms. Checkout is a bit confusing sometimes, when you think you’ve  paid, but have not, but is easily corrected.  I wish you would feature some educational posts or short videos featuring knowledgeable Ruby Lane dealers/sellers, regarding Chinese export china, vernacular photography, coin silver or costume jewelry, etc.  Informed buyers are confident buyers and build collections as their knowledge in a collecting field grows.", "rating": 4}, {"title": "What can be a time waster.", "text": "Mostly my experiences are good but I do find it annoying when I go to purchase something that has been recommended to me only to find they won\"t ship to Australia. I would prefer not to have wasted my time. ", "rating": 4}, {"title": "Seller and site were great; payment procedure a little confusing", "text": "I quickly found what I was looking for and have already received a message from the seller that it will be shipped tomorrow.  The only slight downside was that when I went to pay, I chose the PayPal option, but then it also asked me for my credit card info (which is saved on PayPal), and I was concerned that the payment had been made twice.  It was a little bit confusing.", "rating": 4}, {"title": "Payment issue", "text": "When I was trying to pay it had a selection for PayPal,debit card, etc which I clicked on.I went to another screen and put in my Discover card info and THEN received an email from PayPal that theyhad paid it.  I really did NOT want to pay with PayPal but it's hard to get to credit card info Now I'm worried about being charged twice.Otherwise, ok experience.", "rating": 4}, {"title": "Venmo payment option wasn't offered until after checkout", "text": "Was my first purchase from Ruby Lane and it was overall good. One thing I was disappointed with was after going through the checkout and payment process, the order confirmation page mentioned Venmo as one of the payment options. I didn't see the Venmo payment option prior to checkout, in fact, PayPal (and/or credit card via PayPal) was the only option offered to me. I would have preferred using Venmo for my purchase! :(", "rating": 4}, {"title": "Was unable to communicate with buyer…", "text": "Was unable to communicate with buyer prior to my purchase. I wanted to discuss the cost of shipping. I was held hostage, as in pay what I want or cancel the transaction. Very unhappy! ", "rating": 4}, {"title": "App wants to keep you in the same shop", "text": "If you look at an item in a shop, the algorithm wants to keep you in the same shop even if the next item is in a different category.  It’s difficult to get back to browsing all vendors as the app wants to limit your searches to the last shop you were in.", "rating": 4}, {"title": "Overall very good experience", "text": "The interface with PayPal, at least in Chrome, was awkward and confusing. Everything else was great and my interaction with the seller was exemplary.  I am very happy with my purchase and am eager to receive the package. ", "rating": 4}, {"title": "Ruby Lane has great and hard to find items", "text": "Ruby Lane has great and hard to usually find products, which makes shooping there a delight.Sometimes though navigating the process of arranging tghe shipping with the seller is cumbersome.", "rating": 4}, {"title": "Vintage", "text": "Great seller to work with", "rating": 4}, {"title": "Red Tag Sale", "text": "Red Tag Sale  - when you advertise it as a 50% off sale everything should really be 50% off. I saw many items that weren't 50% off and if thats how you advertise the sale dealers should not be listing an item that isn't truly 50% off. It's a waste of my time to scroll through pages and pages of items Im interested in to find something I want thats less than the advertised 50% off Tag Line that heads up your page. If you are advertising it as a 50% off sale everything listed should adhere to that rule.", "rating": 4}, {"title": "I purchased earrings from A Vintage…", "text": "I purchased earrings from A Vintage Love Affair through Ruby Lane. My earrings arrived much earlier than the anticipated date. I am very happy woyhmy purchase and will shops onRuby Lane again.", "rating": 4}, {"title": "They responded to my question quickly", "text": "They responded to my question quickly. Loved the unique items on their site. Not too keen on the need for authorization links to be sent for completing purchase as the links were only good for a few minutes and I kept missing the emails and had to try again and again. A bit frustrating.", "rating": 4}, {"title": "Great range of products", "text": "Great range of products. Great site.  Just tough to find out the real cost when you are buying from outside of the US.  A currency converter would be nice as would being able to tell what the brokerage fees and import duties will be.  It ends up being quite expensive and a surprise.", "rating": 4}, {"title": "Love Ruby Lane", "text": "I love so much about Ruby Lane, Particularly the very unique items offered. Pricing is great in many items and I love being able to make a favorites list of items that I can go to when I wish to treat myself. The one thing I would love for this company to do is allow sellers to put one item up for sale and simply take a percentage of the sale o f the item. The current standard is not feasible for just one item. Thank you.", "rating": 4}, {"title": "Shipping has caused me to cut down on…", "text": "Shipping has caused me to cut down on my purchases.I still would prefer my wish list be alphabetized by seller. It is cumbersome. I have asked that you consider this a few times.Also, finding past purchases is far harder since the \"completed\" tab often does not appear.Thank you", "rating": 4}, {"title": "Room for improvement RUBY !", "text": "Ruby lane is a good platform,many of the sellers are obliging , but if wishing to send a purchased item to another address in another country as a gift is currently rather  cumbersome & could be greatly improved ! Although achievable, if you are persistent, the instructions on how to do this are still  currently very vague !", "rating": 4}, {"title": "Nicely curated selection", "text": "I was looking for something specific and found the nicest examples on Ruby Lane. I did place an order, but almost a week later I see no means of tracking its delivery.", "rating": 4}, {"title": "Order went through smoothly but...", "text": "Order went through smoothly, but then I had to reverify my email address in order to complete the order. The first time, the reverification email didn't show up.", "rating": 4}, {"title": "\"group\" dynamic", "text": "This is an on-line \"group\". I understand. Checking out is quite complex for me, a first-timer. I had to keep circling  back to make multiple purchases.Now awaiting the \"treasure\"Carl", "rating": 4}, {"title": "I wrote my earlier review stating I was…", "text": "I wrote my earlier review stating I was unable to communicate with the seller. Rubylane then pointed you that I missed a circle that said contact seller. I was new to RubyLane and must have missed seeing the circle for contacting the seller. MY FAULT! So sorry! ", "rating": 4}, {"title": "A trusted source!", "text": "I used to sell at Ruby Lane, and I still converse with the customers I had. Some became good friends. I just could no longer afford the rent, during slow months. There are so many people that don't even know Ruby Lane exists, however, I still shop there often! I am never disappointed in the deals I can find there!Thanks,Teresa", "rating": 4}, {"title": "To much re-entering password if the…", "text": "To much re-entering password if the buyer has not ordered for a while. I cannot be ordering from Ruby all the time. Why make the buyer go thru so much in useing same password?? Too much of a bother", "rating": 4}, {"title": "Wonderful products", "text": "Wonderful products, excellently presented. Ordering a bit clunky though, as payment can't be made until the seller cofirms the postage cost etc.", "rating": 4}, {"title": "Shipping and insurance option", "text": "The shipping and insurance options (media vs. ground advantage) made the difference in the sale for me. Saved me about $3. The verification of email address was bothersome.", "rating": 4}, {"title": "Payment of items is NOT always as EZ as 1-2-3!", "text": "It was not absolutely trouble free to complete my transaction because I had to keep entering my choice of card to use as payment.  It became very frustrating trying to enter all the necessary information before the two items were paid.", "rating": 4}, {"title": "Pay with PayPal option did not work", "text": "Pay with PayPal option did not work, only loaded a blank page;  this meant extra time typing in payment & address, for each separate order.", "rating": 4}, {"title": "I love it when you can purchase…", "text": "I love it when you can purchase something and they can send it to Canada. I also like if they can send it in such a way that I don’t have to pay a large amount of Canadian duty.", "rating": 4}, {"title": "I would have given a 5 star but", "text": "I would have given a 5 star but, when I saw it was paid by PayPal I was alarmed as i had just entered my credit card info. Please spare me the angst of giving my CC and to see it said paypal!!", "rating": 4}, {"title": "pay pal?", "text": "Even though I paid with a credit card it went through pay pal.  I don't believe there was enough information to understand why.", "rating": 4}, {"title": "I was still in your system after quite a while...", "text": "The fact that even though it had been some time since I ordered from Ruby Lane, you still had my information and I was able to reset my password. The rest was easy.", "rating": 4}, {"title": "Some Irksome Things About the Purchase Protocol", "text": "Actually, I believe your order process should be tweaked.  I put in a bid for a pair of whisky glasses at Douglas Lane Antiques.  I was told it wasn't accepted.  So, I wanted to offer more.  I sent a message to DLA asking if they'd accept my next higher bid.  Regina, at DLA, was very helpful and agreed to the price proposed.  Upon her direction, I went back to your website and attempted to key in the new agreed-upon price and then order the items.  But it wouldn't allow me to enter the agreed-upon price.  I got back with Regina who contacted you all. She was told that the system would not allow me to enter a new bid.  Thus, she was able to discount the item (to the price she and I agreed upon.  I then went back into the site to purchase it.  But I kept being cued to do so by using PayPal, which I didn't want to do.  I continued clicking on \"change\" (for the method of payment I wished to use).  But that didn't work.  Finally, I found directions that directed me to go ahead and press \"PayPal\" and then on a subsequent page, click on debit card/credit card.  I did that and it worked.It was kind of frustrating to navigate your purchase process due to the lack of clarity and efficiency in the way you have things set up.  However, again Regina at Douglas Lane Antiques was very helpful and thus, did a great job.  I look forward to receiving the glasses!", "rating": 4}, {"title": "Old Browser", "text": "I enjoy receiving the daily email from Ruby Lane. I just wish the browser supported Safari. other than that, everything is okay.", "rating": 4}, {"title": "I may die of old age before my item finally gets hereQ!", "text": "I dealt with a jeweler who deals through Ruby Lane.  My payment (by credit card) had to go through PayPal. Thus far it has taken over a month to get a small, not very valuable bracelet to (still) not get here.  As I am in my late 80's, I don't really have much time to waste! *Bet they don't post this one!", "rating": 4}, {"title": "Staff responds quickly to \"Help\"…", "text": "Staff responds quickly to \"Help\" notice. Tech staff is excellent. Wish our photos would go up more quickly and instantly like ebay.", "rating": 4}, {"title": "Ruby Lane-One Road I Love To Travel", "text": "This review does not concern, just Ruby Lane. It flows into other areas as welI. I loved Ruby Lane, since it started, years ago. My main concern has been of course the price of objects; yet shipping has cut many a deal. Thought of how it can be rectified. Know that size of boxes, increase cost and days on the road also. If people could have a choice of shipping days, and prices that may help both buyer's and sellers; sell their product easier.Also when I looked for Ruby Lane Discount Codes. Most were not available. I'm not a person, who understands that part of the business; but feel it's an area that draws, people in. One item I looked at was not cleaned and that put me off. Also, no returns. But sellers have their reasons to choose certain paths. Thanks for this request.", "rating": 4}, {"title": "While the seller did an excellent job…", "text": "While the seller did an excellent job of packaging the items I ordered, he did not double-check the USPS print-out label address, which listed a different street to the correct one he had provided on a hand-written Priority Mail label.As a consequence, the package was kept at the local Post Office annex, and by the time I realized the package was five days overdue, the annex was about to return the package to the seller.", "rating": 4}, {"title": "Buying was excellent, signing on not so much", "text": "Everything about the buying was good except that in signing up, I had to accept all sorts of policies and conditions that were really meant for sellers and did not like having to go through that part of the process in order to buy.", "rating": 4}, {"title": "Professional, prompt service", "text": "The seller (at Grandpa's Shed) quickly answered my Email question.My order arrived promptly and was packaged well.I'm very pleased with my purchase 😄", "rating": 4}, {"title": "PayPal Charged instead of Credit Card", "text": "It was good.  For some reason even though I entered my credit card info, the purchase was charged to my PayPal account.  I don't know how this happened - it could have been my error.", "rating": 4}, {"title": "Still", "text": "Still, waiting to find out about an order that was not received. Did contact the shop owner. And, contact him Ruby Lane help line. As of now we have not heard anything at all.", "rating": 4}, {"title": "Nice that items can be saved", "text": "Nice that items can be saved.  Search for specific items works well.  Would be better to show total cost in item search— include shipping and handling.", "rating": 4}, {"title": "Smooth landing!!", "text": "Few times that I found what I was looking for when shopping, especially for vintage items! Great choices. Happy shopper.", "rating": 4}, {"title": "I live in Canada", "text": "I live in Canada, and I find that many sellers do not ship to Canada unless I email and ask them to. Many times the doll I'm interested in has sold while I was waiting for a reply. Listen up sellers!!! Canadians collect dolls too. This puirchase went well. I emailed the seller, she got right back to me, and I purchased the doll. Very pleased.", "rating": 4}, {"title": "The experience was good", "text": "The experience was good. It was easy to navigate through the system. Pricing was what I expected for the item I was looking for", "rating": 4}, {"title": "vintage solid gold jewelry and…", "text": "Love vintage solid gold jewelry and have found many items.  Efficient shipping.", "rating": 4}, {"title": "Always like the variety on Ruby…", "text": "Always like the variety on Ruby Lane-however your exchange rate is a bit high 129 GB is $ 163?  I can always find the unique on Ruby Lane.", "rating": 4}, {"title": "FOR THE MOST PART I CAN SAY THAT MY…", "text": "FOR THE MOST PART I CAN SAY THAT MY EXPERANCES HAVE BEEN GOOD. I HAVE HAD A TIME OR TWO THAT I HAVE BID WITH NO   RESPONSE THEN LATER HAVE FOUND THAT I MISSED THE RESPONSE AFTER TIME WAS UP. I ALSO HAD TROUBLE PAYING FOR A ITEM A COUPLE OF TIMES. ALL IN ALL I HAVE BEEN HAPPY.", "rating": 4}, {"title": "Had a lot of trouble getting the site…", "text": "Had a lot of trouble getting the site to take my password in order for me to send a question to the seller.", "rating": 4}, {"title": "Payment problem", "text": "I paid with my credit card but the payment was charged to Paypal which I never use, and don't want to use.", "rating": 4}, {"title": "shipping an item on the red tag…", "text": "I just bought an item on the red tag sale at 50% off.  I was surprised when the shipping was $5 more than the item.  It was my choice to go on with the purchase and I did.  I wanted the item.", "rating": 4}, {"title": "It was ok", "text": "It was ok, but I wanted to pay by credit card, and ended up pushing the paypal icon, not hard to do.", "rating": 4}, {"title": "Good experience", "text": "I had a good expeerience but I find both Ruby Lane and Arnold's web sites hard to navigate. But I will return to shop!", "rating": 4}, {"title": "Vender", "text": "Vender. Hate conversion to American dollars and very high postal rates compared to Canadian. My experience is mostly excellent.", "rating": 4}, {"title": "The purchase was easy", "text": "The purchase was easy. Haven’t received yet, but may change rating once received.", "rating": 4}, {"title": "I like the selection of items available…", "text": "I like the selection of items available on Ruby Lane. It reminds me of walking through a huge antique mall. I found an item, contacted the dealer, and settled on a price in only 1 day. The store is massive and, I am sure, anyone can find exactly what they are looking for.", "rating": 4}, {"title": "Ring style i liked", "text": "Ring style i liked, but more expensive than i had anticipated.", "rating": 4}, {"title": "The dealer refused the sale because…already sold", "text": "I did not get my item that I had purchase, because they already sold it.", "rating": 4}, {"title": "My purchase was at a great price", "text": "My purchase was at a great price.  I just wish more desired dolls were on sale or for sale.  I don’t see many Tonners, BJDs, or more modern dolls.  I don’t collect antique so perhaps this isn’t the place for me??????", "rating": 4}, {"title": "I love shopping on Ruby Lane for the…", "text": "I love shopping on Ruby Lane for the great selections", "rating": 4}, {"title": "Your prices are high compared to other…", "text": "Your prices are high compared to other websites.", "rating": 4}, {"title": "Pure Gold", "text": "I am buying this beautiful piece because it is replacing the one given to me from my husband. It was his mothers. The original piece was stolen from our home. I am happily shocked that my husband found it on your site. We bought it right then. Thank you!", "rating": 4}, {"title": "The creating account app wasn't exactly…", "text": "The creating account app wasn't exactly user-friendly.  It took me a few tries to get the address part accepted and be able to complete the order.  Also, what is this Paypal business?--I paid with a debit card which it acknowledged--I don't want anything to do with Paypal. **I NEVER SELECTED PAYPAL AND HAVE SINCE GOTTEN AN EMAIL FROM THEM ABOUT CHANGING MY ORDER TO PAYPAL** (This is what the company I'm retired from called \"customer irritants\" and tried to eliminate).", "rating": 4}, {"title": "Changing shipping address is hard", "text": "Changing shipping address is hard. Needs to be easy. The word change doesn’t work.", "rating": 4}, {"title": "Enough photos to determine condition of…", "text": "Enough photos to determine condition of item.  Honesty in description of item.", "rating": 4}, {"title": "No forced Paypal use please!", "text": "I have not received the product yet so I can not review it. I do not like the fact that when I paid for the item, with my credit card, it automatically transferred over to PayPal. I would NOT have used Ruby Lane if I knew the payment had to go thru PayPal, which just happens to be a terrible company. They do NOT help the purchaser, they are truly a useless company. I vowed to never, ever use them again and now I was forced to!", "rating": 4}, {"title": "You have wonderful items to choose from…", "text": "You have wonderful items to choose from and you guided me through the process.  I have a very hard time with passwords.", "rating": 4}, {"title": "Good experience over many years", "text": "Have ordered from various Ruby Lane resellers for many years. Only once did I have a less than great experience. Overall sellers have been honest and forthright and photos are accurate as to condition of items. I've ordered porcelain, glass, and antique jewelry.", "rating": 4}, {"title": "Worked out fine", "text": "I found a fob that was close to what I was looking for a pocket watch.", "rating": 4}, {"title": "Ease of checkout", "text": "Ease of checkout . Was only about the second time I used it but I liked the store I used and will use the site again.", "rating": 4}, {"title": "Issue I had was not being able to…", "text": "Issue I had was not being able to cancel one of the items.  Just was able to do it.", "rating": 4}, {"title": "Purchase of 1930's toy truck", "text": "This item looks really interesting, and like an unusual Christmas item for the house. I believe the price was a bit high, but in this case I am willing to pay it.", "rating": 4}, {"title": "I was able to an hard to find item", "text": "I was able to an hard to find item. I believed the item didn't exist.", "rating": 4}, {"title": "Only one complaint", "text": "Nice sellers.  Lovely items.  Love it when they have a sale!Only complaint is that when you do a search, they add back in things you have already seen. Not sure why that happens but it’s annoying to see the same listing more than once when there are so many things to look at.", "rating": 4}, {"title": "I use Ruby Lane a great deal and have…", "text": "I use Ruby Lane a great deal and have enjoyed doing so for several years.  I find some postage costs a little high, particularly for small aper items, i. e. postcards.  I wish you would advise dealers when their prices are ridiculously high and when the items could not possibly be anywhere that in value.  For example, I have seen adds for common used postage stamps whose catalogue value is less than two or even one dollar offered at grossly inflated prices.  In these cases, the charitable view is that the dealer does not know the true value of his items.  the less charitable view is that the dealer hopes to snare a customer who likewise know the value of the item.  I understand the business principle of Caveat Emptor, but it makes Ruby Lane look bad to me and probably others.I hope you will consider this criticism.  Over the years, I have had very little problem with my purchases.These are general remarks about Ruby lane and not a specific experience.", "rating": 4}, {"title": "Good source for unique vintage", "text": "Ruby Lane is a great online site for vintage and antique items. The check-out is a bit pokey and needs to be upgraded. Otherwise I enjoy browsing and purchasing from the variety of shop owners.", "rating": 4}, {"title": "For the most part, I’m satisfied.", "text": "All in all, I’m satisfied, but for the manner in which the checkout system was attempting to change my primary billing address to my “secondary” shipping address and wouldn’t permit me to distinguish between the two addresses no matter how I edited my account’s address book.", "rating": 4}, {"title": "Love Ruby Lane, Checkout Process is Confusing", "text": "I love shopping through Ruby Lane. I get many gifts here because the items are unique and verified. Recently the site has changed to make buying a two step process, at least through Pay Pal. It's hard to tell if a payment was actually made. I'm pretty tech savvy so if I get confused, I'm sure others do too, especially older buyers who are used to a one step purchase process. Other than that, I have only good things to say about RL.", "rating": 4}, {"title": "Confusing", "text": "I think it woud be easier for a buyer to enterthere name and address at sign up than havingto add it in the Address Book.  I know it's forthe buyer's privacy, but it's a little confusing.  AlsoI would add some color to the pages on Rubylane.Thank you.", "rating": 4}, {"title": "Its fine if you pay with paypal", "text": "Its fine if you pay with paypal. I tried to add a credit card but there is no where I could find to do this.  It seems I have to message it to the seller, which isn't as streamlined as I prefer at these prices.", "rating": 4}, {"title": "A pleasent experience", "text": "An easy time buying the piece of pottery.A++++", "rating": 4}, {"title": "Selection is all cool", "text": "Selection is all cool. Unique pov. Apple Pay pls.", "rating": 4}, {"title": "Very nice site with numerous vendors…", "text": "Very nice site with numerous vendors who carry quality goods. Like anywhere else, some of the shops' pricing runs a little too high for me, but the quality is there. Most of the vendors are very friendly, pleasant to purchase from, and communicate well. Website is sometimes awkward to navigate, and I think your messaging system could use some improvement.", "rating": 4}, {"title": "Great website", "text": "Great website, works as it should  so I don't have any complaints. I did not have any issue searching for items and locating any details that I needed. I've recently interacted with a shop owner and all my inquires were resolved to both our satisfactions. If antiques/vintage items are your love, give this site a try. Ruby Lane has some one of a kind items!", "rating": 4}, {"title": "Unique one-of-a-kind items", "text": "You can find just about anything on this website, especially unique things, and the best part is you can barter on the price, you can ask vender any questions about the product, Vendor even points out the flaws so you are not surprised when you get your purchase. I ordered two cloth military patches, somehow the shipping cost for these two lightweight items is as much as the total costs of merchandise,$19.00 shipping fee? Kinda high!", "rating": 4}, {"title": "great deals on vintage jewelry", "text": "great deals on vintage jewelry, which I love.  I would like it better if sellers wererequired to list the dimensions of items, as some have come much smaller than  I would like.  But on the whole this is a great source for everyday jewelry and is the only place I buy my jewelry.", "rating": 4}, {"title": "Good quality merchandise and service. Checkout needs streamlining.", "text": "The quality of the merchandise is generally pretty good and I feel comfortable buying off it since I know I can return it within a limited time if I get it and don't like it. The checkout process is pretty convoluted though. I wanted to pay through PayPal using a credit card and got a little lost. That's especially worrying because I've been using PayPal for years. Newer users would be pretty lost!", "rating": 4}, {"title": "First Time, Definitely Not Last", "text": "Being a first-time buyer was a somewhat confusing experience - thus the 4 Stars. After placing an initial offer, it wasn’t as clear as other sites if the offer had been accepted. Just an acknowledgment box over the screen would clarify the situation. Other than that, the site is great! The seller with whom I worked was a friendly professional, who was easy to contact.", "rating": 4}, {"title": "I love Ruby Lane", "text": "I love Ruby Lane! The only things I find really annoying is that you cannot just pick out what you wish to purchase from your cart. You must either purchase everything in your cart, or send the other items to a love list which cannot be managed well due to the slowness of the site. I would rather leave my items in my cart for possible purchase later. Also, I would rather see all of my carts, where they limit you to only 75 at a time.", "rating": 4}, {"title": "The service  i receive from you.", "text": "Date of experience: September 05, 2023", "rating": 4}, {"title": "Selection of goods", "text": "Selection of goods.  Website a bit confusing.", "rating": 4}, {"title": "I have purchased some lovely things", "text": "I have purchased some lovely things.  But, they are not always as described. Inaccurate dating as antique or vintage is common. I realize there are not guarantees on Etsy, Ebay etc. either so I don't blame the site- but use the judgement you always should when purchasing online. I do love the 50% off Red tag Sale, which is when I buy most of my items", "rating": 4}, {"title": "This is a general review of Ruby Lane", "text": "This is a general review of Ruby Lane,  not of any specific vendor.  While I like Ruby Lane very much, most of the vendors tend to over price their merchandise.   I appreciate those who are open to offers and find that most of my purchases are made that way.  I also look forward to the occasional site-wide sales and have purchased several saved items that way as well.  The site is easy to use and many of the vendors are a pleasure to work with and offer quality items.  So, yes, I'm a fan.", "rating": 4}, {"title": "Purchase was easy but confused about payment method", "text": "Purchase was easy but confused about payment.  I paid with a credit card but I received an email from PayPal asking to sign up for PayPal.  I have a paypal account but chose to pay with a different credit card.  I suggest that you have an option to check either PayPal or Credit Card.", "rating": 4}, {"title": "Received a timely response", "text": "received a timely response", "rating": 4}, {"title": "I look at the links I get from Ruby…", "text": "I look at the links I get from Ruby Lane everyday. I get frustrated that the link gets me to the dealer, but then I have to fish to find the item. But I can do that.Usually I buy when things are on sale.The items are described well and items show up when I expect them. I need to spend more time setting up alerts for what I am hunting.", "rating": 4}, {"title": "Ruby Lane", "text": "I love Ruby Lane and use it frequently. I have had many good experiences. I had a single difficult interaction with a seller and it took a bit too long for Ruby Lane to help us resolve it.One thing that is good about this site, and different from others I have tried, is that almost all shops show multiple views of the object. I find that very helpful.", "rating": 4}, {"title": "Please overhaul your confusing, doesn't-make-any-sense customer interface", "text": "I love every product and every vendor I have experienced on Ruby Lane over the past couple of decades. I HATE the stupid, illogical customer interface with categories that don't make any sense. I hope the vendor interface is better. I always leave this comment on Trust Pilot and no one ever does anything to update this.", "rating": 4}, {"title": "Loved the earrings at fist sight", "text": "Loved the earrings at fist sight.  The only, very slight glitch, was I had to create a new account, since it’s been years since my last purchase. Shipping and taxes added $10 to the price of the earrings but I believe they will be worth it.", "rating": 4}, {"title": "I’d have given five stars", "text": "I’d have given five stars, except…I made an offer on an item and Ruby Lane automatically determined the amount was to low. And sent back a counter. The seller was willing to accept my offer. I had to write her an emails to explain the offer and response. Otherwise great spot to shop for Dolly antique items.", "rating": 4}, {"title": "I love buying from Rubylane and have no…", "text": "I love buying from Rubylane and have no issues with buying. I just wish it wasn't so expensive to have a Rubylane shop because I have a lot of vintage items to list but there is so much competition that the profit margin is extremely slim and wouldn't cover the cost of the shop.", "rating": 4}, {"title": "No way to allow many bid on a item!!!!!", "text": "Date of experience: November 17, 2022", "rating": 4}, {"title": "Had a problem with password and then…", "text": "Had a problem with password and then the payment.  It didn't seem to want to accept things, so I had to try over and over.  I emailed Ruby Lane and there as no response about it.  I got through but I am not entirely sure that my order went through.", "rating": 4}, {"title": "Very pleased with my favorite sellers…", "text": "Very pleased with my favorite sellers but I have had some bad experiences with a few other sellers that have blocked me because of having to cancel my purchases due to an emergency situation. And also the high cost of the shipping and insurance. Cher", "rating": 4}, {"title": "I ordered a $10.00 item", "text": "I ordered a $10.00 item. I got a reply from the owner within minutes, a request for payment including shipping fee came and was completed. I received the item via usps within a few days. It was wrapped very securely, was in perfect condition and exactly as advertised. Black Tulip Antiques, Ltd. gets 5 stars.", "rating": 4}, {"title": "I love Ruby Lane", "text": "I love Ruby Lane they sell hard to get beautiful items that always bring a smile to my face. They are usually well packaged however sometimes a little squashed when received. I would not shop for antiques and collectables anywhere else.", "rating": 4}, {"title": "This is my first jewelry purchase…", "text": "This is my first jewelry purchase through Ruby Lane. I appreciate the high quality photographs but often find the descriptions incomplete and frustrating. I'm very pleased with my ruby and diamond ring and the shop owner supplied a very complete description.", "rating": 4}, {"title": "The payment is a little challenging on…", "text": "The payment is a little challenging on the siteAll the vendors have been good, sometimes item appear smaller than anticipated - it's nice when they show measurements or comparisons", "rating": 4}, {"title": "Buyer paying and Negative message", "text": "The way to pay for item is a little difficult.  Sometime my buyers cannot figure it out and don't buy.   The message you receive when you remove an item is negative.  We have a business and make a  living doing so.   We do sell in other places and but  never remove an item and have a buyer come to us personally  and cheat ruby lane of a sale.   I do occasionally  purchase an item that I buy for resale  and have recently gave you my tax certificate but it never  came in time for my purchase of a doll for resale ( I need her outfit for a doll I will have for sale)On the other hand  Ruby lane is easy for me to use and I have recommended other dealers to sell on ruby lane and they are selling also on ruby lane now. I do appreciate the warning we receive about a bogus buyer that is vry helpful.", "rating": 4}, {"title": "I see RL as a store that people…", "text": "I see RL as a store that people buy space to sell their products. ALL of the people I have dealt with in public will always give you a 10% discount, esp if asked.Some people will deal with you and are gracious to you for making a sale. Then others act as though they are offended for uttering the word, offer!I have one person that doesn't allow me to buy her products. I assume because I asked for a discount or asked why my dealing was off the table. I could have made her a lot of money this year, for I saw many items I would love to have.Le", "rating": 4}, {"title": "Please send me my order number for the…", "text": "Please send me my order number for the vintage earrings in a jacket. I have no idea why you didn’t and I don’t even know if my order is being shipped.  I paid $1600 for these earrings Paulasheehan", "rating": 4}, {"title": "By the time my day starts and your…", "text": "By the time my day starts and your items are listed, I seem to miss out on some of the items sold.  Can you tell me what time of day do you post for California items please so I can set my alarm to be able to check out on something I might want.  Thank you.", "rating": 4}, {"title": "Item was safely packed and delivery was…", "text": "Item was safely packed and delivery was fast.Re: jewelry.  Descriptions which included gram weight of items were much  more helpful than those which didn't supply this piece of information.", "rating": 4}, {"title": "Please make ALL dealers post tracking", "text": "Please make ALL dealers post tracking numbers properly on invoice. Half the fun is watching your prizes progress. Inconsistent with some dealer’s just giving you the number through correspondence but not posting properly or in some cases don’t know how. Thank you.", "rating": 4}, {"title": "It seemed easy enough to buy an item…", "text": "It seemed easy enough to buy an item from Ruby Lane.  I thought it was interesting that Ruby Lane allows credit card but then the seller has to contact the buyer.  Way too complicated!  Just offer paypal only like eBay.", "rating": 4}, {"title": "Pleasant shopping", "text": "Pleasant for shopping for interesting items. Though at times it feels like there's not enough on the site. Not complicated to purchase, though making offers requires you email the shop owner vs. having a dedicated button to do it. Enjoyable overall.", "rating": 4}, {"title": "I'm still waiting for a response after…", "text": "I'm still waiting for a response after making a final offer on an item from one of the dealers on Ruby Lane. It has been over an hour and I wonder what's next? Dealers should be more responsive.  Thank you.", "rating": 4}, {"title": "It would have been 5 stars yet I am a…", "text": "It would have been 5 stars yet I am a little confused on the checkout process. I normally pay when I make the transaction, however, they need to contact me to complete the process. Other than that it was simple. Thank you and I will shop at this site again.", "rating": 4}, {"title": "the items that I bought arrived quickly…", "text": "the items that I bought arrived quickly and were in better shape than I expected.", "rating": 4}, {"title": "Beautiful selection for doll…", "text": "Beautiful selection for doll collectors.  However---it is NOT easy to puchase many times as the procedure for making payment is difficult sometimes.  From now on I will not pay until I receive an actual invoice from the seller.", "rating": 4}, {"title": "Page Access", "text": "I would like to be able to access any page I want rather than have to access each page separately.  e.g., If I want to go to page 50, I don't want to have to start at page one and scroll through each page until I reach page 50.", "rating": 4}, {"title": "RUBY LANE has an extensive line of…", "text": "RUBY LANE has an extensive line of products of every nature.  Most of thesellers are willing to work with you on pricing or LAYAWAY.  Some are rudeand don't bother to answer your inquiry. On the whole, I am pleased withthe sevice.", "rating": 4}, {"title": "Seller Obligations…", "text": "In this time is iportant tha the seller receive the price after the buyer receive the merchandise.I do not  understand why the buyer must pay the asurance if this, is the obligation the seller to give the item to the buyer", "rating": 4}, {"title": "confusing payment", "text": "It is confusing to me whether I have done everything to make my payment as I gave all credit card information. The way the other email read that I received, it seemed that was just an invoice and I had not paid.", "rating": 4}, {"title": "Search features not as easy to use from…", "text": "Search features not as easy to use from a mobile app as Tradesy or Etsy. Prices are higher on jewelry unless you buy during Ruby Red tag sales.", "rating": 4}, {"title": "Great Shopping Experience", "text": "I've been purchasing items for the last 3 or 4 years and have never had a bad experience. I had one instance where I  needed customer service assistance and was totally satisfied . I highly recommend this site", "rating": 4}, {"title": "I really like the range of jewelry on…", "text": "I really like the range of jewelry on Ruby Lane. You can find some really interesting pieces at reasonable prices. I have been shopping for jewelry through Etsy and E-Bay for a while, but have seen things on Ruby Lane which I haven't seen there.However they do provide costs in Australian dollars as well as U.S, which makes it easier to shop. They also provide shipping costs. It is difficult sometimes to work out who sends to Australia and who doesn't, although this time I emailed the shop owner and got a very prompt reply. I also know that some of the shops state that they will ship overseas, but this might make me tend to search more in these shops. I guess it will be easier as I become more familiar with a different way of doing things.", "rating": 4}, {"title": "Ruby Lane always shows such wonderful…toys", "text": "Ruby Lane always shows such wonderful things, things that have reminded me of my youth, and things that I never knew existed. I just purchased a toy that I thought was gone forever, but forever in my memory. However, the seller left me a little offended, almost to the point of not purchasing his product.  Such harsh words. The price was shown and I thought he would accept my willingness to accept the price.  I did not know the procedure that had to be completed, so I just asked him to allow me to buy the toy. He answered by writing that he does not give things away. He could have just advised me to complete the procedure in a kinder fashion.  I purchased the toy anyway, forgiving him for his impatience.", "rating": 4}, {"title": "Don’t liked being forced to use PayPal, website froze on 2nd attempt to purchase another item", "text": "Don’t liked being forced to use PayPal, who had rejected me recently even though I have 780 credit score. Website froze several times when I attempted a second purchase, not able to complete it.", "rating": 4}, {"title": "I've bought antique jewellery from Ruby…", "text": "I've bought antique jewellery from Ruby Lane and am very pleased with the items. Speedy checkout and shipping and insurance also  contributes to this satisfaction.", "rating": 4}, {"title": "The site is very well done and the…", "text": "The site is very well done and the inventory is very nice. The only reason I did not give 5 stars is the offer/checkout process is a little hard for first time users. But, I will be back for sure.", "rating": 4}, {"title": "Unrelated views", "text": "My only complaint would be that a number of unrelated items were displayed when I specified what I was searching for on the Ruby Lane site. That aside, the seller was a pleasure to deal with.", "rating": 4}, {"title": "I have been shopping through the Ruby…", "text": "I have been shopping through the Ruby Lane website for Years. I have had great luck with the site itself as well as every seller I have done business with. I could not recommend them any higher!!", "rating": 4}, {"title": "wonderful site", "text": "wonderful site.  plethora of items for sale.  only issue is with very high prices on some items.  but if they can get it, all the better for them (the sellers).  I enjoy looking.", "rating": 4}, {"title": "Love what you offer", "text": "Love what you offer, however I would like to recommend using Affirm on all purchases. I was still able to use it, but had to complete the order using a different Affirm option. Thanks.", "rating": 4}, {"title": "My experiences with Ruby Lane have been…", "text": "My experiences with Ruby Lane have been positive.However, I've noticed that the quality of their inventory is lower.One no longer finds an array of great items such as handbags, especially and jewelry anymore.The jewelry could be easily found anywhere else, gone are those shops dedicated only to Pearls, Corals, and Turquoise difficult to find great vintage Gold pieces rings bracelets. And, there are too many Silver pieces sold in Ruby lane and I don't mean pieces from the great Mexican Plateros, those you don't see anymore gone are Pineda, Aguilar, Los Castillos, etc.One could still find something nice, but, difficult.Please bring back the old sellers, do away with some of the fees, and restrictions.I still love Ruby Lane have been here since I found you. 2004", "rating": 4}, {"title": "The earrings I received don’t match the…", "text": "The earrings I received don’t match the ones I ordered and no response from him after emailing him so emailed RubyLane and got a response from seller for refund.", "rating": 4}, {"title": "You are charging the sellers too much", "text": "You are charging the sellers too much.  They are struggling with already small margins.  You do have an efficient and attractive sight but notice a decline in quality antique sellers.", "rating": 4}, {"title": "Making an offer is hard and confusing.", "text": "I found it confusing trying to make an offer to this dealer. I have no idea if my offer was accepted or not. I paid for it regardless because I was tired of messing with it.", "rating": 4}, {"title": "Amazing seller!", "text": "Date of experience: April 06, 2023", "rating": 4}, {"title": "Unable to change both incorrect addresses.", "text": "Both addresses, billing and shipping were incorrect. When I changed one, the other always returned to the previous address. I was unable to correct both.", "rating": 4}, {"title": "Ruby Lane notifies me too late.", "text": "Ruby Lane notifies me, per my request, when Madame Alexander Cissy dolls are available. The problem is the notification comes only when the item is pending sale.", "rating": 4}, {"title": "Every purchase has been a pleasant…", "text": "Every purchase has been a pleasant experience. My most recent one from Attos was just wonderful. I needed the item quickly and they went all out to make that happen.", "rating": 4}, {"title": "I am looking forward to receiving the…", "text": "I am looking forward to receiving the bracelet.I would like to be posted along the way re: arrival.               Thank you ,                        Danielle", "rating": 4}, {"title": "Think you charge too much for shipping.", "text": "My wife found something she liked, but I think you charge too much for shipping.  Makes the price seem reasonable until you find out the total cost. Oh well.", "rating": 4}, {"title": "I would like the payment info to happen…", "text": "I would like the payment info to happen at time of purchase.Nowhere is this a practice (speaking from my experience with online ordering).", "rating": 4}, {"title": "Very good site for antique and vintage…", "text": "Very good site for antique and vintage items. Very good sellers. Only wish there were even more items listed but am very happy with the items I have bought.", "rating": 4}, {"title": "Holiday Shopping", "text": "I am looking for special gifts.  I was impressed with Mr. Holmes' inventory.", "rating": 4}, {"title": "Seller on holidays during ‘red tag’ sale.", "text": "Whilst site was easy to navigate the seller was on holidays. Hence, completion of transaction was not possible. That was disappointing.", "rating": 4}, {"title": "Improvements to search engine needed.", "text": "You have many nice items on Ruby Lane, but this website needs a better search engine to find them easily.", "rating": 4}, {"title": "Ruby Lane is a great concept", "text": "Ruby Lane is a great concept. Most sellers are top notch, but a subpar one can make you nuts and corporate-level customer service isn’t broadly promoted.", "rating": 4}, {"title": "Restocking fee? Really?", "text": "The item I ordered was even nicer than it appeared on line. But too small, so I returned it. The restocking fee is not appreciated.", "rating": 4}, {"title": "Every difficult to make purchase!", "text": "Every difficult to make purchase!Good follow up by Ruby Lane.", "rating": 4}, {"title": "Positive Review of Ruby Lane", "text": "I sell on this site and sometimes buy. Excellent customer service when there's an issue. But IMO the site can be made easier to use.", "rating": 4}, {"title": "Der87", "text": "Delivered a day early, beat that!.item is as described, thank you so muchDerek rudd", "rating": 4}, {"title": "First time buyer", "text": "While searching for an item for a family member I was led to Ruby Lane. I have placed an order but have not yet received the items.", "rating": 4}, {"title": "Good site to purchase items", "text": "Date of experience: November 21, 2023", "rating": 4}, {"title": "I likes the item very much", "text": "I likes the item very much. This is the only website that had what I wanted. Wish I could pay without using paypal  or opening an account", "rating": 4}, {"title": "It would be helpful for the Canadian…", "text": "It would be helpful for the Canadian market to have the amount of the article in Canadian as well as US dollars.", "rating": 4}, {"title": "I would order more except some venders charge TOO MUCH for shipping", "text": "I would order more except some venders charge SO much for the shipping, taxes & insurance.  Most venders are very responsive!", "rating": 4}, {"title": "Mostly fine website but forcing me to…", "text": "Mostly fine website but forcing me to enter a password was not necessary. I'd prefer to order as guest. Nice items for sale.", "rating": 4}, {"title": "It was easy to order the ruby flashed…", "text": "It was easy to order the ruby flashed glass souvenir dog..very original item and we are looking forward to receiving it.", "rating": 4}, {"title": "I have not received a notice of this…", "text": "I have not received a notice of this sale from you nor have I received what  once was a daily drop...What happened??", "rating": 4}, {"title": "Got what I was looking for at a fair…", "text": "Got what I was looking for at a fair price. Skillet was carefully wrapped for shipment. Thank you for your great service.", "rating": 4}, {"title": "Excellent products and friendly…", "text": "Excellent products and friendly efficient service", "rating": 4}, {"title": "Hard site to list items sometimes…", "text": "Hard site to list items sometimes listings disappear before I am done having to start all over!", "rating": 4}, {"title": "Difficult to submit offer", "text": "Difficult to submit offer. Tried 3 times.Had to log out, restart and login again.Otherwise ok.", "rating": 4}, {"title": "Prices are generally pretty high on…", "text": "Prices are generally pretty high on Ruby Lane, but the quality of the antique goods sold is equally high.", "rating": 4}, {"title": "So far things are fine", "text": "So far things are fine. My first buy at this site. I will wait to see how things go.  ThanksLee", "rating": 4}, {"title": "Great stuff", "text": "Great stuff, found just what I was looking for. Shipping was a bit higher than I expected.", "rating": 4}, {"title": "Beautiful merchandise and quick shipping", "text": "Beautiful merchandise and quick shipping ", "rating": 4}, {"title": "excellent service and delivery on time", "text": "excellent service and delivery on time one issue is the shipping is expensive", "rating": 4}, {"title": "Ruby Lane gets four stars for their…", "text": "Ruby Lane gets four stars for their service and assistance.  After all, no one is perfect!", "rating": 4}, {"title": "Looks like a great product and the…", "text": "Looks like a great product and the price was good.  A little hard to navigate the site.", "rating": 4}, {"title": "First time using this site", "text": "First time using this site, we'll see how it goes after I receive my item.", "rating": 4}, {"title": "Love the variety of goods!", "text": "I enjoy seeing the wide variety of goods. Checkput process is easy!", "rating": 4}, {"title": "Is there an app", "text": "Is there an app? I would use the site more often if there was an Android app.", "rating": 4}, {"title": "The site is beautifully presented", "text": "The site is beautifully presented, has quality items for sale and does not seem to sell cheap counterfeit/fake ‘antique’ rubbish from India/China like Etsy or eBay. EBay and Etsy are full of such tat and it is annoying to wade through thousands of listings of fake antiques looking for the real deal. As such I rarely buy vintage or antique items off these websites. However, the 2 step purchasing process on Ruby Lane of having to put in an order and then waiting for an invoice is cumbersome. I have also had a few sellers drastically bump up postage costs from what was noted in the listing. The 2 step purchase process gives them the opportunity to do this and as a buyer, there’s not a lot you can do other than cough up the extra postage. This experience is rare however as the vast majority of sellers I’ve dealt with are honest and professional to deal with.It is also sometimes difficult to find the invoice in your purchase history - instead you have to go back to the original email sent by sellers. Seller feedback is also difficult to access. I’m not talking about the number of stars, I’m talking about actual written feedback of a purchaser’s buying experience with a seller. Given that items purchased are often significantly more expensive than those purchased from eBay or Etsy it would be good to be able to easily find seller reviews.Sale prices should also be able to be viewed in currencies other than USD or GBP - I have to separately google prices via an online currency converter. Main currency conversion should be available.", "rating": 4}, {"title": "RubyLane is much easier to work with…", "text": "RubyLane is much easier to work with than some similar sites.", "rating": 4}, {"title": "Website cumbersome and", "text": "Website cumbersome and , dont like all payments going thru paypal", "rating": 4}, {"title": "I just placed my order", "text": "I just placed my order. we will see when it arrives.", "rating": 4}, {"title": "Interface with customer is good under…", "text": "Interface with customer is good under my experience.  David", "rating": 4}, {"title": "Thank you", "text": "Thank you.  Two more Callot Dwarfs added to my collection!", "rating": 4}, {"title": "Great site", "text": "Great site. Easy to order and pay. Thanks", "rating": 4}, {"title": "Good price for the item.", "text": "Date of experience: March 31, 2023", "rating": 4}, {"title": "Very pleased to have received my order.", "text": "Date of experience: September 29, 2021", "rating": 4}, {"title": "Item purchased", "text": "The price was great", "rating": 4}, {"title": "Fast response to my questions.", "text": "Date of experience: May 02, 2022", "rating": 4}, {"title": "Easy purchase", "text": "Date of experience: December 08, 2021", "rating": 4}, {"title": "Checkout can be confusing", "text": "Checkout can be confusing. Otherwise a nice selection of merchandise.", "rating": 4}, {"title": "Have not yet received my purchase will…", "text": "Have not yet received my purchase will write my total review when I receive it", "rating": 4}, {"title": "Really cool selection", "text": "Really cool selection. Shipped fast. But I found the shipping cost exorbitant.", "rating": 4}, {"title": "We have purchased some unusual items on…", "text": "We have purchased some unusual items on Ruby Lane, and like how easy the payment process is.  The one thing that we hope they correct is once you commit to purchasing an item, you no longer get access to the page that offered the item.  Gone is the wonderful writeup the seller did and the photos that accompany the writeup.  Hopefully this oversight will be corrected.", "rating": 4}, {"title": "Took a while to fin precisely what I…", "text": "Took a while to fin precisely what I wanted. But usually do.", "rating": 4}, {"title": "Awhile back I recommended Rubylane…", "text": "Awhile back I recommended Rubylane begin utilizing a similar payment method to the one employed on ebay.  On my previous Rubylane purchases the seller had to first send an invoice and it took 2 or 3 additional steps for the buyer to complete the purchase transaction (which was confusing at times).  I normally use paypal and ebay purchases seemed much simpler and straightforward.  I'm glad to see that Rubylane has now instituted a much simpler/easier method of payment.  Ebay may still currently have a slight edge on ease of tracking shipments and leaving feedback - since I hadn't purchased anything from Rubylane for awhile this may also have changed and become easier.  Anyway, I'm glad that Rubylane is taking the initiative to make the experience of buying easier/quicker.  Thanks and best regards.Mike", "rating": 4}, {"title": "I love the ruby lane", "text": "I love the ruby lane, but I am not amused, when things, I must have, are no more available. So I must looking everyday for loveley things.", "rating": 4}, {"title": "Love shopping on Ruby Lane", "text": "Love shopping on Ruby Lane, however, the invoice system needs an overhaul, it should be simpler, l wait two days for an email with my total amount to be sent,  two lots of sale confirmation emails doesn't help, can never find the right button to complete a sale, please, make it simple, like Ebay where the invoice is easy to find & pay as soon as it is received, my only complaint.", "rating": 4}, {"title": "Unable to Locate Item Purchased!", "text": "I would have given a five but for two reasons: The search program should be stronger to avoid hits that are pages and pages long.  Some dealers are unable to find the item during the purchasing process.  Ruby Lane to admonished these dealers.  One could not find my item and not only loss a sale but loss a future sale of well over $1500.  The dealer loses and so does Ruby Lane.  The first experience was acknowledged by the dealer and very sincere.  The last experience was irritating and I would never purchase from him again.  Good luck finding another buyer for these items. With that said, I love the dealers on Ruby Lane.", "rating": 4}, {"title": "I am still waiting to find out how much…", "text": "I am still waiting to find out how much shipping will cost on a purchase I made several hours ago.  I am new to this business forum- I will see how things transpire.  Andrew Garlisi MD", "rating": 4}, {"title": "I have never had a problem.", "text": "I have never had a problem with any of your shops.  Everyone ships on time and answers questions immediately.  I do think that some of your vendors need to think more about their competition, depending on the category.  For instance, for jewelry, I feel I can go to The Real Real and get something that I like just as well and get it marked down.", "rating": 4}, {"title": "Very satisfied with purchases", "text": "Very satisfied with purchases. The shipping and sales tax are increasing. I have been paying 14-20 for standard shipping and declining insurance and only buy red tag sale items to off set shipping costs.", "rating": 4}, {"title": "Sometimes I find it hard to locate…", "text": "Sometimes I find it hard to locate items again.I\"ve been told its the search engine. 'perhaps it is.TX, SL", "rating": 4}, {"title": "I find making purchases on Rubylane…", "text": "I find making purchases on Rubylane easy With all the many items the have you are spoilt for choice. I hope to be back soon. I hope you all have a great day.", "rating": 4}, {"title": "I do not understand why you charge sale…", "text": "I do not understand why you charge sale tax. I do not think you are a million dollar company. You used to have a great search. Now it no longer remembers what you like(this changed quite some time ago but I still miss it)", "rating": 4}, {"title": "Love shopping here but I have had…", "text": "Love shopping here but I have had trouble processing my order through paypal", "rating": 4}, {"title": "Most of the RUBY LANE sellers are…honest in their review", "text": "Most of the RUBY LANE sellers are honest in their description of an item. butsome won't list every defect, unless asked.Also, shipping costs on some small items seem overly costly.", "rating": 4}, {"title": "A trust worthy site", "text": "A trust worthy site. I feel more comfortable buying off them than I do from eBay. I think the vendors on Rubylane aren’t about to jerk you around, since that affects their rating and reputation. A big win for me…", "rating": 4}, {"title": "I always question the shipping amount…", "text": "I always question the shipping amount being charged by the vendor...it seems too high.", "rating": 4}, {"title": "Little experience", "text": "I have Just now signed up with Ruby Lane and therefore I have not had enough experience to make a proper review.", "rating": 4}, {"title": "Found a Treasure!", "text": "Very nice website and enjoyed looking at the choice of items.  Had trouble finding where to go to set up my account.  Finally figured it out.  Ordered one item and seemed to go very well.  Will enjoying coming back to this site for different items.", "rating": 4}, {"title": "Had a very good experience with the…", "text": "Had a very good experience with the seller. However, the ruby Lane site will not accept my UK postcode as valid or my UK phone number. This should be looked into.", "rating": 4}, {"title": "Confusing payment process", "text": "Confusing payment process and  instructions.  Seller accepted offer, but have to wait for seller to email me and send / submit payment form to process of credit card.  Too many steps.  Leads to frustration and anxiety in knowing covetted item is mine. Rubylane should have better payment process.", "rating": 4}, {"title": "Not easy to search", "text": "Not easy to search, can be annoying to find purchase orders, favorites but great stuff!", "rating": 4}, {"title": "Great services provided by Ruby Lane…", "text": "Great services provided by Ruby Lane with quality products and fast shipping services", "rating": 4}, {"title": "Great quality and prices!", "text": "I really like the variety that I can find at Ruby Lane. I have bought from this site several times. Most recently I did email one shop owner about an item in which I was interested. I never received a response from that owner. Other times I have dealt with very proactive owners who have been exceedingly easy to deal with. I will continue to shop with Ruby Lane But will be selective with owners that I have used previously.  The prices are usually great and the quality equally as good.", "rating": 4}, {"title": "Had a HARD time adding my address!", "text": "Had a HARD time adding my address!When I filled out one line then the window for address/phone # would disappear.", "rating": 4}, {"title": "I've been with you for only a short…", "text": "I've been with you for only a short time some transactions were easy, some not. I believe a customer rating number would greatly help both buyer and seller. Case in point, I was thought of as spam or a scam artist because the seller didn't believe me. A simple call, the fist Time, would have cleared it up. They almost lost the sale. Some vendors change things up, thus confusing those that have already made purchases, that doesn't help the BUYER, I DONT REALLY CARE THAT IT MADE IT EASIER FOR YOU, IM THE ONE THAT COUNTS. IF ITS ISNT BOKEN, THEN DONT FIX IT🤔 Mr. G. Hansen", "rating": 4}, {"title": "I LOVE RUBY LANE--BUT ONE PROBLEM", "text": "I LOVE RUBY LANEONE PROBLEM--I HAVE MANY THINGS IN MY CART--IT IS HARD TO ISOLATE ONE ITEM OUT OF MY CART TO PAY FOR IT.I USUALLY HAVE TO HAVE THE SELLER REQUEST PAYMENT BY SENDING A MONEY REQUEST TO MY PAYPAL,HOW DO I ISOLATE ONE ITEM OUTOF MY CART TO PAY FOR IT?", "rating": 4}, {"title": "Was not easy to place an order when a…", "text": "Was not easy to place an order when a new customeralmost  gave up and leave site.", "rating": 4}, {"title": "I enjoy occasionally buying from Ruby…", "text": "I enjoy occasionally buying from Ruby Lane.  I am a vintage Barbie collector and they have various sellers with great items for sale.  Less chaotic than Ebay.", "rating": 4}, {"title": "First Time using this app", "text": "This is my first time using this app. I would rather give this review after I received my item I ordered. So far everything is working out.", "rating": 4}, {"title": "I am a first time buyer/looker on Ruby…", "text": "I am a first time buyer/looker on Ruby Lane.  Great choices, of course, I am not clear on how to handle offers.  I did one but am not sure it went anywhere.Looking forward to more choices.", "rating": 4}, {"title": "Your site is simple and functional to…", "text": "Your site is simple and functional to utilize and your customers' administrations are exceptionally quick and powerful. In any case, I am not happy with you as a result of your low-speed site stacking page.", "rating": 4}, {"title": "Three site Criticisms/Suggestions", "text": "I have Three site criticisms/suggestions. 1.) I would like it if Customer Feedback and Feedback ratings existed on Ruby Lane similarly to how they do on eBay. If they do, I didn't see any sign of it. I feel the possibility of positive or negative feedback is a good incentive for a seller to pack things well, provide tracking and ship in a timely manner after purchase as well as feedback about buyers, as incentive for buyers to be easy to work with and pleasant. 2.) I would have felt more comfortable if the page that had me select payment method had said \"Payment will be completed on next page\". I was nervous that by selecting PayPal, it would automatically charge my default PayPal payment method, which was not the card on PayPal that I wanted to use. Thankfully it did not do that and worked fine, but adding that line would be good.3.) I would like it if Ruby Lane had \"Wish Lists\" that would send buyers notifications if new listings matching Wish-list item keywords were posted.Still, I enjoy the site layout, ease of use, wide variety of payment options and am happy to be a new member. As long as Ruby Lane has good telephone customer service and good seller and buyer support, I could foresee my Family and I doing a lot of business, as buyers and sellers on Ruby Lane, down the line.~David", "rating": 4}, {"title": "Great Shopping Experience!", "text": "Great Shopping Experience.  Would give it five stars if better pictures were available.", "rating": 4}, {"title": "Timing is everything", "text": "Ruby Lane has some nice things. In my opinion, most of them are overpriced, but they become market priced at the 50% sale. Except for endangered species, that's usually when I buy.", "rating": 4}, {"title": "I enjoy the RubyLane sellers", "text": "I enjoy the RubyLane sellers.  Sometimes I stop browsing  and move to the competitor which does not solely offer vintage and antiques but is much easier to use. Why not develop an app? It would be much more convenient.", "rating": 4}, {"title": "Quality merchandise", "text": "Quality merchandise. Reasonable price.", "rating": 4}, {"title": "excellent site for shopping but prices…", "text": "excellent site for shopping but prices can be high so do your research", "rating": 4}, {"title": "One vendor dispute", "text": "I have only had one vendor that i had trouble with a return I had to dispute the charge with my bank. I won. Other than that I  have had a positive experience with all other shops on Ruby Lane. Thanks Karen W", "rating": 4}, {"title": "Service and variety is good and I…", "text": "Service and variety is good and I really enjoy Ruby Lane.   It is, however, difficult to understand why most dealer's shipping costs are reasonable, but some are ridiculously high.  This has caused me to cancel several orders in the past.  Shipping should not be more than the purchase price of a single item.  I ordered a single piece today from a vendor, and the shipping cost alone was nearly $5 more than the item's price.  I would typically not have continued with the purchase, but it is a piece that I wanted.  I'm sure this is what the vendor was relying on, but it does seem like a way to gouge the customer.  I won't order from that particular vendor again.", "rating": 4}, {"title": "Searching thru the many pages (even…", "text": "Searching thru the many pages (even after narrowing search a few times) was tedious.  The ability to return to a specific page number in a search list would greatly improve the ability to compare items of interest.Being unfamiliar with Ruby Lane, the status \"offer\" was not clear to me.  I did not see any definition for it.  What does it signify in case I return to your site?", "rating": 4}, {"title": "I think Ruby Lane has beautiful…", "text": "I think Ruby Lane has beautiful merchandise great prices I just wish the checkout process was a little easier being a new customer it’s very confusing I think it could be streamlined to be easier for new customers especially", "rating": 4}, {"title": "I am still trying to figure out how to…", "text": "I am still trying to figure out how to pay for my purchase on-line.  There was not a place for my credit card.", "rating": 4}, {"title": "At first I wasn't sure if my purchase…", "text": "At first I wasn't sure if my purchase went thru.my son bought my 1st phone 20yrs.ago.i have my own phone for a long time.so I guess that was recognized by your co.I collect old glass ie.carnival or vintage .I look forward to receiving the blue glass lady from Ruby co.Thank you,AnnD.O'Lonecan I pay with my visa credit card¬ I don't have pay pal.", "rating": 4}, {"title": "Use Chrome NOT Safari", "text": "This website was rather unresponsive with Safari. Had to switch web browsers to complete the sale. Rather annoying.", "rating": 4}, {"title": "I LOVE everything about this vendor", "text": "I LOVE everything about this vendor. Gorgeous items! Responsive service!My only complaint is with Ruby Lane's checkout process which somehow involves PayPal. It is very confusing, unlike any other site I have purchased from. The Ruby Lane payment process makes a buyer seem like they are, and must, submit payment through PayPal. I prefer to use my credit card, Visa, for purchases, like many who like to use their own credit cards. Yet the option to pay with a credit card does not come up until after it appears the buyer has already purchased the item(s) through PayPal. Very confusing. Why does a purchaser have to go through this? Why is Ruby Lane's payment process like this? This is not fair to the quality vendors on the site who deserve a better payment process from Ruby Lane.", "rating": 4}, {"title": "Three items purchased", "text": "I have just ordered three items from three different vendors. The process was fairly easy and now I am waiting for their delivery. Thank you.", "rating": 4}, {"title": "great place to check out vintage fashion", "text": "Date of experience: March 21, 2021", "rating": 4}, {"title": "Some pages stuttered when loading", "text": "Some pages stuttered when loading, and going back to the list of items from viewing one item was annoying, because eod have to scroll back to find where I was before. Otherwise an enjoyable experience", "rating": 4}, {"title": "All went well until after I had…", "text": "All went well until after I had provided my Canadian Shipping and Billing address, and Ruby Lane had provided the amount of the sale in Canadian currency, and then I was asked for my (US) zip code! What?!?! Not an easy site to work with when it comes to signing up (my original email address was not recognized, had to sign up with a second one) or checkout. Some further attention to the automatic steps/links would help a lot! But I do love the goods, and the descriptions are excellent 😊.", "rating": 4}, {"title": "Great site generally but room for improvement.", "text": "Great site where lots of beautiful goodies are to be found for serious collectors. Whilst there are undoubtably some lovely items for sale here, sellers do seem to have a tendency to overprice and will often drastically reduce prices when an expression of interest made, a good thing in one way, but what does it say about the original prices stated? The site is generally easy to navigate, but could be easier, for example, I’d like to be able to easily search for items by sellers in my own country but can’t see any easy way to do that. In my experience, the sellers have been friendly, trustworthy and conscientious when packing and posting items. The site is always a visual treat.", "rating": 4}, {"title": "Looking forward to receiving the Mickey!", "text": "Date of experience: March 04, 2021", "rating": 4}, {"title": "Ruby Lane", "text": "It was good doing business with the seller.", "rating": 4}, {"title": "A little upset a seller was not willing…", "text": "A little upset a seller was not willing to send to Canada from the USA. Overall good experience", "rating": 4}, {"title": "Easy and convenient", "text": "Shopping on Ruby Lane is easy and convenient. My only complaint is that the store I purchased from refunded my purchase amount because they did not have the product in stock. Not the fault of Ruby Lane however it was still disappointing.", "rating": 4}, {"title": "Bad for my budget...and my self control.", "text": "I love this site, bad for my budget though it is. My one issue (which isn’t anyone’s fault) is that shipping to Australia is expensive. I’ve had a couple of vendors actually refuse to sell to me, saying “it’s not value for money.”We know it’s not, but we have to pay it anyway.", "rating": 4}, {"title": "Constantly having to sign in", "text": "My main complaint is that I have to sign in so often. If I haven't been on the site for a few hours I have to sign in again. IMO signing in should be required MUCH less frequently. Especially if using a known device and IP address.", "rating": 4}, {"title": "I enjoy shopping Rubylane", "text": "I enjoy shopping Rubylane, my experience has been positive... too bad prices are not more competitive...", "rating": 4}, {"title": "I was unable to change my shipping…", "text": "I was unable to change my shipping address no martter how many times I tried, so had to email the vendor to tell her where to post my package.", "rating": 4}, {"title": "The one problem I have with Ruby Lane…", "text": "The one problem I have with Ruby Lane is the sign in.  I get an email saying something on my wish list is on the site.  I see it, try to favorite it and it makes me log in to Ruby Lane.  It logs me out if I use the back button to go back to the item I originally went to look at.   Then I have to re-search it to find it.   Inconvenient.  Otherwise, a bit pricey, but I LOVE IT..", "rating": 4}, {"title": "I love the items that are sold on the…", "text": "I love the items that are sold on the Ruby Lane website.  I have been shopping on the site for many years.  However, this year I ran into two separate situations involved the attempted purchase of diamond earrings.  The first situation occurred when I wanted to place the earrings on layaway.  First, they told that it was okay and sent me pictures for my inspection.  One day later when I got ready to make a payment they old me that the earrings had been sold.  The second situation was similar, once again attempting to purchase diamond earrings but this time I was told that they pulled the item back and they said they were no longer available for purchase.  I was really saddened and was looking forward to purchasing those items.", "rating": 4}, {"title": "I am very happy with the cameo we…", "text": "I am very happy with the cameo we ordered, however it did not come with any of the information about it and we can’t pull it up on the site. Update, contacted Ruby Lane she was kind enough to guide me to the information. I didn’t print the information so I couldn’t explain the broach to my wife. This makes it much more precious! Thanks Ruby Lane.", "rating": 4}, {"title": "Quick response to question", "text": "I asked for a video of a piece of jewelry so I could get a better idea of what it looked like. I got an answer right away, so that was great!", "rating": 4}, {"title": "I have always been very pleased with…", "text": "I have always been very pleased with any item I have purchased on Ruby Lane", "rating": 4}, {"title": "Already made good experience with ruby…", "text": "Already made good experience with ruby some years ago, was worth trying it again, hopefully making the same experience.Unfortunately it's Brexit now, wonder what I'm going into, how business is affected over here in Germany.", "rating": 4}, {"title": "my offer was counter-offered…", "text": "my offer was counter-offered immediately and counter offer was accepted within minutes", "rating": 4}, {"title": "I find this method of ordering so very…", "text": "I find this method of ordering so very frustrating. What happened to order byphone?", "rating": 4}, {"title": "You need to put a layway button on your…", "text": "You need to put a layway button on your sight as it is impossible to buy anything that way", "rating": 4}, {"title": "I’m an avid doll collector and have…", "text": "I’m an avid doll collector and have bought many dolls and related items.I admire searching for them as Rubyland has a plethora of dolls. I find it hard not to find something that I usually end up buying (goodie) I also like the fact that I don’t have to wait to buy because I am very impatient. On a flip side I have been disappointed with some sellers who ignore my offers and don’t bother to answer my “email”. On one occasion I sent a second email to the seller asking if ignoring customers email was normal and he answered “those emails are generated by Rubylane and we don’t always get them.”Regardless he never asked me about my offer. Very interesting!", "rating": 4}, {"title": "Needs easier checkout/love selection", "text": "I love the items but having to wait for full price to pay for the item isn't optimal. It would be better if it could be automatically calculated based on location of the seller and buyer.", "rating": 4}, {"title": "This was my first purchase", "text": "This was my first purchase at a shop on the Ruby Lane website.  I have had an account for years, but have only browsed in the past.  I found the checkout process easy to navigate, with only a slight delay to figure out how to change my shipping address.  Should I encounter any issues with the prompt delivery of my order, I will update this review.", "rating": 4}, {"title": "Ruby Lane pictures are easy to review…", "text": "Ruby Lane pictures are easy to review and well set up.  Prices do vary by seller, but I've seldom found a dealer who would not work with me on an item.", "rating": 4}, {"title": "Adding to a family collection", "text": "My partner inherited this pattern of a demitasse set, but the sugar bowl was missing its lid and he didn’t have the tray.This will be both his birthday and Valentines present-yes born on February 14th!Excited to receive this purchase!!", "rating": 4}, {"title": "First Purchase", "text": "Other than being somewhat difficult to figure out how to \"join\" or \"sign-ups\" to be able to make a purchase, the shopping and purchasing process was fairly intuitive and easy!", "rating": 4}, {"title": "i have bought some items by Rubylane…", "text": "i have bought some items by Rubylane before, yesterday I am blocked by Rubylane and I could not contact with Rubylane customer service to complain, what's happen to block me and let me miss a several items,thanks!", "rating": 4}, {"title": "The website is very easy to use", "text": "The website is very easy to use.  I only wish the zoom option was a little better.  One particular doll I liked did not zoom.  In fact, it made the photo smaller.  If there is an email setting to notify me of specific dolls I collect that become available, I am not aware of it.  Overall, it is a nice website but would like better features while shopping.", "rating": 4}, {"title": "Great e-commerce", "text": "Easy platform to find wonderful treasures. The communication proceses between buyer and seller is perfect.", "rating": 4}, {"title": "My only concern is that it is not clear…", "text": "My only concern is that it is not clear at all how long the shipping will take and also the difficulty in changing the address you have saved for me.", "rating": 4}, {"title": "Beautiful things for sale", "text": "Beautiful things for sale.  I have found most sellers to be really lovely.  There are a few sellers that don't describe the condition of items truthfully and I have had my fingers burnt in the past and paid too much.", "rating": 4}, {"title": "I find website difficult to use when…", "text": "I find website difficult to use when checking out.  Oftentimes I'd like to refuse insurance but there's no option to do that on many vendors checkout page.  Also and especially, prices are much higher on Rubylane than for comparable items on other sites.", "rating": 4}, {"title": "Hard time signing in", "text": "At first, l had a difficult time signing in.  Site wouldn't take my  email/password, but eventually it did work.  Other than that, all was fine.", "rating": 4}, {"title": "Shipping address doesn't show before confirming purchase.", "text": "The item looks great. When I purchased, it only asked for my zip code and it did not show the shipping address. The shipping address did not show until I got the confirming email-AND IT WAS AN OLD ADDRESS!I've tried to fix it. This didn't used to happen. It seems to be a recent upgrade that submits the order without confirming the shipping address, which didn't match the zip code I put in!The item looks great on line, hopefully I'll get to see it in person.", "rating": 4}, {"title": "My Experience", "text": "Being able to access my account from my android would have earned 5 stars instead of 4, but I had to get my laptop. The account icon is there, but when you click on it nothing happens. Works fine using laptop.My shopping experience was great & seller was fantastic, very accommodating. Can't wait to receive my purchase!", "rating": 4}, {"title": "Easy to navigate products.", "text": "Easy to navigate products. Fast checkout. Beautiful items, well described. Having received my product yet.", "rating": 4}, {"title": "Excellent inventory", "text": "This site is remarkable, great inventory my first purchase that’s why I gave four stars , I will let you know how it go s , then I will purchase more in future respectfully submitted,", "rating": 4}, {"title": "Quality of stones are not the bestv", "text": "Good designs but quality of stones are not the best", "rating": 4}, {"title": "I always found such beautiful items on…", "text": "I always found such beautiful items on Ruby Lane.  The shop owners are very nice.  Have received items in a timely manner & I am pleased with my past purchases.  Thank you", "rating": 4}, {"title": "I had a difficult time getting into your website", "text": "I had a difficult time getting into your website. You confirmed purchase before seller and now I,m not sure how to proceed with payment", "rating": 4}, {"title": "Well done!", "text": "Well done!Nice work!", "rating": 4}, {"title": "I had a issue w/filling in the…", "text": "I had a issue w/filling in the address...Your site insisted that my address read Spring Hill, Fl  34604...It should be Brooksville, Fl  34604...It would not allow me to put in Brooksville.", "rating": 4}, {"title": "The Snow Village Chapel arrived in…", "text": "The Snow Village Chapel arrived in perfect condition. My only complaint is that for whatever reason I couldn’t track the arrival. It took almost 2 weeks to arrive but not surprised since it came by USPS.", "rating": 4}, {"title": "I have ordered many items from venders…", "text": "I have ordered many items from venders on RubyLane over the last few years and have rarely been disappointed. I have ordered fewer items after RubyLane began to add taxes & (it seems) higher mail rates. I realize this is mostly a factor/decision of the individual vendors. I know of few sites (like none) that offer the variety of items that one can find on RubyLane. My problem is not being rich & now running out of room in my house for more items I want to buy (and can afford) to buy. Apparently, that doesn't stop me!", "rating": 4}, {"title": "I was happy and excited to buy a…", "text": "I was happy and excited to buy a lovely, vintage doll from a wonderful seller. The page display of her and her details helped me make the decision to buy. Navigating the Ruby Lane web page to make the purchase was pretty basic. I wanted to send her as a gift to a friend but I did run into an obstacle (that the seller helped me to resolve). I would like to share with you, Ruby Lane, an idea that would be a way to navigate that obstacle as well as a nice benefit for buyers using Ruby Lane.Your program did not allow me to separate the billing address from the shipping address, making it difficult to ship what I bought as a gift to the recipient. I also thought of another scenario. If the purchased item needed some adjustments or repairs (at a \"Dolly Spa\" maybe?) that the buyer wanted to arrange, shouldn't the buyer have the opportunity to have the item shipped to the person/company that the buyer was going to have do those repairs? To have the ability to separate the two addresses would benefit buyers in both these cases (and save a little money). Thank you for listening.JB", "rating": 4}, {"title": "Straightforward, good communication and I would use again", "text": "I found a great picture and made an offer which was acceptable to the vendor. The process was straightforward and very simple and I was pleased with the purchase. However, there was some minor confusion over how the offer was processed by Ruby Lane, but both the vendor and Ruby Lane were very helpful in resolving. I would use again.", "rating": 4}, {"title": "The website is great, payment process not", "text": "The website is great, but the payment process is not.  When combining purchases from one dealer, it seems very difficult for them to combine shipping and insurance fees. It gets very frustrating as a buyer.  Irecently s had an item sell while I was trying to figure out the process.", "rating": 4}, {"title": "Had a little bit of a confusing time…", "text": "Had a little bit of a confusing time ordering because evidentially the two plates didn't come from the same place...that being the case, it made the shipping prices high!", "rating": 4}, {"title": "I wish Ruby Lane had a \"Watch Item\" feature…", "text": "I wish Ruby Lane would have a \"Watch\" feature like Ebay's, where potential customers can click and \"watch\" an item as they decide whether or not to buy. It would also be great if you could add a \"Purchase History\" feature.I'm new to Ruby Lane, but have now bought a few antique dolls - some on layaway - and had to have the seller walk me through the layaway process as Ruby Lane instructions aren't clear.Thanks for letting me suggest things! Dee", "rating": 4}, {"title": "First time user", "text": "First time user, very easy!", "rating": 4}, {"title": "Holding thumbs", "text": "I got an immediate direct response from one of the sellers I bought from, but no response from the others. I spent a lot of money, so, hopefully, the items arrive quickly and safely.Otherwise, this is my second experience buying from Ruby Lane, and it has been pretty good.", "rating": 4}, {"title": "Communication around our nation has…", "text": "Communication around our nation has been discombobulated lately...I know I paid for my purchase, but yet I get a message that I have yet to pay🤦🏽‍♀️", "rating": 4}, {"title": "New customer and was very pleased with…", "text": "New customer and was very pleased with the offerings.  Enrolling as a customer was a bit tedious.  I'll be interested to see how quickly the suppliers respond to emails and counter offers.  So far, so good.", "rating": 4}, {"title": "I purchased a pearl ring", "text": "I purchased a pearl ring for my daughter as a gift.  It was the first time I purchased on the Ruby Lane website, my daughter having purchased several times in the past.  The website was okay as compared to others.  It was difficult to figure out how to place the order since you can't finish the purchase as a \"Guest\" and then I had to figure out how to create a username and password with no instructions as to how to do that.  The website should be upgraded to be more seamless and transparent.", "rating": 4}, {"title": "Good product", "text": "I love this slotIt satisfied it's purpose", "rating": 4}, {"title": "Nice merchandise", "text": "This ring is nice. The amethysts are a pretty purple  and cut, color and carat are very nice. 14k setting is unusual and l like unusual jewelry.  It's a big ring, which l also like.", "rating": 4}, {"title": "Everything went well on Ruby Lane's…", "text": "Everything went well on Ruby Lane's side of the transaction. Prompt receipt of my purchases, as well as prompt mailing of the products I have shopped at Ruby Lane for years. The majority of my transactions went smoothly.", "rating": 4}, {"title": "Everything was great except it was…", "text": "Everything was great except it was difficult checking out.", "rating": 4}, {"title": "Just one major glitch...", "text": "Have been shopping on Ruby Lane for years.  My only gripe would be that one can no longer remove an item from the shopping cart, which makes it tough if you want to narrow down an order with a particular seller at checkout.  Yesterday, I let an order go because of the fact I couldn't select the items I actually wanted to keep from a particular seller when I attempted to pay.", "rating": 4}, {"title": "Customer service team is helpful and…", "text": "Customer service team is helpful and prompt. Greatly appreciated buy a non-savvy computer purchaser.", "rating": 4}, {"title": "There was a problem with payment", "text": "There was a problem with payment. Eventually it all worked out.  Otherwise excellent transaction.", "rating": 4}, {"title": "I would have rated my experience as…", "text": "I would have rated my experience as excellent except for one purchase where I asked for - and was refused - an alternative (i.e. less expensive) method of shipping and to decline insurance for the item I bought. (Other sellers have been very accommodating regarding similar requests.) As a result, I paid $49.30 in shipping and insurance ($39.30 + $10) for an item that cost $98. I felt that the seller was unreasonable in denying my request and will not purchase anything from her again.", "rating": 4}, {"title": "Your service is the best", "text": "Your service is the best, and your inventory veratile and of high quality. There two problems that prevent me from purchasing from Ruby Lane: your prices are very high; and few of your shops ship abroad.", "rating": 4}, {"title": "The Seller is excellent.she saved the sale", "text": "The Seller, Jacqueline Eye Candy Boutique saved the sale. We had agreed on my offer, but Ruby Lane, without notice, declined it,and a higher offer appeared. Jacqueline explained (exactly) what I should do.I followed directions, I paid our agreed offer, circumventing “bogus” offer that had appeared. I made immediate Payment via PayPal.Transaction complete. Ruby Lane, what happened? I saved emails showing the incorrect response to my offer. Jacqueline apologized, and could not explain what had happened, and said his had never occurred before.", "rating": 4}, {"title": "Everything was going fine until payment…", "text": "Everything was going fine until payment time, then I had to wait until someone else contacts me so that I may pay?!  According to the payment information listed, I am listed to use pay pal to pay, which is not the case?!  I hope I can switch to a regular credit card when the shop owner contacts me?!Earl Langley!!", "rating": 4}, {"title": "As a 70 year old...I have noticed a…", "text": "As a 70 year old...I have noticed a problem with sensitive touch screen computers putting an item in the cart. I had difficulty seeing a way to remove an unwanted item. I could not get anyone on the site to help me. This caused me to miss a purchase of an item I wanted to buy but could not get rid of the unwanted in the cart.", "rating": 4}, {"title": "I love your beautiful and unique…", "text": "I love your beautiful and unique furniture.  Should be able to pay when you order the furniture.  Wanted to find a small chair that matches and mirror and table.  Hard to find.", "rating": 4}, {"title": "Excellent site for quality items", "text": "I searched far and wide before finding the small silver candleholders on Ruby Lane. I didn't know about this site but will definitely use it for future service. Their purchasing process is quick and easy, and PayPal is available for payment. Thank you Ruby Lane!", "rating": 4}, {"title": "Payment via PayPal confusing", "text": "Payment via PayPal confusing. Paid and then was told dealer will send an invoice", "rating": 4}, {"title": "Waiting on product to ship", "text": "Date of experience: November 05, 2020", "rating": 4}, {"title": "Site improvements are good", "text": "Site improvements are good, been a customer for years. Thanks.", "rating": 4}, {"title": "I received the item I purchased and it…was here in a timely manner easy to do business with", "text": "I received the item I purchased and it arrived very well wrapped and protected. Ruby Lane sent my package priority mail an upgraded they provided and I was much appreciated. The time difference of our locations made communication lag a little but I would do business again with them.", "rating": 4}, {"title": "First time user - Excellent Price", "text": "I was looking for specific items.  They had several in stock at better prices than I saw from other competitors. The website was also much easier to navigate than several of their competitors.  I will definitely use them again.", "rating": 4}, {"title": "Rubylane is my online “go to” place for antiques.", "text": "Rubylane is my online “go to” place for hard-to-find antiques. I am glad that Rubylane does not disappoint when it comes the many different choices and prices. All my purchases have so far safely arrived. And I always get compliments whenever I wear or show my Rubylane finds. They think they cost me an arm and a leg when in truth Rubylane shops sometimes give the best bargains.", "rating": 4}, {"title": "I love the jewelry and shops and owners…", "text": "I love the jewelry and shops and owners I find on Ruby Lane. However, I find the search engine difficult and frustrating. Trying to locate a certain shop or a certain item is nearly impossible. I hope that system will be improved.", "rating": 4}, {"title": "I like your vintage products", "text": "I like your vintage products. I am interested in shopping for more items in the future. However your computer site is very complicated and hard to navigate.You may want to simplify redundant, needless steps. Also make it clear what info you are looking for. ex. \"sign in OR create an account.\" You only ask to sign in. You do not ask to \"create an account' if you do not have one.\" You may want to correct that.", "rating": 4}, {"title": "Nice selection  and great venders but…", "text": "Nice selection  and great venders but complicated checkout process", "rating": 4}, {"title": "For the most part I love shopping on…", "text": "For the most part I love shopping on Ruby Lane but I have had issues lately.One vendor I was trying to buy from wanted me to send her a money transfer instead of paying with Paypal.When I checked with PP they said she had a bad record with them & they wouldn't let the transaction so through until she fixed the problem ! After communicating with her several times I & her not fixing the problem I had to lose the doll hat I wanted to buy because I was not going to send her a money transfer !! Otherwise I have enjoyed my experience !", "rating": 4}, {"title": "Not enough info on jewelry", "text": "I don’t like the new jewelry site. I don’t know what size a necklace is. I don’t know what size a bracelet is, and l have no idea how it will look because one picture just doesn’t work for me. Other then that, the new cleaner look is fabulous.", "rating": 4}, {"title": "I love Ruby Lane", "text": "I love Ruby Lane, I just wish that multiple orders could be combined so you only have to pay once. Other than that, Ruby Lane is great.", "rating": 4}, {"title": "Have changed address on Ruby Lane x2", "text": "Have changed address on Ruby Lane x2 - still has old address as shipping info.  This is messing up my purchases and deliveries.  I then have to pay additional shipping costs to have my items sent to me by the people who now live at the old address.  Fortunately they are very co-operative.", "rating": 4}, {"title": "Very good overall", "text": "Very good overall but payment is a little \"long winded\"", "rating": 4}, {"title": "Okay", "text": "Okay, the site is great.  The problem I had was setting up an account.How to start to set it up was unclear.  Once started, setting it up was easy.Glad you use PayPal.  Look forward to visiting this site often.", "rating": 4}, {"title": "Great items available - Great for Gifts!", "text": "Great items available, and sales and discounts throughout the year, which help for gift-shopping. Most Sellers are really communicative Unfortunately, not all Sellers follow the Rules and I was scammed out of a lot of money a couple of years ago (3/2018). Unfortunately, but by the time I'd realized, it didn't appear anything could be done.", "rating": 4}, {"title": "To make the payment is confusing", "text": "Date of experience: October 06, 2020", "rating": 4}, {"title": "I saw many beautiful VERY nice things…", "text": "I saw many beautiful VERY nice things at this site.  The prices are a little high, but I'm old and the price of everything seems high to me.", "rating": 4}, {"title": "The diversity and quality of the items…", "text": "The diversity and quality of the items for sale are very good and the dealers are communicative and helpful.", "rating": 4}, {"title": "Ruby lane is agreat site to shop", "text": "Ruby lane is agreat site to shop. The dealers are very  nice ..never a gotcha deal. However the new fee structure makes this a non profit venture, asthere is not  enough profit in a antiques,nor can the market bare a 10% increase.", "rating": 4}, {"title": "Was easy and quick.", "text": "Date of experience: September 09, 2020", "rating": 4}, {"title": "It's really too early to comment…", "text": "It's really too early to comment intelligently on this purchase, although I do find the actual ordering procedure a bit awkward. With ebay and etsy I just pay directly by credit card. This seller, however, has to contact me first, and I'm waiting for that email. In fact, I thought this was it and was a bit disappointed it wasn't.", "rating": 4}, {"title": "The website was easily enough to use", "text": "The website was easily enough to use. The price of the item was very reasonable that’s why I bought it.", "rating": 4}, {"title": "I have only one concern", "text": "I have only one concern;      I WOULD LIKE TO BE ABLE TO COPY THE WHOLE PICTURE THAT       IS SHOWN ON THE SCREEN. WHEN I CLICK ON A VIEW OF THE       PICTURE, THE PRINTER ONLY COPIES 3/4 OF THE PICTURE ON       THE SCREEN.Other than this above, I find RubyLane to be delightful. I visit it every day.Thank you for this opportunity.", "rating": 4}, {"title": "Love to shop Ruby Lane even it's…", "text": "Love to shop Ruby Lane even it's pricey. Wait for the sales!!!", "rating": 4}, {"title": "Watched an item for a very long time", "text": "Watched an item for a very long time. 50% sale came up and I was able to get a good deal. Nice !", "rating": 4}, {"title": "i really love this site and have bought…", "text": "i really love this site and have bought many items over the last several years.  There are some exceptionally professional and kind vendors who sell on this site.The checkout procedure appears to have improved significantly.  I especially  look forward to the Red Tag sales several times each year.  My only complaint is that lately many of the vendors on Ruby Lane double the regular price of the item and then offer 50 percent off the doubled price during  the \"sale\".  I really have an issue with this and wish they would consider offering a TRUE discount on just a few items.  When i see this practice, it causes me not to buy from those vendors.  I am including this in my review in the hope that it will be read by the vendors who engage in this practice. With this being said, I have gotten some real bargains on Ruby Lane and will continue to patronize those vendors who do not engage in \"mark it up and mark it down\" for the Red Tag sales.  If not for this practice, this would be a 5 +++ experience.", "rating": 4}, {"title": "Good website for 🛍", "text": "Good website for shopping.  Many good buys can be found.", "rating": 4}, {"title": "Ruby Lane is a great place to shop", "text": "Ruby Lane is a great place to shop. Great dealers and new items every day. The website is a bit awkward to sort out past purchases and questions.  I wish it were easier. I have also heard that there is not a way to give a negative review. As a buyer, I like to see the reputation of the buyer - good and bad.  I purchase on layaway at times and sellers have a large amount of funds.  I like to know they have good records and reviews.", "rating": 4}, {"title": "I have enjoyed most of my purchases on…", "text": "I have enjoyed most of my purchases on Ruby Lane.  However, I think those that charge a \"restocking fee\" for items should be noted in their descriptions.  I had purchased an item a while ago that was inferior, and was told that I could return it, at my expense, and would receive my 85% of my purchase price only.  Shipping both ways was my obligation!", "rating": 4}, {"title": "I wish Ruby Lane  had a way of…", "text": "I wish Ruby Lane  had a way of bookmarking items on a watch list - similar to what Ebay has. There are times when I'm not quite ready to buy an item, but do want to be able to find it again. On Ebay I can place an item on my \"Watch List\" and go back to it whenever I'm ready. Thank you", "rating": 4}, {"title": "Ruby Lane is a wonderful source for…", "text": "Ruby Lane is a wonderful source for antiques.  However, I inquired recently about a necklace and the shop owner told me they were new not vintage and they were a birthday present to her Mom. (!)  Another shop owner mentioned she buys garage sale items to sell on Ruby Lane.  I was surprised by both these responses.  Stay true to your mission!  Thank you!", "rating": 4}, {"title": "This is my first purchase from Ruby…", "text": "This is my first purchase from Ruby Lane. Haven't received the order yet but I'm sure I will. The only odd thing is that if you wanted to purchase something right away, you had to guess at what the shipping would be. At least with my item. Luckily the seller charged fair shipping. But I didn't want to wait for a quote in case I would miss out on the item so I had to purchase it and then find out the shipping later.", "rating": 4}, {"title": "I enjoy shopping on your site", "text": "I enjoy shopping on your site, but wish I wasn't charged double for shipping.", "rating": 4}, {"title": "A True Fan of Ruby Lane!", "text": "I have been a fan of Ruby Lane for a number of years and in the past year or so have made several purchases.  Each time it has be a great experience.  I tell people about Ruby Lane often!", "rating": 4}, {"title": "Good news, bad news", "text": "I very much enjoy looking at the fine quality of products, on Ruby Lane and have purchased many, throughout the years.. What I do not enjoy, is your website. It’s so incredibly slow, that I have even lost items, to buy, during a sale. I really feel this needs to be addressed. Often, I become so frustrated, that I just log out.", "rating": 4}, {"title": "Great, but...", "text": "I love shopping on Ruby Lane!  The sellers are really knowledgeable for the most part and, since I collect vintage rhinestone jewelry, there are just endless choices and the best designers.  My only concern is that since they’ve raised fees on the sellers, the prices have gone up on some things and it’s hard when you also have to pay California sales tax.", "rating": 4}, {"title": "If you would make it easier for dealers…", "text": "If you would make it easier for dealers to purchase using their resales licence, I'd give you 5 stars. I just purchased trim to be used on a doll dress I will sell. To pay sales tax on something that should be tax exempt for my business, makes me grumpy.", "rating": 4}, {"title": "I am only interested in costume jewelry…", "text": "I am only interested in costume jewelry when I buy! I wish there were no ten thousand dollar ( or more) jewelry listed when I refine my search to costume jewelry!", "rating": 4}, {"title": "It was very difficult to figure out how…", "text": "It was very difficult to figure out how to become a member or register.  Once I got thru that part, I was able to make my purchase easily. I think. I am waiting for the shop owner to ask for my credit card #.  Haven't gotten the item yet as I just placed the order.  I like their selection of items.  O", "rating": 4}, {"title": "Great prices", "text": "Great prices . Checkout was a little confusing though. I thought I was using my credit card and PayPal was charged instead", "rating": 4}, {"title": "Ruby Lane has been a great source of…", "text": "Ruby Lane has been a great source of gifts and other interesting items, glass and collectables", "rating": 4}, {"title": "I didn;t like all the red writing", "text": "Date of experience: August 03, 2020", "rating": 4}, {"title": "Show history of items I looked at that day", "text": "I would like to be able to see what items I had specifically looked at that day (history) so I can go back and compare them to each other and decide which item I would like to purchase.", "rating": 4}, {"title": "good pictures,clear description,fair…", "text": "good pictures,clear description,fair price", "rating": 4}, {"title": "Earrings were priced competitively", "text": "Earrings were priced competitively. My one suggestion is to offer free shipping over a certain dollar amount. I think it is a small price to keep loyal customers.", "rating": 4}, {"title": "Ruby Lane is a great site", "text": "Ruby Lane is a great site.  I found many lovely items during my search for a vintage locket.  Once I identified the locket that I was interested in, I was able to make an offer to negotiate a price. When my offer was accepted,  I received an email immediately with confirmation and instructions on completing the purchase.I believe Ruby Lane gave me a fair price and I look forward to receiving my locket,", "rating": 4}, {"title": "Great Job on the UFDC On Line…", "text": "Great Job on the UFDC On Line Convention Sales Room.  Joyce", "rating": 4}, {"title": "I was really happy with my beefeater…", "text": "I was really happy with my beefeater the only problem was that the arm was broken in two places when it arrived but I decided to keep it and repair it myself.  The item was delivered very quickly.", "rating": 4}, {"title": "I'm not able to get good searches", "text": "I'm not able to get good searches. It could be me, operator error, but don't know what I am doing wrong.", "rating": 4}, {"title": "The site was very clear and easy to…", "text": "The site was very clear and easy to use.  I was impressed that it was able to cope so easily with an order from out of the country.", "rating": 4}, {"title": "No delivery info", "text": "Purchasing an item is easy.  What I dont like is not hearing anything from the seller.  I would appreciate shipping information and maybe a thank you?!", "rating": 4}, {"title": "Overall always a great experience with…", "text": "Overall always a great experience with Rubylane.", "rating": 4}, {"title": "Happy Customer", "text": "I found exactly what I was looking for.  Perfect transaction with seller.  The only reason I did 4 instead of 5 stars is I thought the shipping price a little high.", "rating": 4}, {"title": "I absolutely do not understand the…", "text": "I absolutely do not understand the reason for the two stage process of payment.  AWFUL,  what ever the reason. Do you loose customers overthis issue?    Please if you must have a record of some sort, do it internally,with the computer for example, leave the customer out of it!!!  It makes us feel as tho you do not trust anyone!!!", "rating": 4}, {"title": "I LOVE the site", "text": "I LOVE the site. I have problems locating things that are in each of the vendor sites quite frequently, so I'll explain that. Looking up a bronze fireplace fender in Neat Curios. Went in under bronze and under metal but no soap. Had to wade through whole site to locate. Lost a picture last year I wanted. It was of a horse and rider. Found it just this last week under copper (it was painted on copper). But these are small things.all in all, a wonderful site.", "rating": 4}, {"title": "FAQs Need Work", "text": "Shopping on my phone is okay. It's when I have questions I find the FAQs next to useless.  I bother the vendors until I figure out what I wanted to do.", "rating": 4}, {"title": "Love the Site - Purchasing Process Convoluted.", "text": "Thanks for the opportunity to review your system for purchasing items on Ruby Lane.  This was my first purchase.Your software program is relatively easy to navigate. But why is your \"offer\" process so convoluted?  Why have this intermediary step of getting a counter offer from your algorithm, then having a second offer option before sending it to the vendor?  Why not send the initial offer to the vendor directly and the vendor can make a decision? With two items in my cart to purchase, I made an offer on a 3rd item.  I accepted the counteroffer.  Then when that process was complete I had to pay for the negotiated item separately from the payment for the 2 items in the cart.  Each were paid separately.  Again, just seems convoluted.Lastly, via email I received a Purchase order # that is not the purchase itself.  One for the negotiated item and one for the two that had been in my cart.  There's a message alerting me that this is an invoice not a payment.  But I have NOT as of now received an email stating my PAID PURCHASES.  That's more important to me.  Maybe coming later?BUT ... other than that ... easy to navigate.  Like the variety of your vendors. Easy to follow the pathway for paying even tho' I think it's convoluted.", "rating": 4}, {"title": "Mostly very reliable descriptions of…", "text": "Mostly very reliable descriptions of items. Many amazing shops and shop dealers. Have purchased many items from various shops on Ruby Lane.", "rating": 4}, {"title": "I wasn't able to get onto site to ask…", "text": "I wasn't able to get onto site to ask seller question. I am a first time customer", "rating": 4}, {"title": "Ruby Lane and merchant - very good service", "text": "Ruby Lane had a merchant with a vintage Cartier ring I have been trying to find in my size for several years - price was appropriate - shipped promptly and in great condition when received. Couldn't be happier!", "rating": 4}, {"title": "Great site", "text": "Great site. Wonderful items. Items sometimes get moved when going from page to page.", "rating": 4}, {"title": "The shopping was very easy.", "text": "Date of experience: June 16, 2020", "rating": 4}, {"title": "Very good traders", "text": "Date of experience: June 14, 2020", "rating": 4}, {"title": "I thoroughly enjoy examining the…", "text": "I thoroughly enjoy examining the beautiful vintage jewelry on Ruby Lane and the more detailed the descriptions the better. I think it would be great if all sellers would list the clarity of diamonds, most do but some don't. This is, for me at least, an integral part of the purchasing decision.", "rating": 4}, {"title": "These new charges are resulting in…", "text": "These new charges are resulting in fewer purchases and will continue to do. It puts a hardship on sellers buyer alike.", "rating": 4}, {"title": "RL IS The Best", "text": "I like RL because of the quality of its vendors.  I don't recall every being disappointed by an item, or a seller.  That's why I keep buying here!", "rating": 4}, {"title": "I love the assortment of vendors and…", "text": "I love the assortment of vendors and their selections, but it was a little hard to maneuver the site and a little bit confusing for me. I'm on websites and the computer all day long and consider myself to be computer savvy, but it was not a smooth transition from selection to actual purchase and checkout.Otherwise I love \"window\" shopping on Ruby Lane", "rating": 4}, {"title": "Confusing website", "text": "I think your website, especially your checkout, is confusing. And I always have a hard time finding “my account” to check things. I don’t think it needs to be that complicated.", "rating": 4}, {"title": "Had some trouble with the payment…", "text": "Had some trouble with the payment method part of checkout but otherwise everything was fine", "rating": 4}, {"title": "Love your merchandise", "text": "Love your merchandise,  but have problems with the pay now button. And I don't have a mobile phone.", "rating": 4}, {"title": "Would appreciate two changes in the…", "text": "Would appreciate two changes in the purchasing process:1.  List the cost of shipping along with the price of the item, don't wait to list     shipping after one is close to committing to make the purchase.2.  Make it easy to find the link from which to empty a cart.", "rating": 4}, {"title": "Love", "text": "Love, love Ruby Lane, but there always seems to be a problem syncing payment with Paypal.", "rating": 4}, {"title": "Whatever I have purchased through Ruby…", "text": "Whatever I have purchased through Ruby Lane has always met my expectations", "rating": 4}, {"title": "Checkout and offer protocol very…", "text": "Checkout and offer protocol very confusing...love your merchandise!", "rating": 4}, {"title": "The only disadvantage with this is if…", "text": "The only disadvantage with this is if you are antique dealer and have a tax ID you are not supposed to have to pay tax.I just purchased an item and was charged tax. Don't  know how to solve this situation. I don't usually purchase this way but I know the last time I did(maybe 2 years ago)I was not charged tax.", "rating": 4}, {"title": "The best quality", "text": "Date of experience: May 25, 2020", "rating": 4}, {"title": "It would be nice if you could filter by Multiple Subcategories at once.", "text": "It would be nice if you could filter by more than one subcategory at once, like Dolls, Vintage and Composition, or Vintage and Artist instead of having to go through all of the Artist dolls and then have to go back and go through all of the Composition dolls.", "rating": 4}, {"title": "Review of Ruby Lane as a Purchaser", "text": "Hi!Since I rated your site as \"Great\" I'll tell you of a few things I wish were different. (1)  I wish the picture shown on the screen would print out in FULL; instead, there is only 3/4 of the picture that prints out. (2)  I wish there were more pictures of the doll's faces CLOSE-UP. (3)  I wish the \"flaws\" in a doll were pictured more clearly. The attention to details is slack and makes it difficult for buyers to see what they are purchasing. Thank you for this opportunity.", "rating": 4}, {"title": "I order fewer items since fees…", "text": "I order fewer items since fees (shipping, tax, etc.) have added to the price. Sometimes, the fees are more than the item itself, making one wonder if the fees have been escalated to add to the profit.", "rating": 4}, {"title": "Vintage brooch", "text": "Lots of product makes it a bit difficult to search through. I finally narrowed it down and my order was shipped quickly and was in the condition stated on the site.", "rating": 4}, {"title": "My order was in good condition and came…", "text": "My order was in good condition and came quickly.", "rating": 4}, {"title": "trouble paying", "text": "Normally, you would rate a 5, but for some reason the Paypal logo didn't show up at the end of the page as stated, so I had trouble paying five sellers.  I went directly to Paypal and paid backwards!  It was a frustrating experience.", "rating": 4}, {"title": "love all shops", "text": "love all shops. When making an offer to the same seller, it would be helpful that check out would allow to request combine shipping at that time. the check out goes straight to requesting payment without allowing an offer to be made on another item with the same seller and also is more confusing check out process then other sites I have used.", "rating": 4}, {"title": "Love the site-but improve the filters", "text": "Love the site, but could improve the filters at bit more. When it come to jewelry the types should include such things as Charms, Bracelets, Necklace, Earring pierced or clip.", "rating": 4}, {"title": "oNLY PROBLEM", "text": "oNLY PROBLEM: BLOCKING WINNING CUSTOMERS FROM DOWNLOADING PICTURES!", "rating": 4}, {"title": "In several years of membership", "text": "In several years of membership, I've never been unhappy with a Ruby Lane purchase. All of the sellers have been very gracious and deliver a nicely packaged item in a timely manner. I think the website is a bit clunky. I prefer a one-click watch list as on ebay to the wishlist/favorites option on Ruby Lane.", "rating": 4}, {"title": "I had a difficult time getting my order…", "text": "I had a difficult time getting my order paid for  and it took some time but once I got the concept, I was able to pay.  I would recommend a better laid out pay page. It is a bit confusing.  If the seller will only take PayPal then that should be stated.  Instead of making you believe that you can pay with a credit card.", "rating": 4}, {"title": "White Background has got to GO!", "text": "I have purchased from Ruby Lane several times before.  What usually deters me from purchasing is high shipping and forced insurance which sometimes adds up to a very large sum.  I expect to pay reasonable shipping and hate when it is marked up a lot and when I'm forced to pay insurance especially on lower valued items.  My final critique is that I absolutely hate the all white background on everything!", "rating": 4}, {"title": "I just bought a darling doll sweater…", "text": "I just bought a darling doll sweater and plugged in my Master card info to pay for it. However I got a message/receipt from PayPal saying it had been paid by that account. HELP! Did I pay for the item twice???", "rating": 4}, {"title": "This is my first purchase through Ruby…", "text": "This is my first purchase through Ruby Lane and probably a bit premature for me to be rating. I like Ruby Lane and enjoy looking at all of the dolls on this site. I have been collecting antique bisque dolls now for more than 30 years. I purchase my dolls from individuals, antique businesses, and from different sites on the internet. While I love this site the number of dolls I will purchase will depend greatly on how well they are fairly priced. I am seeing many dolls on this site that I feel are overpriced which is why I took away one star making this 4 stars not 5.", "rating": 4}, {"title": "Good old fashioned site", "text": "Date of experience: May 14, 2020", "rating": 4}, {"title": "Ruby Lane should not charge sales tax…", "text": "Ruby Lane should not charge sales tax to those of us who have a resale number.  We should be able to upload a copy of our business license to the site, similar to the process on ebay.  I do not buy as frequently from rubylane due to this and you have also seen sellers leave your site-ie Steiff gal-Rebekah Kaufman who was one of my favorite sellers.  Thank you for your time.", "rating": 4}, {"title": "I am always unhappy with duty charges…", "text": "I am always unhappy with duty charges and the exchange rate. And I seem to always be happy with my purchases. I like when money is used so customer can gauge jewelry size.", "rating": 4}, {"title": "Good experience", "text": "I've had mostly good experiences with Ruby Lane. I do find the checkout process somewhat tedious, since you can only pay for one item (or more if from the same seller) at a time. Ebay lets you pay multiple sellers at the same time. Otherwise all good.", "rating": 4}, {"title": "I have always enjoyed using Ruby Lane", "text": "I have always enjoyed using Ruby Lane. But....I am very glad you got rid of that recent transaction fee that the dealers had to pass on to the buyers. It was like being penalized to purchase items through Ruby Lane.  It truly made me think twice about buying anything further through Ruby Lane, as shipping, plus now tax and then that fee added were making it too pricey to buy.", "rating": 4}, {"title": "I love this site, but...", "text": "I love this site!  I’ve been purchasing from Ruby Lane for about 5 years (I collect vintage costume jewelry) and I always find the sellers especially knowledgeable in their merchandise, and have always been kind and courteous.  But one problem cropping up is that the higher fees RL is charging sellers is causing the sellers to not make as good of deals on offers I make.  I’m having to pay the full  quoted price and that really hurts when I have to pay California sales tax on top of it.  I live on a small fixed income and every penny counts! I’m often getting better deals at other sites these days.  But for reliability and extremely nice people, RL is still the best!", "rating": 4}, {"title": "Rookie Venture", "text": "This was my first experience with the website, and I had some problems executing the bid to buy process. It may well be my computer at fault, or the operator (old, tech nerd). I ultimately am purchasing a welcome addition to my collection of Josef Eidenberger art. I will not hesitate to try again with Ruby Lane. I see value and breadth of inventory", "rating": 4}, {"title": "Good selection", "text": "Good selection.  Good sale prices.  Easy to maneuver the site.", "rating": 4}, {"title": "High shipping and handling costs", "text": "I just started using this website today, through a tip online. I like the filters, esp low to high. I just ordered 3 items. I was going to order 9 items, but the high shipping and handling costs scared me off. I’d rather the costs be reflected in the actual item vs. Getting a shock at the end. I was going to order a tiny ceramic frog planter and 2 blouses and the shipping and handling was almost $50.00. I took off all 3 items fr my list. I took off 3 other items bc I changed my mind. Thank you.", "rating": 4}, {"title": "my first time using ruby lane", "text": "This was my first time using ruby lane and it was a little confusing.   I made an offer and then it said pay.   It was not obvious that my offer was accepted except that I was asked to pay.", "rating": 4}, {"title": "Ruby Lane was very user friendly", "text": "Ruby Lane was very user friendly. Shop owner was helpful. Canada Post does not deliver !", "rating": 4}, {"title": "Great selection. Good prices but be careful", "text": "Great selection, diverse. Products in all ranges from a large variety of sellers. Some respond to queries better than others and some are not experienced or knowledgeable in antique jewelry but I had a great contact with Charlene Trueman and Laura Veroli.  And bought some lovely antique earrings. Sometimes challenging to buy expensive jewelry from pictures and vague descriptions. Was disappointed with slow reaction time and vague answers to questions on condition. Some sellers responded quickly and knowledgeably. Great stuff but be careful.", "rating": 4}, {"title": "Found what I was looking for easily", "text": "Found what I was looking for easily.  I wish there was an option to use credit cards.  - Only complaint.", "rating": 4}, {"title": "Still do not like the wish list set up…", "text": "Still do not like the wish list set up and mixing collectibles with antiques.  Cumbersome", "rating": 4}, {"title": "Ordering was easy !", "text": "Ordering was easy !! I can't wait to receive the charm !! My mother bought me the same charm 8/73 & I lost it just wondering if this could be the same one?? Look @ the date on the back!!!!", "rating": 4}, {"title": "Ruby lane has a beautiful selection of…", "text": "Ruby lane has a beautiful selection of fine jewelry and vintage estate. Will be buying a lot more!", "rating": 4}, {"title": "Browsing for Gifts", "text": "I enjoy browsing RubyLane. I would much prefer browsing through junk and second hand and antique shops in person but my health makes that very difficult. I would like to be able to look at several price points at the same time. say 0-100$. Could you make it possible to check more than one choice box. say 0-25 + 25-50 + 50-100. And how about more than one category, for example if I am looking for a gift could I browse both rings and pendants at the same time. And maybe it is there and I just haven't seen it but how about a spot where I can request an email when something in particular I am looking for comes in...for example I am looking for a Lapis ring then anytime a dealer puts up a new listing of a lapis ring I get an email. I do much of my gift shopping here. CZ", "rating": 4}, {"title": "Sales Pending Before Emails Received", "text": "The only disappointment I ever have with Ruby Lane is that by the time I open the email I have just received, the items I might be interested in are pending sale.", "rating": 4}, {"title": "Ruby Lane has good pictures of items…", "text": "Ruby Lane has good pictures of items for sale but I can not complete the transaction at the same time I make the purchase, which I do not care for.", "rating": 4}, {"title": "why share merchandise that is sold.That…", "text": "why share merchandise that is sold.That is my only complaint.", "rating": 4}, {"title": "I'm a dealer for over 35 years and I'm…", "text": "I'm a dealer for over 35 years and I'm still waiting for Ruby Lane to set the dealers sales tax program like other sites have now. I do hold off buying from RL. just because of that. Sue Fay", "rating": 4}, {"title": "I made an offer on a Wedgewood bowl…", "text": "I made an offer on a Wedgewood bowl offered on Internet.  It seems as though I bought it upon making the offer.....no discussion.  OK but I would have liked some conformation about my offer being accepted before I am asked my CC#, etc.  What happened?  It is OK because I wanted the bowl and servers.", "rating": 4}, {"title": "I thought the checkout procedure was a…", "text": "I thought the checkout procedure was a little confusing.", "rating": 4}, {"title": "I love the website", "text": "I love the website, but sometimes it’s SO slow! Often I get frustrated, and leave, to shop elsewhere.", "rating": 4}, {"title": "I was totally frustrated trying to pay…", "text": "I was totally frustrated trying to pay for two items.  The screen would not allow me to contact the dealer or Ruby Lane.  It took a lot of searching to find a means to write the company.  Once I found the means, I received an immediate response.  It was recommended I try the payments once again.  The payments are finally on the way.  I don't know why it was a issue for 3 days but I am pleased by their communicating with me.", "rating": 4}, {"title": "Confusing Payment Manner", "text": "The site was fine.The only thing which was a bit confusing was in paying.You have to click \"Pay Now\" before you are then sent to the payment site.I had first thought I was paying now, but realized I couldn't have been because I hadn't put in my payment info yet!You might want to change that.", "rating": 4}, {"title": "Great site for a jewelry junkie", "text": "Date of experience: April 08, 2020", "rating": 4}, {"title": "Cart issues …", "text": "I wish I could put more than one item in my cart and purchase them. I seem to only be able to pay for one item at a time.  Very frustrating.", "rating": 4}, {"title": "Good site", "text": "Great site but the paying process is cumbersome.", "rating": 4}, {"title": "Love the blue cobalt", "text": "Date of experience: March 27, 2020", "rating": 4}, {"title": "Every rubylane  vender has a different…", "text": "Every rubylane  vender has a different way to secure payment. I have trouble sometimes and sometimes I do not . Please make a payment option that is readily available and uniform with each vender.", "rating": 4}, {"title": "Great Experience", "text": "Great Experience! A doll friend, by the name of Rachel Hoffman, had mentioned to me that I should check out the website. I found the website to be fairly easy to navigate. Although when you make an \"offer\" to a seller, there is no where to add a message along with that offer. This is very disappointing, as it narrows down our ability to communicate, where communication is so necessary! Just having the ability of using your up/down arrows to select a dollar amount, is not enough. There should be a box where, \"special instruction\", if you will, to be used to add further instruction. I had wanted to make an offer which included *free shipping*, but could not write that in.", "rating": 4}, {"title": "I had to sign up  to your website in…", "text": "I had to sign up  to your website in order to make a pruchase", "rating": 4}, {"title": "I broke my sisters hand painted…", "text": "I broke my sisters hand painted Portuguese jug given to her forty years ago by one of her best friends. Ruby lane was the only site I could find an exact replacement. I was able to order a  replacement the same night and also give her lovely little covered dish that matched.", "rating": 4}, {"title": "Hard to find antiquities at fair prices", "text": "I have been what I consider a very loyal client of Ruby Lane’s for several years.  I am a frequent shopper of unique vintage home furnishings as well as Victorian era jewelry.  Ruby Lane has an amazing following of sellers that offer some of the finest art objects I have ever seen for sale.  As far as the merchandise and ease of check out and payment process, Ruby Lane is Tops.  There is only one issue they MUST fix to get my five star rating.  They MUST stand behind their promise that if a fake piece of merchandise is being sold, it will be clearly stated and if not, a refund is in order.  I had this situation happen and Ruby Lane did not stand behind their word.  I was stuck with a fake.  Other than that, if you KNOW what you are buying, it is a great site to buy from.", "rating": 4}, {"title": "Ruby Lane Customer Service", "text": "I found Ruby Lane Customer Service very good to deal with after I had to ask them to help resolve a dispute I was having with one of their sellers. They were professional and prompt in their communication and they pursued the seller for the information I requested. My only complaint is that they don't seem to be in a position to insist that the seller do the right thing. Although I would never again purchase from the shop that I had trouble with, I don’t expect to have an experience like that again, & would be happy to purchase from other Ruby Lane dealers.", "rating": 4}, {"title": "The website site should be easier to…website issues", "text": "The website site should be easier to use when you like a favorite you should be able to like it and not have to go all the way to the item like it save it then come all the way back it takes too much time so that’s my only complaint about the website on Chairish there’s an easy way to like it with the heart and you don’t have to leave the page and then come back", "rating": 4}, {"title": "New Site Format", "text": "I really preferred the old site format (ie: the Home page) to the current one. I find it more difficult to locate certain categories of items, as opposed to the previous one-click convenience. Otherwise, I am most pleased with the site and its vendors!", "rating": 4}, {"title": "Always great items and great sellers.", "text": "Date of experience: February 21, 2020", "rating": 4}, {"title": "Custmer  Service phone number needed!", "text": "Ruby Lane blocked me from purchasing because they said my email wasn’t validated. My email had not changed. Also, there is no customer service phone number to call for assistance which is irritating. I finally cleared my email address and reentered the same email in my accountant did an update which corrected the issue so I could place an order.PLEASE POST A PHONE NUMBER FOR CUSTOMER SERVICE ISSUES!!!!", "rating": 4}, {"title": "Good except for payment method", "text": "This is a good website but I do not like the new payment method. You used to be able to pay online, now the seller has to call you to get your credit card number. This is very inconvenient, also you really don't know who is calling you and taking your info.", "rating": 4}, {"title": "I didn't shop at Ruby Lane for a long…", "text": "I didn't shop at Ruby Lane for a long time because they blocked me on Pinterest.  I am now able to pin their beautiful dolls so I thought I should look around.  The items I really want are so much better on Ruby Lane.", "rating": 4}, {"title": "i enjoy looking at vintage jewelry and…", "text": "i enjoy looking at vintage jewelry and furniture on your site. I found a lovely necklace i couldn't resist and ordered it recently. I'll let you know how lovely it is when I receive it!", "rating": 4}, {"title": "Depends on what part of Ruby Lane you…", "text": "Depends on what part of Ruby Lane you are asking about ? As far as the website goes it’s great , a wonderful conglomeration of sellers and products . The customer care center is quick, efficient and clear in their responses ....unlike Hall Design which seemed disinterested in sales , inefficient, slow and not the best communicators , on top of that they retracted an offer after it had been accepted ( all in all One star ⭐️) as for Ruby Lane it’s four stars ⭐️ ⭐️⭐️⭐️Only because I found that at times messages did not get through to the vendors . It would be a bonus if buyers would be notified that their messages had been read by the vendor . In Hall Designs case I had no idea for days and at one point over a week if it was received or read .", "rating": 4}, {"title": "Good response from dealer", "text": "My questions were answered quickly and accurately by the dealer of the item I was interested in.", "rating": 4}, {"title": "Website malfunction", "text": "For two days I have been trying to find a gift for a friend.  Ruby Lane's selections are fabulous.  However, on both Chrome and Explorer, when I click on an item in which I am interested, I do not receive an \"add to wishlist\" tab.  I also bid on an item in British pounds, but it would not convert to USD.  This is highly unusual, and I hope that Ruby Lane can fix the problem.", "rating": 4}, {"title": "Email address change", "text": "I have enjoyed finding wonderful and unique things on Ruby Lane, or finding thing sI am specifically looking for . Most dealers are great to deal with.  But communication withRuby Lane is difficult. I have tried writing to change my email, but no such luck.", "rating": 4}, {"title": "A similar item search would be nice…", "text": "A similar item search would be nice when looking 4 something specific. Allso a serch area that would include all stores on ruby lane in the search for a specific item,so you do not have to search each individual store would add to ease of finding something specific.", "rating": 4}, {"title": "I enjoy shopping here", "text": "I enjoy shopping here, great variety of items and I have had good experiences with the sellers. I do think buyers should be able to opt out of insurance on items that are low dollar or not fragile. There is no way to do that as far as I know. Also I have saved searches which emails items to me and I often find that they are already sold when the email arrives so instead of “here’s just what you were looking for” it’s “you just missed out on this”", "rating": 4}, {"title": "good shopping experience everything went smooth", "text": "good shopping experience everything went smoothly only negative is wish they had a app.", "rating": 4}, {"title": "The site is well organized", "text": "The site is well organized. It is easy to search and find items. Descriptions are clear as well as pictures of the items offered. This is my first purchase so hopefully the item will be received as described.One thing I don’t like about the site is that when you search for items, it tells you there are an x number, but in reality there are less because sold items are included in that number. If the items are sold, it means that they are not available. Therefore they should not be included in the list.", "rating": 4}, {"title": "very quick responses to my order", "text": "very quick responses to my order, impressive.  Ruby Lane might look also at their payment options so that payment is done immediately.  Otherwise excellent service.  Hope the postie does his job", "rating": 4}, {"title": "Where did you put the Wish List", "text": "Where did you put the Wish ListI can no longer keep track of the things that I am interested in purchasing I keep getting stupid e mails showing a Wish list of items I never listedbecause I can't  list anythingI called a  several dealers I have bought from for help but they dont know eitherI think you need to get a teck person who knows what they are doingVery upset customer who buys a lot and used to be very happyHoping you can fix this & bring the rating uo to 5 stars", "rating": 4}, {"title": "Some unexpected surprises", "text": "Easy navigation and fairly easy checkout.  Shipping exceeding the cost of the item was an unwelcome surprise, as was discovering that checkout was not \"instant\" with a credit card but that I needed to wait for a phone call from the vendor.The call came within 2 hours; all communication was excellent.", "rating": 4}, {"title": "Great place to shop", "text": "Ruby Lane has provided me with quality pieces for my home. There are a variety of items to choose from, with prices that are reasonable.", "rating": 4}, {"title": "Some of the pictures are hard to…", "text": "Some of the pictures are hard to identify because all are on a bright white background, which sometimes makes seeing the details difficult; only 'issue' for me.", "rating": 4}, {"title": "IT WAS MY FIRST EXPERIENCE WITH RUBY…", "text": "IT WAS MY FIRST EXPERIENCE WITH RUBY LANE, AND IT WENT WELL EXCEPT I DIDN'T LIKE THAT I HAD TO CONTACT THE SELLER TO GET A SHIPPING PRICE. IT WASN'T LISTED, AND I COULDN'T CALCULATE IT MYSELF. I SUSPECT THIS HURTS SALES AS MANY PEOPLE WOULDN'T BOTHER. THE SELLER WAS VERY NICE AND HELPFUL; IT WAS JUST A BOTHER.", "rating": 4}, {"title": "Not happy with double taxation and with…", "text": "Not happy with double taxation and with tax added to postage (which is already a tax and should NOT be taxed again since it is a US government law)Not pleased with service fees being added/upgraded to sellers who already are on a very tight profit margin.", "rating": 4}, {"title": "I was explicitly solicited by Ruby Lane…", "text": "I was explicitly solicited by Ruby Lane to immediately leave a review; this is not a spontaneous response.I viewed the pictures on the site and decided to buy one of the items.  The checkout process was as easy as any other place, no specific difficulties or frustrations.Since all I have done is place an order, there's no way I can post an effective review until the item arrives, so I think this instant review request is kind of self-defeating.If I were asked for a suggestion - which I haven't been - I would suggest to wait until after delivery to solicit a review.  That's when I am much more likely to be pleased compared to having only completed a routine online order.", "rating": 4}, {"title": "The agreement was to pay 250 USD for…betrayed", "text": "The shipment is canceled, I am now waiting for the refund , hope everything ends good.", "rating": 4}, {"title": "RubyLane Fee Issue", "text": "I adored shopping on RubyLane u til these ridiculous fees were applied. I certainly will reduce my shopping here. In some cases the cost is an additional 20.00 on top of the cost for an item. Please eliminate the fee placed on the buyer. I have thoroughly enjoyed purchasing items for years and this has now dampened my interest.", "rating": 4}, {"title": "unclear billing statements", "text": "the online interface is intuitive. there was seemingly no way to inquire about details of the billing statement. for instance, in my state we don't have sales tax and yet i was charged tax through ruby lane with no option to contest it.  also, insurance was not optional and there was another indisputable charge here as well.", "rating": 4}, {"title": "The merchants on Ruby Lane are…", "text": "The merchants on Ruby Lane are wonderful.", "rating": 4}, {"title": "Billing Questions", "text": "I enjoyed going through your site, and purchasing was relatively simple until it came time to check payment. I wanted to pay by credit card but it would only allow PayPal. I switched from PayPal to check so I'm waiting to see if it goes through or not. I put the PO # on the check so I'm crossing my fingers", "rating": 4}, {"title": "I love the merchandise", "text": "I love the merchandise, and the new policy of withholding taxes does not bother me.  I have always kept track of taxes due on merchandise that I've purchased on-line and paid whenever I file my state income taxes.  However, I'm only rating four stars, because of the new buyer fees.  Ruby Lane's fees are minimal,  but I believe in the principle of \"Beware the Entering Wedge\".", "rating": 4}, {"title": "Easy to use", "text": "Easy to use. Found exactly what I was looking for..", "rating": 4}, {"title": "product was as advertised..", "text": "product was as advertised... delivery was prompt", "rating": 4}, {"title": "Well presented platform", "text": "Well presented platform, good images and excellent sellers", "rating": 4}, {"title": "I love Rubylane", "text": "I love Rubylane. With one exception, all sellers have been fabulous!I left one star off, due to the new “service charge” that Rubylane has started. The costs keep creeping up. Also, you can’t see the other charges now, unless you are checking out. I’d like to know before.", "rating": 4}, {"title": "Good web site to search. Order process was a bit difficul", "text": "The description of the merchandise was very good, and the speed of page loading was also good. However, the check out process was difficult. I wanted to pay by credit card, but was inadvertently sent to PayPal. I don't know if my charge went through or not. I did get two e-mails confirming my order, so I assume everything is OK, but I'm not sure.", "rating": 4}, {"title": "Reputable Sellers", "text": "Reputable Sellers, I always get great service from sellers on Ruby Lane.", "rating": 4}, {"title": "Page viewing would be better if you…", "text": "Page viewing would be better if you were directed back to the previous spot in your shopping after viewing an item.Adding items to a favorites list does not always work as expected.", "rating": 4}, {"title": "Mostly good experience", "text": "I haven't received my order yet, but based on the website and process, I was happy. I read about how Ruby Lane selects vendors, handles complaints, and so on, and felt confident about ordering. It was easy to navigate and understand. The only part of the process that I wasn't expecting was the additional fee to Ruby Lane. On many other selling sites, the seller pays the fees. I don't know if the Ruby Lane seller pays fees as well, but the buyer does. So the final price was more than I anticipated. Nevertheless, I will shop Ruby Lane again. I just will know in advance about the extras and not be surprised.", "rating": 4}, {"title": "great info", "text": "I’ve bought several beautiful things at a great price.  I like that they include as much information on the piece I’m purchasing.  Who - What - Where -When!", "rating": 4}, {"title": "I like the Ruby Lane experience", "text": "I like the Ruby Lane experience, but for the first time I noticed a “service charge” to RL.  It actually caused me to rethink for a few hours if I wanted to pay this extra.", "rating": 4}, {"title": "Your products are fine; your process is sometimes lacking", "text": "I have no problem with your products; however, your website wasn't working correctly last night when I tried to make a purchase. When I clicked on \"purchase\" (or \"submit\" - whatever it was), nothing happened. I clicked on it 2-3 times, with the same result. So I gave up, fearing that I might be purchasing the item multiple times. This morning, I received an email that there was an unpurchased item in my cart, and I was able to finally purchase the item.", "rating": 4}, {"title": "I have found most shop owners to be…", "text": "I have found most shop owners to be very pleasant and eager to collaborate and accommodate The most frustrating aspect of going through Ruby Lane is problems shop owners attribute to Pay Pal. For example, recently I offered to pay a discounted amount on an order of several items. The shop owner agreed but Pay Pal could not generate one running bill with modifications. The request was to pay item by item. Or just send 1 direct payment to store but without a bill. She insisted a Pay Pal issue because of changes in prices. Eventually I cancelled my order. Pay Pal problem another time.", "rating": 4}, {"title": "I removed a star because I don’t like…", "text": "I removed a star because I don’t like the new combination of antiques with collectibles. Preferred them separate . Also when I look at top 50 in the relax column it used to go directly to most recent for that dealer and now you have to select a category to look at first and I don’t like that.Also I would like to be able to set it up so that most recent rather than best match shows up on each category page.Other than these items, I am very happy with the way Ruby Lane operates and the high caliber of its dealers.", "rating": 4}, {"title": "Great choice of Victorian jewelry", "text": "Great choice of Victorian jewelry. Easy payments", "rating": 4}, {"title": "I just made an offer on an item from…", "text": "I just made an offer on an item from one of your shops and it was accepted straightaway! Everything was pretty smooth and fast. The only thing I think you could improve on is your checkout process. It is still a bit confusing on how to find your invoice and pay. In other words, there needs to be a more obvious link.", "rating": 4}, {"title": "Takes a minute to sign in", "text": "Takes a minute to sign in, than its a go.", "rating": 4}, {"title": "In total context my experience with…", "text": "In total context my experience with Ruby Lane has been excellent!Recommendations:Transfer buyer fee to sellers! In current format , it acts as additional tax and works against sales.Set up system to allow tax exempt buyers since now charging sales tax!  Ebay has accomplished this allowance!Thanks, Jim Blott (Old Yellow Depot)", "rating": 4}, {"title": "First transaction through Ruby Lane", "text": "First transaction through Ruby Lane, and ease of use is simply a breeze.", "rating": 4}, {"title": "This  is my first purchase from Ruby…", "text": "This  is my first purchase from Ruby Lane and I found the process of signing up and ordering very simple.  Hopefully the piece I bought is as advertised.", "rating": 4}, {"title": "Quite good communication and…", "text": "Quite good communication and interaction, but time elapsed before sending not as quick as one might have expected.", "rating": 4}, {"title": "Love the merchandise and the updates on…", "text": "Love the merchandise and the updates on your wish list......for some reason I needed to type my address in three times .... even after saving it....plus the orders are done separately so if you order more than one thing from a different vendor you have to put all your payment information in again......a little tedious.....", "rating": 4}, {"title": "Great service", "text": "Great service! I would suggest there would be an app available to easily assess my account with them.", "rating": 4}, {"title": "I would prefer the option of paying via…", "text": "I would prefer the option of paying via credit or debit card.  I don't trust PayPal!", "rating": 4}, {"title": "Service fee", "text": "Service fee? Really?", "rating": 4}, {"title": "Overall an excellent site.", "text": "Overall an excellent site.Wish that notifications for new items from favorite sellers were sent to me in a more timely manner.Yes, I know you are on the West Coast but most of the country isn't.", "rating": 4}, {"title": "Great choice but ....", "text": "Ruby Lane has a great variety of sellers and items for purchase, so it offers a good choice for the savvy purchaser. However they have recently introduced additional fees, so it is not as good value as it was before. Am reeling from sticker shock ….", "rating": 4}]