[{"title": "Fast, easy and effective!", "text": "Very quick shipping and easy payment methods. If there’s ever an issue thr support staff is very fast to help you. I just got an assortment of the samples they’re running and based off what I got will definitely be back for more. The Baicalm and Mood Lift capsules are a must try for those looking for energy, nootropic/neuroprotective, mood boosting and sleep enhancing solutions effects.The MT-55 extract of Kanna and its mote potently extracted form are great mood boosters. Just watch out if your sensitive to stimulants or are on serotonergics because kanna effects your serotonin levels. Overall: 8/10 = 4/5 hence the 4 stars. I would love to give 5 stars but I try to be realistic. I got the baicalm sample, mood lift sample, sleep support sample, kanna mt-55 and “kanna gum” samples and a small jar of the more stimulating, potent version. So far I’ve tried it all but the gum and they all work.The kanna isn’t as stimulating as I thought but definitely brings the mood boost and an almost calming effect.The more potent version, however. Did give noticeable stimulation. This was after dosing mood lift and 15mg of mt55 in the morning so tolerance may have dulled the stimulation. Still worked well as a mood booster. Basicalm and the sleep capsules did their job amazingly.Can’t wait to try some gum at work today. Cheers!", "rating": 4}, {"title": "Very good experience, except ", "text": "Very good experience, except for timeliness of shipment.", "rating": 4}, {"title": "Great products, just don't expect a response if you email them with a question", "text": "Great, quality products. Customer service is apparently lacking though. I've emailed them twice to ask about a product I've been ordering no longer being on their website. Still haven't gotten a response if it's been discontinued or what the deal is.  It's now 20 days later and wrote them twice hoping for a response. :( At least the products are good as is their shipping promptly.", "rating": 4}, {"title": "Ordering is fast and easy", "text": "Ordering is fast and easy, only problem is the post office. I don't know why they run it all the way to Indianapolis when there's a hub in Gary. I'm in Michigan City. Adds an unnecessary day to shipping. I paid extra for priority mail for nothing. Took the same amount of time as first class.", "rating": 4}, {"title": "Quality on par with the very best", "text": "Quality on par with any in the Nootropic supplement industry. If products didn't sometimes go on back order or get discontinued, I'd be more likely to rate as perfect. Their sister brand New Mind would also be nice to combine on one order.", "rating": 4}, {"title": "Order arrived s as expected…", "text": "Had no idea if the order was shipped out, when it might be expected, or how to track it. The last email said the order was complete, a day after the order was made. However, it later arrived in a normal timeframe, fulfilled as expected.", "rating": 4}, {"title": "Still a great experience ordering from…", "text": "Still a great experience ordering from Liftmode in general. Great quality products, nice selection, and my items shipped even faster than what I'm used to. I was surprised when I got my order a few days early. It's enjoyable navigating through the site and I also really like the new products Liftmode keeps releasing. The only issue preventing a 5 star is that there is still a problem with inventory for some things. They will unfortunately be out of stock on some items and if you're unlucky, you'll have to wait for a while before they restock.", "rating": 4}, {"title": "The Good and the not so Good", "text": "Shipping was very fast (2nd day air). I did have to purchase twice as much as I normally do to get that free shipping. Considering that the price has gone up by about 20% in less than 2 years (more than inflation) it would be nice if the threshold for free shipping, even if it takes 4-5 days, would make buying this very good product more affordable.", "rating": 4}, {"title": "The prices for small products are a bit…", "text": "The prices for small products are a bit too high in my opinion, but it's not a problem if you're ok with buying in bulk, that's my only (sort of) complaint, otherwise it was a great purchasing experience, super easy and user friendly. The product was extremely well packaged as well.", "rating": 4}, {"title": "Satisfied!", "text": "The one product that I order is pretty helpful! I do wish there were an option of higher potency, I need to take quite a bit of these capsules, so a higher strength would be nice, However they do have plenty of capsules also very reasonably priced. I am satisfied. The website is very simple to navigate! Thank you", "rating": 4}, {"title": "Good, but needs some QOL", "text": "It's easy to order and very informative. Though at times it's tough to just simply reorder an old order, adding something to the account history UI might help a lot for repeat customers.", "rating": 4}, {"title": "I buy phenibut from Liftmode regularly…", "text": "I buy phenibut from Liftmode regularly and it's a good product. I gave four stars because sometimes the shipping takes a little bit longer than it should. Just a pro tip use USPS priority mail because that's the fastest way to get your product. The USPS delivery map says 2 days but it usually takes 3 to 4. Do not use UPS they take forever.", "rating": 4}, {"title": "Ordered L Theanine and Phenibut, but didn't receive proper L Theanine labs.", "text": "Ordered L Theanine and Phenibut. Both are what I ordered and work as they should, however I'm only giving 4 stars because the Theanine came with Tetrahydroharmine labs and not L theanine labs. Otherwise, amazing products and I will continue to be a customer to Synaptent/Liftmode.", "rating": 4}, {"title": "This company cares about customers and product", "text": "Although I had an issue with a product provided to me, Liftmode responded accordingly.  I experienced professionalism in regard to that issue.  Great and timely customer service and details in every regard to the product.  I know Liftmode is one of the top rated vendors online with all their products.  And I’m so grateful when I received mine and had issue with it I was granted a hassle free refund and exceptional customer service.  I look forward to future business with this company!", "rating": 4}, {"title": "I loved the supplement itself and it…", "text": "I loved the supplement itself and it did what I wanted it to do, but the capsules didn't look completely filled so I was just wondering if it was actually 300mg each. Other than that, great stuff.", "rating": 4}, {"title": "Love the products but they just…", "text": "Love the products but they just recently took out the option to pay for regular ground shipping for $9 and the minimum amount to pay for shipping is now $33. The price of the product I buy has doubled over the last 8 months and now the shipping has tripled as well.", "rating": 4}, {"title": "It's great and I have ordered many…", "text": "It's great and I have ordered many times but I haven't been able to actually pay via crypto from my phone. Idk if it's the phone itself or a problem on liftmodes end but I'll have to try my order on another device", "rating": 4}, {"title": "You can't chance your order, only cancel", "text": "Couldn't make a change to my order, cancelling and doing it from scratch is the only option, and there's a very short time window to do that. But that's not their fault, I didn't cancel it quickly enough.", "rating": 4}, {"title": "Love LiftMode, but hate the HUGE price increase!", "text": "Always a great experience and super fast shipping. I love LiftMode, but hate the 90% price increase since my last order !!! I'm sure there's a reason, but it might be a dealbreaker next time.", "rating": 4}, {"title": "•Efficient ordering process", "text": "•Efficient ordering process. •Product (as advertised) arrived one day ahead of schedule.•Prices are on the high end with too many “Out of Stock” items.", "rating": 4}, {"title": "Ordering", "text": "Ordering, delivery, packaging were excellent. To order you need to signup. Since I am a casual shopper and may not return frequently I found this to be inconvenient. Otherwise this will be 5 stars.", "rating": 4}, {"title": "Phenibut reasonably priced although out…", "text": "Phenibut reasonably priced although out of stock in 100g occasionally.Also 2 day USPS shipping I was expecting in 2 days. More like a week", "rating": 4}, {"title": "My only complaint is not so much the…", "text": "My only complaint is not so much the unavailability of product, as how long that situation has persisted.. in fact it seems to have gotten worse rather than better. FWIW", "rating": 4}, {"title": "Liftmode is awesome", "text": "Liftmode is awesome, they got my delivery out same day. Only downside was I had overnight shipping and UPS messed up delaying it 2 extra days.", "rating": 4}, {"title": "The product is excellent as always", "text": "The product is excellent as always. My only complaint is that I paid over $16 dollars for faster shipping and it still took 5 days. However that is probably the fault of USPS rather than liftmode", "rating": 4}, {"title": "Good stuff as always but the…", "text": "Good stuff as always but the instructions for how many scoops to use should be different for this versus the HCL since the volume is higher", "rating": 4}, {"title": "Fast service-Thank you", "text": "Fast service-Thank you!  The tricky part was ordering-wasn’t sure my order went through(it didn’t)…so I tried again and was successful.  That’s the area that needs an update.", "rating": 4}, {"title": "Like the product a lot", "text": "Like the product a lot.  The shipping time was not super quick but it was reasonable.  The email had some kind of weird captcha thing on it though that made it frustrating to open, never had that before.  I would order again though.", "rating": 4}, {"title": "Kinda slow shipping compared to other…", "text": "So ordered on Friday and it should get here tomorrow on Thursday so not the best shipping but not horrible either.", "rating": 4}, {"title": "4 stars just for lack of supply and not…", "text": "4 stars just for lack of supply and not being able to purchase the quantity I’d like to. Other than that, painless and quick shipping.", "rating": 4}, {"title": "Solid company, great extracts.", "text": "Solid company, decent prices, and good shipping if in the eastern part of the states can't speak for the other parts.", "rating": 4}, {"title": "So my package was all screwed up", "text": "So my package was all screwed up. Partly my fault. It went to another same named city in 2days. Problem was fixed I was very frustrated but customer service here is on point. Got my package rerouted to the correct address 2days later. The product is top notch and best of all the customer service is outstanding. Thanks to Lilly and the rest of the people who listened to me go off. Lol sorry and thanks again", "rating": 4}, {"title": "Very effective product", "text": "Very effective product. A bit corse. Scoop is too big for container .", "rating": 4}, {"title": "shipping was good and quick", "text": "I was very happy to have found what i was looking for. the prices and shipping were fair and Quick. product i ordered. was the product shown and paperwork was all there and detailed.Product didn't seem the same as in the past but everything else was a very pleasant experience.", "rating": 4}, {"title": "They got the supplements you need!", "text": "They got the supplements you need!Though they don't offer the best price, but they bring what i want. Fast delivery, fine quality product. Cant ask for more.", "rating": 4}, {"title": "Phone representative was very helpful.", "text": "We had difficulty using the internet site for ordering.  We found that your products are  available by phone and had an excellent experience with the representative.  Thank you for having humans to assist in ordering.", "rating": 4}, {"title": "Everything’s great except they lag on…", "text": "Everything’s great except they lag on shipping the item. Example: ordered a week ago and still waiting on shipping info to be updated", "rating": 4}, {"title": "Product great but shipping price very high", "text": "Product is great and price has only gone up a little bit over the past few years. However, shipping has tripled since .y last order. I paid almost as much for shipping a single bottle as I did for the bottle it self. I miss when shipping was $7", "rating": 4}, {"title": "Love your products", "text": "Love your products, I buy from yall all the time. Only complaint is that you should re stock items more often but other than that everything is awesome and great quality. thanks", "rating": 4}, {"title": "Product availability needs improvement…", "text": "Product availability needs improvement and prices. But shipping is fast and products quality is good", "rating": 4}, {"title": "Probably the best nootrioics vendor I…", "text": "Probably the best nootrioics vendor I know of. It's great! I trust them. I would've given 5 stars if they carried f-phenibut or sold their phenibut HCL/FAA for just a little cheaper.", "rating": 4}, {"title": "everything went well", "text": "everything went well, recieved my product, and the quality was satisfactory.  A little pricey for my bank but i will purchase a smaller amount next time, and hope that they can reduce the price somewhat or offer more discounts.", "rating": 4}, {"title": "98% of the time they have exactly what…", "text": "98% of the time they have exactly what i want. Fast and accurate shipping. And good customer service the few times that ive had to call and speak to someone.", "rating": 4}, {"title": "Caring", "text": "Yes, u guys r always prompt, kind and efficient. Which is gratefully appreciated", "rating": 4}, {"title": "They always get my order out quickly", "text": "They always get my order out quickly. They sell out a lot of the product I buy the most but have a smaller quantity option most of the time.", "rating": 4}, {"title": "Easy to shop", "text": "Easy to shop, good communication, good prices, fairly timely on shipping. I'll be back!", "rating": 4}, {"title": "The experience was great because they…", "text": "The experience was great because they were always the front runner in supplements. Not only the name but quality is top notch . The have supplements many dont have.", "rating": 4}, {"title": "I will give them 4 stars for now yet…", "text": "I will give them 4 stars for now yet the products they have are 5 stars - been ordering for a while and all has been smooth ( for the most part will get to that ) goog prices and yes great products but had 1 - one and only 1 issues with them 1 order  the one b4 last took 3 x to arrive ( I use 2 tracking apps + the USPS up to the min tracking if arrived in my PO sorting center but then was sent back to sender for some reason - w/o attempting delivery I watched it go all the way back to Chicago ( or whatever - the homebase in  outside of chi tow I guess)  I emailed CS 4 times I think and never got so much as 1 single response now 1 Acknowledgment  ( yes I inc screenshots of all 3 tracking sites plus my tracking no to make it easy for them and not think I am doing some scam ) but no response .  well  I did order from them a month later yes others have the product but hey real talk they have they best quality and it arrived fast - a day early in act ( ps the addy+ all was correct in the late package ) so no idea what happened .  I am also just taking a guess on the date - 2 mons-ish ago ", "rating": 4}, {"title": "Good product, good shipping time.", "text": "Came in a timely manner, product came with COA info sheet and a dosage spoon. Good quality, will consider buying again.", "rating": 4}, {"title": "Everything was great except the product…", "text": "Everything was great except the product I wanted was out of stock so I had to get something I really didn’t plan on.", "rating": 4}, {"title": "Everything is awsome great product fast…", "text": "Everything is awsome great product fast shipping only problem is some stuff is a little pricey.", "rating": 4}, {"title": "Product quality has gone down a little…", "text": "Product quality has gone down a little bit in the Phenibut. But very fast shipping and prices are reasonable.", "rating": 4}, {"title": "Item I ordered was sold out", "text": "Item I ordered was sold out. It wasn't listed as sold out on the website and I only found out bc I emailed regarding the order. Shipping was 1-2 days which was quick but they should update the site regularly so out of stock items can't be ordered. Otherwise my experience was pleasant.Update: even though there was a slight inconvenience I will still order again  but thank u for the explanation", "rating": 4}, {"title": "Great product but…", "text": "Great product but shipping charges make the cost à little high.  You can buy more than you need and get free shipping, same with everything these days...", "rating": 4}, {"title": "I actually haven't received it yet and…", "text": "I actually haven't received it yet and can't find the tracking number. Can you please provide that to me? Thank you.", "rating": 4}, {"title": "Works well, but takes a large dose", "text": "It took three sleep capsules to work. I guess that is OK but it does mean I’m going to go through the supply much more quickly and it increases costs going forward. Other than that, the product worked well.", "rating": 4}, {"title": "Is as is advertised.", "text": "Product is yet to arrive; however, once it does, and it works as described: 4 stars. 👍", "rating": 4}, {"title": "Great people and great people products", "text": "This company does great things. I commonly purchase their sleep caps which really help me feel rested in the morning. On my last purchase, I ordered a few items including the sleep caps but was later emailed by customer service to let me know they were out of stock and would be issuing me a refund. Not only did they refund me, but offered a discount for my next order. Great service, and great products.", "rating": 4}, {"title": "Great Service", "text": "Everything seems great except the shipping.  However, I think this is the same everywhere.", "rating": 4}, {"title": "Works but have to have a little patience!", "text": "I now have about 4 days experience on this substance.I first started at the lowest dosage possible.That did not work so I waited about 2 hours and increased dosage. I tried the taking on empty stomach, mixing with coffee to melt crystals, etc still no results and at this point I was up to 3-4 scoopsfrom provided measuring cup. What I found works despite warning is mixing with Alcohol.I found even when mixing with Alcohol I still felt no results. I did Find that taking on empty stomach,using a medium to high dose, melting crystals in coffee, and a little nap works nicely!It seems something about sleeping activates thissubstance. You will awaken to a nice blissful state!", "rating": 4}, {"title": "Great quality at all times", "text": "Great quality at all times, fast shipping as, comfortable transaction.", "rating": 4}, {"title": "i would of given a 5 star", "text": "i would of given a 5 star, the product is by far the best I've tried. The reason for the 4 star is they seem to be out of stock a lot", "rating": 4}, {"title": "Good ordering and delivery", "text": "Good ordering and delivery. Wish you had better stock.", "rating": 4}, {"title": "it WAS GOOD EXPERIENCE", "text": "Date of experience: June 25, 2024", "rating": 4}, {"title": "There was a problem with shipping but…", "text": "There was a problem with shipping but the customer relations team was patient with me and I eventually received package and it was excellent quality .", "rating": 4}, {"title": "Practically instant shipping", "text": "Practically instant shipping, not even 2 days to Aus.Not quite sure on this balance in these caps, seems to make it too much of a slow start and low burn compared to my usual stack. Hopefully next time I need to buy, barley extract will be back in stock so I can make my usual stack the way I like.", "rating": 4}, {"title": "It's getting better", "text": "I think they fixed most of their system issues. My order was faster, but I still had to wait a couple of days for the next day air. The order accurate, high quality, and I even received a nice discount as an apology for when they were still working out some transitional kinks during my last order. Highly recommend! Once the transition is fully completed, this will easily be a five star review.", "rating": 4}, {"title": "Very good communication surrounding…", "text": "Very good communication surrounding orders / shipments.  Inspires buyer confidence.Free shipping is obviously just out of reach with most orders of 1 item ($49.98, $0.02 out of reach).  Inspires resentment.", "rating": 4}, {"title": "delivered on time...haven't had enough…", "text": "delivered on time...haven't had enough time to evaluate the product yet", "rating": 4}, {"title": "Very fast and legitimate website ", "text": "Very fast and legitimate ", "rating": 4}, {"title": "The products always quality fast…", "text": "The products always quality fast delivery and easy returns", "rating": 4}, {"title": "would like to see you in canada so…", "text": "would like to see you in canada so mymorders dont cost so much", "rating": 4}, {"title": "easy checkout", "text": "easy checkout. decent shipping. cant wait to try the product i ordered.", "rating": 4}, {"title": "The item is still processing", "text": "The item is still processing, has not been shipped and I have not gotten any updates.Update: They had an internal fulfillment issue apparently, they communicated with me about it after I reached out, and then overnighted the product when they could. That was very appreciated and consequently I am changing my rating. Thank you!", "rating": 4}, {"title": "Shipping delay and website issues", "text": "Edit: was 3 is now 4. Made right with 30$ coupon which was nice. Could not login to my normal account(due to the new website troubles), made a new account (only way I could order anything) and ordered with no rewards discount. Placed order Monday, never got shipping info, called was told trouble with shipping department and I would get it by Friday or they would upgrade the shipping to next day shipping so I would have it by Friday. It’s finally been shipped but I won’t get it till Monday “estimated time of arrival”. They never upgraded my shipping. I really enjoy liftmode in the past which is why my review is not a 2 or 1 but man.", "rating": 4}, {"title": "great price, effective substance, could use more desiccant and more robust packaging", "text": "My half-kg of phenibut came much cheaper than the Baltic suppliers from whom I had been ordering, and arrived promptly with a certificate of purity from an apparently independent laboratory.  I have been using it to maintain sleep and have found it effective.  My sole criticisms concern the packaging: the plastic jar comes with a flimsy lid that seems to invite spill disasters, and the phenibut already is caking, with no desiccant evident inside the jar.  These concerns are minor, because I can transfer it to my own containers and add my own saved silica packets.", "rating": 4}, {"title": "All was great as always", "text": "All was great as always, bought a 300g and 100 g of nootropics packages but unfortunately one of it arrived open. I'm  Not going to take chances of ingesting it. Other than that no complaints as usually.", "rating": 4}, {"title": "Nuff said", "text": "Good products, fair prices & rapid shipping. Nuff said.", "rating": 4}, {"title": "Satisfied with most of their products.", "text": "Date of experience: September 06, 2023", "rating": 4}, {"title": "Awesome products, decent shipping", "text": "I have been shopping here for years, always great quality products, although I will say they can be maybe a bit more prompt on having orders shipped sooner. Even then once it has shipped it's pretty quick for the free shipping, but like I said maybe a bit faster when I pay for overnight next day a.m.", "rating": 4}, {"title": "they had what no one else did but not…", "text": "they had what no one else did but not in the quantity i wanted", "rating": 4}, {"title": "Love your products", "text": "Love your products. Been buying for years now. For some reason this time, I wasn't able to pick my usual shipping method (UPS 2 day air) even though I spent nearly $80 dollars this time while and a $100 dollars last week. ( Mesembright wasn't available to purchase last week).I sincerely hope this was a fluke.However, I love your company, I love your products and thank you for being in business.", "rating": 4}, {"title": "I have tried your product against one…", "text": "I have tried your product against one other product supposedly the same exact compound of phenibute.  I don't know at first it worked great and then it stopped working I think any advice I'm not sure whether I've just been gone through more stress but I keep my dose at no more than a thousand milligrams any advice at all whatsoever from any readers", "rating": 4}, {"title": "Disappointed", "text": "When trying to place an order recently, your site wouldn't accept the current password on file, tried changing the password which wasn't successful and, due to the fact that it is nearly impossible to reach a team member by phone, I tried my old password.  Peculiar as it seems, that password enabled me to place my order; but I see that as a glitch in the ordering system.", "rating": 4}, {"title": "Phenibut less potent", "text": "I’m a fan of Liftmode and have been ordering Phenibut from them for years. I took a long break and the Phenibut I recently ordered doesn’t seem effective. It’s also a different consistency, which makes me wonder if the formula is off or something. If liftmode could get back to me I’d appreciate it. Otherwise I’d have to get it from somewhere else because the stuff I just got doesn’t seem to work at all.", "rating": 4}, {"title": "Always a reliable and trusted source…", "text": "Always a reliable and trusted source for supplements. Fast shipping and reliable customer service!", "rating": 4}, {"title": "Dr. Blaylock Recommends", "text": "Dr. Russell Blaylock recommends this product in his newsletter, which is why I ordered it and use it daily or almost daily, one scoop, about 250 mg.", "rating": 4}, {"title": "Great quality and personal service", "text": "I have been receiving nootropic supplements from Liftmode for several years. The service and quality of their product is great. The one time I had some difficulty with shipping their response was quick and personable. I came to appreciate their small business model even more because of their positive response...", "rating": 4}, {"title": "Overall - Great Experience", "text": "I've bought things from Liftmode.com on multiple occasions. Shipping is quick, prices are fair, and I've had positive experiences with the products I've ordered. The only negative would be their new website. I encountered numerous errors while searching for products and then trying to checkout. I'm hoping that will be fixed when they're done moving everything. Overall, I definitely recommend them.", "rating": 4}, {"title": "Happy customer!", "text": "Customer service and shipping was outstanding! The phenibut I ordered is fresh and works wonderfully but I can’t see the print on the bottle. I love that it comes with all the safety info but the print could be a little bigger. Thank you all keep up the excellent work!Patty Sellers", "rating": 4}, {"title": "Two orders from this company", "text": "Two orders from this company. First one via Amazon,.. Magnolia Bark, great to calm nerves for sleep or stress reduction. Product claims to help lower cortisol levels thereby promoting weight loss. Not sure about the claims on cortisol as I don't keep it in my system all the time. However, for sleep and relaxation it's awesome!  I ordered the product Matrine but still unsure if the product is beneficial", "rating": 4}, {"title": "I purchase three items from this very…", "text": "I purchase three items from this very professional nootropic vendor. I was pleased with the ease of ordering, the packaging and very high quality. Four stars because I had to pay border fees over and above the expensive delivery cost. The $ exchange and extra fees makes it too costly to order regularly.", "rating": 4}, {"title": "Nutrition matters a lot", "text": "I always try to comply with healthy diet and believe that nutrition plays the biggest role in this case. If you want to keep fit and have a good health, you should either start exercising or start consuming healthy meals. Of course, hte ideal model is to combine these two things, because it literally afford you to keep your health strong. I have chosen this serviceb ecause I thought that nutrition would helpe me a lot. So, I ordered something that I needed here and it came to within a week. I believe it's the fast delivery I have ever seen actually.", "rating": 4}, {"title": "Was sent to the wrong address twice", "text": "Was sent to the wrong address twice. They did however take care to refund... By the time thst happened money was gone, bc it was not showing up, never got a chance to try it.", "rating": 4}, {"title": "I am new to LiftMode", "text": "I am new to LiftMode , but I've only heard good things. They have a HUGE variety of pure extracts with lab test results. I am excited to try some various nootropics and LiftMode has more than I could want, at very decent prices and extremely fast shipping. Aside from all the positives, their website could use a refresh, and would be really helpful to highlight effects of certain substances more readily.", "rating": 4}, {"title": "Have placed several orders with…", "text": "Have placed several orders with LiftMode. Not one complaint. This team knows customer service! I don't generally review my shopping experiences, unless it's warranted. Orders are fulfilled accurately, and quickly delivered.The web site is very informative about the products they sell. Pretty much the way I like to do business. I'm a tough sell on five star ratings, but a few more orders just may get you there!! Thank You.", "rating": 4}, {"title": "I ordered a gram of kanna extract", "text": "I ordered a gram of kanna extract, and it didn't work for me. Could have been a bad batch. Could have been my body chemistry. Not blaming anyone for it. What really blew me away was that when I told them that it wasn't working, they were quick to refund me, no questions asked. Makes me want to shop with them again.", "rating": 4}, {"title": "The kanna I ordered was kind of a mess", "text": "The kanna I ordered was kind of a mess. There was a small plastic lid under the screw top lid and there were roughly 40mg outside the container on top of that inner lid. That was unfortunate as I lost about 20 MG (2 doses for me) when I opened the container. The phenibut was packaged perfectly. I hope my next kanna order is packaged a bit better but the quality was superb. That is why the 5th star is missing.", "rating": 4}, {"title": "Excellent shipping and customer service", "text": "Excellent shipping and customer service. Supplements are ok.", "rating": 4}, {"title": "Still waiting on my order to arrive so…", "text": "Still waiting on my order to arrive so I can't give a complete review. At this point I can say the order processing and shipping is extremely slow. Not impressed. I've used some of the products in the past and they seem to be of good quality and work relatively well for me.The small twist top containers are a little difficult to work with and dropping or spilling them is something that is entirely possible if you're not really careful.", "rating": 4}, {"title": "I received my order in a timely fashion", "text": "I received my order in a timely fashion, I was able to track order entire time. I received exactly what I ordered on the day it said it would be delivered and I am pleased.The only thing I wish that could be better for this particular product was better guidance/clearer instructions  on dosage recommendations.What I mean is, Some sort of way to tell per body weight or something of that nature what dose I should take, it is sort of a guessing game as of right now trying to figure out a dosage that will yield desired effects.", "rating": 4}, {"title": "I'm satisfied with their products", "text": "I'm satisfied with their products, especially the phenibut, good variety of new products monthly. You learn a lot about some nootropics you never heard about, and the benefits. They offer money back guarantee if you not satisfied, with no questions asked.", "rating": 4}, {"title": "The product is top quality", "text": "The product is top quality, you certainly get what you pay for. Product is great, 5 stars for the Liftmode product itself. The only reason for 4 stars is that shipping took 5 business days after I had paid extra for USPS priority mail which is usually 2-3 business days. But I understand these things happen. I plan on purchasing again in the near future, I just hope shipping is a bit more reliable next time.", "rating": 4}, {"title": "Top notch", "text": "Products are great and pretty darn good shipping rates and speed. Good guys. I have been a loyal customer for over a year now. Thanks to a lot of research on all the products I use it coincides with the information they provide which is all accurate And detailed information about their products. For better and for worse.", "rating": 4}, {"title": "Always a good experience", "text": "Always a good experience. The shipping, which I know doesn’t have much to do with Liftmode, always seems to take a while and updates on delivery change daily. It gets frustrating.", "rating": 4}, {"title": "Business Secrets Of The Maya.", "text": "You did a great job. Good product and fast delivery. The only reason you didn't get 5 stars was because I imagine 5 stars representing something extra. But that really doesn't matter you guys and gals are doing a terrific job. Be happy with yourself, and order some good tacos for the employees. They deserve it...A key to success in business is retaining quality employees. And this is done by feeding them tacos. And not just on Tuesdays either. Sure, Taco Tuesdays is a classic. But one man's classic is another man's clichè...So be careful out there, there's as many tacos in this world as there is mistakes. The key is finding balance. The sooner you figure this out the better.Thanks for your time and product,     Oscavartè Genevieve Palacostro.", "rating": 4}, {"title": "Good", "text": "It was a good experience", "rating": 4}, {"title": "Great product great company", "text": "Great product selection, kept me aware of the shipping process and product was just as described. Nice I found a trusted company that delivers.", "rating": 4}, {"title": "Great customer service.good prices…", "text": "Great customer service.good prices also... I'm having trouble with my order making it through the postal system...seems it hasn't moved anywhere for about a week.They kindly offered to send me another one as long as I agree to send the one that stuck in postage back as soon as it gets to me.Over all not a bad service.", "rating": 4}, {"title": "Always good products", "text": "Always good products. Always ships on time and correct. UPS lost my order once and i provided liftmode with the info from UPS and they made it right. I only gave 4 stars because no ones perfect.", "rating": 4}, {"title": "Good service, just need to slow down a bit", "text": "I really appreciate the customer service but I've gotten the wrong product twice. First got 40G when I ordered 100G and now I got powder instead of crystals. It works, just would prefer what I ordered.", "rating": 4}, {"title": "Ask me how you did when I recieve my…", "text": "Ask me how you did when I recieve my product.Ammendment. I am happy. Even in these trying times times, one week is not too long to wait. And free shipping.  I put in another order today.One more loyal customer.Thanks", "rating": 4}, {"title": "Products are hit or miss", "text": "Products are hit or miss. Most don't do anything. Phenibut is about the only one over the years that I feel have made a difference but can only be used like once a week to achieve the wanted effect. Would be good to get better suggestions based on product purchases.", "rating": 4}, {"title": "Sad the prices had to go up even worse…", "text": "Sad the prices had to go up even worse the Free shipping is now $49 and above. Dont like how you mark products at $48 to avoid the free shipping.", "rating": 4}, {"title": "Its not liftmode's fault but I selected…", "text": "Its not liftmode's fault but I selected 2nd day air shipping from ups and of course it got delayed so by the time I get my order it will be 6 days. Liftmode is always good though", "rating": 4}, {"title": "Ordered a pack of three Phenibut 300mg…", "text": "Ordered a pack of three Phenibut 300mg and only two of the bottles were filled. One was literally empty besides the silica gel pack.Edit: The issue was quickly addressed via email. Much appreciated. Thank you.", "rating": 4}, {"title": "I know people who swear by phenibut as…", "text": "I know people who swear by phenibut as being the most potent anxiety reducing compounds they’ve ever taken , I can’t say I noticed anything from it , but it might just be me . Other than that the packaging was great , it came with measurements , how to take , and a spoon !", "rating": 4}, {"title": "Could be perfect", "text": "While shipping is free, through UPS, for some reason the shipping page lists other options as well. The shipping page has 2 free options, which are separated by two paid options followed by a couple of other paid options. If you are not careful when trying to switch between ups ground (free) to ups air (free), it is easy to accidentally chose USPS (not free). The free options should be located next to each other. Customer service Leo is a smart ass who is extremely condescending for no good reason, as he wasn’t aware of how the website works (and he has a bad job and does it poorly). Otherwise, 5 stars", "rating": 4}, {"title": "Great as always but I can't give a 5…", "text": "Great as always but I can't give a 5 star this time because my product doubled in price and that is a big hit on my finances!   I hope the price will come back down!  Thanks Bill", "rating": 4}, {"title": "Quality Vendor", "text": "LiftMode seems to have made it a mission to differentiate what they do from other vendors of herbal (and non-herbal) \"remedies\". I think they are successful. Their website and order process is efficient and professional-looking. The packaging is first-rate and includes surprisingly extensive documentation of purity and suggested use of the items sold. In this they exceed expectations.The only reason this is four rather than five stars is price on some things is not the lowest out there. Clearly, I haven't compared price on all the products LiftMode offers with those of other vendors; just on the items I bought. I will return to LiftMode. I don't mind paying a little more if I am reassured that what I am receiving is high quality and the company cares about the product.", "rating": 4}, {"title": "Your company is usually right on point", "text": "Your company is usually right on point. The only reason for 4 stars, is because part of my order was missing. The problem was resolved in a day...and the fast shipping from the company is excellent.", "rating": 4}, {"title": "4 stars because the bugs STILL on their…", "text": "4 stars because the bugs STILL on their site after how long now... other than that Liftmode is the best. Great customer service, super fast shipping, great products.", "rating": 4}, {"title": "Great customer service", "text": "Great customer service, and fast shipping! I wish Liftmode would start carrying the Phenibut F.A.A. again. It’s been out of stock for months. But that’s my only complaint. Great company!", "rating": 4}, {"title": "Love liftmode..", "text": "Love liftmode... but DO NOT DO NOT use usps, ordered fri on the 20th now its going on Fri the 3rd, still nothing updated. USPS is slower than molasses and will probably lose your package. Lesson learned I guess.", "rating": 4}, {"title": "all went smoothly and no surprises", "text": "all went smoothly and no surprises. Glad you have the product too!", "rating": 4}, {"title": "I absolutely love the phenibut it helps…", "text": "I absolutely love the phenibut it helps my concentration so well. I got some stuff for appetite suppressant and it didn't effect me at all. Kind of bummed over that. Else I'd of given 5 stars. Fast delivery as always", "rating": 4}, {"title": "Its decent", "text": "Its pretty good quality just not for me tbh", "rating": 4}, {"title": "great product.", "text": "great product.knocked of one star cause you are out of stock so much 1111", "rating": 4}, {"title": "I love LiftMode", "text": "I love LiftMode. Majority of the time the phenibut is sold out but it doesn’t take too long to get back in stock. They are always so helpful when I contact them.", "rating": 4}, {"title": "Phenibut is great and helpful and the…", "text": "Phenibut is great and helpful and the customer service is nice and I have been dealing with liftmood for a long time but the prices are greatly exaggerated and very expensive", "rating": 4}, {"title": "service was quick and responsive", "text": "service was quick and responsive. received multiple e-mail alerts about my purchase and shipping label. will recommend this site to my friends if the product is satisfactory", "rating": 4}, {"title": "They always have what i want in stock", "text": "They always have what i want in stock. ALWAYS expedite my deliveries worry free. The products i order come with quality certificates. Ive ordered from liftmode for several years and will continue to do so.", "rating": 4}, {"title": "Great customer service and company", "text": "Great customer service, I bought the phenibut didn't really do anything to or for me but love the company.", "rating": 4}, {"title": "purchased to try", "text": "Well I purchased. It came in three days, it seems to help a little, and that is more than enough for me 🥰 a little euphoria but my tolerance to things is higher than most people.", "rating": 4}, {"title": "Love the product,but..", "text": "Love the product.  Been using for over 2 years now, ordering monthly.  But I've never been given any discounts or special offers for being such a long standing, loyal customer😔", "rating": 4}, {"title": "I always order from lift mode", "text": "I always order from lift mode. Their delivery is quick and the product arrives in excellent condition. However the product I order has not been the quality it has been in the past.", "rating": 4}, {"title": "Lab testing", "text": "Lab testing, good extract, pricyGood clean product that came with lab test results and was exceeded expectations from kanna extract. Would like more varieties of extract.", "rating": 4}, {"title": "Excellent customer service", "text": "Excellent customer service. Incredibly fast shipping and a product that delivers what is advertised.", "rating": 4}, {"title": "Very good product lab tested ,fast…", "text": "Very good product lab tested ,fast shipping! even with the mail being backed up. Wish the product was ground a little finer but, the effects are pretty amazing!", "rating": 4}, {"title": "Quick easy reliable", "text": "Date of experience: June 01, 2023", "rating": 4}, {"title": "I love you guys", "text": "I love you guys! I knocked a star off only because there's no info on the phenibut shortage on liftmode, best info I got was on reddit.", "rating": 4}, {"title": "Fair pricing and great product", "text": "Fair pricing and great product. The only reason for 4 stars instead of 5 is the shipping. I paid extra and did not receive my package on the date said in USPS.", "rating": 4}, {"title": "Price increase", "text": "It's was not great in 48 hours price increase", "rating": 4}, {"title": "Not really sure how I feel ab this…", "text": "Not really sure how I feel ab this product. The effects are definitely there but I dont think Kanna is for me. Would recommend it to someone though. 9.5/10", "rating": 4}, {"title": "The only thing you should change is to…", "text": "The only thing you should change is to have a better supply. That's my only note. You  guys are great.", "rating": 4}, {"title": "Very good quality and fast accurate…", "text": "Very good quality and fast accurate service and quick shipping. Really glad I found this company and shall be sure to order more from them.", "rating": 4}, {"title": "Not the cheapest but always the highest…", "text": "Not the cheapest but always the highest quality! You know what you are taking is legit so it's easy to see if a supplement is effective for you.", "rating": 4}, {"title": "The website is the only complaint I…", "text": "The website is the only complaint I have. Otherwise I love your products.", "rating": 4}, {"title": "The product was shipped quickly and is…", "text": "The product was shipped quickly and is exactly as described.", "rating": 4}, {"title": "This energy cap makes me feel as if I…", "text": "This energy cap makes me feel as if I have drank 2 cups of coffee, except I haven't added cream and sugar.", "rating": 4}, {"title": "My order never has been shipped in 13…", "text": "My order never has been shipped in 13 days (first class 5-15 days) other then that from prior experience they have good products", "rating": 4}, {"title": "I made an order everything is good so…", "text": "I made an order everything is good so far", "rating": 4}, {"title": "This product is powerful", "text": "This product is powerful. I have had to spit each capsule in half otherwise I was wired. The energy cap is design to put you in overdrive.", "rating": 4}, {"title": "Good", "text": "Item is good.  It works great to help you sleep.", "rating": 4}, {"title": "Consistent service ✅", "text": "Concise, fast, and consistent 👌🏻", "rating": 4}, {"title": "It was all good", "text": "It was all good, easy to use website, place order. And I received it promptly...", "rating": 4}, {"title": "Why are the caps pulled from the…", "text": "Why are the caps pulled from the shelves when the powder is not? Works for me though. Bad withdrawals", "rating": 4}, {"title": "The company uses not enough quality…", "text": "The company uses not enough quality product, but the delivery is fast", "rating": 4}, {"title": "Always a positive experience", "text": "Excellent client service and products", "rating": 4}, {"title": "Good Asian food.", "text": "One of my favorite restaurants for Chinese food in Jacksonville. Above average dim sum", "rating": 4}, {"title": "Ordered the Piperine several times now", "text": "Order the Piperine several times now.  I use as a herbal supplement potentator. Always great quality and price.", "rating": 4}, {"title": "Good overall", "text": "Good product, good customer service. Was able to get an order reshipped and delivered in ~3 days. A+++", "rating": 4}, {"title": "Your website could be a little bit more…", "text": "Your website could be a little bit more user friendly. Besides that everything else is great.", "rating": 4}, {"title": "Best releif better than narcotics", "text": "Thank you I suffer trichotillomania this help me more than any addictive BENZO. Thanks", "rating": 4}, {"title": "Product as advertised", "text": "Product as advertised Took a few days before order was processed but once it was shipped within two days", "rating": 4}, {"title": "Very pleased", "text": "Easy to order and delivery was quick! Would definitely recommend this site to anyone.", "rating": 4}, {"title": "Great products and fast processing", "text": "Great products and fast processing, only downer is the constantly changing prices.", "rating": 4}, {"title": "Great service", "text": "Great service, unfortunately you guys have been out of phenibut for some time now.", "rating": 4}, {"title": "drop your prices", "text": "Quality is top notch, but the prices are starting to become mildly comical.", "rating": 4}, {"title": "Great product", "text": "Great product! But I don't ever find a coupon more then 10%. Wish more would be available", "rating": 4}, {"title": "Order arrived sooner than expected", "text": "Order arrived sooner than expected. Entire purchase process was easy and hassle free.", "rating": 4}, {"title": "The product was great, shipping not so much.", "text": "The product was great. Perfect maybe. But my two day air shipping took 6 whole days.", "rating": 4}, {"title": "Theyre a reliable company with good…", "text": "Theyre a reliable company with good shipping through ups. Highly recommend.", "rating": 4}, {"title": "you no longer sell my product", "text": "Date of experience: November 09, 2023", "rating": 4}, {"title": "Decent quality product", "text": "Decent quality productDecent pricesPlz get a members rewards program going plz", "rating": 4}, {"title": "Product was good", "text": "Product was good, Arrived A little late or would be 5/5. Great Customer service. :)", "rating": 4}, {"title": "Just starting the product and still…", "text": "Just starting the product and still adjusting to see what works best for me.", "rating": 4}, {"title": "This was a good deal and shipping cost…", "text": "This was a good deal and shipping cost a bit but prompt.  Thank u lift mode", "rating": 4}, {"title": "Very good products", "text": "Very good products. Not the cheapest, but amongst the highest quality.", "rating": 4}, {"title": "I am confident that they actually sent…", "text": "I am confident that they actually sent capsules that contained what I ordered.", "rating": 4}, {"title": "Good reliable service and products are…", "text": "Good reliable service and products are powerful...", "rating": 4}, {"title": "Lift Mode products are always pure and…", "text": "Lift Mode products are always pure and potent.", "rating": 4}, {"title": "Reasonably easy to setup an order", "text": "Reasonably easy to setup an order. Could use a reorder function.", "rating": 4}, {"title": "Always great product", "text": "Always great product! Always shipped timely! Never had a problem.", "rating": 4}, {"title": "Your products are very good quality but…", "text": "Your products are very good quality but over priced.", "rating": 4}, {"title": "Everything came on time and safely", "text": "Everything came on time and safely.  Thanks for the effort.", "rating": 4}, {"title": "John great products fast shipping", "text": "Date of experience: August 06, 2022", "rating": 4}, {"title": "Easy to find products and fast shipping", "text": "Date of experience: December 29, 2021", "rating": 4}, {"title": "Quick when needed", "text": "Quick when needed. Need capsuls tho", "rating": 4}, {"title": "It came on time.", "text": "Date of experience: March 17, 2023", "rating": 4}, {"title": "It comes fast.", "text": "Date of experience: December 07, 2022", "rating": 4}, {"title": "Fast shipping", "text": "Fast shipping, phenibut was ok", "rating": 4}, {"title": "Fast shipping", "text": "Fast shipping,  good quality", "rating": 4}, {"title": "quick delivery", "text": "quick delivery; fair prices", "rating": 4}, {"title": "Fast efficient quality", "text": "Date of experience: November 04, 2021", "rating": 4}, {"title": "Fast shipping", "text": "Fast shipping. Ok pricing.", "rating": 4}, {"title": "Great company", "text": "Date of experience: June 18, 2022", "rating": 4}, {"title": "Trusted product eveeer", "text": "Date of experience: September 13, 2021", "rating": 4}, {"title": "Their phenibut is good..", "text": "Date of experience: September 15, 2020", "rating": 4}, {"title": "Lift Mode is trustworthy", "text": "Fast and reliable.", "rating": 4}, {"title": "Phenibut HCLreached god mode I've tried…", "text": "Thank you for your product I will use correctly", "rating": 4}, {"title": "Solid Product", "text": "Solid product, among the best I've tried.", "rating": 4}, {"title": "Quality products at a good price", "text": "Quality products at a good price. Customer service is top notch as well. Will continue to be a faithful customer.", "rating": 4}, {"title": "Using liftmode for years now", "text": "Using liftmode for years now, excellent customer service and reliable delivery using DHL from abroad.", "rating": 4}, {"title": "The capsules in my order of LiftMode’s…", "text": "The capsules in my order of LiftMode’s Energy caps were damaged.  This was very unfortunate, but upon inquiry there was a speedy reply! This is all you can ask of a business. 4/5", "rating": 4}, {"title": "I had to take 3 scoops before I could…", "text": "I had to take 3 scoops before I could feel the effects, but all in all, I think it works.", "rating": 4}, {"title": "Great Products but Shipping Errors", "text": "Excellent products both the SALG and L-Theanine in terms of their effects and benefits. However, my order for 5g of SALG came with the wrong scoop size (1 CC instead of .15CC), and in addition, the L-Theanine tub was shipped with a Cert. of Analysis that had a questionably recent expiration date. I called and was informed that the products are still tested while sitting on the shelves.", "rating": 4}, {"title": "Fast and reliable delivery", "text": "Fast and reliable delivery. Products are good.", "rating": 4}, {"title": "Satisfied", "text": "Seems to be good quality for a good price.", "rating": 4}, {"title": "Product is satisfactory", "text": "Product is satisfactory. Order is shipped quickly. Prices are high.", "rating": 4}, {"title": "I don’t think I have enough information…", "text": "I don’t think I have enough information about about Kanna to know what Too look for .", "rating": 4}, {"title": "I couldn't give a 5 star rating because…", "text": "I couldn't give a 5 star rating because I kept getting a AVS mismatch. I had to go through the inconvenience of having to go to the bank to get a money order. Someone recently told me that my credit card company may have thought that someone may have been trying to rip me off. I will order something in the near future and if I get that phony AVS mismatch again, I will call my credit card co and tell them no, I want to buy something from Liftmode", "rating": 4}, {"title": "Ordering was fast and easy", "text": "Ordering was fast and easy. Received my order very quickly. Still working out how it affects me and how much to take as I am new to phenibut.", "rating": 4}, {"title": "Always great quality...", "text": "Date of experience: March 10, 2020", "rating": 4}, {"title": "Solid product", "text": "Solid product. Definitely feel a difference and elevates my mood/lowers my anxiety", "rating": 4}, {"title": "Everything was great except the kanna…", "text": "Everything was great except the kanna capsules got destroyed in transit.", "rating": 4}, {"title": "I'm pleased with everything but price is too high.", "text": "I've ordered from LiftMode several times and have had a good experience.  The product description on the website is accurate and the ordering process is easy.  I've also appreciated the quicker shipping options and my products arrived on time.  My only complaint is the price for the product I order.  It's made in China and the majority of research that I've found indicates that the cost of it is pennies on the dollar.  I realize LiftMode needs to charge a fair price to cover their costs and to be able to offer it to US customers and to make a profit.  However, I feel their profit margin is way too high.  The reality is I've found something that really helps me but can't afford to order it as often as I need to.  I think this is due to a monopoly in that LiftMode is one of very few companies that offer my product so they can charge a higher price.", "rating": 4}, {"title": "Great customer service and speedy…", "text": "Great customer service and speedy delivery. I was hoping for more effect with the kanna, considering the price, but overall very satisfied with my purchases.", "rating": 4}, {"title": "it's been a week and a half..  and no correspondence", "text": "it's been a week and a half I've checked my order and it keeps saying it was picked up and that's all.I know it says under free shipping that there's no tracking,  but it would be much better customer service if you had some way of letting your customers know via email that your package has been shipped.It makes you feel totally in limbo as to what's going on with your orderUpdate.. very fast response after review on trust pilot..  updated to four stars... I've been in customer service for over 20 years now and what I've learned through all of it that it's not what you do but how your customers perceive what you do..... go the extra mile and you might have a customer for lifeThanks!!", "rating": 4}, {"title": "had issue now fine", "text": "Date of experience: January 25, 2020", "rating": 4}, {"title": "Good products", "text": "Good products, but prices keep going up. The phenibut has doublee in the past year.", "rating": 4}, {"title": "Worked well together", "text": "Date of experience: January 10, 2020", "rating": 4}, {"title": "STILL NOT HERE", "text": "STILL NOT HERE. BEEN 3 WEEKS.Edit:Since the liftmode team was so kind to follow up and reply. this has been edited to reflect that. ive tried their stuff before its good.", "rating": 4}, {"title": "Propels my Disc Golf game to new transcendant levels", "text": "Great product with certified lab testing for purity.Informative sales staff.Promptly shipped with shipper tracking feedback.I can trust LiftMode for high quality nootropics.", "rating": 4}, {"title": "I love the products but in a recent…", "text": "I love the products but in a recent order I purchased ITPP and the sample was so small in relation to the recommended dose. I only got 3 servings out of it. Considering the price that is very very high.", "rating": 4}, {"title": "Love liftmode", "text": "Love liftmode. They're very fast and dependable. Prices have gone up quite a bit. That's the only why I didn't give 5 stars.", "rating": 4}, {"title": "Good quality phenibut to take with ny…", "text": "Good quality phenibut to take with ny morning coffee", "rating": 4}, {"title": "I've been ordering Phenibut from…", "text": "I've been ordering Phenibut from Liftmode for 4 years. Its always been good quality, and their shipping is super fast which is a plus. I've ordered other products. Here is my review of each.Magnolia Extract: It was good for sleep, but not perfect. It's good if you have little insomnia here and there, but not for serious insomnia. But good when combined with other sleep supplements like Valerian Root. Phenethylamine: Great stimulant, but very short-acting (1 to 2 hours) I would suggest combining it with Hordenine to increase the duration which I found works nicely. Be aware though the crash aka after the effects wear out is not comfortable so use these compounds sparingly. Sleep Caps: Didn't work that good for me, but it works really well for my brother, so worth a try if you suffer from insomnia. Energy Caps: Had a good wakefulness effect, but only when you take at least 3 caps at a time, so bear that in mind if thinking about buying these.Overall I love Liftmode, and their prices, and wouldn't buy anywhere else.", "rating": 4}, {"title": "Hi my name is Andrea and I have ordered…", "text": "Hi my name is Andrea and I have ordered from you a few times, I always found that the products are excellent, they actually do what it “says on the tin”. I tried to purchase some phenibut and cbd oil today but I was told you cannot ship to the u.k. I am sad about this and actually dismayed that I couldn’t purchase from you. When you consider that you can buy almost everything on the web, this seems ridiculous. So I will have to love you and leave you, but I do thank you for your excellent products.", "rating": 4}, {"title": "GREAT !!!", "text": "GREAT !!!!  RECEIVED VERY FASTAMAZING. HAVEN'T HAD TIME TOTRY PRODUCT YET BUT IM SURE ITSGOOD.  THANK YOU 😀😀😀", "rating": 4}, {"title": "Good products 5 star customer service", "text": "Good product for the most part excellent customer service when on a rare occasion there is a problem.The main complaint is they have been out of the phenibut capsules for a couple of months now", "rating": 4}, {"title": "A+++", "text": "easy ordering. very quick and free shipping with spending 25$ or more. Prices have increased slightly lately, otherwise 5 star company.", "rating": 4}, {"title": "Package arrived safely, but container needs a bit of a design modification.", "text": "The package arrived, as ordered, but I felt that the inner powder container cover wasn't very secure, and powder did get everywhere the first time I tried to open it... Perhaps a bit more secure inner cover would be a good modification to the product.Oleamide Powder 500g", "rating": 4}, {"title": "The real deal !", "text": "Thank you so much ☺️ I was very pleased with my order !I will be ordering again in September.I understand you are experiencing some issues with your machine , a few crushed capsules in the order. Friendly customer service !!!Thank you so much !!!!So glad you are providing your customers with a very fine product !!Thank you .......!", "rating": 4}, {"title": "You guys rock the pheni", "text": "You guys rock the pheni! Long time customer,always consistent.", "rating": 4}, {"title": "Product was delivered in good shape", "text": "Product was delivered in good shape. Would buy again.", "rating": 4}, {"title": "Good delivery time", "text": "Good delivery time. Good prices. Right product.", "rating": 4}, {"title": "Phenibut", "text": "Liftmode is a great place to get supplements. I struggle with poor sleep, anxiety, and focus. Phenibut helps me a great deal and I use it responsibly. Liftmode is reliable and sells a good product. The only down side is many of their phenibut products doubled in price this year and I was told it was because of supplier cost. I hope that is the only reason and the cost comes back down.", "rating": 4}, {"title": "Always have a nice experience with…", "text": "Always have a nice experience with liftmode easy check out process, free 2 day shipping, good products, good quality, I don't like that the price is going up on some of the products but I'm still and always will be a loyal customer.", "rating": 4}, {"title": "Product arrived at the promised date…", "text": "Product arrived at the promised date and time.   Product package neatly in safely and was as promised.   However,  delivery time was a bit lengthy.  I have made Sighn purchase from different site where delivery time was that half of lift mode", "rating": 4}, {"title": "The product is top quality", "text": "The product is top quality! Delivery was painfully long but in the end i'm very satisfied thank you liftmode will order again! Probably best quality phenibut i've had! F.a.a versio better than hlc in my opinion.", "rating": 4}, {"title": "Love your Phenibut", "text": "Love your Phenibut, however the 2 day shipping I paid extra for did not come in two days. Other than that, wonderful product. This is my second time buying from them and I would recommend this to anyone who struggles with social anxiety. It will help tremendously. Just don’t take too much. 1-2 capsules when starting.", "rating": 4}, {"title": "Still assessing.", "text": "I don't notice any change yet so I'll continue, but the service has been top rate.", "rating": 4}, {"title": "I ordered Phenibut and it arrived very…", "text": "I ordered Phenibut and it arrived very quickly. Unfortunately the Phenibut did not really work for me. I was looking for stress relief and mood boost. I noticed no changes. I’m not blaming LiftMode though because Phenibut Just May not work for me.", "rating": 4}, {"title": "Good product", "text": "Product is just as described", "rating": 4}, {"title": "Liftmode consistently delivers quality…", "text": "Liftmode consistently delivers quality products. Phenibut has seen a recent price increase which is why I cannot give 5 stars", "rating": 4}, {"title": "great product", "text": "great product, ease of service and efficient shipping, thanks Liftmode", "rating": 4}, {"title": "First time trying LiftMode’s Phenibut", "text": "To be honest I was reading quite a few negative reviews recently about LiftModes phenibut , mainly their recent stock...However when I got my product and tried it , I was very pleased 😀 smooth , clean with all the desired effects 👍Looking forward to trying more of their products! Would recommend 🙂", "rating": 4}, {"title": "Mostly good service", "text": "I have been a long time liftmode.com customer. I have had a great experience every EXCEPT once.  There was one bad batch I came across.  The problem wasn’t even that I got one batch.  The problem was that after spending over $2K with liftmode I had to argue with them over many emails to get them to replace a $50 order.  That being said I still order from them.", "rating": 4}, {"title": "Products shipped fast and worked as…", "text": "Products shipped fast and worked as described", "rating": 4}, {"title": "All in all", "text": "All in all, a good product. I’d like to see more of the  provider checking in with their customers not just after they have their money and the product is shipped. Real interaction. I know it’s not always possible,  but Make your customers feel more valued as a human being. Not someone who’s getting the same “fantastic update” that thousands of others are.", "rating": 4}, {"title": "Service and products are great", "text": "Service and products are great! Some products from a few years ago are no longer available, however, specifically Noopept and 500gm Phenibut.", "rating": 4}, {"title": "Stop raising the price of Phenibut", "text": "Date of experience: May 15, 2019", "rating": 4}, {"title": "Corrected mistake", "text": "I had ordered a 40g container on Phenibut and a 1g sample of Icariin.The product was shipped fast and arrived within two days but when I opened it up the Icariin had been forgotten.I contacted lift mode and they promptly replied with an option to either re-ship or give me credit at the store. I was disappointed but still happy with the service I received.I will be ordering again.", "rating": 4}, {"title": "Just started taking the items", "text": "Just started taking the items - have noticed a little bit goes a long way! More energy and the calming meds work well if taken proper dosage.", "rating": 4}, {"title": "Reliable, but not super fast", "text": "Shipped to Germany, worked very well (10 days).", "rating": 4}, {"title": "I am a fan of Liftmode--have been for a…", "text": "I am a fan of Liftmode--have been for a long time. However, I have been disappointed to see some of their offerings go away. The choline bitartrate in particular was a sad thing to see go--it's one of my favorite nootropics.  Overall, a wider variety of offerings would be nice.Other than that, I love Liftmode.  Stellar service, reliable, and never had a problem with an order.", "rating": 4}, {"title": "Honestly not overly impressed", "text": "Honestly not overly impressed with the hcl Phenibut I ordered from liftmode. Seems to be weaker than the other batches of Pheni I've ordered. I find I need to take more of this Phenibut than I have in the past, about 1.5-2x my dose, even with a 6 month tolerance break. I thought it might just be me, but I had a family member try it (who used to be a user of Pheni) and they found that it was weaker as well. Shipping was fast, and it did weigh out to what I ordered at least. Perhaps I just got a weaker batch, but since this is my first time ordering from Liftmode and I've heard good things, I'll give them the benefit of the doubt.", "rating": 4}, {"title": "Almost perfect service", "text": "My package got to me before I expected it too, only I never got an email saying it shipped. It was quick and painless ordering from them, though.", "rating": 4}, {"title": "Prompt delivery but unfortunately the…", "text": "Prompt delivery but unfortunately the phenibut hasnt helped me at all. I've not noticed any difference.", "rating": 4}, {"title": "Phenibut f.a.a", "text": "Phenibut f.a.a I purchased from Liftmode is excellent. The quality is great and consistent in use however the measurements are inexact. 1 .665 scoop says to be 250mg whereas the same scoop from other vendors claims to be an even 500mg. Not sure if Liftmode has a more concentrated substance but the quality is great!!", "rating": 4}, {"title": "good and prompt delivery service but so…", "text": "good and prompt delivery service but so far some of the stuff doesn't work like it's supposed to", "rating": 4}, {"title": "Positive feedback", "text": "Arrived fast. Good product, I enjoy using it for social situations. Just need to be responsible with it.", "rating": 4}, {"title": "I have purchased the phenibut a few…", "text": "I have purchased the phenibut a few times now and has been great quality...def better than other brands I've tried...prices went up recently but still a good value...", "rating": 4}, {"title": "I wish the prices wouldn't jump up so…", "text": "I wish the prices wouldn't jump up so quickly.", "rating": 4}, {"title": "Been buying phenibut by the 500 gram…", "text": "Been buying phenibut by the 500 gram tub from liftmode for years. Great quality, great price. Win win because liftmode was still making a killing off me, but now with phenibut prices at all time lows do to increased global use, especially through liftmode alone, they've made the unwise decision to sell 250 grams max. This costs more, and it's a d*ck thing to do to loyal/hooked customers, even if it's an attempt to stay off DEA scheduling radar, which I suspect it is.Having people show up at the ER from withdrawel is far worse than openly selling half kilos of a Russian pharm on the clearnet. As a Gaba B agonist, it's withdrawel symptoms and risk are on par with others - GHB, Alcohol, barbiturates...this means they're very bad. Agonizing nentally and physically. Tremors delusion, siezures, extreme anxiety, insomnia (extended inability to sleep compounding all of the above), and no ER will accept you for detox if you show up saying your kicking phen. They've either not heard of it or their system is too full with opiate addicts....but they do keep a log and report to the government and this would be the evidence the DEA holds up to get the Banhammer out.The DEA and FDA a despise substances that people use to self medicate, especially sucMy point is this - you're screwing your customers and yourselves by making a product you laid out unaffordable for some. I would bet 70% if not way more of your profit comes from phenibut. Stop price gauging now that you cornered the market. Buy out Newmind or something and spread your sales out or. Don't telling your customers it's a stocking issue when your competition is selling at the best prices they've ever listed, because some of us see what's going on and will buy from them just to screw you back (look up my sales record as an example). I'm fortunate enough to have a doctor that will write a baflofen prescription having never heard of it, but most are not. Some are finding themselves in situations where it's lose your job or go to the ER and try to explain what phenibut is and why they've been consuming it by the gram not the MG...Still the best in the supplement game. Don't F it up. Good that you want to hear from your customers but I've already emailed about this and got no reply.", "rating": 4}, {"title": "Great product but delivery is taking…", "text": "Great product but delivery is taking long time.", "rating": 4}, {"title": "100g Phenibut powder", "text": "100g Phenibut powder- Haven't tried the HCL or FAA from LiftMode but the powder seems to be lacking in potency compared to the other source I've tried. Not super noticeable but i have had to tweak starting dosage up by about 250mg. The price per mg is amazing. Will definently buy again but may opt for FAA next time around.", "rating": 4}, {"title": "Good for the most part", "text": "Great products. Good customer service. I just don't understand why the prices of many different products rose so high. I've been a loyal member, love buying the phenibut, but the price of that went up $25, which I didn't appreciate.For the most part, love this site. Prices could be way better though.", "rating": 4}, {"title": "Phenibut for nerve pain", "text": "I ordered these because I use them to help get rid of my nerve pain. I like the fact that they're 99% pure phenibut. They seem to be helping but I have only taken them for a few days. I'm hoping that they will work for me!!", "rating": 4}, {"title": "Quality company", "text": "Great service, quality, and shipping. Minus one star because product was slightly over market price.", "rating": 4}, {"title": "Quality & Speed but they doubled price", "text": "Always love the speed and quality of the service. What I do not like is the fact that they nearly doubled the price of one of the products I purchase so I may have to look else where.", "rating": 4}, {"title": "Liftmode - Excellent value and customer service", "text": "Excellent value and very good customer service. I'd recommend them!", "rating": 4}, {"title": "Fast mail had a little trouble I sent…", "text": "Fast mail had a little trouble I sent it to a po box and ups does not deliver to po boxes", "rating": 4}, {"title": "Best phenibut", "text": "Got the best Phenibut ever from them. You can really feel te quality when taking it. Only wish that it would arrive quicker. Overall you will not be disappointed.", "rating": 4}, {"title": "Great product", "text": "Date of experience: January 12, 2019", "rating": 4}, {"title": "Overpriced goods", "text": "Your product is nice, but there is no reason for the total price to be double the amount it is worth. I Bought one thing from your website worth $15. I ended up paying $30 and some change.", "rating": 4}, {"title": "So I've been using phenibut for a…", "text": "So I've been using phenibut for a couple months now, and at first I was ordering from nootropics Depot. Their quality was really great but they raised the prices quite high so I decided to try liftmode out because they had really good feedback as well and the price was cheaper. I have no complaints from liftmode at all. Their quality has been good Everytime. Phenibut quality is important to me and as long as it's consistent every time I will continue to order from them. Shipping is always very quick as well. Thank you liftmode for your services.", "rating": 4}, {"title": "Only been unsatisfied once! Been buying for years.", "text": "I love most all of liftmodes products and I’ve been regularly buying most of the top products. However the rhodiola was way weaker than I was expecting. I got almost no benefit from it and I normally take 3 to 1%. I’ve yet to ask them for samples of new products, but with their good customer service I’m sure they would do it and that is how you weed out the crap company’s compared to the passionate ones.", "rating": 4}, {"title": "I used to buy phenibut from liftmode a…", "text": "I used to buy phenibut from liftmode a few years ago quite a bit, I'm a little sad to see that the same labeled product has actually changed... It's still of decent quality but it's definitely not the same it used to be :/*Edit* Your absolutely right my mistake, I had purchased the larger crystals in the past. The container I have now is the fine crystals, which the taste is different. I've also had the F.A.A. and out of everything I like the larger crystals the best. Thank you for clearing that up for me. I have bad anxiety and it helps me significantly when I take it.", "rating": 4}, {"title": "Top notch", "text": "Great product ,    Great quality...", "rating": 4}, {"title": "They deliver as promised!", "text": "Date of experience: December 11, 2018", "rating": 4}, {"title": "It’s still good for the price", "text": "Id say average. I bought this Phenibut because I heard online and from people I know that it was better, but surprisingly it isn't as good as where I have been buying it in the past. It's still good, it's just not as strong. Using exactly 500mg of each, there is enough difference to tell. This was trying to use exactly the same dose two days apart etc. Overall it's average though and not bad. A better price too.", "rating": 4}, {"title": "Everything but the shipping to which…", "text": "Everything but the shipping to which you couldn't control", "rating": 4}, {"title": "It's been good...but", "text": "In the past, I've had a good overall experience with you guys, but my current order, which was placed on 11/23/18 hasn't arrived yet and today is 12/3/18. I don't know why it has taken so long when you guys deliver directly from the U.S.", "rating": 4}, {"title": "The product and shipping were great", "text": "The product and shipping were great. However, I signed up for an account and the password I signed up with was sent to me an email in clear text, a big security no-no.", "rating": 4}, {"title": "Happy, longtime Lift-Mode Customer with Suggestions for Improvement!", "text": "I've been a LiftMode customer for years now and am routinely impressed with the operation's turn-around speed following from the time of your order online, to the products' shipment out from their facilities. In addition, they offer free guaranteed two-day or even one-day delivery service if the price of your purchase is high enough.The quality of their products is generally pretty high. That said, every once in a while, I might receive an order that doesn't quite seem to be at the caliber of the others I routinely purchase, but it's more than acceptable. And I'm sure I could reach out to LiftMode and say something, but the difference in quality is so minute that it's not even close to worth it.A recent trend that I've found a bit disappointing is slowly increasing costs on some of their products. The price of 1000 mg worth of Phenibut fluctuates on the site (I assume this depends on stock availability), but recently those fluctuations have tended to push prices higher and higher. What I might have paid for around $160 or so a few months ago can now cost $220 or more. I've also noticed that the range of products available fluctuates from time to time. For example, I prefer to purchase Phenibut that's in a large or medium crystal grain size, but lately, only the fine crystal or powder versions are in stock. The mobile site could also use some work, as the menu options at the top no longer appear with labels. I know from the past to press the orange buttons at the top to pull down options to select but always have to press a few of them before locating the link that I need. Or, when using the search feature for products (for instance, entering the term \"Phenibut\" to search), not all quantities of Phenibut appear in the search, making it seem as though the larger bottles are not for sale. The only way to locate the larger quantities is to go into my previous orders and click \"reorder\" -- which puts whatever larger size bottle that might be in stock into my cart.  They do offer discounts for longtime customers, but I wish these were more substantial, especially as the prices have trended upward. All that said, I'm a happy LiftMode customer and would recommend their products to all. They provide a needed service that is trustworthy too, and I thank them for that!", "rating": 4}, {"title": "This is the first phenibut purchase…", "text": "This is the first phenibut purchase I’ve made and I must say... I’m still getting use to the product; I don’t think it suits me well.I however am happy with liftmodes purchase and delivery process. No complaints", "rating": 4}, {"title": "Easy to buy", "text": "Easy checkout. Decent prices, quality seems good. Shipping is a bit high.", "rating": 4}, {"title": "Stand alone research of…", "text": "Stand alone research of PHENYLETHYLAMINE is hit and miss. When it does work A lot of stimulation. Euphoria is mid range.I will order the HORDENINE and research these 2 together and give it another shot. The PHENYLETHYLAMINE does have good potential.", "rating": 4}, {"title": "Good stuff. Improves the quality of my sleep", "text": "I don't think Phenibut effects me very much while awake. When I take a high dose I notice almost no difference while I'm awake. I was hoping for a more euphoric effect but substances effect everyone differently. I have been prescribed Gabapentin in the past with similar effects while awake. However If I take 300-600mg of Phenibut before bed I have a slight increase in dreams and I wake up feeling amazingly refreshed. I did not have that effect with Gabapentin. Phenibut is great stuff for sleep. It doesn't help me fall asleep but it definitely improves the quality of my sleep which is something I need. Melatonin and a Phenibut capsule or 2 before bed is an amazing combination for me. Will buy again soon. Some idiot below said it was tainted with MDMA. Not at all. That guy had a false positive and is dumb.", "rating": 4}, {"title": "Very good quality and price", "text": "Very good quality and price. Had a small hiccup with the address but that's ok.", "rating": 4}, {"title": "Product is great", "text": "Product is great, shipping is fast. Prices have gone up though.", "rating": 4}, {"title": "If not the struggle in the Beginn 5⭐️", "text": "In the beginn I did a little struggle with the purchase because of the Billing Adress of my credit card which was not accept. But in the end I could finish the transaction with bitcoin, and for on there on everything went well. A few hours  after the purchase was finished I already had the tracking number of UPS and now 10 businessdays after I revived the product here in Switzerland.If not the struggle in the Beginn 5⭐️The product itself i could not try yet.Thank you Liftmode Team", "rating": 4}, {"title": "Everything was good", "text": "Everything was good. I am happy with my purchase. However, there was one problem. When my order arrived, The scoop was broken in half. Therefore, I had to estimate how much Phenibut I'm consuming using a teaspoon.", "rating": 4}, {"title": "I did a lot of research before I…", "text": "I did a lot of research before I decided to purchase your products The two that I liked the most were: Phenibut and the Energy Caps (a good stack). I'm not sure what this review should consist of. The Product or Customer Service. The value of your products are great. Pure and affordable. .My experience with phenibut is limited. I have read your information on  LiftMode as well as others - including erowig.org. and have been quite cautious. Right now, the jury is out on phenibut, Besides the usual benefits with phenibut, I wanted to see if there could be any relief for my non- diabetic peripheral neuroprophy in my feet. Seems like it came from the same family as gabapentin and Lyrica. Of course, being from the same family doesn't mean that it will work the same way. The Customer support is, as far as I know perfectly fine. Maybe Amazon doesn't let phenibut on their site - with Prime I could have gotten it in two days instead of over a week. Just sayin...", "rating": 4}, {"title": "Great service", "text": "Great product, great shipping...too many  emails.", "rating": 4}, {"title": "product was real good quality", "text": "Date of experience: August 20, 2018", "rating": 4}, {"title": "Great Phenibut", "text": "Had an issue with ordering, but the Phenibut is definitely worth it. Very pure product. Only about .5% HCL so it still helps metabolise without sacrificing potency or taste.", "rating": 4}, {"title": "I use this product for post cycle…", "text": "I use this product for post cycle therapy (bodybuilding). It works.", "rating": 4}, {"title": "Good stuff", "text": "Good stuff, but you guys neeed a better shipping method.. 7 days for 2 bottles of supplements is insane.", "rating": 4}, {"title": "liftmode definitely knows its product…", "text": "liftmode definitely knows its product line however however after a $75 investment I quickly learned that liftmode products have a quick fuse and burn out just after minutes.-easily I can take six to eight of the sleep pills with very little if any effect it takes about 4 pills of the LM  energy to really register with my system .very nice people but we need products that work and I need the dmha", "rating": 4}, {"title": "Overall buying experience", "text": "Shipping time was reasonably short, and my overall buying experience was good.  I will continue to make purchases at the Liftmode site.", "rating": 4}, {"title": "Bought the phenibut", "text": "Bought the phenibut, and was pleased with the results. Really helps with anxiety for me when taken at 750 mg to 1 gram and cheap price. Will probably buy again.", "rating": 4}, {"title": "helps me not to feel so depressed", "text": "Date of experience: July 23, 2018", "rating": 4}, {"title": "I have been ordering from liftmode for…", "text": "I have been ordering from liftmode for several years. Quality, selection and customer service is top of the line.", "rating": 4}, {"title": "Great experience", "text": "Got the order really quick first time user of this product and this company did right by me", "rating": 4}, {"title": "usually very helpful n always get…", "text": "usually very helpful n always get orders correct", "rating": 4}, {"title": "Received my order of phenibut HCL…", "text": "Received my order of phenibut HCL promptly...with free capsule samples. Took a conservative 600 mg on day one and was unsure if I \" felt\" anything. On day two, I took 1 gram and began to feel the effects...including increased focus, extra energy, and some euphoria. On day 3, took 600 mg and felt a bit sluggish with a minor headache. During these three days, I lost interest in food and even forgot one meal completely. I was thristy and drank quite a bit of water. Sleep was different...hard to go to sleep and hard to get up. Am taking a break. Likely will only take 600 mg once or twice a week...but not consecutive days.", "rating": 4}, {"title": "Pleasant moderate uplifting effects", "text": "I saw that there were not any reviews on this product yet so I thought I would leave an early review. Take this with a grain of salt, but after one experiment with this product, I am well pleased. I took a single spoonful and after about 20 minutes noticed a nice mild to moderate uplift in mood.  I feel a pleasant rush of light euphoria throughout my torso and upper arms. My head has a light fuzzy, carefree feeling. Very nice chill product.  I may change my review based on additional information, but at this moment I am satisfied with my purchase.  If further encounters with this product are this positive I will be purchasing again.", "rating": 4}, {"title": "Satisfied with my experience", "text": "I had problems when checking out my order. My Canadian credit card had problem getting processed. The live support was however able to help have my order processed.Once processed, my order arrived quickly.I really appreciate that the product comes with lab purity test results.Overall I would recommend this seller.", "rating": 4}, {"title": "I have ordered several times and really…", "text": "I have ordered several times and really appreciate the fast delivery and customer service they offer. The phenibut is top quality but after buying the energy capsules, I wouldn't do that again. I think they must have sienna in them which is a laxative and when it comes to energy, it doesn't work", "rating": 4}, {"title": "Product is as described and shipped on…", "text": "Product is as described and shipped on time.", "rating": 4}, {"title": "The website glitched and said there was…", "text": "The website glitched and said there was an \"error\" when I tried to check out, but the order somehow went through ok anyways. Otherwise great experience. I got my international order in 7 days on the cheapest shipping option, so nothing to complain about there! When I opened the box I found my product very professionally wrapped, sealed and presented. The overall impression I got was that THE EMPLOYEES CARED. Will contine to shop here.", "rating": 4}, {"title": "Good product but...", "text": "Good product but the saftey seal, if that's what that was, was not sealed at all.", "rating": 4}, {"title": "Good and Perfect except -", "text": "I've been using Liftmode for years. I am actually a Gold Member with them and have ordered many Phenibut over the years - However I do have one strange complaint - Over the years of buying this product, It used to be filled to the very very top, to where when you opened the jar you'd have to be careful not to spill any. - Now it seems over the months it's almost like someone took like 5-10 scoop fulls out, It's almost like no where near the top of it - Anyways Perfect Company from my experience over the years besides what i wrote", "rating": 4}, {"title": "Fast shipping and items arrived as expected", "text": "Fast, free shipping (with my purchase over $25) with UPS tracking included. Items came as expected with measuring spoons included. Decremented a point due to not being able to easily access my shopping cart. I had to add another item to proceed to the cart (and then removed the extra item once I arrived at the cart view.", "rating": 4}, {"title": "Almost a fiver", "text": "Mostly great service and very good quality products at fair prices. My only complaint is that I've asked to be notified when certain out of stock products become available again and that hasn't always happened.", "rating": 4}, {"title": "Your products are great and the prices…", "text": "Your products are great and the prices are more than fair.  If it were an option, I would give 4.5 stars.  The only reason I dont give 5 stars is that your shipping costs are higher than they should be for what is being shipped.  If they were closer to what you were actually being charged (I ship a lot: I know the rates), I would move my rating up to 5 stars.", "rating": 4}, {"title": "Repeat customer", "text": "Great site! Ordering is very easy. They list and describe the products exactly how they arrive. I have never had a problem with shipping, with all my orders arriving in a very expedient time.", "rating": 4}, {"title": "I would like more info on prouducts", "text": "I would like more info on prouducts, effects, duration, addiction potential, withdrawal symptoms if any, or if this doesn’t work or has legal issues, the what the researchers have discovered in their own private “labs”", "rating": 4}, {"title": "Paid for 3 day shipping", "text": "Paid for 3 day shipping, took 4 for my product to arrive. Not the first time it's happened. Otherwise, extremely satisfied with liftmode and it's product!", "rating": 4}, {"title": "Phenibut is amazing.", "text": "I’m from Saudi Arabia..Phenibut is amazing.. but we need something works more than phenibut.. make it.. you can .. contact with me by email: Dr-Abdullah5@hotmail", "rating": 4}, {"title": "Phenibut Capsules", "text": "I would love it if you guys would allow us to purchase Phenibut capsules again instead of forcing the powder on us.  The powder tastes nasty and you have to fill your own capsules if you prefer that method of ingestion.  Also it seems the answers that i get pertaining to the pending availability of the capsules, keeps changing.  The last thing I was told was that you guys were waiting on a decision about how the new labels were going to be designed?  Just use the old labels until yall figure it out, seems logical to me.  Filling your own capsules makes for inconsistent dosing.  Please bring back the capsules!", "rating": 4}, {"title": "Customer service good, most products ok, last one way into expiration.", "text": "I love your products and c ustomer service however my latest order of baicalin was already 6 months into the 2 year expiration date.   That could be a problem since I bought to make sure I didnt run out of the jar I'm still using.   I would expect to get a jar that has a ful 2 years on it.  I called and spoke to someone who said if in 1 1/2 years I still have some left to call.  What if you're out of business.   I just have a problem with this and I was told all your current baicalin was packaged 8/2017.  Not very good for a customer who may not use it all the time.", "rating": 4}, {"title": "Great product, great experience", "text": "Great experience, just a little trouble with the tracking. I would recommend liftmode - especially their Phenibut F.AA., I got the sample pack and I was very pleased so I just ordered 40 g. Quality product.", "rating": 4}, {"title": "Quick delivery to California", "text": "Quick delivery to California. Still waiting to try the product though.", "rating": 4}, {"title": "Good ok it was just good", "text": "Date of experience: January 20, 2018", "rating": 4}, {"title": "Website a bit clunky, but basically good experience.", "text": "We found nice designs, but the language used to explain directions was a bit confusing. We asked for a proof, which we saw online. It was confusing though because we only saw a way to look at the front of the invitation. We ended up clicking on the next button thinking it would take us to the next part of the invitation, but instead the button finalized it. No big deal for us, but others might be pretty upset about that. The actual designing of our wedding invitations on the site was a bit clunky too. The website was slow to react (it could have been the my internet) when you made changes. The areas to type in were tiny! All in all it experience was pretty good. Hopefully the website gets a makeover, but it worked for our purposes.", "rating": 4}, {"title": "Fast shipping and quality packaging …", "text": "Fast shipping and quality packaging with a quality product.", "rating": 4}, {"title": "My only complaint is the inconstant …", "text": "My only complaint is the inconstant density of the powder. One order will be fluffy, the other, like salt.", "rating": 4}, {"title": "Hello", "text": "Hello, I recently had a chance to try Liftmode's baicalin and i am very pleased with its effects. It is not only an effective anxiolytic powder, but I have found that in higher doses it has been an effective sleep remedy for insomnia as well.I am very pleased with Liftmodes products and will continue to be a customer for some time to come.-K.C.", "rating": 4}, {"title": "Very prompt delivery", "text": "Very prompt delivery, but large crystals seemed more like fine this time.", "rating": 4}, {"title": "Phenibut , does it work or does it not ?", "text": "Really fast delivery but obviously  very expensive one . Affordability of the product is compensated with expenses on delivery. Other than that everything is great , product works at least for me , start to feel effects already in 30 minutes after taking it on empty stomach. Had my bachelor thesis defended , nerve racking experience but with the help of product , had more of the confidence and easy approach. Wouldn’t say it makes you an Iron man , but at some level It does work , at least in the doses I take , 500mg once a day and only for the important days , not just daily . Good stuff , will recommend for those who browse the web for fast fix.", "rating": 4}, {"title": "The phenibut HCL I received it pretty …", "text": "The phenibut HCL I received is pretty on point, have had better stuff from liftmode but not bad. I really wish that they would come back with the phenibut FAA. Recently when I went to make my order all that I wanted was FAA as it's less acidic and was sad to see that it was gone and was forced into buying HCL. However liftmode is the only vendor that I will ever buy phenibut from so there is something to be said about that.", "rating": 4}, {"title": "Would have gave 5 stars but I couldn't …", "text": "Would have gave 5 stars but I couldn't find product filled  capsules on website", "rating": 4}, {"title": "Love your company", "text": "Love your company. The increase in price for certain suppliments has me down a a bit. But your still honest, quick, and dependable. Forever a customer!", "rating": 4}, {"title": "I always receive very good care to my …good", "text": "I always receive very good care to my orders", "rating": 4}, {"title": "Overall very good", "text": "Overall very good.  The only problem I've had was where I had to call them back to credit where a shipping charge was applied when it was supposed to be free shipping.  Otherwise good prices and high quality.", "rating": 4}, {"title": "Fast shipping and excellent quality …", "text": "Fast shipping and excellent quality product! Definitely going to use liftmode.com again.", "rating": 4}, {"title": "Fast delivery and product packaging", "text": "Fast delivery and product packaging.  Product is working as well. Definitely will order again.", "rating": 4}, {"title": "Customer support could be more …", "text": "Customer support could be more thoughtful and answer back! Other than product is alright. Cheap. I'm curious to try from a different vendor to compare quality though.", "rating": 4}, {"title": "It works like a charm", "text": "It works like a charm.  I am sleeping better and my overall mood has changed for the better.", "rating": 4}, {"title": "Great product", "text": "Great product, very quick delivery.. very pleased so far just wish they had more products in capsule form.", "rating": 4}, {"title": "Great service and quality", "text": "product arrived quickly and packaging was well done. Container (tub) was very well sealed with a full plastic layer on the outside. Testing results were on the order form which was convenient. measuring spoon came in separate package with measuring instructions on a small business card, which i think is a really good idea, easy to save and organize. The product itself was as expected and worked great. I don't take phenibut regularly, but have been taking it occasionally for the last two years. This being said, i have tried phenibut from a few different suppliers and Lift-mode's product is top notch. It is definitely a high quality product.I took away one star because when i opened the container, the seal under the lid was not glued to the edge, it had been pushed through and was buried in the powder. I'm sure this was just a one off and i would still recommend this product. If you haven't had phenibut before, do your research though. it is not something to take lightly. It does cause dependence and has withdraw effects. people have ended up in the hospital because of it. that is why i take small doses only on occasions.", "rating": 4}, {"title": "Open a shipping centre in canada so i …", "text": "Open a shipping centre in canada so i dont have to pay $50 for shipping and i'll give 5 stars :D", "rating": 4}, {"title": "Product was as expected but the UPS …", "text": "Product was as expected but the UPS Sure Post took forever to get to me. I would recommend paying a little extra for a more expedited delivery method.", "rating": 4}, {"title": "Hello", "text": "Hi, your customer service is outstanding I received my order in 3 days with free shipping!  I ordered phenibut and I'm not impressed with it at all, not your fault the product doesn't work for me.  I would like to order Kratom from you if I could, later this week.", "rating": 4}, {"title": "Very good product", "text": "Date of experience: August 07, 2017", "rating": 4}, {"title": "Great service and quick shipping to Canada.", "text": "The product packaging is great. The analysis certificate add an extra level of authenticity. I purchased the Phenibut F.A.A product but still am reluctant after the first few tries of the product. I will likely purchase a sample of the HCL version to see if there is any difference.", "rating": 4}, {"title": "… no butfuckery here", "text": "Easy website to navigate shipping was easy fast actually cost was very low product quality was fine medium grade. Not super high quality all around satisfied though the price was quite cheap very happy with their service definitely shop here again", "rating": 4}, {"title": "Good service", "text": "Good service, good product, good shipping time.", "rating": 4}, {"title": "Easy and fast transaction", "text": "Easy and fast transaction. I like the analysis of contamination with each order.", "rating": 4}, {"title": "Great information and open and …", "text": "Great information and open and straightforward customer service.  Pretty accurate product user directions and results to date have been solid.", "rating": 4}, {"title": "Pricy international shipping", "text": "The product itself is as expected and 5 stars!I put 4 because shipping to Canada is very pricy.  The exchange rate is already killer and the shipping just ads to it.  There are cheaper shipping vendors available that other online retailers use!Thanks", "rating": 4}, {"title": "Fast shipping", "text": "Fast shipping, quality products. Overall I am impressed.", "rating": 4}, {"title": "Great website", "text": "Great website! Easy to use, great prices. Selection is good for the products they have (amounts, free powder, capsules, etc.) but the variety in products has gone down since a few years ago. Still the number one place to get the products they sell though!", "rating": 4}, {"title": "Great product", "text": "Date of experience: June 10, 2017", "rating": 4}, {"title": "Great customer service but...", "text": "Misspelled my address on the order, and liftmode fixed it for me right when I discovered it despite it being like 2am. High quality product. Only missing a star because I really dislike the shipping options. A solid price for a decent option would be better than 10 high priced options and one terrible free one.", "rating": 4}, {"title": "Sorry would have given 5 stars but had …", "text": "Sorry would have given 5 stars but had some trouble ordering  online a couple of times but did get my orders. They have great cust svc too. The product is the best and the best prices. The best thing is the delivery time. I order all kinds of stuff on the net but this company has the fastest delivery!!", "rating": 4}, {"title": "Just as expected", "text": "Just as expected, fast shipping, and good service. Liftmode provides extensive information on each product. The reason why I give it a 4 star, is only because I have a slight headache from their products.", "rating": 4}, {"title": "quick free shipping", "text": "quick free shipping, and very good products. 10/10 would lift again.", "rating": 4}, {"title": "Good overall expiernce", "text": "There was an era with shipping twice. Customer Service took care of it. This is a trustworthy company with high quality products.", "rating": 4}, {"title": "Almost Perfect", "text": "Product was good, priced fairly to my knowledge & arrived quickly. Only negative aspect of the experience was some confusion involved in the way the shipping & payment options are set up. Seems like it would be very easy to make a mistake & choose an option you didn't need to if you weren't paying close enough attention. Besides that, no issues.", "rating": 4}, {"title": "Easy ordering", "text": "Easy ordering, quick delivery, good quality product", "rating": 4}, {"title": "Great service", "text": "Great service, quick delivery to Canada (3-4 days), product is great and well packaged. If there was an option to see the prices in $CDN so we know what we are paying with out getting the calculator out would earn 5 stars.", "rating": 4}, {"title": "Fast shipping", "text": "Fast shipping. Quality products.", "rating": 4}, {"title": "Ordered two but rec'd only one...called …", "text": "Ordered two but rec'd only one...called customer service, very helpful and courteous with quick response and 2nd jar rec'd quickly.", "rating": 4}, {"title": "received quickly", "text": "received quickly. no problem", "rating": 4}, {"title": "I had a hold due to a typo that carried …", "text": "I had a hold due to a typo that carried over from my Amazon account. Customer service handled this within an hour of notification. Their products arrived promptly, intact, and it's contents were as listed.", "rating": 4}, {"title": "Liftmode came through on time and with …", "text": "Liftmode came through on time and with a good product. My only complaint is that I couldn't order what I normally would because it wasn't in stock.", "rating": 4}, {"title": "I have always had a great experience …", "text": "I have always had a great experience with Liftmode. There products are stellar and the transaction is always smooth.", "rating": 4}, {"title": "Great company", "text": "Great company! Best prices and best shipping! Look no further!", "rating": 4}, {"title": "Great company and pure product!", "text": "I had little to no problem with this order of Phenibut.  Lifetmode is professional, experienced, and no hassle.  However, I did have problems with the delivery of the product.  UPS really messed up my order.  I would DEFINITELY order from here again!  A very satisfied customer overall.", "rating": 4}, {"title": "Phenibut Hcl", "text": "Was hesitant to try after using for a couple months now I really like it a lot wish I would have tried sooner thank you lift mode", "rating": 4}, {"title": "Great product but no stock", "text": "I love your Phenibut, but you guys are always out of stock.", "rating": 4}, {"title": "Theanine", "text": "Great product!!  I get the powder form to add to my Supergreen morning drink and the pills for my afternoon coffee.  Best quality I have seen of this product.  Fast delivery and great price.", "rating": 4}, {"title": "Boosted energy/Anxiety relief (phenibut)", "text": "Taking one scoop didn't really do it for me 2-2.5 is perfect dose for me. Do not take more than 3x a week. Not for everyday use.", "rating": 4}, {"title": "good", "text": "so far the service has been great and the product is great too.  I will shop here again", "rating": 4}, {"title": "Good quality and low prices,awesome", "text": "Defiantly worth the money I really enjoy the phenibut", "rating": 4}, {"title": "Received on time", "text": "Can't judge the contents, but its all there and in good presentation. I am trying it as a dose with three other powders so I can't give a review.", "rating": 4}, {"title": "great", "text": "Received my Phenibut quickly and it was great quality.  Only bummer is, I asked for a sample of another product and my request was ignored.  The Phenibut was still perfect and hope that soon ill be placing another order as soon as I know which one I want.", "rating": 4}, {"title": "Fast shipping", "text": "Great customer service, fast shipping as well. Bought the samples for Phrnibut HCL and FAA. I did felt a slight tingling with the Ph. HcL at 1g a day. Very odd i did not feel anything with same dose of the FAA being this one the purest form. I will keep trying to see if i need to add more to assess my tolerance and find the right dose for the desired effects.", "rating": 4}, {"title": "The Best", "text": "Of all the phenibut I've tried, liftmode is by far the purest and most potent.", "rating": 4}, {"title": "Pleased with the product", "text": "The product is quality and the shipping was swift. The only thing I didn't like was the $9.00 USPS Priority cost.", "rating": 4}, {"title": "Great product!", "text": "Best phenibut I've used. Red monkey is useless compared to this!!", "rating": 4}, {"title": "Great company", "text": "I received my order promptly. I'm not sure if the product is right for me, but I'll definitely use the company again for other items in the future!", "rating": 4}, {"title": "Great quality fast shipping", "text": "Everything arrived within 3 days and so far, all of the products have met my expectations.", "rating": 4}, {"title": "Good products, slow shipping", "text": "I love lift mode products. The only reason I'm not giving 5 stars is because their shipping seems to be getting slower and more expensive. I used to pay $6 and get my products in 2-3 days. Now I pay almost $10 and I get it in 4-5 days. Other than that, I'm very happy with lift mode.", "rating": 4}, {"title": "Prompt Response", "text": "Package and delivery very good with proper material information.Not yet tested the quality of the supplied items ordered.Hope should bealso be fine .", "rating": 4}, {"title": "It's not quite what people rave about.", "text": "I'm disappointed in how much I have to take to feel the effects. I'm a smaller, healthy, mid 30s female that is very sensitive to narcotics. I thought this would be a huge life changer. I'm still impressed that it does work but you have to take it no less than 2x ,3 is better and 2 scoops every time. I'm continuing to trial this stuff. Everyone that reviewed this stuff couldn't say enough positive. I have a friend I convinced to purchase the phenibut and her experience has been the same as mine. I'm looking forward to getting this stuff figured out.", "rating": 4}, {"title": "Great buy", "text": "Pretty good product, I take it before it before tests and presentations, definitely helps and calms, awesome sleep too.", "rating": 4}, {"title": "Smooth", "text": "Caffeine+L-Theanine recommendation from the site works wonders. The website looks sleek and user-friendly and I had no trouble tracking and receiving my order.", "rating": 4}, {"title": "Military medecines, naturopatiques & hemi-synthetics.", "text": "To deserve 5 stars in my opinion, synephrine hcl must be avaible by Liftmode.com ; synephrine deserves a 5 star active treatment. You need it with a lymphome, highest results with an artery's one,  no side effect.", "rating": 4}, {"title": "LiftMode Phenibut Pros & Cons", "text": "LiftMode.com Pros:Easy sign in & payment through Amazon.Arrives almost as quick as Amazon Prime.LiftMode PhenibutPros:As effective as Biotics Research/PheniTropic for half the price.Works exactly as Phenibut should, if Phen. is effective for you.Con:You must test dosage & frequency with all Phenibut.BE CAREFUL of quick tolerance ramp up & possible rebound anxiety from overuse or stopping cold turkey.Take your time and experiment, serious side effects do happen if you are not monitoring carefully.", "rating": 4}, {"title": "The products are very good but shipping to Europe a long time", "text": "Very good product quality. Shipping to Europe took about two weeks, it's only one problem (probably is not a problem LiftMode - only the customs office in my country).", "rating": 4}, {"title": "Better than I expected", "text": "Alright prices,  fast delivery. Not to mention great idea including correct scoops and chemical analyse. Would be a future buyer, but I wish there were more sample sizes", "rating": 4}, {"title": "Great Product", "text": "The package was delivered on time and in great condition. The product itself is of superior quality.", "rating": 4}, {"title": "Looking forward to more orders.", "text": "The product was delivered in a very timely manner. It was packaged very neatly and professionally. I was pleased with the company's reasonable prices, handy dosage and product information and the cute little measuring scoop that was added in. I also admired the fact that they included a business card, it's a nice professional touch to their packaging. It showed me they are ambitious as I am when it comes to running a quality business. Im looking forward to future business.", "rating": 4}, {"title": "Good", "text": "Every supplement has an individual purity evaluation report with it and delivery was prompt. Also nice to get an email to just click and track the order.", "rating": 4}, {"title": "Very good, would use again.", "text": "I consistently have been ordering Phenibut from LiftMode for almost a year now. They have a really easy to use website and a great selection of sizes of Phenibut. The LiftMode website is a great user interface. With the new update they have on their ordering form makes it that much easier to use.I have always had a time management problem, and they state on their website that if you order by 5pm they can guarantee your shipment will be sent out that day.WELL I have consistently ordered after 5pm and they have ALWAYS sent out my order that day. And if you email them with any concerns they literally get back to you in a matter of minutes.I would recommend liftmode to anyone! They are great!", "rating": 4}, {"title": "It works so far!", "text": "Just started taking it, but started with low dose (500mg). At about 3hours you can fill it working, just makes you fill good, not like a buzz or drunk feeling, it's like outgoing,, ready to take on the world feeling. Like Fearless! You can think clear and function fine. I think I'm going to like it.", "rating": 4}, {"title": "Quick delivery", "text": "Delivery was really quick. Ordered thursday night and got it on monday. I havent tried it yet but really exited to.", "rating": 4}, {"title": "good so far!", "text": "See title in 10 characters", "rating": 4}, {"title": "LiftMode GABA - 99+% PURE", "text": "My order was shipped the same day in which I placed it and arrived in a padded envelope within 2 business days. A scoop was included with a size card (helpful if you don't own a scale, however I highly recommend getting one, Amazon has some nice inexpensive ones!) and a 1/3rd Teaspoon Scoop (White 1.7 cc). I found it measured around 650-750mg of GABA when fully loaded. \r I wanted to try LiftMode GABA, so I went with their 5 Gram Sample from LiftMode.com. I've heard a lot of good things regarding their supplements and I wanted to try this one out from them because I haven't noticed a benefit from other brands. Unfortunately, I still seem to be a non-responder to this one, as well...however I will try it for a few more days and update my review on my findings.", "rating": 4}, {"title": "great site great produce!!!!", "text": "I wouldn't change a thing!", "rating": 4}, {"title": "Arrived in no time", "text": "You can rely on Liftmode", "rating": 4}, {"title": "Slightly higher pricing BUT free shipping.", "text": "Pure product, lower prices exist, on less reliable sites, worth the extra money", "rating": 4}, {"title": "On time delivery", "text": "My order arrived on time neatly packaged , but I can't find a clear guideline how to take the PEA .", "rating": 4}, {"title": "Effects of Liftmode..", "text": "Powerful stuff, start slow and take on an empty stomach. use the tiny scoop provided and think about the equivalent of (one gel capsule) worth at a time and work up from there. I take 2 hours B4 sleep and although it may not help to me get to sleep it definitely keeps me asleep.\rSometimes if I have taken too much I could get a minor headache too. This concerns the bulk powder so again build up slowly..", "rating": 4}, {"title": "Good but not great", "text": "It does work. However the effects are very subtle although they are quite noticeable. The first day I took it, it helped control my anxiety immensely. I had no cold sweats or clammy hand, and it helped the mental aspect of anxiety the best. I'd compare it to somewhere between kava and Ativan. I will definitely buy this product again.", "rating": 4}, {"title": "Great, if only...", "text": "All good with the products that you have. Quality, reasonable shipping.\rI could do one stop shopping if only Liftmode would add Sulbutiamine. (So now I get my stack from another vendor.[and they've got the quickest shipping I have ever experienced; ever])\r I asked about getting Sulbutiamine long ago and no dice other than \"Sorry, we don't have it\".\r So,\rothers have mentioned their desire for speedier shipping and I do remember thinking the same thing with my most recent order.\r Start carrying Sulbutiamine and maybe I will start spending my money at Liftmode once in a while.", "rating": 4}, {"title": "First time w/ LiftMode", "text": "Very impressed. User- friendly website and ordering process, reasonable prices, arrived on time, excellent packaging, thorough certification analysis. \rThis is my first time ordering LiftMode and the first time I've used the products I ordered. It's been almost a week and I am very pleased with everything. \rMy only request/suggestion would be faster shipping options like next/second day. \rI'll definitely be ordering again and hope that LiftMode is around for a long time as a trusted supplier.", "rating": 4}, {"title": "Good product info. Prompt shipping .", "text": "Dosing product info. Helpful . Never any problem with shipping.", "rating": 4}, {"title": "Great product. Logistics could use some work.", "text": "I was very pleased with the quality of the product I received from liftmode.com, and I was very fond of the information sheet that I received with one of the supplements I ordered. However, I do wish both supplements came with that information sheet, although I was able to find information on the Internet. If you place an info sheet with anything, you are now laying a precident to include it in every product, which it isn't. The shipping options were either expensive or slow or both, but the product itself is very good. Just work on the details, and it is an easy 5 stars.", "rating": 4}, {"title": "Just not working for me.", "text": "Purchased the Magnolia Bark because of the reviews.  It seemed to work well for most everyone. Of course there are always exceptions and I must be one.  Has not seemed to help with the sleeplessness.  But the product came as promised.", "rating": 4}, {"title": "Liftmode noopept", "text": "I purchased several items from Liftmode. This review is for Noopept. I purchased this because it claimed to increase mental clarity. I have MS & Fibro both disorders are characterized as causing terrible brain fog. I ask my doctor & he actually encouraged me to try it a couple time a week. \rMy 1st time trying noopept I took 7mg. My son who is 9 had the flu so I had been up most of the night with him due to his high fever & nausea. Having had hardly any sleep 6am came too quickly. I slipped out of bed to get dressed feeling aweful. Due to lack of sleep I was having a terrible case of brain fog so I thought why not try the noopept. After about 20 minutes I could feel a little surge or energy (motivation actually). I did experience more of a focus while at work. That afternoon I followed up with another small dose of 5mg. It helped me to get through the rest of my evening routine of cooking, cleaning, & taking care of my kids. That night I went to bed at 9pm & slept fine. I tried noopept again the next after having properly rested. It did workuch better. I followed my doctors advise & only took Noopept 3 times that week. I won't be taking it daily but I like having it with my other supplements just incase I  having another bout of brain fog & I need the clarity that noopept did successfully provide with.\rThanks\rHappy Girl :)", "rating": 4}, {"title": "Great service and product.", "text": "Ordered and product was here in less than a week.", "rating": 4}, {"title": "So close", "text": "There product is great quality, great price, however I was given a 2-7mg scoop which makes it difficult to make 100 mg doses accurately.", "rating": 4}, {"title": "Not bad", "text": "Just started taking the supplements but so far so good", "rating": 4}, {"title": "Liftmode products really do the trick!", "text": "When I got my Liftmode products I tried them and there was no immediate response. But the very next day I could see the changes taking place. I leaped out of bed. This is significant because I normally drag out. But after I started using the yohimbine hcl, man o man. I can't describe it in words but for the sample it is only 6 or 7 dollars. But I guarantee you it will change your life.\rI purchased the yohimbine hcl, caffeine+ L-Theanine, phenylethylamine hcl, choline bitartrate and hordenine hcl. All products are working well. And I especially like the yohimbine hcl. I gives you a boost like nothing that I have ever taken. No more need for energy drinks, I have found something three times better!", "rating": 4}, {"title": "☆☆☆☆☆ A Five Star Online Company ☆☆☆☆☆", "text": "I've just started ordering from Lift Mode and am thoroughly pleased: fast, efficient, and professional service with top of the line products that don't skimp on quality!", "rating": 4}, {"title": "works for me", "text": "My grandson recommended noopept and liftmode because it worked to help him a lot.  Delivered on time and correctly I am pleased.  Better instructions on how to take it would help a lot and stopped me from giving 5 stars.", "rating": 4}, {"title": "Good customer service", "text": "I ordered an item and was sent the wrong thing.  I didn't notice until several months later because the Orange packaging was the same.  They replaced the item when it was back in stock.", "rating": 4}, {"title": "PUre but not dope", "text": "Helped me get by hards times", "rating": 4}, {"title": "All good except", "text": "Shipping was behind one day. Paid for 3-6dsy deliver . Got it in 7 days oh well", "rating": 4}, {"title": "PRODUCTS FOR TESTING AND....", "text": "It would be good to leave a quarter inch at top of containers. Would make it easier", "rating": 4}, {"title": "These supplements are very effective", "text": "I find Liftmode to be an excellent source for concentrated supplements of the mood- enhancing and anti-anxiety variety. It is the best place for someone to go... if they know what they want. But a customer should know, for instance, that if they take, say, six spoonfuls of Phenibut every day for two weeks and then stop, they very well might experience a mini psychotic episode. This could easily confuse a person into thinking they've gone crazy. So, I think some sort of very clear acknowledgement by Liftmode, of the many effects of these supplements will go a long way toward the integrity and service of the company. A little hand-holding, sensitively written, will help a user understand the complexities of some supplements, and that the products will not hurt them. That said, I believe the supplememnts benefit and can, ljterally, safe lives. \rThank you.", "rating": 4}, {"title": "Phenibut", "text": "So far so good. Only been using this brand for a few says but I like how it works. Hasnt a different feel then the other brands I have tried. Good brand. 4 stars", "rating": 4}, {"title": "The Jury is Out", "text": "The customer service was excellent and I received my order very quickly. The first two days of taking L Theanine --i got excellent sleep..The second day I took a dose in the AM and one at bedtime however, I found that this dose caused me some significant depression.  SO I went back to the one dose at sleep.  I did have some olfactory hallucinations for several days but those seem to have resolved. ...whether or not that was from the L-T I do not know.   My sleep last night ( I think the 4th or 5th day of taking L-T) was not as good...I only got 5 hours and I need much more than that. \r I will continue to take it and see what happens.", "rating": 4}, {"title": "Fantastic quality and very fast delivery", "text": "I ordered several sample sized items. All are very nice quality, high purity, clean feel and test. I am very pleased. I will be ordering again and have already recommended LiftMode to several friends, some family, and co-workers.\rAs with many non-FDA approved supplements there is a great amount of benefits. However, I've been burned and hurt physically by other distibuters in the past. Mislabeled stuff or poor quality control/low purity. \rLike I said, I recommend LM and would again. I look forward to my next order. I live in the broader Minneapolis, MN area and recieved my order in under 4 days. Order was picked, packed, and shipped within 12 hours. En route via UPS within 24 hours.", "rating": 4}, {"title": "This stuff really works (:", "text": "As an introverted person this stuff makes me feel great I feel more social not as anxious when I'm out in public, It makes me calm,  relaxed, not stressful, takes away any headaches or migraines that I'm having, a sense of well being like everything is fine", "rating": 4}, {"title": "Good product", "text": "Only drawback I had was the powder was a little clumpy so it made it a little harder to get dosing correct. But product is good.", "rating": 4}, {"title": "doesn't work like I thought it would", "text": "I took the correct does one morning and felt nothing all day. the only thing I might have felt was a placebo effect which was not anything at all. I read online that I could just be a bad batch but I'm not sure", "rating": 4}, {"title": "Phenibut", "text": "Boosted my mood considerably and gave me a \"go-get it\" attitude.  However, don't take too more than 2 grams for 4 consecutive days.  There are some nasty hangover effects.", "rating": 4}, {"title": "Can't believe how cheap this stuff is", "text": "In regards to Lift Mode only, this is really quality stuff. In regards to Phenibut, it is incredibly effective for the price.", "rating": 4}, {"title": "Good customer service and quick shipping.", "text": "So far the most reliable company to buy supplements also marketed and packaged very professionally", "rating": 4}, {"title": "Good products but pricey", "text": "The products I bought seem very pure & work according to the description pretty much.  I'm sure everyone might have a slightly different experience as everyone's body responds differently.  Overall, I am happy with the products.", "rating": 4}, {"title": "Good but took a while to get", "text": "I have only tried it twice and it works like it's suppose to. I like the packaging and little scoop it came with. It took a while to be shipped or to get here would be my only complaint", "rating": 4}, {"title": "Great product; fast service", "text": "The product I ordered is of the highest quality and if I order the 2 day shipping it usually gets here within 3 days.", "rating": 4}, {"title": "Inexpensive, fast, and (as far as I know) good quality", "text": "Can't fault the price or the shipping speed, and it seems to be exactly what I ordered -- I'm enitrely happy!", "rating": 4}, {"title": "Not Working Yet", "text": "So far no effects, noticed just a little nauseous when first taken. Following the instructions but have not experienced the energy or mood changes like I read in others reviews. Will give it another week or so to see if I see the changes I was hoping for.", "rating": 4}, {"title": "Trustworthy and efficient", "text": "Using my phone, the directions were easy to follow.  Delivery of product was fast.\rAnalysis was complete.  Like idea of small jars with lids rather that loose powder in plastic.\rPerhaps more description of products, if it is fat or water soluable...", "rating": 4}, {"title": "would give 3.5 if that was a viable option", "text": "I tried phenibut my first time by buying the same pack. I dosed 500 mg my first time and a little under a full gram my second\ri expected to much from this substance and effecrs but I did notice a kind of \"background\" effect, which I enjoyed very much.\r You shouldnt expect any pronpunced, mild altering effects. The I was very social and much happier when I took it. It has immense benefits for those with social anxiety or discomfort.\r I do recommend this product very much(dont use often) as it has very great subtle effects that can help you, even though it may be hard to notice.\rIve only used it twice so far, and will be experimenting various dosages to find my sweet spot.\r Give it a try1", "rating": 4}, {"title": "The naked truth", "text": "Very consistent with quality. Top notch company.", "rating": 4}, {"title": "Anxiety Vanished!", "text": "I suffer from awful anxiety spells and attacks.  Phenibut has almost completely taken my anxiety away while I'm on it. The only problem I have with it is that it take four hours to start working.", "rating": 4}, {"title": "Lift mode delivers quality product in no time.", "text": "Ordered a few things from Liftmode, their selection is nice and what they stock is almost always of superb quality. They also ship within a day and the package rarely takes longer than 3, even with regular priority mail. Shop with confidence!", "rating": 4}, {"title": "Prompt customer service and resolution of problem", "text": "There was a delivery delay.  Seller promptly addressed the issue and I'm happy to report that product has been received.  Would recommend.", "rating": 4}, {"title": "Awesome service.", "text": "Delivery was FAST. Only tried a very small dose so far (Est 250mg) to test tolerance so can't really review the product yet but this is my second order with liftmode and they don't disappoint.", "rating": 4}, {"title": "Amazing service, decent product.", "text": "okay soo I recently ordered phenylpiracetam 5 grams from lift mode, I ordered next day shipping and it was here right in the morning whitch I was very happy about the packaging was neat and orderly and came with very easy instructions.\rThe product, was clean and worked as promised but I just expected more from other reviews, it kept me awake and didn't make me jittery I didn't need caffeine to stay awake throughout the days I used it, I don't have a scale soo I just experimented with different size scoops and found a perfect dose, I am prescribed adderall IR and I found it makes the comedown from it not soo harsh it worked good for a few things but it didn't enhance my focus to much mostly just kept me awake.\rI would reccomend it to others and would use t again but I personally because of the price would not order it again myself but great website, I just ordered phenibut with next day delivery I have high hopes to try it.", "rating": 4}, {"title": "Loved the product. Took a while to ship though.", "text": "I ordered the Phenibut HCL 40 grams just to try it out, the product worked great but it took a while for them to get it to me.", "rating": 4}, {"title": "Never recieved package. Edit: Very good service", "text": "I'm a patient guy but it has been over a month. Package has never arrived.\r Edit: Liftmode's customer service and reply is timely and efficient. A well polished company.", "rating": 4}, {"title": "Phenibut seems to work", "text": "I've tried a lot of different herbal treatments and amino acids for anxiety and insomnia.  Phenibut does seem to work.   For me, it works better as a sleep aid.  I often wake up in the early morning hours-- 2:00, 4:00, etc..  What works best is taking 500 mg of the Phenibut in the late afternoon and then another 250mg right before bed.  While I don't sleep completely through the night, it's definitely a more restful sleep with only one wake up.  I wish I could take it every night, but understand the tolerance issues.  LiftMode delivery is super fast, and I will buy again.", "rating": 4}, {"title": "Swift shipment, excellent quality and convenient pacakging", "text": "The only possible downside is the price. other than that, highly recommended!", "rating": 4}, {"title": "Phenibut", "text": "I did one scoopful (~500mg) by placing it on my tongue and washing it down with water.  It made my tongue burn and by the next morning my tongue had several small sores on it and  my mouth had been extremely dry during the night.  It did nothing for me in terms of helping me to sleep or relax.  I am very disappointed. The customer service was great and the shipping was very fast. They immediately issued a refund. Some people just have different reactions to substances.", "rating": 4}, {"title": "Straight forward easy to use", "text": "I have only ordered one product so far but it was easy to do.  Checkout was simple and I received several email notifications.  Only downside was all the shipping options were expensive.  I was not trying to get my product in a huge hurry but all the options were for 2 or 3 day shipping.  I ended up paying $10 shipping for a very small $12 product.", "rating": 4}, {"title": "good product", "text": "im a lot more focus", "rating": 4}]