[{"title": "Quality is very good", "text": "Quality is very goodDelay in shipping Needed multiple follow ups", "rating": 3}, {"title": "The quality could have been a little…", "text": "The quality could have been a little better on my embroidered logo, but decent job overall. They did a better job on my previous orders. ", "rating": 3}, {"title": "Superb Customer Support, Disappointing Product Embroidery Quality", "text": "The thing that I like best is the customer service department.  Bobbie W. was very prompt in responding to my E-mail requests for assistance.  She has excellent E-mail communication skills, and is very personable, friendly, courteous, knowledgeable, and capable, and patient.  She took the time to read and understand all of my E-mail message, and exhibits a sincere desire to fulfill my requests.  If this were a review of customer service, I would gladly rate five stars.  The same for the quality of the men’s long-sleeve tee shirt which is the basis for my order.The quality of the embroidery is very disappointing.  Queensboro is not capable of providing all of the colors of the official logotype which I provided.  The embroidering equipment does not seem to reproduce the text of the logotype (letter J looks like the letter I) or to be able to follow the fine detail of the artwork of the logotype.I find the search capability of the Queensboro web site to be virtually useless.  I proposed to try the same logotype with screen printing instead of embroidery, but the only options (which Bobbie W. was able to find for me) required larger minimum quantities than I needed. Bobbie W. graciously refunded my money.  So, in the end, and sadly, I am not a customer.", "rating": 3}, {"title": "It took three tries to get it right", "text": "It took three tries to get it right. I’m finally pleased wit your efforts. The first shipment was too small, your LARGE is everyone else’s MEDIUM. The replacement was done with an incorrect color thread, finally the third shipment was correct, but it took eights weeks from my original order date.", "rating": 3}, {"title": "Queesboro never fails to achieve…", "text": "Queesboro never fails to achieve their company mission! The tee shirts exceeded my expectations!! Great products produced on quality clothing. Absolutely the best for all the years I have been privileged to buy their products.", "rating": 3}, {"title": "Shirt(s) did not arrive in time for my…", "text": "Shirt(s) did not arrive in time for my conference.Also, order was placed and it was quite a few days later to receive notification of out of stock item. The shirt I did receive last night was very nice, however, my 3 day conference ended last night.If I had known about the out of stock item (should not have been able to order it initially) and the late delay of the shipping, I would have placed my order with another vendor. As it is, I was a speaker and on a panel, and had no way to represent myself other than my name tag and business card.Again, the shirt looks nice, but no one gets to see it but me.", "rating": 3}, {"title": "Tech support issues", "text": "The product line is excellent but I'm having some issues reaching tech support. This seems to be the norm with a lot of companies these days.", "rating": 3}, {"title": "The logo processing should be easier or smoother.", "text": "The process to get my logos to the size I wanted was a bit difficult and discouraging! This should be easier for your clients. It would help if you were more flexible on the logo dimensions and your communication lines should be smoother. Keep in mind, your clients have a picture of what they want in their heads. They are trying to get this image on their items!", "rating": 3}, {"title": "custom embroidered t shirts are ethnic…", "text": "custom embroidered t shirts are ethnic and mix of modern which gives a classy chic look", "rating": 3}, {"title": "I ordered custom t-shirts for my…", "text": "I ordered custom t-shirts for my company from Queensboro, and while the quality of the shirts was good and the customization process was easy, I was disappointed with the customer service. There were some issues with my order that I needed to address, but it was difficult to get in touch with a representative and it took longer than expected to resolve the issues.", "rating": 3}, {"title": "I like the prices, my size not available", "text": "I like the prices, and would have placed an order, but I need some 4xl and 5xl shirts, and the largest size offered is 3xl", "rating": 3}, {"title": "It took longer than normal I thought to…", "text": "It took longer than normal I thought to fill my order.  I have order many times for my work.  This time it seems like it took a long time to fill my order.", "rating": 3}, {"title": "Not as good as usual", "text": "The items were late because of a production problem; then I never got a notification of shipment; or a reason why it was late until I contacted customer service.", "rating": 3}, {"title": "Super slow but I absolutely love the…", "text": "Super slow but I absolutely love the quality", "rating": 3}, {"title": "I am satisfied with the service", "text": "I am satisfied with the service, the ratio of price and quality is satisfactory", "rating": 3}, {"title": "Just work harder and your company will…", "text": "Just work harder and your company will be great and keep up with the good work", "rating": 3}, {"title": "Custer service is outstanding", "text": "Custer service is outstanding. My first order was spelled wrong and the proof was right. Got full replacement and very happy now. The 30day turn around time is too long. Took 2 months two orders to get it right. We need to work on that.", "rating": 3}, {"title": "I placed an order and part of the order…", "text": "I placed an order and part of the order was embroidery and the other part was screen printing.  The embroidered part arrived and was very nice, but my t-shirt order which is screen printing is still yet to be completed even though I had an expected shipping date of may 17, 2022.", "rating": 3}, {"title": "I called multiple times about my order…", "text": "I called multiple times about my order since it took a very long time to ship. This might be the deterrent for me to continue ordering from your company. When I reached out to find out the status, the way I was approach wasn't the best. For example, don't just tell me the delivery timeline is an approximately and they will be shipped when they are done. Even when this is true at least use different tach to deliver. Products are great and prices are fair but the delivery of orders needs to improve.", "rating": 3}, {"title": "The color is very nice", "text": "The color is very nice. The shape is for those who want to keep their breasts sagging, a kind of training the chest support.  The seams part, the threads stick out, one breast is sharp and the other rounded, I mean at the nipples of tailoring. It prickles on the back. Cotton is very thin and only in the breast area and then not completely.  I thought that for such a price manufacturers will give more cotton in the chest, and a softer synthetic fabric, and molds and threads also on the quality. So much for import substitution. The price would have been two times lower. You can not sell these things, it's dangerous for women and their health breasts.", "rating": 3}, {"title": "The shipping process was a little confusing", "text": "The shipping process was a little confusing, first it said it shipped on 2.4.22 and a week later it says it is received at Wilmington, NC. Then another notice says it is being shipped on 2.08.22, then again on 2.12.22. It finally arrived at my house on 2.16.22. it was a little confusing, merchandise was great though.", "rating": 3}, {"title": "I do have an issue with communication", "text": "I do have an issue with communication.  I do understand that most companies only communicate by email, but what do you do when no one responds to email.  I have been told 2 times that someone will call me concerning opening a store.  Almost a week later, no one has called.  It would be nice to speak to someone if you don't like to email.  I'm not suggesting that you should change the way you do business, but it would be nice to speak to someone when you need to.Thanks!Emon Thompson", "rating": 3}, {"title": "Good shirt quality", "text": "Good shirt quality. Same with embroidery. Only true downfall is the information detail and slow process of shipping. Estimated date of shipping is just a falsehood. Yes, understood supply issues to a point. Now would I purchase again, a second chance absolutely", "rating": 3}, {"title": "Overall Experience Notes - Explanations and communication", "text": "There were changes made to the designs which extended the order and created a delay. Had the changes and reasoning been explained fully then adjustments would have been easier. Or had there been an explanation of logo size vs placement. Additionally conversations with multiple people and each had different results but not necessarily the right one.Explanations and communication would be my feedback", "rating": 3}, {"title": "Love the products and loved the…", "text": "Love the products and loved the quality.  I even loved the customer service! Just took entirely too long to get the initial order and when it was wrong took even longer to get them replaced.  June 7th order delivered July 29 as I had originally ordered. Hoping just a random occurrence and not the standard. I have discussed with other Queensboro customers and they have never had an issue.  Let's see how order two goes!", "rating": 3}, {"title": "Missed my deadline after being told it would be met", "text": "I was really disappointed that an order for 8 hats took more than a month to turn around. When I first placed the order I made them aware of my very reasonable 3 week deadline, and I was guaranteed that the date would be met.  The order was received a week after my deadline. The quality of the work was good, but the schedule was not.", "rating": 3}, {"title": "The products I ordered was fine. see above.", "text": "The products I ordered was fine, but also needed some T- shirts. I was told I should just keep checking  as to when you may have the the shirts. Customer service would have said we will make a note and call you when we have them.", "rating": 3}, {"title": "Hit or miss", "text": "We ordered some lunch bags and they came with ink stains on most of them and some didn't have our logo on it at all. The shirts came out great. The koozies also turned out great. We still haven't received the pens and it's going on a month since they were ordered. We have ordered more shirts since we didn't have any issues with the quality or the embroidering. Quality control seems to be hit or miss on some of the products.", "rating": 3}, {"title": "I have not approved an order twice…", "text": "I have not approved an order twice which is just added more and more days on to waiting for it to come in which does not make me happy. Way too long to get product from you. And since now I see that we’re getting charged for shipping will be the last order you see for me. I get free shipping on anything I buy anywhere ever", "rating": 3}, {"title": "I really like the way that Queensboro…", "text": "I really like the way that Queensboro kept sending me emails about the status of my order however your email stated that my order would be shipping on 23 May.  That didn't happen.  I sent emails to your address and I was told that production had been halted at the Dallas location.  After a week of waiting it seemed that my order got processed.  Not certain why you sent me an email that my order would ship on the 23rd and that wasn't true.  I am pleased with your product however.Dear Michael,We are writing today to let you know your order 1966203 has been scheduled for production.Please note that no additions can be made to this order now that it is scheduled.Your estimated ship date is 5/23/2022.", "rating": 3}, {"title": "One Outta Two Ain't Bad, I guess", "text": "We have ordered twice from Queensboro now. The first order was a NIGHTMARE! Things kept changing - I'd correct one thing and when they resent the order, something else (that had been correct the first time and wasn't supposed to change) had changed. This went on for weeks!  I finally approved the order, but when it arrived the screen printed text and logo was in the wrong color. 1-starThe second order (because we had been assured the first was an anomaly) was PERFECT.  Good quality shirts, and great embroidery. 5-starsThat puts the overall rating at 3-stars.", "rating": 3}, {"title": "Am a Long time loyal customer If…Best in its class, slow in delivery!", "text": "Am a Long time loyal customer If Queensboro. The quality is best in its class. My concern is with my recent purchase which l ordered mid December and received the order mid January 2020. In the meantime l was charged for the order in mid December. I had a hard time explaining to my board the expense in December without receipt of the goods. They are seriously pushing me in another direction. Thank you for listening!", "rating": 3}, {"title": "Very happy with final product...eventually", "text": "They truly do honor their promise of making the order right and not having to send back the wrong merchandise. My order was wrong they fixed it no problem no questions asked. But it was pretty boneheaded way they got it wrong in the first place. But eventually I was given a product I was completely satisfied with both the quality and the embroidery of the logo.  I can recommend them as long as you’re not in a hurry to get your merchandise", "rating": 3}, {"title": "Takes too long", "text": "I like the quality of the shirts and the embroidery is first rate. But the time from order to delivery takes WAY too long. It's 2020. For a customer designed shirt, there is no way it should take over a month. This is my second order and the first was just as painfully long. And during the process we are in a virtual communications blackout.", "rating": 3}, {"title": "Items were produced correctly, but late", "text": "Items were produced correctly, but delayed. The date I was given for shipping was farther out than I expected based on previous purchases and then that date passed without shipping of my items. I never received notice that there was a reason for the delay or even that there was a delay. Product finally shipped 5 days later than the promised date.", "rating": 3}, {"title": "orders are pretty quick when you first…", "text": "orders are pretty quick when you first order then seems to get slower each order after that. this last order part of the order was shipped, then another shirt was shipped a week or so later...I wouldn't have known if I hadn't questioned the missing shirt", "rating": 3}, {"title": "The only problem is you have to wade…", "text": "The only problem is you have to wade through the deluge of discounts for a good discount code comes along to make it affordable. Secondly, I have placed 2 orders but I have to wait to place my 3rd order for a larger order because small quantities are cost prohibitive.On the positive, the Port Authority Embroidered Men's Silk Touch Pique Polo were quite nice.", "rating": 3}, {"title": "The chain broke along the line", "text": "Until this order my experience with Queensboro was flawless but somehow my order was put on hold for a month awaiting 2 baseball caps. Don't get me wrong they made it right but it's just odd that this company that in the past has been all about communications failed to communicate.All of that said, I will continue to be a loyal customer but next time I will be more vigilant.", "rating": 3}, {"title": "Great products-service-pricing - bad shipping", "text": "The process to order, the great discounts and the products are all 5 stars. The only, yet epic issue was that we had changed multiple times our address. So..... when I began to track our shipment, it was showing, yet again, it was being shipped to the WRONG address. Our old address which we changed over the phone. Twice. This caused a day + delay. Thanks.", "rating": 3}, {"title": "Unhappy customer", "text": "I usually always love ordering from queensboro but I do not like the new customer specials that long time customers don’t get , do not believe that is fair at all. I can understand why your company does it, to draw in more customers, but in my opinion it’s still not right for your long time customers to pay more.", "rating": 3}, {"title": "I’m sure you had a backorder on items …", "text": "I’m sure you had a backorder on items from end of the year purchases. The second order I placed for Travel Alliance Partners that I needed for my trip tomorrow won’t arrive in time for me to use for this trade show. That’s the only thing I have an issue with - the length of time it took to get things. The product is great, but the timing was off.", "rating": 3}, {"title": "Carefully CHECK THE CUT!", "text": "Recently you REALLY have to pay attention to the garment CUT. It seems that an XL is no longer an XL from a year ago. They are now selling sizes with distinct tapers that affect the fit in the body as well as the cut of the arms. So If you are like me, you need an XL fro your shoulders and chest, it is likely your arms and waist will NOT fit anymore. I had to have my recent order remade and the replacements are NOT what I originally wanted. I should have simply returned everything.", "rating": 3}, {"title": "The first order the fabric was not good…", "text": "The first order the fabric was not good and you could see through the shirt. We then reordered, great support but the timing got behind and we had to rush the job. In the end the second order came through great and on time. We really thank your company for helping us in our first experience. We will come back and suggest others.", "rating": 3}, {"title": "Too slow in delivery of product", "text": "Too slow in delivery of product.  this needs to speed up.   Thanks for the reasoning for the delay, but it still doesn't excuse the fact that I needed these products before my conference deadline last week, which we missed and therefore the order was essentially null-n-void.  I see lots of excuses and understanding, but I didn't see you willing to offer a significant discount to my company for the next order I place.  Should there be a next order?thank you.", "rating": 3}, {"title": "Art Department", "text": "Art Department first sent proof for my approval, but they actually send an old design, not the one I uploaded. I had included simple instructions on color with the upload and it still took a couple iterations and still was not exactly what I wanted but decided to live with it and had them ship. Your art department seems very unorganized.", "rating": 3}, {"title": "We summited the order on June 20", "text": "We summited the order on June 20. The order was held up due to two items.  I sent an email inquiring about the statist but no response.  Followed up with a phone call inquiring to the whereabouts of the order.  I was told it was incomplete and awaiting the two missing items.  I then gave the girl permission to forward the order as it was and send the missing items later.I would have appreciated an email explaining the reason why  this order was being held up.", "rating": 3}, {"title": "Mistakes happen", "text": "The order was really a mess when I received the merchandise, which really should not have been as I have ordered the same items from them before.  I will say they did rectify the mistake very promptly and please do not take let the 3 star keep you from purchasing. They have the best embroidery that I have seen.", "rating": 3}, {"title": "Was supposed to arrive on Friday...", "text": "Was supposed to arrive on Friday.... came today at 11:30. Fed Ex shows reason for delay was requested re-scheduled delivery. It was not requested by my office so not sure what happened. Wanted hats for the holiday weekend. We did without them! They arrived here this morning and are exactly what we ordered. LOVE THEM!", "rating": 3}, {"title": "Good not great", "text": "The shirts a very nice. They are going to shrink a little in the wash which I found to be a good thing because the sizes are larger then normal sizes. The logo that was embroidered wasn't the best quality. But all said and done, for the price, until I am able to afford a higher quality distributor I would use Queensboro again in a heart beat.", "rating": 3}, {"title": "Grab Bag--Sometimes You get what you pay for!", "text": "I was not really   impressed with my latest purchase from Queensboro and will never venture into a grab bag offer again. I expected several different \"dark\" colors and not the exact same colors. I thought Dark meant a blue and a black, etc.\r I did pay a small amount, about $10 each if you count S&H, but I will be more careful in the future. On the positive side, I do appreciate the Logo being sewn on all four.", "rating": 3}, {"title": "There were issues the first go round.", "text": "I was happy with the quality of the items I ordered.  What I was unhappy with was the embroidery that was done.  My logo was incorrect, there were a lot of \"picks & nicks\" with the embroidery.  I called customer service the day after receiving the order.  I was asked to email pictures of the issues.  Once that was done, my entire order was replaced.  The embroidery was much better, not perfect, the second time around.", "rating": 3}, {"title": "Great service and quality product, not happy with new pricing policy.", "text": "As a long time customer, I know the value of Queensboro product and service.   They have recently added set up fees the show up when placing your order that make smaller orders too costly.   I was recently about to order a half dozen hats based on an email offer.   There was a $25 embroidery set up fee that almost doubled the cost of the order.  I understand they may want to discourage smaller orders, but they should be more up front about it.", "rating": 3}, {"title": "First time using Queensboro...", "text": "I was looking for an embroidered polo supplier for my real estate company. I found Queensboro online and decided to give them a try. The polo I recieved was perfect! It was exactly what I was looking for! The only reason for the lower rating is because Queensboro is way too slow! It shouldn't take a full month to embroider and ship 1 shirt. I can't afford to wait a full month for my team's shirts. It's killing me! I found a local supplier that embroiders the exact same Ogio shirt and completes orders in 1.5 weeks.", "rating": 3}, {"title": "Your web-site is a little hard to …", "text": "Your web-site is a little hard to navigate trying to find certain items. Then when you start building items on sale in the cart, some do not apply, added amounts are applied due to \"less than\" quantities.The more simple you make things, the more people will come back. Long time customer, David A.", "rating": 3}, {"title": "Gave 3 but Could Be a 5 if...", "text": "Actually the only reason I'm giving 3 stars instead of 5 was because of how long it took. It seems excessive to me, which is a shame because the product is beautiful. The embroidery is perfect, the shirt material is outstanding, the colors were right on. I really want to order more but I'm looking for another company that can possibly do it quicker. Hear me though and hear me loud and clear, the ONLY reason for the 3 star instead of 5 is the time it took from order to delivery, all else including customer service was outstanding.", "rating": 3}, {"title": "Takes too long", "text": "It takes too long to get finished T-shirts.  Great product..great people...  been doing business with them for years.   In the age  of Amazon same day delivery 30 days is too long to wait for T-shirts.   They hit my credit card immediately yet I have to wait 30 days for the product???", "rating": 3}, {"title": "Good deals- when you check on the right day.", "text": "I really like QB, the quality and the service is excellent.\rI just wish I could use you guys more than the other vendors my company uses The only thing that stops us is the fluctuating prices. If there were set prices at the discounted rate that I can get items at when they are on special promotion I would be able to advertise to all my clients all the time and know the exact price and markup. If this were the case I would have 50 times as many orders through you guys as I currently do.", "rating": 3}, {"title": "Love the low qty requirements, but...", "text": "I appreciate the fact I can order just four items to avoid the embroidery upcharge, however the sizing in many of the ladies' items seems off.  Items labeled classic fit in particular require you to go up at least one size.  The lack of plus size offerings is also a problem in terms of women's styles.", "rating": 3}, {"title": "Quality at limited qualities.", "text": "The only thing lacking with Queensboro is communication.  I placed an order.  Was sent a partial shipment but never contacted about the remainder of the order.  I finally contacted them, and the item was permanently out of stock.  I was sent a product that truly didn't carry the same image  as the other items.", "rating": 3}, {"title": "Fulfillment was very slow 6 weeks", "text": "Fulfillment was very slow 6 weeks.  First part of my order came first and had quality issues with the embroidery.  Contact Queensboro about the deficiency and was quickly handled by customer service (5 stars).  They credited my account for the my troubles.   2 of 3 of my order arrived a few says later and the quality of the embroidery was great.  Overall, customer service is a 5 stars,  fulfillment time 2.5 stars (very slow), quality is 50%  so far, waiting for the last order to make my final  decison on overall quality of work.", "rating": 3}, {"title": "I did not have a good experience at first But I confess that in the end, we were very happy.", "text": "I did not have a good experience at first because we had a lack of communication, I think they should change the process of authorization to start the Order.You sent me my order without the Logos and that delayed the whole process and received my new Order with the Logos delayed, you made all your effort, send it to the hotel where we had the conference, but that and everything arrived with a late Day.But I confess that in the end, we were very happy with the completion of the work, we hope that for the next, everything will be easier.", "rating": 3}, {"title": "I wish I could give zero stars", "text": "I wish I could give zero stars. I put my trust in them for my first business venture. 2 days after the estimated ship date they still cannot tell me where my order is. Avoid this company like the plague!UPDATE: Erik in customer service has put a ton of effort into correcting this situation. I have a deep respect for the way he has handled this whole situation so I am upgrading my review to 3 stars. I will buy from them again just because of his personal attention to the matter. The product I have received so far has been really good quality so I don't want to completely judge Queensboro on one bad experience.", "rating": 3}, {"title": "I gave 3 stars only because of the length of time it took to receive my order.", "text": "I gave 3 stars only because of the length of time it actually took to receive my order. I love purchasing items for my business however I hat that it takes soooo long to receive them and my last order took even longer.", "rating": 3}, {"title": "It took longer to get this order than I …", "text": "It took longer to get this order than I was expecting . . . and while I don't have a problem with the quality, I am not happy with the sizing . . . the mediums are HUGE and the large are GIGANTIC.  I don't have that many extremely fat people I can give these to.  There does not seem to be a consistent way to get the correct sizes for what I want.  This is not a new issue--I have had the same problem in the past . . . hats, scarfs, towels, etc are fine because there is no sizing issue--but clothing--your bread and butter-- I never get what I expect.", "rating": 3}, {"title": "Great order, mild difficulties", "text": "Prices seemed a little high, but still reasonable. The team did well sorting out an issue with my printable graphic. The most \"friction\" came from when the design team reach out about a complication in the print request. They made a recommendation and asked for input. Despite giving the team direction, these instructions never made it to the print team, and the entire order was misprinted. The order was comp'ed and replaced, however  missed the initial rollout date for the item. Despite the mild inconvenience I will gladly continue using this company.", "rating": 3}, {"title": "The product and quality is AMAZING!!!", "text": "The product and quality is AMAZING!!!My only issue is the turnaround time after you place an order. It took 1 whole month to receive my order 😔I would love to order from Queensboro again, but I don't believe that I will for that reason.", "rating": 3}, {"title": "poor listeners", "text": "We don't feel the persons on the phone listen to what we wanted.This remake order should have never happened.We are very happy you made the order correct, however the order was for a specific conference and it was not correct at the conference time.", "rating": 3}, {"title": "Close but no cigar", "text": "Great products, yet production and delivery challenges make it difficult to depend on your service. Repeatedly orders were lost, deliveries delayed and orders were even duplicated. Correct these and you may realize a profit.", "rating": 3}, {"title": "It took forever to get this to me…", "text": "It took forever to get this to me because you had to redo it but happy with the product.  If you mess up on an order, that order should be your top priority not your least priority.  Thanks", "rating": 3}, {"title": "I love your customer service", "text": "I love your customer service. We had to modify on the look of our logo to adjust to your needs vs you adjusting to our needs. On our background to even the second logo it was not white. I wonder how that could be fixed?", "rating": 3}, {"title": "Too long to get my products", "text": "Too long to get my products.  I needed them for a promotional event and all my products got delivered after the event.  I need to get these sooner w/o having to pay next day shipping...can you get products delivered at least 14 days...thank you.", "rating": 3}, {"title": "My shirts on the second order were very well done.", "text": "This was my very first bad experience with Queensboro. The art department needs some attention...very badly. The best news is you guys made it right and made sure that I was happy! That is why I will continue to purchase your products. THANK YOU!", "rating": 3}, {"title": "It take a while to come up with what I…", "text": "It take a while to come up with what I wanted in this order. I also wanted something with the USS Saratoga ribbons printed on it, we had 13 ribbons.With many repeat stars on them. I am still looking for something to put them on.", "rating": 3}, {"title": "I haven't started yet but they'll be…", "text": "I haven't started yet but they'll be great", "rating": 3}, {"title": "Things happened but finally received a good product", "text": "It has been an experience. I waited for what felt like 3 weeks and received sweaters with my logo that looked nothing like my logo. No one called or emailed that they picked 3 colors out of my 6 to use. I called and the representative was VERY helpful. I appreciate her going above and beyond. I reordered and my package was delayed from the original ship date of 11/11... I needed them for an event November 19th. I was told I would have them the 18th right on time. Yeah well they weren’t. Sweatshirts came out perfect this time though! I would recommend to make sure production is on their game and quicker shipping. I would give them another try because no company is perfect and the second products I received were perfect.", "rating": 3}, {"title": "we good searvice", "text": "we good searvice", "rating": 3}, {"title": "Brought 4 shirts", "text": "Brought 4 shirtsfeel I got fleeced on shippingthen fleeced again on shipping when arrivedmaterial was okayshipping extortion200 bucks for 4 shirtsembroidary okaypeople nice. way too much for too little.", "rating": 3}, {"title": "I would give 5 stars as the product is…", "text": "I would give 5 stars as the product is fabulous, however having to wait a month to receive my order is too much. If I got it in two weeks I would be the happiest with the service.", "rating": 3}, {"title": "Great prices, fast service, inconsistent quality, bad website", "text": "If you read the descriptions of shirts on the website you will find long sleeve shirts listed without sleeve lengths, short sleeve shirts listed WITH sleeve lengths and various other inaccurate information.  \r When you call for assistance, it often takes escalation to several people before you get someone to acknowledge what you're talking about and to provide you with the basic information you need to make a buying decision.\r Also, there is great inconsistency between products when it comes to sizing.  Granted, they provide products from several manufacturers, so it is understandable.  However, that merely underscores why ACCURATE and COMPREHENSIVE sizing information needs to be on the website.", "rating": 3}, {"title": "Need to update customer service and go…", "text": "Need to update customer service and go back to answering the phone when customers call the call back does not help when you have an issue", "rating": 3}, {"title": "Good", "text": "Was good once I was able to actually place the order.  Had trouble with the website twice before I was able to actually place the order.  I've ordered many times before so this wasn't user error.", "rating": 3}, {"title": "It took way too long for things to get…", "text": "It took way too long for things to get approved and made, but turned out well. If ordering again, I’d order a month before I needed them.", "rating": 3}, {"title": "Ironman’s Pink Ladies has been buying…", "text": "Ironman’s Pink Ladies has been buying your products for years, but you don’t have much for girls, duffle bags, back packs, etc! Forces me to use a second company!", "rating": 3}, {"title": "Shipping too long", "text": "The quality of the shirts as well as customer service were great! However almost 8 weeks for delivery was not. We had an employee representing​ our company with out shirts because of the delay.", "rating": 3}, {"title": "Some clarity issues", "text": "In the past, I have ordered from Queensboro with no to limited issues, and I am still likely to order again. They are a good company. While the satchel I ordered from them is in rough shape after two years, I have had their polo shirts for four years and they still look great.The issue came this time on the design itself.  The reason for the back and forth was the delayed discovery that there was a max. thread count that they were able to do. If it was advertised up front, I must have missed it. I just wish it was included in the first response back. Some frustration could have been saved for both the person on their end as well as on my end.Now, I did really their color swap program, which allows you to tweak the colors. Ultimately, it turned out a beautiful shirt.", "rating": 3}, {"title": "Products delivered after my promotional …", "text": "Products delivered after my promotional event.  I don't want to have to spend extra money (express delivery) in order to get my products delivered within 14 days or order.  thank you.", "rating": 3}, {"title": "I needed to work more with the designer…", "text": "I needed to work more with the designer to get exactly what I was looking to get.  I have passed your name to the team who will be working the project.Thanks,Linda McLeod", "rating": 3}, {"title": "Prefer the softer fabric", "text": "I love Queensboro, but I prefer the other t-shirts where we have a softer fabric.  My latest order was with a heavy t-shirt fabric, more durable, but not soft like the other fabric.", "rating": 3}, {"title": "This tee shirt order delivery was only…ok service", "text": "This tee shirt order delivery was only so so, the L,XL sizes were very timely but the 2ea 3XL were longer than expected delivery", "rating": 3}, {"title": "The first hat was not the way it was…", "text": "The first hat was not the way it was supposed to be, but was able to go back and fix it. Its not exactly how our logo is supposed to be, but it will work for small events.", "rating": 3}, {"title": "Delivery times are ridiculous", "text": "Delivery times are ridiculous. The website claims will ship in five to ten business days. It took SEVEN WEEKS to get my last order with no contact advising me of any delays.", "rating": 3}, {"title": "Great product and work!", "text": "I would give you a five star rating on your quality and work. My only issue is the time it takes for orders when you are using a logo you already have.ThanksMike", "rating": 3}, {"title": "Sloooow", "text": "Price, okay. Quality, okay. Timeliness is dismal. Took over a month to receive our beanies. Could have embroidered 20 beanies by hand faster than that.", "rating": 3}, {"title": "It was rough going but the owner…", "text": "It was rough going but the owner inevitably made it right in the long run. A lot of things could have been done before it got to the point where it ended up.", "rating": 3}, {"title": "Shirts", "text": "Everything was great, except the ship time.  If that wouldn't have been sooo long they would have had 5 stars.  Will defiantly reorder 👍🏻", "rating": 3}, {"title": "Ok but not ok", "text": "Honestly. We love the product. Every single time we receive an order it is perfect. Since I’m rating overall experience, the only reason why I would ever consider going with someone else, is the turnaround. In 2 separate occasions, we’ve ordered shirts for events and we can’t receive them before the date. I’ve tried speaking to someone but the only thing they say, it’s the 10 day to print and then some for shipping. For instance, one order 1854133, took from 5/4-5/20. Another order 1865229, mind you, of 4 shirts ONLY, took 6/6-6/24. I'm sorry, but as a business owner, I can not trust the Queen. The order is always perfect once received. But the turnaround is tremendous. Horrific even. Now, honestly, both the times I wouldn't have minded paying \"express print\" AND \"express shipping.\" There's times where I place orders and I don't mind the time, but there's special occasions where money is not the issue! Please consider this. Thank you.", "rating": 3}, {"title": "my sometimes my rep", "text": "my sometimes my rep. never return phone calls and not much help , looking other places for my shirts and hats.........thank you", "rating": 3}, {"title": "The letters above the Logo were the…", "text": "The letters above the Logo were the wrong color.  I spoke with Mona, and she is making the order correct.Great Cusomer care and service.Thank you.", "rating": 3}, {"title": "Lead time is too long", "text": "Lead time is too long. Pricing seemed arbitrary with different price promotions being offered multiple days per week. Not a fan of the overall process.", "rating": 3}, {"title": "Hoping all is getting better with time …", "text": "Hoping all is getting better with time line in getting orders, guess you can get spoiled and when things don't flow as usual you can get disappointed", "rating": 3}, {"title": "The order was perfect but the…", "text": "The order was perfect but the processing time and delivery time was horrible. It's no reason why the order should take so long to receive.", "rating": 3}, {"title": "Fits well", "text": "These shirts have movability which is unusual in a long sleeve button down shirt. the fit is nice and it has a professional  style, not just casual.", "rating": 3}, {"title": "Excellent service but fabrics used sometimes disappoint.", "text": "Queensboro always gives excellent service, and the customer service help is great.  I have one problem with Queensboro:  it is very difficult to find the fabric content of their shirts in their online descriptions, and fabric content is very important for comfort.  I want to order shirts made mostly with cotton.  On some of the items, like their \"cotton t-shirts,\" the fabric content is in the name of the item, but otherwise, it's very hard to find the right product.  On the polo shirts that I ordered, I tried to guess that \"silk touch\" would be made with some cotton.  They're just so-so.  Yes, the order is the way I placed it, so I can't say they made my order wrong, but I don't love the fabric.  It feels like mostly nylon or some other polyester fabric and they won't be comfortable like cotton would be.   When they asked if my order was perfect, I had to say yes, because they made everything just as I asked, but I doubt I'll order any polos in the future.", "rating": 3}, {"title": "Love your apparel but hard to figure your sizes", "text": "Love your apparel and embroidery but the sizes vary extremely. Would buy from you on regular basis is sizes were more within the normal range.", "rating": 3}, {"title": "I like it but was confused several times", "text": "Date of experience: January 02, 2023", "rating": 3}, {"title": "This was a second order used with…", "text": "This was a second order used with credit due to the original order getting lost and over 60 days for delivery.ThanksJames Grace", "rating": 3}, {"title": "The first item was flawed with…", "text": "The first item was flawed with misspelling but you replaced it for no extra charge and I think that's very good customer service.", "rating": 3}, {"title": "I was hoping to get this order earlier …", "text": "I was hoping to get this order earlier since it was a second order. I don't understand why each order takes a full month to get here.", "rating": 3}, {"title": "A little slow...", "text": "Good thing I was not in a hurry but the quality is good. Wrangler western shirts would be a good addition to your product line.", "rating": 3}, {"title": "Early spring/late fall jacket.  Too heavy for summer.", "text": "Be aware jacket has no inside lining.  Weight is for 45-60 degrees.  Not light enough for summer.  Collar does not fold down.", "rating": 3}, {"title": "Had to clarify logo several times", "text": "Had to clarify logo several times. Several emails. Seemed like right and left hand were not paying attention to details", "rating": 3}, {"title": "My initial order was delayed or lost", "text": "My initial order was delayed or lost. I'm not sure which. Customer service did a good job resolving the problem", "rating": 3}, {"title": "Order came in several boxes at…", "text": "Order came in several boxes at different times and there were errors. However, they fixed all of the errors !!", "rating": 3}, {"title": "Too slow...", "text": "Very disappointed in the time it took to get here, almost a month from the time I purchased the shirts.", "rating": 3}, {"title": "Lvl hi broo you are a very good", "text": "Date of experience: December 23, 2023", "rating": 3}, {"title": "They were OK but I felt that the logo…", "text": "They were OK but I felt that the logo could have been bigger. Nice heavy clip though.", "rating": 3}, {"title": "Took too long to get here .", "text": "Date of experience: June 19, 2024", "rating": 3}, {"title": "My order was late", "text": "My order was late , it was supposed to be here 2 Jan . I called and was told 4 Jan . It got here 7 Jan .", "rating": 3}, {"title": "Waited several weeks for order before…", "text": "Waited several weeks for order before shipped - had not been contacted that my order had issues.", "rating": 3}, {"title": "Great products", "text": "Great products. I just wish the wait time was shorter. Seems like a long wait from order to receiving.", "rating": 3}, {"title": "Very difficult selecting items", "text": "Very difficult selecting items. Not enough description. Replacement went smoothly, though.", "rating": 3}, {"title": "Product is as always very good but the …", "text": "Product is as always very good but the shipping seems to take an extraordinary long time now.", "rating": 3}, {"title": "Hats were delivered VERY late", "text": "Hats were delivered VERY late, and only after I called to determine the reason for the delay.", "rating": 3}, {"title": "I really wanted the green", "text": "I really wanted the green, but could not wait.....   not as happy as usual.....Bob Blaser", "rating": 3}, {"title": "Happy with most", "text": "I didn't realize the hoodies were so light weight...other than that everything was great.", "rating": 3}, {"title": "Good Products", "text": "These products are good, but I would prefer the products were made in America not India.", "rating": 3}, {"title": "I highly recommended queensboro!", "text": "I highly recommended queensboro!! The products and the customer service is incredible", "rating": 3}, {"title": "Shipping charges are too high.", "text": "Other vendors charge us much less for shipping and handling compared with Queensboro.", "rating": 3}, {"title": "Quality lacking", "text": "I was a little disappointed with the quality and sizing of the women's shirts", "rating": 3}, {"title": "Shipped to wrong address", "text": "Waited nearly a month for purchase because it was shipped to the wrong address.", "rating": 3}, {"title": "Delays in production caused delays to …", "text": "Delays in production caused delays to me which caused delays to my customers", "rating": 3}, {"title": "Quality is not same as earlier purchases same product.", "text": "Past years purchases of identical product was much better quality material.", "rating": 3}, {"title": "Was expecting to approve design and…", "text": "Was expecting to approve design and size before but never happened.", "rating": 3}, {"title": "Original order was wrong upon arrival.", "text": "Original order was wrong upon arrival.You corrected it and all is fine", "rating": 3}, {"title": "Product was fine but very disappointed…", "text": "Product was fine but very disappointed it took over 3 weeks to get it", "rating": 3}, {"title": "Should really be a 2.5", "text": "If there was a 2.5 that's what I'd choose but since I had a good first experience that's got to be taken in to account. At time of order I was told that my order would go to machine in 6-10 days and I expected it to ship in about 3 since I'm close to the company. After 4 weeks of no word about my order I began to get worried. So I try to log in to my account at night but can't because Queensboro is closed. I do so the next am to find a shirt is on backorder. Well I figure that explains the delay so I give it another week. No word so I contact customer service...no mention of the backordered shirt business when I ask about the delay  but here's where it gets sketchy. I'm told a machine went down and there order processing was affected and they are running behind but are back up after purchasing another machine. Ok I understand. Another week and no shirts. I contact them again and am told now that my order went to machine and that a shirt got damaged in production and that my shirts will be done that day or next and ship out. I'm really questioning the info now. I got shirts finally later than they again said but what gets me is that I felt like Queensboro was not telling me the truth. If there was a production issue, it would have been better to just announce it apologize and move forward. I didn't  appreciate the lack of communication and frankly now I'm just a bit concerned about ordering again. It took me 6 weeks to get my shirts that were expected in 2-3.", "rating": 3}, {"title": "Someone should have contacted me to let …", "text": "Someone should have contacted me to let me know my order was behind.", "rating": 3}, {"title": "Excellent product", "text": "Excellent product. Good workmanship.  Took too long to get order.", "rating": 3}, {"title": "shipping time was a bit long.", "text": "Date of experience: September 06, 2022", "rating": 3}, {"title": "Slow", "text": "In a world of next day service/delivery...you are slow", "rating": 3}, {"title": "I like the site but often feel …", "text": "I like the site but often feel \"tricked\" into things.", "rating": 3}, {"title": "Always happy with results but did take …", "text": "Always happy with results but did take a long time this time.", "rating": 3}, {"title": "First I Was Impressed - Then Over Time I Wasn't.", "text": "Initially when I first started dealing with Queensboro, I was REALLY impressed. And loved how they wanted to know what you think about they will replace it for free if you didn't like it. However, I started to find as I needed to fine tune a few embroideries to match up with our corporate guidelines, I was getting no replies and when I did, it took a few days. I even called up Queensboro and asked if I could get one person assigned to my account, as I was trying to firm up the embroideries (and I am sorry but one was simple and yet, took them forever to get it right), but was almost laughed at. As I starting dealing with that rep back and fourth via e-mail, once again it took forever. As time went on, I ultimately had to fire Queensboro from ordering hundreds of shirts and go with a vendor that was more prompt. I am sorry but almost a month to get the embroideries (2 of the 3 were really simple) was unacceptable and I thought by using Queensboro, I could really impress my boss. Unfortunately I was wrong. After a while even he was like what the fudge?!Queensboro may be good if you have a small order and a very simple logo......but I would not recommend them if you are looking for good Customer Service to work with you on a potential large order as you will be dealing with numerous people along the way. I will also say they are able to get their shirts at discount because they are using old discontinued shirts (mine were Nike) - which if you go out and try on a Nike XL here, with them, it would basically be a size XXL as Nike has adjusted their fitting over the past few years. So be prepared to get a shirt that was 3-4 years discontinued.", "rating": 3}, {"title": "Order was OK", "text": "Order was OK  Color I was expecting a little be darker.", "rating": 3}, {"title": "Logo set up", "text": "Great product & prices \rBut enjoy set up charges $$", "rating": 3}, {"title": "Had a problem on a prior order that was…", "text": "Had a problem on a prior order that was not resolved.", "rating": 3}, {"title": "Original order not perfect", "text": "Original order not perfect,  replacement order late.", "rating": 3}, {"title": "delivery was messed up but well handled…", "text": "delivery was messed up but well handled situation", "rating": 3}, {"title": "Discount", "text": "Shirts were fine but I felt the price was too high.", "rating": 3}, {"title": "Orders seem to take longer than they…", "text": "Orders seem to take longer than they used to.", "rating": 3}, {"title": "The colors were a little off on the logo", "text": "I go to Queensboro for all of our apparel needs", "rating": 3}, {"title": "Embroidery is not perfect", "text": "Embroidery is not perfect. Just ok", "rating": 3}, {"title": "Turn around and shipping are issues.", "text": "Date of experience: January 22, 2018", "rating": 3}, {"title": "It took too long to get my order!", "text": "Date of experience: May 08, 2017", "rating": 3}, {"title": "Thanks for making it right.", "text": "Date of experience: May 04, 2021", "rating": 3}, {"title": "shipping time was a bit long.", "text": "Date of experience: April 25, 2020", "rating": 3}, {"title": "Pretty good", "text": "Pretty good service", "rating": 3}, {"title": "Incorrect logo used", "text": "Date of experience: April 24, 2021", "rating": 3}, {"title": "SIZING", "text": "Shirts run small", "rating": 3}, {"title": "Late arrival", "text": "Date of experience: May 30, 2017", "rating": 3}]