[{"title": "The items seem solid and of good…", "text": "The items seem solid and of good material as they all have a good weight to them. Delivery did take a while but it’s coming from another country so there are no complaints there. I was disappointed in the earrings; I went to try the earrings on,  pull the back off and in the process the earring post came off too so I wasn’t able to try it wear the earrings.", "rating": 3}, {"title": "Shipping takes a month.", "text": "Date of experience: October 03, 2023", "rating": 3}, {"title": "I purchased twice and the jewelry…", "text": "I purchased twice and the jewelry quality is decent. One of the mens chains l got was smaller then what I expected. My husband didn’t like it so I kept it for myself. One of the rings I got the Diamond in the center fell out and I only had it for 2 months. I contacted the ambassador manager 4 days ago about a defective piece and still no response.", "rating": 3}, {"title": "Communication could be better", "text": "Communication could be better. Also, I wrote a few times asking if I had to pay shipping every single time and no response. I feel like if you want to keep people as ambassadors then we shouldn’t have to pay for anything. I did enjoy taking pictures with your jewelry the first time so thank you.", "rating": 3}, {"title": "my boyfriend really likes his ring but…", "text": "my boyfriend really likes his ring but mine was scratchy. the bracelet also wasn’t as oversized as i liked. i had paid for shipping on a previous order and after it was delivered, someone broke into my mailbox and stole it. kids probably. the customer service didn’t refund or resend or offer any help. so. that’s a bummer. if the jewelry was nicer, i may not have mentioned!", "rating": 3}, {"title": "Half the items are great!", "text": "Vanessa flair is definitely an edgy jewelry company. I would say some of the items I received definitely look nice to the eye but maybe poorly made? One of the rings I got was missing a couple jewels. Three of the rings I got were great! Maybe 2 or 3 of the other ones I never wear because of the quality. Some of them are a tad uncomfortable too and hurt the fingers next to the one with the ring. I know which ones to buy though!", "rating": 3}, {"title": "It’s a TRICKY company", "text": "Necklaces don’t have length measurements when ordering. So when I received it, it was super short and not the look I was hoping to get. Also, the fact that I “won” a gift card yet the gift card doesn’t work on shipping and then I can’t use the whole amount won because there’s a 3 piece limit, not fair. Then icing on the cake. When placing an order it showed a $0 shipping charge but when I entered a discount code, boom, shipping is now $30. I called customer service to inquire and they said if your in a certain area shipping is $0 (which is why it showed $0) but because I was getting a discount I need to pay an out of country shipping fee. CRAZY! This is not how you attract a fan base when gift cards in USA can be used like a credit card. Shipping fees are generally part of the “fee” that can be paid with a gift card. It’s just a shady way to make more $ off customers! You can easily get similar fashion jewelry half the price at local stores rather than all of the hassle.", "rating": 3}, {"title": "was kind of what i expected for price", "text": "was kind of what i expected for price. nice look but materials didn't agree with my skin. besides i'm not much of a jewellery wearer", "rating": 3}, {"title": "The shipping took too long and I got…", "text": "The shipping took too long and I got one item that I didn’t order. It was not what the picture showed.", "rating": 3}, {"title": "The jewelry are kind of small", "text": "The jewelry are kind of small, and delivery takes a long time for me.", "rating": 3}, {"title": "I don’t like how long it takes to get…", "text": "I don’t like how long it takes to get the item. To wait a month for it or over a month is a lot. I still have not received my purchase too.", "rating": 3}, {"title": "I was an ambassador but the Price for…", "text": "I was an ambassador but the Price for delivery its too much so i quite", "rating": 3}, {"title": "Dissatisfied with the arrival period", "text": "I’m happy for the fact that, I received exactly what I ordered for. Just the period it took to get here is my plight.", "rating": 3}, {"title": "I loved the earrings", "text": "I loved the earrings. They are beautiful. But the necklace I’ve ordered I had to fix it already three times. It’s a little fragile. But it would be a cute necklace.", "rating": 3}, {"title": "After my first purchase everything…", "text": "After my first purchase everything supposed to be a gift I had to pay for shipping again. Other than that ❤️.", "rating": 3}]