[{"title": "Is it the right one?", "text": "The gal I talked to was very helpful but I am waiting to see if the dental insurance I got will work for me.  The dentist that I have is not on the plan with you and there are really none in the area .    I am hoping it will work.  So I am waiting to see.  I have a dentist appt soon.", "rating": 3}, {"title": "I have called and requested insurance…", "text": "I have called and requested insurance cards for my dental and vision that I’m paying every month and still have not received them or any type of information", "rating": 3}, {"title": "That You have not returned my phone…", "text": "That You have not returned my phone call.I want to talk to a live agent, not just a Text for such a Big step changing from Medicare Advantage Amerigroup to what I understood was United Health Care not Ensurem. Please have someone callMary Gadd.  B/D. 3/4/1951901 491 9322.Am I not under United Health Care?", "rating": 3}, {"title": "Johns' view", "text": "I have not received documentation concerning a contact or document to show i am having a supplemental insurance from the insurance agent. The benefit is not healthcare persee but just cash to help", "rating": 3}, {"title": "The representative was nice and tried…", "text": "The representative was nice and very funny he tried his best to help me. Somethings wasn't quite clear, and I couldn't understand somethings, he seemed a little confused about. But for the most part he did an ok job...", "rating": 3}, {"title": "Spent a lot of time trying to find…", "text": "Spent a lot of time trying to find where my payment s/b sent to no avail.  Still don’t know. - payment due 10/1/23!  Can payment be made.by credit card?", "rating": 3}, {"title": "Very common goals setting", "text": "Very common goals setting. Corrected founded and gives proofly united way", "rating": 3}, {"title": "I thought this company was part of…", "text": "I thought this company was part of Humana.  this is the first time I have heard of Ensurem and hope that it is legitimate.", "rating": 3}, {"title": "Despite providing medicare/senior…", "text": "Despite providing medicare/senior services, most reps. seem to forget or don't understand that like me, seniors are older and although mentally sound, not fast or as quick to grasp what is being said when is long  narratives read at warp speed.  At the end I was asked \"do you understand what I read (10 mins of it)\".  Only to the degree that I could remember without having a script like the knowledgeable rep. had.", "rating": 3}, {"title": "Is good but read into it firsthand I still find 0 info on healthy benefits plus card or anything yet", "text": "I was switching from a decent 1 did good service for me yet this 1 still no idea even my old 1 gave me a good card had healthy benefits plus on it helped me to know what to do with it so I could eat as I am very low income so low I go weeks without food even and can't do laundry or get what I need most of the time...", "rating": 3}, {"title": "Too long it appears that this also…", "text": "Too long it appears that this also means you want me to make up things to talk about.", "rating": 3}, {"title": "I have not been on line with your…", "text": "I have not been on line with your insurance sent me another after it become in effect, I don't have a lot of time at the moment, I just follow what the insurance lady told me", "rating": 3}, {"title": "I cannot use my OTC Without everything…", "text": "I cannot use my OTC Without everything being rejected? I’m tried of going into CVS and having them tell me it not on the list when in fact I call Aetna and was told it was! What is that about? Or are you another company who doesn’t know what the other hand is doing?", "rating": 3}, {"title": "I spoke with Dexter Ward", "text": "I spoke with Dexter Ward, he was very knowledgeable and was great to talk to, I would recommend him anytime", "rating": 3}, {"title": "Very knowledgeable! All questions were answered and good advice given.", "text": "The service was very thorough, all my questions were answered.", "rating": 3}, {"title": "its too early to tell how good or bad…", "text": "its too early to tell how good or bad they are .i dont even have my policy yet .but the agent Lina Heart was very nice and she answered my questions and helped me with a stand alone policy that ihad been thinking about.", "rating": 3}, {"title": "I'm too new to be of use", "text": "I'm too new to be of use, Hopefully yall are more courteous and concerned about my health coverage and well being, and I'm not just a number that sends the federal money to yall for providing me the best coverage possible", "rating": 3}, {"title": "My first application for Humana", "text": "My first application for Humana, the customer service representative signed me up for a plan for which I did not qualify! My level of Disability/Medical coverage need was not enough for that particular plan. I was excited for nothing. A few days later I received a letter of  notification and called Humana back. It was explained to me that the initial representative should have realized I did not qualify. My second call, my information was re-entered and discovered another Humana plan for which I did qualify, and applied for. The second customer service representative explained and I was not so disappointed. If accepted, I will have a couple more advantages than I have on my old plan.", "rating": 3}, {"title": "Stephanie Moody was very nice and…", "text": "Stephanie Moody was very nice and detailed. She seems new and needs more experience and tools at her disposal. She did good with what knowledge and references experience she had to work with.", "rating": 3}, {"title": "Convenient n fast on getting my Sister…", "text": "Convenient n fast on getting my Sister back n enrolled on her medical.", "rating": 3}, {"title": "They were very helpful but didn't give…", "text": "They were very helpful but didn't give me option to choose which insurance company I'd go with. Hooked me up with a pcp that no longer takes patients.", "rating": 3}, {"title": "I enjoyed the conversation with the man…", "text": "I enjoyed the conversation with the man I spoke to.i still have not received my insurance cards and I am concerned", "rating": 3}, {"title": "Received a call while driving and asked…", "text": "Received a call while driving and asked for a call back. Was never contacted and don't know what I am reviewing.", "rating": 3}, {"title": "I came for a facial and it was half…", "text": "I came for a facial and it was half done.  Not because of time, it was because she waisted my time with massaging.", "rating": 3}, {"title": "You go over Everything to many times", "text": "Date of experience: January 25, 2023", "rating": 3}, {"title": "Her computer didn’t give up to date…", "text": "Her computer didn’t give up to date doctor info", "rating": 3}, {"title": "It shows compassion 🙂", "text": "No comment at this time!!", "rating": 3}, {"title": "Humana ID card.", "text": "I have been waiting for my Humana Insurance ID cards. I called them and Humana kept telling me it is on it's way. I have doctor's appointment 12/6, which would be switched for 12/1.Help me.(Mrs.) Bhavana Bhatt", "rating": 3}, {"title": "I have been denied for a necessary…", "text": "I have been denied for a necessary procedure to better my overall health.  I am wondering if my choice of care  was a good one.", "rating": 3}, {"title": "It seemed a bit much", "text": "It seemed a bit much, the information, you asked for to acquire this insurance.", "rating": 3}, {"title": "A covered dental procedure was…", "text": "A covered dental procedure was rejected. Ensurem only reiterated the rejection.", "rating": 3}, {"title": "new incurance", "text": "just looking for new insurance", "rating": 3}, {"title": "Very polite and understanding even when…", "text": "Very polite and understanding even when I had him going back and forth.", "rating": 3}, {"title": "Info provided was understood", "text": "Date of experience: January 20, 2023", "rating": 3}, {"title": "It's okay I like it the way it is thank…", "text": "It's okay I like it the way it is thank you", "rating": 3}, {"title": "Painful", "text": "A lot of time.", "rating": 3}, {"title": "the last time I called I was hung up on", "text": "Date of experience: March 29, 2022", "rating": 3}, {"title": "It was to long", "text": "Date of experience: July 18, 2023", "rating": 3}]