[{"title": "It jumbled my credit address and…", "text": "It jumbled my credit address and shipping address into one address. ", "rating": 3}, {"title": "Half happy with purchase", "text": "The hooked rug which I purchased through your website did not meet my expectations. Bonnie Boswell Antiques altered the colors of the pictures used to advertise the rug. The contrast was pushed to give the rug an almost black frame in the pictures. The actual rug has a mid-tone brown frame. The background of the motif looks cream/white in the ad pictures used, but the actual rug has a tan background. Bonnie Boswell should not alter the colors and contrast of what she is selling. Good points of the transaction: the rug is in good condition and it arrived promptly. ", "rating": 3}, {"title": "I forgot my password and repeatedly for…", "text": "I forgot my password and repeatedly for two days the reset link did not work. A message to the HELP desk went unanswered.I don't like losing an item because the site is not working correctly.UPDATEi remembered my password last night after another error report from Ruby lane chat submission  si am now able to log in.", "rating": 3}, {"title": "Checkout grief", "text": "I found a lovely doll dress that I put in my cart immediately.  The dealers on RubyLane are wonderful and I would not have had a chance to view their items or purchase from them in another format.  But I  have an \"active \" PayPal account that with  Ruby Lane has always been a problem.  I studied the How to Use PayPal tutorial but there is no icon where it supposed  to  be", "rating": 3}, {"title": "This was my first purchase on Ruby…", "text": "This was my first purchase on Ruby Lane.  My comment is nothing against the individual seller; it is against Ruby Lane.  Why give your customers a choice of payment method when you make the final decision?  I entered my credit card information and clicked the button to pay.  Then I received the message \"Thank you for your PayPal payment.\"  Annoying.", "rating": 3}, {"title": "The RL fees are just too much", "text": "The RL fees are just too much, up to $250 per item.  Then there are RL shop monthly fees, taxes, shipping and then paypal fees on top take all the profit for sellers and discourage folks from buying.Yes, I see your response but it doesn't change a thing.  All those added amounts including $250 for expensive dolls, is ridiculous.  Buyers are discouraged and sellers are also discouraged.", "rating": 3}, {"title": "I’m confused", "text": "I’m confused!  At checkout I paid fully with PayPal and received a confirmation from PayPal that the payment had been made to the seller.  But the message I received at the same time from Ruby Lane says I will be hearing from the seller about payment methods.  This makes me uncomfortable.  Have I paid or not?  Where has my money gone?  Ruby Lane should be more clear about the payment process at checkout.  I won’t relax until I know for sure what’s happening - not in the least a pleasant buying experience.", "rating": 3}, {"title": "I was very disappointed that the shop…", "text": "I was very disappointed that the shop owner never responded to my question before shipping. Her shipping  price was outrageous and I asked her if she could possibly ship cheaper. No response , sorry that’s just rude and bad business. She could have just said no.", "rating": 3}, {"title": "Messages and shipping costs", "text": "Messages are a mystery. Given Ebay and Etsy both messsge \"interally\" on their own message board,  RL needs a FAQ item on how it works between buyer and seller.  I was surprised to get an email direct from the other.  It worked, effective, but RL could do more to address the mystery.    Second, shipping was a shock!  $40 to ship a small parcel from US to Canada?!    Fortunately the seller worked to find the REAL cost.", "rating": 3}, {"title": "Please Support My Browser Again!", "text": "I love this site and have purchased many items from various sellers. I would rate it a 5 star except for the fact that the site no longer supports my browser (Safari). To use the site efficiently, I have to switch to a different browser, and that definitely means I use the site less. I cannot update my browser. Please consider adding my older version (15.6) back as supported.Otherwise, I really do love the site. Great trustworthy sellers with wonderful offerings!", "rating": 3}, {"title": "Curious new customer", "text": "I liked the item I ordered and the dealer that sent it to me got it to me quickly and in good shape with appropriate packaging.What I didn’t like was that there was an automatic extra hundred dollars added to my total for insurance . I declined the insurance because $100 was way more than would be necessary to replace the item and because the first hundred dollars of insurance is included without extra cost to the customer anyway normally ! I don’t know why things were set up that way and I hope you will get it fixed !", "rating": 3}, {"title": "I really dislike that paypal is the…", "text": "I really dislike that paypal is the first option for payments. I don't like, nor use paypal anymore. The check-out process feels very high handed and deliberate. Just my opinion based on past experience. Thank you!", "rating": 3}, {"title": "I didn’t like the fact that this…", "text": "I didn’t like the fact that this website only ships to the USA. Why bother putting a business online and only cater to your home country without allowing the rest of the world. The internet and online shopping is global capitalism.", "rating": 3}, {"title": "Risk associated with shops pulling out.", "text": "Purchased jewelry from a shop on Rubylane. Item was placed on layaway. With only one payment left, the shop left Rubylane and I was on my own to contact the shop and complete the transaction. I’m hoping the shop honors the purchase, I’m optimistic they will. But buyers need to be aware that when shops pull out, there is nothing Rubylane can do to help resolve an issue. I’ve done a lot of business on Rubylane and have been very happy with my purchases. But after this experience, I’m not sure I’m comfortable with the risk.", "rating": 3}, {"title": "i haven't received any info on when it…", "text": "i haven't received any info on when it will be shipped or when i can expect to receive the penhowever, i’m really looking forward to its arrival (whenever that might be)i’ve been looking for this particular pen for at least twenty years. i hope it’s in as good a condition as the fotos suggested.thanks for the reply... \"Please note all order information, including shipping date and tracking, are entered in the order, and your order displayed all that information, including the tracking number.\"but i can't find that info anywhere ? where can i locate it? can you send it to me again\"Please note all order information, including shipping date and tracking, are entered in the order, and your order displayed all that information, including the tracking number. Choose My Account in the upper right and then Orders. View that order to see all relevant information, including tracking.\"thanks for your quick response...but i don't see My Account in the upper right corner.i see \"HS heron stone\" with a dropdown menu consisting of My Reviews, My Settings, Help and Log out...   no My Account or Orders.can you just send me the info please?thank youheron.....................................................OK... i found itTHANK YOU", "rating": 3}, {"title": "Jumping the gun…", "text": "I'm giving 3 stars because the email that I received that prompted me to leave this review, also thanked me for making a purchase.  I didn't make a purchase. I made an offer. As of yet, my offer has not been accepted.", "rating": 3}, {"title": "Poor messaging", "text": "The messaging between buyers and sellers doesn't work all the time.  The seller didn't get my first message.  Our messaging went to personal emails which worked better.", "rating": 3}, {"title": "Dear me, what have I gotten myself into!!!", "text": "Granted, I'm what is generally referred to as technically challenged - maneuvering web-sites is not my idea of fun.  In my simple thinking I fill my cart and the pertinent details so as to affect a sale.What I don't expect is legalize that would require a Philadelphia lawyer to get me through.  Of course, I did not read it believing that if my intent is sound and positive any judge would rule in my favor should it comes to that.I have not not heard from the seller.  What's to happen to the sale?  In fact the seller indicated she has more of the same which interests me.  I'd never seen this coloring in this particular pattern and I am curious.What next can I expect from just anybody??  The seller, Trustpilot - whoever.I love the cup and saucer.  The rest is simply a Royal Pain.  I am sorry to say this.  Is this sale a commitment on my part to do something other than pay the seller?  If so I would like to have clarified to me what is expected in the future as I don't believe I will ever return to this web-site again, alas.", "rating": 3}, {"title": "Not a very good return policy or protection for buyers.", "text": "Many interesting pieces here on Rubylane, it’s like walking into the what’s left of the antique shops where everything is old and over priced. I happen to find an earlier miniature dollhouse piece of furniture that the seller knocked off 5.00 to make it more affordable and more at its worth. Unfortunately the item arrived with a splintered off broken leg. I think it’s difficult getting your money refunded and just as difficult returning an item here on Rubylane. I am not happy with their return policy nor the fact that you cannot send the seller any photos of your damaged purchase . I contacted the seller to ask for a refund or discount to which she replied “ how much of a discount and can it be fixed?” As a seller I felt that was a question she should answer and as far as can it be fixed? well I did not purchase a broken item with the description “ a piece for you to fix” I really do not like shopping on Rubylane as my past purchases have had a few problems but after a long absence I thought “why not” now I see why not and will not be returning.", "rating": 3}, {"title": "Not user friendly, glitches", "text": "As a first timer, the site is not user friendly. For example, I kept trying to change my shipping address and when I did that, it showed up as billing. Did it several times, was thinking of opening a store on Ruby Lane and wanted to try it out first as a buyer. Glitches. Had to even backdate the date in order for review to be sent. And I don't know why I'm now a guest. Perhaps that was the new payment method.", "rating": 3}, {"title": "I had a hard time getting signed in to…", "text": "I had a hard time getting signed in to make a purchase.  I punched the credit cards pictures by mistake I didn’t intend to use pay pal I’ve had a bad experience with pay pal got scammed and they were no help.I’m 75 not a geek should have used the grandkids help.", "rating": 3}, {"title": "The messaging system could be easier to…", "text": "The messaging system could be easier to use. Emailing back-and-forth became not very user-friendly. It would be nice to be able to have a messaging system. It would also be nice if Ruby Lane had an app", "rating": 3}, {"title": "Problem with stock availability", "text": "I love the selection and reasonable prices at Ruby Lane.  However, the purchase I made last night was rescinded after the sale.  The seller said the item had already sold at one of her other sites.", "rating": 3}, {"title": "I had to try multiple times to register…", "text": "I had to try multiple times to register with Ruby Lane.  Could not find my old account, re-registering was clumsy and non-intuitive.  Fine deal on the antique though.", "rating": 3}, {"title": "I'm having a very difficult time…getting in ebay. because of my paypal", "text": "I'm having a very difficult time getting on rubylane. because i don't understand why my paypal is not being accepted. I just bought something and I can't get in to pay for it. I will pay with my mastercard. but rubylane will not allow me to get to the purchase area. Why?????", "rating": 3}, {"title": "Search issues", "text": "Most issues center on devising a search that brings what I am looking for - usually collectible buttons.  It is difficult to find things without the ability to exclude certain words.", "rating": 3}, {"title": "Had difficulty paying for my order", "text": "Had difficulty paying for my order. At first, the site wouldn’t accept my credit card. I had to get out of site a couple of times.  Finally, the site accepted my credit card.", "rating": 3}, {"title": "The only thing I have a c/o is that…", "text": "The only thing I have a c/o is that when the seller declined 1st offer I had to write him rather than just sending a 2nd offer.", "rating": 3}, {"title": "Shipping is too high with insurance…", "text": "Shipping is too high with insurance tacked on, especially for multiple items from the same seller. There should be combined shipping.", "rating": 3}, {"title": "I wish RL didn't make it so difficult…", "text": "I wish RL didn't make it so difficult to use my resale tax number,   rather than pay sales tax I do not pay with my doll business.", "rating": 3}, {"title": "Cannot access original item photos and description", "text": "Immediately after making my purchase, the item and its description have disappeared from the Ruby Lane website.  All I can access is the order details page which does not have the original photos and description.  Why is this?  How can I compare what i receive with the seller's description?  Very frustrating.  And not making me happy as a buyer.  RL replied to this review (see below, but the top of that page only said \"Drat, this item is sold, please scroll down to see similar items\".  no mention of my items' full details being all the way past all that or even on that page.  It would be nice if they added that info at the top of the page.   I had to scroll down past almost 75 items to get to the bottom of the scroll where my purchased item was.   so the first time I did that I gave up after about 24 rows of similar items.  This is a rather dumb system in my opinion.", "rating": 3}, {"title": "Getting the book was awesome", "text": "Getting the book was awesome.  Checking out was quite complicated.  I  had to enter the card number and all billing information twice.", "rating": 3}, {"title": "problem with layaway", "text": "i'd purchased from this seller on another site - a fantastic seller, b.t.w. - and she transferred an item to ruby lane so i could put on layaway.  possibly because i use a phone only (no access to laptop, etc.) there was trouble with layaway.  looked on google but things it said to click didn't show on my phone.  emailed rl about jt and although totally different from google's directions it was the same there.  rl also let me know layaway was between buyer and seller and they don't get involved (even though i'd already said we'd agreed) so that was worse than uselwss.  ended up saying i would pay by check and in msg said layaway. it charged me the entire amount.  i emailed seller to see about mailibg 4 checks.on 09/12 i received a reply from seller and we agreed to 4 payments although i'd been charged the entire amount by rl.  on 09/13 i received a reply from rl that didn't tell me anything i didn't tell me anything i didn't already know and still gave me absolutely no info on how to do layaways in the future.  NOT a good 1st experience, but if i purchase something outright i may have better luck.  willing to maybe give it another try at some point, but so far not impressed.", "rating": 3}, {"title": "Aggravating, extremely outdated platform.", "text": "Ruby Lane continues to make the user experience tedious and poorly designed for buyers. 1. When searching, you cannot specify the price range you want. You must use their range choices. 2. There is no way to stay logged in on a specific device. I can see that there are a certain number of items in my cart, so obviously my identity is known. Yet each time I have to enter my user name and password. 3. This platform hasn't been updated in years. It is outdated and overly complicated. Although I have always been pleased with the items I've purchased and the sellers I've purchased from, buying isn't straightforward either. 4. You have to wait for a seller invoice, even if it's only one item and shipping is free. 5. If the convoluted process of notifying the seller that the item has been received isn't performed, the seller continues to list the item as \"pending.\"  I don't really care, but I don't want to make things more difficult for the seller. 6. Leaving feedback is another chore making it less likely for me to bother. I don't know why I bother reviewing Ruby Lane. I've been saying the same things for YEARS and nothing has changed. I've been informed that THEY are fine with the system as it is. Apparently the buyer is of small consequence.", "rating": 3}, {"title": "Prompt response", "text": "I don’t think the tech really understood the issue I was having. But I got a prompt response when I telephoned and was finally able to sort out the issue.", "rating": 3}, {"title": "Same Province and Higher Tax then government specified", "text": "Even though we are in the same province and city, shipping is ridiculously high and in US currency. As well, the tax here is 13% but they charged so much more. Again in US currency. For those who live close by should not have to pay these ridiculous amount.", "rating": 3}, {"title": "Knowing Shipping & Handling Costs before Confirming Order", "text": "This isn’t a comment towards the merchant but Ruby Lane order processing. Knowing the shipping and handling costs before confirming a purchase", "rating": 3}, {"title": "I haven't heard if my gift has shipped", "text": "I haven't heard if my gift has shipped. Also it was difficult adding the mailing address and my note didn't save per my receipt.", "rating": 3}, {"title": "I did not want to use PayPal for this…", "text": "I did not want to use PayPal for this transaction. This is the first time I have ever seen a checkout with no option for credit card. Maybe it's common and I just haven't seen it. Other than that, the checkout was quite  easy.", "rating": 3}, {"title": "shoppers without cellphones find it more difficult to shop", "text": "You and many other shop on line stores do not make plans for those of us WITHOUT CELL PHONES!!!!!!!!!! I am tired of being told I can not buy something, or have to go thru multiple steps, to buy something - to prove I am who I am.  You have my email and land line phone number - call and talk to me. But I do not have a cell, and do not have a way to text!!!!!! whatever that is??", "rating": 3}, {"title": "New Year Fees🎊🎆", "text": "I think the fees for all the items from the sellers have really increased especially from Europe and I plan on not buying from those sellers cannot afford those prices with the inflation now, so disappointed 😞Cher", "rating": 3}, {"title": "I don’t need Ruby lane to tell me", "text": "I don’t need Ruby lane to tell me “I have great taste” “nice find”. This is ridiculous, unnecessary,  and VERY annoying!!!", "rating": 3}, {"title": "It's really hard to navigate in my…", "text": "It's really hard to navigate in my opinion and for some reason the The system shows an error every time I've tried to reset my password something's really wrong with this website at least as far as the replies and that kind of stuff go keep working on it need some help", "rating": 3}, {"title": "beautiful piece no reply from seller", "text": "no reply to an email in regard to shipping costs.  It came up for sale on the spot light sale and I purchased it anyway.  Just would have like a response from the shop owner.", "rating": 3}, {"title": "You may be required to collect tax but the correct tax would be preferred. My county is not 7.5%.", "text": "I was an early buyer from RL. I still love it but they don't seem to care what the buyers think. It is cumbersome to find things now. Way too many new items. Also I am always overcharged on tax and shipping. That stops me from many purchases.", "rating": 3}, {"title": "I dislike any payment option that uses…", "text": "I dislike any payment option that uses PayPal. They do not protect buyers from unscrupulous sellers.", "rating": 3}, {"title": "Making payment", "text": "Finding the payment button has become a real hassle", "rating": 3}, {"title": "First of all I try to sign in with my…", "text": "First of all I try to sign in with my credit card to purchase something didn't go through second of all try to contact you your telephone number couldn't reach out on that on Saturday the 5th still no answer several times third of all I couldn't contact the seller or somebody else on your site", "rating": 3}, {"title": "I am not sure I made a purchase", "text": "I am not sure I made a purchase. I never heard back answering my questions.", "rating": 3}, {"title": "While I like Ruby Lane and have shopped…", "text": "While I like Ruby Lane and have shopped here numerous times I have never had as much trouble as the last time.   It would not accept my credit card (I tried a verbal different ones) as payment and I was forced to open a PayPal account or leave without buying what I wanted as a gift for a friend.    It was much easier in the past.   Now I have a PayPal account t I need to close.", "rating": 3}, {"title": "Shipping fees are way Too High", "text": "Shipping fees are way too high.  Seller probably makes more on shipping than selling coins.", "rating": 3}, {"title": "Your website did not allow me to change…", "text": "Your website did not allow me to change the shipping address and as a result I am being charged almost $90.00 in sales tax!", "rating": 3}, {"title": "SOME CONFUSION WHEN CHECKING OUT:", "text": "SOME CONFUSION WHEN CHECKING OUT:I WANT TO USE MY CREDIT CARD DIRECTLY & NOT USE: PAYPAL,SO CHECKED OUT AND CLICKED THE CREDIT CARD LINK BUT THE PAYPAL LOGO WAS STILL PRESENT.THEN GOT SENT AN EMAIL ABOUT PAYING: WHEN I HAD JUST PAID.THANK YOU FOR YOUR TIME!", "rating": 3}, {"title": "antique doll", "text": "I think that it was a little different from description ,but it was carefully packed and shipped quickly .Thank you for the present .", "rating": 3}, {"title": "Item is Cute; Shipping is Outrageous.", "text": "I like that the vendor - The Orphanage - is selling such a cute vintage Teddy Bear.  I don't like it that the shipping - within one state - is 1/3 the price of the Teddy Bear's price.  That's outrageous, especially considering that both the vendor and I live in the same state.", "rating": 3}, {"title": "Great item but inadequate packing lead…", "text": "Great item but inadequate packing lead to damage the statue during transit.", "rating": 3}, {"title": "I do like alot of your sellers", "text": "I do like alot of your sellers , but one on here took my 300 deposit and refused to give it back!!   That is very wrong!!!", "rating": 3}, {"title": "I think they might be over Weighing the…", "text": "I think they might be over Weighing the product. Because I believe the shipping is a little too much.", "rating": 3}, {"title": "My offer was not sent to the dealer as…", "text": "My offer was not sent to the dealer as promised. The make an offer area needs attention as it often does not go smoothly.", "rating": 3}, {"title": "How do I pay?", "text": "I found the process of paying for the item that I purchase to be unnecessarily complicated", "rating": 3}, {"title": "Prices1620 Plymouth Colony frugality knows quality and greed are 2 different views on sales still low and layaway…", "text": "Prices on sales still low and layaway deposits are usually rates,show your customer you value them at sales time,not as a vulture ready to pick their bones clean  this is not Christie's,but owners think so", "rating": 3}, {"title": "Almost lost the items!!", "text": "Almost lost the items due to not being able to login. Stupid site let me login via Facebook before, now won’t, yet sent me in circles. Wound up having to create a new goddamn email address to start a new account!", "rating": 3}, {"title": "I really like this site and enjoy all…", "text": "I really like this site and enjoy all these various beautiful objects. That said what I don’t like is pay pal coming up everywhere while trying to check out. A slip up and you could be telling them I want an account, which I obviously don’t. I have gotten many, many e-mails telling me I owe them money when I don’t. I wanted to get additional jewelry, but stopped when it said I had to use pay pal. I want to use my own credit card.", "rating": 3}, {"title": "I am confused why I was deducted using…", "text": "I am confused why I was deducted using PayPal", "rating": 3}, {"title": "Hope my order comes in a timely manner", "text": "Hope my order comes in a timely manner. I look forward to it.", "rating": 3}, {"title": "Question regarding item purchased.", "text": "Order# 5921725, no response from seller, regarding purchase made. Can Ruby Lane answer my question?Please inform.We’re the Elsa Peretti open heart rings made in different weights and larger in stature when designed in the 1970’s?  The one that I just purchased looks newer and much smaller than the one I purchased from you in 2019.", "rating": 3}, {"title": "I purchased a transferware plate and…", "text": "I purchased a transferware plate and ended the transaction with a payment via Amex, or so I thought. I was informed the seller would contact me to obtain my credit card info. This is quite an annoyance, having to be tied up, with no time frame as to when the seller might call me, wanting my info! If I had known this prior to committing to the purchase, I would have chosen not to buy the item, even with the good price offered. I prefer the sale to go through with my credit card, just as the transaction is processed, either through Ruby Lane, or the seller. Thank you.", "rating": 3}, {"title": "No more than I bought the item", "text": "No more than I bought the item, I could no longer access the original listing with photos. Since I did not make a copy of the description and or the original photo I can no longer access this information. These spoons were produced in different styles and handle types and different sizes. Now I have to wait to receive the spoons to figure out which one I purchased. In my opinion, one should always be able to access the original listing with photos.", "rating": 3}, {"title": "I just would like to note that the…", "text": "I just would like to note that the shipping charges are not available until one commits to purchase an item.I personally would like to know the shipping costs prior to purchasing because with those charges included, the item may not be affordable.", "rating": 3}, {"title": "I don't like it that paypal is the…", "text": "I don't like it that paypal is the first payment of choice option for you. I prefer not to use paypal. Thank you!", "rating": 3}, {"title": "Have been a Ruby Lane customer for over…", "text": "Have been a Ruby Lane customer for over 20 years. But stopped shopping as often when taxes were added to customer orders together with shipping charges. No perks were given to the customer for all of the additional charges at any time so I often go to other sites to find the vintage items that I desire.", "rating": 3}, {"title": "Ruby Lane uses a convoluted system for…", "text": "Ruby Lane uses a convoluted system for payment. When trying to pay using a credit card (without PayPal) Ruby Lane still directs you to Pay Pal.  I tried following Ruby Lane's instructions, but it appears the transaction still ended up using PayPal/Visa.  Why can't Ruby Lane just provide clicking on either a PayPal icon or credit card icon.  Ruby Lane needs to simplify the payment method and perhaps use ebay as their model.", "rating": 3}, {"title": "I like it but after several years of…", "text": "I like it but after several years of selling and never was told that there was a complaint, you seemed to have someone on your team with a vendetta, and would not let me back in after I moved. Si I have lost respect for your management. Rude, and condescending management.", "rating": 3}, {"title": "Wish there was a way to pay that isn't PayPal", "text": "I was very excited about the items I was going to buy--but even with a credit card, it was going to go through PayPal and my experience using PayPal is really bad, so I cancelled the order, alas. I was sorry to do so--but every time I have had to use PayPal my credit card has been hacked. So no thanks you.", "rating": 3}, {"title": "Shipping way too high", "text": "Shipping way too high. I bought four pieces of flatware and the shipping from same vendor was over $50.00. I would have bought a fifth piece but the shipping was over $70.00. I've bought from Replacements and Ebay and the shipping is nowhere near this level.", "rating": 3}, {"title": "Good site with limitations", "text": "I generally like the products and variation of products on Ruby Lane. What I don't care for are all the added costs, like shipping and insurance etc. These are costs of doing business. It's especially disappointing during a 'sale' when you add in all the extras paying full price wouldn't be much different. I certainly have encountered some great sellers on Ruby Lane and I do feel safer buying here than at Ebay which I have been 100% turned off by due to scams and unscrupulous sellers.......", "rating": 3}, {"title": "Incorrect tax by Ruby Lane", "text": "In the process of checking out, I noticed a sales tax was added. Since the antique was being shipped to the US from the UK, I knew it was incorrect.  The seller told me Ruby Lane automatically adds the tax and she could do nothing about it.  I did not purchase the item.", "rating": 3}, {"title": "Postage cost", "text": "I’m quite sure many buyers would agree with me that Rubylane’s platform could be  better, something like eBay or Etsy where the postage fee can be established first and let known to buyers before they commit to the sale. Take me for example. The sale price of the coral cross pendant was acceptable but it slipped my mind about the postage cost that was yet to be established at that point but unfortunately I have already committed to buy. At US$32 for postage for a small pendant, honestly, I’d probably have second thoughts about this transaction.", "rating": 3}, {"title": "I collect “antique” dolls and related…", "text": "I collect “antique” dolls and related items. I find that I look at Ruby Lane much less than I did several months. Months ago, I checked “antique dolls “ daily and made considerable purchases. Now, there are much less antique dolls and related items. The category is more vintage and reproduction.  I would suggest that more stringent rules apply to what is considered and allowed in the antique doll category.", "rating": 3}, {"title": "I have two complaints", "text": "I have two complaints.  1) I am purchasing these items for a tax exempt organization, but there is no way to indicate or document this, so tax is applied automatically to my order (which my institution will not reimburse!); 2) the item descriptions disappeared immediately from Ruby Lane, before I had opportunity to copy this useful information.  Is there any way to retrieve this?", "rating": 3}, {"title": "Shop The World", "text": "Ruby Lane has been one of my favorite digital shopping sites for a number of years. A world-wide shopping venue that rewards me with rare items that I have wanted to fill-in, complete or build my jewelry collection. I have had positive experiences with each purchase. I am a very satisfied customer. I highly recommend all of the Ruby Lane sites and specialty shopping to  any person hoping to to find something special.", "rating": 3}, {"title": "I used to buy quite a few things from…", "text": "I used to buy quite a few things from Ruby Lane.  I have cut back drastically because the shipping has risen dramatically.  Usually far more than actual shipping.  Also the tax is never correct for my area.  It often adds ten dollars extra for the tiny miniatures I am interested in.  I used to rate them far higher but with these mistakes I feel higher ratings are unwarranted.", "rating": 3}, {"title": "I used to love it but lately they have…", "text": "I used to love it but lately they have other things in dolls, not dolls.  And put off some of best dealers, I have to go to other sites to get to best dealers.  Ruby lane went back and dealers signed something 20 yr ago and forgot about.", "rating": 3}, {"title": "Sellers should not block without courtesy", "text": "Repeat a notice to your sellers.... BE NICE!!  Nothing MORE rude that a seller unilaterally cancelling an order then blocking you.  Rubylane is judged by the nice and the bad.  Add some hard coding.  Whenever a seller clicks the BLOCK, do NOT allow until that seller has fully informed the buyer as to reasons and an opportunity for recourse.   Until then, their bad is your bad.", "rating": 3}, {"title": "Frustrated!!!", "text": "I keep trying to make a purchase.  Your website is not allowing me to do so.  I keep getting a message about verifying my email.   I have done this several times.   I have checked  my spam box and my email, and nothing from you.  I'm finding this site be be quite frustrating!  Can't even make a purchase!!!!!!!!!", "rating": 3}, {"title": "I do not like the fact that searches…", "text": "I do not like the fact that searches are not straight forward.  It is annoying to see the same item appear more than once in a search list, and particularly galling is that after you look at an item in a search and return to the list you are not only not returned to the place you left, but items in the search are rearranged.  This makes it virtually impossible to do a throuogh search.", "rating": 3}, {"title": "I love Ruby Lane but find it…", "text": "I love Ruby Lane but find it unfathomable that they dont accommodate businesses that buy for resale and insist that their shops collect tax even when presented with proof of resale purchase. Its really puts a damper on the process to have to have this discussion every time.  I cant be the only one.", "rating": 3}, {"title": "Items placed in Customer cart", "text": "When I went to pay for my items in my cart, two items where sold", "rating": 3}, {"title": "I am not sure how this is going to go", "text": "I am not sure how this is going to go. I purchased an item. A day later I did hear from the seller. They said they would ship the item today and give me a tracking number but I haven't heard from them again. Leaves me a little hesitant to buy more.Update:  Everything went amazing. Got the item in three days and it was thoughtfully gift wrapped.", "rating": 3}, {"title": "There were 227 pages of sale doll items…", "text": "There were 227 pages of sale doll items and it took a lot of time to view it. You couldn't stop because the items on the page shifted around and you couldn't put the exact page number you wanted without starting over and then the items you already looked at were all mixed on different pages.It was quite frustrating.", "rating": 3}, {"title": "Problems are in the software", "text": "Problems are in the software. Go to Neatcurios and ask for \"metal\". Margaret carries a ton of it, but the system will present only six or eight items. Why? If you do a wide search on Ruby for a given item, it won't give you all of it; just most of it. That's difficult when you're looking for a lost item. Also, increase the number of \"items viewed\" and \"shops viewed\". Otherwise, a delightful site.", "rating": 3}, {"title": "Quality of site changed", "text": "Since fee structure changed many dealers left or post on other sites mostly . QualityOf antiques generally lower and same for porcelain and pottery. It was a mistake to merge antiques with collectibles . Prices are inflated to cover increased costs and are less negotiable . I am a large buyer who bought exclusively in ruby lane . Now I buy more  on ebay and Etsy", "rating": 3}, {"title": "Unchecked racism", "text": "Unchecked racismYou have no way to flag offensive items for sale, so there's people on your site selling jewelry of actual racist caricatures that they mark as \"ethnic\" or don't even describe at all. You also don't check people's bonafides in describing their jewelry as \"Native American,\" when there's a law forbidding people from doing just that.", "rating": 3}, {"title": "I had no problem with the individual…", "text": "I had no problem with the individual vendor on my recent purchase.  Ruby Lane is a different story.  I get many error messages when attempting to load pages.  Items have been difficult to save to wish lists.  It's a shame that Ruby Lane can't keep up with the increase in traffic to their site.  I don't plan on visiting as often as I used to.  Shopping is supposed to be fun, not irritating.", "rating": 3}, {"title": "I haven't received my order yet so I…", "text": "I haven't received my order yet so I can't comment regarding that. I will say though that when trying to set up an account so that I could purchase it there were many hoops I had to jump through before finally being able to buy.", "rating": 3}, {"title": "Ruby Lane's website should be designed…", "text": "Ruby Lane's website should be designed ideally so one could discuss shipping charge with vendor BEFORE committing to the purchase. Today I wanted to purchase items in 3 separate carts. The first 2 carts seem to have proceeded well with those vendors, but the third vendor was charging an outrageous amount for shipping. I did NOT continue with the purchase of the 5 items in that cart.", "rating": 3}, {"title": "Platform difficulties", "text": "Hi. To my great despair I have been blocked by several great vendors. The circumstances Are because I have trouble navigating ur site. Specifically when it comes to finishing the PayPal part of order Some vendors immediately put it in to process. Some put it as an additional step. I was assuming it was processed by the vendors who blocked me. It was my not understanding ur platform. I find it distressing not to be able to apologize and explain myself. I realize that blocking is a survival tactic they use. It would at least be nice to have the ruby lane platform serve as a intermediary", "rating": 3}, {"title": "Quality of offerings is declining.", "text": "I’ve loved Ruby Lane for years, for great quality unique antique and vintage items. However, in the past few months, ‘vintage’ has begun to mean cheap items like drugstore costume jewelry, decor items from Hallmark and (gasp!) junk from Franklin Mint. While I used to enjoy my coffee examining the most recent offerings, I’m becoming less and less interested. I don’t want to look at $10 items I can find at lawn sales!  What has happened to you?", "rating": 3}, {"title": "Quality of items have gone down", "text": "I have very good experiences with dealers across the board so I would give 5 stars for thatHowever the quality of the offerings in the middle to high end is much lower in general than it’s used to be and many of the quality dealers are now showing on other sites .", "rating": 3}, {"title": "Great and not great", "text": "I have bought a couple of pieces, not expensive ones, and found the two sellers trustworthy and professional. What does concern me is that many sellers don't seem to have any idea about antiques and everything defaults to Art Deco. Most of it is not Art Deco or even that style in a reproduction. Check guarantees and if the seller has a return policy I would have any jewelry checked locally. There is some great jewelry and some reasonable prices but I would be careful of anything labeled antique", "rating": 3}, {"title": "Great stock, love to see more willing to Ship to Australia", "text": "Have follow Ruby Lane for awhile, love the photos and information, though sadly living in Australia, lots of vendors are anxious about the shipping I was glad I could actually purchase from a US vendor, by asking the question of that Vendor, who was very accommodating and updated her site to include Shipping to Australia.  Maybe there could be something that promotes or shows this in initial sale photos. Thks", "rating": 3}, {"title": "I love Ruby Lane and all things…but unhappy with shipping costs.", "text": "I love Ruby Lane and all things antiques. I would make many more purchases if shipping wasn’t so expensive. Maybe if you offered an option with a membership (yearly) for free shipping costs. I have so many options for free shipping, I rarely buy from anyone that charges to ship.", "rating": 3}, {"title": "Initial Logistical problem.", "text": "The service so far is good (but I have only just placed my first order). I've rated the site with only three stars because I had difficulty entering the name of the Province where I live and require delivery. The site was fairly insistent in only listing U. S. states until I put in the Postal Code, then it recognized the problem and began to provide for the name of a Province.I may have additional comments upon receipt of the purchase.", "rating": 3}, {"title": "The problem with RubyLane besides now…too many fees!", "text": "The problem with RubyLane besides now charging tax is that there are multiple added costs like shipping insurance and at point some crazy administrative fee. I totally stopped buying on RubyLane because of that until seeing that it disappeared. I messaged several dealers to tell them exactly why I had not gone through with a purchase.", "rating": 3}, {"title": "Premature", "text": "Ruby Lane requested a review after I purchased something but before it was received.  How can I fix the  level of excellence when I don't know what Ruby Lane would do if something went wrong with the sale and the seller wouldn't make it right? That is when the quality of an antiques website really shows. Regarding the purchase, it was easy to find what I wanted, easy to contact the seller, and easy to complete the purchase.  I suggest Ruby Lane change the timing of  the review request to  cover the whole process.  I would think that would be of interest, and I might have been able to give five stars.", "rating": 3}, {"title": "They don't often deliver to Canada and…", "text": "They don't often deliver to Canada and when they do, shipping can get any where between $14.00- $30.00 or more. Plus USD FEEs make shopping expensive. Wish they would branch out and open in Canada too. Beautiful quality products, just frustrating when you can't get a delivery to Canada.", "rating": 3}, {"title": "you have some great collectible items…", "text": "you have some great collectible items but,, the individual sellers need to ''REMOVE'' sold items when they are sold!i just went through trying to purchase an item to find out it was already sold....thats why i am giving 3 stars.. sellers need to pay attention to their site. thanks", "rating": 3}, {"title": "I do not have a PayPal account", "text": "I do not have a PayPal account, nor do I want one. Placing this order was confusing to me....I'm not finding fault with the vendor but I am annoyed by the multiple emails about this order to try get me to sign up for a PayPal account. One especially offensive was the email with an INVOICE to tell me to pay when in fact, my VISA account showed the debit before this particular email even arrived. Earlier this year, I bought a pendant from another vendor and don't remember the same thing happening as this did today.", "rating": 3}, {"title": "Request confirmation of purchase from seller.", "text": "It has been over 3 days and my purchase, which has been paid in full, has not been acknowledged by the seller whose shop is listed on Ruby Lane.  I paid for expedited shipping too, and would like to have a delivery timeframe as this is a birthday gift, not a Christmas gift. Overall Ruby Lane is a great platform and I use it often.", "rating": 3}, {"title": "I enjoyed shopping RubyLane, but am disappointed in my purchase", "text": "I enjoyed shopping on RubyLane. So many shops & beautiful options. The ring I purchased arrived quickly & securely. And looked even better than pictured online! I was very disappointed when less than a week later a diamond fell out. I have not reached out to the shop yet-not sure what they can even do. I like the ring; don’t want to send it back. It’s estate/vintage-things happen. But I do wonder if a jeweler checked it properly before it was offered for sale. I would still shop on RubyLane again & recommend it.", "rating": 3}, {"title": "complicated process,many steps involved", "text": "complicated process,many steps involvedi chose to pay by mastercard,the system defaulted to pay pal which i dont use,i cant seem to be able to change it to mastercardBilling address not same as shipping address,i cant seem to change it myself''", "rating": 3}, {"title": "Antique dealers should not be paying…", "text": "Antique dealers should not be paying tax when items are bought for resale. No provision appears to be made to get dealers tax i.d. numbers to facilitate this.It limits purchases on Ruby Lane.", "rating": 3}, {"title": "I really love the variety of items on Ruby Lane", "text": "I really love the variety of items on Ruby Lane. Prices are very reasonable on most items. I would’ve given five stars if the functionality of the website was easier to use. It’s very difficult to make or accept offers and it’s difficult to pay for items. I wish the site would’ve given the option to reject or accept offers instantly instead of handling business through a series of emails that turns into a waiting game.  The current set up of this site is too confusing & disappointing, especially for newbies.", "rating": 3}, {"title": "I would recommend using site off a…", "text": "I would recommend using site off a computer. It was my first time using the site and i was using a cellphone but it was laggy and froze as i was making an offer and it all of a sudden did a full price purchase. Got it fixed more by a gentleman seller but that wasnt cool.", "rating": 3}, {"title": "This is my first experience with Ruby…", "text": "This is my first experience with Ruby Lane and it was a bit confusing. I wanted to pay with my credit card, but you automatically charged my PayPal account, which I did NOT appreciate! And, you automatically charge for insurance?? I am not likely to shop from you again, but we will see.", "rating": 3}, {"title": "Feeling unfriendly Purchasing", "text": "I’m feeling unfriendly during purchasing an antique calling card case.1) when I enquiry is there any discount of this item with Politely.The feedback is 10%2) and then, I ask to send me a link for make payment. Until about 22:30 23 /12 is no reply.3) Lately, I make a full payment of an antique calling card case and ask seller when will be shipped out of the subject item , still no feedback until this moment.I’m afraid your company’s good image will be influenced.Actually, this is my second time for purchasing.(First time purchasing is very happy. The seller is kind , helpful and good service.)Merry Christmas and happy New Year", "rating": 3}, {"title": "Loved the product but beware", "text": "Loved the product but beware. They had a “sale” that knocked the price to half off, which was promptly added to shipping making it the same price as before. Charged $11something for a flat rate small box which costs $7something. I probably won’t order from here again sadly.", "rating": 3}, {"title": "I really like the miniature turtle", "text": "I really like the miniature turtle.  Even though I purchased it for 1/2 price, the outrageous cost of shipping such a small item upped the price to almost the original price.  I could mail that in a USPS small flat rate box for $8-9 maximum.", "rating": 3}, {"title": "Middle of the pack site", "text": "Have not shopped on Ruby Lane for many years of my experience this morning told me why. It was difficult signing up… Again, search was not intuitive, shipping was hard to find. Selection is not great insight navigation is awkward… All in all appears to be amateur hour.", "rating": 3}, {"title": "Sometimes these things happen", "text": "Sometimes, products are so artfully photographed that they look better in photos than in life.  Sometimes, items are priced without taking into account numerous holes (in lace, for example) and the vendor ignores inquiries about same.Sometimes, photos do not give a true sense of the size of the item.  Those photos with coins, rulers, items in held in the palm of the hand, etc. which allow us to get a true sense despite centimeter or inch measurements work well.Shipping expenses can be as more or more than inexpensive items, don't know if there's any fix for this other than having RubyLane or vendor pitch in.Thanks", "rating": 3}, {"title": "Shipping charges", "text": "To Whom It May Concern,I just ordered and sent an email to the copy concerning the high shipping cost.  My shipping rate was 50% of my purchase and I just feel that is very extreme.  I would appreciate a partial refund.Thank you for your attention to this matter.", "rating": 3}, {"title": "Still waiting and wondering", "text": "Hi, I made a purchase on the 15th of July, and outside of Ruby Lane emailing me payment confirmation, I have no idea of the shipping status, no tracking number, no communication from shop owner. I hope to see my US priority mail package soon.....", "rating": 3}, {"title": "Dollhouse-collecting Difficulties", "text": "I am happy that Ruby Lane offers a wide variety of antique dollhouse items to enrich my enjoyment of collecting them, but it is very frustrating that these items are rarely pictured with rulers.  As a result it is time-consuming to click on each picture to learn what scale an item is, and sometimes the size is never given at all.  Since there are hundreds of items on offer, I am sure that most customers, like myself, rarely have the time or patience to search the complete inventory for the desired scale.  Please consider requiring sellers to include a ruler in photos or size in the initial description.", "rating": 3}, {"title": "Have made many purchases from various…", "text": "Have made many purchases from various dealers on ruby lane. Always been pleased till last purchase. Been nearly a week and just heard that my item was shipped, but no tracking #. Guess ive been spoiled by the quick responses of previous dealers. Disappointing", "rating": 3}, {"title": "Losing Good Customers", "text": "While I think rl has some excellent sellers with high quality items, I find there are sellers who post maybe two or three pictures for an item when clearly many more are needed.  Is it arrogance on the part of the seller?  Do they think they have such a reputation that they need not post more?  Is it laziness?  I don’t know.  What I do know is that it is annoying to have to write and ask for more or better pictures.Fortunately, there are some sellers whose photo arrays and descriptions are in a class by themselves and it is to these sellers, I am drawn.  A pity that the sellers who skimp on their listings don’t realize they are missing out on possible good customers.As a whole, though, I find Ruby Lane a good place for shopping and buying.", "rating": 3}, {"title": "I have bought many antique dolls over…", "text": "I have bought many antique dolls over the years when there wasn’t a tax added. After RL started charging dealers high fees, it turned into high taxes for customers. I have been buying a lot less from Ruby Lane for that reason.", "rating": 3}, {"title": "I think you should put payment options…", "text": "I think you should put payment options before the checkout, not as you check out. Before the check-out there was only a pay pal logo, so I joined pay pal, not what I wished to do. Then I clicked on checkout and found there were other payment options.", "rating": 3}, {"title": "I had a great experience with my latest…", "text": "I had a great experience with my latest purchase.  The site worked well with no glitches and the seller was extremely prompt with replies to my questions.  I must say, however, that in general the quality of products on Ruby Lane is quite low.", "rating": 3}, {"title": "If you need  any help from Ruby Lane…", "text": "If you need  any help from Ruby Lane you be on your own. I had problem with a dealer saying after 5 weeks of not shipping an order. That she wasn’t paid. I gave invoice number had no help . Not happy with service regarding problems.", "rating": 3}, {"title": "I don’t like having to wait on total", "text": "I don’t like having to wait on total, waiting on vendor on when they might look at their online store? I can’t figure if I am buying or not??Guess I’ll look elsewhere too?Sandy", "rating": 3}, {"title": "Purchase and billing steps are very…", "text": "Purchase and billing steps are very confusing.  I have STILL to click the payment icon, because so far no complete total of costs has been given.  I will not continue with payment before I know how much the shipping charge will be.", "rating": 3}, {"title": "Not worth my time.", "text": "This site needs to have the option to pay at the time of purchase and get an order confirmation and shipment details in a timely manner thereafter. They need stricter deadlines for sellers to fulfill an order once it has been received. Finally, they need to NOT charge you $ until your item was shipped.  I was emailed an invoice leaving me to wonder if my purchase had been successful. I was then charged via PayPal for my item and left to wait around for a week wondering if/when my item would ship. I didn’t receive any confirmation or tracking info from the seller. I had to reach out to them to ask where my stuff was… Too much work on my part and too much anxiety to bother buying anything from this site ever again.", "rating": 3}, {"title": "The advertisement did not say that some…", "text": "The advertisement did not say that some of the clothes had tears and holes. Also, the clothes smelled musty, like a basement. The clothes should have been  handwashed before sending.", "rating": 3}, {"title": "I get confused during check out", "text": "I get confused during check out. Did not let me check out all 4 of items I wanted. Only 1 at a time. Don't know where the 4th item is.  Don't want on pay pal.  Want to put on my other credit card.Too confusing.  Judy Gindle", "rating": 3}, {"title": "I am a long time customer of Ruby Lane.  Assistance needed.", "text": "I am a long time customer of Ruby Lane, and love the website.Using your sale this week, I purchased a small bronze statue, and requested shipping to my son, Michael Stratta, 2959 N Troy St. Chicago, 60618.However the receipt today shows shipping address to me in Vincennes, Ind.I have reached out to the seller for verification, but already have a tracking number, 9405828206335382891028.  I would like to know what happened to the shipping address I added, and if I have made an error.I am hoping the shipment can be redirected.This is the only time I have had issues in over ten years of shopping.Thank you for anything you can do to assist.Liz Thomas", "rating": 3}, {"title": "Ring is just as pictured", "text": "Ring is just as pictured.  Dealer insisted on a 'no return' policy which seemed to go against Ruby Lane posted policy, but I took a chance and am not disappointed.  It seemed like a risk however.", "rating": 3}, {"title": "Difficult Check-Out", "text": "I found it more difficult than it needed to be to check out the purchase I made.  It made me re-think even making the purchase.  If I want to make a purchase with a credit card I do not want to go thru PayPal!!!!!", "rating": 3}, {"title": "Hi Team,contacting the seller is a bit difficult", "text": "Hi Team,I have contacted galerie Amour several times by Email several times and called more than 5 times no answer and no responce at all can you guys assist ASAPi put in an offer and waiting for a response please assist", "rating": 3}, {"title": "I love the items on Rubylane but some…", "text": "I love the items on Rubylane but some sellers are rude.  They post items for the red tag sale and remove them.  Rubylane allows people to block us for no reason.  This detracts from the experience.", "rating": 3}, {"title": "Excellent informative website", "text": "Excellent informative websiteHad trouble getting my Master Card to go through", "rating": 3}, {"title": "I made a purchase on my credit card and…", "text": "I made a purchase on my credit card and it does not appear to be completed. I need confirmation.I'm not sure if I purchased it.Transaction and purchase was cumbersome. This needs to be streamlined.", "rating": 3}, {"title": "I found the payment method somewhat…", "text": "I found the payment method somewhat cumbersome. In addition, while the seller made an effort to package the item well, because the corners were not protected the mounted poster arrived damaged.", "rating": 3}, {"title": "Why when you purchase 2 items from the…", "text": "Why when you purchase 2 items from the same shop you have to pay separately?", "rating": 3}, {"title": "It used to be better when you could…", "text": "It used to be better when you could order and pay all in one step. the new way of ordering and then paying the next day is very cumbersome!!! I don\"t like it!! Derald Gingerich", "rating": 3}, {"title": "Your site is simple and functional to…", "text": "Your site is simple and functional to utilize and your customers' administrations are exceptionally quick and powerful. In any case, I am not happy with you as a result of your low-speed site stacking page.", "rating": 3}, {"title": "I love RL as they have great items", "text": "I love RL as they have great items, but they are priced way over the top. I can find items in antique stores for less. Shipping and handling plus taxes are astronomical.Kim", "rating": 3}, {"title": "Please update your system!!", "text": "I buy and sell on Ruby Lane.  There are many things I like about Ruby Lane, and many things I don't.  First off, your whole presentation  for buying  and selling is antiquated.  As a seller I loose buyers because they cannot navigate your system.  As a seller, I myself find it hard to correct things, change details, update listings, etc., the list goes on.  I have buyers tell me that RL's system is not user friendly.  There is just not a smooth flow from one item to the next.  Your processed imaging is ridiculous!  Taking a day to get an item listed is terrible!  And, I don't understand why all of my photos look so fuzzy once uploaded to RL.  They don't on other sites.  Please consider a new program!", "rating": 3}, {"title": "Too much low end junk", "text": "Too much low end junk. When you are searching for an antique it needs to be at least 100 years old- not mixed in with a bunch of junky collectibles.", "rating": 3}, {"title": "I do wish postal updates were sent once merchandise has shipped.", "text": "I do wish, as a buyer, auto postal info was given. I never know when or if it has shipped. As there is usually quite a long wait on receiving purchase, updates would be sensible to add to your set-up.", "rating": 3}, {"title": "Individual sellers are pretty good, But", "text": "Individual sellers are pretty good to deal with but have increased their price points due to the fees ruby lane is now charging. The fees are passed onto us under “taxes”.", "rating": 3}, {"title": "I have always given Ruby Lane a 5 plus…", "text": "I have always given Ruby Lane a 5 plus stars. However I was buying a lots from one seller she was so nice and sweet,I could not say anything bad. Then she said I could join she in sell on her site just give her 10% of sale. That was good for me, Now my thing are not selling so she requested $50.00 for shipping,she could have sent my thins back. Now she is keeping my items and the $50.00. Some thing I bought from her was out of your Ruby Lane chick or Pal Pal. The thing is the three necklace's,  pr. earrings and money do add up to a real some, But the thing that get to me is that someone sells on you site is so dishonest and would do anything for a 5 star feed back, but pull the scam when she though I had no money to buy from her any more.", "rating": 3}, {"title": "Frustrated with both PayPal and Ruby…", "text": "Frustrated with both PayPal and Ruby Lane’s password rejections.  It seems as though they want you to reset the password every time it is to be utilized.", "rating": 3}, {"title": "I don't like that I had an outstanding…", "text": "I don't like that I had an outstanding invoice rather than just leaving it in my cart until I could get my PayPal to work.  It was like no way out.  I wish that you would remove sold items.", "rating": 3}, {"title": "The posting.for shipping was 3.00", "text": "The posting.for shipping was 3.00. At check out it had changed. I am waiting on a response from the seller before completing the purchase. Thank you Alice", "rating": 3}, {"title": "The shops and items offered for sale…", "text": "The shops and items offered for sale are great. The payment process is terrible. It is not at all clear that you have paid for an item even though you have completed the transaction.", "rating": 3}, {"title": "said there was a 20% discount if bought…", "text": "said there was a 20% discount if bought in August but it wasn't given. I don't want anything to do with Pay Pal.", "rating": 3}, {"title": "The selection is amazing but the search…", "text": "The selection is amazing but the search by word does not work so good so you need to be creative naming what you look for in different ways.Other than that was smooth transaction", "rating": 3}, {"title": "Too soon to give a meaningful review…", "text": "Too soon to give a meaningful review since I am still waiting on email to make payment.  I am a bit confused why payment is an issue.  Otherwise I am sure I will be very pleased!!", "rating": 3}, {"title": "I am being told that I have not…", "text": "I am being told that I have not accepted cookies, but I have... I am thereby not being allowed to log in and check my order.", "rating": 3}, {"title": "The site looks great", "text": "The site looks great! The sellers are great! However, the ease of payment is confusing and not well integrated in my opinion compared to other platforms.", "rating": 3}, {"title": "One problem", "text": "I did like the sale for today for an expensive piece of Bent Knudsen; however, right now I am stuck with your email about completing my payment, which is not easy to complete, for whatever reason. Patricia Timbrook", "rating": 3}, {"title": "I would call your site Ebay Jr", "text": "I would call your site Ebay Jr. for the high shipping costs and forced insurance on shipping. How much are you taking from your sellers!!", "rating": 3}, {"title": "Quite different from eBay and etzy", "text": "Quite different from eBay and etzy. I just made a purchase totalling over $70 and I have no idea who the seller is. Makes me a little uncomfortable.", "rating": 3}, {"title": "First Experience", "text": "This is my first time shopping with Ruby Lane.  So, my review is in the middle, bad nor good.  Hope to have more experiences in the future!", "rating": 3}, {"title": "You should not require Pay Pal", "text": "Date of experience: November 07, 2022", "rating": 3}, {"title": "Status of Question", "text": "I sent a question to Seller of an Item I bought.  On my account there is no indication that the question was sent or received.", "rating": 3}, {"title": "Everything went smoothly until…", "text": "Everything went smoothly until CHECKOUT. I couldn't tell if my payment went through or not.  I didn't receive any confirmation.", "rating": 3}, {"title": "I love the site but check out is always difficult", "text": "I love the site but check out is always troublesome, difficult to use a credit card, always defaults to PayPal.", "rating": 3}, {"title": "Your make an offer procedure is very…", "text": "Your make an offer procedure is very poor.I didn’t get the price I wanted to pay.I overpaid and didn’t know it until the process was over.", "rating": 3}, {"title": "The web site was difficult to check out…", "text": "The web site was difficult to check out from. It kept putting obsolete and incorrect information into the order. Aa real pain in the ass!", "rating": 3}, {"title": "The products are fantastic", "text": "The products are fantastic.  My payment isn't going through for some reason.  Need to have options other than just PayPal.", "rating": 3}, {"title": "This is my first time ordering and…", "text": "This is my first time ordering and using your site so I had a few hiccups, maybe my lack of experience caused my issues.Thank you.", "rating": 3}, {"title": "Guest Checkout", "text": "I just bought something, I haven't received yet. The only thing I can say is, please have guest checkout, available!", "rating": 3}, {"title": "Mostly avoid Ruby Lane as it tends to…", "text": "Mostly avoid Ruby Lane as it tends to be a lot of garage sale stuff at antique show prices, but it's OK for some stuff", "rating": 3}, {"title": "The seller was fine", "text": "The seller was fine, smooth transaction. However, Ruby Lanes website is very frustrating, because it’s so incredibly slow.", "rating": 3}, {"title": "Love My Purchase, But High Sales Tax", "text": "I thought the sales tax added to my purchase was a bit high, almost 12 percent. Texas is usually 8.25", "rating": 3}, {"title": "I am trying to pay for the purchase and…", "text": "I am trying to pay for the purchase and I have been unable too!Help me out with this.Thanks,Barbara Mccormick", "rating": 3}, {"title": "Love the look of the item purchased won’t use site again", "text": "Love the look of the item purchased so sad to have to use PayPal.  Won’t purchase again from this site.", "rating": 3}, {"title": "I’m not understanding how to accept a…", "text": "I’m not understanding how to accept a counter offer?  This is confusing...sorry other than that I like the site", "rating": 3}, {"title": "I don't like the checkout process..", "text": "I don't like the checkout process... it keeps pushing the customer to PayPal... I do not like PayPal!", "rating": 3}, {"title": "Wish you could make one payment & Ruby…", "text": "Wish you could make one payment & Ruby Lane send payments to it's sellers", "rating": 3}, {"title": "Very easy to purchase", "text": "Very easy to purchase; I'll know more when it arrives.", "rating": 3}, {"title": "Very nice webbsite but it can be…", "text": "Very nice webbsite but it can be better. It could be easier to find what you search for.", "rating": 3}, {"title": "Difficulty signing in/creating an…", "text": "Difficulty signing in/creating an account. Took forever as a previous customer who forgot ID #", "rating": 3}, {"title": "too much hassle to order and pay", "text": "too much hassle to order and pay. should have guest option.  dont like paypal", "rating": 3}, {"title": "A little confusing about Paypal…", "text": "A little confusing about Paypal interference.", "rating": 3}, {"title": "Having big problem with getting my shop…", "text": "Having big problem with getting my shop to reopen, not sure how it got closed.", "rating": 3}, {"title": "Web site was hard to navigate,I had to…", "text": "Web site was hard to navigate,I had to call vender to make offer and but  item.", "rating": 3}, {"title": "There are lots of fake Native American…", "text": "There are lots of fake Native American items so have to be very careful.", "rating": 3}, {"title": "The option to pay", "text": "The option to pay, was not an option for me. I do not use Paypal.", "rating": 3}, {"title": "Sculpture arrived dusty", "text": "Sculpture arrived dusty, dirty, unpolished. Disappointing.", "rating": 3}, {"title": "Your prices are too high", "text": "Your prices are too high! I always try to buy from eBay instead.", "rating": 3}, {"title": "Not to good can not paid for this I keep on looking to pId.", "text": "Look I can not find out how to paid for this how can I paid", "rating": 3}, {"title": "I’m unable to pay for my purchase", "text": "I’m unable to pay for my purchase. Why ???", "rating": 3}, {"title": "Shipping cost is ridiculous  Keeps…", "text": "Shipping cost is ridiculous  Keeps people from buyiing", "rating": 3}, {"title": "shipping", "text": "shipping, taxes, and insurance sure adds to the cost", "rating": 3}, {"title": "Much chunkier to navigate than EBay and…", "text": "Much chunkier to navigate than EBay and Etsy.", "rating": 3}, {"title": "It was difficult to set up a new…", "text": "It was difficult to set up a new account.", "rating": 3}, {"title": "Shipping is way too much", "text": "Date of experience: December 27, 2020", "rating": 3}, {"title": "Not user friendly…", "text": "Date of experience: September 13, 2021", "rating": 3}, {"title": "Many suggestions of improvement", "text": "Many suggestions of improvement- would like sort ability on price (highest to lowest), and those newly listed- seems to have so much on dolls... not for me. Blog is only dolls.  UGH!- prices aren't as competitive as Ebay.  But not as bad at Etsy.  Etsy is awfully expensive!- tracking items regarding shipping is not easy... fix!- messages should be a separate grouping, not buried with orders- LOVE Picclick!   You should team up with them.  Now that is searching!!", "rating": 3}, {"title": "Still think the wish list portion of…", "text": "Still think the wish list portion of this site is pretty bad.  Don't like that the tax and shipping always overcharges.  And the combination Antiques and Collectibles is very cumbersome.", "rating": 3}, {"title": "The only reason", "text": "The only reason the review is not higher is the difficulty in payment, they do not give standard credit card option, only paypal which I don't use. The payment method could be easier, much more helpful to a standard shopper. Otherwise, very impressive and attractive site.", "rating": 3}, {"title": "Their computer program is not up to…", "text": "Their computer program is not up to snuff, especially on the search detail.", "rating": 3}, {"title": "Prices are much higher now.", "text": "Date of experience: October 26, 2020", "rating": 3}, {"title": "On the whole I have been pleased with…", "text": "On the whole I have been pleased with the site, however, I wish  Rubylane would  be more involved in a 100% satisfaction guarantee on their website between the seller and the buyer.  If a buyer is unhappy with a seller, then the buyer is left out to dry and on their own.  Rubylane is nowhere to be found.", "rating": 3}, {"title": "First time user", "text": "First time user, and don’t know what I’ve gotten into. I’ve selected an item, registered my name and address, chose payment method, but your site says I have to wait for a call from someone to give payment. If this gets any stranger I’m backing out.", "rating": 3}, {"title": "Incomplete order difficult to complete.…", "text": "One of the orders did not take my credit card directly.  It sent me to your website under my account for open purchase which I could not find.  So I have not yet consumated that order although I did send an email to the party and also telephoned them and left a message.", "rating": 3}, {"title": "Not satisfied with customer service", "text": "I made a bracelet purchase during the Red Tag 50% off sale. Weeks went by, and no activity. It hadn't been shipped. I tried emailing the shop owner, twice, without success. I contacted RL, was told I needed to contact PayPal. I did, but just prior to doing that, I tried once more to contact the shop owner. The site said, \"shop is in preview, and unavailable at this time\". I then let RL know I had contacted PayPal. After review, and several more emails, my money was restored, even though I would have preferred receiving the bracelet. I feel RL could have been more supportive of my efforts. What does \"in preview\" mean?  Was RL able to contact the shop owner?  Was there a good, honest explanation for why this transaction wasn't completed?  I feel RL should have followed up with me on this as good customer service policy. I spent a lot of time writing emails back and forth and wasn't offered either an explanation or an apology.", "rating": 3}, {"title": "Good quality..", "text": "Date of experience: October 04, 2020", "rating": 3}, {"title": "I say average because the package came to me and not to the shipping address!", "text": "I say average because the package, a wedding present, was delivered to me even though the email receipt & tracking information show that I had a different shipping address, the address where I wanted the package to go.  I love the ease of browsing on Ruby Lane and the products are excellent, but at some part in the process, my order was mis-routed.", "rating": 3}, {"title": "Difficult to us website", "text": "Difficult to us website. Never was able to find what I was looking for, even though I found it last night.  Then when I tried to order something else from Ruby Lane website, I got tangled up in passwords.  I came extremely close to saying “forget it “", "rating": 3}, {"title": "The locket I received was not exactly…", "text": "The locket I received was not exactly as described.  There is a small dent to it and some of the etching has faded away.  There are also some scratches and overall around the engraving which makes it difficult to see the entire name.  I'm disappointed.", "rating": 3}, {"title": "Email address issues", "text": "There is an issue with the Ruby Lane website and my email address, although eventually I was able to place my order with Paypal.  Kindly look into this . . .", "rating": 3}, {"title": "I found trying to purchase quite…frustrating", "text": "I found trying to purchase quite difficult. I was asked for my email and password but when I tried to hit the sign up nothing happened. I had to then try signing up even though I was not a member. That, naturally did not work. So I tried again to sign up, but again the sign up button wasn’t working. I went through this process three times before I got a sign up form. Since I really wanted the item I finally was able to buy it but it was a frustrating experience and would have disgusted another would-be buyer I think.", "rating": 3}, {"title": "I had trouble changing my ship to…", "text": "I had trouble changing my ship to address.  I finally gave up and just had the package sent to my bill to address.", "rating": 3}, {"title": "When they keep rejecting my email…", "text": "When they keep rejecting my email address.  I don't know what to do.  It kept me from the 50% off sale. Also battled me today.  Seems to be working now.", "rating": 3}, {"title": "Need to make some changes", "text": "Had difficulty changing billing address and never got email to change password even though I get all emails from Ruby Lane ridiculous!!", "rating": 3}, {"title": "Your web site is not user friendly", "text": "Your web site is not user friendly.  Ruby lane does offer wonderfully items.  Please insist that sellers who offer layaway will allow it when you buy.  The same seller advertised layaway but refused to allow it twice.  #1 excuse: $395.00 item not expensive enough to put on layaway (no mention of minimum in listing). #2 excuse : layaway not worth  the time   I spoke to this seller by telephone so you probably don't have a record of our discussion. I have used layaway dozens of times and have never failed to honor them.  I offered names for references but it made no difference with this seller.  If is embarrassing to have a seller refuse layaway when she has offered it in her listing. The feelings of a customer should be important to a seller and Rubylane.  I emphasize that her refusal cannot have been to my buying history as I have a perfect layaway history.", "rating": 3}, {"title": "Excessive Shipping", "text": "The doll clothes lot I bought have a mildew/old/antique store type odor that was not described by the seller. But, My big issue is that I was charged 36% more than the actual shipping cost.I had to Pay for USPS Priority Flat Rate Service, which the seller didn't even utilize. She shipped in a regular USPS Box. She charged me $15.50, actual cost was $9.90.Myself an online seller for 19 years, shipping is always the big elephant in the room. I would have expected the seller to honestly return some of the Excessive Shipping Fees on her own. She did not. Shipping fees are for shipping the item. Not for the seller to recap their seller fees. This practice is frowned upon on the sites I sell on. I don't know that Ruby Lane monitors Excessive Shipping, but I am calling it to Your Attention.", "rating": 3}, {"title": "PROBLEM SIGNING IN", "text": "Hello, I had a problem signing in to purchase an item this evening. Ruby Lane now does not recognize my primary e-mail address, which was accepted in the past but today was rejected. To purchase an item, I had to use my secondary e-mail address. How can that problem be corrected so that my primary e-mail address is reinstated? With thanks, Jane", "rating": 3}, {"title": "Glitch ➡️ Disappointment", "text": "Very disappointed in this past sale. I had spent a few days choosing some items from trusted sellers I had purchased from in the past. I put them in carts, waited until the day of the sale, set my alarm and went to purchase those items I wanted. First I got an error message (broken gateway), then I was able to purchase. I did not pay for them as I noticed shipping wasn’t combined and I wanted to ask the seller to alter my invoice. Somehow, one of my items was purchased from under me even though I had already checked out with it. Extremely disappointed! Had worked hard to find what I wanted.", "rating": 3}, {"title": "Good variety, bad website infrastructure", "text": "Lots of variety on the site, but the site is very slow, and the infrastructure isn't in place to handle sale events - I had the site go down multiple times while trying to purchase items during the latest tag sale.", "rating": 3}, {"title": "Need diversity training", "text": "I searched for African American art, and a piece with a bunch of monkeys was in the search result. No bueno. The company needs some internal audits and diversity training.", "rating": 3}, {"title": "Be careful when paying for orders so you don’t lock the purchase", "text": "The problem was mine. I put something in my cart, went to the cart to pay, selected PayPal, logged into same. All fine to that point. Then accidentally hit cancel. Oops! Returned to cart to begin process again. RubyLane had removed it from my cart. Tried to buy again, cannot do, “item is in someone’s cart” and unavailable. Ergo no sane way to pay for it until I went to My Account” and saw an invoice for same. Was able to connect with PayPal from there. A bit confusing until I got it figured out. Your system “removed” a cancelled item from my cart but did not but did not release it from “someone’s” cart—making me locked out of buying something that was invisible but still in my cart. It essence it made me into 2 separate individuals. Your site is terrific, I love it, but one must be careful!", "rating": 3}, {"title": "It was very difficult for me to use…", "text": "It was very difficult for me to use your system. I was never able to e-mail you for help or communicate with the seller (still can't). A message kept showing up that you sent an e-mail to my address and it was returned to you as undelivered. That message is still showing up - and I still can't e-mail you or the seller. I called your San Fran help number and got a message that no one was there to help. Three stars is the best I can do.  Hope that changes because I have my eye on other things.", "rating": 3}, {"title": "Confusing communications", "text": "Confusing communications - paid with PayPal, had a confirmation from PayPal, yet their site said I needed to complete the transaction.", "rating": 3}, {"title": "For the most part", "text": "For the most part, everything is too pricey as compared to similar or same items on eBay,Etsy, etc  Inflated prices include the items for sale, postage, and sometimes no choice of whether or not to buy insurance.  Is RL charging vendors too much that gets passed along to buyers?    Also, site can be a time-waster: for example, putting item in wish list takes three or four steps,  checkout is not easy to navigate. And recent changes to search pages leaves customer with no way, that I could find, to access detailed info on size, materials used, etc until one puts item in wish list first and then backtracks to retrieve wanted info.  And it nearly always takes longer to receive an order in the mail from RL than from eBay and sometimes Etsy.", "rating": 3}, {"title": "Great items", "text": "Great items, website is hard to navigate.  I searched a keyword, but the item wouldn't show up in results.  The keyword clearly shows up in other pages with similar items.  I guess its the search that's the problem.", "rating": 3}, {"title": "Shipping was way TOO high!", "text": "Shipping is way TOO high, it makes your awesome prices not worth it in the end!  Don't think I'll be doing much shopping here.  Really have to check my options against your added shipping and insurance!  You do have a very nice webpage and selection. It was an interesting experience and I did purchase two items...thank you.", "rating": 3}, {"title": "I had trouble with the site", "text": "I had trouble with the site, but it was better a couple hours later. I was shopping the UFDC event site, and it seems that in my first session, half the dealers were not there. I'm glad I gave it a second try.I get regular emails from Ruby Lane and I feel that it is normally smooth sailing.", "rating": 3}, {"title": "I find their site to be a little…", "text": "I find their site to be a little confusing. I want to look something up & see that item. Instead I see different items and not the ones I want. It could be so much more user friendly.", "rating": 3}, {"title": "Very round about procedures to pay…", "text": "Very round about procedures to pay using Paypal.", "rating": 3}, {"title": "Make it easier to order", "text": "It is somewhat difficult to order from this site.", "rating": 3}, {"title": "Poor customer service", "text": "Placed an order and I was unable to complete the payment portion of the order. It too many tries to get a response from the shop owner. She didn’t seem to really understand the problem. I finally canceled the order.", "rating": 3}, {"title": "This is a difficult website to use", "text": "This is a difficult website to use.  Drop down menus don't list all options ie \"register\".", "rating": 3}, {"title": "Frustrated a seler does not honor the…Frustrated.", "text": "Frustrated a seler does not honor the stated time payment is due on a sale pendingitrmor respond tomy emails. I want a doll but as days pass,I can spend my money elsewhere onanotherdolli wantalthough I am eeay sndworry abot angering the seller with my repeated emails andafraid to call and will do since I try to buy the doll I want.  And, an answer-if this doll can be bought by-mePlease help me to getananswer and relieve my misery of trying to buy a doll I truly want.", "rating": 3}, {"title": "I'm old..", "text": "I'm old... patience is thin... I tried several times to change my password and the link provided (3 times) didn't work. For over 20 minutes I tried different things and frustratingly failed. Finally I realized my \"nickname\" was my email address and not my username and was able to change it on the Rubylane site. This was a very bad shopping experience. I need a nap after this one.", "rating": 3}, {"title": "Making offers", "text": "Making offers was very confusing.  Streamline it like eBay", "rating": 3}, {"title": "There were no instructions to inform me…", "text": "There were no instructions to inform me how this \"Internet Antiques Show\"was going to work.  I made an offer but got no response so I circled back to outright buy the item.  I had no idea when I would get a response.  You still do not have a way of dealing with sales tax.  I have resale certificates in New York State and Maryland, from where I purchased the item.  The issue with the sales tax has been a thorn in my side since the beginning of the internet sales tax regulation.  Other multi dealer sites have managed to deal with it.  I can't understand why you have not made an effort.  You are losing my business.", "rating": 3}, {"title": "Many of their dolls and accessories are…", "text": "Many of their dolls and accessories are beautiful and the prices seem reasonable. However it seems that I do not get notification that there are new items until much later after they have been posted . At that point everything has been bought. I would like to know how some  people are able to see their new items before others? It is rather disappointing!", "rating": 3}, {"title": "Great merchandise and well priced but…", "text": "Great merchandise and well priced but ordering is kludgey and it forces you to use Paypal for processing even if you use a credit card which adds extra costs and makes the transaction harder and slower. 5 stars for the merchandise and the very responsive seller who was lovely to deal with, but 3 stars for the site's ecommerce capabilities.", "rating": 3}, {"title": "shipping info", "text": "I don’t like not being able to find shipping info on purchases. I never know when or if an item has posted. If info is there it sure isn’t easy to find.", "rating": 3}, {"title": "Participating in the Barn Star/Ruby…", "text": "Participating in the Barn Star/Ruby Lane on-line sale and you guys are NOT making it easy. The website is cumbersome to navigate, making an offer required 6 extra steps. If you are going to do this, it really needs to be simplified", "rating": 3}, {"title": "Be prepared for obscenely high shipping charges.", "text": "Everything was fine until I went to pay for my order—I was charged OVER $30 shipping for 7 decks of playing cards! That’s just obscene. Insurance coverage on those cards would’ve been over $12 more, too.", "rating": 3}, {"title": "Adequate but not nimble", "text": "Adequate but not nimble. Unable to adjust tax charges for an exempt buyer", "rating": 3}, {"title": "Still waiting for my purchase after 30…", "text": "Still waiting for my purchase after 30 days. I understand about the covid 19 ..but still 30 + days is a very long time to wait after purchasing somthing .I have purchased other things in the past from Ruby Lane . With  great resualts and hope to again in the future", "rating": 3}, {"title": "I did not make a purchase", "text": "I did not make a purchase, I only put in an offer. This is review is premature.", "rating": 3}, {"title": "Shipping and insurance costs too high", "text": "The shipping and insurance costs are out of market.  They are too expensive and do not compare favourably to other webistes. In any counter offer you should also be able to counter offer on the price of shipping and insurance costs as these are more than double some other competitor webistes.  Are these a profit centre for Ruby Lane?", "rating": 3}, {"title": "website is confusing…", "text": "I found it hard to sign onto the website.  This was my first time using this website.  I was expecting to pay for my order when I placed it but then found my email that said I would be contacted by the seller before payment can be made.  This was confusing since nothing was mentioned anywhere.", "rating": 3}, {"title": "Very narrow reach", "text": "Very narrow reach. Very few purchases via Ruby. Most via 1stdibs. There is a technical issue on Ruby's part that exists nowhere else. I am constantly told that my email address, gloriousity@optonline is rejected and an email sent comes back. This is my working email address. My problem is only on Ruby.I get all email otherwise. Ruby corrects the issue and it returns constantly. Gloria Karp. Glorious Antique Jewelry", "rating": 3}, {"title": "When sellers needed to charge state…", "text": "When sellers needed to charge state tax, the rates were not accurate.  I asked the seller why they were overcharging, and they advised that it is the state tax PLUS A HANDLING CHARGE that Ruby Lane added.  Some sellers refund those overcharges or ship free to keep buyers satisfied.  It would be more equitable to just charge the correct tax amount or have the sellers make those tax charge amounts on their own.", "rating": 3}, {"title": "I don't usually shop Ruby Lane as They…", "text": "I don't usually shop Ruby Lane as They have a poor selection of the things I like and when I do find an item I want the prices are exceptionally high, much like antique store pricing before the internet when they controlled the market.  The pricing is unrealistic but every now and then something slips through the cracks or they are having a big sale.  Then I can afford something.", "rating": 3}, {"title": "The prices are fine but the shipping…", "text": "The prices are fine but the shipping and insurance is high. I ship all the time I know what it should be. Therefore I only ended up buying one of the four items I had selected to purchase.", "rating": 3}, {"title": "Duplicate sale listings?", "text": "When you have your sales, I like to see every piece of sale jewelry.  There seems to be quite a bit of duplication of pieces.  The present sale has 55 pages.  I notice quite a few pieces are shown twice, and even three times.  Is that a sales tactic, or mistake?  I feel the less pages to go through, the more time I can spend on each one.  I usually end up taking till 4 A.M. the day of the sale to finish shopping.  I always end up buying, but I hate wasting time on duplicate listings.                                                                       Diane Prinz", "rating": 3}, {"title": "I used to love Rubylane but now the…", "text": "I used to love Rubylane but now the prices have become very high. I hear it is because there was a new fee tacked onto the dealers there. This was after they tried to get Buyers to pay a fee and it did not go away very well. I still browse but with the high prices and the addition of sales tax I won’t be buying much now.", "rating": 3}, {"title": "Item descriptions are inadequate", "text": "Item descriptions are inadequate.  A seller might list a drop earring, but not provide the dimensions.  In this example, the length of the drop.I no longer message a seller whose description is lacking.", "rating": 3}, {"title": "anything good for sale is beyond retail…", "text": "anything good for sale is beyond retail prices so it's waste of time buying here!", "rating": 3}, {"title": "Where is the registration link on your home page?", "text": "I found it difficult to register and could not find a link for registration on the home page.  Even when I googled it, I was taken to a registration area to registrar as a seller (shop).  I almost gave up.", "rating": 3}, {"title": "Not your fault", "text": "Not your fault, but HATE  the shipping charges.", "rating": 3}, {"title": "Web site is difficult to user", "text": "Web site is difficult to user.  There is no really easy way to navigate when you are setting up a new account.", "rating": 3}, {"title": "Its really hard to rate", "text": "Its really hard to rate. This was my first experience and I found your purchase procedure is a little confusing.", "rating": 3}, {"title": "You make it difficult to use your site…", "text": "You make it difficult to use your site easily.  I made a purchase and you charged me tax.  I have a tax/resale number and I want my money refunded!!  I would not want to be a seller and being a buyer was complicated.", "rating": 3}, {"title": "Most sellers are excellent. Ruby Lane is iffy.", "text": "Most sellers are wonderful but Ruby Lane company has a lot to be desired. They really march to their own drummer and as a buyer they are near useless. Rules change as to their preferences and they don’t protect the buyer what so ever. So you need to really trust your seller to be protected. Sellers do leave and I’ve been burnt out of 500.00 so buyer beware.", "rating": 3}, {"title": "From a buyer & seller’s view", "text": "From a buyer’s perspective, the process is relatively clean although I am unhappy with the additional taxes/fees that are being placed on my purchases. In all honesty as a seller I’m completely disappointed in the stance that Ruby Lane has taken with charging small businesses across the board fees and taxes. This is only applicable from a tax perspective if a seller is selling an excess of $100,000 per year on the site. Also, our margins are extremely tight. To charge a 6.7% across-the-board is unacceptable. If a $1400 Item cost a seller$1000, the margin after monthly fees and listing costs is less than $400. Then you take 6.7% $93.80 leaves a seller with very low returns. In actuality you’re  consuming up to 25% of a sellers profit. Furthermore, requiring access to our PayPal accounts is extraordinarily uncomfortable. Your platform has become extremely controlling. It’s not the warm wonderful place it started out to be.", "rating": 3}, {"title": "We Love the Art Deco Lamp !", "text": "First, to clarify; because we were able to complete the purchase of the lovely art deco lamp we'd give you a 10 on that count and for being there. For the purchase for newcomers though it was difficult. The web site lacks an intuitive path for knowing you must create an account before being able to attempt signing in and  to make a purchase. After many tries the help button became necessary to move ahead but that worked well.Thanks for being there and all the fun items in your store !Robert", "rating": 3}, {"title": "Have way too much trouble getting in to…", "text": "Have way too much trouble getting in to make payment.  Most always states my password is incorrect and after several tries it will accept it.", "rating": 3}, {"title": "The RL fees are now making prices…", "text": "The RL fees are now making prices prohibitive because vendors increase price to cover. I am buying less. Also I don't like the combination of antiques and collectibles. Some dealers or comparable ones are available on other sites.. Fewer things are being sold. No longer the premiere site it was. Used to be five star", "rating": 3}, {"title": "I found the payment part kind of…", "text": "I found the payment part kind of squirrelly. Pulling the money before knowing the sellers response made me nervous. The whole “ offer” thing would definitely keep me from listing stuff at ruby Lane.", "rating": 3}, {"title": "Not sure what happened to Ruby Lane", "text": "Not sure what happened to Ruby Lane. So few listings these days. Some of my favorite sellers are no longer on the site. Too bad.", "rating": 3}, {"title": "Credit card payment would be nice.", "text": "Payment option is Paypal or money order. My iPad for some reason won’t allow me to do Paypal so trying with money order and have never done that so a bit frustrating. Would appreciate if we could use a credit card. Otherwise everything is good. And yes, guess it’s mostly an iPad or Paypal problem.", "rating": 3}, {"title": "Relatively expensive listings", "text": "Relatively expensive listings. I only shop when there is a sale as otherwise most items are overpriced.", "rating": 3}, {"title": "The experience is still pending", "text": "The experience is still pending.  I found it a bit awkward.  I do a lot of online shopping, but this is the first time I was unable to enter my debit card info to finalize the purchase at the time I placed the order.  I don't understand why the vendor has to call me to get the info, unless your site is not secure.  There is also some confusion about the shipping, insurance and tax charges.  The drop down menu on the Ruby Lane site says shipping to the US is $19.99 and insurance is included. (taxes TBD)   However, a final tally in my cart showed $29.98 for shipping, $6.00 for insurance and $19.31 tax.  Then, my email from the vendor showed $24.98 for shipping, insurance was, in fact, included and $18.57 for tax!  I think we all need to get on the same page. I hope my review will help you improve.   I have not seen the items I have ordered.  I trust they will not disappoint.  Linda", "rating": 3}, {"title": "My experience with Ruby Lane has been…", "text": "My experience with Ruby Lane has been largely positive. But there have been several occasions when I have been charged a restocking fee on a returned item for no apparent reason. It has made me more cautious about buying items that I don't see first hand. Jewelry stores on Ebay don't have this practice. Some don't accept returns and it is plainly stated on the first page of the listing, not in the small print. I tend to go to Ebay first for jewelry shopping. I get better prices and less surprises in the form of 20% restocking fees.", "rating": 3}, {"title": "Very disappointed in how difficult it is to navigate between pay immediately or lay-away...", "text": "It's very confusing to agree with a seller to place an item on lay-away, yet you have to first put it in your cart and then there is no where to check a box that states \"this is a law-away item\". It immediately wants you to check the box on how you are going to pay and then immediately takes you into the pay in full lane. Tonight I became so frustrated over this that I went ahead and paid the full $586. amount because I didn't have the time to figure it out !!!!  Perhaps this is your intention.....", "rating": 3}, {"title": "one buys an item", "text": "one buys an item, a doll in my case, one pays with Paypal and there is no email sent to say: \"Your order has been placed and thank you.\"Going back to the site I read: \"SALE PENDING\".Pending what?Several hours later still no sign of recognition or confirmation one has completed a purchase.Compared to Ebay, RubyLane exchages are much less pleasant.Sincerely,AML", "rating": 3}, {"title": "My opinion was better before RL began…", "text": "My opinion was better before RL began charging taxes and service/handling charges! For me, this means the difference in purchasing or not purchasing. If I was affluent or rich, of course, it wouldn't make the difference. The handling charge is particularly irritating!", "rating": 3}, {"title": "Not Happy With RL Processing Fee", "text": "At one time I would have given Ruby Lane 5 Stars. I do not like the way the processing fee suddenly appeared on my invoice during their 50 % off sale in November 2019. No warning, it just appeared.  What a perfect time for them to do this. I believe they used the excuse it was to help with the processing of deducting state taxes. I'm not helping RL with their accounting processes by paying more for an item.  I stopped shopping on their website because of it. I have since come back to shop because the processing fee has since been removed. I hope Ruby Lane will gain my trust again.  There are many wonderful shops on their website however a few I use to purchase from are gone. I'm assuming they left for the same reason. .", "rating": 3}, {"title": "Very difficult to shop from your phone…", "text": "Very difficult to shop from your phone on this site.", "rating": 3}, {"title": "Difficult", "text": "Very difficult to navigate site, awkward and confusing.", "rating": 3}, {"title": "There should be an EASY way to not be…", "text": "There should be an EASY way to not be charged sales tax. I purchase a lot of items for my business. I have a valid  sales tax licence with the state of Arizona. Just this morning I paid over $100 for fabric that should not be a taxable item. Sales tax is always added and I know of no way to avoid it. Any help with this problem would be appreciated.", "rating": 3}, {"title": "added fees", "text": "The prices are reasonable but by the time you go to check out the added fees can be as much as 30% over the cost of the doll.  This is very discouraging!Linda", "rating": 3}, {"title": "I cannot contact the seller for this…", "text": "I cannot contact the seller for this necklace.  I didn't want to use PayPal but it wouldn't go to the credit card I wanted to use master card.   How do I contact the seller to tell her that.Kathy Wasson", "rating": 3}, {"title": "I do not like many of the recent…", "text": "I do not like many of the recent changes to the site. So much space is taken up by the header you have to scroll down to begin to see the items. The currency converter is gone. I am not impressed by Ruby Lane adding a 'surcharge' to the items.", "rating": 3}, {"title": "I am unable to pay with Paypal due to…", "text": "I am unable to pay with Paypal due to bank fraud on my paypal account a year ago.  My bank feels it is not secure for my useage.  It is difficult (impossible?) for me to be able to find another payment method.   Can that be fixed, so that another payment method is easily available?", "rating": 3}, {"title": "Quality of products is low and prices…", "text": "Quality of products is low and prices are high.  In particular I look for dolls and jewelry.", "rating": 3}, {"title": "The website is hard to work through to…", "text": "The website is hard to work through to the place for payment.  I waited several days for notification of how to proceed and it was not until I received a notice from the vendor that I \"rummaged\" through the website to locate the point of sale.", "rating": 3}, {"title": "Postage / shipping.", "text": "Disappointed with over charging on postage (shipping) Do ask for items weight before buying anything.Small lightweight items (even with insurance) with $3 & $4 price difference overcharge. Grrrr. Postal Gouging when I bought!", "rating": 3}, {"title": "Honest antiques", "text": "Honest antiques, overpriced but 90% true to what is offered. Don't believe everything you read,  do your research and then make sure you're 100% sure of your find...Shipping and insurance can be half of the item(s) cost!!", "rating": 3}, {"title": "This interface is confusing", "text": "This interface is confusing.  I have difficulty navigating it. It kicks me out regularly. And I can't back up a step when I need to.", "rating": 3}, {"title": "Shop owners should respond to purchase orders.", "text": "I enjoy shopping on Ruby Lane, but the shop owners do notrespond to the purchase order. It would be nice to know if myitem has been mailed and when I can expect arrival.", "rating": 3}, {"title": "Expensive Shipping & Confusing website", "text": "The shipping cost will prevent me from purchasing again. They seem outrageous compared to other sites. It will now have to be an item I feel I can't find anywhere & want so badly that I can't stop thinking about it before I purchase again. I will stick to my local antique shops, etsy and shopping when I travel. The website is also a bit user \"unfriendly\".", "rating": 3}, {"title": "There have been no provisions made for…", "text": "There have been no provisions made for the buyers with resale numbers. I am not sure I understand how such a thing could happen by a company that prides itself on good customer service. The fees are too high and have deterred some customers from purchasing. I also miss the dolly cam with Rachael.", "rating": 3}, {"title": "Unfair, Automated Extra Fees", "text": "I  don't like the additional charges called tax & fees.  It does not represent the actual tax rate that is required for merchants to apply to purchases for the state I live in.  Also, the fee makes it appear as a service charge for handling and the merchants are already charging shipping and handling fees.  With limited ability to return, and with retail merchants offering free shipping and free return shipping, Ruby Lane is no longer a place I will look for bargains.", "rating": 3}, {"title": "After being a Ruby Lane customer for…", "text": "After being a Ruby Lane customer for several years, this will probably be my last purchase. I take exception to the newly added service fee.", "rating": 3}, {"title": "sign-in problems", "text": "I found your sign-in forms difficult to navigate-----had a heck of a time trying to change my billing/shipping address. Needs to be more user-friendly for old technophobes like myself.", "rating": 3}, {"title": "I have been buying off of Ruby Lane for…", "text": "I have been buying off of Ruby Lane for many years & I also promote the site to my Doll friends. Very disappointed to see the new service fee attached , along with the state taxes ? Don't the Vendors pay enough in listing & maintenance fees to cover this? I recently received a note from a vendor who say they are leaving RL because of the added costs. POO on RL for being so greedy!", "rating": 3}, {"title": "I had a very difficult time with…", "text": "I had a very difficult time with placing my purchase because your “make offer” did not work.  So back and forth with seller over 4 days and 2 emails to ruby lane did not solve the problem.  Out of desperation the store owner and I agreed on a time EST and PST for her to change the purchase price .  I stood by and counted down the time.  At 12:04 the agreed upon sale price was displayed and I placed the order.  It should not have been so hard.  You’re response to my email was unsatisfactory.  I have purchased  items before but at asking price. No problem.  So I give you credit But as a result +5-2=3Delightful to serve worked hard for the sell and item arrived in perfect condition, very happy.", "rating": 3}, {"title": "Additional service fee to run Ruby Lane website added at checkout...not well received.", "text": "I purchase often from Ruby Lane and have been pleased with the service, but my most recent purchase had a service fee from Ruby Lane to run the site.  I do not feel the purchaser should pay for the site.  I had committed to purchase the object and then see an $11.50 fee in addition to the purchase...not my responsibility.", "rating": 3}, {"title": "I doubt anyone loves the service fees…", "text": "I understand taxes.  I understand postage costs are high.  No one can help that. I understand that Ruby Lane needs to charge a service fee, now. But the percentage RL chages reminds me of an auction house's fees.  Except you are not an auction house.  You don't set up the items or make them presentable to a buying audience.  You don't set an actual, physical venue.  You do not have to hire security or auctioneers, send out catalogs, etc,   You don't set up the open telephone lines for on-line bidders. You do nothing but run a website and advertise in a few places.  Now you want a big fee for doing what you've done for years, for free.  Why didn't you charge a modest fee all along?  Then there wouldn't be this sticker shock now.    Of course, most sellers will just eat the fee and take the loss.  How long do you think they can afford to do that?  No more exclusively on Ruby Lane.   And no more big purchases on Ruby Lane for me.   Small ones.", "rating": 3}, {"title": "I have always shopped Ruby Lane as my…", "text": "I have always shopped Ruby Lane as my to-go shopping for antiques of uniqueness and quality. On my last purchase, I was frustrated by the additional $17.64 for fees and tax on a $100 item!! Taxes I understand, but the attached RL fees are unfortunately going to cause me to search other avenues to obtain my antique purchases.", "rating": 3}, {"title": "The website when it comes time to pay…", "text": "The website when it comes time to pay is very, very slow.  So slow that I left things in my desired cart because it was taking so long.  I did like the great selection and the prices were very good.  On the things I was able to purchase, I feel I got my money’s worth.  We’ll see when the actual products arrive.", "rating": 3}, {"title": "Disappointed", "text": "FIrst, I absolutely love the shop Silver by Patrick. But my most recent transaction left me with a negative impression of Ruby Lane. A service fee? Really? Also, my state charges sales tax, but I was charged over the .0825 rate. Why is this allowed? Price gouging!", "rating": 3}, {"title": "Five stars for Vintage Elixir", "text": "Five stars for Vintage Elixir!  She is lovely, responsive, and knowledgable.  However, RL's new fee policy is unreasonable and will force me to abandon Ruby Lane after years of patronage. It is unfair to the veneers and the customers.", "rating": 3}, {"title": "An inflationary feeling in the collecting world", "text": "Merchandise is good and there are good avenues for communication with sellers.  My biggest recent problem is the addition of the fees and mandatory tax, which increases costs by over 10 percent.  Similar recent practices on ebay (mandatory tax for all purchases) feel extremely inflationary.  I realize that you're probably complying with a law, but it's a lot to be hit with all at once, especially if the bulk of your income is used to build up collections.  So, you cut back on purchases to compensate.  And sellers are driven out of business, which is a real shame.  It feels like the end of an era of convenient online collecting, perhaps it's best to spend money in totally different ways.", "rating": 3}, {"title": "Ruby Lane is not a favorite site.", "text": "Ruby Lane has some wonderful items to offer, but I do not like that I cannot find out prior to purchase all the extra costs involved in the purchase.  Also, I like to immediately pay for my items and expect shipping to occur shortly after; on Ruby Lane I am now waiting (and have no idea how long the wait will be) to find out what my costs will be and finally pay for the item.  I do not like this process and probably will not continue viewing items and purchasing from this site.", "rating": 3}, {"title": "I paid for a bracelet that I didn’t…", "text": "I paid for a bracelet that I didn’t want. There was no way to cancel itSo I was stuck paying for it.All I wanted was the beautiful pearl earrings, I never ordered the bracelet, I don’t like it.Thank you, I will pay for it.", "rating": 3}, {"title": "Much has changed at RL and not for the…", "text": "Much has changed at RL and not for the better. I would like to not use PayPal after many of my customers complaints. But RL states that I must use one online payment. I had a nasty x girlfriend of my son make fake purchases just to leave me terrible reviews. She did this numerous times over a week. I asked both Ruby Lane and Trust Pilot to please remove these reviews--both did NOTHING. So my only option was to remove all my reviews--great and terrible. I would like both RL and Trust pilot to step up to protect their sellers as I am loyal to RL. I love the blocked bidder list, the yearly accounting, the excellent photos and easy transaction pages etc.  But, it is time to live in the real world--where angry sick people try to hurt others and destroy a sellers reputation. This to me and many other sellers is a no brainer--just do the right thing both of you.", "rating": 3}, {"title": "I dislike the added fee and tax without…", "text": "Too many fees and no tax exempt optionI dislike the added fee and tax without the opportunity to use my tax exempt status. I will be buying lees from RL in the future due to these changes. Very disappointing from a regular buyer and seller on RL", "rating": 3}, {"title": "Unlike the estimable Etsy", "text": "Unlike the estimable Etsy, the Ruby Lane site is very difficult to use because it lacks flexibility.  Shoppers can't flip back and forth among items or sellers. Can't copy images to send to someone else or to keep for comparison to something on another site. Hard to find spot on screen for contacting seller. Receipts don't have photos of items purchased, limiting the depth of one's records. Etc. And the added fees are too high.  Obviously, the strengths of Ruby Lane are the sellers and their wares, not the site itself.", "rating": 3}, {"title": "HELP!!!!!", "text": "HELP---PLEASE---Do something about your check out system...It was hard for me to figure it out....Thank God for the sellers help...I would have, had  to cancel my purchase.", "rating": 3}, {"title": "Hard to find things", "text": "Hard to find things; checkout confusing.  Not user friendly.", "rating": 3}, {"title": "I have always been very happy with my…", "text": "I have always been very happy with my experiences on Ruby Lane. The individual shop owners are, for the most part, reliable, knowledgeable and friendly. So it is sad to see some of my favorite shops will be closing due to changes in Ruby Lane fee schedules. If more shops close, I will look for them online and take my business elsewhere.", "rating": 3}, {"title": "I can't believe the new fee structure", "text": "Date of experience: November 15, 2019", "rating": 3}, {"title": "Waiting for invoice", "text": "It's been three days and I still haven't got the invoice of my purchase. Why you don't have Instant payment system like in Etsy and eBay?Also, I would buy more if the links of your newsletter worked. They don't, at least not in Android.", "rating": 3}, {"title": "Received the order, but unsure if I'd recommend or order again…", "text": "(updated) I never received correspondence from the store within ruby lane in which I purchased the item but received it between two to three days of my purchase. The item I ordered for a friend was a silver match case that was perfect since it already endowed my friends initials on it. There were a couple of other dents on the antique item then was actually stated after I received it, but all in all since it was marked down, it seemed like a give-in. My friend was OVERJOYED by the gift, so I'm happy it turned out well in the end. I like the platform, but the next time I order, I will be sure to be very thorough concerning policy and noting correspondence. Even though my friend loved this gift, I'm not sure if I would order from here again, but I might.", "rating": 3}, {"title": "Web pages are a bit difficult to…", "text": "Web pages are a bit difficult to navigate.I liked a piece of jewellery and made an offer, after making the offer to the seller, I did not get any indication whether my offer was sent to these.ler. Still waiting.", "rating": 3}, {"title": "RL is cumbersome to use", "text": "RL is cumbersome to use.  Putting anything on your wish list dumps it into one catagory.  You have no choice, it just goes into a general catagory whether it belongs there or not.The wish list makes no sense.  To find something from a particular seller you must go through the entire list.  Why not alphabetize by sellers?  I have made these suggestions but get no response from RL.  So, obviously my opinion is not \"important\" to RL as Trust Pilot suggests.", "rating": 3}, {"title": "While shopping for antique doll clothes…", "text": "While shopping for antique doll clothes on Ruby Lane I had a number of items in my cart.  Upon checking out I realized that each item was from a different \"store\" and I would have to pay shipping on items from each individual 'store'.  Clearly the additional shipping costs reduce the number of items to be purchased.  Ruby Lane is a good site to view many items but it was very disappointing to realize that the site does not accommodate multiple purchases under one order with one shipping cost", "rating": 3}, {"title": "I would prefer to not use PayPal", "text": "I would prefer to not use PayPal. I don't know if this is the seller's policy or RubyLanes.  I would like more options.", "rating": 3}, {"title": "stumbled on to this site while google…", "text": "stumbled on to this site while google searching for a particular item. they had it for sale from a vendor. not hard to buy, but HAD to create account etc., could not just buy as \"guest\"", "rating": 3}, {"title": "Satisfactory Outcome Thanks to Rob Spear of Ruby Lane", "text": "Ruby Lane's Senior VP of Customer Support, Mr. Rob Spear, deserves 5 Stars for his patience and tenacity in dealing with (1) an unprofessional Ruby Lane shop owner who publicized my personal email address, (2) an incompetent Trustpilot representative, and (3) bugs in Trustpilot's software which prevented Mr. Spear from deleting the seller's mean-spirited remarks. The seller attacked me in an emotional response to my objective feedback about her overcharging postage and exaggerating her item's size and quality. The experience cost me over $23.00 in mailing fees. Ruby Lane is fortunate to have Rob Spear on their side. My 3-Star rating averages Mr. Spear's 5 Stars with the Ruby Lane shop owner's 1 Star.", "rating": 3}, {"title": "Convoluted shopping", "text": "Convoluted way to shop. Before you check out you have to become a member. Then you are forced to go back and add not only your email but also your street address ALL before you find out the cost for shipping. After you order you’re not done, as THEN  you have to pay separately.", "rating": 3}, {"title": "I'm not happy that I have to change…", "text": "I'm not happy that I have to change over to google chrome in order to pay my invoices. I don't appreciate google as a company. I feel they try to monopolize everything. I was especially aggravated when I had to use chrome to pay my pge bill online> I asked them to start sending paper bills> Happily I don't have to use chrome to pay pge anymore. I would prefer not to use google for anything>", "rating": 3}, {"title": "hard to sign up", "text": "Date of experience: September 27, 2019", "rating": 3}, {"title": "No sure about this experience at…", "text": "No sure about this experience at all...pour in an order ... With a phone number for the seller to call...then pho es the seller. And dead silence. Don't know if this is going to happen.", "rating": 3}, {"title": "inconvenience", "text": "No back tap when shopping. If come back then have to search again.", "rating": 3}, {"title": "Great products but I was expected to…", "text": "Great products but I was expected to buy the item before I knew what shipping cost was so they could then charge me whatever they wanted!", "rating": 3}, {"title": "I found something unique", "text": "I found something unique.  Most things tend to be too expensive for me.  Pictures of items need to be better quality.  I will use this site again, on the off chance that I will find the unusual item that I can afford.", "rating": 3}, {"title": "Credit Card Information Security", "text": "How is the Ruby Lane purchaser's credit card information SECURE when that purchaser has to give  their credit card information to the seller BEFORE the transaction can be finalized?  There is no indication on Ruby Lane's site which assures purchasers that their credit card information is protected.  Ann Niessen", "rating": 3}, {"title": "Please develop an app! :)", "text": "I find it hard to navigate the website. I really hope you develop an app soon as that is easier and more convenient. I love the variety of things you offer, but the interface makes it hard to browse.", "rating": 3}, {"title": "Horrible...request was summoned to…", "text": "Horrible...request was summoned to seller days ago and haven't heard back from them yet", "rating": 3}, {"title": "I would give 5 stars however...", "text": "I would give 5 stars, however, there are a lot of fakes and overseas counterfeit Native American items.", "rating": 3}, {"title": "await outcome before review", "text": "await outcome before review. however, noticed no option to pay with paypal which would have ben quicker and simpler.", "rating": 3}, {"title": "I find it really frustrating that you…", "text": "I find it really frustrating that you always have to reenter your search.  It would help if there was a listing when you start to type that shows your last few searches. Ebay has this feature.", "rating": 3}, {"title": "Perhaps a Dinosaur", "text": "Ruby Lane is good for finding rare collectibles, but items are 'typically' overpriced.  It's as if it is an environment 'insulated' from the real world of supply and demand.  Most items listed are no longer of interest to the younger generations.", "rating": 3}, {"title": "I enjoy your website", "text": "I enjoy your website, but am having difficulty changing my password. I can't remember my last one.", "rating": 3}, {"title": "Site running slow...complicated method…", "text": "Site running slow...complicated method of paying!  Good selection though:)", "rating": 3}, {"title": "Some nice items especially when there's…", "text": "Some nice items especially when there's a sale. But why does their website take me to PayPal payment, I pay and then get a \"purchase order\" saying seller will contact me to arrange payment when I just paid? It's really confusing and makes me think RubyLane is listing items that are not actually in stock. I expect this to work like ebay Buy It Now.", "rating": 3}, {"title": "Postage/shipping/handling makes prices…", "text": "Postage/shipping/handling makes prices much much higher. I’ve mostly had good experiences with items as advertised but stopped shopping for a while due to receiving an item that was expensive junk purporting to be something else...I no longer buy from that seller", "rating": 3}, {"title": "I would give a 5star rating", "text": "I would give a 5star rating, except for the confusing payment checkout procedures.I have bought about 6-7 items from Ruby lane, and the PayPal/Paypal credit payment instructions are very confusing.I paid today with PayPal Credit, filling in my visa information and when I was done, another screen popped up saying I need to pay for the item -So I did it again, and another screen popped up saying I needed to pay, and then another screen popped up and said this may have already been paid - duplicate invoice discovered (or something like that).It always is confusing and time consuming - am I the only person who has trouble with this?Have I paid double to HD Jewelers today?'Please help!!!Mary Morrissey", "rating": 3}, {"title": "I like the vendors and their…", "text": "I like the vendors and their merchandise on Rubylane.  The site works well when viewing items, but I have have multiple problems when trying to access account information and especially when attempting to make payments.", "rating": 3}, {"title": "Your wish list should be alphabetized…", "text": "Your wish list should be alphabetized by shop.  Also, at the beginning of the day, if I try to put something on my wish list \"general\" is the only place I can put it.  All of the catagories SHOULD pop up so the item can go into the proper category.", "rating": 3}, {"title": "RL sites no longer let you print the…", "text": "RL sites no longer let you print the item you are interested in---or the item you have just bought. This is for my record keeping on my purchases.  I now have to cut & paste the info.This is NOT good customer service!", "rating": 3}, {"title": "You told me the doll was mine", "text": "You told me the doll was mine,  had me pay for it,  and then said it was unavailable!!    How do I get my money back,  since you charged me for a doll you refuse to send to me?  What's up???   Sincerely,   Marianne  🕊", "rating": 3}, {"title": "Better communication", "text": "I was trying to negotiate a better price and all of a sudden was told I agreed to purchase a dress. I emailed immediately and it was ignored. I kept getting emails reminding me to pay. If I had agreed to purchase I would have paid immediately. I will not be coerced into buying something I didn't agree to", "rating": 3}, {"title": "Ruby Lane doesn’t listen to buyers", "text": "I shop Ruby Lane by going to my specific favorite sellers. I have never had an experience with a seller that was not concluded to my satisfaction. That having been said:1. There is no way of canceling an accidental purchase, even if it’s immediately. There is no guidance either (contact the seller? contact Ruby Lane? tough luck & suck it up?). 2. There is STILL no way to search for items based upon the shopper’s price criteria. If I want to search for 14k ring between $45-$175 there is no way to do so. I am stuck with Ruby Lane’s individual ranges which are not MY desired ranges and on top of this, you can search only ONE price range at a time. This is far too time consuming and definitely not buyer friendly. I would search for items on this site more frequently if the existing price search system were updated to at least be comparable with other sites where I also shop for antique items (Etsy, EBay, Poshmark). To add insult to injury, when I contacted the owners of the site, I was given the brush off and told I could search via their price range system, one range at a time. Period. So, in other words, they’re not interested in investing the money and effort to upgrade their system to make it more useful to potential buyers. I am spending MY time leaving this review although I’m sure it will be quite ineffectual. I don’t even know why Ruby Lane does the survey. They are obviously not responsive to user needs.", "rating": 3}, {"title": "I think it is less than easy to use.", "text": "Date of experience: June 23, 2019", "rating": 3}, {"title": "Great items, horrible payment process", "text": "Love the site but can’t stand the paying process.  Huge issues and have been complaining about them for months. 90% of the time I’m unable to use credit card and must mail a check as no other payment option will function.This has made me hesitant to use this site, have been looking and shopping elsewhere.", "rating": 3}, {"title": "Difficult following the instructions…", "text": "Difficult following the instructions between, Check Out Now, Answer questions and another Check out now - all three at the same time.", "rating": 3}, {"title": "Ruby Lane does not support the buyers", "text": "At one time, I was a VERY happy Ruby Lane buyer that shopped on a DAILY basis.  It was until they (Ruby Lane) proved to me they had zero integrity protecting me as a buyer from fraudulent (fake) merchandise as they state.  I lost over $9000 on a fake watch.  They refused to do a thing about it because I “made payments”! How stupid is that? Regardless of HOW I paid, the watch is still a FAKE! On top of that, they allowed this SELLER to badmouth ME on their site for asking them for assistance, causing other sellers to block me from buying.  From now on, I only buy very low price, items I need.  It is amazing to me that to this day, they have NEVER apologized or done a THING about (the seller they KNOW sold me the fake watch). I have proof from the Panerai watch boutique that the watch is a fake AND proof that the seller lied in his description from what I found out from the Panerai boutique about the date the watch was manufactured.  Still, RUBY LANE CONDONED THE SALE OF A FAKE WATCH.  This is the reason I went from being a daily shopper to nil.", "rating": 3}, {"title": "One of my favorite places to look for…", "text": "One of my favorite places to look for interesting items, but the set up of the actual site is very frustrating.  I have at times had to contact individual shop owners, and ask them to contact rubylane to edit shopping cart, wishlist, etc.  Why don't they have a delete icon for individual items in shopping cart?  Why should I have go sign in (\"your account has been inactive for some time\") every time I have not visited the site for a few days.  I do have a life elsewhere.", "rating": 3}, {"title": "You have started allowing sellers to list and sell inferior items", "text": "You have started allowing sellers to post things that are made in China and they may or may not state that. Your site used to be considered high end antiques. However, it is an online museum with ridiculous list prices. Sellers leave their wares on the site until they sell them at a show or store. Many of the items are not rare or antique. I rarely ever come to the site because it is a waste of time....same stuff over and over at outlandish prices.", "rating": 3}, {"title": "It might be helpful if the person that…", "text": "It might be helpful if the person that setup this web page for ordering would have tried to use it.Very confusing! If you go to “ my account” there is no line item to “add address”!!! You actually need to click in the warning box under add address. Then it we back and forth putting an address and info but kept coming up with that error message!!! Finally after 20 minutes I stumbled onto getting the order put together and paid. Then in two seconds after clicking “ place order” the site just cleared off. Had no idea if our order went through because when we checked our cart was empty and the item said no longer available? I’d it wasn’t for confirmation email we would not have know we had purchased it!", "rating": 3}, {"title": "Total amount", "text": "I would have preferred to know the shipping cost before placing the order.", "rating": 3}, {"title": "This is the second purchase I have made…", "text": "This is the second purchase I have made from estatejewelrys For Less. I have wanted to use their “layaway plan” and have been unable to. I was instructed to purchase the ring and then he (owner) would send me an invoice. When I did that, I was sent to PayPal and had no options but to pay the full amount. Other than that, I love the jewelry. It is beautiful and well priced.", "rating": 3}, {"title": "Thumbs Down", "text": "Got to site thru a search engine. Wanted to buy, clicked on PayPal in error, then couldn't change to credit card...difficult site to use....make it like etsy...never a problem buying there.", "rating": 3}, {"title": "Your site has always been difficult to…", "text": "Your site has always been difficult to navigate for me(I made a purchase yesterday, and cannot find it to review today). Very frustrating so I usually look but do not buy on your site.", "rating": 3}, {"title": "I’m getting someone something for their…", "text": "I’m getting someone something for their birthday, but now I have to wait to see what they want to charge me? I’ve never seen anything like this before on other sites. Usually they calculate your shipping and tax when you go to pay, but now I have to wait for someone to get back to me  delaying the process.", "rating": 3}, {"title": "I see a decline in merchandise under…", "text": "I see a decline in merchandise under Dolls.  There are far too many new items, plastic, artist miniatures etc.  I thought listings were antique or vintage only?   I see a slide toward junky Ebay type listings.Also, wish list sellers should be listed in alphabetical order.  It is far too hard to find an item you have listed to purchase.", "rating": 3}, {"title": "Weird and uncomfortable", "text": "I think it is very strange that I can't immediately pay for the item I ordered but have to wait for a call from the seller, which is also strange.  It makes me very uncomfortable that I have to speak to the seller. If the item I'm purchasing weren't so difficult to find I would definitely find another place to purchase it.", "rating": 3}, {"title": "Love your items", "text": "Love your items. Cannot get my PayPal or visa card to purchase an item to work. I am trying to figure it out.", "rating": 3}, {"title": "It could be easier", "text": "I am new to Ruby Lane. It is not user friendly, compared to other sites, like shopgoodwill, Poshmark, Etsy. It takes forever to understand who is answering to what and to adjust price when seller is OK with that and then wait for seller to adjust price and then check messages and pay. Also, checking on messages is confusing, they come to my email and then it is hard to find the same message in the site.", "rating": 3}, {"title": "I am not happy with the shipping and…", "text": "I am not happy with the shipping and handling fee. It is outrageous!!!", "rating": 3}, {"title": "It was confusing", "text": "It was confusing, I thought I had paid for my order and received a message saying I had not.  Thank goodness I saw the message.But I didn't want the seller to think I wasn't going to pay.", "rating": 3}, {"title": "I usually have good luck with Ruby…", "text": "I usually have good luck with Ruby Lane. There has been a couple of experiences that didn’t go well. Items not as described and one instance seller not shipping product. I always felt like I was on the defensive. Not being believed. That’s why I keep all correspondence. I still deal with Ruby Lane because I have their  guaranteed. Not perfect but I still believe in people being honest.", "rating": 3}, {"title": "Search Functionality Needs Work", "text": "Ruby Lane is a good place to shop for antiques if you’ve got all day. The search function isn’t very robust so it’s hard to drill down for specifics.", "rating": 3}, {"title": "Problem W/ finalizing sale", "text": "I had to try twice to complete PayPal transaction .Being a senior may be the reason I was initially confused .", "rating": 3}, {"title": "I love the quality of the product", "text": "I love the quality of the product.  RL is difficult in that each item purchased requires separate payment.", "rating": 3}, {"title": "Most of the vendors offer layaway (at a…", "text": "Most of the vendors offer layaway (at a certain minimum price), but there is no explanation as to how this works. Please explain how to order an item that is available for layaway.", "rating": 3}, {"title": "Website is unclear about how to remove…", "text": "Website is unclear about how to remove items from cart. Website does not take credit cards.", "rating": 3}, {"title": "Two strikes you’re out", "text": "Two chances to make offer should reset after certain hours or something.  Found what I’ve been looking for.  Other than that I like what I found. Can’t wait to receive.", "rating": 3}, {"title": "Newer Customer", "text": "With so many different shops it's confusing at times to know each shops different return policy. Some of the pictures show very good detail where others are blurry. Im somewhat new to this site so maybe I'll catch on soon.  I e-mail a shop and sometimes I get a response several days later or no response at all.", "rating": 3}, {"title": "Prices too high...", "text": "I am in no way complaining about the service I have received over the years.  I have thoroughly enjoy all of my purchases, and been very satisfied.   My biggest concern with Ruby Lane is the pricing structure of late.  The prices have become somewhat exorbitant over the last several years, and I find I am making much more affordable purchases, for the same items on different websites.", "rating": 3}, {"title": "The \"login with Facebook\" functionality…", "text": "The \"login with Facebook\" functionality doesn't work.", "rating": 3}, {"title": "So as not to waste time", "text": "So as not to waste time, please note that I'm telling you about things of which I am unhappy. (1) When I print an item I do not get the whole picture that is shown on the screen. (2) When I enlarge the picture to see a particular detail, something in your processes will not let me copy that screen.Everything else about Ruby Lane is convenient and easy for buyers.Thank you for this opportunity.", "rating": 3}, {"title": "Most transactions are ok", "text": "Most transactions are ok.  Cat's Cradle purchase on 1/12/19 was not.  I paid immediately but hear nothing.  The following week I emailed and asked about shipping and tracking number.  Postage was $38 so I thought it would be insured.  After two days and no response, I contacted PayPal to reverse transaction.  They contacted seller and to this day he has not responded to PayPal or me.  The item did finally arrive, but this makes me leery  the other sellers.  No signature required for delivery with $38 postage and absolutely no correspondence, even to PayPal.  Plenty of dolls in the world.", "rating": 3}, {"title": "Unable to leave feedback on Ruby Lane", "text": "I have been unable to leave feedback on Ruby Lane for the sellers with whom I've conducted business. That's a bummer for them because I've never had a bad experience with any purchase. So that is a plus for Ruby Lane! Thanks and I will do business here again!", "rating": 3}, {"title": "Vendors and merchandise above exceptional - website, not so much. Atrocious customer account section!!!", "text": "All the vendors I’ve dealt with over the past 15 years have been excellent: knowledgeable, helpful, flexible. The website mechanics itself, though, are absolutely horrible!!! After you log in to your account, the customer experience is confusing and irritating. The categories make no sense whatsoever. This site has been in need of a revamp for years and this review is the one I always give and it is NEVER addressed. If Ruby Lane is losing customers - this atrocious customer section may be why.", "rating": 3}, {"title": "I have purchased and signed up with…", "text": "I have purchased and signed up with Ruby Lane before, but don't use it often. With this latest purchase (thru Etsy) I kept getting bounced back to \"Sign In\" and no password was working. When I tried to reset password, the link did not work and I received no email detailing how to reset a password.I finally got so frustrated that I set up a new RL account at another email, just to complete the purchase.  In the future, I hope the process will go MUCH more smoothly.Oh, and they automatically added \"insurance\" to my order of a book. I couldn't see anyway to subtract that fee from the total. I feel buyers should have the option of paying for insurance, not be forced to pay that additional fee.Another irritation...", "rating": 3}, {"title": "Prices  increase before sale!", "text": "Prices  increase before sale on many items!", "rating": 3}, {"title": "The site would not accept my 'make an…", "text": "The site would not accept my 'make an offer' attempts.  It just keptkicking back telling me to put in numbers.  After repeated attempts, I finally had to contact the shop owner to get the transaction completed.", "rating": 3}, {"title": "I asked Seller to combine 3 purchases…", "text": "I asked Seller to combine 3 purchases on shipping price of 3 charms, the Shipping was close to 16.00. Well, I messed up and paid the full amount I had told Seller, what I did, but did not get any response.", "rating": 3}, {"title": "Hello", "text": "HelloIts not easy for make things in favoris.I prefer whem their is a heart on the pictures. It is much easier. And you dont have to change. Thank youFatima", "rating": 3}, {"title": "Fay Wray Antiques", "text": "Fay Wray Antiques. Crappy vendor.BAD experience.", "rating": 3}, {"title": "I haven’t heard back on my compromise…", "text": "I haven’t heard back on my compromise of cost on a ring.", "rating": 3}, {"title": "Trying to get a pay pal purchase and am…", "text": "Trying to get a pay pal purchase and am having nothing but trouble..I cannot even use my Credit card-it keeps flipping to Pay pal and wants me to sign it up that way  Weird!", "rating": 3}, {"title": "No Communication, Lots of Confusion", "text": "As of yet I have received no confirmation or acknowledgement from the seller, no communication at all.  While the invoice was immediately paid, the item is still tagged \"sale pending\" on the website.", "rating": 3}, {"title": "Very nice butter dish", "text": "Very nice butter dish.  The only thing is it took 2 weeks to get to me.  I sent payment to the address given to me, but they didn't check that particular address right away so it was delayed quite a bit.", "rating": 3}, {"title": "Too soon to make an evaluation", "text": "Date of experience: December 31, 2018", "rating": 3}, {"title": "Not enough selection", "text": "Better selection is needed.", "rating": 3}, {"title": "The store had sold the item listed.", "text": "The store had sold the item and not removed the item from inventory. Amateur hour on their part and Ruby Lane for allowing that poor a pactice.", "rating": 3}, {"title": "I had a horrible time trying to open an…", "text": "I had a horrible time trying to open an account.  This portion of the site was aggravatingly difficult to navigate and I came close to giving up and not making a purchase.", "rating": 3}, {"title": "hard to buy a pin", "text": "i am 87 and i fount it really tough to buy a pin!!!! i found it  almost inpossible to spend 225 dollars  tobuy what i wanted to get.  i wonder how hard it will be in future just to be able to scroll through your invertory. ???  i hope it will be easier now.... sincerely, amy hart", "rating": 3}, {"title": "I would like more filters available for the Jewelry", "text": "I would like more filters available for the jewelry section. Such as type of piece, earrings, necklace and so on. In addition, it would be nice if there were filters for time period. I also find the payment section to be cumbersome. Why do I have to pay for each item individually? I put three items in my cart and have to spend the time to pay individually.", "rating": 3}, {"title": "The merchandise was advertised at…Ruby Lane", "text": "The merchandise was advertised at sterling silver, and I am not sure it it. It does not say it is sterling on the charm.", "rating": 3}, {"title": "Get the vase before Christmas", "text": "Get the vase before Christmas, and it’s a 5 star.", "rating": 3}, {"title": "I love the ring I'm about to purchase", "text": "I love the ring I'm about to purchase.  However, it would be much easier if I could just put my credit card information on the site to expedite the process. Still waiting for someone to call me to get my information.", "rating": 3}, {"title": "I absolutely love Ruby Lane's sellers…", "text": "I absolutely love Ruby Lane's sellers but, I do not like when I get e-mails from Ruby Lane and the dolls are pending sales. Why on earth would you send me e-mails for dolls that are pending sales.", "rating": 3}, {"title": "I love Ruby Lane shops, but......", "text": "I love Ruby Lane shops, but the checkout and payment process needs to be completely revamped.  It is buggy and confusing and redundant. Options other than PayPal and PayPal Credit should be offered. PayPal sucks.", "rating": 3}, {"title": "Waited 3 days to hear item was lost", "text": "Waited 3 days to hear item was lost, my order was cancelled.  Not a great experience.  Pretty unhappy about it.", "rating": 3}, {"title": "Like First older webpages better", "text": "Like old one before. This one is hard to navigate in one area.  The things for sale work great,  but the part where you put things in cart or save things to look at later or want to remove things from lists are difficult.  The first webpages were so much better on the part that lets you make lists or add or remove things from cart. Hard to explain. Had pictures before of everything you had in a list not just words.", "rating": 3}, {"title": "Search function and photo viewing capacity not very sophisticated", "text": "Search function not very sophisticated. Would like to be able to expand view of photos by hovering over selected areas", "rating": 3}, {"title": "My only complaint (so far-I haven't…", "text": "My only complaint (so far-I haven't been able to pay for the item 24 hours later which will also delay the receipt) is that Ruby Lane didn't collect payment with the sale! Now it is a hassle trying to coordinate payment a day later with the individual seller.", "rating": 3}, {"title": "Like the sight because quality items", "text": "Like the sight because quality items.  Downside is that prices WAY too high and the checkout, etc difficult to use", "rating": 3}, {"title": "Items needed for Christmas", "text": "So when a vendor/seller is on vacation and a customer makes a purchase when will items arrive? After seller is back?  Not explained. Keep getting items for sale, but if they are needed for Christmas, what does it mean if the seller will not be back until Jan 2nd?", "rating": 3}, {"title": "Paying individual vendors with varying", "text": "Paying individual vendors with varying payment methods is too much trouble! Go to a single payment point with stored credit card numbers.", "rating": 3}, {"title": "Ruby Lane would be a lot better if I…", "text": "Ruby Lane would be a lot better if I could register a permanent search for items I want and then receive alerts when they become available, but other than that I LOVE THE RANGE OF GOODS!", "rating": 3}, {"title": "The website is a little antiquated", "text": "The website is a little antiquated, or it might be my brain, but it seems I have to purchase items in my cart one by one.  However, I'm excited by the item I bought and have full confidence that I'll be happy.", "rating": 3}, {"title": "I had a very difficult time trying to…", "text": "I had a very difficult time trying to check out after my purchase. It kept making me sign in. I never did give my cc information. I would surely hate to lose out on this purchase but I did everything the site asked me to do", "rating": 3}, {"title": "Item in cart causes problems", "text": "I found an item and it said someone had it in their cart.  Logged in the next day, said the same thing so I checked out and at the end after the transaction it said it could not complete.  Got a PayPal invoice the next day and I got the item which was what I wanted.", "rating": 3}, {"title": "Love Ruby Lane ....but....", "text": "Love Ruby Lane ....but..... When I tried to check out, I was routed to my deleted FaceBook account. There was no way to access my existing Ruby Lane account, no way to change the password. This needs a technical fix guys, or do you want to give away your customers to a third party??  Time for a meeting!!!!!!!", "rating": 3}, {"title": "Password reset", "text": "Your password reset is not working.It is beyond frustrating, for 2 weeks now it has been a chore to reset. This was the reason for your average rating.", "rating": 3}, {"title": "I’ve bought a lot of things from…", "text": "I’ve bought a lot of things from Rubylane over the years. I’m generally happy. However I just made a purchase of two yards of antique ribbon. Price of shipping and handling and insurance, for two yards of ribbon was rediculous!!! Guess there trying to make extra money on this purchase!!!", "rating": 3}, {"title": "shopping was easy", "text": "shopping was easy.  selection was very good.  trying to make payment was a nightmare.", "rating": 3}, {"title": "Checkout very difficult if you do not…", "text": "Checkout very difficult if you do not remember your passwords. Needs more personal prompts.", "rating": 3}, {"title": "Nice site with plenty of beautiful…", "text": "Nice site with plenty of beautiful items. Unfortunately I bought one only to get notified the next day that it had apparently sold to someone else. Am now waiting for my refund. Disappointed.", "rating": 3}, {"title": "I love the vintage and antique range in…", "text": "I love the vintage and antique range in Ruby Lane and most sellers are honest in their descriptions and do their utmost to ensure you have a positive buying experience with them.  However, caution is needed if you put items on layaway as they are not covered under the return conditions of Ruby Lane's policies. I received an item that was described as platinum with a one carat solitaire diamond, but was just white gold and stone only .70cwt. I had no redress because it had been on a layaway for my son to use as an engagement ring. My son was a college student at the time and saved so hard for this ring. And the deceptive seller claimed to be GIA certified! Upsettingly, the seller refused to refund and would not accept a return and Ruby Lane said they were not responsible because of the layaway. Check sellers feedback and how long they have been selling on Ruby Lane. I still buy lots on Ruby Lane but follow that caution and stick to my favourite sellers.  .", "rating": 3}, {"title": "The site is troublesome", "text": "The site is troublesome. I had to sign up for a new account because they couldn't find my account. That was annoying. They do have lots of great items. I don't like seeing all the things that are already sold or sale pending. Feels manipulative.", "rating": 3}, {"title": "Item not available, order canceled.", "text": "Seller was unable to complete my purchase as they had sold the listed item previously.  The seller promptly issued a full refund, and as compensation offered a 15% discount on my choice of another of their items.  According to the seller, “Sometimes [Ruby Lane] does not take off items that have sold previously. I sold this item several months ago and did not realize it was still on the website.”  I think the seller did the best they could under the circumstances.  No harm, no foul.", "rating": 3}, {"title": "I often get malware type fishing emails…", "text": "I often get malware type fishing emails fraudulently claiming to come from Ruby Lane. I have reported these to RL but the fraudulent emails just keep coming", "rating": 3}, {"title": "Checking the details. . .", "text": "It would have been a simple transaction, but my shipping info was never updated by Ruby Lane, so my Paypal transaction was sent to the wrong party and i did not get the merchandise I paid for.", "rating": 3}, {"title": "Lots of Problems", "text": "Encountered a lot of problems placing order and paying.  First time I'm on site so not likely to use again.", "rating": 3}, {"title": "NEVER tell me my site has been inactive…", "text": "NEVER tell me my site has been inactive for awhile.  That's insulting.  I look daily, I take note, but it's my husband who buys for me, using his site.  My site is VERY active, thank you very much.  And, you refuse to recognize my Password.  Often I give up on attempting to make a purchase and go straight to ETSY, rather than deal with applying for a new Password. Pay Pal:  PLEASE! just allow me to click the credit card I wish to use, as I'm never sure if PayPal is the bank, or AMEX is.  Show in print which credit card is being used for the purchase.", "rating": 3}, {"title": "The only beef I have", "text": "The only beef I have, So to speak,is when I search for oh, let’s say Miriam Haskell jewelry you add so Many other things, NOT Haskell thatI have to wade through that it gets moreDrawn out than it needs to be. E-Bay when you search for Miriam Haskell jewelry that isall you see....So much Better. I would shop your site and Etsy more if you BOTH quit that tactic.", "rating": 3}, {"title": "It was hard to navigate", "text": "It was hard to navigate. I wasn’t happy. I thought I would go through a auction company instead of e bay. I thought I would get better service. I was wrong.", "rating": 3}, {"title": "the website was hard to understand as…", "text": "the website was hard to understand as to directions for how to log on and then to make purchase.  i bought a vase and there was some difference i owed the seller.  the seller asked me to send by PayPal but the seller did no put any information as to how to send to him and when i got back on my account page on RUBYLANE--there was no obvious way to pay the seller the difference in the shipping. i pushed the PayPal tab and it stated i had paid in full.", "rating": 3}, {"title": "love this site..but overpriced", "text": "love this site.. but everything is so overpriced.. other than that its great", "rating": 3}, {"title": "Doll was not described well at all", "text": "Doll was not described well at all. Fell apart on receipt, ripped dress, modern wig, replacement legs, etc. Very disappointed, still a nice doll, after some work (new wig, legs, dress, restring...). Maybe other sellers are better, but i'll stick to other sites from now on. :(", "rating": 3}, {"title": "I prefer to sign out as a guest without…", "text": "I prefer to sign out as a guest without using pay pal, pass words orfacebook. I’ve done it before at other websites.  The path to completeing an order is so circumvented I thought I would not suceed.", "rating": 3}, {"title": "PURCHASED AN ITEM ON JUNE 8....PAID…", "text": "PURCHASED AN ITEM ON JUNE 8....PAID RIGHT AWAY.....HAVE NOT RECEIVED THIS ITEM AS YET...RECEIVED 3 OTHER ITEMS PURCHASED AT THE SAME TIME....HAVE NOT HEARD FROM THE SELLER AND WHEN I WENT TO CONTACT SIGN CAME UP NO SUCH A LOCATION....WOULD APPRECIATE IF YOU WOULD CHECK ON THIS ITEM...I DID WANT IT BY TODAY AS I AM DOING A SHOW TOMORROW AND ONE OF MY CUSTOMERS WAS INTERESTED IN THIS ITEM.....THANK YOU...JEAN GALLIN", "rating": 3}, {"title": "I dislike using paypal", "text": "I dislike using paypal - would rather use my credit card and be done instead of waiting.", "rating": 3}, {"title": "There should be a time limit on…", "text": "There should be a time limit on ‘offers’.  I made a counter offer on an item and never received a response.  Now read that there is no time limit on ‘offers’.  Very discouraging...what if two mints, or a year, down the road, the vendor decides to accept my offer?  Perhaps there will not be enough money available for said item by the time they decide to respond.For this reason alone, I would not place an offer on anything again, nor would I recommend your web site.", "rating": 3}, {"title": "This is a nice site but I don't really…", "text": "This is a nice site but I don't really like having to wait for an e-mail from a seller to pay.  I wish the site had it's own payment element.", "rating": 3}, {"title": "I have had positive experiences with…", "text": "I have had positive experiences with Ruby Lane other than with one fraudulent seller under the store name of “ANTIQUES AND INCOMMON TREASURE.”   This seller is FRAUDULENT.  THEY LIE AND SELL TO OTHER BIDDERS AFTER TRANSACTIONS ARE COMPLETE TO MAKE MORE MONEY....Avoid ANTIQUES AND UNCOMMON TREASURE AT ALL COSTS!  RUBY LANE IS A GOOD OVERARCHING RETAIL BRAND BUT THEY MUST MAKE A STAND AND HOLD THEIR STORES ACCOUNTABLE FOR ETHICAL TRANSACTIONS OR OTHERWISE, I & others WILL BE LEFT TO BELIEVE THAT THEY ONLY SUPPORT THE STORES TO GET THE REVENUE AND PROFIT.", "rating": 3}, {"title": "Shipping/Handling seems out of proportion", "text": "When shipping & handling is *almost* the same amount as the item you are purchasing, that seems disingenuous. It leaves me feeling taken advantage of.", "rating": 3}, {"title": "you have many beautiful things listed…but fix your website", "text": "you have many beautiful things listed on your site....... BUT.....i took me hours trying to pay for an item that was in my cart..I ended up emailing with the seller in another country who finally was able to releasethe prior hold that Ruby Lane had on an item.. Please, make your website more USER FRIENDLY. I HAVE A LARGE NETWORK OF FRIENDS WHO feel the same about your checkout process.. I was very close to just NOT buying from you.", "rating": 3}, {"title": "I didn’t know that my order was…", "text": "I didn’t know that my order was complete until I went to my email for confirmation. I never had to put in my Visa number as I normally do otherwise. Plus there was no direct signal that confirmed the purchase while on the store’s websight.", "rating": 3}, {"title": "Purchase as guest", "text": "It'd be nice for one-off customers to make purchases as a 'guest' without having to create an account.  Everything is great otherwise.", "rating": 3}, {"title": "I'm reviewing the RL website experience…", "text": "I'm reviewing the RL website experience itself and not any individual vendor. The website's user experience seems dated to me. For instance, something as pivotal as finding items to purchase, or vendors (and I realize that finding vendors is in a different and awkward location) is laborious, time-consuming and frustrating. In other words poorly designed; and not specifically designed with the consumer in mind.The search function has limited common search terms and appears as if little research was done in creating it. This is only one poorly executed function on a website that lacks current functionality in multiple areas.", "rating": 3}, {"title": "Love the items for sale but after…", "text": "Love the items for sale but after spending time filling out info including at checkout and submitting cc payment got response \"Not implemented\" on blank screen and now I'm not sure if my payment went through or not. To be fair this may not be RL's fault.", "rating": 3}, {"title": "Definitely need some work on search…", "text": "Definitely need some work on search options with more selectable detail, and general ease of navigation around the site, suitable for finding specific types of merchandise, specific vendors, price ranges, antique time periods.  I spend ridiculous amounts of time by not being able to logically search for what I'm wanting to see.", "rating": 3}, {"title": "Payment Ease", "text": "I have always had trouble when paying on your site.As well it is not as easy to view orders.Amazon, EBay, Horchow, Pottery Barn, J.Jill and Walmart are MUCH easier to use.No doubt I would use Ruby Lane more often if it were easier.", "rating": 3}, {"title": "It automatically mark “Added To Cart,”…", "text": "It automatically mark “Added To Cart,” or similar, on various items, even though I did NOT want it added to my cart & did not enter it.   I initially wasted time trying to undo, which was fruitless, & even sent a message to one seller stating that I had not added it.  I may have pressed the heart-shape that was nearby to mark it for later consideration.  I had not yet finished viewing all similar items.     If the total number of supposed potential buyers is misleadingly increased to serve as a pressure-tactic on other potential buyers to purchase the item, then I must reconsider shopping on Ruby Lane.    Furthermore, customers should be clearly informed, in ADVANCE of writing a review, that the review is NOT for the sole use of TRUSTPILOT but will be publicly published with the customer’s name.  I would have reconsidered writing one if purpose of TRUSTPILOT was not solely to improve Ruby Lane.  That would not require public posting.", "rating": 3}, {"title": "It was frustrating trying to figure out…", "text": "It was frustrating trying to figure out how to pay and when.  The purchase process takes too long.", "rating": 3}, {"title": "Confused", "text": "Confused.            I find your website confusing as I do not wish to pay via PayPal.  I would like to pay by electronic transfer or online credit card.  Do you have a secure payment site?", "rating": 3}, {"title": "The jury is still out", "text": "My first purchase & I had to contact the seller after I had no communication 48 hrs after the sale. I did receive an immediate reply that my item would indeed be shipped. Waiting to see when (& if) my purchase will arrive.", "rating": 3}, {"title": "Really annoying that you can't just pay…", "text": "Really annoying that you can't just pay right away and that you have to wait to get an email from the owner. Makes the process super confusing.", "rating": 3}, {"title": "The email shop owner option doesn’t…", "text": "The email shop owner option doesn’t work! I’ve tried to write inquiries but there isn’t a place to type a message. I’ve had to pass on potential purchases because I had no way to contact the seller when email is their only choice way to be contacted!I’ve emailed Ruby Lane for help but have NEVER been replied back to or assisted!!!If I can’t formally communicate with a seller then I won’t buy from them!!!", "rating": 3}, {"title": "Antiquated site", "text": "Antiquated site, not standardized between vendors", "rating": 3}, {"title": "Limited options.", "text": "The check out process doesn't provide many options. Impossible to change delivery address without first contacting dealer. Or to use a credit card without first contacting dealer. Since it can take a few days to get a response from a dealer, the sale is left dangling... Frustrating. Was forced to use Paypal and ship the item to my studio, instead of directly to my client.", "rating": 3}, {"title": "So far alright", "text": "So far alright.  However, there is no way to review the seller nor evaluate the products.  I experienced a denied purchase for no reason.  I also notice that this website isn't keen to keep records.  Based on the above, my conclusion is that this website seems to take more interest in protecting sellers.", "rating": 3}, {"title": "Just one thing", "text": "Just one thing: in collecting my data, the cursor wouldn’t line up, thus it wouldn’t take my information on the correct line...took me about an hour to complete my info... and couldn’t figure out where to enter my card number, so have to wait for a call back to get that info. HOWEVER, the jewelry is ABSOLUTELY GORGEOUS and will buy from this site again and AGAIN, their jewelry is A-1. Thank you", "rating": 3}, {"title": "items wonderful", "text": "items wonderful, well presented - my choice if it comes as appears is gorgeousregistering and paying using the order form was the toughest piece and frustrating. My info entries on at least one page did not line up and corrections took forever. The pages did not seem to look the same as shown in youtube so perhaps I should feel relieved that my credit card number was ever asked for.  I do not know if the order was bogus but still need to pay", "rating": 3}, {"title": "When going back on Ruby Lane site after …item removal", "text": "When going back on Ruby Lane site after purchasing agreement made item was removed so I could not purchase through Ruby Lane. Supplier could not verify. Not sure what happened?", "rating": 3}, {"title": "Payment problem mars my experience.", "text": "The experience was fine up to the point of paying for my purchase. I can't use a credit card directly; I must wait for the seller to call me for my credit card information. Depending at what time they call, they may not reach me immediately at my home number. I would have given my work number as the preferred number, but there was no place to do this. This payment system is very cumbersome and will delay shipment of my merchandise.", "rating": 3}, {"title": "I could not see the shipping details on …", "text": "I could not see the shipping details on the website when I ordered my Lapis Lazuli necklace. It should have shown when I would receive my item. Just ordered it and hoping I would get it soon. In Amazon we are sure of the date when we will receive the items ordered.", "rating": 3}, {"title": "I give 3 star rating because I have to …", "text": "I give 3 star rating because I have to commit to buy before I can see what the cost of shipping and taxes if any will be .", "rating": 3}, {"title": "Very unique items are found on this …", "text": "Very unique items are found on this site! The searching process could be improved but still a wonderful place to explore. A lot of the sellers offer layaway, but then change the terms from what is listed with their item after you purchase it or ask a question regarding layaway. Not right.", "rating": 3}, {"title": "BETTER COMMUNICATION NEEDED", "text": "In general, I have been pleased with this site in the past, but I would appreciate an acknowledgement by the vendors that an item has been purchased and will be shipped.", "rating": 3}, {"title": "Customer service not the greatest", "text": "Customer service not the greatest. Won't buy again.", "rating": 3}, {"title": "Good site access and finding what I was …", "text": "Good site access and finding what I was looking for.  BUT, I was unable to pay for my purchase.  My credit account is viable and yet the same message  came through  . . not able to use my payment method.   I WANT to make this purchase, but do not know how.  I do not like or use Paypal, but will if I have to.  I was given a choice on your site: use a credit card OR Paypal. I chose the credit card but forced to go through Paypal. Then it would not go through.  I want to make this purchase . How do I do it?   Never have had such problems in making an online purchase.   Thank You.", "rating": 3}, {"title": "It would have been a nice purchase …", "text": "It would have been a nice purchase however I received an email that they are unable to fulfill the purchase since they cannot find the item due to the inventory being recently moved. Very disappointing.", "rating": 3}, {"title": "I have several sellers in the last red …", "text": "I have several sellers in the last red tag sale who have blocked me. The purchase orders and invoices were sent to my old email address I don't use. ( My fault-I hadn't changed it with Ruby Lane.) I was able to honor the purchase orders and complete the transactions with a few of the sellers who hadn't blocked me, but can't communicate with the others to let them know what happened. This includes one I have purchased from before.  I would appreciate it if Ruby Lane could send them my new email and let them know I would like to complete the purchases if the items were not already sold to someone else. Thank you.", "rating": 3}, {"title": "UNTIL I GET MY RING IN MY HAND,I RATE …", "text": "UNTIL I GET MY RING IN MY HAND,I RATE TRUSTPILOT #3 THEN A #5", "rating": 3}, {"title": "PayPal is a problem.", "text": "The problem I had was trying to use the PayPal system.  I do not like PayPal because I find that it does not work well and requires extra effort on my part when I am trying to buy something.  I would prefer using my own credit card.  I do not understand why any retail store would use PayPal as the only means of buying their product.  It is a good way to discourage me from buying from that retailer again.", "rating": 3}, {"title": "Cyber Monday...not for me!", "text": "I had planned to make several purchases today during Ruby red tag sale. However, after choosing the items from one of the sellers, I was given the shipping cost for each item and there was no way to determine if shipping cost could be combined before I paid an excessive amount for shipping.", "rating": 3}, {"title": "Check out experience was awful", "text": "The site is user friendly and the merchandise is phenomenal, however my check out experience was very concerning. I paid with PayPal but RL gave me an error notice telling me to try again. When I did, a second payment tried to come out. After canceling that and refreshing the page, it completed my order but then I got an email telling me I still need to pay! PayPal shows my payment as pending but the funds have been deducted. Very frustrating!", "rating": 3}, {"title": "Price increases noticed prior to a \"sale\"...not cool", "text": "I have noticed that before you have a sale, some merchants will seriously increase their prices on certain items to make it APPEAR as if the customer is getting a good deal.  I would suggest that if a merchant doesn't wish to participate in a sale that they simply not participate instead of using this tactic.  It's more than a little shady, not appreciated & doesn't go unnoticed by the consumer.  Ruby Lane might not notice, but I certainly have and it's not an honest business practice.", "rating": 3}, {"title": "I wanted to pay with Amex as it was …", "text": "I wanted to pay with Amex as it was advertised as an acceptable form of payment- but they tried to charge it to paypal which I did not want to use for this purchase- so I did not verify payment- even though I wanted the article-", "rating": 3}, {"title": "I found problems with the …website ordering process", "text": "I found problems with the actual.payment on the website. I had to return to it and couldn't find it. So I phoned the lady who was selling and gave her my card then she sent me the items promptly.", "rating": 3}, {"title": "Good & bad aspects", "text": "Good & bad aspects. Good - loads of great things available. Bad- if you have a problem with an unscrupulous Dealer, they will not help you!", "rating": 3}, {"title": "I never heard from the seller.", "text": "Date of experience: November 08, 2017", "rating": 3}, {"title": "Checkout is a PAIN>", "text": "Date of experience: November 08, 2017", "rating": 3}, {"title": "I thought I would be able to use a …", "text": "I thought I would be able to use a credit/debit card as that appeared to be a choice. I do not have a PayPal acct. Misleading.", "rating": 3}, {"title": "Is more easy to me write  in my first …", "text": "Is more easy to me write  in my first language spanish.I dont know if it is adequated.", "rating": 3}, {"title": "Disappointment at Checkout", "text": "Easy to navigate site but checking out was laborious.I wanted to pay with a Visa credit card but was forced to go through PayPal. It worked but it wasn't my first choice.When adding the item to my shopping cart I was notified that the seller -- Antiques Von Litzenberg -- could not process the request until Nov. 20. Very disappointing.", "rating": 3}, {"title": "Disappointed with my purchase & item", "text": "Disappointed in my purchased & item. My Didn't look as nicein person. No receipt paper work or thank you note.", "rating": 3}, {"title": "The problem I encountered was being …", "text": "The problem I encountered was being block by sellers because they said they did not receive payment BUT I had to go through the checkout to find out how much the shipping cost was and if it was too high then I opted not to buy. So the sellers blocked me. I have to do it this way to see if the item is worth my while. In some cases the shipping charge is more than the product.", "rating": 3}, {"title": "Different ratings as a BUYER vs. SELLER", "text": "AS A BUYER: I have found all the shop owners to be trustworthy, fair and honest.  The few returns I did were hassle-free. There were never any surprises with the things I ordered; everything described fairly and accurately, held to Ruby Lane's high standards. As a buyer, I would probably give the site five stars.  However...AS A SELLER: I closed my shop.  Prices more than DOUBLED since it was first opened. Worse, the process of having to have all my photos \"processed\" was confusing, time-consuming and -- worst of all -- resulted in POOR PHOTOS. Pictures that were BLOODLESS...lacking character...and in many cases, not nearly as flattering as the old system.  Plus: we had to pay for this process.  Unfair.  I have opened a shop elsewhere with better results and more freedom, and have had better luck selling there and on eBay. Too bad.  I would have given this site five starts across the board, if not for this new system.", "rating": 3}, {"title": "Ruby Lane needs some catching up to do …", "text": "Ruby Lane needs some catching up to do to measure up to Etsy. Unfriendly user-face.  Skimpy selection.", "rating": 3}, {"title": "Still waiting on a credit form by the …", "text": "Still waiting on a credit form by the shop owner🤓 Seems to be the last pi ce of puzzle. The shop owner has to send the credit form for me to fill out. In limbo till I get it. Bob", "rating": 3}, {"title": "Five — Except…", "text": "I'd give 5 but for the experience of buying a ring, then getting a refund because it couldn't be found in stock. I really wanted that ring.", "rating": 3}, {"title": "I found your checkout process …", "text": "I found your checkout process difficult.  For example, it was unclear that I could use my paypal account.  The paypal icon looked as if I could use the paypal credit card only, and I do not have their credit card", "rating": 3}, {"title": "Pay Ruby Lane Directly?", "text": "I would prefer if we could make payments to the various vendors directly to Ruby Lane.  The current process is cumbersome and make buying on Ruby Lane difficult, as opposed to ebay and Amazon.", "rating": 3}, {"title": "I actually didn't go through with an …", "text": "I actually didn't go through with an order. I wanted to see how much the total amount would actually cost before placing an order. It would be ALOT better and more efficient if your website allowed us to see the total amount, in our currency dollars and shipping before we go ahead and check out.", "rating": 3}, {"title": "I just purchased an item on Ruby Lane …", "text": "I just purchased an item on Ruby Lane 2x  this morning and once I put in all of my information I got a response that said that there is some problem : See below:\"Oh no! An unexpected problem has occurred.Our staff has already been alerted and will try to fix the problem shortly.This could be a temporary glitch, so you may want to try again in a few minutes, or try going to our Home Page\"We apologize for the inconvenience. Thanks! So I have no clue of what is going on or if I have even purchased the item.   I also purchased another item later and I got the same response!Hopefully if it did go through I have not been billed twice for the same item. Very confusing!", "rating": 3}, {"title": "probably my fault but whn finished i …", "text": "probably my fault but whn finished i wasn't sure i even got the item", "rating": 3}, {"title": "Inconvenient Site to shop. No Credit Cards accepted.", "text": "No Credit Cards accepted. Big turn-off !!! That's not very appealing to clients !!!If for that reason you choose to pay by Check, which I had to do, it would help if they at least gave you an ADDRESS where to mail your Check to, in stead of having to search all over for an Address and then having to confirm it first by e-mail, to make sure that the only Address you found is the correct one to MAIL a Payment to !!! … Very inconvenient to have to mail a Check and waste extra work and time, before an order gets sent to you !!! Under these conditions, will probably not buy there again.", "rating": 3}, {"title": "When you go to pay for an item it can …", "text": "When you go to pay for an item it can be a hassle especially with theCanadians.  it should be easy from start to finish and I quite oftenrun into problems when going to pay.Other then that I am happy.", "rating": 3}, {"title": "All of my emails that come thru ruby …", "text": "All of my emails that come thru ruby lane are now empty. I don't even get the \"red\" ruby lane to click on to get ino ruby lane. It is very hard for me to complete buys due to this. I have written 3 times and still nothing has been done about it. I have not made any changes to my settings. It came on suddenly with no reasoning!  Please HELP me get this fixed!Thank You,Jane Gaumond", "rating": 3}, {"title": "I love the offers however the check out …", "text": "I love the offers however the check out is dreadful.  It goes by supplier and then the payment is also bothersome.  Once logged in, I think the process should be smoother.", "rating": 3}, {"title": "I was confused at first about how to …", "text": "I was confused at first about how to submit my payments. I would have preferred to not use Paypal. I pushed the credit card payment section but it still sent me to paypal.Laurel Durso", "rating": 3}, {"title": "You need to improve your Search …", "text": "You need to improve your Search capability. It is difficult to execute searches, and those searches do not return all the possibilities.", "rating": 3}, {"title": "My experience with Ruby Lane", "text": "My experience with Ruby Lane is very limited as this is my first purchase.I have only one complaint, I wanted to look at my purchase after it was paid for but could not find it anywhere.", "rating": 3}, {"title": "This site is not user friendly!", "text": "Every time I try and look at something that I'm interested in, I have item number or name of shop. I find it very frustrating, I don't find this site very user friendly. It's extremely hard to find item or store. Never seems to be able to find the item. And check-out is a pain also, isant easy to do. Wish they would make more user friendly", "rating": 3}, {"title": "When there are a sale", "text": "When there are a sale, sellers change the prices ... it's not correct.", "rating": 3}, {"title": "OK--MAYBE", "text": "OK! I LIKE RUBY LANE BUT IT SEEMED TO BE MORE COMPLICATED WHEN I USED IT TODAY THAN ON THE PREVIOUS OCCASIONS-----IT WOULD HELP US OLDER GEEZERS IF YOU COULD SETTLE ON A GOOD SYSTEM AND STICK TO IT AND NOT INDULGE IN THIS CONSTANT    ''''FINE TUNING''''  THANKS JOHN", "rating": 3}, {"title": "I kept getting a conflicting message …", "text": "I kept getting a conflicting message that the brooch I was purchasingwas sale pending and I was not able to get into my cart to complete thepurchase becauset his comment kept appearing and I was the onethat was making the purchase.Finally called the seller and she directed me to the correct area tocomplete my purchase.Now that I know the procedure, I am sure I will no longer run into aproblem with checkout and payment.", "rating": 3}, {"title": "Calling Ruby Lane when there's a problem should be possible", "text": "Had items in limbo.  I think I should have been able to call Ruby Lane and was not.", "rating": 3}, {"title": "the web site is fine--but payment is unduly complicated", "text": "the web site is fine--but there is confusion when trying to pay by credit card.  The site says seller will call to get the card info., but the seller sends an email under Rubylane heading saying I shouldbe able to pay directly through the site.  I am in limbo and annoyed.", "rating": 3}, {"title": "Ruby Lane is very quick to find fault …", "text": "Ruby Lane is very quick to find fault with listings.  There doesn't seem to be any compromising or trying to understand reasons for certain descriptions.Their correspondence is not diplomatic.", "rating": 3}, {"title": "Outside USA purchases", "text": "As I Live in the U.K. it's very unclear what the shipping charges are going to be...so I'm not 100% sure what price I'm committing to.", "rating": 3}, {"title": "Shopping Cart", "text": "I have made a number of purchases from Ruby Lane in the past, but have not purchased anything until yesterday.  I found three items which I was interested in purchasing, as I found each item I marked it to be put into my basket.  When I went to my basket, only one item was there, so I had to go back thru all the pages and relocate each item and purchase them one by one.  Why have the \"shopping cart\" feather if you can only put in one item in at a time.  Other that that I had a good experience and will more that likely purchase more items, the only thing I will have to remember is to write down the page # I find items I like and then at the end go back to each page and decide what items  I really want and what ones I don't really need.", "rating": 3}, {"title": "Problem with supplying???", "text": "Purchased a Bogoff bracelet from Vintage Glitz & Treasures on Friday & today on Sunday I receive a refund for my purchase. This item was not in anyone elses cart & it still says \"sale pending\".....what gives?", "rating": 3}, {"title": "Wonderful antiques, no customer protection", "text": "I love the antique items offered on Ruby Lane; the selection is so good that it keeps me coming back. However, Ruby Lane offers next to no protection for customers. In one instance, a seller changed her mind about following through with a sale because she got a better offer privately AFTER the item had been purchased and paid for. In another instance, I was sold a bracelet represented to be 14 KT gold which was actually only gold fill. In both situations, I asked Ruby Lane to intervene, but they always said they couldn't do anything about it, that it was between myself and the seller. I shouldn't have come back after these experiences, but there's no other online platform with such selection in the way of antiques. Be warned, though--Ruby Lane is only as honest as the seller you're dealing with.", "rating": 3}, {"title": "A little difficult to figure out and no way to provide comments regarding bids.", "text": "I am interested in German Bisque Bathing Beauties.  Once I found something, I could not provide comments to accompany my offer.  Often, I will bid/make an offer because the item has a problem, but on your site I was not a le to provide any comments to accompany my bid...so, the owner of the item has no item what my thoughts are concerning their itm.", "rating": 3}, {"title": "not a user friendly site", "text": "I found the ruby lane site not user friendly. First I could not open up my own account, had to log in via Facebook. Hard to find items with the search.Just found it not user friendly.", "rating": 3}, {"title": "THE CHECK OUT INSTRUCTIONS WERE NOT CLEAR.", "text": "JUST HAD A HARD TIME QUICKLY UNDERSTANDING THE CHECK OUT PROCESS.", "rating": 3}, {"title": "Confusing website", "text": "I found signing up and checking out not to be very user friendly.", "rating": 3}, {"title": "sign up not easy and paypal commotion", "text": "The title speaks for itself.  I found it clumsy trying to enter my info to purchase. The address thing was confusing.  I buy online a lot and I never saw anything like it.  I resent being hornswoggled by Paypal.", "rating": 3}, {"title": "Paying is difficult to follow", "text": "Having to choose how to pay, with choices on both sidesof the screen,  is very difficult to follow.  How do I email the seller with questions? If there is a way, I do not see it.  I really hestitate as I always have trouble with Ruby Lane with these two issues.", "rating": 3}, {"title": "Final payment", "text": "It should be at my request to finalize a transaction.  Once I put in an offer, I should be notified if it was accepted and not finalized until I respond.  I purchased something yesterday, got an email about accepting the offer, but before I could do anything the purchase was made.  Don't ask someone for their payment method until the purchase is to take place.", "rating": 3}, {"title": "Item already sold.......", "text": "I see lots of pretty things and have received several nice gifts from RL...but I found a ring and purchased it for my granddaughter's 16th birthday ...only to find out, hours later, that it was not longer available.  Now, I have to look elsewhere....not a happy camper today. renee", "rating": 3}, {"title": "Shop orner's quaririty level are go …", "text": "Shop orner's quaririty level are going down.Purchase circulation don't respond.", "rating": 3}, {"title": "Awful communication", "text": "The person I bought off of did not have what I ordered, so she said I would get a refund, but if I wanted a replacement to email her. I have emailed her twice about it and have gotten no reply. Nor have I gotten a refund or an item from her. I would just like an email back so that I know which to look for, and what is going on.", "rating": 3}, {"title": "Easy to Use", "text": "Promised standards have been met. Delivery mostly ok. It is important to be able to shop with conficence, secure ways to use my creditcard.", "rating": 3}, {"title": "Wait to see", "text": "Very easy to order, but thought I was purchasing a truly vintage gift and discovered that my silver gift has a hallmark of 1980.Will hold judgment until items are received (no delivery date mentioned).", "rating": 3}, {"title": "Need to see detailed photos of item and the phone numbers of vendors right after a purchase", "text": "I purchased something quickly, and then the detailed pictures were nolonger accessible when clicking on the item on the Ruby Lane email.  I have an important question about the product Ipurchased which would have been clarified had I still been able to seethe detailed pictures.   I decided to call the vendor, but the vendor's phone number was not shown.  Only the address was shown.  An email was available and so was Skype, but the vendor did not answer my Skype call. So, I am waiting for an email response.  I am nervous about having purchased something without being able to clarify my question.  I think the detailed pictures should be available to apurchaser even after the purchase, plus the vendor's phone no.  should there still be a questions about the item.Usually I find Ruby Lane very good, but this time is a bit disappointing.", "rating": 3}, {"title": "Brooch", "text": "Website very difficult to navigate and does not facilitate comparison shopping nor even finding same again. This site requires perseverance! And am I really supposed to be motivated by how many have the same item in their cart or wish list?", "rating": 3}, {"title": "Lovely Site but Beware of Ridiculous Shipping Some Sellers Charge", "text": "Ruby Lane has beautiful merchandise and many great sellers.  Their prices are wicked high compared to Etsy sellers of the same items but waiting for a sale is fun shopping - usually.The problem is their system for determining shipping.  Their latest sale is a great example.  I had four small silver items totaling less than 100$ after sale price from one seller.  Shipping was over $17 and then the insurance was another $8 plus.  I do a lot of shipping and the cost to ship, with insurance, in a box should have been around $6, including insurance.  This happened with 2 other sellers . did not order and left the site after ordering the one item that was fairly priced for shipping.  This was too bad because I would have placed some substantial orders but not with their insane shipping.  The person from whom I purchased promptly contacted me with a shipping date and friendly info so that was really great.", "rating": 3}, {"title": "difficulty with purchase. recorded phone message was confusing", "text": "I nearly gave up on the purchase because of difficulty with password., address ,credit card etc.Old password didn't work then hassle with getting new one.But I wanted the doll very much so I just stuck with it and did get my purchase.I like Ruby Lane in general and prefer to purchase with RL more than ebay or others on internet.", "rating": 3}, {"title": "Unnecessarily complicated .", "text": "Innecessarily complicated to pay when NOT using pay pal. It seems as though the site keeps trying to push PayPal. Also complicated to access past purchases on buyers account.I am still very fond of Ruby Lane!", "rating": 3}, {"title": "Expensive and difficult if not impossible problem solving.", "text": "Brand new customer.  Ordered on impulse and IMMEDIATELY changed my mind.  Within a minute .  nowhere to go, no help to be offered.  Retracting a bid within a minute should not be impossible.  an hour of doing what I could later. I hope I cancelled my bid with newbies apology", "rating": 3}, {"title": "Ruby lane review", "text": "Ruby lane has some great vendors, but sometimes it's difficult to get a response.  It makes you feel like you are floating out in space when you can't communicate about an item after purchasing it.  I have been told that gmail looks like spam to many ruby lane vendors.  Not sure that's true or not.", "rating": 3}, {"title": "info", "text": "I wish more information was provided about items I'm looking to purchase by sellers. Also, it would be nice to know what criteria sellers must meet in regards to authenticity. Thanks!", "rating": 3}, {"title": "unwanted emails", "text": "wrote 3 times about unwanted emails - they listed things supposedly on my wishlist > but none of them were something I even looked at, nor would I ever be interested in - can't get them to stop sending", "rating": 3}, {"title": "no resolve", "text": "had issue with seller regarding quality not described and timing of returning item due to health issue. there was nowhere to go to resolve issue.  seller profitted even though some charms on $300.00 [?] bracelet were plastic not silver.", "rating": 3}, {"title": "ordering items", "text": "An ok experience with a minimum of confusion.", "rating": 3}, {"title": "Would be better if all items would ship to Canada", "text": "Would be better if all items would ship to Canada. Other than that the site is great", "rating": 3}, {"title": "A little site clarification would make things so much better!", "text": "I just attempted my first purchase on Ruby Lane.  I am a long- time buyer on Etsy and E-Bay, looking for vintage bakelite.  I tried to make a purchase, used Pay Pall, which has always been so easy.  My offer was accepted, I indicated I would pay with Pay Pal, and expected to see the transaction completed.  Instead, I get a message about an \"open purchase order\" (????)and was given instruction to get into my account, go to \" open purchase orders\" and (again??? what next???).  I called the dealer, explained that I seemed to be unable to  complete the sale.   Told her I would try again, and get back to her, but that I definitely wanted the brooch.  I tried again, and this time I found the Pay Pal button which was so far below the text of the message that I hadn't seen it.  I did pay, and called the dealer again to tell her I thought the transaction was completed.   Dealer is great!  We had a good laugh about it all.  I'll know better in the future, but my first-time trying to navigate my way to the conclusion of the sale was iffy.", "rating": 3}, {"title": "Great site but I had difficulty creating an account", "text": "Excellent website, well organized, looks like a lot quality material. I found what I was looking for and purchased. My \"friction\" was creating an account. It could be me, but I kept getting looped around to entering the same info. Gave up and used the Facebook option. Was susscessful logging in.", "rating": 3}, {"title": "Overpriced shipping on some stores.", "text": "I started to order a vintage hat. The shipping for one hat was over $20. That is a huge ripoff. It is not honest. Beware before you order from shops you are not familiar with. Others have been perfect and came well protected.", "rating": 3}, {"title": "Forcing my to log on via Facebook - why?", "text": "I have (had?) a Ruby Lane user ID and password. When I entered the password it came back as incorrect. When I requested a new password I was prompted to log onto FB and use those credentials to change my password. I don't want to log onto RL via FB, I just want to reset my RL password. I tried several times with no success. I was forced to log on via FB in order to complete my transaction. Why???  I can understand if you want it to be an option, but you shouldn't take away my RL credentials just because I have a FB ID that is tied to the same email address. My transaction was smooth, but the log on process was a nightmare.", "rating": 3}, {"title": "The check out process was confusing", "text": "The check out process was confusing when it got down to method of payment. Usually, when you check credit card the boxes comes up to get your credit card info. Your method kept you thinking you were paying by PayPal. I would have been checked out in a jiffy if it were not for that.", "rating": 3}, {"title": "I typed in half dolls and never found this item.", "text": "I typed in half dolls and NEVER found this item.  I then typed in her name and still COULD NOT find this item!!!!  Finally I had to call another shop owner and she THEN told me how to get into Mary Janes Poley site.This site definitely needs to be more user friendly.", "rating": 3}, {"title": "If I ask for \"red hats,\" I want to see ONLY red hats.", "text": "This site is not fun.  I am very tired after trying to navigate ONLY hats.", "rating": 3}, {"title": "Mediocre website", "text": "I STILL am unable to complete a sale- filled out form five times- was given no option for font nor a place to enter check information or address for seller.Please contact me regarding the above- I would still like to order the necklass", "rating": 3}, {"title": "Slogging thru' the PayPal Jungle.", "text": "The often complex extra steps of using Paypal, the difficulty in finding Paypal instructions, and the necessity to change their unchangeable default payment source (e.g. bank vs credit card) has caused me troubles before when buying from sites which use it.  Paypal is NOT always intuitive.  On my order tonight, I was redirected to the Paypal site,  which caused me to leave Ruby Lane.  Once there, I was taken to a dead-end page.  I had to re-google and go to Ruby Lane again. There, my cart was empty even though my order was unfinished.  I finally managed to find and complete the order by going thru' \"My Acccount/Orders.\"  Lots of extra time & frustration.  If Amazon can let a customer pay with a credit card to Amazon and sundry other Amazon Market Place vendors........why can't EBAY and Ruby Lane devise a simple credit card method?  The PayPal struggle earns a 2 star demerit.", "rating": 3}, {"title": "Trouble Updating Address with iPhone", "text": "I didn't remember what my password was, so signed in with Facebook account option. Selecting treasure and getting to checkout was easy, but since I was signed on with Facebook, Ruby Lane needed my address. Updated my address with a lot of trouble because the form doesn't reduce in size or scroll or shrink to fit the iPhone screen. Finally using both hands, one to hold the form in place and one to click ok, I was able to complete the transaction. Initially selecting PayPal Credit got to PayPal with \"infinite spins\". Canceled PayPal screen. Email at least let me know my purchase was committed but trouble getting into Ruby Lane with Facebook because again the screen presumes you are on a large screen computer. Managed to complete the transaction. Make iPhone friendly, please.", "rating": 3}, {"title": "the philosophy of a global online store", "text": "Rubylane is the greatest international antiques shop window, and I often find here very special pieces. I'm very grateful for this, but I must add that sometime the sellers are unreasonable, because the shipping costs are too high and even more because often the American sellers use Rubylane   showcase  but they then not send to other Countries. This seems to me unfair and  contrary to the philosophy of a global online store and I think it constitutes a major handicap.", "rating": 3}, {"title": "Trouble with password", "text": "I ended up using a different email account because my password was denied. an email to reset my password was never received.", "rating": 3}, {"title": "Complicated", "text": "I would like to purchase without  having to wait for an email from the seller.this makes the process too long and complicated. Even though Ruby Lane has lovely things.", "rating": 3}, {"title": "Hard to Contact", "text": "I'm attempting to buy an item from a shop that offers layaway for 3 months, but there is no way to just purchase it that way. So I contacted the owner, and she got in touch with me once, saying she would rather just give me a discount. I explained that I'd rather do the layaway since she offers it, and asked how we get started. She never wrote back. I have written three times now with no response. I went back to her page and made an offer for almost the whole price. We'll see what happens, but with no contact, someone else could still buy it and I will be very disappointed if that happens.", "rating": 3}, {"title": "DON'T LIKE NOT KNOWING", "text": "I DON'T LIKE BEING ASKED TO PAY IN ADVANCE WITHOUT KNOWING WHAT MY TOTAL IS.", "rating": 3}, {"title": "Trouble in ordering!", "text": "Tried to make an offer on a product but after about an hour gave up. I couldn't make an offer ,it would not print my offer. It kept going to the full price and total on its own.", "rating": 3}, {"title": "CART CONFUSION", "text": "Seemed to have 2 different carts for 2 separate postcards.Got confusing,but it's my first time purchasing from you.", "rating": 3}, {"title": "High quality as regards the protection of clients. Research of object to be improved", "text": "A positive experience; you feel guaranteed and you appreciate the expertise and correctness of the vendor.As thousands of objects are offered, please insert new filters regarding their tipology and age, not only their price.Please send a confirmation mail to the potential client Who sends mails to your associates.Best regards", "rating": 3}, {"title": "Too disconnected with buyer", "text": "After the order all responsibility shifted off of Ruby Lane. If I order from someone I don't want them left out of resolving any issues.", "rating": 3}, {"title": "18k gold dagger pendant", "text": "service was quicker than I expected.  the item looked like what I was looking for, but because it only had 1 view, I had no clue that both sides weren't the same.  the one we were trying to replace looked the same on both sides.  for the price, I guess it's what it should be, but I was hoping it was like the one my husband had lost and no one turned it in.", "rating": 3}, {"title": "Charger", "text": "I wanted to order two brass chargers. I could not tell how to increase the order. I tried selecting it twice but it kept saying one. If I can get it increased to two before it ships that would be great. Otherwise I'll have to place another order.", "rating": 3}, {"title": "not happy with checkout and payment on account.", "text": "I am an older customer and every time I wish to buy something or make a payment on my layaway. I get so frustrated I quit trying to finish the order and payment. Unhappy, but want to remain a loyal and payment oriented customer.Regards,KathrynGoesInCircles Herbert 07/01/2016", "rating": 3}, {"title": "sellers not cooperative....prices not as competitive", "text": "I buy tons of stuff from Ebay which has its own set of perils. I expectbetter from R/L it being a smaller outfit. But found it disappointing in a couple of ways. Sellers are not as helpful and prices are higher than on Ebay; so whywould I buy here is the same item is available elsewhere?Also their messaging system is rather poor and cumbersome. In this technologically advanced age they can make it more functional.", "rating": 3}, {"title": "It's okay", "text": "Stone was loose. But it was a very nice ring and way better than picture", "rating": 3}, {"title": "Just OK", "text": "OK ~ required account is annoying and not safe ~ otherwise OK", "rating": 3}, {"title": "Needs some tweaking.", "text": "Nice site, but it seems kind of inflexible or not well explained to its sellers. My seller was trying to figure out how to charge a different price for additional items purchased simultaneously, and she wasn't able to make the site do it. Hopefully, the refund for the difference will go through without any trouble.", "rating": 3}, {"title": "Great products", "text": "Great place to find vintage items, not favorable of membership fee(s).", "rating": 3}, {"title": "Interesting vintage selections, checkout process a bit touchy...", "text": "I like the vintage offerings on Ruby Lane.  As with any resale shop the value can be questionable but buyers should be aware of that fact. My only reservation with shopping at Ruby Lane is with the checkout process.  Ruby Lane doesn't follow the same process as most other online checkouts. Specifically, there is no place where it asks for the delivery name and address before making a payment.  As far as I could tell, my address information wasn't in my account information either (and I was a bit concerned as I have moved since my previous Ruby Lane purchase). I sent my address information to the shop owner for my purchase and I hope that will work out satisfactory.", "rating": 3}, {"title": "Rubylane could do better", "text": "Rubylane could do better-\rfirst customer service is by appointment,it is slow in responding .\rsecond,it has a seller feedback system which allows seller to hide negative feedback.\rThird,Rubylane staff does not understand payment processing-like Paypal  disputes and credit card chargeback,how it works and how it should respond,if the seller is using RB account to accept Paypal payments.\rFourth,it needs to discipline bad sellers,how can seller threaten her customer by posting derrogatory lies and insults,name and address on a public site.,when seller is dishonest and sell items which is not as described.\rRubylane has fallen behind,it has a lot of catchup to do", "rating": 3}, {"title": "Very confusing to pay", "text": "I found a pair of earrings and put in an offer. I was contacted by RubyLane that it was accepted.  It said that the store owner would contact me by phone.  When the store did not, I called the store and spoke with an owner.  He said that customers are invoiced by PayPal, which is perfect.  RubyLane is sending out the wrong information and if I had not called, no purchase could have been made", "rating": 3}, {"title": "Sometimes transactions do not go through", "text": "The problem with buying on Ruby Lane is it shows sale pending for a day for today's arrival then another person comes in and offers more money to buy from the dealer then I sometimes receive a message from the dealer stating that she had made a mistake and could not accept my offer even after she had sent me a sale confirmation previously.  Hope Ruby Lane can be like Etsy that after an order has been paid then it can be removed.  Quite often I feel I am wasting my time shopping on the site.", "rating": 3}, {"title": "Wow...that was hard!", "text": "Not a very user-friendly site...for buyers OR sellers. I used to be a RL seller, and just thought it was difficult from the seller's side. Silly me.", "rating": 3}, {"title": "sellers should accept paypal balance payments not just credit cards", "text": "not everyone wants to use their credit card and my seller only accepted cc payments thru paypal but not my paypal balance. waste of time.", "rating": 3}, {"title": "I had a difficult time getting on PayPal when I was already signed up for it !?", "text": "I liked what I purchased and what I paid for it. Bernard Martin", "rating": 3}, {"title": "okay", "text": "have no comment", "rating": 3}, {"title": "Ruby Lane Silver Purchase", "text": "Ordering more than one of the same item is complicated and not intuitive.  I was a few seconds away from cancelling the purchase all together.  We'll see how the processing and delivery of the product goes.  Had they not had exactly what I wanted, I would have shopped elsewhere.", "rating": 3}, {"title": "site does not always work.", "text": "Very frustrating experience.  Tried to make an offer a d box to do this would not respond.  I ended up wondering if I really bought item.  Difficult site to use. ,Hard to find information.", "rating": 3}, {"title": "Why am I asked to review my purchase when I'm waiting to hear back on my bid?", "text": "Not sure why I'm asked to grade my purchase when I'm still waiting to hear back from the seller regarding my counter-offer.  This request for my opinion is a bit premature.", "rating": 3}, {"title": "my purchases", "text": "Not all my purchases were acknowledged", "rating": 3}, {"title": "AuBonMarche 1800 feedback", "text": "These items finally arrived 2-29, bought and paid for 2-9.  Little French glass lidded box is very nice and I'm pleased with that.  Opera glasses have one missing lens, otherwise fine.\rSeller kindly included a tiny doll ring to \"thank me for my patience\" because it took her 16 days to send off these items to me.", "rating": 3}, {"title": "Good until time to check out", "text": "Love the site and items but check out is always difficult.", "rating": 3}, {"title": "Questionable vendors", "text": "Purchased item from overseas vendor and submitted cashiers check payment to vendors address. Shortly after, \"Vendor no longer on RubyLane\"notice given within one week of purchase…struggled to communicate via private email with vendor since RubyLane form of communication was terminated\r Purchased item from local vendor who stated he was going out of town and could I change my check payment method to card ? Tried to accommodate his urgent time line needs which failed, resulted in vendor taking the item out of my cart. I contacted vendor and expressed remaining interest in the item. Item was offered again, followed through with purchase order on iPhone, waited for vendor confirmation to submit card info, all while at work. Vendor felt I did not comply quickly enough and left nasty message on my home line requesting I cease any further purchase.", "rating": 3}, {"title": "Only in English ?!", "text": "Text on RUBY LANE should be in serveral important idioms/languages :-(\r not just in ENGLISH (only)", "rating": 3}, {"title": "I wanted to pay by my own visa but was obliged to pay by pay pal", "text": "This purchase was only made today so it will be a few days or so before I can make a true judgement. I look forward to receiving my purchase.", "rating": 3}, {"title": "using ruby lane", "text": "im just not used to this site and did not find it easy to use", "rating": 3}, {"title": "Only One Complaint", "text": "I don't understand why Ruby Lane doesn't accept Paypal Credit although\ryou accept Paypal.  This revolving charge account with a 6-month interest-\rfree balance is convenient for me when making larger purchases.  I sometimes must forego shopping with merchants who don't accept\rPaypal Credit.\r Please explain.", "rating": 3}, {"title": "Love the jewelry", "text": "Love the jewelry, but had some trouble with the website when ordering.", "rating": 3}, {"title": "Sellers Opinions Don't Always Matter", "text": "As a Ruby Lane seller, I value my reputation for honesty and integrity. When the Ruby Lane administration disagreed with me over the date and originality of one of the items in my shop, they did not ask me to verify my description of the item, or state the specific concerns they had about it. The item was simply removed from my shop. The description was not even allowed to be modified to their satisfaction. The message I got was either:  I am dishonest, or that I am ignorant of the types of articles that I have been handling daily and selling for 35 years. A bit of a slap in the face to a professional dealer who dutifully pays her shop fees every month.\r That said, as a dealer, Ruby Lane is an easy platform to launch a small business from. It is relatively inexpensive, easy to use for buyers and sellers, and reaches a wide audience. I have close to 300 customers through Ruby Lane, most of whom are repeat customers. That said, their interactions with the dealers on their site could be improved.", "rating": 3}, {"title": "Purchase Order", "text": "Can not print a copy of the purchase order", "rating": 3}, {"title": "Ruby Lane is great... but needs a techno bump", "text": "Ruby Lane is terrific.... with lots of variety and wonderful vintage goodies to chose from. A great place to go if you simply \"want it now\", with no auction messiness to deal with.\r The site works fairly well and is mostly easy to use. But.... using it on a mobile devise is very challenging. This needs to be addressed. A RubyLane App would be best- particularly as your competitors already have them.\r Keep up the good work... and keep improving!", "rating": 3}, {"title": "need to show total cost sooner", "text": "I love the merchandise but want my total payment do quicker", "rating": 3}, {"title": "Signing up didn't go smoothly", "text": "I think it wasn't obvious at first that I had to sign up or how to do it, and then when I clicked on Sign Up it still didn't go smoothly", "rating": 3}, {"title": "Wishlist user experience improvement", "text": "Hello - a couple of points that would improve the user experience.\r1. A wishlist item is unable to be updated (edit, move or remove) when a shop has been removed or is no longer a part of RUBY LANE. The item remains in your wishlist.\r2. When the number of items has been exceeded on a wishlist, the option to remove does not work.  I needed to use the edit function to 'remove'. \r3. Several times I have been advised my wishlist is too big - please increase the number of items allowed. Most sites allow a larger number of items to be captured e.g. 500.", "rating": 3}, {"title": "getting through", "text": "I ACTUALLY SPENT A LOT OF TIME TRYING TO GET TO WHERE I COULD SEND A QUESTION ABOUT SHIPPING.....VERY HELPFUL UNTIL I WANTED TO KNOW SOMETHING IMPORTANT...COULD IT BE MADE MORE ACCESSIBLE...REGARDS LYN", "rating": 3}, {"title": "I'd like to be able to talk to owner while making purchase", "text": "I needed to talk to the owner regarding shipping and had to wait for a phone call to get the credit card info.  I prefer to handle my shopping in one setting.", "rating": 3}, {"title": "Guanyin purchase", "text": "Instant checkout would be better-along with better search filters. Ex: when I was looking for antique religious medals, a ton of rosaries came up. It would have been nice to have been able to use exclusion words like EBay.", "rating": 3}, {"title": "I had trouble ever finding the shipping method and now I must deal with the shop onwer whom I have contacted to get the shipment changed to Next Day Air or 2nd Day Air and hope it'll all work out.", "text": "I am always amazed at how difficult it can be to speak to a real person.  The age of customer service has gone away when we have to rely on a geek who created a web site to think like how it will work with normal people.", "rating": 3}, {"title": "Ruby Lane", "text": "This website is not the easiest site to check-out of.  When one wants to pay for their items, it is not straight forward, it is a little bit of a pain. I also don't want anything attached to my Facebook or anything else. Please steam line the check-out process.", "rating": 3}, {"title": "The bidding process was not clear.", "text": "I ended up paying the full price even though a lower one was offered during the bidding process.", "rating": 3}, {"title": "they need a mobile app!", "text": "I do love ruby lane. Every lane i have purchased from has been wonderful people. Great items, great prices. My pronblem is navigation. Just like 75% of the population that buys online, i do it with my phone or tablet. It is near impossible to navigate through without an app.", "rating": 3}, {"title": "navigating the buying and check out system", "text": "The system Ruby Lane employs to checkout and pay for ones selections is very cumbersome especially when you have to wait for the owner of selected items to respond with a total and payment method. \rthe selection and descriptions of the books is very good but the checkout procedure need fixing", "rating": 3}, {"title": "Site good.  Listing photos awful.", "text": "Buying experiences have all been positive, but I HATE the new picture processing every listing now must go through. The initial photos looks bloodless. The items look dull, dreary, lifeless. I'm surprised that sellers are willing to put up with this. The merchandise on Ebay, Etsy and other online sites is way more tempting, with much more visual appeal.  Because of that, I have been buying many more items from those sites than from Ruby Lane. In terms of how I have been treated by various sellers and the general Ruby Lane experience:  5 stars.  But the items now look so unappetizing, I'm giving you just 3.  Sorry, guys.", "rating": 3}, {"title": "Payment was more than a little confusing.", "text": "Being that I just ordered the item, I can't comment yet on the delivery process.  It was truly confusing the way your bill payment is conducted.  I shop on line all the time and this is the first time I've encountered anything like this.", "rating": 3}, {"title": "Received a Smashed Antique Clock and No Customer Support", "text": "While I enjoyed browsing the site, my actual purchase through this site has been a complete nightmare.  I purchased a small antique clock.  When it arrived the glass on the face was smashed.  I was told that it is my problem as I paid for shipping insurance as part of the cost.  So now I am embroiled in on-line form-filling, scanning and pdfing to try and get my money back.  I am the only one who had nothing to do with how the package was shipped or treated in transit and yet I am doing all the work to resolve the problem.  I will never do this kind of on-line shopping again.  I am very disappointed in how I am being treated by the seller as on my own when none of this was my fault. I just want my money back!!!.", "rating": 3}, {"title": "A bit confusing!  But turned out well in the end.", "text": "I sent an inquiry about the product I want to purchase.  I didn't get any answers, just reply e-mails saying they got my message and someone will get back to me.  Nobody did.  Since the website says \"easy return policy\" I decided to go ahead and make the purchase, although my questions were not answered.  When selecting a payment option of what I thought would be my credit card, it said I would have to go through PayPal which I didn't want to do.  I then selected \"alternative method of payment\" and the website said the seller would be contacting me by phone.  In this day of e-commerce, this is a lot of work to purchase one item.  Not sure why they can't just take my credit card and be done with it.  Still playing phone tag with the seller.  If I didn't need this very unique item so badly, I would have cancelled the order, but I'm still hanging in there.  Hopefully the quality of the product if & when the order is processed, will make up for all of the hassle.\rUPDATE:  Seller did contact me within a reasonable time frame and the transaction was completed by telephone.  Follow up was excellent with an e-mail from the seller regarding ship date, anticipated arrival date & tracking number.  Also received a confirmation from the shipper.  It's all good, although it took a few extra steps to accomplish.  Upping my review from 2 to 3 stars.", "rating": 3}, {"title": "No review on stores and  uncomfortable communication", "text": "It uncomfortable to communicate with shop owner and to respond ,also no review of store", "rating": 3}, {"title": "Everything Great, Except One Issue", "text": "I placed an order on Ruby Lane today.  The site is user-friendly and seems to have nice stuff and reputable sellers. However, I wanted to be able to use my billing address as one address (associated with my credit card) and my shipping address as another (because I wanted to send the item to a place where I knew that the package would be kept safely for me until my arrival in the evening - we have had packages go missing around this time of year last year in my neighborhood - because of the holidays).  Anyway, apparently Ruby Lane doesn't permit that, and when I tried to get the seller to accommodate me, she didn't want to, claiming there were issues associated with it.  I don't understand why Ruby Lane doesn't permit this - Etsy does - and quite frankly, it's an issue for those who want to send gifts directly to someone other than themselves.", "rating": 3}, {"title": "Response regarding damaged merchandise", "text": "I ordered an inkwell and received the item promptly. However, it was damaged in shipment. I contacted the seller and still have not heard anything from the seller after a week.  Although there are many wonderful items on Ruby Lane, I am hesitant to risk another order with the same results if the merchandise should arrive damaged. This was my first order with Ruby Lane and am disappointed in the outcome.", "rating": 3}, {"title": "Good point and challenges", "text": "It is a fun want products at most. When you want to buy a commodity, to offer to the shops. That I mean I did not know well. For the first people who want to buy, you'd need a polite description of each language.", "rating": 3}, {"title": "Not my favorite.", "text": "If you want to see a category... say \"yellow gold rings\" you get a mishmush of things including, often items that have nothing to do with gold rings.\rWhenever I have purchased they take their time to mail out. For example, I just bought a ring, I'm paying expedited shipping... and three days after the purchase it still hasn't shipped. Waste of money.\rVendors don't respond very quickly to questions and sometimes not at all.\rI like that I can return things if they don't suit, but overall I think you could improve customer service and tighten up your categories so that if you want to see specific things other items aren't thrown in as well.", "rating": 3}, {"title": "UGLY WEBSITE", "text": "All I want to say is that Ruby Lane has a SUPER UGLY WEBSITE and needs to get with it !!!!\r It needs to be MODERN, SMART, AND EYE-CATHING !!!!", "rating": 3}, {"title": "Great site but the checkout process did not go smoothly.", "text": "My recent experience with Ruby Lane was my first.  I like the site very much and found exactly what I wanted.  It was difficult to complete the registration and purchase process on the website, however, and I had to contact the site through their chat services.  It took over 15 minutes on chat, but the problem was satisfactorily resolved.  The person who assisted with that solution was \"Sunny\".  I found him/her knowledgable, friendly, and helpful.  I will definitely use the site again, but when the website is updated, please consider making the registration and purchase screens easier to navigate.", "rating": 3}, {"title": "You ask too soon!", "text": "I ordered,and purchased. The product is now \"in review\" for sale.\r That leaves THREE parties wondering: Seller, Purchaser, Person on Want List.  Stupid.\r It's Sold or Not Sold.  If Sold fails, then it;s Not Sold.\r There is no \"Maybe\", and you really irritate people this way.", "rating": 3}, {"title": "Vintagediva purchase", "text": "The $150.00 I paid for the dress is too expensive; no designer name, looks cheap.  Thank you.", "rating": 3}, {"title": "good producs mosly good cendors, terrible website", "text": "Your vendors sell mostly good products\rI have been a good customer for years.\r Your website is terrible.  It won't recognize the names of shps\rwhich actually list their shop names exactly as I type them -\rand if for example I type in Marie Wu it says no such person,If I\rtype in Marie Wu Eclectic Art it says no such shop---but that is\rTHE NAMEOF HER SHOP.  REPAIR THIS EASY TO FIX ERROR", "rating": 3}, {"title": "Ruby Lane is great", "text": "Sometimes difficult to relate with dealers.  I don't always know how to communicate my amount of my offer.", "rating": 3}, {"title": "Your site makes it very hard to buy someone a surprise gift from their wishlist", "text": "A customer should be able to view someone's wish list to buy a surprise gift without having to know the person's username and password.\r As it is, I have to sneak into my wife's account and view the wish list.  Then I have to go to the dealer and get the item number.  To complete the purchase as a surprise, I need to get into my account, but that is impossible because when I come back in to Ruby Lane, the site insists that I am my wife and has nowhere to log in as myself.  \r So, I must go to a different computer to log in under my account and complete the purchase.  This all seems a little clunky.\r Thanks.", "rating": 3}, {"title": "Ruby Lane Purchase", "text": "The item bought is on the way to me at this point. It has not arrived. The listing stated World Wide Free Shipping and when check out came a $19 shipping and handling charge was added to the invoice total that was called \"Insurance\". What a misleading bunch of garbage. International insurance is the biggest joke. I will update my opinion as the transaction evolves. So far I would ask more questions before making another purchase from anyone. The website name \"Ruby Lane\" means nothing when the truth lies in the facts and details. I'm not impressed at this point.", "rating": 3}, {"title": "Love the variety, did not like the site.", "text": "Great variety and search capacities.  Navigating the site was another matter.  Could not get my pc or Mac to allow me to enter my mailing and billing addresses.  Finally got that done accidentally when I was looking at my account.  Please set up some processes for approaching your site like a first time potential customer.  THe merchant I was dealing with saved the day and allowed me to buy an important (to me) gift.", "rating": 3}, {"title": "Advertising & Features", "text": "I love the design and overall RubyLane website.  As a seller and as a buyer there are a few things that I recognize need improvement and changing.  One as a seller, I never see RubyLane offering paid advertising, yet they collect monthly fees from us for the sole purpose of advertising.  They may have social media websites, however, they are all free for everyone.  In addition, when one joins Ruby Lane they offer no support to sellers, such as, featuring new sellers possibly weekly, allowing buyers to see what new sellers have joined and what they are offering.  To have R/L publish a list of all new sellers in an alphabetical list, is not my idea of seller support. I hope they will take a serious look at their advertising and better support of new sellers.", "rating": 3}, {"title": "choice of paymrnt source", "text": "They should use ofer other credit cards as a source of payment besides PAPAL", "rating": 3}, {"title": "Purchasing an item = Agonizing experience", "text": "I can't believe how complicated RUBY LANE site has made trying to purchase an item.  It may only be a one time use for sure! The seller was more than helpful and I haven't received the purchase so this is NOT rating the item purchased or seller, just the complicated Ruby Lane", "rating": 3}, {"title": "COUNTEROFFERS", "text": "Ruby Lane needs to explain how to process agreed-upon counter offers.  Twice now I've made a counter-offer to a store that has been accepted.\rNowhere is it explained how to process these agreed upon counter offers so that the merchant can adjust the price.  AAAAGGGGHHHH!!! Gives me a royal headache trying to figure out whether or not I handled it correctly.", "rating": 3}, {"title": "Time it takes to bring up photos of the goods for sale.", "text": "I find that it takes far longer to wait for the photo of the goods I`m interested in to finally take the page. I get sick of waiting and click off. I`m sure it was much faster  2 months ago. has it been changed?", "rating": 3}, {"title": "confusion about pay pal connection at check out", "text": "The site was fine .... the check out was confusing.  I don't like confusion when it comes to making payments through pay pall.  It is not a financial organization I  trust b/c of their lack of clarity and transparency. \rI will be able to make a complete review after I receive my merchandise.", "rating": 3}, {"title": "Nervous.", "text": "I found what I needed with ease. Then I tried to pay. The site crashed. I did get an email confirming a purchase order, but i have no clue if my credit card information went through. Later I logged into my account (I am a first time user) and I tried contacting the seller through RubyLane. When i submitted my email the site crashed again! I don't know if that went through either. I can tell you I am extremely nervous. I am buying a gift ...now I'm not sure what is happening with my credit card or if I will get the gift I have been searching for over the last 6 months.", "rating": 3}, {"title": "New Customer", "text": "In entering my new information, I found the web site difficult to get around. \rI'm sure my purchase will arrive in good shape.", "rating": 3}, {"title": "Confused as to what to do.", "text": "With all the different dealers it is hard to know what to do. Some take credit cards others want checks and then you have to search for the address and person to send the check to. It would be nice to print out the payment and the address for those wanting checks and how to make it out and to whom. That would make it easier to complete the order and to keep a record of your order. It would all be on the printed summary page.(one page)", "rating": 3}, {"title": "Fair resource-needs better organization, classification system and integrity process in weeding out shoddy vendors", "text": "I've used Ruby Lane periodically but have found myself disenfranchised over some of the vendors' misleading statements about the quality of the jewelry construction or the jewels themselves.  For example, \"stones\" that were \"tested\" and found later by my jeweler to be fake or the stones themselves were loose and lost within two weeks of purchase.  Further, they should incorporate a better system by which the vendors can list age of the product they're listing to better classify products as new, vintage or antique.", "rating": 3}, {"title": "Fakes and misrepresented items", "text": "Rubylane is billed as \"The world's largest curated marketplace for vintage & antiques.\" but there are a lot of fakes and misrepresented items.   Apparently, only another seller can report an item.  I have returned several items because they were not as represented.  In all cases the item went right back on Rubylane without any change in the description.  If the site is truly curated, then returns should be monitored and the reason for the return , if reasonable, should be required to be added to the items description.", "rating": 3}, {"title": "The Good and the Bad About Ruby Lane", "text": "Ruby Lane has a wide selection of merchandise, but I am not fond of the way items are listed or managed.  It's hard to tell sometimes when something has been sold and there is no database of sold items for research or comparison within or outside of the site.  The search engine isn't specific enough and leads one to get unwanted listings.  The payment procedures are easy to use and the want list function is good.", "rating": 3}, {"title": "Make An App Please", "text": "It would be a way better experience using an app instead of a mobile browser.  Your competitors have had apps for ages!!", "rating": 3}, {"title": "hmmmmmm", "text": "2 good purchases, 2 bad out of 4 total - it's difficult to trust internet for\r purchases of jewelry which all my purchases were. I'm not confident in trying again - i continue to window shop; until i see something fantastic i have to have!", "rating": 3}, {"title": "Annoying and unnecessary emails", "text": "My review is to stop completely those -\r \"your opinion is important for us.... \" \r Emails you forward me every time I take action on your site. \r I found some cool stuff and got replies from sellers.  In total will spend around 700 USD and those annoying emails you keep sending me are totally ruining my experience. \r Have some confidence and stop begging for reviews. It's weak.\r Hope you take this the right way. \r Very best.", "rating": 3}, {"title": "I am very Happy to finally get these PINK boots.", "text": "I was not HAPPY when I tried to sign in and couldn't get My password to go thru.  Finally I saw the (forgot password) and put in a new one.  If it continues to go thru I'll be Happy.  I have stopped buying from one seller because every time I started to buy something I got WRONG password.  That is very irritating!!!  I just figure I'll wait and see.  I will send check for shoes tomorrow and have paid for boots.", "rating": 3}, {"title": "Site was difficult to sign up/sign in for.", "text": "I was trying to order something during your Red Tag sale and it took me over 25 minutes to make your site happy.  It even told me the password I'd used 10 minutes prior was not the correct password and made me go through all the frustration of changing it.  Fortunately, I did not lose my item.", "rating": 3}, {"title": "hard to use", "text": "I have found it difficult to bid on Ruby Lane.\rThis morning my bid offerings never reached\rthe seller.", "rating": 3}, {"title": "The postal charges, communication and make an offer", "text": "Some of the sellers refuse to give more than one option for postal charges, sometime double the cost of the item to be posted which leaves the buyer the only option, to withdraw.\rI prefer to communicate throug Ruby Lane site, not my email.\rAs for the 'make an offer' the buyer should be sincere and want to give more than USD 0.50 discount. \rWhy bother if that is all!!!!!!", "rating": 3}, {"title": "so so", "text": "I had ordered a small Blue Cobalt oil lamp that was advertised as antique. At first I was impressed  with it. \rAfter a short time of having it I had shown it to a person that specialies in antique lamps. I was told that it was probably made in the 60's and was made purposely to look old. \rNot happy about this information and probably won't be ordering any other items from this site.", "rating": 3}, {"title": "A lot of retail prices...", "text": "There is a vast selection of products from almost every era you can thing of. However, there are a lot of retail prices for used things that aren't worth much of anything used.\r I can totally get behind paying way more for real gold or things from the 1800s...the scuffed and marred silverware from maybe the 70s-90s, the half chewed on plastic toys from my childhood?...not so much. \r All buyers that I've had have been lovely. The rest I have at arms' reach because I am only going to browse, not buy junk, so there's no need to even talk to them.", "rating": 3}, {"title": "Buy a lot of stuff, but don't like management", "text": "Sellers do not always ship very fast as opposed to sellers on eBay.  I have bought so much from RR, but the prices are often over-inflated. Quality of items is usually very good though.\r My biggest problem is selling.  Very expensive to sell on RR.  When I made an honest mistake in categorizing, they just jumped in and took it down.  I would rather that they asked me to take it down.  I discontinued selling after that.  I was very insulted.  I just don't advise selling on Ruby Lane.  Also, why sell your items just to pay the monthly dues?", "rating": 3}, {"title": "Recent changes to Website", "text": "It is now harder to navigate around, slower to load, and accessing my wishlist has become difficult.\rIt was fine before.", "rating": 3}, {"title": "Kept me informed, communicated without hesitation.", "text": "The price of the item that I purchased while fair, I think that you could have taken a few moments to take the print out of the frame and inspected it before putting it up for sale. It turned out that the print that I purchased was laid down and not loose. I think without a doubt that I would not have bid on this item. Although still it was not in need of cleaning so I am satisfied!", "rating": 3}, {"title": "Seller never answered questions", "text": "I found what I was looking for but seller never answered questions about authenticity", "rating": 3}, {"title": "overpriced items", "text": "After placing a low, but reasonable bid for an item I received the rejection along with a note stating my bid was insulting. Methinks the asking price was insulting. It's too easy for buyers to comparative shop and find prices for similar items online, so pricing has to be in line with the going market rates. Ruby Lane has nice items but over the top pricing drives customers to other vendors.", "rating": 3}, {"title": "Wrong product sent", "text": "When I called Ruby Lane to let them know they had sent the wrong color and wrong item number of the storage bench I had ordered, they wanted me to send them photos which I did right away. After that, if approved, they would send me a return label and have Fedex pick it up at their expense. (Apparently the correct product was out of stock) Several days later, when I hadn't heard from them, I called back. They told me they hadn't received the photos, so I should resend them and then they would later approve the return. I explained that not only did I have to re-pack a heavy piece of furniture, but that it was occupying a big chunk of space in my entryway. I told them I didn't appreciate being treated that way in light of the fact that it was THEIR MISTAKE. They finally sent the return label. My first and last purchase from Ruby Lane.", "rating": 3}, {"title": "stop the arbitrary restocking fee of sellers", "text": "I've greatly curtailed my buying on Ruby Lane due to the practice of allowing sellers to charge you a fee; usually 10%; to return something to them regardless of whether the seller misrepresented an item or poorly presented it in his/her description.  I thought restocking fees pertained to layaways; not fully paid for items purchased sight unseen, often with poor photography and poor descriptions,  Or just plain misrepresentation.   \r I had such an encounter with a seller; wanted to charge me a 10% restocking fee for a 550$ item that she had misrepresented as a doll's dress when it was an altered child's dress--not worth the 550$ to me.  In the photos, I couldn't see this.  I saw it when I got it in my hands and I told her it was a child's dress. So I wanted to return it.  She acted as if she couldn't possibly be wrong and she was going to charge me 55$ to return the dress.   Of course, I didn't return it.  So, she made her 550$ from me but she lost a customer.  I informed RL about my experience but I've no idea if anything came of it. \r Many sellers on RL do not pull the restocking fee on their customers.  Most sellers are wonderful folks, and I have had mostly good experiences all told.  I want to say that.  But this last experience has left a bad taste in my mouth.  Only Ruby Lane can put some controls on the restocking fee policy.\r A few sellers abuse this restocking fee policy so as not to take items back. I found one, and one seller is one too many for me.", "rating": 3}, {"title": "Strange Experience with a Ruby Lane merchant.", "text": "Until last week I would say that my experiences have been good.  At that time I received a message from a merchant who contacted me saying that she had just acquired the matching bracelet to a Juliana necklace and earrings that I had recently purchased.  She wanted to know if I would be interested in buying the bracelet since I had the necklace and earrings.  After some confusion as to what the bracelet looked like and wether or not it truly matched my set I asked how much she wanted for it.  Instead of replying to that question she said that she wanted to know if I would be willing to sell the necklace and earrings back to her.  I replied that I was not interested in selling back the items that I had bought.  (If she wanted to buy back my items, why did she contact me asking if I wanted to buy the bracelet?) I again asked her for the price of the bracelet, since I was indeed interested in purchasing it.  In response she replied that she wanted $600 for the bracelet and that it had already been sold.  (If she had already sold it, why did she ask me in the first place? And $600 for a Juliana bracelet is grossly overpriced.  I paid that much for the necklace and earrings.  Overall I am confused about this interaction and what the intentions of the merchant truly were.  There is a ring of dishonesty in the entire thing.  I am happy that she found someone to pay her $600 for it when most others are selling for about $150.", "rating": 3}, {"title": "Choosing", "text": "It's VERY difficult to see an item that you click on. The scroll won't work to get past the \"title\" of the item and to read the description. Also after you're done you get sent to the top of the page again and have to find your way down. It makes it hard to decide if something is worth all the effort.", "rating": 3}, {"title": "Checkout", "text": "Hi there....your checkout process is onerous and inefficient to say the least....for eg what does PO or purchase order mean.....do not use terms that are confusing ...\r ..also when an item is described as pristine it should be so, instead I just bought something that has paint loss and flecks of paint falling off ,and chips but the seller insisted the items were pristine ,despite my asking on 2 separate occasions  .....\rwhy is shipping quoted at $34.99 and yet on the shipping box it is listed as $20.00......( note shipping was not charged ) . These things make me leary of ordering again....please correct them .....thank you", "rating": 3}]