[{"title": "Still confused", "text": "I do not like that it takes so long to deduct my first payment, particularly when they told me my insurance would not be in effect until my first payment was deducted from my account, then the rep when I called told me the policy was in effect. This contradicts what I was told when applying for the insurance. I do not like inefficiency or miscommunication ", "rating": 3}, {"title": "You don't get to talk with a person.", "text": "Date of experience: November 01, 2024", "rating": 3}, {"title": "Was told I only had to pay 1 time a…", "text": "Was told I only had to pay 1 time a month and I'm getting double charged ", "rating": 3}, {"title": "It's hard to form an opinion on…", "text": "It's hard to form an opinion on something if you haven't seen or heard from anyone ", "rating": 3}, {"title": "I disliked not having my children…", "text": "I disliked not having my children covered for 2 years after spending almost two hours on the phone w/rep walking me through it. So for two years my children weren't covered.I don't like the fact that the accidental doesn't hold cash value. I also don't like the fact that I can not add my children (especially my minor son) to my whole life policy. Leaving me to have to find another life insurance company to get my minor child insured which is an inconvenience to have to pay two carriers.", "rating": 3}, {"title": "Waiting on paperwork ", "text": "I feel that this company is very easy to apply for, however I’m not sure of everything else at this time. I am waiting to receive my policy paperwork in the mail ", "rating": 3}, {"title": "Lower the price from the age of 60", "text": "Lower the price from age 60 to 80. It unrealistic to expect after the age of 60 that those high payments will be easily made. It's very unfair after paying 10 years that the risk of not being able to pay the premium is a realistic fact.", "rating": 3}, {"title": "Called to stop the bs letters", "text": "Called to stop the bs letters, still doing it, so I said ok I might as well get extra, they send a letter back denying me lol, what a joke ", "rating": 3}, {"title": "I think trustage did myself wrong for…", "text": "I think trustage did myself wrong for not writing and telling me that we was about to lose my insurance because of my age.i think trustage should give a year in advance to think about what to do and not wait til after it is  to later thank you his wife Louise owens ", "rating": 3}, {"title": "DISCOUNTS-We Still Deserve Them!!!!. Even With EXISTING Conditions!!!??. \"\"\"THINK ABOUT IT!!!!?They're not OUR Fault.", "text": "No!!?\"\"\"\"Military-Senoirs or Age\"\"\"\"!?          DISCOUNTS!!?.We Still Need Help!!!Paying for our \"\"\"Monthly Payments\"\"\"We don't try to get \"\"\"SICK\"\"\"..!I Think It's Nice Enough That You Give Us Coverage!!!!.But I Think It's. Also A \"\"\"\"Good STEP TO\"\"\"\"!!??.Show Concerns About Your Costumers.Status,In Life!!!?.We Don't Try To Get SICK....THIS \"\"\"\"COMPANY\"\"\"\"!!!.Always Deserves. FIVE STARS!!!.But I Think It's. Good PRACTICE!!?. To Keep In Mind That We, STILL Offered MUCH NEEDED!!!??.          DISCOUNTS!!!?.As Americans..Buying American SERVICES!!? And Much Appreciated, And DESERVED. Company SUPPORT..EXISTING MEDICAL STATUS..Should NEVER, ELIMINATE. Much Needed DISCOUNTS.IT'S THE \"\"\"\"AMERICAN WAY OF \"\"\"\"\"LIFE\"\"\"\"\". .                 🤔", "rating": 3}, {"title": "Trustage seems like a decent company", "text": "Trustage seems like a decent company, but it would be nice if the sales rep had discussed options before steering me into what he thought I needed.", "rating": 3}, {"title": "Good", "text": "I really don't know yet about you guys but if you can get me a chance to work with you guys on this project as soon as possible so I can look at it and see if I can get a good little break from it all ok", "rating": 3}, {"title": "I would like to raise my life insurance…", "text": "I would like to raise my life insurance benefit to 10,000 if this is possible, please let me know with the same monthly premium. ", "rating": 3}, {"title": "HAD ISSUE WITH A INSURANCE TECH", "text": "HAD ISSUE WITH A INSURANCE TECH, I ALMOST ASKED FOR A DIFFERENT PERSON.", "rating": 3}, {"title": "Not the best.", "text": "It's all a bit misleading, disappointed and not sure how to get out. I have not received my documents.", "rating": 3}, {"title": "Was easy to get policy but not all was…", "text": "Was easy to get policy but not all was completely explained at the time of call the documents mailed was a little miss leading.", "rating": 3}, {"title": "I think that's a ridiculous amount of…", "text": "I think that's a ridiculous amount of money monthly for something ueont even receive for 30yrs!!! No thanks", "rating": 3}, {"title": "Easy to activate", "text": "Easy to activate. Easy payment option. Nothing outstanding about it.", "rating": 3}, {"title": "Better price from many places ", "text": "The quote that I received was nearly double what I pay for three times as much coverage", "rating": 3}, {"title": "Send policy to Bridget Tate", "text": "I would like to be sent a policy for my insurance, it would be greatly appreciated.", "rating": 3}, {"title": "Insurance is available regardless of age", "text": "Insuring people that are considered pass their prime", "rating": 3}, {"title": "Is there an additional charge each…", "text": "Is there an additional charge each month of $5.00?", "rating": 3}, {"title": "What life insurance is about ", "text": "I would like to know more about what i have and how it works i dont know alot about it", "rating": 3}, {"title": "who gets the results", "text": "this is just a questionare.. will it reach the right people? i have no idea who this goes to , honestly", "rating": 3}, {"title": "Learn to listen", "text": "nice people but so busy trying to make not listening", "rating": 3}, {"title": "Easy to fill out the application and a…", "text": "Easy to fill out the application and a good price.", "rating": 3}, {"title": "Fatima Sanders ", "text": "Should have someone to call and go over the policy with me. To make sure everything is correctly filled out..", "rating": 3}, {"title": "Not big enough", "text": "Not big enough. Need twenty five thousand dollars for a ", "rating": 3}, {"title": "Great", "text": "Great. It's a reasonable policy.", "rating": 3}, {"title": "Short term investment", "text": "I w.asnt with TruStage very long. Sorry but I found a different Agent. in August I cancelled and in Sept they still took $19.50 out of my acct.", "rating": 3}, {"title": "MrHammonds", "text": "The price was misleading", "rating": 3}, {"title": "No one reach out to me in regards to my…", "text": "No one reach out to me in regards to my mothers life insurance policy. My card was stolen and I really forgot that my card was the only form of payment they had on record. I got no email or mail stating that I needed to update anything. My mother has been without insurance for 5 months", "rating": 3}, {"title": "Very disappointed", "text": "I had this company for a couple of years.they were great .now they have these representatives  that don't  know what they are doing. I tell them to do auto pay.they wait for 2months back then decide  to get in touch with me.need to do better.", "rating": 3}, {"title": "Life insurance", "text": "I am very upset with how I was treated on the phone when I called with questions. I am confused as to what I have for coverage and when or how much I need to pay for life insurance? I also have no idea what type of coverage I have.  I really don’t want to call again to be treated as bad as I did! Thank you, DianeMoses", "rating": 3}, {"title": "Customer service representative…", "text": "First few customer reps were great but the last Customer service representative provided wrong information and once speaking to another rep Lisa she had no clue with what I was talking about I told her I will stay on the line to take the survey she said she would transfer me but actually hung up very unprofessional", "rating": 3}, {"title": "Not a big fan of insurance companies", "text": "Not a big fan of insurance companies. I think the market is always in there favor and hardly ever the favor of the insured. I’m not really even sure if the policy that I have will even benefit me or is even right for me. Because I did not have any life insurance, other than through my work, I thought it would be better to have something over nothing and it was the most reasonable so far that I have found for my age.", "rating": 3}, {"title": "I just wish the Representatives would…understand that as a customer you know close to nothing about purchasing Life Insurance and I wish they would guide you step by step so when you're done you know", "text": "I just wish the Representatives would understand that customers don't know their job and being more informative about Life Insurance would be so helpful if they would actually talk to you and inform you with the same information that they would give to their Loved ones", "rating": 3}, {"title": "I have seen other offers of term life…", "text": "I have seen other offers of term life insurance  at a better rate and coverage for a longer period of time than my Trustage  policy that have the same terms for payout. No special offer or group rate involved,", "rating": 3}, {"title": "once ive done business with the company…", "text": "once ive done business with the company for a while i can upgrade my rating, but for now, the billing is a issue, however speaking to a couple reps they made me feel welcome and they were very pleasant, thats huge with me. thanks", "rating": 3}, {"title": "As stated earlier", "text": "As stated earlier,  I am very pleased at this point. There is always room for improvement because of the fact no one's perfect. You guys are close, so keep up the good work: strive for perfection ...good goal.Thank you.", "rating": 3}, {"title": "I received a policy but really don't…", "text": "I received a policy but really don't understand exactly what I have. If possible please explain. Also are you taking the payments out of my bank account?  Lastly do I have both insurance policies?", "rating": 3}, {"title": "I was not told the definition of whole…", "text": "I was not told the definition of whole life versus life insurance.  It was disappointing and why I will not increase my policies I think a rep should have disclosed this and since it was not what I was expecting", "rating": 3}, {"title": "I am very happy with policy number one", "text": "I am very happy with policy number one. Since I was offered an upgrade, so to speak or to add additional coverage, that has not been as pleasant as my first experience. Before I went on vacation I called to voice my concern about the verbage and policy number two and the fact that the second policy was not at the same rate as the first as was indicated in the advertisement I was sent. I spoke to a manager/supervisor who was supposed to look at the information and give me a call back that was around June 3rd. To date I have not received a call back. I am very unhappy with how my second policy is being handled. I will address this again with a call to the company and will determine if I keep policy number one and policy number two.", "rating": 3}, {"title": "Sorry", "text": "Sorry, ran out of patience ", "rating": 3}, {"title": "Payment", "text": "I think you should make it easier to make a payment online I tried and tried and never could get you all to except it and I want to change the payment date all so", "rating": 3}, {"title": "I have to be honest I do not know a lot…", "text": "I have to be honest I do not know a lot about the services of my his policy. I need to read it in it’s entirety.", "rating": 3}, {"title": "I have had my policy since May of 2019…", "text": "I have had my policy since May of 2019 so i have had it longer than a year i believe can you check your records. Thank you  Peggy Mabbitt", "rating": 3}, {"title": "Peace of mind coverage! :)", "text": "I' m 62 and I got final expense coverage so my daughter will not have to incur any unnecessary expenses when I go die. Just a little peace of mind for a Dad.", "rating": 3}, {"title": "I wanted to change my term policy to…", "text": "I wanted to change my term policy to whole life. You cannot reach anyone at any time.  Unfortunately after 2 years I may cancel my coverage.", "rating": 3}, {"title": "Policy stipulations", "text": "Not raising rates every 5 years.", "rating": 3}, {"title": "TruStage Life Ins", "text": "I just haven’t hD a very good experience with the fee being taken out of the right account and it charging us a $30 fee each time which is a lot of the banks fault.Thanks", "rating": 3}, {"title": "They're reliable and provides coverage…", "text": "They're reliable and provides coverage for all amounts and can find you coverage for any amount that you require or desire", "rating": 3}, {"title": "I just became a customer so I am…", "text": "I just became a customer so I am careful at this time on my rating  of your company.  Although I can't imagine my Credit Union partnering with a questionable company", "rating": 3}, {"title": "Would recommend a policy with true…", "text": "Would recommend a policy with true stage and would like them to offer more options for coverage for those who may not have or can’t get coverage smaller policies", "rating": 3}, {"title": "Your website’s security certificate…", "text": "Your website’s security certificate expired 12 days ago. Might want to fix that.", "rating": 3}, {"title": "It's really easy to get insurance but…", "text": "It's really easy to get insurance but no one contacted me and explain the policy", "rating": 3}, {"title": "Thank you!", "text": "I was not informed that I can create online or access account online. But the process on getting enrolled through mail was smooth and directions were cleared.", "rating": 3}, {"title": "Autopay dates incorrect", "text": "Autopay dates incorrect, policy Not received. On the other hand my Agent is Wonderful. Phone calls returned Extremely in a Timely fashion.", "rating": 3}, {"title": "I’m just getting familiar with this…", "text": "I’m just getting familiar with this company nothing to report at this time.", "rating": 3}, {"title": "App or link?", "text": "Can't find the app or l8nk to view my policy.", "rating": 3}, {"title": "I think that Tru Stage is a very easy…", "text": "I think that Tru Stage is a very easy company to do business with.I will recomend them to anyone that needs assistance with life insurance.", "rating": 3}, {"title": "What Caught My Attention Is The Fact…", "text": "What Caught My Attention Is The Fact Coverage Began Once First Payment Was Received...", "rating": 3}, {"title": "Acquiring this insurance was easy and…", "text": "Acquiring this insurance was easy and straight forward. No hard sell tactics. The staff were knowledgeable and courteous.", "rating": 3}, {"title": "Was easy to get", "text": "Was easy to get. But if you want more coverage to make sure you or your spouse is taken care of. The rates or to high", "rating": 3}, {"title": "Initial wording could be better.", "text": "The initial wording could have been clearer. Initially, we thought the AD&D was life insurance.", "rating": 3}, {"title": "Excellent customer service reps", "text": "Excellent customer service reps.  Insurance is pricey. Also my payment did not come out when it was supposed to.", "rating": 3}, {"title": "Upgrade information", "text": "When I upgraded my life insurance I did not receive the new information confirming it.", "rating": 3}, {"title": "I want good life insurance thank u", "text": "I want Good life insurance to better myself after I leave this earth thank you!", "rating": 3}, {"title": "STILL WAITING ON MY POLICY SO I CAN…", "text": "STILL WAITING ON MY POLICY SO I CAN REVIEW IT AND HAVE IT AVAILABLE FOR MY CHILDREN WHEN IT IS NEEDED.", "rating": 3}, {"title": "Rate change not explained", "text": "Wish I would have known about the rate change", "rating": 3}, {"title": "The reason for my three star rating is…", "text": "The reason for my three star rating is due to the fact that I did not receive hard copies of my insurances", "rating": 3}, {"title": "Everything just need to be explain to…", "text": "Everything just need to be explain to you more but overall this is a great insurance company", "rating": 3}, {"title": "Not enough time", "text": "You only have certain amount of days to change your policy.  If not you have to get a new policy.", "rating": 3}, {"title": "TruStage Insurance Rates are very Reasonable.", "text": "With the current rate of Life Insurance today, TruStage terms were feasibly acceptable.", "rating": 3}, {"title": "I need to be followed up with", "text": "I need to be followed up with, the same way when I first applied for this insurance.", "rating": 3}, {"title": "I don't know too much about either my…", "text": "I don't know too much about either my life insurance or the other insurance that I purchased", "rating": 3}, {"title": "I'm giving a 3 for now since my first…", "text": "I'm giving a 3 for now since my first experience was not a good one.", "rating": 3}, {"title": "Ok nice", "text": "I think that it was a good deal I would use it all the time", "rating": 3}, {"title": "The incremental increases were not as…", "text": "The incremental increases were not as high as other policies I have been reviewing.", "rating": 3}, {"title": "So far clear and easy to understand", "text": "So far clear and easy to understand, a feeling of security and long life protection.", "rating": 3}, {"title": "I don't truly understand the true…", "text": "I don't truly understand the true policy specifics but it was easy to apply for", "rating": 3}, {"title": "Thx. Trustage", "text": "Thx, Trustage for letting me setup by mail payments. OVERDRAFTS are not fun.", "rating": 3}, {"title": "This rating may change as I learn more…", "text": "This rating may change as I learn more about the company and my policy/account", "rating": 3}, {"title": "Plain and simple", "text": "Plain and simple, self explanatory Life insurance policy.Recommendable indeed.", "rating": 3}, {"title": "I'm not sure I received the policy…", "text": "I'm not sure I received the policy could you check and send me one please?", "rating": 3}, {"title": "Insurance policies", "text": "Need the policies sent to my address and a telephone number to get in contact", "rating": 3}, {"title": "Need to hear from a live person", "text": "Date of experience: September 24, 2022", "rating": 3}, {"title": "I'm satisfied with my service but I'm…", "text": "I'm satisfied with my service but I'm busy at the moment thank you", "rating": 3}, {"title": "Currently insured", "text": "I'm new to this company,  can't say to much about them yet....", "rating": 3}, {"title": "Easy to sign up and who doesn’t need…", "text": "Easy to sign up and who doesn’t need insurance nowadays  :-)", "rating": 3}, {"title": "Over a month sense purchase of policy…", "text": "Over a month sense purchase of policy and still have not received yet.", "rating": 3}, {"title": "good times", "text": "good health", "rating": 3}, {"title": "My insurance  for  life's", "text": "Excellent insurance company, would recommend to family and friends.", "rating": 3}, {"title": "Life insurance", "text": "It was easy and affordable thanks to Delta Community Credit Union.", "rating": 3}, {"title": "It was what  I think of them for now…", "text": "It was what  I think of them for now being mine first year", "rating": 3}, {"title": "Disappointed", "text": "I want to know where my policy is. Have not received it yet.", "rating": 3}, {"title": "I need time to look over the policy…", "text": "I need time to look over the policy closely. Thank you.", "rating": 3}, {"title": "Need more information on the company…", "text": "Need more information on the company and the policy itself.", "rating": 3}, {"title": "I’m happy with what I have learned…", "text": "I’m happy with what I have learned about this company.", "rating": 3}, {"title": "good company but not detailed", "text": "seems like a good company, just not very clear on details", "rating": 3}, {"title": "I am just starting this process so it…", "text": "I am just starting this process so it is good for me now.", "rating": 3}, {"title": "I'm unsure about the policy if I get…", "text": "I'm unsure about the policy if I get cancer.", "rating": 3}, {"title": "I need details on my closed policy", "text": "Date of experience: June 10, 2022", "rating": 3}, {"title": "Disappointed my benefits will go down…", "text": "Disappointed my benefits will go down 50% at 70", "rating": 3}, {"title": "I cannot fully rate", "text": "I cannot fully rate.  I have not received my policy", "rating": 3}, {"title": "incomplete", "text": "Haven't review the policy in its entirely yet,", "rating": 3}, {"title": "Clarity Needed About Billing Date", "text": "Changed policy date without explanation as to why.", "rating": 3}, {"title": "Awesome", "text": "Awesome Insurance policy to have for my Family.", "rating": 3}, {"title": "It was ok I’ll share this", "text": "Date of experience: July 25, 2022", "rating": 3}, {"title": "I am still new, I will make my comments next time. Yet the bank is faithful from the day I registered.", "text": "Congratulations", "rating": 3}, {"title": "More information needed about policy!", "text": "Date of experience: December 08, 2021", "rating": 3}, {"title": "Very fast and educational know what you…", "text": "Very fast and educational know what you want.", "rating": 3}, {"title": "I have not recieved my policy paperwork…", "text": "I have not recieved my policy paperwork yet.", "rating": 3}, {"title": "TruStage offers too many different…", "text": "TruStage offers too many different options.", "rating": 3}, {"title": "To expensive you guys are!!!!!!!!!", "text": "Date of experience: October 12, 2021", "rating": 3}, {"title": "I still haven't received my policy!!", "text": "Date of experience: December 12, 2018", "rating": 3}, {"title": "I need to know more about my policy", "text": "Date of experience: January 20, 2021", "rating": 3}, {"title": "Just do what you advertised", "text": "Date of experience: March 16, 2022", "rating": 3}, {"title": "It was helpful to me,and my family.", "text": "Date of experience: June 18, 2020", "rating": 3}, {"title": "New customer", "text": "New unsure yet", "rating": 3}, {"title": "Nobody gets 4 or 5 stars from me", "text": "Date of experience: March 08, 2019", "rating": 3}, {"title": "I need to get money", "text": "Date of experience: May 07, 2022", "rating": 3}, {"title": "Nothing to says", "text": "Speechless", "rating": 3}, {"title": "It's all good", "text": "It's all gooooood", "rating": 3}, {"title": "A little expensive", "text": "Date of experience: May 11, 2022", "rating": 3}, {"title": "Nothing to share at this time.", "text": "Date of experience: April 04, 2019", "rating": 3}, {"title": "Quite concise and professional", "text": "Date of experience: November 07, 2018", "rating": 3}, {"title": "no problems with your service.", "text": "Date of experience: August 08, 2018", "rating": 3}, {"title": "Very amazing wonderful I love it", "text": "I really love it amazing", "rating": 3}, {"title": "Owner", "text": "Would like more information", "rating": 3}, {"title": "Unclear about family rates.", "text": "Date of experience: August 19, 2019", "rating": 3}, {"title": "Satisfied", "text": "Very nice company to have.", "rating": 3}, {"title": "No comments at this time.", "text": "Date of experience: February 21, 2019", "rating": 3}, {"title": "Trustage experience", "text": "No comment at this time", "rating": 3}, {"title": "Easy to understand", "text": "Easy to understandHi", "rating": 3}, {"title": "New Insurance", "text": "The process was easy.", "rating": 3}, {"title": "Poor customer service.", "text": "Date of experience: December 05, 2018", "rating": 3}, {"title": "Very good", "text": "Over all it is good", "rating": 3}, {"title": "Good response time.", "text": "Good response rime.", "rating": 3}, {"title": "Nice", "text": "Good offer awesome", "rating": 3}, {"title": "Easy", "text": "Easy to apply.", "rating": 3}]