[{"title": "Just okay ", "text": "Paperwork was a joke. No digital signatures and sent me the wrong paperwork. Had to hire a notary twice. Switched my service person in the middle of the deal. Took like a month. Surprised it got completed TBH. It was easy to get started and get quote etc then became tedius. ", "rating": 3}, {"title": "Unsure about them", "text": "Process to actually buy the car was pretty simple and trade in process seemed easy. However, once the paperwork was signed communication was a little poor. Didn't get my temp tags right away so 3 days of the 7 day window were already gone when I got it. Car was filthy and I did ask for a detail but they only gave me $50 so I spent about 3 hours detailing it myself. They took my trade in and I am supposed to get money back but haven't heard anything yet on that so will update once I do hear that. I did reach out to the team who is in charge of my registration in my state and haven't heard anything back yet. ", "rating": 3}, {"title": "Takes far too long ", "text": "The competition makes this process way easier and faster.  Driveway.com offered me a small but more then others but the amount of work and info they require before transacting, how long it takes to get approval and then they outsource pickup to a 3rd party and that was delayed; isn't really worth the extra bump.  At the end of the day, the deal got done and the payment was made.   ", "rating": 3}, {"title": "They were very nice and professional but beware of the vehicles.", "text": "The vehicle was worse than depicted in the ad.  The aluminum engine block was corroded badly as was the undercarriage.  I also found sand in areas of the engine bay as if it had been in a flood. Oh and water vapor came out of the air vents when the air conditioning was run.   They did allow me to return it but charged the entire shipping fee which should at least have been split or something with all the issues with this vehicle. ", "rating": 3}, {"title": "OK experience", "text": "Offer was made quickly. The following steps were cumbersome. I didn’t agree with the downgrade in value of the car from the original, but was in a hurry to sell because of many other “balls in the air”. Was left with the feeling of being screwed by a company that is going to make a bunch of money on the deal. The pick up process was annoying, as the transport company was miserable to deal with. Did receive the payment quickly after the car was loaded. ", "rating": 3}, {"title": "There are pros and a few cons", "text": "Everything was very easy and the folks that handled everything over the phone and online we’re good to work with just a little taken back that the vehicle arrived and had 800 more miles on it then listed and the battery was dead and the company that dropped it off just dropped it in the driveway and took off", "rating": 3}, {"title": "Friendly service, unclear process", "text": "You need to explain the purchase and trade in process at the outset and what we should expect. First I was told I would have one main contact through the whole thing. Then I heard from 4 different people/groups along the way and not much from the main person. And I didn't know how to go about vehicle registration, I had to ask about it, then learned you handle it. Am still waiting for an answer as to how long that takes. Most of the info was provided via text, I would have preferred email which it's much easier to re-visit. When I asked a question via text, sometimes I had to ask it 2 or 3 times before getting an answer. One person still hasn't replied.Your team was always nice and friendly. The process and communications need improvement. ", "rating": 3}, {"title": "Communication STILL NEEDS WORK! Why still same mistakes?", "text": "I never thought in a million years I would ever purchase a car online without seeing or test driving, but I have to say it works.  I also would've loved to rate my experience higher, but the communication was TOUGH.  The review score of a 3 ( in total for Driveway)- is only because the car is super nice. I have to say I did get a beautiful car out of the deal - but it was very stressful at times.   I think the whole point of using an online dealer is to AVOID the hassles of a dealership - which was my thought process going into this.  Because of this - I believe Driveway is only shooting themselves in the foot - and losing a large clientele because you will never earn their trust with their current reviews (38% - Rate only a 1) with communication being the common complaint. THIS WAS MY EXPERIENCE;  sales people will be all over you to get the sale, BUT once that takes place - that's it!  There is not a representative assigned to you once the sale is done. Which there should be.  You find yourself floundering and asking people that cannot help you because it's not their job and you STILL have questions once the sale is complete.  You will get text messages where they do not even identify themselves - and at the beginning I thought they were scams ( and didn't pay attention to them).  I was assigned a wonderful (again I do not even know her title) sales person, let's call her, who did a great job to help get through the process and the red tape.  I reached out to her many times only because she was the only one to get back to me via phone or text me consistently. The individual that set up my delivery was also wonderful.  So the car gets to me, and as another reviewer stated, much to my surprise there was only ONE key/fob.  Apparently, because there was a picture of the ONE key sitting on a seat of the new car - I was suppose to assume that there was only one key fab?? I don't think so.   It also came with a BIG scratch that I did not see.  I did bring it to an auto body shop friend and he stated it was definitely a new scratch - which leads me to believe that it happened in the delivery process.    Maybe because the car was black and the pictures were not great - of which I asked over again to get better pictures, I therefore, never saw the scratch.  The  Customer Resolution team was of no help at all - NOW if I ever want someone to do business with my company again- I would do everything in my power to keep a positive relationship going.  No one was willing to get a quote for a new FOB (because it's much cheaper for a dealer to get a fob than a customer), to get me another key or even research the scratch.  It's called disclosure- no one along the way disclosed either of these things to me.  Watch the FINE print I guess.  That was an easy fix. Well, that was my experience,.  I love, love, love the car.  You can make the decision to move forward from reading not only my review, but others.   Driveway still has many things to improve on and I hope they do - because the concept is wonderful.    Thank you for the read!", "rating": 3}, {"title": "Not quite hassle-free, but worth consideration.", "text": "I learned about Driveway.com after researching cars from Edmunds.  General perception is that Driveway.com is slow but eventually delivers on its promises.  My experience more or less matches this.  I had little difficulty identifying the vehicle I wanted, though the process of obtaining it was rather bothersome.At every step of the way, there would be delays or long periods of silence from the company.  From initiating the purchase, waiting for a delivery date, and when I would obtain final registration.  Sometimes I would have to make a stink before the ball got rolling.On the other hand, I obtained a vehicle that matched my needs perfectly and at a rather solid price.  I might have just been lucky, though I can’t really complain here.The customer experience leaves a bit to be desired.    But if you’re in the market for a new car, Driveway.com is good enough if better dealers or retailers don’t have what you’re looking for.", "rating": 3}, {"title": "Miscommunication …", "text": "Miscommunication between driver and Driveway customer service.  Was not informed truck had broken down for 3 days. I was never told driver had other vehicles and would be making drop off as well. I paid 1800 for delivery fee. Driveway needs a link where customer can track their large purchase. I was told my vehicle would arrive on a Thursday,  instead it was delivered on Sunday afternoon. To me Driveway customer service seemed disconnected. Not enough communication between driver and them.... Overall it gave me anxiety not knowing when vehicle would be delivered. Dates kept changing along with customer service giving me different delivery dates. Again, I had zero clue the driver was making other deliveries. Definitely need to work on some sort of tracking of vehicle for the customer.  I honestly expected a smooth transaction, but was disappointed. Vehicle arrived unharmed.  However when I drove it I noticed transmission issues. Took it to Nissan dealership here since it still has warranty.  Also missing handbook but honestly the one that was send to me digital was just how to adjust seatbelt and such. I need the complete 2020 nissan murano manual to learn what my vehicle is capable of.", "rating": 3}, {"title": "Challenging experience ", "text": "Difficult getting paperwork turned in. Was not kept up to date with ETA of delivery. Waited all day when they gave us a two hour window. Only updated when we  requested update. Feeling like we are finished and then another request for information is made. Radio is non functional and details for car were scarce.", "rating": 3}, {"title": "Basically OK", "text": "If you know, exactly, what you want in a vehicle and don't want to deal with car salespeople, this is perfect. There is room for improvement in coordination between Driveway and the customer, as one has to deal with several different people, some of whom don't appear to be communicating with each other. It would be helpful if Driveway provided a document detailing the tag and title process, so one doesn't have to ask several questions and find their way alone. Thank you.", "rating": 3}, {"title": "Rocky start but overall good company.", "text": "We purchased a 4 runner for my wife. The process, paperwork and delivery of everything was very quick and prompt, very nice to see.  The issue came when the car was delivered.  There was damage to the car that had not been disclosed, we went above and beyond and went and got a repair estimate. Cost was just shy of 4,000. After some back and fourth Driveway is going to pay out a very large portion and I'm content with the outcome. My wife gets her dream car and I have had an overall good experience with driveway and would use them again.", "rating": 3}, {"title": "The process took longer and was more of…", "text": "The process took longer and was more of a pain in the butt than I expected it to be. The process involved getting text messages from 5 or 6 different people at different phone numbers which created a lot of confusion. Overall, I would definitely prefer just dealing with a dealership next time.", "rating": 3}, {"title": "Average due to car arriving without temporary tags", "text": "The delivery of the car and the documentation was good, but I had to chase the dealership down for the temporary tags which were not delivered with the car.  This forced me to rent a car, without reimbursement while I waited for 4 days, and eliminated the 7 day trial period.", "rating": 3}, {"title": "Driveway is tied to Lithia Motors which…", "text": "Driveway is tied to Lithia Motors which should be more streamlined in getting to a point where the paperwork is already done and all the consumer has to do is walk in and go over the paperwork and sign. Was surprised dealership had to transfer over all the info into their system on their end since we had already done this with the Driveway website. It’s supposed to easy but was at the dealership for 3+ hours on a sunday.", "rating": 3}, {"title": "Confusing emails and pickup process", "text": "We appreciated that most of the process could be done online. However, after the order was finalized, it was confusing to continue receiving emails telling us to finalize things and then telling us the offer had expired (which was incorrect). It was also confusing to work with the 3rd party pickup. The first pickup never showed up. The 2nd time, we got only ~90 mins notice of impending pickup, which took place at 9:00 pm on a Sunday night. ", "rating": 3}, {"title": "For the most part the process was as…", "text": "For the most part the process was as expected.  However it was a very lengthy process it weeks to complete purchase and delivery as a posed to purchasing through a local dealership and receiving the car same day.  I wish you could streamline the process and have one point of contact throughout.", "rating": 3}, {"title": "The software was not properly…", "text": "The software was not properly developed. I was informed one day before expiration that the offer had expired.  I wrote in and the issue was solved in house which did not exactly make me feel as though I was dealing with a reputable company.  However I continued since I had already made the commitment Then the truck had to park 2 blocks down because the driver didn’t feel comfortable on my street. Since you wanted pictures of the car in the truck I had to hobble to a place where I could get a picture. ", "rating": 3}, {"title": "Lack of follow up and communication", "text": "Lack of follow up and communication. I am still waiting to hear back from a representative on a serious issue but no one has replied to my emails or messages in the last 5 days. ", "rating": 3}, {"title": "Once the car was delivered", "text": "Once the car was delivered, I didn’t hear from Driveway. I had to contact them to find out the status of my final paperwork and my title. To date I haven’t received anything.", "rating": 3}, {"title": "The people I dealt with were very nice…", "text": "The people I dealt with were very nice and knowledgeable. The price you offered was fair. The paperwork seemed to be very much to sell you my car", "rating": 3}, {"title": "Disliked the expectation for delivery…", "text": "Disliked the expectation for delivery was a friday, and was told a 3rd party driver would call the day before to schedule the drop off. But then the 3rd party driver called me Wednesday, didn’t speak english, and told me if I couldnt get to the home, he was going to drop it off. Then texted me “sorry brooo.” Fortunately I was able to get a roommate to come home early to sign for the vehicle.While trying to get in touch w Driveway team, I left messages, I think the next day they reached out to his team because then he started calling my phone all throughout the day to see if things were all good, and asking if I complained I think. I couldnt understand him, but I didnt like his persistence. Was overall not a professional experience. Just needed more than a 2 minutes heads up when I’m living 90 minutes away.", "rating": 3}, {"title": "The buying experience was clunky", "text": "The buying experience was clunky. You are handed off to about 5-6 people throughout the process when working with 1-2 people max would be much easier. I felt like I would talk to a rep and then it was on the the next one, and therefore no accountability. I would have questions and when that person was done with me they wouldn't answer my calls. Towards the end of the of the process this got better. However I put the deposit on my car on June 26, I didn't take delivery till July 11. Obviously this is longer than the websites \"7 days\". I thought this was better than using a dealership but it needs a little refinement ", "rating": 3}, {"title": "I liked the different departments in…", "text": "I liked the different departments in the process, I did not like being told totally different information by each of them regarding payment ( when you purchase a vehicle from the seller) if it was not for Chris located in Nevada , and his professionalism and promptness on getting me the answer I need and attention. your company would’ve lost my business for good. It’s totally case of his Business practice and knowledge and willingness to help that kept me a customer. Audrey also in financing was smart and on it as well . Whatever you do keep these two or your Business won’t hold up .  ", "rating": 3}, {"title": "What started out as a good experience…", "text": "What started out as a good experience ended up being very frustrating. First it would be nice to deal with one person through the process. We had many different people contact us through phone calls and text messages. Every time we called or texted back we never spoke to the same person. We were never notified when the vehicle was going to be picked up. We were not at home but received a phone call that a person was at our home to pick up the vehicle. We had to rush home to meet with them. Thankfully we were not to far from home. Although the experience was frustrating at times, everyone we spoke with was very polite and professional. ", "rating": 3}, {"title": "Bitter- sweet experience", "text": "Bitter- sweet experience. Initially wanted one vehicle and put a deposit down only to find out the car that was reserved for me was sold at the dealership. I eventually had to choose from a small list of vehicles with way less options and vehicles with more miles. The communication was iffy. I had over 4 different contacts during the process and it was still hard to get answers about questions I had. Also no temp tag was with the vehicle at delivery. But, I got the most help out of the satisfactory agents finally. Not quite sure if I would use this service in the future. ", "rating": 3}, {"title": "Communication concerns", "text": "I am happy that I have finally received my vehicle that I purchased. I feel that I could have received more solid communication from the agent that was talking to since the beginning of my process. I felt that I was reaching out more to other agents to get more clarification on the next steps. The emails or text messages that I received were not clear as to what to expect next. Nor were the updates given about the process. Would I consider using driveway again? At this point it's hard to say... but I'll keep the information that I have in case I do charge my mind", "rating": 3}, {"title": "The concept is awesome", "text": "The concept is awesome. Being able to buy cars from anywhere is the states without having to negotiate with dealerships is great.Driveway needs to get better with the online process, as soon as the order is placed I had to deal with 3 different people. I would rather do that online (no phone cals, no txts) everything through the site or an app. The delivery was an issue, the local dealer did not care to deliver and my car was stuck (near my house) for 3-4 days. Driveway had to get someone from 60 miles away to come and take the car our of the dealer and delivery it 3 miles away from the dealership. There is no follow up after sales. I don't have my invoice, title, plates, etc. and I would like to know what is the process to get those documents.", "rating": 3}, {"title": "Easy to purchase", "text": "Easy to purchase. Shipped quicker than we thought it would. We were also pleased that this company is a subsidiary of Lithia motors.Communication was lacking, We asked several times when it would reach the port in Seattle to be shipped to Alaska  & when would it arrive in . The representative at Driveway.com did not know it was actually on the ship. We had to go to the dealer here in Fairbanks to see if the car had arrived. We found it on the lot, confirmed the Vin number and that it was our car. We went in and got paperwork rolling so we could pick it up that same day. ", "rating": 3}, {"title": "Great process", "text": "Great process, customer service. Immediate issues with original ordered vehicle, which was an very big hassle, returned vehicle within 7-Day return period. Quickly applied/ ordered new vehicle, smooth process received new vehicle 3/23- Delivery both times we're great. Only a few hours in, but so far so good.", "rating": 3}, {"title": "Update on previous review", "text": "I purchased a vehicle from Driveway on 5/32/2024. It took awhile for me to get my car, but in the end Sarah made everything right and worked with me on every detail of why the delivery was being delayed. She was even able to get me a portion of the shipping fee reimbursed. I finally received my car on 6/25/2024 and have enjoyed driving it ever since!", "rating": 3}, {"title": "Trying to currently buy a car through…", "text": "Trying to currently buy a car through them and all i get is multiple text messages from different people saying they are with driveway and will contact me shortly. One asked to call and i said sure but it sounded lime kids in the background and told me i could text the additional information needed to the number she called from. I am getting sketchy vibes and contemplating looking else where now", "rating": 3}, {"title": "ghosting on registration/title questions", "text": "Not sure if I didn't post this review if I would have received help. Sarah and Patrick took care of my problems and answered questions, they deserve a raise for being helpful and communicating clearly. Bumping this up to three stars. Initial review :They appear to be ghosting me on the topic of plates/title. I have temp plates from dealer out of state that expire a few weeks after I got car, no temp plates for my state. Wasn't verbally discussed or notified before \"lock-in payment\" that out of state registration can \"take up to 60 days or longer\". Received calls/messages from many different people during purchase process so I don't have a single point of contact to reach out to. Stressed and worried about giant expensive paperweight sitting in driveway while I take bus.", "rating": 3}, {"title": "Different way to buy a vehicle", "text": "Process seemed pretty straight forward. Wasn't quite expecting car to come with undisclosed issues but worked through them and getting issues fixed. Team has made it right after some pictures and messages. Definitely a different way to buy a vehicle when you don't have time to sit at dealership or chase the car you want. Still think the process could be improved with buy a vehicle. Seems to all be working out.", "rating": 3}, {"title": "Great buying experience", "text": "Great buying experience.  Horrible follow up.  I am still waiting on a response, 5 days on a question.  I am sorry I bought and spent 21K HERE. Will Never do again ", "rating": 3}, {"title": "not my first choice…", "text": "picked out a car filled out all the information only to find out later the car was not available.  this happened 2 more times, I found a car but was disappointed my 1st choice was not available", "rating": 3}, {"title": "Only one set of keys", "text": "Only one set of keysTires wornDents in vehicle not shown in picturesPlenty of scratches all overFor a fairly new car. Not goodHad a follow up with customer care after this review.  It took some significant effort to get them to hear me.  The good news is they (Lithia/Driveway have made some reparations and are trying to improve their after sale support.", "rating": 3}, {"title": "I would have given 4 stars", "text": "I would have given 4 stars, I barely give anyone 5. The reason why is I 1st tried to buy a 2020 gladiator.  Went through everything got to the end to hear from delivery coordinator.  They called to tell me the dealership sold it to someone else.  I had to start the process all over again with a 2021 gladiator.  Cost me 1500 more for the vehicle and Went from $620 delivery fee to $1850. I do like the vehicle I finally got. It took a month for the whole process.  And you deal with a lot different people through the process. ", "rating": 3}, {"title": "good money but pain in the ass process", "text": "Driveway paid more for my car than Carvana. However the process was way more of a pain than Carvana. Having to upload pictures, having to wait for paperwork in the mail, paying $30 to have the title notarized then mailing the paperwork back and waiting for someone to reach out. All of this was a pain in the ass.UPDATE: Driveway contacted me, refunded the cost of the notary fee plus 20 bucks for inconvenience. They assured me they are working to make their process as easy as Carvana. I will consider using them in the future.", "rating": 3}, {"title": "Experience was pleasant other than 30…", "text": "Experience was pleasant other than 30 day tags were not sent with vehicle a big no, no! Also, vehicle was suppose to arrive at 9:00am that’s what I was told when the driver called between 7:30am and 8:00am…nine arrives and no vehicle…9:45am I call driver no answer, he text back and said he had got pulled over by the police for inspection and he would be here at 11:00am. Eleven am comes still no vehicle, I text him and ask did he mean 11:00am or 11:00pm, he said 11:00am. My vehicle arrived after 4:30pm… not good.", "rating": 3}, {"title": "This is an update to my Feb", "text": "This is an update to my Feb. 17, '23, review. Everything stated in my first review still stands. The additional stars are for the ensuing customer service by Driveway employee, Eli. Alone, Eli should get 4.5 stars, but I can only apply somewhat of an average for the whole DW experience. DW has pointless contact personnel who muddle the online process. The tags and registration process has to be streamlined. I only needed to be in contact with the dealer; Tanya, the dispatcher, who was terrific; the delivery person; and someone like Eli to take the process to the finish line, as he did, wonderfully.", "rating": 3}, {"title": "Beware when selling your car. The driver will try to pick up car and not wait for you to check if deposit was made to your account", "text": "I liked the supervisors that helped me with issues that surfaced at the moment the car was being picked up. I didn’t like that the process we had agreed on was being changed at the last minute by the driver that came to pick up the car. Thanks to the supervisors on the phone we were able to deliver the car ourselves to their hub nearby. I thought it was weird that the valet wanted to test the car in the neighborhood without me in the car, then he wanted the keys and he would not wait for 15 minutes till the check was being deposited in my account. It looked very suspicious given the nasty attitude this driver showed with my husband and I", "rating": 3}, {"title": "A work in progress....", "text": "Three things:* After I paid the full amount in cash there was a significant delay before I received the vehicle.* I was required pay to insure the vehicle more than two weeks before I could ever drive it.  That is costly and wasteful, and is a hidden expense that should have been disclosed.* The odometer was over 1200 miles above the reading listed on the paperwork for the vehicle I signed for.   I received an explanation that may be true, but was not very precise about the source of the miles.  The vehicle could have been driven to me from the dealership for about half of the mileage discrepancy- so I consider it egregious.My mechanic said the vehicle was in good shape, so I decided to keep it, despite all of the above.     Employees were all polite and tried to be helpful, but the process was unnecessarily long, convoluted and unclear, despite some attempts by them to explain it.I have been an investor in LAD in the past, and after consuming the corporate presentations, expected more from this process.  ", "rating": 3}, {"title": "Not Consistent", "text": "I wanted to provide a detailed review of my experience with Driveway. I found a car online and contacted Driveway. I spoke with Savannah, who was friendly, knowledgeable, and attentive. She guided me through the car details, contract, and the $500 holding deposit. I submitted all the required paperwork, including a picture of my driver's license, current cell phone statement, and proof of insurance. Afterwards, I e-signed the documents and received DMV paperwork via FedEx for wet signatures, which I returned.Priscilla, my new representative, was also helpful and friendly. However, the next representative, Cheyenne, who is a dispatcher, provided incorrect information and was rude. She did not follow up with me and did not respond to my texts or calls, indicating a lack of follow-up and communication as the process continued.My credit union sent the check to the dealership, which was received on Monday, Sept 16th, and the car was delivered to my driveway on Wednesday, the 18th. The car was driven from the Valet Delivery Center to my home, and the Valet representatives were helpful. They pointed out a chip in my windshield and advised me to contact Driveway for repair, for which they were happy to reimburse me. However, I had to persistently follow up as there was a lack of communication, leading to delays in receiving the reimbursement.As for the $500 holding deposit, there has been a mix-up, and I am still waiting for them to contact me once the transaction is complete. Overall, my initial experience with Driveway was positive, but as the process continued, the service was not great. While I love my car and the price, I would not choose to buy from Driveway again.", "rating": 3}, {"title": "Can't get back my $500 refundable deposit", "text": "I started the process of buying a car from them, but  I cancelled my application on third  day.  I can’t get my deposit back. My salespersons  Deshaun and  Khamila disappeared, and nobody will even talk to me. Can anyone suggest how I can return my $500? Please Help!!!After I posted this review, I was contacted by Eli, who was very nice and quickly resolved my problem. Now I feel that my overall experience with this company is  better that is why I am updating rating from 1 to 3. Thank you again Eli.", "rating": 3}, {"title": "Pretty OK, all things considered.", "text": "They were great to work with until I sent in my title. Once they received that, the customer service pretty much just ran dry. It was kind of a hassle to get paid for the car, and their communication pretty much dried up as well. Like they’re OK, and I’m glad that I sold my car to them because it went faster than a private sale, but I can’t confidently say that I would do it again ", "rating": 3}, {"title": "The experience and process was very…", "text": "The experience and process was very easy. Everyone I interacted with was great and they always returned texts or calls quickly. I love the new Jeep! But from the start of the process until the time it was in my driveway was 6 weeks. If you have time to wait, definitely use this company they are great! ", "rating": 3}, {"title": "Too many step and too many reps", "text": "The process takes way too long for selling. At every stage I had to ask the new representative what the next step was. Every step had a different person handling the case which was disruptive. I often had to email or call to check up on the status of the process and there was no way for me to track things. The only reason i gave you guys a 3 is that the reps were very courteous otherwise this would be a 1.5/5.", "rating": 3}, {"title": "Temporary plate issue ", "text": "Liked how easy purchasing was. I was disappointed that my temp plate was not on the vehicle. Causing much stress anxiety and worry. Leaving me unable to get back and forth to work. Due to it not being a legal vehicle. Customer service was not much help in trying to resolve this. ", "rating": 3}, {"title": "Was worried I was gonna have issues…", "text": "Was worried I was gonna have issues getting plates in a timely manner after reading reviews , the car is fine but like others I haven’t received plates yet and now my temporary tags are expired … can’t drive vehicleDavid wood 7910 115th ave e Parrish fl 342199412434841", "rating": 3}, {"title": "Recently purchased a vehicle with…", "text": "Recently purchased a vehicle with driveway although it didn't work out the customer service was expert at it's best. I had the pleasure of working with Christina mogford she made this return and refund easy.", "rating": 3}, {"title": "Good Start - Poor Follow-Through", "text": "The online viewing, selection and purchasing process was pretty efficient.  I recommend providing customers with a \"map\" that shows them what is going to happen and with which offices/positions.  The number of different people (and phone numbers) involved in the purchase and delivery became confusing.  Follow-up, after purchase, was abysmal.  The dealership did not have enough personnel to timely deliver the car, temporary registration documents were forgotten and took almost a week to reach me via regular mail (when promised overnight by Justin), calls/texts were not returned, have been texting Corey for several days about the status of permanent registration and plates.  Not happy at all about this poor, post-purchase follow-through.", "rating": 3}, {"title": "Problems were not disclosed", "text": "The vehicle was sold \"as is\". Which is understood.  However, when I asked if there were any known issues, I was told no.  When you start the car, it is obvious that there is an issue with the radio/ nav system because it beeps constantly.  After reviewing the issue it is a known problem with this year of vehicle.  The touch screen delaminates.  It's a $1500 fix.  I was told that a picture of the radio showed the delineation.  If you know what you are looking for, you might be able to see it.  But most people would never see it and even know what it was.  Other than that, the car was as advertised. Just very disappointed in the lack of disclosure to a problem that the deal had to know about.", "rating": 3}, {"title": "Communication ceased after full payment was made", "text": "Buying seemed to be a good experience up until full payment was made. People were friendly, helpful, responsive and pleasant to deal with. Then when full payment was made all communication stopped. I am now wondering what's next, If DRIVEWAY remains silent?  Since buying was done by communicating with several people, Who should we reach out to for the plan of delivery? I will review again when a new connection is established.02/27/202402/26/2024 In this day of Scams and scammers it is unnerving to sit waiting in silence after investing so much cash in a product with no documented escrow interface. STILL, no confirmation of our payment in full.Buying such an expensive product by telephone is both arduous and scary. An email paper trail would take much of the worry out of the deal.02/26/2024 We have had success by emailing (some person) with a request. While that does work I am surprised (considering the amount of money in the dealer's hand) that the \"seller's\" protocol does not include frequent notices of progress to reassure the buyer. AT LEAST DRIVEWAY should confirm receipt of electronic payment in full", "rating": 3}, {"title": "They fixed the issue", "text": "*updating from 1 to 3 stars after being contacted by Driveway.com’s reputation specialist. Eli listened to all of my issues and seemed genuine and appreciative to hear about my experience. He also refunded the $ that was owed to me immediately. Eli’s response has changed my opinion to the point that I would use driveway.com again as long as Eli remained a contact for me. Thanks again Eli! 5 stars for you. Lucky for me I’m happy with my car except the missing trim piece on my start button that the dealer/driveway has yet to follow up on. However, the communication/follow-up is unacceptable. I was overcharged for my down payment and have been completely ghosted by Nick who is supposedly a supervisor. I have called corporate X 2 and have heard nothing. The whole experience left a bad taste and driveway.com leaves the buyer with a strong impression that they have no idea what they’re doing throughout the entire process. I have wasted so much of my time trying to get my $ refunded and have yet to be successful.", "rating": 3}, {"title": "Plate disaster", "text": "Disaster of an experience to receive plates and registration, however once I got a hold of Christina Mogford she did everything possible to make sure I got my plates and registration updated to the correct address and delivered to me before my temp tag was expired. Christina was a huge help and I would have been lost without her", "rating": 3}, {"title": "One bad apple, but amazing every other way!!!", "text": "3 Stars because I had a wonderful experience with 2 out of 3 associates I worked with while purchasing my vehicle. But one very bad associate who did create a lot of headaches for me. The car buying process ultimately was easy, timely, and efficient. However, it is only due to the associate Na’ai located in the Oregon office, that I would recommend Driveway to anyone. She had responded to me when I couldn’t get ahold of the one associate, she aided me, communicated for me, fought for me, everything. Na’ai truly did go above and beyond the typical customer service I’d ever expect. She took on my complaints that were out of her control and found ways to fix them, as well as compensate me for the huge trouble that was in no way her fault. Na’ai needs a raise, a promotion, a bonus, everything. Aside from the associates, the online platform was very simplistic and made my first car buying experience a pleasure!", "rating": 3}, {"title": "Damage to vehicle and no temporary tag", "text": "From the time I decided on the vehicle until the time I receive the car was approximately seven days which is much earlier than I expected considering it was coming from New York to Georgia. I could've had it sooner, but I was out of town and had to wait a couple of days to receive the paperwork. Once the appointment was made for the vehicle to be delivered they actually delivered it four hours early. I did not expect them to drive the car to my house from the receiving point in Georgia. I expected it to be on a very large truck. Nonetheless, the car was received, but when it was received, it had no temporary tags, and the fender was broken. The same day I received the vehicle is when I address the issue, but I have not been getting a proper response or no response at all. For the past 3 1/2 days I've been trying to get a resolution for the tag and my broken fender but the several people I have been talking to who normally reached out immediately are no longer responding. Today I did get a text from someone to say that she would take care of my matter, but still waiting to receive my temporary tags and resolution on my broken fender that was not in the pictures that was sent to me. I still cannot drive the car legally because there are no temporary tags and still have not received the proper paperwork for my vehicle. ", "rating": 3}, {"title": "Nice customer service...but the process…", "text": "Nice customer service...but the process is long..And the car we got have things wrong with it and it's not listed...the inside of the car is mess up...", "rating": 3}, {"title": "My whole experience went from fast to…", "text": "My whole experience went from fast to sh** to sweet. The buying process was very quick. The buying process was fast because I was already preapproved with my bank and all I needed was to send the check. I found the car I have been stalking and I acted. I was skeptical because the amount of people I was in contact with different telephone numbers from different states. Tanya was great with processing everything but they still got my delivery location wrong even though the car was sent with the correct delivery address on my paperwork. Communication is lacking horribly. They need to work on that. I was always calling checking on statuses of my order constantly because I wasn’t receiving updates. The delivery process was even slower and I was only 4 hours away from where the vehicle was located. Nathan was the transport dispatch and I stayed on his butt about updates. Even though this process was a pain I am satisfied with my purchase. I hope this helps.", "rating": 3}, {"title": "not sure yet but after reading  all…", "text": "not sure yet but after reading  all these bad reviews  I'm terrified  😳 and I just started a purchase on a 2019 toyota  corolla really hope this doesn't go south", "rating": 3}, {"title": "Toyota Camry", "text": "You got me for mileage being not exact after I told you on the phone it was estimate. Cost me $1000 because I never spoke to the same person twice", "rating": 3}, {"title": "Bought a 2020 Dodge Challenger SXT", "text": "Bought a 2020 Dodge Challenger SXT. First off, I got the car and it's amazing. Love it. HOWEVER, it took nearly 3 weeks to get to me, and there are no temp tags. I was told to obtain my own and given zero additional advice. I contacted my DMV and they do not have it in the system and cannot do anything for me (Driveway said they sent in the registration paperwork). So now I have a $26,000 paperweight in my driveway and no way to get to anywhere. This is quite frustrating and I have seen that this is a common theme. If it weren't for this it would be an easy 5 stars, but come on... what am I supposed to do if I can't drive my car?", "rating": 3}, {"title": "Some of the driveway executives not…", "text": "Some of the driveway executives not picking the call during in process purchasing my vehicle. It is very difficult to reach them.", "rating": 3}, {"title": "The overall experience from signing the…", "text": "The overall experience from signing the paperwork to having the car delivered was about 2 weeks. The main problem I have is that the 1st car payment is due 2 weeks after receiving the car and 7 of those days was the “7 day test driving period”. I would of thought the 1st payment would of been due a month after actually having the car. When contacting customer service was told that the “payment date” was not showing in the system and needed to contact the bank. The bank has nothing to do with changing the payment date? So basically now that I got the car and the sale is finalized no one wants to help. Logically a monthly car payment is a payment for the month of driving the car not 2 weeks. So to anyone buying a car from driveway be prepared to pay your 1st payment even if it’s a week after getting the car and also do not expect for anyone to help you if you have a problem. Very unprofessional", "rating": 3}, {"title": "Experience", "text": "Thanks to Christina & Sarah for making my bad experience all right! They both went above and beyond to help me make this whole experience right.", "rating": 3}, {"title": "Received vehicle 2 days ago and…", "text": "Update:: After sale support is lacking.  Vehicle is missing some items advertised and getting resolution has been problematic.  While I think we've agreed on solution, Driveway is very slow to live up to their end and communicating with the sales agent is painfully slow.  For an Internet company, speed is not their strength.Received vehicle 2 days ago and everything is as expected.  Delivery was \"early\" but the process seems to have a lot of fat built into it that sets customer expectations low - easier to over deliver.   Recommendations for Driveway - improve communication quality and better insight.  All updates are very generic making it difficult to feel comfortable with the process.  Allow buyer to access the online advertisement after purchase.  This allows the buyer to self answer questions that may come up after agreeing to purchase (buyers should save all pictures and descriptions prior to agreeing to buy - you'll lose access).  No need to have docs sent for Notary when notary can be done online these days.  Reduce cost and cut several days out of the process.  I could go on and on.  In the end, I got the vehicle and am satisfied with the experience - hopefully plates come without hassle.", "rating": 3}, {"title": "Their car search is almost useless", "text": "Their car search is almost useless.  You cannot compare actual prices you would pay.  They give you a MSRP but at the end the dealer can add $1000 in doc/other fees when another one doesn't.  No way to find the cheapest car.  Even stranger is that they allow you to sort on shipping fee, or price, but NOT shipping+price (and then not the fees mentioned before).  Do I really care if a care is selling for $500 off MSRP if the shipping is $2400?  Only way to find the cheapest is to click on every car and then click \"estimate taxes and fees\" and write it down.Also, they do not let you filter out \"coming soon cars\" (I guess that would show how little inventory they actually have).  If I want to buy a car today, why do I care about things that are coming soon?  Do they expect me to log in every 10 minutes and check if it is there or not?  OBVISOUSLY no one that works there uses their sitePLUS the new cars are listed with MSRP where some of them have extra features added that up the MSRP, BUT NO WHERE are you told what was added.  You might be paying $500 more for some fuzzy diceOBVIOUSLY the \"follow up\" below DID NOT read my post since it doesnt apply to what I saidWhy do they need my name because they have a lousy search.  It was like (before the edited it) they wanted to know the VIN number of the car I wanted to buy when I said it was hard to search on their site.  Makes me think there is just a BOT responding", "rating": 3}, {"title": "I was skeptical about purchasing from…", "text": "Update: I have been working with Sarah since this review and I have to say she has been great. She is taking a crappy situation and doing what she can to make it right. She has provided an update every other day, advised me of exactly what was going on and offered a rental vehicle when I need to go to FT Lauderdale at the end of the month. As of right now I still do not have my registration BUT have been told it is in the home stretch and should have it by 1/4/24. Will provide another update when I receive my registration.I was skeptical about purchasing from Driveway and I should have trusted my gut. Purchased a Jeep from a NJ dealership (I live in FL). Was told my tag could be transferred over and process should take 2-4 weeks. I am now a week away from my temp tag expiring. My DMV rep advised that I call my local office and ask them if they can issue my a temp tag. I assured him that FL will NOT issue a temp tag for an out of state vehicle (I was correct). Isaac also lied and said that my paperwork had initially been rejected due to a Power of Attorney signature but was \"moving along\" now. When I called my local tag office- they have no history of it. I am beyond pissed and frustrate as this has now consumed my days. I will be seeking a lawyer if not resolved.", "rating": 3}, {"title": "Difficulty with tax situation", "text": "In theory, great idea. I did not have a great experience however, as they wanted to charge me tax on a purchase where there would be reduced taxes. I pointed this out to them, the agreed, send an updated proposal. I signed the new proposal where they would not collect the tax. (taxes if due would be paid locally when registered, in this case for used EVs in WA state)After securing the car, they sent a payment request for $500 as expected. I paid this. After that, they claimed they think they do need to collect the tax, so they would need me to sign a new proposal with the tax added back in, and I could \"try\" to get a tax refund from the state.The person I worked with the most, Nolan, was quite helpful. I blame their system for not working with the different situations in different states, or whoever higher up the chain reneged on the proposal they sent and I signed. Not worth getting lawyers involved, I'm sure in the fine print they can change the offer as much as they want.I had to go directly to the dealer to complete the sale, they had no problem with the tax situation. I would have liked to use Driveway but their system still has some kinks to be worked out--once it is more mature I think it will be a great way to buy a car.", "rating": 3}, {"title": "It's a 50-50 crap shoot folks!", "text": "Updated and moved from 1 to 3 stars:Pros:  I got lucky and my car is nice and was a good price.My car didn't get sold out from under me.They reimbursed me for cost to service start stop.They refunded the overcharge for DMV fees.I got my title in a timely manner.Cons:  They didn't take the car back in the 7 days.They didn't respond about the needed service until it was too late.Refunds were only made after persistent calls and arguments and escalations.  Others have had the car sold out from under them even after sending $500 to secure it.Sellers have had them slow walk their payoff.Buyers wait months for a title.If you get one shipped to you, returning will cost you shipping fee both ways, even if the car was trash when delivered.  Read the one star reviews!  You got about a 50% chance of getting what you want.Buying a 2021 Chrysler Pacifica Touring L, located 150 miles from me.  Driveway said it passed a thorough inspection.  When I picked it up there was an error message about the Start Stop which I reported to Driveway on day 1 of my 7 day return window.  Their tech didn't respond to my concern until day 7, which was too late to get a diagnosis.  I asked to return the car.  They denied it because it was over the 400 miles ... even though their website claims they'll just charge $1 per mile if you are over. Twice I had to make special trips to town that Driveway requested, adding up to about 150 of the extra miles.   Delivery with an error!  Lying about $1 per mile!  You can't trust Driveway.com.", "rating": 3}, {"title": "Taxing experience...", "text": "Our experience with Driveway could have been a lot less taxing than it should have been.  After taking delivery of our purchased vehicle, we contacted customer service inquiring when we could expect to receive registration and plates.  After not hearing back, we called customer service again after the 7-day guarantee period had passed. Despite being told we'd be notified, we never heard back.  Given an impending trip with plans to use this vehicle, we called once again, only to be told that selling dealership still had the title- this is now 3 wks. after taking delivery- and that it could take another 30 days for us to get registration...We have had many transactions with other similar organizations and it has never taken almost 2 months to get registration!At this point, we escalated and luckily ended up working with Amey.  She proactively worked with the dealer and within her Driveway organization to overcome this delay by getting all the docs in our hands within 3 business days.  Amey also provided great communications, keeping us updated and advising us what to expect.  Result: We were able to get our vehicle registered just in time to depart on our trip as originally scheduled. If not for Amey's 5-star initiative and intervention, I would have given this whole experience a 1-star.  Thank you Amey!", "rating": 3}, {"title": "The process was not as straightforward…", "text": "The process was not as straightforward as promised. There was confusion when the title was sent to us to get notarized in two places. The notary would not do it because my name was nowhere on the title and only dealers notarize Box B on the back. After getting a driveway rep on the phone at the notary who was staying after hours, the issue was not resolved. My husband, who used to sell cars, called the dealer and followed up with a different driveway rep the next morning. It turns out, the title should not have been sent to me. There was also confusion on 2 of the final paperwork requirements (VIN verification and original inspection). Who was to do these? How was I to do them since I do not have possession of the car? I called the rep and she said that because both dealer and buyer were in the same state, we MAY not need to do that. Again, confusion. Finally, it was promised that the driver would call when they were 1-3 hours out. I got a call from driveway (I think) that said the driver would arrive between 7-8 pm. I asked if they would call. She said yes. The driver arrived between 4 and 4:30! What if I wasn’t there? I got no call. Additionally, the driver did not speak English and had no signal. I had no idea what I was supposed to do. I tried using Google Translate on my phone but his country was not translating accurately. His call kept dropping when he tried to call his agency. This went on for over half an hour. We went with Driveway because we wanted to save a 7 hr round trip to the dealer; however, we spent quite a bit of time working through confusion with the process. After putting this in writing, I’m leaning more toward a 2-star rating. It would be helpful to be assigned one person from start to finish who knows the entire process. ", "rating": 3}, {"title": "I found the truck of my dreams", "text": "UPDATE!!Eli reached out to me and got the ball rolling with his team! Alicia (Dallas office) got me to the finish line 🏁. I’m so happy that she was brought in and helped me see it all the way through. She worked extremely hard and stayed up late nights on my case. Thanks Alicia!! P.S. she needs a raise! She goes hard for her customers. So my experience turned into a great experience because I got what I wanted plus more! I received my truck on .09/23/23Thanks again Dallas office!I found the truck of my dreams. I had an approval. Accepted my proposal and made a deposit. 15 minutes later I get a call someone was at the dealership putting a deposit down the same time I did. So I said okay I’ll wait a few days. The rep insisted I apply for another truck and then they denied me. The first truck they said the dealership wasn’t answering their calls and hanging up on them. I found that odd. Being that driveway tells you they ‘own’ all these dealerships but then the managers couldn’t get the truck? So I was disappointed because this was a bad truck too. I will not recommend this company and don’t have your hopes up high either!", "rating": 3}, {"title": "Update  01/04/2023", "text": "So I recently bought a car from this company back in September received car 10/17/2022. I did a review on Trustpilot.com  10/18/2022 I was told to email customer service did same day, no response, I followed up with another email 11/3/2022. No response So my issue never got fixed nor heard.I then reached out to lithiacares 11/11/22 no response.Also filled out form, also called left voicemail, online for lithia cares still no response.So my previous concerns haven’t got heard. Now I have a new set of concerns.Driveway finance never told me that there will only be one method of payment. Which is ACH my bank is not allowing me to do ACH. They have sent the payment back three times. So I decided to do mail in payment; they refused it and sent it back.They also never told me in my contract that I will be accruing interest every day. If I would have known that I would not have signed up for this it makes no sense. I will never have car paid off.I’m not receiving my invoice/ statement monthly I have to call and they email. Also, I sent in a letter to three different addresses, informing them that I would not like my personal information, or experiences together, or any information from our contract, shared with any party outside of the contract.Of course no response.At this point I no longer wish to do any type of business with this company.Update as of 1/04/2022 my issues with Driveway have been solved and I’m so thankful for Issac reaching out to me and solving and understanding my concerns I really feel as if he really cared.Only reason for the 3 stars as of today is due to my on going issues with their other department (Financial department) Driveway Finance Corporation has yet to reach out or reply to any request and/or concerns", "rating": 3}, {"title": "I still have not received the payoff to…", "text": "I still have not received the payoff to my credit union for the vehical ", "rating": 3}, {"title": "To many emails and texts from different…", "text": "To many emails and texts from different people. I  didn't know who I was talking to.", "rating": 3}, {"title": "The initial approval process was quick…", "text": "The initial approval process was quick and easy for me along with the delivery process ; The delivery team in Detroit Richard and Team was the first ones to inform me of the damaged chewed seatbelt cover that still works and the window chip repair and how to possibly transfer my vehicle plates to new vehicle. However ,  the process of getting an agent to assist me with title work for transfer of plates was not good .I was giving the run around , giving the agent who did my application process and approval process would not respond to me after I ask for the information on how to get my license plate transferred . I know the time frame of getting an out of state plate could be long with personal experience of seeing a person wait six months ! I just wanted to prevent that part because my job consists of me driving and I explained that from day one that having an updated registration would be necessary. In addition my vehicle was delivered today and two hours later the check engine light came on stating service engine . This is not only scary but so inconsiderate and inconvenient for me as a customer/ purchaser and as a company to promote their service this way . My vehicle was sold as is but never was I given information that my vehicle needed for engine maintenance nor was I shown a broken / chewed seat belt holder or crack in windshield which was repaired , I was told customer care team will follow up about the engine light but bo one called me pretty much the same treatment I received after approval .", "rating": 3}, {"title": "Worst car buying experience I have ever…", "text": "Worst car buying experience I have ever had! if you don't want to wait weeks for your car to be delivered, and the trade-in to not get paid off on time! Don't buy a car through Driveway. I put 3 stars because I did receive the vehicle I bought. Janiyah, the person in charge of completing the sale was as good as she could be, she was proactive and did her best! But the mess is that she wasn't the only person I had to deal with, and they have to deal with the actual car dealerships who take a really long time to do things for Driveway customers. It took them 2 weeks to deliver because the people at the Wappingers Falls Toyota took their sweet time getting a temp plate that apparently was required by NY State (even though I am in FL) the car arrived to FL 4 days after I made the purchase, yet they couldn't deliver it to me without that temp plate, even thought the FL registration was done. Temp plate took a whole other week, which was very stressful for me because I couldn't drive the car I was trading in cause I had to change the insurance to the new car that I did not have yet in order to get the temp tag that I never used.So finally, the car arrived and the trade-in was picked-up. Now, it has been almost a month since the sale was finalized (3 weeks since the car was picked-up), and it still has not been paid off yet.  So again, turns out, after having to ask for a supervisor, that driveway financing is not who is in charge of the pay-off, but instead it is someone at Wappingers Falls Toyota who has not done it.  Tomorrow I have to make payment for the car I traded in, meaning this month I have to somehow make two car payments (one which I cannot afford) to keep my credit score from becoming delinquent. I find this utterly unfair to me, and I find this company a mess!!... the fact that for each thing one has to talk to a different person, the fact that they don't follow up with the car dealers to make sure things like this get done makes this a terrible service.This was my first and last time buying from Driveway", "rating": 3}, {"title": "Rollercoaster Ride, Ended Up With A Car In The End", "text": "Ok. So my experience buying a car was a bit of a rollercoaster ride. I'm going to give an honest review here.First,  on Monday May 6th I placed a $500 deposit on a 2020 Ford Escape and was then told it had already been sold. I've seen that echoed in other reviews. Jennifer told me the dealerships are in charge of updating inventory and don't always remove sold cars quickly. I was told I can get the deposit refunded or transferred over to another car if I had seen others. Jennifer helped recommend a few similar cars and I chose a Jeep Compass with low mileage. On May 7 Jennifer said she'd let me know as soon as the vehicle was secured. May 8 I didn't hear anything back.May 9th Jennifer let me know she was out of office and the vehicle was secured but it wasn't marked as such in the system. She told me \"contracting\" should be reaching out soon.May 9th and Heather reached out to me and let me know that due to my state I'd have to sign documents in person in front of a notary. Some states allow you to sign everything online so this step could be done in one day, but she wasn't able to get the papers out until Friday so I didn't receive them until Monday evening. The notary was closed so I went on Tuesday, but had to return the car I was borrowing so was able to send the papers back on Wednesday. Heather received them on Thursday, so this step of the process took an entire week for me. During this time I paid the dealership. May 17th and I was told the delivery coordinator should reach out to me via email or text.I heard nothing until Sunday, May 19th I got a call from the delivery driver that he was arriving that day. Good thing I wasn't out of town. After that, I got a text fom Patrece that the car would arrive the next day. I told Patrece I just got a call from the driver that he was arriving today. She was surprised but it didn't surprise me since communication between departments seemed to be lacking. The delivery guy delivered my car and the rear panel that holds the 3rd brake light had been stripped off and there were 2 dents in the front windshield. I forwarded photos of this to Patrece and she told me a member of their team would be reaching out to investigate.May 20th Lidia with the Customer Satisfaction team reached out and I sent her the pictures. First, I got no response in a day and I was told she was out. Once she was back she was great in helping me find the part and schedule to replace it with a local mechanic. She also scheduled a Safelight appointment to fix the chips. They sent a check to cover these costs since apparently the car was not sent in that condition. No idea what happened to that rear panel that's strange to me. TL;DR:I think the experience received with Driveway is heavily affected by a) lack of communication between departments, b) if your customer service rep in any department is out you won't be advised, you just won't hear from anyone until they return c) the state you buy your car and the state you live  can affect how long things takeOverall, it was an interesting experience to buy a car online. It did take much longer than I had anticipated with bumps along the way. However, now I do have a working car. ", "rating": 3}, {"title": "Terrible Communication, But Eventual Results", "text": "So there were many things done well in the course of my transaction, and a few things that sort of fell short of the desired mark.First: the approval process.  Driveway did something that no other lender could, providing financing for a vehicle I really wanted without requiring an astronomical down-payment to secure it.  Even the interest rate is marginally better than what I was being offered elsewhere.  This was a HUGE win, and one of the primary reasons I would engage Driveway again should a need ever arise.Next (and this one should be taken with a modicum of a factor of luck with regards to who is going to be your \"concierge\" in the process), communication with certain parties was on par with excellent - specifically, Lily.  Rarely did she leave me wanting for a response longer than 10-15 minutes so long as she was in the office.  However, as notated later, this was grossly inconsistent.Finally, paperwork is overnighted once everything is ready for contracting, and they provide a prepaid return overnight envelope.  Nothing out-of-pocket was spent getting documents with original signatures where they needed to go.Now the not-so-good.First, as mentioned above, communication is severely lacking from key individuals, such as Nathan (the person responsible for releasing your vehicle for delivery) and the other person responsible for actually arranging delivery.  I texted many, many, many times to multiple people to try to find out what was going on with delivery of my vehicle, and Nathan flat-out refuses to reply, while others promise they're looking into it when the reality is, they are doing no such thing.  Things got so out of hand that at one point I requested cancelation of my deal, but after a few hours of cooling off (needed after I was getting nothing but the runaround with regards to the actual upcoming delivery date), I went ahead and took delivery.You will be told that the process can take as few as ten days, but as many as 21 - REPEATEDLY.  This is not reassuring when there is this much money involved in a transaction.  My vehicle was only located a couple of states away, yet was picked up from the dealership on a Wednesday and not delivered until Saturday (which was still a couple days sooner than the SECOND updated delivery date I received which was going to be the following Monday).At many points in the process, I had to reach out to the actual dealership independent of Driveway staff to find out what was going on.  You will not be given direct contact information for some of the instrumental staff involved in getting your deal going, which is extremely frustrating.  It also bears mentioning that there is damage to my car that was not documented in the photos provided either by the dealership or by Driveway (I'm assuming Driveway just uses the dealer photos and modifies them for their platform), which was REALLY annoying to take delivery of a vehicle with an unexpected bash and scratches.  But, since I signed documents sight-unseen stating I'm accepting the vehicle as-is, I have absolutely no recourse in this matter.Overall, I would do this again, again all the while knowing I'd be rolling the dice with the level of communication from various Driveway staff, the actual condition of the vehicle itself, and the utter crap-show that actual delivery of my vehicle turned out to be.", "rating": 3}, {"title": "I’m dissatisfied with Driveway delay in…", "text": "I’m dissatisfied with Driveway delay in paying lien holder.", "rating": 3}, {"title": "Anything but \"easy\"", "text": "After an excellent initial experience with Broderick, I had multiple negative experiences with this company that claims to \"make the journey easy.\" I purchased a vehicle that had to be delivered from CA. I was told some paperwork could be done digitally, some had to be hard copy, and a few would need to be notarized. The documents they sent contained multiple errors that required they be redone and sent back to me more than once - including after I'd already taken time off to get some notarized. After finally getting the correct forms and returning them, I was repeatedly told I would get updates on delivery. I was told when it arrived at a Driveway facility in my state to be cleaned and prepped. Several days went by with no updates or information unless I asked. Then suddenly I was told it was literally en route to me and about 1.5 hrs away. All told it took close to 4 weeks.Once I got the vehicle, there were no temporary plates and no title, even though I'd paid in full. I had to reach out to multiple people at Driveway before I was told they were going to register and get permanent plates for me so they needed the title temporarily. That's understandable - but why not tell me ahead of time? More importantly, with no temp plates, I could not drive the vehicle. I was told I could get temporary plates from my state DMV by more than 1 person at Driveway. Again, if you're trying to \"make the journey easy\" why wasn't this communicated to me ahead of time? In this case, that's because what I was told is not true. After I got through to the DMV, I learned this is not something the DMV does in my state. More attempts to get help from Driveway and I finally spoke with 1 person who knew that my state DMV does not do that. Their solution? They told me to buy a 3-day travel permit and then renew it every 3 days over the 2-3 weeks she said it would take to get permanent plates. In short, I was told to do something illegal so that I did not own a vehicle that I could not drive. Again, why was none of this explained to me ahead of time?Finally, the vehicle itself had a few issues: headlight out, broken latch on a cupholder, and it only came with 1 key (with an almost dead battery.) I raised these issues with one person at Driveway who told me not to worry and that Driveway would help. However, when I brought them up with the Customer Resolution person, I was told \"things do break.\" She was full of excuses but short on empathy and \"resolution\" - I was basically told I would need to take care of fixing the issues that the vehicle arrived with. I did not pay for a \"broken\" vehicle! At the very least show some concern and offer to find a dealership to repair it. As far as the missing key, I was told that because the photos of the car didn't show 2 keys, they don't provide 2 keys??? Vehicles are sold with 2 keys. That is standard and if that is not the case - once again - communicate it clearly! (There was nothing written anywhere about not providing 2) Again, no resolution or even attempt at understanding - basically just \"too bad.\"In short, a company that claims to \"make the journey easy\" was anything but. I have bought a lot of vehicles over the years, and this was the most difficult and unsatisfactory car buying experience I've ever had.9.25.23: Sarah and I had a very productive and helpful discussion on Friday and now we have a good plan to address my concerns. I will update this further as we go along. I do appreciate Sarah making additional effort to resolve this.", "rating": 3}, {"title": "The management was helpful ", "text": "Driveway is not for everyone.", "rating": 3}, {"title": "Recommend over in-person dealerships, but with caveats", "text": "I'm giving 3 stars, but I'd rather give a 7 out of 10 if it was an option. The buying experience had quite a few positives, but it's not a perfect experience. In my case there were a few issues I can't ignore, most of which were later in the process. Skip to the end for the TL;DR summary.The car I received was in great condition, clean and pristine. Financing was convenient and there were absolutely no hidden fees. Given the state of dealerships these days this should never be taken for granted. It only took two weeks from the day I ordered my vehicle online to the day I actually took delivery (this is a car that shipped from CA to FL). Any forms and paperwork required I tried to send as soon as I received them, and that probably contributed to the speed of receiving the vehicle. The only complaints I have came after receiving the car.Be warned, if you need a drivable car immediately then buying from out of state isn't the best option. The process of passing paperwork between the respective dealerships and DMVs can propagate some serious delays, delays that Driveway can't do anything about and can leave you without car registration for MONTHS. In my case, I received the car at the very end of June 2023 and registration came in mid September. My state doesn't do temporary tags in this case, so much like the name of the company my car sat in my driveway.While very professional and friendly, Driveway's support staff didn't follow up with me that often. With any of my inquiries about the registration they promised to follow up, but rarely did so. After signing the paperwork and giving my down payment, communication felt like less of a priority for them, and this is not a unique complaint as I've seen this in other reviews. Worse yet, when I received my registration it only lasted 3 months, expiring in December even though the registration fee Driveway collected should at least get 6 months.After much back and forth, Driveway support left me with more promises to follow up that were often unkept. Even when I followed up and contacted them, they pawned it off on \"the DMV team\" or \"looking up the case notes\" and the cycle repeats. This is probably the biggest criticism I have (as do other reviewers), but I would still recommend Driveway over in-person dealerships if I had to choose. I'd take phone tag over sneaky fees and high pressure sales tactics, but that's just my preference.And finally, I have a few suggestions for Driveway. All of the major pizza chains have a \"pizza tracker,\" a webpage/screen customers can visit to see the status of their order, from \"order received\" to \"in the oven\" to \"final inspection\" and then delivery. If this can be done with pizza, why not cars? Having more transparency would ease a lot of customer concerns. Driveway's customer service team already takes internal notes for each case/order, why not just create a pin/password secured page where customers can view the notes related to their car and registration process, as well as a progress bar? This would solve MANY of the complaints I've seen, including my own. No need to call support for updates = more time for support staff to handle other matters. But also, please have some accountability measures for support staff to actually follow up with customers. Lastly, my car was an EV. For electric vehicles, total mileage is less important to judging condition than battery condition. It would be incredibly useful to know how much range is left on the high voltage battery if it is a used vehicle.Overall, I'm happy with the vehicle I received, as well as the financing and price transparency. The experience was better in many ways than the alternative of going to different dealerships in-person. The worst of the buying experience came down to registration delays/issues and the lack of responsiveness from customer support. Improving customer service responsiveness and building customer portal for order status would make this a sharply competitive car buy option.", "rating": 3}, {"title": "Registration and Temp Tags!!!!!", "text": "UPDATE 01/11/24: Since my initial review, I finally got an email stating I will have my plates tomorrow. I was also provided a tracking number. Driveway was also nice enough to issue a check for half of my upcoming car note for the inconvenience. Driveway actually wasn’t the cause of the delay in me receiving my plates, it my DMV office. They are behind on paperwork due to the holiday’s. So all in all beside this mishap, it was a good experience from the start. My only issue was me receiving my plates and being unable to drive my vehicle for a month. Which again I just found out it was due to my state DMV and NOT Driveway.Previous Review:The process of picking a car, putting money down and picking up the vehicle was a good process. I picked up my vehicle on November 4th. The dealership placed a 30 day temp tag on my car, handed over the keys and I was on my way back home to CT. Keep in mind the car was picked up from a dealership in NJ. I was reimbursed the delivery fee because there was no delivery that took place. The check came fairly quick. At this point I was thinking compared to others, everything is going so smooth. What can possibly go wrong? Well, I received an email on Tuesday, November 7th stating I have to complete a VIN verification for my vehicle in order to complete registration for the car. I went out at that exact minute to have it done because I didn’t want to delay anything. As soon as the VIN checked out, I overnight the form back to Driveway as they requested. I then receive an email on Wednesday, November 15, 2024 confirming that my paperwork was sent to a local dmv and is currently processing. Here is where I start to get worried. Knowing my plates expire 12/03 and NJ legally can only issue one temp plate. But I gave it time and hoped the plates will get here before then. It is now 12/04 and I don’t have no PLATES. I make my 1st car note on the 14th and is unable to drive my vehicle to get back and forth. This is unacceptable. When I spoke with customer service they said it will take another 2-3 weeks for it to come. They offered to pay 1/2 my car note off. Which I wasn’t oppose to at first, until they threw in if I agree to them paying 1/2 the car note it’s authorizing that I will release them from all future claims regarding this issue. I disagreed to the terms, as what if it takes longer then I won’t be able to hold them accountable. I even asked if they can give me the registration paperwork so I can bring to the DMV, they said no. I called my state DMV to see about issuing temp tag and they said they can’t do anything without paperwork for my vehicle. SMH!!!!Spoke with another representative on 12/06 to get and ETA or update on the status my plates. No updates. She stated I should expect my plates with it being the holiday season no later than 12/29. That will mean it almost being close to a month that I won’t be able to drive my car. I asked was there any alternatives. She said no, pretty much they did all they can do on their end and a message was sent to their registration department to see if they can expedite everything. In all my years I never had to wait this long for plates. Now I’m paying on a vehicle I can’t drive and based off previous reviews no telling when I will receive them. I called my state DMV and they have nothing in their system when I provided them with my VIN for my vehicle. SMH. I’m calling around to lawyers because this is unacceptable.", "rating": 3}, {"title": "Meh, All in all ok.", "text": "At first, there was a lot of anxiety due to lack of/mixed communication but Driveway did their best to ease any anxieties; I’d initially had. Looking forward to purchasing again through them! The future in car purchasing has arrived!Edit: Was promised a gift card, I never received smh", "rating": 3}, {"title": "I liked not having to haggle with…", "text": "I liked not having to haggle with pricing . Just look and purchase.", "rating": 3}, {"title": "Bumpy start", "text": "Bumpy start, but ok to work with. Have a lot of kinks to work through as a company. The car I got, I love and got a good deal on.", "rating": 3}, {"title": "Good...and bad", "text": "Good...and bad.  To keep it brief, we bought a car, received it, didn't like it, returned it and got our refund.This process occurred over a period of 2-3 weeks during which I must have spoken to everyone that works there.  Most of them seemed to know zero about the company or their role in it.  They were honest, helpful, courteous,  and clueless.  Finally found two guys who were competent to get it done...Chris and Phillip.NO, I would not go through this again.  An endless hassle of phone calls, texts , esigned docs, FedEx docs, and emails.  Finally just ordered a car from a conventional dealer.", "rating": 3}, {"title": "I need a temp tag", "text": "Purchased a car from them, was delivered without a temp tag. Dealership won’t give me a temp tag since it was from California, Driveway employees tell me to go to the DMV but my local DMV says it has to be through the dealership and they can’t issue me one. So am I going to have to wait for my permanent tags, which will take weeks, probably months to come until I can drive my car? I just want a temp tag so I can drive my car. It’s hard to get a hold of anyone, once I finally do they stop replying to my texts after an hour. Please just give me a temp tag so I can drive the car", "rating": 3}, {"title": "Sometimes it depends on how your luck is running", "text": "We've conducted a few transactions through Driveway.  Three out of four were very good.  We sold our vehicles with no problem at a very fair price.  The last transaction, however, left a bad taste.  The vehicle we purchased had some serious mechanical issues.  Driveway most likely did not know about these.  After a LOT of going back and forth with Driveway and the previous dealership and the local dealer who would do the repairs, the issues were resolved.  Parker (Driveway) worked with us and got us the results we needed.  Without him, we most likely would still be left hanging.  Would I do it again?  I honestly don't know.  But I do have to give Driveway good marks for working with  us.  Thanks, Parker!", "rating": 3}, {"title": "Buller?!  Hello?  Anybody there?", "text": "I've been trying to buy a car -- but I want details on the Vehicle Protection policy.  I've written an email, talked to the chat box AI/\"person\", and even responded to text messages.  No one has provided me any details on the warranty coverage/limitations.  Is it basically a waste of money?UPDATE:  Received vehicle protection brochure.  Appears to be comprehensive but it is provided and administered by a third party--much like you might buy when purchasing a vehicle at a dealership.  Bumped rating up to 3 stars -- will continue to update if I go through with a vehicle purchase.", "rating": 3}, {"title": "Trapped in a cartoon", "text": "Edit 2/7/23  at the bottomEvery \"customer service\" person suddenly becomes dumb and ignorant after you sign.. why do you have a call center full of ppl that literally dont know anything, can't answer any questions, or find out any information?? Designated BS team...  ask about the delivery of your car... they gonna tell you any thing to get you off the phone... I was originally told my car would arrive at the \"hub\" 2/6/23... then I received a happy text  saying it would arrive early 2/3/23. Great right.... wrong... i called  the disservice center Monday 2/6/23. 7am for a delivery update...was told yes the car arrived on the 3rd.. and some one would reach out to me... great right? Wrong..nobody reached . I had to reach. again i was told the car arrived on the 3rd and should be ready for final shipping.. great right?? Wrong again.. 45 min later i get a text it  says hey good news your car arrived today 2/6 at 9:16 am ... and is getting ready to prep... wait stop the tape... 3 sources informed me that The car been there since 2/3 infact I called at 7am and I was told the car was at the hub... so then how could it have arrived at 9:16 am the same day... remember when I said trapped in a cartoon?? So after I question that batshittery I get this ultra lame explanation...\"oh I apologize for the confusion. It looks like the folks that told you that were seeing an old ETA that was put into our system. I have confirmation of delivery to our hub from today, 2/6 at 9:16am.\" Hmm yall smell that?? I do it  smells like bullsS catfish and regret... so I called the shipping company ...guess what they told me???  The car isn't even there yet...  \"sniff sniff\".... I call back to disservice center 630 pm... now I'm told great news!!  the car arrived at 12pm today and will be begin prep tommorow....wow the arrival time magically changed again what happened to 9:16am better still what happend to 2/3?. Now even tho the car fake been there since noon... I'm still getting quoted 3-5 days till they inspect it... I'm not even 60 miles from the car and they talking bout 3 days.. that's absurd.. now I got  disservice girl talking to me in staccato like I can't count or understand English simultaneously dodging ALL my questions.. to the point I have to remind her...  to you watch her tone.. I asked her if the process could be sped up...NO  but she'd ask for me or maybe reach out to someone who can help.... I said no you won't you'll say you will but you won't we both know it..... so in conclusion... the only thing these clowns do consistently is lie. and .talk down to you..coulda just went to the  face to face dealer if I wanted to be lied to and condecended  for two or three weeks.... hard pass... I'm one more lie from refusing this car on delivery and canceling this whole S show ...  yall can give me my money back.. and eat this Loan that already on my credit report even tho I have no ride. I can't respect a company that cant maintain basic integrity.. no wonder you flooded with negative reviews.. and ppl flaming your company..My contact info is Quintonscott79@... this is a yahoo address.. if I don't hear anything besides another lie within 24 hours I'm done... bet it. Yall need to do better...Edit: 2-7-23  car was delivered as promised promptly at exactly 1pm on the dot.. so in conclusion.. now that i know lithia and they shenanigans...I would buy from them again and I'd even recommend my friends do it.. will you get a good car?  most likely YES..will you get a good deal DEFINITELY YES!.... Can you get financed with suspect credit? YES!!! For a small down payment (no bs they will work with you on the down payment).. they will turn your janky credit into a loan you can afford, a car you want, they not selling no trash. but you finna have to put up with some 2.0 lvl bs, some lies.. extra lies probly. days waiting for a call back. And after 2 to 3 weeks being annoyed.. if you are honest with yourself.. you will be happy on the slick.. so do it... driveway is your neighbors a-hole toddler that bites and says the f word but you promised to babysit.. but after he leaves and your house is wrecked your hand hurts from the bites but you low-key like the lil effer and even tho you trash talking you would watch him again... that's driveway.. and that's as honest as I can be.  Buy the damn car...", "rating": 3}, {"title": "Unresponsive", "text": "Purchased and received a car in March. Driveway is set up so that they send you the plates for the car. I still have but received the plates as of July 8 and the company's only direction is to drive using the expired temp tags and explain the situation if I am pulled over. They have failed to communicate the reason for the delays at every opportunity and I have only found out anything by calling in multiple times and insisting on receiving answers.Update: When I initially left this review, I rated the company at 1 star. Following this, I have received more updates from the company and the plates have been received. I have updated my review to 3 stars based on the ease of the initial purchase and speed of delivery of the vehicle.", "rating": 3}, {"title": "Took way to long to receive my car.", "text": "Date of experience: June 28, 2024", "rating": 3}, {"title": "Started the process to buy a car", "text": "Started the process to buy a car.   I was led to believe the car would be available right away.   However after insuring the car and putting a deposit down.  I was told it would not be available until 3 to 4 four weeks later.  Kind of think Driveway knew this and should not have posted the car as available on website.  The Driveway rep asked if I wanted to cancel the order but only after doing the whole process to buy it.   Kind of gives me a bad feeling about the company.  Hoping there is no more surprises with this purchase.  I will post additional comment when I know more.Picked up car yesterday from dealer.   Process went well and was free of any sales nonsense for additional services.  Vehicle was detail clean and with full tank of gas.  Car was supposed to be delivered but would have taken extra week, so I picked up at dealer.Update Dealer had registration paperwork done in timely manner.   It took a little over a week.Final Update received Title yesterday in mail.   All things considered in the present supply side environment this was a good experience.", "rating": 3}, {"title": "Don't bother with Driveway. How do you not know which dmv the paperwork was sent to?", "text": "Update: 11/27/2022.- Received plates, it took a little more than 3-5 weeks after getting the keys, but received it sooner than I expected. Thank you. Bumping 1/5 rating to 3/5.----------------------------------------------------------Don't bother with Driveway. I received my car on October 12 without temp tags. Received it the next day after notifying them that the car arrived without tags. The temp tag expired Nov 10. I had started calling Driveway everyday from October 26 to please hurry up with the dmv paperwork. I learned on November 8th, 2 days before the temp tag expiration date, they finally sent the paperwork and the expected time is 5-6 weeks. That's ~1.5 months. I called them to send me a new temp tag so I can continue driving but they said they can't and told me to goto local dmv and try and get one. They sent me a scanned copies of all the files sent to the dmv and suggested I request a temp tag with those files as a proof. I went to the local dmv and requested if I can have a temp plate but I need to have the dmv paperwork under processing state to obtain a temp tag and no, you need original documents. They were willing to complete the process right there if I had the original documents. I told the dmv that the paperwork has been sent to dmv by Driveway but dmv checked my name and license number but found nothing. I told them that Driveway claims dmv is backed up and could take a long time to process the dmv paperwork. The Dmv supervisor literally called out bunch of people, \"Could you raise your hand if you're here for vehicle registration and title transfer?\".  5-6 people raised their hand. That was embarrassing. I called Driveway 3 days daily after tag expiration to ask where did they send my dmv paperwork or if they have any updates. They said, they don't know and will find out and call me back. I also asked them if they have a tracking number or application filed number for my dmv paperwork which I could show to dmv. They gave me a ups tracking number -  1ZY308V10194402155. Shipment is from NY to NY, left on a \"porch\" Today is Nov 16, no callback from Driveway, no license plate, no idea which dmv they sent the paperwork, no idea what step of the process my dmv paperwork is at. What I'm scared of is that what if next month, 5-6 weeks after November 10 (my temp tag expiration date), Driveway says, \"Sorry, dmv paperwork will take another 5-6 weeks.\". Take the car back, refund me or give me the dmv paperwork, I'll go file them myself or LET ME KNOW THE PAPERWORK STATUS. Ranting while sitting on a subway station heading to work, 3 days before my monthly car payment is due and 6 days after my temp tag expiration. Paying car insurance for a car that cannot be driven. The frustration is unreal.", "rating": 3}, {"title": "Needs better inventory updates on new vehicles", "text": "I have tried to purchase a new vehicle twice that was listed on the Driveway website and both times I received notice that the vehicle was not available. I’ve even tried to get confirmation of availability of several different vehicles prior to initiating a purchase and was told they were not available or they couldn’t confirm. One such vehicle was listed for several weeks after I was told it wasn’t available. This week I initiated a purchase and planned to finance through them so gave my personal information to allow a credit check and received a phone call soon after asking if I had any questions to help with the purchase. I had one important question, was this vehicle available? The answer was “ I’ll check on that and get back to you “ A follow up call confirmed it was not. Even after a few days the order is still showing as active on my account with no response from them regarding removing it since the vehicle isn’t available. It is really a waste of time dealing with them with no organization to keep inventory current and updating customers in a timely fashion. UPDATE: I was contacted by Jared from Driveway and we discussed my issues regarding inventory and I am satisfied there was no malicious intent and that these issues have been discussed internally in order to make the buying experience better.In my situation the vehicle that I'm interested is is in short supply and is in high demand. I have adjusted my \"star rating\" accordingly.", "rating": 3}, {"title": "Things took too long", "text": "Things took too long ", "rating": 3}]