[{"title": "Worst home sell experience eveer!", "text": "Update to my review:Though my experience with Clever was less than ideal i can honestly say i was surprised and impressed with Clever's response to my issues. The Co founder and CEO of Clever, Luke, actually reached out personally to discuss my situation with me. Unfortunately, Clever was unable to fully compensate for my loss; however, I do feel Clever did everything in their capacity to address my financial damages. In retrospect I would consider utilizing Clever's services again with the provision that, in the case of potential divorce or separation, specifically in my home State of Texas, one seek legal consultation before proceeding. Below please find original post:I don't know if I could have had a worst experience. The sell of my home was delayed by well over a week due to Title Company misidentification of the property for sell. NOTE:  I owned two properties, one property consisting of 1  acre lot with 400 sq. ft. portable building and second property included 5.2 acres with 1500 sq. ft. house. Five acre lot plus house was listed for sell, Title Company prepared closing paper work for 1 acre lot and portable building causing confusion and delay in closing process. *Very important to note here that I owned properties before marriage.* At the point of closing Title Company informed me that as closing was in the State of Texas spouse would have interest in proceeds from sell even though property was owned by me before marriage. After consulting with attorney regarding pending divorce I was informed that information provided by Title Company was INCORRECT in that spouse has absolutely NO interest in property owned before marriage. This misinformation, unfortunately cost me over $75,000 in proceeds from home sell. I look forward to working with Clever in resolve this issue and be compensated for my loss.", "rating": 3}, {"title": "We sold the house - but I did the pricing and negotiating ", "text": "I guess that our agent - because they were earning a reduced commission - was lowballing all the way.  Hoping for a quick blue-bird. - promised \"professional\" pictures of the property. Agent was talking about they taking the pictures.  Then only posted 5 pictures, (I asked for more),  - suggested a listing price below market - we went with MY number, - suggested we accept the first offer - I countered at a reasonable difference between asking and offer price - made a big deal out of items in the inspection report.  After I read the report - I found a few items that were reasonable concerns and offered an equitable concession. BUT - we did sell the house and we DID pay a lower commission - so all is well. ", "rating": 3}, {"title": "Disappointed", "text": "Plan to buy a house. Sent a request and got quick response from two agents. Commission rebate is a joke. I usually get 1% of sell price if I do most of the homework myself. Here you won't get more than a few hundred. I am fine if the agent can be very helpful, though. Not sure about that yet, but two days later, I started to get a few dozen unrelated junk emails a day. That email I used is only for certain matters and I rarely receive junk emails. Only clever and the two agents know it. I don't think any of them would intentionally release my personal data to others, but as IT professional myself, I am concerned how well my data is kept. I don't rule out coincidence.", "rating": 3}, {"title": "Didn't work for me", "text": "I was really hoping to save some money through Clever R.E. However, the agents they connected me with were not a good fit for me. One was from Rhode Island and I'm selling in Massachusetts. She's over an hour away and is she realistically going to be able to show our house when required? The other two were Real Estate investment firms whose objective is to get the lowest price possible. In my case the old adage still rings true, \"you get what you pay for.\"", "rating": 3}, {"title": "When I first contacted Clever", "text": "When I first contacted Clever, they said I could set the buyers agents commission, NOT SO, the agent I was trying to work with said he wouldn't take the listing unless I gave at least 2.5%, both agents that contacted me said the same thing, find someone else that will let you set commission rate", "rating": 3}, {"title": "Only as good as the agent you get", "text": "House sold but agent, while nice, seemed to be handling a very high volume (or it was their second job) so they were only able to provide a bare minimum level of service. There were a few failures to communicate and some shoddy work. Still worth the savings over a conventional realtor.", "rating": 3}, {"title": "Need improvement on agent service while offering the 1% fixed agent fee", "text": "The 1% fixed agent fee was great. However that's it. Clever didn't put much guardrails around agent and the collaboration was a bit \"wild\" and I had to direct the sell to a direction that was going to work.", "rating": 3}, {"title": "Good deal \"OK\" service", "text": "Clever was good to deal with as far as price but there partnering agent that handled our property was just ok. We saved money but you just need to plan on not expecting much as far as the agent goes. I guess as the old saying goes,  you get what you pay for.", "rating": 3}, {"title": "The old adage “you get what you pay…", "text": "The old adage “you get what you pay for” comes to mind. The firm that partnered with Clever and his affiliated firm never had a showing of my home. The affiliated firm was represented to be the largest real estate firm in the Tulsa area.", "rating": 3}, {"title": "I give it an average experience", "text": "I give it an average experience.  Although the home sold in 5 or so months, it was difficult to contact the realtor.  With that being said, I guess since he was working for 1% that would be expected.Just an average experience.", "rating": 3}, {"title": "Service was good however agent sent me…", "text": "Service was good however agent sent me a email asking for a 1800.00 agent bonus.", "rating": 3}, {"title": "They have been good.", "text": "Date of experience: May 02, 2022", "rating": 3}]