[{"title": "operationally efficient / no trust in the AI being used ", "text": "Overall much seamless experience than going through traditional services.I am still not convinced the AI is fine tuned enough for when it determines the max limit available based on what is being requested for heloc.  I think the AI needs to be inspected and iterated on to ensure it’s “better” than the traditional human review.  The AI obviously helps scale and brings much more efficacy into the process but I’m still not convinced that it is factoring everything that a human would normally incorporate.", "rating": 3}, {"title": "It was 100% online", "text": "It was 100% online, so no personal experience, its was just necessary stuff. ", "rating": 3}, {"title": "Liked the fairly simple way the process…", "text": "Liked the fairly simple way the process worked. I did feel a little disappointed that it took longer than the 3 to 5 days advertised.", "rating": 3}, {"title": "Getting to know your website was…", "text": "Getting to know your website was difficult because going into my application, I wasn’t aware that I had a dashboard nor it’s useful importance. Perhaps a mini orientation would be helpful. The chat line was least helpful because the agent I was speaking to would cause a message to appear that announced the “chat had been terminated (or words to that effect. Thank you for choosing Figure. Have a wonderful day!”  Today was a great example in that I received that message 3! separate times! Each time, any progress on my issue was ended and I had to start completely over with someone new with the same questions. At what point are the agents permitted to abruptly end the session? my frustration was over the top today, but last agent hung in there, used her critical thinking skills, and my issue was resolved. God bless her! You employ some very bright, professional individuals. I with I had all their names.! ", "rating": 3}, {"title": "Advertised is access funds in 5 days", "text": "Advertised is access funds in 5 days, it took me 12 days to have funds, and I missed a window to get a contractor to install an RV garage. Now I'm waiting on new quotes but contractors are already booked.Update 5/14/24 your reply to my review is a canned legal response and not a customer satisfaction response. I did everything in a timely fashion your process failed and did not fund the loan in a timely process. Don't blame a customer for your errors in process. Not good customer service, poor business decision.", "rating": 3}, {"title": "good overall experience", "text": "prior client and new what to expect.  Application didn't progress to closure like they said - had to call twice to get it back on track.  The approval and the closing went great - it was the in between with no contact or follow up had to call each time, emails weren't responded too.  ", "rating": 3}, {"title": "Not great customer service", "text": "Application and funding was a breeze.  Now, I cannot get a hold of anyone, no app or web site that allows me to log in, check my balance, make additional principle payments, change payment account.  Nothing.  Pretty frustrating.  Will be looking to get out of this into something with better ongoing customer service as quickly as possible.Figure recently reached out to me and it got better. Still not able to change my auto pay amount or easily make extra principal payments but I guess that's relatively standard.", "rating": 3}, {"title": "Experience not as fast as advertised", "text": "Really fast response and help from the representatives online, however the automated system seems to have some glitches. It incorrectly read my drivers license as expired. Once that was resolved it took me reaching out to get the online notary session set up. There was no email like it said there would be. If I hadn’t been checking the website consistently this would have take a lot longer than it has already. I should have my funds any day now, but still don’t. Overall really thought it would be quicker and more seamless. ", "rating": 3}, {"title": "Took too long to get the loan…", "text": "Took too long to get the loan completed. Too many mistakes committed by Figure never talked to the same person when a phone call was made to company. ", "rating": 3}, {"title": "Unsettling", "text": "I almost finished applying for a HELOC with Figure but stopped when I reached income verification.  They wanted my Username and Password for my checking account!  Maybe I've watched too many Kitboga videos on YouTube but I wasn't going to give those out.  I tried using the IRS link but again Figure wanted my Username and Password.  IRS has a way a third party can receive transcripts for income verification but Figure does not use that method.  I'm sorry to say I will have to look to another lender for my HELOC", "rating": 3}, {"title": "False advertising", "text": "I was told funds would be available in 3-5 days. I called yesterday to ask if there was anything more I needed to do because I was unsure what the message on the dashboard meant and was told funds will take at least 14 days. While I am still in the 3-5 day window, the answer I got was unacceptable especially since I was not notified of a delay. I had some things lined up based on the assurance when I talked to Figure last week that 5 days was maximum. Very frustrating!It did fund on time but the lack of communication was VERY frustrating!", "rating": 3}, {"title": "Didn't like the time to get loan…", "text": "Didn't like the time to get loan approved and financed.Alex wasn't very clear on your charges and money I would receive. It would be nice to have something in an e-mail explaining breakdown of costs through process.It wasn't easy to get into my file.Alex did answer or returned my calls quickly. ", "rating": 3}, {"title": "Good line of credit, poor user experience once you have the credit.", "text": "I have a home equity line with Figure.  It was an easy application process and came through in an emergency situation.  Very happy with the loan itself.  The biggest drawback is the lack of a mobile app to manage your line of credit.  It's quite archaic that in 2023, such a fast and modern approval methodology would be undermined by the 1990's version of accessing your account information.  Their website FAQ still mentions that they have a mobile app, but customer support confirmed that this no longer exists.  Sadly, that means the only way to manage your account is to connect through the website and an email based code every time.  No connection over to Mint or other money management solutions.  Minus 2 stars for the lack of modern interfaces and integrations to manage finances effectively and efficiently.", "rating": 3}, {"title": "Money if you need it", "text": "Money if you need it. A business like others. Always looking for profit. $89 fee to release lean after closing account which from my county website showed a cost of $20 is a bit excessive.", "rating": 3}, {"title": "Easy Application BUT", "text": "Application process was VERY easy, but current funding time is unacceptable. I applied for this loan on a Tuesday, it's now Monday and funding has not happened yet. The process was easy but you need to plan on funding taking 6-7 business days from application, regardless of what they promise.", "rating": 3}, {"title": "Slow to fund", "text": "Loan paperwork was signed last week. 3 day right of rescission should have been Monday 3/25/24. As of today I still have not received funds. Very frustrating.", "rating": 3}, {"title": "Figure Staff Not Listening to Customer Concerns", "text": "I recently had lending transaction handled by Figure. Figure processed the transaction without confirming account information with me. Upon me finding out the account information was incorrect. I emailed them approximately 4 times. When they responded to my emails instead of assisting me with correcting the mistake. They made it like it was my mistake and continued with the transaction that led to approximately 4 business days later the transaction was unsuccessful as the bank could not process the transaction based on the information provided. Figure sent me multiple emails stating the problem. A PROBLEM that I pre-warned them about but they chose to ignore me and caused a 6-10 business day transaction time delay. I know my bank information but they thought they knew better and / or was lazy to address it. UNACCEPTABLE.", "rating": 3}, {"title": "they advertise getting a loan quicker…", "text": "they advertise getting a loan quicker than the rest.  It has taken 3 weeks and was advertised as 3-4 days.", "rating": 3}, {"title": "Was forced to reapply for loan after…", "text": "Was forced to reapply for loan after they said I put the wrong ss number down. When I reapply my loan amount went down and the interest went up.", "rating": 3}, {"title": "Didn't like the interest rate", "text": "Didn't like the interest rate. Taking to long to get the money.", "rating": 3}, {"title": "Taking too long for funding", "text": "Date of experience: March 04, 2024", "rating": 3}, {"title": "The process to get the loan is very…", "text": "The process to get the loan is very fast although High rate. Only three stars for awful payment options. You have to go to their website to make payments, No option for bill payer set up at your bank or credit union without autopay. If you do not set up autopay during the loan process you do not get their discount. Imagine if everyplace did this, monthly bill paying would be exhaustive.", "rating": 3}, {"title": "Wow don’t ever be late!!!", "text": "I was late 7 days. I have never been late with a payment and never will again! I got no less than 5 calls. Please note that I informed Figure that I would be a few days late, and what the situation was.", "rating": 3}, {"title": "Excellent process but the technology…", "text": "Excellent process but the technology doesn’t always want to cooperate (took 30 minutes to log in to my notary session with your tech team’s assistance).  In addition, my first photo upload didn’t meet your specs (I don’t think the original upload screen said that all four corners needed to be visible) but I didn’t get any form of error message.  As a result, I tried to log into my scheduled notary session to no avail.  Finally got in after a second ID upload, which did state the four corner requirement.", "rating": 3}, {"title": "convenient if you need money fast", "text": "convenient if you need money fast However, the interest rates are very high, there is minimal conversations with any representatives and your first payment is due in less than 30 days of the funding and they are not flexible with that.  They pick the date and you are stuck with it.", "rating": 3}, {"title": "Their process is very strict and…", "text": "Their process is very strict and automated so don't expect them to bend any rules whatsoever that would require any work beyond complete automation on retrieving information.  They sent me a flyer in the mail and when I applied They denied me because they couldn't access my county's public records.  I offered to get them whatever they wanted and they said they couldn't help me.  I asked them why they didn't check to see if they could access public records in my county before soliciting me and they couldn't give me any clear answers. Just vague canned responses. That was fun!", "rating": 3}, {"title": "I wanted to really like Figure, maybe you will", "text": "I wanted to really like Figure. I think automated systems are the future and really wanted to experience the ease of using it for my HELOC. Unfortunately, they only look at your adjusted income from your taxes. This means income from a rental property won’t be taken into account, only the profit from a rental (not total income). This makes it extremely difficult to get a loan when your adjusted income only appears to be your profit margin and not the fact that the rentals mortgage is completely covered by a renter. I imagine with less difficult requests, this lender could be stellar. But in my case they didn’t offer much help since they won’t manually review documents.", "rating": 3}, {"title": "Good overall. But not with coronavirus issues", "text": "It took me some time to get a loan with figure. There was a lot of back-and-forth and confusion in the beginning but in the end they took care of me and helped me to get the loan rather quickly. I would do it again, however I am disappointed that when I called to ask to extend my loan due to the coronavirus and losing my job they were not sympathetic and did not allow me to extend my loan for a longer period of time. They told me I could apply for a new loan instead. But when I applied for the new loan I was not approved. I think this company is great to work with when you have a stable income and job, but they do not seem adept to dealing with the current global pandemic", "rating": 3}, {"title": "I compliment your customer service…", "text": "I compliment your customer service people, but for someone like myself with limited computer skills it was difficult to complete your process. Thank you for your patience and help.", "rating": 3}, {"title": "three notary appointments later", "text": "I had a notary come to my house on 2-14-21. After I signed my paper a week later, I was notified that my notary didn't send everything that I needed for my loan. I received a email from figure saying that they booked another notary appointment but I didn't need it, and it was to extend the date on my loan paperwork. The next week, I was notified that I would need another notary appointment. After my third notary appointment my loan was finally processed. I ended up missing my deadline with the contractor I hired to perform the home improvements on my property, because I had no funds. The contractor was booked up for the rest of the month and I'm still awaiting a contractor. I was told after speaking with a figure representative, that they would send me a amazon gift card for my experience with their company. I plan on using Figure again in the future. I just didn't understand why my loan took so long.", "rating": 3}, {"title": "Friendly service but unnecessary delays…", "text": "Friendly service but unnecessary delays in the process. I expected to jump through hoops, however, so this was a typical money lender experience.", "rating": 3}, {"title": "The paperwork was horrible to get…", "text": "The paperwork was horrible to get through. the postcard I received in the mail was not the way this loan worked. Getting through the stupid questions for the notary was so ridiculous.The questions were not explained very well so we failed the first time. the second time they disconnected us so we had to wait until the next day. i was told by Jason or Jacob the supervisor to call back at lunch. When we called, I was told it had not been 24 hours so call later. It took 3 or 4 days going back and forth on the phone with first one person and then another to get through the paper work and each one of them had a different answer. Why didn't we just follow the instructions on the web site? GOOD QUESTION! Because the BIG F just kept spinning for days. The site doesn't work!! Now once we got through pulling our hair out the funds appeared in our account a day sooner than we thought so I guess that was good.", "rating": 3}, {"title": "Very difficult  software to navigate", "text": "Date of experience: November 03, 2019", "rating": 3}, {"title": "You said 5 min", "text": "You said 5 min, it was about 4hrs", "rating": 3}]