[{"title": "It was all okk and fine experience", "text": "It was all okk and fine experience ", "rating": 3}, {"title": "I had problems with the ordering…", "text": "I had problems with the ordering process and customer service. The shipping was delayed and it took me a lot of time contacting customer support.", "rating": 3}, {"title": "Every thing is perfect but I…", "text": "Every thing is perfect but I recommended with 3 Star because I feel they recommended with 3 star.", "rating": 3}, {"title": "Poor Quality of Product", "text": "Service was good but the quality of the product I purchased was poor.  I bought two Imperial Electric fryers and the repair company has been out twice in the past year to make repairs.  I reached out to Imperial and their hands were tied.  I wish their website had a place on the product page to put reviews.  I have had the identical problem with each fryer breaking down within days of one another.  Obviously there is an issue.", "rating": 3}, {"title": "Expensive bacon press", "text": "The item was found under bacon press but the real name was steak weights. My wife said they will work just as well. I found them to be a bit pricey and the order was right at 80.00  and we didn't get free shipping I first thought we would get free shipping  but it was on another order. All and all if your looking for kitchen type utensils this is the place for you.", "rating": 3}, {"title": "Well we got the product", "text": "Well we got the product, however there was a problem with Old Dominion shipping.  They had setup a time for delivery at between 2 and 4 pm on Friday.  When they had not arrived by 5 pm I called them.  They told me them that the cooler could not be delivered until Tuesday.  We had made arrangements with a moving company to help us at the original delivery range. We had to reschedule that for Tuesday.  This was very inconvenient and waisted several peoples time.", "rating": 3}, {"title": "Love the sink, packaging problems.", "text": "Love the sink, however, the packaging did not protect the product. When cutting the tape on the box to open it, the utility knife cut a horizontal scratch across the top of the sink compartments. To my surprise, there was no protective cardboard under the tape to prevent a knife from cutting into the sink when cutting thru the tape. I will try to buff out the cut in the top of the sink dividers with some steel wool or emery paper.Please improve your packaging!!!!", "rating": 3}, {"title": "Have not tried, but will ride to good health with healthy smoothies", "text": "I just opened the package.  Everything seemed fine but then the removable jar and base came apart.  I put it back together, but I'm not sure if it was correct because there were no directions for assembly.  I won't know until I have cleaned and sanitized the blender.  On the other hand, I received the product in a very timely manner. Tracking was very easy and efficient.", "rating": 3}, {"title": "Great place", "text": "It was my first time coming to this store. Has many items, but it could use more employee's. If looking for used equipment they have a variety of options. I went three days in a row and each time I have to walk the whole store to get a sales or front desk to help me out. Unfortunately one of the items I purchased which is the sandwich prep cooler didn't work out. Besides that everything else was good and in working condition.", "rating": 3}, {"title": "Excellent and speedy service", "text": "On the part of ACityDiscount, all was great. The shipping side of things needs some work so the product gets to the correct hub for delivery. This may not be a default of ACity, but in the shipping co-ordination. Product arrived with no damage during shipping, but unit was defective from the factory, and easily repaired on site. A defective unit comes from all different companies and does not reflect on ACityDiscount in my opinion.", "rating": 3}, {"title": "Service great but needed to communicate and never heard", "text": "Got my high quality product faster than promised, all was good there.  Web site stated at last minute that my ($3.00) item package would require a signature, so tried to contact to cancel.  Never heard back, but day I was gone all day, found the package on my front door with apparently no signature required ......", "rating": 3}, {"title": "Sale did not work as expected", "text": "We wanted a high temperature commercial dish washer.  High temperature is capable of raising 120 degree incoming water to at least 180 degrees for the rinse.  I did not read the spec sheet close enough and found that the machine I bought requires 140 degree incoming water to get the rinse up to 180 degrees.  There are cost penalties associated with running the hot water tank that high and also the risk of scalding someone washing there hands.  Other than that the lowest price was quoted on the first call.", "rating": 3}, {"title": "very helpful - but description a bit deceiving", "text": "Items shipped and arrived quicker than was originally told (was on back order), however on the purchase of the ice maker itself.. it was a bit deceiving as the ice bin shows on the picture but the there is only a small blurb about \"Please note the Image shown may reflect a different configuration. Pictures are for reference only.\" - but it really should have said \"Does not include storage bin\".But the people we dealt with on the phones were great and helpful and did there best to get us the product as quick as possible.", "rating": 3}, {"title": "Received Adcraft table in excellent…", "text": "Received Adcraft table in excellent condition, and you can see extra padding inside, so they take care of ensuring the table is not damaged. Without casters on the table, the price did seem higher than what I paid last year via another company. Overall satisfied.", "rating": 3}, {"title": "Lift gate", "text": "Did not realize you do not bring the product in the business .I had to leave the cooler outside till the movers came the next day. It is still out on the landing till 4:00 this afternoon .Have not opened the package till It is inside.However the delivery man was most helpful.", "rating": 3}, {"title": "Ordering was easy", "text": "Ordering was easy, fast delivery and communication on item being shipped.  The one negative is when I emailed them to ask if a hose could be connected to the drain the inside sales rep responded by saying he/she was not a plumber but they supposed I could ask one.", "rating": 3}, {"title": "We have ordered on two separate …", "text": "We have ordered on two separate occasions through ACity.  Both times our stainless steel mop sinks have come damaged, so we have had to bend them back into original shape.  Fedex, the delivery service, did not let us open the box to check for damage first, they said that was not their company policy.  They said if it wasn't signed for, that it was their property and they would have to take it with them.  So, whose responsibility is it? ACity or Fedex?  Either way, I have somewhat damaged sinks that are now my property and my responsibility, yet not in the condition in which I ordered them.", "rating": 3}, {"title": "Good but could be better on service", "text": "Was helped to a great extent, would patronize again, spent close to few hundred, but sales person didn't close deal with me I left and went to REM and spent over 10 times that much an hour later.\r Could spent that with you guys.", "rating": 3}, {"title": "Great product prices,  expensive shipping", "text": "The online order form was giving me trouble so I called. Within 10 minutes, everything was straightened out and finalized for shipping. My only complaint was the high shipping cost. It was almost as much as the product.", "rating": 3}, {"title": "Too Pushy", "text": "The purchase experience was all positive and the sales staff were superb.  One item was to be picked-up later, a refrigeration unit.  Sales staff noted that there would be contacts encouraging pick-up after one and two weeks.  No problem.  But the reality was that multiple contacts were made by both sales staff and management, with the management contacts bordering on hostile and threatening.  The item was finally picked-up but guys, chill out.  When you start treating your customers like car salesmen do with high-pressure tactics and threats just to try and sell a delivery after you've already been paid, you may drive them away to your competitors.  In fact you already have in at least one instance.", "rating": 3}, {"title": "good prices but sales rep very hard to get a hold of", "text": "Came in with my wife looking for a preo table.  Raffled to Mike I guess the show room manager,  very nice and knowledgeable, shored us what he had and we told him we would be in contact when we could set up a delivery time. Well we tried to reach him for the next 3 days we were told he was bz and he would be told we called or transfered to his voice mail,  which I left 3 messages letting home know we wanted to buy and needed delivered asap. On 3rd day I talked to jon and told him I need to buy this prep table ASAP and if Mike won't call me back I'm going somewhere else so Jon took my order but I had to argue about the discount Mike had promised finally got the price and item delivered.  Otherwise would have given 5 stars", "rating": 3}, {"title": "Disappointed", "text": "The service was great for the purchase of my ice machine but I didn't receive it as promised. It was promised for delivery by Thurs. or Fri. but I didn't receive it until Monday.", "rating": 3}, {"title": "Our order was messed up on your end", "text": "Our order was messed up on your end. After a couple phone calls the problum was cleared up and we got all of our order. Thank you for making it right.         Doc Waldie", "rating": 3}, {"title": "Some kinks, but it was resolved in a fair manner", "text": "The assistance that I received in the store was great.  I also felt that I was able to find the right product for the right price.  However, my purchase was damaged upon delivery and it was difficult to come to a reasonable agreement on making this right.  Good customer service can make or break a business.  Upon delivery, I called customer service to discuss the damage to my product and was placed on hold for well over 20 minutes.  Once I was able to speak with a customer service representative, the issues was still left unresolved.  Once I was given an offer to compensate for the damages, it was unacceptable.  When a customer has an issue that is not of their own doing, the company should take care of the issue as quickly and fairly as possible.  In the end, I was able to resolve the problem in a fair manner.", "rating": 3}, {"title": "Upset that they came after me for sales tax", "text": "I'm upset that you guys came after me for sales tax after the sale was complete.   Not an honest way to do business.  Should have on the ebay listing and during checkout.", "rating": 3}, {"title": "The piece of equipment was delivered…", "text": "The piece of equipment was delivered without notice during lunch. Because the parking lot was full during the lunch period the 265 lb grill was left across the parking lot.", "rating": 3}, {"title": "Delivered as advertised, but no shipping options or information.", "text": "It was easy enough to find what I was looking for and order. However, there were no shipping options. I had no idea how long it would take until after I placed my order.", "rating": 3}, {"title": "I'll let you know once I receive it all....", "text": "Along with the tables you had in Atlanta we ordered chairs that aren't scheduled to ship until 3/6/13 and stools until 3/11/13!!! \rWhat's up with the delay?", "rating": 3}, {"title": "good prices over all with good response times", "text": "Over all good prices, customer service could be better. When salesman tells you something and then dont never do it, it gets old. but over all good review.", "rating": 3}, {"title": "It would be great if the photos of the item matched the item…", "text": "It would be great if the photos of the item were the actual photos or the description were not so generic.  Only two baskets came versus the four it shows in the picture.  We were lucky we had one more basket to mostly fit in there on hand.  We were also lucky to have had dividers from our previous ice cream freezer or we would have had a big mess of novelty ice cream products just heaped together in the baskets.  These freezers should come with the parts needed to display ice cream neatly.  My previous freezer had four baskets with each divided into 3 compartments with extra storage below.  I'm now down to three baskets with reclaimed dividers and no room for a 4th basket and no storage space there to fill.  This cuts down on my organization and ability to carry the same product.  The old dead freezer and the new freezer have the same dimensions.  The sale went well, the freezer was delivered right on time, and it seems to be working well, so far.", "rating": 3}, {"title": "Good Exeperience...", "text": "First time I shop on the this website. I am very love it because they are convenient and easy to get in, and looking for some item.", "rating": 3}, {"title": "good price but not on time delivery", "text": "very good price friendly sales person good product but my delivery was one week late than promise date but its ok not that bad.", "rating": 3}, {"title": "Long delay in delivery", "text": "Long delay in delivery. Three days from GA to AZ, six days from Phoenix to Sedona, 120 milesVery costly for my business", "rating": 3}, {"title": "Shipper wouldn't bring it to the proper location", "text": "The delivery man just dumped it at the front of our restaurant although we asked to have it brought to the store room.", "rating": 3}, {"title": "good prices slow shipping", "text": "they have great prices and selection, however, their communication on shipping time frames and details need work.", "rating": 3}, {"title": "Blender Jar", "text": "I had one the same size but shaped differently. The top is a joke. But the one I have will work on this one.", "rating": 3}, {"title": "2 weeks for delivery???", "text": "product and cost were the reasons for purchasing here but dont be in a hurry! 2 weeks for me, wow!", "rating": 3}, {"title": "Dealing with ACityDiscount rep Adam was…", "text": "Dealing with ACityDiscount rep Adam was fine. But we had trouble dealing with UPS. We followed the tracking directions - called the number provided - and got a rep who was clueless. We gave her all the relevant information and she said the order did not exist. Yet we had been told it had been shipped and we should call this number. After more than one call with both my husband and I talking to the UPS person she finally realized that we had been given the wrong number. The number we needed was UPS Freight. The ship was promised for 2 different times, then delayed. The trucker who finally delivered the steel table and sink was very good to deal with, fortunately, after the previous aggravation. He offered to open the box when I said I wanted to inspect the merchandise and waited patiently while I looked it over to be sure there was no visible damage and that a table, 4 legs, sink, and faucets were included. I highly recommend you contact UPS and be sure reps know that to immediately put the customer in contact with UPS Freight rather than regular UPS if it is a large package. Better yet, have that information included in emails from ACity Discount. The frustration we experienced could have been completely avoided with better communication.", "rating": 3}, {"title": "I ordered the wrong size", "text": "I ordered the wrong size. I can still use them, description should have dimensions though", "rating": 3}, {"title": "This was my first time dealing with…", "text": "This was my first time dealing with this company and so far I don't have any complaints", "rating": 3}, {"title": "Damaged product", "text": "Price was excellent & delivery time was good. My product was damaged during delivery.", "rating": 3}, {"title": "Great but no notice of delivery", "text": "Item came quickly but was left in the street with no one letting us know it was there", "rating": 3}, {"title": "Good product", "text": "Exactly what I order, good product. Did not receive tracking information to my email.", "rating": 3}, {"title": "timely deliverly", "text": "used food warmer...could have been cleaned better.  Still had lime deposits inside.", "rating": 3}, {"title": "Good", "text": "Would be better if the salesperson would answer the phone when customer calls.", "rating": 3}, {"title": "the refrigerator was not the same as showing in the photo and had a dent", "text": "Date of experience: June 02, 2013", "rating": 3}, {"title": "Too many Delays on A-City Doscounts part", "text": "Ordering took days due to your people getting one anothers approval", "rating": 3}, {"title": "It was quite the challenge in the…", "text": "It was quite the challenge in the beginning of the transaction.", "rating": 3}, {"title": "Need a better pricing system...No price …", "text": "Need a better pricing system...No price on products in store...", "rating": 3}, {"title": "I received exactly what I had ordered …", "text": "I received exactly what I had ordered with prompt shipping.", "rating": 3}, {"title": "Driver did not have hand truck upon…", "text": "Driver did not have hand truck upon delivery.", "rating": 3}, {"title": "I think is best", "text": "I think is the best of all time favorite sites", "rating": 3}, {"title": "Nice", "text": "Up to date equipment and reasonably priced.", "rating": 3}, {"title": "Shipping cost it’s hight", "text": "Date of experience: October 16, 2021", "rating": 3}, {"title": "so far my expeience is good", "text": "Date of experience: February 02, 2016", "rating": 3}, {"title": "to many follow up emails", "text": "Date of experience: April 24, 2017", "rating": 3}]