[{"title": "Fast shipping", "text": "Fast shipping, quality products. Happy with my purchase ", "rating": 5}, {"title": "Great products", "text": "Great products, always high quality. Fast shipping that has been on time with stated delivery time. 5 star", "rating": 5}, {"title": "Liftmode sets the bar with customer…", "text": "Liftmode sets the bar with customer service and quality of products. I appreciate their transparency with providing lab results. I do and would highly recommend them to anyone who is looking to improve their quality of life.", "rating": 5}, {"title": "Highly recommended ", "text": "I've used this company for years. All their products are of the highest quality and purity available, often to the degree that you can't find anything comparable elsewhere. And with the lab results to back it up, which is just as uncommon. They always promptly ship their products and they're in my hand within a few days. Great customer service aswell. Can't go wrong. ", "rating": 5}, {"title": "I am absolutely delighted with the…", "text": "I am absolutely delighted with the products of this brand, they are of exceptional quality and without a doubt the best I have found on the market. I would like to express my sincere admiration for your commitment to excellence and innovation. In particular, I am very satisfied with VisiónLift, but I think there is still room to improve and reach new heights. It would be exciting to see it evolve into an even more advanced formula, like AREDS 2, that sets new standards in the industry. Keep up the excellent work!\"", "rating": 5}, {"title": "Fantastic", "text": "Fantastic. Package shipped the same day I ordered.Product is the best quality I've had.", "rating": 5}, {"title": "Great effective product", "text": "Great effective product! And quick shipping! I've been a customer for almost 10 years and have always been satisfied. ", "rating": 5}, {"title": "Highest purity and quality!!!", "text": "Very fast shipping for a low fee, I recieved my package 2 days after I clicked the order button. I also love how the bottles are completely sealed with plastic on the outside of bottle, plus the \"sealed for your protection\" 2 layers of protection give me peace of mind. ALSO the quality inspection sheets that I recieve prove to me that what I am receiving is of the highest purity and quality.", "rating": 5}, {"title": "Never disappoints! ", "text": "First off let me start with customer service , they are always there to help and answer questions. I love how they send useful tips for health, aging, or mood and fitness. The products never disappoint and it’s reassuring to have the lab results to feel safe when taking these supplements. Thank you Litfmode for what you guys are doing over there. ", "rating": 5}, {"title": "Kava tea and honey samples", "text": "So I tried the samples for kava cloud tea and sweet kava honey and just wow! Excellent products, tastes very good and u can definitely feel the benefits. If I could give above 5 stars I would. Keep it up yall. Looking forward to trying many of the other products as well. ", "rating": 5}, {"title": "Supplements that are not B.S. and have CoA reports to back it up. ", "text": "Great quality items, it is extremely nice to get a physical Certificate of Analysis with each item, as so many supplement companies claim to have testing done but when you try to retrieve their test data it is nowhere to be found. Shipping is excellent as well. ", "rating": 5}, {"title": "Most trustworthy & potent products", "text": "all the way products that you make are pure and potent compared to other top brands. better and more bang for your buck and the benefits from baicalm, kanna extract, liver friendly kava honey(great needs flavoring)have helped me so much in my life so far. i can trust you guys and thats the most important thing. thank you! ps i would appreciate little gifts here and there wink wink lol thanks guys", "rating": 5}, {"title": "Been buying things from them for years", "text": "Been buying things from them for years. I have always got top quality products from LiftMode. Literally years of purchases of all kinds of things, and not one thing was not to my liking. Great company, great lab.", "rating": 5}, {"title": "Long Time Customer", "text": "Liftmode is always a great simple purchasing experience. Where LiftMode stands head and shoulders taller than the competition is the attention to detail. Many companies sell powdered supplements. But most forget to include the quality reports like Liftmode, packaged very thoughtfully and including the various scoops and their measurements. These small details make a big difference. I will continue supporting them as long as they are in business. I love how the still continue to add cutting edge products. ", "rating": 5}, {"title": "Always a great experience", "text": "Always a great experience with Liftmode. Every order comes with a full panel COA testing for purity and safety. Products are always satisfactory because you know exactly what you're getting without a doubt. I've been a customer for years now and Liftmode has earned my loyalty.", "rating": 5}, {"title": "Amazing company!", "text": "Amazing company in all aspects. Every product I’ve received from Liftmode has been stellar quality, reasonably priced, and quickly shipped. There’s a reason I have been a returning customer for so long. Liftmode has never once done me wrong. ", "rating": 5}, {"title": "BEST KAVA HONEY ON THE MARKET!!!", "text": "I tried the kava amanita honey and it's very relaxing and great for anxiety. Probably the best kava extract product I've ever had. I tried a couple other extracts and another kava honey (that was much more expensive and came with less) and Liftmode's blew it out of the water and didn't cause a hangover the next day (kava's not supposed to but I've had various extracts and another honey that gave me a killer headache the next day) they're now my go to for kava honey. And they're other products are great too! I wasn't a big fan of Kanna ( I believe the quality was good cause it had a very strong effect, I just don't like how it feels) but their magnolia bark is extremely effective for anxiety and sleep as wellThank you Liftmode! ", "rating": 5}, {"title": "I made an error for my shipping address…", "text": "I made an error for my shipping address and even after my package said it was shipped. Customer service was sure to correct it before it was delivered. Haven’t received my product yet but as soon as I do, I will definitely post another review.", "rating": 5}, {"title": "Liftmode", "text": "Liftmodes products work and are extremely affordable compared to other inferior products/brands. I like paying companies that are trustworthy! Some products I like are Baicalm, Kava, mood boost, and ton of the assorted powders like the gotu kola and rhodiola. I have most of those headed my way now! Thanks liftmode", "rating": 5}, {"title": "Liftmode's L-THP is real stuff", "text": "Liftmode's L-THP is real stuff. I can assure you it's very potent. Great value and quick delivery as well.I had a problem with my first order where it came with the seal broken. When I brought it up to support, they were quick to respond and send me a replacement which was perfect. Totally recommend.", "rating": 5}, {"title": "Holy Heck, where have you been all my life?!", "text": "Ok, first off, I love LiftMode. Or maybe I just have a lot of love to give after taking Phenylethylamine. It’s amazing, like all the powders I’ve gotten. But wow. It came so fast and is so incredibly effective. I’m a writer, so it gets my creative juices flowing without adding edginess or insomnia into the mix. I was shocked at how well it works, honestly. DEFINITELY worth the cost, I’ve tried so many nootropics and this gives the most substantial results with no negative side effects. WOW WOW WOW. You guys rock.", "rating": 5}, {"title": "I have always received excellent help…", "text": "I have always received excellent help from your workers and specialists.  I have purchased many of your propitiatory stacks and all of them have worked as advertised.  I am as healthy as I am because I use many of your products, especially your CBD tinctures.  Well done, Liftmode.", "rating": 5}, {"title": "Another great experience", "text": "Ordered Baicalm for the first time and I had it in about 2 days. Very quick. The product is awesome! It puts me in a calm state and positive mood, exactly as described. Thanks Liftmode for this wonderful formulation, your products speak for themselves and it’s simply always a pleasure ordering from your company. Solid", "rating": 5}, {"title": "Excelent Kanna Product, fast delivery", "text": "Received MT55 as described on the website.  Very high quality, no clumps in the product.  Effects are nice and enjoyable, use with moderation.  Delivered a day earlier than expected.  Totally satisfied with the purchase.", "rating": 5}, {"title": "Liftmode... Look no further! Quality extracts. Fair prices.", "text": "I have been ordering from Liftmode for many years now and have always received quality products. The quality of the different extracts and supplements are very important and have always been top notch from Liftmode. The prices are also amazing considering the high quality of their products.", "rating": 5}, {"title": "Great place for longevity, supplements, immune boosters", "text": "You have a broad selection of items that I use for my longevity an immune system protocols. You also provide a coa along with the items that you send and they come nicely packaged. Also you have a contact number and you detail the backgrounds of the people who run the organization. Shipping is also ultra fast. I'll be purchasing from you again.", "rating": 5}, {"title": "My experience has been great", "text": "My experience has been great. Good customer service always. Have used them for phenibut for the last few years, never had an issue with quality or shipping. Once the website wasnt working and i was able to place an order over the phone. So yeah 5 stars. Pretty disappointed that phenibut will no longer be sold by liftmode.", "rating": 5}, {"title": "Awesome company!", "text": "I love how the company is always coming up with new products. Disappointed my favorite Phenibut was taken off the market, but excited for some new products. I also appreciate the emails, letting me know about new products and sales. Thank you ❤️", "rating": 5}, {"title": "Liftmode has been a great vendor", "text": "Liftmode has been a great vendor. I wish they still sold their most popular supplement/nootropic but for some reason they have stopped selling it. None the less liftmode was always 100% legit. I shall still use them once in a blue moon for some of their more niche items like magnolol and honikol and other supplements/nootropics. I wish you guys would re-stock the good form of GABA (gamma-butric-....). Why did you guys stop selling it and will you ever re-stock it again?", "rating": 5}, {"title": "Excellent supplier of supplements ", "text": "I appreciate all of the useful information on all of the various supplements that Liftmode offers. By having a 3rd party lab to test purity, Liftmode offers quality products.All orders I have placed have been on time as promised, and I have never had any issues.To anyone interested in adding a supplement to their daily regimen, make sure to do your homework first, and speak to your doctor to ensure that you won't have any medication interactions or side effects involving any of Liftmode's fine products.", "rating": 5}, {"title": "Was delivered very quickly", "text": "Was delivered very quickly. Supplement has helped me in a massive way. Want to shout out Big Lenny for recommending LiftMode and Phenibut! I will be using LiftMode as my go to store for my supplements indefinitely!", "rating": 5}, {"title": "Fast shipping", "text": "Fast shipping, great product, just wish it was a bit cheaper but it’s pretty standard market pricing for what it is ", "rating": 5}, {"title": "Liftmode is next level", "text": "The little things that really matter along with the extract for comfortable administration is very thoughtful by the company. The communication by the team during shipping was quick and very responsive.", "rating": 5}, {"title": "Been using LiftMode for around 10 years…", "text": "Been using LiftMode for around 10 years now. One of the only trustworthy nootropics companies left in this crazy world! Never concerned about the quality of the product I receive.", "rating": 5}, {"title": "Fast shipping and good products", "text": "Fast shipping , trying out the kanna jam … seems good , would like to buy in larger quantity as this is just a sample . Trustable quality products . Will purchase more products ", "rating": 5}, {"title": "Great Company, Great Products", "text": "The products are shipped quickly and their purity/potency are extremely well documented by 3rd party sources and, last but not least, they actually WORK.", "rating": 5}, {"title": "Packaging was excellent", "text": "Packaging was excellent. Shipping time was very good. Quality, I will need a week to fully test the quality of the product. So far, my experience was great with the packaging, supplied dosing cups, & Certifications of Analysis. This was excellent.", "rating": 5}, {"title": "Very great quality", "text": "Very great quality, package quality, customer care, and PLENTY of information and tools that comes with each product to be able to safely measure each dosage, but also I got a free 6 capsule sample of “moodlift” pills which have quite the assortment of herbs of various herbs in it BUT BUT BUT more importantly than all that… IT CAME WITH A LAB REPORT!!!!! I’m so proud of this company for adding that to my order!", "rating": 5}, {"title": "great customer service", "text": "I had to cancel my order and they could have easily just shipped it and said sorry, but they promptly cancelled my order, returned my payment, and sent me an email. Great customer service", "rating": 5}, {"title": "A great website for the intersection between supplements and mood management", "text": "Lift Mode was the last best source for one of my favorite supplements until the FDA put a kibosh on that particular product. They have since done their best to educate the consumers on possible alternatives and this is greatly appreciated", "rating": 5}, {"title": "Shipment is quick", "text": "Shipment is quick. Product is legit and they provided batch testing data. ", "rating": 5}, {"title": "High ", "text": "Liftmode offers quality supplements at a great price point. Anyone interested in biohacking, herbal medicine, or bodybuilding ought to consider them as a premium brand for health related products, many of which are difficult or expensive to source elsewhere ", "rating": 5}, {"title": "I have been a satisfied loyal customer…", "text": "I have been a satisfied loyal customer for years. I wish you would bring Phenibut back.", "rating": 5}, {"title": "Priority is fast with these guys", "text": "Priority is fast with these guys, product works well without more then a 5 point raise in bp . Also duration is about 4 hours to 5 depending soon diet .", "rating": 5}, {"title": "Excellent customer service once again", "text": "Even if I run into an issue with an order, the people at Liftmode are there to solve it right away.  Their products are topnotch and shipping is fast.  Thank you, Liftmode!", "rating": 5}, {"title": "Neat website", "text": "Neat website, responsive support team, great coupon schemes, clear product descriptions, innovative products that you will get nowhere else.", "rating": 5}, {"title": "Superb Packaging", "text": "Haven’t used the product long enough to realize any tangible results but the initial look of the product, it’s packaging and instructions are superb!", "rating": 5}, {"title": "I happened to stumble across kanna and…", "text": "I happened to stumble across kanna and tried it through lift mode because the price was really good. I'm not an Expert< But i'd say that this really works wonders for me and i think it's great quality!", "rating": 5}, {"title": "Products were effective for my needs.", "text": "Good products, pricey, but worth it knowing it is great quality.  Only negative is I had paid for shipping to get it here earlier, but it still took 4 days.  Not sure if that is a liftmode issue.", "rating": 5}, {"title": "Quick response and good delivery time", "text": "Quick response and good delivery time. Pure product with written proof.", "rating": 5}, {"title": "I’ve ordered from LiftMode since around…", "text": "I’ve ordered from LiftMode since around 2015! Sad that they no longer sell phenibut but have been enjoying their Kanna extract. Shipping is always fast and they give free samples and scoops!", "rating": 5}, {"title": "I am absolutely in love with this…", "text": "I am absolutely in love with this store! I am big in 'nootropic solition of my day'. Truly, the variaty of products, and the quality. I like the way the team keeps me up to date (on a product that was gone and variation of possible replacements).Shipping too, fast and carefully packed. I am staying", "rating": 5}, {"title": "This review is for liftmode’s Palmitoylethanolamide!", "text": "This review is for liftmode's Palmitoylethanolamide (PEA); a great quality supplement at a great price that truly delivers. I use PEA for pain relief as it naturally reduces inflammation, while improving nerve health and joint function. Overall, a great product that I’d highly recommend to anyone looking for some natural pain support.", "rating": 5}, {"title": "LiftMode is Great ", "text": "LiftMode always delivers a quality product on time, or sooner. I appreciate the transparency LiftMode provides with their product-including COAs that can be easily understood. I’ve been ordering from them for 5+ years and have never been disappointed. I wish other companies could emulate their transparency model.", "rating": 5}, {"title": "Good selection and site as always....", "text": "Good selection and site as always and got my order out the same day. ", "rating": 5}, {"title": "I have bad anxiety", "text": "I have bad anxiety and I used this product (not this brand) before for that problem. The shipment was faster than I expected. Came with a little scooper. I hate that it don't have instructions. If anxiety is your issue, I would advise you to give this a try.", "rating": 5}, {"title": "Quick and efficient process", "text": "Quick and efficient process; with a potent product that has given me great results.  Thoroughly pleased.", "rating": 5}, {"title": "I always have a great and knowledgeable…", "text": "I always have a great and knowledgeable experience when dealing with Liftmode. Their products are top notch so is the service.", "rating": 5}, {"title": "Great products and great service", "text": "Easy to use website and ordering is a breeze, and they ship internationally. I like the email notices about new products and discounts.", "rating": 5}, {"title": "Great service as always from Liftmode", "text": "Great service as always from Liftmode. Timely, personalized contacts from customer service. By far the most professional supplement source out there. 5 stars", "rating": 5}, {"title": "Super fast shipping/customer service", "text": "Super fast shipping, and customer service. They got back to me within a few hours when I had a question about what I ordered!", "rating": 5}, {"title": "Always quick to process my order and if…", "text": "Always quick to process my order and if any problems they get back to me quickly, also quality products", "rating": 5}, {"title": "You folks have always had the best…", "text": "You folks have always had the best customer service when it comes to ordering online period. I genuinely mean that.", "rating": 5}, {"title": "Personalized servic", "text": "A great company that really cares about their customers. Exceptional quality of the products and fast shipping!", "rating": 5}, {"title": "I'm glad I found LiftMode", "text": "I'm glad I found LiftMode. They're a reliable and responsive supplier that ALWAYS ships my order out quickly.", "rating": 5}, {"title": "I had an address issue related to my…", "text": "I had an address issue related to my shipping address. Fortunately. it was resolved quickly. Thank you so much!", "rating": 5}, {"title": "Perfect", "text": "Perfect! Great experience. Thanks so much!", "rating": 5}, {"title": "liftmode is by far the best vendor of…", "text": "liftmode is by far the best vendor of natural nootropics love this compant, cant say enough good things about them", "rating": 5}, {"title": "Very good quality product", "text": "Very good quality product. Took time with having to prime, but so far,  the best Kanna I have come across so far after trying several brands", "rating": 5}, {"title": "I ordered the oblate discs and they…", "text": "I ordered the oblate discs and they arrived in time. Excellent service! ", "rating": 5}, {"title": "The Best Company in the Game!", "text": "Excellent product and plus they accept Bitcoin for payment! You guys are the best- I look nowhere else for my products.  Keep up the awesome work!", "rating": 5}, {"title": "MT55 is great!", "text": "MT55 is great!This is the best extract on the market. Liftmode processed/shipped my order extremely fast. They also replied to my email ASAP!", "rating": 5}, {"title": "Super fast delivery", "text": "I received my product very quickly.  I have always been happy with the quality of any product I have ordered. I could not do without my Ltheanine. No coffee jitters and fatigue❤️❤️", "rating": 5}, {"title": "Liftmode Team bent over backwards to…", "text": "Liftmode Team bent over backwards to help me resolve a complicated ordering situation in a way that couldn't have been more helpful and economical to me as a consumer. ", "rating": 5}, {"title": "They are always quick and efficient…", "text": "They are always quick and efficient when taking orders. Friendly and answer all questions.", "rating": 5}, {"title": "Arrived as promised", "text": "Arrived as promised.  Good quality ", "rating": 5}, {"title": "LiftMode always has the finest quality…", "text": "LiftMode always has the finest quality products, fastest shipping and best customer service.", "rating": 5}, {"title": "Unique, good quality products", "text": "Good quality products backed by analytical documents, and unique inventory..Packaging is good quality as well.", "rating": 5}, {"title": "Great company", "text": "Great company, they sell high quality stuff, secure payments and fast shipping", "rating": 5}, {"title": "Order of Laureth-23", "text": "The order placement was easy and the customer service is very good. I called two times and they answered my questions very well. Thanks.", "rating": 5}, {"title": "3rd party lab tested products and…", "text": "3rd party lab tested products and excellent customer service. Fast shipping. (Super fast)", "rating": 5}, {"title": "Good product love this lace", "text": "Good product. Fast shipping   Great representatives whenever I had a problem and called. ", "rating": 5}, {"title": "We are in a Renaissance of nutritional…", "text": "We are in a Renaissance of nutritional supplements and mental acuity support  , Thank you for helping me  obtain things that make my future easier and helping me be more aware  !", "rating": 5}, {"title": "Great product!", "text": "Great product!! My order was filled almost immediately, and I received it quickly.", "rating": 5}, {"title": "Everything arrived on time as expected", "text": "Everything arrived on time as expected and even came with extra spoons", "rating": 5}, {"title": "Fast shipping and great product", "text": "Order went out same day and was received quickly. Great attention to detail and products", "rating": 5}, {"title": "Decent ", "text": "Great fast delivery. Product is okay. I think more muscimol and hokinol would make it more effective ", "rating": 5}, {"title": "LM provides extraordinary products", "text": "LM provides extraordinary products.  I've  always been very pleased with the product quality.", "rating": 5}, {"title": "Best nootropics company", "text": "Best nootropics company. Always reliable and great customer service! Only order from these guys.", "rating": 5}, {"title": "Very good experience", "text": "Very good experience! The product is exactly as advertised and the shipping was surprisingly quick. ", "rating": 5}, {"title": "Got here quickly", "text": "Got here quickly. I’ve used this supplement for a yr now. ", "rating": 5}, {"title": "Ordering was easy and the package…very simple process", "text": "Ordering was easy and the package arrived a day early then scheduled ", "rating": 5}, {"title": "Perfect service", "text": "Perfect service. Super quick shipping! Thanks a million!", "rating": 5}, {"title": "All around excellent experience ", "text": "The website is easy to use. Products ship super fast. And it's the best Tonkat Ali I've ever used. 2 thumbs up every time, bravo", "rating": 5}, {"title": "Excellent products!", "text": "Excellent product, fast service, and free samples with coupon code!", "rating": 5}, {"title": "Monolaurin", "text": "Quick and easy ordering and shipment on time.", "rating": 5}, {"title": "Shipping was super fast", "text": "Shipping was super fast, very satisfied with their product ", "rating": 5}, {"title": "Quality phenibut", "text": "I've ordered before and it always arrives in less than a week. Happy with the products quality as well.", "rating": 5}, {"title": "Most consistent & reliable Supplement Company", "text": "Absolutely fantastic customer service, consistent product quality, reliable delivery service. 10/10 in terms of the overall customer experience with this company. Have used them for years, never had an issue from their end that they didn't immediately rectify.", "rating": 5}, {"title": "chill", "text": "been looking for kava kava for a long while (like ten years since I could find it) & you have great kava!", "rating": 5}, {"title": "Excellent", "text": "Excellent, effective, high quality products. My order was delivered, securely packaged in a timely manner. Would absolutely recommend LiftMode!", "rating": 5}, {"title": "LiftMode is a great source and I really…", "text": "LiftMode is a great source and I really like the 3rd party lab testing they have on their products", "rating": 5}, {"title": "Had an issue and LiftMode promptly…", "text": "Had an issue and LiftMode promptly remedied it. Awesome service!", "rating": 5}, {"title": "A user-friendly website with easy…", "text": "A user-friendly website with easy ordering and fast shipping.  Perfect.", "rating": 5}, {"title": "LiftMode is topnotch", "text": "I have always received good quality products, and fast customer service with LiftMode.", "rating": 5}, {"title": "High quality supplements", "text": "High quality supplements, best I've found. Super fast shipping & great customer service!", "rating": 5}, {"title": "Awesome product.Arrived just as…", "text": "Awesome product.Arrived just as described.Great information included with product.", "rating": 5}, {"title": "Fast shipping", "text": "Fast shipping. Product as described. Great value.", "rating": 5}, {"title": "Above and Beyond expectations.", "text": "This company is really attentive to your needs. I am very impressed.", "rating": 5}, {"title": "Perfect", "text": "Super fast, exactly what's ordered, easy process. ", "rating": 5}, {"title": "Top quality product", "text": "Top quality product, lab verified. Very fast delivery.", "rating": 5}, {"title": "The kanna extract seems to be effective…", "text": "The kanna extract seems to be effective holistic medicine. Noticable posative difference in mood when used responsibly.", "rating": 5}, {"title": "Good quality  product, clear  direction  how to use it, all supplements  in a glass", "text": "Good quality  product, clear  direction  how to use it, all", "rating": 5}, {"title": "I spoke to a representative and he was…", "text": "I spoke to a representative and he was very helpful with my order.", "rating": 5}, {"title": "Love liftmode", "text": "Love liftmode! Best supplements you can get!", "rating": 5}, {"title": "Extremely fast delivery and top tier…", "text": "Extremely fast delivery and top tier customer service and products. I tried out another brand and was immediately disappointed", "rating": 5}, {"title": "Trouble with your site but helpful…", "text": "Trouble with your site but helpful customer service.", "rating": 5}, {"title": "Simple fast shipping", "text": "Simple fast shipping, great packaging, reliable product.", "rating": 5}, {"title": "As asdvertised", "text": "Quality stuff that came in a reasonable time", "rating": 5}, {"title": "Always impressed with everything about…", "text": "Always impressed with everything about this company.", "rating": 5}, {"title": "This product is very effective and helps greatly with  sleep issues. ", "text": "The product is very effective and it ships very promptly. ", "rating": 5}, {"title": "Great job with quick service and …", "text": "Great job with quick service and  delivery ", "rating": 5}, {"title": "Easy ordering process & quick shipping…", "text": "Easy ordering process & quick shipping made this a perfect transaction!", "rating": 5}, {"title": "Product descriptions are very detailed…", "text": "Product descriptions are very detailed and informative.  Web site is well-organized. Prices are competitive.  Quality!", "rating": 5}, {"title": "It's improving my vision right away", "text": "It's improving my vision right away ", "rating": 5}, {"title": "I'm a repeat offender and it is the…", "text": "I'm a repeat offender and it is the product all the way.", "rating": 5}, {"title": "Quick turn around", "text": "Quick turn around, good value for the amount of the product plus an email for tracking.", "rating": 5}, {"title": "Shipping was quick and awesome ", "text": "Date of experience: July 08, 2024", "rating": 5}, {"title": "Very quick service and excellent…", "text": "Very quick service and excellent product .", "rating": 5}, {"title": "It's easy to buy here", "text": "It's easy to buy here and the price is reasonable with the discount.Thank you", "rating": 5}, {"title": "Super fast shipping", "text": "Super fast shipping. High quality product.", "rating": 5}, {"title": "Trustworthy", "text": "Amazing products, amazing shipments, pure products. You get what you pay for", "rating": 5}, {"title": "Leo is great to deal with and I look…", "text": "Leo is great to deal with and I look forward to buying from him again.", "rating": 5}, {"title": "Best supplement provider", "text": "Always great customer service and quality products, haven't had any issues whatsoever .", "rating": 5}, {"title": "Miss", "text": "You  communicated well with the chat. I do miss my phenibut.", "rating": 5}, {"title": "Prompt service", "text": "Prompt service. Quality products.", "rating": 5}, {"title": "Another good experience start to finish", "text": "Fast shipping, high quality products with good information and customer service, too", "rating": 5}, {"title": "The product is exceptional", "text": "The product is exceptional, the shipping was incredibly prompt. ", "rating": 5}, {"title": "Quick service", "text": "Quick service. High quality product.", "rating": 5}, {"title": "Super fast delivery", "text": "Super fast delivery. High quality energy caps.", "rating": 5}, {"title": "Fantastic and epic quality", "text": "Fantastic and epic quality, the best for the best 👌 👍", "rating": 5}, {"title": "Quick shipping and good quality product.", "text": "Quick shipping and good quality product. ", "rating": 5}, {"title": "Good quality and service.", "text": "Another good product and fast delivery time.", "rating": 5}, {"title": "Fast shipping and great product quality…", "text": "Fast shipping and great product quality 5 stars", "rating": 5}, {"title": "Fast shipping (went out same day)", "text": "Fast shipping (went out same day).  Everything was exactly as ordered.", "rating": 5}, {"title": "Quick shipping and good quality product.", "text": "Date of experience: March 26, 2024", "rating": 5}, {"title": "Kanna and Kava ", "text": "The Kanna extract and the Kava extract are very good. ", "rating": 5}, {"title": "Always reliable and quick", "text": "Always reliable and quick. Great customer service and products", "rating": 5}, {"title": "Tongkat Ali 10% is good quality", "text": "Tongkat Ali 10% is good quality. Second time buying", "rating": 5}, {"title": "Quick shipping", "text": "Quick shipping, smooth experience and great products. Highly recommended!", "rating": 5}, {"title": "Great site!", "text": "Great products and super fast turnaround!!", "rating": 5}, {"title": "Fast shipping", "text": "Fast shipping , quality products", "rating": 5}, {"title": "Great!!", "text": "Great product if your looking to bypass the FDA.", "rating": 5}, {"title": "Great service", "text": "Great service, great company.", "rating": 5}, {"title": "I find the sleep caps very helpful ", "text": "I find the sleep caps very helpful for a good night’s sleep", "rating": 5}, {"title": "Quick delivery", "text": "Quick delivery, product delivered as described.", "rating": 5}, {"title": "Prompt delivery and quality product.", "text": "Date of experience: September 23, 2023", "rating": 5}, {"title": "No Problems", "text": "Simple, straight forward, good information, and prompt delivery.", "rating": 5}, {"title": "Great product and very reliable…", "text": "Great product and very reliable consistency.", "rating": 5}, {"title": "quick shipping & great price (very…", "text": "quick shipping & great price (very cheap!)", "rating": 5}, {"title": "Great Customer Service And Fast…", "text": "Great Customer Service And Fast Shipping.", "rating": 5}, {"title": "Order was very prompt.", "text": "Date of experience: July 22, 2024", "rating": 5}, {"title": "Dr Recommended", "text": "Dr. Blaylock recommends this.", "rating": 5}, {"title": "moodlift product is too good to be true", "text": "Date of experience: March 29, 2024", "rating": 5}, {"title": "Quality products and fast shipping!", "text": "Quality products!", "rating": 5}, {"title": "Liftmode is always solid", "text": "Liftmode is always solid. Great supplements and fast delivery. Never disappointed.", "rating": 5}, {"title": "Pharmaceutical grade alkaloid…", "text": "Pharmaceutical grade alkaloid extraction. Superb adaptogen, Rhodiola.", "rating": 5}, {"title": "My order arrived!", "text": "Date of experience: April 27, 2024", "rating": 5}, {"title": "Prompt and courteous customer service.", "text": "Prompt and courteous customer service.Shipped product immediately.", "rating": 5}, {"title": "Love LiftMode", "text": "Date of experience: November 10, 2023", "rating": 5}, {"title": "speedy delivery", "text": "speedy delivery. quality product.", "rating": 5}, {"title": "Quickgreat explanatory website shipping", "text": "Quick shippingGreat explanatory website ", "rating": 5}, {"title": "Good service", "text": "I like how fast the order comes. ", "rating": 5}, {"title": "First time buyer", "text": "Very fast shipping", "rating": 5}, {"title": "Service was great..showed up on time…", "text": "Service was great..showed up on time and fast", "rating": 5}, {"title": "Great product", "text": "Great product. Fast shippingg", "rating": 5}, {"title": "Fast shipping", "text": "Fast shipping, reliable product", "rating": 5}, {"title": "They deliver perfect everytime", "text": "Date of experience: December 03, 2023", "rating": 5}, {"title": "You are the best.", "text": "You are the best.. your products are awesome", "rating": 5}, {"title": "Timely support and assistance.", "text": "Date of experience: November 30, 2023", "rating": 5}, {"title": "Amazing customer service and fast…", "text": "Amazing customer service and fast responses.", "rating": 5}, {"title": "Great experience and quality products", "text": "Date of experience: October 21, 2023", "rating": 5}, {"title": "Excellent customer service", "text": "Excellent customer service. They were quick and professional.", "rating": 5}, {"title": "Great buy frum yur boi", "text": "Date of experience: July 03, 2024", "rating": 5}, {"title": "It's great", "text": "It's great. Thank you", "rating": 5}, {"title": "The availability and quick delivery…", "text": "The availability and quick delivery options ", "rating": 5}, {"title": "Buy it, it's a nice system balancer Good product-good service-reasonable…", "text": "Good product-good service-reasonable price", "rating": 5}, {"title": "Product exceeded expectations…", "text": "Product exceeded expectations considerably.  ", "rating": 5}, {"title": "fast communication", "text": "fast communication. great products.", "rating": 5}, {"title": "Great company highly recommended", "text": "Great company highly recommended ", "rating": 5}, {"title": "Just what I ordered", "text": "Just what I ordered ", "rating": 5}, {"title": "Arrived earlier than expected", "text": "Date of experience: November 12, 2023", "rating": 5}, {"title": "Top notch everything!", "text": "Date of experience: April 22, 2024", "rating": 5}, {"title": "Quality assurance was appreciated", "text": "Date of experience: February 28, 2024", "rating": 5}, {"title": "Fast delivery", "text": "Fast delivery ", "rating": 5}, {"title": "Everything was A+!!!", "text": "Date of experience: November 07, 2023", "rating": 5}, {"title": "Quick delivery!", "text": "Date of experience: January 30, 2024", "rating": 5}, {"title": "good products", "text": "Date of experience: November 26, 2023", "rating": 5}, {"title": "will buy again", "text": "Good experience", "rating": 5}, {"title": "😀😀😀😀😀", "text": "😀😃😄😁😆😅🤣😂🙂🙃🫠", "rating": 5}, {"title": "5 stars without doubt", "text": "Ordered from similar vendors in 3 different continents. Liftmode is the best by far. Quantity, fast delivery and best quality product.", "rating": 5}, {"title": "Website easy to navigate and find…", "text": "Website easy to navigate and find desired items. Timely delivery and reasonable pricing! 🤜🤛", "rating": 5}, {"title": "Amazing company", "text": "Thank you for another successful delivery!", "rating": 5}, {"title": "Great product and great customer…", "text": "Great product and great customer service and fast shipping and delivery.THANK YOU!", "rating": 5}, {"title": "I love liftmode and their products", "text": "I love liftmode and their products.  When I order from them I know I’m getting clean, quality products. They always ship quickly and I really appreciate that.", "rating": 5}, {"title": "Fast delivery", "text": "Fast delivery. Good products. Nuff said", "rating": 5}, {"title": "My order was shipped quickly", "text": "My order was shipped quickly! The website was easy to navigate, and the communication from Liftmode summarizing the order and detailing the shipping process was excellent.  I would absolutely order from this company again!", "rating": 5}, {"title": "Fxcxssxxxddzxd", "text": "Fxxssxxxddzxd", "rating": 5}, {"title": "Very happy!", "text": "Definitely 5 stars for this company. Great experience.", "rating": 5}, {"title": "Great product", "text": "Date of experience: October 15, 2023", "rating": 5}, {"title": "very happy, & SPEEDY shipping", "text": "i got my order the day after i bought it from here. Awesome product. Best quality i've had from any other site, for the Phenibut . Glad my friend recommended me this here.", "rating": 5}, {"title": "Quick shipping great customer service…", "text": "Quick shipping great customer service and amazing product.", "rating": 5}, {"title": "I always get to speak with Leo", "text": "I always get to speak with Leo, he leads with customer service.  I’m a LM customer for life!  Thanks guys,Stacey", "rating": 5}, {"title": "Great customer service", "text": "Great products, fast shipping.", "rating": 5}, {"title": "Fast shipping and excellent product", "text": "Fast shipping and excellent product! Prices are reasonable and shipping rate is reasonable as well.", "rating": 5}, {"title": "I'm impressed", "text": "Bought this on a monday, recieved the shipment midday wednesday. Thats really fast and I'm thankful for whoever runs these orders. Good job Liftmode! 5 stars and great review for y'all. The products are always top grade and certified with lab analysis, signed by a person in charge, included everytime and more. 5 more stars for transparency and consistency. Big thanks to you guys over there at Liftmode.", "rating": 5}, {"title": "very fast shipping", "text": "came in 3 business days", "rating": 5}, {"title": "Reliably consistent", "text": "Great products Fast shipping every time", "rating": 5}, {"title": "I’ve ordered from Liftmode many times…", "text": "I’ve ordered from Liftmode many times over the past few years and I’ve always been completely satisfied with their service. Their customer service is great, the quality of the products is always great, and their shipping is always fast.", "rating": 5}, {"title": "Great Products", "text": "Top of the line supplements", "rating": 5}, {"title": "Great products and fast delivery", "text": "Great products and fast delivery, thanks guys!", "rating": 5}, {"title": "Good quality product", "text": "Good quality product.  Each container of GOS came with a certificate of analysis documenting the Lot and purity of the batch.  It was also nice that it came in a handy resealable container with a measuring scoop.  Mixes easily into food or drink, with a slightly sweet taste.", "rating": 5}, {"title": "Delivery was speedy", "text": "Delivery was speedy. Received everything as promised.", "rating": 5}, {"title": "Liftmode", "text": "Product quality is great.", "rating": 5}, {"title": "Pretty good", "text": "Pretty good, still waiting for my order on CBD oil hopefully next week they will by then replenish they stock!", "rating": 5}, {"title": "Great ordering delivery tracking", "text": "Great ordering delivery tracking. Pain that I can’t buy this in Canada though. Exchange rate shipping and duty make it prohibitively expensive.", "rating": 5}, {"title": "Always quick and easy", "text": "Always quick and easy; much appreciated", "rating": 5}, {"title": "Great products and great service", "text": "Fast shipping", "rating": 5}, {"title": "I love that I get discounts and free…", "text": "I love that I get discounts and free quick shipping with liftmode.  I have been a customer for a long while, and I don't plan on doing business with any other supplement companies.  Once you do business with liftmode, you will be hooked on their excellent service and quality products! :D", "rating": 5}, {"title": "High quality, fast shipping.", "text": "Everything about the transaction was simple.  The product arrived quickly and is of high quality.", "rating": 5}, {"title": "Quick shipping and great product!", "text": "Date of experience: October 18, 2023", "rating": 5}, {"title": "Great products", "text": "Great products, shipping time, and customer service, but they're often out of stock of the sizes I'm looking to purchase.  Other than that 5/5*", "rating": 5}, {"title": "Absolutely good quality products also…", "text": "Absolutely good quality products also fast shipping", "rating": 5}, {"title": "My experience was excellent and the…", "text": "My experience was excellent and the service is always great!", "rating": 5}, {"title": "One of my favorites", "text": "I've been buying from LiftMode for a number of years now. Quality, consistency, and speed of service cannot be beat.", "rating": 5}, {"title": "SPEEDY SERVICE", "text": "SPEEDY SERVICE, GREAT PACKAGING,GOOD INSTRUCTIONS", "rating": 5}, {"title": "Quality product", "text": "Quick delivery and top tier quality, thank you again", "rating": 5}, {"title": "Best products and best customer…", "text": "Best products and best customer service!!", "rating": 5}, {"title": "Good products", "text": "Good products, great service and prices !", "rating": 5}, {"title": "I'm getting what I ordered your…", "text": "I'm getting what I ordered your products seem to be pure usually I haven't gotten this order yet but it's supposed to be here Friday and that's sooner than it said yesterday it said Saturday so if it arrives on time I'll be pleased hopefully it comes with a measuring spoon", "rating": 5}, {"title": "As always", "text": "As always, liftmode processes your shipment asap. Prices are almost double now though with inflation. Keep up the good work.", "rating": 5}, {"title": "Liftmode rules", "text": "Liftmode is always rock solid. I have been dealing with them for years.", "rating": 5}, {"title": "Good product", "text": "Good product, reliable!!", "rating": 5}, {"title": "Reliable Vendor", "text": "Fast shipping, good product", "rating": 5}, {"title": "Great Service", "text": "Product was delivered accurately and in a timely manner", "rating": 5}, {"title": "Great all around.", "text": "Date of experience: October 19, 2023", "rating": 5}, {"title": "Always refreshing to find a company…", "text": "Always refreshing to find a company that takes so much pride in what they do. Great people at Liftmode.", "rating": 5}, {"title": "Great experience", "text": "Great experience. Product was shipped out the day after I ordered and the quality is A+. Too bad they're discontinuing the product I purchased :(...", "rating": 5}, {"title": "Brilliant products at a reasonable price", "text": "Brilliant products at a reasonable priceI've purchased their Kanna elixir after a recommendation from a friend and it's amazing for relaxation/ winding down during the evening.", "rating": 5}, {"title": "The best", "text": "Quality care", "rating": 5}, {"title": "Order arrived quickly", "text": "We have ordered three times and our items all arrived quickly.", "rating": 5}, {"title": "Top notch", "text": "Super fast delivery, outstanding selection of products, always satisfied with service. Thanks again!!!", "rating": 5}, {"title": "Fast shipping!", "text": "Fast shipping!Great inventory!", "rating": 5}, {"title": "Excellent Experience", "text": "Great product and professional service!", "rating": 5}, {"title": "FAST*** Shipping!!!", "text": "It’s too early to see how my supplement will work but ordering was easy peasy! Shipping was amazing. With Reg shipping- Ordered Mon afternoon & rec’d in Wed!!!", "rating": 5}, {"title": "amazing service, great brand", "text": "I would like to start off by I feel really really really bad for requesting a refund and they gave me a refund, I ordered phenibut and I received it! However I firs started off by 2 capsules I felt nothing then after a few days I took 3 felt nothing then took 2 more then took 2 more so its 7 capsules... I still felt nothing I felt upset because I had high hopes for it and this is my first time ever trying phenibut so I dont have any tolerance, I requested a refund and they kindly gave it to me and I feel really bad but idk maybe my body is different or something or It did have an effect and I didnt notice but I dont know I really dont, but the service is really nice and professional, ugh I feel like I should pay them back I feel really bad but overall I really really recommend this brand, I highly suggest you check it out", "rating": 5}, {"title": "Fantastic products", "text": "Fantastic products, fair prices & I really like the various choices for shipping. I do not order from any other company.", "rating": 5}, {"title": "Phenibut", "text": "Great product", "rating": 5}, {"title": "Finally some sleep", "text": "First off, I went to order the NMN which you were out of.  Understand that as it has received quite a bit of attention NATIONALLY!  But I DID get the sleep caps!  My husband had so many surgeries (6 joint replacements) and the doctors happily got him hooked on oxycodone!  He finally went to rehab about 7/8 years ago.  While getting off wasn't easy, getting sleep after being addicted was IMPOSSIBLE.  We (I) have tried EVERYTHING I could think of!  NOTHING worked.  Well, tried this and he has actually had 4 nights sleep!  Lord willing and the creeks don't rise, I pray that this continues because INSOMNIA is insidious!  It has ruled our lives!  What a journey!  Thank you!", "rating": 5}, {"title": "i ordered the baicalm pills from…", "text": "i ordered the baicalm pills from liftmode and if you have anxiety ( treated or untreded ) these pills are AMAZING. After starting theres my anxiety was gone amd my wife actualy has had no need to take her breakthrough anxiety meds ( klonopin ) a litteral life saver of a pill!", "rating": 5}, {"title": "5 stars", "text": "5 stars. The order and delivery process are always quick and dependable. Liftmode is the best!", "rating": 5}, {"title": "always have what i need", "text": "Date of experience: October 13, 2023", "rating": 5}, {"title": "Liftmode customer service is hands down…", "text": "Liftmode customer service is hands down the best out there.  Very fast shipping is great.", "rating": 5}, {"title": "Good products", "text": "Great products, great customer support", "rating": 5}, {"title": "great seller", "text": "Shipped fast product was as advertised, will be doing business with again.", "rating": 5}, {"title": "Great customer service!", "text": "Date of experience: October 12, 2023", "rating": 5}, {"title": "quick service Great company", "text": "Date of experience: October 09, 2023", "rating": 5}, {"title": "Fast shipping", "text": "Fast shipping, great product", "rating": 5}, {"title": "Prompt delivery and well priced", "text": "The Product was fairly priced and arrived quickly.", "rating": 5}, {"title": "Great quality, trustworthy company", "text": "Great quality products from a company I know I can trust, accurate and prompt order processing as always.", "rating": 5}, {"title": "Quality Product!", "text": "Quality Product!Very easy to use website, and very speedy delivery.", "rating": 5}, {"title": "Service was great & shipping was fast!", "text": "Date of experience: September 25, 2023", "rating": 5}, {"title": "Great company with top quality trusted…", "text": "Great company with top quality trusted certified products.", "rating": 5}, {"title": "Thank you", "text": "Thank you for fast shipping and quality Phenibut!", "rating": 5}, {"title": "Liftmode is Top Notch", "text": "Liftmode is Top Notch. I’ve been buying from them for years. Best service, every single time", "rating": 5}, {"title": "Excellent products Fast delivery", "text": "Date of experience: October 09, 2023", "rating": 5}, {"title": "Quick delivery", "text": "Quick delivery. Product as advertised.", "rating": 5}, {"title": "All around great place and product", "text": "Excellent customer service, quick shipping, great product.", "rating": 5}, {"title": "Sent what I ordered", "text": "Date of experience: September 11, 2023", "rating": 5}, {"title": "Great and caring customer service…", "text": "Great and caring customer service representatives@", "rating": 5}, {"title": "amazing", "text": "best service for the goods", "rating": 5}, {"title": "I love this company.", "text": "Date of experience: October 07, 2023", "rating": 5}, {"title": "Lift mode is amazing", "text": "Lift mode is amazing. Super fast shipping and they print out a test of each of their products.", "rating": 5}, {"title": "I have purchased many products from…", "text": "I have purchased many products from Liftmode since 2016 and have always been very satisfied with their purity and speedy delivery.  I will only buy from Liftmode.", "rating": 5}, {"title": "Always a positive experience!", "text": "The product, emoxypine, has been an experiment for me. I suffer from General Anxiety Syndrome. I have found that the occasional use of this substance has allowed me to decrease my benzodiazepine.  I am pleased. When I had a question regarding usage, customer service (Leo), stayed with me until we both understood. I am pleased, again. I have been purchasing from Liftmode for several years and I have always been satisfied. Thank you!", "rating": 5}, {"title": "Legit website", "text": "Legit website, fast shipping and professional packaging", "rating": 5}, {"title": "Fast shipping good product", "text": "Got my order in not tome at all.", "rating": 5}, {"title": "I have had pretty much all positive…", "text": "I have had pretty much all positive experiences with lift mode in particular their Phenibut product. I’m not really sure how Phenibut has anything to do with lifting weights or fitness however it’s wonderful for helping to control anxiety. I was made aware of the product by a man named Leonard Persin. He has a YouTube channel called the (Big Lenny Show) this man is a character for sure but in-between his strange gym persona and his tranny hunting. Yes the man really enjoys ladyboys. But we live in America so it’s his right to hunt down tan ten ten’s as he reference's them. Tan for their skin color Ten for their attractive appearance and Ten because According to him they are packing 10 inches of heat down below the waist. I find this to be an interesting individual but draw the line at enjoying ladyboy company. I Have to give him credit he speaks highly of the Phenibut manufactured by lift-mode and in all honesty we probably would not be privy to phenibut. In all honesty you should make this man a paid spokesperson for your company. I’d look at your phenibut sales and contribute 90% of them to Mr. Persin and his loyal followers.Sincerely,Jeffrey A. Morrow", "rating": 5}, {"title": "easy ordering quick shipping no B.S", "text": "easy ordering quick shipping no B.S. good to do business with", "rating": 5}, {"title": "Quality Supplements, Quick Shipping!", "text": "I have placed previous orders along with this recent order from LiftMode. The products are of great quality and packaged well for safety. I don't know if it's related to where I live or not, but the order fulfillment and shipping speed are incredible. I placed this order at approximately 3:45 PM and received it the next day! Can't recommend them enough.", "rating": 5}, {"title": "Ordering from LiftMode is easy", "text": "Ordering from LiftMode is easy, it's prices are great, and shipping is never a hassle.", "rating": 5}, {"title": "Great product!", "text": "Great product; helps some with pains & anxiety.  Made sure to order several bottles again (BaiCalm seems to be a popular item) so I'd have a nice back-log.  Not too expensive, arrived in good condition & rather swiftly!  Thanks", "rating": 5}, {"title": "Fast and great product", "text": "Date of experience: October 04, 2023", "rating": 5}, {"title": "Great deal.", "text": "Very happy with the effectiveness of the product and its price.", "rating": 5}, {"title": "All around top tier experience", "text": "Top tier product, reasonable price, fast delivery. Highly recommend.", "rating": 5}, {"title": "Great company", "text": "Fast shipping. Superb quality. I trust Liftmode with my supplements.", "rating": 5}, {"title": "I’m almost ashamed to admit this", "text": "I’m almost ashamed to admit this, but I’ve purchased close to $1,000 worth of products from these guys over the course of 2 years. Mostly to experiment which supplements/vitamins are most beneficial, 90% of them made a drastic improvement in my well being and mental health/anxiety/depression/Insomnia. Every single order I’ve had has NOT ONCE taken more than 3 days to arrive, which is just awesome to me! One time I received my order the day after ordering. And these guys have the highest quality products I swear by it, for real they try their hardest, lab testing and all that. Thanks lift mode", "rating": 5}, {"title": "Quick and professional responses to all…", "text": "Quick and professional responses to all inquires", "rating": 5}, {"title": "Customer service was great.", "text": "Date of experience: September 17, 2023", "rating": 5}, {"title": "kanna extract", "text": "Product was better than expected im happy with my purchase and the service ill be ordering again for sure 👍", "rating": 5}, {"title": "Always excellent customer service", "text": "Always excellent customer service, prompt shipping, exceptional products", "rating": 5}, {"title": "Transparency Products I ordered came with a…", "text": "Products I ordered came with a Certificate of Analysis together with the third party lab results. You never usually get to have those data for assessment and added peace of our minds.", "rating": 5}, {"title": "Smooth, positive shopping experience.", "text": "Product selection was good and ordering was simple and delivery was fast/efficient. Overall positive shopping experience. 5/5.", "rating": 5}, {"title": "Best supplement site that I know of", "text": "I have been purchasing LiftMode supplements for quite some time now.  Always priced fair, top quality, and consistent quick shipping.", "rating": 5}, {"title": "Top nootropics supplier", "text": "Top phenibut supplier! Quick delivery reasonable price.", "rating": 5}, {"title": "Good customer service", "text": "Good customer service, delivered on time", "rating": 5}, {"title": "Never Not Great", "text": "Really enjoy all this site has to offer ❤️.", "rating": 5}, {"title": "Great Company", "text": "Always quick shipping and haven’t received a product of theirs that I didn’t enjoy.", "rating": 5}, {"title": "Always a good experience", "text": "Always a good experience, never been disappointed.", "rating": 5}, {"title": "It's all great from product to shipping", "text": "Date of experience: September 30, 2023", "rating": 5}, {"title": "I love this company", "text": "I love this company. Highest quality product & best customer service. I could not recommend any more.", "rating": 5}, {"title": "Great company and products", "text": "I love dealing with this company. shipping is incredibly fast..keep up the good work y'all!!", "rating": 5}, {"title": "Love the product", "text": "Date of experience: September 08, 2023", "rating": 5}, {"title": "The healing properties of liftmode products", "text": "These products have helped. Recover after a few severeillnesses. The cholines for me. The phenibut used in moderation shorterm . To help with the anxiety and mild depression. Study before use. If misused it can cause agitation for some people. I’m no expert but I studied the history of this product. In use for years over seas with little side effects.", "rating": 5}, {"title": "They are always absolutely fantastic", "text": "Their customer service is beyond reproach-fantastic.  They are the most helpful and nicest people to work with.  Their product quality is also spot on every time.  I am a loyal customer and have been for years", "rating": 5}, {"title": "Quality product and fast shipping.", "text": "Date of experience: September 13, 2023", "rating": 5}, {"title": "Super fast customer service, w/fast shipping!", "text": "I goofed up on an order and they quickly help resolve the issue promptly. Thanks Liftmode", "rating": 5}, {"title": "Super fast shipping, price, product quality", "text": "Super fast shipping. Typically my order ships within 12 hours of the time I placed my order. Also the quality of the products I order is outstanding. The price is so right. I don't usually write reviews but liftmode has earned it . If your questioning whether to order or not definitely place the order and give them a try . You won't be disappointed.", "rating": 5}, {"title": "Very good customer service", "text": "Professional services. The team spontaneously response to all the questions and requests.", "rating": 5}, {"title": "Quick service and free fast shipping.", "text": "Date of experience: September 28, 2023", "rating": 5}, {"title": "Quick shipping and verified products…", "text": "Quick shipping and verified products and clear ingredients and instructions.", "rating": 5}, {"title": "Always quality and fast shipping.", "text": "Date of experience: September 30, 2023", "rating": 5}, {"title": "Love this site", "text": "Love this site. They are the best. Fast and always on top of my orders.", "rating": 5}, {"title": "First Shopping Experience...", "text": "This was my first order and the delivery time was excellent. As well, the product was all professionally packaged and the quality of the product was good. All in all, this was a great first shopping experience with them.", "rating": 5}, {"title": "Liftmode sells quality!", "text": "Liftmode sells quality, cutting edge, nootropics and supplements that work!", "rating": 5}, {"title": "Excellent service and fast shipping.", "text": "Date of experience: September 21, 2023", "rating": 5}, {"title": "Quality product and fast shipping.", "text": "Date of experience: September 26, 2023", "rating": 5}, {"title": "Great customer service", "text": "Great service", "rating": 5}, {"title": "Great and dependable", "text": "Date of experience: September 27, 2023", "rating": 5}, {"title": "fast shipping", "text": "fast shipping. great quality. will purchase from here again for sure.", "rating": 5}, {"title": "Exemplary Product And Experience", "text": "Clean website. Fast shipping. Quality product. Excellent price. Keep getting better. Formula for successful online business and happier customers.", "rating": 5}, {"title": "Fast delivery", "text": "Fast delivery. Easy to place order.", "rating": 5}, {"title": "I found this company online they have a vast array of products.", "text": "I found this company online, they carry a large number of interesting products. I made an order and was extremely happy at how quickly my order arrived. I ordered a few different products and had an issue with one item and contacted customer service who quickly refunded the cost of the item. Very happy overall with customer service and shipping.", "rating": 5}, {"title": "Super fast shipping!", "text": "Item well packaged. Shipped same day which is better than expected and much appreciated. Thank you!", "rating": 5}, {"title": "Got here fast and was exactly what I…", "text": "Got here fast and was exactly what I ordered. Great price, as well.", "rating": 5}, {"title": "I have been a loyal customer of…Phenibut", "text": "I have been a loyal customer of Liftmode for a short time now, and I have to commend all the efforts demonstrated by the Liftmode team in providing some of the best online nootropic products out there!  I have purchased several products thus far and the Phenibut is among the best in quality and purity!  It's a superb compound, esp if one is in recovery from substance abuse, as I can testify from empirical experience that this product is unparalleled.  If I could give more than five stars I wouldDustin", "rating": 5}, {"title": "Great product and service!!", "text": "Date of experience: September 25, 2023", "rating": 5}, {"title": "Always good quality and fast shipping!", "text": "Date of experience: September 25, 2023", "rating": 5}, {"title": "Excellent…", "text": "Excellent communications, excellent delivery options to chose from (not forcing folks to use the incompetent USPS) and package was sealed very well! First class!", "rating": 5}, {"title": "Good quality products", "text": "Date of experience: September 18, 2023", "rating": 5}, {"title": "Great quality products was shocked at…", "text": "Great quality products was shocked at how much better they were then other phenibut caps and the Janna extract is fire", "rating": 5}, {"title": "Always great service!", "text": "Date of experience: September 24, 2023", "rating": 5}, {"title": "Great experience 10/10 would recommend!!", "text": "Package arrived super fast and the product is great!!", "rating": 5}, {"title": "THE BEST PLACE!!", "text": "The people and the product are top tier.Hands down the best company!", "rating": 5}, {"title": "Excellent company with superb customer…", "text": "Excellent company with superb customer service. Highly recommended.", "rating": 5}, {"title": "Super service", "text": "Super service! highest quality products will definitely order again!", "rating": 5}, {"title": "Customer service and delivery time", "text": "Great help and customer service!", "rating": 5}, {"title": "5 STARS", "text": "Been ordering from Liftmode over the years, and will continue to as my go-to for the highest quality supplements", "rating": 5}, {"title": "Great company with very fast shipping", "text": "Date of experience: September 06, 2023", "rating": 5}, {"title": "LiftMode is very trustworthy", "text": "LiftMode is very trustworthy.  I do no have to worry about anything when I  order from them.", "rating": 5}, {"title": "Fast shipping and good products", "text": "Fast shipping and good products. Win win.", "rating": 5}, {"title": "Quality product", "text": "Quality product. Sent in a timely manner.", "rating": 5}, {"title": "The shipping is fast every time", "text": "The shipping is fast every time! Product is pure, works great!", "rating": 5}, {"title": "Eight years ordering with Liftmode.  Every experience 5/5 *", "text": "I've been ordering from Liftmode for 8 years now. Every experience with them has been 5 stars. I've been happy with every product I've ever purchased.", "rating": 5}, {"title": "Great quality", "text": "Date of experience: September 20, 2023", "rating": 5}, {"title": "Availability of the product I wanted", "text": "Availability of the product I wanted.  Fast efficient service.", "rating": 5}, {"title": "Great quality and product", "text": "Date of experience: September 03, 2023", "rating": 5}, {"title": "Super fast execution on getting the…", "text": "Super fast execution on getting the product out their door to yours in no time, it's quick response!! 😁 Products are legit and done properly, VERY happy customer!! 😁😁♥️", "rating": 5}, {"title": "Quality product", "text": "Quality product, delivered quickly, as usual.", "rating": 5}, {"title": "Solid online merchant!!!", "text": "With an easy checkout process, super fast shipping and quality product Liftmode has made a new satisfied customer. They even threw in a scooper and little card explaining the rough values of the scoop! They are a solid seller and I will shop with them again.", "rating": 5}, {"title": "Great service and quality product.", "text": "Date of experience: September 18, 2023", "rating": 5}, {"title": "Fast shipping and great products", "text": "Date of experience: September 01, 2023", "rating": 5}, {"title": "Package arrived in perfect condition", "text": "Package arrived in perfect condition. Earlier than expected! Thanks Liftmode.", "rating": 5}, {"title": "Fast shipping and always been high…", "text": "Fast shipping and always been high quality nootropics.", "rating": 5}, {"title": "I've been buying from LifeMode for over…", "text": "I've been buying from LifeMode for over 8 years and never have been dissatisfied.", "rating": 5}, {"title": "Easy and prompt", "text": "This retailer was the only domestic (US) supplier of phenibut I could locate.  I had low expectations, but the ordering process was smooth as I received my order much sooner than anticipated.", "rating": 5}, {"title": "Ideal experience", "text": "Fast delivery, great prices, and quality product.  I’m definitely ordering again!", "rating": 5}, {"title": "Very professional", "text": "Very professional, great turn around time fast shipment. Quality products that are tested.", "rating": 5}, {"title": "LiftMode is simply phenomenal!", "text": "ALWAYS top notch products & customer service to us folks in Canada!", "rating": 5}, {"title": "Order arrived quickly.", "text": "As promised", "rating": 5}, {"title": "Bought a 70ct Bottle about 6-8 months…", "text": "Bought a 70ct Bottle about 6-8 months ago and enjoyed it all. 150ct should last awhile. Thanks for the exemplary product!", "rating": 5}, {"title": "Very quick turnaround", "text": "Very quick turnaround, product is always consisten", "rating": 5}, {"title": "Does as advertised.", "text": "Date of experience: August 30, 2023", "rating": 5}, {"title": "Always reliable", "text": "Been using this site for years. 100% legit with great service.", "rating": 5}, {"title": "Made it here fast- Very Happy!", "text": "Date of experience: September 15, 2023", "rating": 5}, {"title": "Lift Mode is a phenomenal company!", "text": "Date of experience: September 15, 2023", "rating": 5}, {"title": "Liftmode is fantastic", "text": "Liftmode is fantastic ! Consistant and professional.  I've been using liftmode for a  year now and couldn't be happier with the service they provide.", "rating": 5}, {"title": "Great Customer Service", "text": "Leo was great and look forward to my next order with liftmode because of him!", "rating": 5}, {"title": "Very good product", "text": "Very good product, thank you!", "rating": 5}, {"title": "I have been buying online since before…", "text": "I have been buying online since before 2000 and LiftMode is one of my fav online vendors.  I have been a LiftMode customer for 5 or 6 years and items are exactly as described and of excellent quality.  There is NOTHING I have purchased from LiftMode that I would not hesitate to recommend to anyone.  PERIOD.The ONLY reason that I have used other vendors for similar products is on the off occasion that LiftMode is 'Out of Stock' on a particular item that I cannot wait to purchase.If you are 'vendor shopping', please put LiftMode at the top of your list. There are other vendors of similar items, but the overall experience of availability, price, ease of transaction, and speed of delivery is unmatched with LiftMode.", "rating": 5}, {"title": "Great products and quick shipping and…", "text": "Great products and quick shipping and delivery.", "rating": 5}, {"title": "Great products and Isley quick shipping", "text": "Date of experience: August 15, 2023", "rating": 5}, {"title": "Kanna Elixir Peach Ice Tea", "text": "This was an amazing kanna. It done wonders for my anxiety and my mood all at the same time. This is an excellent product that I will look forward to buying more of in the future!", "rating": 5}, {"title": "Wonderful product and on time.", "text": "Date of experience: August 27, 2023", "rating": 5}, {"title": "Great Quality, Selection & Service.", "text": "Lift Mode has the quality and specific supplements that I use. Price and service are always great!", "rating": 5}, {"title": "Good", "text": "Its nice and effective", "rating": 5}, {"title": "Got what I asked for", "text": "Date of experience: September 05, 2023", "rating": 5}, {"title": "Quality service and products.", "text": "Date of experience: August 25, 2023", "rating": 5}, {"title": "Great customer service and my product…", "text": "Great customer service and my product arrive to me quicker than expected!", "rating": 5}, {"title": "Arrived quickly and exactly what I…", "text": "Arrived quickly and exactly what I ordered. Thank you!", "rating": 5}, {"title": "It would be better if I got a promo", "text": "It would be better if I got a promo! I spend money with you guys every month! I love your product!", "rating": 5}, {"title": "I had trouble signing into my account…", "text": "I had trouble signing into my account and Liftmode help resolve the issue and took my order graciously!", "rating": 5}, {"title": "Great products", "text": "Great products, fast delivery", "rating": 5}, {"title": "Honest to Goodness", "text": "The Good: Every product I’ve ordered has arrived in flawless condition & no later than reasonable ETA. Quality, purity & potency have been beyond obvious for me & - as I’m one for lofty hopes but dismal expectations - placebo effects prove elusive to me.The Bad-A…“Donkey” (Gooder): When I’ve needed guidance from customer service, they were everything of politeness & natural decency.The Ugly (& more Gooder): I’ve had the past misfortune of throwing money at less reputable &/or pricier sources; I’m more than glad I finally stumbled upon this beauty of a treasure chest.", "rating": 5}, {"title": "Fast shipping and delivers the product…", "text": "Fast shipping and delivers the product they advertise which is really all you can want from a company.", "rating": 5}, {"title": "This was my second experience with…", "text": "This was my second experience with liftmode, and both times they blew me away how quicly they got my package to me, I love their selection of products too, alot to choose from for mood health.", "rating": 5}, {"title": "great products", "text": "great products, prices ok, great customer service, always something new at Liftmode!!!!", "rating": 5}, {"title": "Good product- even came with a…", "text": "Good product- even came with a measuring spoon", "rating": 5}, {"title": "Lillie made it great.", "text": "Date of experience: September 07, 2023", "rating": 5}, {"title": "Been a customer of liftmode and newmind…", "text": "Been a customer of liftmode and newmind for at least 5 years and liftmode and they have always had the finest tested supplements I can find online.Thank you Liftmode!", "rating": 5}, {"title": "Amazing company", "text": "Date of experience: September 07, 2023", "rating": 5}, {"title": "It was quick and it was the best price on the internet !", "text": "I got my package really quickly, no issues at all. Was very happy to see they have these oblate pouches back in stock, because they are SO expensive on eBay and Amazon. I need them for taking my kratom, and I will continue to buy them here as long as you have them 🙂 Thank You for prompt service and low prices!", "rating": 5}, {"title": "Fast delivery", "text": "Fast, secure shipping", "rating": 5}, {"title": "Fast convenient service", "text": "Date of experience: September 06, 2023", "rating": 5}, {"title": "Long time customer", "text": "Over the years that I have done business with Liftmode I have, first of all, trusted that I was getting top quality, certified products. In other words, getting what I paid for. The internet hasn’t helped consumer confidence. I may be able to get it from someone else, even get it overnight for ‘free’ but what really am I getting. Some companies, some countries, don’t care about quality control. I like Liftmode.", "rating": 5}, {"title": "Good as always", "text": "Never had a bad experience with liftmode. Good quality products and always delivered quickly", "rating": 5}, {"title": "Fast shipping", "text": "Fast shipping, great quality.", "rating": 5}, {"title": "Fast service", "text": "Great product with very fast service.  Thank you lift mode", "rating": 5}, {"title": "Liftmode provides a quality product…", "text": "Liftmode provides a quality product that’s always available and arrives quickly.  I’ve used other similar sites and do not receive the product nearly as fast if it is even in stock.  Highly recommend.", "rating": 5}, {"title": "Great experience with first order!", "text": "Great experience and first time ordering from LiftMode.  The product came fast with great packaging and flawless delivery!", "rating": 5}, {"title": "Great response and experience", "text": "Date of experience: September 04, 2023", "rating": 5}, {"title": "Been dealing with liftmode for the…", "text": "Been dealing with liftmode for the better part of a decade and I have always been impressed by the quality of the products and the superior customer service. Great job, lads.", "rating": 5}, {"title": "Extraordinary", "text": "Impressive efficiency Fast shipping Quality package", "rating": 5}, {"title": "GRRRRREAT product", "text": "GRRRRREAT product, great price & it arrived SUPER FAST!", "rating": 5}, {"title": "They have surprisingly great customer…", "text": "They have surprisingly great customer service, the guy that helped me was great.", "rating": 5}, {"title": "Great products", "text": "Great products, great selection, far better alternative to NootropicsDepot in my opinion.", "rating": 5}, {"title": "Liftmode is unrivaled!", "text": "As always their products are of the best quality on the market. They are fairly priced and you get a great value for the price.Their shipping department is really great and they always solve any errors there may be quickly and without disappointment.", "rating": 5}, {"title": "Great products and fast shipping.", "text": "Date of experience: September 01, 2023", "rating": 5}, {"title": "Quality stuff", "text": "Date of experience: September 01, 2023", "rating": 5}, {"title": "great customer service", "text": "great customer service , very helpfull/knowledgeable. i will oreder again", "rating": 5}, {"title": "Excellent service/super fast shipping", "text": "Their service is excellent and their shipping super fast.  They also have a large selection of nootropics at very reasonable prices.  I will be using them again.", "rating": 5}, {"title": "Love sample size products!", "text": "Delivery is always quick. I love that you have sample sizes so customers can try out before spending money on a larger size, that is so helpful and time efficient to customers aren't returning product. Thank you", "rating": 5}, {"title": "Great quality products!", "text": "Great quality products! Fantastic customer service! Fast and affordable shipping!", "rating": 5}, {"title": "Liftmode rules", "text": "I received what I ordered. Good job.", "rating": 5}, {"title": "Great service and shipping,", "text": "Date of experience: August 30, 2023", "rating": 5}, {"title": "Great product and fast shipping", "text": "Date of experience: August 30, 2023", "rating": 5}, {"title": "Thanku!", "text": "Very impressed.", "rating": 5}, {"title": "Delivery speed trumped price increases", "text": "The delivery time was actually worth the high cost of the product. I ordered it one day and it came the next, which is totally different than in the past even when I did that like next day or two shipping I still wouldn’t get it until like a week later but this time my item came the very next day after ordering. Wow a first!!", "rating": 5}, {"title": "You can depend on consistent quality from LiftMode.", "text": "I have ordered from Lift-mode several times now and they have delivered high-quality products very quickly.", "rating": 5}, {"title": "Another great liftmode experience", "text": "Shipping time was amazing . I took advantage of the UPS air. Packaging very nice, communication was always quick and fast, and products all great as usual", "rating": 5}, {"title": "I ordered a product from liftmode on a…", "text": "I ordered a product from liftmode on a Wednesday and go on a Friday using its generic cheapest usps service so less than 2 days really.. product is wonderful and amazing and easy website to maneuver.", "rating": 5}, {"title": "Easy to order and arrived quickly", "text": "Date of experience: August 29, 2023", "rating": 5}, {"title": "Fast Shipping", "text": "Honestly the shipping was fast. Everything was as ordered. Seems like they do a good job building their website and branding.", "rating": 5}, {"title": "Excellent service", "text": "Excellent service. Fast shipping", "rating": 5}, {"title": "Fast delivery,good quality", "text": "Fast delivery,good quality. Also good price", "rating": 5}, {"title": "The shipping service is so fast", "text": "The shipping service is so fast. As quick as Amazon, and the product is top notch.", "rating": 5}, {"title": "Liftmode Is just awesome/but", "text": "Liftmode Is just awesome The only issue is the sending.Cost $20 for a  .05 ounce of phenitbut . Come on....but quality is always the same some times it's weaker.", "rating": 5}, {"title": "Great Company", "text": "LiftMode always sells high quality products, thoroughly tested with lab reports, & they ship fast too! Can't go wrong with these guys!", "rating": 5}, {"title": "Liftmode are ALWAYS great", "text": "Liftmode are ALWAYS great.  Excellent range and quality of products and great prices.  Ordering is easy and they are timely in delivery.  I'm a big fan!Stew", "rating": 5}, {"title": "Top notch!!", "text": "Awesome product, Fast Shipping, Thanks Liftmode", "rating": 5}, {"title": "I've been ordering for a few years now", "text": "I've been ordering for a few years now. I have had some issues with my card but the company itself is dependable", "rating": 5}, {"title": "Astounding", "text": "Fast shipping, quality product, probably the best legal substance available for purchase", "rating": 5}, {"title": "Liftmode is great", "text": "Always consistent product and timely delivery at a fair price.", "rating": 5}, {"title": "Problem with delivering from UPS…", "text": "Problem with delivering from UPS delayed I phoned 3 times to clarify they received customs payments received August 29 after 2trysThankyou love product", "rating": 5}, {"title": "Always 👍 service and shipping.", "text": "Date of experience: August 18, 2023", "rating": 5}, {"title": "The quickness of putting an order", "text": "The quickness of putting an order. My info is remembered and it only takes 2 minutes to place an order.", "rating": 5}, {"title": "Amazing Store", "text": "Date of experience: August 17, 2023", "rating": 5}, {"title": "Fast delivery always correct great…", "text": "Fast delivery always correct great customer service", "rating": 5}, {"title": "Excellent customer experience", "text": "Good products and always an excellent customer experience.", "rating": 5}, {"title": "Pure, affordable, reliable etc", "text": "I ordered 200 grams of phenibut before and that lasted almost a year. This order is just as pure as the last. Very affordable as well.", "rating": 5}, {"title": "Easy ordering and fast service", "text": "Date of experience: August 24, 2023", "rating": 5}, {"title": "Best in the business", "text": "Liftmode offers a high quality array of innovative supplements with consistency, fast shipping and top notch customer service for the 4 years I have been a customer.", "rating": 5}, {"title": "Liftmode did a great job expediting my…", "text": "Liftmode did a great job expediting my package. Unfortunately I didn't receive it on time because UPS dropped it off to the wrong address. Not Liftmode's fault, though.", "rating": 5}, {"title": "Just finding the item in powdered form…", "text": "Just finding the item in powdered form instead of another pill!", "rating": 5}, {"title": "I feel that I’m getting trustworthy…", "text": "I feel that I’m getting trustworthy products that work very well at the recommended dosages. It also comes with a sheet that breaks down everything lab wise as well which is useful and informative! And the measuring scoop is always perfect to have as well", "rating": 5}, {"title": "Great friendly team", "text": "Date of experience: August 16, 2023", "rating": 5}, {"title": "Faster than expected", "text": "Date of experience: August 16, 2023", "rating": 5}, {"title": "I like the turmeric because the taste…", "text": "I like the turmeric because the taste is not as harsh as the turmeric powder that I use for cooking.", "rating": 5}, {"title": "Liftmode is awesome", "text": "Great prices , fast delivery and great customer service. All of that built around great products ! Liftmode is a no brainer !", "rating": 5}, {"title": "Quick delivery", "text": "Quick delivery.  Quality product.  Taken at bedtime, my husband says he does not get up at night at all, until it is time to get out of bed in the a.m.", "rating": 5}, {"title": "Great products", "text": "Great products, fast shipping, great customer service.", "rating": 5}, {"title": "Order was shipped super fast", "text": "Order was shipped super fast. Would use this seller again for sure.", "rating": 5}, {"title": "came fast works good", "text": "Date of experience: August 09, 2023", "rating": 5}, {"title": "Liftmode is the GOAT", "text": "Liftmode ships fast and is always consistent and reliable.", "rating": 5}, {"title": "Best place for Phenibut", "text": "10/10. Arrived faster than i expected. a day earlier than the delivery said. came with lab tests which seem to come from the exact powder i had which was cool. Definitely pure like it says.", "rating": 5}, {"title": "Great products and great delivery…", "text": "Great products and great delivery service!", "rating": 5}, {"title": "Good stuff", "text": "Always shipped quickly. High quality supps.", "rating": 5}, {"title": "The item I ordered was exactly as…", "text": "The item I ordered was exactly as described, and I received it really quickly.", "rating": 5}, {"title": "LiftMode is the ONLY place I purchase Phenibut", "text": "LiftMode is the ONLY place I purchase Phenibut (and a few other items). They're always quick to ship my orders. Customer service is excellent. Their Phenibut is always top notch quality!!! I highly recommend this company", "rating": 5}, {"title": "Fast shipping, amazing quality", "text": "Fast shipping, usually (if not always) in stock product. My go-to for quality.", "rating": 5}, {"title": "Always fast service and great products!", "text": "Date of experience: August 18, 2023", "rating": 5}, {"title": "Great Experience", "text": "Easy to order. Shipped quickly. Arrived on time.", "rating": 5}, {"title": "Super fast shipping", "text": "They always ship my vitamin supplements very fast. Like the  same day or the following day I place an order. I always get regular shipping. They have gotten my order correct every time.", "rating": 5}, {"title": "Love These Guys", "text": "Both Lilly and Leo helped me out with my first orders, and I was given a refund when I screwed one of them up. LiftMode is the only company that I trust for quality products, and their service has been amazing", "rating": 5}, {"title": "Great product", "text": "Great product, fast delivery! Will be ordering again. Very soon.", "rating": 5}, {"title": "Reputable company", "text": "Good service good products and prompt delivery. Thorough explanations of uses and effects of products", "rating": 5}, {"title": "The product is pure and I was so…", "text": "The product is pure and I was so surprised that it arrived in two days with regular shipping. I will definitely be back.", "rating": 5}, {"title": "A+++++", "text": "I have been ordering from liftmode for close to 6 years without a single issue. All there products are exactly as stated. Customer service has always been spot on. A++++", "rating": 5}, {"title": "Awesome customer service", "text": "Awesome customer service. Quick delivery. Definitely found a good place with them.", "rating": 5}, {"title": "I ENJOY  THE PRODUCT PHENIBUT", "text": "Date of experience: August 16, 2023", "rating": 5}, {"title": "I've always had a positive experience…", "text": "I've always had a positive experience with Liftmode and I've tried a good variety of their products. There were not all for me but I found a few items that were really effective for me. Their products are quality and shipping has been fast for me. I can recommend them and I've been using them for a couple of years now.", "rating": 5}, {"title": "Worth it.", "text": "I’ve used the 300mg version of the hcl Phenibut and from my experience, its very useful for social anxiety/anxiety as a whole forreal. Ive been usin it for about a 8 months or so at this point on and off, mostly months at a time consistently, and the effects are very noticeable in your day to day. The way I’d describe the feeling in your mind is “comfortably being yourself again” whatever that may be for you. Super quick delivery, very efficient to my apartment too", "rating": 5}, {"title": "Awesome quality supplements for the…", "text": "Awesome quality supplements for the money.  I'm grateful for lift mode.  Good job guys!", "rating": 5}, {"title": "Great company!", "text": "Thank you for still having capsules!", "rating": 5}, {"title": "good price and quick shipping believe i…", "text": "good price and quick shipping believe i ordered on a Saturday or sunday or possible even a Monday and had it by Thursday. Good product as far as i can tell only done one trial run after a multi year hiatus from phenibut but the initial trial seemed to be relaxing.", "rating": 5}, {"title": "Fantastic customer service always", "text": "Date of experience: August 15, 2023", "rating": 5}, {"title": "My order was easy and fast", "text": "My order was easy and fast.  Great experience!", "rating": 5}, {"title": "Outstanding service", "text": "Outstanding service. Unfortunately something went wrong with my first order and the package was lost. The lift mode customer service did everything they could and got in contact with the delivery company multiple times and went out of their way to keep me updates as well. When they found out the package would not be found again they gave me a refund. It is very much appreciated.", "rating": 5}, {"title": "Super fast service", "text": "Super fast service. Always on top of their orders. I'm consistently impressed with their service.", "rating": 5}, {"title": "Everything was perfectly smooth", "text": "Everything was perfectly smooth, got here quickly and product was great!", "rating": 5}, {"title": "Excellent product", "text": "Excellent product. Outstanding quality. Reliable delivery.", "rating": 5}, {"title": "The purity was first-rate", "text": "My product came 5x faster than i expected. The documentation on the purity was first-rate.  i would definitely recommend this company.  Also, i will continue to purchase more supplements from them in the very near future.  I am a very satisfied customer!", "rating": 5}, {"title": "Top Shelf/3 thumbs up!", "text": "Always professional...they run their Company like a well oiled machine. Great prices & Customer Service is way up there...impressive.", "rating": 5}, {"title": "Product is great.", "text": "Date of experience: July 27, 2023", "rating": 5}, {"title": "you guys are great", "text": "you guys are great! everything is always prompt and great quality!", "rating": 5}, {"title": "The best", "text": "Always quality and always on time", "rating": 5}, {"title": "Awesome products", "text": "Awesome products ! Amazing customer service . 10 out of 10", "rating": 5}, {"title": "Best Kanna Extract on the market", "text": "Liftmode has the most consistently good products. The alkaloid percent and strength has been higher than stated which is great because ethier you will get the 5% total alkaloids and 3% mesembrine or it will be higher and with Liftmode it is almost always higher which is why I always come back to liftmode for the 5 gram containers which is the best bang for your buck.", "rating": 5}, {"title": "Wonderful product", "text": "Wonderful product, highly recommend. Just take responsibly.", "rating": 5}, {"title": "Get a call from the mailing department…", "text": "Get a call from the mailing department and they double checked my address which was great because I wrote down my address wrong. But they fixed it really quick and they got my order in the mail fast . Thanks 🙏 Alaska", "rating": 5}]