[{"title": "I accidentally ordered the wrong…", "text": "I accidentally ordered the wrong sectional online and called customer service in a panic. Izamar answered my call and immediately put me at ease. She helped me get my order fixed to the couch I actually wanted and then when I had more questions about billing she said she would call me back after she found the answer so I wouldn’t have to hold so long. She called me back very promptly and had all the answers to my inquiries. She was extremely helpful, positive, and polite. I am forever grateful for her service and kindness. ", "rating": 5}, {"title": "Thank you Alexis and Delivery Drivers !!", "text": "Alexis, Thank You Thank You Thank You !!! We love our new furniture, first time buying online, especially a big order, she was able to manage our order in a timely matter, very responsive and gave us peace of mind, our deliver driver was also very kind and very fast to set up our furniture, highly recommend! 10/10 service and attention to detail, rapid services and HIGH QUALITY. You deserve a raise and also kudos to both delivery drivers for the amazing hospitality. God bless", "rating": 5}, {"title": "Shipping / Scheduling ", "text": "So far, this has been the best experience I’ve ever had with online ordering of home goods. I am ordering furniture from a different state to where I need this shipped and the team especially Alexis has been over the top helpful with all the planning and shipping so far. Thank you!! They send pictures of all your furniture before it even ships!!! Just another bonus of knowing your product will be delivered with no issues. Will update once my order ships!! ", "rating": 5}, {"title": "Best place for a shopping experience", "text": "I had to furnish an entire 2 bedroom apartment and was tired of driving around looking at furniture. I gave Sam my budget and her and Julie spent time designing a perfect package for my apartment right at my budget.They both were extremely friendly, willing to accept the challenge I set out in front of them, and delivered products beyond my expectations! I highly recommend visiting this store to anyone who is looking for quality furniture, very helpful and friendly people and don’t push you into something you don’t want. I will definitely shop here again if I need anything else in the future.", "rating": 5}, {"title": "Amazing customer service", "text": "Amazing customer service! I’ve been in several locations and they are all the same. I’ve shopped here several times and the pieces that I have purchased are high-quality and very well-made. My husband and I are extremely happy with our purchases. I will continue to shop here in the future.", "rating": 5}, {"title": "Ethan helped us a year ago was…", "text": "Ethan helped us a year ago was fantastic. As a business owner, he is exactly what an employer wants in their team. Came into the store tonight and he was still there and this made me very happy! He gets 2 thumbs up from me. ", "rating": 5}, {"title": "Amazing Experience ", "text": "Warm welcoming when we arrived. I actually enjoyed the store not being overcrowded and appreciate them having an area where the kids can wait and enjoy treats while we shopped. Personnel was amazing and attentive. Will definitely be back for additional shopping.", "rating": 5}, {"title": "Excellent products backed by great team", "text": "I had an interaction with Tayla and her manager Shah . I was deeply impressed by their professional approach and customer service focus. My wife and I just came to visit the show room but now thank to both, we  purchased furniture from them ditching our prevoius plans. Great employees. ", "rating": 5}, {"title": "Came in to do a return", "text": "Came in to do a return. I was not questioned much about it and got my refund. Zero hassle involved. I ended up buying a piece of furniture and as always, was very well taken care of. They are always friendly and helpful but never push and do not appear to be desperate to make a sale.", "rating": 5}, {"title": "No salesperson follows you around", "text": "No salesperson follows you around, breathing down your neck for a sale. Super helpful and courteous. I have bought several items from here and will be a forever customer.", "rating": 5}, {"title": "One seat sinks more when seated on it and the back of the other seat is loose. ", "text": "Home Zone called me back in less than 48hrs from the time I sent the email inquiring about my sofas. The lady who called me was very courteous and explained the process to follow. I am very pleased with the prompt response to this matter. ", "rating": 5}, {"title": "Awesome Furniture Store", "text": "Evan, the sales person, was courteous, respectful, ready and available to answer our questions, and if he didn't know something he was quick to ask the manager. He was not pushy and he gave us the space and time to see what we wanted to see. He was also very receptive to our requirements. We went back to add more furniture to our oder and the manager was superb in helping us with that. The best thing, we like, is that this is a family owned business and everything is made locally in Texas!", "rating": 5}, {"title": "Customer service rep, Lee, was excellent!", "text": "Customer service was excellent. Lee, at Home Zone in Waco, Tx, was awesome. He handled every question we had without making us feel pressured. He gave us space, but was also available to help us find the best option for what we needed. The experience, from walking in the door to signing for the purchase, was the best experience I've had buying furniture, hands down! This was my first time shopping at Home Zone, but it will be my \"go to\" from now on! Thank you, Lee and Home Zone Waco, Tx. for making our shopping experience and purchase so enjoyable!", "rating": 5}, {"title": "Candace and Sergio went above and…", "text": "Candace and Sergio went above and beyond to help us! I have never felt so at home when purchasing with y'all! The delivery was available right away and when they came they were quick and so helpful! We weren't sure how to remove the leaf from our new table and they were happy to show us! ", "rating": 5}, {"title": "Great Shopping Experience", "text": "I hate hate hate to be followed around and hounded and it didn't happen at Home Zone.  This was by far the best experience because Julie told us from the get go that they don't do that.  She let us look around and when we were ready we came back to her and she helped us with all of our questions.  So different from box stores!  I love the fact that the furniture is made in Dallas.  Truly great experience.  I can't wait to get my furniture and hope we get the same experience there as well.", "rating": 5}, {"title": "First time to visit Home Zone", "text": "First time to visit Home Zone. Pleased with immediate introduction and allowed to go through showroom without assistance. Purchase was easily made. When we got home, we decided to also to purchase the love seat. Handled seamlessly over phone. Delivery as promised. ", "rating": 5}, {"title": "Shopping without pressure- ask for Alex", "text": "Alex F was so helpful without following me around the whole time.when I was ready He listened to what I was looking for and helped me find exactly what I wanted and more. I went in for a couch and come out with a sectional,ottoman,recliner and a free dog bed! Prices were amazing and the quality seems really good. I highly recommend this store and ask for Alex!", "rating": 5}, {"title": "Patti was so helpful", "text": "Patti was so helpful. She provided the samples and information we needed and answered all of our questions. Made the experience very comfortable and enjoyable.", "rating": 5}, {"title": "Jeff was our sales person at the Allen…", "text": "Jeff was our sales person at the Allen location.Our experience was great.  Jeff helped us fine exactly what we were looking for.  Ken H. ", "rating": 5}, {"title": "Best furniture purchase experience. ", "text": "Jeff was really helpful, and not pushy at all. We were able to come through the store at our pace and the games available were awesome for our child in tow. I really like how the furniture is Texas made and Jeff answered all our questions and got us out of there quickly. This was the best furniture purchase experience I have ever had and will be returning for all future needs. ", "rating": 5}, {"title": "I had a great experience", "text": "I had a great experience, Triston greeted me immediately and helped me order this coffee table I been wanting for a long time. I would give this company a 10/10. Thanks for everything!", "rating": 5}, {"title": "Came in to look around", "text": "Came in to look around, Elij helped us get a table. He was awesome and i'll 100% be coming back. Non-pushy, informative sales tactics get the business.", "rating": 5}, {"title": "We came in looking for a couch and a…", "text": "We came in looking for a couch and a table. And Candace was AMAZING! She listened and knew her store. She showed us multiple options but all things we were looking for. She went put of her way to help us find what we truly wanted! Sergio was a great help too ensuring we got everything delivered quickly and it was just a very good experience! 10 out of 10!!! ", "rating": 5}, {"title": "What a great buying experience", "text": "What a great buying experience!  Pedro took his time with us and showed us all of our options to make the right decision for us.  No pressure, beautiful store, and wonderful Manager Jessica.  We love Home Zone!", "rating": 5}, {"title": "Anthony and his entire staff were very…", "text": "Anthony and his entire staff were very helpful and knowledgeable. I had never been to a home zone before and your first visit always counts and they exceeded my expectations. ", "rating": 5}, {"title": "Maria is your sales person ", "text": "Maria is such an amazing kind person, this is my second time buying furniture and I always ask for her, she is great!!! ", "rating": 5}, {"title": "Like family!", "text": "Andrea and Jennifer were so helpful with our visits at Home Zone. Including the manager which I cant remember his name right now. They greet you and offer help as soon as you walk into the door. Very informative about sales among other details. So happy with our purchase and we will definitely continue to purchase furniture here. ", "rating": 5}, {"title": "Unfortunately there was an issue with…", "text": "Unfortunately there was an issue with the ordering of the correct sofa but once it was discovered, salesman Justin was able to straighten out the situation with the correct one, it did delay the delivery but only for one day. The sofa itself is comfy and the power recliners are quiet. The only regret I have is it was purchased on a Saturday, delivered on Wednesday but on Tuesday Home Zone started their commercial offering to give away a dog bed with every purchase, considering the mixup I dealt with you would think it would be good customer service and relations if that would have been offered at time of resolution of mixup.", "rating": 5}, {"title": "I accidentally order Queen instead of…", "text": "I accidentally order Queen instead of King online and they were able to help adjust the order for me. Thank you.", "rating": 5}, {"title": "Everything was easy", "text": "Everything was easy. I placed an order then canceled it to order different furniture. It was easy. Delivery was easy. Furniture is high quality. ", "rating": 5}, {"title": "Greeted by Daisy as soon as we walked…", "text": "Greeted by Daisy as soon as we walked through door. Welcomed us but did not follow around hounding . We found an item we liked and she immediately took care of us . Applied for credit . Immediately approved . Delivery scheduled  within a few days . Best experience ever", "rating": 5}, {"title": "The start was very well laid out", "text": "The start was very well laid out, the sales person was very knowledgeable. He gave me my space to walk around, asked any questions that I had. There was no pressure we were offered water, coffee, or hot chocolate, and anything better than that I would recommend Home zone to all my friends. recommends Home zone to all my friends. I was also very impressed with the construction of the furniture and that it was made here in Dallas", "rating": 5}, {"title": "Andrea was attentive to our needs", "text": "Andrea was attentive to our needs, answered all of our questions, and helped us to resolve a prior issue we had with a months-old order, with the help of her manager.", "rating": 5}, {"title": "Natalie was so helpful", "text": "Natalie was so helpful. I appreciate that they are not on commission as well. ", "rating": 5}, {"title": "Spectacular Customer Service", "text": "Today was my very first visit to a Home Zone, and I was treated with the utmost courtesy from the moment I entered the store until the moment I finalized my purchase and made it to my vehicle. I was looking to decorate my entryway. I not only received assistance from the sales associate, but the interior decorator was there and assisted me in making the tough decision of decorating. Thank you so much for taking the time to help me find what works for my home. The sales associate even walked me to my car and helped load my purchases. I look forward to doing business there again.", "rating": 5}, {"title": "I love shopping Home Zone", "text": "I love shopping Home Zone.  From their helpful yet no pressure in store experience to their friendly and professional delivery & assembly team, it's a pleasant experience. And everything I've bought their has been great!", "rating": 5}, {"title": "Excellent Sales lady in Teresa", "text": "Excellent Sales lady in Teresa, very knowledgeable and helpful. Answered all our questions, addressed our concerns and is people friendly.", "rating": 5}, {"title": "Tristan was amazing", "text": "Tristan was amazing! He was so helpful with all of our inquiries and decisions and changes to our decisions. He was calm and a walking calculator, as we contemplated our options. We purchased about $8,000 worth of furniture and he maintained the sweetest and most helpful demeanor. You are a lucky company to have him as your sales representative. ", "rating": 5}, {"title": "Gabbi made our experience great", "text": "Gabbi made our experience great! Having such good staff makes all the difference in the world. She greeted us at the door and assisted with every step, she made the entire process easy from start to finish. ", "rating": 5}, {"title": "Great service at Denton, TX location", "text": "Excellent service representatives. Very patient and helpful. Greet you at the door but aren’t pushy at all. We ordered a beautiful power sectional leather couch and an ottoman. Items have not been delivered yet, but the customer service has been wonderful so far. Prices seem very reasonable. ", "rating": 5}, {"title": "Personal & professional", "text": "I gave my comments but I was told how to write my review. This is an unfortunate request.", "rating": 5}, {"title": "Satisfied customer", "text": "I buy all my furniture from Homezone in Lawton Oklahoma, the products are quality made, reasonably priced, the staff are very friendly, and helpful. The delivery personnel are fast and professional. I have never had a bad experience in the 10yrs I have shopped with them.", "rating": 5}, {"title": "Second time Purchase", "text": "This is the second time purchasing from Home Zone and their no-hassle simple approach is the reason we returned for the second time. Great prices and great people. Definitely recommend!! ", "rating": 5}, {"title": "Awesome!", "text": "We had the absolute best experience here with Andrea. She made the process of purchasing our new couch so easy and fast! She was super friendly and so knowledgeable. This store is lovely and has a large selection with UNBEATABLE prices!", "rating": 5}, {"title": "Teresa was a great salesperson", "text": "Teresa was a great salesperson. She showed us everything they had with the features we were looking for. She allowed us to browse and get a feel for what we wanted. When we were ready she helped us hone down on what we wanted. I have pets, teenagers, and elderly parents and I needed something the dogs would not tear up and my dad would be able to get up out of. She even helped us with a couch for our German Shepherd, which was one of the main reasons our old couch was tearing up. With the couches, warranty, and delivery the cost was well under what I had expected. My couches were delivered today and the AI app to help track when my delivery would be here worked just as expected. The gentlemen were courteous, fast, and efficient at setting everything up and bouncing on out. Definitely recommend and with their warehouse in Midlothian it makes everything nice and convenient.", "rating": 5}, {"title": "Marshall M", "text": "Marshall M. At the Arlington location was great. He was very knowledgeable and helpful. None of the pushy salesman attitude that you may find in other places. The prices are reasonable, selection is great, the ability to pick your fabric is a huge plus, the good proof option is better than other stores. Overall, very pleased can't wait to get our sofas. ", "rating": 5}, {"title": "I was able to coordinate the delivery…", "text": "I was able to coordinate the delivery with our needs. Everything came in looking wonderful. The delivery was swift and everything looks great!", "rating": 5}, {"title": "Great service in the store", "text": "Great service in the store. Very nice not to have someone following me around the store while I was shopping. And the delivery was great they informed me exactly what time they would arrive and they were right on time.", "rating": 5}, {"title": "Rocky was great", "text": "Rocky was great, and I am loving my new couches. The whole experience was great. My dog is still trying to get used to his couch. Its a process. ", "rating": 5}, {"title": "Online Clearance furniture ", "text": "I first looked online for furniture for my 87 year old mother, then went to the store in Round Rock to check out the quality. Everything was very well made. Ordered online and it was delivered today. Everything was in great condition and it was all put together in a very short amount of time. Great customer service!", "rating": 5}, {"title": "Texas made furniture and great staff", "text": "I love the fact that the furniture is made in Texas. Staff was very nice and the product is great. We went to 7 furniture stores before Home Zone. We walked into Home Zone and found our perfect couch within 5 minutes.", "rating": 5}, {"title": "The sales lady did a very good job in…", "text": "The sales lady did a very good job in explaining all the questions we had regarding our purchase.", "rating": 5}, {"title": "Home Zone is the winner …", "text": "After much comparison shopping for bedroom furniture, Home Zone is definitely the winner with quality and price! This furniture is a good value for sure. Payton, at the Denton store was so helpful and answered every question we had and confirmed to make sure the answers were accurate. We will continue to shop with Home Zone in the future.", "rating": 5}, {"title": "Casey and Her Team.", "text": "Casey and her team always helps us even when we just wonder in looking around. They are helpful but always gives us space to just look around  without being badgered about buying something right now. That allows us to just shop, look, think about what we may want and ask questions when we have them. ", "rating": 5}, {"title": "Great prices and great furniture!", "text": "Great prices and great furniture! No high pressure sales and the purchase was very efficient! I had my sleeper sofa 2 days after I bought it! I will be back❤️", "rating": 5}, {"title": "Top notch service", "text": "Dornella was very hospitable, accommodating and knowledgeable with absolutely no pressure.  All my questions and concerns were answered resulting in a stress-free buying experience.  Fast delivery, 2 days...purchased on Monday to be delivered on Wednesday.  Looking forward to our new Denver sofa, chair and ottoman.Would definitely drive out of my way again for any future purchases! ", "rating": 5}, {"title": "Great Service", "text": "Jessica, Pedro, LH and Sean were very professional,  polite,  patient and helpful.  I've purchase from here before.  It's always a great experience.  They offered water and/or ice cream which is a nice touch.  Also, they don't pressure you either. I definitely refer family and friends.  My sister just made a purchase as well. ", "rating": 5}, {"title": "From start to finish ", "text": "The whole process was seamless. From ordering online and communication with the company to the delivery and set up, everything went according to plan and I have a beautiful new  extremely comfortable leather loveseat. Everyone was friendly, fast and efficient.", "rating": 5}, {"title": "Our sales guy Amado was very helpful…", "text": "Our sales guy Amado was very helpful and could answer all of our questions.Product selection was good and price great. We loved Made in Texas.", "rating": 5}, {"title": "When I came into the store I was…", "text": "When I came into the store I was greeted by a cheerful girl. I told her I was just looking. She showed me where the sale items were and she came back and checked on me numerous times. The store has a lot of really beautifully decorated areas and I had fun just looking around. I found a rug I liked and they cleared an area where they could roll it out so I could see the whole thing. All associates were very kind and helpful. Wonderful customer service. ", "rating": 5}, {"title": "Customer Service ", "text": "All the employees had great customer service!As soon as you enter the store the associates come and greet you offering you a beverage, etc. The delivery drivers were on time, nice and very helpful.  The company was on top of everything as far as your delivery appointment and making sure you know exactly when it will be and when the drivers will arrive.", "rating": 5}, {"title": "Thomas was very helpful and knowledgeable", "text": "Thomas was very helpful without being pushy.  We needed a dining table of a specific size and style and he took us to three possibilities without wasting time trying to show us something we could not use.  He knew his products and offered options for chairs.   ", "rating": 5}, {"title": "Susie was awesome", "text": "Susie was awesome! Helped get us purchase a couch at a great price. Great customer service!", "rating": 5}, {"title": "Very accommodating", "text": "Very accommodating. informative and pleasant sales person.  The front desk lady was very helpful and kind. The Delivery guys were superb, quick and done!My new bed is just what I wanted.  So glad I went to our neighborhood store HOME ZONE to shop.  ", "rating": 5}, {"title": "First time at Home Zone", "text": "First time at Home Zone, and it was a great experience.  The sales team does NOT follow you around.  They are there for questions and explained the various options with fabrics and cushions.  Purchased a recliner and will go back when I need new furniture.  That team was so friendly and courteous.  ", "rating": 5}, {"title": "Who offers water and/or ice cream when…", "text": "Who offers water and/or ice cream when you walk in the door?  Home Zone, that’s who!  Customer service is amazing!  The store is clean and well organized.  What more could you ask for?  Hmm 🤨 ", "rating": 5}, {"title": "Wonderful customer service", "text": "Wonderful customer service, they remember me from previous sale. Friendly staff and knowledgeable. I feel they are honestly trying to help me get the best value. I am repeating customer:)", "rating": 5}, {"title": "I loved being able to track the…", "text": "I loved being able to track the delivery truck! The guys were professional, efficient and cleaned up right away. It took them no time to set up and leave. ", "rating": 5}, {"title": "Aleck and Nelson were great", "text": "Aleck and Nelson were great.   Very professional and courteous", "rating": 5}, {"title": "Gizelle was great", "text": "Gizelle was great! This is our second time at this location and both times she was AMAZING!", "rating": 5}, {"title": "Will be a repeat customer", "text": "Great customer service, no pressure to buy, offered multiple solutions to our unique layout.", "rating": 5}, {"title": "Home Zone in Richardson", "text": "Great experience.  - Easy to do business with.  Home Zone in Richardson did exactly what they said they would.  I love my new lounger.", "rating": 5}, {"title": "Marshall made my experience a very…", "text": "Marshall made my experience a very pleasant experience.  He's very happy and very knowledgeable! He had patience and I definitely appreciate him for that! ", "rating": 5}, {"title": "Was attended immediately upon entering…", "text": "Was attended immediately upon entering store. Didn’t feel rushed or have anything pushed on me to purchase. Have purchased all our home furnishings at Home Zone in Abilene. Very satisfied with service and would highly recommend them to anyone looking to furnish their home. ", "rating": 5}, {"title": "Great service always so welcoming and…", "text": "Great service always so welcoming and informative about any furniture that you are looking for the delivery was super great fast and delivered respectful with the property I recommend homezone 100%", "rating": 5}, {"title": "Exceptional customer service", "text": "My wife and I bought new Bedroom suit, but when it was delivered No night stands! When we called the store they informed us they where on back order and they would not be back in stock til Mid December. WHAT!! Family coming in for thanksgiving !!. The lady store manager was not very helpful at all. She said the salesman told my wife it was on back order. Which was not true my wife  said why would I buy a new 2500.00 bedroom suit with no night stands. So I called customer service and spoke with Alondra  Wow! She was so helpful, and so kind and our issue was resolved. What a great company and so fortunate to have a great employee like Alondra. If we just had more people like her these days. HZ now has loyal customers from now on  So guess where we are going to purchase our new living room suit. HZ", "rating": 5}, {"title": "Above and Beyond!!", "text": "I had a wonderful experience buying a gray modular sectional couch at Home Zone! Xavier, the manager, and Andrea were incredibly helpful and patient throughout the entire process. They took the time to make sure we found exactly what we wanted and guided us with such care. Xavier made the experience fun by challenging us to a basketball game to determine a specific price. Once my beautiful wife won and we received the discount, we needed to arrange for a pickup. The couch we chose wasn’t available for delivery because it was on sale. They went above and beyond to make it a smooth experience, offering helpful advice and being so kind along the way. Xavier specifically went above and beyond to help us get the couch home!! ((He is pictured helping load up the couch!)) After a few days we did get the couch home. The couch is perfect, comfortable, and we absolutely love it! Thank you, Xavier and Andrea, for the fantastic service! Highly recommend this store for anyone looking for quality furniture and excellent customer service.", "rating": 5}, {"title": "Top Tier Service! ", "text": "I have purchased a few items from this location and every time I walk in I am greeted and treated so well. The customer service and the sales floor team are top tier! Never pushy and let you be. The free ice cream is always a plus too. Every item I have purchased is really good quality. I will definitely keep going back. ", "rating": 5}, {"title": "Have purchased furniture at the…", "text": "Have purchased furniture at the Burleson store in the past and bought the warranty which we did not use. So went back in and was able to use our warranty cash for something else we wanted! Still enjoying furniture. The associates were helpful and professional. ", "rating": 5}, {"title": "The employees were so helpful and kind", "text": "The employees were so helpful and kind.  We mainly worked with Tristan and he was just remarkable.  He went over and beyond to make sure we were purchasing things that we really liked.  He was very helpful and my husband and I will definitely purchase more furniture because of how well we were treated at the Allen, TX location.", "rating": 5}, {"title": "Aaron has extensive knowledge in…", "text": "Aaron has extensive knowledge in assessing customer needs.  He actually researches before coming back with a pat answer.  I've had the pleasure to need his assistance several times.  Results were exceptional.", "rating": 5}, {"title": "Great Customer Service!", "text": "I made several trips to Home Zone to look and sit on furniture, and not once was I pressured by any salespeople.  I was welcomed each time.  Once I made my final decision, I was given all the information I needed.  Upon receiving my new furniture, I encountered a defective sofa.  The delivery men were courteous and took the sofa back without hesitation.  I was contacted that same day by Home Zone and they committed to a new delivery date.  I received my new sofa within the week!  I am very pleased with the customer service I received.  Every contact I had with Home Zone was friendly and courteous.  Not once did I feel disappointed or doubted that they would follow-thru. Thanks for a great experience, Home Zone!   ", "rating": 5}, {"title": "Tristan did a wonderful job showing me…", "text": "Tristan did a wonderful job showing me what choices I had with the information I provided with no pressure to purchase. I like that I am buying local.", "rating": 5}, {"title": "As always the case at Home Zone is a no…", "text": "As always the case at Home Zone is a no pressure environment. Matthew was very helpful and a pleasure to work with. ", "rating": 5}, {"title": "Great Customer Service ", "text": "My experience was great at this store. All of the associates were helpful, friendly and knowledgeable. One of the best in the Texas. The furniture is high-quality. I highly recommend! ", "rating": 5}, {"title": "5 stars! Great company! ", "text": "So glad I choose Home Zone to buy my mattress and my chair from! I have never had a company stand behind their products like they have. The warranty they have can’t be beat!  I plan to always buy from them. ", "rating": 5}, {"title": "Very good experience!", "text": "Very good experience!! We had a very good experience. Everything was an easy process. ", "rating": 5}, {"title": "Best place around to buy furniture", "text": "I love buying my furniture there. I’ve never had a bad experience yet. The prices are excellent and my furniture has been great! There’s no pressure from the sales associates. I asked lots of questions and they answered all of them. I highly recommend. ", "rating": 5}, {"title": "Excellent service ", "text": "Salesman was very friendly and very professional. We enjoyed our interaction with her. Great furniture selection. ", "rating": 5}, {"title": "The experience was great", "text": "The experience was great. We were greeted by a knowledgeable sales rep who helped us make our selection. He ordered exactly what we wanted and was very professional ", "rating": 5}, {"title": "5 Star Experience", "text": "Dawn and Sylvie were both amazing. They helped us find furniture that we love and answers all of our million questions. My wife and I visited twice and would gladly recommend HomeZone to our friends based on our experience. Thank you we are so excited for the furniture to arrive at our new home!", "rating": 5}, {"title": "Great customer service", "text": "We received great service from Mimi!  She explained the process and all of our choices.   We look forward to receiving our new sofa.", "rating": 5}, {"title": "Great customer service", "text": "Home Zone, thanks again for making our experience GREAT!! Every person in the San Angelo store goes above and beyond. The sales associate who helped us and remembered us was a plus.", "rating": 5}, {"title": "Elite greeted us and asked what we were…", "text": "Elite greeted us and asked what we were looking for.     He gave us the time to look around on our own but came over to answer our questions in a timely manner.   He wrapped the chair in plastic and assisted in getting it in the SUV.     You have a great employee!   And he’s a Lions fan too.     ", "rating": 5}, {"title": "Great place", "text": "Loved the no pressure and great selection. Sales lady Amanda, was an absolute pleasure. Will definitely shop and recommend Home Zone. ", "rating": 5}, {"title": "Outstanding product and service", "text": "Outstanding product and service. Delivery on schedule and handed with great care.", "rating": 5}, {"title": "Daisy was fantastic", "text": "Daisy was fantastic, it took us several visits to decide which items we wanted, and she was always fantastic each time we came in the store.", "rating": 5}, {"title": "Great experience all the way ", "text": "From the time of purchase to delivery, everything was perfect. Super people to work with. ", "rating": 5}, {"title": "Felix was wonderful", "text": "Felix was wonderful - following him on the map was convenient so I knew where he was and it was an easy fix! He knew exactly what to check first. Super kind and professional man. Thank you!", "rating": 5}, {"title": "Great Delivery!", "text": "Our delivery was on time, quick and easy. The furniture delivered had no issues and we were given ample notification for where they were and when they would be arriving. ", "rating": 5}, {"title": "Very friendly manager and staff", "text": "Very friendly manager and staff, excellent service. Highly recommend.", "rating": 5}, {"title": "Great customer service", "text": "Great customer service, they don't follow you around.  The quality has been wonderful. We have purchased several items for our home.", "rating": 5}, {"title": "Where Do I even Begin!!", "text": "I had started my furniture shopping almost a month ago and couldn’t really find the elegant and classy look I was going for until my mom remembered “Home Zone” after needing to run a quick errand. I found EVERY piece to my complete home after the help of Mr. Vernon aka Big Vern. He was patient, welcoming, and inviting in helping someone such as myself who is new to furniture shopping finding the best pieces of my visualization board come all into fruition. Mr. Vernon definitely deserves a raise from not just his hospitality but his knowledgeability and adaptability in knowing what he is talking about and being patient with me. One thing you get a lot when going into furniture stores is the peer pressure of having to buy on the spot but what Mr. Vernon said that I remember is that “this is your place you will be living in, so make sure you are comfortable and it’s want you like/want.” Those words right there was enough reassurance for me in knowing I had the right specialist guiding me not only in my search but what turned out to be one of my 1st big girl purchases. Definitely will continue to shop here and request for Mr. Vernon every time.", "rating": 5}, {"title": "No pressure when shopping for…", "text": "No pressure when shopping for furniture.  Delivery was timely and the men that delivered and set the furniture up were careful and professional.  Furniture is beautiful and I am very pleased ", "rating": 5}, {"title": "When my husband and I first walked in", "text": "When my husband and I first walked in. Tayla came over and greeted us and welcomed us to the store. Tayla asked us what we were looking for. We told her that we were interested in Dining Room tables. About 5-10 minutes later, Laura ( the Manager), came over and introduced herself and asked if we needed any help. We told her what we were looking for and she was of great help as well. We also asked Laura if we could just by the table without the chairs. And, Laura said we could because that was all we needed. With Laura’s help, we found a dining room table that both my husband and I liked. And, both Laura and Tayla helped us make the purchase and told us about the delivery service that you (as a company) have. That was very helpful as well. Both Tayla and Laura were very helpful and made our visit and purchase extremely pleasant. Thank you very much for a wonderful experience. Thank you, Teri Sager", "rating": 5}, {"title": "Tim was awesome he help us pick out the…", "text": "Tim was awesome he help us pick out the best bedroom set..and chair, he really knows how to work with people...He was great.He was out of the ft worth store in Lake worth...76108", "rating": 5}, {"title": "Cody is great ", "text": "Cody was very helpful in helping me find the correct dining room set for my space. He then also helped my sons find  living room furniture. He was very friendly and nice. Thank you Cody ", "rating": 5}, {"title": "Easy experience!", "text": "Walked in and I was greeted…left alone to walk around with no pressure to buy. Once I made a decision I was helped to make the purchase and arrange delivery. ", "rating": 5}, {"title": "The associates were polite and helpful…", "text": "The associates were polite and helpful but not pushy.  ", "rating": 5}, {"title": "This experience was the best my sales…", "text": "This experience was the best my sales lady was very helpful and knowledgeable of her store products and spoke really well to me and my family to help us pick the right furniture for us. ", "rating": 5}, {"title": "Everyone was so friendly and helpful", "text": "Date of experience: November 07, 2024", "rating": 5}, {"title": "Helpful, Friendly, and great quality furniture.", "text": "Date of experience: October 29, 2024", "rating": 5}, {"title": "Hey the guys were very professional setting everything up, they did very good job in putting everything together I will be back to buy more thank you very much. ", "text": "Hey I was happy with the professional service and setting everything up, they did a wonderful job I see you all again. ", "rating": 5}, {"title": "Vernon was very great..", "text": "Vernon was very great... let me say its not hisfault  you do not deliver was the only thing", "rating": 5}, {"title": "Harmony was great and very helpful", "text": "Date of experience: November 07, 2024", "rating": 5}, {"title": "Alex made our visit for a new mattress…", "text": "Alex made our visit for a new mattress seamless! Can’t wait to sleep comfortably again:)", "rating": 5}, {"title": "Love our couch", "text": "Love our couch, our salesman was great. He offered help, but didn’t bother us, and the delivery guys were very nice. I also loved the delivery updates.", "rating": 5}, {"title": "Quality products and honest service. ", "text": "We got truthful answers to all our questions. No sales pressure. Great customer service, with quality products. ", "rating": 5}, {"title": "We found exactly what we needed", "text": "We found exactly what we needed. The staff at Home Zone/Marble Falls is great! Very helpful without being pushy. ", "rating": 5}, {"title": "Bree was very helpful and patient", "text": "Bree was very helpful and patient. Really appreciate her help.", "rating": 5}, {"title": "Easy purchase", "text": "What made my experience great was that I already reviewed the item I wanted online, therefore when I went into the store all I had to do was make sure the item was what I looked at online and pay for it. ", "rating": 5}, {"title": "Jennifer Diaz is an amazing associate!", "text": "We were treated by Jennifer Diaz who stayed with us and answered all our mattresses questions! She was amazing- my daughter and I both bought!", "rating": 5}, {"title": "Very professional", "text": "The service attitude is very good. They will make personalized recommendations based on the guests' needs. Very efficient and professional.", "rating": 5}, {"title": "Great Quality & Experience", "text": "We love our new furniture. Great quality and all around experience from the store personnel to the delivery guys. ", "rating": 5}, {"title": "Kaci was awesome", "text": "Kaci was awesome. Very helpful, not pushy. Very knowledgeable and patient. I will ask for her next time.", "rating": 5}, {"title": "Home Zone went above and beyond to…", "text": "Home Zone went above and beyond to stand behind a loveseat we purchased.  Customer service was excellent!", "rating": 5}, {"title": "Quick", "text": "Quick, easy and delivery will be soon.  Salesman was helpful and knowledgeable.", "rating": 5}, {"title": "Ashley was so helpful", "text": "Ashley was so helpfull and very knowledgeable.  When we go to HZ we will be sure to ask for her for assistance.  ", "rating": 5}, {"title": "Process was easy and we got exactly…", "text": "Process was easy and we got exactly what we wanted.", "rating": 5}, {"title": "Logan did a great job ..", "text": "Logan did a great job ... made sure I felt welcome!", "rating": 5}, {"title": "Efficient and knowledgeable", "text": "Nicole was knowledgeable, helpful and efficient.  She took care of every detail of my purchase. ", "rating": 5}, {"title": "Great service", "text": "Friendly helpful ", "rating": 5}, {"title": "Loved the quality of the furniture", "text": "Loved the quality of the furniture. Brittney was great with us!", "rating": 5}, {"title": "I have been looking for a smaller chair…", "text": "I have been looking for a smaller chair for my living room for quite a while - looking at both used and new.  I was very pleased to see the chair I have ordered on Home Zone website and it was a great price.  I really like the style.", "rating": 5}, {"title": "Logan was very helpful", "text": "Logan was very helpful, he was the best!", "rating": 5}, {"title": "Best customer service", "text": "Best customer service! So polite, and helpful! Give this girl a raise!", "rating": 5}, {"title": "Great service lovely furniture  ", "text": "Great service lovely furniture  Went to but sofa love seat reclinersand also bought new bedroom set", "rating": 5}, {"title": "Daniel was by my side all the way", "text": "Daniel was by my side all the way. He gave me honest advice.. I really appreciate him .. 👏🏾", "rating": 5}, {"title": "Very clear", "text": "Very clear, thorough, friendly, nice, professional and very patient! She gave us all the time we needed. ", "rating": 5}, {"title": "Excellent service!!", "text": "Very friendly, helpful and knowledgeable.", "rating": 5}, {"title": "The guys were professional personable…", "text": "The guys were professional personable and nice. Everything was perfect", "rating": 5}, {"title": "Store and sales team member were great", "text": "Store and sales team member were great.  Delivery was fast, within days!", "rating": 5}, {"title": "Cool store. I was pleasantly w", "text": "Very helpful sales associates. Lots of options with fabrics", "rating": 5}, {"title": "Lindsey was AWESOME", "text": "Lindsey was very helpful, friendly and patient to help me find the right piece of furniture. VERY pleasant!!! ", "rating": 5}, {"title": "Alex was very helpful and knowledgeable.", "text": "Alex was very helpful and knowledgeable. ", "rating": 5}, {"title": "Amazing customer service", "text": "Amazing customer service. In and out in 30min.Couches will be delivered in 2 days.", "rating": 5}, {"title": "Jw did awesome job in the warehouse in…", "text": "Jw did awesome job in the warehouse in abilene tx.", "rating": 5}, {"title": "Candace and the team were amazing", "text": "Candace and the team were amazing! She was very attentive and helped in every way possible. ", "rating": 5}, {"title": "Delivery team was carteas and friendly.", "text": "Delivery team was carteas and friendly. ", "rating": 5}, {"title": "Excellent Punctuality", "text": "Excellent Punctuality, friendliness, service and communication throughout the process and pick up! Kelly, Troy & Partner were Amazing!!", "rating": 5}, {"title": "Totally Happy with my service.", "text": "Date of experience: October 31, 2024", "rating": 5}, {"title": "Maria and the manager were amazing", "text": "Maria and the manager were amazing.  I would recommend them to anyone who wants to ask. ", "rating": 5}, {"title": "Quick drop", "text": "Thomas was very friendly and helpful. The Store was organized and inviting ", "rating": 5}, {"title": "We are excited for well made furniture…", "text": "We are excited for well made furniture at a lower price with a great warranty. ", "rating": 5}, {"title": "The lady who helped us was very nice…", "text": "The lady who helped us was very nice and answered all our concerns ", "rating": 5}, {"title": "Katy was the sweetest and most patient…", "text": "Katy was the sweetest and most patient rep. ", "rating": 5}, {"title": "Great inventory", "text": "Great inventory, good prices and wonderful sales staff!", "rating": 5}, {"title": "Alejandra was excellent and helpful.", "text": "Alejandra was excellent and helpful. ", "rating": 5}, {"title": "Excellent", "text": "It was easy and affordable. Thank you", "rating": 5}, {"title": "Great experience ", "text": "The ease of checkout perfect. Help was amazing!", "rating": 5}, {"title": "Easy process to purchase", "text": "Easy process to purchase, delivery and enjoy.  Love the couches.  ", "rating": 5}, {"title": "Quick and easy", "text": "Quick and easy! Lots of communication! Can't wait to get my couches!!!", "rating": 5}, {"title": "Picking a sofa was quick and easy", "text": "Picking a sofa was quick and easy! Delivery was too! We are so happy with the sofa we chose!", "rating": 5}, {"title": "Friendly", "text": "I had great help.  You guys unboxed my purchase so I could get it in the car and helped me load it.  Very pleasant and friendly.  I love this store!", "rating": 5}, {"title": "Easy sell", "text": "Easy sell - was ready to buy - Great all around experience. Aaron was top notch.", "rating": 5}, {"title": "Very good service ", "text": "They very helpful ", "rating": 5}, {"title": "Great shopping experience at Lewisville…", "text": "Great shopping experience at Lewisville store. ", "rating": 5}, {"title": "Shay was very helpful and courteous I…", "text": "Shay was very helpful and courteous I would buy from him again", "rating": 5}, {"title": "Very helpful", "text": "Very helpful, no pressure salesperson.   Good display & options.", "rating": 5}, {"title": "Great service", "text": "Great service. Justin was wonderful, very helpful and professional", "rating": 5}, {"title": "Supernice and friendly staff.", "text": "Supernice and friendly staff.", "rating": 5}, {"title": "Daisy and Daniel were a wonderful help", "text": "Date of experience: October 23, 2024", "rating": 5}, {"title": "My second couch from Home Zone and it’s…", "text": "My second couch from Home Zone and it’s very well made, just like the first. ", "rating": 5}, {"title": "Very professional service", "text": "Very professional service. Good attitude. Fast delivery. Professional installer", "rating": 5}, {"title": " Repair ", "text": "Everyone  has been really helpful and professional ", "rating": 5}, {"title": "Good selection of furniture.", "text": "Date of experience: October 31, 2024", "rating": 5}, {"title": "Great sevice", "text": "This location is awesome!!", "rating": 5}, {"title": "Customer care was extremely helpful and…", "text": "Customer care was extremely helpful and understanding.  ", "rating": 5}, {"title": "Very easy to work with sells person", "text": "Very easy to work with sells person ", "rating": 5}, {"title": "Dawn was very helpful.", "text": "Dawn was very helpful. ", "rating": 5}, {"title": "staff helpful", "text": "staff helpful ", "rating": 5}, {"title": "Malik that helped me was a great help", "text": "Date of experience: October 23, 2024", "rating": 5}, {"title": "Very friendly", "text": "Very friendly, professional, and knowledgeable.", "rating": 5}, {"title": "Easy,fast service", "text": "Date of experience: October 23, 2024", "rating": 5}, {"title": "More like so much", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "Very good", "text": "Very goodOverall experience….. so helpful", "rating": 5}, {"title": "The staff and build of the products", "text": "Date of experience: October 31, 2024", "rating": 5}, {"title": "Awesome service ", "text": "The whole process was easy and fast !", "rating": 5}, {"title": "Very friendly and helpful.", "text": "Date of experience: October 15, 2024", "rating": 5}, {"title": "So helpful and friendly!!", "text": "Date of experience: October 22, 2024", "rating": 5}, {"title": "They were very helpful", "text": "They were very helpful ", "rating": 5}, {"title": "Very engaging and professional with no…", "text": "Very engaging and professional with no pressure.", "rating": 5}, {"title": "Cordial and knowledgeable personnel.", "text": "Cordial and knowledgeable personnel. ", "rating": 5}, {"title": "Great team of people.", "text": "Great team of people. ", "rating": 5}, {"title": "Customer service was Excellent.", "text": "Customer service was Excellent. ", "rating": 5}, {"title": "Quick and Easy!", "text": "Quick and Easy! ", "rating": 5}, {"title": "Friendly people and good prices", "text": "Date of experience: October 21, 2024", "rating": 5}, {"title": "The staff were very nice", "text": "Date of experience: October 22, 2024", "rating": 5}, {"title": "Great customer service", "text": "Great customer service ", "rating": 5}, {"title": "👍👍👍👍👍👍", "text": "👍👍👍👍👍👍👍👍👍👍👍", "rating": 5}, {"title": "Friendly staff", "text": "Friendly staff, no pressure, excellent comfy furniture at excellent prices. They even offer you a soda or water. ", "rating": 5}, {"title": "Very satisfied customer, definitely will be shopping again with them! ", "text": "The furniture looked just like as expected. The delivery and assembly guys were very nice and fast. Living on the 3rd floor those guys were very professional and quick. Very happy with the service. ", "rating": 5}, {"title": "Very friendly and patient", "text": "Yaresi was so kind and patient with our indecisions  we absolutely adored her  Thank You ", "rating": 5}, {"title": "The team at this location was fantastic…", "text": "The team at this location was fantastic and really helpful.", "rating": 5}, {"title": "Dawn was awesome", "text": "Dawn was awesome!  Not pushy, just helpful and patient while I looked around.  ", "rating": 5}, {"title": "Good service", "text": "Good service", "rating": 5}, {"title": "We've never been there before", "text": "We've never been there before, this was our first time shopping with Home Zone.  Our first impressions of the store was \"wow,\" the place is big, clean and smell so nice. The first person to greet us was Laura Perez, she was very nice, friendly, kind and especially very patient with us.  She was there to check us out after me and my husband found a great bed to get. We are very satisfied for the great customer service and experience with shopping at Home Zone.William & Claudia B.", "rating": 5}, {"title": "Knowledgeable people and very helpful", "text": "Knowledgeable people and very helpful. No pressure.  ", "rating": 5}, {"title": "Service with a smile good product and…", "text": "Service with a smile good product and fair price! ", "rating": 5}, {"title": "Wished for larger variety of color but the fam is in love with color & comfort and when my family is happy I am happy.", "text": "Good experience in store. Helpful staff. I will definitely return when ready for other items.", "rating": 5}, {"title": "Nora", "text": "Nora, the sales lady that helped us, was tremendously helpful. She greeted us when we entered and answered all our questions about the bedroom, mattress and sectional sofa we decided to purchase.  She helped us with Synchrony application. She was delightful, funny, smiled a lot. ", "rating": 5}, {"title": "Great shopping experience", "text": " Great shopping experience. You are greeted  when you come in the door ask if you need help if you’re just looking and you tell them that they say go right ahead look all you want. I’ll come check on you later. It was nice not to be hovered over. ", "rating": 5}, {"title": "Really nice delivery men and they were…", "text": "Really nice delivery men and they were efficient and quick. ", "rating": 5}, {"title": "Great experience! ", "text": "Jasmine was very helpful and helped us pick out the right furniture for our needs. ", "rating": 5}, {"title": "Nice", "text": "Nice,  kind , courtesy and quick", "rating": 5}, {"title": "Great Place", "text": "Everyone was very helpful in the store. Great prices for quality items. Delivery was on time and quick and easy. ", "rating": 5}, {"title": "It was great all around.From the time I…", "text": "It was great all around.From the time I walked in the store the lady that helped me was Amazing!! Sorry I couldn’t remember her name.Then the delivery drivers were Amazing as well.Im a very happy customer.The transaction was very smooth sailing.", "rating": 5}, {"title": "First the service is impeccable ", "text": "First the service is impeccable Second the prices are excellent ", "rating": 5}, {"title": "I guys that help me on the phone and in…", "text": "I guys that help me on the phone and in person were friend and kind. It was a pleasant experience and I will come back again.", "rating": 5}, {"title": "I am absolutely blown away by this…", "text": "I am absolutely blown away by this company! Their communication is top-notch and the delivery was super speedy.", "rating": 5}, {"title": "As I wrote earlier the entire…", "text": "As I wrote earlier the entire experience from the sales people on to the delivery and set people was great; professional, polite and helpful.When we were looking at what to buy our focus was on the table and it's great stability. Now that we have the furniture, the chair legs are of concern as there is no cross  bracing on them to add structural stability and strength.Thank you,Charles Stewart ", "rating": 5}, {"title": "Excellent experience", "text": "Excellent experience ", "rating": 5}, {"title": "Great customer service ", "text": "Daisy was extremely helpful and patient. ", "rating": 5}, {"title": "Big Supporter of Home Zone!", "text": "We have made several purchases from Home Zone, and I love the quality and style. The workman is a cut above. They are a family owned company that gives a reasonable price. The moving team is phenomenal and they take great care in moving the furniture in your home! I recommend Home Zone!", "rating": 5}, {"title": "There was nobody trying to pressure me…", "text": "There was nobody trying to pressure me into buying. The person I dealt with was very help and polite. Delivery was on time and very professional. ", "rating": 5}, {"title": "Same furniture as the website with…", "text": "Same furniture as the website with great deals", "rating": 5}, {"title": "Well pleased", "text": "We appreciate Alondra for being professional and working in a swift manner. I spoke with Alondra over the phone. As I began to describe the issue that we were having, she knew what was needed to get the job done. Thanks again Alondra. Take care.", "rating": 5}, {"title": "Excellent service ", "text": "Everyone is always so friendly and never pushy to purchase. Delivery always happens so quick and set up just as quick! My third time purchasing from Home Zone! The experience is always the best and the quality of the furniture is great! ", "rating": 5}, {"title": "Very helpful", "text": "Very helpful, considerate and professional love our pieces that we purchase from home zone", "rating": 5}, {"title": "Emilio was awesome on the service call", "text": "Emilio was awesome on the service call. Juan on phone was super sweet and customer oriented.", "rating": 5}, {"title": "I recently purchaseSeamless Purchase and Delivery Experience – Highly Recommend!d a sofa from Home…", "text": "I recently purchased a sofa from Home Zone Furniture, and the entire process was seamless from start to finish. Ordering online was easy, and selecting a delivery and setup date was simple. What really stood out was the proactive communication on the day of delivery, which left no room for guessing or wondering when they'd arrive. The delivery staff were kind, professional, and efficient—they had everything set up in our living room in under 10 minutes, leaving it spotless. I would definitely be a repeat customer and highly recommend Home Zone Furniture to others!", "rating": 5}, {"title": "The floor personnel wasn’t pushy and…", "text": "The floor personnel wasn’t pushy and they let you browse freely while still being attentive when I had question. ", "rating": 5}, {"title": "I was very pleased with the selection…", "text": "I was very pleased with the selection at the store, but more importantly, the quality is far above the competition. I went in to look for a sofa but was so impressed that I bought a love seat and end tables too. ", "rating": 5}, {"title": "Tristan was great", "text": "Tristan was great!  He was professional, listened to our needs, and gave us some time to look through the store.  He was always available , but didn’t hover. He gave us privacy time.  Then when it was buying time, his knowledge was very valuable.  It’s a great store…. We’ll be back!", "rating": 5}, {"title": "The ordering process online was…", "text": "The ordering process online was seamless and efficient. I went to the Cedar Hill store first to see the furniture in person. I had a very friendly salesman named Vernon. I had to leave before placing my order with Vernon however, but I was hoping to assign credit to him when I placed my online order. I did not see an option to do that. ", "rating": 5}, {"title": "Random sofa purchase ", "text": "We were promptly greeted by Andrea and given helpful information. The information pertained to product and and delivery options. Andrea allowed us to browse without pressure and genuinely answered all of our questions.When it came time to inquire into the sofas we wanted. Andrea gave us all of our options to include warranty and delivery.My spouse and I feel great about doing business with a Texas family owned company and Andrea. Thank you.", "rating": 5}, {"title": "Danny", "text": "Danny was great.", "rating": 5}, {"title": "Great Store", "text": "This was my first visit to a Home Zone Furniture store.  I was greeted upon my arrival but not descended upon like in other furniture stores.  Carlos was great - very friendly, helpful and knowledgeable.  There was also another young lady who helped me when Carlos was busy.  I will definitely come here again when I am looking for furniture!", "rating": 5}, {"title": "I came into the store a few weeks ago…", "text": "I came into the store a few weeks ago and returned and the salesman James Williams remembered me.  Because of how he went above and beyond that week to assist I was sold on going back and we did.  Even during the purchase process it’s been a long time since I have had experience amazing customer service. ", "rating": 5}, {"title": "My sales associate, Aaron", "text": "My sales associate, Aaron, was very friendly and knowledgeable. He spent a great deal of time answering my questions and didn't rush me. I didn't purchase anything that night (I like to think things over), but I did go back the next day and purchase the headboard and frame and a really cute side chair.", "rating": 5}, {"title": "Excellent Staff!!!", "text": "We had a slight issue with the loveseat and they just sent a technician out to replace the brackets. Anthony did a great job and obviously knew what he was doing. Everything is working wonderfully now and we are very happy with our purchase!!", "rating": 5}, {"title": "Great Shopping Experience", "text": "Great Shopping Experience. I will definitely shop at Home Zone again.", "rating": 5}, {"title": "absolutely love my experience with Home…", "text": " absolutely love my experience with Home Zone Furniture! The selection is fantastic, and I found exactly what I needed for my home at an unbeatable price. The staff was incredibly friendly and helpful, making the shopping process a breeze. Although I had a minor issue with delivery, their customer service team was quick to resolve it. Overall, I highly recommend Home Zone for anyone looking for stylish and affordable furniture!", "rating": 5}, {"title": "I wasn’t followed around but associate…", "text": "I wasn’t followed around but associate was easily located to answer my questions. Wonderful shopping experience. Will definitely go back.", "rating": 5}, {"title": "Easy to find item I needed", "text": "Easy to find item I needed. Also I appreciate the notes on the item so there are no surprises ", "rating": 5}, {"title": "Giselle was so helpful and patient with…", "text": "Giselle was so helpful and patient with us!! ", "rating": 5}, {"title": "Tristan is the best", "text": "Tristan was wonderful, he is very knowledgeable and got me a good deal!", "rating": 5}, {"title": "My experience was great", "text": "My experience was great. It was a smooth easy process and I live my new sofa.", "rating": 5}, {"title": "Great customer service ", "text": "Our sales woman was very helpful and friendly ! I loved her personality and customer service!!", "rating": 5}, {"title": "Friendly and helpful staff", "text": "Friendly and helpful staff. Good knowledge of products on floor.", "rating": 5}, {"title": "Jennifer was helpful", "text": "Jennifer was helpful, and led me to exactly the dining set I was looking for! I will be back !", "rating": 5}, {"title": "I love the atmosphere in the store…", "text": "I love the atmosphere in the store itself!  Everyone is so helpful, but NEVER pushy.  The communication for our delivery was spot on and the delivery itself was flawless.  I do not use any other furniture store except Home Zone and I can ALWAYS find what I want there.", "rating": 5}, {"title": "Sales Lady was very courteous and…", "text": "Sales Lady was very courteous and knowledgeable.", "rating": 5}, {"title": "My salesperson Payton", "text": "My salesperson Payton. He provided outstanding service", "rating": 5}, {"title": "Great customer servic", "text": "Great customer service ", "rating": 5}, {"title": "Our sales person was very helpful…", "text": "Our sales person was very helpful through the process of looking for the perfect recliner.  ", "rating": 5}, {"title": "Excellent customer service", "text": "Excellent customer service. Jose was fantastic. I recommend this furniture shop anybody looking for quality furniture and a  great deal and excellent customer service.", "rating": 5}, {"title": "I love Home Zone", "text": "I love Home Zone. They have beautiful furniture at great prices. Staff was very friendly and no pressure. Walked in looked around told them what I wanted and it was delivered in two days. Highly recommend. ", "rating": 5}, {"title": "The sales person explained things", "text": "The sales person explained things, showed us a few items we might be interested in, and then left us alone to look around the store.", "rating": 5}, {"title": "Vernon is the best!", "text": "Vernon at HomeZone Cedar Hill is the absolute best! Patient, professional, personable, & an all around great guy! He listened to what we needed, walked us throughout the showroom, and worked out a great deal for us. Be sure to visit Vernon-he’s the truth! ", "rating": 5}, {"title": "Our sales rep", "text": "Date of experience: October 15, 2024", "rating": 5}, {"title": "Customer service", "text": "Customer service! Jennifer sand Andrea were really awesome! No pushing or following around…just absolutely helpful when needed! They really made the process super easy! A big thank you!", "rating": 5}, {"title": "Made it right", "text": "This is our second purchase at Home Zone. The first purchase went smoothly with no issues. The second had some hiccups, but Home Zone in Burleson went above and beyond to make up for them. Thanks to the great communication, we will be back. ", "rating": 5}, {"title": "The experience was great", "text": "The experience was great, our help was very courteous and respective. she explained every step that was taken.", "rating": 5}, {"title": "Even the problems are no problem.", "text": "We had a slight issue with the loveseat and they just sent a technician out to replace the brackets.  Anthony did a great job and obviously knew what he was doing.  Everything is working wonderfully now and we are very happy with our purchase! ", "rating": 5}, {"title": "Night Stand", "text": "I came by to pickup a nightstand. The process was seamless. Everyone was very professional. Thank you ", "rating": 5}, {"title": "We were new to Home Zone", "text": "We were new to Home Zone, looking for a sectional.  We liked that the furniture is made in Texas (where we live).  They have a very good selection, and many of them are customizable in terms of footprint and fabric.  Plus, delivery to us (we live 250+ miles away from the store) was relatively inexpensive.  Prices were quite reasonable, less expensive than the other furniture stores we shopped.  Finally, the sales person was very friendly and helpful (and offered us water and an ice cream sandwich).  ", "rating": 5}, {"title": "The staff was friendly and organized", "text": "The staff was friendly and organized. Delivery times were fast; only 3 days. We haven’t gotten our couch yet but if it’s anything like their service I’m sure it will be great. ", "rating": 5}, {"title": "Rosalinda was great in getting my issue…", "text": "Rosalinda was great in getting my issue resolved in a timely manner ", "rating": 5}, {"title": "Ease of shopping", "text": "Ease of shopping, no pressure from sales person.", "rating": 5}, {"title": "Nice employee", "text": "Date of experience: October 14, 2024", "rating": 5}, {"title": "Kelly was our customer agent and she…", "text": "Kelly was our customer agent and she handled everything smooth and made it easy to understand.  She answered all our questions we felt very comfortable with our purchase. ", "rating": 5}, {"title": "Fast and friendly", "text": "Fast and friendly; great service", "rating": 5}, {"title": "no sales people following you ", "text": "i really liked knowing right away that it was non commission. one of the things i hate about furniture stores is being heckled by sales people and feeling forced to follow them around the store and having them watch me for my reactions. i was able to take my time to look at everything i was interested in or even just seeing things that were nice that i wasn’t planning to buy. ", "rating": 5}, {"title": "We had a great experience with no…", "text": "We had a great experience with no pressure as we looked at the furniture. ", "rating": 5}, {"title": "Cheap and local.", "text": "Supporting local business while also giving a lower than average price point.", "rating": 5}, {"title": "We were welcomed by Brittany J with a…", "text": "We were welcomed by Brittany J with a smile. She didn’t pressure us to buy anything we didn’t want or need.We went to other stores but went back and ordered our loveseat ", "rating": 5}, {"title": "Suzy was very helpful and polite", "text": "Suzy was very helpful and polite. I will refer others to her. ", "rating": 5}, {"title": "Perfect!", "text": "Victoria Hooper was our sales representative.  She was very professional, respectful, and was eager to help us find the perfect chair for our home. She was very responsive and knowledgeable on the different pieces of furniture we were interested in. She made our experience seamless and exciting!", "rating": 5}, {"title": "Carlos he was very friendly and helpful…", "text": "Carlos he was very friendly and helpful without being high pressure in sales. I would strongly recommend Carlos when shopping for furniture at Home Zone.", "rating": 5}, {"title": "Great staff with the attitude to help.", "text": "Date of experience: October 13, 2024", "rating": 5}, {"title": "It was busy on that day (10-12-24)", "text": "It was busy, but they made it easy with plenty of time to look around. It was even better when we found out that they wouldn’t be chasing us down to make the sale!", "rating": 5}, {"title": "Friendly store associate and speedy…", "text": "Friendly store associate and speedy delivery ", "rating": 5}, {"title": "Excellent furniture..Best services", "text": "Date of experience: October 14, 2024", "rating": 5}, {"title": "Helpful staff!", "text": "Date of experience: October 13, 2024", "rating": 5}, {"title": "The delivery men were very professional…", "text": "The delivery men were very professional and kind ", "rating": 5}, {"title": "Easy process employee is friendly ", "text": "Great customer service ", "rating": 5}, {"title": "Absolutely the best customer service!..", "text": "Date of experience: October 06, 2024", "rating": 5}, {"title": "Shout out to the delivery team of Tim…", "text": "Shout out to the delivery team of Tim and his helper who delivered and set up my dining room set on October 9th!  They came within the schedule time frame and were both courteous and respectful of my home. They went straight to work and had my new set assembled quickly!", "rating": 5}, {"title": "5 stars all the way around…", "text": "5 stars all the way around from sales to delivery.  Would buy from home zone again.  ", "rating": 5}, {"title": "Outstanding customer service!", "text": "Outstanding customer service! ", "rating": 5}, {"title": "The whole experience went smoothly and…", "text": "The whole experience went smoothly and the employees were friendly and helpful. When it came time for our furniture to be delivered I was getting updates and was able to track it. When the guys came and delivered our furniture they were polite and took their time coming into my house. And asked where I wanted it to go and they set it up. Over all it was a great experience.", "rating": 5}, {"title": "The service was good and fast", "text": "Date of experience: October 13, 2024", "rating": 5}, {"title": "Great customer service", "text": "I had an estimate from an associate. I went in to purchase and Daisy handled the transaction. There were errors on the original estimate. Daisy corrected the errors and completed the sale. She handled everything in a professional manner.", "rating": 5}, {"title": "My experience was fantastic", "text": "My experience was fantastic. Aaron made me feel at ease and was super professional. Looking forward to my order.", "rating": 5}, {"title": "Lee made the experience real easy .", "text": "Lee made the experience real easy . ", "rating": 5}, {"title": "Refreshing change from being followed…", "text": "Refreshing change from being followed around a furniture store. Our questions were answered honestly and professionally. Definitely not the big box furniture store. Keeping it in Texas!", "rating": 5}, {"title": "Great service and great product have no…", "text": "Great service and great product have no issues.", "rating": 5}, {"title": "Easy to work with", "text": "Easy to work with, helpful and efficient.", "rating": 5}, {"title": "Everything about this process was…", "text": "Everything about this process was flawless. I ordered online and they texted and emailed confirmation.  When I had a question, an actual person called me on the phone. They gave me a delivery window and honored it. They delivered everything perfectly, set it up, and were very respectful. And I can’t talk enough about the quality of the furniture. ", "rating": 5}, {"title": "Great service ", "text": "Candace helped us out with any questions we had and wasn’t over bearing. And the kids play area while we shopped was the best. ", "rating": 5}, {"title": "Lot of choices and staff are very…", "text": "Lot of choices and staff are very welcoming", "rating": 5}, {"title": "Everyone was very knowledgeable", "text": "Everyone was very knowledgeable, helpful and nice.", "rating": 5}, {"title": "Great customer service", "text": "Great customer service ", "rating": 5}, {"title": "Everyone is so friendly and inviting", "text": "Everyone is so friendly and inviting.  Lee our salesperson is so knowledge, easy to talk with, and helpful.  ", "rating": 5}, {"title": "There furniture is built to last", "text": "I have bought many things from home zone is really love there furniture ", "rating": 5}, {"title": "EXCELLENT PLACE TO BUY FURNITURE", "text": "I can’t rave more about this company, the quality of their products, and their customer service. I have ordered multiple items from this store and had it shipped to MI. The experience was superb. No issues whatsoever. Not to mention the quality of the furniture is amazing and durable. I would highly, highly recommend this company and its furniture! ", "rating": 5}, {"title": "They were very professional and…", "text": "They were very professional and knowledgeable ", "rating": 5}, {"title": "Great customer service", "text": "Tristan was fabulous and answered all of our questions. ", "rating": 5}, {"title": "Great experience!", "text": "Start to finish we had a good experience. Went in to buy a mattress. Very helpful, not pushy. Ordered and it was delivered promptly and in good condition. Will go back!!", "rating": 5}, {"title": "Marcos saved our lives!", "text": "Marcos delivered my new mattress today and I will be forever grateful for his help not only with my new mattress but his warning to me about the smell of gas! He walked in and asked if I could smell gas. I am handicap and don’t leave my house too often but we had a new HVAC system installed in our house in July and had been complaining about the smell of gas and was getting continually dismissed by the HVAC company as something that would dissipate with time. But today after Marcos made the comment about the smell of gas, I called the gas company and sure enough, we did have a gas leak! We had to immediately evacuate our house! The HVAC company has been out and has fixed their initial install mistakes. Thank you, Marcos! I feel like you have saved our lives!! ", "rating": 5}, {"title": "Great store", "text": "Great store. Made in Texas!Whole experience was 5 star", "rating": 5}, {"title": "The staff that helped us was very…great ", "text": "The staff that helped us was very polite and friendly. ", "rating": 5}, {"title": "Helpful staff", "text": "Helpful staff, wide variety of furniture ", "rating": 5}, {"title": "Very Friendly!", "text": "Date of experience: October 10, 2024", "rating": 5}, {"title": "Knowledgeable and friendly staff!", "text": "Date of experience: October 10, 2024", "rating": 5}, {"title": "Excellent Staff", "text": "We are buying a house and needed a whole house worth of furniture.  Monique was very patient and helpful as we picked out furniture for 2 bedrooms, 2 living rooms and a dining room, along with some accessories.  Daylen was also helpful and friendly as we were searching for different pieces and for advice.I would highly recommend stopping in and being assisted by the amazing team in this store.", "rating": 5}, {"title": "I visited the Cedar Hill store about 4…", "text": "I visited the Cedar Hill store about 4 times before making my final purchase. The reason I came back was Gabbi, my sales representative. She worked with me helping to find the perfect furniture for my family room. On one of the occasion I came in to buy what I had decided Gabbi was not there. The man that was there was ok, but showed no interest in helping me. So I called and got the exact time and day Gabbi would be there before coming back to the store. So glad I did! Those guys could learn something from Gabbi!!! Thanks", "rating": 5}, {"title": "The staff was knowledgeable and helpful", "text": "Date of experience: October 10, 2024", "rating": 5}, {"title": "Most importantly", "text": "Most importantly, I was addressed immediately when I walked in.  The salesman was very helpful and professional.  I would definitely return and recommend to others.  ", "rating": 5}, {"title": "Alondra M was very prompt", "text": "Alondra M was very prompt, courteous, and helpful with repair claim ", "rating": 5}, {"title": "It was a very good experience", "text": "It was a very good experience.  Kylie was very helpful.  Well definitely recommend Home Zone to my friends. ", "rating": 5}, {"title": "I had a very sweet and patient sells…", "text": "I had a very sweet and patient sells woman name MiMi, who was easy to work with and took her time care of my needs. I really appreciate having a store so close and dealing with nice local people. Excited to see my Dining table in my dining room.", "rating": 5}, {"title": " Arlington TX Home Zone…", "text": "The team at the Arlington TX Home Zone was patient and kind.  They respected our time and gave us information to make it choice.  Delivery was efficient and informed just about every minute.  Great experience!", "rating": 5}, {"title": "Amazing customer service ", "text": "Always a pleasure to do business with Daniel. He is very professional and always makes sure you are completely satisfied before you leave. Will do business with him again.", "rating": 5}, {"title": "I would like to take the opportunity to give Tristar a compliment", "text": "I would like to take the opportunity to give Tristar Like a very wonderful compliment.  I was lost in finding their location, call the store and Tristar took the time to stay on the  phone and guide me to their location. He went way beyond any customer service to assist me, and I am grateful and appreciated. After arriving and meeting him, he totally assisted with my purchase with additional customer service when it came to the information, I needed to understand to complete my purchase. He is an asset to your company within the Home Zone.", "rating": 5}, {"title": "Lovely store and you had enough…", "text": "Lovely store and you had enough mattresses displayed for me to make a choice.  We had a very nice employee that helped us and he was knowledgeable. The only thing is I wish you had a couple of motorized carts to go around in the store, the wheel chair was a small one also, but a cart would be better! I will.come.back if I need anything else.", "rating": 5}, {"title": "Mariana was a great help when looking…", "text": "Mariana was a great help when looking for new couches. She gave us multiple options that were within our budget. She was very friendly and a huge help!", "rating": 5}, {"title": "Great customer service.", "text": "Date of experience: October 09, 2024", "rating": 5}, {"title": "Carlos did an amazing job helping me…", "text": "Carlos did an amazing job helping me purchase my first couch! Thank you so much for the help.", "rating": 5}, {"title": "Amazing Customer Service; Beautiful Bed!", "text": "Home Zone has the most INCREDIBLE customer service I have ever experienced.I ordered a king-sized storage bed for out-of-area delivery and assembly, and unfortunately some of the drawers had functionality issues (the pieces were definitely packed correctly—as they were thoroughly inspected and photographs were sent to me prior—but with shipping/movement, there's always a chance small elements can shift enough to create a bit of an issue upon assembly...especially with ball bearing-type components, I have learned haha). Alexis and the entire Home Zone team worked diligently to ensure that the situation was rectified. They arranged for a furniture technician to come make additional adjustments to the drawers, and when that visit didn't 100% resolve the issues, they quickly arranged a return visit to ensure I was completely satisfied with my item.Alexis, who was my primary contact from their Nationwide Deliveries department, was incredibly communicative throughout the process, checking in regarding the status of the technician appointments and following up to ensure I was satisfied with the results. Bottom line is that Home Zone CARES about the quality of their items and the satisfaction of their customers. They went above and beyond any other company from which I have ever made a purchase, and I could not recommend them any more highly as a trustworthy merchant of fine home furnishings. Thank you to Alexis, and to the entire Home Zone Nationwide Deliveries team, for putting the customer first and representing quality in today's marketplace. I am forever grateful.", "rating": 5}, {"title": "The customer service is great", "text": "The customer service is great, friendly, very courteous and always smiling, furniture is great quality also", "rating": 5}, {"title": "I had a wonderful experience!", "text": "I had a wonderful experience. Tim that helped me was very friendly, nice and knowledgeable. I found everything I was looking for all in one place!", "rating": 5}, {"title": "A Truly Exceptional Customer Service Experience ", "text": "Above exception patience, professionalism, customer service, and technical expertise!!!!Thank you Ms. Alexis Adams for allowing me to voice my issues and concerns to you. Additionally, thank you for taking the time to listen.Your unequivocal attention to detail, prompt response, and exceptional assistance without question got my issues rectified!!!!Loyal Home Zone Customer for Life,v/rMarcus", "rating": 5}, {"title": "low pressure", "text": "Date of experience: October 08, 2024", "rating": 5}, {"title": "O Neil very helpful", "text": "O Neil very helpful ", "rating": 5}, {"title": "This is my favorite store and I buy all…", "text": "This is my favorite store and I buy all my furniture from HomeZone. The sales representatives meet and greet you immediately upon entering the store. If you choose to be left alone to browse then help is available for any questions and also suggestions are made that I may have missed. ", "rating": 5}, {"title": "The people were super friendly and…", "text": "The people were super friendly and showed me just what I asked for.  Not pushy at all.  I have shopped there before because I enjoyed dealing with the people they have working there", "rating": 5}, {"title": "store was clean and well laid out", "text": "store was clean and well laid out. a salesperson greeted us and helped us find what we were looking for. she explained the different payment options and walked us through the paperwork. she also let us know how to contact her and the store if any problems were to arrive. nationwide delivery was set up with an approximate delivery period. all in all, it was a pleasant experience, and we got the exact product we wanted, in the exact color at a very reasonable price.", "rating": 5}, {"title": "I appreciate that the salespeople are…", "text": "I appreciate that the salespeople are not commissioned. They are available for questions, but do not follow you around the store trying to get you to make purchases. Mike (Mr. Groovy) was available to answer our questions and did not pressure us to make a purchase. We have used Home Zone several times and will continue to use them. They have several locations near me in the Lewisville area. ", "rating": 5}, {"title": "I love shopping with Home Zone the…", "text": "I love shopping with Home Zone the customer service is always excellent. ", "rating": 5}, {"title": "Easy process going into store", "text": "Easy process going into store! Nice furniture. ", "rating": 5}, {"title": "Just quick and easy and super…", "text": "Just quick and easy and super professional! ", "rating": 5}, {"title": "Ask for Carlos ", "text": "Carlos was a huge help, showed me floor options based on what I asked, he knew his material, then a smooth checkout.I love my new furniture ", "rating": 5}, {"title": "Great customer service ", "text": "We were looking for a specific tv stand & kitchen chairs. We bought four chairs: three in cedar hill then had to drive to Richardson to pick up fourth chair. Great customer service at all locations staff is friendly and helpful.", "rating": 5}, {"title": "Great staff", "text": "Date of experience: October 06, 2024", "rating": 5}, {"title": "Home Zone staff are very nice and…", "text": "Home Zone staff are very nice and helpful. Shy and Tayla went over and beyond in assisting us.", "rating": 5}, {"title": "Dawn was very knowledgeable and…", "text": "Dawn was very knowledgeable and pleasant to deal with. ", "rating": 5}, {"title": "We enjoyed that we got to look at…all the couches", "text": "We enjoyed that we got to look at everything without being followed around, and when we were ready to purchase, we were well taken care of.  Shopping at Home Zone is enjoyable because of the fact you do not pressure your customers.", "rating": 5}, {"title": "Customer Service ", "text": "Maria was very professional, helpful, and had great customer service. I had an amazing experience and will continue to do business here at this HomeZone location. Thanks!", "rating": 5}, {"title": "Sales person was knowledgeable", "text": "Sales person was knowledgeable, professional & good communicator as well an excellent listener.  Good, solid \"made in Texas\" furniture. Appreciated patience with the paperwork.", "rating": 5}, {"title": "Theo was very fast!", "text": "Theo was very fast, friendly and efficient. I was confused that the website says pick up at store but does not clarify that it has to be delivered to the store from a warehouse. I drove 45 minutes to the store expecting to pick up my purchase.", "rating": 5}, {"title": "Sales / customer care was great", "text": "Sales / customer care was great. The explanation about the deals and the deal itself was great.", "rating": 5}, {"title": "Quality and Comfort", "text": "From the quality of the furniture, to the expertise of our sales person, we were more than thrilled with the experience!", "rating": 5}, {"title": "Never been to a Home Zone", "text": "Never been to a Home Zone, but was overly impressed with the staff, our sales associate and his manager (both so nice, professional and helpful).  I was also impressed with the quality and pricing of the inventory.  I will definitely be back. ", "rating": 5}, {"title": "Great experience", "text": "Great experience! Great job! ", "rating": 5}, {"title": "The staff was very nice ", "text": "The staff was very nice . They said hello when we walked in and let us look around until we had questions.", "rating": 5}, {"title": "very friendly and helpful", "text": "Date of experience: September 28, 2024", "rating": 5}, {"title": "Helped the way a furniture store should", "text": "Helped the way a furniture store should. Let us take our time shopping and deciding. Found out our needs and offered the info needed based on our needs. Able to address all our questions and concerns. ", "rating": 5}, {"title": "Best furniture shopping experience ever!", "text": "We love our new sectional sofa! Brittanie was so helpful, knowledgeable, thorough, and friendly. Everything about the transaction was seamless and incredibly quick. It was so nice to furniture shop and not feel any pressure just awareness and care when needed.", "rating": 5}, {"title": "Wonderful sales person ", "text": "Wonderful sales person , knowledgeable, and courteous. The check out procedure was quick.", "rating": 5}, {"title": "Teresa was great she answered my…", "text": "Teresa was great she answered my questions. I didn't feel pressure to buy something I was shown plenty of options. the showroom was clean and there was plenty of space to walk around and look. I was offered something to drink while I asked for a minute to look around. everything was good the vibe was good", "rating": 5}, {"title": "Excelent attention and excellent sellers", "text": "Date of experience: October 06, 2024", "rating": 5}, {"title": "Candace", "text": "Candace, the sales woman up front was great! She immediately greeted us and offered us drinks! We said we were just there to look. When we did have questions she was prompt and concise! We really were just looking, ended up leaving with a new sectional!!!", "rating": 5}, {"title": "Celest was very friendly and definitely was informative and answered all our questions.  She was not pushy and overall  was a great experience!!  She has excellent customer service skills💗👍🏼", "text": "Celestcwas very friendly and ", "rating": 5}, {"title": "Home Zone Furniture Cedar Hill", "text": "I like this store. I’ve been shopping there for 5-6 years. My daughter recommended Home Zone. My Family shops at Home Zone as well. Maria is my sales representative for the last few years. She is knowledgeable, caring and professional but she sells me to much beautiful furniture. I recently shopped and plan to purchase more in December. ", "rating": 5}, {"title": "Everyone  was very helpful.Great job", "text": "Date of experience: October 06, 2024", "rating": 5}, {"title": "good service", "text": "good service, great choices.", "rating": 5}, {"title": "The sales lady pointed us to the area…", "text": "The sales lady pointed us to the area of what we were shopping for. Was very nice and not pushy at all which let us shop more easily ", "rating": 5}, {"title": "Home Zone is GREAT!", "text": "We have bought several pieces from Home Zone through the years. We love that we are not followed around… Unless we ask for someone to help us. The store is clean, the people are nice, and they have nice furniture with reasonable prices!! I love that we are buying something that was made in Dallas Texas. And we get it quickly!!!😄", "rating": 5}, {"title": "Staff was very nice", "text": "Staff was very nice, Delivery came fast, furniture seems to be a good quality", "rating": 5}, {"title": "Exchange mattress for temper pedicure…", "text": "Exchange mattress for temper pedicure it went very smooth and very efficient and fast", "rating": 5}, {"title": "Thank You For a Smooth Process", "text": "The purchase of the furniture was effortless. Nick and Duran from the North Lewisville store were amazing. We also went to the South Lewisville store where Sean and Paola were very helpful. Delivery and setup were very smooth and the Friendly delivery guys were very helpful. Everything delivered was what we ordered... so A+. ", "rating": 5}, {"title": "Every body was so kind ", "text": "Every body was so kind , great customer service ...love this place ", "rating": 5}, {"title": "The store looks beautiful", "text": "The store looks beautiful. The employees are extremely friendly Including the in-store, the over the phone and the delivery gentleman. Everything was super simple from the purchase to the delivery to a return that I had to do.", "rating": 5}, {"title": "James and Miranda ", "text": "James and Miranda James and Miranda Were such great help I’ll definitely be coming back to them !!", "rating": 5}, {"title": "This is our second large purchase with…", "text": "This is our second large purchase with Home Zone. Today, Daniel at Lake Worth assisted us with mattresses. Daniel and his team are wonderful. ", "rating": 5}, {"title": "Kaci was great from the moment we…", "text": "Kaci was great from the moment we walked in, She explained where items we were looking for were in the store, she was there when we had questions. Great experience, I hope the couch is a good as she is.", "rating": 5}, {"title": "Greeted by Innocent", "text": "Greeted by Innocent, he had an associate Daniel help me pick what I was looking for, understood all my needs I very much appreciate them and the patience they had with me as they have so many amazing options. Fast easy and highly recommended. ", "rating": 5}, {"title": "You all do an awesome job of helping customers.", "text": "The prices are great and I enjoyed shopping there.", "rating": 5}, {"title": "Jeff was the perfect Sales guy", "text": "Jeff Norton treated us very well! He knew everything about the furniture in which we were interested and we loved the zero pressure he applied when we discussed whether to buy one or two pieces.  We got two because he explained that we could return one of them if it simply didn't fit in our room.  (Your non-commissioned sales approach if very refreshing) I love the follow up your store has given us and the way they keep us informed through every step.  The sofa and loveseat are coming this morning and I will let you know if anything changes; but I can't believe it will. ", "rating": 5}, {"title": "Daniel treated us with the most…", "text": "Daniel treated us with the most respect, help us choose the best mattress for our fitting. I would recommend going with him to look for the best style for yourself. At lake worth home zone ", "rating": 5}, {"title": "Buying EXPERIENCE ", "text": "Overall, I found what I was looking for. Andrea was helpful. The furniture is good quality.", "rating": 5}, {"title": "Everyone was so helpful and got here…", "text": "Everyone was so helpful and got here and everything done quickly and very efficiently!  We will buy from Home zone again. ", "rating": 5}, {"title": "Great experience ", "text": "Kaci answered all of our questions and gave us a great deal! We can’t wait to get our furniture!", "rating": 5}, {"title": "Carlos was friendly and helpful", "text": "Carlos was friendly and helpful. No pressure tactics. A pleasure to work with.", "rating": 5}, {"title": "That I was able to find what I was…", "text": "That I was able to find what I was looking for. The only thing is that the delivery was very late for me.", "rating": 5}, {"title": "The store in Cedar Hill is gorgeous - very inviting", "text": "The store in Cedar Hill is gorgeous, the customer service provided by Keith was exceptional, the way you all follow up with customers re: delivery, etc.....Is amazing.  And the delivery guys were on time and superb.  Kelly in customer service does a great job, but the links to track delivery don't work.  We bought our mattress and the exquisite dual power driven recliners connected by a console on September 29 with delivery today, October 3.  ", "rating": 5}, {"title": "Fast setup!", "text": "The guys were fast with the setup, polite, and respectful. ", "rating": 5}, {"title": "We had the most wonderful salesperson", "text": "We had the most wonderful salesperson!  His name was Davonte Taylor at the San Angelo store.  He greeted us and explained the layout of the store and then let us go at our leisure to look around.  He would check on us and answer our questions and not \"hover\" over us.  We really appreciated that!  He was very kind to us as we discussed what payment option we wanted to use, and explained the delivery procedure very thoroughly.  He is a JEWEL!!!!!  Thank you, Davonte!!!!!", "rating": 5}, {"title": "Jessica and Pedro did a great job in…", "text": "Jessica and Pedro did a great job in showing and giving us what we we're looking. Much better than any of their competitors. We'll be back for sure. Thanks.", "rating": 5}, {"title": "Great Shopping Experience ", "text": "Our salesman, Damien, was so personable, friendly and helpful. He put the leaves in and out of the table for me so that I could try it out at the various sizes. He showed me several options that met my specifications, but he didn’t follow me around annoyingly. He gave me ample time to think and make my decision without pressure.I saw many pieces of furniture in the store that I thought were very pretty and I thought the furniture was affordable.I will definitely shop at Home Zone again.", "rating": 5}, {"title": "Was very helpful and did not pressure…", "text": "Was very helpful and did not pressure us to buy anything. ", "rating": 5}, {"title": "Very good experience ", "text": "I came in on a Saturday with my son. Innocent welcomed us as soon as we walked  in. He introduced himself and asked if we would like anything to drink or snack on. He got my son an ice cream sandwich. We found a table we liked, but still wanted to look at other stores. He answered all of our questions and was never pushy. I came back the Tuesday after and Daisy helped with purchasing the table and a recliner. She was through and explained everything very clearly. I will definitely come back for other furniture needs. ", "rating": 5}, {"title": "Great quality", "text": "Great quality, affordable prices,  excellent customer service and sales rep are so humble and patient.Built in Texas. Love the swiftie themes as well.Once a home zone customer always a home zone customer.Thanks Home zone!!", "rating": 5}, {"title": "Outstanding Customer Service", "text": "The sales rep Brittany was very thorough with explaining and answering all the questions I asked her during my 1st and 2nd visit to the store.", "rating": 5}, {"title": "Very polite and very knowledgeable", "text": "Very polite and very knowledgeable ", "rating": 5}, {"title": "Good Experience", "text": "Good products, good service, good value. ", "rating": 5}, {"title": "Jackie was amazing with helping me pick…", "text": "Jackie was amazing with helping me pick out my furniture! So patient and efficient! Love the fact she walked around and helped and was able to answer every question I had! 10 stars ", "rating": 5}, {"title": "Options for a chair that will be…", "text": "Options for a chair that will be helpful for my back osteoporosis.I have to wait as they are out of stock and eagerly await the call to come & pick up the chair. ", "rating": 5}, {"title": "Marshall was fantastic", "text": "Marshall was fantastic! He ensured my family and I were provided with every detail and offered great suggestions. I will definitely return.", "rating": 5}, {"title": "Great Job", "text": "Great Job! Delivery was on time, I was not there but my wife said the setup was done quickly. ", "rating": 5}, {"title": "New couch", "text": "Not being hassled by sales personnel.  Being able to speak with staff only when we were ready to do so.", "rating": 5}, {"title": "They allow you to shop without being…", "text": "They allow you to shop without being pressured or interrupted ", "rating": 5}, {"title": "Amazing customer service!", "text": "The customer service at Home Zone is amazing. So far the quality of my recliner has been good, except for the pull handle. It has broke twice. But both times customer service came through with a new one. Can't ask for better service. I would buy from again if I still lived in Texas", "rating": 5}, {"title": "Excellent service and assistance from…", "text": "Excellent service and assistance from Jessica and Paola!! ", "rating": 5}, {"title": "The young man that dealt with me was…", "text": "The young man that dealt with me was knowledgeable about the sofa that I was inquiring ! He got me in and out of there quick with a sofa !👍", "rating": 5}, {"title": "Easy, simple, no pressure process.", "text": "The salesman (Tristan) was no pressure, easy-going, and very helpful. He was also extremely knowledgeable. After visiting seven different furniture stores, this was a breath of fresh air!", "rating": 5}, {"title": "The salesman was Awesome!!", "text": "Date of experience: September 24, 2024", "rating": 5}, {"title": "Excellent experience with Erica at the…", "text": "Excellent experience with Erica at the North Richland Hills store she has helped me a few times and every time she is so good polite and helpful", "rating": 5}, {"title": "He was very professional and polite", "text": "He was very professional and polite. He answered my questions and pointed me in the right direction. I found what I wanted in the clearance section, but I wanted it new, which he found.I was also able to pick it up the next day. It did not have to be delivered.", "rating": 5}, {"title": "Painless Process", "text": "The entire process was efficient and friendly.  The staff in the store, the communications, and delivery all exceeded my expectations.", "rating": 5}, {"title": "Amazing furniture shopping experience!", "text": "We went in last weekend looking for a couch & Sabbir was SO NICE & SO HELPFUL. They’re non commissioned employees so they don’t hunt you down & follow you through the store. We were able to shop bother free. When we were in between two couches, Sabbir answered all of our questions & helped us pick the perfect set up. He was so nice & professional. Thank you so much!", "rating": 5}, {"title": "The staff is very friendly and helpful", "text": "The staff is very friendly and helpful.  We also liked that the furniture is made in Texas.", "rating": 5}, {"title": "Devon was very helpful", "text": "Devon was very helpful, knowledgable and patient with us. ", "rating": 5}, {"title": "Great Customer Service ", "text": "The 2 gentlemen that helped me with my bed frame showed me how to put it together. Also, they took measurements so I could get a piece of plywood from Lowes to fit under my mattress. This way, I wouldn’t have to wait for some twin box springs to come in. I couldn’t have asked for better customer service.", "rating": 5}, {"title": "Helpful staff", "text": "Helpful staff ", "rating": 5}, {"title": "All on board for my needs", "text": "All on board for my needs! Very well taking care of!!!", "rating": 5}, {"title": "Customer service was the best ! ", "text": "Cameron was very welcoming & professional, he helped us with the whole process at ease & made sure we got the best deal & gave us everything we were looking for Will definitely shop here again ", "rating": 5}, {"title": "Excellent customer service no sales…", "text": "Excellent customer service no sales pressure or sales person following us around the showroom we was able to look on our own and make our on buying decisions.The check out process was fast and hassle free I have and will purchase furniture here again.", "rating": 5}, {"title": "Very helpful", "text": "Date of experience: September 30, 2024", "rating": 5}, {"title": "The quality choices always make me feel…", "text": "The quality choices always make me feel confident when purchasing items for my home.   Employee's are always very helpful and informative.", "rating": 5}, {"title": "Home Zone Takes Great Care of their Customers", "text": "I like that Home Zone keeps you updated on your delivery. They give you a 4 hour window but they update you throughout that time so you're not left wondering how close your window of time is. And you are able to track them also!The deliverers were professional and courteous.  ", "rating": 5}, {"title": "Casey made our visit wonderful", "text": "Casey made our visit wonderful. She is very low pressure. We got to look around after the initial greeting before she helped us. We did make a large  purchase and she made sure we got all the discounts we could.", "rating": 5}, {"title": "Very helpful", "text": "Very helpful ", "rating": 5}, {"title": "I WENT THERE TO PURCHASE SOME…", "text": "I WENT THERE TO PURCHASE SOME ASSESSORIES THAT I SAW WHEN I MADE MY FIRST PURCHASE.LOOKED THRU THE WHOLE STORE MADE MY SELECTION. THEN PURCHACED.", "rating": 5}, {"title": "Sales associate and delivery", "text": "The sales person, Gabby was a delight to work with. She was knowledgeable about the furniture and provided great suggestions for accent pieces The delivery team Alex was on-time courteous. He and his assistant assembled the bed and placed furniture properly. Great attitude and cleaned up. ", "rating": 5}, {"title": "Quick delivery!!", "text": "Quick delivery!!!  The drivers were cordial and very diligent.", "rating": 5}, {"title": "Great service and appreciate the fast…", "text": "Great service and appreciate the fast delivery date.", "rating": 5}, {"title": "Great Experience at Home Zone", "text": "We had a great experience at Home Zone in Allen. We are buying a new house and purchasing new furniture for most of the house.  It took a while to make our decision, since there was so much to choose from for each room.  The staff was very helpful, but no pressure at all. It is refreshing to shop without sales people trying to make commission.  The no commission  sales people are a great benefit to shopping at Home Zone.", "rating": 5}, {"title": "Alejandra was great! ", "text": "Alejandra was great! She is very knowledgeable about the products you have and there was no pressure to buy. She was very patient and understanding while we worked to determine what would work best in our living room space. ", "rating": 5}, {"title": "Awesome experience!", "text": "Deonte and team took great care of the furniture, and set it up quickly and professionally. It was a pleasure working with the whole store, and I definitely recommend them ", "rating": 5}, {"title": "No pressure salespeople", "text": "No pressure salespeople, clean showroom floor, and large selection of Texas made furniture. Support the economy by buying local. ", "rating": 5}, {"title": "Dave was helpful", "text": "Dave was helpful! For the price, quality, and selection I was happy with Homezone. Plan to come back when possible.", "rating": 5}, {"title": "Celeste is the ideal salesperson!!…", "text": "I really appreciated how Celeste gave me information about the products I was interested in, but not pushy. She was very polite, friendly, and had the knowledge or got it right away for me. ", "rating": 5}, {"title": "Love this store", "text": "Love this store.  Great ppl and great service.  Love my new furniture. ", "rating": 5}, {"title": "Our associate was very helpful and…", "text": "Our associate was very helpful and patient to help us with questions or concerns.", "rating": 5}, {"title": "Great customer service!", "text": "Great customer service! ", "rating": 5}, {"title": "Honest", "text": "Honest. Went above and beyond. We will be back! ", "rating": 5}, {"title": "Well made furniture", "text": "Well made furniture, loved everything we bought from them. They delivered and set up everything in the house exactly where we wanted it.", "rating": 5}, {"title": "Wonderful service.", "text": "We are very well pleased with the service we got at our local store, great service.", "rating": 5}, {"title": "Great experience", "text": "Great experience ", "rating": 5}, {"title": "Great experience ", "text": "Rocky and the manager Nick were great in assisting us with our choices. ", "rating": 5}, {"title": "Great customer service", "text": "Great customer service. James was great.", "rating": 5}, {"title": "I have bought several pieces of…", "text": "I have bought several pieces of furniture from the Burleson store and I highly recommend this store to family and friends. The store is always clean and the staff are always ready to help but not pushy. Shane is always there to help with any questions. I love my Burleson Home Zone!", "rating": 5}, {"title": "Quality company, products and service", "text": "The company has a great product. Delivery is on time. The men doing the delivery were friendly and went above and beyond in their service. This is a quality company with quality products and quality service.", "rating": 5}, {"title": "I always have a great time in this…", "text": "I always have a great time in this store looking for furniture. This was my second time and again I was welcomed in by great people willing to help with what I was looking for. ", "rating": 5}, {"title": "Emma and Victoria were amazing and…", "text": "Emma and Victoria were amazing and helped us so much!! ", "rating": 5}, {"title": "Damien did a great job helping us!", "text": "Date of experience: September 27, 2024", "rating": 5}, {"title": "Great customer service", "text": "Had a great experience. Someone was able to help me right away and purchase went smoothly. ", "rating": 5}, {"title": "Fast delivery", "text": "Fast delivery, great service and great quality! ", "rating": 5}, {"title": "Quality at a fair price.", "text": "Quality at a fair price.Excellent un-pushy knowledgeable sales help. We bought 2 well priced solid firm sofas and a recliner. I am beyond pleased as we had budgeted for a lot more $.", "rating": 5}, {"title": "Great customer service", "text": "Great customer service ", "rating": 5}, {"title": "Very nice clean and beautifully set up…", "text": "Very nice clean and beautifully set up store. Courteous staff. Miranda did a great job helping us pick the right furniture. Knowledgeable and eager to help. Will be back for future furniture ", "rating": 5}, {"title": "You have great pieces of furniture and…friendly staff!!", "text": "You have great pieces of furniture and friendly and helpful staff!! We also like the fact HZ seems to be different. No pushy commission, everything done \"in house\" and no 3rd party. Wonderful varieties of furniture to choose from. Prices that are reasonable and fair. HZ is how a furniture store SHOULD be ran! ", "rating": 5}, {"title": "I was greeted as soon as I walked…", "text": "I was greeted as soon as I walked through the door. Asked if I needed help and what I was interested in buying. I said I was looking for comfortable chairs and just wanted to look around. They didn't hover over me which I appreciated. ", "rating": 5}, {"title": "Maria and Josh were wonderful", "text": "Maria and Josh were wonderful. They had great customer service.", "rating": 5}, {"title": "Awesome as always", "text": "Date of experience: September 19, 2024", "rating": 5}, {"title": "Easiest purchase ", "text": "This was the easiest furniture shopping I have done! Was not nagged or bothered while looking. When I was ready Nora got me fixed up! Delivery was great as well. Fast and easy. I will purchase from here again! ", "rating": 5}, {"title": "Ashlyn assisted us with our purchases", "text": "Ashlyn assisted us with our purchases. She was so pleasant and calm and not in a rush when she processed everything. Everything was explained thoroughly. We're excited to use the items we bought! ", "rating": 5}, {"title": "Quality at a fair price. ", "text": "Excellent un-pushy knowledgeable sales help. We bought 2  well priced solid firm sofas and a recliner.  I am beyond pleased as we had budgeted for a lot more $. ", "rating": 5}, {"title": "Very knowledgeable and fair pricing", "text": "Justin was very knowledgeable, courteous and he let me take my time. The prices are fair and everyone was helpful and upbeat. I would highly recommended them!", "rating": 5}, {"title": "Amazing Customer Service ", "text": "Upon entering the store, I was greeted with a warm smile and welcoming atmosphere. My objective was to find the ideal couch, and thanks to the assistance of Cameron and Victoria, I successfully located what i needed. They demonstrated remarkable patience as I deliberated on my decision. After providing them with my space dimensions, they thoughtfully presented several excellent options. Cameron went above and beyond by sketching out various choices on paper, complete with measurements for each couch. His kindness and patience were greatly appreciated I wholeheartedly recommend their exceptional customer service, as I felt treated with the utmost respect throughout my visit. Thank you, Cameron and Victoria!", "rating": 5}, {"title": "Sabbir was so helpful", "text": "Sabbir was so helpful. He was patient and helped resolve spatial issues with my living room. Other staffed helped with the purchase portion since he is fairly new and not completely familiar with all of the options. He, and the other staff, made my purchase very simple. ", "rating": 5}, {"title": "Susie the sales lady was totally…", "text": "Susie the sales lady was totally amazing. She greeted us at the door with a beautiful smile and a very friendly attitude. She worked with us to be able to purchase our furniture. Great lady", "rating": 5}, {"title": "Low Pressure", "text": "The recent visit was great.  We came to explore without heavy pressure from the rep following us around and constantly pushing a product.  This place was much more relaxed. They greeted us. We explored and when ready asked a few questions and purchased.  It gave us time to discuss with some privacy. ", "rating": 5}, {"title": "customer service was very good", "text": "customer service was very good, and the delivery was on time and the delivery guys was very friendly and on time.", "rating": 5}, {"title": "Everyone was very knowledgeable.", "text": "Everyone was very knowledgeable.Everyone was very courteous.  ", "rating": 5}, {"title": "Professional and nice staff", "text": "Date of experience: September 18, 2024", "rating": 5}, {"title": "Nice, no pressure buying experience ", "text": "Keith and Vernon were really nice and very patient with me.  I really enjoyed working with both of them. They made the experience enjoyable.   ", "rating": 5}, {"title": "The salesperson did an awesome job.", "text": "I found what I was looking for at a fantastic price.", "rating": 5}, {"title": "Tristan was great in helping us", "text": "Tristan was great in helping us. Very professional. ", "rating": 5}, {"title": "An enjoyable buying experience", "text": "Both Alejandra and Jasmine were attentive and accommodating to our questions and order. Each woman showed a high level of professionalism and courtesy that made our experience that much more enjoyable.", "rating": 5}, {"title": "Excellent customer service", "text": "Excellent customer service! Very welcoming and satisfying experience. Staff was awesome! ", "rating": 5}, {"title": "PaytonOur salesperson", "text": "Our salesperson, Payton, was very pleasant and didn’t pressure us at all. He checked on us several times as we looked around the showroom. When we found the couch we liked he was very professional through out the sales process.", "rating": 5}, {"title": "Very happy customer ", "text": "Me and my wife were greeted at the door by one of your salesmen Cody @ the Hudson Oaks location. We knew what we were looking for and he lead us to exactly what we ask for. He was very helpful from the selection of the color to the size and functionality of the pieces. We are return customers and were very happy with the service we received in the past", "rating": 5}, {"title": "Cameron & Daniel at the Lake Worth…", "text": "Cameron & Daniel at the Lake Worth location were so helpful and informative. We appreciated their help with our new couches! ", "rating": 5}, {"title": "The delivery was set for 1:30pm-5:30pm…", "text": "The delivery was set for 1:30pm-5:30pm but they arrived an hour early and assembled everything in good timing. I love the fact that I started receiving messages the day before up until the time the driver was outside of my house. I asked that the driver wear shoe covers and they did just that without a problem. Now I need to purchase the bedroom set I fell in love with. ", "rating": 5}, {"title": "Can’t wait to get my furniture!!!", "text": "Doc was our sales associate at Home Zone in Hudson Oaks. From the time we walked in he knew exactly what I was talking about. He answered every question we had. He helped us all the way through the process and made it super simple! ", "rating": 5}, {"title": "So many things made our Home Zone…", "text": "So many things made our Home Zone experience great. The quality of the furniture is far above competitors, the sales staff don't pester or stalk you through the store, yet they are extremely helpful when needed. The buying experience was quick and straight forward. The sales staff were so great, especially Andrea who we worked with. Her smile, enthusiasm and knowledge about the products made the experience actually enjoyable. They have earned our business going forward. ", "rating": 5}, {"title": "Quick and easy purchase and fast…", "text": "Quick and easy purchase and fast delivery. ", "rating": 5}, {"title": "Great experience buying furniture ", "text": "I like that workers do not hound you about buying anything in the store. They were helpful.  ", "rating": 5}, {"title": "It was an easy purchase", "text": "It was an easy purchase. The lady that helped us was wonderful to work with. We received our delivery on time and the two gentleman that delivered the furniture were amazing! Thank you Home Zone", "rating": 5}, {"title": "People very helpful ", "text": "People were very helpful, very knowledgeable about furniture. ", "rating": 5}, {"title": "Great Experiences ", "text": "Always have amazing service with Home Zone! Even when the furniture breaks, they are on top of getting it fixed asap! Sam the general manager is amazing as well! ", "rating": 5}, {"title": "The Salesperson was great Friendly", "text": "The Salesperson was great Friendly, Helpful, Knowledgeable, and Never Pushy.", "rating": 5}, {"title": "Awesome customer service!", "text": "Awesome customer service!The team member Sam was helpful and got all our needs taken care. Excited for our furniture to arrive. ", "rating": 5}, {"title": "Home Zone in Arlington is GREAT!!", "text": "Great service and quality.  The price for my Hollywood Love Seat was VERY reasonable.  And it is perfect.  This is the second one I've bought from HZ and the 1st one is still in very good shape from 4 years ago.  I highly recommend them!!", "rating": 5}, {"title": "Candace is the best!", "text": "Candace helped us today, and she was a wonderful sales professional! So pleasant, and very knowledgeable! She listened intently to our needs, and quickly showed us options that fit very well. We shopped several other stores, and Candace made Home Zone our favorite furniture store in central Texas! We just LOVE her!", "rating": 5}, {"title": "Great selection and service", "text": "Great selection and service! Dornella was super helpful and knowledgeable and looking forward to getting our furniture soon.", "rating": 5}, {"title": "Jeff was extremely helpful and kind.", "text": "Date of experience: September 21, 2024", "rating": 5}, {"title": "Very professional", "text": "Very professional, fast & kind.", "rating": 5}, {"title": "Thomas is a great sales associate", "text": "Thomas is a great sales associate. Reason I came back to that location ", "rating": 5}, {"title": "Great shopping experience!", "text": "The variety of furniture was plentiful and the prices were reasonable for the quality of the items.  ", "rating": 5}, {"title": "The hospitalty was great!", "text": "The hospitalty was great! Our Sales rep was amazing and the manger as well. Everyone was super friendly and you felt like family, not just a customer.", "rating": 5}, {"title": "Would recommend! ", "text": "Great quality furniture at a great price. Would definitely recommend to others! Delivery was smooth and quick as well. ", "rating": 5}, {"title": "Great customer service", "text": "Great customer service ", "rating": 5}, {"title": "Great people and service", "text": "Great people and service ", "rating": 5}, {"title": "Indecisive", "text": "We kept going back and forth on the style of couches . Tyreck was really helpful. We signed on one set of couches and turns out they were going to be too big for our space. I called and he was able to switch to our second choice. Super easy and helpful ", "rating": 5}, {"title": "good location friendly helpful", "text": "Lots to choose from helpful staff", "rating": 5}]