[{"title": "Such a great company! ", "text": "Such a great company. Made the process very streamline, and they were extremely efficient during all stages. Highly highly recommend them, they are the best out there! Very grateful to have found this company and the service that they provide. Thank you figure!", "rating": 5}, {"title": "Easy to use no pressure to finish which…", "text": "Easy to use no pressure to finish which I appreciate since I like to go over the he documents at my pace. Very helpful staff made everything very smooth.", "rating": 5}, {"title": "They were very helpful in assisting us…", "text": "They were very helpful in assisting us with our problem online and in answering our questions.  We were amazed on how fast they approved our loan and fulfilled their pledge of funding the loan in 5 days.", "rating": 5}, {"title": "Awesome Process", "text": "Initially, I was suspicious of the Ease of using Figure.  After reviewing users' experiences with the platform, I decided to apply.....The process was increadibly easy.  Very simple to understand and follow.  From Initial \"See My Rate\" program to Funds being deposited into my Bank, it was a matter of about a week, including the weekend.  ", "rating": 5}, {"title": "Exceptional customer experience", "text": "I liked the ease of the online application. I really liked the amazing customer service I received when I needed to call with questions and issues.  I also liked the eNotery experience.", "rating": 5}, {"title": "Easy does it", "text": "The ease of doing business. I believe it took 7 or 8 days to have the funds in my bank account.  Minimal paperwork.  Fees were compatible to other online lenders.  The interest loan was a little less than Avian. I believe I'm saving $25-$30 a month with Figure. I did apply with Discover because they have No fees.  I gave up on the application because they ask for way to many Docs and take 6 - 8 weeks to fund the loan. Plus Discover kept asking to resubmit paperwork. Figure ask for minimal paperwork. Once I'm done repaying this loan.  I'll be seeking a big loan to help me build my beach house", "rating": 5}, {"title": "Company was fast very helpful and a…", "text": "Company was fast very helpful and a good explanation on the process", "rating": 5}, {"title": "The process and its digitization…", "text": "The process and its digitization experience made it so easy to accomplish this loan. Thank you!", "rating": 5}, {"title": "Smoothest experience of any loan I’ve…", "text": "Smoothest experience of any loan I’ve ever had n customer service was fantastic thx guys such a blessing for me n my family ", "rating": 5}, {"title": "So far it’s been one of the most…", "text": "So far it’s been one of the most easiest processes that I’ve ever experienced when trying to obtain a loan, before seeing your mailer, I tried to go through who I already have my mortgage with and it turned into a joke, I truly hope your company set a strong example for others to follow.i greatly appreciate you and will definitely highly recommend you to others.", "rating": 5}, {"title": "Couldn't ask for an easier process", "text": "Couldn't ask for an easier process. It was simple and straight forward. The only thing I would change is an option to opt out of the notary coming to me, an amazing service but should be an option. Do you need a notary? If yes click here if not print out sign appropriately and here is a label to overnight the documents.Not a complaint just a suggestion. Already have recommended to several people already.", "rating": 5}, {"title": "Could not be happier!", "text": "I had been nervous to apply for any type of home equity line of credit just because I know how cumbersome the process can be. I did a little bit of research and found some good reviews on figure so I decided to go for it. The process was exceptionally easy, completely automated and quick responses when I had any questions or concerns. I would 10/10 recommend them!", "rating": 5}, {"title": "how quick and easy it was to get the…", "text": "how quick and easy it was to get the additional funds I needed", "rating": 5}, {"title": "Great Experience!", "text": "The Process of applying for a loan was easy and clear. Everything was simple use navigate and was very understandable.  Great experience!!", "rating": 5}, {"title": "Process made easy", "text": "Hi Everyone! I wanted to share how wonderful my experience was. The process of filling out the information and receiving all the details upfront made everything incredibly simple and easy. I didn’t need to speak to anyone or go anywhere to get the paperwork signed—they came to me at a time that suited me best. The website is very user-friendly, with everything clearly laid out, and all the information provided answered any questions I had.", "rating": 5}, {"title": "Easiest Loan Process Ever", "text": "Easiest loan process Ive ever experiencedI have a very large amount of equity in my home, excellent credit and plenty of income but I was turned down by my bank, after 4 weeks of underwriting, for a HELOC because I am in an interest only period (even though I am paying the amortizing rate) on my first.  Figure approved me in days and I was fully funded in under 2 weeks.", "rating": 5}, {"title": "I couldn’t believe how easy the process…", "text": "I couldn’t believe how easy the process was.  It was all done online, it was quick, easy to understand, and streamlined.  It was a very good experience.", "rating": 5}, {"title": "Was impressed with the ease and speed…", "text": "Was impressed with the ease and speed in which the transaction was completed and funded.  The online process was efficient and amazingly quick.  As a CPA I was initially cautious with a completely online process, was especially surprised with the virtual notary process.  Very pleased with ease of uploading documents, E-signing and funding.  Definitely a five start product and service.  ", "rating": 5}, {"title": "Quick and Seamless.", "text": "Quick and Seamless.I wish I would’ve went with you all a few weeks ago rather than another lender who took a month to deny my HELOC.You all are the best in the industry, hands down!", "rating": 5}, {"title": "Staff is very knowledgeable and…", "text": "Staff is very knowledgeable and friendly. Easy application process, with help along the way. Would apply again in the future ", "rating": 5}, {"title": "Easy and quick from the application to…", "text": "Easy and quick from the application to the money in hand. All of the \"red tape\" is handled by FIGURE. Great experience throughout the process. ", "rating": 5}, {"title": "Everything moved along smoothly", "text": "Everything moved along smoothly and quickly- no delays, no hassles, no interruptions.  Process was clear and knew what to expect during every step of the way.  All virtual made it even that much better.  I would recommend this company.  ", "rating": 5}, {"title": "Fast and easy!", "text": "I have worked with figure twice and both times it was fast and easy. The reps are always ready on chat and will answer any question. The whole process happens quickly and only took me a few minutes to fill out the paperwork. ", "rating": 5}, {"title": "Wow! Financing that is EASY??", "text": "It is a simple, straightforward process with great communication. Plus I could do everything from my home from start to finish without talking to live people. Terrific!", "rating": 5}, {"title": "Quick and hassle-free!", "text": "Quick and hassle-free loan approval! I’ve received funding from Figure twice this year, with the first loan paid off through refinancing. I highly recommend them to all my friends and anyone in need of a HELOC. Trust me, Figure makes borrowing easy!", "rating": 5}, {"title": "Fast Funding", "text": "You had all my information and didn't have to provide anything other than a death certificate.  My wait was less than a week and I  was funded.  KUDOS FIGURE AND YOUR STAFF", "rating": 5}, {"title": "Nice Job!!!", "text": "They were very help in giving me an understand of what I was getting into. They were prompt in answering my questions. They gave me the best rate of several different companies. They did the transaction quickly. I received the money 3 business days after I was approved. All in all they were very professional in the way they handled every conversation I had with them.  ", "rating": 5}, {"title": "Excellent & Very Fast Servicing", "text": "This was one of the Quickest & Easiest Loan Processing Companies That I Have Ever Dealt With/If You Are Wanting To Do A HELOC, There Is No Better Company To Deal With. GREAT SERVICE/GO FIGURE. ", "rating": 5}, {"title": "Highly recommend!", "text": "This process was the most efficient, quick, and easiest transaction i have ever done. 90% of everything was done online and they sent a mobile notary to my house to complete what couldn’t be done online. That took 5 mins. I had my money in 9 days. Highly recommend! Thank you for simplifying what could be a complicated process. ", "rating": 5}, {"title": "This was extremely easy", "text": "This was extremely easy. I was shopping around and checked review and Figure had good reviews. The process could not have been easier and everything was clear. I had tried to do this with my bank, but it was just aggravating and they acted like it was a bother. I would recommend. ", "rating": 5}, {"title": "Very easy process and very convenient", "text": "Very easy process and very convenient, it doesn’t require any time out of your work schedule and that was great for me. ", "rating": 5}, {"title": "My experience with Figure was so…", "text": "My experience with Figure was so simple, I was doubting my own perception!  In just a few days the money was deposited into my bank account!  I was able to use equity in my home to pay off my credit card debt that had been overwhelming me financially.  I was barely able to pay just the interest on my credit card debt.  Now I just have one low monthly payment, and my credit card debt is gone!", "rating": 5}, {"title": "The process was seamless and the…", "text": "The process was seamless and the funding was quick.I highly recommend Figure for anyone interested in a HELOC", "rating": 5}, {"title": "Application was not difficult to apply", "text": "Application was not difficult to apply. Especially online method. As long all the documents needed are provided in timely matter, the approval is very quick. I was very impressed of the outcome. I also called the customer services for update and they were very helpful explaining the situation.For the online updates, need to really pay attention what's next. Explanation is very limited. Otherwise, call the customer service.", "rating": 5}, {"title": "Easy and quick", "text": "This was easiest loan process I’ve ever been through, and I’ve financed several homes and many vehicles. Even with a 3 day weekend, my funds were in my checking account 9 days after I started the application process. I did call customer service a few times with questions and found the reps to be professional, friendly, and patient; a winning combination for sure!", "rating": 5}, {"title": "Best loan experience ever", "text": "This has been the best experience I have ever had obtaining a loan of any kind. Every step of the process was quick and easy. Every step was laid out very well with plenty of documentation to make it easy to understand. Start to finish my loan was funded in about a week. I had to call customer service twice to have a question answered. Everyone I spoke with was very friendly and knowledgeable. And, I got the answers I needed the first time.I would definitely recommend Figure to anyone looking to obtain a loan.", "rating": 5}, {"title": "The fastest funding I've ever seen", "text": "The fastest funding I've ever seen.  I was pre-qualified on a Monday night.  Tuesday I was approved.  Wednesday evening I did the e-notary over the phone.  The money was pending in my checking account the next Monday.  A week turn around is phenomenal.", "rating": 5}, {"title": "Very proffesional , ", "text": "Very proffesional to the point, got my loanNo problem, i will recomment to others as they did to me, great stuff, ", "rating": 5}, {"title": "If you need it, they will come!", "text": "When doing my research, Figure was touted as one of the best for quick Heloc and I'm happy I went with them. The time it took from when I submitted my application to when the Heloc got funded was quicker than anticapted. I applied on 8/1 and was funded by 8/8, and that was with having to wait 2 days to get my documents notarized. The icing on the cake was the great rate I got,", "rating": 5}, {"title": "Application & Funding Process", "text": "Application process, closing process and funding were done within a two week timeframe. Very efficient and easy to do. We were able to do the application and supporting the documentation online. We appreciated the timeliness of being able to get a HELOC loan. ", "rating": 5}, {"title": "I applied for a HELOC to consolidate…", "text": "I applied for a HELOC to consolidate high interest credit cards and small home improvements.  Figure handle all paperwork in a timely manner. I was always informed throughout the process of the status of my application and received my funds within 9 days. So, if you do your part as far as giving Figure any neccessary documents they may ask for and complete the notary in a timely manner, you too will receive your funds expeditiously. ", "rating": 5}, {"title": "What made my experience great was how…", "text": "What made my experience great was how hassle free the process was from start to finish. Also, I was able to get a live representative on the phone to answer any question within a minute of calling. The completion time after my application is amazing, literally 4 days.", "rating": 5}, {"title": "We were looking into heloc options even…", "text": "We were looking into heloc options even with navy fed its was a hassle figuire from start to finish took about 9 days and they made it super easy I do recommend we paid off higher interest debt and lowered our dti and have a cousin now ", "rating": 5}, {"title": "Happy Camper", "text": "We were very happy with the pace at which our HELOC was processed. Also the whole process was not complicated.", "rating": 5}, {"title": "Figure was simple and easy to use!", "text": "Figure was simple and easy to use from beginning to end. The user experience on the app and online made the process easy to follow and track progress along the way. I was able to navigate the application process without requiring human intervention! I absolutely recommend Figure for HELOCs. ", "rating": 5}, {"title": "Seriously, look into this if your in the market for a loan...", "text": "The smoothness of the application and communication with the Figure team is outstanding. Very simple and straightforward process.  Funds arrived in a timely and as promised fashion and I have received follow up phone calls to make sure everything is satisfactory. I highly recommend using this company. ", "rating": 5}, {"title": "What a great experience going with…", "text": "What a great experience going with Figure. The representatives are knowledgeable, friendly, and responsive. You get connected right away, no waiting on hold for long periods. The process is quick and easy.Got an answer within minutes. The whole process from the initial application to receiving the deposit in my account was about 5 days! Quick, easy, and hassle-free. I highly recommend Figure, they are great!", "rating": 5}, {"title": "The process was smooth and quicker than…", "text": "The process was smooth and quicker than I thought. The employees were friendly and knowledgeable. No pressuring from the lender. ", "rating": 5}, {"title": "Quick and easy", "text": "Quick and easy. We had a few emails about the pictures of our ID’s not being clear but when we logged in, it didn’t show we needed to redo them. We call and they were quick with answers and very helpful. The whole process was easy and seamless.", "rating": 5}, {"title": "Very Streamlined Process", "text": "Very Streamlined Process.  It couldn't have been easier to get this process completed.  The automation setup is impressive and each step of the process couldn't be more streamlined.  The process of having a remote notary was new and made the process of validating my identity and signing paperwork very easy. ", "rating": 5}, {"title": "I recently secured a HELOC  thru Figure", "text": "I recently secured a HELOC thru Figure.  Having raised over $20 million for real estate and tech ventures over the last 35 years I’ve experienced every roadblock you can imagine when financing through traditional banks.  Figure.com is a refreshingly efficient change and makes conventional Bank Heloc financing obsolete.  I had some Trust Language issues that drew out my processing time to 10 days but that compares to 2 months my local bank was taking.  Figure is what the future of all home equity loan processing will look like.   ", "rating": 5}, {"title": "We had an awesome experience with…", "text": "We had an awesome experience with Figure.  Such an easy process and funded within 7 days!  Strongly recommend.  ", "rating": 5}, {"title": "Figure makes the process simple and…", "text": "Figure makes the process simple and easy. Banks make it difficult on obtaining a HELOC. Process took one week to process. With a bank would have taken a lot more time. From what I learned with their quick process is they know and understand a person that’s responsible and make their payments on time.I would recommend Figure to anyone that would qualify. Thanks Figure ", "rating": 5}, {"title": "The process was quick with great communication.", "text": "The process was quick and totally online with great/clear communication.  Emails were direct and to the point which streamlined the process. Extremely satisfied with this product and its delivery.", "rating": 5}, {"title": "Simple process!", "text": "The process was simple and the money was in my account within 1 day!", "rating": 5}, {"title": "The entire process was amazing", "text": "The entire process was amazing, I highly recommend using FIGURE! ", "rating": 5}, {"title": "The representative was very helpful in…", "text": "The representative was very helpful in the navigation of the system.  It took a very short time to complete the application and there was always someone available to explain all the forms and walk you through completion and signature.  Everyone was extremely helpful and understanding.  It took only a few days for the money to be deposited into my bank account.", "rating": 5}, {"title": "Very simply process for establishing a HELOC Line of Credit", "text": "The process to apply for a HELOC Line of Credit was very straightforward. Everything was done online. All Questions were answered in a timely manner. All communications were handled through email. No waiting on hold to talk with someone. There were no surprises and the loan was completed very quickly.", "rating": 5}, {"title": "Easy to apply", "text": "Easy to apply, fast service - 1 week between application and funding - and you kept me constantly updated along the way.  What's not to like?  I will surely recommend you in the future.", "rating": 5}, {"title": "The process was seamless with very good…", "text": "The process was seamless with very good communication and response time. Each associate that I dealt with knew exactly where I was with the loan and could pick up where I left off with another associate. Thank you for your great service. ", "rating": 5}, {"title": "Easy Process with Great Customer Service", "text": "The customer service team made the process so much easier than I expected.  Phone support was available within a few minutes when I called to get help regarding the online application.  We also received the loan within a week. ", "rating": 5}, {"title": "Great Experience and Fast", "text": "The experience was great, fast and the employees were very helpful and friendly.  I highly recommend this company.", "rating": 5}, {"title": "So completely easy", "text": "So completely easy. Process was super simple and convenient. I have not had to make a payment yet so we will see how that goes. But so far I am SUPER pleased with y'all. I also spoke to a great customer service rep in Reno who was super knowledgeable and helpful. Well done, y'all! 🤙🏻", "rating": 5}, {"title": "Wonderful process…", "text": "Wonderful process…. If you need access to your equity I would go through Figure again hands down.  We were very leery and saw a lot of mixed reviews but thru out the entire process, it was sooooo simple and fast.  I had a lot of questions and used the chat feature a lot and it was a live person and so helpful.  I don’t have a negative thing to say but will update later if anything changes. ", "rating": 5}, {"title": "Very happy…", "text": "It was quick and pretty straight forward. Would recommend to others", "rating": 5}, {"title": "Amazing Experience ", "text": "I wanted to express my appreciation for your loan process. From application to funding, it was incredibly easy and fast, taking less than 10 days. I don't believe any bank or financial institution has been able to match that speed.What stood out the most was how most documentation and verifications were done online in a timely manner. I am very satisfied with your services and will definitely use them again in the future. I've already recommended you to a friend who is currently in the process of funding, and I will continue to recommend your services to others.", "rating": 5}, {"title": "Process was quite quick", "text": "Process was quite quick. Ease of applying via website  Ease in getting hold of someone to answer questions or verify something.", "rating": 5}, {"title": "Great customer service and communication.", "text": "The process of getting my HELOC was great. Even when I had a connectivity issue when submitting paperwork the customer service was excellent and they did their best to help me through. Once everything was approved the funding was fast and I got updates every step of the way.", "rating": 5}, {"title": "This was the quickest loan I've ever done.", "text": "This was quick and easy. Everyone I delt with was professional and nice. The rate and terms were perfect and it funded in less than 5 days. You're awesome!!! I am a little confused with the credit union membership part but that's OK.", "rating": 5}, {"title": "Smooth and Hassle-Free Home Equity Line of Credit Experience", "text": "I was very surprised at how easy the process was to obtain a home equity line of credit with FIGURE. Every time I called and had a question, the representatives were very helpful. The emails I received were informative, and accessing the account online provided real up-to-date status information. I had a great experience with FIGURE, and I’m pleased with the process from start to finish.I definitely would recommend this company to anyone who’s looking for a home equity line of credit.", "rating": 5}, {"title": "Very customer friendly streamlined…", "text": "Very customer friendly streamlined application process and user friendly customer portal to draw, make payments and re-draw. Staff members reply quickly in detail via email to inquiries.  Very pleased I found company through browsing.", "rating": 5}, {"title": "This experience was too good to be…", "text": "This experience was too good to be true. I kept questioning if it was legit because it was SO EASY. I was approved in less than 2 mins. Submitted everything online in minutes, that was Friday. They sent a notary to my house to complete paperwork Monday, and I had my money Friday. 5 days. It was the easiest and most pleasant experience I have ever had with any lender! I never spoke to anyone, which is nice, because I hate dealing with people🤣but they were there if I needed them, and have a chat bubble anytime i had questions. I could not believe it!! Then the payments are great, the interest rate was better than competitors. 10/10 recommend.  And if you find yourself here from questioning if this can possibly be real, because it is such an easy process, IT IS INDEED!! I will say the only thing that some people may not like, is you are required to take out the full amount upfront, unlike traditional Helocs where you can take out as needed. This didn't bother us at all because we wanted to do this anyways!! And we still have a withdraw period where we can pull out money we have paid if needed. You will NOT find an easier or a more pleasant experience!! FIGURE CUSTOMER FOR LIFE!", "rating": 5}, {"title": "Easy application process!", "text": "There was an easy application process with transparency about the transaction. Short turn around time was helpful. ", "rating": 5}, {"title": "Thank you", "text": "Thank you, Figure! The process was easy and painless. I truly appreciate your help. ", "rating": 5}, {"title": "As advertised, streamlined, simple, fast!", "text": "I must give credit where credit is due.  As apposed to many other banks and credit unions who I've done business with for 10+ years and also had the opportunity to win my business, this application process was exactly what was advertised.  Once I uploaded the required documentation, I received a competitive offer shockingly fast.  Once I approved my offer, closing and distrobution was completed within 7 business days.  It was refreshing to see a lender deliver on service as advertised! ", "rating": 5}, {"title": "Great Tech!", "text": "I the technology they use makes the process extremely easy to use. Easiest loan that I’ve ever obtained.", "rating": 5}, {"title": "Awesome experience", "text": "Awesome experience. Everything was done online. There was  no appraisal except something they do online to figure value. Everything was completed and money in my account in less than a week.  I cannot remember the exact date of my HELOC.", "rating": 5}, {"title": "You guys rock!", "text": "You guys rock. Loans are stressful, but from start to finish, you guided me through the entire process. Here’s a huge thank you to all involved. Phil", "rating": 5}, {"title": "I’m amazed how quick and easy it was", "text": "I’m amazed how quick and easy it was! Mobile notary and all! There was no inconvenience on their part of timing or delays!?? I would recommend Figure to everyone. ", "rating": 5}, {"title": "Figure is awesome", "text": "Figure made this a super easy process and had competitive rates.  Would highly recommend and will go to Figure first for the next one.  ", "rating": 5}, {"title": "A pleasant experience throughout the whole process. ", "text": "This was such a pleasant experience from the beginning. Easy to apply with quick responses and excellent communication. Save yourself from the onslaught of offers with poor interest rates and start with Figure. You won’t be disappointed. ", "rating": 5}, {"title": "Figure made it quick and easy", "text": "Figure made it quick and easyGreat job", "rating": 5}, {"title": "Figure first next time.", "text": "I had forgot that I had a loan on auto pay with you and I tried to open an account with Aven. Well after 3 weeks of their stalling and I had to find a current statement from Figure then I said cancel Aven and proceed with Figure. I'm glad I did. Just a few firms and a notary then we were funded. Thank you Figure.com", "rating": 5}, {"title": "Quick and easy loan all done online! ", "text": "Getting a loan was all done online easily with money in our account in days!  We now have no more credit card debt! Everything is one lower payment we can afford and our house is our only debt now! We can afford to enjoy life again without constant worry! ", "rating": 5}, {"title": "Clear and concise procesd.", "text": "Date of experience: October 25, 2024", "rating": 5}, {"title": "Very fast no hassle loan company I…", "text": "Very fast no hassle loan company I really appreciate doing bus with you guys ..thanks", "rating": 5}, {"title": "My experience was a fantastic one", "text": "My experience was a fantastic one. It went quickly and smoothly. If there was an issue, they contacted me immediately, or I was able to reach out to them and have the issue quickly addressed.  In the end, the process was fast and painless. ", "rating": 5}, {"title": "Figure provided a simple path to a home…", "text": "Figure provided a simple path to a home improvement loan.   I had options tailored to my personal needs. ", "rating": 5}, {"title": "Loan process was simple and fast", "text": "Loan process was simple and fast. Communication was easy and fast. Upload of documents was clear and easy.", "rating": 5}, {"title": "Simple and Speedy", "text": "The process was very simple and quick. I needed to reach put to customer service, my request was promptly addressed and the representative was professional and pleasant. Thank you for simple and speedy service.  ", "rating": 5}, {"title": "Nice and Easy ", "text": "Everything was explained thoroughly and it made the process simple and smooth.  It only took 4-5 days for the money to come.  It was a great experience.  ", "rating": 5}, {"title": "It was a Very Pleasant Experience", "text": "It was a Very Pleasant Experience. Everything went smoothly & Meeting The Notary (Brenda Green) Was a Real Blessing.", "rating": 5}, {"title": "When I needed help", "text": "When I needed help, the representatives were there for me! They were very patient and professional in guiding me through the steps I needed to accomplish my application.", "rating": 5}, {"title": "It was efficient", "text": "It was efficient, thorough and hassle free. I received a very fair rate, and the whole master was handle promptly.", "rating": 5}, {"title": "Wow! Is all I can say!", "text": "Wow! Is all I can say. Figure is as advertised and so much easier than the traditional path. Highly recommended!", "rating": 5}, {"title": "Figure Financial great help when needed", "text": "Figure Financial gave a great impulse in my project. I’m very grateful for their support.I’ll suggest to include your requirement of the hazard insurance of the property in the application. ", "rating": 5}, {"title": "There were no issues", "text": "There were no issues. It was different for me not to complete this having talked to an actual person. Everything was done online and worked. ", "rating": 5}, {"title": "Efficient Application Process ", "text": "My application process was efficient and went smoothly till I received the loan.", "rating": 5}, {"title": "It was easy and user friendly...super…", "text": "It was easy and user friendly...super happy", "rating": 5}, {"title": "Great job!", "text": "The professionalism and helpfulness of your staff was beyond reproach. For me, they made the process very easy. Thank you all!", "rating": 5}, {"title": "Simple, fast and user friendly", "text": "Easy to use, good platform and very simple process to follow. Thank you Figure for making this process simple and fast!", "rating": 5}, {"title": "the company was good because  they stay…", "text": "the company was good because  they stay in contact whit all the time  the only set back is the waiting for the money goin to the bank  the rest its all good", "rating": 5}, {"title": "Every representative I spoke with was…", "text": "Every representative I spoke with was helpful, patient and helped me problem solve immediately, as they arose.", "rating": 5}, {"title": "It was an easy process the whole time…", "text": "It was an easy process the whole time for our loan.  Highly recommend them to anyone. ", "rating": 5}, {"title": "I was trying for 3 months to get a 2nd…", "text": "I was trying for 3 months to get a 2nd loan on property, so much headache. I tried this one night after being frustrated and it was done in an hour. And funded about a week in total later. Saved my escrow!! Thank you! ", "rating": 5}, {"title": "Very simple and fast!", "text": "Date of experience: November 01, 2024", "rating": 5}, {"title": "The process of obtaining the loan was…", "text": "The process of obtaining the loan was smooth and effortless. The technology uses by the company makes the loan application process easy and quick.", "rating": 5}, {"title": "Figure was so easy to work with", "text": "Figure was so easy to work with. All steps in the loan process moved along at a good, steady pace. They made it easy to close sending a notary to the house. I recommend using Figure.", "rating": 5}, {"title": "Ease of Use!", "text": "Availability, ease of use, rates, and overall experience. I'm especially a huge fan of your automation!!", "rating": 5}, {"title": "Easiest loan ", "text": "Easiest loan I ever had all electronic and very fast had funding in 4 days.  Awesome customer service.", "rating": 5}, {"title": "Pretty smooth and quick", "text": "Pretty smooth and quick.  I was surprised how easy fast it was to get a heloc done with you.", "rating": 5}, {"title": "Fast and easy process", "text": " I was skeptical and pleasantly surprised of how the process was so fast and easy.", "rating": 5}, {"title": "Fast Funding", "text": "Ease of applyingFast processingReasonable time from star to fundingNotary on wheels", "rating": 5}, {"title": "Easy On-line application ", "text": "Easy process on line. Help was a on-line Chat or phone call away.Approval was right away. Knew what we qualified for in minutes. ", "rating": 5}, {"title": "Very easy and seamless transaction.", "text": "Very easy and seamless transaction. ", "rating": 5}, {"title": "My experience was awesome very easy and…", "text": "My experience was awesome very easy and quick process.  I do want a Figure T-shirt.. ", "rating": 5}, {"title": "Excellent service", "text": "Excellent service. The process wasn’t complicated and very fast. In less than a week we had our money in the our bank account.", "rating": 5}, {"title": "Easy application", "text": "Easy application. Well documented. Fast approval time. ", "rating": 5}, {"title": "Everything was so easy", "text": "Everything was so easy. We were approved quickly and received our loan payment when promised. ", "rating": 5}, {"title": "The speed", "text": "The speed, ease and efficiency of the whole process.", "rating": 5}, {"title": "She was so professional in every way…", "text": "She was so professional in every way and gave me the answers to all of my questions in record time ", "rating": 5}, {"title": "Everything was great", "text": "Everything was great! Your web site was easy to understand and use.  Your customer service agents were very helpful. They really take their time and care about helping me to understand the process of getting my loan. I was greatly impressed with everything. I got my loan, I was also able to get the payments I asked for. So I am extremely happy. This takes a great stress of my shoulders, and helps to keep me health.  You see I got this loan to repair my leaking roof.  Because my roof  leaks mold was starting to grow on my ceilings.  I have Asthma and C.O.P.D.   So the mold is a life threatening thing to me.  So as I said this loan not only takes the stress off my shoulders, but also helps to save my life.  ", "rating": 5}, {"title": "It was quick and easy!", "text": "It was quick and easy, and provided the financial solution we were looking for!", "rating": 5}, {"title": " Super streamlined process", "text": "The steps were very streamlined and easy to complete. Loved the on-line notary service.", "rating": 5}, {"title": "Whole process was simple and easy", "text": "Whole process was simple and easy!  Highly recommended.", "rating": 5}, {"title": "Process is completely on line", "text": "Process is completely on line.  Very quick funding. Couldn't be easier.", "rating": 5}, {"title": "Timing", "text": "Timing, respectful and to the point, no delays, this company is one of the best, I ever worked with!", "rating": 5}, {"title": "They processed my loan very quickly", "text": "They processed my loan very quickly. And anytime I had a question they were quick to answer. Also very kind and courteous all the way through ", "rating": 5}, {"title": "Easy process", "text": "The company works with you and explains the steps to get your money processed to your bank quickly.", "rating": 5}, {"title": "This was the most streamlined and…", "text": "This was the most streamlined and simple process for a loan I have ever experienced ", "rating": 5}, {"title": "FLAWLESS Experience", "text": "FLAWLESS Experience.  From initial application to funding about a 5 day period, Very easy to upload proper documents needed and they offered a competitive interest rate. Id recommend 100%", "rating": 5}, {"title": "The process was simple enough and it…", "text": "The process was simple enough and it took less than a week to get the money that I needed.", "rating": 5}, {"title": "It was a simple process", "text": "It was a simple process, all done online, the wholesale and direct system is kinda screwd I think ,wouldn't be the way I would do it, the only thing I have a problem with is the no business accounts  when it comes to income verification.  In the USA a single member LLC is a pass thru entity which means those single member LLC business accounts are also income ,they are for the irs, they should be here too but they are not, so you are basically taking away income from a single member LLC owner by not allowing those business accounts to be accessed for income verification ", "rating": 5}, {"title": "They provided quick responses to my…", "text": "They provided quick responses to my inquiries and quick funding.", "rating": 5}, {"title": "Everyone is very helpful with the help…", "text": "Everyone is very helpful with the help needed.I’m so happy for being a customer .", "rating": 5}, {"title": "Everything was fast and easy", "text": "Everything was fast and easy. Great experience so far!", "rating": 5}, {"title": "User Friendly and Time Effective", "text": "The whole process was very user friendly, easy to understand, and time effective.", "rating": 5}, {"title": "Very easy experience", "text": "Very easy experience! Easy quick decision. Many options for payback. Paperwork was easy to navigate.", "rating": 5}, {"title": "It was a great experience simple clear…", "text": "It was a great experience simple clear they answered all my questions. ", "rating": 5}, {"title": "This was a quick process that was not a…", "text": "This was a quick process that was not a hassle. Appreciate Figure", "rating": 5}, {"title": "The loan process was fast and efficient.", "text": "The loan process was fast and efficient. ", "rating": 5}, {"title": "Quick and easy process!", "text": "Date of experience: October 10, 2024", "rating": 5}, {"title": "Clarity!", "text": "From start to finish and the service after, everything was SO CLEAR!", "rating": 5}, {"title": "The assistance I received was…", "text": "The assistance I received was professional and courteous. Process was thorough and arrived at in a reasonable amount of time.", "rating": 5}, {"title": "Best HELOC ever", "text": "So seamless and simple. This was my best financial experience ever. Fast and professional.", "rating": 5}, {"title": "Unbelievably easy and did everything…", "text": "Unbelievably easy and did everything online, by far the best lending process I’ve experienced.", "rating": 5}, {"title": "Simple application process and…", "text": "Simple application process and verification. Customer service was very responsive and courteous . I received my funds in exactly five business days. ", "rating": 5}, {"title": "Extremely easy process from start to…", "text": "Extremely easy process from start to finish ", "rating": 5}, {"title": "Highly satisfied. ", "text": "Simple, efficient and transparent. Perfect example of how FinTech and digital economy can improve upon existing financial products at brick-and-mortar banks. Amazing experience; Highly satisfied.  ", "rating": 5}, {"title": "From start to finish in just a week! ", "text": "Quick approval and quick funding. Can't get any better then that! ", "rating": 5}, {"title": "Since I am in a wheelchair", "text": "Since I am in a wheelchair, it was very easy to complete the process ", "rating": 5}, {"title": "easy way", "text": "it was easy and all online except one easy phone call to a notary.", "rating": 5}, {"title": "you are simple the best!!", "text": "you are simple the best!!! thank you so much for your help. greatly apreciate it.", "rating": 5}, {"title": "The process was extremely user friendly…", "text": "The process was extremely user friendly and the personnel very supportive.", "rating": 5}, {"title": "The people were very pleasant and it…", "text": "The people were very pleasant and it was fast.", "rating": 5}, {"title": "Quick, easy and great service.", "text": "The complete process was very easy and quick, from the application to finalization of funds.", "rating": 5}, {"title": "Easy to fill out application and…", "text": "Easy to fill out application and complete notarized signatures.", "rating": 5}, {"title": "This was a great experience for me and my family. It put us in a great spot going forward. And the process was quick and easy.", "text": "I am very happy with the results. And give great praise to the people that walked me through this. Thanks!!", "rating": 5}, {"title": "The entire process was so simple.", "text": "The entire process was so simple. ", "rating": 5}, {"title": "Very fast and easy process money in 8…", "text": "Very fast and easy process money in 8 days.", "rating": 5}, {"title": "It was so easy", "text": "It was so easy! It only took a few minute to apply, I had the money in my account within days. ", "rating": 5}, {"title": "The process", "text": "The process, was amazingly fast, simple and straightforward. ", "rating": 5}, {"title": "Very quick and easy approval process.", "text": "Date of experience: July 28, 2024", "rating": 5}, {"title": "was easy to apply for the loan", "text": "was easy to apply for the loan, fast and everybody was very good. everything online and made it quick.", "rating": 5}, {"title": "I loved all of the integrations that…", "text": "I loved all of the integrations that allowed for painless verification of credit, income, value, etc.", "rating": 5}, {"title": "Fantastic! ", "text": "The process was fast and truly a blessing to me when I needed it the most! ", "rating": 5}, {"title": "The best HELOC ", "text": "Great Costumer service & easy and transparent process", "rating": 5}, {"title": "Fast processing with reasonable rates", "text": "Date of experience: August 29, 2024", "rating": 5}, {"title": "Positive ", "text": "The process was very easy and made my experience wonderful and your customer service very helpful.", "rating": 5}, {"title": "Perfect ", "text": "Easy, fast and great customer service. ", "rating": 5}, {"title": "Great experience ", "text": "The process was quick and easy to work through. ", "rating": 5}, {"title": "It was a very simple process!", "text": "It was a very simple process to get the loan, and it was easy to apply. ", "rating": 5}, {"title": "Excellent customer care service", "text": "Excellent customer care service. No hassle Easy process Fast deposit", "rating": 5}, {"title": "Fast and Easy", "text": "Easy, transparent, fast, and straightforward process. simply amazing!!", "rating": 5}, {"title": "Very easy process and quick!", "text": "Date of experience: September 18, 2024", "rating": 5}, {"title": "Very easy and fast", "text": "Very easy and fast. Excellent customer service. ", "rating": 5}, {"title": "Figure HELOC was the Best Choice for me. ", "text": "The ease of applying and the speediness of being able to communicate with a representative. ", "rating": 5}, {"title": "Very quick process from start to finish!", "text": "Date of experience: June 14, 2024", "rating": 5}, {"title": "Overall my experience was phenomenal", "text": "Overall my experience was phenomenal. The timing was extremely quick and communication throughout was on point.", "rating": 5}, {"title": "Great service", "text": "Great service ", "rating": 5}, {"title": "Very easy fast and reliable.", "text": "Very easy fast and reliable. ", "rating": 5}, {"title": "Fast", "text": "Fast, easy, nothing hidden…. ", "rating": 5}, {"title": "Easy easy 👌 excelente service", "text": "Easy easy 👌 excelente service ", "rating": 5}, {"title": "The customer representatives were…", "text": "The customer representatives were excellent in answering all of my questions and very patient. ", "rating": 5}, {"title": "Very easy and fast", "text": "Very easy and fast ", "rating": 5}, {"title": "It was easy and fast.", "text": "Date of experience: October 01, 2024", "rating": 5}, {"title": "It was very easy and quick", "text": "It was very easy and quick, plus very helpful ", "rating": 5}, {"title": "Very proffesional ", "text": "Very proffesional , service is excelent", "rating": 5}, {"title": "Easy and smooth", "text": "Easy and smooth, in all aspects", "rating": 5}, {"title": "Very easy process!", "text": "Date of experience: June 17, 2024", "rating": 5}, {"title": "Excellent and intuitive experience", "text": "Excellent and intuitive experience, the process was fast and easy to understand.", "rating": 5}, {"title": "The process was very easy and fast.", "text": "Date of experience: July 05, 2024", "rating": 5}, {"title": "Fast", "text": "Fast, convenient and competitive pricing", "rating": 5}, {"title": "Understandable through the entire…", "text": "Understandable through the entire process ", "rating": 5}, {"title": "easy easy easy easy easy easy easy easy…", "text": "easy easy easy easy easy easy easy easy easy there", "rating": 5}, {"title": "Great experience highly recommended", "text": "Date of experience: August 24, 2024", "rating": 5}, {"title": "Quick and easy!  ", "text": "Excellent experience ", "rating": 5}, {"title": "Easy and fast.", "text": "Date of experience: August 09, 2024", "rating": 5}, {"title": "service!!.", "text": "Date of experience: July 25, 2024", "rating": 5}, {"title": "Efficiency", "text": "Efficiency ", "rating": 5}, {"title": "It was great..it was a easy process…", "text": "It was great..it was a easy process from the beginning to the end..I will definitely spread the word...best company hands down.", "rating": 5}, {"title": "Det it done now!", "text": "This process is faast and efficient. And you get a 10 plus for great customer service start to finish. My whole family thanks you!", "rating": 5}, {"title": "The whole process was super easy and I…", "text": "The whole process was super easy and I got progress updates throughout. ", "rating": 5}, {"title": "Amazing!! I'm so glad I found this!!!", "text": "Great experience! I applied for a loan from a credit union 5 months ago and was denied? ended up paying 18% through another loan company for the loan! I've been searching for a good debt consolidation place for a while and this is the place for sure! Had a hiccup in the beginning because I had a credit lock but after I talked on the phone to this lady I was approved in no time and got my money in less than 10 days! Seamless fantastic operation!", "rating": 5}, {"title": "Our experience from the beginning was…", "text": "Our experience from the beginning was excellent. Great customer service. They made things easy and explained every question my wife had.", "rating": 5}, {"title": "Just want to say that the whole process…", "text": "Just want to say that the whole process was so transparent. Figure has given us very professional individuals to get our process taken care of. We would recommend Figure.", "rating": 5}, {"title": "From start to finish with Figure", "text": "From start to finish with Figure, as Iong as I had the needed information to complete my application, the process moved along with impressive ease. If I had a question, it was always answered completely and professionally. Once I completed the application process, the funds were in my account in just a few days--so great! Thank you so much!", "rating": 5}, {"title": "Answered every question professional…", "text": "Answered every question professional and timely", "rating": 5}, {"title": "Good customer service both on line and…", "text": "Good customer service both on line and on site, quick loan process they make sure you understand every detail about your loan. ", "rating": 5}, {"title": "Process was easy, fast and wonderful prople", "text": "Process was easy. Communication was great and everything went through quickly from start to finish ", "rating": 5}, {"title": "The entire process was very simple", "text": "The entire process was very simple. Customer service was very helpful along the way and super fast funding!", "rating": 5}, {"title": "This was the easiest loan I have ever…", "text": "This was the easiest loan I have ever obtained. They have definitely streamlined the process for a HELOC loan. I would recommend them for anyone looking for an affordable HELOC. ", "rating": 5}, {"title": "This without a doubt was the easiest…", "text": "This without a doubt was the easiest process I’ve ever done ~ the fact that it was all done on line was amazing ~ Quick too ~ I’m still amazed ~~ ", "rating": 5}, {"title": "Very easy", "text": "Very easy, and smooth process ", "rating": 5}, {"title": "Great process ", "text": "The whole process was very easy and professional. Every representative was very kind and things went through very fast. Thanks again!", "rating": 5}, {"title": "How easy the process was. Thanks ", "text": "We were able to do the application on my iPad and it was fast and easy. Thanks ", "rating": 5}, {"title": "For the professional,and quick…", "text": "For the professional,and quick response.Stepping up when I really needed financial support.Better then my own Bank I've been affiliated with for 16 years,with a better interest rate.I'll recommend you to all my family and friends.Thank you Figure for being there..", "rating": 5}, {"title": "This was my second time using Figure in…", "text": "This was my second time using Figure in the last 90 days. The service is quick with no red tape like banks and credit unions. They give you the best equity for your property with no Hassel.  If you need a HELOC loan, Figure is the way to go.", "rating": 5}, {"title": "Transaction went exactly has described", "text": "Transaction went exactly has described.  Good communication and ease of under standing.", "rating": 5}, {"title": "Happy customer!", "text": "Very smooth easy transaction and funds came quickly. Thank you Figure!!", "rating": 5}, {"title": "My experience with FIGURE was terrific. ", "text": "My experience with FIGURE was terrific. The application process and all the information provided helped me achieve the goal I was looking for in acquiring a HELOC. I can see why FIGURE has the reputation it has built over the years.", "rating": 5}, {"title": "Thank you for the seamless process from…", "text": "Thank you for the seamless process from start to funding of our loan.", "rating": 5}, {"title": "The process was simple and quick and…", "text": "The process was simple and quick and all online.  Never once did I speak to someone on the phone.  I was not bounced around constantly asking for extra paperwork, unnecessary home inspections and constant phone calls.  I provided proof of income, they gave me a fair rate and I accepted.  Within only a day or 2, they set up a notary to come to my house on a Saturday to sign the paperwork and I was funded within 5 business days.  I highly recommend Figure and will definitely use them again!  Incredibly good experience!", "rating": 5}, {"title": "Thank you so much for your offer", "text": "Thank you so much for your offer. Of course I took it and cleaned up a ton of debt. Haven’t made my first payment yet but hope all goes well with that as well.", "rating": 5}, {"title": "HELOC Application 05/07/2024", "text": "We applied for a HELOC 05/07/2024. The application was a smooth transition. Everything was online and  easy to follow. The funds were received already on 05/22/2024. GREAT!!!", "rating": 5}, {"title": "Even with my screw up", "text": "Even with my screw up, it was still a quick process", "rating": 5}, {"title": "Awesome communication", "text": "Awesome communication, excellent customer service and seamless process. Best experience I ever had I terms of loan process. ", "rating": 5}, {"title": "Easy process.", "text": "Ease of applying for and funding process.", "rating": 5}, {"title": "The process was efficient", "text": "The process was efficient.  Steps easy to apply and timely.", "rating": 5}, {"title": "Easy approval all online no hassle free…", "text": "Easy approval all online no hassle free loans.", "rating": 5}, {"title": "I had some trouble linking my bank and…", "text": "I had some trouble linking my bank and getting my tax records. I had to call in a couple times and your customer service was really great. Professional, friendly, and knowledgeable! ", "rating": 5}, {"title": "Problems resolved by GREAT staff", "text": "We had trouble with being repeatedly disconnected from the Notary process. OUR fault, I am simple tech capable, Wonder Hubbie NOT at all. The staff we spoke with were so KIND & PATIENT with us, they absolutely DESERVE 5 Stars for their efforts! We are definitely impressed with the high level of professionalism we encountered. ", "rating": 5}, {"title": "Simple!", "text": "The process was just simple and clear, objective cleared and obtained in just a number of days.  I am satisfied with FIGURE since years ago...  ", "rating": 5}, {"title": "A Breeze From Start to Finish ", "text": "Figure took what has historically been a tedious process, involving piles of paper and multiple appointments, and turned it into something secure, quick, and simple.", "rating": 5}, {"title": "Figure treasures time! ", "text": "I enjoyed the timing of the entire process - from start to finish. I appreciate that I can log in and chat with a live representative right away (after personal verification). ", "rating": 5}, {"title": "Excellent process. ", "text": "Figure is a wonderful financial lending institution that makes the borrowing process simple, fast and easy online.Everything can be done online with high security and ease. From loan application to disbursement of funds takes a mere five days. And that was including weekends. The rates are fair and the monthly payments are affordable depending on how many years you want to pay Figure back. I chose the lesser years and it was still within my price range. Great experience and transaction. Thank you Figure. ", "rating": 5}, {"title": "The process was easy and expeditious.", "text": "Date of experience: May 09, 2024", "rating": 5}, {"title": "PERFECT TIMING", "text": "All employees were very helpful. The process was very fast. The only on thing that I had trouble with was the application. I never clicked on Submit because I had a question about security, As I sat in front of my computer calling Cust .Service, the system took off and submitted with the 0's I placed in the SS Box. It took over 48 hrs to finally get that cleared. Other than that, everything was perfect. I would recommend FIGURE to anyone who doesn't want to waste time. No waiting for 30 day Appraisal, No waiting to draw up Docs, No strange fees on Draws. The price seems fair since my local back was going to take 30 days to complete and have the loan float at Prime which is another 1% with the fees, etc. I'm excited to make repairs needed to my home and move on ! I'm glad I stumbled across your business. Thank you !  Kim", "rating": 5}, {"title": "Very quick process.", "text": "Date of experience: May 10, 2024", "rating": 5}, {"title": "Easy to apply@", "text": "Easy to apply!  Everything was very timely!  No hassles!", "rating": 5}, {"title": "Perfect online ex", "text": "Figure was flawless in how it presented the online experience in answering the questions.  The notary by video was pleasant and professional.  I hope to use your services again in the future.", "rating": 5}, {"title": "Almost too easy", "text": "Almost too easy. Extremely efficient, fast. ", "rating": 5}, {"title": "Easy to apply no headache process quick funding", "text": "Easy to apply, no headache process ", "rating": 5}, {"title": "The speed and ease of the process was…", "text": "The speed and ease of the process was phenomenal. I’d recommend figure to anyone! 10 of 10", "rating": 5}, {"title": "Great Experience very smooth process‼️", "text": "Date of experience: May 11, 2024", "rating": 5}, {"title": "It was fast and easy every step of the…", "text": "It was fast and easy every step of the way. ", "rating": 5}, {"title": "Everyone we talked to was very nice and…", "text": "Everyone we talked to was very nice and even though it took awhile to close our loan they found some issues with our deed and brought it to our attention so we were able to correct it.  So we had a very good experience with them", "rating": 5}, {"title": "Simple Loan Process ", "text": "The HELOC loan process was very smooth and simple. My loan was fully approved and funded in 5 business days. ", "rating": 5}, {"title": "Always great to work with them this is…", "text": "Always great to work with them this is the second time that we have the pleasure to work with Figure thanks.", "rating": 5}, {"title": "Fast, Smooth and downright AMAZING!", "text": "I have never had such a smooth experience with a lending institution.  Your system is spot on (I own a software company).  The ease of use, speed and ability to do EVERYTHING on line was incredible!", "rating": 5}, {"title": "Application process is fairly easy and…", "text": "Application process is fairly easy and the rates they offer is reasonable.  Communication through out the process from the start is excellent.", "rating": 5}, {"title": "Easy to deal with", "text": "Easy to deal with. No issues with receiving the loan", "rating": 5}, {"title": "Figure Home Equity Loan Process is what…", "text": "Figure Home Equity Loan Process is what you would called, State of the Art! I have never in the past did a loan that went so smooth. Excellent Customer Service, I say keep up the Good Work!!!", "rating": 5}, {"title": "Quick and Painless HELOC", "text": "Super simple to apply. Happy with the result, and how quick and painless the process was. Longest part is waiting for notary docs to arrive and be reviewed since I'm in a state that doesn't allow remote. I would recommend Figure to anyone looking to apply for a HELOC that isn't looking for traditional process. Everything was online (except my signing) and was able to just link accounts to prove my salary, ID, etc. I will follow up with an update as time goes on, though I expect it to be just as simple as the rest.", "rating": 5}, {"title": "The ease and speed of the entire…", "text": "The ease and speed of the entire process was second to none.", "rating": 5}, {"title": "The loan process was very easy and fast.", "text": "Date of experience: May 02, 2024", "rating": 5}, {"title": "WOW! If you need some of your Equity, Figure is your answer!!", "text": "WOW!!  Amazing process, fairly straightforward, simple & painless!!Was able to tap into 3X's the amount as a previous group that kept running into snags!!", "rating": 5}, {"title": "Figure is the absolute TRUTH!!", "text": "Figure is the absolute TRUTH!!! I was a little leary at first because I hadn't heard of them but I decided to give them a try. I applied to Figure, 2 of my credit unions and Figure not only provided me the smoothest process I got my money fast!! Literally took 5 business days. So if you were still on the fence or wondering-DON'T!! I need the traditional banks and credit unions to catch up because they're still stuck in the 80s. ", "rating": 5}, {"title": "The process was seamless and timely.", "text": "Date of experience: April 10, 2024", "rating": 5}, {"title": "I enjoyed this experience.", "text": "I enjoyed this experience. Company folks are knowledgeable and friendly. A positive experience I’d recommend your company to anyone. ", "rating": 5}, {"title": "Amazingly quick and easy", "text": "Date of experience: April 23, 2024", "rating": 5}, {"title": "Customer service is always readily…", "text": "Customer service is always readily accessible and helpful! The entire process was much easier than I would have ever imagined! ", "rating": 5}, {"title": "Company did what they said", "text": "Company did what they said. I was approved, got the loan hassle free and quickly ", "rating": 5}, {"title": "I liked it was all on line", "text": "I liked it was all on line. It was easy to do and fast. ", "rating": 5}, {"title": "The loan process was very fast and…", "text": "The loan process was very fast and simple. Everything was smooth and they pick up the phone when you call.", "rating": 5}, {"title": "Very simple process went quickly if I…", "text": "Very simple process went quickly if I had any questions I was given professional and adequate response the people were respectful and kind in there answers to my questions.", "rating": 5}, {"title": "Purely just the ease of the whole…", "text": "Purely just the ease of the whole process after speaking with oh so many providers.", "rating": 5}, {"title": "Pretty straight forward", "text": "Pretty straight forward,  let us know what was happening each step of the process. Money came quick. ", "rating": 5}, {"title": "Seamless and easy process", "text": "My loan application and the entire process was seamless and easy! I was astounded. I’m thankful!", "rating": 5}, {"title": "Quick and simple ", "text": "Our experience was very easy and we had our money very quickly ", "rating": 5}, {"title": "HELOC ", "text": "So far, everything has gone well.", "rating": 5}, {"title": "The time it took from start to finish…", "text": "The time it took from start to finish that allowed me to take my life to the next level", "rating": 5}, {"title": "Easy application process", "text": "Easy application process ", "rating": 5}, {"title": "Everything was very easy to do online…", "text": "Everything was very easy to do online they walk you through step by step and closed quickly and received are funds fast highly recommend ", "rating": 5}, {"title": "Finally a better way for a HELOC! Be done with the banks!", "text": "If you value your time, use Figure. If you value a crisp and clean process built with modern day technology, use Figure. The whole effort to obtain a HELOC for me was under two hours. 15 minutes to answer a series of questions from my phone and one hour in total to upload documents and use my webcam to attest the note agreement with an online notary. How progressive!! When I asked my current HELOC bank to update my unused line of credit they said I have to go through a whole new process from scratch. Two weeks later and a barrage of more questions and evidence they eventually burned through my patience. Long live Figure.com. I pray no bank buys them out. I will eventually cancel my current stodgy bank and have Figure replace them when I get chance.", "rating": 5}, {"title": "Very easy", "text": "Very easy, fast.", "rating": 5}, {"title": "The loan process was easy", "text": "The loan process was easy, and the waiting period was as predicted.", "rating": 5}, {"title": "I was in debt after the pandemic and…", "text": "I was in debt after the pandemic and never fully recovered. Figure helped me so much and I very grateful. ", "rating": 5}, {"title": "Sometimes people need to borrow money", "text": "Sometimes people need to borrow money. My situation was to pay for a slightly early retirement with a pension.  I needed funding to help me buy out and get through this career step. I don't know of any other companies offering the product you offer, especially with the terms., i.e., 30 years with competitive rates in the HELOC market. You made possible for me and my family something that couldn't be accomplished any other way. A thank you is in order.", "rating": 5}, {"title": "Im ready surprise figure is a amazing…", "text": "Im ready surprise figure is a amazing team In few days I got my loan done ✅ Thanks so much. Great job I’m very happy about it ", "rating": 5}, {"title": "Easy Process", "text": "Date of experience: April 12, 2024", "rating": 5}, {"title": "Quick and easy!", "text": "Very easy process, communicated well about progress, was able to get everything wrapped up pretty quickly without any problems. Every online experience should work this well.", "rating": 5}, {"title": "It was quick and easy with no red tape/…", "text": "It was quick and easy with no red tape/ hassle!!I loved the experience!! ", "rating": 5}, {"title": "Didn't take as long as it does going…", "text": "Didn't take as long as it does going through the bank. ", "rating": 5}, {"title": " Seamless experience ", "text": "I had made an interstate move since my last dealings with Figure Lending. Despite all of the new information required, the overall experience was relatively seamless.", "rating": 5}, {"title": "The process was very easy and didn't…", "text": "The process was very easy and didn't take to long to get approved .", "rating": 5}, {"title": "Website friendly", "text": "The website was extremely friendly and easy to use. During the process, I never had to contact support for any reason.  Everything was a simple point and click or a very easy to use upload for documents. Links worked as they should with no issues.", "rating": 5}, {"title": "Super easy application process with a…", "text": "Super easy application process with a quick turnaround time.  ", "rating": 5}, {"title": "Figure support staff was excellent From…", "text": "Figure support staff was excellent From start to finish on the loan.", "rating": 5}, {"title": "Fast and Easy", "text": "This loan process was the least intrusive and most timely process I've ever experienced. Super fast and easy.", "rating": 5}, {"title": "I went to 10 different banks and got…", "text": "I went to 10 different banks and got denied because of Debt-to-income ratios. I had over $450k in equity in my house and wanted some of it to cover all of my debts so my high balances could be paid off. No bank would do it and I even had great credit. I found Figure and applied for it as a last shot opportunity and within 10 mins I was approved. Took me a total of 7 days to be funded which included the weekend. I will recommend them to everyone I know that needs a fast Heloc. This loan is saving me over $7000 a month in payments. ", "rating": 5}, {"title": "Very Fast Services Very Professional …", "text": "Very Fast Services Very Professional  And Easy Process...", "rating": 5}, {"title": "So quick and easy!", "text": "So quick and easy!! From approval to receiving funds was 7 days. The \"longer\" wait was on me since I couldn't meet right away with the notary. Communication was great throughout. Very transparent.  I called with a question and the call was answered right away!   Process was so easy, I would recommend to anyone looking for a great company to handle equity loans!!", "rating": 5}, {"title": "Customer Service", "text": "Customer service was able to answer all my questions ", "rating": 5}, {"title": "Easy process to get what was needed", "text": "Easy process to get what was needed. The live chat on the notary was much appreciated compared to a phone call. ", "rating": 5}, {"title": "Customer service how easy it was to…", "text": "Customer service how easy it was to apply for the loan online and the timely manner it took to get the loan everything was great", "rating": 5}, {"title": "No hassle", "text": "No hassle, quick funding. The process from start to finish was so easy!", "rating": 5}, {"title": "Figure provides a smooth process with a…", "text": "Figure provides a smooth process with a fantastic application portal and approval/review process.  The notary was efficient.  Great service and the only alternative to Big Banks", "rating": 5}, {"title": "Great Service Great Rates", "text": "Looking to consolidate debt or need access to equity in your home, Figure made the process quick and easy and provided rates which beat other lenders. I would recommend Figure to anyone looking to pull equity out of their home.", "rating": 5}, {"title": "The process was smooth and stress free", "text": "The process was smooth and stress free. The funds were in my account just a couple of days after completing the application process. ", "rating": 5}, {"title": "Very easy application and approval…", "text": "Very easy application and approval process ", "rating": 5}, {"title": "Simple", "text": "Simple, quick and very straightforward! Great experience!", "rating": 5}, {"title": "Great Experience ", "text": "The whole process was super easy, transparent, and quick. I am very glad I used Figure.  ", "rating": 5}, {"title": "Choose FIGURE for your HELOC", "text": "My wife and I decided to get a HELOC. We researched and applied with several companies. Figure was a cut above the rest. We received our funds in a timely manner. It was an easy peasy process. We will use Figure again, if needed.", "rating": 5}, {"title": "Second time using this company", "text": "I had a personal loan with this company before, so I initially was trying to get another personal loan, but I realized they were only doing HELOC's now. I didn't really want to take out a big loan on my house so I was happy to see that I was able to take out a small loan without using all of my equity. As I said, this is my second loan with this company. They are easy to work with and are fast at funding, and you can do it all online. I would highly recommend this company.", "rating": 5}, {"title": "Quick, simple, & easy process ", "text": "They made the process so easy and quick that I actually thought for a minute this was a scam.  Simply link to IRS for income, attach bank statements for money xfer.  No in person appraisal neede- done on line. Use eNotary to sign documents.  And half as expensive on origination fees as a couple others I looked into. And I had a couple questions throughout the 1 day process and they had live humans answer the phone.  It was glorious.", "rating": 5}, {"title": "No Hassle!", "text": "I was getting hounded by HELOC providers after getting preapproved at another company. They also kept pushing me towards a loan instead of a line of credit. I got fed up and found Figure Lending. The process was extremely easy and they had great customer service (almost no wait time). I was funded in 5 days with no hassle.", "rating": 5}, {"title": "I'd never heard of them and was…", "text": "I'd never heard of them and was searching for a HELOC using a rental property.  From the time I applied which was extremely easy to the time the funds were in my account was 6 business days! Everything was seamless and the rate quoted was fair. ", "rating": 5}, {"title": "Figure is the absolute best", "text": "Figure is the absolute best.  Their entire process is seamless.  The application process is simple and approval that you qualify comes quickly.  You can always reach a Figure agent in quick order and never do I leave a call without my questions answered completely.  Once the e-notary is signed money comes quickly.  Figure is the absolute best way to get a home equity loan.", "rating": 5}, {"title": "Open communication and a quick process", "text": "Open communication and a quick process. Very easy!", "rating": 5}, {"title": "Very efficient and helpful", "text": "Very efficient and helpful.  Easy process.  ", "rating": 5}, {"title": "The loan application process was very easy", "text": "The loan application process was very easy, requiring minimal information, and the turnaround time was quicker than expected.", "rating": 5}, {"title": "Funding fast", "text": "Funding fast, honestly, my trusted.", "rating": 5}, {"title": "Professional", "text": "Professional, accurate service, with open communication from the very beginning.", "rating": 5}, {"title": "Excellent!", "text": "Excellent to work with, quick and easy! Funding was received in a matter of 3-5 business days. ", "rating": 5}, {"title": "So easy and painless", "text": "The ease of applying and signing the documents, how quick and painless it was, and how quick you get the funds. Ya'll really blow the competition away in that regard.", "rating": 5}, {"title": "Very easy to do business with", "text": "Very easy to do business with. Very quick.", "rating": 5}, {"title": "It was all done 100% online", "text": "It was all done 100% online, if I needed help or questions I just reached out to the chat it was pretty quick to get a reply. Quick and Easy and the payments fitted my needs ", "rating": 5}, {"title": "Easy and efficient process", "text": "Easy and efficient process, good communication through it all, and quick closing! ", "rating": 5}, {"title": "A perfect match for what we needed!", "text": "I am so impressed that the process was truly all digital! Other HELOC lenders wanted 20+ documents submitted, and the process could take weeks. The rate and fee options are very competitive and the chat support was always available when I  had a question. We are using the loan to add a new roof and solar to our house, and I was happy to learn they will reammortize the loan after making a payment of more than 10% of the balance. This will be perfect when we apply solar tax credit money next year. The e-notery process was easy and the timing of the steps was very reasonable. We got funds in a little over a week ..even with the 3-day cancel period. ", "rating": 5}, {"title": "This has been on of the easiest…", "text": "This has been on of the easiest transactions I've experienced and I've made many similar trasactions.  I provided access to the required financial information through the (Plaid) application and I provided access to my filed tax returns.  They had all the information they needed to make an offer.  It litterally took hours to complete this transaction.  What may be a little disconcerting is this is a new way of doing business with low to no touch, meaning just about everything is digitized and processed automatically as comapred to traditional lending methods.  Even the appraisal used was an automated process through one of their vendors.  Since I have most of my information digitzed, I didn't have a need to make copies or scans of anything.  The lending process was super simple and I'm very happy so far.  I'll proivde an update once I have experience with their loan servicing functions.", "rating": 5}, {"title": "Easy Application Process", "text": "I needed to get rid of some credit card debt and Figure gave me the chance to do it, while others would not. ", "rating": 5}, {"title": "The process was so simple and quick", "text": "The process was so simple and quick! Couldn’t believe how easy it was to do from home!!", "rating": 5}, {"title": "The easiest loan experience from start…", "text": "The easiest loan experience from start to finish! Everything is so streamlined, and they’ve managed to remove all of the lag time in the loan process. ", "rating": 5}, {"title": "It was quick and easy.", "text": "It was easy online and quick response. Everything was easy to upload to their site.  ", "rating": 5}, {"title": "Extremely fast and easy process", "text": "Extremely fast and easy process.", "rating": 5}, {"title": "Simple and fast", "text": "I was not given the run around after I submitted all the required documentation. Applying was simple and getting approved and funded was quick. ", "rating": 5}, {"title": "The process was very quick and easy and…", "text": "The process was very quick and easy and I was provided with a lot of options and flexibility with regards to repayment.", "rating": 5}, {"title": "Easy experience to work with!", "text": "Easy experience to work with! ", "rating": 5}, {"title": "Seamless process", "text": "Date of experience: February 15, 2024", "rating": 5}, {"title": "I could do everything online", "text": "I could do everything online. Uploading my documents was safe & secure. When closing my loan, I was Able to use an e-notary... it was a short session by zoom. Everything was explained thoroughly,  my questions were answered quickly. When I sent emails, someone from customer service always answered within 24 hours. And above all, Figure treated me with respect. I didn't feel intimidated like I have EVERY OTHER TIME I HAVE DEALT WITH ANY BANK FOR MORTGAGE OR PERSONAL LOANS. Figure treated me as tho THEY worked for ME! It was just a very smooth, easy, pleasant experience.  I will use Figure for all of my banking needs from now on. I don't think anyone compares! ", "rating": 5}, {"title": "I got approved same day!", "text": "I got approved same day!The process was SO easy and streamline. Figure was very communicative about the process and it only took a couple of weeks to get my HELOC done and the money in my account.", "rating": 5}, {"title": "Excellent process and CS", "text": "Excellent process and CS.  Figure provided a service that the big banks could not.  We heartily recommend your services to any one needing a HELOC.", "rating": 5}, {"title": "It was easy to follow!", "text": "It was easy to follow. All communications were easy to understand and pleasant. Our Historic Register Home and us thank you very much.", "rating": 5}, {"title": "An incredibly smooth loaning processI am very far from computer literate", "text": "I am very far from computer literate. I initially started my HELOC app with my bank. Was told it would take 4-6 weeks for approval and the rate was not too favorable. Next tried my mortgage company and all they wanted to do was offer me a loan. No thanks. Credit union had decent rates but again a many weeks long approval process. Figure was super easy to navigate, spelled out their terms concisely and the whole experience took less than two weeks, only because I was lax in expediting the loan. As said, am hesitant when it comes to online business, especially of this caliber, but I felt accomplished after the transaction was over. Thank you, Figure. You have changed my life for the better for sure!", "rating": 5}, {"title": "This process was exceptionally simple…", "text": "This process was exceptionally simple to follow, start to finish. I could not have experienced a better process and would not hesitate to share!", "rating": 5}, {"title": "Seamless", "text": "I was a bit skeptical at first but it couldn't have gone any more seamless.", "rating": 5}, {"title": "By far the BEST user experience out of…", "text": "By far the BEST user experience out of all of the places I️ applied for! It was all over in 7 business days I️ was FUNDED and little did I️ know I️ would have a water pipe break the next week with damages in the thousands! I️ had the funds already! Thank you Figure! I️ recommend Figure over any other company for a HELOC or refinance!", "rating": 5}, {"title": "Easy to work with and good…", "text": "Easy to work with and good communication.", "rating": 5}, {"title": "This was the easiest transaction and it…", "text": "This was the easiest transaction and it was very fast. I really appreciate the fact I can pay this off early without any penalties. I look forward to doing business with you.", "rating": 5}, {"title": "Super convenient", "text": "Super convenient for someone who works long hours and can't meet in person. Process was 100% online and super easy. Once approved the funding was extremely fast. Approval was fast as well! Would definitely recommend for HELOC.", "rating": 5}, {"title": "Less paperwork", "text": "Less paperwork. Stress free.", "rating": 5}, {"title": "I started the HELOC process with…", "text": "I started the HELOC process with another company, and it just started getting way too complicated. I ended up going with Figure, and the process was amazingly easy!!!", "rating": 5}, {"title": "They made it so easy and I got my money…", "text": "They made it so easy and I got my money within just a couple days!", "rating": 5}, {"title": "I opened a HELOC", "text": "For me, the fact that the whole process is online! I don't think I actually spoke to a human until the notorazation on a video chat. I'm very uncomfortable initiating business on the phone, so this platform was perfect for me. Of course phone help was available had I needed it.", "rating": 5}, {"title": "Simple. Easy. Fast", "text": "From the beginning the process was easy, from the pre qualification to the full application everything was seamless. Definitely recommend if your looking for a HELOC.", "rating": 5}, {"title": "Best Of The Best Hands Down!", "text": "So far we are happy customers!When these banks and other lenders are offering us some funds with high interest, we found Figure during our difficult time.Figure Lending LLC helps us a lot when we need some funds for our bills and emergency funds for our startup company.Simple, fast and flexible process!Funds immediately in my bank account within a week.Thank you Figure for helping us and we will absolutely keep doing business with you!Team Figure is the best!", "rating": 5}, {"title": "Great experience!", "text": "Very easy and painless process for accessing home equity.  My application to funding took approximately one week and providing documentation was very straightforward.", "rating": 5}, {"title": "So easy and flexible!!", "text": "The speed and ease of loan flexibility was huge for me. So easy to play with the numbers without being pressured to make a certain decision, I could just look at what numbers worked best for me. I loved the interface and going through everything virtually at my own pace was super helpful.", "rating": 5}, {"title": "The online process is easy", "text": "The online process is easy, intuitive, and comprehensive.", "rating": 5}, {"title": "Was just funded", "text": "Was just funded. Super easy fast service.  Was so simple.  Completed within 10 days.", "rating": 5}, {"title": "I can’t believe how easy this was!", "text": "I can’t believe how easy this was!! I am very impressed with this company and I’ll recommend to anyone searching for a home equity loan.", "rating": 5}, {"title": "Easy, fast and convenient", "text": "This had to be one of the easiest and most convenient home loans we have ever applied for. They didn't require a home inspection like other lenders (which we had to pay for) They didn't request a lot of other paperwork to verify our financial history. Everything was done over the computer or phone. This is how I have always dreamed it could be! Thank you!", "rating": 5}, {"title": "Very fast on getting approved and funded", "text": "Date of experience: December 07, 2023", "rating": 5}, {"title": "Great borrower.", "text": "Date of experience: December 21, 2023", "rating": 5}, {"title": "Dealing with Figure has been a very positive experience", "text": "Dealing with Figure has been a very quick and simple process. They keep you informed step-by-step. I would absolutely recommend them!", "rating": 5}, {"title": "My application is still on process", "text": "My application is still on process. So far I have a positive experience...", "rating": 5}, {"title": "It was very stress free…", "text": "It was very stress free from the soft credit check until the money was deposited. Everyone I spoke to on the phone was very knowledgeable and actually did everything they said they were going to. Money was deposited in five business days. Overall great experience!", "rating": 5}, {"title": "This loan was so easy that it was…", "text": "This loan was so easy that it was unbelievable, not anything like my past experiences, it was all online but when we called with questions we got answers. There wasn’t loads of unnecessary paperwork, they use a online notary and it funded so fast. It was a good experience.", "rating": 5}, {"title": "I am been in the real estate investment…", "text": "I am been in the real estate investment business for 50 years and this was the quickest and smoothest transaction I have ever experienced", "rating": 5}, {"title": "It was easy", "text": "It was easy to provide what they needed and the chat is amazing!  All of the questions were answered in a timely manner.", "rating": 5}, {"title": "Contacted Figure for a HELOC on an…", "text": "Contacted Figure for a HELOC on an investment property. Spoke with Mona Shaito on a Thursday by the next day I was approved and on Sunday I signed the loan docs. Expect to fund on Thursday. This is by for the fastest and smoothest transaction I've had with a HELOC. Highly recommend!", "rating": 5}, {"title": "Streamlined", "text": "Best experience easy and quick funding. Would highly recommend no nonsense process. Thank you looking forward to a lasting relationship.", "rating": 5}, {"title": "Best experience I've ever had on a…", "text": "Best experience I've ever had on a financial transaction... Seamless, quick, digital-friendly process. Highly recommend.", "rating": 5}, {"title": "Super easy to work with", "text": "Super easy to work with. Kept me informed", "rating": 5}, {"title": "Wow, Amazing", "text": "Wow,  this was the easiest transaction.  Everything was so quick,  link your accounts easily with plaid, Everything was done thru my phone.  Rates are competitive.   Fees are low.  By far the fastest, painless transaction ever.", "rating": 5}, {"title": "No Hassle Loan", "text": "No Hassle Loan, all pros working for you, BEST LOAN EXPERIENCE I EVER HAD", "rating": 5}, {"title": "Easy.... Peasy...........HEL OR HELOC", "text": "This financial institute make things so easy from the beginning to the end of the process. The only thing I had to do was have my paperwork in order and good credit.I believe that Figure will dominate this industry, provide they don't run out of funds and all customer pay as agreed. The process was easy and funding my account was fast. So to anyone out there that looking for a home loan \"Stop Here\" don't think twice get pre-approved and if you approve, they will take care of you quickly.", "rating": 5}, {"title": "I am blown away", "text": "I am blown away!  Finally a business that has perfected this type of lending. The easiest, and most pleasant experience for obtaining a loan. Whatever criteria and algorithms they are using to make us borrowers believe in ourselves, instead of being turned down and feeling like our hard work is for nothing, have been perfected. Figure is a lender to believe in!", "rating": 5}, {"title": "I was shocked at the ease of the…", "text": "I was shocked at the ease of the process. From initial application to funding was 8 calendar days with 2 weekend days and Labor Day in between. Couldn’t have been easier. Almost too good to be true…but it is.", "rating": 5}, {"title": "Agent was patient and answered all of…", "text": "Agent was patient and answered all of my questions professionally", "rating": 5}, {"title": "Process was relatively straightforward…", "text": "Process was relatively straightforward and easy.", "rating": 5}, {"title": "Excellent service", "text": "Excellent service! Stupid easy to work with they follow through with out delay. I’m very happy I responded to there mail over.", "rating": 5}, {"title": "Was fast and good like not any other…", "text": "Was fast and good like not any other bank", "rating": 5}, {"title": "Great company to work with", "text": "Everything went smooth fast easy application and approval funding within days of approval", "rating": 5}, {"title": "Easiest process ever!", "text": "Figure made this the easiest mortgage/HELOC experience ever! Immediately gave me rate and amounts available. Flexibility of options was nice. And the ability to get the funds without an appraisal was incredible.  Also appreciated the proactive communications and responsive employees.", "rating": 5}, {"title": "everything was really easy fast", "text": "everything was really easy fast. Very helpful. An awesome experience. I recommend it for anyone needing any kind of loan they’re awesome.", "rating": 5}, {"title": "I am very happy with their customer…", "text": "I am very happy with their customer service.", "rating": 5}, {"title": "They came through when other companies…", "text": "They came through when other companies did not.  The process was smooth.  I am grateful for their support", "rating": 5}, {"title": "A timely solution!", "text": "The speed and clarity of how things came together. The avalibality of customer service to answer questions as this is very different process.", "rating": 5}, {"title": "The whole process was easy and I got a great rate!", "text": "It was a straight forward, guided experience and the result was a great interest rate. The savings in interest and consolidation using the equity in my home saved me over $700 in monthly payments.", "rating": 5}, {"title": "The best loan experience I have ever…", "text": "The best loan experience I have ever had:1.  Absolutely no document uploads2.  Easily breezed through a complex multi-person notarization procedure3.  Even automatic payments are already set up.I don't know how it could get any easier.", "rating": 5}, {"title": "Literally Saved My Home", "text": "I am so glad that I came across this company.  They literally saved me from losing my home to the town due to back real estate taxes.  They are wonderful to do business with.  The process was fast, as long as you just keep up with the correspondence from them asking for info, etc.  it really was a pleasure!", "rating": 5}, {"title": "Great company", "text": "Great company. Have had numerous loans with this company that were paid off; and new loans established. The staff are always very professional and easy to work with.", "rating": 5}, {"title": "the ability to do it all online", "text": "the ability to do it all online, lightning speed funding time.", "rating": 5}, {"title": "Applied and recd funds in my account…", "text": "Applied and recd funds in my account within one week. Everything was easy. Very organized website. Great customer service. Interest is a little higher than competitors but the ease of getting funds worth it especially for short term is of funds.", "rating": 5}, {"title": "Excellent Customer Service", "text": "Customer service is excellent and I am satisfied and appreciated at the process.", "rating": 5}, {"title": "Fantastic Company Thank you", "text": "Date of experience: August 02, 2023", "rating": 5}, {"title": "Quick and Easy", "text": "Absolutely the easiest process to obtain a HELOC. It was super fast and super easy. Definitely recommend if you want to avoid jumping through hoops with large banks and waiting forever to close. Figure is awesome in helping us achieve our goals. 5 STARS, you will not be disappointed.", "rating": 5}, {"title": "The application was approved…", "text": "The application was approved immediately The application process was very easy to navigate, the customer service was extremely helpful and knowledgeable and with know language barrier, the funds we in my account within 3 days after final approval and signing documents, Best of all never had to leave my home, even a notary was done via zoom, this entire process was made so easily and smoothly unlike any other company that does Home Equity Loans in the entire market.", "rating": 5}, {"title": "doing very fast!!!!", "text": "Date of experience: July 19, 2023", "rating": 5}, {"title": "The overall process was fast and easy", "text": "The overall process was fast and easy. Everything was done online, but help was just a phone call away when I needed in. I’m the end, was able to close my loan and get funds in 5 business days.", "rating": 5}, {"title": "Excellent experience from the start", "text": "Excellent experience from the start. Everything was simple and I received money within 5 days. Much better than working with Rocket Mortgage!! This company is very efficient.", "rating": 5}, {"title": "The ease of the transition was amazing", "text": "The ease of the transition was amazing. Any question I had was answered quicky and with understanding are care of the client. I was amazed with the whole process and will let my family and friends know about Figure", "rating": 5}, {"title": "I Never Imagined getting HELOC loan…", "text": "I Never Imagined getting HELOC loan could be this much simple. In a few click of a button your loan is processed.Thanks to Figure for making the process so easy.", "rating": 5}, {"title": "Everything was done on line", "text": "Everything was done on line, if I had questions I could talk to a live person.  Excellent customer service!", "rating": 5}, {"title": "Simple online process", "text": "Simple online process. Only had to talk on the phone for 2 minutes to notarized documents. They're the only loan company I came across that actually does what they advertise. They also have competitive rates.", "rating": 5}, {"title": "Hard to believe it was as easy as it…", "text": "Hard to believe it was as easy as it actually was. Straight forward, seamless, intuitive process. Almost too good to be true! Very happy I found Figure!", "rating": 5}, {"title": "figure is the best lending institution…", "text": "figure is the best lending institution i have ever dealt with.  i did everything online and it couldn't have been easier.  i am very pleased.", "rating": 5}, {"title": "Great experience", "text": "I had been denied by every financial institution under the sun and was seriously considering bankruptcy when I applied for a HELOC through Figure. It was all online, fast and very easy. The reps walk you through everything and even provide an electronic Notary if needed.", "rating": 5}, {"title": "Get your loan here!!", "text": "The first thing I do when checking a company I haven't heard much about is to go right to the one-star reviews to see where the real issues were.  When I did this here I saw nothing more than a bunch of gripers; it seemed that there were no legitimate complaints there.  I don't give five star reviews unless they are warranted, and here it is definitely warranted.After my wife and I both completed our three minute long (I kid you not) virtual notary signings, we had the money THE VERY NEXT DAY!!Our credit is good (not perfect) but there were no issues getting a quick response and acceptance.The few questions I had and things I did not quite understand were cleared up quickly and painlessly through the quick response of the chat function.Very highly recommended, thank you.", "rating": 5}, {"title": "Payment", "text": "Mandy was great in discussing what will take place on my account,she explained how the payment will be calculated", "rating": 5}, {"title": "Fast and Easy Process to Obtain a HELOC", "text": "The process of using Figure to obtain a HELOC was easy and quick.  Customer service reps were easy to access, professional, friendly, and helpful at each step along the way.  The company was very communicative, and I have no reservations about recommending Figure.", "rating": 5}, {"title": "Loan Request - HELOC", "text": "The application process was easy to execute, follow up was and approval was quick and everything went well. In less than 5 days the loan was funded.", "rating": 5}, {"title": "I cannot imagine why anyone would ever…", "text": "I cannot imagine why anyone would ever give anything less than a five star review here. From the moment I logged on to the figure website for the first time until my loan was funded barely a week later the entire experience was smooth and professional, and completely hassle free. We have a lot of equity in our home, but we do not have perfect credit, and we were able to tap into our equity without any problem at all. I highly recommend figure!", "rating": 5}, {"title": "Easy to go through the process.", "text": "Easy to go through the process.No worries at all. Thanks Figure!!!", "rating": 5}, {"title": "Easy to submit", "text": "Easy to submit, easy process. Mobile friendly submission.", "rating": 5}, {"title": "Very easy", "text": "Very easy and stress free experience.", "rating": 5}, {"title": "Trustworthy and admirable in business dealings", "text": "Figure made a wonderful and trustworthy representation through how my account was handled. I was never coerced into making an instant decision, my questions were answered through thorough explanations, and not once did I feel like an inconvenience. The first notary I spoke with was personable and honest. I was greatly impressed!", "rating": 5}, {"title": "Great Experience!", "text": "My experience with Figure is outstanding. A company that does exactly what they say they are going to do.  Excellent!!!", "rating": 5}, {"title": "Be patient everything takes time", "text": "We tried for months to get a loan for a new roof with no luck. Figure worked with us to get the loan we could afford. The people were friendly and very helpful. Now we are getting the repairs on our home that it needs. Thank you Figure.", "rating": 5}, {"title": "Figure’s online experience is Amazing", "text": "Figure’s online experience is Amazing! It’s simple, straight forward and easy to use. I would recommend Figure to anyone looking for a home equity line of credit.", "rating": 5}, {"title": "Professional and attentive customer…", "text": "Professional and attentive customer service I was very pleased with the way the Agent explained the details of my transaction to me.", "rating": 5}, {"title": "The process was so fast", "text": "The process was so fast! I got my funds in record time. The only reason it was 4 days long waiting was a law by my state. Otherwise it would have taken 2 days awesome", "rating": 5}, {"title": "HELOC Approval Incredibly Fast", "text": "Super fast and easy to use.  Income verification by connecting a checking account was especially impressive.  Also the instant home appraisal.", "rating": 5}, {"title": "Figure out borrowing with Figure.", "text": "This was my 4th experience with a financial institution regarding mtge. Or refinance.  I tell you this experience with Figure was the best one I had.  I would give a 10 out of 10.  Easy documentation, no going back and forth regarding documentation.  Very quick response and closing.  I would recommend Figure over any other financial institution.", "rating": 5}, {"title": "Quick and easy!", "text": "Figure made things, fast, easy, and hassle free. Highly recommend.", "rating": 5}, {"title": "Five stars for Figure", "text": "First time I ever heard about the company. It was refferred to me by bankrate.com. So I wanted to give it a try. I was skeptical throughout the loan process until I saw the money in my bank account 6 working days later. I was a bit nervous about allowing them to peek into my online bank account but I was not giving them my id and pw. And besides, even if you work with other loan officers you still have to give them your bank statement anyway. So its the same. You can give them access to either checking, savings or both. Normally it would take at least a month to get a loan but... 6 days? How can it not be a 5 stars! Every step was really quick. Oh, the 6 days includes the 3-day cancellation period during which I could have cancelled it for any reason. So it actually took 3 days to approve my loan (???) I cannot speak for others but it was a very good experience for me. I'm a very happy man.", "rating": 5}, {"title": "Quick processing and approval", "text": "I had a very quick processing and funding experience with them , no complaints here at all. Really hard to believe how smooth it went . I too was one that was skeptical of their loan processing procedure , but it works. I received my funding quickly after being approved, which was quick also , always being informed by way of email to what was taking place and any other matters I needed to attend to. I wanted to wait to give a review after the whole process was completed. I just had my first payment posted from my bank account I provided them. No problems at all, thanks Figure Loans.", "rating": 5}, {"title": "They were so quick to help and points…", "text": "They were so quick to help and points us on the right direction. Very pleased.", "rating": 5}, {"title": "I can't believe how efficient and fast…", "text": "I can't believe how efficient and fast these folks are. 2 top lenders in the mortgage realm dragged their feet hoping I would give up my 2 percent mortgage with a growing $200K of equity in my home. But the folks at Figure new what my goal was in trying to get some money to pay off some debt and fix up my kitchen a bit. Me and my wife are thrilled and I would highly recommend them over Rocket and or Discover.", "rating": 5}, {"title": "HE loan from start to funding in record time!", "text": "The HE loan was approved and a Notary appointment made within 5 days  with rapid verification of documents and income, assets, appraisal etc - all without any need for phone calls and mysterious delays.Amazing technology and a competitive rate that was half the personal loan rates I was being offered elsewhere for debt consolidation.", "rating": 5}, {"title": "The whole process was so effortless", "text": "The whole process was so effortless! Caitlyn Halmans told me about Figure when she heard that we were in the market for a home equity line of credit. It was everything she described and more. I was blown away by how quick and easy the process was. I was also blown away by the awesome customer service from everyone involved!", "rating": 5}, {"title": "Figure Is The Real Deal!", "text": "Fast, smooth and great communication!  Uploading all the requested documents was simple and quick!  Have any questions?  For a virtual company, you can speak with a \"live\" person when need be.  I received my funding in less than a month and never had to leave my house.  All signing is done on-line and is secure.  Figure is the real deal!", "rating": 5}, {"title": "Currently in the process of a HELOC", "text": "Currently in the process of a HELOC. One if the easiest transactions I have ever done.. everyone is friendly I have spoken to and the online process is beyond uncomplicated. Thank you! Amy W.", "rating": 5}, {"title": "Topnotch!", "text": "A wonderful experience from start to finish. EXCELLENT staff.Thanks again.", "rating": 5}, {"title": "Super easy. Super Fast.", "text": "Super easy. Super fast. Awesome product.", "rating": 5}, {"title": "Easy to apply for funds and super fast…", "text": "Easy to apply for funds and super fast to receive them.", "rating": 5}, {"title": "My 1st loan that I applied for they…", "text": "My 1st loan that I applied for they approved me for $170,000.00, I didn’t like that amount and talked with an agent to see if they could raise it more, they said no, so I asked for my application to be cancelled.  Then I thought I’d try and reapply again, this time they approved me for $550,000.00, so I said what the heck and pulled the trigger.  I’ve completed every step, I’m only waiting for the funds to be deposited!  Thanks Figure!  I'm still scratching my head on why my loan qualification went from $170,000 to $550,000.  but any case I got the loan.", "rating": 5}, {"title": "Easy loan process.", "text": "Date of experience: May 19, 2023", "rating": 5}, {"title": "Fast, easy, legit.", "text": "My experience with Figure was much faster than I expected. I applied on a weekend but the whole process only took 7 actual (not business) days. Figure did ask for a copy of my deed, and be prepared to prove who you are and what/where you own. which only seems safe and fair. I feel that some negative experiences can happen when someone says 3-5 days, they are setting unrealistic expectations. I have decent credit (714), low debt to income ratio and was able to provide everything Figure needed. With that said- they ARE LEGIT, and the process is light speed fast compared to most other funding sources. Thanks Figure.", "rating": 5}, {"title": "Got funding within 1 week of…", "text": "Got funding within 1 week of application. No issues whatsoever. I read the BBB reviews and they didn't persuade me, seems like most complaints stemmed from applications that weren't complete...", "rating": 5}, {"title": "A seamless experience", "text": "A seamless experience. I would recommend to anyone who wants to avoid the hassles with a regular bank. Started the process on Saturday and was funded Thursday. Amazing staff support for any questions. 10 stars!!", "rating": 5}, {"title": "The ease of this group has made…", "text": "The ease of this group has made attaining a HELOC a smooth process 👍", "rating": 5}, {"title": "Extremely responsive", "text": "Extremely responsive, good terms and I was able to receive just the amount I needed.  I would heartily recommend Figure to anyone.", "rating": 5}, {"title": "Easy process!", "text": "Fast, easy process, and very convenient.", "rating": 5}, {"title": "It was an easy process.", "text": "Everything went pretty smoothly. Had a little trouble linking my bank initially, but I don't think that was Figure's fault and it ended up working itself out. Once the application was done, I was able to speak with a notary immediately to get everything signed. After that, the funds hit my bank account in about 4 business days. All in all, the whole process to getting funded took just under a week. The communication from Figure was great. I was getting updates regularly through email so I always knew what was going on. So far my experience has been a good one.", "rating": 5}, {"title": "Incredibly efficient", "text": "Incredibly efficient.  Applied on a Saturday, loan was funded the following Friday.  Easiest loan I have ever applied for and I never even had to speak to anyone.  Excellent product and I highly recommend/", "rating": 5}, {"title": "An exception to the rule \"if it's too good to be true\"", "text": "To be honest I had my questions about the company as a whole (credibility, tenure..) simply because it seemed like too good to be true but after doing the research I found some great testimonials and some not so great reviews however I decided to continue the with the process of applying and sharing my personal info and then had some questions about the disclosure that took a couple of extra days to get answerers for but the folks I talked to on the phone were great and followed up which encouraged me to go through with the e-notary and the rest of the process was too good to be true but it was!It took about a week from start to finish (when I got my funding) and was seamless for the most part without too many documents needed, so I would thank you and great job!!", "rating": 5}, {"title": "Just closed on my heloc with Figure and…", "text": "Just closed on my heloc with Figure and they are legit.  We received our funds within 5 days of signing closing documents", "rating": 5}, {"title": "Most efficient", "text": "Most efficient; everyone should go Figure! Amazingly consumer friendly and designed to be so! No one is like Figure!Awesome !", "rating": 5}, {"title": "Very easy process online", "text": "Very easy process online. Everything went very well snd quickly! Pleased with the Figure's efficiency.", "rating": 5}, {"title": "Super fast process", "text": "Super fast process. I needed a HELOC for home improvement and extra-cash for an investment. The online process worked very well. I didn't encounter any bugs. We had an appraisal in 48 hrs, agreed upon the terms electronically, a field notary met me while I was traveling out of state. The paperwork was uploaded, and I received a deposit within 2-3 days. Overall only took 8-9 days from start to finish. I would highly recommend. The automatic payments setup was nice as well. I don't even have to think about it.", "rating": 5}, {"title": "Smooth experience", "text": "Easy to work with, professional personnel.", "rating": 5}, {"title": "Professional and fast loan process", "text": "This was a very easy transaction to secure a loan for a pool remodel HELOC loan Great rates easy on line management of loan process excellent customer service We are definitely very satisfied  quick process  highly recommend this for your loan needs", "rating": 5}, {"title": "Fast and reliable", "text": "My experience was a great move on my part. I was very happy with Figure. There was always someone to answer my questions. The best company to go for an equity loan.", "rating": 5}, {"title": "Great experience!!", "text": "Great experience!!! Pleasant to work with and very fast delivery of funds...great job", "rating": 5}, {"title": "Highly recommend", "text": "Compared to other lenders, Figure was the fastest, easiest solution I was eSigning within 48 hours with very competitive rates.", "rating": 5}, {"title": "Very quick and simple", "text": "Very quick and simple. Right to the point without adding some much fluff most bankers do. Really impress with the speed and very competitive interest rates.", "rating": 5}, {"title": "Figure Rocks!", "text": "Best re-fi/equity process I've ever experienced and no my credit score did not drop after a pretty large pull out of equity.  Go with them, stop looking.", "rating": 5}, {"title": "Great & attentive", "text": "We have done business for a few years now and i have only great experiences up to this point.  Most likely will recommend to family and friends...", "rating": 5}, {"title": "Friendly", "text": "Friendly, Smooth, and easy!", "rating": 5}, {"title": "The ease of the entire process", "text": "Date of experience: April 21, 2023", "rating": 5}, {"title": "Very easy and responsive.", "text": "Date of experience: April 20, 2023", "rating": 5}, {"title": "My experience with Figure Lending LLC was very positive and frustration free.", "text": "My experience with Figure Lending LLC was an extremely positive one. Customer service was very helpful, and the entire process of applying and being approved for my home equity (Heloc) loan was expedited and frustration free.", "rating": 5}, {"title": "You made it much easier lending process…", "text": "You made it much easier lending process by comparison to the traditional lenders. You have a sharp comparative edge. Keep up the good service. Thank you", "rating": 5}, {"title": "The process was super quick and…", "text": "The process was super quick and straight forward. They guide you through the entire application. The e-notary session was awesome. Really convenient. Got my cash within a week and could not be happier with the process.", "rating": 5}, {"title": "The process was very easy", "text": "The process was very easy, everyone was was very helpful and professional Thank You. Great Experience", "rating": 5}, {"title": "Great customer support and service - very happy!!", "text": "The customer experience for my Chat session was fast, efficient and solved several problems at once. The agent was able to change a form value that was incorrect, as well has helping me login, and giving me accurate status on the loan application next steps. Thank you!!! Good work Figure.", "rating": 5}, {"title": "Great Staff of Friendly Patient People", "text": "It took a while but the Figure staff were available to answer any question about my application, and to do what's needed, rather than referring you elsewhere.  The process went smoothly, even for the semi-computer-illiterate.   Great people, good low rate, a pleasure to deal with.   Thanks.", "rating": 5}, {"title": "So easy!", "text": "So easy - I never had to set foot in a bank! This is delightfully disruptive to the financial services industry. I love it.", "rating": 5}, {"title": "Fast and efficient approval process took only days to get the direct deposit", "text": "Loan was processed and money received within days.  Highly efficient and automated process, only spent a few minutes online via webcam with the agent to notarize the loan.1. Applied online evening of 4/3/2023 (Monday)2. Had brief notarization session on 4/4/2023 at lunch via web cam (Tuesday)3. Full loan amount deposited in bank on 4/7/2023 (Good Friday)", "rating": 5}, {"title": "Terrific company and very smooth process!", "text": "Terrific company and very smooth, streamlined, fast process with excellent communication every step of the way. Exceeded expectations and we are very pleased. Thanks for making our experience a great one!", "rating": 5}, {"title": "Best Loan Process Experience", "text": "Most direct and simple experience I have had working with a loan process.  Definitely the best.", "rating": 5}, {"title": "This is my second experience with…", "text": "This is my second experience with Figure.  Glad to report the service, convenience and knowledge of the employees involved were terrific as the first time.", "rating": 5}, {"title": "awsome customer service", "text": "awsome customer service.  very courteous employees. my needs were taken care of very expeditiousl", "rating": 5}, {"title": "Easy to work with", "text": "Easy to work with,  great to deal with.", "rating": 5}, {"title": "The process was easy", "text": "The process was easy, the closing was painless, I really enjoyed the way the loan went. The loan was funded quickly, just waiting for the slow bank transfer to get completed. The customer service was very good as well.", "rating": 5}, {"title": "Very easy process", "text": "Very easy process. Everyone I dealt with was amazing. Easy to understand. Highly recommend!!!!", "rating": 5}, {"title": "Really easy to work with", "text": "Date of experience: March 17, 2023", "rating": 5}, {"title": "Fast approval and document prep", "text": "Fast approval and document prep. Had contact with 4 staff members, all were knowledgeable and pleasant.  I highly recommend this lender.", "rating": 5}, {"title": "Process was fast and very detailed…", "text": "Process was fast and very detailed information was easy to navigate. Very helpful and professional.", "rating": 5}, {"title": "That this company is helping me and I hope a lot of other people 😊", "text": "I am very happy with figure for my finances and hope to do more business in the future.", "rating": 5}, {"title": "Unbelievably Streamlined and Efficient", "text": "The process was streamlined and very simple. This was perhaps the easiest mortgage/HELOC I've ever experienced. I provided the basic information Figure needed, and they handled the rest. Although I am a full-time Federal employee, I also have a second private business that generates income I needed to have considered. Once I granted secure access to view my bank accounts for financial verification of my self-employment earnings, it simplified the entire process. Another lender was requesting profit-and-loss statements from the previous year, and YTD earnings. Figure was able to look at my 5-year-old accounts and see that the business was stable and consistent, and did not require these or any other items that needlessly slowed the process. Communication was clear and easy, and then entire process from application to funding in my bank account took 10 days, total.  They even had an option where they sent someone to my home for closing, at a time of my choosing, making the entire process even more convenient. I would definitely use Figure for my next mortgage or HELOC experience. It really was an unbelievably easy loan to have funded! I still don't know how they did it.", "rating": 5}, {"title": "Absolutely amazing and fast service…", "text": "Absolutely amazing and fast service with everyone I spoke with. Kept me updated on the process and before I knew it I was done. Thank you!", "rating": 5}, {"title": "Figure has been prompt and courteous…", "text": "Figure has been prompt and courteous when informing me about my account.", "rating": 5}, {"title": "Helpful", "text": "When I needed help, the customer service representatives were very kind and helpful.", "rating": 5}, {"title": "This was the best experience!", "text": "This was the best experience!The entire process was easy to follow. Acquiring the necessary documents were simple procedures due to a very well structured web program. Start to finish was faster than I imagined.", "rating": 5}, {"title": "Honest and Smart Agents", "text": "At 1st I was reluctant, then was very satisfied and secure during the process. I was very surprised at their perfect handling of my loan, they are very careful with their money and do not take risks. I like them a lot and will pass them along to my Family and friends, mostly be patient and follow instructions, they are very helpful and smart, they know a good deal.   Satisfied.", "rating": 5}, {"title": "Refunded with no quibble", "text": "Date of experience: March 09, 2023", "rating": 5}, {"title": "What a wonderful loan experience!", "text": "Their heloc loan process could not have gone any smoother than it did. The application process is so quick and easy. After I met with a notary, there was a 3 day waiting period in case I changed my mind, then I received my funds 2 days later. I highly recommend using them. You won’t regret it!", "rating": 5}, {"title": "This is the easiest most seamless…", "text": "This is the easiest most seamless process! Follow all the instructions and Figure does all the work. I had a funds in my account within 6 business days. Great Job Figure!", "rating": 5}, {"title": "What’s the catch???", "text": "Very, very streamlined experience. Honestly, almost seemed too easy. They do everything and in quick order. Great, hassle-free experience.", "rating": 5}, {"title": "Everything was accomplished on line", "text": "Everything was accomplished on line. I did call to speak to a representative regarding a few questions I had, they were very knowledgeable and straight forward no pressure or any BS. I have already recommended them to a few friends and family. Would definitely do business with Figure again.", "rating": 5}, {"title": "The entire process was excellent!!", "text": "The entire process was excellent!!! Customer service, application, understanding of the process, professional, secure which I really like. The time of process . Before I applied , I read the reviews and they were right. Great experience with Figure!", "rating": 5}, {"title": "Super easy experience!", "text": "After going through three days with another company of sending documents and \"will they, won't they\", within 15 minutes of work online, I was approved from Figure. I knew we had equity in our home that we could use and I'm so glad that Figure made the process SO easy.", "rating": 5}, {"title": "The process of getting the HELOC loan…", "text": "The process of getting the HELOC loan was super easy and someone was always ready to answer questions and tell me next steps. I was nervous about it because I saw lots of bad reviews on the BBB site, but Bank Rate has Figure listed as one of the top HELOC loans. I found everyone to be helpful, straight forward, and the process to be fast! The notary met us within 5 days of my initial interest, and my loan was funded within 5 days after. I also like that this HELOC is different in that the interest rate does not fluctuate on the initial draw like it does for traditional HELOC.The notary was also very kind and met us at my wife’s work to get everything signed. Thank you Figure!", "rating": 5}, {"title": "My experience with Figure was awesome…", "text": "My experience with Figure was awesome and very uncomplicated.", "rating": 5}, {"title": "Was very convenient and an easy process.", "text": "Date of experience: February 13, 2023", "rating": 5}, {"title": "Agents were very polite and the process…", "text": "Agents were very polite and the process was unbelievable so fast within a week I had my money 👍", "rating": 5}, {"title": "Excellent", "text": "Excellent service, easy to understand instructions with speedy results. Trust worthyFeel confident with Figure. Thank you..", "rating": 5}, {"title": "Excellent transaction and fast", "text": "Excellent transaction and fast, just supply pertinent info and wait 5 days! Smooth sailing with Figure, so happy we got involved.", "rating": 5}, {"title": "Home Equity Loan Process", "text": "The loan application process was easy online.  I was kept up to date through emails for each step and progress.", "rating": 5}, {"title": "Impressed", "text": "Communication was clear and prompt. The process was straightforward and unbelievably fast. Really impressed!", "rating": 5}, {"title": "Great!", "text": "Great!Great!", "rating": 5}, {"title": "We could believe not how fast the…", "text": "We could not believe how fast the process was to recieved funding. Literally by the end of the week we where funded. Contrary to many other HELOC programs this one is fixed on the original funds. The terms do not change unless more funds are pulled out which is fantastic. The rates are slightly higher then a home equity loan but the terms worked so much better for us. Plus making extra payments towards principal could not be any easier.", "rating": 5}, {"title": "This was an amazing experience", "text": "This was an amazing experience.  Quick and efficient, easy.  I was approved in about an hour.  I'm still waiting for the bank and credit union, two other places I was going to apply for a HELOC, to call back.  Figure has already approved me!!!  I loved the convenience of applying from my home office where all my papers are located.  I highly recommend FIGURE.", "rating": 5}, {"title": "The process was super easy and…", "text": "The process was super easy and streamlined.  Anytime I did have a question and called in, the representatives were very helpful and knowledgeable.  I work in the mortgage industry and was very impressed with the ease of the process.  I would definitely recommend to friends and family.", "rating": 5}, {"title": "Excellent Loan Service Processing …", "text": "I am impressed with the customer service provided by Figure.  I found your assistance top notch.  Truth be told I found your company on a whim through BankRate.com.  I have recommended to others how professional the loan process was.", "rating": 5}, {"title": "I am by no means a person that likes to…", "text": "I am by no means a person that likes to handle things online all of the time. Nor am I tech savvy. But the process was fairly simple and straight forward. I like that Figure lets You know whether or not You are approved right away so that You don't waste time waiting around to here from a mortgage person only to put at the back of the burner.", "rating": 5}]