[{"title": "John went out of his way to make me…", "text": "John went out of his way to make me feel comfortable about ordering and went way out of his way to make sure that I was getting the exact pieces that I needed thank you very much", "rating": 5}, {"title": "Exceeded Expecation ", "text": "ACityDiscount exceeded all our expectations.  We initially purchased from this vendor because their pricing as the most reasonable.  Little did we know that they would provide amazing customer service as well.  We ordered a fairly large order of ice machines, and we were contacted by phone to verify our order and answer any questions.  Shipping was incredibly fast.  Communication through the whole processes was excellent.  ACityDiscount will be my first stop next time I'm looking for source equipment. ", "rating": 5}, {"title": "Great price Item as Adverrtised", "text": "Great price on the item we ordered with free shipping.  Arrived on time securely wrapped with no damage.", "rating": 5}, {"title": "ACityDiscount goes above and beyond in…", "text": "ACityDiscount goes above and beyond in everything to do with quality customer service. They are friendly and supportive. They know their merchandise. We were relaxed because they kept in great contact with us all the way to delivery. What we ordered came and we couldn't be more happy.We highly recommend this company. Thank you all for dealing with us here in Vt. Take care... until we order again", "rating": 5}, {"title": "Super quick shipping great products", "text": "Date of experience: November 06, 2024", "rating": 5}, {"title": "I received a cal before shipment…", "text": "I received a cal before shipment confirming everything. ", "rating": 5}, {"title": "Great prices, one stop shop for all items needed!", "text": "We just happened to find this gem on a quick trip traveling through Atlanta. Excellent customer service from start to finish! Great selection of items also. We will be back the next time we need items. Thank you for all your help! ", "rating": 5}, {"title": "Very efficient!", "text": "Friendly, helpful staff.  Purchase was easy over the phone.  Prompt and efficient delivery.  Very easy to work with this company and would highly recommend.", "rating": 5}, {"title": "It was a good experience", "text": "It was a good experience.  A few scratches getting it inside, but I'll accept it.  My sales rep was incredible!  Her service alone set the bar for me, as I was on the fence from a previous experience with the company.  ", "rating": 5}, {"title": "Good Price, Product, and Fast", "text": "Good Price, Product as Described, Very Fast Shipping.", "rating": 5}, {"title": "I requested quotes by phone", "text": "I requested quotes by phone, placed the order by phone, and picked it up in person. Mike Willingham was a great help.", "rating": 5}, {"title": "great page to find diversity", "text": "great page to find diversity ", "rating": 5}, {"title": "Needed a New Ice Machine NOW - Problem Solved!", "text": "Our commercial ice machine failed and we needed a new one quickly - in the midst of a summer heatwave... ACityDiscount found us the right machine and had it delivered in less than a week - all other sites were quoting 6-12 week lead times. Thanks!  P.S. Brian Bennett was fantastic to work with - great follow-up and service delivery!", "rating": 5}, {"title": "OUTSTANDING EXPERIENCE!", "text": "William and the warehouse guys were outstanding. I could not have asked for a better experience. The warehouse team who helped me went above what I expected to help me get loaded. I am a repeat customer and I WILL BE A REPEAT customer because of your staff and the quality products you carry IN STOCK! WOWKen NixGedney's Restaurant & Grill", "rating": 5}, {"title": "Good Customer service ", "text": "John Zheng was a pleasure to work with on this purchase, he was helpful,  patience and timely on the quote.   I was adequately updated on the shipping and delivery times, which was greatly appreciated. This was our second purchase from ACity Discount, both times we have had good customer service.   ", "rating": 5}, {"title": "Salesman was knowledgeable and customer…", "text": "Salesman was knowledgeable and customer oriented.  Helped us to get the right product and at a competitive price.", "rating": 5}, {"title": "Excellent customer service ", "text": "The website was easy to navigate and find exactly what i needed. I was very impressed that a representative called me before shipping just to review the order and make sure the product was definitely the right choice. ", "rating": 5}, {"title": "You had what I wanted", "text": "You had what I wanted, took the order, got it out, your representative was most helpful and gracious and I took delivery today,  - and with 4th of July in the middle.  Could not have been easier.", "rating": 5}, {"title": "Bruce (salesperson) friendly & helpful", "text": "Brian (NOT Bruce!) friendly & helpful. Order correct & timely. Price reasonable. What more can you ask for?! ", "rating": 5}, {"title": "Everything was great", "text": "Everything was great! Salespeople and prompt delivery!Thank youCMDR: American Legion Post 92Carmen Paglione", "rating": 5}, {"title": "From order to arrival on site was a…", "text": "From order to arrival on site was a surprise. We could not believe how fast our Ice Machine arrived. During setup we had a couple questions and they were answered immediately to resolve our mistake.", "rating": 5}, {"title": "This purchase was made as a…Food warmer for church kitchen", "text": "This purchase was made as a representative of my church   My experience with ACity was excellent.  Sales Associate John Zheng was absolutely the best.  He helped me with many questions relating to our needs and was patient with my many questions and calls.   Communication was prompt from sales to delivery.  Five stars is not enough.", "rating": 5}, {"title": "Service people were very helpful", "text": "Service people were very helpful. Bought and paid for the item online, and when I got to the store the next day it was there waiting for me.", "rating": 5}, {"title": "Easy purchase fron begining to end", "text": "John in sales, quick response. Delivery was on time, the guys were great, They went over and beyond helping us squeeze the freezer into a tight door.They made it happen. Great attitude.Thanks,WoodyAll Saints Knight of Columbus, Dunwoody", "rating": 5}, {"title": "Commercial Refrigerator…", "text": "I ordered a commercial refrigerator for our restaurant. It was about $900 cheaper than anyone local, even with the shipping cost. It arrived in less than a week in good condition.", "rating": 5}, {"title": "A good resource for our commercial product needs", "text": "Have made multiple purchases from this company. They are competitive but customer service is A+. They follow up and keep the customer well informed. ", "rating": 5}, {"title": "Extraordinary Service ", "text": "I always have a great service experience at A City Discount.  The staff are knowledgeable and friendly and I get the best prices with amazing service. ", "rating": 5}, {"title": "Great Experience ", "text": "John Z. was very receptive and all the information he conveyed on the item was accurate. It was quick delivery process and my items arrived as ordered in perfect condition. ", "rating": 5}, {"title": "I ordered what I needed", "text": "I ordered what I needed, discussed it some with sales rep. I made sure the exhaust fan would pull enough CFM’s. Paid for it. (Was easy) sales rep told me about delivery & them would call before coming.Everything unfolded just as sales rep said. Got fan right on time, I helped unload it. Did as rep said and opened box enough to see everything. I checked it over and gave it the ok looks good. We will attach the 110v cord take it up on roof. Remove old replace new, plug it in and it should solve all exhaust issues!!! And although it’s not quite done yet I feel confident enough that when we change exhaust fans out. Everything will be as good as new!!", "rating": 5}, {"title": "Working with Rudy was a pleasure", "text": "Working with Rudy was a pleasure. Delivery didn’t call in advance before they showed up at lunch time. Not on you all just delivery company.", "rating": 5}, {"title": "Fantastic service", "text": "Fantastic service from support staff and others in the mix to get my slicer to me QUICK! I appreciate it! Also, customer service assisted me in picking out the perfect product for my business.", "rating": 5}, {"title": "The cx service was impeccable", "text": "The cx service was impeccable, the staff very friendly and down to earth.  Care was taken in ensuring I obtained the correct equipment that I needed.  The store was very clean and organized. ", "rating": 5}, {"title": "Awesome salesman!", "text": "Salesman was very helpful with all questions I had about an ice machine and the different brands.  Had it in stock and was able to pick it up the next day.", "rating": 5}, {"title": "The person that helped did everything…", "text": "The person that helped did everything and kept me updated to get my order out asap, also gave us better pricing than anywhere else.", "rating": 5}, {"title": "Very helpful and friendly", "text": "Very helpful and friendly.  Spot on with delivery ", "rating": 5}, {"title": "No hassle with the purchase", "text": "No hassle with the purchase. Delivery was the same day as payment. A very nice surprise. Overall experience was very positive. The delivery guys were friendly and helpful.", "rating": 5}, {"title": "Actually talking with a rep", "text": "Actually talking with a rep! That made all the difference in chosen A City for my purchase. John was great in answering all my questions. That was a big help to me.", "rating": 5}, {"title": "Casters for gas range", "text": "Needed a set of casters for a new gas range.  Mr. Brian Bennett helped me out.  Very knowledgeable and even contacted Krowne parts to make sure they would fit.  I received the casters, much higher quality and heavier than the casters sent by the range manufacturer. I put the Krowne casters on the range and I'm Very Happy !  Thank you Mr. Bennett !", "rating": 5}, {"title": "Great experience", "text": "Great experience. Brian did a great job handling my request. I ordered an oil filtration unit and I received it in-store in 4 days.", "rating": 5}, {"title": "All good.", "text": "Website easy to use/prices great. Had to use the customer service line once and that was a good experience.  Delivery team, however,  was rather uncommunicative.", "rating": 5}, {"title": "easy to order", "text": "easy to order, very helpful staff, product arrived in great shape", "rating": 5}, {"title": "Great communication", "text": "Great communication.  Called before delivery.  Removed old unit.  Installed new unit and explained operating procedures.  Removed all trash and cleaned rea after install.  Delivery rep was excellent and was extremely knowledgeable about the unit.", "rating": 5}, {"title": "iPhone 12", "text": "Very good customer service prompt and prepared to help the customer. Read carefully what the product is capable to fo", "rating": 5}, {"title": "We really enjoyed working with John", "text": "We really enjoyed working with John. He exudes patience, knowledge and promptness. Due to the quality he possess we will definitely continue business with Acitydiscount.", "rating": 5}, {"title": "Ice Machine filter", "text": "Tend to order this item every year, a reminder to order showed. Great company to order from with fast shipping, fair price and usually in stock. A++", "rating": 5}, {"title": "When I had a question", "text": "When I had a question, I was connected with someone quickly to get an answer.  Pleasant customer service and clear directions for shipping and receiving the merchandise and knowing what to expect.", "rating": 5}, {"title": "good customer service fast shipping", "text": "Date of experience: October 28, 2024", "rating": 5}, {"title": "Fast delivery. Cheap prices.", "text": "Fast, easy website to use. Found the part at a great price. would recommend this company to anyone looking for fast delivery...", "rating": 5}, {"title": "Great knowledgeable guys behind the…", "text": "Great knowledgeable guys behind the counter and will be buying a 40lb fryer tgere soon. 1st time in the store. ", "rating": 5}, {"title": "Larry was very helpful and patient with…", "text": "Larry was very helpful and patient with all of our questions.  He really knows the equipment that is available.   ", "rating": 5}, {"title": "the staff was polite knowledgable very…", "text": "the staff was polite knowledgable very efficient, as always  the product was exactly as described. thank you", "rating": 5}, {"title": "WAREHOUSE STAFF", "text": "The warehouse staff was so helpful and knowledgeable of the items that we purchased", "rating": 5}, {"title": "You had what we needed and got us in…", "text": "You had what we needed and got us in and out fast was very helpful in getting our order !", "rating": 5}, {"title": "Great Service and Good Product", "text": "Easy access and delivery.  Even during Christmas ( Birth of my Lord and Savior Jesus Christ)", "rating": 5}, {"title": "I highly recommend ACityDiscount", "text": "I highly recommend ACityDiscount. Larry went above and beyond taking care of me. Communication was great. Fast delivery. Check ACityDiscount before buying elsewhere. ", "rating": 5}, {"title": "Super friendly and helpful staff", "text": "Super friendly and helpful staff! Had something delivered and they were in and out with 30 minutes, quick and efficient.", "rating": 5}, {"title": "Right experience", "text": "Having the part available online and free shipping was great. The local retail store was out of stock and 2X the cost.", "rating": 5}, {"title": "Customer Service went over and above to…", "text": "Customer Service went over and above to serve our needs. We are very well pleased with this company. ", "rating": 5}, {"title": "Commercial stove /very satisfied ", "text": "Good price and service.delivered very fast.happy with my salesman.will order again with Lorenzo.", "rating": 5}, {"title": "Great over all product and fast…", "text": "Great over all product and fast shipping . Great and friendly communication Easy to work with and the best !! ", "rating": 5}, {"title": "As Described, Fast Shipping", "text": "I ordered a dozen melamine serving spoons and they arrived fast. Price was reasonable compared to other sellers.", "rating": 5}, {"title": "Great Pricing and Fast shipping!", "text": "Date of experience: September 30, 2024", "rating": 5}, {"title": "Very good experience all the way around…", "text": "Very good experience all the way around from ordering to delivery. ", "rating": 5}, {"title": "customer service", "text": "John Zheng was awesome help with all information i needed to find materials and place my order", "rating": 5}, {"title": "The salesman helped us right away and…", "text": "The salesman helped us right away and with a smile something you don’t see these days 👍", "rating": 5}, {"title": "Everyone was friendly and helpful", "text": "Everyone was friendly and helpful.  A salesperson walked me to the item I was looking for and purchased.", "rating": 5}, {"title": "Fine item", "text": "Fine item, fine seller, fine service. Recommended!", "rating": 5}, {"title": "A City Discount", "text": "Lots of options. Plenty of staff available. Great selections and reasonable pricing.", "rating": 5}, {"title": "Awesome customer service", "text": "Awesome customer service, they allways make sure ,you get the right equipment ", "rating": 5}, {"title": "Larry was great", "text": "Larry was great. Easy to talk to and checked all of my options and what was best for us. Even called the manufacturer to see if I could get it faster through them.", "rating": 5}, {"title": "Great customer service and fast delivery", "text": "Great customer service and fast delivery. I have purchased several commercial appliances from A City and the service has always been great", "rating": 5}, {"title": "Brian was very helpful and you had the…", "text": "Brian was very helpful and you had the product I was looking for in stock.", "rating": 5}, {"title": "The bags arrived on time and worked for…", "text": "The bags arrived on time and worked for what we are using them for.", "rating": 5}, {"title": "Dope", "text": "Alway’s Great Services From Purchase To Pick Up… ACity Get’s An A+…💯", "rating": 5}, {"title": "Great customer service", "text": "Call customer service and they took care of the problem", "rating": 5}, {"title": "We love our new freezer", "text": "We love our new freezer! Brain Bennett was great to work with along with any other staff that we talked with. Thank you so much!", "rating": 5}, {"title": "Very helpful sales staff", "text": "Very helpful sales staff, good selection, and fast shipping.", "rating": 5}, {"title": "The product was exactly as listed and…", "text": "The product was exactly as listed and initial appearance. Delivery was efficient to Colorado; Packaging was on point. Extremely Satisfied!!! ", "rating": 5}, {"title": "Helpful staff and delivery", "text": "Alex was very helpful answering questions to help in my selection of equipment", "rating": 5}, {"title": "Comfortable and Excited.", "text": "Larry was excellent and made me feel comfortable and excited about this important purchase.", "rating": 5}, {"title": "It was a great experience and I will be…", "text": "It was a great experience and I will be coming back ", "rating": 5}, {"title": "Fast delivery", "text": "Fast delivery. Packages great without any damages. ", "rating": 5}, {"title": "Quick shipping", "text": "Quick shipping.  Excellent price on product.", "rating": 5}, {"title": "Price timely delivery", "text": "That got the product out 2 days early works as it should ", "rating": 5}, {"title": "Will definitely buy here from now on ", "text": "Everyone we talked to was great and so much help.  They delivered quick and were amazing ", "rating": 5}, {"title": "I had order seats for my stools and…", "text": "I had order seats for my stools and they fit perfectly thanks 🙏🏻 ", "rating": 5}, {"title": "good price and delivered to florida…", "text": "good price and delivered to florida fast. ", "rating": 5}, {"title": "Excellent Experience", "text": "The gentleman I spoke with was MOST HELPFUL and kind.", "rating": 5}, {"title": "Pleasant experience 👍🏼", "text": "Staff was helpful and got a great price on a used eye/ handwash combo sink.", "rating": 5}, {"title": "Fast reliable service from the…", "text": "Fast reliable service from the salesperson and exactly what I needed.", "rating": 5}, {"title": "Price, quality", "text": "Good service, good product. Reasonable price", "rating": 5}, {"title": "Great Price", "text": "Great price, fast shipping and a well packaged item. Fit perfectly. Thanks", "rating": 5}, {"title": "Nice product", "text": "Nice product. Easy maintainance. Satisfied by the service", "rating": 5}, {"title": "Everything was priced and handled…", "text": "Everything was priced and handled perfectly. Would buy from again!", "rating": 5}, {"title": "This is a best customer service…", "text": "This is a best customer service experience and great team. ", "rating": 5}, {"title": "Dax Berney was fantastic", "text": "Dax Berney was fantastic. He was extremely helpful and knowledgeable. I'd definitely recommend ACityDiscount to my associates.", "rating": 5}, {"title": "Brian D", "text": "Brian D. is an amazing sales rep.", "rating": 5}, {"title": "easy to order and good prices and fast…", "text": "easy to order and good prices and fast delivery.", "rating": 5}, {"title": "Fast, efficient service", "text": "Fast, efficient service at a reasonable price. Delivery was quick.", "rating": 5}, {"title": "Best customer service", "text": "Many items and best customer support.", "rating": 5}, {"title": "Very friendly with great customer…", "text": "Very friendly with great customer service.", "rating": 5}, {"title": "Good quality, fast shipping, no problems", "text": "Date of experience: November 19, 2023", "rating": 5}, {"title": "The staff is very welcoming. ", "text": "They had everything i needed at a great price.", "rating": 5}, {"title": "No Brainer", "text": "Simple - good product, good price, smooth transaction. ", "rating": 5}, {"title": "Good prices and great customer service!", "text": "Date of experience: March 16, 2024", "rating": 5}, {"title": "Very fast shipping and lowest prices…", "text": "Very fast shipping and lowest prices for the best products.", "rating": 5}, {"title": "I ordered over the phone and was very…", "text": "I ordered over the phone and was very happy with the assistance.  ", "rating": 5}, {"title": "Brand new appliance in the box", "text": "Brand new appliance in the box, great communication, and quick shipment.", "rating": 5}, {"title": "Very easy to work with and…", "text": "Very easy to work with and knowledgeable of what we needed.  ", "rating": 5}, {"title": "Item came promptly and was exactly as…", "text": "Item came promptly and was exactly as descibed.", "rating": 5}, {"title": "Don't think it twice ", "text": "Trusted business in the city ", "rating": 5}, {"title": "great price and great customer service", "text": "Date of experience: April 25, 2024", "rating": 5}, {"title": "VERY HELPFUL", "text": "CUSTOMER SERVICE IS VERY HELPFUL AND QUICK", "rating": 5}, {"title": "Service", "text": "Costumer service is great buy all my stuff from them", "rating": 5}, {"title": "Faster than expected!", "text": "Item showed up much faster than expected.", "rating": 5}, {"title": "The customer service is good.", "text": "The customer service is good. ", "rating": 5}, {"title": "Prompt", "text": "Prompt, friendly and efficient!", "rating": 5}, {"title": "They were so friendly and nice as…", "text": "They were so friendly and nice as always!", "rating": 5}, {"title": "Very helpful and efficient sales and…", "text": "Very helpful and efficient sales and delivery staff.  ", "rating": 5}, {"title": "easy to order and parts arrived quickly", "text": "Date of experience: April 24, 2024", "rating": 5}, {"title": "hard to find part", "text": "hard to find part. delivered quickly.", "rating": 5}, {"title": "they r very helepful actually i love it", "text": "honestly everything is nice even the workers", "rating": 5}, {"title": "Fast accurate service. Good prices", "text": "Date of experience: March 20, 2024", "rating": 5}, {"title": "Dax was fantastic", "text": "Dax was fantastic ", "rating": 5}, {"title": "Good pre-ship communications to verify…", "text": "Good pre-ship communications to verify use and proper application.  Unbelievable quick shipping, thank you.", "rating": 5}, {"title": "Price was the same as several months ago", "text": "Date of experience: February 05, 2024", "rating": 5}, {"title": "Excellent service", "text": "Excellent knowledge , quick processing and shipping — very fair and reasonable pricing", "rating": 5}, {"title": "You were quick on sending out my order right on time", "text": "You were quick on sending out my order", "rating": 5}, {"title": "ORDER WAS CORRECT AND RECEIVED IN GOOD…", "text": "ORDER WAS CORRECT AND RECEIVED IN GOOD CONDITION", "rating": 5}, {"title": "Fast shipping very good service", "text": "Fast shipping Very good service", "rating": 5}, {"title": "Hood guy help me and explain what fan…", "text": "Hood guy help me and explain what fan is the correct for hood. Thanks.", "rating": 5}, {"title": "Water Filter for Ice Machine", "text": "Great prices & quick delivery!", "rating": 5}, {"title": "Product was as advertised!", "text": "Product was as advertised! ", "rating": 5}, {"title": "The worker are very nice", "text": "The worker are very nice, and polite.", "rating": 5}, {"title": "goodm peoplem workm there", "text": "shippes, fast mgood people to work with", "rating": 5}, {"title": "Great Service", "text": "Date of experience: August 13, 2024", "rating": 5}, {"title": "good company", "text": "good customer service on time delivery thanks", "rating": 5}, {"title": "Great product fast shipping", "text": "Great product fast shipping ", "rating": 5}, {"title": "Great customer service ", "text": "The product arrived fast and in good shape. ", "rating": 5}, {"title": "Good follow through, reasonable price", "text": "Good follow through on getting order processed and responding to communications.", "rating": 5}, {"title": "Very efficient", "text": "Very efficient, very responsive! ", "rating": 5}, {"title": "Customer service friendly and helpful…", "text": "Customer service friendly and helpful with finding my merchandise. ", "rating": 5}, {"title": "Everything was great", "text": "Everything was great! Order was ready and our day went great. Thanks again", "rating": 5}, {"title": "Quick shipping", "text": "Date of experience: June 02, 2024", "rating": 5}, {"title": "Quick response and shipping info…", "text": "Quick response and shipping info communication was great.", "rating": 5}, {"title": "you sent me what I ordered", "text": "Date of experience: October 01, 2024", "rating": 5}, {"title": "good experience", "text": "Quick and easy! Delivery was on time and very delivery personal was very acomodiminating.", "rating": 5}, {"title": "Punctuality ", "text": "How quickly it arrived!", "rating": 5}, {"title": "Great environment", "text": "Great environment. Nice, friendly and professional staff", "rating": 5}, {"title": "Prompt service ", "text": "Prompt service , friendly staff", "rating": 5}, {"title": "Fast shipping", "text": "Fast shipping ", "rating": 5}, {"title": "Good service", "text": "Good service ", "rating": 5}, {"title": "correct item", "text": "this was the correct item, got here on time", "rating": 5}, {"title": "Great service", "text": "Date of experience: March 12, 2024", "rating": 5}, {"title": "Best in the business", "text": "Best in the business ", "rating": 5}, {"title": "Good great service", "text": "Date of experience: May 26, 2024", "rating": 5}, {"title": "Great service", "text": "Date of experience: March 04, 2024", "rating": 5}, {"title": "Customer Service was outstanding", "text": "Customer Service was outstanding.  Helpful courteous and customer service skills exceeded expectations.", "rating": 5}, {"title": "You had the products I was looking for…", "text": "You had the products I was looking for and needed.", "rating": 5}, {"title": "The pan was delivered quickly", "text": "The pan was delivered quickly.  It's a fine pan.", "rating": 5}, {"title": "Great Bus Bin covers for Camco", "text": "Date of experience: March 30, 2024", "rating": 5}, {"title": "Great job", "text": "Great job! Quick and easy to deal with. ", "rating": 5}, {"title": "Very fast service", "text": "Date of experience: March 06, 2024", "rating": 5}, {"title": "Got my product before I needed it 😌", "text": "Got my product before I needed it 😌 ", "rating": 5}, {"title": "Great service.", "text": "Great service.. Wonderful work ethics. ", "rating": 5}, {"title": "John was very helpful. ", "text": "John was very helpful.  ", "rating": 5}, {"title": "service and price", "text": "Date of experience: January 29, 2024", "rating": 5}, {"title": "The item I ordered was very well packed.", "text": "Date of experience: August 05, 2024", "rating": 5}, {"title": "Quick service & fast delivery.", "text": "Date of experience: April 27, 2024", "rating": 5}, {"title": "Helpful and friendly staff", "text": "Date of experience: November 08, 2023", "rating": 5}, {"title": "Brian was awesome!", "text": "Date of experience: November 01, 2023", "rating": 5}, {"title": "Easy online ordering and fast shopping", "text": "Simple online ordering made the experience pleasurable ", "rating": 5}, {"title": "Great Experience", "text": "Easy to shop and fast shipping.", "rating": 5}, {"title": "Very polite people I tell ya", "text": "Date of experience: January 13, 2023", "rating": 5}, {"title": "Great Service…", "text": "They were the only ones that had the product I needed.", "rating": 5}, {"title": "Good pricing", "text": "Ordering process is fair and efficient.", "rating": 5}, {"title": "Very Kind", "text": "Very, Very Friendly; also Helpful.", "rating": 5}, {"title": "I have used my account till 2022", "text": "Date of experience: October 27, 2023", "rating": 5}, {"title": "Very sefty and durable items", "text": "Date of experience: September 21, 2023", "rating": 5}, {"title": "Outstanding service and products", "text": "Date of experience: February 08, 2024", "rating": 5}, {"title": "Awesome people to deal with", "text": "Date of experience: December 17, 2023", "rating": 5}, {"title": "Good selection", "text": "Good selection, competitive prices, fast shipping ", "rating": 5}, {"title": "Great service", "text": "Very helpful and knowledgeable.", "rating": 5}, {"title": "Great people", "text": "Great people. Good prices. Great service.", "rating": 5}, {"title": "CEO FREDDIE", "text": "VERY GOOD VERY GOOD VERY GOOD  VERY GOOD", "rating": 5}, {"title": "Great Customer service ", "text": "The customer service was excellent ", "rating": 5}, {"title": "Everything I needed was in stock", "text": "Date of experience: February 21, 2024", "rating": 5}, {"title": "great job will buy moRe", "text": "Date of experience: March 29, 2024", "rating": 5}, {"title": "Good product and good price", "text": "Good product and good price ", "rating": 5}, {"title": "VERY GOOD", "text": "Good customer services", "rating": 5}, {"title": "Good and on time", "text": "Good and on time ", "rating": 5}, {"title": "Customer service was outstanding!", "text": "Date of experience: April 02, 2024", "rating": 5}, {"title": "Great customer service!", "text": "Date of experience: February 17, 2024", "rating": 5}, {"title": "Fast delivery", "text": "fast delivery ", "rating": 5}, {"title": "Great buying experience", "text": "Great buying experience ", "rating": 5}, {"title": "Affordable mueblez", "text": "Date of experience: October 25, 2023", "rating": 5}, {"title": "Great prices", "text": "Date of experience: February 03, 2024", "rating": 5}, {"title": "Great experience", "text": "Great experience ", "rating": 5}, {"title": "Customer😀 service", "text": "Customer service", "rating": 5}, {"title": "Mad...........", "text": "Date of experience: November 01, 2023", "rating": 5}, {"title": "Good price", "text": "Good price, fast delivery.  Product was exactly as I expected.", "rating": 5}, {"title": "I love these trays", "text": "I love these trays, the color and the sturdiness of them.", "rating": 5}, {"title": "Very helpful and give us fair advice", "text": "Date of experience: October 21, 2023", "rating": 5}, {"title": "Review from SpiceHut", "text": "We received best service from sales to GM", "rating": 5}, {"title": "VERY HELPFUL WITH OUR NEEDS", "text": "Date of experience: October 18, 2023", "rating": 5}, {"title": "No hassle with the purchase", "text": "No hassle with the purchase.  Delivery was the same day as payment.  A very nice surprise. Overall experience was very positive.  The delivery guys were friendly and helpful.", "rating": 5}, {"title": "Great help!", "text": "The rep we used for help, was super knowledgable and got us product and delivered when he said it would be. We are from Tucson, AZ we will be using this company again for more product when needed. Thank you", "rating": 5}, {"title": "Easy to order great shipping service…", "text": "Easy to order great shipping service was excellent. Product came quickly. Would use you guys again and again thank you so very much.", "rating": 5}, {"title": "Mahamed Ahmed muhumed", "text": "I have more years in city discount because my experience is atleast 7 years", "rating": 5}, {"title": "My experience is with electrical goods", "text": "My experience is with electrical goods. Very good experience. I satisfied it.everyone can b trust it.", "rating": 5}, {"title": "I like about here is All kind’s of…", "text": "I like about here is All kind’s of equipments on one place . No need to go any other place . Very neat and clear you pick so easily.", "rating": 5}, {"title": "Easy online ordering", "text": "Easy online ordering. Catalog came with order for quick ref and shipped quickly. Quality products. Thanks", "rating": 5}, {"title": "They went above and beyond and we will…", "text": "They went above and beyond and we will definitely be their client!", "rating": 5}, {"title": "Flexible and fast", "text": "Date of experience: September 28, 2023", "rating": 5}, {"title": "It was quick deliver for our business", "text": "Date of experience: October 02, 2023", "rating": 5}, {"title": "Alex is great to work with and very on…", "text": "Alex is great to work with and very on top of the whole process.", "rating": 5}, {"title": "Great experience with customer service…", "text": "Great experience with customer service and very helpful", "rating": 5}, {"title": "Great fast shipping", "text": "Date of experience: September 26, 2023", "rating": 5}, {"title": "Great staff", "text": "Great staff, smooth delivery, wonderful customer service.", "rating": 5}, {"title": "My experience is with electrical goods", "text": "My experience is with electrical goods. Very good experience. I satisfied  it.everyone can b trust it.", "rating": 5}, {"title": "Great service and trusted", "text": "Date of experience: September 20, 2023", "rating": 5}, {"title": "Very informative about what I was…", "text": "Very informative about what I was looking for and very easy for purchase afterwards.", "rating": 5}, {"title": "Low price and quick delivery", "text": "Date of experience: September 19, 2023", "rating": 5}, {"title": "Good price and free shipping", "text": "Date of experience: September 15, 2023", "rating": 5}, {"title": "fire house  ovens great help great support    outstanding…", "text": "great help great support    outstanding prompt information and service", "rating": 5}, {"title": "5 decades experience is authentic …", "text": "5 decades experience is authentic  indeed wit Acitydiscount It was never a waste of my money shopping with u, I always admire my kitchen utensils , kettle, cooker ,etc anytime I enter my kitchen It’s still new as if it was shopped just yesterday All thanks to you Great deals ; great discount!", "rating": 5}, {"title": "Always great customer service", "text": "Brian is always super helpful. The whole customer service team on the showroom floor is super professional and knowledgeable.", "rating": 5}, {"title": "Exactly what I ordered shipped it in…", "text": "Exactly what I ordered shipped it in record time and I'm very happy with this company", "rating": 5}, {"title": "Package came before time given", "text": "Date of experience: September 10, 2023", "rating": 5}, {"title": "Great", "text": "Great! Useful for many entrepreneurs to start their startup business.", "rating": 5}, {"title": "Customer service", "text": "Customer service, price, availability of products", "rating": 5}, {"title": "Amazing and fables 💯💯 peor quvalti", "text": "Date of experience: September 14, 2022", "rating": 5}, {"title": "Fast ship", "text": "Fast ship, great product - thanks", "rating": 5}, {"title": "Great Service!!", "text": "Date of experience: August 30, 2023", "rating": 5}, {"title": "Great company 👍", "text": "Date of experience: August 25, 2023", "rating": 5}, {"title": "Great folks that do what they promise.", "text": "Date of experience: August 28, 2023", "rating": 5}, {"title": "Immediate response", "text": "Immediate response, great follow thru, professional team.", "rating": 5}, {"title": "I am impressed with the quality of the…", "text": "I am impressed with the quality of the product and the packaging was very sufficient for protection of the equipment.", "rating": 5}, {"title": "delivery", "text": "delivered on time", "rating": 5}, {"title": "Great Follow-up!…", "text": "I worked with Brian and he was very accomodating and knowledgeable about the product I was purchasing.  Great follow-up!", "rating": 5}, {"title": "What I like most the website easy to…", "text": "What I like most the website easy to understand easy to put your information and easy tracking it was great thank you", "rating": 5}, {"title": "Easy and quick", "text": "Date of experience: August 22, 2023", "rating": 5}, {"title": "The deliver was made very quickly and…", "text": "The deliver was made very quickly and the item arrived in excellent shape", "rating": 5}, {"title": "Good price delivered on time very happy", "text": "Date of experience: August 21, 2023", "rating": 5}, {"title": "My salesman", "text": "My salesman, Brian, made the process easy and simple.  He kept me informed as the order processed.  Great experience for a first-time buyer.", "rating": 5}, {"title": "Excellent product", "text": "Excellent product, fast delivery", "rating": 5}, {"title": "Very fast shipping", "text": "Very fast shipping. Great selection", "rating": 5}, {"title": "Overall great experience", "text": "Overall great experience. I called to make sure the online order went through correctly. The representative made sure the order was placed correctly, helped me add on an additional shipping service, and sent a tracking number as soon as it was available. The product we order was exactly what we wanted. Highly recommend!", "rating": 5}, {"title": "Helped me a lot.", "text": "Date of experience: August 13, 2023", "rating": 5}, {"title": "Rudy", "text": "Rudy. You da man!!  Always ready to help thanks", "rating": 5}, {"title": "Very good shopping experience.", "text": "Date of experience: August 07, 2023", "rating": 5}, {"title": "Personable Service", "text": "Fellow that I spoke with on the phone did an awesome job asking me questions and helping me determine what I needed.  We had a little bit of trouble when my wife picked up the machine since I purchased it and she was picking it up but they worked through it with us and we were able to pick it up.", "rating": 5}, {"title": "quick shipping and quality product.", "text": "Date of experience: August 07, 2023", "rating": 5}, {"title": "Outstanding services", "text": "Outstanding services! Great communication with customer service. Products are great at a great price. No issues what so ever.", "rating": 5}, {"title": "Customer service was amazing!!", "text": "Date of experience: July 27, 2023", "rating": 5}, {"title": "Great price on the ice machine and bin.", "text": "Great price on the ice machine and bin.Outstanding communication and fast shipping.I would deal with them again without hesitation.", "rating": 5}, {"title": "Delivery was on time", "text": "Delivery was on time, nice", "rating": 5}, {"title": "thank you for everything", "text": "Date of experience: July 29, 2023", "rating": 5}, {"title": "Fast shipping and good prices are the…", "text": "Fast shipping and good prices are the reason to buy here.", "rating": 5}, {"title": "like what most customers saying", "text": "like what most customers saying, ACITYDISCOUNT is what we could trust forever", "rating": 5}, {"title": "Driver was very helpful and pleasant", "text": "Driver was very helpful and pleasant.  Delivery was on time!!", "rating": 5}, {"title": "Mike was a big help in assisting me…", "text": "Mike was a big help in assisting me with my shelving and working with my budget.", "rating": 5}, {"title": "Customer support was great", "text": "Customer support was great. We received our exhaust fan two days before expected arrival!!!", "rating": 5}, {"title": "Another successful sale", "text": "We get all of our hotels appliances from A City Discount. They have amazing customer service, and they always have what we need in stock.", "rating": 5}, {"title": "amazing i am very interested in the…", "text": "amazing i am very interested in the product once the goods look very luxurious let's all shop here..", "rating": 5}, {"title": "Trustworthy", "text": "Trustworthy, Plain sailing transaction. Will buy again!", "rating": 5}, {"title": "Very good experience", "text": "Very good experience. I liked. Comfortable with low prices. Plz visit", "rating": 5}, {"title": "Our experience was excellent", "text": "Our experience was excellent. Ordering was easy, accurate and received promptly. Thank you", "rating": 5}, {"title": "Great, fast and cheap. Pick three", "text": "Brian was great when we spoke. After ACity shipped the order, he took the time to send a personal email providing tracking info and thanking me.", "rating": 5}, {"title": "Simple and fast.", "text": "Date of experience: July 22, 2023", "rating": 5}, {"title": "We received excellent service From Alex…", "text": "We received excellent service From Alex and his Manager. They took time to show and explain detail the products they carry and eager to source which was not available on the store", "rating": 5}, {"title": "On time and accurate", "text": "Date of experience: July 16, 2023", "rating": 5}, {"title": "Easy to find item and fast shipping", "text": "Date of experience: July 12, 2023", "rating": 5}, {"title": "Alex was amazing can us very detailed…", "text": "Alex was amazing can us very detailed care.", "rating": 5}, {"title": "Ben and the delivery team are…", "text": "Ben and the delivery team are rockstars! I appreciate y’all!", "rating": 5}, {"title": "Availability Fair pricing great…", "text": "Availability Fair pricing great customer service RE", "rating": 5}, {"title": "Bought a panini grill", "text": "There are tons of different furniture and equipment, and, actually, I applied for services to this company when I made a slight renovation of my kitchen. The assortment stunned me for real, and I found a paning grill of a high quality. Couple of tasty paninis were already done! Now I know where to order stuff quickly and free of any hustle.", "rating": 5}, {"title": "Package delivered on time", "text": "Date of experience: July 01, 2023", "rating": 5}, {"title": "BUSINESS PARTNERGood price ,products in stock and fast…", "text": "Good price ,products in stock and fast shipping.", "rating": 5}, {"title": "super quick delivery", "text": "Date of experience: June 26, 2023", "rating": 5}, {"title": "You had the item that I was looking…", "text": "You had the item that I was looking for. Your representative Adam was able top find the item in stock. It was delivered in a timely fashion. This is my second purchase from your company. I will purchase again as needed.", "rating": 5}, {"title": "Extremely fast service and best price…", "text": "Extremely fast service and best price out there", "rating": 5}, {"title": "If you want more discount", "text": "If you want more discount, you have to use this company", "rating": 5}, {"title": "They were able to Pivot to make sure my…", "text": "They were able to Pivot to make sure my item got to the right address. Great communication", "rating": 5}, {"title": "Brian Bennett was amazing", "text": "Brian Bennett was amazing!  He went out of his way to find the right unit for us.  He was patient with our inquires and extremely helpful and prompt.  I would definitely recommend your services.", "rating": 5}, {"title": "Quick delivery", "text": "Very responsive and good team they did a great job very friendly and helpful!", "rating": 5}, {"title": "Great as always!", "text": "Date of experience: June 19, 2023", "rating": 5}, {"title": "William Little always beyond…", "text": "William Little always beyond expectations to make sure I’m taking care of!!!!", "rating": 5}, {"title": "Excellent service", "text": "Date of experience: June 17, 2023", "rating": 5}, {"title": "NO B.S.", "text": "I LIKE WHEN THE TRUTH IS OUT RIGHT FROM THE BEGINING . I WILL BUY FROM U GUYS AGAIN.", "rating": 5}, {"title": "Execellent Quality of shipping and fast", "text": "Great instructions on receiving and resolving issues thankfuly there was not any on our order will  be coming back aging in the future", "rating": 5}, {"title": "They helped me with so much couldn't…", "text": "They helped me with so much couldn't thank them enough.", "rating": 5}, {"title": "I knew what I wanted", "text": "I knew what I wanted, walked straight to it and got everything I wanted in seconds.", "rating": 5}, {"title": "Faucet", "text": "Ez to navigate the site, product was as advertised..on time delivery..", "rating": 5}, {"title": "Executing the order was a breeze", "text": "Executing the order was a breeze, and the swift shipping and delivery were impressive. I wouldn't hesitate to make another purchase and suggest this company to others!", "rating": 5}, {"title": "Product was exactly as described and…", "text": "Product was exactly as described and came very quickly.", "rating": 5}, {"title": "Great product", "text": "Great product, easy to use, arrived when promised", "rating": 5}, {"title": "Good price and fast delivery.", "text": "Date of experience: May 29, 2023", "rating": 5}, {"title": "Really good experience", "text": "Everyone really put a big effort into my small order and made sure I had the right product and even called me when there was a question about my delivery!", "rating": 5}, {"title": "nice to see who really help me.", "text": "Date of experience: May 19, 2023", "rating": 5}, {"title": "Very very professional", "text": "Very very professional. My package was perfect!! Thanks", "rating": 5}, {"title": "Really good", "text": "Everyone really put a big effort into my small order and made sure I had the right product and even called me when there was a question about my delivery! The kind of customer service you dream about!", "rating": 5}, {"title": "this company takes their job seriously", "text": "this company takes their job seriously, they messaged me to verify that what was ordered was the correct part for my project and all work great.  thanks I recommend it 100%", "rating": 5}, {"title": "Great sales and customer service team", "text": "Great sales and customer service team. Product quality is outstanding. Excellent communication. The experience from placing the order to delivery was very smooth and efficient.", "rating": 5}, {"title": "Alex was great with helping me find the…", "text": "Alex was great with helping me find the right ice maker - I will always ask for him - no I don't know him - he is not a buddy and we are not related", "rating": 5}, {"title": "Easy purchase", "text": "Easy purchase after speaking w a sales rep. Packaging helped my items arrive without damage. Thank you and not only will I purchase from you, I’ll be telling about this company", "rating": 5}, {"title": "Great product", "text": "Great product! Great company, delivery was on time and the product worked great! Well packaged and arrived safely. Thanks to their staff.", "rating": 5}, {"title": "Quick delivery", "text": "Date of experience: May 04, 2023", "rating": 5}, {"title": "Great customer service", "text": "Great customer service.  Rudy is the best!  Everything is exactly like it supposed to be.", "rating": 5}, {"title": "They researched the part for me and…", "text": "They researched the part for me and then I ordered. Came very quickly. Perfect. Thanks", "rating": 5}, {"title": "Response time and the parts were correct.", "text": "I received the correct product that I ordered in a timely fashion.", "rating": 5}, {"title": "Everything was great", "text": "Great customer service and follow up. Quick delivery & Nice product at good price. Thanks.", "rating": 5}, {"title": "Item received in great condition", "text": "Item received in great condition.  Packed super-well.  Good product.", "rating": 5}, {"title": "I found what i was looking for and…", "text": "I found what i was looking for and happy with my purchase.", "rating": 5}, {"title": "Everyone really put a big effort into…", "text": "Everyone really put a big effort into my small order and made sure I had the right product and even called me when there was a question about my delivery!   The kind of customer service you dream about!", "rating": 5}, {"title": "Knowledgeable Staff and Customer…", "text": "Knowledgeable Staff and Customer Service is what makes ACity Discount a great company to do business with. They go above and beyond to be sure we're satisfied. Would definitely recommend them to anyone outfitting a restaurant.", "rating": 5}, {"title": "I purchased the coffee grinder", "text": "I purchased the coffee grinder, it was well packaged and arrived in perfect condition. Shipping was very fast. Great experience!", "rating": 5}, {"title": "Brian was very helpful and had a great…", "text": "Brian was very helpful and had a great serving sprit.", "rating": 5}, {"title": "Fast shipping", "text": "Fast shipping. Good price. Accurate product description.", "rating": 5}, {"title": "Fast", "text": "Fast, easy, best price", "rating": 5}, {"title": "I bought Adidas Sweater for my…", "text": "I bought Adidas Sweater for my daughter, she love it and quick ship.Thanks", "rating": 5}, {"title": "I recently purchased a dishwasher from…", "text": "I recently purchased a dishwasher from ACityDiscount, and I was very impressed with their service. The staff were knowledgeable and helped me choose a model that fit my needs and budget perfectly.", "rating": 5}, {"title": "Super fast delivery on quality…", "text": "Super fast delivery on quality products! Excellent communication from Acity discount too. You keep your customers well informed.", "rating": 5}, {"title": "Good Price", "text": "Good Price,  staff knew the business.  Item arrived in 3 days in perfect condition", "rating": 5}, {"title": "Exhaust Systems", "text": "Great service and trust worthy", "rating": 5}, {"title": "Customer service...THE BEST", "text": "Customer service was almost better than our best wine! Shopping online then calling to getting a Real Person (Alex) to help me with my decisions.  Followed up by a call from the manager to make sure everything was good.  THEN, my shipment showed up in 2 days!!", "rating": 5}, {"title": "Got it & IT’S BIG WOW", "text": "Date of experience: April 11, 2023", "rating": 5}, {"title": "Easy ordering", "text": "Easy ordering, fast delivery", "rating": 5}, {"title": "Great service by Brian and others.", "text": "Date of experience: April 01, 2023", "rating": 5}, {"title": "Great customer service", "text": "Date of experience: April 09, 2023", "rating": 5}, {"title": "With a remarkable services provided by…", "text": "With a remarkable services provided by A city discount.  The equipment for our kitchen  was taken by acitydiscount.com.  Really very professional in making our life easier and approachable.  Really obliged by giving us required Kitchen Equipments.", "rating": 5}, {"title": "New Upright Freezer", "text": "I worked with Larry, who laid out the pricing, including some delivery options, and clearly described the process. Once I placed the order, I was kept informed of the timing of the delivery. The unit was delivered on the day that Larry said it would, and the gentlemen that delivered the unit, and removed the old one were very professional, and fully met our expectations. The whole process was smooth, and professional.", "rating": 5}, {"title": "Speedy service and delivery.", "text": "Date of experience: March 27, 2023", "rating": 5}, {"title": "Exhaust fan", "text": "Very friendly salesman fast service and shipping.", "rating": 5}, {"title": "Excellent price for a water filter", "text": "Excellent price for a water filter, very fast delivery. Will purchase from them again!", "rating": 5}, {"title": "Good and prompt service, fair prices", "text": "Courteous and prompt service and fair prices.", "rating": 5}, {"title": "Pricing is on point and anytime i have…", "text": "Pricing is on point and anytime i have any questions a sales associate is always knowledgeable about the products in inventory.", "rating": 5}, {"title": "Brian Bennett was just great", "text": "Brian Bennett was just great, and my guy came and picked it right up. They were actually the same price as a big online retailer that we usually order from, which is really great since we could go by and pick up the kitchen equipment", "rating": 5}, {"title": "Great price", "text": "Great price. Fast shipping.", "rating": 5}, {"title": "Great service", "text": "Great service! Highly recommend ACD for all your food service needs!", "rating": 5}, {"title": "Great customer service", "text": "Great customer service, great service and delivery at a great price. The driver contacted me immediately before delivery and the driver was very helpful.", "rating": 5}, {"title": "Part came in a lot quicker than…", "text": "Part came in a lot quicker than expected.", "rating": 5}, {"title": "Excellent customer service and great…", "text": "Excellent customer service and great prices! The salesmen took the time to explain the products to me.", "rating": 5}, {"title": "The customer service is excellent", "text": "The customer service is excellent, they have fast service and delivery, and good prices. I was contacted before the shipment and the driver was very helpful. I will definitely visit them again.", "rating": 5}, {"title": "Very quick and knowledgeable service.", "text": "Date of experience: March 03, 2023", "rating": 5}, {"title": "Got contacted before the shipping", "text": "Got contacted before the shipping. Delivery on time. The driver was very helpful. Overall a great experience.", "rating": 5}, {"title": "Great performance", "text": "This s the second time i have ordered from ACity, great service and good price.", "rating": 5}, {"title": "Amazing personal service. Bryan Bennett was great.", "text": "Helpful, friendly, efficient.I bought a new 6 burner gas range.Customer service is great, delivery guys were amazing.5 stars :)", "rating": 5}, {"title": "Prompt service", "text": "Prompt serviceQuick deliveryFriendly helpful sales people", "rating": 5}, {"title": "Alex Excellent customer service", "text": "Date of experience: February 28, 2023", "rating": 5}, {"title": "Best retail", "text": "Shopped for my upcoming cafe. The pricing was reasonable, and the staff were really helpful.", "rating": 5}, {"title": "Great service", "text": "Great service, friendly associates. Will return", "rating": 5}, {"title": "Great purchase experience", "text": "Great purchase experience. Bought a wine cooler a month ago. It's a good way for my wine.Thank you", "rating": 5}, {"title": "Very quick service and delivery.", "text": "Very knowledgeable about product and delivery was on time and fast.", "rating": 5}, {"title": "Exceptional Customer Service", "text": "Josh responded to my msg asking for help early the next day.  Facilitated my ordering, helped me process tax exempt cert. and got me to order confirmation all in a matter of a few hours.  Truly Exceptional customer service.", "rating": 5}, {"title": "Thanks for the great service.", "text": "Date of experience: January 19, 2023", "rating": 5}, {"title": "product availabe shipment was speedy", "text": "Date of experience: January 19, 2023", "rating": 5}, {"title": "great service great product", "text": "Date of experience: January 09, 2023", "rating": 5}, {"title": "Quick service", "text": "Date of experience: January 12, 2023", "rating": 5}, {"title": "Pleasure to do business with!", "text": "Order correctFair pricingOn time", "rating": 5}, {"title": "Great product and fast shipping", "text": "Date of experience: January 12, 2023", "rating": 5}, {"title": "great follow up quick service", "text": "Easy to order items.  Items in stock Great follow up Great experience", "rating": 5}, {"title": "Excellent   !    Thank you   !", "text": "Date of experience: January 10, 2023", "rating": 5}, {"title": "Customer service", "text": "Date of experience: December 31, 2022", "rating": 5}, {"title": "Customer support makes a difference", "text": "I had to exchange a product and ACityDiscount made it easy.Thanks again Mike!", "rating": 5}, {"title": "Quick shipping time", "text": "Quick shipping time. Product arrived undamaged.", "rating": 5}, {"title": "Fast shipping", "text": "Fast shippingLow prices", "rating": 5}, {"title": "Definitely will order more in the…", "text": "Definitely will order more in the future. The shipping is very fast, had no problems at all.", "rating": 5}, {"title": "All you hope for in an order.", "text": "Easy to order, fast delivery, good price.", "rating": 5}, {"title": "As Doctors say “Unremarkable”", "text": "As Doctors say “Unremarkable”. This experience was no problem whatsoever!!", "rating": 5}, {"title": "Great service!!!!", "text": "I ordered a commercial Kitchen Aid Mixer as a last minute Christmas gift. I did in store pick up. The product was there waiting for me when I arrived. Kind and courteous staff made my pick up on a cold day a wonderful experience.", "rating": 5}, {"title": "Quick service", "text": "Date of experience: December 20, 2022", "rating": 5}, {"title": "Our salesman was wonderful and patient…", "text": "Our salesman was wonderful and patient with us. We came in to browse and check prices and left purchasing all the equipment for our new food trailer.", "rating": 5}, {"title": "Recommended", "text": "Not the first order and not the last, ACityDiscount always comes through with a sensible price for what we need and the ordered item arrives in a timely manner, not lost or damaged.", "rating": 5}, {"title": "Friendly staff thats so helpful.", "text": "Date of experience: December 10, 2022", "rating": 5}, {"title": "always like dealing with Larry.You rock…", "text": "always like dealing with Larry.You rock Larry", "rating": 5}, {"title": "Fast shipping", "text": "The back splashes arrived on time and just as described on web site. Good quality product and service!", "rating": 5}, {"title": "Helpful Staff and quick order delivery", "text": "Date of experience: December 02, 2022", "rating": 5}, {"title": "Fast shipping", "text": "Fast shipping, great prices", "rating": 5}, {"title": "Great service and great prices!", "text": "Date of experience: December 01, 2022", "rating": 5}, {"title": "Quick shipping and a fair price", "text": "Date of experience: December 08, 2022", "rating": 5}, {"title": "Great Price arrived within days of…", "text": "Great Price arrived within days of ordering in great shape.  Ordered over holiday weekend when called on Monday the person I spoke with was very helpful and even emailed me back within hours to let me know my shipment was being sent later that week.  Very pleased.  The item I ordered was a pizza prep table.", "rating": 5}, {"title": "Item came earlier than specified.. Good service..", "text": "Fast Delivery!!", "rating": 5}, {"title": "Good costumer service.", "text": "Date of experience: November 26, 2022", "rating": 5}, {"title": "Great price and quick delivery.", "text": "Date of experience: November 23, 2022", "rating": 5}, {"title": "Larry made everything easy as could be", "text": "Larry made everything easy as could be. Super fast shipping and delivery!!", "rating": 5}, {"title": "ACity Discount is my go-to company when…", "text": "ACity Discount is my go-to company when we need good products. Thank you!", "rating": 5}, {"title": "Competitive price and quality reviews", "text": "Competitive price and quality reviews. Glad I read reviews of several vendors with same price.", "rating": 5}, {"title": "Quick delivery and product as…", "text": "Quick delivery and product as advertised!", "rating": 5}, {"title": "Reasonable price", "text": "Reasonable price.  Fast shipping.   Polite and caring staff.", "rating": 5}, {"title": "Competitive price and quality reviews", "text": "Competitive price and quality reviews. Glad I read reviews of several vendors with same price.Shipping was prompt - Though carrier was late with delivery. I offered to pick up at terminal but that didn’t fit the “process”.", "rating": 5}, {"title": "Delivered very quickly as requested and…", "text": "Delivered very quickly as requested and arrived and my husband was very pleased. Highly recommend the seller.", "rating": 5}, {"title": "Water filter replacement", "text": "Fast service, great price.", "rating": 5}, {"title": "Cleaning home", "text": "It's just a little bitIt's not a hardIt's very simpleIt's not a jokeIt's very easyIt's very excitedIts own wayI love him", "rating": 5}, {"title": "great service", "text": "Date of experience: November 08, 2022", "rating": 5}, {"title": "Shipped fast and arrived on time", "text": "Shipped fast and arrived on time，But I don't understand why I can only buy one?  So I had to ask my friend to buy a second one for me", "rating": 5}, {"title": "All worked out as stated!", "text": "Date of experience: October 28, 2022", "rating": 5}, {"title": "I would highly recommend after my…", "text": "I would highly recommend after my purchase of applianc They were helpful and not pushy. I'm happy it's a reliable store", "rating": 5}, {"title": "No problems ordering and it came in a…", "text": "No problems ordering and it came in a few days.", "rating": 5}, {"title": "Customer service was superb.", "text": "Price was right. Customer service was superb. Got the product before expected date", "rating": 5}, {"title": "William's attention to detail in…", "text": "William's attention to detail in processing our order. He also followed up to make sure that we knew when the  delivery was forth coming.", "rating": 5}, {"title": "Customer service was excellent from…", "text": "Customer service was excellent from placing the order to the delivery. The delivery guy were very professional and helpful. And the pricing was great!!", "rating": 5}, {"title": "Kegerator purchase", "text": "Great service, good communication and quick shipping! Brian was awesome help. Will buy from again!", "rating": 5}, {"title": "Nice Visit. Great Service", "text": "Josh got me in touch with Larry. Larry was very quick with helping me find the products I was looking for. Quick and easy visit to the location.", "rating": 5}, {"title": "Brian", "text": "Brian! Brian! Brian!", "rating": 5}, {"title": "Very professional and very prompt", "text": "Very professional and very prompt.  Received my order within 4 days, I would recommend this company to everyone I know!!", "rating": 5}, {"title": "A necessary DO-Over!", "text": "I've always said they send those surveys out WAY too fast for a good review.  Having received it on a Friday when I was a bit \"bitter\" but had no real path to recourse until Monday. I gave a \"not so good\" review.  Not hateful but certainly \"CHEESED.\"The person who ordered this with me, Josh was wonderful.  I was in need of the Grill in an immediate way, so he worked with what he knew he had readily available, and that could be shipped for delivery a few days later.  I had issues with delivery. Being proactive I did have a smooth delivery. I Initially reported that this unit was manufactured in 2003, and in fact, the unit was manufactured in August of this year.   This HAD immediate issues with the center control, heating the grill to well over 500 degrees and it is now discolored, but I had IMMEDIATE response to these issues the very first call I made on the first business day these folks were available. The company they shipped this trough was great, but THEY DID NOT HAVE A PHONE NUMBER TO REACH ME!! I have an unusual Business Unique to FOB type deliveries.  Because I had all of the delivery information sent just after purchase, it was simple to call and speak directly to Dispatch. I had an email telling me it was out for delivery, STOP 13. As I began to worry it was easy to become proactive when all it took was phone call to resolve the connection issue and get the delivery.  I have ordered from ACityDiscount before, even though I had some bumps this time, I have to say all was resolved with IMMEDIATE action from both ACD  and Star Manufacturing.  DO note where I wanted a good grill that was priced less, I ended up getting a VERY good discount on a better grill, with a 2 year parts and labor warranty AND the repair will be done within a few days.  STAR even shipped a part in case the one we have is bad. GOOD treatment ALL the way around.  !!!!!", "rating": 5}, {"title": "Fast service", "text": "Date of experience: October 14, 2022", "rating": 5}, {"title": "Atlanta’s The Best Restaurant Supply…", "text": "Atlanta’s The Best Restaurant Supply Equipment place Ever!!", "rating": 5}, {"title": "This is our second order with ACity and…", "text": "This is our second order with ACity and both went very well. They were attentive, quick and the process was seamless.", "rating": 5}, {"title": "Great company to order from.", "text": "It was easy to find what I needed to order. The process was simple. It arrived quickly and the order was correct. Will definitely reorder with them.", "rating": 5}, {"title": "Great product at an affordable price…", "text": "Great product at an affordable price with quick delivery!", "rating": 5}, {"title": "ACityDiscount prices are typically the…", "text": "ACityDiscount prices are typically the cheapest with free shipping that was amazing, Their platforms is easy to use with smooth transaction so great to work with", "rating": 5}, {"title": "Tax-exempt and replacement of item damaged in shipping", "text": "Brian B helped me with the tax-exempt status for my order and he is the best! The first freezer we received was damaged, but because I watched the video by A City, I had taken pictures before and after opening the crate which documented the damage. The process for getting a replacement was very easy, Sofia was so helpful, and I got my replacement freezer within a week. Things happen, but they made it right.  Thank you so much!!", "rating": 5}, {"title": "Very helpful sales associates", "text": "Very helpful sales associates .  They always have what i need in stock . Shipping was mind blowing fast this time .. will use them again .", "rating": 5}, {"title": "Great Service", "text": "Prompt excellent and professional service", "rating": 5}, {"title": "Good company", "text": "Date of experience: October 03, 2022", "rating": 5}, {"title": "Funnel Cake Fryer", "text": "A City Discount is so great to work with. Rudy has always went out of his way to help me. He is great. I would highly recommend this company.", "rating": 5}, {"title": "Great product undamaged shipping was…", "text": "Great product undamaged shipping was quick also", "rating": 5}, {"title": "Great addition!", "text": "Our guests appreciate the option to be able to charge their devices at our bar while having a beverage and some great food. These were an easy choice and fairly priced.", "rating": 5}, {"title": "Always attentive and efficient.", "text": "Date of experience: September 12, 2022", "rating": 5}, {"title": "Repeat customer", "text": "I have purchased replacement ice machine filters for the work setting from ACityDiscount for several years now.  Their prices are typically the lowest and with free shipping on these items the decision is easy.  Online ordering is a breeze and shipping is very quick as well.  I will continue to purchase from ACityDiscount in the future.", "rating": 5}, {"title": "thank you for your promptness", "text": "Date of experience: September 27, 2022", "rating": 5}, {"title": "Exactly what I was looking for", "text": "Exactly what I was looking for.  Fair price.  FAST shipping!", "rating": 5}, {"title": "Great services", "text": "Date of experience: September 20, 2022", "rating": 5}, {"title": "Excellent service", "text": "Great team work", "rating": 5}, {"title": "Had what I wanted in stock", "text": "Had what I wanted in stock. Easy to shop and checkout. Merchandise arrived earlier than expected. Will shop with them again.", "rating": 5}, {"title": "Fast shipping", "text": "Fast shipping, got item earlier than I expected", "rating": 5}, {"title": "Smooth transaction and quick shipment", "text": "Date of experience: September 12, 2022", "rating": 5}, {"title": "Delivery sooner than expected", "text": "Delivery sooner than expected Order on Thursday and received on Monday", "rating": 5}, {"title": "Furniture in a perfect condition.", "text": "Furniture in a perfect condition, took a couple of days to deliver. good price.", "rating": 5}, {"title": "Well pleased with the items I ordered.", "text": "well pleased with the items I ordered.", "rating": 5}, {"title": "Good selection", "text": "Good selection, good prices, good feedback.", "rating": 5}, {"title": "Good service", "text": "Good service and good experience with them.They are really professional and friendly", "rating": 5}, {"title": "Exactly what we needed", "text": "We needed plastic containers for our hen nesting boxes, to avoid absorbing moisture into the nesting material.  These storage containers are the perfect size and shape.  Shipping was super fast too!", "rating": 5}, {"title": "It was a good experience", "text": "It was a good experience. Easy to work with.", "rating": 5}, {"title": "Good", "text": "Good price buy it again", "rating": 5}, {"title": "Great service by Adam", "text": "Adam was attentive, professional. Best of all he keep up with all my orders through email ! Great service!", "rating": 5}, {"title": "Ice Machine Filters", "text": "My filters came fast", "rating": 5}, {"title": "Brian was very helpful and expedient in…", "text": "Brian was very helpful and expedient in getting us the supplies requested.  I wouldn't hesitate reaching out to him again if needed.", "rating": 5}, {"title": "Fantastic Service", "text": "We came into A City Discount to buy a chafing dish and were surprised and pleased to see they offered quite a selection.  We were assisted by Mike who showed us the options, talked about the differences and also guided us through some add-on items.  It was a great sales experience and we would definitely recommend A City for any restaurant or catering needs.", "rating": 5}, {"title": "Love the service and quality of…", "text": "Love the service and quality of furniture. Can't wait for my newest addition to our home!", "rating": 5}, {"title": "Brian is excellent", "text": "Brian is excellent!  He's attentive and supportive!  Very helpful!!", "rating": 5}, {"title": "happy with my order", "text": "happy with my order. furniture in a perfect condition, took a couple of days to deliver. good price. 100% satisfied", "rating": 5}, {"title": "Everything went ok with the sales staff…", "text": "Everything went ok with the sales staff and delivery.", "rating": 5}, {"title": "This is the second order I have made…", "text": "This is the second order I have made with Josh. He is very helpful and has taken care of my order right away. I have a place in Charlotte that I could order from but I prefer to use Josh.", "rating": 5}, {"title": "Great service", "text": "I receive my order in a timely manner it was in good condition.", "rating": 5}, {"title": "Easy to order & quick delivery", "text": "Placing the order was easy and my order was shipped and delivered promptly. I would order again and recommend this company to others.....", "rating": 5}, {"title": "William did an amazing job of answering…", "text": "William did an amazing job of answering our questions and making sure we had the right supplies.", "rating": 5}, {"title": "Was quick very happy", "text": "Date of experience: August 20, 2022", "rating": 5}, {"title": "good selection", "text": "good selection, good prices, good feedback everything was veeeery goooood, I really satisfied with my purchases from your store", "rating": 5}, {"title": "everything went off with out a hitch", "text": "Date of experience: August 18, 2022", "rating": 5}, {"title": "You had what I needed in stock and…", "text": "You had what I needed in stock and shipped it out fast.", "rating": 5}, {"title": "Correct product ordered and received…", "text": "Correct product ordered and received very timely fashion.  Thanks.", "rating": 5}, {"title": "Handwashing Sink", "text": "My business was in need of a handwashing sink.  A City made it very easy for us to search online, purchase online and pick up the same day!", "rating": 5}, {"title": "Great help from costumer service", "text": "Great help from costumer service. I would recommend it for sure", "rating": 5}, {"title": "Everything is great", "text": "Everything is great, assortment, prices, employees, lots of stuff, service is great", "rating": 5}, {"title": "I started out online searching for an…", "text": "I started out online searching for an ice maker and fortunately found you all and read up on some of the company history.  After researching you all I decided that ACityDiscount.com was where I wanted to spend!Upon arrival I was formally greeted by Brian Dufries and he went on to show me everything I did not know about ice makers and sold me the correct Manitowoc unit. I will come back to ACD in the future as needed.Steve VaughanFox Rowden McBrayer, Inc.Norcross, GA 30093", "rating": 5}, {"title": "great service!!!", "text": "Date of experience: August 01, 2022", "rating": 5}, {"title": "Found exactly what I needed", "text": "Found exactly what I needed. Product came quickly and in perfect condition.", "rating": 5}, {"title": "The team is very good and responsive", "text": "The team is very good and responsive. It's a friendly team with professionals. My order is fulfilled on time", "rating": 5}, {"title": "Found exactly what I needed!", "text": "Found exactly what I needed. Product came quickly and in perfect condition.", "rating": 5}, {"title": "Perfect", "text": "Everything went as stated and no one else could get the ice machine in less than a few months I got it in a couple days", "rating": 5}, {"title": "Quick Ship!", "text": "Found just what we needed at a considerably lower price than other vendors. Quick ship too!", "rating": 5}, {"title": "Website extremely easy to use", "text": "Website extremely easy to use, shipping was fast and pricing was great.", "rating": 5}, {"title": "Very helpful staff", "text": "Very helpful staff, and knowledgeable.", "rating": 5}, {"title": "GREAT PRODUCT", "text": "IT IS A GREAT PRODUCT AND JUST WHAT I WAS LOOKING FOR AS  A REPLACEMENT..", "rating": 5}, {"title": "Helpful + Competitive", "text": "Great to work with and willing to undercut the competition.", "rating": 5}, {"title": "Good price and fast delivery.", "text": "Date of experience: July 20, 2022", "rating": 5}, {"title": "I purchased all my restaurant equipment…", "text": "I purchased all my restaurant equipment here. I got them at a competitive price, I even got discount. Good quality.", "rating": 5}, {"title": "Everything went according to plan!!", "text": "Date of experience: July 11, 2022", "rating": 5}, {"title": "awesome", "text": "the items where as i ordered them and the dilivery was fast! thank you!", "rating": 5}, {"title": "Brian Dufries was the best!", "text": "Brian Dufries was the best!  He didn't even carry the product that I was looking for, but went above and beyond and was able to get me the product I was looking for.  Thanks again, and I will be calling on ACity again...", "rating": 5}, {"title": "Pleasantly surprised at the quick…", "text": "Pleasantly surprised at the quick shipping of our order.  Thank you.", "rating": 5}, {"title": "Josh was super helpful and quickly…", "text": "Josh was super helpful and quickly found out details and got my order placed. Called back when he said he would, and order follow up was great. Would definitely order again from ACityDiscount when the opportunity presents itself.", "rating": 5}, {"title": "Totally happy", "text": "Totally happy, packed well and survived the shipping with no problems.Thanks....Jay from Minnesota", "rating": 5}, {"title": "Prompt action!!", "text": "Shipped quickly!  Received in perfect condition!  Easily installed and ICE WAS MADE IN JUST A FEW MINUTES!  Thank you!!!", "rating": 5}, {"title": "ABC restaurant store is conveniently…", "text": "ABC restaurant store is conveniently located for all to see from I85.  It contains various restaurant tool options.  The prices are reasonable and the customer service is great.", "rating": 5}, {"title": "Today I received the parcel", "text": "Today I received the parcel, how nice to receive such a work of art. Thank you very much. I will order more. Thank you.", "rating": 5}, {"title": "Item was just what I needed at a…", "text": "Item was just what I needed at a reasonable price when I asked about a tray a link was provided so it could also be ordered at a reasonable price. Deliver was quick and easy.", "rating": 5}, {"title": "Packaged great", "text": "Packaged great, equipment was well protected. Smooth delivery. Purchased by my father (I completed the online order).", "rating": 5}, {"title": "Glass Chiller", "text": "Called ahead to time to check inventory, and item was in stock on the west coast.  Placed order online, easy to do.  Shipper left it on the front porch with customers.  Good thing they were honest ones..... Shipper asked them for a name.  My employee never spoke to them or signed for it.  Everyone loves the chilled glasses.", "rating": 5}, {"title": "Great selection and fast delivery!", "text": "I was having trouble finding the exact airpots I like to use at my shop and I was able to find them for a good price. We like the Thunder Group brand best and were excited to find them.", "rating": 5}, {"title": "Timely shipping and product was as…", "text": "Timely shipping and product was as stated.", "rating": 5}, {"title": "Best in Class Customer Service & Delivery", "text": "We purchased a Merchandiser Refrigerator which has a glass front and lots of shelves for chilling bottled water and cans of sodas/other beverages for our 55+ community center events.  These are great!  No coolers, no ice to buy, no spills to clean up or cause safety concerns. Get the one on caster wheels so you can move it around your location for whatever activity you have going on.  My sales associate was Brian Bennett and he was awesome!  I'd been looking for one of these for 7 months and was told by most companies they didn't have them in stock due to supply chain issues.  I found Brian in March and he gave me quotes of different sizes both with/without wheels. Very fair. The approvals for purchase took a while on our end, but once we gave him our credit card number he ordered right away and we received our merchandiser within a few days.  Over all an A+ 5-star rating for Brian Bennett for great customer service and follow through (plus patience!).  Highly recommend this product and this company.", "rating": 5}, {"title": "Excellent service", "text": "Excellent service,  professionals agents in the customer service, we wait for the best price, but your is not too bad, I wish its can better.", "rating": 5}, {"title": "Received order as expected", "text": "Received order as expected. Thanks!", "rating": 5}, {"title": "Everything came with the sink that I…", "text": "Everything came with the sink that I ordered on time and with no issues I will be looking to use them again in the future", "rating": 5}, {"title": "Customer service is second to none", "text": "Customer service is second to none.  They answered all my questions and went out of their way to make sure I left happy. Alex really brightened up my day, I'll definitely be coming back here for anything I need.", "rating": 5}, {"title": "Great product", "text": "Great product, great price reasonably fast shipping all things considered", "rating": 5}, {"title": "Everything works great", "text": "Everything works great, fits perfect, arrived in a timely fashion.", "rating": 5}, {"title": "Excellent service", "text": "Date of experience: June 01, 2022", "rating": 5}, {"title": "Quick Service", "text": "The service was quick. FromPurchase to deliver was 4 days!", "rating": 5}, {"title": "As expected!", "text": "Date of experience: May 28, 2022", "rating": 5}, {"title": "GREAT PRICE AND FAST DELIVERY.", "text": "Date of experience: May 25, 2022", "rating": 5}, {"title": "ACD has excellent customer service", "text": "ACD has excellent customer service. We've been using them for years and they are a great go to, when you are looking for a new link in your supply chain. Brian Bennett and all of the sales folks are very professional and a pleasure to work with....and they have a  showroom with a small wares section because sometimes I want to see it, touch it, feel it.", "rating": 5}, {"title": "18” carving fork.", "text": "The product was wonderful, other than a few splits in the handle but it works great. Highly recommend this company and product.", "rating": 5}, {"title": "Excellent", "text": "Great service , Michael was excellent", "rating": 5}, {"title": "Good service.", "text": "Easy ordering, current status updates and quick delivery.", "rating": 5}, {"title": "Fast delivery", "text": "Fast delivery, much appreciated", "rating": 5}]