[
    {
        "title": "Briana was an amazing help with getting…",
        "text": "Briana was an amazing help with getting me approved and into a vehicle after only being in contact maybe a few days. All this after getting the run around everywhere else. I appreciated the customer care and experience all the way around. I suggest you get a car through them as well",
        "rating": 5
    },
    {
        "title": "I recently sold my car to Driveway",
        "text": "I recently sold my car to Driveway, and I couldn’t be happier with the experience. After comparing a few offers, theirs was the highest, so I decided to go with them. I was initially a bit nervous about selling a car online, but the whole process was seamless from start to finish. Bonnie and Illa very very responsive. Everything moved quickly and took only about 5-6 business days.Jake and Corey from the Dallas Hub came to pick up my car, and I was paid on the spot via Real Time Payment, which was super convenient. Overall, I would definitely recommend Driveway to anyone looking to sell their car.",
        "rating": 5
    },
    {
        "title": "So just like anyone else who is super…",
        "text": "So just like anyone else who is super skeptical about purchasing a vehicle online. I decided to give it a shot and nooooo regrets. The driveway team was super awesome and professional. They answered any questions and always kept me in the loop with everything. Everyone from Deyvon, Darren, Jacob,Enrique, Jake!  I would like to extend my appreciation for making this experience pleasant. The whole process took roughly a week. The car was delivered really close by me and I just went ahead and picked up the car myself. I did have a trade in and the process for that was super easy. I would highly recommend using Driveway for the online purchasing experience. Again, to the Driveway team, just want to say thank you! ",
        "rating": 5
    },
    {
        "title": "Everyone was very helpful explaining…",
        "text": "Everyone was very helpful explaining things. It was a great process and really quick. Anything I had trouble understanding was explained. I really enjoyed it..the customer service the convenience of the pick up. It made things so easy.  You folks have a great business and offer a well needed service. I didn't want to deal with selling it privately for all these obvious reasons. Thanks for taking care of all my car selling needs ! ",
        "rating": 5
    },
    {
        "title": "The process was quick and easy",
        "text": "The process was quick and easy. I bought a Used 2017 nissan maxima and it had 2 previous owners BUT only has 55,000 miles on it when I received it yesterday. I will absolutely finance another vehicle from driveway. Cheyenne was the absolute best and she made the whole process smoother and easier! Thank you to all the associates who work for driveway! To anybody reading this review, Driveway is absolutely recommended!!",
        "rating": 5
    },
    {
        "title": "Definitely will buy it again",
        "text": "I recently purchased a vehicle from Driveway, and I must say, the experience was exceptionally smooth and straightforward. The staff were not only incredibly helpful but also very friendly. Without a doubt, I would choose to purchase from them again in the future.",
        "rating": 5
    },
    {
        "title": "I absolutely hate dealing with car…",
        "text": "I absolutely hate dealing with car dealerships and the process of buying a new car. I have purchased my last 2 vehicles from Driveway and it has been the easiest and smoothest car buying experienc ever! 100000% recommend!!!",
        "rating": 5
    },
    {
        "title": "My Sales Rep Ryan Made my experience…",
        "text": "My Sales Rep Ryan Made my experience Magnificent !! I was a little worried the site was a scam and it was to good to be true but Ryan helped me better understand Drive way and also reassured me 100% driveway was legit Ryan had made my entire purchase process easily , understanding and overall a great experience! I’d deal with him any day buying w house car whatever it is ! Count me in ! Also would like to shout out to a sales manager by the name of Brandon when arrived the Hyundai Dealership Brandon did whatever it was he needed to do so that I would be on the road by the end of the night !! Way from Texas he successfully helped me as soon as I called into the after hours number ",
        "rating": 5
    },
    {
        "title": "Great experience",
        "text": "Great experience! Super fast process the car I bought was from a dealership located close by me so we went to pick up my new car within 2 days! Shipping would take approximately 7-14 days we were told.",
        "rating": 5
    },
    {
        "title": "Best online experience ever everything…",
        "text": "Best online experience ever everything was easy straightforward they stayed in contact all through the process. I would definitely recommend someone to use driveway. And on top of all that Got a great deal on my new car.",
        "rating": 5
    },
    {
        "title": "It was easy your able to view the vehicles right on line without feeling haggled and pressured to purchase",
        "text": "It was easy your able to view the vehicles on line without having to go several dealers and wasting alot of time traveling and viewing vehicles. All you have to do is put in the year,make, model, trim, miles etc and bam you got your pick of vehicles. This was my first experience with driveway and it will not be my last. I like to thank the driveway staff for making this transaction a sucess.",
        "rating": 5
    },
    {
        "title": "Easy process",
        "text": "Easy process.Got real rates within 2 minutes of entering my information. Alot better rate than local dealership with no pressure from a sales person. Easiest car buying experience I’ve had.",
        "rating": 5
    },
    {
        "title": "I tried to sell my car through Carvana",
        "text": "I tried to sell my car through Carvana, and after hours of setting everything up, I was told I was outside their pickup area and to take it to a location hundreds of miles away. Driveway gave me a better price and picked it up without issue. My god, this is central NH. Rural, yes, but the hinterlands, no.",
        "rating": 5
    },
    {
        "title": "higher offer from carvana",
        "text": "higher offer from carmax , carvana , promp process , car pickup at the house , fast payment , friendly reminder by text and email . ",
        "rating": 5
    },
    {
        "title": "Easy process",
        "text": "Easy process, gave me a fair price vs the \"other guys\" and I was paid as soon as my vehicle was loaded.",
        "rating": 5
    },
    {
        "title": "Easy process",
        "text": "All instructions were very clear. Whenever I contacted them, I got immediate help or a very quick callback. I was given a good price for my vehicle and payment was very prompt.",
        "rating": 5
    },
    {
        "title": "This was a easy process to sell my car",
        "text": "This was a easy process to sell my car.  Money was paid instantly.  I will definitely be using them again. ",
        "rating": 5
    },
    {
        "title": "Good price, convenient, would do it again",
        "text": "Would definitely use Driveway again and recommend their service.  I got a quick online quote and good price.  And the process was convenient.  My first time doing it so took me longer because I had to get a notarized lien release from my bank, and then was a bit concerned about signing away my title and mailing it to Driveway before payment, but they paid me real time into my bank account at the time of pick-up.  So worked out fine. ",
        "rating": 5
    },
    {
        "title": "Everything was simple and done online",
        "text": "Everything was simple and done online. Kayleen, one of the representatives, helped me and did such an amazing job. She was very professional and personable. I was very happy to have worked with her. She made it worthwhile.",
        "rating": 5
    },
    {
        "title": "Happy I tried it!",
        "text": "Despite my initial hesitation I decided to go with Driveway because their offer to buy my truck was quite a bit more than other online places. And I was pleasantly surprised by how easy and quick the process was once all was confirmed. Everyone was very nice and patient with all my questions since doing anything this big online can make one very nervous. I  would recommend anyone to at least reach out to Driveway for info. Happy I did!",
        "rating": 5
    },
    {
        "title": "Very Good Experience with Driveway…",
        "text": "Very Good Experience with Driveway selling my car. I uploaded the pictures and documents, got the Estimate. Once the estimate approved process started. Driveway sent the documents overnight for the signature. I had three days to sign and return the documents . Driveaway scheduled the pickup date once documents were received. Pickup truck came and picked the car. Every thing was hassle free.",
        "rating": 5
    },
    {
        "title": "Great Overall Experience ",
        "text": "This was a GREAT online car buying experience! Everything went fast and everyone was really helpful and knowledgeable!! I’ll do buy from Driveway again in the future!! ",
        "rating": 5
    },
    {
        "title": "Great experience with driveway",
        "text": "Great experience with driveway. From start to finish such an easy process. Would definitely use again. ",
        "rating": 5
    },
    {
        "title": "Great buying experience!",
        "text": "Driveway.com made my vehicle buying experience very comfortable with many helpful people that made the process easy and informative. Thank you!!!",
        "rating": 5
    },
    {
        "title": "Great customer service",
        "text": "He was a great Customer Service experience with Tyler and his team",
        "rating": 5
    },
    {
        "title": "Easy way to buy a vehicle ",
        "text": "The process was pretty easy, I found the vehicle I wanted put in a application and bought it outright, the only issue I had was that they sent me through three different sales representatives and one of them tried to throw me into a loan for a 2019 Toyota Tacoma but after I got to the third person I bought what I wanted. Overall it was a good experience, I would buy my next car from here again.",
        "rating": 5
    },
    {
        "title": "Easy peasy lemon squeezy",
        "text": "Easy peasy lemon squeezy. I’m sure it’s gonna be one of those cars I wish I never sold but the selling process was quick and simple. ",
        "rating": 5
    },
    {
        "title": "I'll admit I was skeptical at first",
        "text": "I'll admit I was skeptical at first. But everybody I was in contact with during the process made sure I knew exactly what was going on, and what all the next steps were. I got a great deal and I love the car even better in person. Carvana was charging 5 grand over what I paid for my car with Driveway. I've already recommended Driveway to a few of my coworkers.",
        "rating": 5
    },
    {
        "title": "I recently bought a really nice Silverado ",
        "text": "I recently bought a really nice Silverado through Driveway. Their customer service was excellent. Their dispatcher, Cheyenne, was excellent, providing me with shipping updates as the Silverado was shipped from Montana to New Mexico. Driveway is an excellent company to do business with.",
        "rating": 5
    },
    {
        "title": "Driveway did a great job in their communication ",
        "text": "Driveway did a great job in their communication with me. Never had an issue",
        "rating": 5
    },
    {
        "title": "It's one of the greatest experiences I…",
        "text": "It's one of the greatest experiences I have had. It was quick and convenient. i Had little bit doubt about this process cause it was my first time to sell my car via online. I didnt need to go any dealer. I submitted my car  photo and video via app and someone came to my house and checked the car and pick it up. I got the remaining balance right away and the bank was paid off in a week. thank you again",
        "rating": 5
    },
    {
        "title": "Overall a good experience",
        "text": "Overall a good experience. Taylor was exceptional at explaining the process and was fast, thorough, efficient, and courteous. Price was lower than I was hoping but you can’t beat the convenience. Including them coming out and picking it up! Taylor made it all work! ❤️",
        "rating": 5
    },
    {
        "title": "I am very thankful for Ms Briana Thomas",
        "text": "I am very thankful for Ms. BRIANA THOMAS she was just great with everything I needed process etc. Definitely will see her if I decide to get another vehicle Bless your heart Ms Thomas",
        "rating": 5
    },
    {
        "title": "Awesome experience!!!!! 🤩",
        "text": "Awesome experience the whole way through, kept me up to date on all the paperwork, easy process from the initial online requirements to the ending of the car being picked up. Brian from PA took the car and made it such an easy transaction. Everything was smooth and easy. I definitely would recommend Driveway if looking to sell car. 😌",
        "rating": 5
    },
    {
        "title": "Overall excellent experience selling my…",
        "text": "Overall excellent experience selling my vehicle to Driveway. Beautiful vehicle, fair price, ease of transaction, reliable, and straight forward from start to completion. Transport driver very courteous, careful, and thorough- conveniently picked up vehicle from home driveway. Would definitely recommend and transact with Driveway again!",
        "rating": 5
    },
    {
        "title": "Great job from start to finish",
        "text": "Great job from start to finish. I received a fair price. I recommend driveway",
        "rating": 5
    },
    {
        "title": "Reynechea was very helpful …",
        "text": "Reynechea was very helpful and got me squared away with my questions quickly, efficiently and courteously. ",
        "rating": 5
    },
    {
        "title": "Smoothly!!",
        "text": "Everything went very smoothly, communication was great ever step of the way, start to finish was great whole process took a week to complete. Would use again and would recommend it to anyone looking to sell a vehicle with out the pain of people calling and showing up in your driveway!!",
        "rating": 5
    },
    {
        "title": "pleasantly surprised ",
        "text": "Although I ended up canceling the transaction in the end, the entire process was very smooth. Every person I worked with was efficient and very friendly. I worked with Tamie, and she was fantastic. When the time is right I will definitely consider using Driveway in the future. ",
        "rating": 5
    },
    {
        "title": "The entire process was flawless from…",
        "text": "The entire process was flawless from start to finish. Such a great company and employees",
        "rating": 5
    },
    {
        "title": "Very professional",
        "text": "Very professional, cooperative and friendly  way of handling the issue. I specifically appreciate the service of Samantha, Nina and Jason. ",
        "rating": 5
    },
    {
        "title": "Process was very easy in simple",
        "text": "Process was very easy in simple. Employee’s Mark, Samantha, and Taylor were very polite and helpful guiding me through this process. Never would have thought it would have been this easy selling a vehicle. Highly recommend Driveway. ",
        "rating": 5
    },
    {
        "title": "Just sold our 2019 Hyundai Santa Fe to…",
        "text": "Just sold our 2019 Hyundai Santa Fe to Driveway and the process was amazing! Initial valuation was a little lower than others, but David and Tyler worked with me to get everything uploaded and put in. Easy guided photo system is great. Good communication and follow up throughout the process. Their team came and picked up the car no added fees! Would absolutely check them the next time we have a car to sell/trade. ",
        "rating": 5
    },
    {
        "title": "Positive Experience ",
        "text": "The communication is easy. Fast process. Website is built well for finding what you want. Nice people to work with. ",
        "rating": 5
    },
    {
        "title": "We are an older couple who use…",
        "text": "We are an older couple who use technology but are somewhat intimidated with some of it.  The customer service was patient and professional in explaining everything and helpful when we felt lacking.  Thank you to everyone in making the sale of our car painless and efficient.  ",
        "rating": 5
    },
    {
        "title": "Customer service was much better than expected",
        "text": "Customer service and availability was first rate.  It wasnt fast money like stopping in for a trade in but they offered much more than other on line car buyers. The entire process was painless and took about 2 weeks to complete. Money hit my bank account 45 seconds after I sent photo proof of car being loaded! ",
        "rating": 5
    },
    {
        "title": "Smooth from start to finish",
        "text": "I was very nervous to sell my car online. You just can’t be too careful anymore. The whole process was smooth, I received a very fair offer. I could reach a person when I had questions. They paid out quickly and the pickup of my old car was timely. ",
        "rating": 5
    },
    {
        "title": "Valerie",
        "text": "Valerie, respectful honest and understanding and very patient. I actually enjoyed the whole process. Thank you to her. I don't know anybody else's experience but that was mine.",
        "rating": 5
    },
    {
        "title": "Outstanding service",
        "text": "I have never purchased a vehicle online.  I had a lot of questions and everyone was very helpful, and went above and beyond to ensure that this purchase was outstanding.  Even when there were a couple of wrenches thrown in, the staff still went the extra mile and helped out.  The vehicle is above expectations and I will enjoy it for years to come.  Thank you for your phenomenal service.  I would recommend Driveway to anyone looking to purchase a vehicle.     ",
        "rating": 5
    },
    {
        "title": "Every customer service professional was…",
        "text": "Every customer service professional was always extremely polite, very respectful, and truly helpful during this entire process.The sale of my Tacoma was efficiently handled by your company,Thank you for the excellent experience to sell you the pickup.",
        "rating": 5
    },
    {
        "title": "The EASIEST experience I’ve ever had",
        "text": "The EASIEST experience I’ve ever had! Sent the information over, they stood by their original offer, came and got the truck, and it was all over! Communication was super clear and informative, my questions were answered before I even got a chance to ask them, and everyone was super nice. ",
        "rating": 5
    },
    {
        "title": "I saw THE car I wanted in less than 5 minutes ",
        "text": "I saw THE car I wanted in less than 5 mins, we were approved in less than 5 mins….the rest is done over a few days which is great. Any questions we had were answered. Everyone was nice and pleasant. We will 100% share our experience, recommend others to buy from you as well as buy from you again.",
        "rating": 5
    },
    {
        "title": "I purchased a vehicle from…Driveway.com",
        "text": "I purchased a vehicle from Driveway.com. This was the first time I’ve ever shopped online for a vehicle. This experience was great & way easier than expected. The sales person Miracle kept in contact with me the entire time & offered me several vehicles to choose from. I finally made a decision on the vehicle I wanted & Miracle walked me through the process. The price was right & the payment were great. After getting everything that was required & signed, it took approximately 5-6 days for the vehicle to be delivered due to where it was located. The vehicle was exactly as it was in the photos & drives excellent. If you’re looking to purchase a vehicle, shop Driveway.com",
        "rating": 5
    },
    {
        "title": "I didn't really care who bought my car",
        "text": "I didn't really care who bought my car to be honest.  I bought my Jeep Wrangler when I retired and intended to keep it forever.  Sometimes in life circumstances change and I decided to move to France, necessitating the sale of my vehicle.  Driveway offered me the highest price of any of the \"usual\" online car buying services.  I submitted photos and they confirmed their offer via their online tool which was easy to use.  We shipped documents back and forth ang they picked up the car from my driveway in a week.  No haggling.  Nio hassle.  The money was in my bank account within a day or two.  ",
        "rating": 5
    },
    {
        "title": "Highly Recommend",
        "text": "I was very hesitant at first because I've never heard of the company. When 1st communicating with a representative, it felt like a scam due to the conversation, but after doing research, I decided to trust my gut. Driveway had individuals who like Dominique, Mark, and Tyler who were extremely helpful with my process. They made the process super easy. Pick up was easy and quick as well. I would use Driveway again if I ever want to sell my vehicle. ",
        "rating": 5
    },
    {
        "title": "Best Online Car Shopping Experience!",
        "text": "I recently had the pleasure of using Driveway for my car shopping experience, and it exceeded all my expectations. From start to finish, the process was seamless and stress-free. One of the most significant advantages was the convenience of shopping online, allowing me to browse a wide selection of vehicles from the comfort of my own home. The website was user-friendly, with detailed descriptions and high-quality photos of each car, enabling me to make informed decisions effortlessly.The customer service at Driveway was outstanding. The team was incredibly responsive and attentive, answering all of my questions promptly and providing valuable insights into the vehicles I was interested in. Their professionalism and knowledge gave me confidence in my purchase, knowing I was supported every step of the way.Driveway also offered a transparent pricing model, with no hidden fees or surprises, which made the financial aspect straightforward and manageable. The option for home delivery was a fantastic feature, eliminating the need to visit a dealership and saving me a great deal of time.Overall, Driveway transformed what is typically a daunting task into a pleasant and efficient experience. I would highly recommend Driveway to anyone in the market for a vehicle, as they truly prioritize customer satisfaction and convenience.",
        "rating": 5
    },
    {
        "title": "I recently sold my car through this…",
        "text": "I recently sold my car through this company, and I couldn’t be happier with the experience. The entire process was smooth, efficient, and stress-free. From the initial inquiry to the final sale, everything was handled professionally. My payment was processed quickly and arrived in my bank account without any delays. I highly recommend this company for anyone looking to sell their vehicle easily and with confidence",
        "rating": 5
    },
    {
        "title": "Amazing experience ",
        "text": "The communication was amazing from the start, everyone did their best to make me feel comfortable buying a car I have never seen. I love how honest and upfront they were with me and how smooth the whole process went.",
        "rating": 5
    },
    {
        "title": "Gave me best price",
        "text": "Gave me best price, better than Carvana or Car Max. Easy to do business with as process was quick and loved instant transfer of funds directly into my checking account.",
        "rating": 5
    },
    {
        "title": "Great experience with Drive way ",
        "text": "It was my 1st time buying a truck online, Driveway had the truck I wanted and their online reviews in my truck groups were good. Paper work and delivery took a week and half, 2023 Tundra Pro arrived in great condition. They came back a week later for my truck and everything is complete. ",
        "rating": 5
    },
    {
        "title": "Fast and Easy",
        "text": "I did not have time to shop at the dealership and I do not like haggling. Once I found my car online, contacted Driveway, I was done with the entire transaction within 2-3 hours (via online messages back and forth).  I could complete other tasks with purchasing my vehicle.  Cindy walked me through the process effortlessly. ",
        "rating": 5
    },
    {
        "title": "Vehicle Lease Sold",
        "text": "Just when I thought my sone would not be able to avoid having a repossession on his credit report, DriveWay stepped in to save the day. The process was fast. The  employee available to handle the processing of this purchase was very efficient.  The short of the story…My son still has great credit, Thank you DriveWay. ",
        "rating": 5
    },
    {
        "title": "I received a great offer for my vehicle…",
        "text": "I received a great offer for my vehicle and communication was great, they help you every step of the way.",
        "rating": 5
    },
    {
        "title": "Great experience from start to finish",
        "text": "Every step was easy from the initial call to pick up the service staff was friendly and helpful. Armani and Rafael who picked up our van were early for the appointment and very professional. They waited until the fund transfer came through before leaving.",
        "rating": 5
    },
    {
        "title": "I was initially going to sell my car…",
        "text": "I was initially going to sell my car through CarMax but Driveway has a better offer and more convenient where they would come and pick up your car instead of driving it to a dealer and finding a ride home. Would definitely recommend everyone too sell to Driveway ",
        "rating": 5
    },
    {
        "title": "Very responsive staff and platform is…",
        "text": "Very responsive staff and platform is very user-friendly",
        "rating": 5
    },
    {
        "title": "Carvana Should Watch Out",
        "text": "Damaris helped me get my Honda and it was an easy quick experience. She stayed in touch with me throughout the whole process and made the experience feel like I was being guided. Even with some issues with the ID validation, she kept me up to speed on what I needed to do.If everyone at Driveway is like Damaris, then carvana should watch out as they’ll be out of business with this competitor.",
        "rating": 5
    },
    {
        "title": "Selling my car to driveway was the…",
        "text": "Selling my car to driveway was the easiest thing ever! They kept me in the loop during the entire process and everything was explained to me. And getting a hold of an individual over email or texts was very easy! ",
        "rating": 5
    },
    {
        "title": "everything went smoothly",
        "text": "everything went smoothly. car was picked up in a timely manner Dillon and coworker (sorry forgot his name) were both professional and communicative.thank you!",
        "rating": 5
    },
    {
        "title": "Customer Care Team",
        "text": "I was very nervous about selling my vehicle because everything is done through email, chat, and phone.I was assured by the customer care team that everything would go smoothly.....To my surprise it did!!!Communication was great, every text, email, and phone call I sent was responded to in a prompt courtesy time frame.I am very pleased with the team that assisted me.Thank you.",
        "rating": 5
    },
    {
        "title": "I just sold out my Volkswagen Passat…",
        "text": "I just sold out my Volkswagen Passat (2014/white) via driveway. Tyler, helped me all of process as well. He does excellent customer service( quick response, polite,knowledgeable) If someone wants to sell a car, I strongly recommend the drive way. Ask Mr. Tyler ! I got better   price than car max( sterling , VA ) ",
        "rating": 5
    },
    {
        "title": "It was honestly one of the most easiest…",
        "text": "It was honestly one of the most easiest transactions from the beginning to the end. And I didn't even have to do it in a dealership. Enrique was awesome he was the one who made my delivery exactly how they say right into the driveway! Thanks to everyone at driveway who made this all possible.",
        "rating": 5
    },
    {
        "title": "Very pleased with my Driveway purchase",
        "text": "Very pleased with my Driveway purchase.  While the process was online, the people involved were always available for calls.  The team was responsive to changes along the process. The person at the pickup took responsibility to make certain my experience was positive.  I recommend Driveway and will use it again.",
        "rating": 5
    },
    {
        "title": "Great company!",
        "text": "Everything was simple and easy! Representatives stayed in touch with me every step of the way! This was a fantastic car buying experience!",
        "rating": 5
    },
    {
        "title": "This company was great",
        "text": "This company was great, Like the other guy said Carvana should watch out because to be honest they bought my car for $300 more than what I owed on it, they have speedy service they overnight paperwork. They do a great job, communicating back-and-forth even on the weekends. I will recommend them to anyone. ",
        "rating": 5
    },
    {
        "title": "Good experience with selling my car",
        "text": "Selling the car through Driveway was like a breeze. They gave the best price for my car and handled the process online effectively. The personal came for pick up Jake Kiley and Enrique Rico (from DFW hub) were very professional and completed the pick-up and payment process quickly. Overall its a great experience. Highly recommend Driveway to others! ",
        "rating": 5
    },
    {
        "title": "It was great communication and…",
        "text": "It was great communication and explanation about the process, and no delays. Great team work!Thank you!",
        "rating": 5
    },
    {
        "title": "Great communication!",
        "text": "Great communication, process was smooth and easy.  I had a good experience selling my car to Driveway.  I had multiple questions, all of which were answered promptly.  Driveway sent a driver to pick up my car at my house, so that made it much easier.  Would recommend selling your car to Driveway!",
        "rating": 5
    },
    {
        "title": "Service was great!",
        "text": "Service was great they walked me through the process. answered all my questions! I will be using them in the Future!",
        "rating": 5
    },
    {
        "title": "It was great",
        "text": "It was great! Best car buying experience EVER! ESPECIALLY with no HIGH PRESSURE salesperson to deal with",
        "rating": 5
    },
    {
        "title": "Very easy compared to the others",
        "text": "Very easy compared to the others. Did exactly what they said they would do.",
        "rating": 5
    },
    {
        "title": "Absolutely no complaints!",
        "text": "Driveway has been an amazing experience thus far. I have had the pleasure of working with many great people on my truck deal, Ryan, Marc, Angelica, Corey, Kasandra, Dane, and others! I had read through the reviews and proceeded anyways. My experience is definitely my own and I can say that I would absolutely be buying again. Thank you everyone at driveway for making my first online vehicle purchase an awesome one!",
        "rating": 5
    },
    {
        "title": "This is our first experience with…",
        "text": "This is our first experience with buying a car on line and when we found the car we wanted it was through Driveway.All aspects were handled timely and as described. We are very pleased with our new car. When we had questions they were answered promptly and courteously.The only hangup has been with the NH license plates, but the temporary plates were sent on time. The DMV usually helps us to develop patience. Thanks for a positive experience. David Malone ",
        "rating": 5
    },
    {
        "title": "Tyler helped me with picking up and…",
        "text": "Tyler helped me with picking up and selling my vehicle to driveway. Made the process very easy. He was friendly and knowledgeable and made sure any questions I had were answered. Highly recommend and looking forward to doing business in the future.",
        "rating": 5
    },
    {
        "title": "How easy the paperwork and receiving…",
        "text": "How easy the paperwork and receiving the vehicle was.",
        "rating": 5
    },
    {
        "title": "I am very satisfied with my…",
        "text": "I am very satisfied with my interactions with Sarah, she was very supportive, patience with me, treated me with respect and consideration. Great professional customer service and she makes sure that the customer is satisfied. I can not ask for very service. God bless her and gives her long life for her keeps doing her job. I don't give her 10 stars because they are only 5, but she deserves more than that. Thanks 👍👍 Sarah ",
        "rating": 5
    },
    {
        "title": "PARA COMPRAR TU CARRO NUEVO O USADO DRIVEWAY.COM",
        "text": "Great Place to Buy cars online. Best Place to sell your car also. Very Friendly people and also they speak your Language, Español. Gracias por tan buen servicio. 100% Recomendado para vender o comprar tu carro.",
        "rating": 5
    },
    {
        "title": "Thank you very much for your prompt and…",
        "text": "Thank you very much for your prompt and attentive service",
        "rating": 5
    },
    {
        "title": "Above And Beyond Service",
        "text": "Hello everyone! To start, the team who served me in the DFW (TX) was wonderful. I was a first-time buyer, and they did all they could to get me a car; the Grapevine Honda dealership even got me an Uber to get me in my car before the first of October. My biggest help was Mr. Nathan, his manager, and his sales representative. The process of buying the car was quick, simple, and structured. The whole process, overall, took two days (since I picked it up). The Driveway Team and the Grapevine Honda dealership were efficient and helpful with their approach. I would recommend them to anyone who is interested in purchasing or selling a vehicle!",
        "rating": 5
    },
    {
        "title": "Driveway made the process of selling my…",
        "text": "Driveway made the process of selling my car truly painless. I looked around at several sites and most companies low balled the value of my car, driveway paid out really close to what I was expecting. The whole process was super easy, submitted pictures online, uploaded all my documents, signed the paperwork and returned in the deiveway provided envelope, and then a friendly drive way valet collected my car from my property. Thanks to everyone at driveway for making it so easy Raven, Brandon, Tyler and Brian ",
        "rating": 5
    },
    {
        "title": "right from the very first phone call",
        "text": "right from the very first phone call, everyone was courteous, respectful, knowledgeable, very helpful. All my questions were answered. Everything happened in the timely matter and as they said, it would start to finish smooth transaction I couldn’t be happier.",
        "rating": 5
    },
    {
        "title": "First car buying experience ",
        "text": "This is my first car and I did soo much research on what model make year mileage I could get for a certain price across multiple websites. But driveway had such an easy search option and huge array of vehicles. I found one at a reasonable price and it was shipped right to me. The process obviously takes longer than a day at a dealership for me it was roughly 10days. But I was in no hurry anywho so it didn’t bother me. The reps were very approachable and accessible. I highly recommend ",
        "rating": 5
    },
    {
        "title": "From start to finish the process was…",
        "text": "From start to finish the process was excellent. The pricing including shipping was very competitive.The car showed up much sooner than I thought it would. I will use them again.",
        "rating": 5
    },
    {
        "title": "Good clear communication throughout",
        "text": "Good clear communication throughout. No last minute surprises or changes. Fair price and better than some other similar services",
        "rating": 5
    },
    {
        "title": "The company exceeded my expectations",
        "text": "The company exceeded my expectations. From the time I entered my car information on the driveway’s website to the time the car left my driveway, every step of the process of selling my car was accompanied by helpful on time communications thru texts and emails. I only called the company once to make sure they received my paperwork and asked for pickup eta.  The money was in my account the moment the car was ready for pickup. Not to mention that Driveway offered me 2k more than the local dealer at the time of trade in.This company was great, and all the people were super friendly. I will recommend driveway to all my friends, can’t think of the reason to sell the car on your own. Thank you Driveway!",
        "rating": 5
    },
    {
        "title": "Great Experience",
        "text": "Great Experience! This company is willing to work with small business owners virus the dealerships & Carvana. Had amazing customer service every step of the way! Very much appreciated Luke (Manger) & Mireya(contract analyst) help and customer service! Will recommend to anyone! Can’t wait to receive my new car! ",
        "rating": 5
    },
    {
        "title": "Had a great experience with Driveway",
        "text": "Had a great experience with Driveway, transaction went thru smoothly. Received paperwork within days as promised. After my vehicle was picked up and I submitted a photo my payment came over within 5 mins .. thanks for the great service … ",
        "rating": 5
    },
    {
        "title": "The staff was very friendly",
        "text": "The staff was very friendly. They responded to every concern I had through out the whole precess. They also let me know when and what steps were being taken. I could not have asked for a more easier process, and would HIGHLY recommend Driveway for all our car wants!!",
        "rating": 5
    },
    {
        "title": "Legit company and great service",
        "text": "Was skeptical as to whether or not it was legit, but I got my money and my car is paid off! Woohoo! Great customer service, will definitely use in the future if the need arises.",
        "rating": 5
    },
    {
        "title": "Good experience",
        "text": "Well organized. Good communication throughout. Vehicle was exactly as portrayed.",
        "rating": 5
    },
    {
        "title": "Driveway was amazing",
        "text": "Driveway was amazing! They picked up my within the hour, and I got paid within 10 minutes. Just a great experience! ",
        "rating": 5
    },
    {
        "title": "from the start the driveway staff went…",
        "text": "from the start the driveway staff went above and beyond to make everything a first rate experience.from the day I first choose my truck till the day my truck arrived they were there step by step.very freindly and helpful.always willing to help any way they could.I would highly recomend diveway to anyone looking to buy online.They were there from start to finish.",
        "rating": 5
    },
    {
        "title": "Sold a car through driveway",
        "text": "Sold a car through driveway. The process was very easy. They moved a faster than I expected. My car was picked up 3 days after sending the paperwork back.",
        "rating": 5
    },
    {
        "title": "Selling car online to Driveway for the first time",
        "text": "Thank you Kayleen, Jada and all team members at Driveway for helping me sold my first car online. At first, I was skeptical and thought it would be complicated to sell the car online. However, it was easy as 1 2 3 through Driveway. The transaction was smooth and straight forward. I would definitely recommend my family and friends to Driveway.This is how it works, Driveway send out both the online electronic Docusign through email and physical paperwork overnight to you with instruction where to sign it. You sign both the electronic and physical paperwork and postmark the physical paperwork within 3 days in the provided UPS envelop.  Once Driveway receive and process the paperwork, the car would be scheduled for pickup depending on where you live. Driveway then send a U.S bank link over email for you to fill in your banking information. Keep in mind, when the car is picked up onto the transport trailer, just snap a photo and send it to Driveway dispatch team. Call dispatch team for confirmation and the fund would be release to your banking account. That's it.",
        "rating": 5
    },
    {
        "title": "I made my first purchase with driveway",
        "text": "I made my first purchase with driveway, and it began with preston who was my online salesperson. He was outstanding and was very helpful and informative and really on the ball for answering all my questions before I even decided to make the purchase. He really went out of his way to contact the dealer and have them send me extra pictures.After deciding to make my purchase, I was passed along to dane, who was my go to guy for the delivery after delivery process. Dane was truly outstanding and answered a million questions on my part. There was a few issues with the car upon receipt that I was not aware of. Dane took it upon himself to reach out and get these small issues resolved and really went to bat for me and made me feel really great about the choice I made which made me happy with my purchase even though I had a seven day return window. If I'm being honest if it wasn't for these 2 gentlemen and their outstanding customer service, this would have been a  not so great experience. With that said every thing turned out great and I highly recommend the Driveway experience. I will definitely be back again if I have any future car needs.Also  a shout out to all the young ladies in the title and shipping department that helped along the way. They all had great communication skills.",
        "rating": 5
    },
    {
        "title": "Driveway had clear communicatio from…",
        "text": "Driveway had clear communication from start to finish. No surprises kept to the timeline. Everyone I spoke to was pleasant and helpful. Just got my car picked up and will use this company again in the future.",
        "rating": 5
    },
    {
        "title": "ENTIRE DRIVEWAY STAFF",
        "text": "I personally want to thank, SUNRISE AT COLLIERVILLE, and their team, Leisha, Amanda,Jake, Cheyenne , my delivery driver and Raine also anyone who made it possible for my dream to own a brand new car, a memorable and pleasant experience! I highly recommend them to anyone and everyone, from beginning to end my experience was great! Thank all of  you from the bottom of my heart ❤️ 😊 MY Car was delivered today and it looks way better than pics! Great customer service does STILL EXIST !!",
        "rating": 5
    },
    {
        "title": "Chose Driveway for an easy sale!",
        "text": "The reason I choose driveway to sell my car was they offer real time payments.  They were easy to work with and accommodated some unexpected situations.  Definitely recommend them if you are selling a vehicle.",
        "rating": 5
    },
    {
        "title": "Easy process with Driveway.com",
        "text": "Driveway.com made the sale of my vehicle such an easy process. The customer  service  was superb and they were available to help each time I reached out. The young man who came to pick up my vehicle was extremely nice and answered all my questions. ",
        "rating": 5
    },
    {
        "title": "You made the operation of selling my…",
        "text": "You made the operation of selling my car seamless!Thank you.Mike",
        "rating": 5
    },
    {
        "title": "Recently I got my CAR through Driveway…",
        "text": "Recently I got my CAR through Driveway and overall experience was nice as well as they take care everything without any follow ups starting from delivery to title.Thank you.",
        "rating": 5
    },
    {
        "title": "Great Customer Service",
        "text": "This was my first time buying a car online, and it was so easy! Everyone I talked to was extremely helpful, waking me through every step and explaining things very patiently. No criticism from me!",
        "rating": 5
    },
    {
        "title": "Patience is the key ",
        "text": "The rest experience.  Once I accepted that nothing happens overnight, I was fine and was able to appreciate the process and the people that I worked with.  Every individual that  I came in contact with were friendly, professional and helpful.  ",
        "rating": 5
    },
    {
        "title": "Had a great experience selling my car…",
        "text": "Had a great experience selling my car to Driveway and would definitely recommend for others to consider. Was initially nervous about the online approach but their communication and responses to questions was very good. You get handed off to different people on different teams, during each part of the process but the transition was seamless for me. For the final pickup, Jake & Enrique from the Dallas hub came out and were very professional in answering any final questions. Overall, great experience!",
        "rating": 5
    },
    {
        "title": "The experience with Driveway was…",
        "text": "The experience with Driveway was seamless and very straightforward.  For me it was better than selling to a local and worrying about every scratch or future mechanical problem to come back for resolution.  The drive who picked up the car was very polite and professional .",
        "rating": 5
    },
    {
        "title": "Seamless and Professional (Highly Recommend)",
        "text": "The process was seamless and professional.  I highly recommend.",
        "rating": 5
    },
    {
        "title": "Great experience buying my truck",
        "text": "Great experience buying my truck! Would recommend the service to anyone looking to sell without the headaches of dealing with the public. ",
        "rating": 5
    },
    {
        "title": "The whole process was terrific!",
        "text": "The whole process was terrific! Anytime you had questions, someone was always available to answer it, whatever it may have been. I’d use DRIVEWAY again!",
        "rating": 5
    },
    {
        "title": "They offered the best …",
        "text": "They offered the best out of every online dealer even the dealers and the process was very simple and quick to do. I enjoyed working with every person that texted me. Thank you so much. I Would recommend them and I would use them again.",
        "rating": 5
    },
    {
        "title": "They made a great offer",
        "text": "They made a great offer on my car, the selling process was quicker than the reviews online had warned about, and everything was straightforward and honest.",
        "rating": 5
    },
    {
        "title": "Great overall experience",
        "text": "Great overall experience,  would highly recommend.  Way better than carvana who try’s to low ball people. Driveway gives you a good price for your vehicle. ",
        "rating": 5
    },
    {
        "title": "Awesome customer service notified me of…awesome customer service and assistance",
        "text": "Awesome customer service notified me of every step of the way got a quick pick up and it's on its way thank you all so much for your assistance",
        "rating": 5
    },
    {
        "title": "This process was so easy!!!",
        "text": "This process was so easy!!!! The quote given was fair.  I am very happy I chose Driveway and will definitely refer them to others!",
        "rating": 5
    },
    {
        "title": "Kayleen is the best. ",
        "text": "Kayleen has gone above and beyond to be helpful and informative.  I appreciate the quick responses and will recommend Driveway.com to all my friends and family. THANK YOU KAYLEEN!!!",
        "rating": 5
    },
    {
        "title": "It was super easy! ",
        "text": "It was super easy! Just a great process. Everyone I interacted with was professional, courteous and friendly. I highly recommend Driveway when ready to sell your vehicle. ",
        "rating": 5
    },
    {
        "title": "Very efficient and honest",
        "text": "Very efficient and honest. From now on, I will use Driveway only for selling my future used cars. Highly recommend it.",
        "rating": 5
    },
    {
        "title": "Melissa and Bobby ",
        "text": "Melissa and Bobby Exceptional communication and I appreciated them explaining every step of the process in which they were apart of. They were professional and a pleasure to work with. ",
        "rating": 5
    },
    {
        "title": "Very Satisfied.",
        "text": "Everything was so Great! From start to finish. Never bought a car online. Associates were great. Havanna was superior!!!",
        "rating": 5
    },
    {
        "title": "Driveway gave us the best price for our…",
        "text": "Driveway gave us the best price for our used vehicle, and was consistent with outreach and updates. I especially appreciated working with Krystal, Brandon, and Tyler.",
        "rating": 5
    },
    {
        "title": "My experience with driveway is…Excellent.",
        "text": "My experience with driveway is flawless,Excellent. Whole Team is very helpful in professional manner. They earn my future business no doubt about that.",
        "rating": 5
    },
    {
        "title": "Great Staff",
        "text": "Every person we worked with on the Driveway team were helpful and made the entire process stress-free.  We wanted to sell our vehicle and they helped us with every step.  I will recommend them to my friends and family.  ",
        "rating": 5
    },
    {
        "title": "Very efficient process",
        "text": "Very efficient process. Extremely professional. Payment was made within minutes of final inspection.",
        "rating": 5
    },
    {
        "title": "Everything went smooth",
        "text": "Everything went smooth. Great communication through the whole process. Car arrived earlier than expected. ",
        "rating": 5
    },
    {
        "title": "Super smooth process",
        "text": "Super smooth process. My car arrived on time and in perfect condition ",
        "rating": 5
    },
    {
        "title": "Honestly this was the best way to buy a…",
        "text": "Honestly this was the best way to buy a car was through driveway. They did everything for me and reassured about the updates on the car and literally everything was taken care of. Thank you 10/10 service!!",
        "rating": 5
    },
    {
        "title": "Driveway made the process so painless",
        "text": "Driveway made the process so painless. I would do it again. I got the price I wanted. Money direct deposited in my bank. Easy peasy. Great group people who i delt with. ",
        "rating": 5
    },
    {
        "title": "The transaction was smooth and easy",
        "text": "The transaction was smooth and easy, straightforward and everyone was a great pleasure to deal with, I highly recommend buying or selling a car with driveway.com!",
        "rating": 5
    },
    {
        "title": "Easy to navigate",
        "text": "Easy to navigate. Was paid the price that was promised. Process took a bit longer than I expected but was informed step by step of Process and timelines.",
        "rating": 5
    },
    {
        "title": "You did everything you said you would",
        "text": "You did everything you said you would. Great customer service.Yes I would do it again and will if I ever decide to sell a vehicle again.",
        "rating": 5
    },
    {
        "title": "Thank u to the staff for such an easy…",
        "text": "Thank u to the staff for such an easy sale we appreciate your help and patience with us during all of this ",
        "rating": 5
    },
    {
        "title": "I was happy to find Driveway",
        "text": "I was happy to find Driveway and the buying process was pretty simple. I like the online car buying experience and good communication all the way through",
        "rating": 5
    },
    {
        "title": "My experience with driveway.com was…",
        "text": "My experience with driveway.com was extremely painless and easy. The company is very professional and quick to respond.",
        "rating": 5
    },
    {
        "title": "Excellent team, excellent communication",
        "text": "Friendly and diligent",
        "rating": 5
    },
    {
        "title": "The process was very fast and…",
        "text": "The process was very fast and communication was great. I suggest driveway over any online seller. No gimmicks and very transparent.",
        "rating": 5
    },
    {
        "title": "Smooth sale",
        "text": "Smooth sale. Gave me clear directions for paperwork. ",
        "rating": 5
    },
    {
        "title": "It was a great experience and the…",
        "text": "It was a great experience and the selling car process they made so easy and even price comparing with other competitors it’s very good . ",
        "rating": 5
    },
    {
        "title": "Everything",
        "text": "This experience was Everything so far from how i ordered until i got it delivered thanks DRIVEWAY ❤️",
        "rating": 5
    },
    {
        "title": "Great People, Great Service",
        "text": "Great service not having to go into a dealership to buy or sell my car. ",
        "rating": 5
    },
    {
        "title": "Driveway is the best!",
        "text": "It was a great pleasure working with Driveway! Everyone was so nice and helpful. It was stress free. ",
        "rating": 5
    },
    {
        "title": "The whole process was smooth and no…",
        "text": "The whole process was smooth and no regrets dealing with Driveway.",
        "rating": 5
    },
    {
        "title": "Drive time is awesome",
        "text": "Drive time is awesome! The best place to go for online car buying experience. So easy and flawless!!!!",
        "rating": 5
    },
    {
        "title": "Amazing and fast customer service ever…",
        "text": "Amazing and fast customer service ever step of the way!",
        "rating": 5
    },
    {
        "title": "Such a pleasant experience",
        "text": "Such a pleasant experience! Henry was very kind and courteous. He explained every step thoroughly. ",
        "rating": 5
    },
    {
        "title": "Great Experience ",
        "text": "The experience was absolutely wonderful!!! Thank you very much for making it easy!!",
        "rating": 5
    },
    {
        "title": "Good transaction ",
        "text": "Fairly reasonable offer Process was easy ",
        "rating": 5
    },
    {
        "title": "Easy to  use ,friendly ,great communication ",
        "text": "Very easy to use, detailed instructions, would recommend to others wanting to sell their car",
        "rating": 5
    },
    {
        "title": "Driveway is a good company to purchase…",
        "text": "Driveway is a good company to purchase a vehicle from. The people are very helpful with everything. ",
        "rating": 5
    },
    {
        "title": "This process was so easy and the people…",
        "text": "This process was so easy and the people that help me were so friendly and available for all my questions!!",
        "rating": 5
    },
    {
        "title": "I've sold two cars to Driveway.com and",
        "text": "I've sold two cars to Driveway.com and, despite a small hiccup on pickup on the second, it was a great experience. So easy, and I got a more than fair value for my cars.",
        "rating": 5
    },
    {
        "title": "The team was amazing",
        "text": "The team was amazing. From the start to the day the truck was picked up was an easy experience. Thank you and I would highly recommend drivewayThank you ",
        "rating": 5
    },
    {
        "title": "Good and quick service.",
        "text": "Good and quick service. ",
        "rating": 5
    },
    {
        "title": "Sold my car to driveway and it was an…",
        "text": "Sold my car to driveway and it was an easy process. ",
        "rating": 5
    },
    {
        "title": "Great company to work with…",
        "text": "Easy to deal with and very clear on all aspects of buying your vehicle ",
        "rating": 5
    },
    {
        "title": "Everybody was professional and answered…",
        "text": "Everybody was professional and answered questions guickly.  Happy with the service.",
        "rating": 5
    },
    {
        "title": "Great job everything went smoothly came…",
        "text": "Great job everything went smoothly came to pick it up and got settled fast ",
        "rating": 5
    },
    {
        "title": "Everyone was very friendly and helpful.",
        "text": "Everyone was very friendly and helpful.",
        "rating": 5
    },
    {
        "title": "Clear instructions on next steps and…",
        "text": "Clear instructions on next steps and easy process ",
        "rating": 5
    },
    {
        "title": "Easy process",
        "text": "Easy process. Good communication and customer service. ",
        "rating": 5
    },
    {
        "title": "Very straightforward and no surprises",
        "text": "Very straightforward and no surprises ",
        "rating": 5
    },
    {
        "title": "Easy peasy!",
        "text": "Easy peasy!Everyone was friendly and helpful.No negatives.",
        "rating": 5
    },
    {
        "title": "Great communication from start to…",
        "text": "Great communication from start to finish and in between ",
        "rating": 5
    },
    {
        "title": "Always helpful and kept me informed",
        "text": "Date of experience: October 11, 2024",
        "rating": 5
    },
    {
        "title": "Simple and easy!",
        "text": "Simple and easy! The agents were friendly and the communication was great. ",
        "rating": 5
    },
    {
        "title": "Great experience with staff",
        "text": "Communication was great throughout the process, a worker named Simon was super helpful and straightforward over text messaging and expertly guided me to the information that I needed. ",
        "rating": 5
    },
    {
        "title": "customer service was excellent and…",
        "text": "customer service was excellent and drivers were very polite and respectful ",
        "rating": 5
    },
    {
        "title": "Happy car buyer",
        "text": "Easy, expedient, helpful, and friendly.",
        "rating": 5
    },
    {
        "title": "Driveway.com had the car picked up in…",
        "text": "Driveway.com had the car picked up in just a few days ago a reasonable price. Thanks!",
        "rating": 5
    },
    {
        "title": "The process was super easy and there…",
        "text": "The process was super easy and there was great communication from everyone involved during the process. ",
        "rating": 5
    },
    {
        "title": "I was working with Justin,he was so…",
        "text": "I was working with Justin,he was so helpful and patient.everything was smooth ",
        "rating": 5
    },
    {
        "title": "Great costumer service agents",
        "text": "Great costumer service agents ",
        "rating": 5
    },
    {
        "title": "Excellent experience ",
        "text": "Awesome experience ",
        "rating": 5
    },
    {
        "title": "Thank you Damaris for the smooth…",
        "text": "Thank you Damaris for the smooth process, excellent service.",
        "rating": 5
    },
    {
        "title": "Everyone answered my questions and…",
        "text": "Everyone answered my questions and everything went quick and easy.",
        "rating": 5
    },
    {
        "title": "Great experience and nice staff that…",
        "text": "Great experience and nice staff that are attentive. ",
        "rating": 5
    },
    {
        "title": "From start to finish the communication…",
        "text": "From start to finish the communication was consistent best car sale experience for me ",
        "rating": 5
    },
    {
        "title": "Great offer, fast response",
        "text": "Great offer, excellent communication, easy transaction. Help was readily available when I had questions",
        "rating": 5
    },
    {
        "title": "I am happy doing business with yo",
        "text": "Date of experience: September 20, 2024",
        "rating": 5
    },
    {
        "title": "Easy transaction",
        "text": "Easy transaction ",
        "rating": 5
    },
    {
        "title": "Everthing was great and very easy",
        "text": "Everthing was great and very easy ",
        "rating": 5
    },
    {
        "title": "Driveway review ",
        "text": "Tyler was very helpful in selling my vehicle. ",
        "rating": 5
    },
    {
        "title": "Every step of the process was handled professionally and on time.",
        "text": "Every step of the process was ",
        "rating": 5
    },
    {
        "title": "Easy process friendly customer service.",
        "text": "Easy process friendly customer service. ",
        "rating": 5
    },
    {
        "title": "Quick and easy process",
        "text": "Quick and easy process, gave me a good price ",
        "rating": 5
    },
    {
        "title": "Customer service",
        "text": "Customer service, ease of purchase ",
        "rating": 5
    },
    {
        "title": "Great Experience",
        "text": "Everything.. from price to pickup.",
        "rating": 5
    },
    {
        "title": "Very easy to deal with",
        "text": "Date of experience: October 12, 2024",
        "rating": 5
    },
    {
        "title": "Very good job",
        "text": "Very good job  thank you ",
        "rating": 5
    },
    {
        "title": "Fast",
        "text": "Fast, honest, well communication. ",
        "rating": 5
    },
    {
        "title": "Nice and friendly",
        "text": "Nice and friendly ",
        "rating": 5
    },
    {
        "title": "Great experience doing business",
        "text": "Great experience doing business ",
        "rating": 5
    },
    {
        "title": "2019 Ford",
        "text": "You're people were awesome you guys did everything you told you would thank you ",
        "rating": 5
    },
    {
        "title": "Good communication",
        "text": "Good communication, instant payment.  Great job.",
        "rating": 5
    },
    {
        "title": "I don't think I'll go back to buying locally",
        "text": "I wasn't sure what to expect but the process was smooth and everyone was very helpful. I picked the car I wanted on their website, talked to a few people, got some emails, made a payment, signed some online papers, signed some more papers sent to me in the mail some of which had to be notorized, sent them back, made my final payment, and got the car 5 days later. It arrived in PERFECT condition and is the most beautiful car I have ever owned. Honestly, I much prefer buying a car this way and probably won't go back to buying locally. Their inventory is just too large to ignore, it's all in great condition, and the process is fast and easy. It takes a bit longer than buying locally but for me it's worth it. So yeah, 10/10 for Driveway. ",
        "rating": 5
    },
    {
        "title": "Amazing experience!",
        "text": "This was a super easy process, everyone was very nice and clear on everything and made the whole process very easy to understand and get done from beginning to end.",
        "rating": 5
    },
    {
        "title": "Just sold my car!",
        "text": "I had a really great experience with driveway! The customer service was top notch. Diana walked me through every step of the way and was consistently available via text , email or by phone to assist with any questions. Once all of the paperwork was completed they scheduled the pick up. An awesome gentleman named Noel Walkes reached out an hour before scheduled pick up time and was able to show up early. Noel conducted the final inspection and the RTP hit my bank account on the spot! He was very professional and had a great disposition. Beginning to end I had a great experience with Driveway and would absolutely recommend using them to sell your car!  ",
        "rating": 5
    },
    {
        "title": "This was the easiest car selling…",
        "text": "This was the easiest car selling experience to date. Simple guide for photographing the vehicle, fair value for the sale, easy communication with the service individuals via text and calls. No complaints!",
        "rating": 5
    },
    {
        "title": "Driveway.com went to distance to earn my business and dispel my doubts.",
        "text": "Driveway.com actually expects you to sign ownership of your vehicle over to them, THEN schedule and appointment to have your car picked up, After that, arrangements will be made for funds to be transferred, either immediately AFTER you have relinquished your vehicle or in some cases, 3-5 business days later. I'm ASTOUNDED that ANYONE would agree to such terms. At that point, if Driveway.com finds or INVENTS fault or changes their mind, they can pay whatever they'd like, and seller would have to resort to litigation to get redress? They aren't kidding when they say possession is 9/10s of the law. I told them to kick rocks, think you should too.UPDATE:After the initial review (above) I was contacted by their head of operations. He confirmed the policies, but assured me that he could verify that my bank participated in their Immediate Payment system, which in fact they did. Still wasn't thrilled about having to sign and ship documents prior to getting funds, but agreed to try.  But turns out it went like clock work. Dealer rep showed up on schedule to pick up the car, and when I asked about funds transfer, he said he had no idea since he wasn't with Driveway So I told him no go until I contact Driveway, which I did. The rep there spoke to the dealer's driver to confirm pickup, and IMMEDIATELY initiated payment. The funds hit my account before the vehicle left my driveway (no pun intended). Driveway went the extra mile to make the deal, and earned my trust. Can't speak to buying, but selling to them turned out to be easy and reliable, and they made BY FAR the most reasonable offer. I would recommend.",
        "rating": 5
    },
    {
        "title": "Great experience ",
        "text": "Great experience . honest and fair offer and smooth process from offer to the car being picked up and getting paid ",
        "rating": 5
    },
    {
        "title": "Great experience and the company lived…",
        "text": "Great experience and the company lived up to what they promised. In addition they made the highest offer for my vehicle. ",
        "rating": 5
    },
    {
        "title": "GreatCustomer service was awesome",
        "text": "Customer service was awesome. Very helpful and  very nice and patient with working with us. ",
        "rating": 5
    },
    {
        "title": "Driveway Has A Very Nice Customer Service ",
        "text": "Driveway has a nice customer service in every department. In person Kasandra in the post-delivery customer satisfaction dep, even though I forgot these guys' departments namely Ken, Jibril, and Ryan they are also cool and very good at their jobs.. Driveway is blessed to have these guys on their team.",
        "rating": 5
    },
    {
        "title": "The quote promised was the price I…",
        "text": "The quote promised was the price I received after showing my pictures.  signing over my title before pickup and being paid made me a little on edge but the process went easy and great.  ",
        "rating": 5
    },
    {
        "title": "Quick and simple process when they came…",
        "text": "Quick and simple process when they came to pick it up! Tyler was very helpful.",
        "rating": 5
    },
    {
        "title": "Smooth selling experience",
        "text": "Selling to Driveway was a very smooth and easy process. They were responsive and timely and guided me to through every step of the process. Paperwork was straightforward. Received the payment within an hour of pickup. No experience buying a vehicle from Driveway, so can't speak to that, but would definitely use them again in the future should I need to sell another vehicle. ",
        "rating": 5
    },
    {
        "title": "Easy lease buy out ",
        "text": "Easy communication throughout the whole process of selling my car. They did a lease buyout. Very smooth and everything was completed quickly. ",
        "rating": 5
    },
    {
        "title": "Cheyenne at driveway is dope",
        "text": "Date of experience: September 17, 2024",
        "rating": 5
    },
    {
        "title": "Fast and easy.",
        "text": "Fast and easy.Great experience, zero complaints. Thanks.",
        "rating": 5
    },
    {
        "title": "The vehicle offer was really good.",
        "text": "The vehicle offer was really competitive. I a great offer for my Tesla model Y Performance. The paperwork process took a long time, almost two weeks. The people who picked up my vehicle were nice and very helpful. Overall it was a good experience, they just need to work on their paperwork process time.",
        "rating": 5
    },
    {
        "title": "Excellent ",
        "text": "Driveway always make sure their customer's is satisfied with what they purchased ",
        "rating": 5
    },
    {
        "title": "This was the best way to sell my car",
        "text": "This was the best way to sell my car!  They were great in all aspects of offer, paperwork and communication.   I highly recommend and already have! ",
        "rating": 5
    },
    {
        "title": "I had a great experience in selling my…",
        "text": "I had a great experience in selling my car to Driveway. They were very professional and helpful and always available to answer any questions I had throughout the process. I would highly recommend Driveway to anyone who’s looking to sell or trade their car. ",
        "rating": 5
    },
    {
        "title": "Easy process in car buying",
        "text": "Easy process in car buying. They stayed in contact throughout the process and helped with any questions.",
        "rating": 5
    },
    {
        "title": "Great Experience ",
        "text": "The entire process was made so convenient. I really appreciated how often I was updated with every detail of the delivery process. Tim and Dillion delivered my new vehicle today and were so patient to answer all of my questions and encouraged me to drive it around my neighborhood before they left. I will definitely recommend Driveway to anyone I know who is looking to purchase a new vehicle.",
        "rating": 5
    },
    {
        "title": "Great experience",
        "text": "Great experience, made it easy!",
        "rating": 5
    },
    {
        "title": "Kaila's Review",
        "text": "I sold a vehicle through Driveway. The entire process was really quick & easy. A member of Driveway customer care is always available to answer any questions & they always responded to my emails within 24 hours. Once the vehicle was picked up, the money was in my account the very next day. The 2 guys who came for the pickup were friendly & very nice to work with. I'm very happy with my decision to use Driveway to sell my vehicle & I would use them again.",
        "rating": 5
    },
    {
        "title": "The process of selling Driveway my car…",
        "text": "The process of selling Driveway my car was a positive one. The people I had a chance to speak with were always courteous and concise. The Driveway team that picked up my car aldo did a great job. Thank you! ",
        "rating": 5
    },
    {
        "title": "had an excellent experience selling my…",
        "text": "had an excellent experience selling my car with Driveway. From start to finish, the process was smooth and straightforward. Their communication was top-notch, keeping me informed every step of the way. The team was professional, efficient, and made the entire transaction hassle-free. I highly recommend Driveway to anyone looking to sell or buy their car. Five stars!”",
        "rating": 5
    },
    {
        "title": "I had a great experience",
        "text": "I had a great experience, The staff was top notch explaining things I didn't understand as a first time buyer! And the process was quick and easy everything was handled within a timely manner, I had my new vehicle within 2 weeks, and I just overall had a great experience! Will definitely use driveway for my next vehicle purchase! And I highly recommend everyone else do the same! ",
        "rating": 5
    },
    {
        "title": "Easy and fast",
        "text": "Date of experience: September 13, 2024",
        "rating": 5
    },
    {
        "title": "So I have to brag on them because I…",
        "text": "So I have to brag on them because I honestly didn’t think I was going to get a car I had a low credit score not even 600 and 2 open car loans  and they got me approved in secs now I have a 2023 bmv",
        "rating": 5
    },
    {
        "title": "Driveway",
        "text": "Driveway, what a great concept!   Lidia was terrific, responsive, and efficient!  She helped make my Ariya sale transaction smooth.  I like that Lidia's texts are very detailed-oriented providing all the info I need. Thank you for a job well done! 😊",
        "rating": 5
    },
    {
        "title": "Great selling experience",
        "text": "Everyone I dealt with was exceptional in the selling of my vehicle.  I had a unique situation and everyone from from Audrey to Tyler made it possible.   I would recommend Driveway for selling a vehicle.   ",
        "rating": 5
    },
    {
        "title": "I was hesitant at first dealing with an…",
        "text": "I was hesitant at first dealing with an online buyer. I Received a way better offer on my vehicle than other online buyers and dealerships were offering. Everyone involved communicated with me and answered all of my questions,except for one person on a weekend. Other than that my experience was just fine ",
        "rating": 5
    },
    {
        "title": "Excellent service",
        "text": "Excellent service! I was skeptical at first, but everyone was so kind and helpful. They gave me a good price also. I want to say big thank you to Tyler and Kiera. They really went above & beyond! I am so happy!",
        "rating": 5
    },
    {
        "title": "During transactions like these",
        "text": "During transactions like these, maintaining communications and constant updates is the key. Driveway accomplished that and made the experience very pleasant",
        "rating": 5
    },
    {
        "title": "Everyone I spoke with was helpful",
        "text": "Everyone I spoke with was helpful, knowledgeable and very responsive I could not be more happy with my experience!",
        "rating": 5
    },
    {
        "title": "Amazing service …",
        "text": "Very easy and friendly staff I highly recommended them amazing people from beginning to end ",
        "rating": 5
    },
    {
        "title": "Just ask for Patrik",
        "text": "I was truly having a bad morning, then called back to drive way and got the most amazing customer service rep (Patrik) he did not give me the runaround or ignore what the real issue was, he immediately jumped in and said not to worry and he did the dam thing, great customer service support I have ever encountered. Thank you Patrik,  he deserves a raise, he is the true call of someone that loves what they do. ",
        "rating": 5
    },
    {
        "title": "What a great experience",
        "text": "What a great experience.  They gave me a fair price and made the entire selling experience easy!  Tim, Rich and Ruben when the individuals who came out to pickup my truck.  Those three guys are super nice!  Payment was instant to my bank when they picked up the truck.  Highly recommend their service when selling your vehicle!",
        "rating": 5
    },
    {
        "title": "This is an update to a previous review",
        "text": "This is an update to a previous review. Ryan T. Was our go-to guy for the purchase. He is awesome! This was a first car purchase for our son who needs to follow step by step what is needed. Their process allows that. So much better than sitting in front of a finance person who shoves papers and a whole lot of double talk at you. Our issue was NOT with Driveway.com but with the dealership (of course). The dealership paperwork did not match the proposal we signed with Driveway.com and we didn't realize it until later in the day. Ryan went above and beyond his job responsibilities to work with contracts and the dealership to get this right. We did get a refund of the difference from the dealership. Patrik from Driveway reached out to us during this time based on our initial review and between him and Ryan they provided stellar customer service. Thank goodness because the dealership was not helpful nor responsive. I would definitely use Driveway.com again just to avoid dealing with a dealership ever again! Not much has changed with the dealership business model since I bought my first car 40 years ago! ",
        "rating": 5
    },
    {
        "title": "car buying made easy",
        "text": "car buying made easy ",
        "rating": 5
    },
    {
        "title": "Great communication",
        "text": "Great communication.  Every part went smooth even though I asked a million questions and had to work around my crazy schedule ",
        "rating": 5
    },
    {
        "title": "Got a good offer.",
        "text": "Date of experience: September 03, 2024",
        "rating": 5
    },
    {
        "title": "Scary internet",
        "text": "I have never done anything totally via the internet so it was a little scary but they reassured me and everything went well.",
        "rating": 5
    },
    {
        "title": "good overall - some minor issues but quickly resolved. ",
        "text": "Good overall. Communication during the delivery process was not perfect but the team was quick to apologize and answer any questions I had. The car was delivered in a reasonable time, it was just the communication leading up to it that was not great. After receiving the car my mechanic discovered an issue that ended up costing a bit more than I expected, but Driveway was quick to respond to it and reimburse me, and that process was awesome. Overall a great experience and I would buy from Driveway again. ",
        "rating": 5
    },
    {
        "title": "This is the Future of Vehicle Shopping...",
        "text": "Everything about my experience was 100% positive.  From the stress of not knowing how the process of purchasing a vehicle online to all the paperwork and the elements of the unknown, it was all eased with the team that helped me obtain my new vehicle.  I have never purchased a vehicle from a dealership without feeling like I overpaid or was misled to purchase unnecessary add ons.  The team even worked through their breaks to make sure they got me the best financing options possible and kept an open line of communication the entire way.  I will never buy a car from a dealership again, and I will recommend Driveway to everyone who mentions that they may be in the market for a new vehicle.  They saved me precious time and money and I couldn't have imagined it would be such a smooth experience.",
        "rating": 5
    },
    {
        "title": "They helped me the to get the…",
        "text": "They helped me the to get the assistance I needed. Thank you",
        "rating": 5
    },
    {
        "title": "Great team work",
        "text": "Great team work ",
        "rating": 5
    },
    {
        "title": "Great experience! Best price!",
        "text": "I checked all available online options for selling my car because I kept getting low-balled by dealerships for using it as a trade in. Driveway was the best and most fair deal for me. The process was smooth and the staff was always pleasant to deal with. I definitely recommend them especially if the price is right. I was also paid promptly. Would always consider them again in the future.",
        "rating": 5
    },
    {
        "title": "Transparency",
        "text": "Transparency, and straightforward process. ",
        "rating": 5
    },
    {
        "title": "Great experience happy with my 2022…",
        "text": "Great experience happy with my 2022 dodge Durango",
        "rating": 5
    },
    {
        "title": "Process was smooth",
        "text": "Offer was fair. Process is simple.  Everything is explained and happens as it is described.  Phone support is good.  ",
        "rating": 5
    },
    {
        "title": "It was a great smooth experience short…",
        "text": "It was a great smooth experience short wait no problems",
        "rating": 5
    },
    {
        "title": "It was easy and quick",
        "text": "It was easy and quick ",
        "rating": 5
    },
    {
        "title": "Easy fast done",
        "text": "Date of experience: August 31, 2024",
        "rating": 5
    },
    {
        "title": "2021 Nissan Altima Platinum ",
        "text": "Great communication and reliable information. Car was even better in person than I was expecting",
        "rating": 5
    },
    {
        "title": "Quick and clear process",
        "text": "Quick and clear process, best offer out of all locations I've tried in south Florida. Will recommend and use them again.",
        "rating": 5
    },
    {
        "title": "Efficient Transaction",
        "text": "Quick, efficient, helpful",
        "rating": 5
    },
    {
        "title": "Once you go with driveway you will never go back ",
        "text": "Leave me most for my vehicle ",
        "rating": 5
    },
    {
        "title": "Communicated a little too well and knew…",
        "text": "Communicated a little too well and knew the process every step of the way. ",
        "rating": 5
    },
    {
        "title": "Every one was very professional",
        "text": "Every one was very professional.  They explained everything in great detail.  I would recommend Driveway to others.  ",
        "rating": 5
    },
    {
        "title": "Best car buying experience ever",
        "text": "I usually don't write reviews, but I've been so impressed with Driveway that I wanted to share my experience. From beginning to end, they have been fantastic to work with. Each member of the team that I communicated with was responsive and professional. And I do mean team. From sales to administration to vehicle delivery, everyone was top notch. Even now, after the sale is done, Driveway has impressed me with their followup no matter how small my concern may be. Definitely a great company to work with and one of the best car buying experiences I've ever had.",
        "rating": 5
    },
    {
        "title": "Great experience!!!!!",
        "text": "Everything went smoothly and everyone was super helpful",
        "rating": 5
    },
    {
        "title": "I don’t typically take time for these…",
        "text": "I don’t typically take time for these kind of reviews, but I/O driveway a five star review. Their service was Johnny on the Spot and followed through on everything when they said they would. It is exceptional service done the old fashion way. When was the last time somebody answered their phone when you called. The team I worked w coordinated everything make my part effortless and on my phone or computer. The car was delivered spotless, like new and full of gas. I was skeptical about buying a car sight unseen. I wish my insurance company made my life as easy as this team did!",
        "rating": 5
    },
    {
        "title": "No vulture-istic sales people ",
        "text": "No vulture-istic sales people My ‘21 rave hybrid XSE is sitting in my driveway.. delivered on Sept 4th and I am very happy.I could tell that there was a definite pathway from first contact to delivery Customer service was terrific..The BIG hump is that all the great staff that are handling the purchase are nowhere near the car.. I asked if I could speak with the dealership get some more photos.. basically talk to me as the walk around the car… I was told this was not a normal practice but they will enter a request… I got a fast response… I got detailed pictures…I spoke with a person at the dealership Grant who addressed all my concerns So it was Grant who sold me my lovely Rave… yes i would recommend Driveway.  Thank you. Amanda Brian John Cheyenne!",
        "rating": 5
    },
    {
        "title": "Wonderful helpful and such a delight I…",
        "text": "Wonderful helpful and such a delight I would like to personally thank Christina for all her help ",
        "rating": 5
    },
    {
        "title": "Excellent experience",
        "text": "Excellent experience! Quick, fast delivery of my Tesla Model 3. Very friendly staff to communicate with throughout! Thank you.",
        "rating": 5
    },
    {
        "title": "I had a great experience with driveway…",
        "text": "I had a great experience with driveway employees, I was kept updated with all the process when I purchased my truck. The staff were knowledgeable and professional. They guided me every step of the way and answered all of my questions. Sarah helped me with all the information I needed to get a couple things fixed on the truck and processed the paperwork I submitted to her very quickly. She responded to me in a very timely manner all the time. Overall, it was a very good experience!",
        "rating": 5
    },
    {
        "title": "First time car buyer",
        "text": "First time car buyer! Driveway made the process as simple and quick as they could and even answered my ridiculous amount of questions to find me the right vehicle for the right price. Compared to a dealership they didn’t gate keep numbers and information from me just trying to get me to sign on . The customer service is impeccable and I owe much thanks to Alden and Brandon at driveway for making the process much easier to understand and explaining things essential to a first time buyer with no idea of what they’re doing lol. I would send anyone to driveway with the experience I’ve had and if I’m ever in the market again I’ll be sure to come back.",
        "rating": 5
    },
    {
        "title": "Process was very easy selling my car",
        "text": "Process was very easy selling my car.  Customer service was top notch.  The people that picked up my car and finalized  the transaction (Tim and Dillion) were friendly, knowledgeable, and dependable. They kept in touch with me the entire process and arrived right on time. If I could give them more than 5 stars I would.  ",
        "rating": 5
    },
    {
        "title": "Seasoned purchaser, but very apprehensive.",
        "text": "This is my first time ever buying a car online without going to a brick and mortar store to look at it. I was very apprehensive, but it was seemingly easy and very affordable. I was amazed at the vehicle I got. They sold me a vehicle that was well priced and was delivered to my driveway. I would definitely recommend this for anyone looking to purchase a used vehicle.",
        "rating": 5
    },
    {
        "title": "I had a great experience in purchasing…",
        "text": "I had a great experience in purchasing my car 2025 Honda crv with smooth transition. ",
        "rating": 5
    },
    {
        "title": " Chris, Angie, and Cherie ",
        "text": "Each of the representatives made sure that I received my purchase on time of the  delivery. The hole process Didn’t take long at all and each representative had patience with me concerning the process of delivery.",
        "rating": 5
    },
    {
        "title": "Great experience ",
        "text": "Was going on a family trip soon and explained and asked to hopefully pickup or receive the vehicle the day before our departure. They worked quickly and made the delivery in time and my family had a nice trip with the vehicle. No issues and they even helped get a charger for my tesla from the dealership. Quick and smooth transaction.",
        "rating": 5
    },
    {
        "title": "Super easy and they took care of…",
        "text": "Super easy and they took care of everything for me",
        "rating": 5
    },
    {
        "title": "Highest offer",
        "text": "Highest offer. Simple process. Great customer service.",
        "rating": 5
    },
    {
        "title": "Great ",
        "text": "Fast experience, definitely will recommend ",
        "rating": 5
    },
    {
        "title": "Great experience",
        "text": "Great experience. Process was simple, straightforward and went as communicated it would. Really neat photo upload as well. Highly recommend. ",
        "rating": 5
    },
    {
        "title": "Excellent and quick response",
        "text": "Excellent and quick response, they did what they promised, fair and clear transparent pricing.",
        "rating": 5
    },
    {
        "title": "No more annoying car salesmen",
        "text": "I spent over four months searching for the perfect vehicle. Not only did the local dealerships not have the exact one I wanted , but their ridiculous high mark ups, fees and packages sent me running. With Driveway, I didn’t have to deal with car salesmen and their constant follow up emails/calls. I didn’t have to put up with them trying to put me in a vehicle of their choice. The entire process was so seamless with Driveway. I will absolutely purchase from them again. ",
        "rating": 5
    },
    {
        "title": "Thanks for my X6",
        "text": "I enjoyed working with your team, everyone was well informed and very helpful. It’s by far the best car buying experience I’ve ever had ",
        "rating": 5
    },
    {
        "title": "First online car purchase",
        "text": "First the car selection and search options was outstanding. The process after selection was very efficient.",
        "rating": 5
    },
    {
        "title": "AWESOME COMPANY",
        "text": "This company is awesome! They were very helpful with me while I purchased my first car! And everything went very smoothly. 10/10!",
        "rating": 5
    },
    {
        "title": "Quick and friendly",
        "text": "Quick and friendly. The group of people that helped me made the car  buying process easy and efficient. I knew that buying a car online would not be an instant gratification process but they made it as quick as possible and had great communication. ",
        "rating": 5
    },
    {
        "title": "I bought 2 cars from driveway",
        "text": "I bought 2 cars from driveway. The first time it was a peace of cake. The second time they sent me the car early which is a plus but they sent the car with no tags. After calling three days in the row I finally was able to speak with Corey who was able to get me some temp tags from the dealership quicker than expected giving it was right before the holiday weekend ",
        "rating": 5
    },
    {
        "title": "Don't give up if it gets difficult.",
        "text": "The workers on the other end were patient with me and helped me to complete the transaction. ",
        "rating": 5
    },
    {
        "title": "Very easy process",
        "text": "Very easy process, will definitely buy a car this way again! ",
        "rating": 5
    },
    {
        "title": "Everyone I dealt with made it a smooth…",
        "text": "Everyone I dealt with made it a smooth transaction would definitely give my business to them again! Thank you, Ryan and Cheyenne for all your help with getting me my new jeep:)",
        "rating": 5
    },
    {
        "title": "Driveway was so A Smooth Process easy to use to help us…",
        "text": "Driveway was so easy to use to help us with purchasing a vehicle from out of state. Any questions we had during the process were quickly answered for us. We ended up getting the car of our choice delivered right to our home. We would definitely recommend Driveway to anyone. ",
        "rating": 5
    },
    {
        "title": "Super easy",
        "text": "Super easy! Agents were friendly and helpful. Never setting foot in a car dealership ever again. Good price and I extra love that they do the tag& title and spare me the trip to the DMV. Car showed up exactly as pictured and runs great. I’d definitely recommend Driveway to a friend. ",
        "rating": 5
    },
    {
        "title": "The very quick and easy I was like wow",
        "text": "The very quick and easy I was like wow ",
        "rating": 5
    },
    {
        "title": "Great experience selling our vehicle.",
        "text": "Driveway gave us a fair offer on our automobile (car dealers offers were laughable).  The process was straightforward - we had to snap a few pictures and provide some documents and basic info on the car.  Steps were laid out clearly via email or text.  We were provided a representative for updates and questions. The customer service line was responsive and answered the few questions I had.  The car was picked up within about a week of starting the process",
        "rating": 5
    },
    {
        "title": "It was quick and easy",
        "text": "It was quick and easy. Less than a week from start to finish. ",
        "rating": 5
    },
    {
        "title": "Repeat customer for selling my vehicle",
        "text": "Repeat customer for selling my vehicle.  It is low stress and super easy",
        "rating": 5
    },
    {
        "title": "PLEASE READ THIS REVIEW!! You will not be sorry!!!!",
        "text": "I don't know where to start. Would I recommend this, ABSOLUTELY! The whole process was easy and fun. Also, probably the most important thing is this company is credible!! They never let me down. I don't use the word \"never\" often. But if they said they were going to do it THEY DID! After my purchase, which was EXACTLY as the picture showed, I had a tire that was leaking. They replaced all of them. My contact, Sarah, was top notch. She helped me through the process. She made me feel as if I was Driveway's best customer. She kept me in the loop through the whole process!! GIVE SARAH A RAISE!!! She answered every question and she was very patient. I can be quite the pain in the a..you get the picture.From Broderick,Justin, Naomi and a few others that I'm sorry i can't recall right now and of course Sarah, I would recommend Driveway to everyone. I would even do a commercial testimonial ad for them if they wanted me to!!!This is no bull. I tried Carvana, True car and the others . Driveway I just trusted from the first call!!  From the start of the whole process. Ooooh and the best thing is you actually talk to people!!!! Leave a message someone calls back!!! Anyone who reads this doesn't really know how picky person I am. But the people who DO know me would not believe i wrote this. I could write so much more that was great about them. Thank you all again. Sarah, you are top notch!!! I wish you and Driveway all the best!!",
        "rating": 5
    },
    {
        "title": "Cheyenne was super friendly and was…",
        "text": "Cheyenne was super friendly and was also keeping me up with what was going on with the vehicle I recommended using driveway ",
        "rating": 5
    },
    {
        "title": "Excellent customer service ",
        "text": "Fabulous Customer service. Very quick and efficient process selling my car! Overall fantastic experience!!!",
        "rating": 5
    },
    {
        "title": "Every one was very helpful and polite",
        "text": "Every one was very helpful and polite.  Thank for a great experience ",
        "rating": 5
    },
    {
        "title": "Leisha was the greatest she worked hard…",
        "text": "Leisha was the greatest she worked hard for me and her and her team gave me the best deal I called and talk to her on Wednesday and by Friday I had my car !",
        "rating": 5
    },
    {
        "title": "Amazing company to work with!",
        "text": "The customer service is very responsive, kind and understanding! We've had an excellent experience selling our vehicle to driveway! Would do business with them again for sure!",
        "rating": 5
    },
    {
        "title": "Great service",
        "text": "Great service, always able to talk with a real person if any questions. Quick responses!",
        "rating": 5
    },
    {
        "title": "Fast",
        "text": "Excellent service ",
        "rating": 5
    },
    {
        "title": "Excellent",
        "text": "Excellent professional service",
        "rating": 5
    },
    {
        "title": "I am pretty happy with Driveway ",
        "text": "This was my first time selling my car online. I didn't know what to expect. A Driveway staff reached out with a phone call, while the competition never bother doing. Drive staff did a great job explaining the process and answering all of my questions. The process went smoothly. I am looking forward to doing business with them again. ",
        "rating": 5
    },
    {
        "title": "Excellent all around",
        "text": "Excellent all around ",
        "rating": 5
    },
    {
        "title": "Nice experience for first time online purchase ",
        "text": "Was looking for a used vehicle, happen to see it a nearby dealership. I’ve had no issues going to a dealership or negotiating in person. However, saw that it was also posted in driveway. I reached out to the team at driveway and they explained to me that they’re able to allocate the vehicle since their inventory comes from an actual dealership. Which sells new and used. Being that the vehicle is a used as is vehicle I decided to try it out, knowing I had the flexibility of returning the vehicle if  it wasn’t as expected. I picked up the vehicle once it was verified that it was still available, and made my deposit. Once at the dealership everything was a breeze. Did a pre purchase inspection and everything checked out.Pros- The team agents of driveway are quick to response back to your inquiry.-provide detail information of the vehicle.-Dealer allocated cars.Con-There might be a time zone difference depending what agent you reach out to.",
        "rating": 5
    },
    {
        "title": "They made everything go very smoothly…",
        "text": "They made everything go very smoothly and quick. And when I had a million concerns and questions they were always very quick to respond and clarify anything that I needed!",
        "rating": 5
    },
    {
        "title": "Easy to work with",
        "text": "Easy to work with, customer support was easy to get ahold of, and they answered all my questions in a timely manner. ",
        "rating": 5
    },
    {
        "title": "Driveway Fixed Every Issue!!!",
        "text": "Everything that could go wrong, has gone wrong. This has been the worst car buying experience ever. I was originally told I was approved for a vehicle with a certain downpayment. After sending the deposit I was told I couldn't get the vehicle promised originally. Selected a different car, received that car without any documentation. No temp tag no Bill of sale. I received it 3-4 days later.Received my car and the rear differential is trash and the gas tank door is stuck. Spoke with service department & was told it's under 60 day warranty.Took a week for approval to do repairs! My car has been at the dealership for 2 weeks now & still no update on when the parts will arrived! I’m here to express my appreciation for Driveway. Although, it started off rocky they definitely finished STRONG! Sarah is truly AMAZING! I know now, that Driveway wasn’t the problem. I just needed to speak with the right person! Driveway honored their 60 day warranty and even went above the warranty to assist me for my troubles. I’m truly grateful. I will definitely recommend using Driveway for your car needs! I would like to Thank Sarah & the General Manager AGAIN!!!!!! ",
        "rating": 5
    },
    {
        "title": "I sold my car to driveway",
        "text": "I sold my car to driveway. The process was smooth, everything was explained step by step. Tyler was especially helpful and even answered my questions after the process was completed. Five stars all the way ! ",
        "rating": 5
    },
    {
        "title": "Awesome Agent (Simon) - great experience!!",
        "text": "I had the best experience with driveway. The agent who help me was Simon and was very professional , he gave me all the details upfront which helped me not to mess up the best offer in the industry. Customer service is all you care about. I have dealt with few companies in the past to sell cars but driveway is the best by far. Highly recommended. ",
        "rating": 5
    },
    {
        "title": "Great selling experience ",
        "text": "Was looking to sell my car and shopping around offers. They beat all local offers and all other app offers by a Longshot. The process from first contact to getting paid was seamless. Everything made very easy by their exceptional employees who were in contact with me the whole way. I'd definitely do business with them again. ",
        "rating": 5
    },
    {
        "title": "They honored their warranty",
        "text": "They honored their warranty. They stayed in contact with me during the purchase process. Though, there were some hiccups. 2 cars that I saw and like were listed on their page yet they were already sold. They seem to not update their site as quickly as a product is sold. There was little contact during the warranty process. Overall, it was a good experience.",
        "rating": 5
    },
    {
        "title": "Very nice people , helpful & fast",
        "text": "They were very nice neat, professional made sure everything was in order in a timely manner ",
        "rating": 5
    },
    {
        "title": "Very easy and fast.",
        "text": "Very easy and fast. ",
        "rating": 5
    },
    {
        "title": "Super friendly helpfull staff",
        "text": "Super friendly helpfull staff ",
        "rating": 5
    },
    {
        "title": "Consistent correspondence and step was…",
        "text": "Consistent correspondence and step was smooth along the way.",
        "rating": 5
    },
    {
        "title": "Quick",
        "text": "Quick, accurate, convenient, great offer on the car ",
        "rating": 5
    },
    {
        "title": "For sure I recommend this company",
        "text": "For sure I recommend this company. When was selling my car I checked  every where all possible offers with famous services  and not famous and Driveway gave my the highest offer and it's not only highest proportion the difference between driveway and with the highest proportion  of all rest companies or services  was significantly big!.  I saw some kind of negative experience to make payment  through  their system ect  so  I did not have it and thinking  might be this company  still young and of course it's could happened on this stage. So  in general  I think  this company has big future.",
        "rating": 5
    },
    {
        "title": "Simple. The whole purchasing process was…",
        "text": "The whole purchasing process was simple. All staff was super professional and customer focused ",
        "rating": 5
    },
    {
        "title": "The experience was really great",
        "text": "The experience was really great.  Associates were really helpful and they were able to explain and express all of the needed information. I would recommend doing business with this company.",
        "rating": 5
    },
    {
        "title": "Great experience!",
        "text": "No hassle, no nonsense approach! I really enjoyed the process! Will do business again.",
        "rating": 5
    },
    {
        "title": "Driveway are the best ",
        "text": "Everything ",
        "rating": 5
    },
    {
        "title": "My experience was great I will continue…",
        "text": "My experience was great I will continue to shop wit DriveWay from now on . ",
        "rating": 5
    },
    {
        "title": "Start to finish the Car soldprocess went great.",
        "text": "Start to finish the process went great.",
        "rating": 5
    },
    {
        "title": "I heard about this website/program on…",
        "text": "I heard about this website/program on instagram as I was scrolling through my feed. I got curious and gave it a shot. In less than 24 hours a very efficient representative named Ndia reached out to me and started the process. I started the process on a Tuesday morning and had my jeep by Friday!!! I had a great experience overall! ",
        "rating": 5
    },
    {
        "title": "Positive experience All of the associates I interacted with…",
        "text": "All of the associates I interacted with were great. Good communication, good service. ",
        "rating": 5
    },
    {
        "title": "Great experience",
        "text": "Great experience! The offer was fair, the process was easy and the payment was instant. I will always use Driveway moving forward.",
        "rating": 5
    },
    {
        "title": "10/10 experience! (Selling)",
        "text": "The most pleasant experience I have had selling a car. I’m so glad I was told about Driveway. Everyone I interacted with was so kind and helpful and really patient with my many questions and inquiries. I was offered quite a bit more than Carvana was offering. Thanks so much! Will definitely use in the future if I am seeking to sell another car. ",
        "rating": 5
    },
    {
        "title": "Jada was Very nice to me",
        "text": "Date of experience: August 21, 2024",
        "rating": 5
    },
    {
        "title": "They were quick and informative and…",
        "text": "They were quick and informative and gave me more money for the car than other sites.",
        "rating": 5
    },
    {
        "title": "They made this very easy and very…",
        "text": "They made this very easy and very professional, and the car was delivered in excellent timing and overall great experience so far",
        "rating": 5
    },
    {
        "title": "Gave me the best price of all the…",
        "text": "Gave me the best price of all the online options. Car condition app is impressive. Process took about 2 weeks but inn the end everything went smoothly. ",
        "rating": 5
    },
    {
        "title": "Above my expectation ",
        "text": "Their team is very helpful. Every staff I contacted with is very polite and professional.  They are available the whole time for questions, either by phone, text or email. The deal was fair and went smoothly.  Above my expectation.",
        "rating": 5
    },
    {
        "title": "Selling a vehicle (the way it should be)",
        "text": "I was initially a bit hesitant, but selling my car to Driveway turned out to be a simple and straightforward process, exactly as I hoped. Not only was everything smooth, but they also offered me a few thousand dollars more than Carvana, CarMax, and others. Five stars from start to finish!",
        "rating": 5
    },
    {
        "title": "Great experience from start to finish",
        "text": "Everyone involved in the process was extremely helpful. Their estimate was better than all competitors. I’d highly recommend working with them.",
        "rating": 5
    },
    {
        "title": "Fast",
        "text": "Fast, efficient, courteous",
        "rating": 5
    },
    {
        "title": "The process was easy and everyone was…",
        "text": "The process was easy and everyone was very helpful and friendly.",
        "rating": 5
    },
    {
        "title": "The most important thing was…",
        "text": "The most important thing was communication with the customer. All of your representatives did a great job!Appreciate you!                              August 2024",
        "rating": 5
    },
    {
        "title": "Smooth and efficient",
        "text": "Date of experience: August 19, 2024",
        "rating": 5
    },
    {
        "title": "Good experience",
        "text": "It was a little slow process but overall there was transparency and timeliness. ",
        "rating": 5
    },
    {
        "title": "The service I experienced with…Great Experience ",
        "text": "The service I experienced with Driveway.com was an amazing experience. Thank you to all that played a part in assisting with the sale of my vehicle.",
        "rating": 5
    },
    {
        "title": "I was very very skeptical to buy online…",
        "text": "I was very very skeptical to buy online BUT we decided to an it was the best decision!! From start to finish easy breezy! They are helpful an make sure you understand everything. Diffentley will buy again! ",
        "rating": 5
    },
    {
        "title": "I had such an easy and great experience…",
        "text": "I had such an easy and great experience on my recent purch of my 2023 toyota highlander, thanks to Tamara Teskey! Not only did she guide me from the beginning,  but also checked on me constantly throughout the whole process, from my loan approval to paper work and shipping of my vehicle. I would definitely recommend drive way. Super easy, thanks again Tammy. ",
        "rating": 5
    },
    {
        "title": "This was so easy",
        "text": "This was so easy!  I picked out what I wanted.  A few texts, emails. A couple of calls and a little paper work later and I had my car in my driveway in a couple of weeks from the time I started looking. ",
        "rating": 5
    },
    {
        "title": "Great Customer Service",
        "text": "Great process, simple. The Rep at driveway.com was excellent. ",
        "rating": 5
    },
    {
        "title": "very polite efficient and helpful",
        "text": "Date of experience: August 15, 2024",
        "rating": 5
    },
    {
        "title": "Very professional and trustworthy",
        "text": "Very professional and trustworthy. Every thing went accordingly. Will buy my next car from drive way. ",
        "rating": 5
    },
    {
        "title": "Great communication",
        "text": "Great communication ",
        "rating": 5
    },
    {
        "title": "Easy experience",
        "text": "Easy experience, clear communication, best offer and prompt payment.  ",
        "rating": 5
    },
    {
        "title": "The best experience ever…",
        "text": "I can’t even begin to tell you how easy this car buying experience was. From the beginning to the end they walked me through the process! I will never use another dealership or service again. The best! ",
        "rating": 5
    },
    {
        "title": "Not a scam..,.",
        "text": "The whole process was very well orchestrated! Staff was courteous and informative. I would definitely use this company again.",
        "rating": 5
    },
    {
        "title": "Lydia is a champion",
        "text": "Lydia is a champion, she along with the whole driveway team made the car purchase easy.  Lydia helped especially with the difficulty of an out-of-state title change.  Great team!",
        "rating": 5
    },
    {
        "title": "Best offer",
        "text": "Best online offer, most of the communication was through email or text which at first made me a little uncomfortable. Was rest assured once I reached the end of the process and was able call and speak with IIka and Samantha about any questions and concerns I had. Would definitely choose driveway again",
        "rating": 5
    },
    {
        "title": "Called them",
        "text": "Called them, took a few pictures of the vehicle,some paperwork and all done. They also me the best offer out of four other groups I contacted. Tyler took care of everything.",
        "rating": 5
    },
    {
        "title": "Very quick and simple process",
        "text": "Very quick and simple process.  There seemed to always be someone available to answer any questions and confirm the next steps in the process.",
        "rating": 5
    },
    {
        "title": "Superb experience ",
        "text": "Sold my Porsche to driveway and the experience was top notch. Their offer was very good, this also eliminated the need to list on facebook and deal with all the endless number of non serious buyers that just waste your time. Communication was superb and the transaction was quick and easy. Will definitely sell/buy with them in the near future. Neil",
        "rating": 5
    },
    {
        "title": "I was a little nervous because I did…",
        "text": "I was a little nervous because I did not know the company and it is not as out there as the competitors, BUT I received the highest amount for my car. All of the staff I worked with were amazing and everything was easy. The money was transmitted quick and easy and the payoff to my lender. I would definitely use them again.",
        "rating": 5
    },
    {
        "title": "Selling from the East coast",
        "text": "My son sold his car through Driveway and I was skeptical since they weren’t one of the big names like Carmax or carvana. However, I was very pleased with the process and would definitely recommend Driveway when selling a car. Everything they did was very professional.",
        "rating": 5
    },
    {
        "title": "Selling a car made easy",
        "text": "Selling a car made easy. Taylor was awesome to work with. Fair offer and the process online, and overnight packages for signatures was seamless. Overnighted check, plus other options were available for ach and direct deposit. Good job Driveway. ",
        "rating": 5
    },
    {
        "title": "It was a very smooth process",
        "text": "It was a very smooth process. From picking out a car, to having to sign paperwork, to having it delivered. The team I dealt with was very helpful and always there for my questions. I am in love with my new car!",
        "rating": 5
    },
    {
        "title": "Sarah was amazing ",
        "text": "What started off as a bad experience was quickly turned around. Sarah went above and beyond to make sure that I was not inconvenienced in any way. Definitely not something she had to do but took it upon herself to do so. That being said I would definitely recommend Driveway to any potential car buyers. Thanks again Sarah! ",
        "rating": 5
    },
    {
        "title": "Hit the easy button. ",
        "text": "Very smooth process and easy to do, very pleased with the whole process. ",
        "rating": 5
    },
    {
        "title": "It was an easy process selling my…",
        "text": "It was an easy process selling my vehicle to driveway! There was never a point where they made me feel uneasy about the transaction. Pretty quickly and smooth transaction.",
        "rating": 5
    },
    {
        "title": "Monica is a Pro!",
        "text": "Despite the unpleasantness of the subject of my call, (fraud), Monica turned the whole experience around and I actually had a great time working with her.  She made me laugh!   Bonus.  Super great encounter.  Everything got worked out perfectly.   Total professional.",
        "rating": 5
    },
    {
        "title": "The service reps were very friendly and…",
        "text": "The service reps were very friendly and helpful. The contract and other paperwork process was easier and faster to complete than expected. I liked the line of communication throughout the order process up to the delivery of my new vehicle. I always knew what was going on with my order. Even the valet service guys that delivered my car were friendly and professional. All in all, a very positive experience, the best I've ever had buying a new car!",
        "rating": 5
    },
    {
        "title": "Legit and good communication ",
        "text": "Our biggest concerns, having never really heard of the company was 1. is it legit 2. Will we get paid. And yes, it is legit and we got paid immediately. Tight responsive communication as well.",
        "rating": 5
    },
    {
        "title": "I purchased a used Ford F-150 from…",
        "text": "I was contacted by Sarah at Driveway and she kindly and quickly helped me navigate to what I felt was a fair and amicable result.  In the end, I am a satisfied customer.I purchased a used Ford F-150 from Driveway.  before signing contract I got a carfax report that showed minor damage on passenger side rear qtr.  I got pictures and verified it was acceptable - I asked if there was any other damage and was told NO.  upon delivery of vehicle, there was a dent (through the paint) in passenger front door.  I immediately filed a report and was told to take vehicle to dealer to get estimate which came in at ($1300).   two weeks later Driveway offers me $200 and I say, no thanks I'll return vehicle - they say I missed deadline after dragging their feet for two weeks.  they refuse to fix damage, refuse to pay estimate from their own partner, and refuse to accept return - Shady business practice at best.",
        "rating": 5
    },
    {
        "title": "Easy to work with.",
        "text": "Date of experience: August 05, 2024",
        "rating": 5
    },
    {
        "title": "Top notch services ",
        "text": "I had a great experience with Driveway. The staff is amazing, very friendly and helpful especially Brianna and Yaka. Thank you Brianna for your expertise and Yaka for your superb services. Driveway is an excellent way to find and buy your next car.",
        "rating": 5
    },
    {
        "title": "Simple process",
        "text": "Simple process - awesome customer service.",
        "rating": 5
    },
    {
        "title": "It was very easy,I'm a senior and they…",
        "text": "It was very easy,I'm a senior and they helped me through the hol process on the phone and always returned my phone calls promptly.there was some damage to a Minor on the transport and I feel it will be taken care of.And most of all I really like my car. No regrets    ",
        "rating": 5
    },
    {
        "title": "Fast and efficient ",
        "text": "Helpful team, makes things easy ",
        "rating": 5
    },
    {
        "title": "The experience was very easy and…",
        "text": "The experience was very easy and everyone was very helpful and knowledgeable ",
        "rating": 5
    },
    {
        "title": "The communication 👏 🙌 ",
        "text": "The communication 👏 🙌 The pictures of the car was exact 💯 👌 The process and paperwork went smoothly. In the end meeting the truck driver in a safe place to pick up my car, because I live in a no outlet neighborhood and I knew there was no way he can come through in a 18 wheeler with other cars on it safely. So I agreed to meet him in a open area. Smooth transition from beginning to end. Thank you ",
        "rating": 5
    },
    {
        "title": "From beginning to end",
        "text": "From beginning to end ",
        "rating": 5
    },
    {
        "title": "The process was easy and fast",
        "text": "The process was easy and fast. Instructions and communication were very good. From start to finish, I was given an estimated timeline and it was met. ",
        "rating": 5
    },
    {
        "title": "Flawless experience",
        "text": "Flawless experience. I received an instant offer via the website, handed over the keys & received a payment in just under a week. Highly recommended. ",
        "rating": 5
    },
    {
        "title": "Everything they said they were going to…",
        "text": "Everything they said they were going to do they did very helpful. Made the whole process very easy. I sold my car to them from the minute I called to the day they picked it up everything went very well highly recommend.",
        "rating": 5
    },
    {
        "title": "Easy",
        "text": "Easy. Best offer. And couldn’t be happier. I will let everyone know to use driveway!",
        "rating": 5
    },
    {
        "title": "Price and fast processing.",
        "text": "The company gave me good prices for my car . Money was in my account as soon as they loaded the car.",
        "rating": 5
    },
    {
        "title": "Facts",
        "text": "Very thorough very quick great to do business with ",
        "rating": 5
    },
    {
        "title": "My first time using Driveway",
        "text": "I have never used an online company to sell my used car. I look at a number of sites and Driveway gave me a good price. I am a single woman and I live alone, so I did not like the thought of having strangers come to my home to look at my vehicle. I did not need it as a trade-in. I chose Driveway based on reviews and the fact it is located in Oregon. We had a few hiccups, mostly because I live in a rural area and mail service is not always dependable. Overall it was a pretty easy experience and the support staff was always helpful. I would do it again.",
        "rating": 5
    },
    {
        "title": "Possibly the best customer service experience I have ever had. ",
        "text": "Not trying to be hyperbolic but I think this might have been THE smoothest and most accommodating process/service I have ever used. Car broke down, was very stressed about getting a new car as finances have been tight. Did some research and found Driveway. I got prequalified in less than 10 minutes. Then got approved for multiple vehicles for $500 down and decent monthly car payments. Every step of the process was super streamlined and so easy that I thought there had to be some type of catch. Spoke with agents through the whole process. They were super communicative, punctual and friendly. Even ended up having casual conversation with them. Felt like I was talking to real people who actually cared about their job. Best customer service ever. I just got my car delivered today, an 2022 Kia Soul and everything is perfect. My experience with Driveway legitimately made a tough time so much better. Shout out to Cheyenne and Amanda for all the help. Will definitely be recommending Driveway to people!",
        "rating": 5
    },
    {
        "title": "TEST REVIEW FROM HUB SUP",
        "text": "Date of experience: August 08, 2024",
        "rating": 5
    },
    {
        "title": "Title: Exceptional Service and Top Dollar Offer for My Car",
        "text": "I recently sold my 2019 Hyundai Santa Fe through Driveway.com, and I couldn't be more pleased with the experience. From start to finish, the process was fast and seamless. The team at Driveway.com was incredibly responsive, answering all my questions promptly and professionally.They offered the best price around, significantly higher than other offers I received. The entire transaction was straightforward, and I felt confident and supported throughout. If you're looking to sell your car, I highly recommend Driveway.com for their exceptional service and competitive pricing.",
        "rating": 5
    },
    {
        "title": "Great experience so far!",
        "text": "Great experience so far!! there was a lot of inventory and the approval process was fast and efficient. The customer service was great!! I was always able to speak to someone and I purchased the car on a Sunday!",
        "rating": 5
    },
    {
        "title": "It’s giving EASE",
        "text": "So easy! They offered the best price to buy my vehicle, and were exceptional at communicating what was needed and how everything would transpire. So friendly and such ease ",
        "rating": 5
    },
    {
        "title": "Good price",
        "text": "Good price; vehicle in great shape.  Came with only one key fob and empty gas tank.  Delivery dealer filled tank for me and charged Driveway. Had to contact  Driveway after delivery for temporary tag but they came through quickly.  Overall, a very positive experience.",
        "rating": 5
    },
    {
        "title": "Simple process",
        "text": "Kat was the absolute best! She made the process seamless and smooth. I started out working with Matthew I would NOT recommend working with him, however Kat stepped up and made it happen. I choose to pick up my vehicle as they don’t tell you interest is charged on the shipping so if picking up is an option I would highly recommend doing so. Overall I love my car and the process. ",
        "rating": 5
    },
    {
        "title": "Very happy! ",
        "text": "Everything was excellent from start to finish. Everyone was polite and kind from the initial connection to the gentlemen who picked up my car. Timeframe of completion was slightly off by a few days… but wasn’t an issue. Was skeptical of the process at first… selling your vehicle online is definitely different from what I was used to. But in the end I couldn’t be happier and would definitely explore this route again in the future. ",
        "rating": 5
    },
    {
        "title": "The staff at Driveway Car Company were…",
        "text": "The staff at Driveway Car Company were knowledgeable and attentive. They took the time to answer all my questions, offer insightful advice, and ensure I was completely comfortable with my decision. The buy out process was straightforward, and their no-pressure approach made the experience enjoyable rather than stressful.",
        "rating": 5
    },
    {
        "title": "Excelent service",
        "text": "Excelent service ",
        "rating": 5
    },
    {
        "title": "EFFICIENT AND PROFESSIONAL",
        "text": "Date of experience: August 02, 2024",
        "rating": 5
    },
    {
        "title": "Easy peasy!",
        "text": "Easy peasy!! Tim & Dillan showed up on time, were informative & professional!",
        "rating": 5
    },
    {
        "title": "Great Selection and ease of purchase",
        "text": "I really like the experience of being able to car shop from my kitchen table and compare multiple vehicles all from the comfort of my home. I was able to find the exact vehicle I was looking for and it was delivered to my driveway in perfect condition. My next vehicle purchase will be through driveway. Also, I was very happy and I have already recommended it to a couple of friends.",
        "rating": 5
    },
    {
        "title": "This company made car buying a breeze",
        "text": "This company made car buying a breeze. Staff communicated daily keeping us up to date on paperwork and what we needed to do. Staff also knowledgeable, friendly and helpful. Car was delivered to us and even after all was done they notified us they found another key for our car! That saved us from ordering another.Highly recommend doing business with Driveway.com!",
        "rating": 5
    },
    {
        "title": "Very smooth and straightforward…",
        "text": "Very smooth and straightforward process, not to mention that they offered more than others for my car. I would definitely recommend!",
        "rating": 5
    },
    {
        "title": "Very great.",
        "text": "Date of experience: August 02, 2024",
        "rating": 5
    },
    {
        "title": "Everything was went good",
        "text": "Everything was went good ",
        "rating": 5
    },
    {
        "title": "The process took a while but Nathan and…",
        "text": "The process took a while but Nathan and Cheyenne made it all worth the wait. Both contacted me each day with updates and was able to answer any questions I’ve had. ",
        "rating": 5
    },
    {
        "title": "Made buying and delivering the vehicle…",
        "text": "Made buying and delivering the vehicle easy",
        "rating": 5
    },
    {
        "title": "This was our 3rd vehicle purchase with…",
        "text": "This was our 3rd vehicle purchase with driveway and we are very much satisfied with prompt service and response.  The process was very simple and easy.  Very convenient and efficient.  Strongly recommend to my family and friends  Thank you",
        "rating": 5
    },
    {
        "title": "Everyone was very helpful with me :)",
        "text": "Date of experience: July 23, 2024",
        "rating": 5
    },
    {
        "title": "I just made my second car purchase…",
        "text": "I just made my second car purchase through Driveway!! I absolutely love it.  They are fast, friendly and reliable.   I can't say enough good things anout them down to the person that delivered my car. Absolutely amazing!!!  She remembered me from the first car delivery.",
        "rating": 5
    },
    {
        "title": "So efficient and trustworthy",
        "text": "So efficient and trustworthy! Kept me in the know about every detail. So will continue to recommend Driveway to anyone needing to sell their vehicle! They take care of EVERYTHING!!",
        "rating": 5
    },
    {
        "title": "Proven simple…",
        "text": "Skeptical at first but all went smoothly!  Highest offer on my used vehicle by far.  Emails and text msg links to upload and maintain contact.  Pickup from driveway and immediate payment to bank account.  Would definitely use Driveway.com again!!!  Thank you",
        "rating": 5
    },
    {
        "title": "Easiest truck buying experience ever!",
        "text": "It was so easy to buy truck through Driveway!  Employees were in constant contact every step of the way.  I knew what would happen next so I wasn't left wondering.  Overall great truck buying experience!",
        "rating": 5
    },
    {
        "title": "Honest and very clear about the process.",
        "text": "Date of experience: July 23, 2024",
        "rating": 5
    },
    {
        "title": "Easy car buying car experience from…",
        "text": "Easy car buying experience from Breanna,Jeremiah to phill A+ Driveway is the answer for picking up your car! Now delivering is another story:(",
        "rating": 5
    },
    {
        "title": "Driveway is very easy",
        "text": "Driveway is very easy. From my offer , to getting my information to Driveway, to dropping my car off, was a simple experience. It is my third car sale to Driveway. Thank you to Jada in Las Vegas, and Kevin in Beaverton, Oregon",
        "rating": 5
    },
    {
        "title": "Awesome I will buy my next truck from…",
        "text": "Awesome I will buy my next truck from them. ",
        "rating": 5
    },
    {
        "title": "Great overall experience!!!!",
        "text": "The whole process was very simple and smooth.  The team at Driveway were friendly, knowledgeable and quick to response to emails/calls/texts. The whole experience from picking a car, filling out e-sign forms and taking ownership was roughly 7 days.  Thanks everyone for the help!!!",
        "rating": 5
    },
    {
        "title": "The process was smooth and efficient",
        "text": "The process was smooth and efficient.  And you could get to a human for questions ",
        "rating": 5
    },
    {
        "title": "From start to finish the process of…",
        "text": "From start to finish the process of selling my vehicle was made simple by driveway. ",
        "rating": 5
    },
    {
        "title": "Good Company!",
        "text": "Valet was on time and very informative!",
        "rating": 5
    },
    {
        "title": "Christina was super helpful and was so…",
        "text": "Christina was super helpful and was so pleasant I would recommend anyone to only work with her",
        "rating": 5
    },
    {
        "title": "Great from start to finish very…",
        "text": "Great from start to finish very straightforward ",
        "rating": 5
    },
    {
        "title": "Excellent service",
        "text": "Excellent service ",
        "rating": 5
    },
    {
        "title": "Helpful Employees ",
        "text": "The people at Driveway bent over backwards to help us.  Our vehicle is everything that was promised and more!",
        "rating": 5
    },
    {
        "title": "Easy and quick ",
        "text": "The quote was quick, process was quicker and payment was quickest. Highest quote and fastest process. Would recommend 100% for a truly hassle free selling process",
        "rating": 5
    },
    {
        "title": "Overall my experience was great",
        "text": "Overall my experience was great. Edward helped me find the best car for me and my son. Thanks again driveway for the easy process. ",
        "rating": 5
    },
    {
        "title": "I would like to take the time to give…Sarah Wolf a wonderful thank you ",
        "text": "I would like to take the time to give an extra thanks to Sarah wolf .She went over and beyond when it came to the multiple issues I had with the buying experience.She maintained a professional attitude thru the whole process and kept every promise she made with all follow ups promised to me .If you buy fromThis company I highly recommend you cross her path you’ll have a wonderful experience.Again thanks Mrs.Sarah Wolf you rock and I wish you nothing but success in your career you deserve it.",
        "rating": 5
    },
    {
        "title": "You did exactly what you promised",
        "text": "You did exactly what you promised,  even though I returned the car. I would definitely recommend you. ",
        "rating": 5
    },
    {
        "title": "Great communication",
        "text": "Great and friendly communication every step of the way that made the entire process go so smoothly. ",
        "rating": 5
    },
    {
        "title": "Amazing experience!",
        "text": "Amazing deal, super easy process. Paperwork came fast, detailed instructions and everything went smooth with selling my car and getting paid. I will 100% sell a car using Driveway again.",
        "rating": 5
    },
    {
        "title": "Fair price",
        "text": "Fair priceFast processClear communication and instructionsInstant payment when they took the car.",
        "rating": 5
    },
    {
        "title": " outstanding service ",
        "text": "Fast and outstanding service and comunication",
        "rating": 5
    },
    {
        "title": "I highly recommend driveway",
        "text": "I highly recommend driveway. The process was seamless, quick and easy.  Every step of the way I was kept informed and every representative was very professional and extremely helpful.  Thank you for making selling my car super easy and fair.  Love  Driveway!",
        "rating": 5
    },
    {
        "title": "My first car purchase in America",
        "text": "Writing my review after my successful purchase with driveway. Everything went off well and was better than expected. It started off a little on the negative side as two of the cars I initially wanted to purchase did not work out but then the car I ended up with was absolutely perfect. I would like to thank Amanda from the initial sales and customer service department who gave me a proper and thorough explanation of the entire process. She is very thorough with regards to the process and did not give me any unrealistic expectations. Cheyenne was also super quick in getting my car delivered to me. Kasandra from the post - delivery customer satisfaction department helped in getting minor issues fixed and did so very quickly. Thank you all at Driveway.com. Now I await my plates and the hope for a speedy conclusion to the registration process. I would definitely recommend driveway to anyone looking to purchase a car online. ",
        "rating": 5
    },
    {
        "title": "I can vouch for Driveway.com!",
        "text": "I’m going to be honest…It was a little nerve-wracking buying a car on the internet, where I basically have no chance to test drive it before making the purchase and where I must rely on the car being delivered to me. It seems like so much can go wrong, right? But I checked out driveway.com despite my worries and they had an unbeatable price on just the car I was looking for, and I really appreciated the 7-day grace period to test out the car. To top it off, the estimate for my trade-in was the highest offer I received. So I just took a leap of faith! The salesman (Joshua) I dealt with over the phone and via text was kind and helpful through his end of the process, and the others were helpful and informative as well. But it was Noemi Gamez (Dispatch Coordinator) who provided stellar customer service - she constantly provided me with updates and was very responsive to my texts. There were some delays due to VIN issues, but she was persistent about getting the car to me as soon as she could. She’s the Dispatch Coordinator you want on your side. The driver who delivered my vehicle did it right on time and was also very pleasant. I originally gave driveway.com 4 out of 5 stars just because there’s nearly a different contact for each step of the process, and you might have to wait up to a month to get your car, depending on if there are any administrative hurdles along the way. I first spoke to the salesmen on 6/30, and I received my car on 7/25. Also, when I tried to contact the salesman about my VIN issue (after I signed the paperwork to purchase), I never heard back from him. But now that the deal is done and I’ve had a chance to reflect, the process was relatively smooth. I was given my temporary tags along with the car (I recommend asking for an email copy as well, just in case). I was then sent my permanent license plate and registration stickers a couple of weeks after I received my car!  And again, Noemi was so good to work with. Just remember that you’re not getting your car the same day; you have to be ok with waiting a few weeks to a month for delivery. Just stay on top of status and make sure you know who to contact, depending on what step you are at in the process. All in all, a good experience for me. I’d do it again!",
        "rating": 5
    },
    {
        "title": "Very satisfied with car purchase thru…",
        "text": "Very satisfied with car purchase thru Driveway. Friendly knowledgeable staff that kept us updated with every step of the purchase. We bought vehicle sight unseen and it was delivered to us by a lovely young lady.Highly recommend this company.",
        "rating": 5
    },
    {
        "title": "I couldn’t be happier with the results…",
        "text": "I couldn’t be happier with the results !! Driveway has the best team and the finest customer service I have ever dealt with ! Everyone was kind and over the top helpful and hand no issue walking me through all the steps as this was my first time buying a newer vehicle. Delivery was smooth and I look forward to being able to recommend the company to others who are in the market for a reliable vehicle and company to match !A special thanks to Chase , Cheyenne & Jibril as they have been absolutely phenomenal in their service and assisting me through this process !!5 Stars all the way !!!",
        "rating": 5
    },
    {
        "title": "Great customer service ",
        "text": "Christina Mogford came through. I was a first time customer ordering from driveway. It gave me a wonderful trade deal for my car. Unfortunately the car I got came with a broken radio that was not listed on carfax. I reported it and Christina made the efforts to reach out to the service department and got the radio part approved to replace on my car. That was very impressive and I applaud her efforts and customer service. ",
        "rating": 5
    },
    {
        "title": "You were professional and true to your word. It was a great experience. Would do business with this company again",
        "text": "You were professional and kept us informed all the way though the process ",
        "rating": 5
    },
    {
        "title": "The day I went to pick up my truck my…",
        "text": "The day I went to pick up my truck my bank could not give me a cashier check, you would not take a personal check or cash I had to wait to the bank computer came back on line about 6 hours ",
        "rating": 5
    },
    {
        "title": "The process was trying at times",
        "text": "The process was trying at times. The offer was good and the payment was quick and as promised. All the people I I dealt with would take the time to help during the trying times 9",
        "rating": 5
    },
    {
        "title": "I have my tags!",
        "text": "There was a complicated process with my tags. But with the help of the Driveway team that lead me to Christina Mogford I was able to receive my tags. Thank you all.... And you go girl!!",
        "rating": 5
    },
    {
        "title": "Excellent all the aspects",
        "text": "Excellent all the aspects. I worked with Jeff Jewell, Martin, Brandon and Alicia. All very attempted to our concerns, reliable, giving us reassurance and very professional. I definitely will sell another car with them. ",
        "rating": 5
    },
    {
        "title": "Easiest car buying experience of all…",
        "text": "Easiest car buying experience of all time.",
        "rating": 5
    },
    {
        "title": "Easy transaction and gave me the best…",
        "text": "Easy transaction and gave me the best price for my truck ",
        "rating": 5
    },
    {
        "title": "#1 and great company to sell your…",
        "text": "#1 and great company to sell your vehicle in US",
        "rating": 5
    },
    {
        "title": "I was really impressed with the speed…",
        "text": "I was really impressed with the speed and ease. The person I worked with over the phone was amazing!",
        "rating": 5
    },
    {
        "title": "Driveway team was clean from intro to…",
        "text": "Driveway team was clean from intro to completion. I originally was skeptical about transfer of title to depositing funds into my bank account. There team was outstanding in following thru to completion. Thank you Driveway Team.Pete O.",
        "rating": 5
    },
    {
        "title": "They communicated every step of the…",
        "text": "They communicated every step of the process.  ",
        "rating": 5
    },
    {
        "title": "Sarah is the best ",
        "text": "Sarah is the best at what she does had few problems but she took care of everything in a professional manner ",
        "rating": 5
    },
    {
        "title": "Ease of the process & delivered what…",
        "text": "Ease of the process & delivered what was expected.",
        "rating": 5
    },
    {
        "title": "Above and beyond what I was expecting ",
        "text": "I think it’s only fair that if I made a post when I wasn’t treated fairly, that I also do so when my issues have been addressed and corrected Sarah responded to my review and immediately put the work in to correct all my concerns. I was not only compensated, but also reminded that customers matter. Thank you Sarah and I hope Driveway appreciates your ability to make people happy",
        "rating": 5
    },
    {
        "title": "GoodJob",
        "text": "Did a good job.",
        "rating": 5
    },
    {
        "title": "Everything worked out just as they said…",
        "text": "Everything worked out just as they said it would. Every Representative was kind and professional In every way. I would recommend Drive-way for future business. Thank you. ",
        "rating": 5
    },
    {
        "title": "Driveway made our experience very easy…",
        "text": "Driveway made our experience very easy and quick. Their communications was clear and concise ",
        "rating": 5
    },
    {
        "title": "Easy",
        "text": "Easy, Efficient, and very quick. All the people I dealt with were polite and knew their jobs. Would definitely use Driveway again.",
        "rating": 5
    },
    {
        "title": "First time buying a truck online and it won’t be the last. ",
        "text": "I was skeptical at first when my wife and I began the process of looking for a new to me F 150. But, I was surprised at the inventory and the price of the trucks I saw. After looking for a day or so I found the one that I wanted, the wife and I filled out the online paperwork and to my surprise I was approved. My truck arrived about a week later and it’s better than what I saw online. I’m beyond happy with my experience. Justin was the best and helped us throughout the process and his patience as we as new online buyers called him about every day and he spoke to us and even followed up with me the day of delivery. We will use driveway in the future for sure. ",
        "rating": 5
    },
    {
        "title": "Driveway is the only way to sell your car! ",
        "text": "From the first phone call every step was seamless and hassle free. I received my documents quickly and within 72 hours after returning my documents, my car was picked up and I was paid in a few hours. This truly was a relaxing experience. ",
        "rating": 5
    },
    {
        "title": "So easy to do",
        "text": "So easy to do. Great communication. I was nervous about dealing online for this type of thing. They understood and reassured me also was very understanding at all the emails calls and texts. Would highly recommend. ",
        "rating": 5
    },
    {
        "title": "Very smooth process. ",
        "text": "Team is very cooperative. Good customer service. Prompt responses. Timely payment. ",
        "rating": 5
    },
    {
        "title": "Very smooth process",
        "text": "Very smooth process. Communicative team. ",
        "rating": 5
    },
    {
        "title": "communication and fast cash?",
        "text": "Date of experience: June 11, 2024",
        "rating": 5
    },
    {
        "title": "Very good communication",
        "text": "Very good communication. Fair and competitive offer on vehicle based on market value. Quick and painless transfer of funds!",
        "rating": 5
    },
    {
        "title": "Great simple experience in selling my…",
        "text": "Great simple experience in selling my car ",
        "rating": 5
    },
    {
        "title": "trustworthy! great communication",
        "text": "I was very skeptical and was pretty lost in ordering a vehicle online, but y'all made it so simple and easy!",
        "rating": 5
    },
    {
        "title": "Amey is the best",
        "text": "Amey is the best! I had a problematic title issue with my vehicle purchase which required specific attention and a unique skill set.  Amey was knowledgeable, professional and committed to resolving my problem. It took a month to resolve but Amey kept me updated throughout the process. This could have been an unmanageable (out of state) problem without Amey’s persistence. Thank you Amey!!! Tim from Denver",
        "rating": 5
    },
    {
        "title": "Service was prompt & helpful",
        "text": "Service was prompt & helpful. Ashley answered all questions with kindness and patience. Picking the vehicle up was an easy and quick experience. ",
        "rating": 5
    },
    {
        "title": "Process was smooth they said my vehicle…",
        "text": "Process was smooth they said my vehicle was going to took awhile to get to me but I got it fast. Only complaint I don’t know how the driver was driving my truck to cuz a chip in my windshield. Driveway paying for it but have to wait idk how long to get a check in the mail",
        "rating": 5
    },
    {
        "title": "Great experience selling my car",
        "text": "Great experience selling my car! I loved that a rep was always available & you can complete most things through email & text. This company tends to offer more for the vehicle than local dealerships. I would suggest getting time frame for processes from rep & hold them to it. Call them if tasks is not in time frame. For example: paperwork received 1-3 days, or pickup arranged 3-5 days, when I didn’t hear anything on 5th day, I would call & they would get on it that day. ",
        "rating": 5
    },
    {
        "title": "Very simple!",
        "text": "Date of experience: June 11, 2024",
        "rating": 5
    },
    {
        "title": "The people are easy to talk to.",
        "text": "The people are easy to talk to. ",
        "rating": 5
    },
    {
        "title": "Great experience",
        "text": "Great experience and very smooth. Received my money fast. Thanks!",
        "rating": 5
    },
    {
        "title": "You kept your word!!",
        "text": "You kept your word!!!  It was easy to communicate with you and your agents got right back to me whenever I had a question. ",
        "rating": 5
    },
    {
        "title": "Everything was handled with a…",
        "text": "Everything was handled with a professional manner.",
        "rating": 5
    },
    {
        "title": "The service was great the people i…",
        "text": "The service was great the people i talked were very polite ",
        "rating": 5
    },
    {
        "title": "Driveway Unequaled Customer Service across ERVERY aspect of the Process ",
        "text": "Through the whole process I dealt with several people. Number one I spent approximately two hours speaking to Patrick. Unbelievable Customer Service had answers to all my questions and followed up consistently. Number two work with Courtney again very very helpful. Followed up consistent walked me through anything and everything that I didn’t understand. Number three worked with Na’al she also kept in constant contact with me, letting me know what was going on with the vehicle every step of the way. I can’t remember the valet guy who delivered the car and covered everything with me,  he was excellent. Even though the car was unacceptable and had damage, he was professional, return the vehicle and it was promptly repaired and redelivered in the condition it should have been delivered it in the first place. We also have just dealt with a guy name, Nasier on several chips that were on the hood of the vehicle during transport. He requested photos. I just sent them to him and look forward to hearing from him and getting these repaired. The overall experience I would give you 10 stars your employees are outstanding and I hope they are compensated well for going over and beyond taking care of your valued customers. I’m very challenging to deal with and had no issues with them what so ever. Thank you for doing a great job. I will highly recommend and have highly recommended you to everyone I come into contact with. ",
        "rating": 5
    },
    {
        "title": "It was a great experience",
        "text": "It was a great experience! I’m a real human and not a bot lol they customer service was top tier. They helped a lot. I would recommend. Aldon was great. Cheyenne also. ",
        "rating": 5
    },
    {
        "title": "Such a quick and pleasant process!",
        "text": "It was just such a quick and pleasant process. Got what I was offered originally. Any time I had questions throughout the process, anybody I texted replied rather quickly with what I was looking for. Obviously receiving a good offer for the car was the best part, but their communication was easily the 2nd best thing. Lastly, they support the new banking protocol RTP (real time payments), so I got paid the same day that they came and took the car. Pretty cool!",
        "rating": 5
    },
    {
        "title": "Clean and safe process.",
        "text": "Clean and safe process. ",
        "rating": 5
    },
    {
        "title": "Driveway is legit !",
        "text": "Driveway is legit !! Offered me the highest price, after submitting paperwork my car was picked up a few days later. I was skeptical at first because it seemed too good to be true but it’s official. Payment was processed 4 business days after pick up, there’s really no hassle. Definitely the easiest way to sell your car online, I highly recommend  !!",
        "rating": 5
    },
    {
        "title": "It was efficient",
        "text": "It was efficient.  They told me exactly what would take place and everything went as they told me. Everyone was very polite and helpful. I would recommend them highly to anyone wanting to sell a car. Outstanding experience. ",
        "rating": 5
    },
    {
        "title": "This was an interesting experience for…",
        "text": "This was an interesting experience for us. The purchasing and financing process was quick and easy. When the vehicle was delivered we were excited but it turned out that due to an error (which was not driveway's) the wrong vehicle had been delivered. Driveway's customer service teams and representatives have worked closely and diligently with us to get us the right vehicle and compensate us for the mistake.",
        "rating": 5
    },
    {
        "title": "Excellent service and very professional.",
        "text": "Excellent service and very professional.",
        "rating": 5
    },
    {
        "title": "It was a great experience working with…",
        "text": "It was a great experience working with Driveway. They did exactly what they said they would do. The transaction was quick and easy.",
        "rating": 5
    },
    {
        "title": "Quick",
        "text": "Quick, easy and very responsive",
        "rating": 5
    },
    {
        "title": "Very impressed with all the employees…",
        "text": "Very impressed with all the employees that helped with the purchase from start to finish.",
        "rating": 5
    },
    {
        "title": "First time user.",
        "text": "The first thing to remember is Driveway is here to sell you a car.  As soon as you \"submit\" within hours you will be contacted and things happen very quickly.  Get your act and finances together. In my case the car was enroute from Florida to Denver before they had received the funds. They are extremely efficient.  Not the least expensive way to buy a car but you are getting access to their expertise .  A leap of faith but my purchase was sight unseen from a Florida dealer.  Worked for me.......Good luck!  ",
        "rating": 5
    },
    {
        "title": "Great job! ",
        "text": "Thank you for the great customer service!",
        "rating": 5
    },
    {
        "title": "I usually think everything is a scam…",
        "text": "I usually think everything is a scam until I see it with my own 2 eyes. I saw the mixed reviews online and trusted them and the car I wanted anyway. I started my online order July 2 and I just got it delivered today July 16. There are going to be a lot of different people you have to talk to but they all work in different departments. As long as you do your part, follow up if you need answers, they will execute and I’m very pleased. Thanks guys.",
        "rating": 5
    },
    {
        "title": "Christina at Driveway",
        "text": "Christina at Driveway, along with all representatives I spoke with, were so very helpful. I inquired about an issue with my vehicle within the first seven days and the team was quick to solve the issue. I highly recommend Driveway to anyone who is vehicle shopping but doesn’t have the time to drive all over to find the perfect ride! ",
        "rating": 5
    },
    {
        "title": "Very effective and efficient",
        "text": "Very effective and efficient ",
        "rating": 5
    },
    {
        "title": "Was very easy",
        "text": "Was very easy. Professional friendly just a over all good experience. Thank you ",
        "rating": 5
    },
    {
        "title": "Quick and easy process with great…",
        "text": "Quick and easy process with great service and support ",
        "rating": 5
    },
    {
        "title": "Smooth",
        "text": "Smooth. Easy, timely…all good!",
        "rating": 5
    },
    {
        "title": "Easy and fast",
        "text": "Date of experience: July 06, 2024",
        "rating": 5
    },
    {
        "title": "Easy from start to finish",
        "text": "Easy from start to finish. Picked up car when they said they would.  Check deposited when they said it would!",
        "rating": 5
    },
    {
        "title": "We were apprehensive at first when we…",
        "text": "We were apprehensive at first when we first emailed Driveway to get an offer for our Honda Accord.The experience with Driveway was excellent.From sales to customer service to dispatch to the driver. Very pleased with the process.In fact we recommended Driveway to my daughter who was looking to purchase a vehicle and she did. Her car was just delivered.",
        "rating": 5
    },
    {
        "title": "Great Thing Overall",
        "text": "The process of pre-qualification and pricing transparency was amazing and top-tier! Communication and expectations around delivery could have been slightly better but overall was very good.",
        "rating": 5
    },
    {
        "title": "Very good experience and very helpful",
        "text": "Very good experience and very helpful ",
        "rating": 5
    },
    {
        "title": "I was so leary buying a car online",
        "text": "I was so leary buying a car online.   Everyone was so helpful and nice through every step of the process. Questions were answered promptly and efficiently with the millions of questions I had.  Would definitely do it again and recommend to all my friends!  Plus I love my car!",
        "rating": 5
    },
    {
        "title": "Hassle free car buying",
        "text": "Very simple, methodical process. Great communication and service.",
        "rating": 5
    },
    {
        "title": "Very good experience with Driveway",
        "text": "The car was exactly as advertised. It arrived by transport and was delivered perfectly. The buying process was smooth and easy. ",
        "rating": 5
    },
    {
        "title": "Being able to purchase a vehicle online…",
        "text": "Being able to purchase a vehicle online with absolutely NO hassle was simply amazing with Driveway!All representatives were courteous, professional, and fast paced. Delivery went extremely well! Driver called before delivery and upon arrival. Registration was secured in vehicle and visual appearance in person of vehicle was mirror image of online images. I would recommend all to Driveway! Thanks A Bunch, Driveway!",
        "rating": 5
    },
    {
        "title": "Easiest car I have ever sold",
        "text": "Date of experience: July 12, 2024",
        "rating": 5
    }
]