[{"title": "We were in a rush to get these items…", "text": "We were in a rush to get these items for a trade show, we called the customer service line as the online estimate showed the items would not arrive until after the show. After speaking with the CS rep we followed through with the order and received our items ahead of schedule! Quality of the embroidery is top notch!", "rating": 5}, {"title": "Customer Service Rep", "text": "It would be great if you assigned a customer service rep to my account Penny is the rep a prefer outstanding service helps in what ever way she can.Spoke to here 10/11,10/16,10/23 and in the future.Since she is familiar with my account, she always has great suggestions and follows up. She is an asset to Queensboro company.", "rating": 5}, {"title": "Great quality and service ", "text": "I just received a couple of beanies and a polo shirt and the quality is great. I'll definitely be adding Queensboro to the list of companies I order merch from. I also had to talk to them about the design and the service was much better than expected. ", "rating": 5}, {"title": "Customer service is out of this world!", "text": "Customer service is out of this world!! The first order just wasn't as I expected it to be, so I couldn't mark it \"perfect\" and just like that they offered to make the small changes to make it \"perfect\"! The quality is excellent and customer service is even better. Give them a try and don't be afraid- YOU are their first priority!!", "rating": 5}, {"title": "The process for your No Returns…", "text": "The process for your No Returns Necessary Program was easy and your customer service representative was unusually helpful for these days.  I felt like I was experiencing customer service from decades ago.The shirt you made for me was so nice that other team parents are asking about it, I'll be sending them to your website so they can buy their own!", "rating": 5}, {"title": "Long term cistomer", "text": "We have been using Queensboro for probably 20 years.  The quality and service is outstanding.  Just once we had an issue over all those years and Queensboro took care of the situation to 100% of our satisfaction.", "rating": 5}, {"title": "The Sweater and Logo Are Perfect", "text": "The first sweater I received did not have a good color combination. But you fixed it! This second one is perfect. Processing and shipping were all quick. I plan to use this logo on shirts as well.", "rating": 5}, {"title": "New Customer ", "text": "When I say Mia.W the CSR or SR was very helpful and knowledgeable of the products and prices not one time was she aggressive as for as pushing a item but she made some great suggestions thanks Mia.W we all need people like you on our team ", "rating": 5}, {"title": "Adjusted or logo colors to stand out against the background.", "text": "Great selection, ease of ordering, and we know it will look great. We have a logo on file, and when we ordered dark hats you flipped the logo colors so they would be visible against the background - it turned out great!", "rating": 5}, {"title": "Quality", "text": "High quality, fair price, custom embroidered hat. Fast shipping, and even accepted an order quantity of one.", "rating": 5}, {"title": "I’ve been using Queensboro  for some…", "text": "I’ve been using Queensboro  for some time, and they are fantastic. The product quality is great and the support is outstanding, which is equally important.I recommend queensboro.Best regards,", "rating": 5}, {"title": "Late but good", "text": "Missed original production date promised but all was good with the order. Shirts and jacket were nice. ", "rating": 5}, {"title": "Great company, service & products!", "text": "I loved the opportunity to do a one-off product as a sample! The quality, communication process and everything else was excellent!", "rating": 5}, {"title": "They do what it takes", "text": "I love getting the email specials - Although we don't buy as much as I'd like - when the right deal comes through, Queensboro always makes a great product for us.", "rating": 5}, {"title": "We have been using Queensboro for many…", "text": "We have been using Queensboro for many years and always have received fast, quality service!", "rating": 5}, {"title": "Worth the delays", "text": "Required rework on both of my previous projects, but customer service is OUTSTANDING and fixed the problems at no extra expense to me. I am very happy with the quality of the products and will purchase from them again. ", "rating": 5}, {"title": "Fixed the problem without question ", "text": "The original order was messed up in production, logos were all in the wrong places. One quick phone call and the agent verified where things were supposed to be vs where they were and reordered without question. I’ve used Queensboro for several years in a couple of different businesses and this was the first problem I experienced and it was rectified immediately without question. Since I did not have to return the original shipment I donated them.", "rating": 5}, {"title": "The best decision is be made", "text": "This was my first time ordering on line and I made st tell you I was very very nervous. Nervous that I was going to be throwing money out the window. Well, Queensboro really made me feel as I was making the right choice but,that I was in good hands. Queensboro went above and beyond. The polo shirt did not feel cheap. The stitching didn’t look rushed. It was perfect! If it’s your first time buying a couple of shirts… don’t hesitate..they will help you and they will make sure you are satisfied. I’m definitely going to be a life time costumer. Thank you Queensboro ❤️", "rating": 5}, {"title": "We’ve always had a great experience…", "text": "We’ve always had a great experience with Queensboro. Fair prices, excellent quality and great service! ", "rating": 5}, {"title": "Absolutely spectacular customer service!", "text": "I ordered two shirts in XL and should have ordered XXL.Queensboro sent two replacements within a week.Absolutely spectacular customer service!", "rating": 5}, {"title": "process was seamless", "text": "The process was seamless. I had one question and I was responded to immediately. The shirts are of exceptional quality and the logo that I uploaded was perfectly placed on the shirts and  the colors matched perfectly. Delivery was as promised also. ", "rating": 5}, {"title": "Smooth", "text": "Overall — very easy process. I’ve worked with other companies in the past and this was one of the easiest. I will definitely be ordering more for y’all in the future. ", "rating": 5}, {"title": "It was easy to order", "text": "It was easy to order, match up thread colors for the different colors of items. User friendly site, great deal, love the final product!", "rating": 5}, {"title": "AMAZING AMAZING AMAZING!!!!!", "text": "Excellent customer service.  Communication throughout the process.  The fact that you were able to change the way you shipped the product at the last minute to ensure I received it, amazing! Also, the pricing was better than everyone else’s out there.  The ability to buy the size color and type and not have some idiotic minimum or some minimum price I have to pay OUTSTANDING!!!  Way to go, I will be ordering more and you have earned my business.", "rating": 5}, {"title": "Easy Peasy", "text": "The order was easy to place and delivered swiftly. Communication on the tracking and delivery was very good.", "rating": 5}, {"title": "I was really appreciative of how you…", "text": "I was really appreciative of how you handled my order and fixed it for me.. Thanks again as I’m I’m sure I will be ordering more in the near future ", "rating": 5}, {"title": "The Reason I Keep Coming Back", "text": "The Reason I Keep Coming Back. I have ordered from Queensboro for years now, thousands of dollars of merchandise and I will continue to come back because the quality has literally NEVER been anything short of perfect. I haven't even had to contact them to fix anything. ", "rating": 5}, {"title": "Bull Logo ", "text": "Queenbro  has good products and the embroidery  is amazing  I love the notification about specials  and the customer  service  is the best . Queenbro is our govto for polo's sweatshirts beanies and ball caps . ", "rating": 5}, {"title": "Great experience ", "text": "First time ordering from them and I will again. The jacket was snug and they immediately made another and shipped it to me. Great customer service!  ", "rating": 5}, {"title": "Always a great experience with the…", "text": "Always a great experience with the queen. Product is always on point no complaints ever always better then expecting!!", "rating": 5}, {"title": "Highly Recommend!!!", "text": "Polos came out better than I could have thought. They were a super good price and they look really good and are super comfortable. The company was extremely good at keeping me updated on the status of my order. Definitely plan on ordering from here again.", "rating": 5}, {"title": "We have used Queensboro for many years…", "text": "We have used Queensboro for many years and have always been pleased. Never had any problems with quality and always get it quicker than expected. Customer service is excellent! If there's a better company out there, I'm just fine with Queensboro.THANK YOUDP Heating & Air", "rating": 5}, {"title": "I love these guys", "text": "I love these guys! Queensboro has been my go to for the past 15 years! They have been with me through the dream, implementation, success and now legacy of growing my company over the years. They deliver high quality consistence at reasonable pricing. I recommend them without hesitation.David Leavitt, CEOAmerican Forensics Dallas, Texas", "rating": 5}, {"title": "Customer service is exceptional in the…", "text": "Customer service is exceptional in the last 20 years. The owner has done a fantastic job running such a competitive product hats off to your Queensborough. You do the job right a true American company. Stay blessed and successful.Erik Hagstrom", "rating": 5}, {"title": "Great customer service ", "text": "I’m very happy with my experience with Queensboro. I’ll be ordering more soon. ", "rating": 5}, {"title": "Queensboro is fantastic!!", "text": "Queensboro is fantastic!!! Their custom apparel is top notch in quality. I always shop from them as they are very reliable. ", "rating": 5}, {"title": "Just ordered a polo", "text": "Just ordered a poloShirt and sweatshirt, came out outstanding exactly what I wanted, lettering was actually better and bigger then expected, the texts I get randomly for deals are exceptional. I highly recommend this company in all embroidery and would expect great quality in prints as well if they didn’t have a minimum count on them. ", "rating": 5}, {"title": "Custom polo", "text": "Easy ordering and great pricing and completed quickly. Thanks for making small run orders for small business.", "rating": 5}, {"title": "Perfection as always", "text": "Arrived in a timely fashion and the quality, fit and logo were as requested. ", "rating": 5}, {"title": "I love my shirts", "text": "The shirts I ordered at first were a little big, but Queensboro immediately put in a replacement order for me. When I got them, they were absolutely perfect. I will only ever order through Queensboro.", "rating": 5}, {"title": "Awesome products and even more awesome personnel", "text": "The quality of the products and the speed with which they arrive are all amazing, but they're secondary to the exemplary service we get from Megan Pecararo. We're currently switching all of our uniform needs to Queensboro due to how amazing she has been to work with. ", "rating": 5}, {"title": "Rain jackets brought me tears of joy!", "text": "I made my order a few weeks ago for some rain jackets for the upcoming wet season. When they arrived I had a huge smile on my face as they looked exactly as desired and now my team can look professional in our new gear!", "rating": 5}, {"title": "Customer Service Second to None", "text": "Queensboro’s customer service is second to none! Their No Return Necessary policy and no-hassle easy replacement when a shirt arrived with a small stain from the factory, made my most recent purchase of logoed apparel easy and carefree. Queensboro has earned my loyalty time and again. ", "rating": 5}, {"title": "You guys are great", "text": "You guys are great. Wonderful products and if it is not perfect you make it so.   Greatly appreciated. ", "rating": 5}, {"title": "Ordering was easy and I was impressed…", "text": "Ordering was easy and I was impressed with the quality of the beanies and embroidary!", "rating": 5}, {"title": "Awesome work and awesome customer…", "text": "Awesome work and awesome customer service.. fixed anything you dislike about product.. that’s a plus is awesome customer support..", "rating": 5}, {"title": "Queensboro is the absolute best ", "text": "Queensboro is the absolute best I've purchased all my company products from them and will contine to do so. When our High School Girls Golf team needed hats and the school said they were not paying for them Queensboro stepped up and sent the girls hats. Very highly recommened this company to everyone", "rating": 5}, {"title": "I have my outerwear for this winter", "text": "Love the hoodie and fleece that I ordered. The polo shirt sized just a bit small on me but I’ll take the blame on that. Have been bragging to friends and recommending that anyone needing logo clothing check them out", "rating": 5}, {"title": "excellent quality", "text": " excellent quality, very nice colors, will buy again", "rating": 5}, {"title": "Your company provided a quality product…", "text": "Your company provided a quality product in a timely manner. My logo was not easy to create and you did an awesome job! ", "rating": 5}, {"title": "Excellent product I ordered the wrong…", "text": "Excellent product I ordered the wrong size. Within hours of me receiving my shirt I received an email asking if I liked the shirt. So I explained about the sizing. Then I received another email that evening saying my order is in line to be made. Thanks queensboro.", "rating": 5}, {"title": "Great company too but from", "text": "Had a problem with order. Staff were great. Fixed it instantly. Did not have to mail back incorrect order. Great company to deal with. 10/10. ", "rating": 5}, {"title": "Makes me and my team look great!", "text": "Queensboro makes me and my team look great, every time. The logos and colors are always spot on. Their customer service team is always on top of it, and the couple of times there was a MINOR issue, they go way beyond what was expected for a resolution. I have referred a ton of people, and do it with out hesitating (and no affiliate link so they can stay profitable…) ", "rating": 5}, {"title": "Quick turnaround", "text": "Ordered over the weekend and proof arrived next business day. Whole project arrived before the estimated production date. ", "rating": 5}, {"title": "Second order", "text": "Second order. More to come. The products have been beautiful. ", "rating": 5}, {"title": "Excellent process from start to finish", "text": "Easy ordering process. With a quick response, followed with a great product.", "rating": 5}, {"title": "Order was perfect", "text": "Order was perfect. Just like always!!", "rating": 5}, {"title": "Excellent service I must say I got the…", "text": "Excellent service I must say I got the wrong size and within minutes I received an email with a solution and my item was sent out to me. The customer service by this company is exceptional and I will definitely be recommending them to my business partners and I will be a forever returning customer.", "rating": 5}, {"title": "Love this company", "text": "Love this company, been with them for years… never been disappointed!", "rating": 5}, {"title": "Queensboro is the best", "text": "Queensboro is the best.  Great price, fast service, excellent product. I will always go to them first for my bulk orders", "rating": 5}, {"title": "I was surprised of Queensboro product…", "text": "I was surprised of Queensboro product quality. I would highly recommend to my business partners.", "rating": 5}, {"title": "You guys were awesome to work with and…", "text": "You guys were awesome to work with and were able to take care of everything that I needed. I'm hoping to get a larger order together and send to you guys shortly.", "rating": 5}, {"title": "Outstanding Quality ", "text": "Getting my hat made exactly the way I wanted was quick and easy and looked exactly the way I wanted it to ", "rating": 5}, {"title": "GREAT QUALITY", "text": "GREAT QUALITY, GOOD PRICES, FAST SHIPPING", "rating": 5}, {"title": "great overall", "text": "Sizes ran a little snug, they immediately fixed it and reshipped at no additional costs. They are aware that their vendor runs somewhat small and are in the middle of resolving it. Embordery was absolutely satisfying and customer service was refreshing. ", "rating": 5}, {"title": "Great customer service!", "text": "There was a problem with my first order, and it was immediately addressed by the customer service team.  A few of the items were re-done perfectly, and very quickly.", "rating": 5}, {"title": "I am very happy with my shirt...", "text": "I am very happy with my shirt...Queensboro was very responsive to my modifications and the logo turned out perfect.", "rating": 5}, {"title": "Products came exactly as ordered", "text": "Products came exactly as ordered. The deal was UNBEATABLE!!! Will definitely continue to use Queensboro for other custom products. ", "rating": 5}, {"title": "The process of uploading my LOGO was…", "text": "The process of uploading my LOGO was fast and efficient the shipping was what was projected the quality of the shirt looks great! I highly recommend this company for any future projects.", "rating": 5}, {"title": "Overall ease of use and the overall…", "text": "Overall ease of use and the overall quality of the product was very good I will definitely be using them again in the future", "rating": 5}, {"title": "The customer service was top tier with…", "text": "The customer service was top tier with this company. I got to see a preview of my order beforehand and everything was just as expected. The shirts fit great. I will definitely order again. Prices were very reasonable. ", "rating": 5}, {"title": "whole process was smooth", "text": "whole process was smooth, shipping was timely, products came out amazing. will definitely be using again!", "rating": 5}, {"title": "ANOTHER SUCCESSFUL PURCHASE FROM THE QUEEN", "text": "QUICK SERVICE BUT THE COLOR WAS NOT WHAT THE PICTURE LOOKED LIKE STILL WAS HAPPY WITH THE QUALITY OF THE SHIRTS", "rating": 5}, {"title": "Exceptional quality", "text": "Exceptional quality! Embroidered logo is perfect! We are going to enjoy these nice soft and warm sweatshirts all winter! ", "rating": 5}, {"title": "Excellent quality", "text": "Excellent quality. A little slow on delivery but overall great ", "rating": 5}, {"title": "High quality apparel", "text": "It is easy to order online and there is a large selection of high-quality apparel. ", "rating": 5}, {"title": "Good quality shirts", "text": "Good quality shirts. Order came in quickly. I Very happy with the order. ", "rating": 5}, {"title": "Fantastic customer service", "text": "Fantastic customer service. Made everything perfect with my order. I am recommending them to a friend who needs to update his employee shirts.", "rating": 5}, {"title": "The design and stitching was absolutely…", "text": "The design and stitching was absolutely perfect! Do not hesitate to use this comapny!", "rating": 5}, {"title": "You really can’t top these folks", "text": "You really can’t top these folks. From their prices to their customer service and fast delivery times. ", "rating": 5}, {"title": "The ordering process was easy and…", "text": "The ordering process was easy and customer service was great.  I inadvertently cut off a small portion of the emblem uploading and they without question offered a new shirt without questions!  ", "rating": 5}, {"title": "Good product", "text": "Good product, nice material but it’s my bad. It’s small for me. Mostly 2xl was fit for me. But I don’t know, your sizes are different I guess. I bought wrong size's :(", "rating": 5}, {"title": "Always a great job! ", "text": "We have ordered from this company many times and every time the clothing and prints turn out beautifully. Highly recommend!! ", "rating": 5}, {"title": "Nothing Happened", "text": "Nothing, and I do mean “nothing” at all happened which would be an issue or a problem. Problem Free Ordering!  I love you guys!", "rating": 5}, {"title": "Good quality and fast shipping.", "text": "Good quality and fast shipping. ", "rating": 5}, {"title": "Was actually the bestQueensboro is King job of any…", "text": "Was actually the best job of any printing company", "rating": 5}, {"title": "Best apparel company out there", "text": "Always great products & service. ", "rating": 5}, {"title": "The design and quality of this product…", "text": "The design and quality of this product was great and I look forward to purchasing more", "rating": 5}, {"title": "The quality is great", "text": "The quality is great. The prices are excellent expectations exceeded", "rating": 5}, {"title": "Always a great experience", "text": "Always a great experience.  Easy to order quick delivery, great quality", "rating": 5}, {"title": "Will be a repeat customer ", "text": "Great look when received. Great after first wash. Will be using again!", "rating": 5}, {"title": "I LOVE the quality Queensboro provides", "text": "I LOVE the quality Queensboro provides. You all nailed it. You took my very minor feedback and implemented it perfectly. Thank you so much!", "rating": 5}, {"title": "Fixed an issue right away", "text": "Fixed an issue right away.  Embroidery is always high quality.  Will continue to use your great company.", "rating": 5}, {"title": "Great response time", "text": "Great response time, product came delivered as promised and the clothing looks great more than satisfied with the results", "rating": 5}, {"title": "The ladies shirt on the first order ran…", "text": "The ladies shirt on the first order ran small but it was quickly replaced with another shirt one size up and it fits ", "rating": 5}, {"title": "Erik is the best rep to have support…", "text": "Erik is the best rep to have support our business.  Thank you!!!", "rating": 5}, {"title": "The attention to detail and the fast…", "text": "The attention to detail and the fast turn around from the time my order was placed tothe delivery ", "rating": 5}, {"title": "I could not be happier :)", "text": "Amazing quality!Order placement and communication throughout the process went above and beyond.I couldn't be happier!!!", "rating": 5}, {"title": "Top notch company right there", "text": "Top notch company right there! They have always set the bar for product quality. I always trust the Queen.", "rating": 5}, {"title": "Great job as always ", "text": "Quality is excellent as well as sale promotions. ", "rating": 5}, {"title": "Hat for my business ", "text": "The hat I ordered for my business turned out great and I will definitely be ordering through you guys again. Thank you! ", "rating": 5}, {"title": "Nice vests", "text": "It took a few back and fourths to get the logos correct, but in the end both of the best I ordered turned out perfectly. Nice job again. ", "rating": 5}, {"title": "Great product, Great price!", "text": "Price was extremely cheap and quality of priduct was great! Will order more products. ", "rating": 5}, {"title": "Meets expectations!! Great Job", "text": "The quality of the hat was way better than I expected. Will definitely order again. The shopping was fast. ", "rating": 5}, {"title": "Great customer service", "text": "Great customer service! Will be ordering more from Queensboro!", "rating": 5}, {"title": "long live the queen!", "text": "Exactly as expected. Great job!", "rating": 5}, {"title": "Perfect Products!", "text": "Queensboro is a great company that makes great products to PERFECTION!", "rating": 5}, {"title": "Perfect to order every time", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "Always on time and great quality", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "Absolutely the best promo company…", "text": "Absolutely the best promo company available..Will be ordering more products ", "rating": 5}, {"title": "As always", "text": "As always, you guys friggin rock!!! I Tell everyone about you!!! -Jesse", "rating": 5}, {"title": "My order was perfect", "text": "My order was perfect.  Thank you. Looking forward to my next shipment.", "rating": 5}, {"title": "Excellent experience", "text": "Even though there was an issue on delivery being a little later than originally expected, the team was amazing on keeping me updated and answering all my questions.", "rating": 5}, {"title": "Always great", "text": "This company is always helpful and great quality. Customer service is absolutely amazing as well ", "rating": 5}, {"title": "Always Perfect! ", "text": "Setting the standard for both quality and customer service. Trust the Queen- they really deliver! ", "rating": 5}, {"title": "I loved my polo shirts", "text": "I loved my polo shirts. Wish the writing was a little bigger!!", "rating": 5}, {"title": "There was an issue with the size and…", "text": "There was an issue with the size and you made it right. I am very grateful for that. Thank you!", "rating": 5}, {"title": "Great quality", "text": "Great quality! Came a day earlier than expected. Better than I thought it would be for the 4.95 first shirt. I will be ordering  more for my team and I ! ", "rating": 5}, {"title": "Thanks for making everything perfect", "text": "Thanks for making everything perfect! You guys rock!", "rating": 5}, {"title": "Thank you once again for your quality…", "text": "Thank you once again for your quality work. Always reliable and exact.", "rating": 5}, {"title": "Polos are great for our staff", "text": "Polos are great for our staff. The logo stiching is perfect. Thank you!", "rating": 5}, {"title": "Outstanding job", "text": "Outstanding job, my go to company for embroidery. Thanks ", "rating": 5}, {"title": "The ordering process was very easy", "text": "The ordering process was very easy, the prices are amazing and the quantity is excellent ", "rating": 5}, {"title": "The staff at Queensboro understands customer satisfaction! ", "text": "Got what I thought would be my size but was too big and the queens staff replaced it at no extra cost! ", "rating": 5}, {"title": "The replacement of shirt was well…", "text": "The replacement of shirt was well beyond expected and the quality endurability is great! I would recommend this company to everyone!!", "rating": 5}, {"title": "Happy with my order.", "text": "Happy with my order.  ", "rating": 5}, {"title": "Great customer service!", "text": "Great customer service! Replaced the garment in question immediately. Will continue to give you all my business.", "rating": 5}, {"title": "Great!", "text": "The qualities are great and just as expected.", "rating": 5}, {"title": "Always great service", "text": "Always great service.  Nice shirts delivered on time.  Thank you. ", "rating": 5}, {"title": "Great customer service", "text": "Great customer service. You guys always make everything right.", "rating": 5}, {"title": "Thank you for making my order perfect.", "text": "Thank you for making my order perfect. ", "rating": 5}, {"title": "Super quality.", "text": "Super quality.Thank you", "rating": 5}, {"title": "Great quality and service ", "text": "Item arrived exactly as ordered and on time. ", "rating": 5}, {"title": "Wow!", "text": "The shirts not only arrived, they arrived five days ahead of schedule. Thanks Queensboro. \"I trust the Queen.\"", "rating": 5}, {"title": "Quick responsiveness and very seemless…", "text": "Quick responsiveness and very seemless process, thank you team! ", "rating": 5}, {"title": "Great", "text": "Great. Love the logo and product quality.", "rating": 5}, {"title": "your website is super glitchy.", "text": "Date of experience: October 29, 2024", "rating": 5}, {"title": "Fast turnover", "text": "Fast turnover, responsive customer service, great choices", "rating": 5}, {"title": "Queensboro is the best ", "text": "We’ve ordered from Queensboro 8-10, and couldn’t be more satisfied We will use them for years to come ", "rating": 5}, {"title": "I love everything about it will buy…", "text": "I love everything about it will buy here again with fast shipping and great prices thanks ", "rating": 5}, {"title": "Great experience from ordering to delivery", "text": "Easy to order. Great communication. Timely delivery.Products do not disappoint. ", "rating": 5}, {"title": "I’ve ordered several times ", "text": "I have ordered a few times and every time has been accurate and quick.  Great job.  ", "rating": 5}, {"title": "Great", "text": "Love queensboro always professional and they last a long time", "rating": 5}, {"title": "Great products", "text": "Great products, great team... Have enjoyed the experience.", "rating": 5}, {"title": "Truly a piece of art", "text": "Truly a piece of art. Love my logo on your products. Fast and reasonably priced. ", "rating": 5}, {"title": "Quick turn around and professional…", "text": "Quick turn around and professional product.", "rating": 5}, {"title": "The shirts look great", "text": "The shirts look great. I’m super happy with how they turned out! Great price too!", "rating": 5}, {"title": "Good quailty workmanship and  great…", "text": "Good quailty workmanship and  great logo design", "rating": 5}, {"title": "Great product", "text": "Great product. Great fulfillment. ", "rating": 5}, {"title": "The process was easy and I received…", "text": "The process was easy and I received exactly what I ordered ", "rating": 5}, {"title": "Great as usual", "text": "Date of experience: October 31, 2024", "rating": 5}, {"title": "Great experience@", "text": "Great service! Shirt and embroidery look great.", "rating": 5}, {"title": "Fantastic service", "text": "Fantastic service.  Queensboro is the best.  ", "rating": 5}, {"title": "By far the best company for apparel!", "text": "Date of experience: October 22, 2024", "rating": 5}, {"title": "Great company to do business with", "text": "Great company to do business with. 😃", "rating": 5}, {"title": "They looked so cool!", "text": "They looked so cool!! Very good quality …. Super happy!!!", "rating": 5}, {"title": "Shirts with logo turned out great", "text": "Shirts with logo turned out great, Thank you", "rating": 5}, {"title": "Exactly what I ordered", "text": "Exactly what I ordered ", "rating": 5}, {"title": "Nice embroidery and the shirts were the…", "text": "Nice embroidery and the shirts were the good for the guys!", "rating": 5}, {"title": "Quality and costumer service is…", "text": "Quality and costumer service is exceptional I will be ordering soon", "rating": 5}, {"title": "Came across this company online and…", "text": "Came across this company online and liked the introductory first time buying experience", "rating": 5}, {"title": "Best in  the business", "text": "Fast, affordable and always the highest quality.", "rating": 5}, {"title": "Provided expected service and product", "text": "Date of experience: October 24, 2024", "rating": 5}, {"title": "Product quality and embroidery quality…", "text": "Product quality and embroidery quality were excellent", "rating": 5}, {"title": "Nice quality", "text": "Nice quality, fast shpment", "rating": 5}, {"title": "Great price and value.", "text": "Great price and value.  ", "rating": 5}, {"title": "My items came out great!!", "text": "My items came out great!!!  I’ll be back!!!", "rating": 5}, {"title": "Easy peasy", "text": "Easy peasy, I continue to use them ", "rating": 5}, {"title": "Everything was perfect", "text": "Receive on time and everything was perfect ", "rating": 5}, {"title": "You guys are the best at what you do", "text": "You guys are the best at what you do! Quick and fast!!", "rating": 5}, {"title": "Fast service", "text": "Fast service, quality products", "rating": 5}, {"title": "Just what I asked for!", "text": "Date of experience: November 06, 2024", "rating": 5}, {"title": "Excellent Service", "text": "Easy ordering, timely confirmation and on time arrival!", "rating": 5}, {"title": "Amazing products", "text": "Amazing productsPurchase with excellence", "rating": 5}, {"title": "Very nice logo design and fast delivery …", "text": "Very nice materials perfect logo design fast delivery ", "rating": 5}, {"title": "No surprises ", "text": "No surprises , on time, all the time !!", "rating": 5}, {"title": "Got 2 hoodies they look and fell great", "text": "Got 2 hoodies they look and fell great.  Thank you", "rating": 5}, {"title": "Prompt", "text": "Prompt, efficient, error free", "rating": 5}, {"title": "Great product!", "text": "Date of experience: November 07, 2024", "rating": 5}, {"title": "Price and quality", "text": "Price and quality ", "rating": 5}, {"title": "Awesome Product every time.", "text": "Date of experience: October 24, 2024", "rating": 5}, {"title": "ive used your company,again and…", "text": "ive used your company,again and again,,,great job!", "rating": 5}, {"title": "Great job on hats", "text": "Great job on hats ", "rating": 5}, {"title": "Great service", "text": "Great service ", "rating": 5}, {"title": "Order delivered as promised.", "text": "Date of experience: October 24, 2024", "rating": 5}, {"title": "Great as always", "text": "Great as always, and great prices!  ", "rating": 5}, {"title": "My Shirt was perfect", "text": "My Shirt was perfect ", "rating": 5}, {"title": "Fast Shipping and great product!!!!", "text": "Date of experience: October 18, 2024", "rating": 5}, {"title": "great product", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "they stand behind their product", "text": "they stand behind their product ", "rating": 5}, {"title": "Fast service", "text": "Fast service, great communication!", "rating": 5}, {"title": "Very good ", "text": "Excellent product ", "rating": 5}, {"title": "Thank you very much", "text": "Date of experience: October 30, 2024", "rating": 5}, {"title": "Fast and Affordable ", "text": "Fast, quality embroidery. Great customer service.", "rating": 5}, {"title": "Simply EXCELLENT!!!", "text": "Date of experience: October 30, 2024", "rating": 5}, {"title": "A1 service ", "text": "I love my shirt and hat", "rating": 5}, {"title": "Speedy service and quality materials", "text": "Speedy service and quality materials ", "rating": 5}, {"title": "Amazing quality!", "text": "Date of experience: October 02, 2024", "rating": 5}, {"title": "Always perfect!", "text": "Date of experience: October 27, 2024", "rating": 5}, {"title": "Quality discounts", "text": "Quality discounts ", "rating": 5}, {"title": "Fast", "text": "Fast, excellent customer service and on the point .", "rating": 5}, {"title": "Great company to deal with every time. ", "text": "The communication is always top notch just like the work that is done on every product I have ordered!", "rating": 5}, {"title": "I LOVE DOING BUSINESS WITH THIS…", "text": "I LOVE DOING BUSINESS WITH THIS COMPANY, THEY DO AWESOME WORK AND HAVE THE BEST CUSTOMER SERVICE EVER", "rating": 5}, {"title": "Very good and best service", "text": "Date of experience: October 16, 2024", "rating": 5}, {"title": "Embroidered Shirts ", "text": "My embroidered shirts are great looking and was completed and delivered in a timely manner. Queensboro is a top notch company with giving their customers great deals on embroidered clothing!!Thank you ", "rating": 5}, {"title": "When ordering online ", "text": "When ordering online , the standard sizes will differ how they fit by manufacturer. When I received an item that would be smaller or larger , the staff at queensboro will reorder the correct size to my likeness at no charge and will even rush ship it. As a new business owner I’m happy to have found the Queen! ", "rating": 5}, {"title": "You fixed my mistake!", "text": "I made a mistake on color and without asking, you corrected it without question. I’ve been a customer for over 20 years and it is due to your customer service, great products at a great price. Thank you!", "rating": 5}, {"title": "Great follow through ", "text": "One piece needed to be redone and the team got that done very quickly. Will order again soon!", "rating": 5}, {"title": "Great Quality", "text": "Great Quality ", "rating": 5}, {"title": "Order was perfect!", "text": "Clear communication from start to finish. Sale price made it totally achievable. Order was perfect!", "rating": 5}, {"title": "Great Shirts", "text": "Great Shirts, and amazing material.", "rating": 5}, {"title": "Perfect as always ", "text": "As always, service, communication and product perfect! ", "rating": 5}, {"title": "Customer service that can't be beat", "text": "Customer service that can't be beat!  Great quality prints done fast.  Thanks!", "rating": 5}, {"title": "Great quality, Top-rated customer service", "text": "Great quality, solid customer service. Always very helpful when I have questions. I've ordered multiple times for two organizations I'm involved with, and I'll be ordering again.", "rating": 5}, {"title": "EverythingGreat product Great Price wasad on time", "text": "Everything was correct ad on time. Thank you!!", "rating": 5}, {"title": "Good work customer service", "text": "Good work. Customer service impeccable. ", "rating": 5}, {"title": "great quality and my logo looks…", "text": "great quality and my logo looks beautiful ", "rating": 5}, {"title": "Material of the shirt was great and the…", "text": "Material of the shirt was great and the price was better. Production and delivery was a bit longer than expected but still overall great transaction. I will definitely be making another purchase ", "rating": 5}, {"title": "Polo shirts are an exceptional value", "text": "Polo shirts are an exceptional value.  Beautiful material and the price is phenomenal! Time to get serious now", "rating": 5}, {"title": "Tattoo for DadI…", "text": "The embroidery color was just what I was looking for. ", "rating": 5}, {"title": "Great Product", "text": "Great Product! Great Price! Small Business friendly and fast!", "rating": 5}, {"title": "Always a great experience with every…", "text": "Always a great experience with every order. ", "rating": 5}, {"title": "Customer Service is Exceptional !", "text": "Customer service made sure I was entirely happy", "rating": 5}, {"title": "Great price", "text": "Great price, quality work and fast delivery…what more could I want?", "rating": 5}, {"title": "First order was really bad and wrong…", "text": "First order was really bad and wrong materials, but these people made it right ! They definitely have a customer for life.", "rating": 5}, {"title": "Queensboro continue to amaze with their…", "text": "Queensboro continue to amaze with their detail in work and quality of product. ", "rating": 5}, {"title": "As Usual...PERFECTION!", "text": "As usual. Great job, communications, and delivery.", "rating": 5}, {"title": "Awesome!", "text": "The shirt quality is so good! The embroidery was superb!", "rating": 5}, {"title": "Customer service was exceptional", "text": "Customer service was exceptional. My shirt was a size too small, they made sure I received the correct size, without returning the original shirt. I will be back and will tell everyone I know to order from this company. ", "rating": 5}, {"title": "Great quality embroidery!", "text": "Great quality embroidery! ", "rating": 5}, {"title": "I am so glad I found this company", "text": "I am so glad I found this company.  A fellow firefighter told me this past weekend how jealous he was of the personalized hat I was wearing.  Great communication, great attention to detail.  ", "rating": 5}, {"title": "I am a long time customer", "text": "I am a long time customer.  LOVE THE PRODUCTS", "rating": 5}, {"title": "Quality is always there", "text": "Quality is always there!  We love the shirts for our contractors as they always look sharp!", "rating": 5}, {"title": "they fix the issue with the size and…", "text": "they fix the issue with the size and sent me a new set of T shirt with no cost ", "rating": 5}, {"title": "Proactive C.S.", "text": "Customer service was proactive and suggested solutions before it was even asked of them.", "rating": 5}, {"title": "Many years, every order is perfect!", "text": "Many years, every order is perfect and so less expensive than ANYWHERE else.  How they do it, who knows but them.  Thanx again for my shirts ", "rating": 5}, {"title": "Beautiful fabric and stitching", "text": "Beautiful fabric and stitching! Will make me look very professional at conferences. An elevated more mature look than simple company t-shirts!", "rating": 5}, {"title": "Superior work!", "text": "I have placed several embroidered orders with Queensboro.  The craftsmanship and quality of their work is superior.  I will be placing more orders in the near future.", "rating": 5}, {"title": "I am very pleased with the overall experience", "text": "I want to take a moment to provide feedback regarding our recent uniform order.I am very pleased with the overall experience. The quality of the uniforms exceeded our expectations of craftsmanship and attention to detail.Additionally, the customer service we received was outstanding. Your TEAM was responsive, attentive, and proactive in addressing our needs through the ordering process. Thank you very much, Anthony Palmer ", "rating": 5}, {"title": "Great quality products and service", "text": "Great quality products and service. The discounts were nice as without it they would’ve been rather pricey. I definitely would use you again and would recommend you. ", "rating": 5}, {"title": "Good material and very good customer…", "text": "Good material and very good customer service. ", "rating": 5}, {"title": "Dr Rita", "text": "The polo’s were beautiful and at a great price", "rating": 5}, {"title": "Great work", "text": "Great work, as always", "rating": 5}, {"title": "Highly Recommend !", "text": "I’m a repeat customer, bought many shirts and never had a quality issue, great website easy to navigate.I’m 100% satisfied and will refer to all of my clients.Thank you ", "rating": 5}, {"title": "Perfect fit", "text": "Perfect fit. Perfect embroidery. Fast delivery. I will be ordering again very soon!Thanks, Qeensboro! ", "rating": 5}, {"title": "Quick ordering process", "text": "Quick ordering process, got order as promised!", "rating": 5}, {"title": "Thank you Great service and products.", "text": "Thank you Great service and products. ", "rating": 5}, {"title": "New orders are quick and easy", "text": "Ordering new merchandise from Queensboro is always easy, whether for just a few friends, coworkers or an entire company for any size order. Over the years, Queensboro has been great to work with matching thread colors when needed to make our logo look just right. Big props!", "rating": 5}, {"title": "Completely love this company", "text": "Completely love this company! So easy start to finish with fast turn around time and no issues. High quality merchandise and high quality work. Couldnt be easier. ", "rating": 5}, {"title": "Won’t go anywhere else.", "text": "Date of experience: October 13, 2024", "rating": 5}, {"title": "Great products", "text": "Great products, easy to order, guaranteed satisfaction.", "rating": 5}, {"title": "Timely and correct!", "text": "Date of experience: October 13, 2024", "rating": 5}, {"title": "Excellent Customer Service!", "text": "There were a few issues with how the logo came out and Queensboro made it right! Excellent customer service!", "rating": 5}, {"title": "Very pleased ", "text": "Quality shirts, outstanding job on the logos, fast delivery, and all at an excellent price. Very satisfied. ", "rating": 5}, {"title": "Really an amazing company all around", "text": "Really an amazing company all around. Could spend all day harping on not only my experience, but ways this company should be the model for everyone else out there. Great customer service, great product, quick turn around time, and nice people. They have earned by business, and I will vouch for yours.  ", "rating": 5}, {"title": "Company delivers", "text": "Company delivers. Trust the Queen!", "rating": 5}, {"title": "Phenomenal products and even better…", "text": "Phenomenal products and even better customer service ", "rating": 5}, {"title": "Excellent product", "text": "Excellent product and price is great. Easy to set up image and timely delivery. Color selection was a hit with our club. Customer service was very helpful in setting up image and getting a better price. Embroidered colors are a  match to our current patch. ", "rating": 5}, {"title": "Great", "text": "The greatest ", "rating": 5}, {"title": "As always the quality was great", "text": "As always the quality was great. The workmanship flawless and delivered as promised at time requested. Wouldn’t go anywhere else. ", "rating": 5}, {"title": "Small business Friendly ", "text": "Having quality logo wear can really help in promoting brand awareness and creating a professional image. Since Queensboro offers no minimum deals, it allows me to get the custom items we need without having to purchase in bulk.  ", "rating": 5}, {"title": "Absolutely perfect- fast and easy", "text": "Absolutely perfect- fast and easy. Very responsive team. ", "rating": 5}, {"title": "the kind remake of my work shirts", "text": "the kind remake of my work shirts. I am blown away by the thoughtfulness of how your company responded. Thank you again because I have needed work shirts for so long and I am pleased you guys put your best foot forward and made everything perfect. ", "rating": 5}, {"title": "This company goes out of its way to…", "text": "This company goes out of its way to make things right!", "rating": 5}, {"title": "I love the quality of the shirts and…", "text": "I love the quality of the shirts and the embroidery services. Queensboro has always been very responsive with ensuring all orders are perfect. I am a repeat customer. ", "rating": 5}, {"title": "Love my hats and hoodie", "text": "Love my hats and hoodie.  They all came out great!! Thank you", "rating": 5}, {"title": "Great option for small companies.", "text": "Queensboro is great for small businesses. They offer a level of customization that allows us to get what each of our employees wants (without having to order a thousand of each style). They communicate well and deliver quality workmanship at a fair price. What else could you want?", "rating": 5}, {"title": "Great Customer Support ", "text": "High-quality products with great customer service. I had a problem receiving my order from UPS because they delivered it to the wrong town. The address was filled out correctly, but UPS just delivered it to the wrong address ( actually the wrong nearby town) Anthony with Customer service got on the phone with UPS and quickly figured out what the problem was and had it redirected to me. ", "rating": 5}, {"title": "Customer support A+A+A+", "text": "Needed customer support and they were awesome in helping me.", "rating": 5}, {"title": "Caring and Quick Service", "text": "My experience was great--the quality of the product is wonderful and your quickness in delivery and with the small issue I had was very kind and over and above--very happy with your products! Thank you!", "rating": 5}, {"title": "I loved the terrific special price…", "text": "I loved the terrific special price offered on our sweat shirts. The ease of ordering the colors and sizes plus getting the quality we have continued to get from Queensboro made the whole experience exceptional. ", "rating": 5}, {"title": "Great from the start", "text": "Great from the start, came out exactly as I hoped it would, quick to receive and nice quality to fit my self and business sense and moto of providing quality service and quality workmanship. ", "rating": 5}, {"title": "Excellent customer service ", "text": "Excellent customer service , I had an issue with my original order which was handled immediately.  Thanks so much again. ", "rating": 5}, {"title": "Excellent service and final order.", "text": "Date of experience: October 10, 2024", "rating": 5}, {"title": "Genuine and accurate ", "text": "Trustworthy ", "rating": 5}, {"title": "Queensboro", "text": "Queensboro, products and service is always great! ", "rating": 5}, {"title": "Great people who are doing a Great job.", "text": "Date of experience: October 09, 2024", "rating": 5}, {"title": "No issues just wish shirt was a real…", "text": "No issues just wish shirt was a real dri fit", "rating": 5}, {"title": "Great experience ", "text": "Product was as ordered. It was completed just asd you said it would be.", "rating": 5}, {"title": "Easy to order", "text": "Easy to order, prices were great and great quality.", "rating": 5}, {"title": "It was Great", "text": "It was Great!  Just as requested.", "rating": 5}, {"title": "I have to admit", "text": "I have to admit, when the proof of the art was send to me, it didn't look great but when I received the merchandise, it looked GREAT! Thank you very much! ", "rating": 5}, {"title": "Great service and product ", "text": "Excellent customer service. Great prices and quality. ", "rating": 5}, {"title": "They were amazing", "text": "They were amazing.  They even replaced a shirt that I ordered with the wrong size.  Nobody else would do that.", "rating": 5}, {"title": "Perfect ", "text": "As usual, your product is perfect ", "rating": 5}, {"title": "Best Customer Service ", "text": "Always great customer service when you order from Queensboro. Product quality is great!", "rating": 5}, {"title": "3X Fits Great! ", "text": "I'm a bigger guy and usually have trouble finding 3X professionally embroidered t-shirts that fit. Usually they are either too tight or too short. So I was pleasantly surprised to get my shirts and try them on. They fit me well in both directions. Oh, and the embroidery is perfect. Thanks Queensboro! ", "rating": 5}, {"title": "Great folks to work with", "text": "Great folks to work with, quailty is top notch", "rating": 5}, {"title": "Turn around time", "text": "Date of experience: October 08, 2024", "rating": 5}, {"title": "Thanks for a great shirt and logo for…", "text": "Thanks for a great shirt and logo for an unbelievable price!Great communication and fast shipping. ", "rating": 5}, {"title": "Quality Performance", "text": "When ordering I received the design as I personalized it along with the right size/grade, the product was placed at the optimal location and the shipment went smoothly from the day of production, A of quality", "rating": 5}, {"title": "Testing Queensboro Quality", "text": "I ordered one embroided hat to test the quality and it came out stunning! I got a deal that costed me only $5 for the hat. I will definitely be ordering bulk for my business.", "rating": 5}, {"title": "It's very easy to place an order and…", "text": "It's very easy to place an order and they keep you a prize of progress very well", "rating": 5}, {"title": "Quality merchandise with a guarantee to…", "text": "Quality merchandise with a guarantee to back it up.", "rating": 5}, {"title": "Quality product that meets my request exactly   ", "text": "Quality product that meets the specifics requested and delivered in a timely manner. ", "rating": 5}, {"title": "Outstanding customer service", "text": "First order colors came wrong. They immediately corrected the issue.", "rating": 5}, {"title": "So well done", "text": "So well done! I love it!! Will be ordering again!", "rating": 5}, {"title": "Top quality", "text": "Top quality ", "rating": 5}, {"title": "Great job with the shirt ", "text": "Great job with the shirt , they look amazing ", "rating": 5}, {"title": "Delivery on time.", "text": "Delivery on time.Great quality productI have not been let down yet!!!!", "rating": 5}, {"title": "Great customer service!!", "text": "Date of experience: October 07, 2024", "rating": 5}, {"title": "Queensboro went above and beyond", "text": "Queensboro went above and beyond expectations when dealing with a sizing issue (my mistake).  They replaced the items without question even though I said it was not necessary. This is the type of company that has old fashioned standards and really puts the customer first.  Wonderful company! Wonderful products!", "rating": 5}, {"title": "Just in time", "text": "I uploaded my logo and ordered hats and shirts, I received them in just one week, we had planned to not having them for our first big opening but we got them the day before and the employees were able to represent and they did it so well!!", "rating": 5}, {"title": "Excellent service and work.", "text": "Date of experience: October 07, 2024", "rating": 5}, {"title": "Excellent customer service", "text": "Had issues with a couple of shirts. They took care of them immediately, no questions asked. Great company to work with!", "rating": 5}, {"title": "Amazing customer service", "text": "With my first order, a few of the items didn't fit quite how I wanted them to. After a quick refund, my next order was perfect. ", "rating": 5}, {"title": "Life happens...I made a mistake and…", "text": "Life happens...I made a mistake and Queensboro did not squabble about fault and blame...they just remade 2 shirts.  I will ALWAYS use Queensboro for anything embroidery!", "rating": 5}, {"title": "The best company!!", "text": "Date of experience: October 07, 2024", "rating": 5}, {"title": "My hat turned out great!!", "text": "My hat turned out great!!! Thanks ", "rating": 5}, {"title": "Replacement shirts were perfect", "text": "Replacement shirts were perfect; thanks for taking such good care of our order.", "rating": 5}, {"title": "Spectacular!!", "text": "Spectacular!!! They took very good care of. I am a customer of over 10 years.", "rating": 5}, {"title": "It came earlier than expected", "text": "Date of experience: October 07, 2024", "rating": 5}, {"title": "I had an initial problem with my order…", "text": "I had an initial problem with my order and your staff was quick to resolve a reprint the order.  I am very thankful for you doing the right thing.  Will definately continue to order my items from Queensboro. Thank you", "rating": 5}, {"title": "My go to company for all my business…", "text": "My go to company for all my business apparel. The stitching and colors are always top notch. I even like they offer Carharrt.", "rating": 5}, {"title": "Great as always!", "text": "Date of experience: October 06, 2024", "rating": 5}, {"title": "Super great service for a long time customer", "text": "I've used Queensboro for supplying multiple marketing requirements - they've always been super helpful, the quality has always been great, and their customer service is legendary.  A past order had an irregularity in one of the shirts - and they stepped up - and replaced the shirt immediately and no questions asked.  I couldn't be more pleased and would highly recommend Queensboro for any marketing or vendor-ware requirements you may have.", "rating": 5}, {"title": "Yet another great order", "text": "Yet another great order. Thank you for the good work and efficient service. ", "rating": 5}, {"title": "been using these guys since 2014", "text": "Date of experience: October 06, 2024", "rating": 5}, {"title": "Always spot on with the logo", "text": "Date of experience: October 06, 2024", "rating": 5}, {"title": "They fixed my order and I was able to…", "text": "They fixed my order and I was able to receive winter jackets in a timely manner for my main guys", "rating": 5}, {"title": "I really like the shirts.", "text": "Always have had a positive experience with Queensboro.The company logo on the shirts are perfect.", "rating": 5}, {"title": "Great quality & customer experience ", "text": "Great quality, fast shipping and wonderfulCustomer experience ", "rating": 5}, {"title": "We love your workmanship and quality of…", "text": "We love your workmanship and quality of your products—it’s truly 5STAR and what brought us to Queensboro. That being said, it’s your continued customer care that brings us back again and again. ", "rating": 5}, {"title": "They always hit a home run with my…", "text": "They always hit a home run with my company shirts! ", "rating": 5}, {"title": "Our church has ordered from Queensboro…", "text": "Our church has ordered from Queensboro several times.  They always produce a quality product and delivers to our expectation.  Thanks Queensboro for being a great company to do business with.", "rating": 5}, {"title": "Always nice shirts and hats at a very…", "text": "Always nice shirts and hats at a very competitive price. The last batch of ladies' polos I got fit excellently. ", "rating": 5}, {"title": "It what I wanted and expected", "text": "Date of experience: October 05, 2024", "rating": 5}, {"title": "Good quality", "text": "Date of experience: October 05, 2024", "rating": 5}, {"title": "Great turn around time", "text": "Great turn around time. Thanks for correcting my order.", "rating": 5}, {"title": "I would use them again and again…", "text": "I would use them again and again everything was perfect ", "rating": 5}, {"title": "Service rep had the flexibility to help…", "text": "Service rep had the flexibility to help with Disciunt pricing... made it possible to place the order", "rating": 5}, {"title": "Thank you so much for fixing my mistake…", "text": "Thank you so much for fixing my mistake of ordering the wrong size! You guys rock I will always order my gear from you. ", "rating": 5}, {"title": "Perfect polo", "text": "Perfect polo, great quality ", "rating": 5}, {"title": "Perfect!!!", "text": "Date of experience: October 05, 2024", "rating": 5}, {"title": "Amazing service", "text": "Amazing service, quality, and speed! Always coming back for my custom apparel needs.", "rating": 5}, {"title": "I trusted the Queen and was pleased!", "text": "The communication with Queensboro was seamless. The attention to detail was great, and their desire to please the customer is something not seen too often in today's world.  The products were quality and I am very pleased to have found this company.  Trust the Queen is not just a motto. It is the truth.  ", "rating": 5}, {"title": "They tracked down the brand shirt that…", "text": "They tracked down the brand shirt that I had ordered 5+ years ago. Great job", "rating": 5}, {"title": "Easy and painless experience", "text": "Easy and painless experience. Also very fast response and shipment. That’s why I keep coming back as a customer. .", "rating": 5}, {"title": "The shirts look great and customer…", "text": "The shirts look great and customer service is outstanding ", "rating": 5}, {"title": "Great Job", "text": "Product is exactly what I needed and I was informed of it's status as the order was being processed. ", "rating": 5}, {"title": "Good quality ", "text": "Good quality and fast service ", "rating": 5}, {"title": "Easy to order", "text": "Easy to order. Quick delivery. Excellent quality! Highly recommend!", "rating": 5}, {"title": "Customer service is great", "text": "Customer service is great. Products and designs are great.  ", "rating": 5}, {"title": "Always excellent service", "text": "Date of experience: October 04, 2024", "rating": 5}, {"title": "Impressive First Order", "text": "Very impressed with the quality and the details of the embroidery! Will continue to order from Queensboro for our future needs.", "rating": 5}, {"title": "Great prices", "text": "Great prices, keeps you updated on your orders and great results", "rating": 5}, {"title": "The best company to purchase your…", "text": "The best company to purchase your embroidery  items from. Amazing customer service.  Highly recommend.", "rating": 5}, {"title": "Great product", "text": "Great product! Super service. Love your company. ", "rating": 5}, {"title": "Amazing! ", "text": "Queensboro is amazing! You can always find high-quality products within different price ranges, so it fits all budgets. They ship quickly, and the orders are always packed nicely so they arrive in tact. For the past year and a half I’ve ordered quite a few products for our employees and not once have I had an issue with any of them. Customer service is very responsive. They take care of any issue quickly and effectively. I highly recommend them! ", "rating": 5}, {"title": "Excellent as always", "text": "Excellent as always!  Our logo is on file,  I ordered several shirts on line for new and existing employees and everything came in on schedule and exactly as expected.   Another five star performance.", "rating": 5}, {"title": "Quality products", "text": "Quality products, great website, excellent communication before, during and after the order. ", "rating": 5}, {"title": "Queensboro always delivers!", "text": "Queensboro always does beautiful work! Outstanding products at great prices!", "rating": 5}, {"title": "Replaced order with instantly", "text": "Order didn’t fit well but Kaitlin was gracious enough to correct and replace the order within 5 days. ", "rating": 5}, {"title": "Everything was as I ordered it ", "text": "Everything was as I ordered it . Embroidery was great", "rating": 5}, {"title": "First order was my mistake. ", "text": "When I placed my first order for sweatshirts, I ordered them in x-large. I received my order and tried on the sweatshirts, they were definitely too big. I needed to place another order this time in large. The first order of x-large was a mistake on my part. Your customer service re-ordered by sweatshirts in large and would not accept my money for the re-order even though it was my mistake and not yours. ", "rating": 5}, {"title": "Shirts are high quailty and delivery…", "text": "Shirts are high quailty and delivery was ahead of schedule. They deliver more than what they promise.", "rating": 5}, {"title": "Never Disappointed!", "text": "I honestly don't know how many times I've ordered from Queensboro for the company I work for and now my husband's business, but I am NEVER disappointed!!", "rating": 5}, {"title": "Queensboro is the way to go!", "text": "I have always had a good experience with Queensboro. If a mistake was made or an item of less favorable quality,  Queensboro made it right.My last order was a crunch order. I had less than two weeks to have attire for new staff for a less minute wedding and reception. Queensboro made no promise of guarantee,  however they met my deadline by two days! Only at Queensboro! Thank you for standing behind your work and customer service.", "rating": 5}, {"title": "Great customer service!!", "text": "Great customer service!!! They are always responsive and understanding our the customer's needs. Thank you for a great experience!", "rating": 5}, {"title": "Great company with one of the best…", "text": "Great company with one of the best services, i have ever seen!", "rating": 5}, {"title": "Quality product and quick turn around…", "text": "Quality product and quick turn around time. ", "rating": 5}, {"title": "Queensboro always delivers!!", "text": "Queensboro always delivers!!!  Super smooth.  Already have my next order in!", "rating": 5}, {"title": "The sweatshirts look great", "text": "The sweatshirts look great!  The embroidery looks great.  Can't wait til cool weather to wear it!One suggestion, maybe offer the logo be full front.  I'm sure the cost would be overwhelming, but maybe you could offer something similar.Great products and great customer service.  Will be doing more business with you!", "rating": 5}, {"title": "Awesome product always comes through…", "text": "Awesome product always comes through for my needs..", "rating": 5}, {"title": "No surprises", "text": "No surprises. Everything came as requested and, in the timeframe promised. Thank you Queensboro, for a job well done. ", "rating": 5}, {"title": "Outstanding craftsmanship", "text": "Outstanding craftsmanship. Good pricing. Quick turnaround.", "rating": 5}, {"title": "Everything abt my order went smooth", "text": "Everything abt my order went smooth. The product is exactly as ordered. ", "rating": 5}, {"title": "Always excellent and great quality", "text": "Date of experience: October 02, 2024", "rating": 5}, {"title": "Great Service ", "text": "This was a seamless no issues order… very simple to do business with, product arrived and looks exactly as ordered… would recommend them highly ", "rating": 5}, {"title": "Product was very good and the service…", "text": "Product was very good and the service was very fast.", "rating": 5}, {"title": "My order was as expected", "text": "My order was as expected. I am a repeat customer because every time I get an order from you it is what I expected", "rating": 5}, {"title": "Quality items and Great customer service!", "text": "In all of the embroidered items I have purchased from Queensboro, I have only have an issue with a couple of the orders. A recent order had one shirt that was not \"perfect\", but they are always quick to respond and replace any item that has an issue. Their customer service is top notch. ", "rating": 5}, {"title": "Great Quality Shirts and the logo…", "text": "Great Quality Shirts and the logo embroidered look nice and clean , thanks Queensboro !!!", "rating": 5}, {"title": "Excellent all the way around", "text": "My experience when dealing with Queensboro has always been first class: from online ordering, to on time delivery, to quality clothing items, and perfect embroidery, and finally to customer service. ", "rating": 5}, {"title": "Happy", "text": "I am very satisfied with the product, communication and shipment.", "rating": 5}, {"title": "Super!", "text": "The order process is easy, the quality is great, and the production time was good.", "rating": 5}, {"title": "Love the colors !", "text": "Perfect as usual ", "rating": 5}, {"title": "We had a hiccup with the advertising…", "text": "We had a hiccup with the advertising but the queensboro team made it right. Thank you. ", "rating": 5}, {"title": "Always excellent Thank you", "text": "Date of experience: October 02, 2024", "rating": 5}, {"title": "Best work ever! ", "text": "Easy to setup and order a product. I love the great work. It looks readily nice! Thank you. 🌻", "rating": 5}, {"title": "great service", "text": "great service and products.  nice embroidery and the customer service is very responsive and helpful!", "rating": 5}, {"title": "Beautiful products each with a unique…", "text": "Beautiful products each with a unique design which came out wonderful. It takes a bit longer but worth it", "rating": 5}, {"title": "Your team is excellent", "text": "Your team is excellent; especially Adaire!!  She is always very friendly, easy to work with, and gets things done.  Wish I had her on my team.", "rating": 5}, {"title": "great communication", "text": "great communicationquality products", "rating": 5}, {"title": "Great product. Sale price and free shipping!", "text": "Great product... sale price and free shipping i just couldn't resist.", "rating": 5}, {"title": "Shirt turned out very good", "text": "Shirt turned out very good. Happy with product ", "rating": 5}, {"title": "Very positive experience with staff", "text": "We had to order two extra shirts after the fact and the gentleman who worked with us was very accommodating! ", "rating": 5}, {"title": "What an amazing company!", "text": "What an amazing company.  Product is great but the customer service is even better.  I have purchased products for several years and will continue as this company is second to none when it comes to taking care of its clients.  ", "rating": 5}, {"title": "Fast", "text": "Fast, great customer service. ", "rating": 5}, {"title": "Great Quality fast turnaround on…", "text": "Great Quality fast turnaround on shipping and excellent customer service ", "rating": 5}, {"title": "First class product.", "text": "Date of experience: September 30, 2024", "rating": 5}, {"title": "Everything went well", "text": "Everything went well. Our questions were answered, and the product is excellent.", "rating": 5}, {"title": "I am a big fan of Queensboro", "text": "I am a big fan of Queensboro! I had some polo shirts made for my new digital marketing agency. They sent me what I ordered, but the colors of the threads didn’t look great against the background color of the fabric, and extra large size was too big for me, so Queensboro redid the shirts in the rrvised colors and printed them on size large. I am perfectly happy with the final result! Then, I ordered some embroidered ball caps as giveaway items. Can’t wait for them to arrive!", "rating": 5}, {"title": "Satisfied", "text": "Turnaround time and quality is prefect just what we were looking for", "rating": 5}, {"title": "Great job.My shirt came out perfectly.I…", "text": "Great job.My shirt came out perfectly.I will be ordering more", "rating": 5}, {"title": "Great company!", "text": "Best customer service that I have dealt with in a long time. No problems with getting something taken care of if it is wrong. But that's the other thing, they are good at what they do, the only problem I have ever had has been sizing. They even took care of that at their expense. Great company of people caring about what they do.", "rating": 5}, {"title": "My shirts were made to perfection", "text": "My shirts were made to perfection, every detail was spot on, would definitely used them on my next order", "rating": 5}, {"title": "Custom Polo w/logo", "text": "The process to order and get your custom design was an easy task.  The shirt quality is great. The embroidery was flawless.  The only regret that i have about my order, is that I only shared and image of the design that I wanted instead of the actual digitized logo that I paid to have done. But Queensboro nailed the assignment.I highly recommend them for your needs.  I willDefinitely be a returning customer ", "rating": 5}, {"title": "Quality of product exceeded first  my…", "text": "Quality of product exceeded my expectations ", "rating": 5}, {"title": "Very detailed and great product at a…", "text": "Very detailed and great product at a great price", "rating": 5}, {"title": "My 1 Stop Shop", "text": "The quality of the clothing and embroidery work is so perfect, my wardrobe is slowly becoming an exclusive Queensboro wardrobe!Next on my wishlist ...... a Fall Jacket.", "rating": 5}, {"title": "Been using Queensboro for years", "text": "Been using Queensboro for years. Always perfect.", "rating": 5}, {"title": "Wonderful product at a perfect price…", "text": "The product was perfect at a wonderful price! I may be re-ordering the same hats given the high quality material.", "rating": 5}, {"title": "Excellent customer service", "text": "Excellent customer service! I will back for future purchases and will definitely refer others! ", "rating": 5}, {"title": "I love the quality of everything I have…", "text": "I love the quality of everything I have ever ordered from Queensboro (and I've ordered a lot!), and I especially like their 100% guarantee.  I ordered a jacket that ended up being too large, and immediately they sent out a new one the right size, and did not require that I send the first one back.  So I was able to donate the first jacket to someone in need in my own community.  Their customer service is without equal.", "rating": 5}, {"title": "RRRBBQ Loves Queensboro!", "text": "The website is so easy to use, and our hoodies are perfect!", "rating": 5}, {"title": "We placed our second order", "text": "We placed our second order, we love Queensboro both for the quality of their products and for their great customer service, too!", "rating": 5}, {"title": "Product and quality is fantastic! I got my shirts well before the expected date! ", "text": "Product and quality is fantastic ", "rating": 5}, {"title": "Great place to shop", "text": "Great place to shop. Great prices and service. I had size problem(my fault) but still they shipped out a free replacement.", "rating": 5}, {"title": "Exceeded expectations ", "text": "I have to say customer service went ABOVE and BEYOND and exceeded my expectations.  They have excellent communication and promptly addressed any questions or concerns, providing a stellar resolution. They truly live up to their motto. ", "rating": 5}, {"title": "I was very appreciative about ordering with everything being online and so reasonably priced. It was actually very easy to order and their communication through the process was great!", "text": "I was very appreciative about ", "rating": 5}, {"title": "Evolution", "text": "Great product. Great value. Fast turnaround. 100%", "rating": 5}, {"title": "My experience was perfect", "text": "My experience was perfect!  Customer service was excellent!  My only issue was the size of the shirt, I ordered a 2x and the fit was somewhat tight.  I will probably order in men’s size my next go around.  Other than that I am extremely pleased with both products and will definitely order again in the future.", "rating": 5}, {"title": " perfection", "text": "It's always great and to perfection, that's why I always go to the Queen. Keep up the great work.", "rating": 5}, {"title": "As always", "text": "As always, customer service!", "rating": 5}, {"title": "The best customer service ever !", "text": "Date of experience: September 28, 2024", "rating": 5}, {"title": "Perfect job", "text": "Perfect job, no drama, totally boring!", "rating": 5}, {"title": "Wonder customer service", "text": "Wonder customer service, Quality control is superior and spot on. Delivery is fast and easy to track.Can’t wait for my next order to arrive!Thank you ", "rating": 5}, {"title": "Great company ,Fixed my mess up in a…", "text": "Great company ,Fixed my mess up in a short time.  Very helpful, will be using the Queen every time.", "rating": 5}, {"title": "Quick order and shipping ", "text": "Quick order processing, and quick shipping! ", "rating": 5}, {"title": "Thank you again", "text": "Thank you again. Everything perfect! ", "rating": 5}, {"title": "Amazing customer service", "text": "Amazing customer service. Our first order sizes were too small. They corrected the order and reshipped.  Will be ordering again soon. ", "rating": 5}, {"title": "Excellent!!", "text": "Quality and offers. ", "rating": 5}, {"title": "They really go the second mile in customer service", "text": "This company really goes the second mile in customer service. We received our shirts in great order. They were perfect!", "rating": 5}, {"title": "Great correspondence!!", "text": "Great correspondence!!! Thank you!!", "rating": 5}, {"title": "Tried working with another company but…", "text": "Tried working with another company but since I ama one person company,they didn’t want my business.  Queensboro  made me feel like a big company with their excellent customer service. I highly recommend.", "rating": 5}, {"title": "Everything from the website layout to…", "text": "Everything from the website layout to the production and shipping notifications, and most importantly for a small business- the pricing.  Queensboro’s a tough act to beat.  We will absolutely be ordering from Queensboro again!", "rating": 5}, {"title": "great polo!", "text": "My polo was fantastic!", "rating": 5}, {"title": "I can’t say enough good about my 1st purchase", "text": "I was impressed at the ease of ordering, turn around time, and product appearance. I also like how you can change the logo colors at the review time that way if I order some different colored shirts that clash with the original thread, I will have the option to modify.", "rating": 5}, {"title": "This is my second time using…", "text": "This is my second time using Queensboro. They are fantastic, easy to use and order, and the product was perfect both time.", "rating": 5}, {"title": "Above and Beyond!!!", "text": "I have ordered many times with Queensboro and they have always been amazing.  I tried a new product and it didn't turn out as hoped.  The incredible people at Queensboro stepped in and fixed the issue immediately.  They went above and beyond what I think any other company would do.  Very pleased with the final product and most impressed with the level of service and care they put into their business and their customers.  I recommend Queensboro to everyone.  ", "rating": 5}, {"title": "A very simple and seamless ordering…", "text": "A very simple and seamless ordering process with an extremely fast production time. Very pleased since we give these hats away directly to doctors and patients the cost was excellent. Thanks", "rating": 5}, {"title": "Great Quality", "text": "I am very pleased with the quality of the shirts I ordered and the workmanship of the embroidery.  ", "rating": 5}, {"title": "Great quality and prompt responses from…", "text": "Great quality and prompt responses from their team. Thank you!", "rating": 5}, {"title": "Great quality of shirts and bags", "text": "Great quality of shirts and bags.  These make perfect gifts.  Fast shipping and great communication.", "rating": 5}, {"title": "Glad I found this company- as a small…", "text": "Glad I found this company- as a small business owner I am on a tight budget and their products are amazingly affordable and great quality ", "rating": 5}, {"title": "Top notch company!", "text": "Top notch company!!   Never disappointed. ", "rating": 5}, {"title": "Their customer service.", "text": "Date of experience: September 25, 2024", "rating": 5}, {"title": "Great quality and they have certainly…", "text": "Great quality and they have certainly sped up their process in getting your stuff done. Plus I love the fact we don’t have to order a minimum of four items now.", "rating": 5}, {"title": "One of the cleanest designs yet on a…", "text": "One of the cleanest designs yet on a polo ", "rating": 5}, {"title": "Smooth ordering process and order…", "text": "Smooth ordering process and order arrived during the stated time frame. Logo looks good on the shirts.", "rating": 5}, {"title": "The communication is excellent!", "text": "The communication is excellent!Very helpful, in helping me order.And the items came out great! Also love all the deals they constantly offer!!! It’s getting cold, and my husband is ready to order some hoodies and jackets! Great company! We’ll be using them and sharing them with other companies we know!", "rating": 5}, {"title": "My order was exactly what I had expected", "text": "Date of experience: September 25, 2024", "rating": 5}, {"title": "I am very happy with my order from…", "text": "I am very happy with my order from Queensboro. The shirts and hats turned out far better than expected. Moreover, its prices are far more reasonable than the competition.  I will definitely be submitting another order soon. ", "rating": 5}, {"title": "Great working with Anthony on the Grande Dunes Bocce Club Order", "text": "I have been working with Anthony on this order for the Grande Dunes Bocce Club in Myrtle Beach, SC. He has promptly answered all of my questions.We aim to present the following items to the membership: polo shirts, twill hats, visors, beanies, and fleece jackets.Our first task was to find the perfect logo. The original design did not work out because the design was too intricate, making the circular logo too small. The remedy was to use a text logo that is easy to read. After a couple of iterations, the shirt and hat colors were selected as green and red. The white embroidery clearly defines the Grande Dunes Bocce Club.We look forward to working with Anthony and submitting more orders soon.Joe", "rating": 5}, {"title": "They always insure the product meets my…", "text": "They always insure the product meets my expectations. ", "rating": 5}, {"title": "Great Product and Great Customer Service", "text": "We have placed a number of orders for my staff. Communication and customer service are excellent. Very responsive and professional. We are treated as a valued customer. Products are always reasonably priced and they stand behind them 100% always ready to correct any problem with no exceptions. We will continue to purchase from Queensboro and look forward to a long standing relationship. Thanks and keep up the great work!! ", "rating": 5}, {"title": "Spent a little extra money to get Bella…", "text": "Spent a little extra money to get Bella Canvas and Next Level shirts. The feel and fit of them is much smoother and fits well with my style.This was a test order for DTF printing. I tried a color design and a black and white design and a new, one color logo.All my designs came out sharp and clear and true to my vision.Like a shirt I received at the Haiku North America conference in Cincinnati last year, at first the full front and full back designs feel a little heavy and stiff.That shirt softened up nicely after a few washes, and I’m sure these will as well.Placing this order was convenient. I did it one session and didn’t need any assistance from Queensboro staff.So, for my needs, yes, the order was perfect.", "rating": 5}, {"title": "The product was perfect", "text": "The product was perfect. They brought my bakery logo to life, and did it well before the deadline they have themselves!", "rating": 5}, {"title": "The customer service is great as always.", "text": "Date of experience: September 25, 2024", "rating": 5}, {"title": "Perfection ", "text": "Excellent: Pricing, Quality and Appearance with every order. Thanks for always providing my company work attire above my expectations. ", "rating": 5}, {"title": "I was taken aback by the customer…", "text": "I was taken aback by the customer service  they responded quickly corrected the issue  and the quality of the work was superb.  For my company there will be no other printing company", "rating": 5}, {"title": "Great product very clean Highly recommend", "text": "Awesome company to do business with very professional clean", "rating": 5}, {"title": "Your customer service is stellar", "text": "Your customer service is stellar. Just recommended my employer to you for a bunch of shirts, etc.", "rating": 5}, {"title": "Great Service!", "text": "I try my best to provide great service to all my patients. It is nice to see an organization like Queensboro who tries its best to provide the same service that I try to instill in my business everyday! No redundant questions asked and needless info needed. Did it work or not? Does it fit? Are you happy with your purchase? The answer is YES every time! I love the fact that they follow up as it should be. Great job! ", "rating": 5}, {"title": "Great work for great price", "text": "Great work for great price. Thank you ", "rating": 5}, {"title": "Called for a bigger size shirt", "text": "Called for a bigger size shirt. The new order was just perfect. Thank you. ", "rating": 5}, {"title": "Amazing service", "text": "Amazing service ", "rating": 5}, {"title": "Amazing work", "text": "Amazing work, excellent attention, and the best customer service ever!! Thank you! ", "rating": 5}, {"title": "Easy to use website and ordering", "text": "Easy to use website and ordering ", "rating": 5}, {"title": "Great products and great customer…", "text": "Great products and great customer service. They go above and beyond to make sure everything is perfect!", "rating": 5}, {"title": "Super happy with my experience", "text": "Super happy with my experience. I had forwarded a picture for our logo that I couldn’t alter, but the Queensboro team quickly leveraged their photoshop skills and allowed me to change the thread colors of certain aspects of the logo based on the color of shirt/hat it was being embroidered on. The hats and shirts turned out AMAZING. Thanks folks. As we grow, we will be coming back for more. . ", "rating": 5}, {"title": "Great service.", "text": "Great service. ", "rating": 5}, {"title": "Love their products and service", "text": "I have been using Queensboro for the last year and a half and I love their products, customer service, and the prices when they have specials. ", "rating": 5}, {"title": "Great products superior customer service", "text": "Date of experience: September 24, 2024", "rating": 5}, {"title": "No need to go broke to look professional", "text": "Great quality and selection. I'm not a big organization with a huge budget for apparel and Queensboro put professional branded attire within my reach and helped immediately boost my confidence in being in business for myself as opposed to putting myself in massive debt with huge order minimums that I would have to dig out of before feeling good about my purchase.  I have ordered product from Queensboro for a few years and only once had a mistake that was more so an error of understanding on my part and they stepped up and made it right with no hassle. ", "rating": 5}, {"title": "Love these guys", "text": "Love these guys, great prices and top quality", "rating": 5}, {"title": "Great customer service from Adaire", "text": "Adaire is the perfect manager of our account. Always goes above and beyond! ", "rating": 5}, {"title": "Looks great", "text": "Looks great! Easy process. Quick turn around", "rating": 5}, {"title": "Great place", "text": "Great place, I love it", "rating": 5}, {"title": "Easy, amazing selections, and great service.", "text": "It was so easy to order custom items with the logo already saved in your database.  And the selection of shirts and other items is just amazing.  I was also happy with the time it took to make the custom items and ship them to me.  One more thing I thought was great--your communication.  I always knew where we were in the process.  Thanks so much.", "rating": 5}, {"title": "Was very streamlined", "text": "Was very streamlined, customer service reached out to me to ask if I needed any help without me even asking. The products I received were well worth the price that I paid and I did not have to wait long at all. I would highly recommend Queensboro to anyone who needs embroidery or similar work done at a great price.", "rating": 5}, {"title": "Man I just love my shirt", "text": "Man I just love my shirt ", "rating": 5}, {"title": "Items were easy to order", "text": "Items were easy to order. This was a replacement order for items I’ve used before just different sizes.", "rating": 5}, {"title": "Like always on time", "text": "Like always on time, and no errors", "rating": 5}, {"title": "Performance shirts for the french horn ensemble", "text": "I order shirts for my french horn ensemble members every year from Queensboro. The customer service is excellent and I am able to get high quality shirts for a very reasonable price for my students.", "rating": 5}, {"title": "Queensboro was easy to work with and…", "text": "Queensboro was easy to work with and the quality of the polo was great . I will definitely order more apparel from them again for my company. ", "rating": 5}, {"title": "Hats were done professionally", "text": "Hats were done professionally. One thing the positioning of my lettering-of the logo .I would have liked it to have been how I sent it to you. But. I understand there is not much room on a hat.", "rating": 5}, {"title": "Super easy to reorder", "text": "Super easy to reorder. Good quality products Alwawys good customer service.", "rating": 5}, {"title": "great as always Thanks ", "text": "great as always", "rating": 5}, {"title": "Items were of great quality description…", "text": "Items were of great quality description was spot on! ", "rating": 5}, {"title": "Happy return customer", "text": "Excellent products and workmanship with the embriodery of my logo. Consistent and quick. Thank you. A happy return customer.", "rating": 5}, {"title": "As advertised", "text": "Date of experience: September 22, 2024", "rating": 5}, {"title": "Great Job!", "text": "Great Job, will use again!", "rating": 5}, {"title": "Great service & products", "text": "Great service, good products. I know I can count on The Queen.", "rating": 5}, {"title": "Excellent job done quickly", "text": "Excellent job done quickly ", "rating": 5}, {"title": "Everything was great", "text": "Everything was great ", "rating": 5}, {"title": "Support staff is wonderful", "text": "Support staff is wonderful! Customer service is clearly a priority for Queensboro!", "rating": 5}, {"title": "Fast turnaround and high quality…", "text": "Fast turnaround and high quality merchandise.", "rating": 5}, {"title": "Great quality", "text": "Great quality, fast and beyond expectation.  Wow!  I could not be happier!", "rating": 5}, {"title": "I submitted a drawing and text for a…", "text": "I submitted a drawing and text for a polo shirt. The submission was good, but it would be great if it were larger. They sent me the enlarged embroidery at no additional cost, which is absolutely great.I will send these to guys I served with in the Marine Corps.Thank you, Queensboro. Great work.", "rating": 5}, {"title": "Shirts look great", "text": "Shirts look great. Would prefer to see what the logo would look like on the shirt before purchasing like Vista Print does. But the embroidery does look great. ", "rating": 5}, {"title": "Products arrived quickly", "text": "Products arrived quickly. Thank you", "rating": 5}, {"title": "Did a great job and will return. ", "text": "First shirt I ordered wasn't perfect but made good on 2nd. I love the shirt. Exactly what I was looking for and looks sharp. We will be returning for more gear. ", "rating": 5}, {"title": "Always Excellent", "text": "Timely, quality products.", "rating": 5}, {"title": "Great Period!", "text": "Great quality, communication, and cycle time.", "rating": 5}, {"title": "Great final product", "text": "Great final product, very satisfied with the embroidered design", "rating": 5}, {"title": "This is a amazing 😍", "text": "Date of experience: September 19, 2023", "rating": 5}, {"title": "Quality job", "text": "Quality job, quick response,easy to deal! ", "rating": 5}, {"title": "Great fit", "text": "Great fit, quality and pricing", "rating": 5}]