[{"title": "have not recieved the product yet BUT i…", "text": "have not recieved the product yet BUT i put in the wrong mailing addy.  i shot them an email immediately and they responded saying it's been shipped and to the right address!!!", "rating": 5}, {"title": "Long time satisfied customer. Appreciate the Military discount!!! ", "text": "Always have good service and advice from you!  69 years old. Kidney transplant patient. Helping me stay strong and active!  Appreciate other health info (anaerobic HIIT studies), and I ordered the Zinc Complex. I had been buying and trying to cycle 4 types of Zinc compounds.  The 7 complex is the answer. ", "rating": 5}, {"title": "Great customer service!", "text": "Great customer service. Prompt response. Top shelf quality ingredients.  Love Lost Empire Herbs. ❤️👍", "rating": 5}, {"title": "Excellent and speedy customer service…", "text": "Excellent and speedy customer service and shipping.  I will update my review once I receive and rest my product. ", "rating": 5}, {"title": "Quality products", "text": "Quality products, honest business practices and transparency, and everything j have tried has been excellent! ", "rating": 5}, {"title": "I knew what I was looking for.", "text": "I went onto your site and read the description for each project and purchased them. ", "rating": 5}, {"title": "1st Impressions are so important & you passed with flying colors!", "text": "I researched what I need to help my health issues and found your herbs to fill several of my needs. Your website was very informative and organized. I did take your quiz and it was very helpful. I look forward to using the products I ordered .", "rating": 5}, {"title": "Always great prices", "text": "Always great prices,  fast turn around time, fast and fair shipping, over all its an awesome company to do business with. ", "rating": 5}, {"title": "Made me a believer", "text": "All orders come in in a timely manner.  I was lacking energy so I thought I'd try your supplements a try.  My energy level has increased but now I have to figure out which ones I can do without because I tried a few different products.  I make myself a protein shake and drink it instead of a meal few times a week...seems to do the trick.", "rating": 5}, {"title": "Comprehending herbs and their true…", "text": "Comprehending herbs and their true effects can be a challenge, but over time I have learned that there is a lot of information linked to the various products so you can find out more about them on the fly. The shopping experience is fine, but I usually end up learning something each time.", "rating": 5}, {"title": "Lovin the pine pollen…I’m gettin back…", "text": "Lovin the pine pollen…I’m gettin back in the black ant soon. I’ll be back. ", "rating": 5}, {"title": "Web site easy to navigate, Great products.", "text": "Web site easy to navigate and order. Customer service, which I used a couple of times, had a quick response and very helpful. I love the Pine Pollen Tincture from Lost Empire and decided to try the capsules. I had been taking capsules I order from Amazon but decided to order Lost Empires capsules. From experience, I know Lost Empires will be a better product.   ", "rating": 5}, {"title": "I’m shocked at how quickly I felt results! ", "text": "I’m really impressed with my results. I had bloodwork and a urine test to see where my hormones were. I had been doing supplements from the doctor I was working with, but added in Pine Pollen tincture from Lost Empire Herbs and wow! I feel like I have more energy throughout my day, I sleep better at night, AND I wake up feeling like “my eyes are more open!” That fatigue fog hasn’t been around. I’m so thankful and bought a couple more bottles! ", "rating": 5}, {"title": "Easy ordering process", "text": "Easy ordering process, lots of accessable reviews.  Decent time from order to receipt of product.  Products have done very close to what description says.  Very happy with products received.", "rating": 5}, {"title": "Lost Empire Herbs provide great…", "text": "Lost Empire Herbs provide great products, and back them up with wonderful customer service! ", "rating": 5}, {"title": "Been taking Cistanche powder and pills…", "text": "Been taking Cistanche powder and pills now for several months . I can tell you that it works great! I have nothing but great things to say about Lost Empire Herbs! ", "rating": 5}, {"title": "go for the long haul with an integrative approach to health", "text": "I am 86, started to use various Lost Empire herbs soon after LE started.  A living entity is a too complex network with trillions of connections, to expect miracles from supplements, that happens only with pharma-'bombs' (at the expense of much collateral damage - therefore I never took these). That network  of us has to be overall healthy, to steer it to better performance with 'supplements' (or at my age to maintain health). So, I do since my early 50's on a daily basis: extensive exercise (not to grow muscles, but to keep the 'machinery' smooth incl. the brain) plus freshly cooked 'bio' meals, a very regular bedtime, and a goal in your life.  With this mindset & attitude, I find LE's herbs extremely helpful !! But I take also other specific supplements,  Moreover, living (as a foreigner) in the Swiss mountains (clean air and water from mountain sources), in the only country, where democracy is present between the ears of the people (I lived in the US and in 6 Eur. countries) makes its society highly attractive. In other words, be strategic, see the larger picture, act without hip-shooting, go for the long haul. Do also not get addicted to algorithms (I am an ex-Tech exec) & protocols. Pilots follow protocols, but, thanks God, also know how to fly (I hope).", "rating": 5}, {"title": "Shipping error promptly corrected ", "text": "I made a shipping error on my order. I wrote an email (Sunday night) and received a reply the next afternoon advising me that they would make the appropriate correction. Problem solved.", "rating": 5}, {"title": "Everything seems easy to understand…", "text": "Everything seems easy to understand prices a little higher that I liked but looks like good people to deal with", "rating": 5}, {"title": "Thank you LOST EMPIRE HERBS for your…", "text": "Thank you LOST EMPIRE HERBS for your great checkout page...very customer friendly to purchase and checkout...and Logan is very honest and knowledgeable in his description of the herbs...keep up the great service and i really like the idea that you also use the herbs yourself...Brenda.", "rating": 5}, {"title": "My transaction was fabulous", "text": "My transaction was fabulous. I read about you and your product on gab .com. Website worked well, and I had zero troubles ordering. Loved your \"try it out for .01 cents\" and we are excited to try your pine pollen! TY! ", "rating": 5}, {"title": "Received a quick return call from…", "text": "Received a quick return call from customer service, now just waiting on USPS tracking #. Will be looking for it today. Great herbs, thanks. ", "rating": 5}, {"title": "The company give a free ebook on herbs…", "text": "The company give a free ebook on herbs that they have and there use potential. Very helpful!", "rating": 5}, {"title": "I love the LEH company", "text": "I love the LEH company.  I have been purchasing from them quite a while and staying.  Their products are high quality and very potent (thank you Blue Vervain for blissful sleep) which makes purchases quite reasonable.  I love to read their blog which really helps me pick what is right for me at a given time.  Their ongoing integrity and professionalism has built a trust over time to buy most of my stuff from them.  I like their sales too :)  Please keep it going.  ", "rating": 5}, {"title": "Great product great description of…honest products", "text": "Great product great description of product   You can taste the difference. ", "rating": 5}, {"title": "I've ordered before", "text": "I've ordered before, I like the products and was just reordering.  The no cost pine pollen was a nice perk, as I have been using it and I like the results. ", "rating": 5}, {"title": "Pleasantly surprised how ez to rectify my mistake ", "text": "I accidentally placed my order twice, when I clicked on the email confirmation I was able to cancel the order right away. So easy & convenient. When I wrote to ask a question, the response was also timely. I chose this company for it’s good reviews, ratings, & quality of the pearl powder I wanted to try. I just ordered two more bags:) I add it to a night time drink I make with pure sleep, rose powder, B3, & oat milk. I also add this to the toothpaste I make & face cream. Wonderful company & products. ", "rating": 5}, {"title": "Reclaim Your Manhood", "text": "Respect due to Logan. This man, this company, this product....all FIRE. I'm a big fan of the liquid tincture version of Cistanche, it seems to work a bit better than the powder. You can't go wrong with either one, it comes down to what you respond to. Pine Pollen, another product that helps put the \"man\" in manhood. I don't know, is it mental? But sex is so much more intense sense I've began running with Lost Empire. Seems like pull-ups are a breeze. No issues at all with Lost Empire and their products. If you're smart, you best get down with this company. Derrick did.", "rating": 5}, {"title": "Great Products, Great information & Trustworthy", "text": "Great products with great information pages on everything. Fast shipping. Helpful emails with updates and new products and services. What's not to love?", "rating": 5}, {"title": "Great discounts and good information i…", "text": "Great discounts and good information i am 68 years young been customer for over 5yrs love products i am big on testosterone and male sexual health. Non smoker, drinker, and i am vegan please keep me on right way on being at my best JOHN WILLIAMS", "rating": 5}, {"title": "Lost Empire is always a learning experience …", "text": "So much valuable and interesting information on your website.  I love to go there and learn something, look around , and when it’s time to purchase, it’s fast , easy and fun ", "rating": 5}, {"title": "Happy with all ", "text": "I received support through email in regards to placing my order & was given 15% off. For whatever reason the system kept saying their was an error and later I got an email from lost empire and was able to complete it.", "rating": 5}, {"title": "Im a BIG fan…", "text": "I've been able to go on site and complete my order with no issues. In the past if I had an issue it was swiftly resolved. My packages have always been delivered within a weeks time . As I've stated before LEH has set a high standard and quickly show me how inferior other companies falter in customer service.  I'm a big fan .", "rating": 5}, {"title": "I have used your herbs for over a Decade…", "text": "I have used your herbs for over a decade when you were called Superman Herbs. (by the way, I feel Lost Empire is much more fitting).. I used the powder, and capsules and now only use the Spagyric tinctures..I am a senior female and trust Logan, his assistant, Callie, and his company implicitly. I have always been treated with respect and professionalism.. The glass tinctures are professionally wrapped and consistently shipped out promptly as well as phone calls are answered..They are like family! Gratefully, Dagny.", "rating": 5}, {"title": "You guys make me feel appreciated", "text": "You guys make me feel appreciated. Thank you for sending the product to such a quick period of time.  And thank you for acknowledging my loyalty.  Keep up the great work. Your products are fantastic.  ", "rating": 5}, {"title": "LEH is the best", "text": "LEH is the best, never doubt it. You've set the bar extremely high for any other companies that I deal with for any product. Can you imagine being a company and not providing a phone number, only an email  and then providing poor communication by not responding back. Well of  course you can't, as LEH provides total support to all their customers.  You are a class act that is greatly valued and appreciated.  ", "rating": 5}, {"title": "Lost empire herbs", "text": "This is bin so good it given me lots of energy took a long but it works for me thank you.", "rating": 5}, {"title": "I recently came across Lost Empire…", "text": "I recently came across Lost Empire Herbs, and decided to give some of their supplements a try. Their website is very well presented, and the information concerning their products in very detailed, and informative. Making selections is very easy. They have a short quiz you can take on a variety of scenarios and they help you pinpoint exactly which herbs will help you. I felt comfortable on the website. Communication is good, not overbearing, or bloated with \"buy me\" all the time. So far I have been very happy, and if the product does its job, I'll look to invest in others.", "rating": 5}, {"title": "LEH has set the bar high for customer…", "text": "LEH has set the bar high for customer satisfaction. I will accept nothing less from inferior companies. It's been a pleasure over these past few years. ", "rating": 5}, {"title": "Quick shippers", "text": "They always ship my herbs pretty quickly. Which is good for me, as I wait until I’m nearly out to re-order. Well packaged.  ", "rating": 5}, {"title": "Very consistent", "text": "Very consistent, gr8 products! Pretty expensive, but they work well, & Christopher really floods the site with helpful information & alot of research to back things up. Keep up the good work. 👍💪🙏", "rating": 5}, {"title": "Easy experience ", "text": "As always, ordering and checking out was a breeze. Love the products and also love how easy they are to get", "rating": 5}, {"title": "Herbs for life ", "text": "Lost empire gives great information on the herbs with the benefits for our health and a quiz which helps identify what is best for each person to buy. The videos really aid because the visual, seeing, is a good idea. I like that we can call also if we have a question.", "rating": 5}, {"title": "Easy to locate the product …", "text": "Easy to locate the product I was looking for. Quick check out and email responde with order.", "rating": 5}, {"title": "I sometimes purchase items several…", "text": "I sometimes purchase items several times a week.The service is always friendly.The website is user friendly.Questions are answered promptly.I've been a customer for years.Thank you.", "rating": 5}, {"title": "The folks at Lost Empire seem truly…", "text": "The folks at Lost Empire seem truly interested in providing quality products and a smooth buying experience. They explain as much as possible about their products, and what one can honestly expect from them.My purchase was smooth and I received the product on time.", "rating": 5}, {"title": "My Bad...They're Great!", "text": "I somehow made a double order....still not sure how or what occurred, but I simply hit the \"cancel order\" verification of the 2nd order & in short order, they emailed me that the mistaken order was cancelled & that the charge was being refunded.  This was handled so well by LEH support system!!", "rating": 5}, {"title": "Excellent Service and Products", "text": "Date of experience: November 06, 2024", "rating": 5}, {"title": "Great service I get my orders in about 4 days ", "text": "I love your new shipping center it closer to me so I get my orders a lot quicker now smart move on your part. R Snook Michigan ", "rating": 5}, {"title": "Love them all", "text": "Been purchasing herbs from Lost Herbs Empirefor about two years now and I couldn’t be more pleased with the experience. The quality of their herbs is outstanding—fresh, aromatic, and clearly well-sourced. Love these guys. Forever customer.", "rating": 5}, {"title": "Great little blurb on Goast Pine…", "text": "Great little blurb on Goast Pine Pollen, especially emphasizing US sourcing.  Feels good to support a growing concern.", "rating": 5}, {"title": "Easy to navigate to your website", "text": "Easy to navigate to your website, Video tutorials wonderful, explaining exactly what the herb does and how you should take it. Knowledge is power, and giving there point of view puts me at easy. Thank you", "rating": 5}, {"title": "Great products. ", "text": "Great products and great service. Really like the tinctures.", "rating": 5}, {"title": "Great product", "text": "I've been a customer for years. Excellent, high-quality product that is still affordable. Quick shipping and excellent customer service. ", "rating": 5}, {"title": "Super Service.         There 4 reasons why I want to give 5…", "text": "There 4 reasons why I want to give 5 Stars for Servics. An abundance of valuable information on website which helps guide towards the herbs that may help. Almost immediate response to query regarding possibility of and cost of shipping (  to UK ). Ease of ordering and payment system. Finally the Introductionary email with free gift of additional information makes me feel a welcomed member of their Tribe not just a customer.", "rating": 5}, {"title": "i like this company and use their…", "text": "i like this company and use their products regularly. i’m not always clear about the discount oops and found myself paying full price for an item that was available for a discount. immediate satisfactory response is what i got. thank you thank you!!", "rating": 5}, {"title": "I have always had a pleasant experience…", "text": "I have always had a pleasant experience when dealing with Lost Empire customer service. The website is fairly easy to navigate. It could use a continue shopping link, so that you didn't have to use the back button on your browser. But, overall, I am very pleased with all my experiences with this company.", "rating": 5}, {"title": "Great herbal remedies and supplements…", "text": "Great herbal remedies and supplements that help the body empower itself naturally.  The raw vitamins & minerals one needs to live a vibrant & vivacious life. ", "rating": 5}, {"title": "Wide variety of products", "text": "Wide variety of products. Would like more suggestions on how to take products and when would be best time. User guide. Other than that zero product complaints. Best I've taken. ", "rating": 5}, {"title": "Lost Empire Herbs is the premier…", "text": "Lost Empire Herbs is the premier company for all of your herbs. Very good customer service.", "rating": 5}, {"title": "Everything about my experience would…", "text": "Everything about my experience would lost empire herbs over the years has been nothing short of fantastic! Once again that is true", "rating": 5}, {"title": "The products and the customer service…", "text": "The products and the customer service are all top of the line.", "rating": 5}, {"title": "Fire herbs", "text": "Always top quality products that you can actually feel a difference in overall vitality. LEH have changed my life for the better ", "rating": 5}, {"title": "The Real Deal", "text": "I've been a L.E. customer for years and really don't trust any other company in this line of business.  Years ago I tried a few others and they all turned out to be \"snake oil salesmen\" who make one wish the supplement business WAS federally regulated!These guys truly are the best, AND the most honest.", "rating": 5}, {"title": "Company always delivers products in a…", "text": "Company always delivers products in a timely manner.  Once You make an order seems as if all attention is just focused on making the customer aware that they’re all valuable to the business.", "rating": 5}, {"title": "Website is easy to use but when I made…", "text": "Website is easy to use but when I made a mistake your team went above and beyond to help me.", "rating": 5}, {"title": "Exceptional Service", "text": "Callie was just so sweet and helpful, it made my day to deal with someone like her at a company.  And ANYONE with \"Customer Happiness Manager\" in their e-mail signature block is someone I want to do business with.", "rating": 5}, {"title": "Top notch service department", "text": "Hi Lost Empire,I ordered your product not more than 5 days ago, and it came yesterday!  It is a new product for me and am eager to try it!  As usual, your service department is the best!", "rating": 5}, {"title": "It was great to find out that i had…", "text": "It was great to find out that i had store credit thank you for honestly i am a customer for life😇", "rating": 5}, {"title": "Great Customer Support", "text": "I had received a discount promotion that had expired.  Purchased the Tincture Bundle and Callie honored the expired discount by giving me a credit.  How cool is that?!Thank you Callie!", "rating": 5}, {"title": "My order came well packaged", "text": "My order came well packaged. And in two days. Full stop. No problems. Swift, professional, seamless service. Thank You…", "rating": 5}, {"title": "I ordered online", "text": "I ordered online. I read the specifics of the products I purchased, great information attached so people know what you are getting & what each herb does. ", "rating": 5}, {"title": "Great service", "text": "As always, super-easy to place the order online and a swift delivery followed. Love Lost Empire Herbs. Paul M.", "rating": 5}, {"title": "I am amazed at the natural products…", "text": "I am amazed at the natural products awesome job empire!", "rating": 5}, {"title": "I like the ease of ordering with Lost…", "text": "I like the ease of ordering with Lost Empire Herbs. They ship out fast and in a nice safe package. I needed to return an item, and like they say no questions asked refund. I also like the web site with the tutorials. It’s easy for a guy like me to navigate. ", "rating": 5}, {"title": "Accommodating", "text": "My purchases were repeat buys so it was a breeze. I do use the LEH site for information and find it quite helpful. ", "rating": 5}, {"title": "First time visitor", "text": "First time visitor. Easy website, good information resource, helpful and speedy response with questions.", "rating": 5}, {"title": "Exceptional Service and Dedication ", "text": "They always send what I order and it arrives in a timely manner. Thanks to all the team for their continued help and dedication to improving the lives of all people . Wayne ", "rating": 5}, {"title": "Great herbs and Great customer service.", "text": "I’ve been ordering from Lost Empire Herbs for over 5years now and I Love the herbs and the staff!", "rating": 5}, {"title": "Great Business", "text": "Great Business, selling superb products at reasonable prices, with friendly customer service.  Why go anywhere else?", "rating": 5}, {"title": "quality vendor for more than a decade", "text": "I've purchased from this vendor for well over a decade and value the offering and quick shipping. ", "rating": 5}, {"title": "I always love the commitment that the…", "text": "I always love the commitment that the whole crew at Lost Empire have to there products and quality. Delivery and customer service A1 ✌️", "rating": 5}, {"title": "Good company", "text": "All products were in stock and arrived quickly. Web site is good.", "rating": 5}, {"title": "I've been ordering from this company…", "text": "I've been ordering from this company for a couple of years now and they haven't disappointed on the quality of their goods nor the customer service. ", "rating": 5}, {"title": "Healthy Living", "text": "The information displayed on “The Lost Empire Herb” company’s website is very knowledgeable. I appreciate their encouragement to live healthy. I’m presently waiting on my herbs to arrive. 🥰", "rating": 5}, {"title": "You Are Where You Need To Be", "text": "I became a Lost Empire Herbs (LEH) customer a few years ago. I had no experience with herbs before I found Lost Empire and have since learned quite a bit and have found some herbs that helped me tremendously. About a year ago another company hit my radar and they sold a few herbal products that intrigued me so I thought I'd venture out and see how they compared. They have some nice products but not nearly the menu that Lost Empire offers. They offered no information on sourcing or purity, the products are more expensive and in my opinion, not as effective. I gave that company a year to win my business and they didn't really reach out like I feel the people at Lost Empire do. That's the real kicker for me. I can send an email or make a phone call and get an answer from somebody the same day or within a few minutes even. The other company had no personality and offered no reassurance on anything. They merely spammed me with gimmicky emails about how I'll miss out unless I respond by midnight etc. I'm not sure how they're going to build trust and confidence by offering no real information on what they sell, not having a phone manned by a real, English speaking person intimately familiar with the company and the products offered, but I suppose most people are used to this type of \"interaction\" from companies now. Lost Empire is a breath of fresh air in a polluted world so I'm back and staying right here where I started this journey back to optimal health. Excellent products and outstanding service at a very fair price. Why did I ever venture out? ", "rating": 5}, {"title": "Always prompt", "text": "Always prompt. Very Professional.  Was hoping I could get to that discount promo code in time.  I was a bit late!  Hoping another comes through I can use. ", "rating": 5}, {"title": "The supplement world best kept secret ", "text": "This company has real supplements and herbs without the hype. I haven't ordered in a while but with this new job and that I'm older. I plan to get back into shape and Lostempireherbs should help me get into shape faster. Thank you.", "rating": 5}, {"title": "User friendly.", "text": "Website is informative and easy to navigate. Checkout process was seamless.", "rating": 5}, {"title": "Thank you Christoper", "text": "Thank you ChristoperYou recommended collagen that works.  Your herbs have been the best for decades.", "rating": 5}, {"title": "Awesome products! ", "text": "I’ve been using these product for years and they never disappoint! The pine pollen tincture  is phenomenal! Highly highly recommend for the gentleman!", "rating": 5}, {"title": "very easy to order", "text": "very easy to orderI also like the explanation that is given on each product plus what to expect in taste.  That makes it very helpful ", "rating": 5}, {"title": "Superb products", "text": "Real people, making real, healthy, natural products. They care, and want to make a difference as a company. ", "rating": 5}, {"title": "I always have a good experience with…", "text": "I always have a good experience with lost empire herbs. If I have questions they respond quickly and their products are top notch. ", "rating": 5}, {"title": "Great Herbs ,A little Pricey", "text": "Great Herbs ,A little Pricey ", "rating": 5}, {"title": "Excellent service!", "text": "My experience with anyone at the staff a loss empire herbs has always been exceptional. I have been using your products for several years. ", "rating": 5}, {"title": "discounted mucuna", "text": "I got an offer at checkout but couldn’t redeem it because the website glitched, support staff still allowed me to redeem it and get a large discount on mucuna powder, very helpful and polite!!", "rating": 5}, {"title": "Always a good experience", "text": "Always a good experience. Quick shipping and high quality herbs. Would recommend", "rating": 5}, {"title": "Easy online purchase", "text": "Easy online purchase, usually make orders on Amazon ", "rating": 5}, {"title": "Customer serviced answered all my…", "text": "Customer serviced answered all my questions in a very timely manner.  Just ordered my products and hoping to get fairly quick!", "rating": 5}, {"title": "My Experience With Ordering Your Products", "text": "Easy to order and to learn what each product is good for. I also like to read the reviews and stars that other customers give to your products.", "rating": 5}, {"title": "Good enterprise", "text": "Good enterprise, good product. Good to share enthusiasm.", "rating": 5}, {"title": "Great products..informative videos ", "text": "Great products..informative videos Total package absolutely aGodsend for older folks like myself ", "rating": 5}, {"title": "Friendly customer service…", "text": "Friendly customer service and was willing to answer any questions about the products.", "rating": 5}, {"title": "Kelly is always helpful and…", "text": "Kelly is always helpful and compassionate, thanks so much…💜👊🏻", "rating": 5}, {"title": "Easy to order and you provide my with…", "text": "Easy to order and you provide my with good quality products and information about herbs ", "rating": 5}, {"title": "Callie was awesome!", "text": "You were able to package my two orders into one shipment.", "rating": 5}, {"title": "Very responsive staff...", "text": "Very responsive staff. All the herbs I am getting from this company are working well for me.", "rating": 5}, {"title": "GREAT PRODUCT", "text": "GREAT PRODUCT, BUT I AM TIRED OF REVIEWING THE SAME PRODUCT EVERY MONTH", "rating": 5}, {"title": "I appreciated the ease of ordering", "text": "I appreciated the ease of ordering, the quality of the pine pollen, and the free samples.", "rating": 5}, {"title": "Love your herb info ", "text": "Easy to select the right product. Information is available on each product. Most of the time very easy to checkout.", "rating": 5}, {"title": "Lost Empire Herbs are the front runners…", "text": "Lost Empire Herbs are the front runners in their market.  They’re the best. ", "rating": 5}, {"title": "Kerry took care of my order and…", "text": "Kerry took care of my order and shipping method very well.It's Frank (me) who put the order in, not Eleanor.Please make the change.", "rating": 5}, {"title": "Always a great experience with Lost…", "text": "Always a great experience with Lost Empire Herbs !!! Great company & great products !!!", "rating": 5}, {"title": "I've been a customer for several years", "text": "I've been a customer for several years.  Their products and customer service has always been ouitstanding", "rating": 5}, {"title": "They listened", "text": "They listened. They did their part. All is well. ", "rating": 5}, {"title": "A standard for customer service.", "text": "I made a mistake on my order and it was handled flawlessly.", "rating": 5}, {"title": "Informative and great customer support", "text": "Informative and great customer support ", "rating": 5}, {"title": "Site pretty easy to use", "text": "Site pretty easy to use. If you've been on the site before, easy to find what you're looking for and easy to check out. Shipping is fast and service is really good.", "rating": 5}, {"title": "Top notch quality for years!", "text": "You can have a peace of mind😊knowing for sure🙃 you're getting quality herbs.", "rating": 5}, {"title": "Once again fantastic service,products…", "text": "Once again fantastic service,products simply the best out there.", "rating": 5}, {"title": "DETAILED PRODUCT INFORMATION", "text": "DETAILED PRODUCT INFORMATION, AND BY FAR THE HIGHEST QUALITY PRODUCTS THAT I HAVE EXPERIENCED.", "rating": 5}, {"title": "Always like their service", "text": "Always like their service. Price is always fair. I believe them when. They say they are lab tested.", "rating": 5}, {"title": "Quick shipping", "text": "Quick shipping.  High quality product.", "rating": 5}, {"title": "Great products", "text": "Great products, wonderful staff and super fast shipping!", "rating": 5}, {"title": "Great as usual", "text": "Great as usual. I'm a long time customer", "rating": 5}, {"title": "I get discounts once in a while on…", "text": "I get discounts once in a while on products I use", "rating": 5}, {"title": "Great products and service", "text": "Great products and service ", "rating": 5}, {"title": "Experience your product to be very…", "text": "Experience your product to be very helpful to me!!!!", "rating": 5}, {"title": "A monthly subscription was offered.", "text": "Date of experience: September 28, 2024", "rating": 5}, {"title": "Site is easy to use", "text": "Site is easy to use, orders are filled and shipped quickly.", "rating": 5}, {"title": "I like the mushroom brain and alchemy tinctures!", "text": "Date of experience: September 06, 2024", "rating": 5}, {"title": "Fast reply to my phone call and…", "text": "Fast reply to my phone call and questions.", "rating": 5}, {"title": "Their products actually work.", "text": "Date of experience: September 29, 2024", "rating": 5}, {"title": "Always a great experience at LEH", "text": "Date of experience: September 05, 2024", "rating": 5}, {"title": "Great service and Great products", "text": "Date of experience: October 22, 2024", "rating": 5}, {"title": "Fast shipping and Quality What Else Do…", "text": "Fast shipping and Quality What Else Do you Need!They will Help you Find the right Erbs For the Task At Hand!", "rating": 5}, {"title": "Educational", "text": "Educational, easy navigation website with well priced products that are nutritionallyhealthy.", "rating": 5}, {"title": "Excellent and friendly caring service", "text": "Excellent and friendly caring service ", "rating": 5}, {"title": "Received order in a reasonable amount…", "text": "Received order in a reasonable amount of time ", "rating": 5}, {"title": "Always trusted", "text": "Always trusted - best herb apothecary in the US", "rating": 5}, {"title": "Best Quality in USA", "text": "Best quality herbal supplements in the USA, great customer service, frequent discounts/sales to reward loyalty", "rating": 5}, {"title": "Great  product", "text": "Great b product. Been using for yearsNow I have my whole family using it", "rating": 5}, {"title": "Dam.", "text": "Dam.. like dam they work. It's high shelf herbs. None of that diluted 💩 from Amazon ", "rating": 5}, {"title": "Great costumers service.", "text": "Date of experience: October 12, 2024", "rating": 5}, {"title": "No surprises", "text": "No surprises. Just do what you ask.", "rating": 5}, {"title": "Seems the product was priced fair", "text": "Seems the product was priced fair. Fast delivery & good product.", "rating": 5}, {"title": "Phoenix formula seems to be effective.", "text": "Date of experience: August 23, 2024", "rating": 5}, {"title": "Everything was easily accomplished,more…", "text": "Everything was easily accomplished,more so than most of my experiences purchasing online ", "rating": 5}, {"title": "Great customer service", "text": "Quick response and resolution to questions asked.", "rating": 5}, {"title": "Great products, service and knowledge", "text": "Wonderful products that works", "rating": 5}, {"title": "honest company", "text": "honest company, excellent customer service, no thrills money or product guarantee.", "rating": 5}, {"title": "Ease of ordering and excellent…", "text": "Ease of ordering and excellent description of the products.", "rating": 5}, {"title": "Awesome ", "text": "Easy website to use and order comes quickly ", "rating": 5}, {"title": "Good products with good information…", "text": "Good products with good information available about their benefits.", "rating": 5}, {"title": "Good price not happy with shipping…", "text": "Good price not happy with shipping fees. However, I have no choice 😊", "rating": 5}, {"title": "They explained things well ", "text": "They explained things well on the website.", "rating": 5}, {"title": "Shilajit", "text": "Information was very clear an easily understood", "rating": 5}, {"title": "Great company and fast shipping.", "text": "Great company and fast shipping. ", "rating": 5}, {"title": "Just always good", "text": "Just always good, always quality", "rating": 5}, {"title": "THIS COMPANY IS HONEST", "text": "THIS COMPANY IS HONEST, HAS RELIABLE PRODUCTS WITH EXCELLENT CUSTOMER SERVICE.", "rating": 5}, {"title": "Very good quality herbs and great…", "text": "Very good quality herbs and great communication.", "rating": 5}, {"title": "Good company", "text": "Date of experience: September 16, 2024", "rating": 5}, {"title": "As always", "text": "As always, Lost Empire delivers products delivers as advertised. ", "rating": 5}, {"title": "Ease of ordering", "text": "Ease of ordering, good descriptions and reviews.", "rating": 5}, {"title": "Pleased!", "text": "Great results on all we have bought.", "rating": 5}, {"title": "Great customer service", "text": "Customer Service is always quick , And efficient", "rating": 5}, {"title": "Thank you", "text": "Thank you. A very good products.", "rating": 5}, {"title": "Shipped fast", "text": "Shipped fast.  Good price.  Quality product", "rating": 5}, {"title": "Great products", "text": "Great products!  I use them every day!", "rating": 5}, {"title": " Happy customer ", "text": "These products work information is excellent", "rating": 5}, {"title": "great products--fast service", "text": "great products--fast service", "rating": 5}, {"title": "You gave me the information I requested.", "text": "Date of experience: August 02, 2024", "rating": 5}, {"title": "Good product & service", "text": "Good product & service ", "rating": 5}, {"title": "Good product", "text": "Good product, delivered quick.", "rating": 5}, {"title": "Easy to order what you need thank you", "text": "Date of experience: August 21, 2024", "rating": 5}, {"title": "They answered all my questions.", "text": "Date of experience: August 21, 2024", "rating": 5}, {"title": "Love their products.", "text": "Date of experience: September 02, 2024", "rating": 5}, {"title": "Efficient and simple!", "text": "Date of experience: August 12, 2024", "rating": 5}, {"title": "Always great service!", "text": "Date of experience: June 01, 2024", "rating": 5}, {"title": "Great product", "text": "Great product, excellent service", "rating": 5}, {"title": "Excellent products", "text": "Excellent products, well run family business…. Perfect combination! ", "rating": 5}, {"title": "Makes you feel like family", "text": "Date of experience: August 10, 2024", "rating": 5}, {"title": "Very good products", "text": " Very good products. Fast service.", "rating": 5}, {"title": "Excellent customer service", "text": "Date of experience: October 19, 2024", "rating": 5}, {"title": "Professional all the way", "text": "Date of experience: August 30, 2024", "rating": 5}, {"title": "Simply the best herbs in the market.", "text": "Date of experience: August 05, 2024", "rating": 5}, {"title": "Good Service ", "text": "Reviews Good Ingredients ", "rating": 5}, {"title": "the herbs really work ", "text": "The products have proven their worth ", "rating": 5}, {"title": "Great company,superior products,fast…", "text": "Great company,superior products,fast delivery.", "rating": 5}, {"title": "Keep up the good work !!!", "text": "Date of experience: July 17, 2024", "rating": 5}, {"title": "Love it", "text": "Good products ", "rating": 5}, {"title": "Always quality results!", "text": "Always quality results! ", "rating": 5}, {"title": "Very Good", "text": "Very Good! Love the products!", "rating": 5}, {"title": "timely", "text": "timely, efficient professionalism", "rating": 5}, {"title": "Great Shipping also", "text": "Fantastic Products", "rating": 5}, {"title": "Great products!", "text": "Date of experience: August 27, 2024", "rating": 5}, {"title": "Great Products 👍", "text": "Great Products 👍 ", "rating": 5}, {"title": "Quick and easy!", "text": "Date of experience: August 05, 2024", "rating": 5}, {"title": "Great products.", "text": "Date of experience: August 05, 2024", "rating": 5}, {"title": "Quick and easy!", "text": "Date of experience: August 03, 2024", "rating": 5}, {"title": "Always enjoy shopping with Lost Empire Herbs.", "text": "I always enjoy my shopping with Lost Empire Herbs. I find what I want, place my order and no worries,... it's usually shipped pretty quickly, delivered intact and enjoyed. ", "rating": 5}, {"title": "Callie was quite forthright and honest…", "text": "Callie was quite forthright and honest with me .", "rating": 5}, {"title": "Answered all my questions 👍", "text": "Date of experience: August 02, 2024", "rating": 5}, {"title": "High quality", "text": "High quality, great service, great insight and guidance, great prices, and a personal touch. You feel like the team is taking the time for you personally. ", "rating": 5}, {"title": "Great quality herbs ", "text": "LEH has always provided high quality herbs and they have made a big improvement in mine and my wife’s livelihood. Thanks Lost Empire ", "rating": 5}, {"title": "Very helpful support staff.", "text": "Date of experience: June 17, 2024", "rating": 5}, {"title": "Very helpful !", "text": "Date of experience: July 31, 2024", "rating": 5}, {"title": "Very good herb products that work", "text": "Very good herb products that work, easy to shop online and great response when you have a question.", "rating": 5}, {"title": "Always a pleasure ordering from here", "text": "Always a pleasure ordering from here. Easy and fast. ", "rating": 5}, {"title": "Easy to use website fair prices and…", "text": "Easy to use website fair prices and knowledge people ", "rating": 5}, {"title": "The product are helpful for me", "text": "The product are helpful for me ", "rating": 5}, {"title": "The customer service staff was kind and…", "text": "The customer service staff was kind and generous. I very much appreciate it. ", "rating": 5}, {"title": "I ordered Shilajit and Ashwagandha for…", "text": "I ordered Shilajit and Ashwagandha for post surgery recovery.  Helped tremendously.  Helped get myself strong enough to start lifting again.  Love their herbs.", "rating": 5}, {"title": "Great customer service!", "text": "Your customer service is always been great. I sent a question in and it was answered promptly with the list of products to buy, and I bought them all!Thank you I appreciate your prompt service", "rating": 5}, {"title": "Love the product and the service", "text": "Love the product and the service ", "rating": 5}, {"title": "Very good herbs!", "text": "Date of experience: July 24, 2024", "rating": 5}, {"title": "I have never had a negative experience…", "text": "I have never had a negative experience with Lost Empire Hefbs.", "rating": 5}, {"title": "High-quality ", "text": "I refuse to purchase my herbs elsewhere! My body is properly fed with these high-quality herbs.....", "rating": 5}, {"title": "I love this company!", "text": "I love this company!! I read every article and blog; I find them so educational & helpful for my health journey. The products are great of course, but something that is important to me as a consumer, is customer service and Lost Empire knocks it out of the park. They always answer every email quickly and there is nothing they won’t help with! The generous 365-day return policy shows me they believe in their products and care about their customers; I love their transparency as well!", "rating": 5}, {"title": "Prompt and knowledgeable replies to…", "text": "Prompt and knowledgeable replies to emails. You all don't hype or hard sell your products; your info about each product, and then the further details you offer are easy reads and make me want to, as I call it, guinea pig myself...that's the only way one will find out what does and does not work. I'm enjoying my guinea pig travels with Lost Empire Herbs!", "rating": 5}, {"title": "Great service ", "text": "Always on time great products.", "rating": 5}, {"title": "No problem using web sites", "text": "No problem using web sites ", "rating": 5}, {"title": "seems to be a good product ", "text": "Service and the product is as described ", "rating": 5}, {"title": "Consistency", "text": "Consistency.  Products are easy to order.  I never had any transaction issues.", "rating": 5}, {"title": "Fast shipping", "text": "Fast shipping! Excellent products! Top quality!!", "rating": 5}, {"title": "Consistent purity", "text": "Consistent purity. I have tried other brands and always regret it. Now I just jump around different herbs here and see how it makes me feel. My new favorite is the black ant extract. ", "rating": 5}, {"title": "Excellent products", "text": "Excellent products, great selection.", "rating": 5}, {"title": "The website offers tutorials on the…", "text": "The website offers tutorials on the products they sell. It helps me understand the benefits of use and which version of a product is best for me. I just bought the pine tincture because of it despite not typically liking a tincture", "rating": 5}, {"title": "Quick and helpful service -great…", "text": "Quick and helpful service -great products", "rating": 5}, {"title": "Outstanding & Trustworthy", "text": "I have tested several items and found that some work better for me than others. I've had no noticeable side effects from any of it but, we're all different and some things will work better for some than other things. I have found several that work for me and continue to test a few along the way. The company is outstanding & I believe to be very trustworthy. Thanks Lost Empire Herbs,Ricky", "rating": 5}, {"title": "Supreme herbs!", "text": "The herbs are potent and great! I'm hook and spoiled with the entire herb selection. I only trust purchasing my herbs from \"Lost Empire Herbs\". ", "rating": 5}, {"title": "THESE PRODUCTS WORK BETTER THAN ANY MAN MADE MEDICINE WITH NO SIDE AFFECTS.", "text": "THESE PRODUCTS WORK BETTER THAN ANY MAN MADE MEDICINE WITH NO SIDE AFFECTS!!!", "rating": 5}, {"title": "I buy from this company from a long…", "text": "I buy from this company from a long time and I also diverted quite a few clients throughout the years. Their product quality is great.", "rating": 5}, {"title": "Only place I buy tinctures", "text": "Only place I buy tinctures! I’ve tried other brands, but nothing is comparable! I’m going on 4+ years cycling through pine pollen! It’s Amazing! I’m 45 and when I’m on the pollen ,I stay leaner with moreMuscle ,energy through the room along with the sex drive! ", "rating": 5}, {"title": "Herbal fanatic ", "text": "Everything was simple and the products all have very good write-ups as to how they benefit your body and in some instances, a historical background.", "rating": 5}, {"title": "Very reliable", "text": "Very reliable ", "rating": 5}, {"title": "Good customer service", "text": "You’re one of the few companies that people don’t have to worry ,good customer service, Very helpful. The only thing I would suggest is when you get to the order and you’re getting ready to place it instead of having to go back, you should be able to make an adjustment right there if you wanna buy extra of what you ordered. It doesn’t seem to allow you to do that unless you go back", "rating": 5}, {"title": "Great product", "text": "Great product ", "rating": 5}, {"title": "Great products", "text": "Great products, quick delivery ", "rating": 5}, {"title": "Ease of ordering and Prompt service", "text": "Date of experience: July 15, 2024", "rating": 5}, {"title": "Preliminary review prior to trying product. ", "text": "Explaining the product benefits is helpful. Hopefully I will benefit from the product as some of the individuals leaving reviews. ", "rating": 5}, {"title": "Lost Empire herbs is an excellent…", "text": "Lost Empire herbs is an excellent company to deal with. They are courteous, helpful, knowledgeable. My shipments are always correct and arrive promptly. I am never disappointed with the quality of service nor product. ", "rating": 5}, {"title": "I've enjoyed my regular tinctures that…", "text": "I've enjoyed my regular tinctures that I've reaped benefits and pushed back products that were fine but allowed me to focus on the products that fit my budget. Any communication I've needed has always been swift reply as well as being resolved. I have had an issue with a recommended company through LEH and communicated with LEH not to encourage services with ROOTZ .  I've been a more customer with LEH the past couple years and will always have my main staples of He Shu Wu. Pine Pollen, Nettle Root. ", "rating": 5}, {"title": "Ordering and shipping was easy", "text": "Ordering and shipping was easy.  Lots of information on the product you are wanting.", "rating": 5}, {"title": "GREAT COMPANY AND STANDS BY ITS PRODUCTS", "text": "GREAT COMPANY AND STANDS BY ITS PRODUCTS,", "rating": 5}, {"title": "Callie is exceptional at her job", "text": "Callie is exceptional at her job.  Shipping to Canada sucks however", "rating": 5}, {"title": "I had no problem whatsoever ordering…", "text": "I had no problem whatsoever ordering and purchasing the product. ", "rating": 5}, {"title": "Honest Company", "text": "Honest CompanyProvides incredibly useful informationGreat productsWonderful customer service", "rating": 5}, {"title": "Yes I asked to ship the order with USPS…", "text": "Yes I asked to ship the order with USPS and your team said they would very easy and I appreciate everything ", "rating": 5}, {"title": "Quality Formulas", "text": "Great Selection, Lots of Information concerning their Products, Fast Delivery, Quick response team. Repeat Customer.", "rating": 5}, {"title": "I like the product,especially having…", "text": "I like the product,especially having taken it in its raw and powdered form.The gel caps are a good move.Delivery time is quick.Ordering process is easy.", "rating": 5}, {"title": "Brilliant 👌", "text": "Date of experience: July 08, 2024", "rating": 5}, {"title": "Quick", "text": "Quick, efficient and high-value.", "rating": 5}, {"title": "The customer service I have received…", "text": "The customer service I have received upon placing my order ", "rating": 5}, {"title": "I take Lions Mane powder and the…", "text": "I take Lions Mane powder and the results on my neurological system arenot subtle, they are profound. I went from being extremely off balance most days, and sudden unpredictable paralytic attacks, to none! My life has completely changed. My memory is better as well as my mood. This company is very responsive to needs or concerns.  ", "rating": 5}, {"title": "Easy ordering and easy checkout great…", "text": "Easy ordering and easy checkout great quality products.", "rating": 5}, {"title": "It is easy to get products that are…", "text": "It is easy to get products that are completely authentic and without unnecessary fillers. This is the real deal. The spagyric tinctures are now my favorites", "rating": 5}, {"title": "Every description of the remedies are…", "text": "Every description of the remedies are concise and informative. It is very easy to choose from it.The prices are reasonable and return policy instill confidence ", "rating": 5}, {"title": "Simple & quick to order", "text": "It was a simple & quick to ordering process and I like your products, thanks.", "rating": 5}, {"title": "Satisfied repeat customer ", "text": "I have been a customer for several years. Lost Empire Herbs always delivers a quality product at a fair price. I would recommend them to anyone! Overall great company and a smooth experience. ", "rating": 5}, {"title": "Impressive!", "text": "Great products; great service; great integrity. What more can you ask for in any company or any business!!!", "rating": 5}, {"title": "Always get Great Products", "text": "Always get Great Products, keep up the good work ", "rating": 5}, {"title": "First class product,great service.", "text": "Hi,I have been taking Tongat Ali,now for about two months,I normally like to try herbs and other supplements for six months before offering an opinion,I'm 65 years of age fortunately with a very good libido,so taking the Tongat Ali powder for extra energy,and up to now its helped greatly both with increased energy and even stronger libido which is a bonus.I have taken supplements since my early twenties,and trained in internal martial arts for over 40 years,this is without doubt in my opinion the best product out there I only need to take one dose daily, for five days then lay off for two days,the service at Lost Empire Herbs is first class, and would highly recommend.Errol.", "rating": 5}, {"title": "great product", "text": "great product. I am 76 years old , excellent health. your products give me the energy and stamina to do every day life and they also contribute to my sex life. my wife and I enjoy sex three times a week from using the herbal blends! Thank you!Dan& Sue", "rating": 5}, {"title": "easy site to navigate", "text": "easy site to navigate. great prices.  product does as avertised", "rating": 5}, {"title": "Easy to navigate site ; Great Products ; Easy checkout !!!", "text": "Great Products ,Friendly , Knowledgeable Staff ,Easy Checkout ,Buy with confidence !!! ", "rating": 5}, {"title": "The have great products", "text": "The have great products, can't go wring with his stiff. Easy to use website! No hassle check out!", "rating": 5}, {"title": "Excellent service", "text": "Excellent service. High quality product. ", "rating": 5}, {"title": "AWAYS ON TIME .GREAT PRODUCTS", "text": "Date of experience: June 02, 2024", "rating": 5}, {"title": "The products showed up fast", "text": "The products showed up fast. The contents were real. Ive been purchasing and using supplements from here 2 months now. Im known to update my reviews so I will with this as well if something about my opinion changes or i have some new info worth adding. Happy shopping. ", "rating": 5}, {"title": "Great customer service!", "text": "The company has great products and excellent customer service! ", "rating": 5}, {"title": "Ordering was easy and product was…", "text": "Ordering was easy and product was shipped quickly ", "rating": 5}, {"title": "Explanatory n easy", "text": "Explanatory n easy ", "rating": 5}, {"title": "Great products", "text": "Great products, quick delivery.", "rating": 5}, {"title": "Perfect place to get better", "text": "I’ve been using pine pollen powder and he shou wu for several years, with great success. Recently added Tongkat Ali and I’m liking the benefits. Easy to order, fast shipping, stand behind their products and periodic sales make this my go to place for supplements. Thanks", "rating": 5}, {"title": "I find the site easy to navigate and…", "text": "I find the site easy to navigate and plenty of expanded information on your products.Seem a little slow. To load page after clicking on Tabs", "rating": 5}, {"title": "The natural energy, the focus , my workouts even have increased without fatigue ", "text": "The ordering process, the description of the product , I will be ordering again today. Thank you I am a huge fan now ", "rating": 5}, {"title": "everything was clear and easy", "text": "everything was clear and easy, took advantage of 7/4 sale starting", "rating": 5}, {"title": "Excellent Quality and Ethics", "text": "When I trust my health to someone or a company, I need to know what they stand for and whether their actions back up their words.I've been disillusioned with conventional medicine for decades, and Lost Empire Herbs seems to represent the closest thing to a sensible approach to health.If I'm particular about limiting pesticides in my food, then it makes no sense to lower my standards for my medicine. Lost Empire Herbs provides clean, potent herbal products I'm willing to trust with my life.I want to say everything I've bought has worked for me, but that's not the case. There is a limit to what the herbs can do, and a person must sometimes lower their expectations and practice patience.I know that every product I've bought is of the highest quality, clean, and matches the description. It's nice to know I'm getting what I pay for, and if I do my part, I will derive maximum benefit.The staff are knowledgeable and helpful. Products usually arrive earlier than expected. I couldn't ask for more and will always be eternally grateful for finding Lost Empire Herbs.", "rating": 5}, {"title": "Efficient fulfillment and great products", "text": "Date of experience: May 27, 2024", "rating": 5}, {"title": "Great products with Fast Service!", "text": "Great Products with Fast Service!", "rating": 5}, {"title": "Packaged delivered on time and works…", "text": "Packaged delivered on time and works wonderfully,bought pine pollen powder & tincture,about to reorder,products are excellent quality.", "rating": 5}, {"title": "I LOVE EVERYTHING ABOUT THEM!", "text": "Date of experience: June 27, 2024", "rating": 5}, {"title": "Quality products I can trust.", "text": "Date of experience: June 28, 2024", "rating": 5}, {"title": "Exelent product and service as usual", "text": "Date of experience: June 26, 2024", "rating": 5}, {"title": "Quick responses!", "text": "Date of experience: May 25, 2024", "rating": 5}, {"title": "New Member", "text": "good reviews and definition of each item is fully established.  Just started, but beginning to see some results I was hoping for.", "rating": 5}, {"title": "Great products made by people that…", "text": "Great products made by people that care. I love the products from this site. They are authentic and not filled with fillers like other commercial products.", "rating": 5}, {"title": "Lots of info", "text": "Lots of info. Great guaranty.", "rating": 5}, {"title": "The products I have received are of…", "text": "The products I have received are of excellent quality and do what they are designed for. This being said the service I have received has also been fantastic 5 Star", "rating": 5}, {"title": " Pine Pollen arrives on time…", "text": "My order of Pine Pollen arrives on time and well packaged. ", "rating": 5}, {"title": "Great service", "text": "Great service, easy website", "rating": 5}, {"title": "I generally find it pretty easy to…", "text": "I generally find it pretty easy to place my order. They ship it out, as quickly as it is processed. I believe I am getting some really good results from taking these herbs, although I don't have any clinical data to back this up. Just how I feel. I have been using this companies herbs for roughly 3 or 4 years. I don't take any medications, what so ever, at 66 y.o. All homeopathic supplementation. I am quite pleased with Lost Empire!", "rating": 5}, {"title": "Easy to use site", "text": "Date of experience: June 21, 2024", "rating": 5}, {"title": "A Great Win for me", "text": "I first came to LEH looking for some help with my prostate. Typically I would need to get 3 or more times a night to hit the bathroom. Sound sleep never happened. My urologist pushed to do a procedure, but that was not going to happen. Any procedure in a hospital using the blood supply,,, well that would only happen as a \"last resort\". So I researched supplements, tried a few and then I came across LEH.I took your quiz about hormones n prostate issues. Explored the herbs you recommended, Nettle Root, Pine Pollen, Tongkat Ali. And gave them a shot. Being a recovering alcoholic I want what I want when I want it, buts that not how life works. Recovery is a long time journey. Just like these herbs that I have been faithfully using for more than 2 years. Now I will either sleep thru the night or maybe get up once to hit the bathroom. For me that is a Great Win.Thanks LEH,Bruce Dps: Some herbs are tough on the tastebuds", "rating": 5}, {"title": "great as usual", "text": "great as usual", "rating": 5}, {"title": "Top quality, helpful—and fast delivery", "text": "Top quality products! Excellent, informative website with plenty of helpful guidance on the various products.  And they fulfill and ship everything nice and fast.  Regular customer here for all the right reasons. ;)", "rating": 5}, {"title": "Order arrived in a timely manner.", "text": "Order arrived in a timely manner.We’ll see how good the pine pollen extract works the next time I have a blood test to check my testosterone levels.", "rating": 5}, {"title": "Quick reply to questions.", "text": "Quick reply to questions.Short, sweet, and to the point.", "rating": 5}, {"title": "It's easy to navigate Lost Empire Herbs…", "text": "It's easy to navigate Lost Empire Herbs website. If you have an account with past orders/subscriptions and you've paused them it's easy to find what it was and reorder. Sometimes I'll get notified of helpful specials.", "rating": 5}, {"title": "The customer service is top-notch", "text": "Date of experience: May 16, 2024", "rating": 5}, {"title": "Making sure that I have the right…", "text": "Making sure that I have the right product and ship on time. ", "rating": 5}, {"title": "High quality product rivals high…", "text": "High quality product rivals high quality customer service!", "rating": 5}, {"title": "Amazing products ", "text": "Hands-down, best herbs ever! No other company can compare to the pine pollen alone!", "rating": 5}, {"title": "Awesome products and awesome service", "text": "Awesome products and awesome service ", "rating": 5}, {"title": "Always responsive", "text": "Always responsive, ships quickly and makes good suggestions. Products perform well for me.", "rating": 5}, {"title": "Very high quality products and great…", "text": "Very high quality products and great service ", "rating": 5}, {"title": "Amazing brand", "text": "I love everything about this company and its products. Great pure products, great customer service, never disappointed when I try something new either. 12/10 company", "rating": 5}, {"title": "Love You Guys!", "text": "Love You Guys!Cali is the BEST!Excellent communication and follow through with shipping. So grateful to work with such a good team. Keep up the good work and keep shining that light out to all. Good ingredients and good health! Sincerely, Mason", "rating": 5}, {"title": "Great customer service and also also…", "text": "Great customer service and also also quality products", "rating": 5}, {"title": "Quick delivery", "text": "Date of experience: June 08, 2024", "rating": 5}, {"title": "Fast shipping and a very good product", "text": "Date of experience: May 09, 2024", "rating": 5}, {"title": "Great quality herbals at a good price…", "text": "Great quality herbals at a good price and generous loyalty program and specials.", "rating": 5}, {"title": "Getting away from main stream medicine.", "text": "Great products ", "rating": 5}, {"title": "Great products", "text": "Date of experience: May 09, 2024", "rating": 5}, {"title": "i LOVE THINGS/REMEDIES THAT WORK!!!", "text": "i LOVE THINGS/REMEDIES THAT WORK!!!Your tincture and the likes WORK very well!", "rating": 5}, {"title": "First time customer…", "text": "I like the wide variety of herbs and all of the information that you have pertaining to them! ", "rating": 5}, {"title": "Hi the shipping is a lot faster I like…", "text": "Hi the shipping is a lot faster I like that. I believe that taking these herbs I’m feeling better energy to my heath thank you.", "rating": 5}, {"title": "SAME AS ALWAYS THAT I'VE SAID", "text": "SAME AS ALWAYS THAT I'VE SAID. STOP WITH THE DAMN SURVEYS ALREADY. ENOUGH IS ENOUGH ALREADY!!!", "rating": 5}, {"title": "open dialog with representative", "text": "open dialog with representative, forthrightness, plus I noticed a improvement,great job", "rating": 5}, {"title": "Lost Empire has long been my go-to herbal vendor.", "text": "Lost Empire has long been my go-to vendor for specialized herbal products.  Their quality is top-notch and their customer service equally so. Further, I fully appreciate the detailed product information which frequently includes research, customer experiences, regular batch testing for consistency, and guidance as to the product’s key attributes. I’ve learned quite a lot about herbal supplements from these folks.", "rating": 5}, {"title": "Easy to order", "text": "Date of experience: June 06, 2024", "rating": 5}, {"title": "Simple to place an order", "text": "Simple to place an order, prompt processing, and receiving my order in just a few days! Thank you for easy!", "rating": 5}, {"title": "Always great product and service !", "text": "Date of experience: June 06, 2024", "rating": 5}, {"title": "Efficient and informative", "text": "Efficient and informative ", "rating": 5}, {"title": "Trying a new product for me", "text": "I always learn from all the research you guys do. I have products that I have been using for a while. I love those. Trying something new for tinnitus, hope it works as well as the other stuff. Will let you know. ", "rating": 5}, {"title": "Logan is always providing fact based…", "text": "Logan is always providing fact based and very information to his customers.  He supports Veterans and First Responders by providing discounts.  His team is very courteous and supportive.  Logan tries to provide suggestions and herbal solutions to customers who query him for help even if the solution is not benefiting his business.This country needs more  customer focused companies like lost empire.", "rating": 5}, {"title": "Great customer service and products", "text": "Great customer service and products, I highly recommend Lost Empire Herbs ", "rating": 5}, {"title": "Trusted and potent", "text": "I will look no further for trusted, potent, and effective herbs! ", "rating": 5}, {"title": "GREAT COMPANY TO BE A CUSTOMER TO…", "text": "I simply went online as always and placed my order.  Navigation is always easy and straightforward. I have contacted customer service in the past and that has always been pleasant. I truly have no complaints. I have referred people to buy here, not sure if they did or not. I am a VIP so it's awesome having access to some limited product that is not yet available to the public. I wish I could go through one of the trials on a brand new product, but hey it's not necessary for me to endorse this company. It simply would be nice to be a part of that. All their products have been great so far, and I do like that they have a 1 year warranty should I have any issues with something not working for me. ", "rating": 5}, {"title": "The easiness of ordering and the great…", "text": "The easiness of ordering and the great customer support", "rating": 5}, {"title": "easy ordering", "text": "Date of experience: June 01, 2024", "rating": 5}, {"title": "Great selection, highest quality", "text": "Great selection, great information, great team working hard to earn my business!Great products priced right!", "rating": 5}, {"title": "It took a while for results", "text": "It took a while for results, being 73, there’s a lot sludge to move.    Being a retired Marine, I gave the best part of my life to this country and I’m trying to regain a semblance of those lost(?) years. I would love to see a special deal for us. I served from Vietnam to Iraq.", "rating": 5}, {"title": "Herbal Tincture", "text": "Lost Empire Herbs is a pleasure to order from. Great customer service. Great products at great price. Website is user friendly. Once ordered, product shipped quickly.Looking forward to trying out these herbal tinctures. Keep up the great work!Highly recommended!", "rating": 5}, {"title": "Review", "text": "The information that you all provide is awesome. The product itself is second to none! ", "rating": 5}, {"title": "Good Experience", "text": "Always a good experience to work with LEH.  An upright company with consistently good practices", "rating": 5}, {"title": "I've been using your products for…", "text": "I've been using your products for several years, with great results!  ", "rating": 5}, {"title": "Quality products and service", "text": "I really appreciate the prompt responses to my emails. Products are good. Love the fact that many if not all products are \"3rd party tested\"!", "rating": 5}, {"title": "Shilijit", "text": "The product and company are great. The shilijit tastes like hot garbage and with any other company I would worry it was tainted or bad. But Lost Empire does enough testing to assure me it is healthy. Thanks!", "rating": 5}, {"title": "I have been going to try shalijet", "text": "I have been going to try shalijet for a while and finally did. Very good stuff felt the difference from day one. Will definitely keep ordering from you guys.", "rating": 5}, {"title": "Your prompt and quick service ", "text": "Your prompt and quick service is very much appreciated. Also your updates a reviews of the diverse products is very helpful in making a decision as to what product to order.", "rating": 5}, {"title": "Amazing herbs!", "text": "This company has an amazing herbs! I tried 3 of them so far and I’m feeling so much better! My hormones were out of balance. I started to use Athena and I began to feel so much better! ", "rating": 5}, {"title": "The Service that this company provides…", "text": "The Service that this company provides is really great!! And information about their products is very helpful.  However the products them selves did not do a great deal for me, i really didn’t get the effect from them that I was looking for.", "rating": 5}, {"title": "The herbs are great", "text": "The herbs are great.  They do exactly what you say they will do and whenever I have contacted your team, they are very helpful.Thanks and keep up the good work.", "rating": 5}, {"title": "Favorite products black ant powder and…", "text": "Favorite products black ant powder and he shou who!!! Very quick service and this company thr reason I'll probably never buy another major brand pharmaceutical product again for aliments", "rating": 5}, {"title": "good people", "text": "Date of experience: May 24, 2024", "rating": 5}, {"title": "Out of Africa", "text": "Very professional and caring handling on questions about a new powerful Herbal tincture I ordered for the first time.", "rating": 5}, {"title": "Rep was very helpful and guided me to…", "text": "Rep was very helpful and guided me to the right place in order to fix my account and when I still had issues she pushed the order through for me. Great job. Thank you", "rating": 5}, {"title": "Your site has great explanations on it", "text": "Your site has great explanations on it. Very detailed. You put lots of effort into educating your readers (new and old). It shows your attention to detail that splashes over into the effort and time you take to produce quality products. As a medical professional, I appreciate that.", "rating": 5}, {"title": "CUSTOMER FOR YEARS!!", "text": "I have been ordering with Logan and the Lost Empire Team for years now. I am now a senior and in the best shape of my life with 0 aches and pains! I don't trust a lot of companies these days especially when they get bought out by Big Pharma and big Corp and still act like they are family companies...I TRUST this company implicitly and Logan is passionate about the quality of these herbs..I  feel his dedication and eagerness to constantly work on upgrading and renewing these herbs.. I use the VIP tinctures exclusively.. I am grateful for finding this company and you will be as well! ", "rating": 5}, {"title": "they called me back wow", "text": "they called me back wowthey really mean what they say!ordered pine pollen powder had testosterone test went up quickthis company really interesting do wished they open up more! toxic metals test on pine pollen like lead remains to be seen", "rating": 5}, {"title": "Great products for a great price", "text": "Great products for a great price! My source! ", "rating": 5}, {"title": "Real substantive help with real natural…", "text": "Real substantive help with real natural answers for your health! Simple as that!", "rating": 5}, {"title": "Their knowledge and customer assistance…", "text": "Their knowledge and customer assistance is above and beyond and I've never found a better set of products anywhere. I will continue to use these as they have become a necessity in my life", "rating": 5}, {"title": "Great products 😁", "text": "Informative web pages discussing and listing all the benefits of their products.", "rating": 5}, {"title": "Efficiency ", "text": "All products arrive in a timely manner. Website very user friendly.", "rating": 5}, {"title": "Always Great Herbs and Service", "text": "Always Great Herbs and Service, Thanks", "rating": 5}, {"title": "Lost Empire Herbs doing a wonderful", "text": "Lost Empire Herbs doing a wonderful, excellent job. All Your product is superb. Thank you so much.", "rating": 5}, {"title": "LOST EMPIRE ROCKS", "text": "I'm a returning customer so as usual the products and service is exemplary. ", "rating": 5}, {"title": "A very good & well run company ", "text": "Got a fast and straight answer on an inquiry I made. Site is user friendly. Checkout was easy. High quality herbals. Shipping was fast and reasonably priced. Great operation. ", "rating": 5}, {"title": "Your pine pollen is really good!", "text": "Date of experience: May 17, 2024", "rating": 5}, {"title": "Lost Empire Herbs deserves my trust.", "text": "Lost Empire Herbs is a completely trustworthy company.  They are very transparent with quality testing and share valuable information about their products.Their shipping process is also top notch.", "rating": 5}, {"title": "Great Product Line", "text": "High grade herbs and the variety of products.", "rating": 5}, {"title": "User friendly, no hassle", "text": "Easy ordering ", "rating": 5}, {"title": "Impressed ", "text": "I was very impressed on how easy it was to place my order and how well the order site was laid out.No hassles no stress.", "rating": 5}, {"title": "Very professional and kind", "text": "Very professional and kind. Customer service is wonderful. I definitely recommend this place.", "rating": 5}, {"title": "Lost Empire Herbs ", "text": "I was not to share at first until I called and spoken to a experience representative she help me to fix the problem I had I felt safe to place my orders and I received my gift a my herbs and tried some these ingredients are the best and I’m so happy every thing that lost Empire Herbs are pure and clean I’m jus glad and Happy thank you ", "rating": 5}, {"title": "High quality products", "text": "Lost Empire all day!", "rating": 5}, {"title": "Responded Quickly", "text": "Customer service called back in a timely fashion. Very professional and easy to talk to. Paid attention to what I was asking for to make sure the order was correct.", "rating": 5}, {"title": "My orders are processed quickly", "text": "My orders are processed quickly, and then shipped out just as quickly. I really appreciate being able to place an order so easily!", "rating": 5}, {"title": "I love the pop-up sales", "text": "I love the pop-up sales, especially when I don't miss them!  Ordering is simple and and takes just a few minutes.  Turnaround is incredibly fast which is great when I am getting low on product.  Thank you for your efficiency!", "rating": 5}, {"title": "Lost Empire herbs ", "text": "Easy to order, great product quality and customer service", "rating": 5}, {"title": "The highest quality herds on the market.", "text": "The highest quality herds on the market. ", "rating": 5}, {"title": "The price         5-16", "text": "The price.  I take a few of your products. I have been a customer for a few years and have gotten a few of my friends buying from you. this last sale of 30% off was a great bargain for me. i bought 2-mega bags of pine pollen just to stock up.  I think you should run a sale  ( when ever )  for your loyal customers only.", "rating": 5}, {"title": "The products are good and arrive on…", "text": "The products are good and arrive on time. ", "rating": 5}, {"title": "Detailed information", "text": "Detailed information!  This website offers important details about each product.  There are downloadable pdf files that offer additional information that is helpful to me in making decisions on which product will best meet my health needs.  Keep up the great work!", "rating": 5}, {"title": "Great product and customer service.", "text": "Date of experience: May 16, 2024", "rating": 5}, {"title": "one of the few places we support…", "text": "one of the few places we support because You help folks retirn to Gaia for their medicine.  thank u Chris!❤️🌲", "rating": 5}, {"title": "Always wonderful experience when…", "text": "Always wonderful experience when ordering, as I've been a customer since the superman days.", "rating": 5}, {"title": "Great information and an even…", "text": "Great information and an even easier-to-use site.", "rating": 5}, {"title": "Highest quality products", "text": "Highest quality products, and excellent service", "rating": 5}, {"title": "Lost empire herbs is the best", "text": "Lost empire herbs is the best. I have been buying from them for probably 15 years. ", "rating": 5}, {"title": "Quick response to…", "text": "Quick response to inquiries/questions/concerns", "rating": 5}, {"title": "Website was very easy to navigate", "text": "Website was very easy to navigate, good customer service and my product was shipped quickly.. Two thumbs up 👍👍", "rating": 5}, {"title": "I love the quiz because it allowed me to specifically specify what my health issues are", "text": "I love the quiz because it allowed me it allowed me to answer specifically what my issues were that I needed help with trying to correct. Once I gave answers it then directed me to a specific herb or herbs.  I really like that idea of the quiz.", "rating": 5}, {"title": "Fantastic as usual", "text": "Fantastic as usual. It is my highest priority to have a tested clean product, from a company that has a heart and supports family and well-being. ", "rating": 5}, {"title": "The product always arrives as promised…", "text": "The product always arrives as promised in good form in a timely manner. I really appreciate all the team at Lost Empire and the hard work they put in to give a great product and exceptional customer service! Thanks for all you do it is very much appreciated ! ", "rating": 5}, {"title": "Shockingly Great Stuff!", "text": "Lots and lots of useful information. Extremely helpful how to kind of articles. I started with Pine Pollen tincture it's been great stuff. I need to stick with it though. It knocks out incoming colds like nothing I've ever had. Finally just ordered a bundle of tinctures and can't wait for the experience with the new ones. I will be Lost Empire Herbs customer for life.", "rating": 5}, {"title": "The products are great", "text": "The products are great, the real thing, there are so many supplements out there that are scams, filled with fillers like bioperine. I taste everything that I am taking and thanks to Lost empire herbs, I know when I am getting the real thing. I have been purchasing products from Logan even from before it was lost empire herbs.", "rating": 5}, {"title": "The Best Herbs on the Market…", "text": "I’ve been ordering products from Lost Empire Herbs for many years now, and the products and service has been amazing! Their product information on their website is the best for figuring out what products you need. Keep up the great work.", "rating": 5}, {"title": "The products are very good quality", "text": "The products are very good quality.  Packaging is also top notch. I have never received anything that was broken or leaking unlike some orders from other retailers.", "rating": 5}, {"title": "Dependable", "text": "Dependable ", "rating": 5}, {"title": "Herbs and Customer Service", "text": "Working with customer service is quick and easy. Callie is very helpful. I'm glad I found this company.I like experimenting with many of the different herbs for bettering my health, and I've had lots of success. They have become a crucial part of creating more positive feedback loops, as I work through my health issues. \"you have to take it one day step by step. Lucky thing me have the herbs, high grade, pon deck\" - Brighter Days, Collie Buddz", "rating": 5}, {"title": "The products really work", "text": "The products really work ", "rating": 5}, {"title": "Good stuff", "text": "I appreciate the fact I can call and talk to my person to assist me with my order. Thank you very much. ", "rating": 5}, {"title": "Great for information and best products", "text": "Great for information and best products ", "rating": 5}, {"title": "It was easy to find what I was looking…", "text": "It was easy to find what I was looking for. ", "rating": 5}, {"title": "Great herbs", "text": "Great herbs. Find them helpful ", "rating": 5}, {"title": "Informative and easy-to-use site.", "text": "Date of experience: May 09, 2024", "rating": 5}, {"title": "Love the Stag swag", "text": "Love the Stag swag, and mushroom tinctures. Love the sense of well being, and a natural energy that has to be experienced to be understood. ", "rating": 5}, {"title": "Love ordering from Lost Empire", "text": "Date of experience: May 03, 2024", "rating": 5}, {"title": "Great Website & Products", "text": "The website is great which explains in details about the products so you can make a wise choice! Great Customer Service in responding to request!And the most important Great PRODUCTS!", "rating": 5}, {"title": "Great customer service professional…", "text": "Great customer service professional very knowledgeable about product ", "rating": 5}, {"title": "Mostly your knowledge of your products", "text": "Mostly your knowledge of your products. The detail in your descriptions of your products.And, your dedication and passion shows.I learn so much and love the products.Thank you,Elizabeth Howell", "rating": 5}, {"title": "Everything  was  great", "text": "Date of experience: May 06, 2024", "rating": 5}, {"title": "Friendly and Helpfuk", "text": "The people at LEH are always friendly and helpful! ", "rating": 5}, {"title": "A product like no other product and…", "text": " A product like no other product and works wonders", "rating": 5}, {"title": "I love Lost Empire Herbs products", "text": "I love Lost Empire Herbs products.  Checkout is easy, the web site is easy to maneuver.  I love all the information about each of the herbs.  Thank you for all of this.", "rating": 5}, {"title": "Lions mane, Chaga purchase ", "text": "Found exactly what I wanted on the website, checkout was easy ", "rating": 5}, {"title": "Great service", "text": "Great service, friendly knowledgeable staff and high quality herbs that deliver results.", "rating": 5}, {"title": "I made a mistake and put 2 of the same…", "text": "I made a mistake and put 2 of the same item into my cart. I contacted Empire Herbs and they swapped the product out and fixed it fast. ", "rating": 5}, {"title": "These folks are very responsive and credible", "text": "These folks are very responsive! Also, one of the reasons I order from them is that the site includes numerous references from real studies/data (not just cherry picked internet references). This makes them far more credible, at least in my opinion, than the countless other herb/supplement companies out there. ", "rating": 5}, {"title": "Easy new life  to order and it was very hard to…", "text": "Easy to order and it was very hard to find your website . I’m glad I did all I’m waiting is my order to arrive soon", "rating": 5}, {"title": "Good website!", "text": "Good website with plenty of information and references regarding the pros and cons of the products.", "rating": 5}, {"title": "Very fast shipping", "text": "Very fast shipping, product exactly as described. ", "rating": 5}, {"title": "Great service as well as great customer…", "text": "Great service as well as great customer service!", "rating": 5}, {"title": "A company you can trust.", "text": "This company shines with the light of real integrity. Their products and service are well thought out and trustworthy.", "rating": 5}, {"title": "Good Products, good service", "text": "Lost Empire Herbs is a good company doing good business. Never had any issues with my orders as I recall. I believe the products are good and I know the service is. Thank You Lost Empire Herbs.Ricky~", "rating": 5}, {"title": "EVERYTHING", "text": "Date of experience: April 29, 2024", "rating": 5}, {"title": "Best products hands down", "text": "Best products hands down ", "rating": 5}, {"title": "FAST delivery exellent products.", "text": "Date of experience: April 20, 2024", "rating": 5}, {"title": "Excellent quality", "text": "Excellent quality, good service, and great information.", "rating": 5}, {"title": "First time on Lost Empire Herbs", "text": "Website was easy to navigate, lots of useful info. Ordering was easy.", "rating": 5}, {"title": "Turning back the clock ", "text": "The fact that I'm 63 and had rotator cuff surgery in 2022 has not stopped me from playing the best tennis of my life. Cistanche has had a significant impact in the way I feel and perform. THANK YOU Lost Empire Herbs🙂", "rating": 5}, {"title": "Phoenix Formula slows down Father Time", "text": "Phoenix Formula has been a great herbal addition to my wellness and performance goals for two months now. At 58, I feel like it has been a clean way to support  my goal of slowing down Father Time.", "rating": 5}, {"title": "Always have great experiences with…", "text": "Always have great experiences with orders products and results! I also like the new dropper for my Pine Pollen Tincture!", "rating": 5}, {"title": "All the products I have bought from…", "text": "All the products I have bought from Lost Empire have been hi quality. If I have questions the crew answer in a timely fashion. ", "rating": 5}, {"title": "Always a good product and great service.", "text": "Always a good product and great service. ", "rating": 5}, {"title": "There products work great and inexpensive ", "text": "Great pricing fast and quick response and service ", "rating": 5}, {"title": "You didn’t do anything", "text": "You didn’t do anything ", "rating": 5}, {"title": "Honest company with quality products", "text": "Honest company with quality products ", "rating": 5}, {"title": "I couldn’t find a product I ordered for my…", "text": "I could find a product I ordered for my wife and her knees and couldn’t find it. Contacted customer service and presto, I had it ordered. ", "rating": 5}, {"title": "Fast and efficient", "text": "Fast and efficient, easy to order,and product is legit. Thanks  keep up the good work.", "rating": 5}, {"title": "Website was easy to use abd my call to…", "text": "Website was easy to use abd my call to customer service was very friendly and helpful..", "rating": 5}, {"title": "nice website ", "text": "he order process was OK just waiting on item to be shipped", "rating": 5}, {"title": "Informed regarding my needs!", "text": "Very helpful directly and with “informative” information re what I was ordering and potentially interested in later so I can be educated about my body or  individual needs! ", "rating": 5}, {"title": "Speed of delivery", "text": "Speed of delivery. Jury is still out on the effectiveness of the herbs.", "rating": 5}, {"title": "Quick Shipping and tbsp and tsp are different", "text": "I didn't pay attention to my inventory and didn't order a week in advance. The Pine Pollen was shipped right away and received before I ran out. Great Service. Also I just had VA bloodwork done, I am 67, for Testosterone and my previously low levels are now at a less than 50 year old. The big mistake I was making is 3 Tablespoons not 3 teaspoons per day. It has made significant improvement in my energy levels and performance. ", "rating": 5}, {"title": "Great quality and educational…", "text": "Great quality and educational information ", "rating": 5}, {"title": "Good people to work with ", "text": "Talking to a very nice person and feeling a real connection, just gave me confidence in my decision ", "rating": 5}, {"title": "Always good quality herbs", "text": "Always good quality herbs. Fast shipping. I have only needed help from customer service once and it worked out well in the end. Would highly recommend to others.", "rating": 5}, {"title": "Easy to find and order", "text": "Date of experience: April 20, 2024", "rating": 5}, {"title": "73 retired military veteran", "text": "The product I needed was available and the white papers informative.", "rating": 5}, {"title": "Great Verified Herbs", "text": "Great verified, high quality herbs, fast friendly service, and, oh yea, the products work great for me and my wife.  We rarely go a day without them.  Thank you!", "rating": 5}, {"title": "It took over 24 hours to ship", "text": "It took over 24 hours to ship.Didn't know what typical processing times were. Thanks for the response!", "rating": 5}, {"title": "Simple and efficient online ordering…", "text": "Simple and efficient online ordering platform. Great customer service. Timely delivery. And high-grade products. They are now my sole source of herbal supplements! And they seem like genuine good people on top of that. ", "rating": 5}, {"title": "It made a positive impact physically…", "text": "It made a positive impact physically and mentally.I felt the energy flow through me.", "rating": 5}, {"title": "The information and detail of it…", "text": "The information and detail of it without getting overly academic. Thank you! Bob", "rating": 5}, {"title": "Great service great product", "text": "Great service great product ", "rating": 5}, {"title": "Excellent Service and Excellent product", "text": "Excellent Service and Excellent product ", "rating": 5}, {"title": "Easy website to use", "text": "It was quick and easy to make the order.", "rating": 5}, {"title": "Good product fast shipping", "text": "Good product fast shipping. Some of those herbs are pretty potent! Prett pricey though. Can’t afford to get everything I really want. Would love to see more of the tincture blends too. The synergistic effect of some of the herbs works way better when taken together, and make it alot easier when 3-4 of them are blended into one bottle. Great job guys!", "rating": 5}, {"title": "Excellent quality products and service", "text": "Date of experience: April 19, 2024", "rating": 5}, {"title": "Pleasant Customer Service Rep.", "text": "The young lady who called was very pleasant and gave me the information that I was looking for. ", "rating": 5}, {"title": "Great!", "text": "Price, value, selection,  nobody else comes close. ", "rating": 5}, {"title": "This batch is perfect for my body…", "text": "This batch is perfect for my body chemistry", "rating": 5}, {"title": "Good line of products and explanations…", "text": "Good line of products and explanations easy checkbout", "rating": 5}, {"title": "Great herbs", "text": "Great herbs, i use them every day. Gives me the Energy to keep being active. ", "rating": 5}, {"title": "My orders come pretty fits", "text": "My orders come pretty fits, no problems. I like the option of canceling subscriptions if I choose to. I like to try a product for at least 3 month. Then I can decide if that product is one for me. I love the Pine Pollen Superfood. ", "rating": 5}, {"title": "My family loves your products and…", "text": "My family loves your products and regularly buys various products. From Athena for myself to Mucuna, your products help us stay healthy and strong. Thank you!!", "rating": 5}, {"title": "Lost Empire Herbs Can Be Trusted", "text": "Lost Empire Herbs has been a trust resource for me in the researching of natural products for working towards building a cleaner, healthier way of life. As I am aging, currently 57 years young, I need products that are efficiently effective. Lost Empire Herbs provides tons of information and makes selecting their products seamless and easy. Keep doing your thing LEH!!!!!", "rating": 5}, {"title": "Good quality ", "text": "I love your products. I always feel safe purchasing from lost Empire herbs ", "rating": 5}, {"title": "Quick responses to questions and emails…", "text": "Quick responses to questions and emails always very helpful", "rating": 5}, {"title": "it was easy to order and everything lay…", "text": "it was easy to order and everything lay out fine with some great deals,like that.....!!", "rating": 5}, {"title": "Good Product", "text": "Good Product, good results", "rating": 5}, {"title": "All Love for Lost Empire Herbs!", "text": "All Love for Lost Empire Herbs!A great product and a great team! Thank you so much for your support and health.", "rating": 5}, {"title": "All around good company to do business with ", "text": "All around good experience.  Ordering is easy and products arrived when promised.", "rating": 5}, {"title": "List of ingredients and Explanation of…", "text": "List of ingredients and Explanation of the ingredients is very good. ", "rating": 5}, {"title": "good quality products", "text": "good quality products ", "rating": 5}, {"title": "Great company ", "text": "Although I wish the prices were a lil better or get more for your bucks considering the small size package, I've never had a problem receiving what I ordered and they keep me up to date and the information you give before you purchase a product is great ", "rating": 5}, {"title": "Nice to be able to get what I wanted…", "text": "Nice to be able to get what I wanted after figuring out the options: after that it was very easy to order ", "rating": 5}, {"title": "Big fan of Lost Empire Herbs here!", "text": "I'm a big fan of Lost Empire Herbs! I've been using these products since 2016 and I've been impressed from the first order! Logan is so knowledgeable. I've learned so much from him. As for the quality and performance of these products themselves, I have not found better! Many of the tinctures have become staples for me. Thank you List Empire Herbs for greatly improving my life and we'll being!", "rating": 5}, {"title": "Great company to work with", "text": "Great company to work with.  Fast shipping.", "rating": 5}, {"title": "Love Lost Empire Herbs!", "text": "Date of experience: March 09, 2024", "rating": 5}, {"title": "Navigating the site was very easy.", "text": "Navigating the site was very easy. ", "rating": 5}, {"title": "Honesty", "text": "In a word, information.  I appreciate all of the information your company puts out there regarding not only your own products, but herbs in general.  This concept of cycling your herbs is not something other companies are saying anything about.  No, they sell more supplements when you take them daily, never mind that the efficacy diminishes without cycling.", "rating": 5}, {"title": "Great products", "text": "Great products - as always!", "rating": 5}, {"title": "I trust this company for results!", "text": "I trust this company. Lost Empire Herbs provides the highest-quality products available anywhere and provides noticeable results. I use Thor’s Hammer Formula, Pine Pollen, horny goat Weed, Cistanche, and Shilajit, too. They all provide me with excellent results, energy, and a great feeling.  I like Thor's Hammer because it combines most of these and is probably cheaper in the long run.  ", "rating": 5}, {"title": "The site is very informative about the…", "text": "The site is very informative about the product & the reviews. I liked reading about the three brothers who created the company. Thank You", "rating": 5}, {"title": "My husband told", "text": "My husband toldMe about your products many years ago. I have been consistently been using them the last few years. Amazing products. Please always keep Athena in stock. Thank you!", "rating": 5}, {"title": "I've been ordering for a few years but…", "text": "I've been ordering for a few years but now I've about 6 herb tinctures I order regularly now that I know what my body and mind desires. It's added quality to my life and I take advantage of the ongoing price breaks LEH offers throughout the year. Any issue that arises or questions I have are resolved by the great staff in a timely manner. ", "rating": 5}, {"title": "Quick response", "text": "Quick response, made necessary changes to assure proper delivery of product.", "rating": 5}, {"title": "The orders are clear", "text": "The orders are clear, emails confirming and including tracking number are super helpful. If I ever have any problems the staff is swift to correct or improve my situation. After years of using these products I’ve improved every area of my life and can’t wait to keep growing", "rating": 5}, {"title": "So easy to complete orders and its…", "text": "So easy to complete orders and its always delivered as schedule.  Products never disappoint ", "rating": 5}, {"title": "Great company with a fantastic website", "text": "Great company with a fantastic website. Shipping is very fast. Just remember not all herbs work the same for everybody. ", "rating": 5}, {"title": "Nice folks", "text": "Nice folks, great product!", "rating": 5}, {"title": "Loved using ELK VELVET ANTLER MY BODY…", "text": "Loved using ELK VELVET ANTLER MY BODY FEELS GREAT ", "rating": 5}, {"title": "Easy to order,great product,fast…", "text": "Easy to order,great product,fast delivery.", "rating": 5}, {"title": "Excellent ", "text": "Excellent as always!", "rating": 5}, {"title": "The consistent quality!", "text": "The consistent quality of the products keeps me coming back for more.  The educational videos posted on YouTube provided me with the transparency of the company's processes and sources of herbs. I experienced more energy in my workouts and total well-being.", "rating": 5}, {"title": "Excellent service", "text": "Excellent service,  communication, product. ", "rating": 5}, {"title": "Pine Pollen really works!", "text": "Pine Pollen really works! Both the powder and the tincture.", "rating": 5}, {"title": "Top shelf products and customer service!", "text": "Every product I have used to this point from Lost Empire has met or exceeded my expectations. Thank you Lost Empire for your top shelf products and customer service. ", "rating": 5}, {"title": "Quality products", "text": "Quality products. I do notice a difference. Easy to deal with and easy to order from. Very happy with them as a whole. ", "rating": 5}, {"title": "GREAT PRODUCTS THAT WORK AND GREAT…", "text": "GREAT PRODUCTS THAT WORK AND GREAT TRANSPARENCY ABOUT THE PRODUCTS!", "rating": 5}, {"title": "Always Excellent customer service", "text": "Date of experience: April 01, 2024", "rating": 5}, {"title": "High quality stuff", "text": "High quality stuff, everything I have bought from you guys is amazing. ", "rating": 5}, {"title": "The person who called me back was the best ", "text": "The person who called me back was really good I think her name was Kelly. She answered my question really good and she was really patient", "rating": 5}]