[{"title": "This is my second time purchasing with…", "text": "This is my second time purchasing with more purchases to be made! The items ship out quickly and although it takes 2-3 weeks to deliver, it’s totally worth waiting for! Easy to follow the tracking and the most important thing is that Halara is a reliable company. ", "rating": 5}, {"title": "You will not be disappointed!!!", "text": "Fell in love with the Halara dresses and the great products keep on coming not only am I beyond satisfied with everything I have purchased over the past two years that customer service cannot be beat items sometimes take a little longer than I hope for but that's just me being eager with anticipation for my next addition to the wardrobe! Everything is comfortable, true to size and a great value for the money. The quality and compliments exceeded my expectations every time.", "rating": 5}, {"title": "I bought two different pairs of the…", "text": "I bought two different pairs of the stretchy jeans. They are incredible. I have never liked wearing jeans because of how restrictive they are, and now I can wear jeans that I love, that look good, feel good, and I could do anything in them. I’m probably going to buy more.Also my partnered accidentally dried them which normally shrinks all my new stuff. But these didn’t shrink at all. ", "rating": 5}, {"title": "Always a little hesitant to buy online…", "text": "Always a little hesitant to buy online but I saw many reviews on the leggings and they did not disappoint!  I love them and will be ordering more.  Beautiful fit, and amazing comfort.  Love the fabric!  Great product!!", "rating": 5}, {"title": "The leggings are good. ", "text": "The leggings were great, I understand why they took long to get to me but it was still a little annoying. They for nice and are true to size. I definitely recommend getting them, I’ll definitely buy more. It’s a really good price compared to LULU. 10/10 recommend. Quality is fabulous.", "rating": 5}, {"title": "I was skeptical but it’s legit", "text": "I was skeptical but it’s legit. It’s not Amazon fast, but Halara isn’t Amazon, so don’t expect it to arrive the next day. I love the pants and the stretch of the material. I’ve ordered off of Amazon before for a stretchy and comfortable pant and nothing compares to Halara flex. ", "rating": 5}, {"title": "Love!!!", "text": "Love my denim skirt! I  always leary of ordering from online retailers… but Halara was great. Great quality, price and fast shipping! I would definitely order again. ", "rating": 5}, {"title": "Very Happy Customer", "text": "I had a great experience with this site! The website is easy to navigate, and my purchases arrived exactly when promised. The style, material, and fit were just as advertised, and I couldn’t be happier with my order. Highly recommend!", "rating": 5}, {"title": "Very happy ", "text": "The trousers are very comfortable, and fit perfectly. The only downside of ordering from Halara is the length of time it takes to receive your order, however this time it was with me in just over a week so really happy. ", "rating": 5}, {"title": "my 3rd order went as smooth as the…", "text": "my 3rd order went as smooth as the other 2, fast shipping, correct merch, nothing to complain about.The Flex Jeans are all super comfy and stylish and I love the Tall options since I am 5.11\"", "rating": 5}, {"title": "Good service", "text": "I ordered 5 items and had to return 3 of it, because they didn't fit wel. First I had some problems by using the returnsite, but the customer service helped me kindly and quickly to fix it. ", "rating": 5}, {"title": "So comfortable!", "text": "Package arrived in a timely fashion.  Pants fit wonderfully (except too long but that's almost always the case) and are so comfortable. Love them!", "rating": 5}, {"title": "Always great customer service", "text": "Always great customer service. Any time anything hasn’t fit right or the fabric wasn’t what was expected etc., they’ve handled it quickly and in a way that worked for me. I love the clothes and quality and fast customer service. ", "rating": 5}, {"title": "Love my pants!", "text": "The pants that I ordered are extremely comfortable and fits as expected.  It's made of a great material.  I'm very pleased with my purchase and will probably order again in the future.", "rating": 5}, {"title": "Best compression leggings and tights on the market.", "text": "Absolutely the best compression leggings and tights for tummy and butt on the market. Get the softly tummy high rise leggings tights. Buttery soft and you will look amazing!", "rating": 5}, {"title": "Easy ordering", "text": "Easy ordering, size guide is good, quality is good too. Very comfortable clothing. I'm in the UK so there is always a bit of a wait for delivery but I plan in advance! ", "rating": 5}, {"title": "Lovely jean/leggings", "text": "These jeans are so adorable! They fit so well. They really look like jeans, but not having zippers or buttons is so amazing! I have a similar style, but they are lycra, in black, and the length is perfect; I'm not sure why these ones are a little long with tennis shoes. I bought the XS Petite. I'll need to take them to the seamstress. I tried them with boots, and they are OK, but I know that on weekends, I would like to wear them with tennis shoes. ", "rating": 5}, {"title": "Site is easy to use", "text": "Site is easy to use. Can always find a helpful review from someone my size to be able to order correctly and visualize how someone like me might really look in the clothes!", "rating": 5}, {"title": "Really happy with the two pairs of…", "text": "Really happy with the two pairs of trousers I ordered. They are the perfect size and fit, great quality and they look lovely on- both pairs. Will definitely be a returning customer in the future. Great company.", "rating": 5}, {"title": "Love these stylish, comfy jeans!", "text": "These jeans are cute, flattering and comfy! Looking forward to wearing them this fall. I had a great experience shopping with this company. ", "rating": 5}, {"title": "I ordered 2 pairs of trousers ", "text": "I ordered 2 pairs of trousers, which didn’t fit well. My return was accepted with no problem and I received my refund promptly. Thank you for the excellent service.", "rating": 5}, {"title": "My purchasing experience was excellent", "text": "My purchasing experience was excellent, the app kept me informed about the delivery and the pieces arrived perfect and on time. The clothing fit me perfect, they do a great job.", "rating": 5}, {"title": "Got my order before expected and…", "text": "Got my order before expected and everything fit even better than anticipated. I’ve already been getting compliments on my new jeans!", "rating": 5}, {"title": "Lovely flattering jeans & trousers", "text": "Fast delivery and absolutely love my jeans and trousers. They are exactly as described - soft and stretchy. They are true to size and the short length is perfect for me - 5’2”. Very flattering style. ", "rating": 5}, {"title": "Love them!!!", "text": "I loved both styles of pants that I bought!! They fit perfectly and are so comfortable. I’m glad that long sizes are now being offered since most of the regular styles are too short on me. I will definitely buy more!", "rating": 5}, {"title": "Great Halara shopping ", "text": "I loved the prompt delivery as I had paid for express delivery, and the fit and quality of the garments are excellent! Very happy with my Halara experience.", "rating": 5}, {"title": "Amazing quality", "text": "Amazing quality, super flattering on my baby bump! Love this in pregnancy and will be great postpartum. ", "rating": 5}, {"title": "Fast shipping!", "text": "Shipping was super fast and the quality of my skirt is amazing. Will definitely order from Halara again in the future.", "rating": 5}, {"title": "I absolutely love all of the different…", "text": "I absolutely love all of the different pants I have bought.  They fit perfectly and are super comfortable.  I am hooked on Halara!!", "rating": 5}, {"title": "I’ve bought 4 pairs of the stretchy…p", "text": "I’ve bought 4 pairs of the stretchy trousers and they are amazing I’ll definitely be ordering again great service and quick delivery ", "rating": 5}, {"title": "Perfect pants for teachers!", "text": "I absolutely love the Halara 3 button pants.  As a teacher, I need comfortable, classy, and durable dress pants.  These fit the bill and look great!", "rating": 5}, {"title": "Material and quality is great for price. Comfort but professional/stylish", "text": "There were plenty of options, styles and colors. Clothes can be dressed up or casual. Delivery was about 2 weeks which is great ", "rating": 5}, {"title": "Great clothing.…", "text": "This is the 5th garment I have purchased from Halara. I love their products and am looking forward to purchasing more in the future.", "rating": 5}, {"title": "Loved my pants! Nice surprise", "text": "You have to wait for the delivery, but it all went smoothly. My pants fit incredible. I sized down 1 size. Beautiful stretchy fabric", "rating": 5}, {"title": "I have totally enjoyed wearing your…", "text": "I have totally enjoyed wearing your items as well enjoyed getting compliments on how I look wearing them.", "rating": 5}, {"title": "Love the pants I ordered", "text": "Love the pants I ordered! Fit perfectly and look amazing. Can wear them for a professional look for work and casual for a night on the town! Looking to buy more!!", "rating": 5}, {"title": "Comfy wear", "text": "Easy ordering, loved the fact that it's a pre order to go against waste.Trousers are so comfy but still stylish ", "rating": 5}, {"title": "Excellent quality fabrics and…", "text": "Excellent quality fabrics and construction. Great return policy for clothes that did not fit. ", "rating": 5}, {"title": "Trust worthy company ", "text": "The item was shipped timely and with tracking. The pants were exactly what I expected and will purchase more in the future.", "rating": 5}, {"title": "I really like the style and feel of the…", "text": "I really like the style and feel of the clothing. I have a disease where I have to wear clothes that will not irritate my skin and so far the pants that I have ordered are very nice", "rating": 5}, {"title": "Good company", "text": "Good company. Good quality products. I’ve ordered several items from them and never had any problems. ", "rating": 5}, {"title": "I loved the product but then only…", "text": "I loved the product but then only dissatisfaction I had was the time it took for delivery", "rating": 5}, {"title": "I really like the jeans I ordered", "text": "I really like the jeans I ordered. You are very prompt on receiving my orders. I just would like to get a return label to mzke a.return easier.", "rating": 5}, {"title": "Easy online ordering", "text": "Easy online ordering.   Item was nicer than expected.   Fits true to size.", "rating": 5}, {"title": "Love the pants I ordered", "text": "Love the pants I ordered! So comfortable and the fit is perfect! I will definitely order again. ", "rating": 5}, {"title": "These jeans are comfortable and fit perfectly.", "text": "These jeans are comfortable, not too heavy and fit perfectly! My husband says they're sexy on me, too.", "rating": 5}, {"title": "I really like the fact you make pants…", "text": "I really like the fact you make pants for the short girls. I am 5'3 and the length is perfect on the petite sizing. Pants are very comfortable and the quality is there! ", "rating": 5}, {"title": "Clothing is actually lovely", "text": "Clothing is actually lovely! Delivery takes quite a while, but the wait is worth it", "rating": 5}, {"title": "I love to product", "text": "I love to product. The pants are great quality. They fit good.The customer service is outstanding!!!", "rating": 5}, {"title": "cargo pants", "text": "Shipping was very fast.  Merchandise is good at an affordable price!", "rating": 5}, {"title": "Items ordered what exactly what was…", "text": "Items ordered what exactly what was expected and the fit was awesome!  I’m 5.2 135lbs and the small fits perfect.  Pants were a size 6.  Perfect fit", "rating": 5}, {"title": "Comfortable and great service ", "text": "Great pants and delivery was excellent. Bought a pair for sister, so comfortable.", "rating": 5}, {"title": "It takes a little longer due to…", "text": "It takes a little longer due to international shipping but it’s worth it! I love Halara!", "rating": 5}, {"title": "Quality and fit of the clothes is…", "text": "Quality and fit of the clothes is great! I got so many compliments from my coworkers on my outfits!", "rating": 5}, {"title": "Quality products ", "text": "The fit and quality of the pants are fabulous. Ordering again. Order came very quickly as well.", "rating": 5}, {"title": "Love these jeans", "text": "Jeans fit great I love the fabric. Wash and dry well. I have ordered another pair. Fast service received in Canada in less than a week", "rating": 5}, {"title": "Quick & Easy", "text": "It was very easy to navigate the site on my phone, view the clothing, and purchase.", "rating": 5}, {"title": "Nice dress trousers ", "text": "Order two pairs of stretchy slightly flared trousers (navy and black). Really pleased with the quality and the fit. Nice dress trousers for work or going out.", "rating": 5}, {"title": "This is my 3rd pair of Halara pants and…", "text": "This is my 3rd pair of Halara pants and I've purchased two pair for my daughter-n-law.  We love the trouser pants.  So comfortable yet classy.", "rating": 5}, {"title": "I love my overalls and will definitely…", "text": "I love my overalls and will definitely be ordering more very soon!!", "rating": 5}, {"title": "Very comfortable pants and love the…", "text": "Very comfortable pants and love the fabric. I will be ordering again.", "rating": 5}, {"title": "Fab Pants!", "text": "Knit Jeans are truly amazing. Great quality! Loved all the products. Highly recommend. ", "rating": 5}, {"title": "I loved the pants that I ordered", "text": "I loved the pants that I ordered, they took 3 weeks to get here. The good thing is that I could track them all the way. Would definitely recommend! ", "rating": 5}, {"title": "JUST FABULOUS! ", "text": "Quick delivery. Product exactly as described. Excellent value for money. ", "rating": 5}, {"title": "perfect fit", "text": "I bought a petite/medium. I am 5'1\" tall and a do NOT have to shorten these pants. The pants are comfortable, and they have pockets.", "rating": 5}, {"title": "Great quality", "text": "Great quality, they fit beautifully, I will be buying more!", "rating": 5}, {"title": "Great products!", "text": "Very pleased with my purchase of Halara tights. Good quality, good price, good delivery.", "rating": 5}, {"title": "Like the picture ", "text": "It was easy to purchase, it was quick delivery. I like the pants I bought . Exactly as shown in the pictures ", "rating": 5}, {"title": "Tennis Skirt", "text": "Shopping was quick and easy. I love the tennis skirt that I ordered. It is soft material and true to size.", "rating": 5}, {"title": "Great pants", "text": "Great pants. Fit perfectly and were a very nice weight material. ", "rating": 5}, {"title": "I just go my package,love the fabric…", "text": "I just go my package,love the fabric and the size perfect,thank you vso much", "rating": 5}, {"title": "10 out of 10", "text": "The clothes shipped quickly and honestly these are my new favorite jeans. ", "rating": 5}, {"title": "Very comfortable great for tennis…👍👍👍", "text": "Very comfortable great for tennis pickle ball nice stretch.", "rating": 5}, {"title": "I am so happy for find halara…", "text": "I am so happy for find halara everything is perfect the pant and service  is great to so thank you ", "rating": 5}, {"title": "Comfy Pants", "text": "Color, fit and style are great. Super comfy and perfect for work. ", "rating": 5}, {"title": "Great items", "text": "Great items, super comfy and really beautiful. True to dize", "rating": 5}, {"title": "It arrived pretty fast and it’s exactly…great experience ", "text": "It arrived pretty fast and it’s exactly as advertised ", "rating": 5}, {"title": "Fast shipping", "text": "Fast shipping, great product, true to size, affordable. ", "rating": 5}, {"title": "I love my pants but I think I should…", "text": "I love my pants but I think I should order a size smaller next time. The quality is amazing. Thank you", "rating": 5}, {"title": "Great choice", "text": "Great choiceYou had all the sizesQuick deliveryGreat merchandise ", "rating": 5}, {"title": "Easy to order", "text": "Very easy to order and customer service answered quickly. ", "rating": 5}, {"title": "Ordering was simple", "text": "Ordering was simple.  And the products I purchased are amazing!!", "rating": 5}, {"title": "I love the pants", "text": "I love the pants. Great fit, great material, good quality for the price.", "rating": 5}, {"title": "Great service nice clothing", "text": "Great service nice clothing. I ordered the wrong size and they took care of me right away. Will purchase from again. ", "rating": 5}, {"title": "There clothing is made really well and…", "text": "There clothing is made really well and reasonable.", "rating": 5}, {"title": "Easy to order and track", "text": "Easy to order and track, arrived quickly.  Loved the way the pants fit, just as described.", "rating": 5}, {"title": "Love", "text": "I've loved all my clothes and when I did have a complaint they took care of me quickly ", "rating": 5}, {"title": "Everything I purchase is High Quality…", "text": "Everything I purchase is High Quality and Beautiful!", "rating": 5}, {"title": "Product Quality", "text": "Product Quality and good Marketing I want it all", "rating": 5}, {"title": "Fast shipping.", "text": "Fast shipping.  True to size. Excellent fabric. ", "rating": 5}, {"title": "Received in a timely manner and good…", "text": "Received in a timely manner and good quality.", "rating": 5}, {"title": "Perfect fit", "text": "The material is so soft and they fit very well! ", "rating": 5}, {"title": "Super fast shipping", "text": "Super fast shipping! Great quality clothes. ", "rating": 5}, {"title": "Easy ordering fast service and my…", "text": "Easy ordering fast service and my clothing was Awesome!", "rating": 5}, {"title": "The outstanding fabric quality and…", "text": "The outstanding fabric quality and budget-friendly prices are truly impressive. Moreover, customer service is exceptionally accessible, and the designs and fittings demonstrate exceptional craftsmanship.", "rating": 5}, {"title": "Size was perfect", "text": "Size was perfect! Items exactly as advertised", "rating": 5}, {"title": "Purchaser ", "text": "The jumper is adorable easy to wear and so cute!", "rating": 5}, {"title": "Great overalls ", "text": "Great clothes and they get here when they get here. I get so many compliments in my overalls 😚", "rating": 5}, {"title": "Great fit and amazing quality", "text": "Great fit and amazing quality.  Very comfortable ", "rating": 5}, {"title": "Easy to order great pants", "text": "Easy to order. Great fit. So comfortable. ", "rating": 5}, {"title": "Fit great", "text": "Fit great! True to size. Nice material", "rating": 5}, {"title": "Reliable Company", "text": "This company is doing exactly as advertised. Delivery & quality all good. ", "rating": 5}, {"title": "These pants feel so light and dressy enough for my job or night out. ", "text": "These pants feel so light, look dressing enough for my job and are stretchy.  ", "rating": 5}, {"title": "The best dresses I have bought in a…", "text": "The best dresses I have bought in a long time! Bottoms are amazing, feels like second skin. Thank you 😊", "rating": 5}, {"title": "Absolutely love your clothes", "text": "Absolutely love your clothes!  Fit is great and so is the quality.", "rating": 5}, {"title": "Great", "text": "Excellent service and delivery. Would def buy again", "rating": 5}, {"title": "It was very easy to order .", "text": "It was very easy to order and alot of choices for style and color.", "rating": 5}, {"title": "Great quality", "text": "Great quality, accurate sizing, and unique design", "rating": 5}, {"title": "Love Them", "text": "Very easy to order. Run great deals. Very well made clothes. I love there pants. Shipping time was pretty good", "rating": 5}, {"title": "Hassle free material was soft loved…", "text": "Hassle free material was soft loved color", "rating": 5}, {"title": "The fit and comfort", "text": "The fit and comfortTimely delivery ", "rating": 5}, {"title": "Leggings are fabulous", "text": "Leggings are fabulous,  best iv ever had !", "rating": 5}, {"title": "Good quality staff", "text": "Good quality staff, fit perfect, nice. ", "rating": 5}, {"title": "Ease of order and prompt delivery.", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "Great customer service", "text": "Great customer service, great communication in a timely manner. Thank you", "rating": 5}, {"title": "Good value", "text": "Good value, reasonable delivery time and very comfortable jeans!", "rating": 5}, {"title": " Shopping ", "text": "Always easy to shop and everything fits perfectly!", "rating": 5}, {"title": "Great fit", "text": "Great fit, good service, arrived on time ", "rating": 5}, {"title": "Good quality and exactly similar to pic", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "Love the material on my body!! Will order again", "text": "Love the material on my body!!", "rating": 5}, {"title": "I appreciate all the speedy after…", "text": "I appreciate all the speedy after purchase support. ", "rating": 5}, {"title": "These pants are so comfortable!", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "Navigating the website", "text": "Navigating the website, ordering the items and receiving them was an easy process.", "rating": 5}, {"title": "excelente price the fit das perfect", "text": "Date of experience: October 13, 2024", "rating": 5}, {"title": "God quality clothes as described", "text": "God quality clothes as described. Fantastic packaging. ", "rating": 5}, {"title": "Great customer service ", "text": "Great customer service Cute clothes ", "rating": 5}, {"title": "Great company", "text": "Great company! Excellent quality clothes, good service and communication. Love them! ", "rating": 5}, {"title": "Excellent", "text": "Excellent. High quality. Will definitely buy again ", "rating": 5}, {"title": "They fit well", "text": "They fit well, they look great, and they are reasonably priced!  My new go to!", "rating": 5}, {"title": "Speedy delivery and great jeans. I love them they are comfortable.", "text": "Speedy delivery and great jeans.", "rating": 5}, {"title": "Fit the bum", "text": "Fast delivery if a great product.", "rating": 5}, {"title": "Good products!!", "text": "Great products and delivery time", "rating": 5}, {"title": "The product is so soft", "text": "The product is so soft, feels so comfortable.", "rating": 5}, {"title": "Fash shipping", "text": "Fash shipping, easy order placement.", "rating": 5}, {"title": "I love them", "text": "I love them.  They look great and are so comfortable. Just bought more.  ", "rating": 5}, {"title": "Excellent customer service ", "text": "I’m very happy with my new jogging pants, turned out great ", "rating": 5}, {"title": "Love the quality and fast shipping", "text": "Love the quality and fast shipping ", "rating": 5}, {"title": "Comfortable ", "text": "True to size and comfortable.", "rating": 5}, {"title": "I love the pants and everyone is so…", "text": "I love the pants and everyone is so helpful.", "rating": 5}, {"title": "I really love this pants ,fit perfectly…", "text": "I really love this pants ,fit perfectly for my petite body, 😍 ", "rating": 5}, {"title": "Easy to order and packaged well", "text": "Date of experience: November 06, 2024", "rating": 5}, {"title": "Very soft ", "text": "Very soft quality fabric", "rating": 5}, {"title": "they arrived on time and the 2X are…", "text": "they arrived on time and the 2X are hella comfy! 5' and 189 lbs", "rating": 5}, {"title": "Efficient", "text": "Quick delivery, reasonable price, good product", "rating": 5}, {"title": "Clothes fit very well", "text": "Clothes fit very well. Very flattering. ", "rating": 5}, {"title": "Comfort", "text": "Comfort, quality and price", "rating": 5}, {"title": "Perfect service and Nice jumpsuit", "text": "Perfect service and Nice jumpsuit ", "rating": 5}, {"title": "Was easy to order and receive", "text": "Was easy to order and receive ", "rating": 5}, {"title": "Very easy to return items", "text": "Very easy to return items. That is something I value ", "rating": 5}, {"title": "good service and fast delivery", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "Customer service made my return easy.", "text": "Date of experience: October 29, 2024", "rating": 5}, {"title": "Very pleased with the quality of the…", "text": "Very pleased with the quality of the dresses and skorts!  ", "rating": 5}, {"title": "Great quality.", "text": "Great quality.Fit true to size.Love these pants.Thank you ", "rating": 5}, {"title": "Love your Clothes they hold up well", "text": "Love your Clothes they hold up well. And they don’t break the bank", "rating": 5}, {"title": "Love the pants", "text": "Love the pants.  Shipping a little slow but worth it!", "rating": 5}, {"title": "Easy to return items that did not fit.", "text": "Date of experience: October 26, 2024", "rating": 5}, {"title": "Pants fit great i love style and colors", "text": "Pants fit great i love style and colors ", "rating": 5}, {"title": "Won’t disappoint ", "text": "Very happy with my first purchase ever ", "rating": 5}, {"title": "I can not get enough of the pants", "text": "I can not get enough of the pants! They are amazing!", "rating": 5}, {"title": "Great fit and just love these leggings.", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "I love the styles", "text": "I love the styles, the fabrics and the fit. Make more petites!", "rating": 5}, {"title": "My halara denim wide leg trousers are…", "text": "My halara denim wide leg trousers are fantastic. True to size. Nice cut too. ", "rating": 5}, {"title": "Very good quality", "text": "Very good quality ", "rating": 5}, {"title": "Love everything I order from Halara!", "text": "Love everything I order from Halara! ", "rating": 5}, {"title": "Love it all!", "text": "Love it all!! Soft, comfy, and fit great!!! ❤️", "rating": 5}, {"title": "Love the quality", "text": "Love the quality ", "rating": 5}, {"title": "Quick response", "text": "Quick response. Good customer service. ", "rating": 5}, {"title": "I love the clothes I’ve purchased from Halara! They fit well and the material is of good quality. The delivery time is good, too!", "text": "I love the clothes I’ve purchased from ", "rating": 5}, {"title": "Fast and efficient!", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "Pants are great !!", "text": "Pants are great !!! Took long to get them but I love them ", "rating": 5}, {"title": "Fit exactly as I had hoped!", "text": "Fit exactly as I had hoped! ", "rating": 5}, {"title": "Great fit & super comfortable", "text": "Great fit & super comfortable ", "rating": 5}, {"title": "Good products", "text": "Good products, reasonable delivery time.", "rating": 5}, {"title": "Easy to shop online.", "text": "Easy to shop online. ", "rating": 5}, {"title": "Nice quality", "text": "Very nice fabric and fit", "rating": 5}, {"title": "Easy to order", "text": "Easy to order. Shipped quickly. ", "rating": 5}, {"title": "I love my sweater!!", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "Good Job!", "text": "Service IS good and fast!", "rating": 5}, {"title": "Great products", "text": "Great products.  Good prices.  Good service.", "rating": 5}, {"title": "Love the quality and fit", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "Love the jumpsuit-super comfy and…", "text": "Love the jumpsuit-super comfy and stylish!", "rating": 5}, {"title": "The feel of the material is spectacular", "text": "The feel of the material is spectacular ", "rating": 5}, {"title": "I have bought pants and I like them", "text": "Date of experience: November 07, 2024", "rating": 5}, {"title": "My picky teen LOVES these pants!", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "Everything was great!", "text": "Everything was great!! Thank you ", "rating": 5}, {"title": "Everything fit according to size guide", "text": "Prompt delivery and packaged appropriately", "rating": 5}, {"title": "Thank you", "text": "Thank you,  very good. ", "rating": 5}, {"title": "The best pants around!!", "text": "Date of experience: October 29, 2024", "rating": 5}, {"title": "GREAT CUSTOMER SERVICE.", "text": "GREAT CUSTOMER SERVICE. ", "rating": 5}, {"title": "Amazing quality", "text": "Very nice material ", "rating": 5}, {"title": "Quick delivery", "text": "Very nice tights.", "rating": 5}, {"title": "Super 👌", "text": "Bequem, stylish. 👍😎", "rating": 5}, {"title": "Pants fits well", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "Easy and quick!", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "Love the fit.- new customer", "text": "Love the fit. ", "rating": 5}, {"title": "Fast delivery", "text": "Fast delivery ", "rating": 5}, {"title": "Excellent customer service!", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "Loved everything !", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "Thanks you ", "text": "All - Thanks", "rating": 5}, {"title": "Excellent service", "text": "Date of experience: July 18, 2024", "rating": 5}, {"title": "Love the jeans but should have ordered…", "text": "Love the jeans but should have ordered a size smaller", "rating": 5}, {"title": "Such lovely trousers", "text": "Such lovely trousers,  so comfortable and stylish.  Easy purchase and speedy delivery. Thank you ", "rating": 5}, {"title": "It was good!", "text": "Date of experience: October 28, 2024", "rating": 5}, {"title": "Love these leggings", "text": "Love these leggings. True fit. Quick delivery. Great price. ", "rating": 5}, {"title": "Great quality", "text": "Great quality, especially love the blue jeans and the stretching material right to the size.", "rating": 5}, {"title": "Communication was very good", "text": "Communication was very good, thanks very much ", "rating": 5}, {"title": "Best jeans ever", "text": "Best jeans ever!  So comfortable, great length!", "rating": 5}, {"title": "I don’t like the long wait to get the…", "text": "I don’t like the long wait to get the product, but other than that i love the clothing.", "rating": 5}, {"title": "Delivered quickly considering my order…", "text": "Delivered quickly considering my order was from the UK. Trousers were well made and. Comfortable fit", "rating": 5}, {"title": "Flex pants and jeans- love them", "text": "Ordered the flex pants and jeans- love them!  So comfy yet look so nice!", "rating": 5}, {"title": "Great style leggings", "text": "Great style leggings, I haven't seen before. They're also very comfortable. Might get another pair. They are well made. ", "rating": 5}, {"title": "Loved the fit and style", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "I absolutely love them", "text": "I absolutely love them!  They’re soft and comfortable.  The only thing I wish they would made them for short people some of them are super long for me.  I’m only 5’3” but other than that l.  I absolutely love them!", "rating": 5}, {"title": "Great service & jeans", "text": "Great service, really beautiful fitting jeans. Arrived within a week.", "rating": 5}, {"title": "I love Halara the servise is amazing…", "text": "I love Halara the servise is amazing and the pants i brought are really comfortable and soft ", "rating": 5}, {"title": "Good product and quick delivery", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "I got one and going to have another…", "text": "I got one and going to have another two!! Love it so comfortable ♥️", "rating": 5}, {"title": "I have several pair of Halara yoga…", "text": "I have several pair of Halara yoga pants that I wear to work almost every day. They are the most comfortable pants that I own and look like dress pants when paired with a dressy top. I ordered two pair for my elderly mother, and while the size was incorrect on my part, they made returning them easy and I was then able to order the correct size. Very good customer service!", "rating": 5}, {"title": "Good quality trousers at good prices", "text": "Date of experience: October 24, 2024", "rating": 5}, {"title": "They fit so amazing!!", "text": "They fit so amazing!!  ", "rating": 5}, {"title": "The best leggings EVER ", "text": "These leggings fit so well, and they don't pick up lint and fuzz like other leggings. IYKYK🤩 ", "rating": 5}, {"title": "Comfy and soft …", "text": "Ordered two pairs of Halara wide leg jeans/ stretchy/ soft denim, little scared they wouldn't fit but omg they are a fantastic fit, love them. Ordering was easy, delivered within a two week time frame, packaged lovely, with a free gift too! I will be ordering more in the future, thank you xx", "rating": 5}, {"title": "Lovely products at great prices", "text": "Lovely products at great prices. Great quality.", "rating": 5}, {"title": "I absolutely love everything I’ve…", "text": "I absolutely love everything I’ve gotten from this company. I get compliments every time I wear their clothes. ", "rating": 5}, {"title": "My favorite pants", "text": "My favorite pants comes from Halara", "rating": 5}, {"title": "Great product ", "text": "The trousers came when they said they would. Very pleased with the quality and fit. ", "rating": 5}, {"title": "Fabulous trousers ", "text": "Fabulous trousers , superb quality,  so happy with this purchase 😀 ", "rating": 5}, {"title": "Pants fit great", "text": "Pants fit great. I order the XL tall as I am 5’10” and 200#. I prefer them to not be tight in the waist, seat or thighs. Just the fit I like. ", "rating": 5}, {"title": "These are my new favorite pants!!!", "text": "These are my new favorite pants!!!! Great quality and so comfortable. Just ordered a couple more! 🙂", "rating": 5}, {"title": "Great product ", "text": "Great product", "rating": 5}, {"title": "Easy refund", "text": "Easy refund ", "rating": 5}, {"title": "This is the third time I have ordered…", "text": "This is the third time I have ordered from this company, and I had my order sent to a different address on this last order. I received my order in a timely manner and, as with my earlier orders, was rather impressed with the quality of the material. On my first order, I ordered the black, and I regret not ordering more, as my first pair of black is slightly discoloring after many washes. I ordered them in the spring. ", "rating": 5}, {"title": "I LOVE LOVE my pants", "text": "I LOVE LOVE my pants!  I have now bought 4 pairs of them and have my co-workers ordering them.  Great product.", "rating": 5}, {"title": "Great quality perfect fit and easy…", "text": "Great quality perfect fit and easy shopping experience if you need to return items ", "rating": 5}, {"title": "Great cord trousers", "text": "Great trousers, really comfy, look fantastic and fit well. Delivery details via the app was clear and updated well. Will definitely shop again ", "rating": 5}, {"title": "The quality and the texture of the…", "text": "The quality and the texture of the material is amazing. The fit is perfect!", "rating": 5}, {"title": "Quality and fit of the pants were 5…", "text": "Quality and fit of the pants were 5 stars all the way. ", "rating": 5}, {"title": "Quick and cheap", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "Great product/delivery times", "text": "Great product - sometimes takes a long time to get delivered.", "rating": 5}, {"title": "So impressed!", "text": "I had seen the leggings on ads all over my social media, so I thought I would take a gamble on them. Happy to say that I am super impressed by the quality. Sizing is perfect, they're really soft but also they feel supportive.", "rating": 5}, {"title": "As described ,", "text": "As described ,, absolutely great jeans and leggings , and kept informed of order and delivery times ", "rating": 5}, {"title": "Amazing", "text": "Amazing. Kept me updated on progress. I understand the extreme long wait to receive your purchase, however seems too long.", "rating": 5}, {"title": "Good quality for price", "text": "Very quick service and the products seem to be better quality than other online suppliers", "rating": 5}, {"title": "Good morning", "text": "Good morning. My granddaughter recommended this company. I did order 2 pairs and received them. This site is easy to order , very quick in responding and in delivering. I am very pleased with the merchandise I ordered. Perfect fit and quality! Thank you.. ", "rating": 5}, {"title": "Great quality ", "text": "Easy buying process, items arrived in good time. Trousers really nice and comfortable, true to size ", "rating": 5}, {"title": "Extremely comfortable for a formal…", "text": "Extremely comfortable for a formal /semiformal wear. Satisfied with my purchase. ", "rating": 5}, {"title": "This is my 3rd order and will not be the last- addicted!", "text": "Everything I buy is as expected from the website information.I love these clothes, fit well ( wish you offered more styles in petite) stylish and extremely comfortable.I wear them to dance and for day to day, always get compliments. Lots of friends now ordering too.This is my 3rd order and will not be my last.", "rating": 5}, {"title": "Great products and good customer…", "text": "Great products and good customer service. One item didn't fit and they were really helpful with the return process ", "rating": 5}, {"title": "Excellent  ", "text": "Easy website and ordering process Efficient service Excellent quality items Very well packaged ", "rating": 5}, {"title": "Nice jeans. ", "text": "The jeans are as expected. I bought regular length but needed petite so I have ordered again. ", "rating": 5}, {"title": "Arrived on time", "text": "Arrived on time. Quality of product is exceptional. Will definitely be buying from you in future!", "rating": 5}, {"title": "Great quality clothing ", "text": "Great quality clothing and efficient service", "rating": 5}, {"title": "My items which I love arrived in good…", "text": "My items which I love arrived in good time ", "rating": 5}, {"title": "Great quality and good range of…", "text": "Great quality and good range of clothing.", "rating": 5}, {"title": "Everything I have brought has been spot…", "text": "Everything I have brought has been spot on.", "rating": 5}, {"title": "Love the trousers.", "text": "Love the trousers. ", "rating": 5}, {"title": "Order arrived so quick and the trousers…", "text": "Order arrived so quick and the trousers are excellent quality", "rating": 5}, {"title": "Great product and excellent quality…", "text": "Great product and excellent quality thank you!!!", "rating": 5}, {"title": "Easy to order", "text": "Easy to order, arrived in good time and a very nice product. I’ll be ordering again. ", "rating": 5}, {"title": "Great Brand & Quality", "text": "Amazing experience and they fit so well. Very great quality ", "rating": 5}, {"title": "Amazing customer service ", "text": "Bought a pair of jeans too small customer service was amazing received my refund very quickly ", "rating": 5}, {"title": "Love the products", "text": "Love the products - great quality and fit perfectly. ", "rating": 5}, {"title": "Love the clothes.", "text": "Date of experience: October 29, 2024", "rating": 5}, {"title": "Very comfortable and look just like…", "text": "Very comfortable and look just like jeans", "rating": 5}, {"title": "The pants were so comfortable", "text": "The pants were so comfortable. Very flattering fabric with a good feel.", "rating": 5}, {"title": "Great product", "text": "Great product. Quality fabric with great fit x", "rating": 5}, {"title": "Just received my jeans and they are…", "text": "Just received my jeans and they are fabulous - so soft and great stretch but still a fabulous fit with no bagging ", "rating": 5}, {"title": "Perfect", "text": "PerfectThese trousers are a perfect fit they have a comfy feel.Love the colours and delivery was good ", "rating": 5}, {"title": "Shopping is easy", "text": "Shopping is easy, sizing is always right! My item arrives when they say it will. ", "rating": 5}, {"title": "Had a great experience", "text": "My order arrived quickly and the products were well made, very comfortable and flattering.", "rating": 5}, {"title": "Fast and easy resolution.", "text": "Fast and easy resolution. ", "rating": 5}, {"title": "Excellent fit", "text": "Excellent fit. So many compliments. Love these jeans. Immediately ordered 2 more pairs! ", "rating": 5}, {"title": "So good!!!!", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "Excellent clothing and material is high quality ", "text": "Excellent style! You won’t be disappointed ", "rating": 5}, {"title": "Glad I gave the ad a try!", "text": "Great products and amazing customer service!", "rating": 5}, {"title": "The perfect fit", "text": "The perfect fit. No sagging, perfect stretch.  Slacks for all occasions…I am impressed with the quality and again, the perfect fit!!! ⭐️⭐️⭐️⭐️", "rating": 5}, {"title": "I LOVE halara pants", "text": "I LOVE halara pants! So comfortable and flattering!!! ", "rating": 5}, {"title": "Very happy!!", "text": "Date of experience: October 17, 2024", "rating": 5}, {"title": "True fit great selection", "text": "True fit great selection ", "rating": 5}, {"title": "great item Thank you.", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "Love them!", "text": "I had fast delivery and the product is absolutely amazing!!", "rating": 5}, {"title": "High Waisted Button Multiple Pockets…", "text": "High Waisted Button Multiple Pockets Straight Leg Casual Pants, I purchased these pants, and they fit great! I’m 5’3”, weigh 120 pounds, and ordered a Medium because I prefer a slightly loose fit for the office. The pants are very comfortable, look good, and the quality is impressive for the price. Highly recommend!", "rating": 5}, {"title": "Great product ", "text": "Love the fit and softness of the fabric.", "rating": 5}, {"title": "Love the pants", "text": "Love the pants. Beautiful colors. Soft, comfortable material. They wash and dry nicely. ", "rating": 5}, {"title": "These are the most comfiest pants ever", "text": "These are the most comfiest pants ever. Fit perfect. I’m an 8 got med and fit great. 5’5” 140. Love them. ", "rating": 5}, {"title": "Fit great and super comfy!", "text": "Pants fit great and are so incredibly comfy I ended up buying 2 more pair!!", "rating": 5}, {"title": "The clothes arrived quickly and they…", "text": "The clothes arrived quickly and they look just as pictured. Very well made!", "rating": 5}, {"title": "I love Halara", "text": "I love everything I have gotten from Halara. So comfortable and looks great. ", "rating": 5}, {"title": "Great Quality Products", "text": "Halara has great quality products. I’m pleased with my purchases and will be buying again. ", "rating": 5}, {"title": "I ordered items that were not the right…", "text": "I ordered items that were not the right size.  You all made it extremely easy to remedy the situation.  I will definitely recommend  your products to anyone!  Thank you so much.", "rating": 5}, {"title": "Good material and fit perfectly", "text": "Good material and fit perfectly ", "rating": 5}, {"title": "Great quality and comfort", "text": "Great quality and comfort ", "rating": 5}, {"title": "The pants are amazing", "text": "The pants are amazing. It did take way longer than expected to get here. But they are awesome. The jeans are sooo cute! Even better in person!", "rating": 5}, {"title": "These pants are incredible", "text": "These pants are incredible! They are so soft and comfy and make you feel all dressed up and classy while feeling like you're lounging in stretchy pants. The colors are beautiful. I only got two to start and I will definitely be getting more", "rating": 5}, {"title": "Love all the choices of clothing from…", "text": "Love all the choices of clothing from pants to dresses but wish more of them came in petite", "rating": 5}, {"title": "The return was easy and the clothes are…", "text": "The return was easy and the clothes are high quality!", "rating": 5}, {"title": "Love my jeans ", "text": "Love my jeans . Ordered another pair right away", "rating": 5}, {"title": "LOVE!", "text": "Love these pants, loved how they were just as advertised, will definitely be buying more!!", "rating": 5}, {"title": "Best jeans ever", "text": "Love the jeans. I'm 5'7\" 159lbs ordered tall large. They fit perfect. I ordered a second pair in a different style. So comfortable. ", "rating": 5}, {"title": "Love Halara!", "text": "I love the quality of the clothing and to consistency of the tracking information and the items arrive in a short period of time", "rating": 5}, {"title": "Easy Return", "text": "Customer service was very helpful and quickly took care of my issue", "rating": 5}, {"title": "The fit is spot on and the material is…", "text": "The fit is spot on and the material is just right for style and comfort ", "rating": 5}, {"title": "Great quality leggings", "text": "Great quality leggings! The shipping takes a little long but they are truly worth the wait! Definitely recommend and will be purchasing again", "rating": 5}, {"title": "Great product", "text": "Great productGreat prices ", "rating": 5}, {"title": "Favorite Brand!!!!!!…", "text": "Everything I have ordered has looked and fit amazing and immediately become one of my go to pieces!!!! Highly recommend!!! And way cheaper than that other brand I used to buy!!!!", "rating": 5}, {"title": "loved everything i ordered!!", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "Pants arrived on time and it's as the…", "text": "Pants arrived on time and it's as the ads show! Very comfortable and I'm always getting compliments when I wear them out", "rating": 5}, {"title": "My purchase from your website was easy", "text": "My purchase from your website was easy.  The shipping and receiving were fast.  Product was as expected.  Thank you", "rating": 5}, {"title": "Great customer service", "text": "Great customer service ", "rating": 5}, {"title": "The items fit well and the quality is…", "text": "The items fit well and the quality is good. Shipping could have been faster but the product was sound. ", "rating": 5}, {"title": "Even though the pants didn't work out", "text": "Even though the pants didn't work out, customer service was great. I had to take a picture wearing them, but that wasn't an issue. Thank you for the great service. ", "rating": 5}, {"title": "Ease of shopping and returns", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "Easy shopping", "text": "Easy shopping. Good delivery times", "rating": 5}, {"title": "Easy to order", "text": "Easy to order. Shipped very quickly with plenty of updates and the leggings are AMAZING! I ordered 2 more pairs. ", "rating": 5}, {"title": "These are my new favorite leggings", "text": "These are my new favorite leggings! After having my first baby 3 months ago the thick tummy control band and side control panels are giving me back some confidence! ", "rating": 5}, {"title": "Easy service", "text": "Easy service. I am a small and it is sized correctly and happy with the purchases.", "rating": 5}, {"title": "Loved all the peices", "text": "Date of experience: October 28, 2024", "rating": 5}, {"title": "The Fit", "text": "I am very happy with the pants that I purchased they are comfortable and fit me perfect.  Thank you ", "rating": 5}, {"title": "It was easy", "text": "It was easy, the clothes came in a timely manner, and they are great!", "rating": 5}, {"title": "leggings", "text": "Awesome products!! Reccomend", "rating": 5}, {"title": "Omg!!!", "text": "Omg!!!! I love these tights I will no longer buy any other brand. ", "rating": 5}, {"title": "I really love the products", "text": "I really love the products. Great quality, great fit and so cute. Communication and delivery was also great.", "rating": 5}, {"title": "NiluferYour products are very nice and high…", "text": "Your products are very nice and high quality. You send the orders on time. I recommend everyone to shop from you.👌🌟", "rating": 5}, {"title": "Great product", "text": "Quick delivery, good quality and fit.", "rating": 5}, {"title": "I ordered these pants and absolutely…", "text": "I ordered these pants and absolutely love them! They are just what they advertise. I bought more! I recommend these to my friends and family. Good quality and price.", "rating": 5}, {"title": "great product....exactly as appearing…", "text": "great product....exactly as appearing in video...good quality", "rating": 5}, {"title": "Love the pants I ordered !", "text": "Love the pants I ordered !! My order arrived ahead of scheduled delivery and I LOVE the product. Excellent value and better quality than I expected.  ", "rating": 5}, {"title": "Great quality ", "text": "Great quality. I am in love with my leggings ", "rating": 5}, {"title": "Wonderful selections", "text": "Wonderful selections!  Prices are comparable to department stores.  Many colors to choose from. Looking forward to receiving my purchase. 😊", "rating": 5}, {"title": "Love it-it was amazingly easy and love…", "text": "Love it-it was amazingly easy and love the product. ", "rating": 5}, {"title": "good quality and prompt service", "text": "Date of experience: October 28, 2024", "rating": 5}, {"title": "Huge selection", "text": "Huge selection, relatively quick delivery, true to size and I got what I expected. Great quality!", "rating": 5}, {"title": "Love Halara", "text": "Love Halara! My pants are amazing! Bought a few pairs for work- I have to dress business casual and these pants are perfect for that! Returns are made so easily! ", "rating": 5}, {"title": "I am very satisfied with my purchase…", "text": "I am very satisfied with my purchase and in the future I am planning to do more shopping from Halara.  ", "rating": 5}, {"title": "Flawless fit", "text": "Flawless fit, great quality. ", "rating": 5}, {"title": "Good fit and material", "text": "Good fit and material. Delivered on time 👍Many thanks 😊 ", "rating": 5}, {"title": "My second order", "text": "My second order. Great trousers. Can't get comfier than these.", "rating": 5}, {"title": "Loved the pants I ordered so much I…", "text": "Loved the pants I ordered so much I reordered in two more colors! They are excellent quality and aside from the first order being a pre-order the shipping was pretty fast.", "rating": 5}, {"title": "Very comfortable ", "text": "Item as shown in pictures. Very comfortable and soft. Will consider buying more", "rating": 5}, {"title": "I like trousers but I found the waist rather tight and hips a wee bit wide", "text": "Trousers are a good weight and hang nicely ", "rating": 5}, {"title": "The clothes were excellent quality and…", "text": "The clothes were excellent quality and fit me perfectly! I am thrilled with my purchase ", "rating": 5}, {"title": "Very happy with the service and…", "text": "Very happy with the service and especially the fit of my leggings.  Colour was spot on as well. Thank you! I will definitely order from you again. ", "rating": 5}, {"title": "Perfect fit and feel", "text": "Perfect fit and feel! Would buy againnin every colour. ", "rating": 5}, {"title": "Perfect fit and feel", "text": "Perfect fit and feel! Would buy againnin every colour. ", "rating": 5}, {"title": "Great clothes", "text": "Great clothes! Amazing fit, very comfortable! Fabulous fabrics! Loved the free gift!! And fast shipping! ", "rating": 5}, {"title": "Great bottoms!", "text": "Great bottoms!The first pair were so nice, I had to get another! Now I have a few more in the cart. ", "rating": 5}, {"title": "Fast delivery", "text": "Fast delivery ", "rating": 5}, {"title": "Jeans advertised via Facebook ", "text": "The jeans I bought were true to size and exactly what was advertised- delivery on time - very happy . ", "rating": 5}, {"title": "Great dress I like it ", "text": "I like the dress a lot ", "rating": 5}, {"title": "These are the best leggings I’ve ever…", "text": "These are the best leggings I’ve ever worn! I use them to workout and run! I never had to pull them up or adjust them. They are so comfortable and true to size! ", "rating": 5}, {"title": "Quick and item as i expected", "text": "Quick and item as i expected, thank you so much", "rating": 5}, {"title": "Delivery was quick", "text": "Delivery was quick. True to size and great material that’s stretchy and good quality. It’s not so thin that it’s see through, but they aren’t thick either. Very breathable and comfortable with enough stretch. Well worth the money! ", "rating": 5}, {"title": "I love the fabric and feel", "text": "I love the fabric and feel! The styles are great too!! I was going to return them to exchange for a large, they seem for me to run just a little small, but I plan on trying other items as well", "rating": 5}, {"title": "I just received my pants yesterday and…", "text": "I just received my pants yesterday and I love them.", "rating": 5}, {"title": "Best jeans ever", "text": "Fast delivery, super quality and comfortable clothing", "rating": 5}, {"title": "Absolutely love everything", "text": "Date of experience: October 28, 2024", "rating": 5}, {"title": "Great company to deal with.", "text": "Easy to order. Very easy to return products. Great communications", "rating": 5}, {"title": "Ordering was easy", "text": "Ordering was easy, everything i ordered was great quality and fit as expected.", "rating": 5}, {"title": "Ordering is easy", "text": "Ordering is easy, lots of choice of styles and coloursQuick delivery too!Great fit", "rating": 5}, {"title": "Great customer service", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "Good quality", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "I like most of the clothes", "text": "I like most of the clothes. They make something for everyone ", "rating": 5}, {"title": "I love my overalls and have received…", "text": "I love my overalls and have received many compliments!", "rating": 5}, {"title": "COMFIEST DRESS EVER!!!", "text": "I ordered this tennis dress in olive green and it is the exact color on the website. It is SO COMFY!!! Softest material ever and thick. It feels great quality and I can wear it to play and coach tennis in! It’s perfect! I usually wear small-medium tops and I ordered a small and it fits me perfectly.", "rating": 5}, {"title": "Quality of the garments.", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "I bought a pair of work pants", "text": "I bought a pair of work pants. I loved them so much I bought 2 more", "rating": 5}, {"title": "Love all the clothes!!", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "Great overalls", "text": "Easy to order. Very reasonable price and I love these overalls.", "rating": 5}, {"title": "Comfy clothes", "text": "Clothed are comfy. Fit great.", "rating": 5}, {"title": "It fit perfectly", "text": "It fit perfectly. Beautiful color. ", "rating": 5}, {"title": "I love these jeans", "text": "I love these jeans! Comfortable and wickedly great fitting! ", "rating": 5}, {"title": "It’s all about fit and quality ", "text": "I found the quality to be there , everything fit true to size and look great", "rating": 5}, {"title": "Quickly delivered", "text": "Quickly delivered ", "rating": 5}, {"title": "I love my new Halara jeggings!", "text": "I love my new Halara jeggings!! Feel great and fit perfect!", "rating": 5}, {"title": "Longer than my short legs", "text": "As expected, the pants are too long, but otherwise fit great. They are super comfortable ", "rating": 5}, {"title": "Great pair of jeans love them shipping…", "text": "Great pair of jeans love them shipping could be a little faster but overall great ", "rating": 5}, {"title": "Great skirts to add to my wardrobe.", "text": "Great skirts to add to my wardrobe. ", "rating": 5}, {"title": "Pants are very comfortable", "text": "Pants are very comfortable. I should have ordered the petite as regular is pretty long on me. I will definitely order more. Shipping was quick, received in about 10 days and communication was very good!", "rating": 5}, {"title": "Best return experience", "text": "The convenience you offered. ", "rating": 5}, {"title": "Shipping was fast and products were…", "text": "Shipping was fast and products were very well packaged.   Clothes fit amazingly!!! 💜💜💜💜", "rating": 5}, {"title": "The jeans are amazing", "text": "The jeans are amazing, I feel skinny wearing them. Is really a game changer in the shape department", "rating": 5}, {"title": "It would be nice to have better normal…", "text": "It would be nice to have better normal colors rather than such off colors that you have and that is in the jogger", "rating": 5}, {"title": "The pants I ordered", "text": "The pants I ordered, very comfortable,  fits great. ", "rating": 5}, {"title": "Absolutely love these jeans comfy and…", "text": "Absolutely love these jeans comfy and not to long bought regular and I’m 5.2 Took quite a while to come but worth the wait!", "rating": 5}, {"title": "Love Halara", "text": "Love Halara, the quality and look and feel of everything is amazing.", "rating": 5}, {"title": "Pants arrived exactly as ordered and…", "text": "Pants arrived exactly as ordered and much quicker than the promise date. ", "rating": 5}, {"title": "i love my new 👖 pants", "text": "i love my new 👖 pants", "rating": 5}, {"title": "Item bought was of good quality and an…", "text": "Item bought was of good quality and an excellent fit.  Timely delivery.  Will definitely shop again with this company", "rating": 5}, {"title": "So comfortable love my dresses", "text": "So comfortable love my dresses ", "rating": 5}, {"title": "Amazing Products / Customer Service", "text": "Amazing products! Great customer service!  ", "rating": 5}, {"title": "Great pants!  Good quality!", "text": "Easy and quick shipping!", "rating": 5}, {"title": "I have ordered at least five times from…", "text": "I have ordered at least five times from Halara. I have always been happy with the quality of the purchase. ", "rating": 5}, {"title": "Love my new pants", "text": "Love my new pants! Wish shipping was faster but over all satisfied and will definitely order again!", "rating": 5}, {"title": "Best jeans ever!", "text": "These jeans are amazing! So comfortable, great fit and length (tall). I am very pleased and will be ordering more.", "rating": 5}, {"title": "Great pants", "text": "Great pants. Size down", "rating": 5}, {"title": "I am extremely pleased with the jeans I…", "text": "I am extremely pleased with the jeans I ordered. It came within a week to downtown Toronto and I am extremely impressed with the quality of fit and comfort.  Body inclusive and better than spanx by a mile both in price, fit and quality!", "rating": 5}, {"title": "I ordered a second pair of the stretch…", "text": "I ordered a second pair of the stretch jeans.  They are SO comfortable!!  And you can't tell they aren't denim!", "rating": 5}, {"title": "Was very good and really pleased with…", "text": "Was very good and really pleased with my jeans", "rating": 5}, {"title": "Fit and fabric are great", "text": "Fit and fabric are great! Very happy!!", "rating": 5}, {"title": "Customer Service Win!", "text": "I accidentally added a quantity of 2 for two items in any cart. I did not notice until after I received my order confirmation. I was doubtful I would receive promt and courteous service because all I could find was an email address. I was wrong - prompt and courteous service was received. My issue was resolved the next day!", "rating": 5}, {"title": "From order time I was informed I was…", "text": "From order time I was informed I was able to track and receive goods in a timely fashion ", "rating": 5}, {"title": "The products purchased are incredible", "text": "The products I purchased are incredible soft and exactly what I wanted so keen to buy more stuff. Always great offers on to ;) ", "rating": 5}, {"title": "Very good quality", "text": "Very good quality, I love it ", "rating": 5}, {"title": "Lovely velvet/velour wide leg trousers…", "text": "Lovely velvet/velour wide leg trousers they look smart and are really comfy. These will be perfect to wear over Christmas as I am currently in a wheelchair with a plaster cast on my lower leg. So these are perfect and look stylish", "rating": 5}, {"title": "Great quality jeans", "text": "Great quality jeans, absolutely love them", "rating": 5}, {"title": "With the exception of a few week wait…", "text": "With the exception of a few week wait time, love my pants! They were long enough and feel great", "rating": 5}, {"title": "Perfect fit and length", "text": "Very happy with the pants!!  Perfect!!", "rating": 5}, {"title": "Very good and comfortable think these…", "text": "Very good and comfortable think these may become my new favourite! ", "rating": 5}, {"title": "Received my Halara wide leg jeans in…", "text": "Received my Halara wide leg jeans in petite.  I am 5’1” and these jeans are just the right length for a flat or a boot.  I ordered 3 colors .  Ordering more !!", "rating": 5}, {"title": "Great products", "text": "Great products, exactly as described and good quality. Nicely packaged. I’ve got 6 pairs of wide leg trousers and jeans in different colours, I really like them. At 5ft 2 inches and a size 12/14, the medium petite fits perfectly. Never any problem with delivery and I’ve returned items for smaller sizes with out any concern. I have no doubt I will order again in the future. ", "rating": 5}, {"title": "You won’t be disappointed ", "text": "My order arrived quicker than expected. The wide leg jeans are   Fabulous, I’m a size 12,5ft tall, I ordered 12/14 petit, they fit perfect and are very flattering on my bum and are so comfortable to wear. Don’t hesitate to buy these 😃", "rating": 5}, {"title": "I love the fit.", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "Love the product!", "text": "Date of experience: October 22, 2024", "rating": 5}, {"title": "Great products", "text": "Great products, good quality and fabulous fit.", "rating": 5}, {"title": "Great jeans ", "text": "I am very happy to have come across Halara- this jeans feel like leggings on, very soft and comfortable and on top of that they are very flattering. I will definitely be getting more in deferent colours as I usually struggle to find any jeans I like. ", "rating": 5}, {"title": "Reliable service", "text": "Reliable serviceExcellent products", "rating": 5}, {"title": "Great service", "text": "Great service. Loved my purchases haven’t worn anything else ", "rating": 5}, {"title": "Comfortable", "text": "The pants came very fast after I ordered . They are So comfortable ( Which is what I care about ) and the colors were perfect for what I wanted or thought they would be !! Thank you so much !", "rating": 5}, {"title": "Good Experience!", "text": "Honestly, I was worried before I ordered since the clothing was inexpensive. It came quickly, good quality items and I liked their return policy! I placed a second order!", "rating": 5}, {"title": "Best jeans/pants", "text": "Best jeans/pants.  So comfortable 🥰", "rating": 5}, {"title": "Love everything I've received", "text": "Love everything I've received. Love that they have petite for us under tall ladies. True to size. Well made, Great Value.", "rating": 5}, {"title": "I really like your clothes very…", "text": "I really like your clothes very confortable ", "rating": 5}, {"title": "Great jeans well made and perfect fit…", "text": "Great jeans well made and perfect fit took about 2 week to arrive but i expected that but was kept informed of shipping ect", "rating": 5}, {"title": "Exactly what I ordered delivered fast", "text": "My order was delivered quickly and it was exactly what I wanted. Fits perfectly, colours beautiful, quality material. I am a big fan of Halara", "rating": 5}, {"title": "Good quality", "text": "Good quality, pricing and quick delivery ", "rating": 5}, {"title": "I am obsessed with these pants", "text": "I am obsessed with these pants! I now own 3 in different colors and I'm not done yet!!.", "rating": 5}, {"title": "Excellent fit", "text": "Excellent fit, great quality. True to size. Have made another order very happy. Thank you", "rating": 5}, {"title": "I am in love", "text": "The material is amazing, the size fits perfectly, and I'm I'm love!!!!", "rating": 5}, {"title": "Quick order and delivery", "text": "Quick order and delivery. And I love these pants. Outrageously comfortable. ", "rating": 5}, {"title": "The quality of all the items I’ve…", "text": "The quality of all the items I’ve gotten is very good. Sizing is accurate and the pants are all so comfortable yet look like I’m wearing jeans. ", "rating": 5}, {"title": "Love the product and the feeling of the material ", "text": "Love the product and the fields ", "rating": 5}, {"title": "Fab trousers", "text": "Fab trousers, so comfortable and perfect for work and also to wear more casually, excellent customer service too, would definitely recommend! ", "rating": 5}, {"title": "Fast order and delivery process", "text": "Date of experience: October 28, 2024", "rating": 5}, {"title": "Informative and explained every part of…", "text": "Informative and explained every part of the process", "rating": 5}, {"title": "I got the trousers, but I need a size change", "text": "I got the trousers on time, but they were very large for me. I asked them to get a change and I got exactly what I want. Thank to Halara.", "rating": 5}, {"title": "Great customer service ", "text": "Great customer service and support , received my items and unfortunately they didn’t suit me,  and an refund or exchange was offered, i went with the exchange and my second choice was perfect, will definitely use this company again ", "rating": 5}, {"title": "Product is excellent", "text": "Product is excellent!  Packaging is beautiful.  ", "rating": 5}, {"title": "Petite was actually a petite!", "text": "Petite was actually a petite! ", "rating": 5}, {"title": "the pants are so comfortable and my…", "text": "the pants are so comfortable and my order didn't take long to receive", "rating": 5}, {"title": "Comfortable Jeans ", "text": "The jeans size is so comfortable and the material is elastic and stretchable. Loving it so much 😊", "rating": 5}, {"title": "Absolutely LOVE these jeans", "text": "Absolutely LOVE these jeans. I live in them! ", "rating": 5}, {"title": "Love love love my jeans and the arrived…", "text": "Love love love my jeans and the arrived quickly too 😊", "rating": 5}, {"title": "Lovely order", "text": "How easy to do this order. I received my package in a timely manner. Product is  quality. The fit lovely.", "rating": 5}, {"title": "Great fit", "text": "Great fit. Took awhile to get here but worth the wait", "rating": 5}, {"title": "I ordered some pants and they were a…", "text": "I ordered some pants and they were a little snug so I had to reorder some more. Easiest process ever!", "rating": 5}, {"title": "Material of this pair of pants exceeded…", "text": "Material of this pair of pants exceeded expectation. Unfortunately they were too short and the return options was very quick and fair.", "rating": 5}, {"title": "I really like  halara trousers", "text": "I really like  halara trousers, like trousers that are stretchy and high waisted I are very pleased with the trousers that I purchased so far I will recommend to friends.", "rating": 5}, {"title": "Awesome quality and true to size", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "Great leggings", "text": "Great leggings, good quality material, excellent value for money", "rating": 5}, {"title": "Great!", "text": "Easy ordering, quick delivery, and looooooved the pants! ", "rating": 5}, {"title": "Love how easy it is to order and the…", "text": "Love how easy it is to order and the products are lush!! ", "rating": 5}, {"title": "Prompt delivery", "text": "Prompt delivery, sizes fit well, comfy clothing.", "rating": 5}, {"title": "Great fit and material! ", "text": "Great fit and material! True to size", "rating": 5}, {"title": "I love it!", "text": "The products are good quality. The reference measurements are really helpful. I could follow the shipment and it didn't take long for the products to be delivered. I would recommend shopping on Halara, definitely a favourite of mine. ", "rating": 5}, {"title": "It’s my new favourite place for trousers! ", "text": "It’s my new favourite place for trousers!! I’m 5ft tall and really struggle to get trousers to fit length ways but their petite ones do. They take a long time to come but I knew that when I ordered and they keep you well informed. Haven’t had to send anything back yet, not sure how easy that would be ", "rating": 5}, {"title": "Brilliant - Amazing service", "text": "Brilliant! Halara provided lovely quality clothes, they supported through a smooth refund transaction and they were courteous and prompt with all communications - They offered a refund with no return of item as a gesture of goodwill. They are a fantastic company and I have recommended them to all family and friends. Thank you ", "rating": 5}, {"title": "Pants fit great and very comfortable", "text": "Date of experience: October 30, 2024", "rating": 5}, {"title": "Brilliant trousers and jeans", "text": "Brilliant trousers and jeans. Love  every pair I’ve bought. Great customer service too which is unusual to find these days. Thank you Halara!", "rating": 5}, {"title": "Very well made and well fitting leggings", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "Good Quality ", "text": "Leggings are lovely, so soft and fit well. I am only 5ft 1 and the regular size fit well on my leg, just the right length. ", "rating": 5}, {"title": "Easy ordering ", "text": "Easy ordering , Jeans are so comfortable perfect length. ", "rating": 5}, {"title": "Great company", "text": "Great company, really helpful when there is an issue", "rating": 5}, {"title": "Well made trousers", "text": "Well made trousers. True to size. Very fast delivery", "rating": 5}, {"title": "They look great and an amazing fit", "text": "They look great and an amazing fit! So comfortable!", "rating": 5}, {"title": "Great quality", "text": "Great quality ", "rating": 5}, {"title": "Love the product", "text": "Date of experience: October 27, 2024", "rating": 5}, {"title": "Comfort and Style ", "text": "I bought two pairs of trousers - the high waisted jeans are perfect in every way (length 30 inches, fit and style). The other trousers were not to my taste, but the returns process is excellent.", "rating": 5}, {"title": "Comfort for work", "text": "My pants from Halara came quickly and they have been a dream come true.  They look like dress pants for work, but feel completely comfortable! The pockets can hold my phone, which is usually the drawback to comfortable pants. I will order more colors.", "rating": 5}, {"title": "Purchased items sent promptly", "text": "Purchased items sent promptly. Items fit well and are true to size. ", "rating": 5}, {"title": "Great quality item.", "text": "Great quality item.I’m happy.", "rating": 5}, {"title": "The pants I bought were delivered…", "text": "The pants I bought were delivered quickly and they are very comfortable and flattering.", "rating": 5}, {"title": "I loved the fit and quality of…", "text": "I loved the fit and quality of everything I ordered!! ", "rating": 5}, {"title": "Love the pants the delivery time is 👍…", "text": "Love the pants the delivery time is 👍 okay ", "rating": 5}, {"title": "Love it", "text": "Love it! The pants I ordered are so comfortable and super cute. :)", "rating": 5}, {"title": "Great product and timely delivery", "text": "Great product and timely delivery ", "rating": 5}, {"title": "Extremely Happy", "text": "I ordered 2 skirts with the attached shorts.  I absolutely love them. I get compliments on them all of the time. They are extremely comfortable and fun to wear.Then I got another skirt, a dress and pants.  So far I love this brand and the shipments came in quickly.  I'm extremely happy with my purchases.", "rating": 5}, {"title": "Great clothing", "text": "Great clothing!  Will continue to purchase items!", "rating": 5}, {"title": "I love love your product", "text": "I love love your product.  Only thing I can think of is that it takes a long time to receive....", "rating": 5}, {"title": "Is  awesome I love it the texture …", "text": "I’d awesome I love it the texture  everything I like it and a I’m buy more the one ❤️", "rating": 5}, {"title": "Very good very comfortable and it shape…", "text": "Very good very comfortable and it shape your tummy. I wasn’t expecting to be this good. I’m very satisfied and would purchase again. You can go one size down since it will stretch. ", "rating": 5}, {"title": "Style", "text": "Style, material, and colors are awesome.  Fits great.", "rating": 5}, {"title": "perfect stretchy jeans", "text": "The stretchy jeans I ordered with side pockets are absolutely perfect!  They are very comfortable and perfect for long wear and have the side pockets just like I been looking for. ", "rating": 5}, {"title": "Woderful clothing", "text": "Woderful clothing, grest fit, washsnle and comfortable!", "rating": 5}, {"title": "Amazing", "text": "Besides the long shipment ! It was so worth it i cant stop wearing my sweater and pants so comfy and mad so well..very impressed! I want more!!!!", "rating": 5}, {"title": "The jeans are amazingly…", "text": "The jeans are amazingly comfortable!Have purchased 3 pairs!", "rating": 5}, {"title": "Great pants with POCKETS !", "text": "These are, no joke, the most comfortable pants I have owned. I love how soft they are, I love the fit and feel, I love the POCKETS, I love that they sit higher on my waste and don’t roll down whenever I move. ", "rating": 5}, {"title": "The pants are very beautiful", "text": "The pants are very beautiful, the quality surprised me, they arrived earlier than expected, that's why I give them 5 stars. ", "rating": 5}, {"title": "Good experience ", "text": "Cute clothes, high quality soft fabric, fast shipping", "rating": 5}, {"title": "Easy Returns ", "text": "I had to make returns and the customer service was great and made the return process very easy.  ", "rating": 5}, {"title": "Super ", "text": "Fit perfect ", "rating": 5}, {"title": "Great fit", "text": "Great fit, size guide was very accurate. ", "rating": 5}, {"title": "Love love their clothes!!", "text": "Love love their clothes!!! Everything always fits perfectly!! Best variety for business attire! ", "rating": 5}, {"title": "Great fit", "text": "Great fit! Super comfortable. ", "rating": 5}, {"title": "Jumpsuit was true to size and great…", "text": "Jumpsuit was true to size and great quality. ", "rating": 5}, {"title": "I was actually blown away by the fast…", "text": "I was actually blown away by the fast delivery, as well as the high quality! I will definitely be a return customer! ", "rating": 5}, {"title": "Best jeans ever…", "text": "Love the comfort of the jeans.size is perfect. ", "rating": 5}, {"title": "Love your products and delivery!", "text": "Date of experience: October 28, 2024", "rating": 5}, {"title": "Good material", "text": "Good material. Fit to the size", "rating": 5}, {"title": "The quality and fit of the 4 pairs of…", "text": "The quality and fit of the 4 pairs of pants I bought are perfect…love them ", "rating": 5}, {"title": "Great pants", "text": "Great pants, very comfortable! I love them! ☺️", "rating": 5}]