[{"title": "Very good customer service ", "text": "There's a lot I can say you do great, but you customer service is the best. Great people working there.", "rating": 5}, {"title": "Must say your cashier RO store #00648…", "text": "Must say your cashier RO store #00648 were wonderful,  great customer service,  very organized and detailed oriented with lot of patience and passion for your company and customers. I was very happy with my service from her today I must say you need more like her. ", "rating": 5}, {"title": "Cute mini dresses over cute leggings", "text": "Cute, cute, cute dresses that are casual and fashionable. I love the great selection of mini dresses that came out this spring. Sometimes I wear the bodycon dresses alone and sometimes I pair them with your incredible selection of leggings...either way people notice. Some of Rainbows clothes are like hitting the jackpot because you're paying  a lot less for a cute dress that you would be paying 4xs the amt at another clothing franchise or boutique.", "rating": 5}, {"title": "So not sorry ", "text": "Im sorry but I w snapped at rain ows plenty of times and to have the order sent to the wrong address and still had to reorder my items a 2nd time. I had to use a different email address because for some reason my email address was not correct. But the fact that I got no apologies or anything because I had to 3 different times is ridiculous and outrageous.  And I'm still getting different emails from another person saying that my lost items are in the way.. lack of communication is the key word on your part.", "rating": 5}, {"title": "I love the rainbow shops", "text": "I love the rainbow shops, whether buying online or in the store. This was an online order. Always packed superb, communication great. Products are definitely worth the look. I've been shopping with them quite awhile. ", "rating": 5}, {"title": "My experiences shopping online", "text": "My experiences shopping online, is so much better than purchasing in  stores. The customer services are poor, the associates makes it so hard to approach them. Not all Rainbows are that way. Last year, my husband and I, traveled from Wash. DC to Williamsburg, Va for a vacation. We visited the Rainbow location in the outlets there. Customer service was \"PERFECT.\" We was greeted at the door, they were friendly and helpful from the beginning to the end. But when I'm home, I rather shop online than to go in the stores. I usually shop in the Maryland locations (District Heights Md). I will continue to shop online unless I'm desperate and need something quick to wear for the day.  Thank you!", "rating": 5}, {"title": "Shopping For Daughter", "text": "My daughter works nights and she wanted me to shop for her up coming vacation trip, my cousin told me about Rainbow and I'm so glad she did. Easy Shopping, bright colors and THE PRICES ARE WONDERFUL. Thank you Rainbow Shops.", "rating": 5}, {"title": "Love", "text": "I've always loved Rainbow! I have one right here down the street from my house. The only thing they would need to change is stop trying to sell winter clothes during summer & summer clothes during winter. It's aggravating sometimes because i have to go to other shops to look for what i really want", "rating": 5}, {"title": "I worked for Rainbow for years in the…", "text": "I worked for Rainbow for years in the 90s into the 2000s. I have been shopping at Rainbow since I was 16 years old and I am now 52 years old 7 kids later. I will always shop Rainbow because their sizes fit me well abd the prices are great. I can always count on them for my go to especially last minute outfits or revamping my wardrobe. I have 5 girls, agres range from 35 years of age to 17 and they love Rainbow. Rainbow has saved me when it came to school dances, weddings, baby showers, BBQs, High School Reunions ,even when I had to go to a funeral wanting to look my best and a hard time. Thank you ! Sincerely, Diana Bautista ", "rating": 5}, {"title": "It was easy to find the best price for…", "text": "It was easy to find the best price for what I was looking for. Having the categories available to select which type of clothing I was looking for within the sale category was very helpful.", "rating": 5}, {"title": "Excellent prices and selection", "text": "Excellent prices and selection. It also very easy to navigate around the site!!! It's my first time shopping at Rainbow online, but definitely not my last!!!", "rating": 5}, {"title": "Best Prices, Colors and latest fashion", "text": "What made my experience great with rainbow is the fact I don't have to pay for shipping.  Also, there are two Rainbow stores on the island, and what is online is not in the stores 90% of the time.  Many times, people ask me where you got that blouse or pants I am wearing, and when I told them Rainbow, they will say oh I was at the store, and I did not see that outfit.  I would then say I got it online.  Also, I love shopping online at Rainbow's because they have all sizes and colors you can think of.  I'm loving it!", "rating": 5}, {"title": "I like shopping from the online store", "text": "I like shopping from the online store, much better than the original store don't get me wrong I like the stores as well, I just don't have to wait in line with a bunch of screaming kids and people!👍", "rating": 5}, {"title": "Fast delivery", "text": "Fast delivery. Sizes are always correct for me. I love rainbow clothing because it's affordable and so many choices. Love my rainbow. Thank you rainbow. ", "rating": 5}, {"title": "VERY EASY CHECK OUT", "text": "I JUST TYPED IN WHAT SIZE I WEAR AND WHAT I WAS LOOKING FOR IN EVERYTHING POPPED UP NICE CLOTHES AND REASONABLE PRICE THEY HAVE BETTER AND NICER SHOES ON LINE FOR RAINBOW AND HAVE MORE SIZE'S THEN THE STORE INCLUDING BETTER CLOTHES...", "rating": 5}, {"title": "It was very easy placing my order…", "text": "It was very easy placing my order online also knowing when I will get my order. It saves time and money on shopping. I will definitely be reordering again.", "rating": 5}, {"title": "Awesome company", "text": "I can only say this company is amazing as well awesome.My orders are always correct and on time.The thing I wish they start having things for teenager that are 15 years old and up for girls and boys!! ", "rating": 5}, {"title": "I love shopping on Rainbow", "text": "I love shopping on Rainbow. Always fast shipping, beautiful clothes and shoes. I have never had an issue with Rainbow.", "rating": 5}, {"title": "I love shopping from Rain bow shop", "text": "I love shopping from Rain bow shop. You get a great selection of different styles that fit you at an affordable price.", "rating": 5}, {"title": "Real nice clothes at real reasonable…", "text": "Real nice clothes at real reasonable prices especially on the plus sizing I just love all of their clothes I really recommend this company ", "rating": 5}, {"title": "The representative was very friendly…", "text": "The representative was very friendly and helpful explain a lot of things to me about the clothes. which help me make my decision she did a great job ", "rating": 5}, {"title": "My experience was great because of how…", "text": "My experience was great because of how easy it was to place my order, and receive everything within a few days... Thanks again rainbow ", "rating": 5}, {"title": "Love them!", "text": "Great prices! Fantastic shipping! Good quality clothes. I will say, the quality of the shoes could be better as they don't last very long, and they are not very comfy walking wise but they are cute! ", "rating": 5}, {"title": "My experience was great because I was…", "text": "My experience was great because I was able to find my favorite Wax jeans in store and on your website. I really like how you had them in stock.", "rating": 5}, {"title": "When placing my order, it was very easy not complicated at all. Received email for confirmation of order was very quick.", "text": "Placing my order easy not complicated at all.  Timing for email being sent to confirm my order was quick.", "rating": 5}, {"title": "Affordable", "text": "I love to shop at rainbow the store and the website has amazing deals and the clothing and shoe as well as accessories are very affordable and up to date fashion ", "rating": 5}, {"title": "I’m here for a few days and the only…", "text": "I’m here for a few days and the only NICE people I came across during my stay were Ashley and Clarissa. TOP TIER. 5 Stars! Real life sweethearts. ", "rating": 5}, {"title": "Life Time Season Woman ", "text": "The size for Real sizes for women, prices, I’m been a customer with Rainbow for all of my Adult Life! I enjoy shopping at Rainbow!", "rating": 5}, {"title": "Love the Close", "text": "I’d buy  rainbow because they’re always got discount clearance and I like the price  and they deliver really quick.", "rating": 5}, {"title": "I haven't received my order yet", "text": "I haven't received my order yet, but what I've seen on rainbows website is all I can bargain for.", "rating": 5}, {"title": "Progressing my order so quickly I am…", "text": "Progressing my order so quickly I am waiting for y'all to send it I appreciate y'all business I love you all thank you", "rating": 5}, {"title": "Great customer care service was excellent ", "text": "Great customer care service, i had an issue and rebecca was so amazing, i will forever shop here ", "rating": 5}, {"title": "The price's are the best!", "text": "It's always easy to order online and then return if needed at the store or mail back.Prices a re good for anyone on a budget!Thank you Rainbow!", "rating": 5}, {"title": "GREAT SALES, QUICK CHECKOUT🥹", "text": "I love the fact that the sales are so affordable and manageable and placing my info in was quick and efficient. ", "rating": 5}, {"title": "Summer Clothes ", "text": "My first experience with Rainbow has been very good, easy to access and very reasonably priced products  .", "rating": 5}, {"title": "I had no problems ordering nor with…", "text": "I had no problems ordering nor with anything else on the website. My experience was great, thanks!", "rating": 5}, {"title": "Rainbow has always been a good store to…", "text": "Rainbow has always been a good store to order from if any issues, they are quick to fix it. ", "rating": 5}, {"title": "Relatively very easy to order if I…", "text": "Relatively very easy to order if I don’t like what I ordered can I return in store? ", "rating": 5}, {"title": "Great selection and great prices", "text": "Great selection and great prices. There is something for everyone in the family. Site is easy to navigate.", "rating": 5}, {"title": "The delivery was very fast?", "text": "The delivery was very fast?! The boots 👢 are just beautiful even prettier than the photo!! I bought them while on sale!! Cany wait to wear them this winter ☃️❄️☃️", "rating": 5}, {"title": "Great merchandise", "text": "Great merchandise, great products.  You cater to a variety of tastes.  I've been shopping Rainbow for over 40 years now.", "rating": 5}, {"title": "Great customer servicehave always received great customer…", "text": "I have always received great customer service while visiting the store and it is always something new that catches my eye.", "rating": 5}, {"title": "Rainbows is a company for years has…", "text": "Rainbows is a company for years has been giving you quality clothes for a great price.", "rating": 5}, {"title": "I've always loved Rainbows because of…", "text": "I've always loved Rainbows because of reasonable prices and the clothes are good quality. ", "rating": 5}, {"title": "I love RAINBOW!!", "text": "I love the selections and prices.  I always find good and high quality fashions online and in the store.", "rating": 5}, {"title": "The order came in a timely manner", "text": "The order came in a timely manner. When I returned it to the store I had no problems. The order was exactly as it was in the picture. I  just didn't like it on me. Thank you ", "rating": 5}, {"title": "Great pants/Good Price ", "text": "Great customer service- the product is exactly as ordered and the price is great!Thanks - I will order more.", "rating": 5}, {"title": "The choices given meet well beyond what…", "text": "The choices given meet well beyond what I expected. Quick and easy checkout!", "rating": 5}, {"title": "I used to buy clothes and shoes from Rainbow years ago ", "text": "I used to buy clothes and shoes from Rainbow years ago. Shopping on line was so easy I didn't have a problem at all. ", "rating": 5}, {"title": "The size I wanted finally came back in…", "text": "The size I wanted finally came back in stock, I can’t wait to wear it! Rainbow have amazing clothes for the summer!", "rating": 5}, {"title": "Great quality and prices ", "text": "I order workout clothes, I hope the quality is as great as it appears on the website.Lorna", "rating": 5}, {"title": "Excited", "text": "First I thought it strange that I Recieved your email but then I got excited, when I saw the prices I got Excited.  So keep up the Great work. ", "rating": 5}, {"title": "It was easy to navigate the website", "text": "It was easy to navigate the website. I could search with the search bar on the site and switch from women to plus size with ease. ", "rating": 5}, {"title": "Amazing place to shop ", "text": "The organization of the website and the fact my size was available in everything was amazing ", "rating": 5}, {"title": "I was given a small coupon I had to pay…", "text": "I was given a small coupon I had to pay for shipping  😔 but excited for purchase", "rating": 5}, {"title": "Ready for Summer! ", "text": "Size availability is awesome. The models are great on the webpage and the description is excellent.", "rating": 5}, {"title": "Love the colors", "text": "Love the colors. Can always find something Orange🧡 Best place to get WAX jeans. Can’t beat prices.", "rating": 5}, {"title": "Well it was extremely easy to maneuver…", "text": "Well it was extremely easy to maneuver the site and I think that’s wonderful.", "rating": 5}, {"title": "Excellent quality", "text": "Excellent quality, dependable delivery, return policy and it was easy to use your website to place my order.", "rating": 5}, {"title": "My order was put together within the…", "text": "My order was put together within the same hour I ordered it", "rating": 5}, {"title": "Great Merchandise and Selections ", "text": "So easy to shop online and able to switch in and out of different items. Love me some RAINBOW❤️", "rating": 5}, {"title": "I didn't have any issues everything…", "text": "I didn't have any issues everything went smoothly and went through with no problem ", "rating": 5}, {"title": "Purchase ", "text": "I never have a problem when I'm shopping or getting my delivery ", "rating": 5}, {"title": "Sissy shopping", "text": "I'm a Sissy cross dresser and cough and style and shoe size.Fitting is very important to me", "rating": 5}, {"title": "I like the variety of clothing and…", "text": "I like the variety of clothing and accessories Rainbow Shops has.", "rating": 5}, {"title": "This was my first time ordering and…", "text": "This was my first time ordering and eve6went smooth. Just waiting to rec6my order!", "rating": 5}, {"title": "It was very easy to shop and quick.", "text": "It was very easy to shop and quick.  Best part was the models, seeing how the outfit could/ would look on me.", "rating": 5}, {"title": "they have good quALITY ITEM received in…", "text": "they have good quALITY ITEM received in a good timely manner", "rating": 5}, {"title": "I love Rainbows clothing", "text": "I love Rainbows clothing. I always shop with them. My order comes fast also. ", "rating": 5}, {"title": "I love shopping with Rainbow!", "text": "I love shopping with Rainbow!! Great selections!! Great prices!! ", "rating": 5}, {"title": "The product arrived in a timely manner", "text": "The product arrived in a timely manner, made from good material and affordable.", "rating": 5}, {"title": "I Love Shopping With Rainbow I Shop @…", "text": "I Love Shopping With Rainbow I Shop @ The Stores @ Least To Till Three Times Weekly ", "rating": 5}, {"title": "Ordering was quick & easy", "text": "Ordering was quick & easy. Items shipped within 1 day. ", "rating": 5}, {"title": "Can't wait for my order to come in.", "text": "I was able to get what I wanted.  I'm just waiting for it to get here so I can enjoy wearing the stuff.", "rating": 5}, {"title": "I shop at this store all the time", "text": "I shop at this store all the time. I recently bought a blouse from Rainbow store in shopping mall.", "rating": 5}, {"title": "Easy to navigate and order my…", "text": "Easy to navigate and order my merchandise. Found good bargains.", "rating": 5}, {"title": "I have been ordering from you guys a…", "text": "I have been ordering from you guys a couple years and I love the service. ", "rating": 5}, {"title": "One of my favorite stores.", "text": "Always find for me what I need and it's affordable.", "rating": 5}, {"title": "They had a pair of jeans that fit me!", "text": "They had a pair of jeans that fit me!!  I'm 62, love wide leg, I am 4'11\" and weigh 80#.  A size 0 fit and the length was perfect!  You have no idea how happy I am.", "rating": 5}, {"title": "Ordering from you is always fast and…", "text": "Ordering from you is always fast and easy ", "rating": 5}, {"title": "Good service", "text": "I love my sandals that I bought they are so pretty and the shipping was fast.", "rating": 5}, {"title": "It’s very convenient and great sales", "text": "It’s very convenient and great sales. The clothes are so gorgeous 😉😉", "rating": 5}, {"title": "Thank you for your assistance and…", "text": "Thank you for your assistance and satisfaction of products", "rating": 5}, {"title": "Fun shopping", "text": "Great prices and easy to navigate website.", "rating": 5}, {"title": "Available & Easy ", "text": "Available & Easy . Hope they come in in time for my vacation!!!", "rating": 5}, {"title": "Amazing", "text": "Amazing! My favorite I love to buy my clothes from this is good price ", "rating": 5}, {"title": "Prices", "text": "The outfit was true to size and comfortable ", "rating": 5}, {"title": "Classy and Affordable ", "text": "Affordable price, Quality and Unique design ", "rating": 5}, {"title": "VARIETY AND PRICING AND SIZE FOR PLUS…", "text": "VARIETY AND PRICING AND SIZE FOR PLUS WOMEN", "rating": 5}, {"title": "Very easy to access and process orders.", "text": "Date of experience: May 27, 2024", "rating": 5}, {"title": "I will be sharing this with my friend and friends to buy from Rainbow shop ", "text": "Because you're company have some great prices and great deals.  I will come back and buy more", "rating": 5}, {"title": "Stress free shopping", "text": "It was super easy to navigate the website", "rating": 5}, {"title": "The process of ordering was very easy.", "text": "Date of experience: May 19, 2024", "rating": 5}, {"title": "Very easy to place my order", "text": "Very easy to place my order. And the prices were very reasonable!", "rating": 5}, {"title": "Amazing prices in excellent styles for…", "text": "Amazing prices in excellent styles for women ", "rating": 5}, {"title": "good store", "text": "shipped fast. site is easy to use. nicely packaged. also site has nice variety of items.", "rating": 5}, {"title": "Easy shopping ", "text": "It was easy to navigate a purchase ", "rating": 5}, {"title": "I found the items that I wanted", "text": "I found the items that I wanted.  Navigation was easy.  Thank you.", "rating": 5}, {"title": "Good Quality ", "text": "I found great clothing at an awesome price. ", "rating": 5}, {"title": "It was easy to order but the shipping…", "text": "It was easy to order but the shipping is a little high ", "rating": 5}, {"title": "I love shopping with rainbows I love…", "text": "I love shopping with rainbows I love all the sales they have", "rating": 5}, {"title": "Price and colors available on product👍", "text": "Date of experience: May 25, 2024", "rating": 5}, {"title": "It's always great", "text": "It's always great! Been buying from you guys for years!", "rating": 5}, {"title": "Tresa", "text": "Ease of ordering and selection of items", "rating": 5}, {"title": "easy navagation through the website and…", "text": "easy navagation through the website and the ordering process was easy. ", "rating": 5}, {"title": "Easy to navigate", "text": "Easy to navigate, a lot of sizes in stock", "rating": 5}, {"title": "I love rainbow", "text": "I been shopping at rainbow for 20yrs", "rating": 5}, {"title": "Great sale cute stuff", "text": "Easy  ordering got a good sale. ", "rating": 5}, {"title": "The lady I talked to in Philadelphia…", "text": "The lady I talked to in Philadelphia was so helpful", "rating": 5}, {"title": "Love shopping for vacation clothes.", "text": "Love shopping for vacation clothes. ", "rating": 5}, {"title": "IT was very easy to look through the…", "text": "IT was very easy to look through the items, most of all the prices were great.", "rating": 5}, {"title": "Fast easy great selection", "text": "Date of experience: May 30, 2024", "rating": 5}, {"title": "Easy access to order clothes and shoes.", "text": "Date of experience: May 10, 2024", "rating": 5}, {"title": "Ease of ordering", "text": "Ease of ordering, fast shipping, excellent order tracking, quality packaging & product", "rating": 5}, {"title": "online always has my size", "text": "Date of experience: May 14, 2024", "rating": 5}, {"title": "Merchandise was on sale", "text": "Merchandise was on sale ", "rating": 5}, {"title": "Transaction was fast and easy", "text": "Date of experience: May 11, 2024", "rating": 5}, {"title": "Prices", "text": "Ive been buying clothes from here for a while now. I love tge clothes and the prices,", "rating": 5}, {"title": "Fast", "text": "Fast, easy and convenient. ", "rating": 5}, {"title": "Great quality", "text": "Great quality, great price and great fit. Love to shop at rainbow", "rating": 5}, {"title": "Easy to find…..good selection of shoes…", "text": "Easy to find…..good selection of shoes and good prices.", "rating": 5}, {"title": "I have been shopping from this site for…", "text": "I have been shopping from this site for years. Love the style and prices.", "rating": 5}, {"title": "Easy to do just what I was looking for…", "text": "Easy to do just what I was looking for work clothes ", "rating": 5}, {"title": "It’s easy shop online and in the…", "text": "It’s easy shop online and in the store.I love the style of clothes ", "rating": 5}, {"title": "I love love love it been shopping here…", "text": "I love love love it been shopping here for many years", "rating": 5}, {"title": "The online shopping experience was…", "text": "The online shopping experience was pleasant and easy.", "rating": 5}, {"title": "I like rainbows they got nice clothes…", "text": "I like rainbows they got nice clothes and nice shoes ", "rating": 5}, {"title": "Huge variety awesome colors great…", "text": "Huge variety awesome colors great selection and awesome pricing", "rating": 5}, {"title": "Everything fit and I was happy with my…", "text": "Everything fit and I was happy with my purchase", "rating": 5}, {"title": "Quick service", "text": "Quick service ", "rating": 5}, {"title": "The Best Fashion Pieces for a great…", "text": "The Best Fashion Pieces for a great Price!!!!!", "rating": 5}, {"title": "Great first time experience!", "text": "Awesome clothes", "rating": 5}, {"title": "Always great!", "text": "Date of experience: May 15, 2024", "rating": 5}, {"title": "Love Rainbow", "text": "Date of experience: May 15, 2024", "rating": 5}, {"title": "Steven was amazing", "text": "Steven was amazing ", "rating": 5}, {"title": "Easy website", "text": "Date of experience: May 15, 2024", "rating": 5}, {"title": "No problems", "text": "Date of experience: May 18, 2024", "rating": 5}, {"title": "Cute clothes love the design can't wait…", "text": "Cute clothes love the design can't wait to get the product", "rating": 5}, {"title": "Price  an quality", "text": "Date of experience: May 28, 2024", "rating": 5}, {"title": "Easy to find what I wanted and easy…", "text": "Easy to find what I wanted and easy checkout", "rating": 5}, {"title": "Great price", "text": "Great prices for summer sandles.", "rating": 5}, {"title": "Easy purchase and item was in stock", "text": "Date of experience: May 24, 2024", "rating": 5}, {"title": "Love Rainbow!", "text": "The app made it super easy to shop!", "rating": 5}, {"title": "Being able to get what you wanted", "text": "Being able to get what you wanted ", "rating": 5}, {"title": "received on time and items were great", "text": "received on time and items were great ", "rating": 5}, {"title": "Ability to purchase", "text": "Ability to purchase ", "rating": 5}, {"title": "very simple to place an order", "text": "Date of experience: June 01, 2024", "rating": 5}, {"title": "It was easy to order what I wanted.", "text": "Date of experience: May 12, 2024", "rating": 5}, {"title": "They have so many affordable cute things", "text": "Selection and price.", "rating": 5}, {"title": "Love it ", "text": "Great shopping and prices", "rating": 5}, {"title": "Beautiful Sandals", "text": "I love your styles of sandals", "rating": 5}, {"title": "Very easy to select and check out", "text": "Very easy to select and check out ", "rating": 5}, {"title": "Great clothes", "text": "Great clothes, great price and quality!", "rating": 5}, {"title": "Shoe shopping Finding the right sandles", "text": "Finding the right sandles", "rating": 5}, {"title": "Very good service from", "text": "Very good service from ", "rating": 5}, {"title": "I love me some Rainbow…", "text": "Date of experience: June 04, 2024", "rating": 5}, {"title": "Lots of options and sizes", "text": "Lots of options and sizes ", "rating": 5}, {"title": "No hassle to place an order!", "text": "Date of experience: May 15, 2024", "rating": 5}, {"title": "rainbow is the best", "text": " rainbow is the best", "rating": 5}, {"title": "Great Buy", "text": "Awesome selections this year.", "rating": 5}, {"title": "Found what I was looking for", "text": "Found what I was looking for ", "rating": 5}, {"title": "A personal touch ", "text": "The customer representative gave me a very personal touch.", "rating": 5}, {"title": "My favorite store online", "text": "My favorite store online ", "rating": 5}, {"title": "I love the leggings", "text": "I love the leggings ", "rating": 5}, {"title": "Very easy to order", "text": "Date of experience: May 18, 2024", "rating": 5}, {"title": "Ease of the website", "text": "Date of experience: May 10, 2024", "rating": 5}, {"title": "Ease of use of the website.", "text": "Date of experience: May 22, 2024", "rating": 5}, {"title": "Found what I needed quickly and a good…", "text": "Found what I needed quickly and a good price", "rating": 5}, {"title": "You have a beauGreat summer sandaltiful selection", "text": "You have a beautiful selection ", "rating": 5}, {"title": "…Great customer service", "text": "Great experience the customer service rep was fantastic ", "rating": 5}, {"title": "Easy", "text": "Very easy to use site. Great prices. ", "rating": 5}, {"title": "Everything about I really liked it", "text": "Date of experience: May 15, 2024", "rating": 5}, {"title": "The site is very user friendly", "text": "The site is very user friendly ", "rating": 5}, {"title": "Clothes choices for little girls", "text": "Date of experience: May 27, 2024", "rating": 5}, {"title": "Good quality ", "text": "I love the way the clothes fixed ", "rating": 5}, {"title": "Easy to find what I needed", "text": "Easy to find what I needed ", "rating": 5}, {"title": "The price and style are good.", "text": "The price and style are good. ", "rating": 5}, {"title": "Great sale on winter boots!!", "text": "Date of experience: May 10, 2024", "rating": 5}, {"title": "Great Customer Service", "text": "Efficient Service,  Easy Website.", "rating": 5}, {"title": "Nice store great prices", "text": "Date of experience: June 02, 2024", "rating": 5}, {"title": "Great products and choices", "text": "Great products and choices ", "rating": 5}, {"title": "Clean store friendly staff", "text": "Clean store friendly staff ", "rating": 5}, {"title": "Good job ", "text": "Good job I love it", "rating": 5}, {"title": "The prices of items", "text": "Date of experience: May 24, 2024", "rating": 5}, {"title": "Great Fit", "text": "I love the clothes ", "rating": 5}, {"title": "Very user friendly!", "text": "Date of experience: May 29, 2024", "rating": 5}, {"title": "More nba shorts", "text": "More nba shorts ", "rating": 5}, {"title": "Great merchandise", "text": "Great merchandise ", "rating": 5}, {"title": "Reasonable prices affordable", "text": "Reasonable prices affordable ", "rating": 5}, {"title": "Ordering", "text": "Quick and easy", "rating": 5}, {"title": "Review", "text": "Always awesome!!!", "rating": 5}, {"title": "GREAT SHOPPING EXPERIENCE", "text": "Date of experience: May 29, 2024", "rating": 5}, {"title": "Excellent ordering process", "text": "Excellent ordering process ", "rating": 5}, {"title": "Great prices", "text": "Great prices ", "rating": 5}, {"title": "Nice clothes", "text": "Nice clothes ", "rating": 5}, {"title": "Happy!", "text": "Happy!  Happy!  Happy!", "rating": 5}, {"title": "Great dress", "text": "Date of experience: May 17, 2024", "rating": 5}, {"title": "Great experience", "text": "Great experience ", "rating": 5}, {"title": "Excellent service", "text": "Date of experience: June 01, 2024", "rating": 5}, {"title": "Everything", "text": "Everything ", "rating": 5}, {"title": "This company is amazing amazing…", "text": "This company is amazing amazing customer service amazing clothes amazing people in the background who give us a lot of gorgeous and unique items and clothes to choose from please bring back the God looks into the  heart long sleeve t-shirt with God writing on the back it was so popular so it out and I couldn't get my hands on one to be honest I was going to grab a few theses  shirt  for myself and for others God Looks Into The Heart Graphic Long Sleeve Tee I really do like rainbow.com no I really love rainbow.com and I look online all the time and see what other women have brought and I get a sense an idea what to buy and how it will look on me as well or how I get a idea I love shopping in the store this is my first time ordering online and I love i black-plus size and in women's Long Sleeves, Crew Neck, T-Shirt, Sequins, Foil Screen, Graphic Print, Graphic: 1 Samuel 16:7 , Item Number 1912033873513", "rating": 5}, {"title": "Quick fast delivery! And ", "text": "The merchandise is always true to size and just like the picture display! I just wish the clothing were less see thru! But other than that for me, I love Rainbow Shops!", "rating": 5}, {"title": "great prices", "text": "great prices, many choices, and user-friendly website.", "rating": 5}, {"title": "I enjoyed the sales and finding…", "text": "I enjoyed the sales and finding everything I was searching for. The only thing I didn’t find were closed work shoes and weren’t a soft material. ", "rating": 5}, {"title": "Satisfied", "text": "I like to order from rainbow because you guys have the sizes that I need", "rating": 5}, {"title": "User friendly page", "text": "User friendly page, checkout seamless with options that makes it easier to choose from methods of payment. ", "rating": 5}, {"title": "Another great deal!", "text": "I can always find great deals on rainbowshops.com.  There is always something for everyone!", "rating": 5}, {"title": "It's easy to order my come quick", "text": "It's easy to order my come quick ", "rating": 5}, {"title": "Great and fast nice experience very…", "text": "Great and fast nice experience very comfortable ", "rating": 5}, {"title": "Very nice items and selections to…", "text": "Very nice items and selections to choose from. Also, easy to order from as well.", "rating": 5}, {"title": "Great experience very helpful", "text": "Great experience very helpful ", "rating": 5}, {"title": "Absolutely LOVEEE it ! ", "text": "It was a smooth process I was able to find what I needed , received deals and discounts and ordering eveyrhing was smooth and quick. ", "rating": 5}, {"title": "Sales ", "text": "Y’all  prices are amazing", "rating": 5}, {"title": "Well shipping is always fast and  I've…", "text": "Well shipping is always fast and  I've never experienced any problems with my order. ", "rating": 5}, {"title": "Great experience  with the ordering …P", "text": "Great experience  with the ordering  easy", "rating": 5}, {"title": "Great product and pricing ❤️", "text": "Date of experience: May 05, 2024", "rating": 5}, {"title": "Quick and easy", "text": "Quick and easy ", "rating": 5}, {"title": "Website easy to navigate", "text": "Website easy to navigate ", "rating": 5}, {"title": "Nice and fast shipping ", "text": "Love shopping here. Good customer service but rarely need it.  Cute stuff and fast shipping!", "rating": 5}, {"title": "Shopping with Rainbow ", "text": "First of all, I'm very familiar with the company. I've also shopped with Rainbow locally! The reason I like shopping with Rainbow...is because the prices are reasonable, and... it's affordable! Also, it's within my price range. ", "rating": 5}, {"title": "I’ve purchased items from the website…", "text": "I’ve purchased items from the website before, and was pleased. Have not in a year thought I will give it a try again. I’ve had to return because of the size,  had a problem with returning there should be a system  within the company that can pull up a receipt if you purchase with a credit card and or debit card. A credit should be issued if you have no receipt. But other than that it’s okay so far. ", "rating": 5}, {"title": "Great prices", "text": "Great prices, good services, package is always on time. Love it!😃", "rating": 5}, {"title": "Everything", "text": "Everything ", "rating": 5}, {"title": "Easy to shop!", "text": "Date of experience: May 06, 2024", "rating": 5}, {"title": "WAS VERY EASLY TO FIND WHAT I WANTED", "text": "Date of experience: May 06, 2024", "rating": 5}, {"title": "Did not offer me a spun discount as…", "text": "Did not offer me a spun discount as usual not happy 🙁☹️", "rating": 5}, {"title": "Easy ordering experience", "text": "E writhing went well", "rating": 5}, {"title": "I was to find what I wanted put in few…", "text": "I was to find what I wanted put in few detail words the site us awesome to navigate and shop in the polices are amazing 👏 👌 ", "rating": 5}, {"title": "The clothes fit perfectly", "text": "The clothes fit perfectly, never have problems with my orders.", "rating": 5}, {"title": "Great Store for your money ", "text": "Prices And Style Are Great ", "rating": 5}, {"title": "Item are just like the picture", "text": "Item are just like the picture. Good quality for the price. I'm in love with my 3 piece swim suit.", "rating": 5}, {"title": "Love the clothes", "text": "Love the clothes, the choices, the prices.", "rating": 5}, {"title": "Quality of the fabric And size guy ", "text": "Im always finding nice stuff on line then in the store ", "rating": 5}, {"title": "Easy to find ", "text": "This web site has gone better and easier to find the things you want. ", "rating": 5}, {"title": "Best prices", "text": "Best prices, best service", "rating": 5}, {"title": "I like shopping at Rainbow", "text": "I like shopping at Rainbow, they have a lot of nice items.", "rating": 5}, {"title": "She was very pleasant and very helpful", "text": "She was very pleasant and very helpful. I had a great experience.", "rating": 5}, {"title": "Everything!", "text": "Date of experience: May 03, 2024", "rating": 5}, {"title": "The item I purchased was readily…", "text": "The item I purchased was readily available in stock. Check out process very easy to follow.", "rating": 5}, {"title": "The site was very easy to use.", "text": "Date of experience: May 03, 2024", "rating": 5}, {"title": "Awesome ", "text": "Had everything i was looking for and the size", "rating": 5}, {"title": "The quality", "text": "The quality, designs and price of the kids clothes is unbelievable ! You really can get a bang for your buck . Especially if you are on a budget which most families are these days . ", "rating": 5}, {"title": "great price!", "text": "Date of experience: May 02, 2024", "rating": 5}, {"title": "It’s the right price when you have limited money ", "text": "Its easy to find what you’re looking for ", "rating": 5}, {"title": "Senior Citizen friendly", "text": "Senior Citizen friendly ", "rating": 5}, {"title": "Great experience", "text": "Great experience ", "rating": 5}, {"title": "The site is easy to navigate.", "text": "Date of experience: May 02, 2024", "rating": 5}, {"title": "Excellent service and Beautiful clothing", "text": "Excellent service and Beautiful clothing ", "rating": 5}, {"title": "I always have a good experience when…", "text": "I always have a good experience when shopping online or in the store. I have nothing bad to say. ", "rating": 5}, {"title": "I love the prices & styles.", "text": "I love the prices & styles. ", "rating": 5}, {"title": "Great customer service", "text": "Great customer service. The rep was pleasant.Making my purchase was quick and convenient.", "rating": 5}, {"title": "Website easy to oder", "text": "Date of experience: May 02, 2024", "rating": 5}, {"title": "My shopping experience was great.", "text": "My shopping experience was great. ", "rating": 5}, {"title": "I enjoy shopping online", "text": "I enjoy shopping online. I like my shopping order delivered to my house.", "rating": 5}, {"title": "The price of everything", "text": "The price of everything ", "rating": 5}, {"title": "Love my store Rainbow", "text": "Love my store Rainbow", "rating": 5}, {"title": "Jacket is cute!", "text": "Jacket is cute!! Good fit and perfect match for my jumpsuit. ", "rating": 5}, {"title": "You're price are reasonable and I love…", "text": "You're price are reasonable and I love the outfit I purchased for my granddaughter for Christmas last year.", "rating": 5}, {"title": " Cute Shoes I can find nice shoes at a reasonable…", "text": "I can find nice shoes at a reasonable price.", "rating": 5}, {"title": "Love the items and prices!", "text": "Date of experience: May 01, 2024", "rating": 5}, {"title": "Satisfaction", "text": "Date of experience: April 29, 2024", "rating": 5}, {"title": "Excellent ", "text": "I love shopping online at Rainbow! I've been a customer for many years! The clothes I've bought over the years, til this day I still get compliments and asked where do I buy my clothes. I even buy my grandson's outfits from there as well! ", "rating": 5}, {"title": "Well my package supposed to come before…", "text": "Well my package supposed to come before but their was a problem with the label and they corrected it and they send me a email when I was going to receive it. I got my package today at 1054 am even though they had said by the end of the day, everything that I can purchased was in the package and no problem .", "rating": 5}, {"title": "They make sure my order is right all…", "text": "They make sure my order is right all timed", "rating": 5}, {"title": "Easy to use and place an order!", "text": "Date of experience: May 01, 2024", "rating": 5}, {"title": "I have always had great experiences", "text": "I have always had great experiences at Rainbow. Quality clothes for affordable prices, you can't beat it!! ", "rating": 5}, {"title": "The experience was good", "text": "The experience was good ", "rating": 5}, {"title": "From my very first purchase lve been…", "text": "From my very first purchase lve been satisfied also knowing l can return to any store if fit not good without issues is a plus..can't wait until new purchase arrive.Ms Blondee", "rating": 5}, {"title": "The app to order was very easy to use", "text": "The app to order was very easy to use ", "rating": 5}, {"title": "Finding the merchandise that I was…", "text": "Finding the merchandise that I was looking  for was very easy then placing  the order was not a problem . And my shipping is coming via FedEx .", "rating": 5}, {"title": "Easy as 1 2 3", "text": "Easy to use site", "rating": 5}, {"title": "Good love y'all how y'all doing do well…", "text": "Good love y'all how y'all doing do well thanks yall", "rating": 5}, {"title": "i love this website i order all the…", "text": "i love this website i order all the time the quality is great and ships fast", "rating": 5}, {"title": "Great plus size selections", "text": "Always have what I'm looking for on the website", "rating": 5}, {"title": "I have not been on this site in a while…", "text": "I have not been on this site in a while and I really like the new setup. I find it visually appealing and easy to use.", "rating": 5}, {"title": "supper easy to navigate and very user…", "text": "supper easy to navigate and very user friendly. ", "rating": 5}, {"title": "I found all the items I was looking for", "text": "Date of experience: April 30, 2024", "rating": 5}, {"title": "The order experience was great.", "text": "Date of experience: April 30, 2024", "rating": 5}, {"title": "So far my experience has been because I…", "text": "So far my experience has been because I get to search products and use wise decisions.", "rating": 5}, {"title": "Buy on-line any time for the best selection", "text": "You get a better selection( sizes, colors,description of material and more of what the stores don't have. The store in outer loop doesn't allow anyone to try on anything (short staff) since cov'd. It's  better to try on at home. Then if you don't want It,you can return the items to the store. Delivery is fast.", "rating": 5}, {"title": "Ease of shopping and fast checkout.", "text": "Date of experience: April 29, 2024", "rating": 5}, {"title": "Great prices easy to order", "text": "Great prices easy to order ", "rating": 5}, {"title": "Great", "text": "Great, professional, fast service.", "rating": 5}, {"title": "I ordered with ease no issues at all", "text": "Date of experience: April 29, 2024", "rating": 5}, {"title": "It was easy to use the order service", "text": "It was easy to use the order service! Thank you ", "rating": 5}, {"title": "It was very good experiences shopping…Very good experience", "text": "It was very good experiences shopping online.", "rating": 5}, {"title": "I just love the clothes an how they fit", "text": "Date of experience: April 29, 2024", "rating": 5}, {"title": "Shopping is always always a pleasure…", "text": "Shopping is always always a pleasure whether online or in person at Rainbow Shops. ", "rating": 5}, {"title": "Great accessories", "text": "Great accessories! Nice clothes! ", "rating": 5}, {"title": "I found exactly what I was looking for…", "text": "I found exactly what I was looking for on the website.", "rating": 5}, {"title": "Over the rainbow ", "text": "Clothed are really looking good lately. I hope my ordered is fantastic.", "rating": 5}, {"title": "Love it", "text": "Love the quality", "rating": 5}, {"title": "Transaction was smooth.", "text": "Date of experience: April 28, 2024", "rating": 5}, {"title": "Go Rainbow!", "text": "It’s always a reliable place for great prices! ", "rating": 5}, {"title": "Love the prices and quality of their footwear", "text": "Love, the items they have, and free shipping ", "rating": 5}, {"title": "I am a very loyal customer", "text": "I am a very loyal customer. I really love rainbow. You can catch me constantly commenting that rainbow has affordable clothing , that is stylish and contemporary.  With that being said. I really thought I was going to get disappointed. I had a birthday gift that I brought for someone . The individual did not want it. I had a watermark on my receipt. I had a slight delay in my return. The district manager of your district. Tiffany. She came in and did a fantastic job. It has been said that the more expensive stores are more concerned and interactive with their customers. Your ambassador , district manager Tiffany, got to the bottom of my issue. She represents your company in an excellent way. She was patient, and determined to get to a quick resolution,  to my problem.  Tiffany / rainbow squashed the myth that less expensive stores are not dedicated and loyal to their customers. Rainbow is appreciative , and fully engaged in giving their customers a wonderful shopping experience. Rainbow /Tiffany I am glad to continue to be a loyal customer to rainbow. Good job rainbow/ Tiffany district manager. Ford city mall burbank ill. A very satisfied customer. Yvonne jerdine,  ", "rating": 5}, {"title": "I love shopping with rainbow they have…", "text": "I love shopping with rainbow they have the best clothes and shoes", "rating": 5}, {"title": "Easy to Navigate website", "text": "Easy to Navigate website.  Prices are reasonable for quality.  ", "rating": 5}, {"title": "It was very quick and easy to purchase", "text": "It was very quick and easy to purchase ", "rating": 5}, {"title": "I still haven't received my order.", "text": "I still haven't received my order. ", "rating": 5}, {"title": "The service was good I got everything…", "text": "The service was good I got everything that I ordered and will use it again thanks ", "rating": 5}, {"title": "My oder went through smoothly", "text": "My oder went through smoothly. Found what I wanted on website because they didn’t have them in the store that I shop in. (Neptune)", "rating": 5}, {"title": "Georgie  liked the content", "text": "Truley liked the content ", "rating": 5}, {"title": "The girl was very very nice", "text": "I didn't even know you could order from rainbow this way through a phone number she was so helpful thank you so much", "rating": 5}, {"title": "Very easy to navigate", "text": "Date of experience: April 27, 2024", "rating": 5}, {"title": "Ordering was fast and easy and price…", "text": "Ordering was fast and easy and price point is very good. Unfortunately the shipping cost was equal to the purchase price of the item. ", "rating": 5}, {"title": "Great website!", "text": "Easy website, great array of choices, great level of sizes!", "rating": 5}, {"title": "Easy to order", "text": "Easy to order  Nice collection.  Thanks!", "rating": 5}, {"title": "Great experience and website", "text": "It is an easy website to navigate. The images are a nice size and the wording is easy to read and not too small. Love the sales, options, and variety. ", "rating": 5}, {"title": "...easy shopping!", "text": "Date of experience: April 26, 2024", "rating": 5}, {"title": "I've ordered many things from Rainbow…", "text": "I've ordered many things from Rainbow and I hope this order is as great as the others", "rating": 5}, {"title": "Love the skirt they gave me the wrong…", "text": "Love the skirt they gave me the wrong size in the store( large) so I looked online and y’all had it in a medium I’m happy", "rating": 5}, {"title": "The order process was not difficult…", "text": "The order process was not difficult simple to use ", "rating": 5}, {"title": "It was easy and painless", "text": "Date of experience: April 26, 2024", "rating": 5}, {"title": "Smooth transaction ", "text": "The transaction was smooth with no glitches.", "rating": 5}, {"title": "Order processed and delivered in a…", "text": "Order processed and delivered in a timely fashion. Liked the price of item.", "rating": 5}, {"title": "I always shop at rainbows they always…", "text": "I always shop at rainbows they always have my size when I get to their store wherever I'm at", "rating": 5}, {"title": "The site was user-friendly.", "text": "Date of experience: April 26, 2024", "rating": 5}, {"title": "It's always a great experience for me.", "text": "Date of experience: April 25, 2024", "rating": 5}, {"title": "Was easy online shopping", "text": "Was easy online shopping ", "rating": 5}, {"title": "Ease of website", "text": "Ease of website ", "rating": 5}, {"title": "Rita on customer service was fabulous!", "text": "Date of experience: April 25, 2024", "rating": 5}, {"title": "I was able to get the shirts to fit all…", "text": "I was able to get the shirts to fit all my needs!", "rating": 5}, {"title": "I have never had a problem with…", "text": "I have never had a problem with anything I have ever bought before.", "rating": 5}, {"title": "I love to shop Rainbow online", "text": "I love to shop Rainbow online.  It's hard to find anything at the stores. They're so small and have a lot of merchandise to look through. So cluttered. ", "rating": 5}, {"title": "Love to shop in person and online 💕…", "text": "Love to shop in person and online 💕 customer service is good both ways.", "rating": 5}, {"title": "I like the set up it made ordering easy", "text": "Date of experience: April 24, 2024", "rating": 5}, {"title": "Always great selections!", "text": "Date of experience: April 25, 2024", "rating": 5}, {"title": "Great experience", "text": "Date of experience: April 25, 2024", "rating": 5}, {"title": "Variety of jeans available", "text": "Variety of jeans available ", "rating": 5}, {"title": "Reasonably priced", "text": "Reasonably priced ", "rating": 5}, {"title": "Clothes for plus size are awesome &…", "text": "Clothes for plus size are awesome & good prices", "rating": 5}, {"title": "I love the merchandise!", "text": "I love the merchandise!! It was easy to order, and my size was available!", "rating": 5}, {"title": "So easy to order online", "text": "So easy to order online.  No problems finding what I want to order and prices are in range of my budget", "rating": 5}, {"title": "I had to order my shoes online because…", "text": "I had to order my shoes online because I did visit several rainbow shops and none of them had size 6.  ", "rating": 5}, {"title": "Price was great 👍", "text": "Price was great 👍 ", "rating": 5}, {"title": "easy to order online", "text": "Date of experience: April 24, 2024", "rating": 5}, {"title": "Quick service", "text": "Quick service ", "rating": 5}, {"title": "Smooth online shopping", "text": "Smooth online shopping, but a bit too many emails ", "rating": 5}, {"title": "I always have an easy and seamless…", "text": "I always have an easy and seamless experience with rainbow ", "rating": 5}, {"title": "The Best Store Ever", "text": "Everything ordering, delivery just perfect.", "rating": 5}, {"title": "The site is easy to navigate", "text": "The site is easy to navigate. Orders come in a timely manner. Good selection and quality of clothes.", "rating": 5}, {"title": "Cost for the cargo skirt", "text": "Cost for the cargo skirt, sizing choice for plus size and variety of tops", "rating": 5}, {"title": "Love ❤️ ❤️ love love ❤️ my tops and they…", "text": "Love ❤️ ❤️ love love ❤️ my tops and they are the topic of discussion at my physical therapy sessions!!!", "rating": 5}, {"title": "Love dressing cute at a affordable…", "text": "Love dressing cute at a affordable price. Thanks Rainbow!! Times are hard. Keep looking cute.", "rating": 5}, {"title": "I was able to get everything I wanted.", "text": "I was able to get everything I wanted.", "rating": 5}, {"title": "Products ", "text": "The item was not in the store but it was online. I like Rainbow for keeping up with the fashion and reasonable pricing. ", "rating": 5}, {"title": "This online purchase was EASY", "text": "This online purchase was EASY, the prices are right and the styles are fun.", "rating": 5}, {"title": "I purchase a pair of red crepe knit…", "text": "I purchase a pair of red crepe knit pant unbelievable absolutely gorgeous the large fits tight but cute so I re-ordered 3 more pait", "rating": 5}, {"title": "It was easy and I love Rainbow shops…", "text": "It was easy and I love Rainbow shops I've been buying at Rainbow for many years 😀😊🫶❤️", "rating": 5}, {"title": "Very happy affordable prices", "text": "Quick, easy to search, great prices", "rating": 5}, {"title": "I get my package on time I love the…", "text": "I get my package on time I love the service ", "rating": 5}, {"title": "Easy!!!!!!", "text": "Easy!!!!!!", "rating": 5}, {"title": "Great online shopping experience", "text": "Great online shopping experience ", "rating": 5}, {"title": "Online Easy Shopping Experience", "text": "The discounted price and better selection online than in the stores.", "rating": 5}, {"title": "Easy online shopping", "text": "Date of experience: April 22, 2024", "rating": 5}, {"title": "I like the clothes rainbow sells", "text": "I like the clothes rainbow sells. I don’t like the no refund if it’s on sale and you order online.you should be able to return sale merchandise order online as well as regular price items. I don’t like if you get a receipt refund you can’t use it online.", "rating": 5}, {"title": "More of what you're looking for is…", "text": "More of what you're looking for is online than in the store I was very surprised cuz I went to the store first looking for what I wanted and then if I didn't find it I was going to go online and I found it", "rating": 5}, {"title": "Always very easy to purchase items", "text": "Date of experience: April 21, 2024", "rating": 5}, {"title": "Plus Size Spring Wear", "text": "Great selection, stylish looks and reasonable prices for the spring especially being a person who wears plus sizes. ", "rating": 5}, {"title": "I love all the clothes I love the…", "text": "I love all the clothes I love the accessories I love the colors and it's something that I'll look forward to wear to work this week", "rating": 5}, {"title": "Great experience ", "text": "I love shopping Rainbow and have for many years. They have sexy clothes at great prices. So if you want to look good and save money go to Rainbow.I highly recommend. ", "rating": 5}, {"title": "I was satisfied with order and delivery…", "text": "I was satisfied with order and delivery time ", "rating": 5}, {"title": "Cute summer styles", "text": "Love that they have curvy girl styles that fit my body type. They have cute accessories and i can always find something cute to wear on a getaway or evening out with friends.", "rating": 5}, {"title": "Excellent!", "text": "Great clothes! Great prices! Great service!", "rating": 5}, {"title": "Rating my online shop experience ", "text": "Shop experience was great I shoped online ", "rating": 5}, {"title": "Everything was easy to find which made…", "text": "Everything was easy to find which made my ordering very easy,", "rating": 5}, {"title": "Fast and easy", "text": "Easy to find what I needed. Great prices.", "rating": 5}, {"title": "Was able to find what I needed easy", "text": "Was able to find what I needed easy ", "rating": 5}, {"title": "Easy to navigate system", "text": "Easy to navigate system ", "rating": 5}, {"title": "I find it a great experience when…", "text": "I find it a great experience when shopping with Rainbow. The sells are within my budget and the quality are nice & not cheap looking. And I can still look nice at work. ", "rating": 5}, {"title": "Thank you for making shopping fun &…", "text": "Thank you for making shopping fun & easy online. This store is great!", "rating": 5}, {"title": "Great experience ", "text": "My experience at rainbowshops.com was great. I love the styles they have for kids; beautiful hip hop designs. And I also love how they have categories for babies, little kids, and big kids. I have been shopping from rainbow store for years for myself and they sell good quality clothes that last for a long time. I just wish they will sell kids clothes in store too especially babies and little girls.", "rating": 5}, {"title": "Clothing selectionlove this store", "text": "Clothing selection", "rating": 5}, {"title": "GOOD QUALITY CLOTHING!", "text": "I have been a loyal Rainbow Fashions customer since 2008!! Beyond in love with the excellent, quality clothing that they sell!", "rating": 5}, {"title": "No hiccups. ", "text": "Easy to use site. ", "rating": 5}, {"title": "I have great experience with this…", "text": "I have great experience with this company orgarionl product ", "rating": 5}, {"title": "Very easy to order!!!", "text": "Date of experience: April 19, 2024", "rating": 5}, {"title": "Nope aaaaaAaa", "text": "Nope aaaaaAaa", "rating": 5}, {"title": "Quick check out process!", "text": "Quick check out process! ", "rating": 5}, {"title": "Website worked with ease", "text": "Website worked with ease ", "rating": 5}, {"title": "Each time I order on line I receive…", "text": "Each time I order on line I receive good products I even went inside the store yesterday and made a purchase ", "rating": 5}, {"title": "Easy to surf the web", "text": "Easy to surf the web. Making purchases  was a breeze", "rating": 5}, {"title": "The shopping site is very user-friendly", "text": "Date of experience: April 18, 2024", "rating": 5}, {"title": "It didn’t take long to check out.🤩", "text": "Date of experience: April 18, 2024", "rating": 5}, {"title": " Rainbow is my go to", "text": "I always always can count on Rainbow to have the right garments to put my outfit together.", "rating": 5}, {"title": "Quick order shipping", "text": "Quick order shipping.  So my order may get to my niece in time for her birthday.  Thank you.", "rating": 5}, {"title": "It's very beautiful Dresses I'm so…", "text": "It's very beautiful Dresses I'm so excited to get them. ", "rating": 5}, {"title": "I know I'm getting quality products for…", "text": "I know I'm getting quality products for the price I'm paying for. Size are consistent. I trust buying clothes from Rainbow Shops more than buying clothes from Amazon.", "rating": 5}, {"title": "Always enjoy and happy with all I have…", "text": "Always enjoy and happy with all I have received ", "rating": 5}, {"title": "Lovely Quality Merchandise!", "text": "I’m a long time customer. I have been ordering from rainbow for years now. I have never had to return anything. The clothes and shoes are all very good quality and looks exactly like their photos!!!", "rating": 5}, {"title": "Good advertising  nice items", "text": "Advertising there items is a plus & it's  delivery is fast & I love there  clothes,  shoes everything.  Maria Velasco", "rating": 5}, {"title": "Easy check out", "text": "Easy check out ", "rating": 5}, {"title": "Great finds!", "text": "Wonderful selection of merchandise at affordable prices. ", "rating": 5}, {"title": "Easy to navigate online and quick check…", "text": "Easy to navigate online and quick check out ", "rating": 5}, {"title": "Being Honest", "text": "My size and colors I wanted were in stock.  The site is very user friendly.  I do not like that fact that the dressing rooms are not available as it would eliminate the customer from having to return to the store to return or exchange purchase.  Also, would like to see more quantity of the popular plus sizes (1X-2X) in store.   ", "rating": 5}, {"title": "Excellent service", "text": "Excellent service, my transaction was so easy! From start to finish it was smooth and my size in clothes and shoes were available! I’m quite happy and I will shop more in the future with Rainbow! 🌈 ", "rating": 5}, {"title": "I'm a New Yorker and I always shop at…", "text": "I'm a New Yorker and I always shop at Rainbows 🌈 a Rainbow in every corner. Great place to shop to look good.", "rating": 5}, {"title": "I love all the new choices of clothes", "text": "I love all the new choices of clothes. And that when you pick premium shipping, you get your clothes in like three days. 🙂", "rating": 5}, {"title": "It was great", "text": "It was great ", "rating": 5}, {"title": "Only place I can get the tank tops I…", "text": "Only place I can get the tank tops I love in  my size. ", "rating": 5}, {"title": "Lovely designs", "text": "Lovely designs. Easy ordering. Free shipping. ", "rating": 5}, {"title": "Fast and easy …", "text": "Filters made it much easier and faster to find the exact outfit and accessories I need for my baby shower ", "rating": 5}, {"title": "I like the periodical text messages…", "text": "I like the periodical text messages with deals on different items. The text usually catches my eye and then I order something. The free shipping encourages me to order at least $75 worth of items. The website is easy to manage and is hassle free. The prices are reasonable. I will continue buying from Rainbow. ", "rating": 5}, {"title": "Quick and effective", "text": "Quick and effective. You told me what was not available one time", "rating": 5}, {"title": "showing a lot of nice plus size clothing", "text": "Date of experience: April 15, 2024", "rating": 5}, {"title": "Always satisfied with my orders.", "text": "Date of experience: April 16, 2024", "rating": 5}, {"title": "Upcoming vacation ", "text": "Awesome clothes for upcoming vacation. ", "rating": 5}, {"title": "Easy to navigate & shop this website..", "text": "Date of experience: April 15, 2024", "rating": 5}, {"title": "They had my size", "text": "Date of experience: April 16, 2024", "rating": 5}, {"title": "I enjoyed myself. Shopping on-line eliminated Stres and saved \"Gas Money\"", "text": "This experience was like shopping with my best friend and having a personal assistant. ", "rating": 5}, {"title": "From the ease of searching thru the…", "text": "From the ease of searching thru the website,to the checkout process, it was a breeze. Everything was clear cut detailed.", "rating": 5}, {"title": "Good quality clothing at affordable…", "text": "Good quality clothing at affordable prices ", "rating": 5}, {"title": "Always easy to order and have exactly…", "text": "Always easy to order and have exactly what I am looking for!!", "rating": 5}, {"title": "Exactly what I want", "text": "Exactly what I want ", "rating": 5}, {"title": "I simply love all the styles so many…", "text": "I simply love all the styles so many it’s was hard to make a choice. I have to come back and shop for more!!!!", "rating": 5}, {"title": "Fast", "text": "Fast, convenient, safe.", "rating": 5}, {"title": "Absolutely love my items", "text": "Absolutely love my items ", "rating": 5}, {"title": "First to", "text": "I went into local store in my neighborhood for the first time today.  I found something I wanted the staff was very helpful.  I came home and checked out your website and I wanted to order more things.  That was a positive experience as well because it was so easy", "rating": 5}, {"title": "Great Shopping ", "text": "My experience was positive because instead of having my package shipped to my home I had the option to ship it by FedEx to a local Walgreens store for me to pickup so that way I receive my order and not worry about package thieves stealing my items. It was so convenient as well", "rating": 5}, {"title": "Since, fitting rooms are no longer open I can order from home. Try it on don't fit take it back to the store get larger or smaller size", "text": "Easy to order", "rating": 5}, {"title": "The convenience shopping online", "text": "The convenience shopping online, accurate merchandise that was ordered,  fast shipping.", "rating": 5}, {"title": "Easy shopping", "text": "Date of experience: April 15, 2024", "rating": 5}, {"title": "It was fast and easy", "text": "It was fast and easy ", "rating": 5}, {"title": "Simply put", "text": "Simply put, Rainbow was well stocked because I got everything I wanted in stock and on sale!!! ", "rating": 5}, {"title": "Restocked The Shoe I really wanted!!    The fact that they restocked the shoe I…", "text": "The fact that they restocked the shoe I wanted made me so happy. I love Rainbow they always have everything I need. From everyday wear, datenight, picnic etc. They always come through for me. I always go to them 1st if I need something to wear...", "rating": 5}, {"title": "Love shopping when I’m at work on my…", "text": "Love shopping when I’m at work on my break ", "rating": 5}, {"title": "Good prices.", "text": "Good prices. ", "rating": 5}, {"title": "I LIKED THE WAY EVERYTHING look.", "text": "I LIKED THE WAY EVERYTHING WAS ORGANIZED AND YOU CAN SEE THE PICTURES OF THE MERCHANDISE. ALSO EVERYTHING IS AFFORDABLE. I  SHOPPED BEFORE AND THE MERCHANDISE IS A GOOD QUALITY ", "rating": 5}, {"title": "Easy ordering online", "text": "Easy ordering online ", "rating": 5}, {"title": "Have nice styles reasonable prices and…", "text": "Have nice styles reasonable prices and better fashion ", "rating": 5}, {"title": "Happy shopper.", "text": "Very easy shop on the website love their shoes and clothing. I shop at there store when ever I can.", "rating": 5}, {"title": "Ease of shopping the site", "text": "Ease of shopping the site, the great deals ", "rating": 5}, {"title": "I usually get all my items. I had one bad experience where I didn't receive my items but was giving a refund", "text": "I usually get all my items. ", "rating": 5}, {"title": "So many beautiful items for such…Great Items!", "text": "So many beautiful items for such reasonable prices!", "rating": 5}, {"title": "Cute clothes", "text": "Cute clothes ", "rating": 5}, {"title": "Easy to place order", "text": "Date of experience: April 13, 2024", "rating": 5}, {"title": "Great pricing", "text": "Date of experience: April 13, 2024", "rating": 5}, {"title": "I enjoy looking at Rainbow's clothing…", "text": "I enjoy looking at Rainbow's clothing items on-line. The process was easy and my selections were available!", "rating": 5}, {"title": "I did it myself", "text": "I did it myself ", "rating": 5}, {"title": "Great price on clothing", "text": "Great price on clothing ", "rating": 5}, {"title": "easy to order", "text": "Date of experience: April 13, 2024", "rating": 5}, {"title": "Great Plus Size Clothing ", "text": "The clothing that I had been searching for came up on a Google search. The outfit looked great on the picture and video so I decided to search for another item while I was on your website and you had those items as well. Now when they arrive if they are of good quality as shown on the pictures then I will be back as a monthly customer ", "rating": 5}, {"title": "RAINBOW SHOPPING", "text": "I use to shop at Rainbow alot in kcks. I moved to DT been here for 6 hrs and first time seeing a Rainbow I couldn't pass up without going in.  I was so happy. I miss this store. Now I can shop for clothes with great quality and a great price.", "rating": 5}, {"title": "Affordable prices", "text": "Affordable prices", "rating": 5}, {"title": "Process was very efficient", "text": "Process was very efficient, received items in 3 days, and was made aware of each step in the process. ", "rating": 5}, {"title": "Easy to navigate the website lots of…", "text": "Easy to navigate the website lots of great sales", "rating": 5}, {"title": "The shipping was very fast and the…", "text": "The shipping was very fast and the prices were unbelievable. ", "rating": 5}, {"title": "Low affordable prices", "text": "Low affordable prices ", "rating": 5}, {"title": "User friendly website", "text": "Date of experience: April 12, 2024", "rating": 5}, {"title": "Exceptional Awesome Fashions Retailer ", "text": "Very Exceptional Awesome always. I shop online and in stores. Fashion in both forms of purchases are always extremely exceptional period. Prices may rise the same as prices may move lower. Reason why I love this Retail Sales Company.!! All fashions  styles in clothing and shoes are just extremely affordable. That has and  gives a look of being more expensive then the price being paid.!! ", "rating": 5}, {"title": "Awesome prices", "text": "Date of experience: April 12, 2024", "rating": 5}, {"title": "Website is easy", "text": "Date of experience: April 12, 2024", "rating": 5}, {"title": "Good source ", "text": "Website is easy to use. Plenty of options. ", "rating": 5}, {"title": "I absolutely love this store", "text": "I absolutely love this store! The website is so easy to use! You don't have to keep resetting your filters when you want to go back to where you were shopping! It's so smooth! (It's a big deal for me 😀) I also love the prices! Some of the items don't have the greatest quality, but majority of them do and they're cute! Can't go wrong here! ", "rating": 5}, {"title": "An excellent resource for buxom sizes!", "text": "Date of experience: April 11, 2024", "rating": 5}, {"title": "It was easy to shop and l love the size…", "text": "It was easy to shop and l love the size scale.❤️‼️", "rating": 5}, {"title": "Because I always shop with them", "text": "Because I always shop with them ", "rating": 5}, {"title": "great prices", "text": "Date of experience: April 11, 2024", "rating": 5}, {"title": "Reasonable price ", "text": "Reasonable price Easy check out", "rating": 5}, {"title": "The fact that I can get one day…", "text": "The fact that I can get one day shipping I need that top for Saturday ", "rating": 5}, {"title": "I don’t know I just like the clothes…", "text": "I don’t know I just like the clothes and they delivered on time cool", "rating": 5}, {"title": "My size was available,and the app is…", "text": "My size was available,and the app is easy to use", "rating": 5}, {"title": "I should have been shopping online from…", "text": "I should have been shopping online from the start. Found more stuff online than in the stores. Thank you", "rating": 5}, {"title": "Easy to order", "text": "Date of experience: April 11, 2024", "rating": 5}, {"title": "Quick & easy", "text": "Date of experience: April 10, 2024", "rating": 5}, {"title": "The website was easy to navigate", "text": "The website was easy to navigate. Was able to find what I was looking for easily.", "rating": 5}, {"title": "Dress is great", "text": "Dress is great, and shipping fast.", "rating": 5}, {"title": "Didn't  have a problem with nothing …", "text": "Didn't  have a problem with nothing  everything was real  easy to oder and check out.    Thank you                                          ", "rating": 5}, {"title": "products were in stock and available to…", "text": "products were in stock and available to ship. and on sale ", "rating": 5}, {"title": "Great Experience", "text": "Easy to place an order and pricing was good. ", "rating": 5}, {"title": "Remarkable prices", "text": "Remarkable prices.  Good quality.  Beautiful shoes.  ", "rating": 5}, {"title": "Beautiful Off the shoulders dresses.", "text": "Beautiful Off the shoulders dresses.", "rating": 5}, {"title": "Easy to maneuver the website.", "text": "Date of experience: April 10, 2024", "rating": 5}, {"title": "Easy to order & selection great", "text": "Date of experience: April 10, 2024", "rating": 5}, {"title": "denim!", "text": "I love denim sandals!  ", "rating": 5}, {"title": "Never had an issue with Rainbow Very reliable ", "text": "My orders always on time with no problem 100% reliable ", "rating": 5}, {"title": "You all have good though prices though…", "text": "You all have good though prices though I wish shipping was cheaper.", "rating": 5}, {"title": "Good thank you", "text": "Good thank you ", "rating": 5}, {"title": "It is always a pleasure shopping with…", "text": "It is always a pleasure shopping with rainbow shops ", "rating": 5}, {"title": "Checkout was simple and fast", "text": "Date of experience: April 09, 2024", "rating": 5}, {"title": "Very Good Size Description & Selection", "text": "Extremely comprehensive selection, most items available in basic black, easy filtering & search capabilities, descriptive photos and sizing comparison offering info on size worn on model with model's measurements. Shopping cart, easy to edit & Checkout using PayPal works well. All in all, A+!", "rating": 5}, {"title": "Easy shopping and checking out options", "text": "Easy shopping and checking out options ", "rating": 5}, {"title": "I've been a customer for years and  I…", "text": "I've been a customer for years and  I love your clothes.", "rating": 5}, {"title": "I like different things in rain bow…", "text": "I like different things in rain bow great.", "rating": 5}, {"title": "I happen to step into a Rainbow store…", "text": "I happen to step into a Rainbow store many years ago and have been shopping at Rainbow stores ever since then. While cruising on the internet I stumbled upon your online store. I did not know there was an online store. I was skeptical to order online though was not sure if the quality was comparable to the the brick and mortar store. Well, after my first order I was very happy to find out the quality is the same as what are in your stores. I don't recall that your brick and mortar stores advertise the online store. But it is something that should be definitely be done so all your customers are aware. I would recommend placing it directly behind the cash registers since there is normally a giant wall behind the cash registers. The same women who shop at Target, Walmart, Ross, TJ Maxx, Marshall's and Bealls Outlet are also the women that would be shopping at Rainbow. I know, I am one of them.  Good luck on your success. ", "rating": 5}, {"title": "She was fast with answer and fix the…", "text": "She was fast with answer and fix the problem fast ", "rating": 5}, {"title": "The clothes r reasonable and the prices…", "text": "The clothes r reasonable and the prices I can do with. And still have enough to buy what I want.", "rating": 5}, {"title": "Easy to use website ", "text": "Website was easy to use and search friendly.", "rating": 5}, {"title": "Easy to navigate", "text": "Easy to navigate. Had the product I was searching in the size that I needed.", "rating": 5}, {"title": "Good customer service ", "text": "Everything I needed was available.", "rating": 5}, {"title": "Really nice clothes", "text": "Really nice clothes, at an affordable price.", "rating": 5}, {"title": "The styles and the price", "text": "The styles and the price ", "rating": 5}, {"title": "Reasonable prices and nice clothes", "text": "Reasonable prices and nice clothes ", "rating": 5}, {"title": "The website was easy and fast", "text": "The website was easy and fastAnd had exactly what I wanted ", "rating": 5}, {"title": "Greatness", "text": "Found the item I was looking for ", "rating": 5}, {"title": "Nice picks and bargains.", "text": "Date of experience: April 01, 2024", "rating": 5}, {"title": "Great store to shop nice prices and…", "text": "Great store to shop nice prices and quality products ", "rating": 5}, {"title": "Easy to navigate and had what I  was…", "text": "Easy to navigate and had what I  was looking for. ", "rating": 5}, {"title": "I like the jeans shirts not  so much…", "text": "I like the jeans shirts not  so much because they run really small. ", "rating": 5}]