[{"title": "I am overwhelmed with joy and so…", "text": "I am overwhelmed with joy and so grateful as a result of your excellent customer service, compassion and kindness. You went beyond the ordinary measures to resolve my issue.I am truly greateful!", "rating": 5}, {"title": "Amber was very kind, patient and helpful…", "text": "Amber was very kind, patient and helpful when I called to file my first ever claim. She helped to simplify what is naturally an intimidating process.   ", "rating": 5}, {"title": "We had our trip cut short because our…", "text": "We had our trip cut short because our van was broken into with all of our luggage stolen. We purchased the insurance that allows trip interruption for any reason. Seven Corners was easy to work with and reimbursed us for everything covered by our policy. ", "rating": 5}, {"title": "Received the best customer service of any travel insurance group I have ever used", "text": "I was able to reach an agent very quickly, no long holds on the phone.  Anyone whom I spoke with was cheerful, attentive, concerned and very helpful.", "rating": 5}, {"title": "Quick response and no hassle when I…", "text": "Quick response and no hassle when I needed to cancel my policy within the 14-day refund period. The refund showed as pending with my credit card withina few hours. Laura was very professional", "rating": 5}, {"title": "Candy: outstanding customer service", "text": "Candy gave me outstanding customer service.  She understood my frustration with EF Go Tours and the insurance claim.She answered all of my questions and made the process so much easier.  She is professional, knowledge, and helpful.  This woman deserves a bonus.  Note:  I even wrote Seven Corners a separate email!  Thanks Candy ", "rating": 5}, {"title": "They are able to collaborate with…", "text": "They are able to collaborate with information and clarification about our doubts, also they do beyond their job to help people who are dealing with health insurance for the first time. ", "rating": 5}, {"title": "Quick response!", "text": "Request for policy changes made via email at 11pm and update made and notice to me by 8am next morning.  Thank you!", "rating": 5}, {"title": "Trip Cancellation vs Cancel for Any Reason", "text": "I called Customer Service to find out if trip cancellation insurance for a destination wedding would cover cancelling the trip if the wedding itself was cancelled. (Answer: not unless I also bought \"Cancel for Any Reason\")  The customer service representative I spoke with was very helpful and kind, explaining things that I hadn't thought to ask about. Although I didn't receive the answer I wanted to hear, she did her job well, and I ended the call with a favorable impression of the company she represents.", "rating": 5}, {"title": "Jeanette was professional", "text": "Jeanette was professional, answered my questions clearly and thoroughly. She even called me back after we concluded our call to ensure I was clear about a specific issue we discussed. She was correct that I was still confused and due to her callback (went the extra mile) I became clear on what was required in my claim submission. 10 out of 10. ", "rating": 5}, {"title": "Candy was efficient and prompt in…", "text": "Candy was efficient and prompt in answering my questions about submitting my claims.  She saved me time and assured me that I did not need to resubmit a claim even though I could not view it in my account.", "rating": 5}, {"title": "Solid travel insurance features", "text": "Two things stand out with Seven Corners:1) The features on their travel insurance policies are the best I've seen at competitive prices.2) The customer service (non-claim related) is prompt, professional, and courteous.I cannot comment on the quality of their claims handling because I've never filed a claim with them (and I hope I never have to because filing a claim implies something bad has happened to me).", "rating": 5}, {"title": "Very helpful", "text": "Candy helped me and she was very patient, helpful and did not treat me like an idiot because I was having trouble with the claim forms. I've had people in the past (other organizations) who are rude because I'm just not understanding.  Candy was so nice and patient.", "rating": 5}, {"title": "I was having difficulty purchasing our…", "text": "I was having difficulty purchasing our plan online. We called the 800 number and were connected with Kendra. She quickly and efficiently took care of setting up our insurance plan. She was friendly and knowledgeable about the product.", "rating": 5}, {"title": "Client services have always been very…", "text": "Client services have always been very friendly and helpful.  (Candy)", "rating": 5}, {"title": "Janetta Wade was very helpful", "text": "Janetta Wade was very helpful. She was polite, pleasant and patient with my concerns. Unfortunately, people like this are becoming rare in customer service. She resolved my issue and was a pleasure to work with. ", "rating": 5}, {"title": "Extraordinary positive experience ", "text": "First, you can call and reach a real person. Jona was very pleasant and helpful in explaining the plans. Once our vacation was cancelled due to the hurricane, response time and reimbursement was extraordinary. Our new travel insurance company will definitely be Seven Corners Travel Insurance. ", "rating": 5}, {"title": "Excellent customer service", "text": "We called customer service to find out if delay or cancellation due to illness of a family member was covered under our policy.  Amber was very helpful.  She explained our coverage, how to make a claim, and the type of supporting documentation required.  She followed up with an email also.", "rating": 5}, {"title": "Agnes was very helpful and courteous", "text": "Agnes was very helpful and courteous. She quickly addressed my policy change and followed up with the confirmation email. ", "rating": 5}, {"title": "The Best Customer Service You'll Find", "text": "I have spoken with Seven Corners customer service reps several times and each time it has been a pleasure. They are always professional and have knowledgable, helpful answers. In addition, I don't think I have ever had to wait on hold for more than a minute. That in itself is amazing. We travel overseas a lot and Seven Corners' attention to customer service will always make it my number one stop for travel insurance.", "rating": 5}, {"title": "Proof is in the pudding", "text": "There are many travel insurance companies but I've only ever used Seven Corners and I have reasons to continue.  My most recent experience has been with customer service representative Tristan S.  My questions got into the weeds about what the car rental insurance covered (not spelled out on the website) and how to structure insurance for a travel partner that doesn't live with me.  Tristan had a great attitude, didn't rush me off the phone and got back to me with all my answers.  It was a pleasant experience.  The service solidified my experience with Seven Corners who had handled my claim from a prior trip better than I could have expected.  I suggestion Seven Corners to my contacts that are traveling. ", "rating": 5}, {"title": "Affordable trip insurance with responsive customer service.", "text": "This was a first time test for my wife and I to consolidate a single trip insurance policy provider for a multi-stop international trip with various airline carriers and a liveaboard diving operation.  Tristan, Richard and Laura assisted with teaching us, providing a thorough understanding of the coverage, and important documentation needed from us, in the rare event that we would be forced to file a claim for all or a portion of the eight week, six country trip.  Being recently retired, we're now extending trips and destinations.  We researched and always questioned whether or not it was more beneficial, both financially and for simplicity, of purchasing a single policy or with each airlines and, then a single policy for the liveaboard.  Seven Corners was referred to us by Divers Alert Network (DAN) as a reasonably priced and thoroughly vetted insurance provider.  We're giving it a test for this particular trip and are already feeling good vibes for the decision.  I'll let you know more, in the rare event we need to file a claim (hopefully not!), and how the process works.  Setting up the policy was affordable and efficient.  The Reps mentioned greatly assisted teaching us what was needed.  This is one of our most complex trips to date, but we're just getting started.  Thanks. ", "rating": 5}, {"title": "Ting-Yu, Lin_Candy", "text": "Candy's explanation is very clear. She's very patient in confirming the informations for me and being very productive and prompt in my inquiries.", "rating": 5}, {"title": "It was quick", "text": "It was quick, efficient, and courteous.", "rating": 5}, {"title": "Employee Performance", "text": "The employee on the phone was very pleasant, helpful, and knowlegable.", "rating": 5}, {"title": "Every person I have talked with at…", "text": "Every person I have talked with at Seven Corners has been courteous and knowledgeable, and I have used Seven Corners for several European trips.  Also, they are in the US and are easy to understand. Janetta was especially helpful when I checked on an issue this morning. Carolyn Watson", "rating": 5}, {"title": "Great customer service", "text": "After purchasing a basic plan, I changed my mind and decided I'd rather have the plan that my advisor, Troy, had initially recommended. He was very easy to reach and he was able to cancel the policy and arrange for the coverage I wanted. My call was transferred to accounts, and Agnes was able to process the refund quickly. Both were very professional, personable and helpful. Received confirmation emails of the new policy and the refund within minutes. I am a repeat customer and found the rate to be competitive.", "rating": 5}, {"title": "Highly recommend Seven Corners", "text": "I had to file a claim for a medical reason.  The claims process was straightforward and easy to get through.   I had a few questions and a representative spent time with me over the phone to get all the correct documents in place and uploaded.  They were extremely helpful.  The claim was processed way faster than I had expected and I was given 100% reimbursement.   I was so relieved.   I would highly recommend Seven Corners for all travel insurance needs.", "rating": 5}, {"title": "Good customer service, and paid out claim in timely manner", "text": "Claim processing was simple and clear. Customer service team was very helpful, patient and courteous and answered my questions in detail ( thank you Candace!)Had to use the emergency room and had an overnight hospital stay, and the Seven Corners plan covered majority of the expenses. I did have some pending amount which was not covered by insurance, but overall the insurance company did a good job. I had heard of  experiences where many claims get denied or paid in part, but luckily in my case, the Seven Corners plan paid out most of the hospital bills. They worked directly with the hospital and i did not have to intervene. My experience with them was very good and will be using them again", "rating": 5}, {"title": "Best Customer Service experience…", "text": "Best Customer Service experience ever!!!!Bought last minute policy 9/28 for travel on 9/30 and had to cancel due to a change on how many people need to be covered. Called up on Sunday 9/29 and agent (Heather K.) helped me book new policy and cancel old policy in a span of 15 minutes. On top of that the wait time to connect to live agent was less than 5 minutes!!!", "rating": 5}, {"title": "Excellent customer service!", "text": "Excellent customer service! I spoke with a representative named Amber H. today, and she listed to my concerns, assured me regarding the claims process, and even provided tips for me to follow up with the claims team. She was not only knowledgeable and helpful, but friendly and empathetic as well. ", "rating": 5}, {"title": "I am able to travel with confidence…", "text": "I am able to travel with confidence that should a situation arise, my needs are covered by my travel insurance plan. I also appreciate the pay as the expenses occur.", "rating": 5}, {"title": "Gotta say it was an easy process and my…", "text": "Gotta say it was an easy process and my medical cost was covered in full quickly after I submitted my claim. ", "rating": 5}, {"title": "Seven Corners Came Through for Us", "text": "My girlfriend and I purchased a trip protection annual multi-trip plan from Seven Corners.  Two days before we were scheduled to embark on a three-week hiking, kayaking, biking trip to British Columbia, we both tested positive for COVID and Type A flu.  We had to cancel our trip, which involved more than $6,000 in nonrefundable costs.  I called a Seven Corners customer service representative, who was extremely helpful in explaining what was needed to file a claim.  My girlfriend and I each provided the necessary documents on July 25 via email. On August 9, we each received an email, saying that Seven Corners had approved our claims for the full amounts.  On August 12, we each received e-checks.  The quick service from Seven Corners helped take the sting out of our cancelled trip and confirmed our decision to use their travel plan.  ", "rating": 5}, {"title": "Clear explanation of policy before the trip", "text": "We bought a travel insurance from Seven Corners for trip to Europe. We still had some questions before the trip and called the company. Candace in customer service answered all our questions and explained the policy very clearly. Thank you!", "rating": 5}, {"title": "Great Customer Service", "text": "Letitia was kind, patient and extremely helpful.  She did not make me feel as though I was annoying her in any way.  Sweet personality. ", "rating": 5}, {"title": "Knowledgable", "text": "Patient, courteous, helpful and knowledgable.", "rating": 5}, {"title": "Austria hospital visit", "text": "Very positive first time experience with 7 Corners. We took out a policy for medical coverage for our trip to Europe this winter. My wife got sick in Austria with a sinus infection and bronchitis resulting in hospital & pharmacy charges. We submitted a claim form online when we got back home. The claim process required a fair amount of documentation but was straightforward. We received our check in the mail w/in a few weeks. Will definitely use 7 corners again for our future travels. ", "rating": 5}, {"title": "It was great because I was attended to…", "text": "It was great because I was attended to swiftly, kindly and with great professionalism. To cap it up, i became more clarified and aware after the conversation ", "rating": 5}, {"title": "Janette Wade was easy to understand", "text": "Janette Wade was easy to understand. She was sympathetic to our problem and clear in her instructions. She was very prompt in sending the information we needed. I wish all my customer service interactions went like my experience with Janetta. ", "rating": 5}, {"title": "Give Julie a raise", "text": "Though I hope I never will have to make a claim, I am very grateful to Agent Julie Holtzapple who has walked me through the plans, advised me on the details, sent me the information promptly and continues to take care of my questions.  That Seven Corners values us as customers by having caring and expert agents like Julie gives me confidence in your company.  Give Julie a raise and the other agents, too.  They are the heart and soul of your success.", "rating": 5}, {"title": "Excellent service thank you for your…", "text": "Excellent service thank you for your support!", "rating": 5}, {"title": "Great Customer Service", "text": "I called about a claim that I submitted in November. Schuyler was the person I talked to. She was fantastic. She has a very calm demeanor and extremely professional AND I could understand her. I thank Seven Corners for keeping jobs in the US. She led me in the proper direction and offered to resend anything I needed. I'm not used to getting customer service like this anymore. I felt she actually cared about helping me rather than trying to rush me off the phone.", "rating": 5}, {"title": "Representative could not help me but another did the next day", "text": "Representative could not help me.  Attachments would not attach.  She could not help me in any way except saying try again later.I was very surprised when another representative from Seven Corners contacted me the next day.  She had investigated my problem and told me how to submit my claim.  She said she would personally make sure that it went through correctly.", "rating": 5}, {"title": "I contacted Seven Corners just to…", "text": "I contacted Seven Corners just to inform you that we had difficulties with our flights from Portland to Sidney, Australia and that we would be submitting a claim within a week or so after completing our cruise on 5/12/24. The person I spoke to was very professional and listened to the details of our journey to date. She said that she would open a file afterwards. Thanks. Gary Jacobsen ", "rating": 5}, {"title": "Great customer service", "text": "Laura was kind, cheerful, and helpful, and answered my questions very quickly, alleviating any concerns about potential policy changes. Thanks!", "rating": 5}, {"title": "Quick helpful service", "text": "I found out that we needed to cancel our trip due to my son tearing his shoulder, rotator cuff. His surgeon is not comfortable with him going to Africa now so we had to cancel our trip. I called and the agent answering the phone told me we could all reschedule our trip when my son's doctor felt comfortable he had healed enough to not damage the shoulder. They were so helpful and nice and so I am working with a tour company to rebook us for 2025. We were going to Africa for my 70th birthday so we will celebrate my 71 birthday next year in Africa. Also when it happen I thought \"Thank God\" I had insurance!", "rating": 5}, {"title": "Agents are very knowledgeable and…", "text": "Agents are very knowledgeable and helpful. They explain your options and what coverages you may or may not need. Luckily, I have not had to file a claim but I would expect from their star rating, that they would be both helpful and trustworthy to pay what is owed based on your policy, both quickly and efficiently.", "rating": 5}, {"title": "I have had to call Seven Corners two…", "text": "I have had to call Seven Corners two times now. Not for a claim or any inaccuracy in my policy. I just needed to update the terms of my existing policy and to ask a few questions. Both times, my wait time was minimal and the customer service representative was highly efficient and prompt and did exactly what she said she would do. I will continue using Seven Corners. I have never had a claim as of yet, so I can not speak to their efficiency in that regard however. ", "rating": 5}, {"title": "Super easy", "text": "Quick, easy and super affordable.", "rating": 5}, {"title": "Seven Corners customer service is…", "text": "Seven Corners customer service is excellent.  Amber is very friendly and helpful. ", "rating": 5}, {"title": "ENJOYABLE EXPERIENCE", "text": "ENJOYABLE EXPERIENCEThe representative I spoke on 4/17/2024  was knowledgeable and friendly.  I merely wanted to have the policy indicate we were traveling to the Netherlands as well as Spain and she was able to make this change to the policy immediately.  She also sent revised documents to me.  The whole experience was easy and pleasant.John Torrente", "rating": 5}, {"title": "The fact that they actually communicate…", "text": "The fact that they actually communicate with you.  Your team answered voicemails in a timely manner.  I hate getting prompts telling me to press 1 to talk to someone!  With seven corners they gave me their direct number.  So nice to be able to talk to a person instead of a machine!", "rating": 5}, {"title": "the team", "text": "the team!  your staff is outstanding!  I buy a lot of  insurance from you because your team - the voices on the other end of the phone make me feel like I am  important and that they care about me.  Thanks to all of you on the phones - please l ow your knowledge and kindness matter and that is why customers like me keep coming back and tell other people about your wonderful service! You matter, you make a difference, you are the backbone of Seven Corners!", "rating": 5}, {"title": "She was humble", "text": "She was humble, respectful, and was able solve my queries and requests in a very professional manner. ", "rating": 5}, {"title": "Great customer service!", "text": "After my travel insurance cancellation date, I decided I wanted to change my cruise to a different itinerary but hadn't decided yet. They promptly said they would issue me a credit and it would be good until 5/26.  Promptly got the follow up email supporting this. ", "rating": 5}, {"title": "Quickly Answered My Questions ", "text": "Answered my questions and sent required forms by email and suggested I fill them out and return them to that email address and they would be uploaded to my already filed claim. Great customer service", "rating": 5}, {"title": "Great customer support", "text": "The customer support person was super helpful and walked me through the process of filing out the application.  She caught that my account number was wrong which would have slowed thing down.", "rating": 5}, {"title": "Autumn was very clear and concise in…", "text": "Autumn was very clear and concise in helping me with my request. In my experience I am quite often confronted in a situation like this with someone who barely  has a command of the English language.Good hire on your part. Cert # 1TPC23-AOS-132304", "rating": 5}, {"title": "Customer service was patient and…", "text": "Customer service was patient and informed on what I needed. Was able to resolve my issue by providing me with the information and documents I needed to fill out.", "rating": 5}, {"title": "Thank You", "text": "I felt confident and relieved to have purchased an insurance before leaving for the trip. The unexpected and unfortunate situation happened that my father had a stroke during our trip. Seven Corners insurance answered questions quickly and efficiently. When I was ready to fill out the claim I was too overwhelmed to find my way in the website.  I called the company and received assistance immediately.  The representative was so courteous and patient that she remain with me on the phone until I completed the claim.The support I received in this difficult situation is greatly appreciated.  During unexpected situations when is hard to think and simple things can be hard to do, angels come along.  Thank you madam, did not get your name, for being so helpful in this process.Thank You", "rating": 5}, {"title": "Travel Coverage ", "text": "Mrs. Andrea so very polite, courteous, knowledgeable, and patient with me. Would highly recommend Seven Corners Travel Ins. Company to other travelers. They have the best rates for the coverage in my opinion. ", "rating": 5}, {"title": "The lady helped me to fix my online…", "text": "The lady helped me to fix my online account by spending a lot of time with me. ", "rating": 5}, {"title": "I had a claim to file", "text": "I had a claim to file, and Andrea was an amazing customer servicie provider, guided me thru all the claim forms that I needed to fill out, over 40 minutes, very helpful knowledgeable and super patient.Thanks you Andrea ", "rating": 5}, {"title": "Candy was so helpful walking me through…", "text": "Candy was so helpful walking me through the claims forms. I couldn’t have figured it out without her.Deb", "rating": 5}, {"title": "Call was promptly answered", "text": "Call was promptly answered. The agent was pleasant and checked to ensure my updated cost fell within the time sensitive period. Shortly thereafter, I received  a confirmation email of the change.", "rating": 5}, {"title": "The customer service reps helped me…", "text": "The customer service reps helped me fillOut the claim for my husband and I since I had difficulty understanding how to do both.  They were kind, patient and very knowledgeable .  It was a pleasure working with both representatives!", "rating": 5}, {"title": "She was sooo very helpful", "text": "She was sooo very helpful.  She gave me the information I needed to fill out my travel insurance claim form with accuracy.   She was professional, personable and truly a pleasure to work with.   She needs a raise !  :) ", "rating": 5}, {"title": "Great service", "text": "Call was answered quickly. Good telephone connection. Agent was knowledgeable and easy to understand--sounded like English was first language. Transaction (change in policy) was completed quickly. ", "rating": 5}, {"title": "Our recent purchase through Squaremouth…", "text": "Our recent purchase through Squaremouth autofilled in incorrect dates for the policy so I called Seven Corners to talk to an agent.  She was extremely courteous, helpful, and understanding and quickly corrected the problem.", "rating": 5}, {"title": "Great follow up /follow through ", "text": "I purchased this travel insurance on line. I immediately received all the info plus my own representative. I continued to receive updates. I also received my policy and what info I would need for my trip. Unfortunately, I did need some medical. Seven Corners responded immediately. And updated me almost everyday. 10 days after my original claim I received resolution and approval. Wonderful experience working with them and will definitely use them again. Thank you! ", "rating": 5}, {"title": "Courteous and professional service", "text": "I called to reassure I had done everything I needed and that my claim had arrived. I was happy to know everything had arrived safely and they were working on my claim. The lady I talked to was professional sweet and reassuring. Thank you it’s rare these days to get someone so good. I was so happy with her service 😊🌷 3E761793E543", "rating": 5}, {"title": "Janetta Wade in the Customer Service…", "text": "Janetta Wade in the Customer Service office did a wonderful job with my inquiry. She was professional and caring all whilst helping me resolve my problem I was experiencing filing a claim.She delivered excellent customer service!", "rating": 5}, {"title": "Wonderful experience from day one.", "text": "I've had called the Seven Corners number of times and from the initial call, they were very professional and pro-active to assist me. Every person I spoke to was able to get access to updated information regarding my case and very helpful.  I really appreciate working with this company.", "rating": 5}, {"title": "Customer service was amazing and helped…", "text": "Customer service was amazing and helped me walk through all my problems.  They are willing to protect our mission work in areas the others would not even consider.  ", "rating": 5}, {"title": "Candy was very helpful and informative…", "text": "Candy was very helpful and informative about how to go about a claim.", "rating": 5}, {"title": "Very helpful service representative", "text": "Very helpful service representative - Ami Bolin helped us sort out some online issues we had.  Super friendly.", "rating": 5}, {"title": "We filed a claim on this policy", "text": "We filed a claim on this policy.  The filing was very easy.  The company communicated with us immediately about it.  The claim was paid in full and quite quickly.  Thank you very much for a good customer experience. ", "rating": 5}, {"title": "Excellent service", "text": "Answers were quick & correct. The staff was friendly & helpful.", "rating": 5}, {"title": "Great service with SEVENCORNERS", "text": "I am very much satisfied with your great service.  Please keep on doing it.Blessed ", "rating": 5}, {"title": "Skylar", "text": "Skylar, the customer rep, was great. I noticed an error in the name listed on my ID card and letter for an upcoming policy and she fixed that on the spot. Thank you!", "rating": 5}, {"title": "Second time using for our Trip…", "text": "Second time using for our Trip Insurance, very easy to use and included everything we needed in the insurance.", "rating": 5}, {"title": "Skylar DeBruyn answered all of our…", "text": "Skylar DeBruyn answered all of our questions with expertise and good rapport. We asked to record a message regarding the great call we had with her.", "rating": 5}, {"title": "Policy questions after purchase ", "text": "I called to ask a few questions about the new policy I purchased online and I had a very nice and helpful person on the phone that answered all of my questions.", "rating": 5}, {"title": "I think these annual plans are very…", "text": "I think these annual plans are very comprehensive covering all areas well, and are also a good value when comparing to other annual plans.  I highly recommend Srven Corners for your travel insurance.", "rating": 5}, {"title": "The agent i spoke withSkylar", "text": "The agent i spoke with, Skylar was so kind.  Her voice was clear and easy to understand.  She made sure I was k with all the info she was giving to me.  She showed concern and care.  she eased my concerns about submitting a claim and how to do it.  She was through.  Thanks so much", "rating": 5}, {"title": "Candy was bright and professional!", "text": "Candy was bright, chipper and professional. She helped me with what I needed to know to prepare my claim and I thank her for her assistance!", "rating": 5}, {"title": "All my questions were answered", "text": "All my questions were answered. Kandy ( I hope I write their name correctly) was so helpful - they provided clarification on my insurance policy and all additional details beyond what I expected.Their acknowledgement of the complicated healthcare system and the need for clarification is also very important.Overall, I appreciate their time and resources provided.", "rating": 5}, {"title": "I was served by Andrea", "text": "I was served by Andrea, who was gracious and very supportive. Every question I had she answered and sent me supportive information. ", "rating": 5}, {"title": "We had no issues that required using…", "text": "We had no issues that required using the insurance. I do like the ease of purchasing healthcare as primary insurance and adjusting the amt of insurance as needed. ", "rating": 5}, {"title": "Exceptional staff great customer…", "text": "Exceptional staff great customer service! Andrea totally nailed it helping me submit a somewhat complex medical expense travel claim with ease! She was extremely patient and professional. The whole experience with SC customer service from purchase to submitting a claim has been excellent!", "rating": 5}, {"title": "The website was clear and easy", "text": "The website was clear and easy to navigate. When I had to make a change of dates the person who helped me was very pleasant and efficient. ", "rating": 5}, {"title": "Fast and easy policy modification", "text": "Due to airline scheduling changes we needed to add an additional day to the end of our current policy. I was able to get it done quickly and effortlessly over the phone.Thank you!", "rating": 5}, {"title": "Amber was great", "text": "Amber was so kind and helpful! Very professional and patient.", "rating": 5}, {"title": "Peace of Mind knowing that if something…", "text": "Peace of Mind knowing that if something caused a travel problem, the insurance was there to protect me", "rating": 5}, {"title": "Great customer service", "text": "Great customer service! I was provided all necessary information.  This was a plan I purchased in 2/2023 for my trip 4/2024.", "rating": 5}, {"title": "Updates made easy", "text": "Every time I have called to ask questions I get polite responsive answers. The info is always very helpful. ", "rating": 5}, {"title": "Customer Service about Payment", "text": "Needed a more detailed invoice that was not available online.  I called in and the representative was quick to provide me the documentation that I needed.", "rating": 5}, {"title": "Excellent service", "text": "The operator was friendly and eager to help. They know their job perfectly, and we resolved the issue in no time.", "rating": 5}, {"title": "My conversations", "text": "The people that I spoke to were helpful, listened and helped me to be comfortable making changes to my policy/", "rating": 5}, {"title": "We had to cancel our cruise before…", "text": "We had to cancel our cruise before departing, and Seven Corners let us save our insurance premium for a future cruise.", "rating": 5}, {"title": "Independent Review", "text": "Autumn was a pleasure to work with.  She told me exactly what I needed to process my claim.  Certificate # 44440473-P", "rating": 5}, {"title": "Skylar was very helpful with…", "text": "Skylar was very helpful with information I called about. Also, very patient with my phone cutting out.", "rating": 5}, {"title": "The assistance I received from Tristan…", "text": "The assistance I received from Tristan was excellent.  He was able to answer all of my questions thoroughly.", "rating": 5}, {"title": "24F5335681B8 claim information ", "text": "Janette answered my questions and gave me helpful information about my claim24F5335681B8", "rating": 5}, {"title": "The agents are friendly", "text": "The agents are friendly, knowledgeable, and helpful. I will definitely use them again!", "rating": 5}, {"title": "My call was answered quickly and the…", "text": "My call was answered quickly and the solution was explained to me in a very understandable way.", "rating": 5}, {"title": "Awesome!", "text": "This review is for Laura M. She was very patient. She stayed connected with me while I worked on my claim to help answer all my questions.", "rating": 5}, {"title": "Great Customer service", "text": "I contacted customer service to clarify some policy questions and Candace, who supported me, was super helpful. I am satisfied with the customer service so far.  ", "rating": 5}, {"title": "Great customer service", "text": "Great customer service.   Representative was very helpful when I needed to make a change to my policy.", "rating": 5}, {"title": "Superb customer service! ", "text": "When calling to follow up on claim inquiry, the call was instantly answered by a fabulous, friendly, professional, knowledgeable, and helpful representative. I was VERY impressed! ", "rating": 5}, {"title": "I had to make a change", "text": "I had to make a change and Skylar was very efficient and friendly.  ", "rating": 5}, {"title": "Quick, clear advice from Candy @ Seven Corners", "text": "The representative, Candy, answered my questions about documenting claimed expenses very clearly and quickly. My situation was complicated because of (i) a combination of payments and refunds, and (ii) inadequate documents from the tour provider. ", "rating": 5}, {"title": "Candy is the best", "text": "Candy is the best! She had the thorough knowledge of claims and insurance policy and helped me so much with kindness. ", "rating": 5}, {"title": "Agent responded succinctly to my query…", "text": "Agent responded succinctly to my query about coverage for a last minute cruise. ", "rating": 5}, {"title": "Great agent  ", "text": "The agent was very friencly and knowledgable.  She understood my issue and corrected my mistake quickly and accurately.", "rating": 5}, {"title": "Great Customer Service", "text": "I was able to extend the travel insurance on the phone with Scarlett, the insurance specialist; and received a confirmation email in less than a minute.", "rating": 5}, {"title": "Great experience", "text": "Overall, the wonderful experience for booking the policy as well as calling for cancellation due to unexpected changing. The agent was super helpful and efficient! Thank you. ", "rating": 5}, {"title": "They were very helpful with any issues…", "text": "They were very helpful with any issues that came up. Very professional !", "rating": 5}, {"title": "customer service was very helpful and…", "text": "customer service was very helpful and presented an alternative way to file a claim when I had difficulty with the online form. ", "rating": 5}, {"title": "easy to set up this insurance for my…", "text": "easy to set up this insurance for my trip and the price was fair", "rating": 5}, {"title": "The people answering the telephone were…", "text": "The people answering the telephone were very nice, efficient and answered my questions.  ", "rating": 5}, {"title": "She was very knowledgeable", "text": "She was very knowledgeable, helpful and kind", "rating": 5}, {"title": "Excellent customer service", "text": "Excellent customer service. Very friendly and helpful. I would highly recommend thus company for travel insurance", "rating": 5}, {"title": "The operator was very helpful and…", "text": "The operator was very helpful and informative. She explained the procedure with claims in details and made the things easier to understand.", "rating": 5}, {"title": "Excellent customer service", "text": "Excellent customer service. Answered all my questions and followed up with email. ", "rating": 5}, {"title": "Absolutely fabulous great service great…", "text": "Absolutely fabulous great service great knowledge thanks for all your help", "rating": 5}, {"title": "Submitting a claim", "text": "Information and clarity on what to do to submit a claim was very helpful.", "rating": 5}, {"title": "Very helpful and prompt action", "text": "Date of experience: September 26, 2024", "rating": 5}, {"title": "Tristen was very helpful in getting…", "text": "Tristen was very helpful in getting travel insurance setup.", "rating": 5}, {"title": "Questions about our recent policy purchase ", "text": "Very helpful and answered my questions about our coverage.", "rating": 5}, {"title": "I was able to get information regarding…", "text": "I was able to get information regarding my trip coverage quickly and easily. ", "rating": 5}, {"title": "Good People Ready to Assist ", "text": "Good people ready to assist me an d excellent outcome.", "rating": 5}, {"title": "Excellent Customer Service Experience", "text": "Great phone agent, got us just the information we needed.  Thanks!", "rating": 5}, {"title": "Great Customer Service", "text": "The agent was cordial, professional, and able to answer all questions we had with regard to submitting a claim", "rating": 5}, {"title": "The representative who took my call was…", "text": "The representative who took my call was extremely helpful and friendly. Truly a great representative!", "rating": 5}, {"title": "She is so nice and kind", "text": "She is so nice and kind. Every problem was solved by her. I really appreciate it.", "rating": 5}, {"title": "RV Breakdown", "text": "I had to make changes to my travel dates because the RV broke down.  Your agents were very helpful.", "rating": 5}, {"title": "Skyler helped me with all my inquiries", "text": "Skyler helped me with all my inquiries ", "rating": 5}, {"title": "Easy to understand", "text": "Easy to understand! Quick response to change!", "rating": 5}, {"title": "The Seven Corners representative was helpful and solved the problem.", "text": "The Seven Corners representative was helpful and took care of the problem. ", "rating": 5}, {"title": "Helpful and friendly customer service", "text": "The rep I spoke to was not only helpful but also very friendly and pleasant.   ", "rating": 5}, {"title": "Great Customer Service with Laura!!", "text": "Date of experience: August 26, 2024", "rating": 5}, {"title": "Agents are very helpful and…", "text": "Agents are very helpful and Knowledgeable.", "rating": 5}, {"title": "Ease of use", "text": "Ease of use. Just the right cover at a reasonable price. ", "rating": 5}, {"title": "Agents were very helpful and…", "text": "Agents were very helpful and straightforward.", "rating": 5}, {"title": "Agent polite and easy to understand.", "text": "Date of experience: June 11, 2024", "rating": 5}, {"title": "Took care of me right away and it was…", "text": "Took care of me right away and it was effortless ", "rating": 5}, {"title": "Good customer service ", "text": "Questions answered by competent agent ", "rating": 5}, {"title": "Skylar was friendly", "text": "Skylar was friendly, and helpful.", "rating": 5}, {"title": "Quick and friendly", "text": "Quick, friendly and easy customer service", "rating": 5}, {"title": "Outstanding customer service👍👍👍👍👍  Will…", "text": "Outstanding customer service👍👍👍👍👍  Will recommend you to anyone who needs a reliable travel insurance. Carola", "rating": 5}, {"title": "Sven was great and helped me a lot.", "text": "Date of experience: October 10, 2024", "rating": 5}, {"title": "The professionalism of the customer service staff ", "text": "The professionalism of the customer service staff. She was courteous and polite.", "rating": 5}, {"title": "Easy to select the right policy", "text": "Easy to select the right policy. Value for what I’m getting. ", "rating": 5}, {"title": "The consultant was very quick to help…", "text": "The consultant was very quick to help me take care of my travel planz.s", "rating": 5}, {"title": "Easy to connect and had more questions…", "text": "Easy to connect and had more questions answered", "rating": 5}, {"title": "Very easy to deal with", "text": "Very easy to deal with. Made us feel like we were important.", "rating": 5}, {"title": "representative Andrea was extremely…", "text": "representative Andrea was extremely informative and sent me a claim form within 2 minutes  ", "rating": 5}, {"title": "Helpful and honest ", "text": "Helpful and honest 1TPB23-AOS-122933", "rating": 5}, {"title": "Staff was courteous and knowledgeable", "text": "Staff was courteous and knowledgeable ", "rating": 5}, {"title": "My concerns were being addressed.", "text": "Date of experience: February 23, 2024", "rating": 5}, {"title": "Gave me exactly what I wanted and saved…", "text": "Gave me exactly what I wanted and saved me over $1,000!", "rating": 5}, {"title": "Prompt", "text": "Prompt, clear and professional advice", "rating": 5}, {"title": "Efficient and effective", "text": "The associate was kind, efficient, and helpful.", "rating": 5}, {"title": "Very quick response", "text": "Very quick response, very attentive! ", "rating": 5}, {"title": "Excellent customer service.", "text": "Excellent customer service. ", "rating": 5}, {"title": "Excellent communication and clarity", "text": "Excellent communication and clarity.  Effective and quick responses and process. Pleasant demeanor and style.", "rating": 5}, {"title": "Kind and quick", "text": "Kind, patient, and quick help when I needed it. Thank you!", "rating": 5}, {"title": "Fast customer service ", "text": "Great service ", "rating": 5}, {"title": "Very helpful.", "text": "Very helpful. ", "rating": 5}, {"title": "Good service", "text": "Good service ", "rating": 5}, {"title": "Great customer service", "text": "Easy online quotes and coverage information.  Provides coverage to senior 70+!", "rating": 5}, {"title": "Quick help with detailed information", "text": "Quick help with detailed information. Friendly customer service. ", "rating": 5}, {"title": "great service by Joan", "text": "Date of experience: July 18, 2024", "rating": 5}, {"title": "Very helpful agent", "text": "Date of experience: May 01, 2024", "rating": 5}, {"title": "Fast courtesy service", "text": "Fast courtesy service ", "rating": 5}, {"title": "Customer service is a big deal", "text": "The customer service representative was very personable and tried to understand my questions. ", "rating": 5}, {"title": "friendly and knowledgeable", "text": "Date of experience: March 01, 2024", "rating": 5}, {"title": "A relief to be insured ", "text": "The associate was very helpful and knowledgeable ", "rating": 5}, {"title": "quick and efficient.", "text": "Date of experience: February 19, 2024", "rating": 5}, {"title": "Very responsive and helpful.", "text": "Date of experience: June 03, 2024", "rating": 5}, {"title": "Outstanding Customer Service", "text": "Prompt access to customer service rep and updating insurance.", "rating": 5}, {"title": "Amazing and very friendly", "text": "Very patient and knowledgeable.", "rating": 5}, {"title": "Great knowledgeable and pointed answers", "text": "Date of experience: April 01, 2024", "rating": 5}, {"title": "Very nice rep to talk with (Candy)", "text": "Date of experience: July 17, 2024", "rating": 5}, {"title": "Very nice and efficient customer…", "text": " Very nice and efficient customer service!", "rating": 5}, {"title": "Very professional courteous and always…", "text": "Very professional courteous and always available", "rating": 5}, {"title": "Very helpful and professional", "text": "Date of experience: August 26, 2024", "rating": 5}, {"title": "Representatives were very cordial and…", "text": "Representatives were very cordial and helpful", "rating": 5}, {"title": "Efficient and cheerful customer service…", "text": "Efficient and cheerful customer service helper. ", "rating": 5}, {"title": "The friendliness and helpfulness of the…", "text": "The friendliness and helpfulness of the representative.", "rating": 5}, {"title": "Good customer service!", "text": "Date of experience: June 26, 2024", "rating": 5}, {"title": "Outstanding company and service!", "text": "Date of experience: February 20, 2024", "rating": 5}, {"title": "Super satisfied ", "text": "fast response Reliable insurance ", "rating": 5}, {"title": "Good customer service", "text": "Good customer service ", "rating": 5}, {"title": "Outstanding communication", "text": "Outstanding communication, very patient. ", "rating": 5}, {"title": "Representatives were excellent", "text": "Representatives were excellent ", "rating": 5}, {"title": "excellent customer service", "text": "Date of experience: April 19, 2024", "rating": 5}, {"title": "Fantastic and professional.", "text": "Fantastic and professional. ", "rating": 5}, {"title": "April Welch, Our Responsive, Professional Resource", "text": "We have worked with April Welch on at least 7 occasions. All of which included medical, extended stay and multiple countries. Our work together has included switching countries within a plan due to geopolitical issues and concerns. In all cases April has been very supportive, responsive, articulate, detailed and helpful. We have called on her for recommendations, to get her input and help us understand choices and logistics. We appreciate April’s help and professionalism!Dean & Lynda Duffy", "rating": 5}, {"title": "I have never purchased travel insurance…", "text": "I have never purchased travel insurance for a large trip before.  After researching and talking to several travel insurance companies, I found Seven Corners had the most comprehensive policy compared to others.  The Seven Corners representatives, I have spoken to, are well-informed and made the whole process of purchasing less intimidating.  I am hoping not to have to make use of the insurance, but I feel more protected now that I have it.", "rating": 5}, {"title": "Excellent agent", "text": "The agent went out of her way to ensure the issue was resolved. She was patient, persistent and provided clear feedback once the issue was resolved. Thank you!", "rating": 5}, {"title": "The agent listened to my concern", "text": "The agent listened to my concern, checked on it with a manager and then called me back to resolve the issue in my favor. I appreciate the follow through and the fact the company honored our signed policy.", "rating": 5}, {"title": "Clear communication", "text": "We appreciated April's clear communication and desire to work with us to find the best match for our travel insurance needs.", "rating": 5}, {"title": "Representative was friendly and very…", "text": "Representative was friendly and very helpful", "rating": 5}, {"title": "Fast resolution of my problem", "text": "Fast resolution of my problem.  I had an incorrect date on my policy and Ami fixed the problem quickly after asking a couple of questions.  The updated policy was emailed to me within a few minutes.  Easy!", "rating": 5}, {"title": "Didn't need to use", "text": "Didn't need to use, but process was easy!", "rating": 5}, {"title": "Very supportive and kind", "text": "The person was very supportive, kind, and helped me with my problem.", "rating": 5}, {"title": "Very helpful, well trained staff", "text": "I have been very happy with the service I have received from Seven Corners.  I had to cancel my trip 4 days before departure due to an unanticipated health emergency.  The staff at Customer Service was there for me from day one on this.  They have either answered my call immediately or returned my call quickly.  They have helped advise me on forms and documents needed to make a claim. Then once I had submitted them, they have reviewed them for me to assure they were all received and properly completed.  They, also,  advised me on what else I might need to submit. They have even helped me to understand how to go about getting the additional needed documentation. This has all be accomplished over the course of a week. I do, also, get email updates from the claims department acknowledging receipt of documents.  I am very pleased with the service so far.  At this point, I am waiting for word that my claim was accepted and a refund will be forth coming.", "rating": 5}, {"title": "It was nice to get a customer service…", "text": "It was nice to get a customer service person listen to reason and see the wisdom in allowing my reduction in coverage request due to airfare already being insured", "rating": 5}, {"title": "Great Service and Quick Claim Processing", "text": "Had to use our travel insurance for the first time ever due to an illness.  Filing the claim online was easy and spoke with a very friendly claims representative for assistance on ensuring that I filed everything correctly.  Filed our claim on 2/5/23 and our claim check was deposited into our bank account on 2/9/23.  WOW.... Never thought it would be that quick.  Seven Corners will be our go to travel insurance from now on.", "rating": 5}, {"title": "Talked to a representative…she was…", "text": "Talked to a representative…she was great…very knowledgeable.", "rating": 5}, {"title": "Call with policy dept. for indicative premium charge", "text": "The agent (Anyes) with whom I have had the pleasure of speaking with previously on the same policy, a month or so ago was helpful and responsive.", "rating": 5}, {"title": "Very helpful agent", "text": "Very helpful agent, took care of my problem quickly.", "rating": 5}, {"title": "Customer Service Rep was extremely Helpful", "text": "The Customer Service Rep was extremely knowledgeable and helped me make sure my previously sent information (as a reply to a request by the company for further information but provided the incorrect email address when I used the reply button) got to the correct email address, which she provided, and stayed on the phone with me until it came through.", "rating": 5}, {"title": "Certificate number1TPB23-AOS-113838", "text": "Certificate number1TPB23-AOS-113838 Kaia R was extremely helpful and refunded the airfare insurance I added yesterday after finding out today that we are covered for that. She needed approval and it did not take long for her to receive it. The process was easy and I greatly appreciate the great customer service!", "rating": 5}, {"title": "I think their customer service is wonderful...", "text": "I buy the medical insurance for all of my cruises. I've had to use it once last August when I came down with COVID.I am confident of the customer service available with seven corners.", "rating": 5}, {"title": "Great Customer Service", "text": "I had just booked additional Insurance for a Princess Cruise that was unfortunately cancelled with two weeks out.  I called immediately to cancel the policy and it was handled immediately and very professionally.", "rating": 5}, {"title": "andrea was very helpful and patient as…", "text": "andrea was very helpful and patient as she listened to my reasons for submitting a claim.she offered assistance in what docs. I needed and how to submit.", "rating": 5}, {"title": "Great customer service with an agent…", "text": "Great customer service with an agent that answereed all questions.", "rating": 5}, {"title": "Ms Autumn was very patient with me and…", "text": "Ms Autumn was very patient with me and was very clear . I was filled with hope that my claim would be acknowledged . She e-mailed all the necessary forms needed for filing a claim .", "rating": 5}, {"title": "The representative was very helpful", "text": "Date of experience: January 29, 2024", "rating": 5}, {"title": "I thought I'd share a positive…", "text": "I thought I'd share a positive experience. After years of travel and being very lucky, we had to use travel insurance for our first time. We had planned a 3 and a half week trip nearly a year ago - scheduled to depart on January 21. Having an elderly parent and an elderly pet, we bought travel insurance with a cancel for any reason rider. Sadly we discovered one of our dogs has an aggressive cancer that needed immediate treatment. For us, the right decision was to cancel our trip.We have always purchased our insurance through Seven Corners out of Indianapolis. We notified the company of our decision to cancel the trip on January 16. We had gathered all the needed documentation (which was quite a bit) in the days leading up to the cancellation. I'm happy to report they accepted our claim with all documentation that I provided. No further questions. We had reimbursement for our claim in our checking account by January 25. So very happy we bought the insurance.", "rating": 5}, {"title": "Very efficient in answering questions…", "text": "Very efficient in answering questions and getting me the documents that I wanted.", "rating": 5}, {"title": "Customer Service extremely responsive…", "text": "Customer Service extremely responsive and addressed my question!  Thank you.", "rating": 5}, {"title": "Responsive", "text": "Responsive.  Understandable.", "rating": 5}, {"title": "Very good customer service", "text": "Very good customer service. Good availability.", "rating": 5}, {"title": "So far so good", "text": "So far so good. I had to change my coverage ti add another country. I got a call the next day to make the change.", "rating": 5}, {"title": "Quick response to my claim.", "text": "Date of experience: January 15, 2024", "rating": 5}, {"title": "Talking to real person that was…", "text": "Talking to real person that was courteous and polite", "rating": 5}, {"title": "great service", "text": "great service, knowledgeable and very patient and kind.  Plus, friendly and thanked me for the insurance plan.", "rating": 5}, {"title": "Claim satisfaction", "text": "Communication with sales team and claims team was excellent.  Important to keep all documentation to substantiate a claim.  I faxed a package of invoices etcAnd received full reimbursement in 60 days.  No complaints.  Representatives were easy to talk to and helpful.  Best thing I can say is I would use Seven Corners again to insure a cruise vacation", "rating": 5}, {"title": "I needed to change dates and a country…", "text": "I needed to change dates and a country I was visiting based on changes to a tour.  It was so easy!", "rating": 5}, {"title": "The reps made it easy to understand to…", "text": "The reps made it easy to understand to available options.", "rating": 5}, {"title": "Intelligent agent", "text": "Your agent, Autumn, was very helpful and knowledgeable.", "rating": 5}, {"title": "fast customer service", "text": "fast customer service, courteus and informative", "rating": 5}, {"title": "Understanding Trip Delays", "text": "We are so grateful that your team decided to extend the period where policy changes can be made.  We experienced several delays in our trip (all of them out of our control) to a country that has experienced some serious political strive, making travel unsafe.  This extension was very much appreciated and we understand that you did not have to grant it.  Thank you for this!", "rating": 5}, {"title": "very helpful and patient with me in…", "text": "very helpful and patient with me in sorting out several questions about my policy.. Thanks", "rating": 5}, {"title": "Very knowledgeable", "text": "Very knowledgeable,  and helpful staff!", "rating": 5}, {"title": "Very nice employees that are very…", "text": "Very nice employees that are very helpful!", "rating": 5}, {"title": "Called to change travel dates on an…", "text": "Called to change travel dates on an existing policy. The woman I spoke to was fabulous ... knowledgeable, pleasant and efficient. She is a credit to her company!!!", "rating": 5}, {"title": "The customer service representative…", "text": "The customer service representative actually listened with empathy and understanding, made me feel valued.", "rating": 5}, {"title": "It did not take long to answer my…", "text": "It did not take long to answer my question.", "rating": 5}, {"title": "Solid Experience", "text": "I've had a solid experience with these guys. Not impeccable communication, but really didn't have any complaints and will definitely use again.", "rating": 5}, {"title": "Candy was wonderful and very thorough…", "text": "Candy was wonderful and very thorough in reviewing my travel insurance purchase and correcting a couple of errors I made on the application form.", "rating": 5}, {"title": "Prompt answer and correction of problem", "text": "Date of experience: January 08, 2024", "rating": 5}, {"title": "The person I talked to was very helpful…", "text": "The person I talked to was very helpful & informative.  I will have to admit I do not like these surveys!", "rating": 5}, {"title": "I needed more info on part of my policy…", "text": "I needed more info on part of my policy, the gal that answered the phone was helpful but needed to check more in depth. She got back promptly & answered what was needed.", "rating": 5}, {"title": "Claim reimbursed for trip interruption", "text": "I purchased  travel protection basic insurance for an intentional trip, just in case I needed medical attention. While traveling, a family member fell ill back in the US and I had to fly home unexpectedly. I reached out to Seven Corners after returning home to see if the policy could cover the cost of the ticket due to the medical emergency and the representative let me know it could cover up $1,000 if I had proper back up documentation. I filled out the paperwork, submitted the claim, and it was approved and the money was deposited into my account. One thing to know, it wasn’t a quick process. I filed the claim in October and it wasn’t reviewed until December. I had to resubmit the physicians form and then it was approved in January. I received the direct deposit to my account with 48 hours of the approval though! I would definitely use them again and look to add in the plan that fully reimburses costs due to a medical emergency/trip interruption.", "rating": 5}, {"title": "Canceling the policy was easy!", "text": "Canceling the policy I did not need was very easy. Thank you.", "rating": 5}, {"title": "Called regarding  medical claim", "text": "Called regarding  medical claim. So helpful and professional.", "rating": 5}, {"title": "Help when needed", "text": "The friendliness of personnel to help solve an issue.", "rating": 5}, {"title": "Customer service", "text": "The customer service representative was extremely helpful and friendly.", "rating": 5}, {"title": "Good service.", "text": "Date of experience: December 19, 2023", "rating": 5}, {"title": "I was able to talk to a person right…", "text": "I was able to talk to a person right away and not an AI. She was very helpful and pleasant. I would recommend this insurance to anyone.", "rating": 5}, {"title": "Tristan Schilling was my agent", "text": "Tristan Schilling was the agent I booked my policy through. He was very professional, patient and knowledgeable. The epitome of caring customer service.", "rating": 5}, {"title": "When seven corners denied my claim", "text": "When seven corners denied my claim, I was really upset. Laura and I connected via Seven Corners facebook page. She went out of her way to help me submit an appeal and get it approved", "rating": 5}, {"title": "Great customer service!", "text": "Very knowledgeable and helpful customer service! Thank you!", "rating": 5}, {"title": "Excellent service", "text": "When I fell and injured my knee (requiring a visit to an E.R.), Seven Corners was seamless from from start to finish. The phone representatives were so friendly and helpful. I received my reimbursement in less than a month. I will definitely purchase the same product for future trips!", "rating": 5}, {"title": "Got the information I needed.", "text": "Date of experience: December 05, 2023", "rating": 5}, {"title": "It took over a month to get our money…", "text": "It took over a month to get our money back, which I felt was a bit slow, but I had no problems. My husband and I got COVID and were not able to go on our trip. We had both been paying separately for our portion of the trip through EF Ultimate Break for about a year and we both got our full amount back by submitting the physician statement and some medical records.", "rating": 5}, {"title": "Great customer service!", "text": "Date of experience: November 29, 2023", "rating": 5}, {"title": "It was quick and easy to make the change", "text": "It was quick and easy to make the change and the premium increase was lower than expected.", "rating": 5}, {"title": "Excellent Customer Service!", "text": "From the beginning  to completion of my request, the customer service was top notch!", "rating": 5}, {"title": "Very helpful lady on the phone", "text": "Date of experience: November 16, 2023", "rating": 5}, {"title": "Positive customer service experience", "text": "Easy to reach customer service for questions about coverage when making purchase decision. I called 3 different times while considering alternative insurance companies and the representative was always knowledgeable and helpful. I will be traveling in 2024 so I cannot comment on any other aspect of coverage.", "rating": 5}, {"title": "Andrea was outstanding in dealing with…", "text": "Andrea was outstanding in dealing with my question. She was knowledgeable and helped me in finding a solution. Thank you!", "rating": 5}, {"title": "Associate was attentive", "text": "Associate was attentive, knowledgable and solved my problem. Thank you", "rating": 5}, {"title": "So glad I chose Seven Corners Insurance", "text": "No, extensive waits online. Very pleasant, helpful employee to answer questions. Resolved problem immediately.", "rating": 5}, {"title": "The company was most helpful in all…", "text": "The company was most helpful in all aspects of my needs I will use again", "rating": 5}, {"title": "We had few questions about claim form.", "text": "We had few questions about claim form.Customer service representative was patient and friendly, she answered all our questions in details. She knew what she was talking about.", "rating": 5}, {"title": "Ms. Fonville", "text": "Ms. Wade was SUPER  helpful!! After our call ended, she called me to let me know only ONE person in my family had received reimbursement. I am so grateful she noticed this and emailed me the documents to complete and submit for reimbursement.  OUTSTANDING customer service!!", "rating": 5}, {"title": "Everyone was very helpful and patient!", "text": "Date of experience: November 09, 2023", "rating": 5}, {"title": "Representative helpful", "text": "Today I called and spoke to representative Cindy who checked to make sure all forms were received. She was polite and checked everything out and told us we were in review and would take another 30 days until determination.  The paperwork and forms were difficult to fill all out on line.   Frustrating! On  August 25 EF Go Ahead Tours communicating to file claim.  Still going on, waiting for refund.  CINDY WAS VERY HELPFUL!cert# F 5E029B05563", "rating": 5}, {"title": "Agent was very responsive to my…", "text": "Agent was very responsive to my questions, and seemed to be well informed.", "rating": 5}, {"title": "Helpful and fair", "text": "Seven Corners was very helpful in getting our trip insurance for our South Africa trip. We had some problems getting there so now I’m filling out a claim for our lost vacation time. I’m assuming that Seven Corners is going to be just as helpful and fair in this process.", "rating": 5}, {"title": "No hassles in trying to obtain a policy…", "text": "No hassles in trying to obtain a policy to suit my needs.  I like having several plans to choose from.", "rating": 5}, {"title": "Courteous", "text": "Courteous, prompt and efficient", "rating": 5}, {"title": "Your customer service rep", "text": "Your customer service rep. She was friendly, knowledgeable, extremely helpful and this made my experience a positive", "rating": 5}, {"title": "Call 2 times today", "text": "Call 2 times today.    Both times representative was helpful.  Have used seven corners before.    Find they are very reliable.", "rating": 5}, {"title": "No phone hold time", "text": "No phone hold time; got my answer quickly", "rating": 5}, {"title": "I needed to update my email", "text": "I needed to update my email. Skylar did so for me, quickly.", "rating": 5}, {"title": "Did not need to use them", "text": "Date of experience: October 22, 2023", "rating": 5}, {"title": "Excellent Customer Service", "text": "The agent was excellent at answering my questions and clarifying specific details of my policy due to unusual world events in this particular region.", "rating": 5}, {"title": "Helpful", "text": "Helpful, pleasant", "rating": 5}, {"title": "Easy to make contract change", "text": "Easy to make contact with the correct staff.  The woman I contacted was personable and helpful -- she understood my question about extending the return date and quickly made the change after reconfirming my new date.  And, she was easy to understand as well as an overall good speaker.  I was impressed by her ability to quickly locate my policy, review my return date change, and make changes to the policy as well as to forward the revised policy in a very, very short time.  I believe she would be good at teaching others how to provide great service.", "rating": 5}, {"title": "Excellent Customer Seervice", "text": "I spoke with Andrea in Customer Service. She was beyond helpful. Very professional and went way beyond what I was asking for.  Complete blessing to Seven Corners to have her working there.", "rating": 5}, {"title": "Claim process was simple and smooth", "text": "Claim process was simple and smooth.  Will buy from again !", "rating": 5}, {"title": "Review", "text": "Great customer service!", "rating": 5}, {"title": "Purchase of the insurance is great", "text": "Purchase of the insurance is greatAnd when we decided not to take the trip, cancelling the insurance and receiving a full refund was even greater!!", "rating": 5}, {"title": "I got a call back rather than have to…", "text": "I got a call back rather than have to wait until an agent was available. The agent was well-informed and clear in her instructions.", "rating": 5}, {"title": "Very good customer service in terms of…", "text": "Very good customer service in terms of reminders and access to representatives. Cost of the coverage was comparable and the coverage was very comprehensive allowing for choices to be made that were important to consider.", "rating": 5}, {"title": "GOOD VALUE", "text": "GOOD VALUE for what you get compared to other insurance. Their definitions and documentation was straight forward and when I called their customer service to make changes they were very cooperative and friendly.", "rating": 5}, {"title": "The policy I need and at a reasonable…", "text": "The policy I need and at a reasonable price", "rating": 5}, {"title": "Peace of mind", "text": "Well we had no issues but had peace of mind knowing if something did happen we were covered", "rating": 5}, {"title": "Thankfully didnt have to use your…", "text": "Thankfully didnt have to use your service.  I picked your company because of the excellent rate and insurance coverage.", "rating": 5}, {"title": "I highly recommend Seven Corners", "text": "I highly recommend Seven Corners.  Someone picks up the phone quickly when you call.  Staff are knowledgeable and resolve your concerns.  We had to claim reimbursement for a trip and the process was very smooth and efficient.  Thank you Seven Corners.", "rating": 5}, {"title": "Sicily", "text": "Efficient assistance", "rating": 5}, {"title": "Candace Sheetz", "text": "Candace Sheetz, Customer Advocate was extremely helpful", "rating": 5}, {"title": "I need assistance with my certificate…", "text": "I need assistance with my certificate number. I’ve been told it’s incorrect and I should ask the seven corners to change it with new ID card. I can’t claim because I’m told my certificate number is incorrect. I don’t understand because I was given this number.Update: I was assisted. Thank you so much!!!!", "rating": 5}, {"title": "Seamless communication", "text": "Seamless communication, willingness to help, smooth process", "rating": 5}, {"title": "Thank you to Tristen", "text": "Thank you to Tristen who did a great job renewing my managers insurance!  He made it informative and easy.", "rating": 5}, {"title": "Great customer service", "text": "Great customer service. Thank goodness we didn’t need to use the insurance however when I called with questions I received answers immediately from a caring, helpful employee!", "rating": 5}, {"title": "Josh actually answered questions and…", "text": "Josh actually answered questions and was able to do what I needed.  It was prompt, accurate, and easy.", "rating": 5}, {"title": "Phone rep very knowledgeable & Online experience easy.", "text": "Re: purchasing policy--Phone rep very knowledgeable, steered me to make change online, stayed on phone as I extended date of policy.  Online experience and site very easy to use", "rating": 5}, {"title": "Agent answered several questions that…", "text": "Agent answered several questions that resolved a problem in my understanding of the payment process.", "rating": 5}, {"title": "Andrea is the customer service person…", "text": "Andrea is the customer service person that I spoke with. She was beyond helpful immediately emailed me the forms that I needed and walked me through what I would have to fill out. She went out of her way to make my experience a good one excellent customer service.", "rating": 5}, {"title": "It was easy to access info and sign up", "text": "It was easy to access info and sign up. Fortunately, I didn't need to use it", "rating": 5}, {"title": "Scotland 7/30]/2023 to 9/30/2023", "text": "All coverage information was readily available should we have had any issue during a 9 week stay in Scotland, UK.Explanation of coverage was concise.Customer Service response time is great.", "rating": 5}, {"title": "Thanks for laura M", "text": "I was very scared at first, but Laura helped me calmly and in detail by examining my entire file. thanks to her", "rating": 5}, {"title": "Fair Prices and Easy to Buy", "text": "Date of experience: September 27, 2023", "rating": 5}, {"title": "Folks are so nice and helpful to work…", "text": "Folks are so nice and helpful to work with", "rating": 5}, {"title": "Great customer service with Andrea", "text": "Great customer service with Andrea!  Thorough, helpful, and very reassuring that my claim was being processed.", "rating": 5}, {"title": "Maximum reimbursement 30 days after filing claim", "text": "We cancelled our September trip to Peru due to my new and unexpected heart failure diagnosis. I created my claim on 9/1/2023, Seven Corners requested additional documentation, and I received a letter that we will receive the maximum cancellation benefit on 10/02/2023. I am satisfied with this outcome and would use this coverage on future trips.", "rating": 5}, {"title": "Hotel reimbursement", "text": "Our connecting flight on AA was cancelled by British Air without telling us.  We could not get a flight out that day and had to spend a night in a hotel.  I sent all the information and bill to Seven Corners and was reimbursed the hotel stay in a reasonable amount of time.", "rating": 5}, {"title": "Your a very professional company and…", "text": "Your a very professional company and all your reps are the same and very helpful.", "rating": 5}, {"title": "Very personable and helpful", "text": "Date of experience: September 07, 2023", "rating": 5}, {"title": "I had a no-problem trip", "text": "I had a no-problem trip.  but Seven corners was easy to deal with in the securing of the travel insurance and dealing with a few issues prior to departure.", "rating": 5}, {"title": "Things I appreciate", "text": "1) Competitive pricing especially because the medical evacuation coverage was substantial enough for overseas travel2) appreciate the email received just before my travel to remind me of documents to have on hand", "rating": 5}, {"title": "Easy to purchase coverage", "text": "Easy to purchase coverage. Did not need to use it, so no experience there but would use again based on how easy it was to purchase coverage.", "rating": 5}, {"title": "Signing up for and purchasing coverage…", "text": "Signing up for and purchasing coverage was easy", "rating": 5}, {"title": "If you pay when needed to be payed", "text": "Good servicegood pricefriendly  stuff", "rating": 5}, {"title": "Bali & Thailand", "text": "Our representative was amazing. She was professional and very patient especially dealing with a large group like ours.  Any changes that I needed done, were done with no hesitation. Thank you.", "rating": 5}, {"title": "Friendly customer service agent", "text": "Date of experience: September 13, 2023", "rating": 5}, {"title": "I have always gotten a quick response…", "text": "I have always gotten a quick response with a live person.   I placed a claim, we will see it their payment to me is as good as their customer service is.", "rating": 5}, {"title": "Easy to get access to my files and…", "text": "Easy to get access to my files and plan. Luckily didn't need it this time around, but happy to have had it!", "rating": 5}, {"title": "bicycle accident in Portugal…", "text": "I had a bicycle accident in Portugal and broke my wrist.  I called Seven Corners from the hospital, and they suggested I pay up front (since the costs weren't exorbitant) then submit receipts.  I did exactly that, collecting receipts until the cast came off five weeks later.  I then submitted everything and received the reimbursement checks today, four weeks later.  I definitely will use their insurance again!", "rating": 5}, {"title": "Good policy options and pricing", "text": "Good policy options and pricing.  Like to purchase high coverage for medical without covering full cost of trips - like the options Seven Corners provides", "rating": 5}, {"title": "Quality customer service", "text": "Its easy to get ahold of a representative which is soooo refreshing. They give you 14 days to change your mind. If you change your mind they will refund you back the money. What isnt to like?", "rating": 5}, {"title": "Polite and helpful regarding upcoming…", "text": "Polite and helpful regarding upcoming international travel.", "rating": 5}, {"title": "It is nice knowing you have insurance…", "text": "It is nice knowing you have insurance in case anything goes wrong.  The airlines lost one of my suitcases and eventually found it but was glad I had backup if needed.", "rating": 5}, {"title": "Great Service", "text": "Pleasant, fast and efficient.  Couldn't have been any better!!", "rating": 5}, {"title": "My Seven Corners Medical Insurance", "text": "When purchasing my Seven Corners Medical insurance I omitted a destination. I called early this morning to fix this error and a young gentleman whose name I think is Richard was super efficient, sweet and professional and was able to add my destination right away. The service was excellent.", "rating": 5}, {"title": "I had several questions about the claim…", "text": "I had several questions about the claim form and direct, clear answers were given politely and professionally. I liked the call back feature during peak times 2RTB22-AOS-125722", "rating": 5}, {"title": "Confidence", "text": "Efficient personnel - ease of use - confidence in company from prior experience RTC - 130589", "rating": 5}, {"title": "This is an easy to use site that gives…", "text": "This is an easy to use site that gives multiple options for coverage.They are reliable, available and communicate well,Prices are competive", "rating": 5}, {"title": "Date change", "text": "Date of experience: September 05, 2023", "rating": 5}, {"title": "The person who I spoke to was very kind…", "text": "The person who I spoke to was very kind and understanding", "rating": 5}, {"title": "When setting up account", "text": "When setting up account, there was a real person who worked with me. That went smoothly. And the cost was reasonable.", "rating": 5}, {"title": "Crystal Gayle is wonderful!", "text": "Date of experience: September 02, 2023", "rating": 5}, {"title": "The customer service rep was great", "text": "Date of experience: September 01, 2023", "rating": 5}, {"title": "Amazing customer service and support", "text": "Amazing customer service and support.  Easy to reach a human !!!", "rating": 5}, {"title": "Signing up was easy & quick", "text": "Signing up was easy & quick. I had no claims so i can't speak to that but i definitely felt more at ease knowing i was covered for all unexpected emergencies.", "rating": 5}, {"title": "Jenetta did a great job walking me…", "text": "Jenetta did a great job walking me through my claim form yesterday!", "rating": 5}, {"title": "Great customer service", "text": "Great customer service! 😊", "rating": 5}, {"title": "Fast and efficient to add to a policy.", "text": "Date of experience: August 29, 2023", "rating": 5}, {"title": "Very supportive team", "text": "Very supportive team. Thanks", "rating": 5}, {"title": "Last minute policy update", "text": "Quick answer of my phone call.Fast answer to my question.", "rating": 5}, {"title": "A prompt response to my claim.", "text": "I needed to file a claim and spoke with three reps as I was putting it together.  They were competent and wonderfully kind on every call.  The documentation was complex, and I received detailed instructions and confirmations.  After I filed the claim, there were no follow-up questions or concerns on Seven Corners' part.  In a few weeks, my claim was accepted and the funds sent to my bank.  I was very impressed and would recommend their travel insurance to everyone.  Phillip Forester", "rating": 5}, {"title": "They were helpful and patient with…", "text": "They were helpful and patient with necessary changes and learning of their website.", "rating": 5}, {"title": "They come through", "text": "Customer service was very helpful in talking to me about how to file a claim.", "rating": 5}, {"title": "Great Communication from Seven Corners", "text": "Seven Corners communicated with me from the time before my trip, during and after. It provided me with my documents in emails more than once, so they were accessible and convenient. I appreciated having these communications even though I had downloaded the documents on my phone. It was nice to have them in various locations in case I needed them in a hurry.", "rating": 5}, {"title": "Trip extension insurance coverage", "text": "They understood that we had extended our trip, and they let us buy the insurance we needed going forward.  We purchased the insurance about 3 weeks before the extended part of our trip started.", "rating": 5}, {"title": "My ID PS00353230", "text": "My ID PS00353230. I have been getting emails very quickly and they follow the whole process. Thanks.", "rating": 5}, {"title": "It was easy and clear to purchase.", "text": "It was easy and clear to purchase.Luckily I didn't have to use. So I can't speak to claims", "rating": 5}, {"title": "Tandy was quick", "text": "Tandy was quick, courteous and professional. My situation was handled well.", "rating": 5}, {"title": "Nathan in customer service was very…", "text": "Nathan in customer service was very helpful in helping me file my claim and that I was doing it correctly.", "rating": 5}, {"title": "We never had to make a claim", "text": "We never had to make a claim,  but knowing they were there for our entire trip gave us peace of mind", "rating": 5}, {"title": "Exceptional Service", "text": "Seven Corners is my primary travel insurance provider. Their flexibility and customer service is tremendous. I've used them for many years and have also handled a claim for me perfectly.", "rating": 5}, {"title": "I never had to use it", "text": "I never had to use it. I did feel well covered.", "rating": 5}, {"title": "Troy handled my wife and my travel…", "text": "Troy handled my wife and my travel insurance requests promptly, professionally and we shared some humor....I have been using 7 corners for years as we have traveled to 104 countries, all 7 Continents, circumnavigated Australia, Iceland and traveled around Africa and S America!", "rating": 5}, {"title": "Certificate 1TPC23-AOS-110507", "text": "I had a very pleasant and productive experience. The representative i talked to ( i apologize for not remembering his name) was super friendly, engaging, very knowledgeable, and most importantly He addressed all of my issues. So thank you so much for making my day and allowing me to check off one more item from my to do list.", "rating": 5}, {"title": "Heather was very helpful and we needed…", "text": "Heather was very helpful and we needed to reschedule our trip several times and she always made sure we continued to have excellent coverage for our trip to Ireland.", "rating": 5}, {"title": "My mother fell and broke her pelvis…", "text": "My mother fell and broke her pelvis while on an overseas cruise.  Seven Corners was a life saver.  They were responsive and helped us get her home.  Thank you!", "rating": 5}, {"title": "Very helpful extending our coverage…", "text": "Very helpful extending our coverage through the pandemic.", "rating": 5}, {"title": "Answered the questions and corrected…", "text": "Answered the questions and corrected wife's last name. Haven't used any of the features so can't comment on how well the actual coverage is done.", "rating": 5}, {"title": "Great customer service", "text": "Nathan was extremely friendly and helpful.  Excellent!", "rating": 5}, {"title": "Certificate #", "text": "Certificate #: 2RTCG22-OR-100006DeAwna Bailey was extremely valuable in helping me navigate the travel insurance policy for my group.It is because of her that I selected Seven Corners.", "rating": 5}, {"title": "Easily policy changes", "text": "Rep was professional and made the changes to the policy for my upcoming trip as requested.", "rating": 5}, {"title": "It was great 😊", "text": "It was great 😊! At first I did not believe that I would get my money back , but I as soon as I completed the things needed ,!I got it quick! Thanks and is worth having a good coverage. Highly recommended 😊", "rating": 5}, {"title": "great service and execution", "text": "great service. excellent communication.everything was first rate. easy to do business with", "rating": 5}, {"title": "Easy clear helpful", "text": "Easy, clear and helpful.The representative was excellent!", "rating": 5}, {"title": "Don’t travel without Insurance.", "text": "Didn’t have to use it..this time. But had to twice in the past. Both times in Spain. Company was very responsive and fair. Took a little longer during Covid but they came through in covering unexpected expenses related to us catching Covid.", "rating": 5}, {"title": "great communication", "text": "Date of experience: August 01, 2023", "rating": 5}, {"title": "Cooperation is key", "text": "Cooperation is key. Especially when we canceled our trip due to the pandemic.", "rating": 5}, {"title": "Easy to work with", "text": "Easy to work with. Needed insurance for 4 couples from 4 different states. Got the coverage we needed at a decent price.", "rating": 5}, {"title": "Great customer service", "text": "Great customer service, great attitude, loads of help.", "rating": 5}, {"title": "I had an issue with the policy set up…", "text": "I had an issue with the policy set up when I missed a letter off my email.Seven Corners staff rectified the issue very efficiently.", "rating": 5}, {"title": "Seven Corners Insurance", "text": "I needed information sent to me concerning my cruise insurance. I Needed to speak to two customer service individuals. They were very knowledgeable and courteous.", "rating": 5}, {"title": "Easy to communicate with", "text": "Easy to communicate with. Each time all transactions have been completed in a fast manner. Every person I have interacted with has been very nice and professional.", "rating": 5}, {"title": "The person I spoke with was easy to…", "text": "The person I spoke with was easy to understand, knowledgeable and very helpful.", "rating": 5}, {"title": "Gotta have it just in case", "text": "Travel insurance is something you hope you never need. We didn't need ours but it was good to know it was there. We had about 20k tied up. 7 corners was in constant contact with us from about 7 days out until the vacation was over. Good to know they were there.", "rating": 5}, {"title": "Fortunately I did not require any…", "text": "Fortunately I did not require any services. It felt really good to know someone had my back.", "rating": 5}, {"title": "Great representative during purchasing process", "text": "The representative, (Tristan), when we selected our plan was Excellent. He is Very well informed, spoke clearly and explained all completely.  Fortunately, we did not have to use your services during our trip as all went well.", "rating": 5}, {"title": "This travel insurance made us feel very safe and secure", "text": "This travel insurance made us feel very safe on our trip. Luckily we didn't need to use it.  We bought it last year and had to delay that trip and they let us keep the policy and upgrade it if use within 2 years. Awesome option!", "rating": 5}, {"title": "It was very easy to do and the person on the phone was very helpful", "text": "It was very easy", "rating": 5}, {"title": "No complaints here", "text": "I really didn’t need to use the service ..but I have been going with Seven for all my travel coverage for over 10 years . My trips have been smooth sailing Thank God !! Purchasing it online is seamless.", "rating": 5}, {"title": "the people at your company are very…", "text": "the people at your company are very helpful and courteous", "rating": 5}, {"title": "Requesting a refund was very straightforward", "text": "Requesting a refund was very straightforward. However, it did seem like there was a duplication of document requests.  Nonetheless, I was very satisfied with the process and outcome.", "rating": 5}, {"title": "Peru 2023", "text": "We had originally booked our trip to Peru in 2020. As everyone knows that year COVID stalled everyone's travel plans. So we re-booked for 2021, travel was still iffy, so then rebooked again for 2022, where travel was still concerning. We FINALLY went on our trip to Peru July 2023. Seven Corners worked with us, and was able to use the travel insurance we purchased back in in early 2020 and transfer it for 2023. As I had to do was contact them with our updated travel plans. I did not need to purchase new travel insurance due to change of date plans.", "rating": 5}, {"title": "Easiest thing I didn't have to use...", "text": "Thankfully I didn't need to use the coverage, but it was easy to sign up for, all the documents and info were easy to understand and print off to take with me on my trip.", "rating": 5}, {"title": "Excellent customer service so far", "text": "Excellent customer service so far. We have always gotten trip insurance but never had to use it until this past trip. Unfortunately, due to weather delays we were stuck in NY for 2 extra days that was not expected. This is the first time I've ever had to make a claim and so far so good. The customer service rep was super helpful and I am so glad that I chose Seven Corners for my insurance needs!", "rating": 5}, {"title": "No need for medical attention the five…", "text": "No need for medical attention the five months in Vienna.", "rating": 5}, {"title": "Great coverage for the price", "text": "The materials explaining what the insurance did/did not cover were clear and easy to read, and I determined it provided the best coverage for the price. Also purchasing was super easy and smooth. Fortunately I didn’t have to use it but it also seemed like there were many options for reaching someone in case of emergency.", "rating": 5}, {"title": "Completion of purchasing in stages of Payment of Costs", "text": "Completion of purchasing in stages of payment of actual costs is wonderful.  Deposit, final payment of cruise/tour, flights, transportation, etc.", "rating": 5}, {"title": "The representatives were courteous and…", "text": "The representatives were courteous and helpful  in answering my questions and getting to me the necessary forms and explaining the required information I would need  to file my claim.", "rating": 5}, {"title": "Personal contact…", "text": "Speaking personally to an English-speaking representative who was able to answer my questions and facilitate the claim process.", "rating": 5}, {"title": "Compensation for Travel Delay", "text": "I had a good experience with the handling of my claim when travel was delayed for my tour to Italy. The compensation was quick and fair.", "rating": 5}, {"title": "Getting the insurance was easy and…", "text": "Getting the insurance was easy and quick.  I didn’t have to use it thank goodness.", "rating": 5}, {"title": "Excellent coverage, professional service", "text": "We submitted both medical and trip delay claims with Seven Corners while we were traveling abroad. Their agents are professional, informative, and kind. Both claims were fully covered and the process was facilitated with ease. The premium cost is very reasonable for the scope of coverage offered. We felt very secure traveling with Seven Corners' coverage plan, and I would gladly use their services again in the future. I travel often, both with and without additional travel insurance coverage, and after using Seven Corners, I can confidently recommend their services to anyone traveling abroad.", "rating": 5}, {"title": "We purchased the insurance but…", "text": "We purchased the insurance but fortunately did not need to use it", "rating": 5}, {"title": "Nathan Nowacki did a great job", "text": "Nathan Nowacki did a great job walking me through how to submit a claim and answer all my questions.", "rating": 5}, {"title": "Peace of Mind", "text": "I just completed a glorious trip -- riding horses in the Rocky Mountains of Wyoming. While I had no need to file a claim, having this policy gave me peace of mind --especially when someone else on the trip had an accident! Will definitely purchase a policy in the future.", "rating": 5}, {"title": "Fortunately I have never had to use the…", "text": "Fortunately I have never had to use the insurance I have gotten through Seven Corners, but I continue to be impressed with help I get when I call them for I travel insurance and advice.  I was recommended to them several years ago and have recommended SC myself.   It is just so seamless", "rating": 5}, {"title": "Great Customer Experience", "text": "Customer focused - easy to deal with and answered all questions. Sent documentation promptly and followed up as necessary.", "rating": 5}, {"title": "Great customer service and fantastic pricing", "text": "After researching several companies and having used others for past overseas trips, I decided to purchase a \"Cancel for Any Reason\" policy with Seven Corners for my most recent trip to the UK.  They had the most reasonable prices and easy to understand conditions.  I also appreciated how I can purchase an initial smaller amount and then as I continue to pay the final payments on my trip, I was able to increase coverage.  I did that by calling and Seven Corners representative was extremely helpful.  Everything was easy to understand.  I will definitely use them again.", "rating": 5}, {"title": "Needed assistance . Had a question", "text": "Customer Service actually was helpful", "rating": 5}, {"title": "You never expect the unexpected! Thankful for Seven Corners Insurance!", "text": "Unfortunately, sometimes unexpected things come up and you aren't able to go on your trip. In our case, our child was hospitalized right before the departure date and was unable to go on her trip. Fortunately, we were reimbursed, in full, by Seven Corners Insurance. It was very easy to file a claim and I was paid very quickly. I highly recommend this insurance for any trip!", "rating": 5}, {"title": "Explained and sold exactly what we needed…", "text": "Explained the difference between “travel” insurance and medical travel insurance, which is what we wanted and needed to purchase. Staff was great and support and updates and notices were great. Best of all we did not use to the medical evacuation insurance.", "rating": 5}, {"title": "Trip coverage", "text": "Coverage questions answered were very helpful in a call made to the California office .", "rating": 5}, {"title": "Great Service. Simple Process", "text": "It was very easy to compare insurance coverages through Forbes Advisers. Seven Corners process is simple and quick. I also liked the etailed descriptions of the coverage.DeAwna Bailey was very helpful and is very knowledgeable. She responded promptly to my questions.", "rating": 5}, {"title": "Very easy to set up.", "text": "Very easy to contact my sales representative. She is very knowledgeable about the Best insurance selection for my needs. The coverage options were easy to understand and very well priced.", "rating": 5}, {"title": "Will be a repeat customer!", "text": "I had no issues with my trip, however, I was pleased with the interactions that I had with the agent whom I purchased the insurance from. I will definitely utilize Seven Corners for travel in the future. This is my first time using Seven Corners and I have recommended it to other friends.", "rating": 5}, {"title": "First time users of Seven Corners and…", "text": "First time users of Seven Corners and everything went smoothly. The trip was fine, so we didn’t have to file a claim, but we were comforted by the professionalism and clear communication from Seven Corners. Two friends in the insurance business, and one customer of Seven Corners recommended the company, and I believe we made the right choice. I’ll definitely be using them again.", "rating": 5}, {"title": "Violeta was an excellent agent!", "text": "Date of experience: June 22, 2023", "rating": 5}, {"title": "Tristan our agent helped me get…", "text": "Tristan our agent helped me get everything lined out and told me what to expect if we ran into issues on or before our trip. These folks are very helpful and they made sure I knew how to reach them if we had an issue. Great job folks.", "rating": 5}, {"title": "I contacted customer service more than…", "text": "I contacted customer service more than one and each time the person I dealt with was extremely pleasant and was able to answer my thoroughly.I have used another company in the past but will be using Seven Corners in the future.", "rating": 5}, {"title": "Ireland Trip", "text": "Great customer service over the phone!", "rating": 5}, {"title": "Had no issues with trip did not need to…", "text": "Had no issues with trip did not need to use the insurance this time", "rating": 5}, {"title": "Thankfully", "text": "Thankfully, I had no reason to use the insurance, but was so glad I had it.", "rating": 5}, {"title": "Thank you for helping me create a plan…", "text": "Thank you for helping me create a plan for my upcoming trip to Switzerland!", "rating": 5}, {"title": "Didn’t have to use it", "text": "Didn’t have to use it, but was glad I had the back up", "rating": 5}, {"title": "Tiffany Day made my experience…", "text": "Tiffany Day made my experience wonderful. From our first conversation to my numerous follow up questions. I appreciated how quick she was to always respond and the other team members when I needed to add on to my policy. The trip went great!", "rating": 5}, {"title": "This is the third time we have insured…", "text": "This is the third time we have insured our trip through 7 Corners.  Thankfully we have only had to use the insurance once and they did everything that was promised. Their customer service is excellent.", "rating": 5}, {"title": "Heather Kleinschmidt was very…", "text": "Heather Kleinschmidt was very knowledgeable, professional and responsive.  Outstanding expertise and pleasant to deal withYou should look to promote and advance her! She answered all my questions honestly and with an obvious command of your terms and conditions.  She gave us peace of mind as we planned our family vacation to Greece, celebrating our first grandson’s arrival and my and my wife’s retirement", "rating": 5}, {"title": "Great service", "text": "Great service and solved my issue very Quickly", "rating": 5}, {"title": "I'm Impressed", "text": "Thankfully, I did not have to use this insurance.  I was, however, totally impressed with the follow up before I left.  This is the only company that ever did that for me.", "rating": 5}, {"title": "LOVE SEVEN CORNERS!!", "text": "We chose Seven Corners because of their substantial coverage and excellent rates.We felt totally prepared as we boarded the ship knowing that the 6 of us...all over 70...would get the medical attention we may need.", "rating": 5}, {"title": "Easy and efficient", "text": "Date of experience: June 07, 2023", "rating": 5}, {"title": "Easy process to follow", "text": "Easy process to follow.  Claim processing was fast and prompt.  Would highly recommend to anyone who is looking for extra protection.", "rating": 5}, {"title": "The agents are always so nice and…", "text": "The agents are always so nice and helpful. Answered my questions and made everything clear. Easy.", "rating": 5}, {"title": "Was able to speak to someone easily and…", "text": "Was able to speak to someone easily and clearly. Very professional. Changes were made immediately, without issue.", "rating": 5}, {"title": "Nothing to say about Seven Corners", "text": "Nothing to say about Seven Corners. My trip was fine and I did not use the insurance, but it's always better to have one", "rating": 5}, {"title": "Excellent experience", "text": "The friendly agent answered my question. Thank you", "rating": 5}, {"title": "Violetta", "text": "Violetta, is my representative that sold me my previous coverages and she is the he Best.", "rating": 5}, {"title": "Easy to sign up", "text": "Easy to sign up, appreciated knowing a rep name if it turned out I needed to utilize the service.", "rating": 5}, {"title": "True To Their Word", "text": "cert number 2RTB22-AOA-120094Seven Corners was thorough, responsive and we receive our check timely.", "rating": 5}, {"title": "I have bought this insurance for years…", "text": "I have bought this insurance for years now. But i have never had to use it. So thats great in my book.", "rating": 5}, {"title": "Have to give a GREAT review to Seven Corners", "text": "Have to give a GREAT review to Seven Corners. Book a cruise for myself, wife and daughter to Alaska and got a \"Cancel Anytime Insurance\" for a fair price.Unfortunately we did have to cancel, and with proof of payment we received that 75% back direct into our bank account 'without question' or concern. This all transpired in less than a month with absolutely great email communication along the way. I never write reviews but was so pleased with this service and result that I had to post this.", "rating": 5}, {"title": "Have a very wide coverage", "text": "Was a good insurance, for future maybe include in the insurance card what kind of medicine are included, because the times that I used a doctor service all the medicines were buy by me", "rating": 5}, {"title": "Reliable Travel Insurance.", "text": "Fantastic communication, easy application, fast paperwork, great followup before and after trip. Very reliable", "rating": 5}, {"title": "Th person I spoke to was knowledgeable…", "text": "Th person I spoke to was knowledgeable and helpful when choosing options", "rating": 5}, {"title": "Worked with a terrific rep on your side", "text": "I spoke on the phone with Nathan Nowacki.  He was incredibly helpful. The problem had to do with my claim documents, and Nathan walked me through a way to resolve the problem.  He also emailed later to tell me that my file was back in process.  He was patient, informative, and so very helpful.  Great person.  I have a high opinion of Seven Corners because of his actions.", "rating": 5}, {"title": "Thanks for a prompt response.", "text": "Date of experience: May 26, 2023", "rating": 5}, {"title": "Clear, helpful", "text": "Representative understood what I needed and was clear and efficient in processing refund.", "rating": 5}, {"title": "Very helpful service!", "text": "Date of experience: May 27, 2023", "rating": 5}, {"title": "Summary letter of benefits as well as ease in getting a quote and speaking to live agent.", "text": "It was easy to get a quote online and speak to a live agent when I needed to add a country on my recent trip. What I like best is the summary letter of the benefits of my plan. It made it easy when the checkin counter staff asked for my travel insurance. I just presented it instead of going through many pages on my recent trip to Dubai.", "rating": 5}, {"title": "Don’t travel without it!", "text": "While I didn’t have to use it I was confident knowing it was there if I needed it. My son travels extensively and constantly and this s his go-to company.", "rating": 5}, {"title": "Satisfied", "text": "I was satisfied with the affordable cost of the insurance and I liked the reminders of my coverage before I left on my trip.", "rating": 5}, {"title": "I had a great experience with Seven…", "text": "I had a great experience with Seven Corners because of the customer rep that provided my insurance.  He was congenial and helpful and explained everything to me so that I was able to purchase the correct insurance coverage for me.  I didn't need to use the insurance so I can't provide an opinion on the things that really would have mattered had I needed to file a claim.", "rating": 5}, {"title": "A company you can trust!", "text": "We have been insuring our travels with Seven Corners for the past seven years.  Our trips had to be canceled twice- the first time because of the start of COVID and the second time because of my husband's passing.  Each time when I filed a claim, the process was smooth and hassel free.  Any future travels...Seven Corners will always be the company to insure my trip!", "rating": 5}, {"title": "Valuable service provider", "text": "The process is simple, they have excellent customer service. The process to apply and have adequate policy coverage is quick and affordable.", "rating": 5}, {"title": "Great rates", "text": "Great rates, fast service.", "rating": 5}, {"title": "Happy traveler", "text": "Fortunately, we did not have to make a claim.  The initial meeting (by telephone) with Seven Corners was easy and the terms were easy to understand.  The documentation was clearly written so we knew what we were getting.  There was one error on the contract with the departure date but that was corrected without a problem.", "rating": 5}, {"title": "Feedback", "text": "Very professional and friendly.  Keep up the good work.", "rating": 5}, {"title": "My customer service representative", "text": "My customer service representative, Troy Lain, always does a great job explaining the details to me. I’ve used 7 Corners on at least 5 occasions, and never had a claim. I don’t anticipate any claims in the future, but have full faith and confidence in 7 Corners in the event there ever is. Troy Lain has a profound knowledge of the travel insurance business, and is a great asset to 7 Corners. Thanks Troy!", "rating": 5}, {"title": "What one would hope for from travel insurance.", "text": "I'm sure we all hope, buying travel insurance, that we won't need to use it.  But secondarily we hope it'll come through for us if need be.  I had an unexpected urgent need for medical attention while overseas.  Filing for reimbursement of the expenses, once I got back, was time-consuming but worthwhile - Seven Corners reimbursed the entire cost not covered by my normal medical insurance.  Communication regarding my case was prompt, clear, polite and helpful. (Cert # 2RTB22-AOS-112822)", "rating": 5}, {"title": "Helpful", "text": "Good and helpful", "rating": 5}, {"title": "Ease of submitting claims", "text": "The ease of submitting a claim was very reassuring.", "rating": 5}, {"title": "Re- Issuing Travel Ins.", "text": "My Travel Ins. issue was resolved kindly and proficiently", "rating": 5}, {"title": "Had to file a claim from a recent…", "text": "Had to file a claim from a recent cruise when I was quarantined in my cabin for half the trip due to Covid. The claim was managed very professionally, efficiently, and I recvd my check in just a few days after it was approved. Great service!!!", "rating": 5}, {"title": "Excellent Service!", "text": "I read the online comments that it was going to take months to get a refund, but we received our refund in approximately 3 weeks.  I was very happy with all the help we received when we called and how nice the staff was during those calls.", "rating": 5}, {"title": "Communicates well", "text": "Fortunately, we didn't need to use our insurance. But the company communicates well without pressure.", "rating": 5}, {"title": "Friendly helpful assistance", "text": "Friendly helpful assistance, much appreciated", "rating": 5}, {"title": "10 days in dubai", "text": "Quick response", "rating": 5}, {"title": "Professional information from the…", "text": "Professional information from the courteous person.", "rating": 5}, {"title": "Great experience", "text": "Reasonable price, easy process, helpful & knowledgeable staff. Would definitely utilize again.", "rating": 5}, {"title": "Agent who took my call was very helpful…", "text": "Agent who took my call was very helpful and answered my questions.  Very satisfied!", "rating": 5}, {"title": "Very helpful", "text": "Very helpful. Gave great breakdown of coverage", "rating": 5}, {"title": "Confidence", "text": "Thankfully, I didn't need to use my travel insurance - but I was confident that Seven Corners would have been there immediately.I received email communications prior to and after my travel.  Good to know they were there all along.", "rating": 5}, {"title": "Reasonable price", "text": "Reasonable price. the agent was helpful and answered my questions.  Fortunately I didn`t have to use it.", "rating": 5}, {"title": "Best price for a very comprehensive plan", "text": "When choosing an insurance company, Seven Corners provided excellent phone communication and was easy to reach. My questions were thoroughly and promptly answered. They provided the most comprehensive insurance plan for the best price. Fortunately, I did not have to make a claim, so I can provide no information on that aspect of the service.", "rating": 5}, {"title": "I called Seven Corners to credit a…", "text": "I called Seven Corners to credit a previous policy I purchased (for a trip that got cancelled), towards my current trip. They were all extremely polite, friendly and helpful. I was able to credit my trip plus take out new policies for the rest of my family in one smooth phone call that took under 20 minutes. Thank you!", "rating": 5}, {"title": "Reliable and Dependable", "text": "I first used Seven Corners for a trip to Italy in 2020. When my bag was stolen, they reimbursed me no questions asked. I was grateful for their quick response and reimbursement. Since that time, I have used them for every major trip and trust them with my travels!", "rating": 5}, {"title": "Great Customer Service", "text": "My call was answered quickly and the representative answered  all my questions.", "rating": 5}, {"title": "They resolve my problem in a quick…", "text": "They resolve my problem in a quick matter and in a efficient way", "rating": 5}, {"title": "Great customer support", "text": "Date of experience: May 16, 2023", "rating": 5}, {"title": "easy to contact helpful and real person", "text": "Date of experience: May 15, 2023", "rating": 5}, {"title": "Did not have to utilize insurance but piece of I mind was appreciated", "text": "Did not have to utilize insurance but ease of obtaining and reasonable rates for top quality coverage make it be an excellent choice", "rating": 5}, {"title": "The agent was sweet and resepectful", "text": "The agent was sweet and resepectful. I was able to resolve my issue quickly with no issues.", "rating": 5}, {"title": "No problems thus far.", "text": "Date of experience: May 06, 2023", "rating": 5}, {"title": "Excellent customer service and…", "text": "Excellent customer service and reasonable pricing. This is the second time I’ve used Seven Corners and I expect to use them in the future.", "rating": 5}, {"title": "Great customer service!!!", "text": "The service provided by Julie Snyder was awesome. She was very responsive with all my questions, which made me comfortable that should there be any issues, I know it would be taken care of immediately. I will definitely use Seven Corners again for future travel insurance.", "rating": 5}, {"title": "Easy to compare and purchase a policy", "text": "Easy to compare and purchase a policy. I was already familiar with the choices. I did not have a claim, my trip went smoothly.", "rating": 5}, {"title": "Great phone service and claim…", "text": "Great phone service and claim settlement!", "rating": 5}, {"title": "Seven Corners delivered the travel…", "text": "Seven Corners delivered the travel insurance coverage I requested at a fair price and continued communication and follow up regularly right up to our trip and also when we arrived back home. Felt we had a partner walking beside us the entire time!", "rating": 5}, {"title": "At first there was trouble finding the…", "text": "At first there was trouble finding the right policy because I am certain the customer service folks are trying to sell policies with more coverage…so I had to call several times and insist that I only wanted the basic one. After this hurdle it was smooth sailing.", "rating": 5}, {"title": "The staff was very professional during…", "text": "The staff was very professional during both the sales process and claim process. They were helpful in walking me thru claim and reviewing my paperwork prior to submission to claim unit.", "rating": 5}, {"title": "Fast", "text": "Fast, good customer services and accessable.", "rating": 5}, {"title": "Updating my policy was quick and easy…", "text": "Updating my policy was quick and easy with the help of an advisor.", "rating": 5}, {"title": "What I needed in travel insurance", "text": "I knew I needed a cancel for any reason clause for my trip. Seven Corners had a great option for this. I filed my claim once I knew we had to cancel in Feb. The process was easy, the customer service agent walked me through the process.  It did take around 90 days to get the claim processed but they paid no questions asked.", "rating": 5}, {"title": "5 Star excellence", "text": "I gave a 5 star rating because the information I received prior to leaving was clear and concise.  I did not have to use the services but I knew exactly what to do in case the need arose.", "rating": 5}, {"title": "Everything is quick and easy to work…", "text": "Everything is quick and easy to work with your team", "rating": 5}, {"title": "My view", "text": "Very efficient operator who had our renewal information. Price was the kept the same as last year so much appreciated.", "rating": 5}, {"title": "Amazon 2023", "text": "I had no issues at all with your service. Everything went smooth. Thank you.", "rating": 5}, {"title": "Agent was knowledgeable and very…", "text": "Agent was knowledgeable and very curious.", "rating": 5}, {"title": "Fortunately I had no need for using the…", "text": "Fortunately I had no need for using the insurance. I did have a dress that got lost but am not sure if that'd be covered. Will contact my agent to see. The purchase process was seamless and our agent was very helpful.", "rating": 5}, {"title": "I'm a Seven Corners client for life", "text": "I'm a Seven Corners client for life. Why? Because though I didn't encounter any problems while traveling recently, I had peace of mind because on a previous jaunt I got sick and Seven Corners came through for me with flying colors. Support while recuperating overseas, easy accessibility for advice, a kept-every-promise standard while providing reimbursement--this company acted with integrity and compassion. I won't use any other travel insurance provider.", "rating": 5}, {"title": "Trust worthy", "text": "Date of experience: April 30, 2023", "rating": 5}]