[{"title": "Best place for unique items ", "text": "Best place to find unique quality items never had a problem with any of my purchases i highly recommend them ", "rating": 5}, {"title": "Quick and user-friendly website", "text": "Quick and user-friendly website, making purchases a snap!  Good prices to be found, if you look for them.  Frequent Red-Tag sales a bonus!!", "rating": 5}, {"title": "Speedy communication and shipping", "text": "I was impressed with the speed of the response I received, and the same day shipping. Also, the communication was clear.", "rating": 5}, {"title": "Love this item ", "text": "I sent the lady an email to make sure she was ok and not impacted by hurricane and she was not. This is the first time I have ordered from her but the item I ordered from her is a butterfly full of  rhinestones and other stones and it just called to me.", "rating": 5}, {"title": "Fine dealers", "text": "Bought from a fine dealer who shipped the item faster than expected, and this exquisite glass was packed very professionally. Will be returning to Ruby Lane for more gifts for others.", "rating": 5}, {"title": "Easy peasy", "text": "Easy peasy. Smooth operation. First transaction went well, seller responded nicely, purchase arrived safe n sound n beautiful.", "rating": 5}, {"title": "Rubylane.com : # 1 ", "text": "I have used Rubylane.com for years to mainly buy jewelry. It has always been easy to find what I was interested in. Always been courteous and competent people to talk to - and their answers has always been quick in return. The items (which has been many over the years) has been top quality when received. I can only recommend Rubylane.comSincerely Kirsten", "rating": 5}, {"title": "Best online shopping experience!", "text": "I bought a beautiful ring from here and although it was too big for me so I had to return it...it was the best experience I have ever had online shopping.  The seller was extremely nice and understating.  She made the purchase and return so easy.", "rating": 5}, {"title": "Rosalie’s Steiff and more purchase.", "text": "Rosalie’s Steiff and more. Excellent communication and honest representation of products. The steiff fox terrier I purchased was exactly as described. Foxy was promptly shipped and I received tracking number to follow him. He came with a note to let Rosalie know he had arrived safely. I did and he not only arrived safely but he was packed with care to insure he wouldn’t be damaged in transit. Definitely a shop that cares about both its merchandise and their customers.", "rating": 5}, {"title": " Happy Collector", "text": "I have bought a number of dolls from Maria and have been thrilled with all of them. Maria is excellent at getting back to me quickly, she packs dolls well, and is always happy to answer my questions. She is one of my favorite vendors on Ruby Lane. ", "rating": 5}, {"title": "Gumgumfuninthesun, a great seller to deal with!", "text": "Genuine, honest and very helpful. Gave me a good discount on the particular item I was interested in buying, and also put in a lot of effort in trying to get me an affordable shipping price. The parcel, posted from the USA to Australia, arrived in the shortest possible time. Thank you very much for all that you did in making this happen.", "rating": 5}, {"title": "I have visited Ruby Lane to purchase a purse and had a great experience", "text": "I have visited Ruby Lane to purchase a purse and had a great experience. The staff was friendly and helpful, assisting me in finding the perfect purse that matched my style. The store was well-organized, making it easy to browse through their wide selection. I appreciated the quality of the products and found the prices to be reasonable. Overall, I was very satisfied with my purchase and would definitely shop there again.", "rating": 5}, {"title": "Fun and easy way to find unique gifts…", "text": "Fun and easy way to find unique gifts and items ", "rating": 5}, {"title": "purchase from anne olmsted was…", "text": "purchase from anne olmsted was marvelous. easy to do, products arrived quickly and well packed. communication was quick and easy, and the products were in perfect shape, and lovely. i would purchase from anne olmsted without any concern. she is quick, thoughtful, careful, and has wonderful products. thank you so much. 5 star and more!", "rating": 5}, {"title": "Solid all around company", "text": "Relatively easy to search, lots of good vendors, a fantastic variety of products.", "rating": 5}, {"title": "Ruby Lane is a relief from other…", "text": "Ruby Lane is a relief from other websites like Etsy, Chairish, etc. with thousands of offerings. While I shop them often, I love the better curated selections on Ruby Lane.  It's an easier, faster search. ", "rating": 5}, {"title": "Hard-To-Find crystal goblet on Ruby Lane", "text": "So thrilled to see this hard-to-find emerald-green crystal Val St Lambert “Gevaert” goblet on Ruby Lane! Of course it was an immediate purchase as my 1978 wedding collection now misses a few. The seller, Grandview Fine Tableware, was prompt and courteous, and the  goblet is on the way! Martha A. ", "rating": 5}, {"title": "Excellent Support", "text": "I contacted the shop owner about an issue with the shipment paperwork, but they ignored my email. However, when I reached out to Ruby Lane customer support, they responded sincerely and addressed the problem. While I’m disappointed with the shop's response, Ruby Lane’s handling of the situation was excellent and ultimately led to a safe shopping experience.", "rating": 5}, {"title": "Quick, positive response from seller", "text": "We found an item where the seller did not ship to Canada.  A quick email to the seller in the evening, and a response the following morning letting me know she had changed the ad to allow international shipping, and the piece is on its way!Ruby Lane has been a go-to for us for a number of years, and we always have good experiences.", "rating": 5}, {"title": "Belleek purchase", "text": "Zudea Z answered all my questions and simplified the ordering process by explaining how to order online. My item was delivered pretty quickly and packaged very good resulting in no damages. Thank you!", "rating": 5}, {"title": "Very easy, transparent, and quick shopping experience", "text": "I was looking for an out-of-production David Yurman ring, and Ruby Lane happened to have one in just my size. The ordering process was smooth and easy, and I got both a confirmation, a personal note, as well as shipping confirmation within a day of ordering, showing me exactly when my piece would arrive. The description was clear and accurate as well, and the piece I received was 100% as it looked in the photo and what I expected. I spent so little time looking for a hard-to-find item thanks to my experience with Ruby Lane. ", "rating": 5}, {"title": "The place for VCJ!", "text": "Always,if possible, I prefer to buy my vintage costume jewelry on this site.  Ruby Lane has such knowledgeable sellers and so many of them have been willing to work with me to make more expensive transactions become reality.  I’ve made many friends through my purchases here.  The vintage costume jewelry community are fabulous people with a gigantic love for bling!  This is the place, for sure!", "rating": 5}, {"title": "Seemless Buying", "text": "Ruby Lane sends me notification of an item I put on my wish list each time it comes up - I buy it with no hassle from helpful sellers and the items - usually from USA - arrive in UK in good condition with the sellers helpfully sourcing lowest postal rates/ methods. And Ruby lane does not clog up my inbox with notifications otherwise. Excellent", "rating": 5}, {"title": "It's all good!", "text": "I have not purchased that much, but each experience is good. I really enjoy the \"wish list\" options and variety of items available.", "rating": 5}, {"title": "The owner was very helpful", "text": "The owner was very helpful, she answered me promptly and was very professional.  I have not received my product yet, but I am sure it will be just as advertised.", "rating": 5}, {"title": "The transaction was handled smoothly", "text": "The transaction was handled smoothly. Interaction with dealer was pleasant and helpful to me as a first time buyer.", "rating": 5}, {"title": "Your Own Personal Antique Shops", "text": "I really enjoy the fact that I can communicate with the Sellers.  So far, every purchase I have made has gone through without a hitch.  And I have been pleasantly surprised to discover items on RubyLane that I can not find other places.  Each shop is like your own personal Antique shop where you can speak directly with the owner and work out a price that is acceptable to each of you. I will keep coming back.", "rating": 5}, {"title": "It is a pleasure searching through the…", "text": "It is a pleasure searching through the database.  In particular, I appreciate the ability to search in a variety of ways - vendor, price, item category, etc.  As well, thank you for allowing the use of PayPal.  I found Ruby Lane two years ago, and have ordered everything from earrings to a magazine rack.", "rating": 5}, {"title": "Thank you Richard Saxman Antiques!", "text": "From start to finish my transaction with Richard Saxman has been very smooth. Communication was prompt, clear and considerate. The doll arrived in good time, was safely packed and exactly as described. I would be more than happy to purchase from this seller again. Liz Stanbrough Australia.", "rating": 5}, {"title": "Great find!! Amazing seller!!", "text": "I had been looking for a particular crystal decanter as an engagement gift for one of my twin daughters for over a year. Ruby Lane had the exact one and it was in perfect condition. I emailed Ruby Lane on Super Bowl Sunday, purchased it first thing Monday morning and it arrived in less than a week! I was over the moon thrilled with the entire process! Ruby Lane couldn't have been accommodating!! Great company to work with!!", "rating": 5}, {"title": "Filters are Great!", "text": "I really like the filters, it helps reduce my search time. (My only suggested improvement would be to list what an item sold for, that would help educate buyers who want to learn more about the value of vintage pieces.) ", "rating": 5}, {"title": "Perfect in every way", "text": "Excellent description about the clock we bought. Easy to purchase through PayPal. Amazing instructions on unpacking the clock and its setup.We were told signature would be required, but the box was just delivered and set on the front porch. It is a lovely antique clock and working perfectly!", "rating": 5}, {"title": "Shopping on Rubylane is easy and fun", "text": "Shopping on Rubylane is easy and fun.  I've been buying things from vendors here for over 20  years and I've told a lot of people about the site.  I don't believe there is another place like Rubylane online, with so many different shops and vendors, all with interesting and/or beautiful things.  I've rarely been disappointed with something I've bought on the site, and never with anything I've bought from Arnold Jewelers, from whom I have bought things before this.  It's a great shop with wonderful things and good prices and great customer service.In general, completing a transaction is also easy - this one was.", "rating": 5}, {"title": "Dealing with this seller highly recommended.", "text": "Excellent dealings. Items shipped promptly; as described. Recommend dealing with. I used layaway so that I could purchase 3 items from the dealer. This is very helpful to allow budgeting for sometimes more pricey choices. The dealer was very good in managing this transaction. Sad that eBay and ETSY have removed that option from their sites. Kudos to Ruby Lane !  ", "rating": 5}, {"title": "Carnelian ring", "text": "Helpful seller, my item was beautifully packaged and safely packaged for shipment.  Receipt of my item was timely.I do have to stress how beautifully my ring was wrapped.  The seller took time and care to create the best impression.  As someone who appreciates the aesthetics of the world around us - this meant a lot to me and was much appreciated.The ring is beautiful, the stone is perfect.  I know it will be a favorite.", "rating": 5}, {"title": "Unique and Special Things Here", "text": "I always find the most unique and special things in the Ruby Lane shops and the shop owners are a pleasure to work with. Shipping is fast, even from the overseas shops, and usually the items are even lovelier in person when they arrive. ", "rating": 5}, {"title": "The fact that i have replaced artwork…", "text": "The fact that i have replaced artwork stolen from me by an Ex boyfriend has made me so happy today. Now all I have to replace is Interlocking and Barcelona Suite and an inner peace will have been restored. Thank You so very much for carrying Bruce Weinberg's art pieces", "rating": 5}, {"title": "Such a wonderful first (not last)…", "text": "Such a wonderful first (not last) experience. I was a bit concerned about breakage via shipping, but was assured my beautiful vase would be packed with care. Quick delivery, too. Thanks, Ruby Lane.", "rating": 5}, {"title": "Beautiful opal ring. . . . .", "text": "I received my beautiful opal ring today and am so pleased. The description and pictures offered in the sales listing of the ring were very accurate and depicted the color of the stone perfectly. Updates on shipping and tracking were helpful and the ring arrived quickly. I will have to have the ring sized up a little before I can wear it comfortably but that isn't a problem. Thank you so much!", "rating": 5}, {"title": "Joseph of Hollywood ", "text": "Hi, contacted from Scotland to ask if delivery possible,no problem . Good communication great service ,and wonderful items, will definitely be back for more, purchased item just as displayed on site . Very happyJohnathan Roberts ", "rating": 5}, {"title": "I purchased a beautiful charm bracelet…", "text": "I purchased a beautiful charm bracelet from Circa Vintage Jewelry on Ruby Lane. Barbara from Circa Vintage was responsive to my questions and organised international shipping. The bracelet arrived securely and in the same condition as described. I couldn't be happier with my bracelet and with the service provided by Barbara. 5 star experience - a highly recommended business. Would gladly purchase from Circa Vintage Jewelery again and the Ruby Lane platform was easy to use too. Thank you both!", "rating": 5}, {"title": "Ruby Lane got back with me IMMEDIATELY…", "text": "Ruby Lane got back with me IMMEDIATELY to make the \"payment\" step very simple. Placed my order on tuesday with the regular shipping and received my order on friday...couldn't be any faster! At first I thought the shipping fee was a little high but it arrived so quickly and was packed the way I would have packed it myself I was extremely happy. Thank you, Ruby Lane!", "rating": 5}, {"title": "Another really unique vintage buy!", "text": "Found another really unique vintage purchase on Ruby Lane. It’s an overseas buy and I expect it will arrive quickly and in good condition given the good experiences I’ve had with these with Ruby Lane in the past.", "rating": 5}, {"title": "Great Service and Great Shops", "text": "I always get what I order and I am always happy with what I purchase!! Pkgs arrive quickly and shipping is not outrageous!! Shop owners are very nice and helpful!! Ruby Lane is my favorite place to shop!!", "rating": 5}, {"title": "First time shopper", "text": "The web site is easy to browse. The details are available for the product so that I know exactly what I am getting. I was surprised at check out that each dealer has a bill instead of one big bill.  That actually helps sort items out for me.  There is a huge selection. I didn't get to it all.  I will definitely be returning to continue shopping.", "rating": 5}, {"title": "I know I can trust sellers on Ruby…", "text": "I know I can trust sellers on Ruby Lane.  Each seller I have dealt with has demonstrated integrity and honesty.  The pictures and descriptions are always spot on!", "rating": 5}, {"title": "Honest Sellers ", "text": "I ordered the Rainbow Tye Dyed Beanie Baby Bear. It was in Perfect Condition, the seller packaged it very nicely so it wouldn’t get damaged and it came promptly. Very Pleased with My Purchase 🥰", "rating": 5}, {"title": " I highly recommend this seller.", "text": "I'm very happy with my interaction with the seller.  She responded very quickly to my message regarding a \"pending\" sell.  I'm very happy with my purchase and would definitely buy things from her in the future.  I highly recommend this seller.", "rating": 5}, {"title": "I found just what I wanted on Ruby…", "text": "I found just what I wanted on Ruby Lane, and their vendor, Gumgumfuninthesun, was wonderful to work with.  The items shipped promptly, were exactly as described, and arrived in perfect condition.  I would definitely order from Ruby Lane and Gumgumfuninthesun again.", "rating": 5}, {"title": "Unique Jewelry Lady", "text": "I received my BEAUTIFUL lions head pin and diamond band quickly. It is more BEAUTIFUL in person. EXCELLENT EXCELLENT customer service. The owner and the staff are wonderful. This business have unique and BEAUTIFUL estate jewelry. Will always support them. Please bring more jewelry.", "rating": 5}, {"title": "My favorite website ", "text": "This “online vintage/antique mall” is my go-to for unique vintage items. I’ve made multiple purchases and every transaction has been easy and satisfactory. I recommend this site often. ", "rating": 5}, {"title": "The seller was responsive to my email…", "text": "The seller was responsive to my email about the invoice total not appearing. He was apologetic and prompt about fixing the stall. He was willing to ship my purchase while he was traveling. ", "rating": 5}, {"title": "Ruby Lane Is the Best Place for Antique Jewelry", "text": "Ruby Lane's sellers have the best selection of vintage and antique jewelry hands down.  I have purchased numerous items from different sellers and have always been pleased.  I will continue to shop with them.", "rating": 5}, {"title": "I made an offer for an item", "text": "I made an offer for an item. Seller quickly responded and made a counteroffer, which I was happy with. I also loved that the seller has shipping included. Very nice experience and hoping when my Santa’s arrive they are as nice as they look. ", "rating": 5}, {"title": "It was a very easy transaction", "text": "It was a very easy transaction.  I made an offer and evidently the seller had it set up so that depending on the amount of the offer, she would automatically accept certain offers, based on the amount.  I was pleasantly surprised that she accepted my offer!", "rating": 5}, {"title": "Rubylane is an amazing place to sell…", "text": "Rubylane is an amazing place to sell your art & vintage collectables. I have been selling on Rubylane for 9 years and am super pleased with this professional company. Gumgumfuninthesun", "rating": 5}, {"title": "I have always been able to purchase…", "text": "I have always been able to purchase excellent items on Ruby Lane with beautiful packing.  Really good experiences so far with sellers.  I so very much appreciate your beautiful site!  ", "rating": 5}, {"title": "Love My Purchases", "text": "So far every purchase from each vendor I have purchased from, has been awesome. They email me to keep me posted of my items, as they are shipped. I appreciate their considerations and communication as well as customer service.", "rating": 5}, {"title": "All Around Great Experience With Ruby Lane", "text": "I was thrilled to find the item that Ruby Lane sold me and it came to me very quickly and was in excellent condition and was packed very well to protect the breakable item that I purchased.  I am very pleased with my experience buying from Ruby Lane.", "rating": 5}, {"title": "Super classy!Every store in the group that o have…", "text": "Every store in the group that o have worked with has been timely , helpful when needed and very professional! They take great efforts to ship well and pay attention to email inquiries!", "rating": 5}, {"title": "Long Time Ruby Lane Customer ", "text": "I have always trusted shopping on Ruby Lane and have purchased many items over the years. Their sales are really good and I couldn’t pass this beautiful ring up.", "rating": 5}, {"title": "Easy and enjoyable", "text": "I have always had an easy and good experience using Ruby Lane.  Sellers are prompt to respond and trustworthy.  I love the selection of items and can navigate smoothly.  Thanks for the opportunity.", "rating": 5}, {"title": "Positive experience here ", "text": "Ruby Lane is like an online flea market with lots of different sellers. I had a great experience with Classic Fab Finds and I'd use Ruby Lane again.", "rating": 5}, {"title": "First purchase using Ruby Lane so far…", "text": "First purchase using Ruby Lane so far so good. I need to receive my purchase to finalize my transaction so I'm not going to comment further until then.", "rating": 5}, {"title": "Ruby Lane’s amazing selections …", "text": "Ruby Lane has everything you can imagine in jewelry and beyond. Beautiful items at excellent prices. Before you go out there and drive around looking, check Ruby Lane. I bet they have it at lower prices!! 💍", "rating": 5}, {"title": "The only thing I don't like about Ruby…", "text": "The only thing I don't like about Ruby Lane is the new format for sellers to present their items, the previous and long standing format was much convenient and easier. Everything else is perfect. ", "rating": 5}, {"title": "All the dealers I have dealt with have…", "text": "All the dealers I have dealt with have been quick to  send my orders...well packed for safe shipping. All did their best to regulate shipping costs if I thought those listed were too high. Fast to give me a refund if the shipping turned out lower then I agreed to. I love Ruby Lane and will continue to shop here!", "rating": 5}, {"title": "The seller was extremely responsive", "text": "The seller was extremely responsive, also I’ve never had a bad experience on rubylane yet either.  I feel like the sellers are responsible and it’s safe to shop here.", "rating": 5}, {"title": "I recommend this shop", "text": "I recommend this shop, to Anyone, and Everyone! TY!", "rating": 5}, {"title": "Happy With My Ring!", "text": "My beautiful vintage ring arrived on March 23, two days before I expected it, following a cross-country journey. It is even prettier than the Ruby Lane photos showed, and I am delighted to have it. The price was very reasonable, especially in comparison with similar rings. ", "rating": 5}, {"title": "Ruby Lane offers quality vendors and…", "text": "Ruby Lane offers quality vendors and has a user-friendly site.  I purchased from ReUnions.  The dealer does an exceptional job of describing items and providing quality photographs.  ", "rating": 5}, {"title": "A superior shopping experience!", "text": "The customer service from The Many Faces of Japan has been consistently excellent. Their research and knowledge of the ceramics offered for purchase is a welcome \"extra\" in every instance. This is a first-class dealer in all phases of a transaction and I truly appreciate the attention to details!", "rating": 5}, {"title": "Ruby Lane is wonderful", "text": "Ruby Lane is wonderful! The dealers I have met are gracious and helpful. Items are mailed right away and are as pictured and described. Just great!!", "rating": 5}, {"title": "Great Expectations Ruby Lane", "text": "Ruby Lane, very trusted. Each merchant has high standards of customer service, if there is an issue the dealer resolves it.", "rating": 5}, {"title": "First experience", "text": "First experience : big success !Very easy to purchase a rare item at a bargain price...Will definitely use this website in the future", "rating": 5}, {"title": "Well designed website", "text": "The website design makes it easy to find the items I’m specifically shopping for.  The Rubylane rating system allows me to shop with confidence.", "rating": 5}, {"title": "Rubylane - what's not to like?!", "text": "Rubylane offers good quality pieces from venders, who are prompt, helpful, and good to deal with, and I enjoy browsing and shopping here.  What's not to like?!", "rating": 5}, {"title": "Purchase Order system is improved", "text": "The purchase order process apparently has been changed/improved.  I had no idea that if I chose PayPal/Credit card I would not be billed immediately for a purchase (my previous experience); the system is now letting me place an order but wait for payment until the shop owner has adjusted the shipping charges. ", "rating": 5}, {"title": "Highly recommended!", "text": "Answers quickly, great items, good price, very happy to have found this! Highly recommended!", "rating": 5}, {"title": "Easy Transaction", "text": "Was great to find rare porcelain dolls that I have been having my eye on for a long time. Was able to purchase easily and many payment options available.", "rating": 5}, {"title": "One of the things that makes Ruby Lane fabulous", "text": "This was one of the fastest, easiest transactions I have ever experienced. The seller has great merchandise, and a great, competitive price. We'll do business again!", "rating": 5}, {"title": "Everything was easy to order and I…", "text": "Everything was easy to order and I enjoy the emails announcing the added items at my favorite stores.", "rating": 5}, {"title": "Tailored emails", "text": "I love how the emails are tailored for me, and the item I just purchased will go into my favorite collection", "rating": 5}, {"title": "My item was on sale!", "text": "My item was on sale! The seller had good pictures, so I could read the hallmarks on the piece of silver I was interested in. Am pretty sure the item is older than described, which is more appealing to me.", "rating": 5}, {"title": "Everything was great from ordering to…", "text": "Everything was great from ordering to receiving  l could not ask for more ", "rating": 5}, {"title": "Lovely website", "text": "Lovely website, particularly if you are an antique doll collector. Easy to use and shop from. Highly recommend. ", "rating": 5}, {"title": "I am delighted to be a Seller on…", "text": "I am delighted to be a Seller on Rubylane. I love them. They are so Wonderful & Trustworthy. I highly recommend this marketplace. 5 Stars all the way. ", "rating": 5}, {"title": "Smooth process", "text": "Smooth process.  Fast shipping and item was exactly as described. I would use again and appreciate the service.", "rating": 5}, {"title": "I had a question about an item that I…", "text": "I had a question about an item that I wanted to purchase for my wife for Valentine's Day and I received a response in a timely manner. Quick and easy transaction 😁", "rating": 5}, {"title": "I am really excited to use the buttons…", "text": "I am really excited to use the buttons on the sweater that I am knitting. They arrived promptly, well packaged and true to description. Thank you so much!", "rating": 5}, {"title": "Building a quality and trusting experience", "text": "The company constantly reviews the dealers and their items to make sure they are authentic and are not misrepresenting their merchandise in any way.  They make sure to give their buyers a quality and trusting experience with their sellers and therefore buy with confidence!", "rating": 5}, {"title": "Receipt of this book was delightful…", "text": "Receipt of this book was delightful visit with the past. My parents gave me this book when I was 6 years old.", "rating": 5}, {"title": "Positive Shopping Experience", "text": "The antique print was a quality item.  Dealer was very prompt and helpful in responding to questions.  ", "rating": 5}, {"title": "Fast Service", "text": "My very first order went accordingly as promised.The seller was om yo of my order quickly and I received it in 2:working days. ", "rating": 5}, {"title": "Loving Ruby Lane", "text": "Loving Ruby Lane. I have checked them out a lot over the years and recently found some gorgeous vintage earrings I could not live without. ", "rating": 5}, {"title": "I’m excited to receive it. ", "text": "Just what I was looking for! There were great pictures of the ring on the website which helped me to make my decision. I really need the ring to arrive by Wednesday! I can’t wait to see it in person and wear i! ", "rating": 5}, {"title": "Offer process", "text": "Ruby Lane made the \"offer\" process simple and straight-forward.  Plus, the seller accepted my offer, so yippy!", "rating": 5}, {"title": "Great purchase experience, lovely item. ", "text": "The pitcher arrived securely packaged. No mailing incidents. It is better than the picture shows, I love it. ", "rating": 5}, {"title": "Great Purchase", "text": "Fast shipping and so carefully packed.  The postcard was even better than I hoped!  ", "rating": 5}, {"title": "You will definitely find something fabulous on this website!", "text": "I recently came across the Ruby Lane website and I love it.  There is such a vast variety of items for sale.  It is so much fun to go through the entire website and see what is available.  It is very enjoyable!  The prices are great and there are so many items that I remember from when I was younger.  I love it.Thank you", "rating": 5}, {"title": "Highly recommend", "text": "I have gotten some wonderful things from multiple sellers on Ruby Lane.  I trust this site a lot more than the others.  It seems they really vet their sellers.", "rating": 5}, {"title": "I have been buying from Doug since he…", "text": "I have been buying from Doug since he started selling on eBay, and his items have always been of the highest quality!", "rating": 5}, {"title": "Love the website", "text": "Love the website - vintage items huge and varied inventory with reasonable prices from most sellers. Easy transactions, trustworthy website.", "rating": 5}, {"title": "I really like the site", "text": "I really like the site. My previous experiences have been positive. My chosen trader is fabulous - ", "rating": 5}, {"title": "Easy purchase app", "text": "Easy purchase app. Great display photos. Nice selection of items by various sellers to purchase.", "rating": 5}, {"title": "I am just thrilled with my purchase", "text": "I am just thrilled with my purchase. Lovely and high quality. Seller was very responsive and went above and beyond with packaging and shipping.", "rating": 5}, {"title": "The ease with which the purchase and…", "text": "The ease with which the purchase and payment were made.", "rating": 5}, {"title": "I am a very satisfied repeat buyer from…", "text": "I am a very satisfied repeat buyer from this seller. Always  quality items for sale. Great prices also.", "rating": 5}, {"title": "Responses were immediate and helpful.", "text": "I saw an item I wanted, submitted request and everyone was extremely helpful. I wad given information on my requested purchase.", "rating": 5}, {"title": "Great Experience", "text": "I was able to find some items that I wanted and Ruby Lane made it easy to order the items.  I had a great experience with the vendors, as well.  ", "rating": 5}, {"title": "So helpful and patient in", "text": "So helpful and patient in our transaction. I really appreciate getting a wonderful memory from my childhood!", "rating": 5}, {"title": "Always A Great Buying Experience", "text": "I have bought dolls from this wonderful venue for 20 years. Always a perfect pleasant experience! ", "rating": 5}, {"title": "Great Experience!", "text": "Anne was very kind and I love my purchase!  This is my second from Rubylane, and I’m very pleased with my experiences there!  I will keep searching for things I love to collect!  *****", "rating": 5}, {"title": "Great Shopping Experience", "text": "Fast shipping, great price for the item, book was in great condition and just as advertised. ", "rating": 5}, {"title": "This was my first purchase on Ruby lane…", "text": "This was my first purchase on Ruby lane and it was easy. The seller was great, the item excellent. The service excellent. Will definately buy more from there.", "rating": 5}, {"title": "Wonderful selection of items", "text": "The Ruby Lane site is easy to use, has informative items pages, wonderful selection of items.", "rating": 5}, {"title": "This vendor offers wonderful delights.", "text": "This vendor offers the sort of collectibles I adore.  She is very polite and helpful.", "rating": 5}, {"title": "Bird on a Wire is great", "text": "Evelyn from Bird on a Wire is great to work with.  Very reasonable and I have complete confidence in her and what she is selling.", "rating": 5}, {"title": "Great product!", "text": "Great product!Smooth transaction!👍", "rating": 5}, {"title": "Prompt reply to my questions", "text": "Prompt reply to my questions, and shipping after purchase.  Item was exactly as described.", "rating": 5}, {"title": "The seller was so quick to answer my…", "text": "The seller was so quick to answer my questions. The item is even more beautiful than in the pictures!! Would 💯 by again from the place!!", "rating": 5}, {"title": "I love my Dog painting", "text": "I love my painting, and the extra little GOODIE that was enclosed with it. Such super finds on Ruby Lane!", "rating": 5}, {"title": "Every item I purchase from Ruby Lane is…", "text": "Every item I purchase from Ruby Lane is as described and in pristine condition.", "rating": 5}, {"title": "Fine website full of collectables ", "text": "Fine website full of collectables . Honest and caring  vendors who ship quickly .", "rating": 5}, {"title": "Perfect experience", "text": "The site is seamless and checkout was super simple. I have a feeling I'll be shopping on this site for quite a while lol.", "rating": 5}, {"title": "The German grammar book I purchased…", "text": "The German grammar book I purchased will help me with genealogy", "rating": 5}, {"title": "Oodles of great finds", "text": "Easy to shop and pay.  So many beautiful curated items to review.  Trustworthy sellers.", "rating": 5}, {"title": "Great service", "text": "Quick response to question.  I placed the order and it was shipped immediately.  Great customer service and great selection of merchandise.", "rating": 5}, {"title": "Excellent transaction", "text": "Excellent transaction, item as described, well packed, fast shipping, prompt and nice email, VERY HIGHLY RECOMMENDED!", "rating": 5}, {"title": "I love Ruby lane because they have wonderful antiques", "text": "I love Ruby lane, I have found wonderful antique dollhouse furniture, and jewelry!!!!", "rating": 5}, {"title": "Positive feedback", "text": "I found the transaction to be easy to follow and the seller responded promptly.", "rating": 5}, {"title": "I am new to Ruby Lane", "text": "I am new to Ruby Lane. I haven't made a purchase only left an offer. I am waiting for a response. This seems to be a very good and fun way to search for what you like and seems safe also.", "rating": 5}, {"title": "Immediate communication.", "text": "Immediate communication.Very easy to deal with", "rating": 5}, {"title": "Seller Did a Good Job", "text": "Seller answered question promptly; packaging was very good.  ", "rating": 5}, {"title": "I always love to buy from this dealer…", "text": "I always love to buy from this dealer as her items are authentic and unusual.", "rating": 5}, {"title": "Great vintage earrings", "text": "Great vintage earrings at a great price.   Also fast shipping  appreciated.", "rating": 5}, {"title": "Friendly", "text": "Friendly, responsive shop owner.  Purchase was a very good 'deal' too!", "rating": 5}, {"title": "I can find collectible items and easily…", "text": "I can find collectible items and easily purchase through Rubylane.", "rating": 5}, {"title": "Perfect ", "text": "Found exactly what I've been looking for and the transition went smoothly.", "rating": 5}, {"title": "Ruby lane has a vast collection of…", "text": "Ruby lane has a vast collection of excellent quality jewelry which I collect.", "rating": 5}, {"title": "I contacted the seller and they…", "text": "I contacted the seller and they responded right away and worked with me.", "rating": 5}, {"title": "Ruby Lane is a reliable source to find…dolls, and doll house accessories.", "text": "Ruby Lane is a reliable source to find beautiful and surprising things.", "rating": 5}, {"title": "Very professional shop", "text": "Very professional shop, EM-JEY Jewelry by Mike Boitier", "rating": 5}, {"title": "I’m happy with the purchase and the…", "text": "I’m happy with the purchase and the great communication. Valued seller!", "rating": 5}, {"title": "Fast shipping and some are negotiable.", "text": "Fast shipping and some are negotiable.So far I have found great deals", "rating": 5}, {"title": "Easy to use Program", "text": "Easy to use program, easy to find what I'm looking for, and easy to place an order. Thanks, Ruby Lane", "rating": 5}, {"title": "It was a fun way to shop", "text": "It was a fun way to shop. I found an item and had some questions. I emailed my questions to the vendor and received a quick and helpful reply.", "rating": 5}, {"title": "Ruby Lane always has a wide selection…", "text": "Ruby Lane always has a wide selection of items", "rating": 5}, {"title": "Great selection of items and sellers", "text": "Great selection of items and sellers. Easy to navigate and use.", "rating": 5}, {"title": "I have had this set for over 30+ yrs", "text": "I have had this set for over 30+ yrs. It was a present from my grandmother, it's like having her still with me! Thank you.", "rating": 5}, {"title": "Will be a repeat customer", "text": "Ruby Lane site was easy to use. Found exactly what I wanted at a good price. seller shipped the following day. What more could you ask for?", "rating": 5}, {"title": "It was quick", "text": "It was quick. I will be buying from Ruby Lane as I have in the past.", "rating": 5}, {"title": "It was easy to speak with the vendor", "text": "It was easy to speak with the vendor. I received exactly what I ordered and in good condition", "rating": 5}, {"title": "Excellent dealings", "text": "Excellent dealings. Item shipped promptly; as described. Recommend dealing with.", "rating": 5}, {"title": "Great shopping experience", "text": "Great shopping experience. Fast shipping and safe packaging. Condition as described. Highly recommend. ", "rating": 5}, {"title": "I appreciate rubylane and paypal…", "text": "I appreciate rubylane and paypal payment .Dealers are always nice and efficient .", "rating": 5}, {"title": "Extremely happy with my purchase", "text": "My purchase arrived quickly and safely !  Great job packaging!", "rating": 5}, {"title": "Treasure Found !", "text": "A treasure found !An easy transaction from start to finish. Excellent communication, a great seller in Carolinas Vintage Collectables", "rating": 5}, {"title": "Very nice product", "text": "Very nice product.  Easy communication with shop owner.  Fast delivery", "rating": 5}, {"title": "Always a great place to shop!", "text": "Found something great again on Ruby Lane!! ", "rating": 5}, {"title": "Great Experience", "text": "A Really Cool Art Pottery Vase With Lightning-Fast Shipping & Professional Packaging", "rating": 5}, {"title": "The ease of making my purchase and…", "text": "The ease of making my purchase and communication with the seller.", "rating": 5}, {"title": "So easy to navigate", "text": "So easy to navigate. Wonderful selection of items, with superb descriptions and sellers of integrity.", "rating": 5}, {"title": "great product", "text": "great product, fast deliver", "rating": 5}, {"title": "Beautiful doll bonnet", "text": "Beautiful doll bonnet, super seller, very happy", "rating": 5}, {"title": "I love the products", "text": "I love the products.  I get an email every day and I enjoy just looking.  The checkout is easy.", "rating": 5}, {"title": "Laureate Antiquestransaction was straightforward and…", "text": "The transaction was straightforward and uncomplicated.The dealer (Laureate Antiques) is excellent.", "rating": 5}, {"title": "Ruby Lane has some great items and I…", "text": "Ruby Lane has some great items and I have bought from them before.  Great service ! ", "rating": 5}, {"title": "Friendly", "text": "Friendly, helpful and trustworthy seller.", "rating": 5}, {"title": "Antique dealers are very co-operative…", "text": "Antique dealers are very co-operative and have lots of interesting treasurers.", "rating": 5}, {"title": "It is just any easy site to use", "text": "It is just any easy site to use.  Very customer friendly!", "rating": 5}, {"title": "Reasonable price", "text": "Reasonable price. Quick ordering. Nice photos and great description!", "rating": 5}, {"title": "Ruby Lane is always perfection.", "text": "Ruby Lane is always perfection.", "rating": 5}, {"title": "Wonderful packaging and unique product.", "text": "Date of experience: January 14, 2024", "rating": 5}, {"title": "Excellent choices", "text": "Excellent choices. Trusted vendors. Interested in accurate descriptions of goods.", "rating": 5}, {"title": "Easy navigation of the site!", "text": "Date of experience: April 26, 2024", "rating": 5}, {"title": "The dealer was great", "text": "The dealer was great. Honest & great product/ prices.", "rating": 5}, {"title": "Unique shop with unusual items", "text": "Unique shop with unusual items. Attentive owner. A pleasant shopping experience. ", "rating": 5}, {"title": "Easy to shop", "text": "Easy to shop. Found exactly what I was looking for.", "rating": 5}, {"title": "RUBYLANE IS A GREAT SHOPPING EXPERIENCE…", "text": "RUBYLANE IS A GREAT SHOPPING EXPERIENCE ...", "rating": 5}, {"title": "The immediate reply to my inquiry", "text": "Date of experience: April 28, 2024", "rating": 5}, {"title": "I love the diversity of items for sale", "text": "I love the diversity of items for sale.  Keep up the good work.", "rating": 5}, {"title": "Like your website and hard to find…", "text": "Like your website and hard to find products!!", "rating": 5}, {"title": "Amazing dragon!", "text": "Great item, it was on sale, so a great deal! Prompt shipping.", "rating": 5}, {"title": "Very simple and quick way to register.", "text": "Date of experience: June 28, 2024", "rating": 5}, {"title": "Ease of purchase", "text": "Ease of purchase ", "rating": 5}, {"title": "Quick and Easy!", "text": "It was easy to purchase the items.", "rating": 5}, {"title": "Fair prices", "text": "Fair prices, accurate descriptions, quick service, quality jewelry.", "rating": 5}, {"title": "I love Ruby Lane!", "text": "I love Ruby Lane, everything about the site!", "rating": 5}, {"title": "Quick order processing", "text": "Quick order processing ", "rating": 5}, {"title": "Fast and easy", "text": "Fast and easy. Keeping it simple is the best way", "rating": 5}, {"title": "Web page is easy to use", "text": "Web page is easy to use, nice items for sale", "rating": 5}, {"title": "Great items for purchase", "text": "Date of experience: February 14, 2024", "rating": 5}, {"title": "Shopped", "text": "Shopped, liked the prices and products, ordered.  Nice folks.", "rating": 5}, {"title": "Great Shopping!", "text": "Easy to navigate website.", "rating": 5}, {"title": "You had what I wanted and I got it", "text": "Date of experience: February 09, 2024", "rating": 5}, {"title": "Lovely item and quickly sent", "text": "Lovely item and quickly sent.  Thank you!", "rating": 5}, {"title": "Great stuff", "text": "Great stuff! Easy to buy. ", "rating": 5}, {"title": "Easy to complete transaction", "text": "Easy to do--", "rating": 5}, {"title": "Prompt delivery", "text": "Prompt delivery ", "rating": 5}, {"title": "Antique Glass purchase", "text": "My experience buying antique glass from Maggie Belle's Memories Vintage Sales was amazing! She was very responsive to questions and shipped my order quickly and with the utmost care. I was seriously blown away by the  amount of effort that was put into packaging to ensure that nothing broke in transit. 10/10!", "rating": 5}, {"title": "Great shop I love this place!", "text": "Date of experience: January 21, 2024", "rating": 5}, {"title": "Everything you need to know about what…", "text": "Everything you need to know about what you are purchasing is explained by the dealer. The pictures of the doll were excellent to help me decide to make the purchase.", "rating": 5}, {"title": "Easy purchase experience!", "text": "Easy purchase experience!Nice items!", "rating": 5}, {"title": "The website was very easy to navigate", "text": "The website was very easy to navigate. The information provided was helpful in making decisions on what I might want to purchase. Would recommend them.", "rating": 5}, {"title": "Love RubyLane", "text": "Love the many selections on RubyLane. Forget Me Not Antiques is a wonderful shop! Great seller communication! Quick service!", "rating": 5}, {"title": "Positive experience.", "text": "Great communication.  Item was packaged very well.  Good value for the price.", "rating": 5}, {"title": "Very good communication with Laura from…", "text": "Very good communication with Laura from The Steiff Room.Previous excellent service from Laura, very helpful and quick postage", "rating": 5}, {"title": "good inventory of many items", "text": "Ruby Lane was the only site that offered something I was looking for.Transaction from outside USA went smoothly.", "rating": 5}, {"title": "Check out was simple", "text": "Check out was simple.  Good photos of items.", "rating": 5}, {"title": "Smooth transaction", "text": "Date of experience: January 14, 2024", "rating": 5}, {"title": "fast response", "text": "fast response, ease of ordering, lots of photos", "rating": 5}, {"title": "easy to order.", "text": "Date of experience: January 13, 2024", "rating": 5}, {"title": "Great seller", "text": "Great seller, with great service. Rubylane's website is really user friendly, and easy. to find items.It would be better if there are more sellers that would ship internationally.", "rating": 5}, {"title": "Love your stuff, Ruby Lane", "text": "I have been watching Ruby Lane for some time now and have always admired their wonderful variety of pieces. Today I purchased three unusual pendants which I absolutely adore. They were well priced and will be worn often. The shop owner was very helpful in arranging shipping to Australia and communicated swiftly and informatively. I enjoy Ruby Lane emails as I love to see new products and to be reminded of my favourites. It is a great website, easy to manoeuvre and the numerous photos are useful in coming to a decision.", "rating": 5}, {"title": "I buy most of my gifts on RubyLane due…", "text": "I buy most of my gifts on RubyLane due to great selections, reasonably priced, well packed and shipped.", "rating": 5}, {"title": "The piece of jewelry was delivered in…", "text": "The piece of jewelry was delivered in great care, as pictured, and in time for Christmas, my wife loved it, thank you!!", "rating": 5}, {"title": "Excellent Cartier/AJ Hedges Ladybug", "text": "I am very happy with my charming gold and enamel ladybug.  Excellent condition exactly as promised!", "rating": 5}, {"title": "Timely shipping-great service- Thanks", "text": "Date of experience: January 02, 2024", "rating": 5}, {"title": "Found item that is rare to find", "text": "Date of experience: January 09, 2024", "rating": 5}, {"title": "The seller in the,\"Netherlands,\" has…", "text": "The seller in the,\"Netherlands,\" has magnificent items. He is absolutely wonderful and great communication.", "rating": 5}, {"title": "Excellent", "text": "fast and very helpful", "rating": 5}, {"title": "Excellent", "text": "Great fast service", "rating": 5}, {"title": "My order was shipped same day it was…", "text": "My order was shipped same day it was placed. It came in a lovely little box along with a personal note. That’s a very caring gesture & greatly appreciated.", "rating": 5}, {"title": "I have purchased several things from…", "text": "I have purchased several things from Ruby Lane sellers and have had a very good experience across all purchases. The objects are as advertised and they arrive promptly. Communication is good.My mom had a problem with a seller and it was resolved by Ruby Lane promptly and politely.", "rating": 5}, {"title": "Quick and easy", "text": "Quick and easy! Great quality and a variety of merchandise. Friendly and fast response by the merchant. Love this shop!", "rating": 5}, {"title": "I feel safe with Ruby Lane", "text": "I feel safe with Ruby Lane.  I believe that the hey review the listings and verify that the sellers have quality merchandise.  Thanks!", "rating": 5}, {"title": "Excellent customer service!", "text": "Excellent customer service, prompt mailing, beautiful brooch! What more can one ask for!", "rating": 5}, {"title": "Mary is very helpful !!!", "text": "Mary is very helpful !!!! Answered my question quickly and completely!!!I am a repeat customer and will buy from Mary again in the future!", "rating": 5}, {"title": "The vintage playbill I purchased…", "text": "The vintage playbill I purchased arrived today in perfect condition. It was expertly packaged. I’m so very happy with my purchase and my experience with Ruby Lane", "rating": 5}, {"title": "Safe", "text": "In this ever changing world, it’s nice to find a space that’s more comprehensively safe. Rubylane is such a space and it is appreciated!", "rating": 5}, {"title": "Asked and received in a short time", "text": "Asked and received in a short time. Packaged well to prevent damage, excellent.", "rating": 5}, {"title": "Commuications", "text": "The system of communications with the vendors works well.  Having all the correspondences in the same place is a great history of all activity.", "rating": 5}, {"title": "Happy to find Ruby Lane", "text": "Item as described.  Fair price.  Happy customer.", "rating": 5}, {"title": "B and C Victorian Antiques", "text": "B and C Victorian AntiquesIi am familiar with this site.  Shopping is easy and efficient.", "rating": 5}, {"title": "jewelry", "text": "I have been buying jewelry from different dealers with Ruby Lane for a few years. I have been pleased with every piece. The pictures and descriptions are accurate and I will continue to buy through Ruby Lane in the future.", "rating": 5}, {"title": "Great Steiff in excellent condition", "text": "Great Steiff in excellent condition, great communication and super fast shipment.", "rating": 5}, {"title": "Like having a personal assistant to answer all your questions and concerns.", "text": "Positive experience from the team at POB 1034.  Heck yeah they get the job done.  It was fun determining the value of the item.  Gave them my reason for what I thought it was worth.  And they listened!  Glad I took his advice on postage and off it went.  Let me just add that the value they place on packaging is top notch.  It must have taken time, effort and materials to wrap it up for transport.  No worries as it rained on the delivery date and got wet.  No damage as every inch of cardboard was covered with packaging tape.  So grateful for the thank you letter from Chaim.", "rating": 5}, {"title": "Easy to purchase.", "text": "Date of experience: January 03, 2024", "rating": 5}, {"title": "Great product and service", "text": "I received the product quickly and was exactly what I was looking for!", "rating": 5}, {"title": "A great seller and a fast shipper", "text": "A great seller and a fast shipper. Sends me pictures of things that interest me and might go into my collection.", "rating": 5}, {"title": "Seller is very easy to communicate with…", "text": "Seller is very easy to communicate with and has beautiful jewelry. Second purchase I’ve made from her and if this ring is as spectacular as the first one was I will be more than delighted!", "rating": 5}, {"title": "Consistently Wonderful, As Per Usual.", "text": "I’ve made numerous purchases with Ruby Lane over the years. I have never had a single issue. Consistently wonderful. Top rung vendors on this platform.", "rating": 5}, {"title": "HAVE MADE SEVERAL PURCHASES ON RUBY…", "text": "HAVE MADE SEVERAL PURCHASES ON RUBY LANE FROM VARIOUS VENDORS & HAVE NEVER HAD ANYTHING BUT WONDERFUL EXPERIENCES WITH ALL OF THEM! HIGHLY RECOMMEND THIS SITE!", "rating": 5}, {"title": "Fast and easy", "text": "Date of experience: December 22, 2023", "rating": 5}, {"title": "Better than perfect", "text": "The Riedel wine glasses are exactly as described, even better than described.  The price was reasonable and they were very carefully packaged for shipping.  I couldn’t be happier with my purchase.", "rating": 5}, {"title": "Easy to purchase", "text": "Easy to purchase. Beautiful piece at fair price", "rating": 5}, {"title": "These folks are great", "text": "These folks are great!  I had a shipment issue and they went out of their way to fix the problem.  They had great customer service and communication.  I would definitely buy from them again.", "rating": 5}, {"title": "I was very pleased with your merchandise.", "text": "Price! And quality of items!", "rating": 5}, {"title": "Very respectable and professional", "text": "Very respectable and professional! I had an issue with an order that was addressed quickly and efficiently. Thank you!", "rating": 5}, {"title": "Best place to shop", "text": "Merchant was easy to deal with, answered my request quickly . Unique jewelry , treat you like family.", "rating": 5}, {"title": "Fast response", "text": "Fast response, great customer service. Will shop here again!", "rating": 5}, {"title": "Great company", "text": "Prompt service, excellent communication, wonderful product.", "rating": 5}, {"title": "Great shopping experience!!!  Highly recommended!!Great experience", "text": "Great experience.  Just what I was looking for!!", "rating": 5}, {"title": "Great selection", "text": "Great selection.  Vendors are courteous and professional.  Have had many positive deals.", "rating": 5}, {"title": "Purchasing from Ruby Lane was very easy…", "text": "Purchasing from Ruby Lane was very easy and I appreciated the option to use PayPal at checkout.", "rating": 5}, {"title": "The checkout process was simple and…", "text": "The checkout process was simple and intuitive.", "rating": 5}, {"title": "Excellent website", "text": "Excellent website, east to navigate & very nice selection of merchandise.", "rating": 5}, {"title": "So thrilled with this transaction-…", "text": "So thrilled with this transaction- beautiful product!", "rating": 5}, {"title": "Whoo Hoo Ruby Lane", "text": "This was a seamless experience of shopping on Ruby Lane. I am extremely pleased with my purchase from Suzy Lemay - a French silver perfume bottle. I look forward from purchasing from this dealer and on Ruby Lane in the future.", "rating": 5}, {"title": "Fabulous first experience! Will definitely order again!", "text": "This was my first time ordering from Ruby Lane and it was perfect! My order arrived right on time, was in perfect condition and I could not be happier with my order!", "rating": 5}, {"title": "I was looking around for this action…", "text": "I was looking around for this action figure. My dad had one and had lost it a long long time ago when he moved out from his apartment, and finding this I decided to buy it for him to surprise him", "rating": 5}, {"title": "VERY FINE SELECTION", "text": "Date of experience: December 23, 2023", "rating": 5}, {"title": "Amazing Place to List", "text": "Amazing Place to List. Wonderful, Professional and fun People. Rubylane is totally Awesome. I Love Rubylane and Highly suggest listing here.", "rating": 5}, {"title": "Ruby Lane is the best", "text": "Ruby Lane is the best!  Beautiful vintage and antique jewelry, dolls, dishes, clothes, and more.  I’m always wanting to look at their items.  And the shipping is fast and things arrive in good shape.", "rating": 5}, {"title": "I have liked Ruby Lane and bought many…", "text": "I have liked Ruby Lane and bought many wonderful things on the site. I don’t like the new format. Old way was MUCH easier to use.", "rating": 5}, {"title": "LOVE Ruby Lane!", "text": "I have shopped on Ruby Lane for many years and have always had positive experiences. I especially like their jewelry as I can find very unique quality pieces in one place and the vendors are flexible on pricing.", "rating": 5}, {"title": "Ruby Lane-a great place to shop for…", "text": "Ruby Lane-a great place to shop for everything you love. I have never had a bad experience here and have shopped many times.  Quality-integrity.", "rating": 5}, {"title": "The seller was great at communicating…", "text": "The seller was great at communicating and answering all my questions.  The item was packed extremely well and was in great condition.", "rating": 5}, {"title": "Troubleshooting", "text": "Excellent with managing buyer/seller issues.", "rating": 5}, {"title": "Fantastic", "text": "The items arrived quickly, carefully packaged, and as described. This was my first experience on this site and it is a perfect one. Thank you!", "rating": 5}, {"title": "Fast and friendly", "text": "The seller promptly responded to my inquiries and was very accommodating.", "rating": 5}, {"title": "My order from My Vintage Clothes Line…", "text": "My order from My Vintage Clothes Line was exactly as advertised. It arrived in a timely manner & the packaging was excellent. Most satisfied!", "rating": 5}, {"title": "Excellent customer service", "text": "Excellent customer service, prompt reply & willing to negotiate on price", "rating": 5}, {"title": "Lost a favorite childhood book", "text": "Lost a favorite childhood book. My grandmother read it to my mom.  My mom read it to me.  I read it to my kids.  Having a copy back with us is precious.  I had excellent communication with the seller & it arrived safely & lovingly packed.", "rating": 5}, {"title": "I made a very scary big purchase!", "text": "I made a very scary big purchase.  Ruby Lane was there helping me along.  So far Ruby Lane has been wonderful.  I notice a lot of people recommending them for dolls.  Happy so far.  Now to get the doll home safely from Netherlands!", "rating": 5}, {"title": "Fabulous value and quick shipping", "text": "Fabulous value and quick shipping. Exactly as described. 100% positive.", "rating": 5}, {"title": "Great vintage Lenox", "text": "The vintage Lenox arrived in perfect shape, delivery was swift. great transaction, I will use again.", "rating": 5}, {"title": "RubyLane has the widest selection of…", "text": "RubyLane has the widest selection of high-quality products, and the site is easy to navigate. I’ve “met” and repurchased from numerous top-notch sellers. Overall, my experiences have been great!", "rating": 5}, {"title": "Very kind, friendly and responsive", "text": "I really wanted a specific ornament for my mom and found it on Ruby Lanes site, but it was already pending sale. I messaged them to ask if the sale didn't go through to let me know. They had another one exactly like it and listed it for me to buy as soon as i expressed interest! Very friendly with quick responses!", "rating": 5}, {"title": "Reliable vendors and high quality items.", "text": "Date of experience: December 15, 2023", "rating": 5}, {"title": "THE MOST BEAUTIFUL PIECES ANYWHERE", "text": "WHEN I WANT TO BUY BREATHTAKING, WORLD-CLASS HAND-PAINTED PORCELAIN, I ALWAYS GO TO RUBYLANE. MY THREE FAVORITE PORCELAIN SELLERS ARE ALL ON RUBYLANE. THEIR COLLECTIONS FAR EXCEED ANYTHING I HAVE FOUND ON THE MORE ORDINARY WEBSITES. I AM VERY GRATEFUL THEY CARE ENOUGH TO FIND AND LIST EXCEPTIONAL MUSEUM-QUALITY ITEMS.", "rating": 5}, {"title": "Seller was prompt on shipping", "text": "Seller was prompt on shipping, accurate description, and packaged well. Thank you!", "rating": 5}, {"title": "Worth the Visit", "text": "Unlike the Etsys of the world, Ruby Lane has managed to grow and still maintain standards. It is a fun place to browse, and an even better place to shop…old enough to remember that it isn’t all about me, the website has something for everyone’s tastes.", "rating": 5}, {"title": "Convenient shopping", "text": "Date of experience: December 15, 2023", "rating": 5}, {"title": "It's been a while since I have used…", "text": "It's been a while since I have used Ruby Lane and I was impressed with the improved \"other offer\" feature, very much like 1st Dibs, very nice.", "rating": 5}, {"title": "Shopping on Ruby Lane is always a fun experience!", "text": "Shopping on Ruby Lane is always a pleasure. The vendors are wonderful and customer service is great!", "rating": 5}, {"title": "Website was easy to navigate and I was…", "text": "Website was easy to navigate and I was able to find exactly what I wanted.", "rating": 5}, {"title": "Ruby Lane's method used for payment is…", "text": "Ruby Lane's method used for payment is extremely easy compared to a few years ago.  The only things I would recommend is that RL install tracking information for each purchased item on line along with an easy method for leaving feedback on seller (similar to ebay's setup).  CORRECTION - I wasn't aware that Ruby Lane added these features and I apologize.  Ruby Lane has great sellers and made it easy for buyers to readily complete their transactions, track shipments and provide feedback.", "rating": 5}, {"title": "I can always rely on RubyLane for…", "text": "I can always rely on RubyLane for excellent sellers who sell excellent items, like Heidi on Fancy and Fine Doll Accessories. I also like that you can Favorite and Follow sellers you like so you don’t miss out on new listings.", "rating": 5}, {"title": "Wonderful shops and quality items", "text": "Date of experience: December 12, 2023", "rating": 5}, {"title": "The site had many examples of what I…wanted as a Christmas gift to myself.", "text": "The site had many examples of what I was looking for. The ordering of the item I chose was easy.", "rating": 5}, {"title": "I love the few times I have purchased…", "text": "I love the few times I have purchased through the Ruby Lane site.  My only concern is that there is not any info on how to fill out a \"purchase order\" if you need to delay your payment temporarily.  Purchase orders are not the same as placing items in cart.  There should be clear, concise instructions on what a purchase order is, and how to delay payment once you have discussed a hold with the Seller.  Because I did not understand how to do this, I ended up buying an item immediately when I actually needed to wait two additional days.  But even with this, I rate Ruby Lane high.  And I feel like I get quality items and service.", "rating": 5}, {"title": "The site is easy to navigate", "text": "The site is easy to navigate. The selection is huge & the checkout process is easy. I have ordered several times & have always gotten my order fully intact & in a timely manner.", "rating": 5}, {"title": "Excellent website design", "text": "Excellent website design.  Easy and effective searching.  Clear pricing.", "rating": 5}, {"title": "It is very easy to search for what I…", "text": "It is very easy to search for what I want to purchase. I like the huge selection of products. I have purchased many gifts on Ruby Lane.", "rating": 5}, {"title": "Great website", "text": "Great website. Nice and easy. No problems.", "rating": 5}, {"title": "First time ordering from ruby lane", "text": "First time ordering from ruby lane. Item arrived quickly and just as described.  Thank you!", "rating": 5}, {"title": "Awesome purchase at Ruby Lane!!", "text": "My purchase of 3 items went very well and was quick! I have bought from the Hoosier store about 10 times and I have always been happy with my purchases!", "rating": 5}, {"title": "Found exactly what I was looking for on…", "text": "Found exactly what I was looking for on their site at a reasonable price.  Fast shipping too!", "rating": 5}, {"title": "Just as described", "text": "Just as described!  Quick shipper!", "rating": 5}, {"title": "Trusted seller", "text": "Trusted seller - easy transaction", "rating": 5}, {"title": "Exactly as described", "text": "Exactly as described.  Thank you, seller!", "rating": 5}, {"title": "Quick", "text": "Quick shipping of great product!", "rating": 5}, {"title": "Great site and fantastic seller. A++++", "text": "Found an item that I thought would be irreplaceable since it is no longer manufactured. Plus the item is in its original box with the original receipt! Seller was very quick and helpful with email communications. She even offered to wrap the item since it is a gift! A+++++", "rating": 5}, {"title": "Got a hard to find item at a decent…", "text": "Got a hard to find item at a decent price. Was convenient to shop and pay through the Ruby Lane platform. Will definitely shop here again!", "rating": 5}, {"title": "Ruby Lane has the greatest online…", "text": "Ruby Lane has the greatest online antiques, a good interface where I can search and filter easily, and the sellers are always responsive and professional.", "rating": 5}, {"title": "It seemed as I ordered from this seller…", "text": "It seemed as I ordered from this seller my order was on its way to me. She e-mailed me as soon as she mailed it. Thank you.", "rating": 5}, {"title": "The vendors are responsible and Ruby…", "text": "The vendors are responsible and Ruby Lane is a sure place to find and be sure to receive very interesting items.", "rating": 5}, {"title": "Extremely user friendly site", "text": "Extremely user friendly site. Many wonderful items for sale & I found exactly what I was looking for! Outstanding communication from seller. Couldn't ask for a better transaction", "rating": 5}, {"title": "Worked ****", "text": "Date of experience: December 04, 2023", "rating": 5}, {"title": "Genevieve Cummins", "text": "Genevieve Cummins, as the representative of Ruby Lane, was extremely understanding, candid and helpful.  She made purchasing this circa 1937 Hamilton doctor's watch -- a replacement for one that I owned that was stolen -- a fulfilling and warm experience.", "rating": 5}, {"title": "Full Confidence!", "text": "Cate of Del Mar Classique made this an experience where I could have full confidence. She explained to me how Ruby Lane vets its vendors and holds them accountable. I was dealing with a real person...but with a great company behind her!", "rating": 5}, {"title": "The Best Website", "text": "Ruby Lane is my first go-to when seeking an item.  I have shopped here for years and never had a problem with buying, shipping, or liking a product.  Sellers are friendly, responsive, and honest.  I love this website.", "rating": 5}, {"title": "Purchased an item I had been watching…", "text": "Purchased an item I had been watching for a while, at a tag sale price, and the item was shipped within the hour. Cannot ask for a better transaction.", "rating": 5}, {"title": "Ease with which I could go from Ruby…", "text": "Ease with which I could go from Ruby Lane Email announcement to my sign in page where I can find my wish list.", "rating": 5}, {"title": "I have always had a good experience…", "text": "I have always had a good experience when dealing with Ruby Lane dealers!", "rating": 5}, {"title": "Great", "text": "Timely delivery. Well packaged", "rating": 5}, {"title": "Fast & Easy", "text": "Very easy - fast delivery- will do business again. Transaction was smooth no problems. Would highly recommend.", "rating": 5}, {"title": "I had a question and was answered right…", "text": "I had a question and was answered right away!", "rating": 5}, {"title": "Easy order process", "text": "Date of experience: December 03, 2023", "rating": 5}, {"title": "Love Ruby Lane!", "text": "I have bought from Ruby Lane for many years and have never had a problem with any of the sellers.  The ease of purchase and good communication is very important to me and Ruby Lane has always been top notch.  Every item I purchased from them has been received quickly and as described.  I would highly recommend the Ruby Lane stores.", "rating": 5}, {"title": "Beautiful things easy check out well…", "text": "Beautiful things easy check out well described items", "rating": 5}, {"title": "Items were as described & pictured.", "text": "Date of experience: November 24, 2023", "rating": 5}, {"title": "Safety on their card", "text": "I feel like coming back when I know my credit card is safe", "rating": 5}, {"title": "Excellent dealings", "text": "Excellent dealings. Allowed setting up a layaway plan. Recommend dealing with this seller.", "rating": 5}, {"title": "A unique and vaired shopping experiance", "text": "The site always has a unique and varied shopping experience. I can always find that one gift or personal purchase that will stand out. It is a one-stop shop for hundreds of shops. I have never had any problems with my purchases. The shops I have interacted with have all been professional and helpful.", "rating": 5}, {"title": "What you are doing right:", "text": "What you are doing right:Providing your customers with venders that have great product and variety. Easy purchasing system.Easy access. Appreciation of those venders who are forthright in their descriptions of merchandise. Luv it when a vendor says a stone is filled with glass. This gives you trust in the vender and what they are selling. What needs work:Some (very few) will write up a summary of what is being sold and the summary is not exactly on point. Example: two rings are offered as Alexandrite, one is alexandrite the other is a color changing sapphire. A sapphire is not alexandrite. It is not obvious till you read the listing underneath that you realize it is a sapphire. Otherwise, it’s billed as alexandrite.", "rating": 5}, {"title": "Sally Antiques had a perfect gif", "text": "Sally Antiques had a perfect gift for my WW1 history buff partner.  I'm looking forward to giving him this gift.Ruby Lane makes the whole shopping experience easy and enjoyable.  I've used this site for at least 15 years.  On the rare instance where I encounter a glitch the issue was addressed quickly and to my satisfaction.  And, the inventory on this site is varied  and interesting.As always thanks .", "rating": 5}, {"title": "Always a pleasant experience!", "text": "Always a pleasure to be on Ruby Lane!!!", "rating": 5}, {"title": "New Customer", "text": "I'm a first time customer and found the shopping experience easy and fast.", "rating": 5}, {"title": "Excellent seller", "text": "Excellent seller!  Excellent communication and customer care, quick shipping, thorough description and great doll as described.  Thank you!!", "rating": 5}, {"title": "Finding What I want", "text": "I enjoy browsing on Ruby Lane, and I have purchased several times from Melodies Memories as part of Ruby Lane. I have always been pleased with the items purchased, the timely arrival of the purchases, and the care with which they are mailed. My long-time friend and I both collect vintage rhinestone brooches, and I find what I want for a gift as well as for myself!", "rating": 5}, {"title": "Easy pleasant purchase", "text": "I got an email saying something I had on my wish list was 50% off. I followed a link to view the corresponding page on their website and make the purchase. The process was very easy and I appreciated the heads-up about the sale price.", "rating": 5}, {"title": "Very smooth transaction...", "text": "Transaction was extremely easy.  I made an offer and received a response within 30 minutes.", "rating": 5}, {"title": "excellent!  will definitely shop here again", "text": "I was delighted with the selection and the ability to find unique items on the site.  The vendor was absolutely fantastic!  It was so convenient and easy to use this site.  I will definitely be back in the future!", "rating": 5}, {"title": "Very happy", "text": "The product arrived as order, well packaged", "rating": 5}, {"title": "I have not ever had any problems with…", "text": "I have not ever had any problems with Ruby Lane I love this lane ♥️😁", "rating": 5}, {"title": "Good selection of what I was looking…", "text": "Good selection of what I was looking for. Fast and easy purchasing. The only thing I would change is to add Apple Pay as an option at checkout.", "rating": 5}, {"title": "always easy and trustful buy on…", "text": "always easy and trustful buy on rubylane.", "rating": 5}, {"title": "Unique and diverse items", "text": "I love the variety of things to look at. Sellers descriptions are always spot on. I love good costume jewelry, and really have gotten some beautiful and unique pieces from Ruby Lane.", "rating": 5}, {"title": "You can trust this site", "text": "Super easy and safe", "rating": 5}, {"title": "Shipped same day as ordered", "text": "Shipped same day as ordered.  Thank you", "rating": 5}, {"title": "Checkout experience fast", "text": "Date of experience: November 26, 2023", "rating": 5}, {"title": "Have been a customer on Ruby Lane for a long time-LOVE it!…", "text": "Have been a customer on Ruby Lane for a long time now and have found that sellers are awesome, the items being sold are fantastic and typically there is a high level of communication, interest, and attention by those who are doing business with me.  This makes buying on the Ruby Lane platform a tremendous pleasure.", "rating": 5}, {"title": "Always satisfied with Rubylane.", "text": "Date of experience: November 24, 2023", "rating": 5}, {"title": "Very happy with purchase.", "text": "Date of experience: November 21, 2023", "rating": 5}, {"title": "Very happy with all my purchases", "text": "Date of experience: November 25, 2023", "rating": 5}, {"title": "I love shopping Ruby Lane because of the alease of transaction of…", "text": "I love shopping Ruby Lane because of the ease of using the site with a quick over-all transaction.  The prices are good too!", "rating": 5}, {"title": "Quality of the products.", "text": "Date of experience: November 24, 2023", "rating": 5}, {"title": "My experience with Ruby Lane has been positive!  I have made quite a few purchases and have been very satisfied with all of them.", "text": "My experience with", "rating": 5}, {"title": "Love all the pieces I ordered except…", "text": "Love all the pieces I ordered except the earrings that came from Canada the stones were scratched. All the other pieces have been great!", "rating": 5}, {"title": "Everything worked smoothly and as…", "text": "Everything worked smoothly and as expected.", "rating": 5}, {"title": "Responsive and Accommodating", "text": "Seller was very accommodating and helpful. Answered all my questions promptly. Very responsive.", "rating": 5}, {"title": "Expansive coverage of collectible…", "text": "Expansive coverage of collectible vintage art at reasonable prices.", "rating": 5}, {"title": "Love Ruby Lane.", "text": "I’ve been shopping on Ruby Lane for many years now and always had a wonderful experience. Their vendors are top notch and most price their merchandise well.", "rating": 5}, {"title": "I love the infinite variety of…", "text": "I love the infinite variety of affordable and curated objects on Rubylane. I check it every day!!", "rating": 5}, {"title": "THE site for vintage costume jewelry!", "text": "I’vebeen shopping on Ruby Lane for many years and I find that of all the major sites to shop for vintage costume jewelry, this is the place for really friendly and knowledgeable sellers.  And I’ve made so many friends through my transactions here.  Wonderful attitudes and well-qualified information makes this the first destination in my morning ritual of scanning for items that pique my interest.  I’m rarely, if ever, disappointed!", "rating": 5}, {"title": "Love rubylane I being  shopping  here…", "text": "Love rubylane I being  shopping  here for a couple  of year  never been  disappointed", "rating": 5}, {"title": "Perfect Transaction", "text": "Everything about this transaction was perfect!  I found exactly what I was searching for and it's very lovely!  The color, style and weight is great, and the condition is pristine.  It arrived quickly and was packaged carefully--I'm thrilled!!", "rating": 5}, {"title": "A varied and trusted site for orders and products.", "text": "The presentation photos are excellent representations.The sign in and order process is easy and trustworthy.Vendors so far have been well vetted.", "rating": 5}, {"title": "The seller and I came to quick agreement", "text": "The seller and I came to quick agreement that was fair to both of us.", "rating": 5}, {"title": "Good service!", "text": "Good service!  I love how they do Easy Purchase. Communicated with seller", "rating": 5}, {"title": "Another treasure at a great price!", "text": "Found another treasure at a great price! I love to peruse my favorite shops at Ruby Lane and admire the things I can’t afford, see how much things I already own are worth, save ideas for future purchases, and find things I can’t find anywhere else. This time I bought a great pin just in time for the holidays.", "rating": 5}, {"title": "RubyLane Has 2 Shops That Score & Rate 5 Stars!", "text": "I recently found 2 very good shops on Ruby Lane. One was \"Classic Fab Finds\" & the other is \"Shades of the Past\". I was amazed at the array of the items available to purchase but in addition they were very reasonable in price. I found items that I had been looking for a very long time & all were in mint condition - a lot in glass - no chips, scratches or what have you. A pleasure to do business with times 2.", "rating": 5}, {"title": "I Hope it for Kestner.", "text": "Date of experience: November 18, 2023", "rating": 5}, {"title": "Ruby Lane, I love you long time", "text": "I am a longtime user of Ruby Lane, longtime customer of the Identical Cousins seller. This is a great place to find vintage collectibles and unique gifts.", "rating": 5}, {"title": "Good shopping platform", "text": "Using the Ruby Lane platform was easy to navigate, communicate with the seller, and make payment. I am satisfied with my experience.", "rating": 5}, {"title": "Excellent service and amazing…", "text": "Excellent service and amazing selection. If I could give more than 5 stars I would.", "rating": 5}, {"title": "The Seller was very prompt in getting…", "text": "The Seller was very prompt in getting back to me on a question.  Item was fairly priced.  Look forward to doing business with Phil again in the future.", "rating": 5}, {"title": "The website is friendly but I have not…", "text": "The website is friendly but I have not completed my transaction, waiting for seller.", "rating": 5}, {"title": "the option to make an offer is good…", "text": "the option to make an offer is good shopping . i appreciate a store that can  understand selling long kept items at a lower price .", "rating": 5}, {"title": "First time purchase - Perfect!", "text": "This was my first time buying something on Ruby Lane. It was a very easy website to navigate - user friendly, easy to follow and understand, easy to search for the item I was seeking, and very easy checkout process. It also provided helpful information like seller ratings, customer feedback, etc. so that I could buy with confidence. The best part is, Ruby Lane just happened to have exactly what I was looking for, and, at a great price. I highly recommend Ruby Lane as a very satisfied customer!", "rating": 5}, {"title": "Great place to shop…", "text": "I have purchased a number of things from Ruby Lane and have always been quite satisfied with the items and the efficient customer service", "rating": 5}, {"title": "Exemplary customer service!", "text": "The Vendor was attentive to my questions, very helpful and responded in a timely fashion.  I work in the film industry as a Costume Buyer and will gladly visit her shop again!", "rating": 5}, {"title": "I love browsing on Ruby Lane for…", "text": "I love browsing on Ruby Lane for vintage jewellery and have had good experiences of buying, very happy with all my purchases.", "rating": 5}, {"title": "I get good customer service", "text": "I get good customer service. Bought items are shipped in reasonable time. Good communication.", "rating": 5}, {"title": "Consistently good sellers", "text": "Consistently good sellers. Honest and willing to discuss purchases and to give reasonable prices. Love the Ruby Lane 1/2 price sale with the count down to sale which helps plan your purchases ahead of time. I have gotten some great deals on that sale. Never had a problem with a purchase and have been buying for many years. Met a lot of nice and honest sellers with high quality merchandise for sale. Pictures are accurate and I just got a frequent buyer discount so that’s great to be acknowledged for being a good buyer.", "rating": 5}, {"title": "That description was very complete and…", "text": "That description was very complete and when I asked a question, I received the sweetest reply possible.", "rating": 5}, {"title": "So delighted to find a favorite…", "text": "So delighted to find a favorite Christmas book on Ruby Lane! Prompt and courteous service, too - can’t wait to receive my book!", "rating": 5}, {"title": "Easy Purchase", "text": "Easy Purchase. Communicated with seller (from whom I have bought before). Received prompt replies/ made purchase. Seller has always shipped  promptly.", "rating": 5}, {"title": "New Earrings!", "text": "I LOVE receiving the early morning new arrivals email. Today I was lucky enough to score a pair of awesome naja earrings. The checkout process is simple, and I'm excited to get a great gift for my daughter. Thank you!", "rating": 5}, {"title": "Why I love Ruby Lane!…", "text": "The people on Ruby Lane care for the site like it is their own and it is really, each person is running a small business and the really take care in making it great. I have been studying the site for a month before I start selling and I love the great care they take in describing each and every item they sell.d", "rating": 5}, {"title": "Cinnabar Earrings you for the", "text": "Thank you for the fabulous Cinnabar earrings. The tracking information was very easy, and the parcel was delivered as per the tracking info. I’ll definitely look for other items from your shop.", "rating": 5}, {"title": "Excellent customer service from Diana", "text": "Diana Carson, owner of \"A Vintage Love Affair\" responded to my text inquiring about the length of the necklace about an hour after I sent it.  I bought the necklace yesterday (11/12/23) about 6:00 p.m.  When I logged in to my email this morning, there was a message that she had already shipped it to my home.", "rating": 5}, {"title": "Quirks & Glitches", "text": "I had hoped Ruby Lane should save my Credit Card info so that I don't have to put it in again & again when I make a purchaseTry to let customers comment on a buying experienceduring the time it is occurring.  Whatever quirks & glitches there are, if they are solved on the spot, it would be so much better", "rating": 5}, {"title": "Easy checkout process.", "text": "This transaction was fast and easy. The transaction went flawlessly .Love this site for the ease of it's checkout process. It is awesome.", "rating": 5}, {"title": "It was very easy", "text": "Date of experience: November 12, 2023", "rating": 5}, {"title": "Purchasing jewelry for over a year", "text": "Purchasing jewelry for over a year. Always very happy. Donna", "rating": 5}, {"title": "Your site is easy to navigate!", "text": "Your site is easy to navigate!I can always find if you have what I am looking for", "rating": 5}, {"title": "Great dealer, great item!", "text": "The pictures were clear and the description was accurate.  The dealer refunded a portion of the shipping because she had overestimated the cost.  The item was extremely well packed.", "rating": 5}, {"title": "Always had good results purchasing voa…", "text": "Always had good results purchasing voa Ruby Lane", "rating": 5}, {"title": "Great products", "text": "Great products. Super prices!!", "rating": 5}, {"title": "Website easy to navigate and simple to…", "text": "Website easy to navigate and simple to order from.", "rating": 5}, {"title": "Easy site to navigate", "text": "Easy to navigate site, simple straightforward way to reach out to sellers with questions. Outstanding selection of quality items.", "rating": 5}, {"title": "I love ordering vintage pieces from…", "text": "I love ordering vintage pieces from Ruby Lane. This transaction/shop was no exception. The carefully packaged “Man in the Moon” moonstone and sapphire ring arrived safely and promptly; it is absolutely pristine. This gorgeous ring is the perfect match to my vintage earrings—also purchased on Ruby Lane, of course. Linda was a pleasure to deal with: friendly, helpful, and responsive. Many thanks!", "rating": 5}, {"title": "I love this shop.", "text": "I look this shop. The photos and descriptions of what they have for sale are accurate. I ordered a beautiful 1925 glass vase and it was well-packaged for its trip across the company. It was delivered quickly and the vase is stunning. I received a beautiful personalized note from the owner.", "rating": 5}, {"title": "Ruby Lane is a very user friendly site", "text": "Ruby Lane is a very user friendly site. I enjoy using it and am happy they have many sellers for  buyers to deal with.  This site allows buyers to easily communicate with the sellers in order to receive the best service.", "rating": 5}, {"title": "Prompt response to questions.", "text": "Date of experience: November 06, 2023", "rating": 5}, {"title": "I trust this company to tell the truth about their merchandise?", "text": "99% of my transactions with this company have been everything I had hoped.", "rating": 5}, {"title": "Wedgwood cup and saucer", "text": "Easy to maneuver through the website", "rating": 5}, {"title": "Antique mantel clock", "text": "The website was easy to follow.    All pictures and descriptions of the merchandise was clear.", "rating": 5}, {"title": "We've always had a good experience with…", "text": "We've always had a good experience with Ruby Lane's vendors. We've never had any issues with the transactions or shipments.", "rating": 5}, {"title": "Trouble Changing from Seller to Customer", "text": "I wrote for help in my switch from vendor to customer and was answered promptly.  The problem I had was also fixed.  The process was simple!  I'm SO grateful to the Customer Service rep, a kind gentleman named Charles.", "rating": 5}, {"title": "Found what I wanted!…", "text": "Got what I wanted and your search engine is good.  Good communication from seller!", "rating": 5}, {"title": "Excellent!", "text": "This was an excellent experience!!  I have been looking for the items I purchased for a long time and was thrilled to find them here.  Registration and payment were quick to accomplish and everything went very smoothly.  I'm so pleased!!!", "rating": 5}, {"title": "Ongoing site informational process", "text": "Some of the organizational structures of the site are confusing to negotiate.  I think it is getting better, but for new sellers it is difficult to find process and answers to questions.  My most recent experience took a couple additional emails to further clarify my questions.  The respondent, initially made assumptions that I knew what they were talking about, when I did not.  They were patient and provided more complete answers.", "rating": 5}, {"title": "Was very helpful about my order", "text": "Was very helpful about my order. Was as described and in great condition", "rating": 5}, {"title": "Very beautiful & unique items at your fingertips.", "text": "Excellent.", "rating": 5}, {"title": "A Cornucopia", "text": "The variety of items on one site and the ease of locating specific interests is very helpful in researching and finding what one is seeking.", "rating": 5}, {"title": "Excellent Customer Service…", "text": "We love Simon and all the people who work in Customer Service. They are super friendly and well trained to answer your questions. Thank you Rubylane for such great service!!!", "rating": 5}, {"title": "The Steiff Lion", "text": "I purchased a Steiff lion from The Steiff Room site in Ruby Lane recently.  It arrived promptly and was well wrapped.  The lion (Leo) is beautiful, in great condition and as described.  I really appreciate working with this vendor.  Thanks!", "rating": 5}, {"title": "Easy to locate what you are looking for…", "text": "Easy to locate what you are looking for and easy to order", "rating": 5}, {"title": "access to a great variety of things…", "text": "access to a great variety of things that are easy to search for.", "rating": 5}, {"title": "Long standing buyer", "text": "I have purchased jewelry through Ruby Lane for over 10 years now. I have never been disappointed in a purchase. Customer service is prompt and personal. My purchases are always well packaged for shipping. Many times there is a personal, handwritten note addressed to me, thanking me for my purchase and wishing enjoyment of my purchase. I look forward to receiving sale updates from Ruby Lane daily.", "rating": 5}, {"title": "Love my purchase!", "text": "The shop owner replied immediately - that says volumes about his commitment to customers! He was able to facilitate my purchase and took care of everything. Plus it was packaged securely and shipped the next day. And I love the bowl - looks fantastic on my table!", "rating": 5}, {"title": "I had pleasant and kind interactions…", "text": "I had pleasant and kind interactions with my first purchase on Ruby Lane.  I plan on using this site again in the future.", "rating": 5}, {"title": "Ruby Lane review", "text": "i think the website has an innovative and accessible design...it feels old-fashioned and comfortable...communication with seller felt personal...i appreciate the clearly stated policies, especially regarding returns.", "rating": 5}, {"title": "Truly eclectic", "text": "Interesting items at very reasonable prices.  A very welcome surprise!", "rating": 5}, {"title": "Very easy to shop with excellent…", "text": "Very easy to shop with excellent products!", "rating": 5}, {"title": "BEST Place to Shop Wonderful Dealers…", "text": "BEST Place to Shop Wonderful Dealers and Wonderful Finds!", "rating": 5}, {"title": "Excellent transaction in every way", "text": "Date of experience: October 15, 2023", "rating": 5}, {"title": "iCollect", "text": "A great Experience!", "rating": 5}, {"title": "Always an excellent transation-", "text": "Date of experience: October 25, 2023", "rating": 5}, {"title": "I have been connected with the finest…", "text": "I have been connected with the finest antique doll dealers in the US, France, and UK through Ruby Lane.  I have had excellent service from all of them!  I love antique dolls, and in spite of the \"next generation's\" attitude in wanting new, replaceable things, I'm SO GLAD we can all still do this!!   Nanci", "rating": 5}, {"title": "I have been buying from RubyLane for 7…", "text": "I have been buying from RubyLane for 7 years. I find the dealers have ALWAYS sent items quickky and as described. I continue to look for \"finds\" that no one else has. Vintage is the best!", "rating": 5}, {"title": "Easy purchasing", "text": "Easy purchasing! Lovely website! Always something new!", "rating": 5}, {"title": "I love this website", "text": "I love this website! Everything is so unique! I will be doing more shopping here :)", "rating": 5}, {"title": "Excellent communication is the key to…", "text": "Excellent communication is the key to the success of the Company.", "rating": 5}, {"title": "Always classy and wonderful", "text": "Date of experience: October 22, 2023", "rating": 5}, {"title": "An amazing store for playing card decks.", "text": "I have found Two For His Heels to be an excellent company when searching for antique, out of print, or unusual playing card decks.  The quality of the decks is exactly as described, shipping is quick, and the decks are packed well to avoid shipping damage.  The owner of the company, Steve, is very friendly and helpful if you have any questions, and he responds quickly.  My shopping experiences with Two For His Heels have always been great!", "rating": 5}, {"title": "Grateful & Happy Canadian!", "text": "Very helpful and accommodating when asked to ship to Canada. Excellent communication throughout the whole transaction. Looking forward to getting my package in the mail! Thank you, Veronica! - LMorgan", "rating": 5}, {"title": "great merchandise  and easy to purchase", "text": "Date of experience: October 21, 2023", "rating": 5}, {"title": "An excellent experience", "text": "Susan was extremely helpful, ensuring that I had an accurate picture of my item and an understanding of how long it would take to arrive. When I received my item, it was everything that I hoped it would be.", "rating": 5}, {"title": "You cannot make this firms better", "text": "You cannot make this firms better.  They are courteous, friend and courtesy is best.I am old fashion and like good manners and business savy great.", "rating": 5}, {"title": "Love love love", "text": "I like to buy my wife beautiful and unique jewelry; I can always find what I am looking for on Ruby Lane.", "rating": 5}, {"title": "Bought From Seller Previously: Great Experience", "text": "Loved the choices, even though there were 69 pages of them... The only thing which greatly bothered me was that PayPal sent me a notice that I seem to have paid through them, which I certainly DID NOT!", "rating": 5}, {"title": "Love Ruby Lane for years now", "text": "Love Ruby Lane for years now. Quality for reasonable prices and website is wonderful.", "rating": 5}, {"title": "Website is easy to navigate.", "text": "Date of experience: October 19, 2023", "rating": 5}, {"title": "Lovely doing business with the seller", "text": "Lovely doing business with the seller. New to shopping on Ruby Lane. Wonderful first experience! Excited to receive the item I bought.", "rating": 5}, {"title": "Always great items!!", "text": "Always great items that you can't find anywhere else!  Sometimes pricier than the E-sites, but knowledgeable honest sellers make it worth a bit more!", "rating": 5}, {"title": "AMBER EARRINGS", "text": "FAST TO RESPOND ===ITEMS SHE HAS ARE GREAT ==CAN'T WAIT TO GET THEM ...", "rating": 5}, {"title": "Easy buy", "text": "Easy buy. Seller extremely honest.", "rating": 5}, {"title": "I so enjoy shopping with known doll…", "text": "I so enjoy shopping with known doll dealers and having the ability to get to know them through the site as well as through UFDC.", "rating": 5}, {"title": "The only problem I had", "text": "The only problem I had, is I didn’t scroll down to they could submit my offer? I couldn’t understand why I didn’t hear anything.  Now I know, maybe put scroll down to submit.", "rating": 5}, {"title": "Easy to complete purchase.", "text": "Date of experience: October 15, 2023", "rating": 5}, {"title": "Ruby Lane absolutely wonderful for vintage buyers", "text": "Ruby Lane is an excellent and very reliable source for finding wonderful and absolutely beautiful vintage items. The only suggestion is that hopefully RL will soon find a way for customers to post photos of their Ruby Lane purchases because it helps sellers sell even more because then potential buyers can see how the jewelry really looks like when worn. The interface gives the option to upload photos but when uploaded nothing is visible, which is such a shame, because then the shops don’t get the visual credit of how amazing their products are in real life.", "rating": 5}, {"title": "Website is easy to use", "text": "Website is easy to use, huge variety of goods available from lots of different providers. I've had very positive experiences with the sellers.", "rating": 5}, {"title": "Excellent", "text": "Shops are easy to navigate and checkout was simple!", "rating": 5}, {"title": "Great dealer", "text": "The dealer I purchased from was wonderful to work with.", "rating": 5}, {"title": "Elegant and simple", "text": "The item was easy to locate and purchase, and the information access was intuitive.", "rating": 5}, {"title": "easy to follow", "text": "Date of experience: October 13, 2023", "rating": 5}, {"title": "I shopped at the Rusty Husky Antiques…", "text": "I shopped at the Rusty Husky Antiques store. I found the selections great and the prices were within reason. When I selected an item as a gift for myself (my favorite kind of shopping), the item selected was shipped without delay. I throughly enjoyed my experience and will repeat it in the future.", "rating": 5}, {"title": "Great Vintage Selection", "text": "Favorite lists and checkout process is easy. There are a lot of dealers on this site, and I can find anything vintage or antique here. I shop here often and the independent store owners have been very reliable and honest.", "rating": 5}, {"title": "Great item", "text": "Great item, easy to view, easy to determine full cost, easy to buy.", "rating": 5}, {"title": "Great", "text": "Great.  Fast shipping.", "rating": 5}, {"title": "What makes my experience great is the…Trust, Expertise and Quality!", "text": "What makes my experience great is the trust, expertise and quality I put in Ruby Lane to scrutinize their dealers and their merchandise.  I have bought vintage, and authentic antique jewelry from the Ruby Lane dealers for years.  I am so proud of these pieces and just treasure them in my collection.  The only problem I have is the vast and gorgeous selection of some of the most beautiful antique, and vintage jewelry, I have ever seen in my life.  I am always discovering new dealers with new treasures, diamonds, gems, sterling, gold, turquoise, anything collectable.  I could just get into too much trouble.  It's my favorite place to go to shop!", "rating": 5}, {"title": "I've never had any problem with seller…", "text": "I've never had any problems with seller communications, payments, or receipt of orders.", "rating": 5}, {"title": "The vendor was understanding", "text": "The vendor was understanding, patient and kind as we both worked through the problem. Could not ask for better service. I have made many purchases from Maggie and will certainly continue to do business with her.", "rating": 5}, {"title": "free shipping from this vendor", "text": "Date of experience: October 06, 2023", "rating": 5}, {"title": "Great Seller always!", "text": "I have purchased from Ann-tiques and Fine Jewelry several times and items are always as they appear, she follows up very timely and items are sent immediately. I highly recommend and trust this seller!", "rating": 5}, {"title": "Exactly what I was looking for", "text": "Exactly what I was looking for, at a great price. Quick, reliable service.", "rating": 5}, {"title": "Fun choices and happy endings.", "text": "Fun to see all your choices and then to narrow it down to what you will select today.I have been very happy with all my purchases.", "rating": 5}, {"title": "Where to buy the perfect gift", "text": "I always know that I can find the perfect gift on Ruby Lane.  My daughters buy their gifts on Ruby Lane as well.", "rating": 5}, {"title": "I ordered a vase from Something…", "text": "I ordered a vase from Something Wonderful and it arrived quickly and in great condition.  The seller kept me informed about the status of my order.", "rating": 5}, {"title": "Very easy website to work with", "text": "Date of experience: October 07, 2023", "rating": 5}, {"title": "Ruby Lane is a legitimate & wonderful resource", "text": "I’ve never had an issue with an item purchased from Ruby Lane. Really cool unique items from various sellers are offered here. This is a legitimate and great resource for your finds.", "rating": 5}, {"title": "I always find unusual gifts for friends…", "text": "I always find unusual gifts for friends or for myself.", "rating": 5}, {"title": "anything I buy has been wonderful so far", "text": "Date of experience: October 05, 2023", "rating": 5}, {"title": "Love this company!", "text": "Love this company!! So many beautiful things!", "rating": 5}, {"title": "Great communication", "text": "Great communication. Fast shipping. Beautiful bracelet.", "rating": 5}, {"title": "A great place for Quality.", "text": "I have now made numerous purchases through Ruby Lane and have to say I'm extremely pleased with both the excellence of the items and also the service from the sellers.", "rating": 5}, {"title": "Confidence in seller", "text": "I've bought from this seller before and items advertised are as described.  Delivery is on time.", "rating": 5}, {"title": "Lovely things.", "text": "Always fun!  Lovely surprises! Easily  accessible and easy payment.", "rating": 5}, {"title": "Help answers to my questions on email.", "text": "Date of experience: October 03, 2023", "rating": 5}, {"title": "Nice and easy to use", "text": "Nice and easy to use and they have a fabulous selection of really unique and beautiful items ... no hesitation in recommending Ruby Lane!", "rating": 5}, {"title": "Jeremy Walls of Petit Vernon on Ruby…", "text": "Jeremy Walls of Petit Vernon on Ruby Lane was an extraordinarily helpful seller of the beautiful crystal vase I bought. He answered my email promptly and then sent videos, rotating the vase slowly in excellent light, followed by a still photo on which he had circled two barely discernible scratches. He did not want me to miss seeing them on the video. I am very impressed with this scrupulously honest seller and would happily buy again from him. I highly recommend Jeremy Walls and his website on Ruby Lane!", "rating": 5}, {"title": "The seller was easy to work with.", "text": "Date of experience: September 24, 2023", "rating": 5}, {"title": "Ruby Lane: A VALUABLE Resource!", "text": "Throughout my many purchases over the years from vendors on Ruby Lane, not only have I found GREAT products in my \"interest\" category: dolls), but I have also found REALLY TERRIFIC Sellers, as well, which makes the transactions even MORE APPEALING!I GREATLY VALUE having Ruby Lane as a source for my collectible doll \"stuff\"!", "rating": 5}, {"title": "Easy communication with the seller", "text": "Easy communication with sellers, good choice of items, different types of payment.", "rating": 5}, {"title": "When I buy from Ruby lane 9 times out…", "text": "When I buy from Ruby lane 9 times out of 10 I am satisfied with what I ordered ! So you have a good thing going with your site ! Sincerely,William Weigand", "rating": 5}, {"title": "wonderful transaction from Design References", "text": "speedy delivery...well packed...wonderful transaction from Design References. thanks so much! :)", "rating": 5}, {"title": "I like the easygoing buying.", "text": "I like, many times, description of the items.  Also there is a feeling of security knowing Ruby Lane is in the middle of the transaction.", "rating": 5}, {"title": "I Love everything about RL!", "text": "Date of experience: September 29, 2023", "rating": 5}, {"title": "Easy to use search of categories", "text": "Easy to use search of categories, Ebay is a nightmare, compared to you. I can always find what I want, which is very important to me. Keep up the good work & don't change. You can't improve on great. My seller is friendly & accommodating too.", "rating": 5}, {"title": "Quality items listed on this site.", "text": "Quality items listed on this site.Easy to communicate with seller.", "rating": 5}, {"title": "Found such a variety of items with…", "text": "Found such a variety of items with decent prices. Really enjoyed looking around and of course I'll be back.", "rating": 5}, {"title": "The website was easy to use", "text": "The website was easy to use. Sellers are very professional and helpful.", "rating": 5}, {"title": "Happy Shopping!", "text": "I appreciate that checkout is easy and that categories are clearly defined--for example, no repro jewelry in a fine jewelry search, unlike another site.   Navigation is straightforward--and fun,  which is a good part of RL's shopping experience!", "rating": 5}, {"title": "I Love my first experience", "text": "I Love my first experience, fast shipping, beautiful item ,better than I expected. Would buy again.", "rating": 5}, {"title": "Easy process", "text": "Easy process.  Very straightforward.", "rating": 5}, {"title": "Transactions are always smooth and so…", "text": "Transactions are always smooth and so lightening  fast!", "rating": 5}, {"title": "Hooray for Pearl's Parlor", "text": "Couldn't believe how fast Pearl's Parlor got my purchase to me.  Communication was great and I love what I purchased.  Well done!", "rating": 5}, {"title": "I can usually find a nice brooch to add…", "text": "I can usually find a nice brooch to add to my collection, and at a good price!", "rating": 5}, {"title": "A real pleasure shopping at Ruby Lane", "text": "A real pleasure shopping at Ruby Lane. So many choices and great attention to detail, straight through until your package arrives.", "rating": 5}, {"title": "My purchase went very easily and fast.", "text": "Date of experience: September 22, 2023", "rating": 5}, {"title": "Great find !", "text": "I was looking for a small Cambridge blue rose bowl very rare. There it was . Then it was delivered in excellent condition.", "rating": 5}, {"title": "I love that I can buy with confidence…", "text": "I love that I can buy with confidence from the sellers.all kinds of wonderful items, but it the sellers who have so much integrity that makes me feel safe buying on Ruby lane.", "rating": 5}, {"title": "Stunning Queen Marie Antoinette Plate", "text": "The item received matched its online description, packaged extremely well, and shipped quickly! Thank you for a wonderful experience! 💐", "rating": 5}, {"title": "So easy peasy purchasing!!", "text": "Date of experience: September 17, 2023", "rating": 5}]