[{"title": "Escrow for security", "text": "The seller provided multiple high quality pictures of the watch, was fast and thorough in their replies to my questions.  The Chrono24 escrow and 14 day return window provided peace of mind while awaiting the watch and inspecting it post-delivery.In the past, however, Chrono24 has failed to hold sellers accountable for stated return policies.", "rating": 5}, {"title": "The transaction was seamless", "text": "The transaction was seamless.  Ordered it, paid for it in a manner that I felt most secure with, got updates on the parcel, and got the watch.  Loved how I benefited from their experience with different dealers.  I wouldn't have bought the item from where I did (Germany) without having that confidence.", "rating": 5}, {"title": "Ahead od delivery date, good price", "text": "The seller offered a more competitive price after rejecting their first offer. The watch came ahead of the initially promised delivery date. I suspect the box was not the same as provided by the manufacturer - instead of a rugged plastic box for promasters, I gor a Citizen carton box. This wasn't a deal breaker for me.", "rating": 5}, {"title": "High recommend Chrono24", "text": "I have purchased two watches from Chrono24 and also sold one on the platform. Huge choice of watches to buy at competitive prices. The buyer protection program is reassuring. Great experience. ", "rating": 5}, {"title": "Second transaction with Chrono", "text": "Second transaction with Chrono. Both items were exactly as described and the purchase process was smooth and easy. Highly recommend. ", "rating": 5}, {"title": "Other than not getting through the…", "text": "Other than not getting through the first time I called, when I did I got all questions answered immediately by a real professional. The purchasing experience is superb.", "rating": 5}, {"title": "They were very engaging throughout the…", "text": "They were very engaging throughout the process and making sure to keep updating me the shipping status and following up with me when delivered and after delivery. I'm really pleased with their way of communication. ", "rating": 5}, {"title": "Another happy customer of Chrono24", "text": "Despite the Australian Border Force holding up the watch because of a CITES issue, I am delighted and satisfied with my purchase. Chrono24 and the dealer were making every effort to rectify the situation and find a solution. This dealer is highly recommended. ", "rating": 5}, {"title": "This was my first time using Chrono24", "text": "This was my first time using Chrono24, and my second time buying a watch on-line. The dealer reviews were a big part of my decision to try them out. Updates from Chrono24 came in right away, and up to and after delivery of the watch. I would have no hesitation to buy through a trusted dealer on this site again.", "rating": 5}, {"title": "Great platform", "text": "Great platform. Seamless transaction. Having a middle man gave me the confidence to make a transaction this big over the internet. Would definitely use again. ", "rating": 5}, {"title": "C24 is an easy platform to negotiate", "text": "C24 is an easy platform to negotiate. Additionally, it has an extremely large selection of watches that you are almost guaranteed to find what you are looking for.", "rating": 5}, {"title": "Shop With Confidence at Chrono24", "text": "Chrono24 made my search experience and transaction easy and pleasant.  Each listing is logically laid out and navigation is a breeze.  Shop with confidence here.", "rating": 5}, {"title": "The best place for used watches", "text": "Good variety of choices from around the world, a generally top notch dealer population and clear listings. Definitely place to go for wristwatches. ", "rating": 5}, {"title": "Great system for buying authentic watches.", "text": "I purchased a Seiko SBPY165N 'Panda Style' Solar Chronograph and a Citizen Attesa Super Titanium GPS Solar Radio CC4058-67X from different dealers. Both arrived promptly, well-packaged, and with all necessary paperwork. When one watch was flagged by US Customs, the dealer responded quickly, ensuring smooth delivery. Chrono24’s platform made the purchase easy and secure, with excellent communication tools between buyer, seller, and Chrono24. I’ll definitely use this platform again and highly recommend it to others.", "rating": 5}, {"title": "Awesome seller!", "text": "Seller was awesome throughout the whole process. They sent numerous photos of different watches without question. After purchase they held the postage upon request as I was over seas at the time. Once shipped it reached Australia within 24 hours and at my address within a couple of days after customs stung me with GST. Product ended up being better condition than advertised. Would certainly use again! Cheers!", "rating": 5}, {"title": "Ordered a Watch from Japan and perfect", "text": "Ordered a Watch from Japan and based in Australia.Watch is 60 years old and in excellent condition as described. ", "rating": 5}, {"title": "Chrono24 representation of the watch…", "text": "Chrono24 representation of the watch and the dealer were very accurate. DHL, the shipper was horrible.  I would never use them again if I had a choice.  I have posted comments about DHL on a different web site, DHL action was not related to Chrono24 or the selling dealer.", "rating": 5}, {"title": "Excellent easy to use platform and…", "text": "Excellent easy to use platform and access to great watchdeals and variety from around the world.", "rating": 5}, {"title": "Watch was in perfect condition", "text": "Watch was in perfect condition, transaction went very smoothly, very happy with everything.", "rating": 5}, {"title": "Very smooth and trust worthy…", "text": "Very smooth and trust worthy experience. Only complaint is the custom paper work from the import process. Wish Chrono24 could have explained it beforehand.", "rating": 5}, {"title": "Smooth Transaction", "text": "Smooth TransactionVery pleased with how easy the purchase was. The seller packaged my timepiece with great care and promptly shipped my item. I highly recommend both the Chrono24 platform and the seller for providing a wonderful purchasing experience.", "rating": 5}, {"title": "Chrono has been a reliable source of…", "text": "Chrono has been a reliable source of watches for me. Large collection to compare prices. Very pleased. ", "rating": 5}, {"title": "I was having a little trouble…", "text": "I was having a little trouble connecting by phone but was able to get my questions answered, the end result was satisfactory experience and I was very happy with my purchase.", "rating": 5}, {"title": "The entire process was amazing", "text": "The entire process was amazing. I was, at first, skeptical about sending money online.  I spent a fair amount of time researching chrono 24 and spoke to several users that eased my anxiety. Great company to deal with.  My watch was as advertised probably better.  Couldn't be happier.", "rating": 5}, {"title": "I felt secure purchasing a timepiece…", "text": "I felt secure purchasing a timepiece without seeing it first in person due to the 2 week return policy and the escrowed payment held until I received the item. ", "rating": 5}, {"title": "Bought 3 watches I think through…", "text": "Bought 3 watches I think through Chrono24, never had an issue, simple and easy process ", "rating": 5}, {"title": "The whole process was easy", "text": "The whole process was easy, transparent and as promised. Got lots of updates along the way, no snags…felt confident the whole time and I now trust purchasing through Chrono 24…(it was my first time test purchase and it all went well)…", "rating": 5}, {"title": "Easy App to Navigate for first timers", "text": "Everything was communicated fluently till every detail was gathered, than the delivery was committed along with tracking tools .", "rating": 5}, {"title": "valuable resource for watch buyers.", "text": "great place to go research market value for watches and get much better deals than your local ADs", "rating": 5}, {"title": "I would like to thanks Chrono24 the…", "text": "I would like to thanks Chrono24 the help and assistance either my piece. They actually reach back to me and advised me about the progress of the buy and delivery. Would recommend with out a inch of a doubt. ", "rating": 5}, {"title": "Love this platform for buying and…", "text": "Love this platform for buying and selling watches Highly recommend Glenn ", "rating": 5}, {"title": "Easily found and  purchased an…", "text": "Easily found and  purchased an expensive piece across the world. Chrono24 expert helped me pick the watch and check it. Easy and reliable", "rating": 5}, {"title": "A great experience end to end", "text": "A great experience end to end. The team is very responsive. ", "rating": 5}, {"title": "Easiest to use", "text": "Easiest to use, professional website!We wish to have the same website!Great customer service, quick and easy to reach. Professional work.Nothing more to ask for.Thank you guys.", "rating": 5}, {"title": "Great experience! ", "text": "Your website was very easy to browse and find the watch that I was looking for. I was then connected with a reputable jeweler who was amazing to work with. I received the watch within two days Without be able to physically see it, I felt confident with the authenticity of the watch and shipping it to my home.", "rating": 5}, {"title": "Great place to fine your next watch", "text": "They communicate well with buyers and seller alike. They make sure that commitments are kept and you are able to find the watch that you are looking for at a fair price.", "rating": 5}, {"title": "Secure transaction and prompt delivery", "text": "Purchasing through chrono24 is so feasible as you can buy without any worry. Transaction is secured and prompt delivery with updates were made after payment done. Overall, am very satisfied with the purchase and will definitely recommend purchasing via the app.", "rating": 5}, {"title": "The process was very quick and seamless…", "text": "The process was very quick and seamless dealing with Chrono24 and the seller.  The Major issues were with DHL, it took over a week to clear the item through customs.", "rating": 5}, {"title": "Gret", "text": "Trusted site with a great protocol in place to maintain and increase trust in your purchases", "rating": 5}, {"title": "Breitling was exactly as described", "text": "Breitling was exactly as described, shipped very fast, and packaged well.  100% excellent.  ", "rating": 5}, {"title": "This jeweler is a great family run…", "text": "This jeweler is a great family run company that were extremely helpful and professional.  I received a wonderful product that was more that I was expecting.  I'll be back to purchase more from them in the future.", "rating": 5}, {"title": "Very sophisticated interface featuring…", "text": "Very sophisticated interface featuring protection for both buyer and seller.  I have now used them for both international as well as domestic transactions in the USA.  Highly recommend in this strange era of minimal inventory from the major brands but amazenling enough there seen to be an endless supply of almost new watches!", "rating": 5}, {"title": "I've bought several watches from this…", "text": "I've bought several watches from this site and only had one bad experience (due to the seller, not the site). I would highly recommend it. ", "rating": 5}, {"title": "Second time purchasing from Chrono24…", "text": "Second time purchasing from Chrono24 and experience I had was really good. I also sold my watch here as well and the process was great!! Highly recommend Chrono24", "rating": 5}, {"title": "Wonderful customer service", "text": "Wonderful customer service.  The website is easy to navigate and work with the sellers.", "rating": 5}, {"title": "Chrono 24 made my search easy", "text": "Chrono 24 made my search easy and then give me the confidence that all would be well during the purchase process.", "rating": 5}, {"title": "Efficient transaction", "text": "Efficient transaction. Watch was as described. Fair price. Quick delivery. ", "rating": 5}, {"title": "Great website", "text": "Great website. I have purchased 3 times from this website and never had any problems ", "rating": 5}, {"title": "Trusted site", "text": "Trusted site, with over whelming assortment of wrist watches.", "rating": 5}, {"title": "Excelent experience", "text": "Excelent experienceFast progress from order to delivery,the watch looks as it should for a new one😀Thanks to the watch dealer for professional response ,thanks to Chrono 24 for such an application and specialy for being a trusting one.Thanks", "rating": 5}, {"title": "Couldn't have been better!", "text": "It was an easy, smooth transaction.  Delivery was earlier than expected and item was exactly as described and carefully packed.Would buy from and recommend this seller with utmost confidence!", "rating": 5}, {"title": "Excellent experience", "text": "Excellent experience.  Great communication and the watch is exactly as described.  Fastest shipping I’ve ever experienced.  I ordered the watch on a Monday and it was on my wrist by Wednesday. Hope to work with this seller in the future.", "rating": 5}, {"title": "Very straight forward and easy to use", "text": "Very straight forward and easy to use, bought a couple watches as an entry enthusiast. ", "rating": 5}, {"title": "No issues with purchases so far", "text": "No issues with purchases so far, smooth transactions with dealers", "rating": 5}, {"title": "This is the third purchase I've made…", "text": "This is the third purchase I've made and every time no issues. Every watch I have received has been delivered as described. ", "rating": 5}, {"title": "Making the purchase of the Omega…", "text": "Making the purchase of the Omega Seamaster via Chrono24 was a good experience. Everything happened as expected, and the watch exceeded my expectations. I will definitely be buying more watches here to build my collection ", "rating": 5}, {"title": "Seamless purchase with built in…", "text": "Seamless purchase with built in security, very happy thanks.", "rating": 5}, {"title": "Diversity and Range", "text": "If you're looking for a trustworthy and professional watch dealers with top-notch customer service, I highly recommend Chrono24", "rating": 5}, {"title": "all went perfect", "text": "all went perfect. had a problem with an watch from a delear...very fast return + refund . 2 days to receive the refund recommended for sure", "rating": 5}, {"title": "Purchased a watch on the app", "text": "Purchased a watch on the app. Very smooth and simple experience. The options for payment are very good and the overall purchase experience was very good. ", "rating": 5}, {"title": "Smooth as silk", "text": "Tons of watches to choose from. Easy app to use and excellent purchase experience (smooth as silk).", "rating": 5}, {"title": "Bought a number of watches on Chrono24", "text": "Bought a number of watches on Chrono24. Great experience every time, had one small problem with a watch and the resolution team were brilliant .", "rating": 5}, {"title": "Instructions were easy to follow in…", "text": "Instructions were easy to follow in listed a watch.", "rating": 5}, {"title": "Risk free", "text": "Risk free.  Brilliant app that protects the buyer with attention to detail.  My concierge Andrea was a rock star assisting me purchase multiple watches and a fierce advocate for the buyer.  Extremely professional. ", "rating": 5}, {"title": "I would like to thank Chrono24 for…", "text": "I would like to thank Chrono24 for their fast action & professional work ", "rating": 5}, {"title": "The best platform for CPO watch…", "text": "The best platform for CPO watch purchase. ", "rating": 5}, {"title": "The whole process from ordering to…", "text": "The whole process from ordering to delivery first class ", "rating": 5}, {"title": "It was a very good experience", "text": "It was a very good experience. The seller’s description and asditional information helped a lot. The delivery was timely and smooth. The watxh fully met me expectations. ", "rating": 5}, {"title": "Highly recommend this seller", "text": "Perfect communication and super quick shipping from Japan to Europe. Item as described.", "rating": 5}, {"title": "All good", "text": "All good. Delivered on time as advertised ", "rating": 5}, {"title": "Great place to buy and sell watches", "text": "Great place to buy and sell watches. Very professional and serious. Very secure. ", "rating": 5}, {"title": "This was a great transaction", "text": "This was a great transaction. I got exactly what I thought I would be getting. Great communication. I paid a little more for express shipping and it came very quickly. I would buy from them again. ", "rating": 5}, {"title": "My experience", "text": "I have bought three watches and Chrono24 and all have been positive and pleasant experiences.", "rating": 5}, {"title": "A bought a Citizen watch from Harvey…", "text": "A bought a Citizen watch from Harvey Store. De.The watch have a long strap, verry long for my wrist. I sent the watch to the store, and i wait my money buck.Chrono 24 is verry honest and safe , all is good. I sell a few watches here. All good", "rating": 5}, {"title": "every question that was put forward was…", "text": "every question that was put forward was answered in a helpful and clear way, i felt confidant that i was dealing with a good company", "rating": 5}, {"title": "Great site; secure purchases. ", "text": "Great site. Plenty of product information. Secure purchases. ", "rating": 5}, {"title": "Seller was brilliant", "text": "Seller was brilliant, amazing contact and service. ", "rating": 5}, {"title": "Very clear communication", "text": "Very clear communication. Straight forward service and clear site.", "rating": 5}, {"title": "Really simple and no hassle", "text": "Really simple and no hassle, the sellers are also easy to contact", "rating": 5}, {"title": "Easy payment and vendor interaction", "text": "Payment was straight forward and the vendor PrestigeTime was very communicative.", "rating": 5}, {"title": "Great experience!! ", "text": "I had a very easy experience with purchasing my watch from Chrono24. It’s a safe & secure site. Chrono24 is my go to for my future watch purchases ", "rating": 5}, {"title": "Great communication from Chrono24.", "text": "Great communication from Chrono24.Works fast and clear. No questions needed.", "rating": 5}, {"title": "Due to the set-up", "text": "Due to the set-up, I was very comfortable in my trading for a watch. Highly recommended.", "rating": 5}, {"title": "Fantastic platform for both buying and…", "text": "Fantastic platform for both buying and selling. Trusted and worry free method to make both feel at ease. ", "rating": 5}, {"title": "Third watch I’ve purchased through…", "text": "Third watch I’ve purchased through chrono 24 all transactions great !", "rating": 5}, {"title": "First time buying through Chrono 24", "text": "First time buying through Chrono 24. Process very easy with good communication. Highly recommend and with the added bonus of payment protection ", "rating": 5}, {"title": "Very easy to navigate and quick…", "text": "Very easy to navigate and quick responses from the chrono24 team. Great all around ", "rating": 5}, {"title": "A safe place to shop using a trusted…", "text": "A safe place to shop using a trusted seller/escrow service. I will definitely use Chrono24 again", "rating": 5}, {"title": "Easy to communicate with the seller", "text": "Easy to communicate with the seller.  I was always updated with information on shipment arrival estimation.  Most important is that I felt secure in the transaction.", "rating": 5}, {"title": "Excellent place for hard to find watches", "text": "I was able to find exactly the watch I was looking for and the transaction was smooth and easy.", "rating": 5}, {"title": "The only site you need", "text": "The search and discovery process is simply and fun. The merchants are professionals. The buying experience is streamlined. ", "rating": 5}, {"title": "Product looks exactly as posted.", "text": "Product looks exactly as posted. ", "rating": 5}, {"title": "Very Good", "text": "Good experience, able to find watch I was after at good price!", "rating": 5}, {"title": "Very easy transaction", "text": "Very easy transaction. Would definitely use Chrono24 again.  ", "rating": 5}, {"title": "Watch is A1", "text": "Watch is A1, service and dealer keep you updated ! Would recommend 100%", "rating": 5}, {"title": "Great platform", "text": "Great platform, great portfolio of sellers and very user-friendly process.", "rating": 5}, {"title": "Great experience ", "text": "Makes the purchase process secure ", "rating": 5}, {"title": "Very impressed with the communication…", "text": "Very impressed with the communication and delivery time. Tokyo - Brisbane Australia in 6 days….an excellent experience ", "rating": 5}, {"title": "Great interaction", "text": "Great interaction. Sure did everything well and made the experience seem less. ", "rating": 5}, {"title": "A simple and good way of transaction.", "text": "Date of experience: October 22, 2024", "rating": 5}, {"title": "Legit", "text": "The experience was great🤍 Quick responses and a great watch.", "rating": 5}, {"title": "The watch was exactly what they…", "text": "The watch was exactly what they advertised . Thx so mucj", "rating": 5}, {"title": "Packed with care", "text": "Quick Shipping, and a great watch packed with care! Thank you!!", "rating": 5}, {"title": "The watch is very very good like a new …", "text": "The watch is very very good like a new  , really I like it and it's arrived on short time ", "rating": 5}, {"title": "Great experience ", "text": "Responded to all my questions. Very happy with the product. Would purchase from the company again. ", "rating": 5}, {"title": "The Chrono24 Buyer Protection makes the…", "text": "The Chrono24 Buyer Protection makes the entire experience easy and stress free.", "rating": 5}, {"title": "Love the company and easy to get…", "text": "Love the company and easy to get watches for fair prices", "rating": 5}, {"title": "Breitling Colt GMT", "text": "Beautiful experiences with japanese dealers. Thanks to Chrono, every time the transaction went smooth, nothin to complain.", "rating": 5}, {"title": "A wide selection of watches", "text": "A wide selection of watches. Responses by seller are timely.", "rating": 5}, {"title": "A sense of security.", "text": "Great communication and shipping updates. A very professional online presence. I felt very secure dealing through Chrono24.  ", "rating": 5}, {"title": "Very easy with clear and fast…", "text": "Very easy with clear and fast communication.I felt very safe using chrono24 ", "rating": 5}, {"title": "I feel safe.", "text": "Everything was done as agreed. I recommend the seller. They are very professional.", "rating": 5}, {"title": "App perfecta.", "text": "Date of experience: November 06, 2024", "rating": 5}, {"title": "Great, easy experience", "text": "Great seller, item arrived as described, easy transaction.", "rating": 5}, {"title": "Very useful and honest website", "text": "Date of experience: November 03, 2024", "rating": 5}, {"title": "Bought couple of watches from here", "text": "Bought couple of watches from here. Great experience.", "rating": 5}, {"title": "I was informed all the way where the…", "text": "I was informed all the way where the watch was & when it would arrive", "rating": 5}, {"title": "Top service", "text": "Top service ", "rating": 5}, {"title": "good service", "text": "Date of experience: October 16, 2024", "rating": 5}, {"title": "Excellent", "text": "Extremely correct, accurate and with a secure payment system.", "rating": 5}, {"title": "Easy to make a deal", "text": "Easy to make a deal. Fair pricing and quick shipping", "rating": 5}, {"title": "The security it offers for shopping…", "text": "The security it offers for shopping which is the best for online shopping", "rating": 5}, {"title": "Top service and reliable company", "text": "Top service and reliable company ", "rating": 5}, {"title": "Second watch from Chrono24", "text": "Second watch from Chrono24. Very satisfied.", "rating": 5}, {"title": "The easiest way in the world to…", "text": "The easiest way in the world to purchase the time piece you desire", "rating": 5}, {"title": "Gives the buyer piece of mind", "text": "Gives the buyer piece of mind ", "rating": 5}, {"title": "Great", "text": "Easy, safe transaction!", "rating": 5}, {"title": "Excellent", "text": "Excellent, fast and very trustful site", "rating": 5}, {"title": "Good website", "text": "Good website, secure!", "rating": 5}, {"title": "It’s how I update my horology…", "text": "It’s how I update my horology experience!", "rating": 5}, {"title": "Great platform", "text": "Great platform. Worldwide reach.Secure escrow service", "rating": 5}, {"title": "Excellent service", "text": "Excellent service, up to date information, totally professional and trustworthy. ", "rating": 5}, {"title": "Smooth Purchase", "text": "Smooth and trouble-free transaction.", "rating": 5}, {"title": "Vendor was efficient and helpful", "text": "Date of experience: October 01, 2024", "rating": 5}, {"title": "Great platform", "text": "Great platform. I have used it twice. The first watch I returned and got a refund with no hassle. The second watch I have kept.", "rating": 5}, {"title": "Excellent communication", "text": "Excellent communication, prompt service and a superb watch at a reasonable price. Couldn't be happier.", "rating": 5}, {"title": "great service shown by rectifying an…", "text": "great service shown by rectifying an issue", "rating": 5}, {"title": "Really well organised network.", "text": "Really well organised network.Reliable and easy to manage.", "rating": 5}, {"title": "Painless purchase", "text": "Painless purchase. Felt comfortable. Dealer experience excellent ", "rating": 5}, {"title": "Chrono24 is excellent ", "text": "Chrono24 is very professional, an excellent site, well-designed, positive experience as a buyer. ", "rating": 5}, {"title": "Flawless Transaction", "text": "Excellent packaging. Accurate description. Product arrived in a timely fashion. ", "rating": 5}, {"title": "Everything ended up being resolved and…", "text": "Everything ended up being resolved and the staff at Chrono24 did a great job Thank you ", "rating": 5}, {"title": "great deals", "text": "great deals, safe payment, great customer service", "rating": 5}, {"title": "Clean transaction", "text": "Clean transaction. Watch exactly as described and pictured. Good communication, fast shipping.", "rating": 5}, {"title": "Accurate description of watch", "text": "Accurate description of watch. Lightning fast service.", "rating": 5}, {"title": "Great ", "text": "Thank you. Great service ", "rating": 5}, {"title": "super good!", "text": "Date of experience: October 01, 2024", "rating": 5}, {"title": "Great platform", "text": "Great platform - found nice dealer.", "rating": 5}, {"title": "Clear information on the watch", "text": "Clear information on the watch. Fast communication from the buyer. Overall a good experience.", "rating": 5}, {"title": "Excellent love the site", "text": "Date of experience: October 26, 2024", "rating": 5}, {"title": "Awesome Experience", "text": "Great place to buy a watch!", "rating": 5}, {"title": "Good information and comparison on the…", "text": "Good information and comparison on the requested item", "rating": 5}, {"title": "Brilliant selection", "text": "Brilliant selection. Great pricing and superb service.", "rating": 5}, {"title": "Company was considered reputable.", "text": "Date of experience: October 22, 2024", "rating": 5}, {"title": "Peace of Mind", "text": "Excellent security, multiple layers of buyer protection gave me confidence to make a purchase. ", "rating": 5}, {"title": "Good communication", "text": "Good communication, prompt delivery, secure processes.", "rating": 5}, {"title": "Great", "text": "Great service ", "rating": 5}, {"title": "Very good platform.", "text": "Very good platform. ", "rating": 5}, {"title": "I am satisfied with the services of Chrono24", "text": "The organization is perfect and the payment method is guaranteed with the delivery.", "rating": 5}, {"title": "Everything was correct and fast.", "text": "Everything was correct and fast. ", "rating": 5}, {"title": "Good product", "text": "Good product, fast shipping!", "rating": 5}, {"title": "Best service out there!", "text": "They never fail me, ever!", "rating": 5}, {"title": "Great site with all in one service.", "text": "Great site with all in one service. ", "rating": 5}, {"title": "quick respond from seller", "text": "quick respond from seller, found the watch i wanted", "rating": 5}, {"title": "Seemless ", "text": "Great experience, thanks Chrono24", "rating": 5}, {"title": "Seamless process", "text": "Date of experience: November 07, 2024", "rating": 5}, {"title": "Transparent and relatively fast…", "text": "Transparent and relatively fast delivery.", "rating": 5}, {"title": "Best prices for genuine watch online", "text": "Quality.Prices.Process safety.Immaculate.", "rating": 5}, {"title": "Very good market store watches", "text": "Date of experience: October 27, 2024", "rating": 5}, {"title": "Easy transaction", "text": "Easy transaction. Short and effective communication with the buyer and fast transaction ", "rating": 5}, {"title": "Beautiful classic watch", "text": "Beautiful classic watch. Great condition ", "rating": 5}, {"title": "Everything went smoothly", "text": "Date of experience: October 29, 2024", "rating": 5}, {"title": "Correct", "text": "Correct, quick! Recommended", "rating": 5}, {"title": "All good 5 stars", "text": "Date of experience: September 01, 2024", "rating": 5}, {"title": "Excellent communications from seller…", "text": "Excellent communications from seller and broker.", "rating": 5}, {"title": "excellent platform connecting watch…", "text": "excellent platform connecting watch sellers/buyers!", "rating": 5}, {"title": "Highly professional.", "text": "Excellent experience", "rating": 5}, {"title": "Communication management between seller…", "text": "Communication management between seller and buyer", "rating": 5}, {"title": "Accuracy", "text": "Accuracy, reliability and efficacy in all my purchases.", "rating": 5}, {"title": "Great", "text": "Good experience ", "rating": 5}, {"title": "Good experience", "text": "Good experience ", "rating": 5}, {"title": "Safety", "text": "Safety, fast, excellent communication!", "rating": 5}, {"title": "Everything was ok", "text": "Everything was ok. Comunication, notification. ", "rating": 5}, {"title": "Great options", "text": "Great options, even better communication.", "rating": 5}, {"title": "Perfect transaction", "text": "Perfect transaction ", "rating": 5}, {"title": "Exelent", "text": "Exelent, tnx", "rating": 5}, {"title": "Easy to communicate", "text": "Easy to communicate ", "rating": 5}, {"title": "Excellent movement", "text": "Excellent movement, Quick Delivery.", "rating": 5}, {"title": "Excellent!", "text": "Date of experience: October 23, 2024", "rating": 5}, {"title": "Very nice webpage", "text": "Very nice webpage ", "rating": 5}, {"title": "Was good experience", "text": "Was good experience ", "rating": 5}, {"title": "Straightforward and seamless experience", "text": "Date of experience: October 14, 2024", "rating": 5}, {"title": "Seamless and informative", "text": "Date of experience: October 17, 2024", "rating": 5}, {"title": "Everything was OK", "text": "Date of experience: October 17, 2024", "rating": 5}, {"title": "Excellent service quick delivery", "text": "Excellent service quick delivery ", "rating": 5}, {"title": "Amazing service", "text": "Date of experience: October 16, 2024", "rating": 5}, {"title": "Quick and easy", "text": "Quick and easy ", "rating": 5}, {"title": "Good experience", "text": "Date of experience: October 27, 2024", "rating": 5}, {"title": "Good communication", "text": "Date of experience: October 11, 2024", "rating": 5}, {"title": "Trusted experience", "text": "Date of experience: October 01, 2024", "rating": 5}, {"title": "Awesome experice", "text": "One of the best platforms to sell and buy watches in the world. ", "rating": 5}, {"title": "They were very responsive and accurate…", "text": "They were very responsive and accurate detailed the watch condition. ", "rating": 5}, {"title": "Great experience ", "text": "Easy, transparent transaction. Item arrived exactly as expected. ", "rating": 5}, {"title": "Good transaction. Product as per description. ", "text": "Product as per description. Quick delivery. Will buy again. ", "rating": 5}, {"title": "Once again:)", "text": "Once again, the Chrono 24 showed themselves as the best platform to connect the watch enthusiasts on a merely  global basis! Deals go in a very professional and smooth way, while under one highly protected and secure environment! Thank you and till my next visit🙂", "rating": 5}, {"title": "First time buyer", "text": "Simple to use and very intuitive even if you are not  very tech savvy.....like me!", "rating": 5}, {"title": "Amazing", "text": "Amazing watch and delivery and my whole experince was amazing", "rating": 5}, {"title": "Very supportive and respectful people", "text": "Very supportive and respectful people! Thank you for your business!", "rating": 5}, {"title": "Retro Watch search", "text": "Watch just arrived. My Chrono24 and Big Ben TP experience has been great. Watch arrived in a timely fashion, communication was great and watch is perfect for an everyday wear and love the vintage feel and look. I have already switched the strap.", "rating": 5}, {"title": "Easy and Great", "text": "Easy and super convenient! Chrono24 makes you feel secure while buying a purchase online! ", "rating": 5}, {"title": "Better than expected. ", "text": "Great. Watch was better than expected. ", "rating": 5}, {"title": "Super smooth transaction ", "text": "I purchased a watch recently on the app and the transaction was unbelievably easy. I knew what watch I wanted and found it on the site and it was in my possession by weeks end. Unbelievably simple ", "rating": 5}, {"title": "Very convenient, good recommendation system", "text": "First of all, Chrono24 is a respectable site that makes the overall process much less nervous. Many thanks for this escrow account. Also you have an extremely convenient search engine and recommendation system. Speaking about my wishes: please consider adding “skeleton” into searching filters. So that I could search across different brands for skeletonised only watches. Thank you!", "rating": 5}, {"title": "The application is so good and it alow…", "text": "The application is so good and it alow you to buy any watch from your home. But it need little improvement like :- your members who have an account with chrono24 give them a special discount who buy 5 watches , 10 watches ,15 watches and above every quantity different discount. ", "rating": 5}, {"title": "Platform works extremely well when it…", "text": "Platform works extremely well when it comes to search features and functionality. The selection is large and easy to navigate. ", "rating": 5}, {"title": "The seller was wonderful", "text": "The seller was wonderful.  They had another of the same watch available new for me at the same price.  Shipping was timely.  The watch was perfect with cards and box.  This was my first time using Chrono24 to purchase a watch.", "rating": 5}, {"title": "Seamless transactions", "text": "Seamless transactions ", "rating": 5}, {"title": "Great app and easy to search their…", "text": "Great app and easy to search their massive database of timepieces", "rating": 5}, {"title": "Communication is key ", "text": "Easy to use, trustworthy and communicative of all the steps, and what’s happening with your money. ", "rating": 5}, {"title": "Easy transaction", "text": "Date of experience: October 07, 2024", "rating": 5}, {"title": "I am so happy for the purchase as the…", "text": "I am so happy for the purchase as the service and delivery is amazing. Everything worked perfectly. There is one point I did not realise as I had to pay more than the listed price. It might be due to the service charge from Chrono24. ", "rating": 5}, {"title": "Enjoyed the checkout and purchase…", "text": "Enjoyed the checkout and purchase experience.", "rating": 5}, {"title": "Awesome from start to finish", "text": "Awesome from start to finish, purchased a Explorer 2 and  Submariner no date ", "rating": 5}, {"title": "reliable", "text": "reliable, as always", "rating": 5}, {"title": "Prompt service", "text": "Prompt service, watch exactly as described ", "rating": 5}, {"title": "Great choice of watches", "text": "Great choice of watches and good prices. I look for more items regulary!", "rating": 5}, {"title": "very happy with the process used…", "text": "very happy with the process used excellent service", "rating": 5}, {"title": "Great service", "text": "Great service. As I changed my mind after receiving the delivery, I could return the watch and receive a full refund. The messaging subsystem is great and helped to stay in touch with the dealer.", "rating": 5}, {"title": "Great site", "text": "Great site. Bought a used speedmaster through an authorized dealer and the whole experience was secure, convenient and lightning fast. ", "rating": 5}, {"title": "The escrow payment feature made me feel…", "text": "The escrow payment feature made me feel confident dealing with third parties. I also liked the return feature when buying from dealers. Finally, the processes to ensure that pictures in posts are authentic gave me confidence in making a purchase decision based off of these. ", "rating": 5}, {"title": "Great experience ", "text": "Being able to have the watch shipped to a watchmaker and send money to an escrow account while all that happened made me feel really secure in this transaction. Everything went super smoothly and quickly, actually arriving before promised. I am thrilled.", "rating": 5}, {"title": "Nice ", "text": "Great experience ", "rating": 5}, {"title": "Tjp on g", "text": "Good web site", "rating": 5}, {"title": "Trustable seller ", "text": "Authentic product, good communication (room for improvement though), and product delivered in reasonable time. ", "rating": 5}, {"title": "Professional ", "text": "Everything was co-ordinated. I got step by step direction and things went perfect and i got delivery 1 day before. Watch was exactly as picture.", "rating": 5}, {"title": "Easy to use.", "text": "Easy to use. ", "rating": 5}, {"title": "Very pleased with the whole process", "text": "Date of experience: October 08, 2024", "rating": 5}, {"title": "Quick easy and accurate- all steps…", "text": "Quick easy and accurate- all steps along the way made the purchase easy and I was confident in the authenticity and security of ", "rating": 5}, {"title": "Watch purchase was good", "text": "Date of experience: October 19, 2024", "rating": 5}, {"title": "It's all good", "text": "It's all good ", "rating": 5}, {"title": "Really simple and smooth experience", "text": "Really simple and smooth experience. As a first time buyer there are always reservations and questions when you are about to spend thousands of dollars on a watch the other side of the world.Chrono24 have a really smart system in place and as long as you research the seller and read reviews you should be able to relax and enjoy the experience.Would definitely use Chrono24 again and have been really impressed with not only the services they offer but the security and checkpoints (like 14 days hold on money in escrow) that they have in place.Excellent experience all round for me.", "rating": 5}, {"title": "It’s been very great", "text": "It’s been very great. I have found great deals. Only purchased 2 watches so far. ", "rating": 5}, {"title": "Chrono24 Best Place to buy or sale", "text": "Chrono24 Best Place to buy or sale. This is my second watch and I have had the best buying experience both times. They protect you and the buyer and give you 14 days to make sure you are 100% satisfied or your money back. That means everything to me. They have a great and easy site to navigate ", "rating": 5}, {"title": "Had a great purchasing experience with…", "text": "Had a great purchasing experience with Chrono24, even though, it was pricey but I got my watch delivered and it was in good condition all thanks to Chrono24🙏🙏👍💯", "rating": 5}, {"title": "Excellence", "text": "Like any great service based in the selling of goods or services, Chrono24 has built a seamless, and trustless portal, connecting vendors (both institutional and private) with buyers, through solid, well built systems that protect everyone throughout the buying cycle.", "rating": 5}, {"title": "First Chrono24 purchase worked…", "text": "First Chrono24 purchase worked perfectly. ", "rating": 5}, {"title": "Trustworthy platform and excellent…", "text": "Trustworthy platform and excellent service.", "rating": 5}, {"title": "My purchase went smooth from start to…", "text": "My purchase went smooth from start to finish. 5 STARS", "rating": 5}, {"title": "Great Experience", "text": "This was my first Chrono24 purchase. Seller provided fast delivery. Watch was just as described and the time and complications were all set to match my time zone. Would repeat.", "rating": 5}, {"title": "Breitling Datora", "text": "No issues. Watch as advertised, lovely piece! Sent quickly!", "rating": 5}, {"title": "Good communication about the process.", "text": "Date of experience: September 30, 2024", "rating": 5}, {"title": "service is spot on", "text": "service is spot on, reliable and fast", "rating": 5}, {"title": "Have used the app a couple of times and…", "text": "Have used the app a couple of times and they are 100% onboard with answers and I have only good and safe experience with buying with them onboard", "rating": 5}, {"title": "Chrono24 fan.", "text": "Firstly the website itself.Virtually unlimited options a comprehensive range of brands, models and styles.It is extremely user-friendly to navigate and purchasing is straightforward.Secondly the updates I received from both Chrono24 and RodeoDrive were excellent. I rate the customer service I received as exemplary.", "rating": 5}, {"title": "I have made 2 purchases through…", "text": "I have made 2 purchases through Chrono24 and I have been very satisfied with the whole process. Will definitely continue the site to acquire more pieces. Thank you. ", "rating": 5}, {"title": "Excellent service and safe payment 👍", "text": "Date of experience: October 04, 2024", "rating": 5}, {"title": "Ordered my first watch here", "text": "Ordered my first watch here. Very reliable service from them.", "rating": 5}, {"title": "A pleasure!", "text": "As usual doing business with Chrono24 was a pleasure.", "rating": 5}, {"title": "Really easy and user friendly service", "text": "Really easy and user friendly service ", "rating": 5}, {"title": "Great experience ", "text": "Was a great experience, accurate advertisement, quick shipping and felt good about buying a watch with a guarantee.", "rating": 5}, {"title": "Very easy to use e2e", "text": "Date of experience: September 30, 2024", "rating": 5}, {"title": "Very fast response and knowledgeable…", "text": "Very fast response and knowledgeable people.", "rating": 5}, {"title": "I've made two watch purchases through…Great Experience", "text": "I've made two watch purchases through Chrono24, and both experiences have been absolutely top-tier. The platform is reliable, easy to navigate, and provides a great selection of high-quality timepieces. Each transaction was smooth, and I felt confident with every step, from communication with the sellers to the secure payment process.Both watches I purchased arrived in perfect condition and exactly as described, which speaks volumes about the trustworthiness of the platform and its vendors. I highly recommend Chrono24 for anyone looking for a seamless, professional, and enjoyable watch-buying experience. I'll definitely be making more purchases here in the future!", "rating": 5}, {"title": "Peace of mind…your purchase is safe", "text": "Date of experience: October 11, 2024", "rating": 5}, {"title": "Quick", "text": "Quick, honest and efficient. No problems.", "rating": 5}, {"title": "Thank you sooo much !!!", "text": "Date of experience: October 16, 2024", "rating": 5}, {"title": "My first purchase", "text": "My first purchase and everything went so well. Would definitely recommend!", "rating": 5}, {"title": "Amazing app", "text": "Amazing app, great dealers and overall service!Amazing! ", "rating": 5}, {"title": "I Have used Chrono24 several times over . . . very easy to use", "text": "I Have used Chrono24 several times over the course of about 3 years now and every single time has been painless and effortless on my part. You choose your watch of choice, commit to buying it, pay for it and it magically appear at your address in a not very long time - 3-7 working days in my case. Highly recommended", "rating": 5}, {"title": "Safety and ease of use", "text": "Very easy to use and very safe to proceed with a purchase.", "rating": 5}, {"title": "Very satisfactory recent purchase", "text": "Straightforward. Efficient. Ease of use. Watch as described. Prompt reply from dealer", "rating": 5}, {"title": "Best place to buy watches", "text": "Always find great watches, huge selection and variety of suppliers. Best place to find a watch from very affordable all the way to very high end.", "rating": 5}, {"title": "Tried a few offers", "text": "Tried a few offers, and finally found the correct deal for me.", "rating": 5}, {"title": "Great service and platform to buy and…", "text": "Great service and platform to buy and sell watches", "rating": 5}, {"title": "Top, number 1", "text": "Top, number 1, like a vip!!!", "rating": 5}, {"title": "Very good service.", "text": "Date of experience: October 15, 2024", "rating": 5}, {"title": "The process for buying an authentic…Great service provided as promised!", "text": "The process for buying an authentic watch proclaimed by Chrono24, in my experience, was totally accurate and they delivered as promised.", "rating": 5}, {"title": "Overall everything is good", "text": "Overall everything is good,  but I'd kindly request to have the possibility to sort by payment method also(PayPal/via bank/both)", "rating": 5}, {"title": "Thank you!!", "text": "Date of experience: October 14, 2024", "rating": 5}, {"title": "Did it again", "text": "Quality product. Quick delivery. Clear communication. All thanks to Chrono24. Definitely the place to go for a watch.", "rating": 5}, {"title": "Easy & Straighforward", "text": "Easy & Straighforward ", "rating": 5}, {"title": "Smooth transaction buying a watch from…", "text": "Smooth transaction buying a watch from a Japanese seller. Quick shipping and convenient escrow coordination. Watch in great shape. ", "rating": 5}, {"title": "I will use same company again.", "text": "Clear communications and timelines fron the company. Price and product were amazing.", "rating": 5}, {"title": "It’s a great place to buy and sell…", "text": "It’s a great place to buy and sell watches ", "rating": 5}, {"title": "Great shopping experience", "text": "Fast response fast delivery from Japan. Awesome watch ", "rating": 5}, {"title": "With a compressive guarantee system I…", "text": "With a compressive guarantee system I feel confident buying authentic watches through Chrono24.", "rating": 5}, {"title": "Communication was good", "text": "Communication was good, and delivery was on time, product as described.", "rating": 5}, {"title": "Great experience!", "text": "very pleasant experience, everything was excellently done", "rating": 5}, {"title": "I trust Chrono24 to purchase high-end…", "text": "I trust Chrono24 to purchase high-end timepieces. ", "rating": 5}, {"title": "My first experience with Chrono24 and…", "text": "My first experience with Chrono24 and it exceeded expectations. I would highly recommend.", "rating": 5}, {"title": "Very professional people ", "text": "Very professional people ! I appreciate it ! I would buy again and again !! ", "rating": 5}, {"title": "Transacrionn& purchase process was easy…", "text": "Transacrionn& purchase process was easy & straightforward.", "rating": 5}, {"title": "Watch as described", "text": "Watch as described. Received just 2-3 days after purchase. Good experience.", "rating": 5}, {"title": "A great buying experience ", "text": "Great communication, fast replies and happy to provide extra photos/videos when asked. Would definitely recommend ", "rating": 5}, {"title": "Everything went smooth when buying…", "text": "Everything went smooth when buying watch. I recommend!", "rating": 5}, {"title": "Everything was ok", "text": "Fast and free shipping, nice watch, everything was ok", "rating": 5}, {"title": "Excelent app", "text": "Date of experience: October 13, 2024", "rating": 5}, {"title": "Simple and fast", "text": "Simple and fast. Got my watch with no fuss.", "rating": 5}, {"title": "Chrono24 great app. ", "text": "Very happy with the system & how Chrono24 helped with the whole process. ", "rating": 5}, {"title": "Fast and reliable", "text": "Hassle free!", "rating": 5}, {"title": "Everything was great ", "text": "Everything was great . I just did not receive the thin foam like paper inside the box to protect the face of the watch. I’ve never purchased a new Rolex that didn’t have this protection ", "rating": 5}, {"title": "Great communication and quick delivery", "text": "Great communication and quick delivery. Very happy with my seller and Chrono24", "rating": 5}, {"title": "Fast delivery and prompt correspondence.", "text": "Date of experience: September 26, 2024", "rating": 5}, {"title": "Panerai", "text": "Profesional service ", "rating": 5}, {"title": "Literally one of the best places on…", "text": "Literally one of the best places on earth to buy watches from. ", "rating": 5}, {"title": "Customer feedback ", "text": "Good trading experience ", "rating": 5}, {"title": "Best way to buy a watch ", "text": "1234567890", "rating": 5}, {"title": "Reliable dealer ", "text": "Reliable dealer who answers questions quickly and treats customers smoothly. I recommend him.", "rating": 5}, {"title": "I love the opportunity to search and…", "text": "I love the opportunity to search and compare watches that I admire and find the best price.", "rating": 5}, {"title": "Great communication", "text": "Great communication and delivery service", "rating": 5}, {"title": "Great service", "text": "Great service ", "rating": 5}, {"title": "Trusted website and plenty of choices", "text": "Trusted website and plenty of choices ", "rating": 5}, {"title": "My experiences have always been good…", "text": "My experiences have always been good and I would recommend their service to anyone looking for a watch.", "rating": 5}, {"title": "Chrono24 is the best.", "text": "Chrono24 is the best I have sold more than 12 ", "rating": 5}, {"title": "Excellent website for buying and selling low to high end timepieces ", "text": "Excellent service. Website is easy to navigate and well laid out. Everything is clear and transparent. So far the experience has been great as both a watch seller and a buyer. A++", "rating": 5}, {"title": "Good purchasing experience ", "text": "Smooth process", "rating": 5}, {"title": "Simple and straightforward", "text": "Simple and straightforwardCompletely hassle free! The checkout process was so simple, and communication with the dealer was awesome. The only way I'll be buying watches online from here on out!!", "rating": 5}, {"title": "Found Chrono24 through an eBay listing…", "text": "Found Chrono24 through an eBay listing for a watch; price was better than that on eBay for the same listing - many good products and decent safeguards for the buyer. ", "rating": 5}, {"title": "⭐️⭐️⭐️⭐️⭐️", "text": "⭐️⭐️⭐️⭐️⭐️Very good services", "rating": 5}, {"title": "Quick easy transaction", "text": "Quick easy transaction. Utilizes reputable services to facilitate a secure financial transaction. As well as consistent communication ", "rating": 5}, {"title": "I buy through chrono24 2 watches so far", "text": "I buy through chrono24 2 watches so farThe experience was perfect!I will buy through chrinos24 again for sure ", "rating": 5}, {"title": "Nice watch", "text": "Nice watch; smooth transaction.", "rating": 5}, {"title": "Chrono24 = Awesomeness", "text": "The staff at Chrono24 was very helpful and kind to help allay my first time experience of buying a high priced time piece not seen in person.  ", "rating": 5}, {"title": "I decided to return the watch I bought", "text": "I decided to return the watch I bought. The process went smoothly.", "rating": 5}, {"title": "I didnt expect it to be verry smooth…", "text": "I didnt expect it to be verry smooth since I am in canada and ordering from Europe. It was my first and it was a good experience. ", "rating": 5}, {"title": "Great communication ", "text": "Great communication Item was exactly as described Quick Shipping ", "rating": 5}, {"title": "Great experience", "text": "Date of experience: September 19, 2024", "rating": 5}, {"title": "Peace of mind knowing Chrono24 is…", "text": "Peace of mind knowing Chrono24 is involved, to verifying watch and owner and as guardian that payment is only released when delivery is made. Could have purchased my latest deal 10% cheaper via eBay 😎", "rating": 5}, {"title": "First time using Chrono24.", "text": "First time using Chrono24.Seller responded very quickly to offer. Excellent communication through the platform all the way.Payment was easy. Love that it goes to escrow account.Shipping was super fast, even from Hong Kong to UK. Watch in perfect condition.Couldn't be better.", "rating": 5}, {"title": "I’m fully satisfied with Chrono24", "text": "I’m fully satisfied with Chrono24’s working and usefulness as a selling point for expensive watches with its reasonable offer of prices, the ease of doing business and the facilitation to communicate with the buyer. My only concern is security that it would reach the buyer safely with no untoward incidents along the way. Thankfully all went well though the watch was held up at the US customs for some days. Notwithstanding, it was important to communicate closely with the buyer and keep each other well-informed on the goings on.", "rating": 5}, {"title": "Just perfect ", "text": "Quick delivery, great buy at a great price and everything included as described ", "rating": 5}, {"title": "excellent communications and service", "text": "Date of experience: October 02, 2024", "rating": 5}, {"title": "Found my dream watch! ", "text": "I’ve been looking for a watch for quite a while - it had to be automatic, silver coloured, bracelet band, within a certain price range, small case width & a recognizable (for me) brand. My son introduced me to this site & I found the perfect watch quickly. I was amazed that my criteria was met. Highly recommend this site!", "rating": 5}, {"title": "Very professional and informative", "text": "Very professional and informative ", "rating": 5}, {"title": "Price was reasonable", "text": "Price was reasonable, watch was shipped promptly, and watch was excellent as was advertised; very satisfied with my purchase.", "rating": 5}, {"title": "I received my watch in perfect…", "text": "I received my watch in perfect condition. The seller was quick to respond to my questions and to ship. I would definitely buy from this seller again.", "rating": 5}, {"title": "“Great experience ", "text": "“Great experience purchasing a watch from your site! It arrived quickly, well-packaged, and exactly as described. Excellent communication and reliable service. Highly recommended!”", "rating": 5}, {"title": "Product arrived as depicted", "text": "Product arrived as depicted.  Timely shipping and effective communication throughout purchasing process", "rating": 5}, {"title": "Buying a JLC Reverso on Chrono24", "text": "I felt secure during the purchase of my watch, knowing that 14 days after I receive it, Chrono24 are keeping the paid amount in their escrow account and in case of issue or return of the purchase, I will get my money back. Site works great and the communication and transaction with the seller was very well facilitated. ", "rating": 5}, {"title": "Great app", "text": "Great app. Legit & safe. ", "rating": 5}, {"title": "Great communication…", "text": "Great communication throughout the purchase.  ", "rating": 5}, {"title": "Professionable", "text": "Professionable, correct, Thanks ", "rating": 5}, {"title": "Bought three watches from this…", "text": "Bought three watches from this provider. All were certified with buyer protection. All have arrived exactly as stated and on time. Very happy with them.", "rating": 5}, {"title": "Happy Customer. ", "text": "I've purchased a few watches and over the years and each time was just as advertised. No hassles, on time.I will be buying another watch from Chrono24 in the future. Thank you !", "rating": 5}, {"title": "When everything goes right!", "text": "An easy process that resulted in buying a great watch! The seller was fantastic and I received the watch quickly in fabulous condition. I would definitely buy from him again.", "rating": 5}, {"title": "EASY PROCESS", "text": "The purchase process was seamless, easy and simple. The watch details provided were accurate.Communications were very good.", "rating": 5}, {"title": "Easy and convenient", "text": "Date of experience: September 01, 2024", "rating": 5}, {"title": "Buy experiencePerfect", "text": "Perfect experience ready for the next one ", "rating": 5}, {"title": "Great site", "text": "Great site. Variety of watches ", "rating": 5}, {"title": "A+++", "text": "Great communication from the seller. Outstanding product, inclusive of manufacturer warranty. ", "rating": 5}, {"title": "100% satisfaction ", "text": "Honestly, there is no app better than chrono24 for watch enthusiasts!  ", "rating": 5}, {"title": "All communication was excellent it’s my…", "text": "All communication was excellent it’s my third watch from Chrono and very happy with all dealings.😀👍🏼", "rating": 5}, {"title": "Good experience.Nice quality  and so…", "text": "Good experience.Nice quality  and so fast. ", "rating": 5}, {"title": "Its a very good website", "text": "Date of experience: October 07, 2024", "rating": 5}, {"title": "The process was super easy fast and…", "text": "The process was super easy fast and clean 🙏🙏", "rating": 5}, {"title": "good to work with", "text": "Good to work with.", "rating": 5}, {"title": "They were superb", "text": "Date of experience: October 01, 2024", "rating": 5}, {"title": "Accurate description and pictures", "text": "Accurate description and pictures. The dealers I have interacted with were responsive. For a first time users I was satisfied ", "rating": 5}, {"title": "Honest efficient product delivered as…", "text": "Honest efficient product delivered as described", "rating": 5}, {"title": "Fantastic service", "text": "Date of experience: October 01, 2024", "rating": 5}, {"title": "Great place to buy a watch", "text": "Great place to buy a watch!  Everything is handled in a very safe and informative atmosphere.", "rating": 5}, {"title": "This is the second watch that I have…", "text": "This is the second watch that I have bought from Chrono 24.  I have been extremely satisfied with the quality of offers and the service provided.", "rating": 5}, {"title": "Really good experience", "text": "Date of experience: October 07, 2024", "rating": 5}, {"title": "Great communication", "text": "Date of experience: October 01, 2024", "rating": 5}, {"title": "Very happy with my purchase", "text": "Easy check out, fast delivery, exactly as described. Very happy with my purchase. Thank you!", "rating": 5}, {"title": "100%", "text": "100%Good job!!", "rating": 5}, {"title": "Above expectations in all aspects", "text": "Above expectations in all aspects ", "rating": 5}, {"title": "Prompt delivery time", "text": "Date of experience: October 01, 2024", "rating": 5}, {"title": "you can trust the Chrono24 process and…", "text": "you can trust the Chrono24 process and the team are very responsive and professional.", "rating": 5}, {"title": "Watch acquisition thru Chrono24 - very pleased", "text": "Chrono24 allowed me to connect with an international AD with the peace of mind of their guarantee of authenticity and escrow based payment method. I received exactly what I paid for, and in a timely manner too - very happy with entire process.", "rating": 5}, {"title": "Professional matches to expectation ", "text": "That product matches what you get and that money are not released to seller before buyer accepts the purchase and quality ", "rating": 5}, {"title": "Have purchased multiple watches and…", "text": "Have purchased multiple watches and timepieces from this site. I trust them and will continue to use them.", "rating": 5}, {"title": "The best application to buy watches", "text": "The best application to buy watches ", "rating": 5}, {"title": "Perfect service and communication", "text": "Perfect service and communication. Careful administration. I fully recommend the Chrono24.", "rating": 5}, {"title": "Great experience buying my first watch…", "text": "Great experience buying my first watch via Chrono24. No problem with seller. Was kept in the loop through the whole process from order, shipping to delivery. Next watch allready in the horizon.", "rating": 5}, {"title": "Correct", "text": "Correct, quick answer, quick delivery time.Super!", "rating": 5}, {"title": "Highly recommended", "text": "Date of experience: September 30, 2024", "rating": 5}, {"title": "Smooth transaction as usual with…", "text": "Smooth transaction as usual with Chrono24", "rating": 5}, {"title": "I bought a watch from an online private…", "text": "I bought a watch from an online private seller on Chrono however he didn’t deliver the watch. Withing 2 days from my complaint to Chrono24, the money was refunded to my bank!I bought another watch instead and they were supportive and responsive to my emails", "rating": 5}, {"title": "This is my first time transacting with…", "text": "This is my first time transacting with Chrono24. To be honest, I’m in my senior years and not accustomed to selling without receiving payment upfront before sending the watch or watch parts to the buyer, as I fear the possibility of being scammed. However, Chrono24 provides excellent security measures for both buyers and sellers during the process. Kudos to them for ensuring a safe environment!", "rating": 5}, {"title": "Very happy with Chrono24", "text": "Date of experience: October 01, 2024", "rating": 5}, {"title": "Great seller!", "text": "Good communication, great product at a decent price.", "rating": 5}, {"title": "Overall great experience", "text": "Overall great experience, have made buying used or new watches online feel safer than any other place I’ve used. ", "rating": 5}, {"title": "Very Smooth Experience", "text": "Very easy communication with the seller and no hidden charges. Very easily understood descriptions and great interface for completing the purchase.", "rating": 5}, {"title": "First time buying authentic watch from…", "text": "First time buying authentic watch from Chrono 24, it’s a great experience!", "rating": 5}, {"title": "Great Website", "text": "Great platform!  I was following several watches, and really liked when a similar one was listed, I was notified.  That process gave me the ability to find the exact watch I wanted at my price point.", "rating": 5}, {"title": "Speedy delivery", "text": "Speedy delivery. Quality and authentic product. Great price.", "rating": 5}, {"title": "Very intuitive", "text": "Very intuitive, reliable and trustworthy.", "rating": 5}, {"title": "Great watch and delivery.", "text": "Date of experience: September 19, 2024", "rating": 5}, {"title": "Garmin Tactix AMOLED…SOLD!", "text": "I listed my Garmin Tactix AMOLED ($1,499.99 retail) on Craigslist and Marketplace for 90 days.I had zero interest from Craigslist and only a couple inquires on Marketplace, no offers.I listed my Garmin on Chrono24 and it was sold in 3 weeks.", "rating": 5}, {"title": "Excellent one-stop-shop for purchasing…", "text": "Excellent one-stop-shop for purchasing used watches", "rating": 5}, {"title": "Smooth and fast process", "text": "Smooth and fast process, I purchased an amazing watch, nice quality, professional seller", "rating": 5}, {"title": "The transaction was straightforward", "text": "The transaction was simple and straightforward. I was confident of both the platform and the seller, so I had no second thoughts about the purchase or it's safety/legitimacy.", "rating": 5}, {"title": "Wonderful experience", "text": "Wonderful experience aided by a good seller but it is very comforting to know the safety and security offered by Chrono24 is exceptional ", "rating": 5}, {"title": "Great Experience ", "text": "Easy to use, I got what I was looking at. Well done Chrono", "rating": 5}, {"title": "Chrono24 is truly an incredible service…", "text": "Chrono24 is truly an incredible service for those who love watches. I find myself just looking through the app all the time. When you order, you can trust that it will arrive and any issues will be taken care of quickly. ", "rating": 5}, {"title": "Thank you for your excellent service.", "text": "Date of experience: October 02, 2024", "rating": 5}, {"title": "Super well organized", "text": "Super well organized, flawless communication and status tracking ", "rating": 5}, {"title": "“Used” watch received in timely manner…", "text": "“Used” watch received in timely manner and better than described. I would certainly use Chrono 24 again. ", "rating": 5}, {"title": "Chrono 24 provides excellent oversight…", "text": "Chrono 24 provides excellent oversight and communication.  I made several purchases through Chrono24, a couple of them requiring their assistance.In one case, the item was lost in transit and Chrono24 provided assurance that I was protected the whole time.", "rating": 5}, {"title": "My watch was legit from the merchant", "text": "My watch was legit from the merchant ", "rating": 5}, {"title": "Reliable services", "text": "Reliable services ", "rating": 5}, {"title": "Seamless platform", "text": "Seamless platform, with easy access to dealers. ", "rating": 5}, {"title": "Trustfull and reliable", "text": "Trustfull and reliable. Full compliance with site information. Exceptional focus on customer satisfation.", "rating": 5}, {"title": "Safe and professional", "text": "Safe and professional ", "rating": 5}, {"title": "First class service thank you", "text": "Date of experience: October 01, 2024", "rating": 5}, {"title": "Everything went perfect", "text": "Everything went perfect. No problem.  Would use them again ", "rating": 5}, {"title": "They work as advertised with very good support.", "text": "The support through the overall process.", "rating": 5}, {"title": "Good online marketplace", "text": "Date of experience: September 30, 2024", "rating": 5}, {"title": "I like this community a lot", "text": "I like this community a lot, many people that i communicated with, including my buyer were very polite and pleasant to talk to, i like chrono 24 for good searching system that allowed my buyer to find my watch ", "rating": 5}, {"title": "Delivery faster than expected", "text": "Delivery faster than expected ", "rating": 5}, {"title": "Fast and reliable service", "text": "Fast and reliable service. Easy to use user interface", "rating": 5}, {"title": "Easy transaction", "text": "Easy transaction, got a great watch", "rating": 5}, {"title": "I'm at my second purchase via Chrono24", "text": "I'm at my second purchase via Chrono24. No issues whatsoever.", "rating": 5}, {"title": "Good experience", "text": "Good experience ", "rating": 5}, {"title": "Smooth transaction!", "text": "Smooth transaction! Easy easy to work with. I’ll be back for more for sure.Thank you so much for the great deal.", "rating": 5}, {"title": "Great service", "text": "Great service. Tons of options and dealers. Excellent service. ", "rating": 5}, {"title": "thank you super i lake", "text": "Date of experience: September 30, 2024", "rating": 5}, {"title": "Great experience ", "text": "The watch was as advertised, the seller was great to work with and delivered the watch in 2 days.I would buy from them again.", "rating": 5}, {"title": "Worry free shopping", "text": "Fast shipping, worry free process because of Chrono’s trusted name.  The watch arrived quickly in perfect condition.  The price was awesome!", "rating": 5}, {"title": "Communication and process are excellent", "text": "Date of experience: September 12, 2024", "rating": 5}, {"title": "Seamless transaction !", "text": "Seamless transaction ! ", "rating": 5}, {"title": "Easy transaction", "text": "Easy transaction. Great watch. ", "rating": 5}, {"title": "I would highly recommend Chrono 24 to…", "text": "I would highly recommend Chrono 24 to anyone who is looking for a watch, whether it be used or new. In my case, I wanted to purchase an Omega Seamaster. After setting up my Search, and the particular filters that I desired in my watch purchase; Chrono 24 did the rest. I received frequent updates on Omega Seamaster watches that became available for sale. This really made it easy comparing watches, prices and even dealers. I ultimately purchased an Omega Seamaster 75th Anniversary in Summer Blue (38mm), for an incredible price. Thank you Chrono 24. Jim Geary", "rating": 5}, {"title": "Chrono is a trustful marketplace for…", "text": "Chrono is a trustful marketplace for watches.", "rating": 5}, {"title": "everything went well", "text": "the seller was very understanding", "rating": 5}, {"title": "User friendly ", "text": "Overall cant complain ,everything on the website side of things was smooth . I was kept updated at all times. ", "rating": 5}, {"title": "Smooth and easy purchase", "text": "Smooth and easy purchase.  Easy to communicate with seller. ", "rating": 5}, {"title": "Best place to buy used watch.", "text": "Date of experience: September 23, 2024", "rating": 5}, {"title": "Highly recommended Chrono 24!", "text": "Date of experience: September 30, 2024", "rating": 5}, {"title": "Repeat Customer - Outstanding Service Again!", "text": "Chrono24 has an outstanding selection of watches from dealers all over the US (and international). The purchase process was exceptionally easy and communication went well along with the escrow process. Communication between the seller and Chrono24 appeared to go very smoothly. Shipping was flawless from the seller.This was my second purchase through Chrono24. I will be coming back again!", "rating": 5}, {"title": "Great platform", "text": "Great platform. Easy to navigate and straight forward ", "rating": 5}, {"title": "Efficient and trustworthy ", "text": "Needed a wire refund when transaction cancelled. No hiccups. ", "rating": 5}, {"title": "Fast shipping", "text": "Things went smooth, fast delivery, product as descriebed", "rating": 5}, {"title": "A Watch that perfectly corresponds to…", "text": "A Watch that perfectly corresponds to the description. Serious company.", "rating": 5}, {"title": "All my purchases have been exactly as…", "text": "All my purchases have been exactly as presented. All pieces are authenticated and Chronos24 makes the experience an easy one with plenty of options for you to find the piece you are looking for. ", "rating": 5}, {"title": "Reliable website", "text": "Facilitating dialogue with sellers eases the purchase process and strengthens customer confidence", "rating": 5}, {"title": "Trustworthy sellers and a smooth experience. ", "text": "Not the cheapest site to buy watches, but you do have a good degree of safety to cover you. ", "rating": 5}, {"title": "Completed my second watch purchase", "text": "Completed my second watch purchase.  Both were excellent experiences.  Recommended.  ", "rating": 5}, {"title": "Excellent communication with both…", "text": "Excellent communication with both Chrono 24 & the dealer with expedient, accurate responses to all questions prior, during, & after the sale!", "rating": 5}, {"title": "Great service", "text": "Great service. Very satisfied.", "rating": 5}, {"title": "Buying a Kronos is a piece of mine…", "text": "Buying a Kronos is a piece of mine because you have 14 days to check if the piece is realAnd I know the piece when you buy it supposed to be real, but those 14 days. Is a piece of mind for me. That's why I buy a Chronos.", "rating": 5}, {"title": "Positive Experiences", "text": "All of my dealings on Chrono24 have been positive and I continue to use the platform and services", "rating": 5}, {"title": "Repeat shopper", "text": "I was able to purchase the watch I wanted at a fair price. I received updates during the process. This was my second watch purchase with Chrono24, and I have recommended them to others.", "rating": 5}, {"title": "You can trust Chrono24", "text": "You can trust Chrono24, I got fully refund before, then I purchased another watch, everything's smooth.", "rating": 5}, {"title": "All was great … The follow up and…", "text": "All was great … The follow up and everything else …", "rating": 5}, {"title": "Easy and fast", "text": "Date of experience: September 30, 2024", "rating": 5}, {"title": "Easy buy", "text": "Easy buy. Feels safe purchasing. Reliable dealer", "rating": 5}, {"title": "Almost all of my watches were ordered…", "text": "Almost all of my watches were ordered from Chrono24!Fully recommend!", "rating": 5}, {"title": "You are my go to place", "text": "You are my go to place when looking for a quality watch", "rating": 5}, {"title": "Very easy to find what you want", "text": "Very easy to find what you want, find reputable dealers, with VAST selections ", "rating": 5}, {"title": "My first time using Chrono site had a…", "text": "My first time using Chrono site had a good experience.   ", "rating": 5}, {"title": "Great experience all around", "text": "Great experience all around. The transaction, the delivery and the watch was even better than advertised. ", "rating": 5}, {"title": "Super happy with my Chrono24 purchase", "text": "This is not the first time I've used Chrono24 for a watch purchase & it won't be the last time either. They make it easy to purchase & you know that you have piece of mind making the purchase. Point to learn (for me) don't try to bring an expensive watch into Australia when the leather band is genuine crocodile 'cause it costs heaps more, sad, as Oz is a leading world wide exporter of the same!", "rating": 5}, {"title": "Highly recommend Chrono24", "text": "The transaction was flawlessly quick, safe and secure. Chrono24 offers a means to find, transact and receive any watch of your choice through a safe environment. Just remember the import costs, taxes etc, which are completely beyond the control of Chrono24.", "rating": 5}, {"title": "Easy", "text": "Easy, seamless buying experience", "rating": 5}, {"title": "Amazing experience", "text": "Amazing experience ", "rating": 5}, {"title": "Trusted company", "text": "Fast delivery and perfect as in picture", "rating": 5}, {"title": "Best selection and trusted site to buy…", "text": "Best selection and trusted site to buy a luxury watch.", "rating": 5}, {"title": "Excellent Experience", "text": "Excellent Experience! If you are looking for an Authentic luxury timepiece, this is the place to go. Completely Safe and Secure. No Funny Business! I will only buy from this dealer in the future. Many thanks for an amazing experience! ", "rating": 5}, {"title": "Easy shopping experiencr", "text": "Product was as described and pictured. Purchasing was simple and quick. Highly recommend. Very satisfied shopping experience. ", "rating": 5}, {"title": "A totally different experience from other marketplaces ", "text": "Most of my watches off of chrono24 have been with reputable Japanese and US dealers and have been excellent. The prices are better than eBay and there is no “international shipping hub” which has “lost” (read: stolen) both a high end camera and a rare watch that was difficult to replace. In short, chrono24 is a refreshing marketplace. I hope they venture into other areas like high end vintage lenses and cameras.", "rating": 5}, {"title": "Best and most trusted site to purchase…", "text": "Best and most trusted site to purchase a watch, period. ", "rating": 5}, {"title": "Trustworthy", "text": "Date of experience: September 13, 2024", "rating": 5}, {"title": "So far the only reliable site", "text": "Date of experience: September 18, 2024", "rating": 5}, {"title": " seemless", "text": "As usual a seemless, trouble free transaction.", "rating": 5}, {"title": "Great watch at a great price", "text": "Received a great watch at a great price. Chrono24 had great selection.The communication with both Chrono24 and the dealer was timely and professional. Would definitely use Chrono 24 again.Thank you.", "rating": 5}, {"title": "It made me easy to select the watch I…", "text": "It made me easy to select the watch I wanted thru a lot of selections of watches. Honest input of the dealers and private seller of the advertised watches is a plus for a buyer like me", "rating": 5}, {"title": "Excellent communication.", "text": "Excellent communication. ", "rating": 5}, {"title": "Love the app and the seller sent out package very carefully wrapped ", "text": "Really like the app and the seller I bought the watch from did not leave out any details ", "rating": 5}, {"title": "As always with Chrono 24", "text": "As always with Chrono 24, Easy breezy and flawless.  ", "rating": 5}, {"title": "Chrono is amazing", "text": "Chrono is amazing. Very large selection and very nice service. ", "rating": 5}, {"title": "I bought an Omega watch", "text": "I bought an Omega watch. It was exactly as described in pristine condition for a good price. It shipped fast. And it’s reassuring to know it’s certified authentic with Chrono24. ", "rating": 5}, {"title": "Great experience", "text": "Date of experience: September 20, 2024", "rating": 5}, {"title": "Evrithing was great", "text": "Date of experience: September 26, 2024", "rating": 5}, {"title": "I stumbled across this site and I’m…", "text": "I stumbled across this site and I’m glad I did too many watches to look through for one that you like. I like them all very easy to deal with the dealer. He was very helpful. Kept me informed that the transport will definitely be using this site again, kind regards, Paul", "rating": 5}, {"title": "Excellent communication and all around…", "text": "Excellent communication and all around service", "rating": 5}, {"title": "Title: Excellent Platform for Buying and Negotiating Prices", "text": "I've had a fantastic experience selling my watch on Chrono24. The platform is not only user-friendly, but the best part is the ability to negotiate both the price and the shipping costs with potential buyers. This flexibility really sets Chrono24 apart, allowing for smoother transactions and satisfied customers on both sides. I highly recommend using Chrono24 for anyone looking to buy or sell luxury watches.Hamza Nisar", "rating": 5}, {"title": "Outstanding service and communication", "text": "Outstanding service and communication, watch arrived in super quick time in perfect condition, highly reccomended!", "rating": 5}, {"title": "Website was great and well put…", "text": "Website was great and well put together. Loads of selections. My purchase with them was very smooth.", "rating": 5}, {"title": "The purchase and shipping process was…", "text": "The purchase and shipping process was very easy. It's the second time i've used Chrono 24 and will definitely do so in the future.", "rating": 5}, {"title": "Perfect", "text": "transaction was easy and smooth. ", "rating": 5}, {"title": "Great company and great watches", "text": "Great company and great watches ", "rating": 5}, {"title": "Great experience", "text": "Trusted, all as described ", "rating": 5}, {"title": "Super", "text": "A good and safe experience. ", "rating": 5}, {"title": "The ease in locating what I wanted.", "text": "The ease in locating what I wanted and the veriety of the selection made my experience with Chrono24 great.", "rating": 5}, {"title": "Rolex perpetual 41 green purchase", "text": "Correct and punctual delivery. The watch arrived in perfect condition.", "rating": 5}, {"title": "Secure online interface for selling…", "text": "Secure online interface for selling watches. Their customer service is very fair!", "rating": 5}, {"title": "Easy to shop", "text": "Easy to shop, many good choices with good details and friendly service ", "rating": 5}, {"title": "Great place to buy your next timepiece!", "text": "Date of experience: September 17, 2024", "rating": 5}, {"title": "Chrono24 was the only place where I…", "text": "Chrono24 was the only place where I could find the watch I was looking for in Europe. It’s awesome that you can buy something from a reputable seller in another country and get it shipped within a week or two. Very satisfied!", "rating": 5}, {"title": "Great experience!", "text": "Great experience! I bought from professional seller!", "rating": 5}, {"title": "Good communication", "text": "Good communication. Would recommend ", "rating": 5}, {"title": "Chrono24 are great to deal with", "text": "Chrono24 are great to deal with, very safe and secure. I made a call into the contact centre and had a really good experience. Well done Chrono24 Frank C", "rating": 5}, {"title": "Very professional", "text": "Very professional,  trustworthy and easy", "rating": 5}, {"title": "Great platform", "text": "Great platform, well presented and great protection for sellers and buyers. The only online site to buy expensive watches ", "rating": 5}, {"title": "Trusted and reliable ", "text": "Authentic and east to use", "rating": 5}, {"title": "Great service", "text": "Date of experience: September 10, 2024", "rating": 5}, {"title": "Everything was very easy", "text": "Everything was very easy, easy to communicate and was so clear. ", "rating": 5}, {"title": "Hell yeah brother", "text": "Very prompt with everything from source, dealer notification, payment review, shipping", "rating": 5}]