[{"title": "Ryan and his team", "text": "Ryan and his team are extremely helpful and friendly.  They are very professional and great to work with.  Ryan did a fantastic job,  he has a wonderful personality,  we spoke with him almost on a daily basis.  ", "rating": 5}, {"title": "Our experience NewDay USA were very…", "text": "Our experience NewDay USA were very professional and quick. Mr. Matthew did not hesitate to keep me informed about every step of the process to complete my  loan application. Even after closing he called me to thank me for allowing NewDay USA to us service. I am very thankful NewDay USA for their helping us to breath again. ", "rating": 5}, {"title": "The entire process from start to finish…", "text": "The entire process from start to finish was clear, clean, concise well explained and very efficient, especially was impressed with the communications that was set up. Not one day went by other than Sundays that our loan officer did not contact us to keep us up-to-date with what was going on.", "rating": 5}, {"title": "Brandon was excellent to work with", "text": "Brandon was excellent to work with. He was communicative, always available and right in the process with us. We so appreciated his support, kindness, care and professionalism through the entire refinancing process. He helped us get equity out of our home so that we could get our debts paid down and do much needed renovations. Phew! Thank you Brandon!!!", "rating": 5}, {"title": "Joshua was very open and answered all…", "text": "Joshua was very open and answered all our questions.  He kept us updated as to where we were in the process.  He is an excellent representative for NewDay.The process itself was very smooth.  Everything happened in a timely manner.  We are really happy with the results we’ve gotten.Thank you NewDay for affording us this opportunity.  It will make our lives so much better.", "rating": 5}, {"title": "I am very pleased with Brandon he…", "text": "I am very pleased with Brandon he worked very hard to help me with the loan process and I really appreciate all his efforts to do so.  Brandon is great he will go over and above to help his clients.  Thank you Brandon, continue the great work you do to help Veterans and their families.", "rating": 5}, {"title": "Brandon was great to work with", "text": "Brandon was great to work with! He was extremely knowledgable and helpful during the whole process. He answered any questions we had along the way instantly! I would absolutely recommend him to anyone looking to do a cash out refinance or even for someone to call inquiring about one. ", "rating": 5}, {"title": "what made my experience great was the…", "text": "what made my experience great was the fact that someone was thinking enough to help a Veteran in need was most gratifying  to me.", "rating": 5}, {"title": "Colson Buscher is a rock star", "text": "Colson Buscher is a rock star. He politely guided me through the whole experience very calmly and lucidly. Responded quickly and patiently to all my questions. It was a pleasure working with him. ", "rating": 5}, {"title": "I really appreciate that Mr.J Denson…", "text": "I really appreciate that Mr.J Denson was that person who help me and family and was very detailed understanding and very knowledgeable. ", "rating": 5}, {"title": "I can’t say enough about the…", "text": "I can’t say enough about the outstanding service I received from Colin G. Schotter at New Day. My refinance loan had many challenges along the way, but Colin handled each hurdle with professionalism, patience, and expertise. He went above and beyond to ensure that every detail was taken care of and kept me informed throughout the entire process. His dedication to helping me achieve my goal was truly impressive. Thanks to Colin, my refinance loan was approved, and I couldn't be happier with the outcome. If you're looking for someone who genuinely cares about your financial goals and will work tirelessly on your behalf, Colin is your go-to person!", "rating": 5}, {"title": "I was Hesitant to go through this…", "text": "I was Hesitant to go through this process, however, Mr. Malone made the whole process very simple and easy for Me and my Wife.  We are truly grateful for all of his help in getting us the funding we need to take care of things.  Truly an amazing experience.  Mr. Malone was not only friendly and easy to speak with-he was also very professional and answered all of our questions through emails within a timely manner.  Could not have asked for anything better, again we are very thankful for not only Mr. Michael Malone, but the whole New Day Team.  Thanks.", "rating": 5}, {"title": "That the new day USA employees will take care of you", "text": "New day USA has given me the opportunity to pay off all my debt and be completely debt-free. I am so thankful to Newday USA for doing that. I will now be able to live stress-free and not worry about debt anymore, and I will never ever get myself back in that situation ever again", "rating": 5}, {"title": "NewDay", "text": "Our agent, Justin, was friendly, polite, and very well informed. He kept us informed on every detail of the progress. The entire process was incredibly thorough and fast. We now have a fixed rate mortgage that fits our budget. I would certainly recommend NewDay. ", "rating": 5}, {"title": "Great knowledge of realstate patients…", "text": "Great knowledge of realstate patients with customers and great service over all ,definte referr people to do business with your business.", "rating": 5}, {"title": "Mr. Dan Shea", "text": "Mr. Dan Shea helped us with our refinance. He was professional and pleasant to work with. He kept us updated on every document we needed and expedited our closing date. ", "rating": 5}, {"title": "NEW DAY THE BEST WAY TO GO FOR A VETERANS HOME LOWN", "text": "NEW DAY IS THE BEST TREATED ME LIKE FAMILY ÀND SO PROFESSIONAL  THANK YOU NEW DAY ", "rating": 5}, {"title": "My refinance with New Day. was smooth…", "text": "My refinance with New Day was smooth and Bredan helped with everything and quick to respond on issues, highly recommended to other Veterans.TY", "rating": 5}, {"title": "Colin made the process easy and simple", "text": "Colin made the process easy and simple. He was very patient with our questions and walking us through steps necessary. Great experience! ", "rating": 5}, {"title": "Gabby Garza made this whole process…", "text": "Gabby Garza made this whole process very easy for us. ", "rating": 5}, {"title": "A Satisfied Customer ", "text": "I was thoroughly impressed and satisfied with the results of my experience with Brandon. He was very responsive and helpful to all of my concerns. Would definitely recommend him and New Day USA. ", "rating": 5}, {"title": "My Account Exec", "text": "My Account Exec, Joe Delgado, was very responsive and really cared about getting me refinanced in such a way as to meet my goals.", "rating": 5}, {"title": "Nathan Valdez was honest with me about…", "text": "Nathan Valdez was honest with me about the loan application process. He worked with me to get the most money possible. Nathan was honest, extremely helpful and most of all genuine. He earned my trust and respect several times over throughout the entire loan process.New day made the entire process smooth and hassle free.Nathan and New Day were overall excellent and I highly recommend them to all of my veteran brothers and sisters.Thank you Nathan Valdez for your help and support.", "rating": 5}, {"title": "This experience has been very smooth…", "text": "This experience has been very smooth and fast. Very cordial and always answering all our questions.  The whole experience was a breeze. We would thank you for everything.  Highly recommend them. The whole process was easy and fast. Thank you.", "rating": 5}, {"title": "Isabelle Clark has the patience of a…", "text": "Isabelle Clark has the patience of a saint! She was so helpful with all of our questions and walked us through every step. I look forward to working with her as we continue to make decisions about our home refinance loan. Thank you, Isabelle!!", "rating": 5}, {"title": "Another Successful Experience", "text": "I had another good experience with my IRRRL with New Day USA. Within a short time, we closed and I obtained my proceeds. I worked with some very good and customer-focused staff. The communicated throughout the process. I highly recommend them for all aspects of your mortgage needs.", "rating": 5}, {"title": "Brandon was amazing in helping me…", "text": "Brandon was amazing in helping me process the loan from start to finish in record time. I was amazed of his diligence to assure a successful loan process. I was very comfortable through the whole process and I thank Brandon for all his help. My financial future looks very bright. Thanks again", "rating": 5}, {"title": "Opportunity for better living.", "text": "this is the second time I've worked with New Day USA and it wont be my last.  NDUSA came to me and was so beneficial to me it was a no brainier.  They helped me get rid of 99% of my debit and generated more cash for me. Yes I still have a mortgage,but I am 100% better off then I was before they helped me. I'll always be thankfully for that first call from them almost 2 years ago. Thanks again NDUSA.", "rating": 5}, {"title": "Fast", "text": "Fast, accurate and timely help.  Your staff always returned my calls and answered all my questions.  ", "rating": 5}, {"title": "The New Day USA Team went above and…", "text": "The New Day USA Team went above and beyond their duties. When the home appraisal came in below our estimate, it wasn't going to make good financial sense for our family to refinance. That's when the Vice President, Mr. Craig Burris, got personally involved and was able to make it work financially. Great job Team, really embodying Mr. Lynch's motto of doing everything within the team's power to make it work for the veterans. Cisco P.CPT, US Army (RET)", "rating": 5}, {"title": "It's a New Day in the USA for me…", "text": "It's a New Day in the USA for me because buy using NEW Day in the US service, every day is new for me. It would take years to accomplished what they did for me. Thank You!", "rating": 5}, {"title": "Nick Barth was great to work with and…", "text": "Nick Barth was great to work with and helped me make a good decision.", "rating": 5}, {"title": " Thank you from a grateful Veteran", "text": "Chris Hamilton my contact at New Day was super helpful in every phase of purchasing my home. I am so grateful for his help and the new day team for making this a successful and enjoyable experience. My thanks to Admiral Lynch for putting veterans first and leading from the front! I have nothing but good things to say about New Day and will be telling all my veteran friends about what happened to me. Thank you for everything!", "rating": 5}, {"title": "as very…", "text": "Our loan representative was very helpful and kept us informed every step of the process ", "rating": 5}, {"title": "Satisified Veteran!", "text": "The entire process from the initial phone call to actual closing the loan was very efficient and professional. My personal goals for the refinance were acknowledged and met. Everyone involved in the process treated me with the utmost courtesy and respect. It was truly a pleasure working with NewDay USA.Special thanks to Joseph Delgado​​​​!", "rating": 5}, {"title": "Professional and easy from start to finish.", "text": "From start to finish the process was done with great ease and top professionalism. I will do business again with NewDay USA.", "rating": 5}, {"title": "Philip Lieberman was great and very…", "text": "Philip Lieberman was great and very helpful.  I appreciate all that was done.", "rating": 5}, {"title": "God bless Ryan Elliot", "text": "It is with a grateful heart that I thank my account executive Ryan Elliott.  From the moment I spoke with him on the phone, he went right to work on my behalf.  Ryan's timely help, professional demeanor, attention to detail, knowledge of procedures helped me to follow his instructions and secure my loan.  Ryans Elliot and New Day has given me a fresh new perspective.   I will share my experience with other veterans.  Thank you for trusting me.    ", "rating": 5}, {"title": "I'm sorry that I don't have the time to…", "text": "I'm sorry that I don't have the time to do this properly; but.....Now hear this!!!! Everybody I worked with during the purchase of our new residence.....Busted Their Rearends!!!!! I could not be more pleased!!!Special thanks to Mitchell Sinicropi!!! Great Job!!!!!!", "rating": 5}, {"title": "It was easy and quick", "text": "It was easy and quick, and the representative was very helpful and answered all my questions I would refinance with you again if needed", "rating": 5}, {"title": "It was absolutely a pain free process", "text": "It was absolutely a pain free process! All of our questions and concerns were addressed. We were in a terrible financial mess! They literally saved our future!  Ryan Christopher Elliott is wonderful to work with and deserves a raise/promotion! Thank you, Ryan!! Thank you New Day for helping hardworking veterans like me.", "rating": 5}, {"title": "New Day USA Experience", "text": "Everything that was advertised was accurate and completely workable. The help we received from Kenny was the best. He kept us abreast of the process and was always available and very accurate. Thank you for all your tremendous help.", "rating": 5}, {"title": "My loan officer Andrew Nelson was on…", "text": "My loan officer Andrew Nelson was on top of every thing and I was able to close in 30 days.  Trouble free process.", "rating": 5}, {"title": "Nigel was amazing", "text": "Nigel was amazing! We are so pleased with our experience with NewDay. Nigel went above and beyond to make our experience great, and the refinance process smooth and seamless. We had unfettered access to him through phone, text and email. We would highly recommend NewDay and their professional and courteous staff. Thank you Newday!", "rating": 5}, {"title": "Best Decision!!", "text": "Using New Day USA for our cash out refinance was the best decision! Cody Dennis was excellent to work with. He let us know everything going on, he would call and inform us at least every other day and ask if we needed anything. Our closing was quick and painless! ", "rating": 5}, {"title": "We HIGHLY recommend New Day for home buying services! ", "text": "We had a wonderful experience with Stuart and his team during the whole process of buying our home! He was professional from start to finish and always responded in a time manner. There were a few things that came up during the process that required clarification but there are so many moving parts in this type of process that I feel it’s hard to avoid. However, they worked hard on their end to make sure we closed same day as mentioned when we started the process. I would highly suggest New Day to anyone who is looking to purchase a home without a doubt! ", "rating": 5}, {"title": "From the very first contact I had with…", "text": "From the very first contact I had with Nathan, he was a true professional. He explained everything in detail and continued to do so throughout the entire refinancing process. He was always a phone call, text or email away and always replied very quickly to any question we had. He would always reach out to keep us updated and informed of how our case was going. We congratulate you for having such a very professional and helpful person as part of your staff. Kudos to Nathan! He worked with us thru the entire month of August 2024.", "rating": 5}, {"title": "Assume Agent", "text": "Our loan agent is Mr. Thiago P Cruz who was very knowledgeable, respectful, and frank about the entire process. The loan went through quickly and we were informed about what to expect next with every step in the loan. Great job Thiago.", "rating": 5}, {"title": "Jordan Ferguson was there every step of…", "text": "Jordan Ferguson was there every step of the way. He explained everything fully and clearly. The process from start to finish took less than three weeks. He have us our complete options up front so that my wife and I could make the best financial decision for us. He was patient and kind throughout every step, kept us in the loop on target wait times, and explained each requirement that was requested via the VA loan process. I would recommend any part of NewDay USA to all veterans but especially Jordan.  ", "rating": 5}, {"title": "Was a great time we spent with Brandon…", "text": "Was a great time we spent with Brandon he answered every question that we had and I had a lot always answered the phone when we needed him was always calling us back for updates how everything was going I know this was the first experience that I’ve had to do all the paperwork and getting everything situated for Brandon to use was a good experience. I wouldn’t trade it for nothing. Brandon was very helpful on letting us know what we needed to get when we needed to get it how to get it he would help us get it very very good person to work with very respectful. Talk to us in a respectful manner always said yes, sir no sir yes ma’am I was so pleased. I’m glad we still have good people out there that we can deal with and I want to thank Brandon so much he helped us a whole lot. Thank you Brandon. ", "rating": 5}, {"title": "My rep kept me informed throughout the…", "text": "My rep kept me informed throughout the process and was very helpful.", "rating": 5}, {"title": "great experience", "text": "fast. good, helpful and professional team.It took only 14 days from application to closing. was sAfter a months long failed process with another company, working with NewDay was such a pleasure.", "rating": 5}, {"title": "I don't know why I waited, ", "text": "From the first phone call with Bryan, it was awesome, putting together our Home Refinance. He walked us through each step better than a military Drill Sergeant lol! If they would ask us to do a commercial we would! Actually Client and loving New Day USA!", "rating": 5}, {"title": "Richie Cruz was very helpful through…", "text": "Richie Cruz was very helpful through the process of securing the refy for my wife and I. This allowed us to use our equity to pay off all but one debt. The signing of legal documents was accomplished quickly at our home by a notary. All in all it was a good experience for us. The only drawback was the hundreds of calls we had to endure for a week or two.Major Dennis C. Ewert, USAF retired.", "rating": 5}, {"title": "Gabe has been very professional and…", "text": "Gabe has been very professional and went above and beyond to help me. I will highly recommend him to my friends. Great job!!!", "rating": 5}, {"title": "I cannot recommend NewDay and Nigel enough", "text": "I cannot recommend NewDay enough.  Mostly it was because of Nigel, but it was such an easy and stress free endeavor.  Nigel explained everything, responded to every question, guided me through the process and was straightforward....all real, no chaser!  I didn't even think it would be a fast process, but from beginning to end, it was easy.  Thanks NewDay and Nigel.", "rating": 5}, {"title": "The entire process was thoughtfully and…", "text": "The entire process was thoughtfully and professionally administered. All procedures were explained and any questions were promptly addressed and all necessary actions were taken.Thank you to Antonio for make this as painless as possible!", "rating": 5}, {"title": "New Day... New beginning!", "text": "Our agent was amazing and put up with a lot with me constantly texting him for updates. He made us feel very at ease during the process", "rating": 5}, {"title": "they were very open and honest", "text": "they were very open and honest, and answered all my questions. I can only hope other veterans can find newday and help their needs. I look forward in working with newday in the future for my personal needs.  ", "rating": 5}, {"title": "Thiago P Cruz", "text": "We were served through Mr. Thiago P. Cruz. He was upfront and really on the ball. Had everything spelled out clearly in e-mail correspondence. Overall, this was a smooth and fast experience. Now we can breathe a sigh of relief. ", "rating": 5}, {"title": "Just make the call and everything is done for you.  No cost out of their pockets.  Best deal going.", "text": "This was the simplest Morgage application I've ever done.  Cody did everything for us and no question was too stupid or outlandish.  All contractors came to us and were very professional and on time.  This is rare in the work world today.  Thank you for your team, Admiral.    ", "rating": 5}, {"title": "Very helpful and squared away", "text": "Very helpful and squared away ", "rating": 5}, {"title": "My point of contact Ryan Cuthery kept…", "text": "My point of contact Ryan Cuthery kept me in the loop the whole time, the person filling in for him did a great job in his absence. They me informed me of any changes during the process. Signing the e docs was easy and the lawyer that came to my house for me to sign the closing paperwork was very helpful. Job well done 👍", "rating": 5}, {"title": "Amazing customer service", "text": "Amazing customer service. Highly recommend for any Veterans wanting to liquidate high interest loans to Cary you through tough times. Amazing company with you in mind.  Thank you so much for helping me with all my financial issues. Much Appreciated Jon Helberg USN", "rating": 5}, {"title": "Great Experience ", "text": "I had a great experience with Dylan at New Day. He explained every step of the process thoroughly and always took time to answer my questions. He provided options for a program I should be eligible for in the future that will lower my interest rate. I feel the process went very smoothly. Dylan was very professional, an I had confidence in him the entire time. ", "rating": 5}, {"title": "Brandon Liebfred is exceptional from beginning and even after closing; consummate professional!", "text": "Brandon Liebfred represented New Day in the most professional way possible. In this economy, my skepticism was at an all time high. He put me at ease and offered terms and conditions tailor made for my family’s financial well being. I highly recommend the company and Brandon for all of your mortgage needs.", "rating": 5}, {"title": "My agent Spencer was super fantastic", "text": "My agent Spencer was super fantastic. He kept me very well informed about the loan. The process was clear from the time I applied until finish. Thank you very much. Pat", "rating": 5}, {"title": "This is the easiest refyi I have ever done", "text": "This is the easiest refyi I have ever done. We had an excellent account executive Kenny Liang. He was a big help. the whole process was so easy. We closed in less than a month.", "rating": 5}, {"title": "Gabrielle Garza was a wonderful person…", "text": "Gabrielle Garza was a wonderful person to work with. She was very professional, answered all my questions and kept me informed every step of the way.", "rating": 5}, {"title": "We have worked with Newday USA on two…", "text": "We have worked with Newday USA on two separate occasions. Both times the process was seamless and very quick. Everyone that we worked with was stellar!!! Thank you Newday USA for all you do for the Veterans!We will definitely share our experience with other Veterans. Thanks again for everything!!", "rating": 5}, {"title": "Tristan James Grimes​​​​ was very…", "text": "Tristan James Grimes​​​​ was very helpful getting my loan approved.  ", "rating": 5}, {"title": "Your personal we very helpful and…", "text": "Your personal we very helpful and courteous.  They answered every question ve had and they did not disappoint us.  Andrew Berry was very professional and new exactly what we needed to do to get the loan. Thank you.", "rating": 5}, {"title": "TEAMWORK AND FAMILY ", "text": "My husband and I are happy to give details about our experience with NEW DAY USA VA.! We did a refinance on our condo. We had a VA LOAN THROUGH OUR BANK SINCE 2019. We started our journey with Phillip Liberman and so glad we did. I am a retired CPA and I keep pretty good records. Everything Phil needed I made sure I got it right away. He always got back to me with any questions or concerns I had. It was easier than it would have been dealing with a local company. He worked on getting information for me and the disbursement team. We closed and it was a holiday weekend which changed things a little but everything came together as he said it would the Tuesday after Labor Day. We would  recommend NEW DAY USA VA. God Bless Thanks 🙏.", "rating": 5}, {"title": "This is the second mortgage I have used…", "text": "This is the second mortgage I have used from New Day; refi and home mortgage. Professionalism from associates into notch. Quick and thorough results that provides ease for the customer. I have already informed my son (a Vet) to use in the future. Thanks for the seamless and stress free experience!", "rating": 5}, {"title": "Excellent Service and Understanding", "text": "From day one, my loan officer Sam Elmaani, was extremely knowledgeable, polite and understanding of my needs and my nervousness! His advises were correct and on timely manor, a true professional!!!  He stayed on top of the loan process and I trusted him for everything I needed.The policy of the NewDay USA and the procedures, has been unparalleled  to any others i knew so far. I have been a business professional working with different banking institutions for 36 years!! NEWDAY USA is the best!!!!I am very grateful, my future looks sunny and promising!!THANK YOU Sam and NewDay Usa.", "rating": 5}, {"title": "The process was smooth and quick.", "text": "What made my experience great with New Day USA was the ease in which the process went. Mr. Cruz explained everything from start to finish, calling daily to make sure I was up to speed on everything and asked if I had any questions.", "rating": 5}, {"title": "2024 ReFi", "text": "Julian Zivkovic was an outstanding loan agent. He made sure all the information was submitted on time and complete. In my past life I was a Captain in the US Army. I wish I had men like Julian to help complete my missions while in Vietnam.  Back in the world I lead 24 sales reps Nationwide for a sporting goods company, and none compared to Julian. I am certain we would not have qualified for the loan without Julian.Thank You Admiral", "rating": 5}, {"title": "The integrity of New Day USA", "text": "The integrity of the person handling my case Mr Nicholas Barth was very professional and courteous! And he took the time to explain things in very meaningful manner! I will give two thumbs up to a job very well done! And I would recommend NewDay USA to all my friends and family, and to anyone looking to purchase or refinance a home! way to go keep up the outstanding work!", "rating": 5}, {"title": "At no time did we feel we were alone…", "text": "At no time did we feel we were alone through out this process.  Our Newsday USA representative,  Colson Busher, kept us on track and guided us through out the steps of required documentation.  He also provided guidance and encouragement as we proceeded.  He was a great representative of the company.  All calls are recorded,  so everything I have stated can be verified. This company truly has the veterans welfare as their main goal. Their commercials are actually true and factual. I can't say enough great things about this company, they made it possible  for me to stay in my home. Thank you and God bless you all for your dedication to helping Veterans. Tom Vasek", "rating": 5}, {"title": "Mr Escobar was great from start to…", "text": "Mr Escobar was great from start to finish. Very attention to detail and always thinking ahead. Mr Escobar is truly a professional in his field of housing financing. May I say it truly shows that he cares about his clients that he is charged to take care of through this process. ", "rating": 5}, {"title": "Ryan Elliott was great throughout this…", "text": "Ryan Elliott was great throughout this process. He did everything needed quickly and was able to close my loan in no time!  Thanks Ryan!", "rating": 5}, {"title": "My wife and I appreciated the level of…", "text": "My wife and I appreciated the level of care that NewDay USA showed to guide us through our cash out refi. Our MLO, Lionel was very knowledgeable & was supportive throughout the process. Highly recommend to my fellow veterans to trust the distinctive approach that NewDay USA brings!!! ", "rating": 5}, {"title": "Everything from start to finish!", "text": "Everything from start to finish, it went so smooth.", "rating": 5}, {"title": "The service was great!The agent kept me…", "text": "The service was great!The agent kept me inform on everything that he was doing,the process was fast and very easy.Glad I used NewDay USA I'll use it again if I could..", "rating": 5}, {"title": "New day associates", "text": "I love working with the people on all the people that are on your staff are great services good it's not very hard to work with people and to get what you need", "rating": 5}, {"title": "Everything went as smooth as always", "text": "Everything went as smooth as always. The staff are so friendly and professional to make sure they work every aspect to do what’s best for you.", "rating": 5}, {"title": "JOB WELL DONE", "text": "We were not in a rush to compete the task. We wanted it to be done correct and with no large delays. Our assigned agent, Colson Busher, filled that need. We had no doubt Colson was ON-THE-JOB.  ", "rating": 5}, {"title": "Veterans have a Mortgage partner they can trust", "text": "The ease of usage.  The timely notifications.  Did not have to worry whether or not I forgot anything - everything was done for me.", "rating": 5}, {"title": "Excellent service ", "text": "Received excellent service, thank you New Day USA", "rating": 5}, {"title": "Gabby was very informative", "text": "Gabby was very informative, kept me appraised of what was happening. She did not mind answering questions when my wife or I did not understand something or repeating something if we did not catch everything the first time.", "rating": 5}, {"title": "The only thing that I can say about the…", "text": "The only thing that I can say about the Newday experience , is that it was very pleasant.  This was an easy accomplishment to refinance and the process was made easy.  There wa no stress involved.  This was due to the individual that I was working with.  He constantly called to give me feedback and kept me informed  as to how the items were processing.  I never had anyone from a company constantly calling and informing me as to how thing were going.  Even after all was processed he called to check to see if we were satisfied.  I have nothing but positive things to say about the company and individuals associated with it.", "rating": 5}, {"title": "I appreciate the opportunity to express…", "text": "I appreciate the opportunity to express my view of NewDay USA;The speed of which I was able to complete my loan was EXCEPTIONAL.  My initial contact with NewDay on 16 July 2024, put me in contact with Mr. Lionel A. Marshall, Personal Account Executive.  Lionel assured me that he would be with me throughout the process and that he would ensure a smooth process.  HE DELIVERD, I signed my documents on 3 August 2024.  Each required action taken by NewDay USA was scheduled and completed in a timely manner consistent with Lionel’s word.  I joked with Lionel and asked him if he threw a bucket of grease out in front because everything and I mean everything went as smooth as it could have possibly gone (without exception).   I am confident that NewDay USA commercials have been seen by many of my brother and sister veterans and to you I will say BELIEVE THEM, they are here for us, and they deliver.  LIONEL A. MARSHALL: SIR YOU REPRESENT YOUR COMPANY EXTREMELY WELL.", "rating": 5}, {"title": "Andrew Marin was very professional", "text": "Andrew Marin was very professional and on top of everything needed throughout the whole process.  The entire experience was very good.  I would recommend NewDay USA to all veterans interested in buying or refiancing a home.  They will definitely treat you fair.", "rating": 5}, {"title": "Both Ben Taylor and Julian Zivkovic are…", "text": "Both Ben Taylor and Julian Zivkovic are excellent !  Neither of them seemed to tire of my endless questions. The entire process was open and transparent and honestly took less time than I had imagined. ", "rating": 5}, {"title": "We are very please with approval our…", "text": "We are very please with approval our loan Ryan was so helpful  if we  had any questions he  was there to help and quite us . Ryan is a great. Asset to your company Thank you for help it is appreciated many good blessing", "rating": 5}, {"title": "Devan Hopkins was straight forward", "text": " Devan Hopkins was straight forward, he made every effort to help us in the process. ", "rating": 5}, {"title": "\"Help is out there\"", "text": "Your Representative was Great.. He was knowledgeable about your product and he explained what was needed for the process and why he needed the information. That made the whole process more understandable and more conforable for the Veteran", "rating": 5}, {"title": "The professional and courtesy of…NewDay and Mr Strickland. ", "text": "The professional and courtesy of everyone that I have dealt with on this refinancing experience. They kept me informed on every step of the process.  Everything was explained to me in a professional manner and all my questions we answered very professional also. I would recommend this company or agent to everyone. I really appreciate Mr  Strickland on his outstanding performance and  performance in keep me well informed,  and completing my refinance in a record time. If I ever need to do this again NewDay is who I would  choose. ", "rating": 5}, {"title": "From beginning to end Joe helped me…", "text": "From beginning to end Joe helped me pull together all paperwork that was needed.  I have a disability that sometimes make me confused and slow to understand, but Joe was very patient with me ", "rating": 5}, {"title": "Ms Kimberly DeCourley ", "text": "Mr. Barth made it all so easy.  I bearly had to do anything. Great organization.  ", "rating": 5}, {"title": "David was great to work with", "text": "David was great to work with! He wasn't just our loan officer but advised us on making wise financial decisions. He really made a stressful situation go smoothly. Thanks again for all your help!", "rating": 5}, {"title": "Mitchell Sinicropi was a consummate…", "text": "Mitchell Sinicropi was a consummate professional - always on top of things and extremely helpful.  Because of his diligence and patience we had everything in order and sailed through closing. In addition Mitch's positive attitude and personality made the experience as pleasant as possible considering  the stress inherent in home buying.  We would recommend him to anyone. ", "rating": 5}, {"title": "Joe Delgado ", "text": "Joe Delgado made the whole process easy from start to finish. Professional, courteous and very knowledgeable. Joe always made himself available to answer my many questions with openness and honesty.", "rating": 5}, {"title": "Easy to contact our salesperson", "text": "Easy to contact our salesperson.  He was exceptionally polite and attentive to our needs.  He also worked to include what debts we wanted to pay off.", "rating": 5}, {"title": "The whole process was made so easy", "text": "The whole process was made so easy. Communication was awesome and we were kept updated all the way through the process. Thank you Daniel Shea for a great experience with NewDay.", "rating": 5}, {"title": "The staff was excellent and made the…", "text": "The staff was excellent and made the whole process also painless they did an outstanding job of leading us through the whole process with the utmost of respect and dignity.  I would highly recommend your company to anyone looking to refi and purchase a new home, truly a 6 star rating ", "rating": 5}, {"title": "Always On time with answers", "text": "Always On time with answers, and service is always complete, very professional associates, never a surprise, always on time.", "rating": 5}, {"title": "My loan was approved and closed in a…", "text": "My loan was approved and closed in a very short time and my representative was super helpful and knowledgeable, worked when he was sick to get me finished. Great job.", "rating": 5}, {"title": "We worked with Joshua Denson and he was…", "text": "We worked with Joshua Denson and he was very, very thorough and very very polite. We would’ve not been happier with anybody else. He is such a gentleman. He is also very knowledgeable. He helped us get through this whole process.", "rating": 5}, {"title": "Loan experience ", "text": "Braydon was a great person. He was so helpful helping my husband and I to get the loan that we needed. He stayed in touch with us on a daily basis, even when his father was in the hospital. Thank you for hiring such a kind and thoughtful person.", "rating": 5}, {"title": "Nicholas Was very helpful throughout…", "text": "Nicholas Was very helpful throughout the process. Kept us informed and answered our questions. ", "rating": 5}, {"title": "Brandon Leibfred was great handling our…", "text": "Brandon Leibfred was great handling our account and worked with us on getting everything done. A great guy to work with, and was always there to answer any questions.", "rating": 5}, {"title": "Professional satff", "text": "MATT N SAM were very professional  and helped us alot. Thank you for putting us at ease. ", "rating": 5}, {"title": "No team is good unless there is a good…", "text": "No team is good unless there is a good coach. And having Brandon to walk me from the beginning to end was nothing but outstanding, job well done. He is a good and great member of the New Day USA TEAM!!!", "rating": 5}, {"title": "A Huge Thank You!!", "text": "A huge Thank you to our Loan Officer Stuart W. Lindquist II. He is Amazing! He was so patient, knowledgeable, engaged at all times, and caring through the whole mortgage process from the first contact to the keys of our new home! We all have seen the commercials for NewDay USA. We thought, no way could they want to help the Military members, Active or Veteran as the commercials say. Our LO Stuart was all that and more! Our dream home was a bumpy road and if we wouldn't have had Stuart and NewDay USA by our side every step of the way we would have given up. Even when we just needed someone to listen, he was there for us! Our LO and NewDay USA are the real deal!! We have had other lenders and other mortgage companies in the past and in our opinion they All could learn a LOT from our LO and Newday USA!! ", "rating": 5}, {"title": "Excellent service", "text": "Joe Delgado is the man I worked with.  He was professional, knowledgeable and very friendly.  Joe kept in contact with me to keep me up to date on the process.  I would definately recommend NewDay to all.", "rating": 5}, {"title": "NewdayUSA was very helpful", "text": "NewdayUSA was very helpful, and made our refinance and loan experience so easy.", "rating": 5}, {"title": "Account Manager Juan Delgado Carrera…", "text": "Account Manager Juan Delgado Carrera provided exception service throughout the process.  Great communication and constant updates while navigating the process.  Juan was very professional, knowledgeable, patient, and explained everything with no hidden surprises. This was painless and an actually pleasant experience.  Would highly recommend Newday USA.  Thanks for the breathing room.  ZS", "rating": 5}, {"title": "Account Executive Ryan Henry O'Neill…", "text": "Account Executive Ryan Henry O'Neill was very helpful and answered all me questions. He assisted me in a quick and efficient manner, was friendly and knowledgeable.  The overall experience was positive and  I would recommend New Day USA to any Veterans. ", "rating": 5}, {"title": "new day was wonderful and great to me", "text": "theNew day expenence was great and wonderfulto me and the personal was evey helpfulwithmy lona. handle the paper work ease fro me", "rating": 5}, {"title": "Excellent to work with any easy", "text": "Excellent to work with any easy. Nigel was a Great help!", "rating": 5}, {"title": "Mr Elliot was very considerate of my…", "text": "Mr Elliot was very considerate of my need we worked together and got quick and on time  nice to work with ", "rating": 5}, {"title": "Excellent experience!!", "text": "Tyler Brook was extremely knowledgeable and helpful throughout the entire process and made the experience very stress-free and simple. ", "rating": 5}, {"title": "It was quick and effective", "text": "It was quick and effective. I got gold star rating because I used New Day Before.", "rating": 5}, {"title": "Exceptional service", "text": "Lionel walked us through the process and completed it in a timely manner. He was a person of his word. When he said a date it was done by then. Lionel was upfront about the process and stayed on top of this so we did not fall through the cracks", "rating": 5}, {"title": "Great Communication", "text": "Brandon was Very Helpful Every Step of the way. He answered all questions and contacted us quickly when we had questions.", "rating": 5}, {"title": "Working with knowledgable and true…", "text": "Working with knowledgable and true professional people who knew what needed to be done to finish it on time.", "rating": 5}, {"title": "A Very Satisfactoy Refinancing", "text": "From start to finish, our refinancing process was smooth and timely.  Our notary requirement was set up and handled while on vacation and we appreciated the flexibility and coordination.  Cody was very thorough and professional in our application and loan process.  It was an excellent experience and one that we are grateful.", "rating": 5}, {"title": "Great service", "text": "Great service, likable people. Helpful and prompt. Dan Shea was very attentive and helpful ", "rating": 5}, {"title": "Very happy ", "text": "Nick explained everything to me clearly and if I didn’t understand something, he tried to explain it more simply. ", "rating": 5}, {"title": "Joshua Denson was very professional and…", "text": "Joshua Denson was very professional and on top of things and he kept me in the loop the whole time which I really appreciate and I tell my friends and family to use your company whenever they need any assistance with any kind of business transactions thank you very much", "rating": 5}, {"title": "Joshua was Informative he was polite", "text": "Joshua was Informative he was polite. He called me every single day to keep me updated and he made things go by real smooth.", "rating": 5}, {"title": "Working with Ellis Gloyd was very easy with his help. He was very professional in all aspects on this loan explaining the process as we went through it. If interest rates drop next year I will be back", "text": "Working with Ellis Gloyd", "rating": 5}, {"title": "Service to those who served.", "text": "Staying on top of issues, fighting to keep other companies paperwork moving in a timely manner and most of all, following up with me keeping me informed. ", "rating": 5}, {"title": "The Gentleman who assisted us ( my wife…", "text": "The Gentleman who assisted us ( my wife ad I ) did a great job assisting us.", "rating": 5}, {"title": "It was a seamless process a little over…", "text": "It was a seamless process a little over 2 weeks from outreach to close ", "rating": 5}, {"title": "Wilmer Gamboa was awesome was with me…", "text": "Wilmer Gamboa was awesome was with me every step of the way and was more friendly than others I have worked with.also he explained things  in a way we could understand he is the best. And truly cares", "rating": 5}, {"title": "Fast closing", "text": "Fast closing. Our Loan Origination Officer was on the ball and very helpful throughout the process. ", "rating": 5}, {"title": "MR STUART WILLIAM LINQUIST ,WAS A…", "text": "MR STUART WILLIAM LINQUIST ,WAS A PROFESSIONAL DOING  HIS JOB, I WOULD RECOMMEND HIM TO ANY BODY,THANK YOU NEW DAY VERY MUCH.", "rating": 5}, {"title": "Colby has been great", "text": "Had A question for Colby and he was great getting back to me.  Colby has been great through this whole process.", "rating": 5}, {"title": "Quick response", "text": "Quick response, very professional. Communication was excellent. Everything I needed fell into place easily. Andrew was awesome. Thank you.", "rating": 5}, {"title": "Outstanding very helpful.", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "Phil was fantastic", "text": "Phil was fantastic. He kept us up to date on the progress. He was always there to answer questions.", "rating": 5}, {"title": "Blake smith was great throughout the…", "text": "Blake smith was great throughout the process of my refinance ", "rating": 5}, {"title": "Andrew Marin is a Star", "text": "Andrew Marin's professional attitude, expert advice and dedication to serve us has placed Newday at the top of our list of trustworthy companies. ", "rating": 5}, {"title": "Great customer service", "text": "Great customer service. Quick answers and response to questions.", "rating": 5}, {"title": "Everyone was very helpful and polite", "text": "Everyone was very helpful and polite.  I would refer Newday to other veterans ", "rating": 5}, {"title": "Working with Christopher D", "text": "Working with Christopher D. Hamilton.  A true professional in the RIGHT job!", "rating": 5}, {"title": "Andrew's assistance.", "text": "Andrew was always polite and always kept us informed about the status of the refinance process.", "rating": 5}, {"title": "I was unsure on whether to go through…", "text": "I was unsure on whether to go through with this but the staff explained everything. All is well.", "rating": 5}, {"title": " great customer service…", "text": "We received great customer service from New Day USA! I would definitely recommend them.", "rating": 5}, {"title": "That they will take good care of you", "text": "The way every one was kind and patient and always answered all our questions", "rating": 5}, {"title": "I have just concluded a refi after…", "text": "I have just concluded a refi after having New Day as my company for years. They made it easy and quick ", "rating": 5}, {"title": "No comments", "text": "Date of experience: October 21, 2024", "rating": 5}, {"title": "Jordan was pleasant explained…", "text": "Jordan was pleasant explained everything well and kept in touch", "rating": 5}, {"title": "Michael Malone what's an exceptional  Manager.", "text": "Working with Michael Malone.He kept me informed at every step in the process.", "rating": 5}, {"title": "customer service is very good", "text": "Date of experience: October 04, 2024", "rating": 5}, {"title": "Brandon Leibdfred was great", "text": "Brandon Leibdfred was great. He was very helpful and answered all questions and concerns. ", "rating": 5}, {"title": "Easy guidance.", "text": "Easy guidance. ", "rating": 5}, {"title": "Cody Dennis was very helpful. He was very professional and walked me through the whole process. I appreciate him being there to help guide me through it all.", "text": "Cody Dennis was very helpful. Especially to me because it is all ", "rating": 5}, {"title": "Our Loan Officer", "text": "Our Loan Officer, Eddie Escobar, was super helpful. ", "rating": 5}, {"title": "Patrick Murphy was great", "text": "Patrick Murphy was great.  He answered my questions and was available to help me thru the process.  The process was easy and fast.  I'm glad New Day is out there.  It came at a time I really needed help.Thank you.", "rating": 5}, {"title": "They all worked together", "text": "They all worked together ", "rating": 5}, {"title": "Thiago Cruz was thorough professional…", "text": "Thiago Cruz was thorough professional and attended to the process details continuously to a successful conclusion of the application to loan closing and followed up to ensure documentation was completed that reduced concern or confusion over the process.  Highly knowledgeable and profesional providing confidence in us as we needed.  ", "rating": 5}, {"title": "They would let me know at all times…", "text": "They would let me know at all times what was happening", "rating": 5}, {"title": "Fast and easy.", "text": "Date of experience: November 01, 2024", "rating": 5}, {"title": "The entire process was simple and…", "text": "The entire process was simple and stress free. I was kept informed.", "rating": 5}, {"title": "My Refi", "text": "I was very pleased with the handling of my loan. From beginning to end. ", "rating": 5}, {"title": "Very helpful if we had any questions", "text": "Date of experience: September 20, 2024", "rating": 5}, {"title": "Zane was great to work with", "text": "Zane was great to work with. I think he is of your greatest assets.  ", "rating": 5}, {"title": "Great service", "text": "Mr Gordon was very helpful and made the process very easy.", "rating": 5}, {"title": "Julian made our experience extremely…", "text": "Julian made our experience extremely helpful by navigating our financials and understanding what we could do to make this loan happen to help our family.", "rating": 5}, {"title": "Much more competent and cordial…", "text": "Much more competent and cordial representative, unlike my first experiences.", "rating": 5}, {"title": "Everything about the loan process was…", "text": "Everything about the loan process was great ", "rating": 5}, {"title": "They were able to assess our needs and…", "text": "They were able to assess our needs and guide us through to meet our goals. ", "rating": 5}, {"title": "Fast service", "text": "Fast service, constant communication, very helpful, answered all questions.  ", "rating": 5}, {"title": "Experiance", "text": "The one on one tha Mr. Shea gave us during the process", "rating": 5}, {"title": "I didn't have to do anything", "text": "I didn't have to do anything, they took care of everything.", "rating": 5}, {"title": "Helped with the computer", "text": "Helped with the computer.  I’m not computer savvy,Alex made it easy. Every thing went smoothly.", "rating": 5}, {"title": "Always a pleasure to work with Sarah…", "text": "Always a pleasure to work with Sarah Sahki was great.", "rating": 5}, {"title": "Ryan was so helpful!", "text": "Ryan walked us through everything that we needed to get done. He was a huge help!", "rating": 5}, {"title": "The way things were handled", "text": "The way things were handled, was excellent.", "rating": 5}, {"title": "Professional", "text": "Professional, well organized, and polite.", "rating": 5}, {"title": "Great service", "text": "Fast responses and quick closing.", "rating": 5}, {"title": "Everything progressed quickly!", "text": "Date of experience: August 05, 2024", "rating": 5}, {"title": "I was kept informed of the process was", "text": "I was kept informed of the process was. Seemed fast and easy. ", "rating": 5}, {"title": "Quick and curtious service", "text": "Quick and curtious service.  Kept me in the loop.", "rating": 5}, {"title": "Ease of process", "text": "Date of experience: September 06, 2024", "rating": 5}, {"title": "Phillip Sprinkle", "text": "Phillip Sprinkle ", "rating": 5}, {"title": "Exemplary", "text": "Isabelle Clark was fantastic", "rating": 5}, {"title": "Staying on track with us", "text": "Date of experience: August 23, 2024", "rating": 5}, {"title": "Nathan Oneill Gordon ", "text": "Nathan Oneill Gordon . He is (underlined), professional…!!!", "rating": 5}, {"title": "Helped us out a lot!!", "text": "Date of experience: September 23, 2024", "rating": 5}, {"title": "I was helped when I needed it.", "text": "Date of experience: September 06, 2024", "rating": 5}, {"title": "Everyone was professional and very…", "text": "Everyone was professional and very knowledgeable ", "rating": 5}, {"title": "Great job", "text": "Great job, by Mr. Daniel Shea", "rating": 5}, {"title": "Nice people to work with", "text": "Nice people to work with ", "rating": 5}, {"title": "Very customer centric.", "text": "Very customer centric. ", "rating": 5}, {"title": "Excellent", "text": "Excellent, personable service.", "rating": 5}, {"title": "Service", "text": "Excellent professional service.", "rating": 5}, {"title": "Honest and very helpful.", "text": "All claims they made were honored and fulfilled.never were they pushy and always answer your questions.and they make it all as simple as possible.which helps an older person like me.I am over 70. Thank you NewDay!", "rating": 5}, {"title": "I've been with New Day since 2021 and…", "text": "I've been with New Day since 2021 and hands down has been the best experience. Truly take care of business and is for you. ", "rating": 5}, {"title": "Excellent experience….very responsive…", "text": "Excellent experience….very responsive and was there every step of the way.  Highly recommend to anyone.", "rating": 5}, {"title": "Very professional", "text": "Very professional.   Answered each and every question.  ", "rating": 5}, {"title": "Jeffrey steeb was very prompt with…", "text": "Jeffrey steeb was very prompt with getting me answers and making it as easy as possible. There was no judgement, just help", "rating": 5}, {"title": "Champions for veterans and families!", "text": "First of all, from the first person we talked to, to the final signing, everyone was so polite and very helpful every step of the way. Second, any question we had was answered almost immediately. Third, the process was smooth and finalized on time. Such a great help at this stage in our economic times. Thank you from the bottom of our hearts! Hoorah", "rating": 5}, {"title": "fantastic customer service!!", "text": "fantastic customer service!!! Knowledgeable, helpful, and friendly", "rating": 5}, {"title": "Ben Taylor was a great rep", "text": "Ben Taylor was a great rep. for the company. After a few hiccups he straighten everything out, and made the home loan experience very satisfying. I would highly recommend this company to anyone. Thanks Ben for everything.", "rating": 5}, {"title": "Very Fast Process", "text": "I got a very quick reply from Brandon C at New Day USA.  He clearly explained the process and stayed with me the whole way through.  He helped when I struggled to find some help in repairs that needed to be completed and worked with me and the appraiser to get them done. What I thought was going to be an exhausting experience actually turned out to be pleasant and easy.", "rating": 5}, {"title": "Frederico  was excellent in all areas", "text": "Frederico  was excellent in all areas. all happened as he explained. all done in a timely matter. all I can say is an awesome way of explaining everything. should be proud to have employees of this nature.very knowledgeable.THANK YOU !", "rating": 5}, {"title": "Representative", "text": "The Representative, Shawn Orem was very helpful to guide me through this process. He kept me informed and touched base every day and answered all my questions. He made this process very easy and painless. ", "rating": 5}, {"title": "It was a little nerve racking but over all was a rather painless experience.", "text": "It was a little nerve racking at times but we were happy to see how thorough our representative was throughout the data collection process. And while it took a little time to get there, once the loan was approved, closing moved very quickly. All in all it was a rather painless experience.", "rating": 5}, {"title": "Great Experience/Quick Turnaround ", "text": "Everyone was great to work with.  My specialist L** was with me every step of the way.  He even answered a text message really early in the morning.  I am an early riser 0300 and I had a question, I sent it by text so I would not forget around 0430 I figured he would answer when the office was open.  So I was completely surprised when he answered it around 0500.  Yes there were a couple hiccups, but we got through them and I am completely satisfied.  I can't comment on the checks that I am sending to the CC companies to pay off debt but I am sure if something comes up, New Day will be available to help.  Thank you for a great experience.", "rating": 5}, {"title": "Thiago Cruz provided exceptional…", "text": "Thiago Cruz provided exceptional service through my refinance process. He kept in contact with me through the process and after the loan was completed. I highly recommend New Day and Mr Cruz. Will definite use their services if need in the future. Services provided was more than 5 🌟.", "rating": 5}, {"title": "Thank you for a job well done", "text": "Gabrielle Marie Garza was extremely helpful and kept in contact with us throughout the whole process. What sounded too good to be true soon became reality. Please thank Gabby for us for her hard work and dedication to her job and customers.", "rating": 5}, {"title": "Communication was impeccable", "text": "Communication was impeccable. Brandon C did an amazing job helping me with managing my expectations. Everything he said was spot on. ", "rating": 5}, {"title": "Arizona to Oklahoma ", "text": "The individuals who were involved in this transaction kept me informed that every step along the way.  Very professional. Thank you", "rating": 5}, {"title": "Very easy and very professional", "text": "Very easy and very professional.  Made us feel that we were cared about!!!  ", "rating": 5}, {"title": "Everything", "text": "Everything ", "rating": 5}, {"title": "There for everything and every step of…", "text": "There for everything and every step of the way. Very professional and helpful. ", "rating": 5}, {"title": "Brandon Conover was with me every step…", "text": "Brandon Conover was with me every step of the way and stayed in constant contact. I did have some issues with the checks having the wrong name which caused a delay in paying off my creditors, but Brandon acted immediately and corrected the problem as fast as he could. Overall, excellent experience!", "rating": 5}, {"title": "The process was made extremely easy buy…", "text": "The process was made extremely easy buy our agent (Wilmer). He kept us informed every step of the way. He explained everything throughly as we went along. He responded swiftly to any questions we had. My wife and I are very satisfied with our experience. Thank you New Day.", "rating": 5}, {"title": "Gabriella was professional in every…", "text": "Gabriella was professional in every way.  She smoothed out the bumps and made this a rewarding experience.  She put forth  outstanding efforts on every occasion and a difficult situation was made easy!  Thanks, Gabby!!", "rating": 5}, {"title": "Our loan agent was very professional", "text": "Our loan agent was very professional, undates during the process were quickly sent forward and the process was easy ", "rating": 5}, {"title": "the loan officer Kenny was GREAT", "text": "Date of experience: June 10, 2024", "rating": 5}, {"title": "Representative listened to what we…", "text": "Representative listened to what we wanted to do, provide answers and guidance throughout the process and most importantly kept us informed from begining to end.", "rating": 5}, {"title": "I got everything I was looking for", "text": "I got everything I was looking for. I am so Satisfied with the Results", "rating": 5}, {"title": "Excellent Customer Service", "text": "Luke Brucers was very professional, patient, and informative. He explained every aspect which asked about thoroughly and was patient and kind when I had follow up questions...a pleasure.Michael William Thorpe guided me smoothly & expertly to the Review Site. Thank you Luke and Mike.", "rating": 5}, {"title": "Brandon", "text": "Brandon, was fantastic in guiding me through the 'hoops'.  His demeanor was very professional and caring, and he managed to smooth out the few rough spots that were my ownership-legally.", "rating": 5}, {"title": "Everything went smoothly", "text": "Everything went smoothly ", "rating": 5}, {"title": "Our loan officer was fantastic", "text": "Our loan officer was fantastic. He explained everything and was very helpful. ", "rating": 5}, {"title": "Real straight forward information…", "text": "Real straight forward information throughout the entire process. Not all mortgage companies are like New Day USA as options were presented and together with Colten D. I made the decision which is best for me without undue pressure. Need someone who will treat you like a valuable person - call Colten at NewDay USA.", "rating": 5}, {"title": "NewdayUSA is great", "text": "Thiago Cruz is a true professional at his job and working with my re-finance he even predicted some questions and concerns I had about the process. Thiago, you are excellent at this procees from beginning to end, you make a wonderful connection with your customer and you deserve a raise in pay, thank you from Mark and Karen.", "rating": 5}, {"title": "Excellent and very knowledgeable staff", "text": "Excellent and very knowledgeable staff. Julian was very professional and knew what he was doing. Julian saved me a lot of money per month. New day USA is all about taking care of veterans!", "rating": 5}, {"title": "Great experience ", "text": "Clear communication and direct process. Devin was very helpful and clearly communicated with me. ", "rating": 5}, {"title": "Couldn’t have been easier!", "text": "Couldn’t have been easier! New Day employees are competent, efficient and respectful! They make you feel like your home purchase is important to them. They keep you up to date and walk you through every step of the way! Andrew treated us like VIPs! We highly recommend New Day USA!", "rating": 5}, {"title": "Agent", "text": "Agent - Blake Smith", "rating": 5}, {"title": "Great Experience!!", "text": "My only regret is that there is not another star i can mark for this review. Newdayusa is an absolute company with integrity with full force help to us veterans. Mr Kevan Bowen is an absolute amazing representative to work with, very efficient, polite, prompt and makes this process as easy and comfortable as possible. Throughout my refinancing process Kevan always made himself available to answer any of my questions even on weekends which i feel it was very admirable in his part. Kevan is a great asset to his company and Newdayusa is very fortunate to have him as their representative. I highly recommend anyone looking to buy or refinance to contact Newdayusa and ask for Kevan Eugene Bowen,, you wont regret it! Thank you and,,,SEMPER FI, God Bless", "rating": 5}, {"title": "Beginning to the end", "text": "Beginning to the end, Cody was with us.", "rating": 5}, {"title": "Juan was very professional and handled…", "text": "Juan was very professional and handled things in a thorough and timely manner. He made this experience go smoothly. I had a great experience due to the customer service I received", "rating": 5}, {"title": "Amazing Experience!", "text": "I had an amazing experience working with Daniel Parker of NewDay USA. His customer service was outstanding, and the mortgage loan was exactly what I was looking for. He went above and beyond to help me find the perfect loan for my needs.", "rating": 5}, {"title": "The expertise with which Mr", "text": "The expertise with which Mr. Barth handled the whole process. ", "rating": 5}, {"title": "Refinancing made simple!…", "text": "NewDay finance representative kept me updated on interest rates that accommodated me to be able to refinance my home hassel free. My closing was within two weeks and most importantly, I completed everything in the presence of my home. Thanks for a positive customer service experience!", "rating": 5}, {"title": "Patience and Understanding", "text": "Patience and Understanding.  Nick is the best!", "rating": 5}, {"title": "Excellent customer service ", "text": "Sean Orem answered all my questions in a through and timely manner. He made this experience go smoothly. Had great experience during this time due to the customer service I received.", "rating": 5}, {"title": "Your team is very professional", "text": "Your team is very professional. Always there to answer questions. Always keeps us informed.     Thank you,   Gary ", "rating": 5}, {"title": "It went very well.", "text": "It went very well. ", "rating": 5}, {"title": "Excellent ", "text": "Organized, courtesy, very prompt.Will highly recommend your services ", "rating": 5}, {"title": "the lender was the best", "text": "the lender was the best. He  helped me through the whole process. Kept me inform of what was happening and when.", "rating": 5}, {"title": "Well done..a very great job!", "text": "Date of experience: June 03, 2024", "rating": 5}, {"title": "I enjoy working with Dylan Moran he…", "text": "I enjoy working with Dylan Moran he kept us informed on everything.Thank you all", "rating": 5}, {"title": "I really appreciated the time Gabriel…", "text": "I really appreciated the time Gabriel Brizuela spent getting my loan approved and settled. I am very grateful to him for keeping me informed and updated on the progress of every detail. I was getting offers in the mail from NewDay but I never knew that it was for real until I called and spoke with Gab. Thanks NewDay and Gab for all you did.", "rating": 5}, {"title": "Respect is the key for me", "text": "Respect is the key for me. Everything else that goes with this key word is acceptable.", "rating": 5}, {"title": "Went well had questions and they would…", "text": "Went well had questions and they would be answered if theirs an issue we would be contacted and we helped to the best of our ability things went smooth and we felt very appreciated for taking out the loan thank you.", "rating": 5}, {"title": "Why NewDay?  The Team", "text": "What made our NewDay experience so great?  The team - Most importantly Chirs.  Chris was totally professional and always kept Maria and I informed and updated on the progress to ensure a smooth purchase. A truly exemplary performer. ", "rating": 5}, {"title": "Juan Delgado", "text": "Juan Delgado, our representative, was very knowledgeable and very helpful with our loan. Kuddos to him for making it easy for us to go thru all the paperwork of the loan.  He also was very friendly.  It was always a pleasure to talk to him!!!", "rating": 5}, {"title": "Yes your company is doing great", "text": "Yes your company is doing great. However I was under the impression that my home insurance was NO LONGER with State Farm, but has been changed to USAA.", "rating": 5}, {"title": "Ease of processing and outstanding…", "text": "Ease of processing and outstanding professional representative (Mr. Disher) assisted me. It was a great experience from start to finish with information and updates readily available throughout the whole process. Great experience, keep up the great work. ", "rating": 5}, {"title": "From start to finish everything has…", "text": "From start to finish everything has been amazing. Truly takes care of veterans!! ", "rating": 5}, {"title": "Excellent Refinance Agent", "text": "I had an excellent finance agent, Captain Patrick Murphy. He was spot on every minute of the refinancing process--explaining credit score, requesting materials, explaining the refinancing process from appraisal to loan percentage rate to payout to new mortgage requirement. He was always professional but yet empathic, proficient, and efficient. Most of all, since I am a retired Associate Professor of English, he has an excellent command of the English language.", "rating": 5}, {"title": "Thank You", "text": "It was easy to set it up. It was quick. As long as you work honestly with your agent it is a breeze to get through. We have no complaints ", "rating": 5}, {"title": "The process was faster than I thought", "text": "The process was faster than I thought.  The Agent was helpful and communicated well.", "rating": 5}, {"title": "The team was great at helping me with…", "text": "The team was great at helping me with my refinancing.  Thanks to everyone. ", "rating": 5}, {"title": "My account executive", "text": "My account executive, Colson Buscher, was great throughout the entire process. He kept me updated in a timely manner, ensured I completely understand all the documents and answered my questions thoroughly. Very professional, and caring. ", "rating": 5}, {"title": "My experience with my assigned agent…Excellent and Smooth Process", "text": "My experience with my assigned agent Mr. Delgado was outstanding!  He was very transparent with the process, items needed and what New Day USA was offering!  Very smooth process!", "rating": 5}, {"title": "That veterans can get a good shake from you. Guyes, even though you're navy, ha ha go army.", "text": "Mister rutledge was great and the procedure was not difficult", "rating": 5}, {"title": "Newday does a good job taking care of …", "text": "Newday does a good job taking care of  Veterans! They walked me through the whole process and explained everything along the way! I was totally comfortable throughout the whole process! Thanks Mr. Lieberman and team!!", "rating": 5}, {"title": "Ryan Kattell was very helpful through…", "text": "Ryan Kattell was very helpful through the entire process, which balanced all my concerns.  Thank you very much.", "rating": 5}, {"title": "Having done a refinance with New Day…", "text": "Having done a refinance with New Day before, it was a company i was familiar with. I was extremely pleased with my results this time. Mr. Federico Camusso has done an outstanding job.", "rating": 5}, {"title": "Great", "text": "Everything went smoothly, thanks to Collin ", "rating": 5}, {"title": "Brandon was a great asset", "text": "Brandon was a great asset, he kept us in the loop every step of the way.", "rating": 5}, {"title": "Always updated of progress", "text": "I was continuously being kept up to date with the process of my refinance application. That made the process much less stressful. ", "rating": 5}, {"title": "Cobly Richardson was the greatest loan…", "text": "Cobly Richardson was the greatest loan officer ever. ", "rating": 5}, {"title": "NEWDAYUSA gives a Veteran a New Day.", "text": "The experience was very helpful. The information was exact and timely. The Agent was very friendly and customer service-oriented. I appreciate his willingness to go the extra mile to satisfy what was needed. Veterans, such as I, should be happy to see that if they needed help with their financial obligations, New Day USA was there waiting to take their call. Since I am disabled and a 20-year vet, I needed all the help that could be afforded to me. Thank you, USANEWDAY. and thank you, Andrew Schaefer", "rating": 5}, {"title": "My counselor", "text": "My counselor, Matthew was truthful, insightful, and very available to answer myself and my wife’s questions. He has a strong knack for customer service and looking out for the veteran.", "rating": 5}, {"title": "Arroyo", "text": "Everyone was so helpful. They never dropped the ball. They did what they said and said what they did. Such an easy experience. ", "rating": 5}, {"title": "Professional service", "text": "Date of experience: June 03, 2024", "rating": 5}, {"title": "E Krissak refinance review.", "text": "This is the second time that we used New Day USA to finance/refinance our home. Both times were very smooth and easy. This time we refinanced and cashed in on some of the equity in our home to pay off some debt and get some other things done to our house. Ladele Andrew Tojuola handled the process. He did so with the utmost dignity and integrity. He made the process very easy and smooth. He brings credit and honor to the Admirals name and New Day USA. I mean that with all sincerity. He was very understanding and worked with my time constraints. I work a part time job and my wife and I have a disabled daughter that requires 24/7 care. Ladele could not have been more understanding or have done any better than what he did. New Day USA and the Admiral can and should be proud to have him as part of the team. He was out standing. Now for the vinegar. We refinanced our home with New Day USA for the first time some years ago. I don’t remember the exact date. We didn’t have any problems with New Day USA after they took over our mortgage. Then our mortgage was sold to Freedom Mortgage. Honestly my wife and I felt like we had been thrown under the bus when Freedom Mortgage took over our mortgage. It was one problem after another for about the first year. They said we made late payments when we were on time. There were problems with the our taxes and other fees in the escrow account. It was not a pleasant experience to say the least. I know that mortgages are bought and sold on a routine basis but I hope we can stay with New Day USA this time. Admiral Lynch if you get to read this I know you are a man of high standards, morals, and integrity. The service you provide to the active duty and retired military community is second to none and very much needed. I know many that have their mortgage with you and your company and they love it. Here I am a retired USAF Master Sergeant telling a retired USN RADM to keep up the good work, but keep up the good work. The service you provide is needed. There are veterans that wouldn’t have a home if it wasn’t for you. God bless you and all of the people with New Day USA.", "rating": 5}, {"title": "Thomas Costanza helped me through this…", "text": "Thomas Costanza helped me through this process and I appreciate this very much .", "rating": 5}, {"title": "Walter Harrington has been a big help…", "text": "Walter Harrington has been a big help to me. He kept me informed of the process every step of the way. My thanks to him", "rating": 5}, {"title": "Happy I Went with New Day", "text": "Bandon Leibfred made my refinancing experience smooth and worry free.  I feel I got the best interest rate available and happy with the terms.  So happy I went with with New Day.", "rating": 5}, {"title": "We especially appreciated Dan’s help in…", "text": "We especially appreciated Dan’s help in the beginning stages of this experience. He always was available to take our calls, emails, text messages and all when we had questions. He was always very reassuring and we appreciated that very much. I was sad when he was not available at the end to finish the proceedings. ", "rating": 5}, {"title": "Great customer service", "text": "Great customer service. Made the whole process less stressful all the way around. ", "rating": 5}, {"title": "I could not be more pleased with New Day", "text": "I could not be more pleased with the service I received from New Day. Juan Camilo Delgado Carrera, Account Executive was amazing. His depth of knowledge, communication skills, concern, attention to details and personality were spot on!  I appreciate all of the call backs, ease of providing information and timeliness of the process. Thank you making a complex task easy. This is the second time I have used New Day and my experience was great both times  You live up to your commercials. And that is a rarity in today’s business world. Thank you ", "rating": 5}, {"title": "Great people .Matthew help me from…", "text": "Great people .Matthew help me from start to finish.", "rating": 5}, {"title": "Pleasant Loan Experience ", "text": "Devin is professional and efficient in the entire process! He made our experience smooth, easy, and always returned our calls in a timely manner. New Day is an excellent company that we would recommend to any veteran. Thanks for the pleasant loan experience!", "rating": 5}, {"title": "Professional and excellent team", "text": "Professional and excellent team. Executed by the gentleman that handled our refinance was great. The loan process was smooth and the numbers were exactly as they were told to us. Best company we have ever worked with on a mortgage. Thank you. ", "rating": 5}, {"title": "Very happy ", "text": "Very happy with all of the help and advice ", "rating": 5}, {"title": "Brandon was exceptional", "text": "Brandon was exceptional! We had a great experience.", "rating": 5}, {"title": "Temi handled all the paperwork in a…", "text": "Temi handled all the paperwork in a most timely manner ! He also was very prompt in returning our calls !NewDay USA is definitely everything they advertised !!", "rating": 5}, {"title": "NewDay USA was a life saver…", "text": "From the moment we reached out to NewDay USA we received excellent service. Our rep Cody walked us all the way through the process from beginning phone call all the way to closing and made sure we understood all that was going on. We thought our credit card debt was impossible to get under control. Thanks to NewDay USA we can breathe easier and are on the best financial footing we have been in a long time.", "rating": 5}, {"title": "Great Job", "text": "New Day was easy to work with and did a great job. We are grateful and happy.", "rating": 5}, {"title": "People were great", "text": "People were great! Answered all questions or found someone who could! Always introduced themselves ", "rating": 5}, {"title": "We had a fantastic agent in Samuel he…", "text": "We had a fantastic agent in Samuel he was awesome, very helpful and so knowledgeable. Without him I don't think it would have gone thru this fast.New day USA is very lucky to have this Agent .", "rating": 5}, {"title": "Joe Delgado really worked with me all…", "text": "Joe Delgado really worked with me all the way through the process!! Always answered all my questions!!", "rating": 5}, {"title": "Admiral ..", "text": "Admiral ... please commend Mr Lionel Marshall (aka the Sergeant Major although I know he is a Staff Sergeant) that NewDayUSA is a GREAT organization. Service rendered was the best of the best!!! I couldn't be happier in the process, and the result. Let it be known that I will be proud to refer any and all to look to NewDayUSA for any future needs!! Thank You for company and indeed look to keep Mr Lionel Marshall a major component of the team!!!!", "rating": 5}, {"title": "First I wish to compliment one of your…", "text": "First I wish to compliment one of your Experts in the handling of my situation:  Anthony John Simpson.He did an outstanding job paying attention to detail and supporting my needs.  The transaction went thru without a hitch.  Albeit a bit long, but, that worked out to my advantage in the long run.  Good show Anthony.I reviewed nearly all of the 300 comments you have received recently - both good and the complainers. May I add a comment to the complainers?1.  The loan process (even from Newday) is a business (it is NOT a free giveaway of monies to   Vets).  Businesses need to make money like every other business in America.  It takes time and effort to see if you qualify;  yes, even you.  You, like the rest of us, need to QUALIFY for the loan, whatever your circumstance in life.  I am sorry if you did not make the 'muster'.2. Ask them what YOU need to do to better your situation to enable you to qualify for 'something'....it may not come out to the multi-thousands you wished, but it is a start.  Remember: You are dealing with a businessPersonally, I did NOT ask for the 'maximum' out of what I may have qualified for - I asked simply for what I needed to help me get several high-interest credit cards nullified to get my debt load under \"better\" control.   Newday did exactly that.I hope better days ahead for you and yours.Gary O  Captain (Ret)", "rating": 5}, {"title": "The company made the experience easy…", "text": "The company made the experience easy from day one.  If we had any questions at all they were answered quickly, the entire process was great.", "rating": 5}, {"title": "Everything went so smooth!!", "text": "Everything went so smooth!!! All of the people were awesome!!! Could not have been any better!! Thanks to everyone that worked with us!!! Ken & Bobbie Black", "rating": 5}, {"title": "Very professional and helpful", "text": "Very professional and helpful. If you have the opportunity use them.", "rating": 5}, {"title": "NewDay USA was quick to approve my…", "text": "NewDay USA was quick to approve my mortgage refinance.  My mortgage advisor was a pleasure to work with.  He kept me informed of every step if the process.  A personal thanks to Philip.", "rating": 5}, {"title": "Excellent service", "text": "Excellent service! The agent I worked with through the entire process was very respectful, informative and very easy to work with. When I needed to get in touch with him with any concerns or questions, he there to answer the call, or get back with me very quickly when leaving a message. Very satisfied with the entire process. ", "rating": 5}, {"title": "Great experience ", "text": "Seamless process. Matt was a pleasure to work with. Great communication. ", "rating": 5}, {"title": "Working with new day USA ", "text": "Working with Stuart Lindquist was very easy. He is an asset to New Day USA. I would recommend new day to any one who is looking to buy a home or refinance. This was my third time using new day. Keep up the work", "rating": 5}, {"title": "Great customer service!!!", "text": "The NewDay professional we worked with was outstanding in helping to meet each of our requirements", "rating": 5}, {"title": "Great communication throughout the…", "text": "Great communication throughout the process!", "rating": 5}, {"title": "Veteran's salute", "text": "The complete process was simple and all our questions answered to both my wife's and my expectations. We could not be happier and will definitely recommend them to my fellow vet's.", "rating": 5}, {"title": "Great Customer service", "text": "Your people like Collin N every time we talk or if he emailed me he would say - Call - Text - Or email if you have questions. He was prompt to answer question even if I text to say appraiser was here or inspector he was good to let me know he got text and thank me for doing it. I work in customer service for 30 years and I love working with company that people like to do there job", "rating": 5}, {"title": "Fast and detailed steps explained for organizing the required forms to submit …", "text": "Fast and detailed steps explained for each.   I was able come up with the material needed and my loan was closed in two weeks. This was my second loan with New Day USA. Great folks!", "rating": 5}, {"title": "Taheeb Aroworowon was very patcient and…", "text": "Taheeb Aroworowon was very patcient and extremely helpful with my less than desirable computer skills With all the required paperwork and needed from me to sign, locate, etc. As far as I'm concerened he is a definite asset to New Day USA. He was always considerit, and most of all,very,very patient with me. new Day definitly was very well represented by Taheeb. I'm very greatfull with New Day, it was a great experience.", "rating": 5}, {"title": "Experience was great", "text": "Experience was great. It was easy to understand and the paperwork was very simple.", "rating": 5}, {"title": "Great Experience Working with New Day USA", "text": "I believe working with Ryan was one of the reasons my loan closed so quickly. He knew what his was talking about, what items he needed from me to get this work completed in a very timely matter. He was kind and well experienced at his job.", "rating": 5}, {"title": "This is about Wallter Harrison;", "text": "This is about Wallter Harrison;He was so sweet and helpful to us going through the paper work. He worked with us and patientwith any questions we had. He gets a 10 from us for all he helped us with. He was like talking to family. I would recommend him to anyone that is going through the same as we did. He makes it so   much easier.                                                              Sincerely,  Thomas and Virginia Garringer  ", "rating": 5}, {"title": "I just closed on first cash out…", "text": "I just closed on first cash out refinance! Brandon is awesome and helped me every step of the way! I reached out to him in June 2023 to get started. I had zero confidence in my ability to be able to qualify for the refi but he did! He had enough confidence that he checked on me quarterly to make sure I stayed focused! I’m so grateful I did and for Brandon! Now I’m able to do some investing, remodel home, and save for my son’s future! ", "rating": 5}, {"title": "Exceptional Service! ", "text": "James Lambert was an absolute pleasure to work with! He was very kind and professional. James did an awesome job following up and keeping us informed through the entire process. He was able to get our cash our refinance closed on time and we are very pleased with our decision to proceed with James as our account executive. Five stars! The Slukas ", "rating": 5}, {"title": "Our home is our retirement plan", "text": "Our home is our retirement plan. When we found out that it needed a \"out of our budget\" procedure to secure the foundation, we were devastated. Thankfully we saw a advertisement for New Day USA.  The process was so simple and we were approved almost immediately.  Shawn Orem was amazing. He explained everything to us and made us feel at ease through the entire process. The future is bright again thanks to New Day USA. ", "rating": 5}, {"title": "Excellent service ", "text": "Everything was handed promptly and professionally. There were no outlandish promises made. This is not the first time I have used NEWDAY. If needed, I will use them again. ", "rating": 5}, {"title": "I would recommend New Day and our…", "text": "I would recommend New Day and our mortgage professional Blaine Rutledge to everyone. Blaine was very professional and easy to work with. He was with us in every step of the way making it very easy. It was really a pleasure doing business with New Day and Blaine Rutledge. ", "rating": 5}, {"title": "Refinance/debt payoff loan", "text": "Just recently closed on a refinance, debt payoff loan with Brandon Michael Leibfred, that also left me with a substancial cash out to put in my savings account.  The process was quick and pretty simple, even for computer illiterates like me.  Brandon was excellent at returning calls and resovling any questions or confusions on my part in a timely manner.  ", "rating": 5}, {"title": "Letter of heart felt apppreciation", "text": "My husband and I  highly recommend your business.Zachary Griener our Account Executive is not only friendly, and kind, but also highly skilled in his position.  He is very Efficient and his Punctuality are Hallmarks of his service. We are completely impressed with Mr. GRIENER Especially With his professional customer service.  ", "rating": 5}, {"title": "Great experience", "text": "Blake Smith truly made this one of the easiest home purchases/refinances ever.  I have done several and Mr. Smith was a true professional who knew exactly what he was doing and made the process a breeze.  Friendly, knowledgeable, helpful and always available.  Cannot say enough good things about this refinance.", "rating": 5}, {"title": "Fastest and error free streamline I…", "text": "Fastest and error free streamline I ever had.", "rating": 5}, {"title": "Professional from start to finish", "text": "The entire process was outstanding!!", "rating": 5}, {"title": "Blake was most helpful", "text": "Blake was most helpful. I am very happy with the way he handled it and kept me updated. You guys are the best, thanks", "rating": 5}, {"title": "Great service", "text": "Great service ", "rating": 5}, {"title": "Great service", "text": "Date of experience: April 13, 2024", "rating": 5}, {"title": "Great job", "text": "Professional service", "rating": 5}, {"title": "The courtesy and consistency", "text": "The courtesy and consistency ", "rating": 5}, {"title": "Matt was absolutely wonderful to work…", "text": "Matt was absolutely wonderful to work with. Very knowledgeable and explained things fully to let us understand and not feel like we were not intelligent enough.  Thank you again matt.", "rating": 5}, {"title": "Refinancing with a lot of equity in home sure helps to reduce high interest debt ", "text": "Refinancing my home in which I had a lot of equity made sense.  It allowed me to pay off high interest credit card and car.  It just made good financial sense even though the interest rate was higher than I wanted.  Monthly payment were not that much more than want I am paying now.  So there ya go.", "rating": 5}, {"title": "Everything was done in a timely manner", "text": "Everything was done in a timely manner! The ppl I worked with like Mr. Lionel Marshall were very professional and made this process easier. Not only did they help reach my goal bit they were able to put cash in my pocket to better my future. I appreciate Mr. Marshall and his team. I would recommend this company to anyone they really care about us veterans and for that im grateful!", "rating": 5}, {"title": "Michael was very professional and was…", "text": "Michael was very professional and was able help me quickly in providing information about a question concerning a refund due me. He should be recognized for his excellent service. ", "rating": 5}, {"title": "Everyone at New Day was very helpful…", "text": "Everyone at New Day was very helpful and Andrew Nelson was awesome.  He guided us through the process and was always there to answer our questions and see that everything went great.", "rating": 5}, {"title": "Great experience!! ", "text": "Colby was great through the whole process! ", "rating": 5}, {"title": "Working with New Day", "text": "Working with New Day USA was a great decision.  Our Agent Ari Elfasi was super to work with.  Always answered all of our questions, was always helpful and very informative.  Would definitely recommend them. Thank you Ari and New Day USA!!!", "rating": 5}, {"title": "It was an absolute pleasure to work…", "text": "It was an absolute pleasure to work with Andrew Yenesel. He was very upfront and informative.  He was easy to get ahold of. He would answer any question that I had. Everything was done so fast.", "rating": 5}, {"title": "Best decision ever.", "text": "This is the best decision my family has made. Andrew was with us every step of the way leading us through the process and answering any questions. My only regret is that we didn't do this earlier. Thank you New Day team for your support of us veterans. ", "rating": 5}, {"title": "Review for Ari", "text": "Ari was a great help. He was supportive and helpful and made the experience easy.", "rating": 5}, {"title": "Great experience!!", "text": "Our experience was amazing!! KJ‘s ability to communicate with us, made the process extremely smooth!", "rating": 5}, {"title": "Our loan servicing rep was Juan…", "text": "Our loan servicing rep was Juan Delgado, he was awesome, kept us informed, explained everything and made the process very easy! ", "rating": 5}, {"title": "Working with Brandon Conover", "text": "Date of experience: April 01, 2024", "rating": 5}, {"title": "New Day remarkable ", "text": "Daniel my representative for your company, made the Refi almost seamless. He was professional, upfront and honest. Daniel explained things in detail,  the things I was uncertain of, he promptly returned emails and was keeping with the highest standard you all have. Exceptional gentleman: ", "rating": 5}, {"title": "Our Servicers name was Ryan Kattell", "text": "Our Servicers name was Ryan Kattell. He was awesome! He was very courteous, helpful and friendly.  He went through and explained the whole refi process with us. He kept us in the loop doing the whole process. It went so smoothly and fast!! Thank you Ryan!", "rating": 5}, {"title": "Our loan processor Alec Lasalle is the…", "text": "Our loan processor Alec Lasalle is the best we’ve ever had at Newday USA. Explained everything extremely well, called at least every other day during the week to keep us up to date. ", "rating": 5}, {"title": "Ryan Elliott is very professional and…", "text": " was very helpful in getting this process started and completed in a speedy time frame. I would recommend him as a agent for your company to help other Veterans that want to refinance their home loan. It was a pleasure working with him. If my husband had a issue  with something  he was always there.A phone call away                             Sincerely H.J.Bland", "rating": 5}, {"title": "Shawn Oden is a great asset to your…", "text": "Shawn Oden is a great asset to your company. As senior citizens who sometimes need a more simple explanation of things, Shawn was very polite and patient. He kept us informed every step of the process. I would highly recommend your company. ", "rating": 5}, {"title": "Welborn's Review ", "text": "Mr. Willy Junior Petiote was by far the most professional mortgage person I've ever worked with.  Everything was very smooth throughout the process & occurred exactly when anticipated. I was such a pleasure to work with him as he found solutions to meet our needs.  Thank you for everything you have done to help us.  60 years old & 1st using my VA Loan.", "rating": 5}, {"title": "Nathan Gordon  was awesome", "text": "Nathan Gordon was great working with he was always very polite and courteous.  He was always there to answer any and all my question and concerns.  He kept me informed through the whole process. I just can't say enough great things about him. He is an asset to your company.", "rating": 5}, {"title": "I love the fact that the refinancing…", "text": "I love the fact that the refinancing was initiated on your end the saving me money every year on the lower interest rate thank you very much I appreciate you looking out for me and my family", "rating": 5}, {"title": "Your Agent Ryan Elliott is very…", "text": "Your Agent Ryan Elliott is very professional and was very helpful in getting this process started and completed in a speedy time frame.  I would recommend him as a agent for your company to help other Veterans that want to refinance their home loan.  It was a pleasure working with him.", "rating": 5}, {"title": "Very easy process", "text": "Very easy process, no hassling by the representative everything was completed in a timely manner.", "rating": 5}, {"title": "Refi process", "text": "Brendan Cavanaugh  displayed professionalism from the initial contact to final closing of the refi. He was thorough throughout the entire process keeping informed along the way. I would recommend Newday to any veteran looking to refinance their home.", "rating": 5}, {"title": "I recomment  my agent and this company …", "text": "I recommend this company and my agent Dominic Denelo to everyone ...This refinancing was incredibly helpful to me and my family . I didnt realize this opportunity existed until my friend saw NewDay on foxnews and mentioned it to me..The process of refinancing went smoothly and didnt require anything of me. My agent did all the work and was there to help every step of the way.He  kept me updated and informed about everything going on and answered every question I could think of. This was a fantastic experience , Im very happy about it  ", "rating": 5}, {"title": "New Day USA approved my refinance which…", "text": "New Day USA approved my refinance which helped my family tremendously. We didn't have to pay for anything up front. Expenses were taken care of after the loan was given. Truck paid off, credit cards and IRS paid off. Now,we can get a new start on life without all the worries of debt with high interest rates. Gabby was our agent and was always available to help us and get us everything we needed. Thank you and God bless you,Tammy M.", "rating": 5}, {"title": "With respect. ", "text": "The first thing would be your agent Ryan Elliott.  His strategies and straightforward attitude without any doubt was part of this important decision I made to work with and obtain my goals to cash my home equity.  Best of all it was painless! As I weighed the information between Newday and the comparisons and or competition.  Job well done!", "rating": 5}, {"title": "I was pleased and honored", "text": "I was pleased and honored, to have had Mr. Berry, he was extremely helpful and very professional. He worked tirelessly and patient with me. His professionalism and dedication to his job, speaks volume. ", "rating": 5}, {"title": "Speed in closing", "text": "Speed in closing ", "rating": 5}, {"title": "Prompt", "text": "Prompt, courteous, knowledgeable service.", "rating": 5}, {"title": "Previous experience.", "text": "Date of experience: March 15, 2024", "rating": 5}, {"title": "Excellent service and support", "text": "Excellent service and support. It was a honor to work with your team!", "rating": 5}, {"title": "Very professional", "text": "Our agent was extremely professional and kept in touch throughout the entire refinance process.  He was always available to answer any questions or concerns.", "rating": 5}, {"title": "No issues.", "text": "No issues. Great customer service. Good follow up. Jeffery was wonderful. ", "rating": 5}, {"title": "A FANTASTIC COMPANY - NEW DAY USA !!!", "text": "The person who did the footwork for my loan was one of the best I have ever dealt with.  His name is Sean Kelley and he was fantastic.  The ability to complete everything by computer was also great.  I will recommend Newday USA to all my Marine Corps League members and any other Military Veteran I come in contact with.  The company is great with great employees.  As the Marines would say ....... \"OOHRAH\" !!!", "rating": 5}, {"title": "The Account Executive", "text": "The Account Executive, that handled my cash-out process were very knowledgeable, and professional.The Account Executive, kept me informed throughout the process.Great communicator.", "rating": 5}, {"title": "I have always had terrific people to…", "text": "I have always had terrific people to talk to. Very knowledgable and helpful.. ", "rating": 5}, {"title": "I dealt with Joe Delgado", "text": "I dealt with Joe Delgado. He was very pleasure to work with. He is polite, and professional, and returned phone calls in a timely manner. New Day loans should be very proud to have him as an employee.", "rating": 5}, {"title": "I never heard of a company that I was…", "text": "I never heard of a company that I was connected with call and offer a better rate before.  I figured I would have to go with a different company to get a cheaper rate.  I had four other offers during the time that we were getting the better rate.", "rating": 5}, {"title": "I was extremely pleased with Luke …", "text": "I was extremely pleased with Luke who answered all of my question and helped me to set up an automatic paying program directly from my bank. He also fix my mortgage being paid  double each month, therefore reducing the number of years to pay off the mortgage; Luke is polite, friendly and very knowledgeable; I feel very fortunate to have him for advice and help when I need it. In my opinion this company is lucky to have Luke as their employee  ", "rating": 5}, {"title": "Easy process", "text": "Easy process. Thomas was very friendly, professional, and kept me informed through the whole process. He was very respectful of my time, and made the whole experience very pleasant. ", "rating": 5}, {"title": "Had a great experience and the staff…", "text": "Had a great experience and the staff was awesome and very patient and understanding. I highly recommend them to anyone. Thanks for a the help", "rating": 5}, {"title": "Service excellence", "text": "From day one Brandon exhibited professionalism and truthfulness.  He was very responsive to our every need, very timely and performed his job with a great sense of urgency.  He expertly guided us through every step of the process.  Brandon we appreciate you and would not hesitate in working with you again.  GREAT EXPERIENCE 👍 ", "rating": 5}, {"title": "It doesn't matter that your first language is not English...", "text": "From the first moment Lionel Marshall answered our call we knew that he was going to give everything to help us move forward with our refinancing. NewDay USA has a great account executive, in Lionel. Thanks to the entire NewDay USA team for their support. I am especially grateful because even though English is not my first language, they helped me with everything. THANK YOU.", "rating": 5}, {"title": "Gabe helped me out very much", "text": "Gabe helped me out very much ", "rating": 5}, {"title": "My experience is always great with new…", "text": "My experience is always great with new day USA everyone does a great job", "rating": 5}, {"title": "Great Customer service ", "text": "My husband and I had the opportunity to work with Mr. Thiago Pimenta Cruz. This Gentleman was so patient with us. He had answers to all questions and never hesitated to call us back. Such Great customer-oriented service. We rate The experience with Mr. Cruz a 🔟 and he should get a raise. ☺ Thank you New Day USA ", "rating": 5}, {"title": "NewDay USA has been an outstanding…", "text": "NewDay USA has been an outstanding company to work with, from the start of the refinance process we were continually advised as to what was going on and also what the best strategy would be to ensure our financial future. Our loan professional, Nicholas James Barth​​​​, has guided my wife and I step by step in this process, he was not only knowledgeable and professional but very personable.I will definitely recommend NewDay USA to all of my veteran friends and to my immediate family as well .", "rating": 5}, {"title": "A life saing event", "text": "Jim, my account specialist diligently walk me through every step and available options.", "rating": 5}, {"title": "Our agent Tom Costanza was great", "text": " Our agent Tom Costanza was great, checked in on us every week and took care of everything ", "rating": 5}, {"title": "This is the 2nd time I have used New…", "text": "This is the 2nd time I have used New Day for a mortgage, and like the first time, they made the usually painful process very easy and seamless.  Mitch Sinicropi and all involved through closing were excellent and obviously very knowledgable and professional.  If I buy/refinance again, there will be no other companies considered!!", "rating": 5}, {"title": "Committed and highly competent ", "text": "Our account executive, Lionel Marshall, was both knowledgeable and professional in facilitating our recent mortgage refi.  Despite encountering obstacles during the process, he was diligent in his efforts on our behalf. I even teased him about working so hard on evenings and weekends!  As a veteran himself, he is committed to advancing the welfare of those who served and their families. Thank you, Mr. Marshall! ", "rating": 5}, {"title": "had a great experience with my loan…", "text": "had a great experience with my loan officer, Ladele Tojuola. Very transparent and was always keeping me up to date on the progress. Very quick turnaround from initial conversation to closing. Thank you for your help.  ", "rating": 5}, {"title": "My team went above and beyond to help…", "text": "My team went above and beyond to help me get the most out of this experience and all my questions were answered. ", "rating": 5}, {"title": "Wonderful refinance experience ", "text": "We had the pleasure of working with Mr. Lionel Marshall. He is extremely knowledgeable, thorough and efficient. We appreciate he was willing to talk on the phone, text and email us. We were informed every step of the process. Mr. Marshall is wonderful to work with and we are grateful for New Day!", "rating": 5}, {"title": "The Representative was courtesy", "text": "The Representative was courtesy. Kept us informed and very knowledgeable. I would recommend This Company to anyone ", "rating": 5}, {"title": "Evaluation for Michael Malone", "text": "My first encounter with New Day was November 29, 2023. The first two guys who tried to help me, didn’t know what they were doing. So therefore, we had many problems along the way that wasn’t until, January 8, 2024, when Michael Malone took over my case. He turned out to be very knowledgeable and very patient with me. My circumstances were unusual as I was a six year Marine Corps Reservist and I lived in a condo. But with each new problem we faced, he learned how to fix it we were told no more than once, but we ended up having everything approved this loan approval changed not only my life, but the life of others, on a scale  of 1-10, I gave Michael a score of 9.9. I don’t know where he is in his career but if he’s not at the top of it, he should be at the top of it. if he is at top of it’s position, it’s probably time for him to get a promotion. May God continue to bless him. Preston K. Cross Jr. USMC-R. 1967-1973. ", "rating": 5}, {"title": "From NIGHTMARE to Blessing!  What was possibly a major problem to an incredible outcome is what occured!  ", "text": "My experience with New Day has gone really well.  Micheal Malone the agent I worked with created a very pleasant experience for me.  There were several things that needed detail attention.  Micheal stepped up to the plate to help me the customer accomplish the task that needed special attention.  One phone call lasted almost two hours because of the technical things that had to happen.  He exercised extreme patience and fortitude in helping get things right.  By this, I mean helping me and guiding me through the processes that had to happen for us to complete the task.  I needed someone with Micheal's patience to walk me through some very technical moments that presented themselves to me.  His guidance through the financial aspects was very productive.  I am especially thankful for his advice and counsel.  Micheal was a blessing to this old man and made my experience with the refinancing part of this deal a pleasant business adventure.  Thanks Micheal", "rating": 5}, {"title": "I’m disabled and they walked me through…", "text": "I’m disabled and they walked me through everything ", "rating": 5}, {"title": "Everyone I have talked to/dealt with has been very supportive and helpful. Explain", "text": "Everyone I have talked to/dealt ", "rating": 5}, {"title": "The process was fast and easy to…", "text": "The process was fast and easy to understand from start to finish. Ben was very thorough with the paperwork and explained everything that was needed from me and how to get it to them and also how to sign all of the e documents.", "rating": 5}, {"title": "Wonderful experience.", "text": "Wonderful representation. Always available. Immediately call back to answer any questions.Our representation NATE GORDON Was wonderful. Would recommend him to anyone!", "rating": 5}, {"title": "Brendan H made the whole process easy", "text": "Brendan H made the whole process easy. He answered all my questions. He always answered his phone whenever I called,", "rating": 5}, {"title": "This company is doing very well I had…", "text": "This company is doing very well I had the pleasure of working with Cameron he was very good in explaining everything to me even when it was tough at times questions I need it answers to he made it possible to answer to the best of his ability if not he would send me to someone else that could better help me overall I appreciate everything you guys have done for me especially now so that I could get my air conditioner furnace fixed I appreciate everything you guys have done for me and in the future if I need you I won't hesitate to contact so thank you once again for all you have done sincerely Linda Ballard ", "rating": 5}, {"title": "Wonderful", "text": "The treatment I got from my rep.he was  always  there  when  I needed  him  very courteous  very professional. ", "rating": 5}, {"title": "Outstanding customer service", "text": "Outstanding customer service.  Mr. Sean made everything easy understandable. ", "rating": 5}, {"title": "Awesome", "text": "Cheyne Jubin was there for us every step of the way. He made us feel like we were human.", "rating": 5}, {"title": "Our loan officer", "text": "Our loan officer. Jeff Steeb, was very helpful and efficient in getting our loan through processing, underwriting and on to closing. He is very professional and always available to answer questions and kept us informed as to the status of our loan.  ", "rating": 5}, {"title": "Nick was more than helpful during the…", "text": "Nick was more than helpful during the entire process .He kept me informed about what was going on and updated.", "rating": 5}, {"title": "Brandon Leibfred is an outstanding…great experience!", "text": "Brandon Leibfred is an outstanding representative. He took time to explain the issues of the program that best helped me with the refinancing of my home. My experience was a great experience and everything went well. I will continue to work with Brandon on my future needs. Thank you Brandon. ", "rating": 5}, {"title": "Great job by Ryan and the staff", "text": "Ryan and the staff were TOPS in our book.  We were debating on how to financially succeed in our retirement.  Ryan was right there answered every question and problem that we had.  He more or less held our hand through this experience.  He and the gang at NewDay deserve more than 5 stars.  In our book they deserve a TEN STAR review!!! When we had a question they had the answer.  They advised us what whould happen every step of the way. Who would be coming and what they would do.  If we needed paperwork they would not only tell us but help us find it. GREAT JOB RYAN (and staff)!! You all deserve Halos and BIG RAISES!! ", "rating": 5}, {"title": "Great experience!", "text": "I'm not a techy person but Ryan was always just a text or call away when I had a little trouble transmitting documents. Friendly, respectful and efficient. Just 18 days from application to close. I never had to wonder if someone was working on it for me. I'm a navy vet and I felt like it actually mattered. Well done Ryan and well done NewDay!", "rating": 5}, {"title": "Smooth and Fast.", "text": "Blaine did a great job keeping me updated about the entire process. 30 day closing. We wanted to refinance to do some upgrades to our property then do an IRRL when rates come back down. Thank you Blaine for the great job.", "rating": 5}, {"title": "Ellis Floyd was with us every step of…", "text": "Ellis Floyd was with us every step of the way. He checked in early, late and on weekends. Each step was explained and then completed with total assistence.", "rating": 5}, {"title": "The service and responsiveness was second to none!ne.", "text": "The responsiveness, professionalism and personal touch was superior.  And, Brandon Leibfred our Account Executive was OUTSTANDING!!  ", "rating": 5}, {"title": "I am honored to give the best rating possible", "text": "I am honored to give NewDay USA the best rating possible.   First for my loan, thank you.  Then for absolutely Terrific Service.. thank you again!  Today I had the pleasure of talking to Tristan,  he took great care to explain the answers to my questions in a most professional and friendly manner.    Thank You Tristan!", "rating": 5}, {"title": "First of all I would like to say Thank…", "text": "First of all I would like to say Thank You, Miles Jai!!!! He’s a beautiful soul!!!! He took the time to answer all my questions quickly and find a solution to my problems immediately.He had to hold my hand and guide me through the steps, n he answered the same questions over and over and never waived his kind personality. I was in the hole n sinking quickly, needed a way out n Miles explained not only do they care about getting you cash out but they care about your financial future.And yes I called another company just to see if what NewDay was offering was right for me, and as it turns you you were right for me. I believe my situation is what the company is here for. True lifesavers, and I wanna Thank,Miles team of experts that helped along the way!!! Thank you", "rating": 5}, {"title": "The Loan Officer Andrew Berry made me…", "text": "The Loan Officer Andrew Berry made me feel that he sincerely cared. Every step of the process he explained to me, and gave me guidance on how to achieve my financial goals. I really appreciated his professional Can Do Attitude.", "rating": 5}, {"title": "It was a very pleasant process Juan…", "text": "It was a very pleasant process Juan made it easier than expected. My Wife and I love that Veterans like me can access a company that works for us not against us. Thanks again Juan and New Day, you have set the standard very high for your industry.", "rating": 5}, {"title": "Representative was very easy to work…", "text": "Representative was very easy to work with and explained everything that was going on!", "rating": 5}, {"title": "Fast and great experience", "text": "Fast and great experience.  Everything went smoothly and was done quickly.  Great people to work with ", "rating": 5}, {"title": "Jason was very helpful thru the process", "text": "Date of experience: February 23, 2024", "rating": 5}, {"title": "Highest possible rating for Brandon Michael Leibfred", "text": "Mr. Brandon Michael Leibfred deserves the highest possible rating as a loan  closing officer.His assistance in closing a New Day loan for me was of the highest quality, and I thank him.      He was always available to take my calls and answer questions relative to rhe closing.Mr.  Leibfred is a valuable asset to New Day.    ", "rating": 5}, {"title": "When I called Blake answered ", "text": "When I called, Blake answered the phone, right away made my wife and I feel we would be taken care of with the most care. He kept in touch during the whole process. This New Day USA is the best. ", "rating": 5}, {"title": "My experience was a great change in my…", "text": "My experience was a great change in my life. No more credit issues. More money in pocket. A different perspective on things and life.", "rating": 5}, {"title": "Smooth streamlined process and…", "text": "Smooth streamlined process and excellent customer service from Andres. He was very attentive and kept us informed on updates or just a friendly check in on a weekly basis. ", "rating": 5}, {"title": "My agent was attentive to everything…", "text": "My agent was attentive to everything and kept me abreast of all steps and deadlines.", "rating": 5}, {"title": "Process was good even though I don’t…", "text": "Process was good even though I don’t like conducting my business on a computer.", "rating": 5}, {"title": "I was very pleased the way I was…", "text": "I was very pleased the way I was treated respectfully as a Veteran.The loan process was thoroughly explained to me and the follow-up was professional.This was my second loan process with New Day which should tell you how I feel about your organization.", "rating": 5}, {"title": "Newday", "text": "Excellent guidance throughout the process and Monoa was Awesome!!", "rating": 5}, {"title": "Our rep was Andrew Perez and he made it…", "text": "Our rep was Andrew Perez and he made it  seamless to apply. The whole process was painless and very simple.", "rating": 5}, {"title": "How quick and seamless the process was.", "text": "Date of experience: February 16, 2024", "rating": 5}, {"title": "The rep.that helped me went above and…", "text": "The rep.that helped me went above and beyond to help us.my hat off to him", "rating": 5}, {"title": "Michael Thorpe is a great asset to NewDay USA.", "text": "Michael Thorpe is one of the most helpful individuals my husband (William Mayhue Millett), our son (Mario Antonio Millett) and I (Marisa Navarra Millett) have ever had the pleasure of dealing with in all our home financial situations. His courtesy,  concern, and friendly manner made it a true joy to work with him. Michael was so helpful and compassionate when he learned that I had had a recent stroke which had left me somewhat less than 100% mentally. His understanding of my situation enabled us to be assisted in an exemplary manner. Thanks Michael!!!", "rating": 5}, {"title": "I shopped around before deciding to…", "text": "I shopped around before deciding to refinance with NewDay. It was refreshing to experience the style of customer service and care that has been absent in recent times. I will recommend NewDay to my loved ones.", "rating": 5}, {"title": "Easy Day…", "text": "Nick provided solid communication throughout a very streamlined process. I would recommend New Day for any financing needs.", "rating": 5}, {"title": "I was very happy with New Day and happy…", "text": "I was very happy with New Day and happy with the results. Thank you.", "rating": 5}, {"title": "Andres was truly invested in us have a…", "text": "Andres was truly invested in us have a quality experience. He listened well, stayed in contact with us through the process of our refinance.", "rating": 5}, {"title": "Great Service", "text": "Eddie did a wonderful job guiding me through the process. He is hard worker and we thank him very much", "rating": 5}, {"title": "Customer Service", "text": "Customer Service, attention to details thru the loan processing, and following up with customer questions.", "rating": 5}, {"title": "Very informative", "text": "Very informative. Answered all questions. Always available", "rating": 5}, {"title": "My NDU team was great", "text": "My NDU team was great. All of them were professional, knowledgeale, ans explained everything to a tee!", "rating": 5}, {"title": "My loan officer", "text": "My loan officer, Patrick Murphy was awesome. Very little stress involved and my wife and I sincerely appreciate the experience.", "rating": 5}, {"title": "It was a truly great experience working…Ryan Elliott.", "text": "It was a truly great experience working with Ryan Elliott. He was so informatable and helpful through this whole process.Thank You Ryan for everything", "rating": 5}, {"title": "Great experience", "text": "Mike Malone made everything go smoothly. Very good at his job. Will recomend to friends and family.", "rating": 5}, {"title": "Got the loan we needed", "text": "Got the loan we needed!  It was easier than expected.  Our NewDay USA agent, Thiago Cruz was a huge help along the way to getting the loan.  He was very professional, patient, courteous, and friendly.  It was easy to talk to him and ask silly questions.  Thank you Thiago, and thank you NewDay USA!", "rating": 5}, {"title": "The process was fast & efficient.", "text": "The whole process was fast, efficient, and very customer oriented.  The team took every opportunity to fully answer my questions and understand my needs before taking any action.  Once a decision was made on a course of action there was no delay.  Joe Delgado was on top of it the whole way.  Great job all around.", "rating": 5}, {"title": "Phil was great made it simple and fast…", "text": "Phil was great made it simple and fast , i would recommend NewDay to anyone who wants to get cash from their homes", "rating": 5}, {"title": "GABBY DID", "text": "GABBY DID! A- NNEW DAY IS ALWAYS QUICK AND EASY AND CLOSE BEFORE SCHEDULED", "rating": 5}, {"title": "New Day is the Best", "text": "Every veteran would be wise to use New Day. I've completed about a half dozen mortages/refinancing and New Day is, without question,the best service, most courteous and honest loan officers, and quickest company to reach closing I've worked with.  Tom was great to work with and was able to quickly answer every question.", "rating": 5}, {"title": "Brandon excellence", "text": "Brandon excellenceHe was an excellent support throughout this process, guided me, and was available for all questions immediatelyBrandon provides wonderful support and help to your clients and great asset to youThank you, BrandonOwen Humphrey A", "rating": 5}, {"title": "Aki Coles was the Best- He handled us…", "text": "Aki Coles was the Best- He handled us with lot’s of care and grace. He was ALWAYS informative and never over promised and under deliver. He was GREAT beginning to end. Thank you New Day for having your best players on the team. Thank you for helping us on a new start.", "rating": 5}, {"title": "We had the pleasure of working with…Brain Rutledge", "text": "We had the pleasure of working with Brian Rutledge. He did an excellent job with our loan . He is very knowledgeable and friendly. Helped us through each step and was always available to answer any questions that we had . We will highly recommend Brian and New day USA.     Mr & Mrs G Whitaker", "rating": 5}, {"title": "Great experience! Thanks Patrick.", "text": "Worked with Patrick. Extremely responsive. Great communication. Very clear with what was needed and when. This experience was night and day from previous experiences with other organizations. Thank you Patrick and NewDay USA!", "rating": 5}, {"title": "Overall experience went smoothly", "text": "Overall experience went smoothly. I appreciate the support and helping me make the best decision. The team was very helpful answering all my questions during the process. I couldn’t have done it any better with anyone else.", "rating": 5}, {"title": "Communication, communication, communication", "text": "Alec was very communicative, kept me well informed along the way and assisted in every area. things went smoothly for the most part, where it didn't we adapted and overcame. Well done.", "rating": 5}, {"title": "Blake Smith from New Day USA was…", "text": "Blake Smith from New Day USA was upfront and honest with me right from the beginning of my loan process.He stayed in constant contact with me.I will definitely be letting my fellow veterans and friends know about the outstanding work your company did for this Veteran", "rating": 5}, {"title": "The whole process was very smooth and I…", "text": "The whole process was very smooth and I had to furnish a minimum of material  New Day Reps. did all the work and put everything in order.  the closing was at my house at a time that was great for me.  Everything was fully explained in simple terms.", "rating": 5}, {"title": "My NewDay USA account rep Michael…", "text": "My NewDay USA account rep Michael Malone was nothing less than a true professional. Mike listened to my concerns and answered all questions with a thorough and clear answer. Communications were handled promptly, and Mike also utilized any special requests I gave for calling my work. Having an account representative like Michael gives me incentive to recommend using him and NewDay USA for mortgage needs.", "rating": 5}, {"title": "Andrew Perez was great", "text": "Date of experience: January 08, 2024", "rating": 5}, {"title": "Your new day rep (Patrick Murphy) was…", "text": "Your new day rep (Patrick Murphy) was extremely efficient & got us needed cash back & an an affordable monthly payment. Gloria & I (Edward Arp) were pleased. The settlement company not overly demanding & were also highly effecient. I would recommend New Day to any of my qualifying friends. You gave us a fresh start financially & we thank you so much. Ed & Gloria Arp.", "rating": 5}, {"title": "Gabe Santos Brizuela", "text": "What made my experience a 5 star experience? My loan adviser, Gabe.Gabe kept me apprised through the entire refi process; and although I never met Gabe in person, he certainly is, to me, the friendly and professional 'face' (voice) of NewDay USA!Thanks Gabe, and thanks NewDay!!", "rating": 5}, {"title": "Jesse OConnell Rawls keep in touch and…", "text": "Jesse OConnell Rawls keep in touch and let us know how everything goes with the process and if we needed to do anything else.", "rating": 5}, {"title": "I have to say Gabrielle was out…", "text": "I have to say Gabrielle was out standing. I have delt with other mortgage reps and never have I developed a friendship that I will miss. She goes way above making you feel like NewDay really appreciates there customers and makes them feel like family not just a company. Thank you so so much. Sharon Ireland", "rating": 5}, {"title": "Blake Smith is fantastic!", "text": "Blake Smith was absolutely a pleasure to work with. He was very responsive and ensured I understood each step of the process. He worked endlessly to ensure we got the loan and all the moving parts taken care of quickly as we had a very tight deadline. By far the best experience I have ever had with a banking institution. I strongly suggest that Blake train others on customer service!", "rating": 5}, {"title": "Best mortgage company ever!", "text": "Of all the mortgage companies I’ve ever worked with, Cody Dennis and the team at New Day USA have been the best. The communication and the entire process was better than I could have ever expected. THANK YOU!!!", "rating": 5}, {"title": "My agent was always available", "text": "My agent was always available and kept me informed of what I needed to do.", "rating": 5}, {"title": "Hi my name is Veteran", "text": "Hi my name is Veteran, I reached out to New Day back in November 2023. I really had nowhere to to turn or move forward because of crushing debt. I reached out to New Day after the 99th time I saw the commercial about the 100% cash out deal.  I spoke with Cameron an Account Specialist. I asked him at first if the current 100% cash out was real or a scam. Of course he told me it was a real offer.He informed me he would be with me thru the entire process to close. I thought this impossible and a scam still. I never told him that but,Cam was right, not a scam. He was able to coordinate from his office all communications in a timely manner. Also I became a true believer in Cameron first and later New Day.I had a few obstacles keeping the loan process from being flawless due to a home repair I felt necessary and time consuming due to my ability to not do the work necessary. I found a fellow vet to assist in the work necessaryCam touched base every couple of days to check and offer support of the project. I have become less than trustful of \"Great Deals\". Cam helped assure the process was a \"Great Deal\" for me/us. I was 110% sure that Cameron would get me to the finish of the new mortgage process. My concern were my deadlines. Cam worked probably harder than the next person to keep me on track. He is a thoughtful,consumer friendly Account Specialist. I believe that if Cam could work with me, he can work with anyone. He was also a great listener of my extensive stories about past/present/future. Great hire New Day !!!!!! Thanks again", "rating": 5}, {"title": "Nada", "text": "Nope -  I don't write reviews - I will check boxes but that's all", "rating": 5}, {"title": "Great Experience", "text": "Mr Cavanaugh was extremely helpful and is a valuable asset to your firm. The process was very easy, less stressful, and done professionally. I can’t say enough good things about this experience. Thanks for all the Great Works you do", "rating": 5}, {"title": "Great Experience", "text": "Sam was just an amazing loan officer. He kept in touch almost daily, answered all of my questions, and was even available when he was not in the office. Sam made the experience seamless. He was always   professional and demonstrated a sense of caring.", "rating": 5}, {"title": "Happy we decided on New Day USA", "text": "Professional, easy to follow instructions and assistance was given to us starting from the first call made to the closing date.", "rating": 5}, {"title": "Outstanding service", "text": "I contacted New Day hoping to get a loan to pay off debt.  Lionel handled my case. He was thorough,  knowledgeable, attentive to details and kept me informed as I submitted information and really was a pleasure to work with.  He was everything I would want in a person handling my case.New Day's process was a little different from other companies I have used in the past, but New Day was excellent.", "rating": 5}, {"title": "NewDay USA will work for you!", "text": "Words cannot begin to express my total satisfaction working with NewDay USA and Mr. Gabriel Brizuela. Mr. Brizuela's professionalism, knowledge base and willingness to serve the veterans community was like a breath of fresh air and life changing for me. I highly recommend NewDay USA, and Mr. Gabriel Brizuela to any and all veterans looking to finance or refinance their real property. NewDay USA will change your life for the better.", "rating": 5}, {"title": "Jessica in customer service dept", "text": "Jessica in customer service dept. Assisted in resolving a major problem with the Freedom Mortgage company about my mortgage payment increase. She was more than helpful and very professional manner.Daniel Bresina", "rating": 5}, {"title": "Newdayusa review", "text": "My application and approval went very smooth. Colten Drawbaugh and Devan Hopkins are very good communicators. Always giving updates with timely replies. Both of these gentlemen were a pleasure to work with.     You have a great team -", "rating": 5}, {"title": "I was impressed with the speed New Day…", "text": "I was impressed with the speed New Day Financial processed my home refinance. Truly a great company and would highly recommend them to anyone looking to finance or refinance a home. Jason Burke was phenomenal in keeping me appraised of the progress.", "rating": 5}, {"title": "Eddie Luis Escobar- New Day USA", "text": "We can’t thank Eddie Luis Escobar enough for all his help in getting our refinance done! He was very professional, honest and courteous!!! Told us step by step what to expect and no surprises!!! Any questions we had he would give an honest answer and what to expect every step of the way!!! We tried other companies but Eddie and New Day USA were the only ones to help get this refinance done in a very timely manner!! Communicating with Eddie was like having a friend working on our behalf!!! We will never speak to anyone else pertaining to our mortgage!! We found the best in New Day with Eddie Luis Escobar!!! Thanks again Eddie and the staff that helped make our dream come true!!! We settled December 14, 2023.Vincent and Tammy Huff", "rating": 5}, {"title": "Lionel was so easy to work with", "text": "Lionel was so easy to work with.  He was friendly, informative, and knowledgeable. He was very efficient answering all my questions and guiding me through the entire process.", "rating": 5}, {"title": "Lessons learned", "text": "The process as a whole went very well.Attention to detail caused several delays during the process. I strongly recommend paying more attention to state and local policies. Communication was on point. I was kept informed at all times. I strongly recommend this program for other veterans!Thank you for all you do!! Improvements:1) attention to detail. 2) review local & state polices prior.", "rating": 5}, {"title": "Our account executive", "text": "Our account executive, Ladele Tojuola​ was a pleasure to work with. From start to finish, our refinance went very smooth and quick. Ladele provided all the answers to our questions. This is our second opportunity to work with NewDay, and both times have been great!", "rating": 5}, {"title": "This review is for Patrick Murphy of…", "text": "This review is for Patrick Murphy of New Day from Ed & Gloria Arp. We thoroughly appreciate his swift & precise manner collecting our information for refinancing. He was cordial & bent over backwards in assisting us.  We are very satisfied with the results by lowering our payment & the cash back funds promised. My wife Gloria & myself are very impressed with his efficiency & helpful demeanor. Thank you Patrick once again.", "rating": 5}, {"title": "My Refi", "text": "Our agent, Patrick Joseph Murphy​, made the process easy and non-eventfully. He kept us updated on the process and what was needed from us to keep the process moving along. When question did come up, he was easy to reach and answered our question or got back to us quickly with the answers. Our closing occurred on a Sat. but by Friday we had not heard from the notary I contacted Patrick, and he responded that I would here from the notary Sat morning, but we were still scheduled for 2 PM. Well, I did get a call from the notary, and we were able to doing the signing early than scheduled. Which was perfect for us. Four days later our proceeds were in the bank and checks on the doorstep by noon Monday. Done and over...Thank you.", "rating": 5}, {"title": "The agent Thomas who helped us was…", "text": "The agent Thomas who helped us was through and courteous", "rating": 5}, {"title": "Great loan associate very helpful", "text": "Helpful agent", "rating": 5}, {"title": "Painless and Quick", "text": "Our loan advisor helped us through every phase.  The process was very easy--no computer expertise required!  Above all, we obtained our loan proceeds and were able to replace our broken AC in quickly.", "rating": 5}, {"title": "Loan Process", "text": "Andrew Perez is my loan officer. He did a wonderful job during the entire process. My Loan process was a Great Experience !!! Thank You Andrew !!!!!", "rating": 5}, {"title": "Amazing customer service", "text": "Michael Thorpe has been working with me since October of this year and continue to work with me through November and December to make some changes to my account. He is such an asset to your company. He is so professional and courteous and very detailed oriented. You guys are very lucky to have him as an employee and he has made this customer very very happy.", "rating": 5}, {"title": "Completing the Job", "text": "Completing the JobThe people I have encountered from New Day were always patient and helpful. Solutions were always on hand for any situation that arose. Today, I needed information about a creditor and New Day actually has a department that helps their customers with issues like that. New Day had the new mortgage completed; their part of the business was done and they were still there to help me complete my part. Thank you.", "rating": 5}, {"title": "The process was quick and easy", "text": "The process was quick and easy. Thank you New Day USA!", "rating": 5}, {"title": "Best decision I made!", "text": "I have been receiving the New Day USA mailings for over 2 years and shred or recycled them. I decided in November, 2023 to just call and find out exactly how the process works. I needed to get some work done on my house being this was my first purchase of a home. I called the 1-800 phone number and received a callback the next day from Collin Nutt. He explained to me in detail how the process works and then I decided to go ahead and apply. I also wanted to pay off some bills as well as doing some home improvements. Collin  explained to me that New Day USA pays for an appraisal of my home. I was pleasantly surprised at how much my house appraised for. The entire process from beginning to end was relatively easy and painless. Collin insured that I understood the entire process and answered my many questions. I’m very impressed how streamlined the entire process is and I’m so very happy that I decided to apply! Not only did I pay off some creditors, but I can now fix issues with my home and some home improvements which will build equity in my house! My first major renovation is James Harding siding on the outside of my house in January, 2024. I highly recommend Veterans to apply with New Day USA for home improvements, pay off creditors or have cash in the bank. You can do all three at once!", "rating": 5}, {"title": "i felt that we were more than just clients.", "text": "At all points along the way, Jason Lorell Burke was johnny on the spot, kept us informed, called to make sure all was going smoothly on our end.  While assuring me that all was smooth on their end!  Jason was extremely helpful, i felt that we were more than just clients.", "rating": 5}, {"title": "Easy and confidential", "text": "Date of experience: December 08, 2023", "rating": 5}, {"title": "My first home was purchased with a VA…", "text": "My first home was purchased with a VA loan.  If memory serves the processing was somewhat similar.  New Day Financial was very detailed in the recovery of pertinent personal financial details.  My goal was to refinance, pay off the existing balance on my current loan, my off my car, a large finance company and several credit cards and other retail debt.  It may have taken a little longer to get there but in the end every one of my goals were met.  Kudos to Mr Phil Sprenkle, my personal representative, who was with throughout the entire process.  He is truly a professional who values his clients dream.  Would definitely highly recommend New Day to family and friends.", "rating": 5}, {"title": "We’ve been with Lionel Marshall from…", "text": "We’ve been with Lionel Marshall from the beginning to the end.  Lionel is very professional and knowledgeable during the process is very outstanding.  He’s very patience and throughout he makes us feel very important. We give him a HIGH FIVE!  Thank you very much Lionel Marshall.", "rating": 5}, {"title": "Quick and professional", "text": "Quick, fast, and very reliable in refinancing.   They were very professional.", "rating": 5}, {"title": "Upfront and honest", "text": "Upfront, helpful, and honest answers to my questions. Always available if I had any others questions I forgot to ask. I felt confident with service.", "rating": 5}, {"title": "Daniel Shay was the best!", "text": "Daniel Shay was the best!!  He stayed with us during the entire process and literally walked us through the whole thing.", "rating": 5}, {"title": "I was taken care of by mr Rutledge", "text": "I was taken care of by mr Rutledge . He was very professional and helpful with anything I ask I bet he went far beyond to take care of of me. He was very outstanding.  That’s the type of person I would want to handle by business", "rating": 5}, {"title": "NEWDAY USA", "text": "Our experience with NewDay USA  was very positive. NIGEL STRICKLAND was very professional,knowledgeable thru the entire process. He kept us informed  and answered  all our questions.We will recommend  NEWDAY USA.thanks again Nigel.", "rating": 5}, {"title": "Very helpful and knowledgeable rep", "text": "Date of experience: December 04, 2023", "rating": 5}, {"title": "Consistent communication", "text": "Date of experience: November 17, 2023", "rating": 5}, {"title": "Ryan Elliott", "text": "The loan officer,  Ryan Elliott, made the process so easy. He explained each step and gave me clear instructions on what documents I needed and walked me through everything.  He is amazing!", "rating": 5}, {"title": "Thanks to Mr", "text": "Thanks to Mr. Corcione for his outstanding commitment to us and other veterans. We just filled out application and a few documents-he did the rest- received funds within 30 days. Mr. Cortisone kept us advised throughout entire process. He is the reason New Day has accomplished their mission-\"ensure Veterans and their families receive the benefits they deserve\". I highly recommend New Day USA to veterans for their mortgage needs. PRESS ON  VETERAN WARRIORS!! Thanks again to Mr. Cortisone and New Day.", "rating": 5}, {"title": "The help", "text": "Fast, reliable and my loan officer took care of everything and guide me step by step.", "rating": 5}, {"title": "Easy process", "text": "Date of experience: December 01, 2023", "rating": 5}, {"title": "Great and honest people.", "text": "I am very glad I went with NewDay USA for my refi. The gentleman that help me was just great. He answered all my questions and if didn't have the answer he would go out of his way to find the right answer. He always kept me up to date as to what was going on and always wanted to know if I had any questions. He made the whole process very easy. This is a great company to do business with.", "rating": 5}, {"title": "The best Agents", "text": "I had the best agent, Nigel Strickland. My sister-in-law had him as her agent and gave me his direct phone number.  He was there for me from start to finish.  If any situation would come up, he was there to offer is assistance and everything went smoothly.  I was always kept informed and up to date on everything.  If all the agents at New Day is the same caliber as Nigel, it's no wonder what a great company it is.", "rating": 5}, {"title": "My agent was very helpful and easy to…", "text": "My agent was very helpful and easy to work with. He responded very quickly to my questions and concerns. Would gladly recommend him and this company", "rating": 5}, {"title": "Mr Samuel make are loan very easy make…", "text": "Mr Samuel make are loan very easy make us feel very comfortable", "rating": 5}, {"title": "Anthony Corcione was our representative…", "text": "Anthony Corcione was our representative and he was helpful, courteous and he went above and beyond to make our experience easy and enjoyable. He made three way calls to creditors who usually take a long time getting information back to us, and it was done immediately.  That by itself made the experience stress free. He made sure we had everything we needed including the checks, which were delayed due to the holidays. We highly recommend him.", "rating": 5}, {"title": "Excellent service and help from Brendan…", "text": "Excellent service and help from Brendan Hempstead", "rating": 5}]