[{"title": "Glenn was great to deal with and very…", "text": "Glenn was great to deal with and very understanding when it was difficult to find the necessary papers needed to proceed.  The final paperwork was very quick.  However, PLEASE do not state that the closing papers within your website need to be reviewed AND PRINTED, because I wasted so much ink and paper.  Just state \"PLEASE RECEIVED BEFORE THE CLOSING.\"", "rating": 5}, {"title": "Clear and timely instructions", "text": "Clear and timely instructions, from soft approval to final commitment. I am self-employed for 20 years and the only strange/riduculus request was about the date of my company being incorporated. I moved from MA to RI and had to register in RI when we changed the tax status of the business from LLC to S-corp. I provided all the official (legal) documents from RI Sect. of State and they still insisted a letter from my CPA firm. The problem was the application was in the final days before the Oct 15th filing deadline for deferred tax returns - second busiest period for accountants. I do not understand the insistance of the letter when all the legal documents were provided. The CPA letter is meaningless compared to the legal filings with the government. ", "rating": 5}, {"title": "Quick & Painless", "text": "The whole experience, from start to finish, was fast, easy, and very professional. My Representative, Garrett Miller, kept in touch with every step of the process. He quickly returned my calls or texts with any questions I had, but there really weren't many questions!! This whole process was quick and painless!!!", "rating": 5}, {"title": "Frank is a 5 star fiduciary", "text": "Frank is a 5 star fiduciary. Made me feel comfortable with all the details of my loan and calmed the nerves when stress was high. Communication is excellent! Friendly as well. Closing was easy. Got my funds and checks 4 business days after closing.", "rating": 5}, {"title": "Outstanding Experience with Rocket Mortgage!", "text": "⭐️⭐️⭐️⭐️⭐️ \"We recently did a cash-out refinance on our home with Rocket Mortgage, and the experience couldn’t have been better! The entire process was smooth, straightforward, and moved along quickly, but Alyssa from Detroit, MI, deserves special recognition. Alyssa was an absolute superstar! She went above and beyond, guiding us step-by-step, explaining every detail, and answering all our questions with patience and clarity. Her professionalism and support made the whole experience truly exceptional. Without a doubt, one of the best financial experiences we've ever had! Rocket Mortgage and Alyssa are highly recommended!", "rating": 5}, {"title": "Made it all possible ", "text": "Awesome people and departments that made things go so easy. Not a bad experience in any department or about the whole ordeal. From the very first phone call to the last phone call and closing. Recommend for all.", "rating": 5}, {"title": "Rocket Mortgage - The communication ", "text": "The communication from the top to the bottom was extremely good. It started with Jesse Heath, the first person I spoke with and went all the way through to the closing team. I was always able to reach and talk to someone and/or the chat line. Also, the \"to do/tasks\" list in my Rocket account made things very easy. ", "rating": 5}, {"title": "Y'all ROCK @ Rocket!", "text": "Y'all ROCK @ Rocket Mortgage! Friendly, professional, fast & efficient, thorough service. I feel blessed to have the opportunity to work with this Team. They are truly amazing at what they do! Thank you so much, I appreciate y’all & all that you do. Blessings to you & yours. ", "rating": 5}, {"title": "Rocket Mortgage", "text": "Adam Ali was incredibly kind, patient, and went above and beyond to make our refinance a reality. He took the time to listen to all our questions and, if he didn’t have an immediate answer, ensured we were connected with someone who did. Every team member we worked with at Rocket Mortgage went the extra mile to make us feel valued and appreciated as customers.", "rating": 5}, {"title": "Excellent Experience", "text": "The whole process was excellent. Everyone was very helpful and if we had any question they were answered quickly. Even the closing process was streamlined. Documents were pre-signed and the streaming on camera closing only took around a half hour. Thank you Rocket Mortgage!", "rating": 5}, {"title": "Good experience ", "text": "Everything went smoothly and it was very easy.  The only little glitch was when we first discussed the bills to be paid off,  we were NOT informed of the change to the bills initially discussed after the appraisal of the house came in a little lower than expected by Rocket Mortgage.   So, we were a little surprised that several accounts were not included in the payoff until after everything was signed and completed.   Other than that,  everything went well. ", "rating": 5}, {"title": "Jason at Rocket Mortgage gave us…", "text": "Jason at Rocket Mortgage gave us options and explained everything along the way.  I would suggest Rocket Mortgage yo my friends and family.", "rating": 5}, {"title": "Sherlock is the best ", "text": "Sherlock is the best The whole team really was very professional. I am extremely happy with how everything went. Very appreciative.   ", "rating": 5}, {"title": "Justin Womak did a great job", "text": "Justin Womak did a great job, My loan is not simple as I own many properties and underwriters get confused a lot on what is required.  Justin understood and it all got taken care of", "rating": 5}, {"title": "Alyssa Cerda is amazing! ", "text": "Really enjoyed working Rocket! Alyssa Cerda is an incredible person to work with! If you get a chance to work with her I would highly recommend! ", "rating": 5}, {"title": "Chris Zajec is a fantastic person to…", "text": "Chris Zajec is a fantastic person to work with.  He made everything run so smooth. If I work with Rocket Mortgage I'll ask for Chris Zajec to be my realtor. ", "rating": 5}, {"title": "A team of professionals to be our guides", "text": "From beginning to end we had tremendous  support in finding our way through the whole process. There was not only a support person, but also a team of experts for each step of the way whom we could contact with any concerns or updates. If it hadn't been for the original person I spoke to about scheduling a late payment...advising me to speak to Mark about re- financing and using the equity in our home to pay off  a whole list of indebtedness, we would still be living oay check to paycheck with no relief or progress ", "rating": 5}, {"title": "Can't say I would change anything", "text": "Can't say I would change anything.  Blake, Randy, Mia and the whole team were very professional, and took 98% of the stress out of getting my loan done. Much faster and easier than I expected. 100% satisfied with the entire process. ", "rating": 5}, {"title": "The best found after research", "text": "Prior to selecting Rocket i did extensive research on the best mortgage companies. Every person I dealt with was experienced and knowledgeable in every situation. They attempted everything possible to get my loan to go through after coming from a very bad situation with my previous lender. I would definitely recommend and refer anyone to Rocket.", "rating": 5}, {"title": "The team did an excellent job to help…", "text": "The team did an excellent job to help us in our refinancing. They helped us every step of the way from the beginning to the closing of our refinancing. We appreciate all of you that make it happen. Thanks a  lot!", "rating": 5}, {"title": "Rocket has been out go to for a while", "text": "Rocket has been out go to for a while. Only wish it had closed sooner. Multiple credit card payments came out before we could get payoff checks to them ", "rating": 5}, {"title": "Everyone was easy to work with", "text": "Everyone was easy to work with. Rates were good and we didn't even have to leave the comfort of our Home. I had some concerns with tax prorations but I now have clarification and I   am satisfied. The issue was with the title company not Rocket Mortgage ", "rating": 5}, {"title": "What a wonderful experience!!!", "text": "What a wonderful experience!!!Austin was very professional and answered any questions I had promptly.Was kept up-to-date on the progress of the loan and also the title company.  Everyone was great to work with.  Will definitely recommend Rocket Mortgage to friends and family.", "rating": 5}, {"title": "Spent 4 months with BofA on what should…", "text": "Spent 4 months with BofA on what should have been a no brainer, Rocket approved in a week. Very streamlined, everyone was a joy to work with. Even the notary said Rocket was at the top of their game ", "rating": 5}, {"title": "RM was fantastic to work with", "text": "RM was fantastic to work with! Always kept me informed and quick to respond when I had questions! Israel and Matt were top notch! Well done!", "rating": 5}, {"title": "Recommend to friends and family", "text": "Every step of the way the process was smooth. The representatives I had in contact with were all knowledgeable, respectful, and patient with my questions. Excellent customer service. ", "rating": 5}, {"title": "The most helpful ", "text": "Everyone I worked with was a professional specially my agent Whitney she went above and beyond to help me resolve unforeseen issues. 3rd loan with Rocket and likely 3 of many more to come. They are the Best.", "rating": 5}, {"title": "Great communication - simple process", "text": "Great communication throughout the whole process. The online daily tracking of open tasks was super user friendly. The staff stayed in close contact throughout the whole process.", "rating": 5}, {"title": "very helpful step by step through all…", "text": "very helpful step by step through all the paperworks , thankyou Tyler spent so much time explained for me  every details, my english kind a basic ", "rating": 5}, {"title": "Very knowledgeable and helpful people", "text": "Rocket was thorough and accurate.  Our mortgage was a bit unusual - a cash out on a rental property while living outside of the country.  It posed a few difficulties, but they always found an acceptable solution.  I am very happy with both the product and the people at Rocket I dealt with.", "rating": 5}, {"title": "Very helpful & satisfied ", "text": "The staff was great and very helpful. Explained everything so well that you can understand.  Every step if the way RM was there.  If there was an issue RM had a solution and made you feel at ease.", "rating": 5}, {"title": "Rocket contacted me a soon as I reached…", "text": "Rocket contacted me a soon as I reached out with interest in purchasing my first home. From the moment we spoke to the moment I closed on my home it was smooth sailing which made it a great experience. I definitely recommend!!", "rating": 5}, {"title": "Desean's dedication", "text": "Desean's dedication, expertise, patience, and friendly approach made our experience enjoyable. Not only was Desean always available, helpful, and had our best interests in mind He was a true professional and was very easy to get in touch with.", "rating": 5}, {"title": "Our refi process has been great", "text": "Our refi process has been great! There was always communication with the process and easy signing. Very quick!", "rating": 5}, {"title": "Great company", "text": "When we started the process, getting pre approved for a loan was given instantly.  We started looking for houses but had not found the one in the given time of the approval letter, got extended on the pre approval for another 3 months, once we found the house, everything went so quickly and we closed in two weeks.  Pamela Hightower was on top of everything and handled issues efficiently and had no delays.  We closed on our house and the next day we signed on our new one.  We definitely would use Rocket mortgage again in any future purchase.", "rating": 5}, {"title": "Great experience!", "text": "Everything went smoothly, no major problems the people we worked with were all very professional and helped us every step of the way, I'll never go anywhere else more my mortgage needs!", "rating": 5}, {"title": "Rocket Mortgage is a great lender!", "text": "The team at Rocket Mortgage was great in helping us obtain a loan for a home we wanted to purchase. They were friendly, timely, and willing and able to answer all of our questions. They communicated clearly and stayed one step ahead of what was needed throughout the process. They gave us a good interest rate and helped us keep our costs down.", "rating": 5}, {"title": "The process was so easy", "text": "The process was so easy.  Not a lot of stress trying to get paperwork together and submitted.  The best part I had wonderful person, Nick, helping get things together.  He was so patience with me. He explained everything and I honesty felt very good comfortable with my decision.", "rating": 5}, {"title": "Don’t wait - call them - you will be glad!", "text": "Great guidance through the process by our rep. Excellent first class company to deal with. Organized, communicative, trustworthy and a GREAT decision to get our finances under control and save money. Highly recommend!", "rating": 5}, {"title": "Amazing experience!", "text": "We had an amazing experience with Rocket Mortgage, and Mike El Sayed more specifically. They were great partners and resource for us throughout the process. Mike was very caring and made us feel heard and considered. He was very knowledgeable and proactive. He tried to make everything easy for us and make sure we got the best deal. Communication was great, always responsive even on weekends and late in the evening. We would highly recommend!", "rating": 5}, {"title": "Things went smoothly and when I wasn't…", "text": "Things went smoothly and when I wasn't sure about something, there was always someone to talk to. Everyone had the knowledge to answer my questions. I did however wish so much of it would have not been over the internet, beings I'm not comfortable with same.", "rating": 5}, {"title": "Daniel was incredible", "text": "Daniel was incredible! Very knowledgeable and responsive! Made it easy and smooth. ", "rating": 5}, {"title": "Quick & Extremely Professional Service", "text": "This is our second loan with Rocket Mortgage and we will continue using and recommending them in the future as they have made both processes quick, professional, and extremely simple for us.  Nick Yatooma was incredible, kind, and answered each and every question we had in expedient manner.", "rating": 5}, {"title": "Excellent company to work with.", "text": "I got home from work today and had a beautiful new roof and you can't tell that anyone was here today?", "rating": 5}, {"title": "Raymond Alexander was very easy to work…", "text": "Raymond Alexander was very easy to work with from the start.  He was great about following up with my husband and myself throughout this entire process, even after closing.  A class act.  He was a good listener as well.", "rating": 5}, {"title": "Help was always readily available", "text": "Help was always readily available, everything was completed when I needed it.", "rating": 5}, {"title": "Refi w a perfect ending", "text": "Refi was easy, smooth and perfect ending. Kudos to my Rocket refi manager Christopher Chalkley.", "rating": 5}, {"title": "Alex and Chris made the process so much…", "text": "Alex and Chris made the process so much easier than expected. At the end Chris called me every day to check on me and make sure I didn’t have any questions. I even referred my son to Alex. Pray they are homeowners in 2025. ", "rating": 5}, {"title": "Thank You!", "text": "Stephen was awesome!  Everything on our end went very smooth from start to finish.  There were some bumps as the loan progressed closer to closing as the realtor and title company had trouble getting a hold of the correct person because our \"person\" kept changing.  Stephen helped a lot with that.  That is the only thing I think that could be improved is to have one \"go to\" person for everyone and the logistics of change be handled by the same person always.", "rating": 5}, {"title": "Isaiah was a great help", "text": "Isaiah was a great help. Always said if I have any questions call him. Process was organized and easy to adhere to. It was a good experience.", "rating": 5}, {"title": "Excellent customer service", "text": "Excellent customer service. Miro was knowledgeable and walked us through the process. Miro kept us up to date on the progress. Quick and easy. Highly recommend Rocket Mortgage.", "rating": 5}, {"title": "Matthew MillerFrom staer to finish people did what…", "text": "From staer to finish people did what they said they were going to do and followed through. Mathew Miller was a All Star and should be very high up in your company!! ", "rating": 5}, {"title": "My experience with Rocket Mortgage was…Outstanding!", "text": "My experience with Rocket Mortgage was outstanding. Shumel Karagalinsky was the most outstanding part of the experience. From the moment I started talking to him, he walked me through each step of the loan process with the patience of a saint. I was so impressed with my lack of knowledge and his patience and talking me through each step.", "rating": 5}, {"title": "Everyone did a great job putting this…", "text": "Everyone did a great job putting this program together! We are very happy with the results and the closing. David Paddick did a wonderful job with Everything.Thank you very much!", "rating": 5}, {"title": "Rocket mortgage was very helpful and…", "text": "Rocket mortgage was very helpful and answered all our questions.", "rating": 5}, {"title": "Rocket Morgagw customer service always…", "text": "Rocket Morgagw customer service always kept me informed of and documentation needed and treated me with respect. I was able to do my closing quick, thorough and fast with no hesitation. I would definitely recommend Rocket Mortgage  to family and friends.Thank you Rocket Mortgage Family!", "rating": 5}, {"title": "Very competent", "text": "Very competent, able people to work with. No problems-good process start to finish!  Well done.", "rating": 5}, {"title": "Very friendly ", "text": "Katelin Haught was friendly and helpful and went out of her way to be helpful and address any concerns. Similar to the experience we had when we did our refi with Rocket.", "rating": 5}, {"title": "Brandon Kappeler", "text": "Brandon Kappeler, he is a wonderful and knowledgeable person. He is great at his job.", "rating": 5}, {"title": "Easiest refinance, amazing rep!", "text": "1st, Scott Cleason was AMAZING!  He was thorough, kind, knowledgeable and was so proactive to make this process easy and fast! I could even text him anytime if I had questions...which i used a few times! I hope I get him the next time we use Rocket Mortgage for home improvements soon!", "rating": 5}, {"title": "Agent was very helpful and good at…", "text": "Agent was very helpful and good at solving all problems that came up ", "rating": 5}, {"title": "Knowledgeable people and process", "text": "Our loan representative Lisa James was so knowledgeable and helpful. She answered all answers and requests and made the whole process so much simpler than the other places we had contacted.", "rating": 5}, {"title": "It was a fast and easy experience", "text": "It was a fast and easy experience. No problem and easy to talk about your journey in this experience they really know their stuff.", "rating": 5}, {"title": "Flawless!!!", "text": "From the beginning to the end, this refinancing process was remarkable. The team left nothing on the table that was confusing. Each step of the process was professionally handled in a timely manner.", "rating": 5}, {"title": "Fast and Easy Process", "text": "The entire process from start the initial application to the closing was without a doubt the easiest process I have gone through when dealing with a refinance/mortgage. The entire crew that was on our refinance was top notch, polite friendly and super knowledgeable. I would and shall recommend Rocket Mortgage to any of my family and friends looking to do a refinance!!", "rating": 5}, {"title": "Fast", "text": " Everyone that worked with us was helpful, fast, and refinance was done quickly", "rating": 5}, {"title": "I would like to say this process of my…", "text": "I would like to say this process of my mortgage was an amazing process to do. From the beginning of the process to the end was very smooth and without any issues. I would highly recommend Rocket Mortgage for anyone who is looking to purchase a home.", "rating": 5}, {"title": "Ryan and Rocket are a winning team", "text": "Ryan Craven really made the whole experience pleasant and easy. He took the time and patience to explain everything to me, and the website was easy to navigate.", "rating": 5}, {"title": "Very professional", "text": "Very professional, always kept us updated. Answered all of our questions in a timely manner.", "rating": 5}, {"title": "Your Team working with me explaining…", "text": "Your Team working with me explaining everything & being experienced showing me the way & making sure I understand what was happening you have a awesome team.", "rating": 5}, {"title": "Very good experience", "text": "Very good experience! Jessica was very professional and helped me through the whole process! Very pleased!", "rating": 5}, {"title": "Camera made it easy to do business", "text": "Camera made it easy to do business. The app was wonderful. Everything that I needed was there. Rocket Morgage did a wonderful job I would recommend for anyone.", "rating": 5}, {"title": "Quick and Easy Mortgage Process", "text": "Other than needing documents I have never needed with prior refinances causing additional costs and time the financing process with Recent Mortgage was quick and easy. Every person I spoke with was helpful and friendly.", "rating": 5}, {"title": "I recommend. reliable and effective", "text": "I recommend it. It was a very easy and quick process. They were attentive to every step and every detail. a team of very friendly professionals who are confident in what they are doing", "rating": 5}, {"title": "Nadis and Maria are amazing and made…", "text": "Nadis and Maria are amazing and made the process easy. Maria helped me navigate online otherwise I wouldn’t have been able to do it. Thankful for both.", "rating": 5}, {"title": "Professional, knowledgeable and friendly ", "text": "Although it was slow, it always is but all lenders and other were knowledgeable and professional. Helped me through some on line signing or other. The tasks to complete was a good way to keep track. People also replied to my emails promptly. ", "rating": 5}, {"title": "The staff at Rocket Mortgage made my…", "text": "The staff at Rocket Mortgage made my refinance simple and painless.  They handled everything from start to closing.  Special thanks goes out to Billy, he was assume to work with.", "rating": 5}, {"title": "From start to finish the process was…", "text": "From start to finish the process was seamless and the people we dealt with were professional, knowledgeable,  and personable. The entire process took about a week.", "rating": 5}, {"title": "Just incredibly easy to do a refi", "text": "Just incredibly easy to do a refi. Appl to disbursement in less than 2 weeks", "rating": 5}, {"title": "I was pleased by the ease of the…", "text": "I was pleased by the ease of the transactions.  Doing the paperwork on line was without problems.", "rating": 5}, {"title": "Excellent Bankers with their heads on", "text": "Excellent Bankers with their heads on, guidance from their knowledgeable staff helped to make our loan process work for us. We give a 10 to all we worked with.", "rating": 5}, {"title": "Great customer service", "text": " Your representative Mario Bizzee was very helpful throughout the application and closing process. He listened and responded to all of our questions. He was thorough and the entire process went smoothly.", "rating": 5}, {"title": "Home Equity Loan", "text": "The entire process was very easy. There was communication every step of the way, which was excellent and reassuring. We knew exactly where we were during the process.", "rating": 5}, {"title": "Rocket Mortgage notified us every step…", "text": "Rocket Mortgage notified us every step of the way, was very quick and was extremely helpful!  I’d recommend them to everyone!!! ", "rating": 5}, {"title": "Happy Again", "text": "I dwelled on this decision for awhile and it was a hard decision to make because there are a lot of scammers out there and I wanted to be positive that I chose a reputable company. The service was comforting, knowledgeable and thorough and made the process easy. ", "rating": 5}, {"title": "Rocket Mortgage & Personnel ", "text": "Rocket Mortgage including their exceptional loan processors and closing agents provided outstanding products and services to fit my needs. All were very thorough and professional and communicated throughout the process from initial contact to closing. ", "rating": 5}, {"title": "Moose was amazing", "text": "Moose was amazing. Everyone we talked to explained things really well. They are all very nice and understand customer service. ", "rating": 5}, {"title": "The website is extremely user friendly…", "text": "The website is extremely user friendly and with contacts information available. What a breath of fresh air.", "rating": 5}, {"title": "Zionis was knowledgeable", "text": "Zionis was knowledgeable, professional and answered all of my questions. He explained the process and was very helpful as needed.", "rating": 5}, {"title": "Highly recommended ", "text": "Applying for the loan was quick, easy, and professional. Just had to wait a few days for the loan to be processed. ", "rating": 5}, {"title": "Outstanding Care", "text": "The whole team at Rocket did an amazing job. They were very easy to work with. They actually called and spoke with me.  They kept me in the loop with emails of what to expect next and what to do afterward.There was only one thing I did not like which is out of the control of Rocket. We received a tone of calls from other lenders wanting to offer us loans. ", "rating": 5}, {"title": "At first it was terrible but I am happy with terms and rate", "text": "At first it was terrible,  they kept telling me that my credit dropped.   But it had not.  I had been thru this run around enough times to know to call someone on the board of directors.   And oddly enough every time I do that  suddenly someone can help so easily. *yes I have had to do so more than one time just to be allowed to pay the inherited mtg.\"   ", "rating": 5}, {"title": "Online process made submitting data…", "text": "Online process made submitting data reasonably easy. Eric my loan officer was very helpful solving problems with iPad compatibility. Rate is a bit high but reasonable.", "rating": 5}, {"title": "Very professional and helpful ", "text": "My mortgage went very nice and no real stress!! My mortgage helper was very understanding and really helpful! I’m older so I’m not that good with online things but Mo worked with me all the way!! Thank You Sir!!", "rating": 5}, {"title": "Quick and efficient", "text": "Quick and efficient.  Mr. Holder was professional and easy to work with.  Very knowledgeable about job and service he was providing.  ", "rating": 5}, {"title": "Everything went great!", "text": "Everything went great!!  Kiyah Powell was super responsive and helpful. I will definitely reach out to him again!!Thank you all for literally EVERYTHING!!!  😊 ", "rating": 5}, {"title": "Most streamlined process ever", "text": "Most streamlined process ever. Was kept informed step-by-step.  Company, representatives are friendly and knowledgeable.", "rating": 5}, {"title": "The ease of the whole process and peace…", "text": "The ease of the whole process and peace of mind , knowing that rocket was handling everything. ", "rating": 5}, {"title": "Everyone was courteous", "text": "Everyone was courteous, knowledgeable,and always willing to help us understand the process. I would highly recommend them to everyone!!!", "rating": 5}, {"title": "Everyone i talk to was marvelous ", "text": "Everyone i talk to was marvelous . Chris was the best. I'd recommend Rocket Mortgage and Chris to Everyone ", "rating": 5}, {"title": "The knowledge and help that was…", "text": "The knowledge and help that was provided to me as a first time buyer.", "rating": 5}, {"title": "Heneveld", "text": "Heneveld, Scott is a great person to work with I'd give him 10 stars if I could Courteous.And quick to respond. ", "rating": 5}, {"title": "Great experience", "text": "Great experience, easier than buying a car!  Very pleasant people.  Mark Hanna is a credit to your organization.", "rating": 5}, {"title": "Ease of making my loan complete", "text": "Ease of making my loan complete. Personal that worked with me were professional and helpful in every way.", "rating": 5}, {"title": "Everyone who I had to talk to regarding…", "text": "Everyone who I had to talk to regarding this process was knowledgeable and explained everything about the mortage and loan to me and my husband. ", "rating": 5}, {"title": "Rocket Review", "text": "Clear instructions. Helpful humans. Delivered on promises. Easy to understand processes. ", "rating": 5}, {"title": "Great communication", "text": "Great communication, answers all the questions I had. Very easy transaction. All was done as scheduled. ", "rating": 5}, {"title": "FAST AND ACCURATE SERVICE", "text": "FAST AND ACCURATE SERVICE. BEST MORTGAGE COMPANY THAT I HAVE EVER DEALT WITH.  HIGHLY RECOMMENDED. ", "rating": 5}, {"title": "Easy Breezy !!", "text": "Every one we dealt with was just great, couldn't have been better.  ", "rating": 5}, {"title": "very friendly and personable kept me up…", "text": "very friendly and personable kept me up on what was happening             Gery LeBlanc", "rating": 5}, {"title": " JD Powers award. The choice was easy.", "text": "The largest mortage company, with excellent reviews and 4.1 ratings, and the process was fast and simple, and The JD Powers award. The choice was easy.Billy S.", "rating": 5}, {"title": "My Rocket Mortgage Experience", "text": "My experience was great from start to finish. ", "rating": 5}, {"title": "This was mostly a painless", "text": "This was mostly a painless, easy experience. They communicated exceptionally well & fast. I would recommend this for anyone. ", "rating": 5}, {"title": "I was pleased with Rocket Mortgage…", "text": "I was pleased with Rocket Mortgage Company in helping us with refinancing and work out perfect. ", "rating": 5}, {"title": "PROCESS WAS EASY AND VERY USER FRIENDLY…", "text": "PROCESS WAS EASY AND VERY USER FRIENDLY AND THE BACK UP EMAILS ON TASKS WAS GREATMY REPRESENTATIVE WAS ALSO GREAR AND ALWAYS THERE TO HELPWYNGEE", "rating": 5}, {"title": "Super friendly and accommodating", "text": "Everything worked out as planned and discussed previously. Everyone was super friendly and accommodating.", "rating": 5}, {"title": "Ryan was very helpful and professional…", "text": "Ryan was very helpful and professional every step of the way. Great remote refinance experience that I would recommend to anyone who is busy. ", "rating": 5}, {"title": "My experience was very good with Rocket Mortgage was…", "text": "My experience with Rocket Mortgage was very good,they was very helpful and I would recommend them to anyone.", "rating": 5}, {"title": "The experience was very smooth", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "Everyone was knowledgeable and very…", "text": "Everyone was knowledgeable and very considerate and efficient. Thank you", "rating": 5}, {"title": "Rocket Mortgage was a breeze to work…", "text": "Rocket Mortgage was a breeze to work with on our home equity loan. We closed in less than 30 days. ", "rating": 5}, {"title": "Great Experience", "text": "Albert was the ultimate professional. My loan was processed quickly and efficiently!", "rating": 5}, {"title": "Everyone was helpful at every step in…", "text": "Everyone was helpful at every step in the process. Everyone explained each part clearly to me. ", "rating": 5}, {"title": "Quick and easy process", "text": "Quick and easy process. Especially for a business owner. ", "rating": 5}, {"title": "Ease of closing process", "text": "Date of experience: October 31, 2024", "rating": 5}, {"title": "Easy process and great experience", "text": "Easy, great analysts, excellent products", "rating": 5}, {"title": "Great experience ", "text": "Matt Ryan was wonderful and very knowledgeable and helpful . I plan on referring several of my friends to Rocket Mortgage. ", "rating": 5}, {"title": "This was a simple and positive…", "text": "This was a simple and positive experience. All I came in contact with where professional and kind. ", "rating": 5}, {"title": "Had a great experience with Rocket…", "text": "Had a great experience with Rocket mortgage. Very easy and quick.", "rating": 5}, {"title": "The customer service was awesome", "text": "The customer service was awesome. Closing and paperwork was super simple.", "rating": 5}, {"title": "My Rocket Mortgage Experience ", "text": "Everyone involved was efficient, professional and guiding through the process at laymen’s terms. I appreciated the feedback, direction options and experience from individuals in this Mortgage Industry…", "rating": 5}, {"title": "When I needed help Rocket Morgage was…", "text": "When I needed help Rocket Morgage was there for me. I like how they talked to me about everything They made me feel that I was imported.", "rating": 5}, {"title": "how helpful everyone was.", "text": "Date of experience: November 02, 2024", "rating": 5}, {"title": "From start to finish", "text": "From start to finish, all questions were answered and the loan was closed in weeks", "rating": 5}, {"title": "Everything was easy and multiple…", "text": "Everything was easy and multiple individuals kept me informed throughout the entire process. Would recommend Rocket to anyone.", "rating": 5}, {"title": "Awesome Experience!", "text": "Our rep, Jamal was very patience and professional. Always accessible to answer any questions.", "rating": 5}, {"title": "Dallas was very insightful and very…", "text": "Dallas was very insightful and very informative Simplified the process so it best suited our needs ", "rating": 5}, {"title": "Pretty amazing from start to finish", "text": "Pretty amazing from start to finish.  Professionals all the way around. ", "rating": 5}, {"title": "Great experience", "text": "Great experience, fast closer . Not a lot of paperwork ", "rating": 5}, {"title": "Handled very professionally.", "text": "Handled very professionally.Great interest rate and quick closing. ", "rating": 5}, {"title": "Just a very positive and supportive…", "text": "Just a very positive and supportive process due to the personnel involved from start to finish.", "rating": 5}, {"title": "Great customer service", "text": "I worked with someone that was very knowledgeable and friendly and helped me every step of the way. ", "rating": 5}, {"title": "Smooth and as quick as needed", "text": "Smooth and as quick as needed, highly recommended.", "rating": 5}, {"title": "Easy process and clear.", "text": "Easy process and clear. ", "rating": 5}, {"title": "Super easy and convenient to work with.", "text": "Super easy and convenient to work with. ", "rating": 5}, {"title": "Mike our loan re-fi officer makes a loan Fun!", "text": "Mike our loan re-fi officer.......OUTSTANDING.", "rating": 5}, {"title": "Quick", "text": "Quick, no complicated requirements, fully digital, upfront, great support", "rating": 5}, {"title": "Very easy to navigate ", "text": "This was a very easy process. I appreciated being able to upload the necessary documents. ", "rating": 5}, {"title": "Great service", "text": "Great service, friendly people, quick process ", "rating": 5}, {"title": "Our point of contact", "text": "Our point of contact, Kyle, was very responsive and informative. ", "rating": 5}, {"title": "Everything ran smoothly and Devin was…", "text": "Everything ran smoothly and Devin was very patient and helpful.", "rating": 5}, {"title": "very professsional", "text": "very professsional, caring, informative. great communication skills and easy to contact", "rating": 5}, {"title": "What a great experience.", "text": "Great agent great people around her great work all the way around.", "rating": 5}, {"title": "Quick and easy", "text": "Quick and easy, everything went without a hitch. A lot of stress was quickly relieved. ", "rating": 5}, {"title": "Wow and thanks!", "text": "Very professional and pain free process! Excellent communication and appreciated all Moe's expertise.Thank you kindly!!", "rating": 5}, {"title": "Fast", "text": "Fast, courteous and knowledgeable service.", "rating": 5}, {"title": "Communication", "text": "Communication,  caring, helpfulness, listening to the needs and working towards that goal.", "rating": 5}, {"title": "It was a seamless process", "text": "Date of experience: October 25, 2024", "rating": 5}, {"title": "it was very easy and the loan officer…", "text": "it was very easy and the loan officer was Greattt!  He deserves a raise in pay", "rating": 5}, {"title": "Fast and smooth process.", "text": "Date of experience: November 02, 2024", "rating": 5}, {"title": "They were fantastic.", "text": "They were fantastic.  ", "rating": 5}, {"title": "Very straightforward and smooth process", "text": "Date of experience: October 24, 2024", "rating": 5}, {"title": "The process was very easy", "text": "The process was very easy, and everyone was very helpful", "rating": 5}, {"title": "Courteous", "text": "Courteous, professional and easy to work with.", "rating": 5}, {"title": "Teamwork", "text": "Paula Zombra was great. Held our hand every step of the way.", "rating": 5}, {"title": "Seamless from start to finish.", "text": "Seamless from start to finish. ", "rating": 5}, {"title": "Very Responsive ", "text": "Very Responsive . on Time .", "rating": 5}, {"title": "Wonderful and very easy to work with.", "text": "Date of experience: October 26, 2024", "rating": 5}, {"title": "The warmth", "text": "The warmth, clarity, and patience of your representatives. ", "rating": 5}, {"title": "Our key contact Moe did a Great job for…", "text": "Our key contact Moe did a Great job for us", "rating": 5}, {"title": "Smoothness of the entire process", "text": "Smoothness of the entire process ", "rating": 5}, {"title": "My advisor Monica Torres", "text": "My advisor Monica Torres ", "rating": 5}, {"title": "Very efficient and informative ", "text": "Very efficient and informative Smooth process", "rating": 5}, {"title": "Everything was great!easy to deal with!", "text": "Date of experience: October 31, 2024", "rating": 5}, {"title": "Job well done", "text": "Job well done! !!!! Hardly no  trouble. Everything was great.", "rating": 5}, {"title": "Process was quick", "text": "Date of experience: October 25, 2024", "rating": 5}, {"title": "Everything went fast and smoothly", "text": "Everything went fast and smoothly, thank you.", "rating": 5}, {"title": "Great service!", "text": "Date of experience: October 04, 2024", "rating": 5}, {"title": "Fast, and professional. ", "text": "Fast, professional, and easy process. ", "rating": 5}, {"title": "Great service", "text": "Great service ", "rating": 5}, {"title": "great people. fast service.", "text": "great people great service.", "rating": 5}, {"title": "Very easy to work with", "text": "Date of experience: November 02, 2024", "rating": 5}, {"title": "Very quick and easy", "text": "Very quick and easy. No surprises. ", "rating": 5}, {"title": "Rocket Mortgage Treats Their Customers with Great Respect", "text": "Customer Service was fantastic and timely updates", "rating": 5}, {"title": "Quick and very easy", "text": "Date of experience: October 31, 2024", "rating": 5}, {"title": "Everything was great and Theresa is the…", "text": "Everything was great and Theresa is the best ", "rating": 5}, {"title": "All went very seemlessy.", "text": "Date of experience: October 24, 2024", "rating": 5}, {"title": "It was a real easy process", "text": "It was a real easy process ", "rating": 5}, {"title": "Great service and communication", "text": "Great service and communication, easy documentation submitting process. ", "rating": 5}, {"title": "Great to work with", "text": "Great to work with.  Easy and quick.", "rating": 5}, {"title": "Expeditiously efficient", "text": "Expeditiously efficient ", "rating": 5}, {"title": "Great customer service", "text": "Date of experience: October 26, 2024", "rating": 5}, {"title": "Respectful", "text": "Respectful, timely correspondenceEase of execution", "rating": 5}, {"title": "The help was great", "text": "The help was great ", "rating": 5}, {"title": "Efficient", "text": "Efficient, organized, friendly ", "rating": 5}, {"title": "Knowledgeable", "text": "Knowledgeable, helpful, patient ", "rating": 5}, {"title": "The people thanks again", "text": "Date of experience: October 20, 2024", "rating": 5}, {"title": "Great experience.", "text": "Great experience. ", "rating": 5}, {"title": "Great experience!", "text": "Date of experience: October 21, 2024", "rating": 5}, {"title": "Customer service", "text": "Customer service ", "rating": 5}, {"title": "Great customer service.", "text": "Date of experience: October 21, 2024", "rating": 5}, {"title": "Very professional and efficient.", "text": "Very professional and efficient. ", "rating": 5}, {"title": "Willing to help", "text": "Date of experience: October 21, 2024", "rating": 5}, {"title": "Edmir was excellent ", "text": "Edmir was excellent Very patient and explained the process in detail ", "rating": 5}, {"title": "Everything went smooth", "text": "Everything went smooth! No worries, no hiccups, and no stress!", "rating": 5}, {"title": "Wow the fastest", "text": "Wow the fastest, smoothest, mortgage EVER.  Highly recommend!!", "rating": 5}, {"title": "professional", "text": "professional, rapid response", "rating": 5}, {"title": "Professional", "text": "Professional, knowledgeable team of people who helped us at all hours of the day or night, including weekends.", "rating": 5}, {"title": "Brent is awesome ", "text": "Brent little is awesome at what he does.  He helped me understand the Process.better then what I did. Rocket mortgage is a good to work with .thanks u", "rating": 5}, {"title": "Excellent is an understatement", "text": "Excellent is an understatement! Thank all of you so much. Dominic G was especially helpful, we will be recommending Rocket to our friends and family!", "rating": 5}, {"title": "Rocket mortgage is a great company to do business with company", "text": "Rocket mortgage is a great company.  Their personal is very knowledgeable,  attentive,  professional and courteous. ", "rating": 5}, {"title": "Very Impressed…", "text": "Process was so easy and non intimidating! Anyone we worked with was very knowledgeable and very quick to respond to any questions we had, I am not one to give reviews often but this company deserves the 5 star rating. We were very impressed just how smoothly everything went.", "rating": 5}, {"title": "quick & fast", "text": "quick & fast ", "rating": 5}, {"title": "Refinance ", "text": "The process was smooth and quick. ", "rating": 5}, {"title": "The people I worked with", "text": "The people I worked with, we're very proficient and explained everything very well, and everything was accomplished on a timely manner.", "rating": 5}, {"title": "The customer service is outstanding", "text": "The customer service is outstanding.  From start to finish everything is crystal clear.  There was no question left unanswered.  Very helpful staff and getting back to us no more than 24 hours after an email was sent. Love love love!!!", "rating": 5}, {"title": "They went above and beyond to help with…", "text": "They went above and beyond to help with very difficult sellers. ", "rating": 5}, {"title": "Buying a car was harder than buying a…", "text": "Buying a car was harder than buying a house through Rocket Mortgage- the easiest journey ever!! Thank you", "rating": 5}, {"title": "Fast and friendly", "text": "Date of experience: October 21, 2024", "rating": 5}, {"title": "It was a great experience", "text": "It was a great experience. Great group of people to work with. (Excellent Team Work)", "rating": 5}, {"title": "Alexis Sandoval was great", "text": "Alexis Sandoval was great, he helped me through the whole process.  All the people were professional, knowledgeable, and courteous. Answered all my questions and help move my loan forward.", "rating": 5}, {"title": "The agent was nice and willing to work…", "text": "The agent was nice and willing to work with me.", "rating": 5}, {"title": "So fast", "text": "So fast, easy, streamlined process. Special thanks to Dana Gold who facilitated the loan. ", "rating": 5}, {"title": "Painless Loan Process", "text": "Painless Loan Process - Rocket Mortgage made the loan process painless, easy, and quick.", "rating": 5}, {"title": "The overall process went well!", "text": "The overall process went well! ", "rating": 5}, {"title": "I’m glad that I switched to Rocket…", "text": "I’m glad that I switched to Rocket Mortgage while in the process of buying my home. Amazing experience for being a first time home buyer. Jordan was absolutely amazing and helpful and professional and patient. He got me the best deal and the process went so smooth and fast it was perfect. I absolutely will do business with him again and I definitely will refer him to anyone who is looking to buy a home. Thank you so very much for your patience and your help and time getting my family and I the home that I have been wanting for a long time. ", "rating": 5}, {"title": "Quick and kind service", "text": "I was contacted immediately when I started inquiring about a loan. From the first the first representative I talked to through the closing representatives, I was always treated with patience and kindness and all my questions were answered. The whole process went quickly and smoothly!", "rating": 5}, {"title": "Everyone I communicated with was very…", "text": "Everyone I communicated with was very knowledgeable and polite. The entire process was pleasant ", "rating": 5}, {"title": "Quick and easy  ", "text": "The process was quick, easy and very convenient.  We were very pleased with the speedy response and getting checks to pay off our debts so quickly.  Couldn't be happier with our experience.  ", "rating": 5}, {"title": "They made a very  lengthy and difficult…", "text": "They made a very  lengthy and difficult process as simple as possible.", "rating": 5}, {"title": "It has gone smoothly so far.", "text": "It has gone smoothly so far.No glitches yet. Everyone was knowledgeable helpful and friendly.", "rating": 5}, {"title": "Everything went smoothly and everything…", "text": "Everything went smoothly and everything went the way they said it would", "rating": 5}, {"title": "This was the easiest process", "text": "This was the easiest process! Ryan Rieck was wonderful. He provided great input and was clear and concise every step of the way. The rate we were offered was considerably lower than our prior one. We are saving over $2,000 a month. I would recommend Rocket Mortgage to anyone! ", "rating": 5}, {"title": "The banker worked with me all along the…", "text": "The banker worked with me all along the way and the services group was great", "rating": 5}, {"title": "Fantastic work ", "text": "Fantastic company that got everything done on time!  Thanks for the hard work and excellent work!", "rating": 5}, {"title": "Everyone was great Andy Bow helped so…", "text": "Everyone was great Andy Bow helped so much from the beginning of the process… and made this so easy … a big thank you to him… ", "rating": 5}, {"title": "Rocket Review", "text": "Extremely easy to work with and everything was done on time or sooner than stated.  ", "rating": 5}, {"title": "Hannah and group members were all A+!", "text": "My direct helper, Hannah, was always helpful and knew exactly what I needed to make the process proceed and complete! The other specialists were like wise qualified to assist me with paperwork!", "rating": 5}, {"title": "I still can’t believe Rocket Mortgage…", "text": "I still can’t believe Rocket Mortgage and my amazing Banker Zach Hammond made this a reality. I have been telling everyone I know because they made this refinance so smooth and so easy. Thank you for been an outstanding company! Im so glad I made the call to Rocket Mortgage. Thank you!", "rating": 5}, {"title": "Great process and easy to work with", "text": "Rocket mortgage were great to work with.  We closed super fast.   Their communication was excellent and responded to my questions very quickly.   Rates were competitive and everything done on line or through the app which I found extremely convenient.    I would highly recommend!", "rating": 5}, {"title": "The best", "text": "They go above and beyond and are so committed. ", "rating": 5}, {"title": "They made purchasing my own very easy…", "text": "They made purchasing my own very easy and I felt like they were taking care of me", "rating": 5}, {"title": "Everything was explained and all my…", "text": "Everything was explained and all my needs were met.", "rating": 5}, {"title": "Thankfulness ", "text": "Mr. Jason Boike was exceptionally exceptional. His, guidance, knowledge, professionalism, integrity, and honesty was much appreciated. The Refinance process was extremely thorough and streamlined for me. Easy breezy .. Once, I have, at least, 2 years experience .. I, will, be contacting Mr. Boike to apply for a 2nd Refinance for Home Improvements. ", "rating": 5}, {"title": " Processing Did a good job", "text": "Did a good job. Underwriter was a pain but that’s their job. Process software program was a nice  benefit . The program made it easy to send information without making copies and scans.", "rating": 5}, {"title": "Your expert team made ever step in the…", "text": "Your expert team made ever step in the process of getting our equity loan as easy and swiftly as possible.", "rating": 5}, {"title": "This was a great experience from start…", "text": "This was a great experience from start to finish. The staff was very helpful and friendly.", "rating": 5}, {"title": "Home refinancing", "text": "From my own experience, everything went well.My husband is the one that dealed with the company and our business for our home.", "rating": 5}, {"title": "Great people to deal with", "text": "From start to finish everyone we dealt with were fantastic!  There was no embarrassment or negativity!  Had answers to any questions asked!", "rating": 5}, {"title": "Stress free process! ", "text": "Every person that we interacted with was friendly, professional, efficient and compassionate. This truly was a stress free process. They worked well with the title company and realtor to ensure things kept moving forward at a really fast pace. Thank you! ", "rating": 5}, {"title": "Fast and simple", "text": "Fast and simple.  Austin with rocket was great and the people at the closing company were very nice and prompt ", "rating": 5}, {"title": "Thanks to armando barragán", "text": "Thanks to armando barragán, for the amazing job. He helped us out to get a great rates. He was very comprehensive and patient with us. Our second loan thah we work with him and he did a great job. ", "rating": 5}, {"title": "Great job done by all", "text": "Great job done by all! Ease of maneuvering the process. Friendly, efficient, knowledgeable, quick responses! Absolutely no issues! Thank you", "rating": 5}, {"title": "Effortless", "text": "Everything went perfect from start to finish.  Patient and professionals employees.", "rating": 5}, {"title": "Helpful and Patient", "text": "Everyone was very helpful and patient with me and the results where worth the time.  I would highly recommend them to anyone that wanted to borrow on their home.", "rating": 5}, {"title": "The experience was streamlined…", "text": "The experience was streamlined efficiently.  The customer service was excellent.", "rating": 5}, {"title": "Stress Free", "text": "Jose was a mix between professional and folksy. He provided professional guidance yet keep conversations light and stress free.", "rating": 5}, {"title": "The ease of the whole process.", "text": "Date of experience: October 18, 2024", "rating": 5}, {"title": "This refinancing our house was easy and…", "text": "This refinancing our house was easy and simple. ", "rating": 5}, {"title": "It was smooth", "text": "It was much smoother of a process than o expected. We received a great deal of help from our mortgage specialist Jed Bulson. He was a consummate professional and was will to explain everything I needed to know. He also was a great help with pricing even with the current market fluctuations.", "rating": 5}, {"title": "Very good experience over all.", "text": "Very good experience over all. ", "rating": 5}, {"title": "All online", "text": "All online, so wasy", "rating": 5}, {"title": "Professional staff available to answer…", "text": "Professional staff available to answer questions promptly ", "rating": 5}, {"title": "Rocket Mortgage - The Best", "text": "I have been a Rocket patron for over 20 years.  Again, they delivered exceptional service and care for me with a HELOC.  The best Mortgage Company in the business!", "rating": 5}, {"title": "Everything went smoothly for the most…", "text": "Everything went smoothly for the most part just a few issues with gaining paperwork that you guys needed from me, but all in all everything went smooth as silk", "rating": 5}, {"title": "Kudos to Rocket Mortgage", "text": "Kudos to Rocket Mortgage!  Johnie Zahka, I have to say, you set a new bar for outstanding service! Your responsiveness, proactive communication, and overall helpfulness were second to none. I felt like I was your top priority throughout the entire process and like I was working with a trusted friend, not just a business associate. Thank you for showing me what five-star service looks like! I have already referred a friend and will keep going!!!  Thank you again!!!", "rating": 5}, {"title": "Great Team To Work With", "text": "This was a great experience for me.  Evan Haggerty was very patient and guided me through every step. I had so many calls about refinancing but this by far was the best decision and I am glad I made it. ", "rating": 5}, {"title": "The Rocket Mortgage Team ", "text": "The whole Rocket Mortgage team is so easy to work with. They listen and figure out exactly what is needed. They are very efficient and caring. The paperwork is so easy to understand. The team is always there for questions, etc. The team makes you feel important and wants to help. This is our second loan with them. We are very pleased with Rocket Mortgage!", "rating": 5}, {"title": "cash out refinance", "text": "We did a cash out refinance.  The process was made super easy. Communication was amazing, someone was in constant contact with us day or night. Over all great experience. ", "rating": 5}, {"title": "I strongly recommend Rocket Mortgage…", "text": "I strongly recommend Rocket Mortgage for People who are purchasing a home. ", "rating": 5}, {"title": "The process from start to finish was…quick service ", "text": "The process from start to finish was smooth and quick.", "rating": 5}, {"title": "Forever grateful!!!", "text": "From start to finish, my family will be forever grateful for the experience. Rob Nelson,  Roberto, Roderick Rhodes and Jason Smith walked me thru the process. Even when I cried on many days the encouragement alone allowed me to keep going...for that I am grateful. ", "rating": 5}, {"title": "Super fast", "text": "Super fast!  Everything went very smoothly, was very clear and straight forward, and quick responses to any questions (although there weren’t many).  ", "rating": 5}, {"title": "This was a very quick and satisfying…", "text": "This was a very quick and satisfying process ", "rating": 5}, {"title": "Mortgage", "text": "MortgageWhen I first applied for a mortgage from Rocket,, the one thing that I didn’t like about their process was that it was impersonal and it felt disconnected.  I felt like my questions and needs weren’t being addressed and I lost a deposit in the process.  Fast forward to 2024.. even though hesitant I decided to give them a second try and this time I was more educated about the process.  I was pleasantly surprised with how smoothly the process was .. from beginning to end.  I was always made aware of where I was in the process of obtaining my mortgage.. I didn’t have to wait for answers..and I felt heard and understood.  I am pleased that they made changes that allowed for a pleasant experience in homeownership.  Would definitely recommend and reuse their services in the future if the need arise. ", "rating": 5}, {"title": "Thank you for all your guys help", "text": "Thank you for all your guys help. You guys were good. Thank you again.", "rating": 5}, {"title": "I feel the company was willing to go…", "text": "I feel the company was willing to go above and beyond to help us, we are a little older, my husband has some issues with communication, so we were very pleased with the extra time you afforded us to complete this process.     ", "rating": 5}, {"title": "Rocket 🚀 is the greatest! Hands down ", "text": "Second time buying a home with @RocketMortgage, and I must say, the experience was exceptional! They achieved a 10/10 rating. In 2019, I closed under 30 days, and in 2024, I managed to close even faster, in just 24 days! The customer service at Rocket was fantastic. They promptly responded to all my inquiries and simplified and stress-free the home-buying process for both transactions. Thank you, Rocket! 🚀", "rating": 5}, {"title": "Good experience from start to finish.", "text": "Good experience from start to finish.  ", "rating": 5}, {"title": "the hole process was easy and very fast", "text": "Date of experience: October 12, 2024", "rating": 5}, {"title": "Easy and very quick", "text": "Date of experience: October 10, 2024", "rating": 5}, {"title": "Very Quick and easy", "text": "Date of experience: October 12, 2024", "rating": 5}, {"title": "We are very happy", "text": "We were very happy with the way things went.  Lynasia was fantastic and answered all of our questions.  The process was fairly smooth and we would recommend Rocket Mortgage to anyone.", "rating": 5}, {"title": "Remote e-Signing makes the experience easy to fit in to your day. ", "text": "Ed Ford made the intake process painless for us. Answered all of our questions quickly and concisely with a pleasant demeanor. The app combined with remote e-signing and ability to pick any location for closing made the experience very easy.  ", "rating": 5}, {"title": "Alec", "text": "Alec.   Was the most personable person great to work with the whole process was very easy ", "rating": 5}, {"title": "Hamid was very knowledgeable & patient…", "text": "Hamid was very knowledgeable & patient with me throughout the process ", "rating": 5}, {"title": "Rapid response", "text": "Rapid response, courteous, professional, patient, knowledgeable and caring.", "rating": 5}, {"title": "Consistent", "text": "Consistent, pleasant and professional...Wonderful experience ", "rating": 5}, {"title": "Easy ", "text": "Mathew was responsive and helpful through the entire process", "rating": 5}, {"title": "Refi", "text": "This is my second loan with Rocket Mortgage. Zee worked with me through the refi and her patience and knowledge made the whole process much easier. I recommend Rocket Mortgage to anyone who is looking for a first or second mortgage.", "rating": 5}, {"title": "Paul was hard working", "text": "Paul was hard working, straight forward and very patient with me during the loan process.I would highly recommend Rocket Mortgage to any first time home buyer.", "rating": 5}, {"title": "Was a quick and easy process", "text": "Was a quick and easy process, from start to finish.", "rating": 5}, {"title": "Rocket mortgage made buying a home easy", "text": "Rocket mortgage made buying a home easy from start to finish. Their step by step to keep you informed did not leave you guessing. Hats off to this five star company", "rating": 5}, {"title": "Everyone was very professional and…", "text": "Everyone was very professional and helpful through our refinance process. The whole process was fast and easy to complete compared to prior loan companies we had worked with. Excellent service, I would highly recommend Rocket Mortgage!", "rating": 5}, {"title": "Provided real information about…", "text": "Provided real information about mortgage rates and the process to take cash out. ", "rating": 5}, {"title": "You have staff that is genuinely…", "text": "You have staff that is genuinely interested in helping find the product they need. I’m speaking specifically about RudyJarad.  He is definitely an asset to your staff. He is diligent, smart, very knowledgeable, and highly professional. He walked me patiently thru the process thru completion, was always available to clear my questions,  was smart in suggesting solutions , and never made me feel frustrated.  He went the extra mile in contacting other people to make sure they did their share of what was needed.  He made this process look easy.   I highly recommend Rudy to friends and family. ", "rating": 5}, {"title": "Wonderful experience!", "text": "Wonderful! The process was so easy and transparent. Our agent was even surprised of how informed the teamkept her!  She mentioned that even her local lenders don’t do that.", "rating": 5}, {"title": "Very Good and nice rep helped us…", "text": "Very Good and nice rep helped us through the process with out no flaws. always answered questions promptly. we know the rep done us right and was honest on all accounts this rep is a 5 star all the way!", "rating": 5}, {"title": "Everyone was very helpful and…", "text": "Everyone was very helpful and knowledgable and the process flowed so smoothly.  ", "rating": 5}, {"title": "Polite and fast", "text": "Polite and fast. The only problem was the payoff checks initially went to the wrong address, but these were promptly voided and reissued. We have received and mailed the checks.", "rating": 5}, {"title": "Samatra was so polite", "text": "Samatra was so polite, knowledgeable and professional throughout the whole process.  She is a jewel!!!Great experience with our refinance!", "rating": 5}, {"title": "The Rocket Mortgage refinance process couldn’t be more simple!", "text": "The Rocket Mortgage refinance process was simple and efficient. I always knew what was expected of me and what was in progress on the Rocket side.I had to call twice to ask follow up questions and, both times, received quick and knowledgeable answers.", "rating": 5}, {"title": "Excellent customer service and great…", "text": "Excellent customer service and great communication", "rating": 5}, {"title": "The efficiency and ease of the process", "text": "The efficiency and ease of the process. Fastest refinance I’ve ever experienced. ", "rating": 5}, {"title": "Good rate", "text": "Good rate. Very helpful. Quick to close. Thorough. Seamless. Thank you Summer ! ", "rating": 5}, {"title": "It was hassle free!", "text": "Date of experience: October 14, 2024", "rating": 5}, {"title": "Quick replies", "text": "Quick replies. Quick Approval Whole process went awesome. They made my first time home buying a wonderful experience.Thanks.  Jake and all .", "rating": 5}, {"title": "I had a great experience and and…", "text": "I had a great experience and and everyone I spoke to help me with my issues. ", "rating": 5}, {"title": "Easy process and didn't take too long.", "text": "Easy process and didn't take too long.  ", "rating": 5}, {"title": "Easy process", "text": "It was quick, easily understandable. ", "rating": 5}, {"title": "Very efficient an the people were great…", "text": "Very efficient an the people were great to work with! ", "rating": 5}, {"title": "the expertise and professionalism are…", "text": "the expertise and professionalism are more than I expected! the time it took for the whole process was amazing!", "rating": 5}, {"title": "very easy to do and they answered any…", "text": "very easy to do and they answered any questions I had right away", "rating": 5}, {"title": "You have a whole team at your…", "text": "You have a whole team at your fingertips. Every questions was answered immediately.Parker was amazing to work with and kept the process moving swiftly.>", "rating": 5}, {"title": "Communication was awesome", "text": "Communication was awesome ", "rating": 5}, {"title": "Closed in two weeks without any hassles.", "text": "Very easy to refi our home and get some cash out.", "rating": 5}, {"title": "Customer service and great…", "text": "Customer service and great communication.", "rating": 5}, {"title": "Great experience", "text": "Great experience! Everyone was very helpful and fast. ", "rating": 5}, {"title": "your people", "text": "Date of experience: October 10, 2024", "rating": 5}, {"title": "Caring and helpful to work with", "text": "This review is based on the serves provided to me by Noli Ladringan. Noli worked with me from August to about two weeks into September. Noli helped me to gather all the materials I needed to complete the loan. I will recommend Rocket Mortgage to anyone because of the care that was shown to me. The company's representative showed me that the company cared about its customers.There is only one thing I wished I could have kept the person I started with until it was time to turn me over to the closing team.  I still will give the Rocket Mortgage Company a 5-star rating.", "rating": 5}, {"title": "Great fast and fair service", "text": "Great fast and fair service.  Thank you", "rating": 5}, {"title": "Rocket mortgage is my go-to company for…", "text": "Rocket mortgage is my go-to company for my mortgage.  They make the whole process so easy, with one person that handles all questions and helps with any paperwork that needs submitted.  The whole experience is fast and as simplified as possible. ", "rating": 5}, {"title": "very attentive ", "text": "fully answered any and all questions I asked, regarding my purchase", "rating": 5}, {"title": "Cortni and Sebastien made the process…", "text": "Cortni and Sebastien made the process smooth even with a problem seller!", "rating": 5}, {"title": "So professional", "text": "So professional, informative quick easy closing.", "rating": 5}, {"title": "Smooth and easy", "text": "Date of experience: October 10, 2024", "rating": 5}, {"title": "This was an extremely well oiled…", "text": "This was an extremely well oiled process and we felt well supported.", "rating": 5}, {"title": "Amazing experience ", "text": "From start to closing, the entire process was easy and any/all questions were answered. There was never a time I was left wondering what I needed to do next or who to call. ", "rating": 5}, {"title": "Knowledgeable staff", "text": "Knowledgeable staff, Mathew Miller was outstanding very helpful always there through out the process. Thank you very much Rocket Mortgage.", "rating": 5}, {"title": "Rocket Mortgage is way above the rest", "text": "Dujon did a great job keeping me informed, guiding me, being patient, and suggesting things that were best for my overall intent.Please working with him as well.Also, the software, updates, and overall experience was excellent. I felt engaged, informed and cared for.", "rating": 5}, {"title": "Everyone was so helpful!!!", "text": "Date of experience: October 13, 2024", "rating": 5}, {"title": "Very nice workers", "text": "Very nice workers, it took extremely long to finely get my refinance completed ", "rating": 5}, {"title": "Very quick", "text": "Very quick, efficient, helpful service from beginning to end.", "rating": 5}, {"title": "Fast professional organization", "text": "Fast professional organization! Very knowledgeable, helpful and communicative! Easiest closing I have ever experienced!", "rating": 5}, {"title": "Simple and easy application.", "text": "Simple and easy application. ", "rating": 5}, {"title": "Fast", "text": "Fast, easy, never had to leave the house.", "rating": 5}, {"title": "Fast response, timely ,detailed process", "text": "Fast response, very informative sales agent, refinance procedure was on timeline followed by constane emails and text messages.  interest rate was in line with other banks.", "rating": 5}, {"title": "Amazing  Darr  took great care of me", "text": "Amazing  Darr  took great care of me  ", "rating": 5}, {"title": "Very fast and very professional", "text": "Very fast and very professional with better options.", "rating": 5}, {"title": "Super easy", "text": "Rocket makes the home loan process so easy.  Every Rocket team member I've had the pleasure of working with has been patient, knowledgeable, professional and accommodating.  They have always helped me find the best mortgage solution to fit my needs.", "rating": 5}, {"title": "Easy Process Friendly service", "text": "Date of experience: October 12, 2024", "rating": 5}, {"title": "Easy transaction", "text": "Easy transaction, pleasant people to deal with everything was handled in a timely mannor", "rating": 5}, {"title": "Michelle Blondin and her team were…", "text": "Michelle Blondin and her team were always ready to assist and answer questions.Very helpful and considerate.", "rating": 5}, {"title": "Great service", "text": "Great company to work with after some rather negative experiences dealing directly with my bank and credit union. Fast, easy process and excellent communications. By far the easiest refi/equity loan I've ever done. A++", "rating": 5}, {"title": "Easy process from start to finish", "text": "Easy process from start to finish! The dashboard really helped with navigating what needed to be completed! ", "rating": 5}, {"title": "Very fast and friendly.", "text": "Date of experience: October 05, 2024", "rating": 5}, {"title": "Efficient process with dedicated team…", "text": "Efficient process with dedicated team members. Especially liked the dashboard and e-docs. ", "rating": 5}, {"title": "MY Rocket Presentative", "text": "MY Rocket presentative, Taelor Westbrooke. She answered every question and to her time with me when there was some confusion on my part.", "rating": 5}, {"title": " Rocket Mortgage Review", "text": "I recommend Rocket Mortgage to anyone looking for fast, efficient services. Sam Gerling was excellent. He was professional and fast to respond to phone/text messages. More importantly, he knows his job, and other departments I came in contact with showed the same respect, courtesy, and service as my primary agent. I have only positive words for Rocket Mortgage and agent Sam Gerling.", "rating": 5}, {"title": "Seamless process going through the…", "text": "Seamless process going through the refinance. Staff were very helpful and patient. My only recommendation would be for staff to go through explaining each of my present credit cards and accounts that would be refinanced and allow me to determine whether I wanted to include them in the refinance. Some of my accounts were on a 0% APR for 2 years.", "rating": 5}, {"title": "On line ease.", "text": "Date of experience: September 13, 2024", "rating": 5}, {"title": "The ease of the process", "text": "The ease of the process. Nothing too hard to do.", "rating": 5}, {"title": "Mortgage ", "text": "Everything went great with my Refinance with Rocket Mortgage. My agent Steve Anderson was great on helping me with the process. Could not gave gone better. ", "rating": 5}, {"title": "You got us a home!!", "text": "You got us a home!! ", "rating": 5}, {"title": "Everything was great and professional", "text": "Everything was great and professional. Thank you for your help with my mortgage.", "rating": 5}, {"title": "Everyone was friendly and professional.", "text": "Very friendly and helpful and professional.", "rating": 5}, {"title": "Fast and efficient .", "text": "Date of experience: October 11, 2024", "rating": 5}, {"title": "Way2Easy!!", "text": "Date of experience: October 07, 2024", "rating": 5}, {"title": "Excellent customer service", "text": "Excellent customer service.  We felt that they worked on making this mortgage the best for US.", "rating": 5}, {"title": "Very professional", "text": "Very professional", "rating": 5}, {"title": "Prompt responses", "text": "Prompt responses. Honest answers. Quick turn around.", "rating": 5}, {"title": "The entire team was very knowledgeable…", "text": "The entire team was very knowledgeable patient and understanding they made this experience much better than we’ve ever had.", "rating": 5}, {"title": "Great experience", "text": "Great experience.  Sales was very helpful all the way through closing.  Thanks so much.", "rating": 5}, {"title": "Gene Hightower made my 1st time…", "text": "Gene Hightower made my 1st time refinancing a breeze.  Will use him and rocket again.Was only a minor problem after closing, something left off my insurance side.", "rating": 5}, {"title": "Experience getting a Home Equity Loan", "text": "Rocket Mortgage was easy to work with to get a home equity loan. Communication was clear throughout the process and took about 2 weeks to complete..  ", "rating": 5}, {"title": "Quick", "text": "Quick, easy, and pretty much done online.  Closing was quick and efficient.  Great experience.", "rating": 5}, {"title": "Great People!", "text": "Date of experience: October 10, 2024", "rating": 5}, {"title": "Chris was very helpful!", "text": "Chris was very helpful, knowledgeable and eager to help me and move quickly.  I enjoyed working with him! Thanks!", "rating": 5}, {"title": "Everything went well", "text": "Everything went well, great rep (Renee) helped me with every step of the process, with great input when I asked.", "rating": 5}, {"title": "Fast", "text": "Fast, friendly, no hassle process!", "rating": 5}, {"title": "Great experience ", "text": "Luke King did a great job helping me with my 2nd mortgage loan, I sincerely appreciate everything he did to make this fast & easy!", "rating": 5}, {"title": "You did great", "text": "You did great ", "rating": 5}, {"title": "Amazing!", "text": "It was amazing! Very straightforward and simple. Everyone involved especially John and Megan were incredible and very nice! Made the process so much less stressful. ", "rating": 5}, {"title": "Quick and efficient.", "text": "Quick and efficient. ", "rating": 5}, {"title": "Prompt and courteous service", "text": "Prompt and courteous service ", "rating": 5}, {"title": "Great experience ", "text": "There are plenty of other options for mortgage lenders out there and when I was considering a cash out refinance, I never thought I’d go with Rocket. I will credit a large part of the decision and the great experience to my loan officer, Kyle Esparza. He took the time to answer my questions and explain things in a transparent way, making me feel like he was on my side. We got what we wanted/needed in the process to build onto our current home. I’m very pleased.", "rating": 5}, {"title": "Cat and dog", "text": "Cat cat cat cat", "rating": 5}, {"title": "The rep that I started with", "text": "The rep that I started with, Gage Johnson made our refinance happen.  He was AMAZING.  He walked us through every single step.  Whatever you are paying him is not enough.  ", "rating": 5}, {"title": "Allison was excellent in answering our…", "text": "Allison was excellent in answering our questions and having a quick closing.", "rating": 5}, {"title": "Process was easy and timely", "text": "The whole process from start to finish was easy and quick.  I was extremely satisfied with the Representative who was with me the entire time.", "rating": 5}, {"title": "Great company to work with", "text": "Great company to work with. Gave ma a lot of info that was very helpful.", "rating": 5}, {"title": "Was helpful and explained everything…", "text": "Was helpful and explained everything perfectly ", "rating": 5}, {"title": "CLOSED ON MY HOUSE..", "text": "EMMANUEL AND MEGAN GUIDED ME THROUGH ALL.Very professional. I had a great experience.", "rating": 5}, {"title": "Eric Donelson made everything so easy", "text": "Eric Donelson made everything so easy, he was patient and knowledgeable", "rating": 5}, {"title": "The representative made the process…", "text": "The representative made the process easy and efficient ", "rating": 5}, {"title": "About as perfect as you could ask for…", "text": "About as perfect as you could ask for very quick and easy process", "rating": 5}, {"title": "Everyone was so kind and helpful", "text": "Date of experience: October 03, 2024", "rating": 5}, {"title": "The speed and consistency of Remortgage the whole…", "text": "The speed and consistency of the whole process.", "rating": 5}, {"title": "Use these folks!", "text": "The easiest process I've ever been through. Great from start to finish. ", "rating": 5}, {"title": "Pretty smooth and seamless process", "text": "Pretty smooth and seamless process. Everything was very straight forward and simple, with no hidden fees or surprises. The only issue I had was a notary that didn’t show up for closing, but I think that was an issue with the notary, not Rocket mortgage. ", "rating": 5}, {"title": "Everything was done quickly and…", "text": "Everything was done quickly and professional. I really appreciate the service we received from Rocket Mortgage.I’m ", "rating": 5}, {"title": "Great customer support", "text": "Gwyneth was very helpful and the process was very smooth and easy.", "rating": 5}, {"title": "Great experience", "text": "Great experience, good communication, fast service...you were totally aware of what was going on at all times.", "rating": 5}, {"title": "They were wonderfully kind and walked…", "text": "They were wonderfully kind and walked me through the entire operation. Was all very seamless. ", "rating": 5}, {"title": "You guys were on top of everything from…", "text": "You guys were on top of everything from the very start we appreciate all that you have done and stuck through with this from the beginning to the end I felt very comfortable with your services again thank you", "rating": 5}, {"title": "Rocket Mortgage is my hero!", "text": "The associates were always pleasant, professional and helpful. The software was super easy to follow. It was easy to submit the documents. I can't believe how easy Rocket Mortgage makes the whole process!", "rating": 5}, {"title": "Your people", "text": "Date of experience: October 06, 2024", "rating": 5}, {"title": "Impressed", "text": "I have been very impressed with my refi experience.", "rating": 5}, {"title": "From the beginning to end Rocket…", "text": "From the beginning to end Rocket Mortgage was fantastic!  They have carried our home loan for many years and we love their customer service, quick responses and honesty. ", "rating": 5}, {"title": "Is was easy to navigate,was always…", "text": "Is was easy to navigate,was always informed of the next step. The people were very helpful and knowledgeable ", "rating": 5}, {"title": "extraordinary", "text": "fast, friendly, knowledgeable personnel.Hit all benchmarks established by banker and his team.Easy to contact for questions ", "rating": 5}, {"title": "Excellent experience", "text": "Date of experience: October 04, 2024", "rating": 5}, {"title": "Initial banker 1 a great helper!", "text": "Initial banker 1 was the most helpful person that I have dealt with for this type of transaction. He explained the process in terms that I understood.  He made suggestions that helped me get the right amount of money and at a very good rate of interest.  ", "rating": 5}, {"title": "First time purchasing made easy", "text": "This was the first time i have ever purchased a home and the dashboard was so user friendly and easy to understand.  My loan specialist, Ara, was only a phone call or text away and was always quick to respond back.  Ara made this the most pleasant experience in a really stressful time.  I would definitely recommend Rocket Mortgage to anyone in the market.", "rating": 5}, {"title": "The people were great", "text": "The people were great! So patient and supportive.😊", "rating": 5}, {"title": "Everything and everyone!", "text": "Date of experience: October 03, 2024", "rating": 5}, {"title": "Fast", "text": "Fast, knowledgeable and helpful from the beginning to the end.  Thank you Hass and Rocket team.", "rating": 5}, {"title": "The process was quick and easy", "text": "The process was quick and easy. I was provided details every step of the way.", "rating": 5}, {"title": "I'm my first time home buyer and the…", "text": "I'm my first time home buyer and the experience was just awesome", "rating": 5}, {"title": "Everything went well..", "text": "Everything went well.. ", "rating": 5}, {"title": "From the beginning of the process to…", "text": "From the beginning of the process to closing everyone I encountered were extremely knowledgeable and caring. I would highly recommend Rocket to anyone looking to purchase a home. ", "rating": 5}, {"title": "Easy, fast, and great customer service! ", "text": "I'm so thankful that I was able to work with Rocket Mortgage to ger my house refinanced. It was such an easy process, even with me getting sick in between. We closed in about three weeks and it was fantastic. Thank you so much for your help and for getting us approved and closed! ", "rating": 5}, {"title": "Very organized and user friendly systems", "text": "Very organized and user friendly systems ", "rating": 5}, {"title": "Everyone I spoke with during the…", "text": "Everyone I spoke with during the process was so knowledgeable, helpful and friendly. ", "rating": 5}, {"title": "Very professional", "text": "Very professional.  Very thorough.", "rating": 5}, {"title": "We were sure to get the credit from the…", "text": "We were sure to get the credit from the beginning at the best interest rate. We want to pay as soon as possible. We have many projects ahead. Thank you.", "rating": 5}, {"title": "great company to deal with", "text": "Date of experience: October 06, 2024", "rating": 5}, {"title": "Agent was very patient informative and…", "text": "Agent was very patient informative and knowlegable", "rating": 5}, {"title": "The ease of applying for a Home Equity…", "text": "The ease of applying for a Home Equity mortgage (loan) and the team that I worked with.  From Ronnie, our first team member we met, to Anjelica the team member at our closing. All was efficient, smooth and professional. Would recommend Rocket Mortgage to anyone buying a home to someone wanting to update their existent home.", "rating": 5}, {"title": "Great communication", "text": "Great communication, no hassle, quick and accurate", "rating": 5}, {"title": "The process flowed smoothly", "text": "The process flowed smoothly ", "rating": 5}, {"title": "Rocket did great", "text": "Rocket did great! There was some missed communication, but once I learned who I needed to ask questions to. It went smoothly.", "rating": 5}, {"title": "Professional, responsive, and easy to work with.  ", "text": "Rocket Mortgage was very responsive and easy to work with from the start to finish of our new home purchase. They professionally took care of every detail. Their teams worked in advance of upcoming deadlines to professionally prepare for every need. ", "rating": 5}, {"title": "I am so thankful for Rocket Mortgage", "text": "I am so thankful for Rocket Mortgage. They've helped me immensely! The team that worked on getting my loan approved, including all the way to closing was amazing! Thank you again! ", "rating": 5}, {"title": "Great Experience!! ", "text": "Sean was extremely helpful and patient with me! I brag to my family and friends about my experiences with him! He’s AWESOME! ", "rating": 5}, {"title": "Very easy to work with", "text": "Very easy to work with. Very knowledgable  and answered all questions quickly. Very helpful and everyone I dealt with was very friendly.", "rating": 5}, {"title": "Fast", "text": "Fast, well documented and best service. ", "rating": 5}, {"title": "Kyle was very helpful and understanding…", "text": "Kyle was very helpful and understanding of our situation. He kept us informed and updated throughout the process just as he stated at the beginning. ", "rating": 5}, {"title": "It was a very fast process", "text": "It was a very fast process, Ricardo Melara and the whole team were great", "rating": 5}, {"title": "Mainly the whole operation was quick…", "text": "Mainly the whole operation was quick and smooth.  But importantly, you accomplished milestones when you said you would.", "rating": 5}, {"title": "Samantha Camilleri was very friendly…", "text": "Samantha Camilleri was very friendly and caring about our needs. She also was very knowledgeable with what Rocket Mortgage had to offer.", "rating": 5}, {"title": "My banker Jason was amazing from start…", "text": "My banker Jason was amazing from start to finish. He responded timely to my requests and educated me on the entire process. He was proactive with everything. I was able to close in TWO WEEKS, which I know is unheard of. The only issue I has was with my closing agent. I had to call them a couple times to get information on my closing. I was not given any directions on the process after closing and I am a first-time homeowner. ", "rating": 5}, {"title": "Fast and pain free!", "text": "Extremely friendly and knowledgeable. Initial contact to closing in 3 weeks. Typical paperwork requirements that were easily obtained and uploaded for their underwriting department. Closing on my schedule in my home. ", "rating": 5}, {"title": "The main person to help me with the…", "text": "The main person to help me with the whole experience was Adam.  He guided me to the application and answer each question that I had throughout the whole process.  There were a few other people who help but I cannot remember their names, but all and all, the team made it easy and user friendly. Cynthia Martinez", "rating": 5}, {"title": "Seamless Experience", "text": "My experience was made seamless because of my agent/representative Robert Messing.  He put me at ease in every aspect of what can be a taxing process.He was knowledgeable and reassuring.  He may not be a star like Deborah Messing but he is one to us!  Thank you, Robert!", "rating": 5}, {"title": "The caring staff that are willing to…", "text": "The caring staff that are willing to take the time to help their customers get through the process ", "rating": 5}, {"title": "Rocket Mortgage Rocks", "text": "The people at Rocket Mortgage were great!!!  Very knowledgeable, professional and guided me through the process step by step.  Always helpful and and returned my calls.  The application process was top of the line.  Followed the process on my phone, which included completed steps and any outstanding items needed on my side. Impressive!! Extremely easy to do business with Rocket.", "rating": 5}, {"title": "Easy communication and simple to follow…", "text": "Easy communication and simple to follow step by step instructions on the website. Also the ease at which I could send everything needed to the home loan experts.", "rating": 5}, {"title": "Fast and friendly got it closed in less…", "text": "Fast and friendly got it closed in less then 4 weeks", "rating": 5}, {"title": "The complete process from the begining …", "text": "The complete process from the begining  to the end. ", "rating": 5}, {"title": "We felt our mortgage application process was handled most carefully and with professional excellence by Rocket Mortgage. ", "text": "We felt our mortgage application was handled carefully and expertly, documents were expedited perfectly and our closing experience was pleasant, well prepared and instructive. Our signing agent, Samuel Swanson facilitated  the final step flawlessly and answered our questions perfectly.The entire loan process was clear, professionally handled and easily completed, augmented by the \"Your Loan Progress\" Rocket website online bulletins. \"Your Tasks\", \"Our Tasks\" and \"Completed Tasks\" reminders were most helpful. Thank you for a pleasant experience. We will remember to recommend Rocket Mortgage and Amrock to relatives and friends in the future.", "rating": 5}, {"title": "Quick and easy", "text": "Date of experience: October 04, 2024", "rating": 5}, {"title": "Fantastic experience ", "text": "The great work at being in communication. A very easy to use app and website. These things made the process quick and easy. ", "rating": 5}, {"title": "Excellent customer service ", "text": "Customer service is key with Rocket Mortgage and I am grateful receipt, I made one call and within just a few days my refini was approved. Excellent service.", "rating": 5}, {"title": "Process was very fast and easy.", "text": "Date of experience: October 03, 2024", "rating": 5}, {"title": "Everyone we worked with was polite and…", "text": "Everyone we worked with was polite and comforting and knowledgeable.  Service was quick and calls were always returned in a timely manner.", "rating": 5}, {"title": "It was great and everyone was so…", "text": "It was great and everyone was so helpful and getting this House. And I'm very thankful for that.", "rating": 5}, {"title": "Mortgage ", "text": "Everything was explained very well. Being older and explained even if had to do several times. So patient with us. Thanks for wonderful service", "rating": 5}, {"title": "Our agent", "text": "Our agent, Ruben, made the whole process very easy. He was very clear in his communication and explained the whole process.  He also found a way for us to pay off major credit card debt at minor cost to us.  I highly recommend Ruben and Rocket Mortgage. ", "rating": 5}, {"title": "Everyone was so helpful and patient…", "text": "Everyone was so helpful and patient with us seniors who are not as skilled on the computer as the younger generation. So appreciated that. So convenient to be able to get everything done right at home! Thanks!", "rating": 5}, {"title": "Helpful", "text": "Helpful, polite and organized team.", "rating": 5}, {"title": "the best", "text": "I have purchased and refinanced several times and i have never felt as good and relax will the complete process, thank you ", "rating": 5}, {"title": "Rocket Mortgage is on the top of my list.", "text": "Rocket Mortgage has been the most efficient, Professional and personable organization to deal with. This is the second time in seven years that I have utilize their services and have been very impressed with the organization and the people who have dealt with. At each step in the process of obtaining or Reworking a mortgage, I’ve known exactly what needed to be done with no doubts as to full process every step of the way.", "rating": 5}, {"title": "Great customer service & super…", "text": "Great customer service & super responsive ", "rating": 5}, {"title": "Happy customer ", "text": "Rocket Mortgage was patient while work on my loan. Everyone was very polite and helpful during the process. Made refinancing my home so easy. Would highly recommend Rocket Mortgage ", "rating": 5}, {"title": "Team members on all levels assisted and…", "text": "Team members on all levels assisted and help me navigate through the process with ease.  ", "rating": 5}, {"title": "Rocket Mortgage made my dream come…", "text": "Rocket Mortgage made my dream come true. I never thought I would own my own home. Mary was amazing and held my hand through the complete process, all the team members I worked with have been amazing. Words can’t describe how amazing my experience has been. Thank you Rocket Management for all you have done.", "rating": 5}, {"title": "A great experience", "text": "The process was quick and easy. The technology tools and app are amazing. My loan consultant, Elizabeth, was amazing and quick to answer all questions. My loan closed in 18 calendar days.", "rating": 5}, {"title": "Excellent experience ", "text": "From the star to finish it was a Breeze to do business with Rocket Mortgage. Excellent communication & prompt  response made me very comfortable and confident. I would recommend Rocket Mortgage to anyone who is looking for a reliable and responsive lender ", "rating": 5}, {"title": "My 2nd mortgage wi/ Rocket because they…", "text": "My 2nd mortgage wi/ Rocket because they earn the right for my business. My initial contact, Khalil Robinson,  was the BEST! He politely checked in with me frequently to see if I'd found the right home yet, & he was never pushy. Right to the finale, 3 month's later, he tailored the loan I could afford, was pleasant & extremely understanding. Talking me off the ledge numerous times. I'm a widowed senior, confident yet careful, with a Fixed income. He gave me hope that we could make this new dream come true, & We Did! What an exemplary employee,  all around very nice young man, 👏 & I tear up thinking about him. I can be a challenge & he took it in stride, assuring me we'd make this happen, & We Did. Thanks again, Khalil. I'm forever Grateful & wish you an abundant Life, full of great times & robust health.Cynthia D, Momma & Buster🙏🐾💕🫂", "rating": 5}, {"title": "The professional staff made everything easy.", "text": "The whole process was easy because everything was explained clearly and completely from the beginning. The job was handled professionally.", "rating": 5}, {"title": "Peumi Malagoda and Rocket Mortgage were Amazing ", "text": "Peumi Malagoda helped me at anytime and all the time along the way with my loan.  She kept me updated and was Always up to date on what I needed to do and where we were at in the steps of the loan process.  She was not only knowledgeable but kind as well.  Thank you Peumi, you set me at ease and made the process easy.", "rating": 5}, {"title": "Most seamless", "text": "Most seamless, streamlined experience ever.  EVERYONE we interacted with was 100% committed to helping and helping quick.  Being able to do everything online was more than a little helpful.  And we were actually able to sign the final closing papers at our house.  from the first phone call to closing was less than 4 weeks", "rating": 5}, {"title": "Everything was awesome", "text": "Everything was awesome ", "rating": 5}, {"title": "Consistent communications", "text": "Consistent communications, all questions were answered on a timely basis. ", "rating": 5}, {"title": "This was the easiest least stressful…", "text": "This was the easiest least stressful experience that we have ever had. Highly recommend.", "rating": 5}, {"title": "Loan officer made the process easy by…", "text": "Loan officer made the process easy by clearly explaining process from initial phone call all the way through to closing date", "rating": 5}, {"title": "Fast & professional", "text": "Fast & professional! Thank you!", "rating": 5}, {"title": "Quick and painless!", "text": "Date of experience: September 29, 2024", "rating": 5}, {"title": "The process was efficient ", "text": "The process was fast, easy and direct. Everyone involved was great to work with. ", "rating": 5}, {"title": "Point of contact Nick Sinning", "text": "Our main point of contact was Nick Sinning. He was fantastic to work with; knowledgeable, flexible, and patient! Rocket Mortgage has always been our preferred mortgage company to work with because they always make the borrowing process so simple! I truly feel that Rocket Mortgage are the leaders of the lending industry!", "rating": 5}, {"title": "We are very pleased with the services…", "text": "We are very pleased with the services offered. ", "rating": 5}, {"title": "Easy and quick refinance!", "text": "Date of experience: September 28, 2024", "rating": 5}, {"title": "Quick and easy", "text": "Quick, easy and professional!", "rating": 5}, {"title": "service", "text": "Experience was good because I know nothing about this new phone technology and I actually did it and you helped with that and didn’t turn me off because I don’t understand it thank you ", "rating": 5}, {"title": "Great advise and customer service.", "text": "Great advise and customer service. ", "rating": 5}, {"title": "Excellent service ", "text": "Smoothest closing ever", "rating": 5}, {"title": "Rocket Mortgage is AMAZING!!!", "text": "Rocket Mortgage is amazing!!!  We were able to refinance our mortgage, from loan application to closing, in 15 days!!!  Our refinance team was knowledgeable and led us every step of the way.  THANK YOU, ROCKET MORTGAGE!!!  I would highly recommend them to anyone needing a mortgage loan.", "rating": 5}, {"title": "They help with everything from the…", "text": "They help with everything from the beginning to the closing ", "rating": 5}, {"title": "While your company exceeded most of my…", "text": "While your company exceeded most of my expectations I would have liked the personal touch throughout (for instance my refinance was a debt consolidation) secured by the equity in my paid for home). The client services function I had to pursue on my own to status when the checks I would receive to pay my creditors off would be received and If I would be able to track their receipt to me.! Shouldn’t have had to pursue them - that process should have been made clear in writing. It wasn’t  made clear leaving me to have to pursue from my loan officer how it worked. We’re talking thousands of dollars in checks to me to pay off my creditors and being left in the dark on the matter after closing had occurred. Kind of scary- right?", "rating": 5}, {"title": "Great Service", "text": "Dealing with Rocket Mortgage was pretty seamless. We came to them late in the game and had an urgency to get things done quickly. Even with some hurdles along the way, we were able to get things handled and closed quick. They answered the phone the majority of the time, when they were not able to answer a return call was always received. They answered any questions we had and were there for us.Thank you Rocket Mortgage!", "rating": 5}, {"title": "I thoroughly enjoyed the professional…", "text": "I thoroughly enjoyed the professional of staff when working or speaking with me over the phone. It was very helpful to me how I was kept informed of the process from the beginning to the closing. The young man that came to my home seemed to be a little upset because I didn’t answer the phone when he called me on the day of the closing. My phone service at times is not the best. I tried to explain to him that I didn’t see where he called me. Initially he was not to pleasant but it all worked out. He completed the paperwork and was helpful as much as he could be. Thank you all the assistance and support the staff gave me. You all are the best. ", "rating": 5}, {"title": "The ease of the process", "text": "The ease of the process. the professionalism of the staff and speed of which it was completed. ", "rating": 5}, {"title": "Quick and easy", "text": "Quick and easy. Simple to understand.", "rating": 5}, {"title": "You Made it Easier", "text": "Personnel and computer submission of info requested.", "rating": 5}, {"title": "My Loan", "text": "All now time as described", "rating": 5}, {"title": "Easy peasy", "text": "Everything was smooth and simple. Couldn't of wished for a better experience with refinancing.", "rating": 5}, {"title": "Everyone was amazing!", "text": "Date of experience: September 30, 2024", "rating": 5}, {"title": "I had the best experience with Rocket…", "text": "I had the best experience with Rocket Mortgage. They were outstanding from the beginning to the end. I would highly recommend them. I will use them again in the future. ", "rating": 5}, {"title": "Helping out", "text": "Date of experience: September 29, 2024", "rating": 5}, {"title": "Lifesavers", "text": "Everyone was patient,helpful and professional!", "rating": 5}, {"title": "The personal care they gave me", "text": "The personal care they gave me ", "rating": 5}, {"title": "It was a very good experience because…", "text": "It was a very good experience because the people I worked with were very helpful and caring in helping me through the loan process.  I’m very thankful that it went so smooth.  They really cared about helping me through this loan process and I appreciated their expertise.", "rating": 5}, {"title": "Jason was great!", "text": "Date of experience: September 26, 2024", "rating": 5}, {"title": "Great Rocket Mortgage ", "text": "Rocket Mortgage did everything great.  We were very happy with our closing and still happy about it.", "rating": 5}, {"title": "People thruout the process were…", "text": "People thruout the process were informative, and actually I was very surprised how quick and painless you have made the process.", "rating": 5}, {"title": "Great company", "text": "Mariah made our experience with the entire refinancing process simple and stress free! ", "rating": 5}, {"title": "Fast service!!!wiw!", "text": "Date of experience: September 27, 2024", "rating": 5}, {"title": "Rocket Mortgage", "text": "All of the Rocket Mortgage Representatives were TERRIFIC.I would recommend Rocket Mortgage to anyone ! ", "rating": 5}, {"title": "Rocket rocks", "text": "Professional, courteous, friendly, and extremely helpful.", "rating": 5}]