[{"title": "Great company!!", "text": "They were very quick to respond to my emails. When I thought a delivery had gone missing. After dealing with USPS, I thought it had been stolen. They were quick to offer me a choice of solutions.  Turns out the husband had collected and forgot to inform his wife!! I didn't need a solution from them and was quick to let them know.  This company is very easy to deal with and I love their clothing!!", "rating": 5}, {"title": "I love rotita clothes.", "text": "I love rotita clothes.It has incredible quality, the fabrics are exceptional.Furthermore, their designs are original and current.I love them from their dresses, pants, bikinis...", "rating": 5}, {"title": "Had to return my order as too small", "text": "Had to return my order as too small, , live chat agent very helpful, so far impressed! hope the return goes well. UpdateThey did try to fob me off by offering store credit but have now refunded to my card and postage very reasonable, £3.99 , makes me think of using them again", "rating": 5}, {"title": "I recently received my order - Fair Price, Great Quality", "text": "I recently received my order, and I was very pleased with the quality of the items. They were well-made and arrived in excellent condition.I would definitely recommend Rotita to others. Thank you for the great service!", "rating": 5}, {"title": "I love this items very good quality and…", "text": "I love this items very good quality and best price ever ", "rating": 5}, {"title": "SUPER EASY RETURNS using Live Chat", "text": "Did a return using Live Chat. Was hesitant at first thinking I should have done this by e-mail but Live Chat return was soooo easy!!! They brought up the photos of my order and I chose what items to return, then they confirmed by showing me just those photos and then they provided me a Shipping Label that I copied off my phone and can print right away! This was way too easy!!! And my refund should come to me within the week. Will continue purchasing from this company and I had an excellent person do my return who was straight forward and not a lot of back and forth conversations! Quick and easy!!!", "rating": 5}, {"title": "What you really excelled at with this…", "text": "What you really excelled at with this purchase was customer service!!  I had a few questions about my order and your agents were very understanding and patient.  Your rep was very familiar with your swimsuits and helped me determine the right cut and fabric type for my water aerobics suits.", "rating": 5}, {"title": "Rotita does not disappoint.", "text": "Over the past few years, I have ordered many items from Rotita and I have never been disappointed. From swimsuits to shirts, the quality is exceptional. Every item I've received has been exactly as described and always fit true to size. ", "rating": 5}, {"title": "The ease at how the agent handled my…", "text": "The ease at how the agent handled my return, could not have done it without her help, thank you so much", "rating": 5}, {"title": "These were my first orders from Rotita…What a GREAT experience!", "text": "These were my first orders from Rotita and I was skeptical of how the experience and quality would be. I was SO pleasantly surprised!! I absolutely LOVE all my items! They are adorable and such great quality. I have gotten so many compliments on each item so THANK YOU for such a fab experience. I will definitely be ordering more and more!!", "rating": 5}, {"title": "easy to use site and great customer…", "text": "easy to use site and great customer service. Lots of modest wear and fun items to choose from", "rating": 5}, {"title": "Excellent customer services in regards…", "text": "Excellent customer services in regards to returns", "rating": 5}, {"title": "Very nice and helpful", "text": "Very nice and helpful. I had purchased a swim suit and needed a different size. So easy to return and get correct size..1st time I have interacted  with this company and have had very good experience.", "rating": 5}, {"title": "The Chat Agent was great at fixing my…", "text": "The Chat Agent was great at fixing my problem. However your \"ordering process via your website\" is STILL HORRENDOUS!!!", "rating": 5}, {"title": "Plus size clothing for us \"full…", "text": "Plus size clothing for us \"full figured\" gals that is true to size, fits well and looks flattering.  I'm talking the 3 b's - b**bs, belly and butt.  Cute tops and wonderful bathing suit ensembles.  SUPER FAST shipping for a website business.  I'll be going back for more! ", "rating": 5}, {"title": "Trying to sign on as guest for return is difficult", "text": "I was very frustrated to try & get a return label so I decided to try live chat and the girl answered all of my questions & sent me a return label pretty quickly.  I only wish I would have tried that first.", "rating": 5}, {"title": "I bought a swim suit last year still…", "text": "I bought a swim suit last year still looks brand new! I bought another color same style for this season! I recently had an issue with a discount being taken off they have went above and beyond getting it corrected!! ", "rating": 5}, {"title": "I enjoy all the clothes", "text": "I enjoy all the clothes, jewlery that is on sale at Rotita .com   . in Erie we cannot find besutiful clothes like you people display.. Besides I am getting older, and my body doesn;t want to  run around looking for lovely things.. You make it easier for us older group.  i WILL  continue shopping here,in the comfort of my own honme!!!", "rating": 5}, {"title": "Rep was very helpful and patient", "text": "Rep was very helpful and patient. Service was quick and professional.", "rating": 5}, {"title": "Every bathing suit I’ve gotten has been…", "text": "Every bathing suit I’ve gotten has been absolutely beautiful on! Very nice quality and a great but! I’ve gotten 7 this summer! I ordered some last year and they were great too but I’ve lost 128 pounds and I’m a size 4 but with a large top that’s my only complaint is the bottoms fit perfect but the tops not so much but that’s my fault! I will probably order more lol", "rating": 5}, {"title": "Company gives refunds ", "text": "Purchased 2 items and tried them on for 1 minute and returned them.  This is the message that I got back: \"We have received the returned clothing item, unfortunately, it doesn't meet all of our return criteria (unworn, without stains, and undamaged). We are unable to process a refund for this return.\"  I contacted the company and they are now giving me a full refund.", "rating": 5}, {"title": "Very happy as I was skeptical as I got…", "text": "Very happy as I was skeptical as I got burned from other companies and never received my product or refund.You were true to your word.  I place an order for 4 bathing suits which for some reason did not get the 4th free even though I put in promo code 4th free,  Besides that you said I would receive my pkg  by June 21/24- July 1st/24.  I received the pkg on June 20th/24 which I was over the moon happy.  I would definately order from yous again as finally A company I can trust.  Just one thing when you advertise 4th free can it be done somehow automatically as fir some reason when I put the code in didn't work so if the 4th is free maybe when we ard ordering it automatically comes up with the 4th free   I would hate to loose out on these deals because of a clique.  Thank you so much for being an honest company and I will let others know too.", "rating": 5}, {"title": "Sowshi was very helpful in answering my…", "text": "Sowshi was very helpful in answering my question regarding one item that I ordered that was left out of my delivery Sowshi is kind, understanding, very Customer-Centric. I give Sowshi 5 STARS. ~ Elena Rains", "rating": 5}, {"title": "Perfect fit", "text": "I purchased a two piece bathing suit that had a blouselike top and bottoms with a high waist.  The bottoms had the panties attached and they fix perfect.  The high waist was true to size and the material was light weight and did not sag to my knees when soaking wet getting out of the pool.  The material was nice and soft and I loved it.  Fit Perfect!!! ", "rating": 5}, {"title": "Love the material and the sizes fit…", "text": "Love the material and the sizes fit perfect I’ve always had problems fitting and feeling comfortable in bathing suits . Now since I found your site it will always be my go to .. ", "rating": 5}, {"title": "We have been so pleased with any items…", "text": "We have been so pleased with any items we have purchased from Rotita.  The quality of the material of the items that we have purchased have been great as is the actual correct sizing!  Never has been disappointed!", "rating": 5}, {"title": "Customer service was prompt in…getting back to me quickly.", "text": "Customer service was prompt in answering my questions returning my swimsuit for a larger size I'm hoping it will be sent to me quicker that my original that took 21 on days to get to me. The suit was beautiful I will come back to purchase again.", "rating": 5}, {"title": "Fantastic clothes", "text": "The clothing I ordered were well made. Not cheap. Fabric is great. Had to return a few items and experience was pleasant and quick. Highly recommend to everyone.", "rating": 5}, {"title": "Review edited", "text": "II love the quality of the swimsuits I ordered.  They arrived a little late but customer service was awesome.  The order was expedited and I have them now.  Thank you for handling this request with care.", "rating": 5}, {"title": "Excellent customer service!", "text": "I have always found customer service with Rotita is excellent.  I have made multiple purchases from them and the quality of the bathing suits in particular have been great. I would not hesitate to purchase from them. ", "rating": 5}, {"title": "Agent checked on my partial delivery…", "text": "Agent checked on my partial delivery and explained that the rest of my order will be expedited.  And that I will receive tracking information as soon as my other item is shipped.", "rating": 5}, {"title": "I love the colors", "text": "I love the colors, the style and mostly the fit.  I have an unusual body type and these tops fit me so good; they don't sit on my backside, accentuating the size of my backside.", "rating": 5}, {"title": "Easy ordering, accurate sizing chart", "text": "Ordering was easy but i placed an order because my last purchase with Rotita was successful. Sizing was great and that can be an issue when ordering online. Looking forward to receiving my next order.", "rating": 5}, {"title": "Dresses, thousands of em !", "text": "Was looking for something easy to wear but not my usual blue.Saw a gorgeous yellow dress but flicking through found the pink one.I don't usually wear pink but this caught my eyeFits and hangs well, the lace adds a touch or class and I'm able to wear black underwearRotita is the best site of its sort, has a very wide range of clothes and caters to real sized people.Being on Klarna is a bonus.", "rating": 5}, {"title": "The live chat is excellent the help me…", "text": "The live chat is excellent the help me every time when I need a return done or I have a question they are always there to answer!", "rating": 5}, {"title": "I was looking for a tankini top I had…", "text": "I was looking for a tankini top I had seen last year but couldn’t find it so sent a message via Facebook Messenger and got a very quick response with a link to purchase it from. ", "rating": 5}, {"title": "As long as I get my credit this hour…", "text": "As long as I get my credit this hour long chat was worth it! Demi was very good at listening and hearing my concerns and trying to remedy them!", "rating": 5}, {"title": "I love Rotita", "text": "I love Rotita!  Tummy coverage is important for me. Several choices from clothes, swimsuits, to dresses. Rotita makes it easy to order and a return items. ", "rating": 5}, {"title": "This tankini fit perfectly", "text": "This tankini fit perfectly, is very comfortable, I get a lot of compliments.  I loved it so much I bought it in 2 different colors.", "rating": 5}, {"title": "Cloths", "text": "Every thing i hsve ordèréd for 2 years now ive never had any problems and all the cloths fit anf wear great ", "rating": 5}, {"title": "I order 6 swimsuits", "text": "I order 6 swimsuits, and they were all FABULOUS AND FIT PERFECT!!Service and shipping was great, I have bought these swimsuits for the last 5 years.  Never disappointed.5 STARS ALL THE WAY!", "rating": 5}, {"title": "Yes if this fits right yes I  will order another…", "text": "There dressed are beautiful and this dressI order is so different and just thinking how my body will fit YES AT 77 YEARS OLD THIS BODY GOING TO FIT NICE OH YES PLEASE I NEED IT BY MAY 15 MY WOMEN DAY CHURCH PROGRAM THANK YOU.", "rating": 5}, {"title": "What great customer service I received…", "text": "What great customer service I received at Rotita. I was worried about my orders coming in on time and Sowshi was a great help at putting me at ease. Thank you again for helping me. ", "rating": 5}, {"title": "I used fb messenger to chat to an agent…", "text": "I used fb messenger to chat to an agent and she came on immediately. Explained what to do and it worked :-)! All ordered now and just waiting on my delivery", "rating": 5}, {"title": "Complete Satisfaction", "text": "This is second time I have dealt with a live chat and it was excellent both timesI had to use another email since my machine was continuing to spool and that is why I did the love chat", "rating": 5}, {"title": "Cancel exchange ", "text": "Needed to expedite returned items that were originally an exchange to a refund. Sowshi was very helpful in making it happen.", "rating": 5}, {"title": "I am delighted with the fast shipping…", "text": "I am delighted with the fast shipping for this women's clothing order. It was processed and delivered with impressive speed, allowing me to enjoy my new outfits right away.", "rating": 5}, {"title": "Really easy to look at clothing and to…", "text": "Really easy to look at clothing and to determine proper size and color. Have never had any issues when items arrived.", "rating": 5}, {"title": "DEBSREVIEWS ", "text": "Like the site and clothing But refunds should be paid straight back into your account Not give you credit instead ! ", "rating": 5}, {"title": "My order arrived on time", "text": "My order arrived on time. There were many more pieces of jewelry than I expected...an unexpected, nice surprise!", "rating": 5}, {"title": "I love the bright colors and there are…", "text": "I love the bright colors and there are so many choices. Being a XXL And 1X size lady you don’t get beautiful swimsuit choices like you do with Rotita!!!", "rating": 5}, {"title": "Live Chat actually helpful, much better than other companies!", "text": "I couldn't find my return info and went on the Live  Chat. Real person on the other end. Found the info I needed so quickly. Sorted out my problem, exactly what I needed! Plus the clothes are such good quality and great sizes.", "rating": 5}, {"title": "Changed sizes on an order that had not…", "text": "Changed sizes on an order that had not shipped yet. Got on live chat told them what I needed responded right away and fixed my order great service! Can't wait to get my shipment!", "rating": 5}, {"title": "Great Communication", "text": "Not only did she give me her name, but communicated very well.  knowledgeable, precise and great information ", "rating": 5}, {"title": "Customer service was very prompt and…", "text": "Customer service was very prompt and thorough! My issue was resolved in a timely manner.", "rating": 5}, {"title": "I double ordered and Sousi was so…", "text": "I double ordered and Sousi was so helpful helping me solve my problem!", "rating": 5}, {"title": "Very happy with my purchases", "text": "Everything I’ve purchased has been of good quality, nice fabric and true sizing. I had one item that I exchanged and it was handled in a timely manner. ", "rating": 5}, {"title": "Delivery of order", "text": "Great customer services, quick response and very supportive.  Thank you ", "rating": 5}, {"title": "Checking on the order I had not…", "text": "Checking on the order I had not received. They let me know it was being shipped and would sent me the information soon. Great service.", "rating": 5}, {"title": "Excellent service", "text": "Excellent service. Parcel arrived within 5 days and I could track it without any problem. ", "rating": 5}, {"title": "Style and Quality", "text": "From the moment I browsed their website, I was impressed by the wide variety of styles and trends they offer, suitable for all occasions, from casual looks to more formal outfits.", "rating": 5}, {"title": "Showsi on the live chat was very quick…", "text": "Showsi on the live chat was very quick with her responses and ver helpful a real pleasure to deal with", "rating": 5}, {"title": "I have been thoroughly impressed with…", "text": "I have been thoroughly impressed with Rotita’s commitment to delivering high-quality products at an affordable price. Their team is reliable and always willing to work with clients to ensure their satisfaction.", "rating": 5}, {"title": "Always buy my swimwear here absolutely…", "text": "Always buy my swimwear here absolutely beautiful quality and brilliant fit and the most gorgeous colours and choices the best swimwear site ever ", "rating": 5}, {"title": "Customer service was excellent", "text": "Customer service was excellent! They were able to solve my issue without much trouble.", "rating": 5}, {"title": "True to size", "text": "Most of the items I receive are exactly what I expected...some are not.  The sizes are true to size.  I wish the swimsuits/bikinis could be ordered in one size for top and a different size for the bottom", "rating": 5}, {"title": "Don’t know yet I haven’t got my…", "text": "Don’t know yet I haven’t got my merchandise yet. I’m hoping that’s gonna be here in six days not in three weeks. If it takes that long, I won’t be re-ordering.", "rating": 5}, {"title": "Ordered one", "text": "Ordered one, it was a medium. I weigh a 147 pounds. It was too small, had no way of really knowing how to ship it back. Had to get a large otherwise very cute. I was happy with Material", "rating": 5}, {"title": "Love all the clothes from Rotita.", "text": "Love all the clothes from Rotita.The bathing suits are so stylish and comfortable, well-fitting, and good quality. ", "rating": 5}, {"title": "Great fitting and comfortable", "text": "Great fitting and comfortable. I feel very comfortable walking around in it without a cover up. True to size", "rating": 5}, {"title": "I love all the different styles and…", "text": "I love all the different styles and products.  Makes shopping online so much easier and fun. ", "rating": 5}, {"title": "I love shopping at Rotita!!", "text": "So many beautiful clothes and swimwear to choose from. Easy to order, reasonably priced and true to size.", "rating": 5}, {"title": "Being able to contact a real person was…", "text": "Being able to contact a real person was invaluable to customer service experience.  The agent was quick to respond and offer a return label in a timely manner. ", "rating": 5}, {"title": "Great Price & Quality", "text": "The quality on this site is always great. Exchanges are easy, but the prices are what keeps me coming back!", "rating": 5}, {"title": "GREAT WEBSITE WITH GREAT PRODUCTS", "text": "I love your website and all your products!!!!  Makes it easy to order and I love the discounts that you offer and FREE shipping!  KEEP UP THE GREAT JOB!!!!!!", "rating": 5}, {"title": "Very fast service via chat..", "text": "Very fast service via chat... addressed my issue and went above and beyond to assist me ", "rating": 5}, {"title": "Was very patient and helpful 🙂", "text": "Was very patient and helpful 🙂 ", "rating": 5}, {"title": "2nd part of my order", "text": "Representative I just chatted with was able to look and find my order after all.", "rating": 5}, {"title": "It's easy to place an order", "text": "It's easy to place an order. I have purchased dresses in the past and now I'm looking forward to some swingwear!", "rating": 5}, {"title": "The agent was able to answer my…", "text": "The agent was able to answer my questions and quickly resolve my issue.", "rating": 5}, {"title": " . Swim skirt ", "text": "Very easy to shop your website.I ordered this for a friend, and the quality of the swim skirt was so nice. I loved it so much that I came back to order myself one.", "rating": 5}, {"title": "I absolutely love all of the products I…", "text": "I absolutely love all of the products I have ordered from Rotita.  They are excellent quality for the price.", "rating": 5}, {"title": "I had a query and it was dealt with in…", "text": "I had a query and it was dealt with in minutes. Very satisfied. Just waiting for a delivery now .", "rating": 5}, {"title": "View Backup Of Clothing Item", "text": "I like the way the pictures show the front and back clear of each item that interests the shopper.", "rating": 5}, {"title": "Great service always very reliable and…", "text": "Great service always very reliable and items fit well", "rating": 5}, {"title": "I had a question on my order and used…", "text": "I had a question on my order and used the live chat. They responded quickly and answered my question.", "rating": 5}, {"title": "I have order many items", "text": "I have order many items. the only issue I had was with a rush order that didn't come in time so had to return.  ", "rating": 5}, {"title": "I love rotita", "text": "I love rotita! The best clothing I have ever purchased!!!! Keep doing what u are doing! Amazing 5 star!!!!", "rating": 5}, {"title": "Very helpful with credits/wrong items…", "text": "Very helpful with credits/wrong items purchased.", "rating": 5}, {"title": "I love this brand", "text": "I love this brand, the quality is very high, they fit very well and the shipping is super fast", "rating": 5}, {"title": "The service was great and friendly I’m…", "text": "The service was great and friendly I’m very satisfied with the attendance!!!", "rating": 5}, {"title": "Looking for fantastic swimwear then Rotita has it all!", "text": "This store has great swimsuits and other clothes as well. Although they are priced on the high level I found my items are well worth it.", "rating": 5}, {"title": "I love these swim suits", "text": "This is not my first order. I love your swim suits! I have 4 & I just placed an order for 4 more! I have never had use for 8 swim suits in my life. But I now live 25 mins from the beach, so now I have a whole selection of suits to choose from. I'm very happy!", "rating": 5}, {"title": "IF YOU NEED HELP YOU CAN USE THE LIVE…", "text": "IF YOU NEED HELP YOU CAN USE THE LIVE CHAT AND THEY HELP YOU TO MAKE SURE YOU GET ALL YOUR QUESTIONS ANSWERED.  ", "rating": 5}, {"title": "Too easy to order", "text": "Too easy to order, lolI spent more than I budgeted for because there were too many nice things I wanted ", "rating": 5}, {"title": "Great service", "text": "Great company, good quality products and customer service was quick and helpful ", "rating": 5}, {"title": "Very helpful when a missing parcel…", "text": "Very helpful when a missing parcel turned up and I could return it . Thank you ", "rating": 5}, {"title": "The delivery of my order made this a…", "text": "The delivery of my order made this a great. This is my first order, I can't wait to order more.", "rating": 5}, {"title": "I am so looking forward to getting…", "text": "I am so looking forward to getting these clothes and swimwear!  I really love them!  ", "rating": 5}, {"title": "Good costomer care .I appreciate", "text": "Good costomer care .I appreciate. God bless you abundantly. ", "rating": 5}, {"title": "Good company to purchase from", "text": "Great service item as described arrived on time and good communication from online chat ", "rating": 5}, {"title": "Thank you for your help", "text": "Thank you for your help.  Look forward to receiving my order", "rating": 5}, {"title": "order issue", "text": "had problem with a order and got fast help. problem solved.", "rating": 5}, {"title": "I bought a pants two weeks ago ", "text": "I bought a pants two weeks ago , when I put it on I would had too tight, so I reached out  service center. Pretty good ! ", "rating": 5}, {"title": "Swim wear for plus size women.…", "text": "Lot's of options and colors and sizes to fit me. I love the way they fit me. They're not constricting.", "rating": 5}, {"title": "I have alway had good luck with the…", "text": "I have alway had good luck with the clothes. Shipping does take a little long than I like.", "rating": 5}, {"title": "Highest quality", "text": "Date of experience: October 07, 2024", "rating": 5}, {"title": "Easy site to navigate", "text": "Easy site to navigate. Cute swimsuits.", "rating": 5}, {"title": "Helpful", "text": "Helpful; quick; found the order and rushed delivery", "rating": 5}, {"title": "Great service and the quality of the…", "text": "Great service and the quality of the products are excellent.", "rating": 5}, {"title": "Freya thank for your assistencce 🥰🥰🥰", "text": "Date of experience: August 27, 2024", "rating": 5}, {"title": "Excellent", "text": "Excellent, Fast, Easy Service. Thank you", "rating": 5}, {"title": " Bathing suit", "text": "To received them and see that it was exactly what I have ordered. Even the color and the fit.", "rating": 5}, {"title": "I received my items in good time and…", "text": "I received my items in good time and all fit perfectly. ", "rating": 5}, {"title": "I have bought close to 100 dresses for…", "text": "I have bought close to 100 dresses for you. I have also told every one in my church about you. Many of them now get their dresses from you. I have loved all of the dresses. They are well made. Thank you.Sheri Bishop", "rating": 5}, {"title": "used an app!", "text": "used an app for my recent purchase worked well", "rating": 5}, {"title": "Products are of great quality", "text": "Products are of great quality. Have ordered several times in the past. ", "rating": 5}, {"title": "Explained clearly how to return dress.", "text": "Date of experience: August 14, 2024", "rating": 5}, {"title": "Agent was very helpful", "text": "Agent was very helpful! Great asset to your company!", "rating": 5}, {"title": "Very quick answer to inquiry on my order", "text": "Date of experience: May 22, 2024", "rating": 5}, {"title": "Absolutely love the cloths", "text": "Absolutely love the cloths. Good quality clothing.", "rating": 5}, {"title": "Beautiful bathing Beautiful bathing suitssuits wish had one…", "text": "Beautiful bathing suits wish had one piece swim dresses.", "rating": 5}, {"title": "I love their items", "text": "I love their items. They look cute and can be worn in many ways.", "rating": 5}, {"title": "The agent understood my query and dealt…", "text": "The agent understood my query and dealt with it very quickly", "rating": 5}, {"title": "Love these dress bathing suits", "text": "Love these dress bathing suits. I purchased 4 and just purchased 3 more. Cant wait to wear all them on my cruise", "rating": 5}, {"title": "Fabulous fit.", "text": "The item looked and fit great and was delivered in a timely manner.", "rating": 5}, {"title": "Very helpful with my return and saved a…", "text": "Very helpful with my return and saved a lot of stress for me.", "rating": 5}, {"title": "Nice swimwear", "text": "I have bought 1 bathing suit loved it, so I ordered another. ", "rating": 5}, {"title": "Rotita has great quality clothes", "text": "Rotita has great quality clothes, and I love shopping with them.", "rating": 5}, {"title": "The rep answered my question politely.", "text": "Date of experience: July 30, 2024", "rating": 5}, {"title": "Took 3 weeks to come ", "text": "Took 3 weeks to come . But very satisfied with my bathing suit.", "rating": 5}, {"title": "Awesome", "text": "Customer service was very helpful with assisting me with my questions", "rating": 5}, {"title": "Easy to order and the items were of…", "text": "Easy to order and the items were of great quality and true to size", "rating": 5}, {"title": "Love there products its good quality…", "text": "Love there products its good quality and amazing style love love❤️", "rating": 5}, {"title": "Good Customer Service", "text": "Was able to rectify late order", "rating": 5}, {"title": "the price is reasonable and the design is perfect for me.", "text": "I am happy with Rotita clothing. I ordered two tops earlier. They look great on me. ", "rating": 5}, {"title": "Easy to shop and select merchandise.", "text": "Date of experience: June 06, 2024", "rating": 5}, {"title": "Great customer service and excellent quality…", "text": "Great service and excellent quality swimwear. ", "rating": 5}, {"title": "Responded in a timely manner", "text": "Responded in a timely manner. It was no hesitation.", "rating": 5}, {"title": "Speed and efficiency", "text": "Speed and efficiency, thank you for your help! ", "rating": 5}, {"title": "I love the choices you have in plus…", "text": "I love the choices you have in plus size! Plus the designs and colors. I've made many purchases with you. :)", "rating": 5}, {"title": "Great service ", "text": "This company is very helpful and reliable. ", "rating": 5}, {"title": "Very high quality clothes 💜💜", "text": "Date of experience: September 23, 2024", "rating": 5}, {"title": "Very easy to return items", "text": "Very easy to return items! I was very happy and surprised it was so easy! Thank you so much", "rating": 5}, {"title": "If I get my order by Thursday I’ll be…", "text": "If I get my order by Thursday I’ll be real happy", "rating": 5}, {"title": "So many beautiful choices.", "text": "Date of experience: May 02, 2024", "rating": 5}, {"title": "easy to find all the info i need", "text": "easy to find all the info i need on the clothing", "rating": 5}, {"title": "The outfit was great", "text": "The outfit was great, so soft, great fit. Shipping was quick. So I am happy.", "rating": 5}, {"title": "Good service and fast delivery.", "text": "Date of experience: April 28, 2024", "rating": 5}, {"title": "Solved the problem", "text": "Solved the problem ", "rating": 5}, {"title": "Customer service was helpful and…", "text": "Customer service was helpful and prompt. Very professional. I'm thoroughly satisfied.", "rating": 5}, {"title": "It made it easy to spend my money..", "text": "It was a good experience ", "rating": 5}, {"title": "Customer service is responsive and are…", "text": "Customer service is responsive and are diligent with their responses ", "rating": 5}, {"title": "Great response", "text": "Date of experience: July 08, 2024", "rating": 5}, {"title": "Great quality of swimwear ", "text": "Love there swimwear. ", "rating": 5}, {"title": "Easy shopping", "text": "Easy shopping; great items", "rating": 5}, {"title": "Very helpful.", "text": "Very helpful. ", "rating": 5}, {"title": "easy to order", "text": "Date of experience: August 01, 2024", "rating": 5}, {"title": "Very helpful with my query", "text": "Date of experience: August 07, 2024", "rating": 5}, {"title": "Cure stuff", "text": "Nice quality for price.", "rating": 5}, {"title": "Love it 🤍 ", "text": "Love it 🤍 the dresses are amazing", "rating": 5}, {"title": "The 24/7 response time", "text": "The 24/7 response time ", "rating": 5}, {"title": "Bathing suits are awesome and fit to…", "text": "Bathing suits are awesome and fit to size", "rating": 5}, {"title": "The agent Demi, was so efficient and professional.", "text": "Efficiency and professionalism from Demi the agent.", "rating": 5}, {"title": "Great company would buy again", "text": "Great company would buy again ", "rating": 5}, {"title": "Good prices", "text": "Good prices, good quality ", "rating": 5}, {"title": "buy my swimsuits here.", "text": "buy my swimsuits here. ", "rating": 5}, {"title": "fast shipping,good prices", "text": "Date of experience: June 25, 2024", "rating": 5}, {"title": "timely and efficient", "text": "timely and efficient ", "rating": 5}, {"title": "They got the problem solved quickly ", "text": "They were very helpful ", "rating": 5}, {"title": "Ease of shopping and great prices", "text": "Date of experience: June 03, 2024", "rating": 5}, {"title": "very helpful", "text": "very helpful, thank u 😊 ", "rating": 5}, {"title": "The shopping none hassle and easy.", "text": "Date of experience: May 25, 2024", "rating": 5}, {"title": "Amazing service and quick efficient…", "text": "Amazing service and quick efficient answers!", "rating": 5}, {"title": "Good service b", "text": "Great fast customer service ", "rating": 5}, {"title": "I always have good luck", "text": "Date of experience: June 13, 2024", "rating": 5}, {"title": "Lots of choices", "text": "Lots of choices, just my style! Easy and fast.", "rating": 5}, {"title": "Relatively easy ordering process", "text": "Relatively easy ordering process. Thank you.", "rating": 5}, {"title": "Suit was true to size and very nice", "text": "Date of experience: July 08, 2024", "rating": 5}, {"title": "Prompt delivery", "text": "Prompt delivery. Excellent products and customer service", "rating": 5}, {"title": "Good quality", "text": "Good quality, sizing is approximate.", "rating": 5}, {"title": "Love shopping here!", "text": "Great products to choose from. ", "rating": 5}, {"title": "Very helpful customer service", "text": "Date of experience: June 28, 2024", "rating": 5}, {"title": "easy to search and shop.", "text": "easy to search and shop.  ", "rating": 5}, {"title": "Great value and great products", "text": "Great value and great products", "rating": 5}, {"title": "Thank you", "text": "Took care of everything.", "rating": 5}, {"title": "Satisfied quick response", "text": "Satisfied quick response ", "rating": 5}, {"title": "Great customer service ", "text": "Date of experience: June 20, 2024", "rating": 5}, {"title": "get inf I need", "text": "Date of experience: July 04, 2024", "rating": 5}, {"title": "very easy to use.", "text": "very easy to use. ", "rating": 5}, {"title": "I love the products", "text": "Date of experience: June 02, 2024", "rating": 5}, {"title": "Happy wife Happy life", "text": "Happy wife Happy life ", "rating": 5}, {"title": "Easy and fast", "text": "Date of experience: July 12, 2024", "rating": 5}, {"title": "Love your clothes...", "text": "Love your clothes... ", "rating": 5}, {"title": "Easy", "text": "Easy. Fast. Thanks.", "rating": 5}, {"title": "Quick and easy", "text": "Date of experience: June 05, 2024", "rating": 5}, {"title": "Great ", "text": "Yes. Thank you.", "rating": 5}, {"title": "Fast and easy", "text": "Date of experience: June 01, 2024", "rating": 5}, {"title": "Great experience", "text": "Great experience ", "rating": 5}, {"title": "Excellent service", "text": "Date of experience: June 21, 2024", "rating": 5}, {"title": "Rotita has an amazing website that is…easy to navigate", "text": "Rotita has an amazing website that is easy to navigate and order from.  Prices are amazing for the quality of purchases!", "rating": 5}, {"title": "Love your products", "text": "Love your products ", "rating": 5}, {"title": "Smooth transaction ", "text": "Website was easy to use but I didn't understand why my total price went up when I used the shipping coupon so I didn't use it.", "rating": 5}, {"title": "Love all my orders", "text": "Date of experience: April 22, 2024", "rating": 5}, {"title": "Rotita is excellent!", "text": "Easy to use website.  Prices reasonable and from previous purchases, quality is good.", "rating": 5}, {"title": "Beautiful items at affordable prices!", "text": "Date of experience: April 21, 2024", "rating": 5}, {"title": "Great quality", "text": "Great quality, perfect fit and super fast shipping!! Highly recommend!!", "rating": 5}, {"title": "Lovely good quality swim wear", "text": "Lovely good quality swim wear. I am so pleased with my recent purchase I am going to order more . Great customer service . I was kept up to date with where my products were right up to  after delivery. ", "rating": 5}, {"title": "There are so many swimsuits to choose…", "text": "There are so many swimsuits to choose from at such a cheap price, they're amazing! 😊", "rating": 5}, {"title": "I absolutely love everythingthis…", "text": "I absolutely love everything this company makes I’ve never been disappointed! I’m very excited to get my new bathing suit’s ", "rating": 5}, {"title": "I have been a customer for over 7 years…", "text": "I have been a customer for over 7 years they are always true to size and very comfortable swimwear that is very flattering. Recommended  them highly", "rating": 5}, {"title": "Very happy with my orders", "text": "Very happy with my orders! Love the fit!!   Good quality and arrives on time.  Will order more in the future :)", "rating": 5}, {"title": "Beautiful Web site easy to navigate", "text": "Beautiful Web site easy to navigate. Ordered 2 lovely bikinis. With discount. What's not to like.", "rating": 5}, {"title": "Easy to found the merchandise needed", "text": "Date of experience: April 17, 2024", "rating": 5}, {"title": "like what I purchase", "text": "like what I purchase. never had a problem with the company, the only thing is I wish more of the clothing items where in Cotton, making it cooler to wear, the fabric used in alot of the clothes is to hot.", "rating": 5}, {"title": "I love the bathing suits on this site I…", "text": "I love the bathing suits on this site I have bought many. I travel a lot and like to keep up with the styles, Love Rotita", "rating": 5}, {"title": "Good quality clothe's", "text": "Good quality clothe's, fir really well, I am very pkeased with them, will shop again.", "rating": 5}, {"title": "This dress is a showstopper", "text": "Date of experience: April 16, 2024", "rating": 5}, {"title": "Love so much about the items offered on…", "text": "Love so much about the items offered on this site.  So far out of about 20 orders I've only had to send back a handful of items due to the fit.  Great site for great pieces to add to any Spring, Summer, Fall or Winter collection. ", "rating": 5}, {"title": "Easy to find something beautiful", "text": "Easy to find something beautiful ", "rating": 5}, {"title": "Shirts", "text": "Totally awesome to order from . Luv the styles.", "rating": 5}, {"title": "Nice fit", "text": "Nice fit, comfortable. Easy to care for ", "rating": 5}, {"title": "I appreciate the attention to detail in the design of these T-shirts. The stitching is well done, and they look polished.", "text": "I appreciate the attention to detail in the design of these T-shirts. The stitching is well done, and they look polished.", "rating": 5}, {"title": "Love the fashions", "text": "Love the fashions. Only wish cotton fabrics were used is some of the selection of tops. Check out is always quick and easy!", "rating": 5}, {"title": "Shopping is very quick & easy", "text": "Shopping is very quick & easy. Clothes are a great value.", "rating": 5}, {"title": "Excellent clothing", "text": "Excellent clothing, good material, stick to the size chart. Great variety and time delivery very accurate.", "rating": 5}, {"title": "Shop with Rotita.com alot", "text": "Shop with Rotita.com alot, Love, Love, Love their clothing & styles ", "rating": 5}, {"title": " user-friendly website", "text": "This website is extremely user-friendly and easy to navigate ", "rating": 5}, {"title": "The website was easy to My experience.", "text": "The website was easy to navigate. I could easily view the products. When buying and checking out the processes when through smoothly with no glitches.", "rating": 5}, {"title": "Great fit!", "text": "Great prices, and products. ", "rating": 5}, {"title": "Tankini and yellow blouse", "text": "Both the green tankini and yellow blouse fit wonderfully. So happy I bought them. ", "rating": 5}, {"title": "Love Shopping Here", "text": "Ordering was easy, size charts are perfectly accurate, quality of product was excellent, shipping was fast, payment was easy. Love shopping here!!", "rating": 5}, {"title": "great !", "text": "i love the clothes and easy to use the site, everything is cute", "rating": 5}, {"title": "Great product and fast delivery", "text": "Great product and fast delivery ", "rating": 5}, {"title": "Website user friendly ", "text": "Website user friendly and my query was quickly and efficiently solved. Highly recommended.", "rating": 5}, {"title": "True to size and flattering fits", "text": "Date of experience: April 04, 2023", "rating": 5}, {"title": "Shopping was seamless", "text": "Shopping was seamless, return and exchange was with ease and the dress fitted nicely. Very impressed with the length", "rating": 5}, {"title": "Exchanges Easy & Fast", "text": "I had to exchange my bathing suit for a different size. The exchange was free and the new one arrived within 7 days.", "rating": 5}, {"title": "Super helpful with switching to…", "text": "Super helpful with switching to expedite ting shipping.  ", "rating": 5}, {"title": "Clothing style", "text": "Date of experience: March 21, 2024", "rating": 5}, {"title": "Easy Exchanges", "text": "One of the two bathing suits was too big. It was a very easy exchange process that was resolved in 7 days.", "rating": 5}, {"title": "Material beautiful and fit no fault of…", "text": "Material beautiful and fit no fault of Rotita. ", "rating": 5}, {"title": "Order with confidence", "text": "Order with confidence! Decent quality for a great price. Pretty good shipping time. I have used this company 3 times and was very pleased. Their clothing is true to size, made well, and wash and wear. A+", "rating": 5}, {"title": "Good service", "text": "Good service.  Good feedback and kept me up to  date with tracking info", "rating": 5}, {"title": "Their plus sized swimwear selection can't be beat!", "text": "I've purchased swimsuits from Rotita and they're very well made and reasonably priced. I really like like how they have a ton of swimsuit options for plus sized women. I've never had an unsatisfactory experience with Rotita!", "rating": 5}, {"title": "Love Rotita outfits", "text": "Love Rotita outfits. Very good quality and delivery is superb.Highly recommend.", "rating": 5}, {"title": "Good fabric", "text": "Good fabric ", "rating": 5}, {"title": "I love shopping at the Rotita store", "text": "I love shopping at the Rotita store.  the garments are of excellent quality, faithful to the photos shown.  the sizes are comfortable and real.  every day there is always a wide range of new arrivals and you can find many styles.  in addition to clothing there is a section dedicated to shoes and accessories.  shipments are very fast as is the customer service.  advised", "rating": 5}, {"title": "Fast shipping", "text": "Fast shipping. On the website there are different type of clothes , inclusive and with different styles for everyone. I recommend the brand ", "rating": 5}, {"title": "I love so much this brand", "text": "I love so much this brand, it’s products are so high quality and the shipping it’s very fast. The size corresponds with the description of the products", "rating": 5}, {"title": "Quality and Affordable Clothing ", "text": "I have been using Rotita for years and will continue. The prices are reasonable and the clothing has quality. My experience has always been a good one. ", "rating": 5}, {"title": "Rotita has the best clothes ever", "text": "Rotita has the best clothes ever. Beautiful , stylish and very good material! I am very satisfied!🥰😘", "rating": 5}, {"title": "I love these clothes", "text": "I love these clothes ", "rating": 5}, {"title": "Very good experience with this company…", "text": "Very good experience with this company !! Very nice the clothes !! I ll suggest to try it! ", "rating": 5}, {"title": "  Great quality 👍", "text": "I love this brand , the clothing are the best  i buy ever time and all items are like a photo 🥰 just amazing quality ", "rating": 5}, {"title": "Definitely my favorite store to shop…", "text": "Definitely my favorite store to shop at! The quality of the clothes is perfect, shipping is fast and they fit really well! I strongly advise", "rating": 5}, {"title": "The shipping was super fast", "text": "The shipping was super fast, the quality of the clothes very good, I loved the colours, the right sizes and the very nice clothes. Everyone asks me about them, I'll buy again (:", "rating": 5}, {"title": "This is the 3 time I ordered from…", "text": "This is the 3 time I ordered from Rotita, and I’m happy with the quality and delivery of the clothes.", "rating": 5}, {"title": "The quality is very good and the…", "text": "The quality is very good and the clothes fit very well.", "rating": 5}, {"title": "This brand is amazing", "text": "This brand is amazing! Fast shipping and quality clothes ❤️❤️ all my family and friends love it ", "rating": 5}, {"title": "The order is always fast in shopping…", "text": "The order is always fast in shopping quality is good. Fits true to size", "rating": 5}, {"title": "i received my blouse with great…", "text": "i received my blouse with great surprise it is beautiful !!  it ran a little small but it will work.  the price was fantastic & so impressed with delivery time.  I ordered it on a Monday & had it by Friday.   Eileen ", "rating": 5}, {"title": "The clothes I have bought from Rotita", "text": "From last year til now I have bought plenty of tops I have been very satisfied with all that I have bought. I do wish the clothes would be delivered sooner.I'm still waiting for my other bathing suit I ordered ", "rating": 5}, {"title": "I love the quality of Rotita's…clothing!", "text": "I love the quality of Rotita's clothing.  I'm just in the process of finding the correct sizing.  Returned items are easy to do.  If in stock, I received my item fast!  I highly recommend ordering from Rotita!", "rating": 5}, {"title": "Website is easy to navigate", "text": "Website is easy to navigate, lots of discounts, and reward points for checking in every day. Clothing is good quality too for the pricing.", "rating": 5}, {"title": "Absolutely was excited about my first…", "text": "Absolutely was excited about my first order of 2swimsuits. Fit perfect and looks great. Just ordered 3 more!", "rating": 5}, {"title": "Love them", "text": "Love this company always been pleased with their clothing. Delivery on time.Would recommend them.", "rating": 5}, {"title": "Easy to Order!", "text": "Easy to Order!! Great Quality Products!! Great Prices!! Looking forward receiving my current order placed today. I have never been disappointed in my purchases.", "rating": 5}, {"title": "Was fast & easy", "text": "Date of experience: February 23, 2024", "rating": 5}, {"title": "online shopping with Rotitia is an easy…", "text": "online shopping with Rotitia is an easy process. I ordered four dresses which came as two packages. one  package arrived quickly the other about a week later. The dresses were all nice but I did need to do a return as one was too big(my size was not in stock) The other the lace bodice did not feel comfortable. The return process I felt could have been a little easier...needed ticket number, download return label and yodel collection.Awaiting refund when items have been received and checked by Rotitia.", "rating": 5}, {"title": "Love the prints", "text": "Love the prints, love the sizing, the models!", "rating": 5}, {"title": "I have had much success with Rotita", "text": "I have had much success with Rotita.  Sizing is perfect and quality is beyond imagination ", "rating": 5}, {"title": "Clothes and bathing suits fit really…", "text": "Clothes and bathing suits fit really well. The quality is nice. A little pricey but I try to buy when they have buy 3, 1 free.", "rating": 5}, {"title": "The products are good", "text": "The products are good, the quality the material and also is a true size ❤️", "rating": 5}, {"title": "Really pleased with all 3 items", "text": "Delivered earlier than expected.  Perfect fit, good quality and exactly as shown in the photo - 3 items purchased", "rating": 5}, {"title": "Love their bathing suits", "text": "Date of experience: January 20, 2024", "rating": 5}, {"title": "the bikini fitted properly", "text": "the bikini fitted properly. very impressed !!!!", "rating": 5}, {"title": "The item was as pictured and arrived…", "text": "The item was as pictured and arrived when promised. The fit was true to size.", "rating": 5}, {"title": "Your styles are refreshing,", "text": "Date of experience: December 18, 2023", "rating": 5}, {"title": "Beautiful dress", "text": "I'm very happy with my purchase", "rating": 5}, {"title": "Well DoneThe return process was simple!", "text": "The return process was simple!", "rating": 5}, {"title": "Great swimsuits…", "text": "I really like my swimsuits I purchased from you! Sizing was perfect and I know I will be comfortable in them in front of family and friends this summer.", "rating": 5}, {"title": "Perfect fit", "text": "Perfect fit, and good quality.", "rating": 5}, {"title": "They for great I was able yo return with no problems and ask for a different size", "text": "They for great", "rating": 5}, {"title": "My order shipped quickly and was easy…", "text": "My order shipped quickly and was easy to track. The items I purchased were true to size and I am glad I had read other shoppers reviews of the products i purchased.", "rating": 5}, {"title": "Very nice I like it 💙", "text": "Date of experience: December 19, 2023", "rating": 5}, {"title": "Perfect as in the picture", "text": "I ordered two sweatshirts and a sweater they are exactly like in the picture indeed now I can say that they are warm and soft! I will definitely order again because they are of excellent quality !!!", "rating": 5}, {"title": "Impressive", "text": "I had a small issue with a bathing suit not fitting but that was no reflection on Rotita.  My top and bottom are not in the same size range.I sent the product back and within a week I had a response and the credit was on my account.  Don't think I have ever had such great service.", "rating": 5}, {"title": "I recently had a pleasant experience…", "text": "I recently had a pleasant experience shopping on the Rotita website for clothing. The variety of choices was impressive, and the quality of the items I purchased met my expectations. The ordering process was smooth, and the delivery was prompt. Overall, a satisfying shopping experience on Rotita.", "rating": 5}, {"title": "I haveI discovered the company thanks to an advertisement on Instagram known this company for several…", "text": "I have known this company for several years and it has never disappointed me. Her garments are exactly as in the photo with a crazy fit where the femininity of every woman is enhanced with any garment, from the dress to the trousers, always trendy and never banal.", "rating": 5}, {"title": "Great service", "text": "Great service, Brenda very helpful & made chat easy", "rating": 5}, {"title": "I am so much in love with rorita…", "text": "I am so much in love with rorita outfit. I purchased so many time.fashionable, reasonable prices and delivery on time", "rating": 5}, {"title": "Customer service was excellent", "text": "Date of experience: November 17, 2023", "rating": 5}, {"title": "Great service ,excellent  customer…", "text": "Great service ,excellent  customer service, quick  response and resolving my problem I LIKE SWIMMING  SUITS,GOOD QUALITY  AND COLOR . DEFENDLY  WILL RECOMMEND  YOUR COMPANY TO MY FRIENDS.", "rating": 5}, {"title": "Quick response to questions!", "text": "Date of experience: November 15, 2023", "rating": 5}, {"title": "Dress arrived yesterday", "text": "Dress arrived yesterday. Fast delivery, beautiful dress exactly as shown on the model. Thank you Rotita, my first order from you and I will be more than happy to order from you again.", "rating": 5}, {"title": "Great clothes and fast paced shipping", "text": "Date of experience: November 10, 2023", "rating": 5}, {"title": "I had an issue and the customer service…", "text": "I had an issue and the customer service rep resolved it quickly!", "rating": 5}, {"title": "Wonderful customer service", "text": "Wonderful customer service...helpful and patient!", "rating": 5}, {"title": "The swimsuit an Xlarge", "text": "The swimsuit an Xlarge,  I am 5'2''  38 C bust and 160 lbs,  fit perfect for me.  I like the material and the customer service is excellent.    \tT5666127661Order Number:\tWW2310210814391045Thank you", "rating": 5}, {"title": "Clara answered all my concerns and got…", "text": "Clara answered all my concerns and got back to me right away", "rating": 5}, {"title": "Customer service is important to me", "text": "Customer service is important to me.  Clare handled herself very well and answered my questions.", "rating": 5}, {"title": "Easy to order", "text": "Easy to order.  Ordered wrong quantities of 2 items and Thea corrected it immediately via live chat!  TYVM!", "rating": 5}, {"title": "Rotita e-shop and all the team is very…", "text": "Rotita e-shop and all the team is very professional with excellent quality and range of clothing.The sizes are 100% true.I’m their customer for 4 years and I have never been let down if I needed exchange for bigger or smaller size due to my constantly changing my size due to illness. I got even refund for my mistake by adding 3x the same pants to my basket. I didn’t noticed until I paid so by contacting customer service Clara it was resolved within few minutes and refund was in my account next day. This is very professional team and shop and I would highly recommend it to anyone.", "rating": 5}, {"title": "Demi with customer support was fast to…", "text": "Demi with customer support was fast to respond and was able to answer my questions quickly.", "rating": 5}, {"title": "quick response", "text": "quick response, clear answer, friendly service and good quality clothings, though slightly expensive :)", "rating": 5}, {"title": "Very fast to resolve the issue.", "text": "Date of experience: October 24, 2023", "rating": 5}, {"title": "I was very impressed by the quality of the clothes", "text": "I was very impressed by the quality of the clothes. They fit well and they have such beautiful clothes.", "rating": 5}, {"title": "Quick service and good resolution", "text": "Date of experience: October 21, 2023", "rating": 5}, {"title": "Clare was very helpful", "text": "I inadvertently had my order shipped to the wrong address and Clara helped me out by changing my order to be shipped to my correct address!", "rating": 5}, {"title": "I love the way they feel and fit", "text": "I love the way they feel and fit , thank you.", "rating": 5}, {"title": "Good return service !", "text": "Easy to return and really good service with the chat", "rating": 5}, {"title": "I ordered a swim suit and love it", "text": "I ordered a swim suit and love it. I have never had a problem with anything I have ordered. I only wish I could buy some of this years dresses but I don’t have a lot of money to do so.", "rating": 5}, {"title": "A most wonderful experience", "text": "A most wonderful experience! Watching all you have to sell, buying and mostly receiving!' All so beautiful!", "rating": 5}, {"title": "Quick and easy", "text": "Date of experience: October 15, 2023", "rating": 5}, {"title": "no hassle return", "text": "Date of experience: October 14, 2023", "rating": 5}, {"title": "Quality Service Beyond Satisfactory", "text": "Always a great experience dealing with Rotita 🤩! Even in the rare case of submitting a return, always receive assistance beyond satisfactory!  Highly recommend their service.", "rating": 5}, {"title": "Customer service was quick to respond…", "text": "Customer service was quick to respond and very helpful.", "rating": 5}, {"title": "I had to return the items as I ordered the wrong size", "text": "I had to return the items as I ordered the wrong size. I used the CHAT which was immediate. Very helpful!", "rating": 5}, {"title": "They where able to stand by me all the…", "text": "They where able to stand by me all the way, return and cancel items.The quality of their clothing is great.Excellent service", "rating": 5}, {"title": "I had order the wrong size and they…", "text": "I had order the wrong size and they help change it to the correct size", "rating": 5}, {"title": "Love the quick response!", "text": "Date of experience: October 10, 2023", "rating": 5}, {"title": "Fun lovely bathers", "text": "Easy too follow website.items were exactly like the photos shown.  True colors.Communication was easy and thorough.  They helped me out with my enquiry", "rating": 5}, {"title": "Quick shipping and great product", "text": "Quick shipping and great product.  Great customer service.", "rating": 5}, {"title": "I truly appreciated the time that was…", "text": "I truly appreciated the time that was given to me to resolve an old person who is computer illiterate to resolve. How to return an order for resize and refund", "rating": 5}, {"title": "Clara resolved my issue in 2 minutes", "text": "Clara resolved my issue in 2 minutes. Very responsive person.", "rating": 5}, {"title": "She reassured me about my package and…", "text": "She reassured me about my package and was very nice and polite.", "rating": 5}, {"title": "Spoke with Brinda and she was such a…", "text": "Spoke with Brinda and she was such a big help in doing my return/exchange tonight!! Thumbs up to her", "rating": 5}, {"title": "Swoshi was nice and attentive to my…", "text": "Swoshi was nice and attentive to my issue. They also provided a solution for my problem. Please pass in my appreciation for their top tier service.", "rating": 5}, {"title": "Best Chat help ever.   She was fantastic", "text": "What made my experience great?   ....Your supporting Agent Sowshi as amazing.   Loved that your \"chat\" is with a real person.   She made sure to help me exchange an item that I did not like for myself.   Made it simple and easy.", "rating": 5}, {"title": "Ace Customer Service!", "text": "I hadn't received my order yet and thought my money was gone forever. But when I clicked into the customer service chat, I was chatting to the agent within 1 minute and she immediately provided an update on one item and issued my refund on the other. Don't know about the product because it's still on the way, but five stars for customer service for sure!", "rating": 5}, {"title": "Product was delivered before promised", "text": "Product was delivered before promised, fit as described. Was same quality material as more expensive sites.  Customer service was superb.", "rating": 5}, {"title": "Customer Service", "text": "Had a great customer service person.  Helped me straighten out my mess.", "rating": 5}, {"title": "Sowshi helped me with my log in", "text": "Sowshi helped me with my log in. The system would not let me get into my account and it would not accept my new password. She helped it a matter of minutes.", "rating": 5}, {"title": "Just like you see on the website", "text": "Prices are affordable, items looked and fit exactly as indicated on the website.", "rating": 5}, {"title": "Answered my question quickly", "text": "Date of experience: September 16, 2023", "rating": 5}, {"title": "Excellent customer service", "text": "Excellent customer service! Awesome fast and very knowledgeable and helpful! Can’t wait to receive our order! Definitely will 100% do business again!!", "rating": 5}, {"title": "Thank you for chatting with me", "text": "Thank you for chatting with me. Trying to resolve my issues.", "rating": 5}, {"title": "Prompt chat service. The agent Sowshi was very helpful.", "text": "Service was quick. The merchandise arrived and the dress was very nice. However it was very long and unfortunatelyI did not like that for on me.", "rating": 5}, {"title": "Brinda clearly understood the…", "text": "Brinda clearly understood the importance of me receiving my dress order prior to packing it into my suitcase and flying to the east coast for a big event.  She asked the carrier to expediate my order so I will be able to get it on time.", "rating": 5}, {"title": "Your customer service is great I…", "text": "Your customer service is great I screwed up twice ordering shirts and they were awesome helping me!!", "rating": 5}, {"title": "Thanks  for my order,I made this…", "text": "Thanks  for my order,I made this mistake,just want one.please update me.", "rating": 5}, {"title": "Brinda put a rush on my order", "text": "Brinda put a rush on my order.   I hope it gets here before the 25th of August 2023", "rating": 5}, {"title": "Great customer service chat support", "text": "Great customer service chat support. I was very happy with my bathing suits and quality of clothes. I'm hopeful my issue is resolve.  I will order again.", "rating": 5}, {"title": "I am so pleased how you people notify…", "text": "I am so pleased how you people notify when a package is to be shipped and when to expect delivery", "rating": 5}, {"title": "Rotita was so very empathetic with my…", "text": "Rotita was so very empathetic with my issue of my lost order; just wanted me to be happy and reshipped my order. Thank you Rotita", "rating": 5}, {"title": "I had a hard time trying to return it…", "text": "I had a hard time trying to return it took three day But today I found the right girls , they gave me the address and I Ordered more", "rating": 5}, {"title": "Great Chat Line.", "text": "I received my items in the mail but I needed to exchange them for a different size.  I went to do that and it said that they had not been delivered yet so I had to wait.  I went to their chat line and the person that answered was very helpful.  She sent me the mailing tag I needed to return my items and I will now order them in a different size.  Thank you for all your help.", "rating": 5}, {"title": "Everything I’ve gotten from here has…", "text": "Everything I’ve gotten from here has been great except logging into my account", "rating": 5}, {"title": "Excellent customer support", "text": "Date of experience: July 25, 2023", "rating": 5}, {"title": "They answered my questions quickly and…", "text": "They answered my questions quickly and efficiently.  They were very good and helpful.", "rating": 5}, {"title": "great customer service", "text": "I order from here all of the time. Of course there is going to be mishaps but issues always get resolved. Customers service is always so nice and helpful.products are good quality.", "rating": 5}, {"title": "Fab service", "text": "Ordered 2 dresses beautiful but they just wernt for me. Cost was £87. Had to return and refund of £80 was processed within a week or 2 . I would not hesitate to order from this company again. Fab service.", "rating": 5}, {"title": "Excellent customer service", "text": "Date of experience: July 20, 2023", "rating": 5}, {"title": "I thought the products are good and fit…", "text": "I thought the products are good and fit welland the service I was great also.maryludiscountshop.com", "rating": 5}, {"title": "I bought the wrong size blouse and they…", "text": "I bought the wrong size blouse and they were very accommodating with the return and reorder. The blouse was great quality and I will certainly order again. Joan", "rating": 5}, {"title": "Brenda was great", "text": "Brenda was great. She did everything she could to get my last minute order delivered when I needed it!", "rating": 5}, {"title": "the chat agent was very patient with me", "text": "Date of experience: July 15, 2023", "rating": 5}, {"title": "I really liked the bathing suit I…", "text": "I really liked the bathing suit I bought and I also very much appreciated the email responses since I have had trouble logging in to my account on line. I am still waiting for the refund to be deposited but I know I was told it could take a bit of time to process. I will definitely consider buying from Rotita again.", "rating": 5}, {"title": "Sowshi", "text": "I didn't have the order # to give Sowshi and the rep was still able to find the dress I needed to return.  The rep was beyond greatness.  Couldn't be any greater!  Keep rep and give rep a pay raise. Sowshi definitely earned it !!!!!  I was happy I got Sowshi a 2nd time for a chat.  Sowshi is the BEST of the BEST!!!!", "rating": 5}, {"title": "Great deals on swimwear", "text": "Great deals on swimwear.  Customer Service is excellent.", "rating": 5}, {"title": "Outstanding customer service", "text": "I had to return a merchandise and I misunderstood the procedure to do so; however, I got great support and understanding from Rotita's staff. For me, it turned out to be a great customer service experience!", "rating": 5}, {"title": "I returned merchandise today at the…", "text": "I returned merchandise today at the Canada Post office and needed to send a copy of the receipt with tracking details to your office. I had no idea how to do it so I opened a live chat. The agent guided me step by step what to do and my issue was resolved quickly. Excellent customer service. Your clothing is good quality. I had to return 1 item because it was too small and bigger size not available. Everything else I bought was beautiful and fit well. I am very pleased.", "rating": 5}, {"title": "My dress was very pretty but too large…", "text": "My dress was very pretty but too large on me so I needed to return it.  The representative was very helpful and sent me a return label immediately.  Thank you.", "rating": 5}, {"title": "Although I returned my item the quality…", "text": "Although I returned my item the quality was very good and returning was easy.  I also used the chat and was served fast and efficiently", "rating": 5}, {"title": "Smooth transaction", "text": "Date of experience: June 23, 2023", "rating": 5}, {"title": "Very satisfied for your quick answer to…", "text": "Very satisfied for your quick answer to my issue and for your services. I have appreciated. Thank you very much.", "rating": 5}, {"title": "Great Customer Service", "text": "I placed an order for a swim top today but realized I would be at a different address when it was to arrive.  I contacted a representative at Rotita and received a very prompt and courteous reply and was assured that the address change for my order would be taken care of.Thank You", "rating": 5}, {"title": "Great products", "text": "Quality products, sizing great, shipping very fast.Will order for years to come.  Its difficult for seniors to find clothing that hides the tummy, but you nailed it in spades.  Great job!", "rating": 5}, {"title": "Great fashion👌", "text": "Lovely product Lovely quality 👌", "rating": 5}, {"title": "Excellent Customer Service", "text": "Great customer service and outreach!", "rating": 5}, {"title": "Good product and customer service", "text": "Like the swim suits. Had to return one and received timely refund.", "rating": 5}, {"title": "Good experience", "text": "Rotita can be trusted", "rating": 5}, {"title": "Rotita has quickly become my go-to…", "text": "Rotita has quickly become my go-to place for tops.  The quality of the tops is perfect, the quick response to my order and in receiving the items is great.  I have had to return 1 top, and it went off without any problems and I can't wait to order with the credit I have now.I highly recommend and endorse Rotita.", "rating": 5}, {"title": "My refund was handled great!", "text": "Date of experience: June 08, 2023", "rating": 5}, {"title": "Excellent service for me so far!!!", "text": "Date of experience: June 10, 2023", "rating": 5}, {"title": "I forgot to apply a coupon code and the…", "text": "I forgot to apply a coupon code and the live chat agent honored it. Great customer experience!", "rating": 5}, {"title": "Simple chat and quick service.", "text": "Date of experience: June 06, 2023", "rating": 5}, {"title": "The customer service is great and I can…", "text": "The customer service is great and I can not wait to try out my new swimwear !", "rating": 5}, {"title": "I liked the quality of the products", "text": "I liked the quality of the products, but I didn't like the way it fit for my body. And the customer service is great - return was very easy for what I needed to return.", "rating": 5}, {"title": "Excellent customer service", "text": "Excellent customer service, adorable and affordable variety of merchandise and excellent fit in all categories!", "rating": 5}, {"title": "Quick answer", "text": "Quick answer to email questions before package arrived", "rating": 5}, {"title": "Very fast in solving problems..and also…", "text": "Very fast in solving problems..and also very kind ..great job", "rating": 5}, {"title": "Loyal Customer", "text": "This is the third time I place an order with Rotita and I am satisfied with the quality of every outfit I purchased. I made one return and the transaction was smooth. I will recommend Rotita to friends and family! Keep up the good work you have a loyal customer.", "rating": 5}, {"title": "Happy Customer - I have ordered from Rotita before and…", "text": "I have ordered from Rotita before and was extremely happy.  This time I  ordered two tops and while they are of great quality, they just were not to my liking.   I contacted Rotita and was given a shipping label to return the merchandise.  This happened within seconds.  I appreciate their timely response and am looking forward to the refund, and doing future business with them.", "rating": 5}, {"title": "I needed my dress expedited and…", "text": "I needed my dress expedited and customer service was very willing to assist me and do what they can.", "rating": 5}, {"title": "Efficient customer service", "text": "Had very fast and efficient service regarding my request to have my order shipped quicker.", "rating": 5}, {"title": "Nice purchase and good customer service!", "text": "Nice purchase! I initially had a problem with my order (wrong item sent) and Maggie from Rotita fixed it easily and quickly. Thanks Maggie!!!", "rating": 5}, {"title": "Great follow up and refund on a return", "text": "Great follow up and refund on a return.  Great customer satisfaction.", "rating": 5}, {"title": "As usual", "text": "As usual, great job!!", "rating": 5}, {"title": "The quick and polite responses", "text": "Date of experience: May 22, 2023", "rating": 5}, {"title": "Bathing Suit and Hat", "text": "Bathing Suit and HatGreat job with assisting in locating this order for me, I appreciate all of your help this morning.  Quick and efficient.", "rating": 5}, {"title": "Clara did an excellent job in canceling…", "text": "Clara did an excellent job in canceling an item in my Order.", "rating": 5}, {"title": "Pantsuit and a white dress", "text": "The items that I ordered came promptly. I really liked both of the orders. My pastor gave me a compliment when i wore the pantsuit. Very satisfied.....", "rating": 5}, {"title": "Customer service", "text": "The customer service that helped me the person that helped me was very helpful very delightful and very respectful and reassured me my things were on their way and made this woman feel very confident and knowing her things were coming thank you five stars", "rating": 5}, {"title": "Excellent Customer Service!", "text": "The customer service representative was professional and prompt in handling my issue.", "rating": 5}, {"title": "clothes fit perfectly", "text": "clothes fit perfectly, couldnt be happier", "rating": 5}, {"title": "Great customer service and cute products", "text": "You were willing to help me change the size of my beautiful tankini. Even thought you were not able to change it because your order processed fast, you were willing, that means a lot to me. Also, the medium tankini fits me perfectly. I didn't mind much that the earrings were not available anymore, and you kept me informed and readjusted my order accordingly.", "rating": 5}, {"title": "All the shirts fit as expected", "text": "All the shirts fit as expected. Great price and my husband loved them!", "rating": 5}, {"title": "My package arrived earlier than the…", "text": "My package arrived earlier than the expected date. The items were great.Received a follow up email to confirm whether packaged had been received. Accidentally clicked on the wrong option and was sent a follow-up email regarding the issue. Next came the full transit details to confirm that it had been delivered. Sent a reply that I had clicked on the wrong option and had received the package. Loved how quickly they sent confirmation from their side. This is the second order I've made in the last year and my experience has been great.", "rating": 5}, {"title": "Chat: Efficient and quick response", "text": "I did chat online to check if my order has been shipped yet and I received a response immediately. Very impressed. I will follow up regarding the item after I receive it", "rating": 5}, {"title": "Very helpful.", "text": "Date of experience: April 27, 2023", "rating": 5}, {"title": "Beautiful bathing suits that enhance…", "text": "Beautiful bathing suits that enhance women pretty shapes. Excellent service, on changing part of an order. Very polite and helpful.", "rating": 5}, {"title": "Excellent Customer Service", "text": "So I had questions about my order from Rotita and a service representative Brinda was very helpful and answered all my questions. I felt comfortable not being rushed and was extremely satisfied with the customer service I received.", "rating": 5}, {"title": "I made an error on my order form", "text": "I made an error on my order form, couldn't figure it out.  The help was immediately given, easy to do, very helpful!", "rating": 5}, {"title": "Happy Customer", "text": "I wrote to Rotita in mid-April to ask why I did not receive any news about my purchase done in March. They replied right away to tell me they are checking it. 2 days ago I received my tops, tried it and was thrill they are all fiting very well. Thank you for your concerned and for your professionnalism.I will continue to purchase to your store and I will share it to my friends.An Happy Customer.Danièle St-Jacques", "rating": 5}, {"title": "I love this site", "text": "I love this site.  Really great clothes, color, style, fit, all the real deal.  I plan on staying a frequent flyer here.  All my friends compliment me. No one finds these items, so I get to be fashion forward.  Plus great customer service makes this a great complete package!", "rating": 5}, {"title": "4 bathing suits", "text": "I ordered 4 bathing suits. They're beautiful,  the color is a little different than what was shown in the photos,  lovely material,  fits really good.  Shipping was not too bad to Canada, 2 weeks.  I was missing a bathing suit bottom, they were quick to respond to send them out.  I would definitely buy their product again.", "rating": 5}, {"title": "Very good service.", "text": "I didn't get the package, and emailed Rotita. I got a response very quickly, and my next door neighbour came around with the package. It was in her black recycle box. Both boxes are side by side, so the driver did deliver, but to the wrong box. Many thanks.", "rating": 5}, {"title": "The agent was so responsive and helpful…", "text": "The agent was so responsive and helpful - I was a little wary ordering online with a retail organization I never really heard of.  The clothing is awesome!  Just a pair of short too big and the agent was so helpful with the exchange.  I won't hesitate to buy further items with Rotita!", "rating": 5}, {"title": "Great customer service", "text": "Date of experience: April 03, 2023", "rating": 5}, {"title": "Ms. Brinda", "text": "Ms. Brinda she help me to look good at my son's wedding. And I thank her for that.", "rating": 5}, {"title": "Shipping and attention has been great", "text": "Shipping and attention has been great. Everything very fast and correct.", "rating": 5}, {"title": "This is my first time shopping  at…", "text": "This is my first time shopping  at Rotita and I love the product  I   received and the feed back that I have received  i will recommend the store to anyone who wants to buy quality  products products.", "rating": 5}, {"title": "I was promised my order will be…", "text": "I was promised my order will be canceled  and refunded due to site error.", "rating": 5}, {"title": "Happy Customer from Australia", "text": "I needed to use live chat for fast information, it was fantastic the response was really fast & extremely helpful and of course productive.  Well done Rotita", "rating": 5}, {"title": "Absolutely AMAZING", "text": "I can't say enough about this company, customer service, and the items I have gotten.  Everything has been true to size, the customer service has gone above and beyond, and the shipping has been quick and easy.  Will definitely be purchasing again!!!", "rating": 5}, {"title": "I have just received 2 Tankini", "text": "I have just received 2 Tankini, the delivery date was as stated, in fact a little earlier, quality is very good and sizing true to size, I have no complaints", "rating": 5}, {"title": "I have never had to contact them before…", "text": "I have never had to contact them before and never had any issues. I was trying to find an outfit that I previously purchased but in a different color...did a chat and within minutes got the help I needed!!! 10 star service across the board!!!", "rating": 5}, {"title": "Helpful with my return", "text": "Agent was very helpful and resolved my issue quickly!", "rating": 5}, {"title": "Very helpful.", "text": "Date of experience: March 10, 2023", "rating": 5}, {"title": "My first order and it arrived even…", "text": "My first order and it arrived even sooner than expected. Fit and quality of tankini and a top are excellent and colour as pictured. Will definitely place another order with this company and have recommended to others. Thanks Susie!", "rating": 5}, {"title": "Return monies", "text": "Sowshi was extremely helpful with my trying to return my purchases.The only thing was I recieved little in return of the amount I spent.", "rating": 5}, {"title": "Very helpful but", "text": "Very helpful but, I can’t leave feedback on the product or on the shipping until I actually receive the items.", "rating": 5}, {"title": "Sowshi was a terrific help in changing…", "text": "Sowshi was a terrific help in changing my order shipment to priority so I have my outfits for My Carribean Vacation. THANK YOU!!!!!!", "rating": 5}, {"title": "Items ordered received and was…", "text": "Items ordered received and was surprised how good the quality was. Use their measurements for sizing! Had to return one swimsuit and exchange process went smoothly. Customer service was quick in responding to my questions and in helping with return/exchange. Will definitely order again.", "rating": 5}, {"title": "Fast and friendly customer service on a…", "text": "Fast and friendly customer service on a Saturday evening.", "rating": 5}, {"title": "I wanted to thank Sowshi for how…", "text": "I wanted to thank Sowshi for how quickly she responded to me. She was so very pleasant and extremely helpful. Extremely happy with her. Thank you again Sowshi.", "rating": 5}, {"title": "They were very quick to answer my…", "text": "They were very quick to answer my questions. She double checked to make sure my order was correct and that I would receive in time", "rating": 5}, {"title": "Great", "text": "Brenda was good she did excellent on answering all of my questions I really appreciate it can't wait to get my product thank you", "rating": 5}, {"title": "Awesome customer service", "text": "Awesome customer service. Very quick to answer and resolve my issue. And without me having to research which order I was referring to she already knew. Very knowledgeable and professional 👏 😘 I don't remember the name of the person that helped me but it was something like sousha, forgive me I know I butchered it. And I don't know the reference number.", "rating": 5}, {"title": "I had a question and Clara was very…", "text": "I had a question and Clara was very helpful and answered my question promptly. Awesome customer service  :-)", "rating": 5}, {"title": "Answered my questions hopefully I will…", "text": "Answered my questions hopefully I will receive my refund.. very kind and helpful.", "rating": 5}, {"title": "Order Correction", "text": "used the live chat to correct an order item.was fast, easy and painless", "rating": 5}, {"title": "Prompt and attentive", "text": "Renee was very prompt and courteous. I feel she read the ticket thoroughly and understood my issue. I think I got the replacement faster than the original. Very happy.", "rating": 5}, {"title": "The kindness of your staff", "text": "The kindness of your staff. Your staff was polite and efficient with answering my questions. So very helpful.  Thank you.", "rating": 5}, {"title": "Ovayi was helpful on chat", "text": "Ovayi was helpful on chat.  I hope to see the rest of my order soon.   Valentine's day is almost here.  Rush order was offered.  Good.", "rating": 5}, {"title": "Brinda was great!", "text": "Brinda was great!! Had questions on my order and she was quick and helpful.", "rating": 5}, {"title": "Clara was awesome", "text": "Clara was awesome! quick, efficient and very helpful!  Never used your products before so I'm now even more excited for my goodies to arrive!  Certainly made my day!", "rating": 5}, {"title": "I needed info on how to retu two…", "text": "I needed info on how to return two items the rep was very helpful and in less than two minutes I had the info I needed . Great customer service", "rating": 5}, {"title": "It is my first time buying", "text": "It is my first time buying.  And was concerned about my package and chat help very much.", "rating": 5}, {"title": "Brinda was very helpful and prompt!", "text": "Date of experience: February 01, 2023", "rating": 5}, {"title": "Customer service agent so kind and…", "text": "Customer service agent so kind and polite. I attempted to reach out on an item I ordered and had not received nor was it listed on my orders page, but I know I paid for it. The connection was immediate and my rep was the sweetest thing. I went back to get her my order # and got a notice of, you left something behind with a pic of my sweatshirt. I was completely embarrassed. They were very understanding, very kind! Thank you, Rotita!", "rating": 5}, {"title": "Great customer service", "text": "Great customer service experience. Very kind, understanding, helpful and thorough.", "rating": 5}, {"title": "I contacted Customer Service because I couldn't get a return ticket.", "text": "I contacted Customer Service because I have been unable to get a ticket to return my items because it kept saying my order was not there.  So I finally hit the chat and got Brinda who was absolutely awesome.  She found out that my order was under my old email address and that is why it wasn't coming up.  She found my order number and now I am able to do a ticket and return the items that do not fit me.  I was so excited to get results because I thought I was going crazy.   She told me exactly what to do in less than 5 minutes.  Great job Brinda.", "rating": 5}, {"title": "contacted by shipping to be expedited - thank you", "text": "I contacted Rotita to get my shipment expedited and the help was excellent. Hope I get my order before Feb 10th so I can take my purchase to my vacation. Thank you so much :-)", "rating": 5}, {"title": "Renee was very helpful", "text": "Renee was very helpful, my order got here quicker than she  expectedLeslie", "rating": 5}, {"title": "The USPS sent my package back to…", "text": "The USPS sent my package back to Rotita.  I needed my dress for a sweet sixteen.  Coming up very soon. Clara told me on what to do.", "rating": 5}, {"title": "Rotita’s GREAT", "text": "Hi May, my experience with rotita was GREAT!! Thank you so much.. I will definitely be ordering again in the future.😊", "rating": 5}, {"title": "So fast and easy", "text": "So fast and easy!  Thank you, Clara.  You were a BIG help.", "rating": 5}, {"title": "Sara was very informative", "text": "Sara was very informative.  She explained the entire shipping process and estimated times.  I was concerned about getting an item for a certain event.  She made me feel more confident about my order.", "rating": 5}, {"title": "Patient", "text": "Sara was polite and tried her best to help me.", "rating": 5}, {"title": "Sara was great to deal with-she was…", "text": "Sara was great to deal with-she was very helpful and responsive solving my issues.", "rating": 5}, {"title": "Thank you Clara really appreciate you…", "text": "Thank you Clara really appreciate you protecting response", "rating": 5}, {"title": "Easy to follow process for exchange", "text": "Easy to follow process for exchange. Clear email communications. Looking forward to receiving the replacement.", "rating": 5}, {"title": "Sara was very quick to respond", "text": "Date of experience: January 21, 2023", "rating": 5}, {"title": "This is my second order for multiple…", "text": "This is my second order for multiple items. Very happy with my orders. Was also easy to make a correction to the order. Sizes are correct too.", "rating": 5}, {"title": "Oviya was a great help on the items I needed to return.", "text": "Oviya was a great help on the items I needed to return.  Quick and easy. Thank you so much for your help.", "rating": 5}, {"title": "Oviya was very helpful with my order", "text": "Date of experience: January 20, 2023", "rating": 5}, {"title": "Clothes are not meant for petite women.", "text": "My experience with Clare was very helpful but still haven't been able to solve return problem", "rating": 5}, {"title": "Quick turnaround for an exchange on a…", "text": "Quick turnaround for an exchange on a bathing suit, handled by Renee.", "rating": 5}, {"title": "Sara said she would do express for us 👍", "text": "Date of experience: January 19, 2023", "rating": 5}, {"title": "Professional and successful.", "text": "Sowshi looked after me very quickly.  I appreciated the very good service.", "rating": 5}, {"title": "Sara is trying to resolve my problem…", "text": "Sara is trying to resolve my problem and made me feel reassure that I will be getting my order soon.", "rating": 5}, {"title": "Sara did a fantastic job thank you so…", "text": "Sara did a fantastic job thank you so much", "rating": 5}, {"title": "Clara was extremely helpful", "text": "Date of experience: January 17, 2023", "rating": 5}, {"title": "Really helpful good customer service", "text": "Date of experience: January 14, 2023", "rating": 5}, {"title": "May provided me with a great service.", "text": "Date of experience: January 11, 2023", "rating": 5}, {"title": "The package came right away as the…", "text": "The package came right away as the Customer Support Sue has told me.Very beautiful soft material and I’m very satisfied.", "rating": 5}, {"title": "May was very helpful.", "text": "Nay was very helpful.", "rating": 5}, {"title": "Helpful and hopefully get back to me…", "text": "Helpful and hopefully get back to me with an answer to my enquiry of an un hemmed item i received :) besides this products look great cant wait to try them out when i head on my holiday in a couple weeks :D", "rating": 5}, {"title": "MAY was very helpful in dealing with my…", "text": "MAY was very helpful in dealing with my issue.  Everything fine now.", "rating": 5}, {"title": "Good clothes get compliments when I it them on", "text": "Fast service always someone there to chat with", "rating": 5}, {"title": "Swooshi was quick to respond to help…", "text": "Swooshi was quick to respond to help find where my order is at", "rating": 5}, {"title": "Clara was awesome in answering my…", "text": "Clara was awesome in answering my questions I had regarding my order and updating my email addressThank you Clara", "rating": 5}, {"title": "Clara solved my problem quickly as I…", "text": "Clara solved my problem quickly as I ordered two of the same dress by mistake and she issued me a refund to the original form of payment.  Thanks Clara!", "rating": 5}, {"title": "May resolved my parcel delay with speed…", "text": "May resolved my parcel delay with speed and competence", "rating": 5}, {"title": "Very quick with a response", "text": "Date of experience: January 07, 2023", "rating": 5}, {"title": "Sue was a great help", "text": "Sue was a great help, very much appreciated.", "rating": 5}, {"title": "I ordered for the first time and I am…", "text": "I ordered for the first time and I am very happy 😊with my purchase. Sizing perfect even hubby liked my purchase ♥️ .I would like to know when looking at items I like and mark it with the ❤ how do I go back and find the ones marked with the red heart?", "rating": 5}, {"title": "Renee did an excellent job with…", "text": "Renee did an excellent job with customer service. Made me a very satisfied customer.", "rating": 5}, {"title": "CSR named May provides kind service", "text": "May, the customer service rep at Rotita, kindly issued in-store credit for a small item I accidentally threw out with the packaging - even though I acknowledged it was my fault. I remain a loyal, long-term Rotita customer because they always treat me with respect.", "rating": 5}, {"title": "9114 May is excellent", "text": "Date of experience: December 29, 2022", "rating": 5}, {"title": "Fantastic service and help off May", "text": "Fantastic service and help off May? Thank you very much May over the moon with the product, Chris😊", "rating": 5}, {"title": "May was very helpful and efficient", "text": "Date of experience: December 23, 2022", "rating": 5}, {"title": "Alice has shown wonderful customer…", "text": "Alice has shown wonderful customer service. Was prompt with reply’s and very helpful in sorting out the error.", "rating": 5}, {"title": "My order was not delivered together", "text": "My order was not delivered together. May was helpful in tracking the order and getting the missing items delivered.", "rating": 5}, {"title": "I had to return my outfits my contact…", "text": "I had to return my outfits my contact was May, she was very prompt with her replies, polite and courteous. I couldn't have been treated any better. So thank you May, I appreciate how helpful you were.", "rating": 5}, {"title": "Prompt response to my query and", "text": "Prompt response to my query andgood advice.Very happy with the service.", "rating": 5}, {"title": "Thank you so much Renee", "text": "Thank you so much Renee! Even though the event I was planning on going to was cancelled you gave good info on how to know exactly the answer to my question!", "rating": 5}, {"title": "Excellent service", "text": "Excellent service. Returning items was easy and very happy with money returns.Keeping me informed every step of the way.Great company to deal with.", "rating": 5}, {"title": "Vindicated", "text": "While l was disappointed in non delivery of my order the cancellation and refund of money was great.  Five stars to May.", "rating": 5}, {"title": "Helpful and prompt issue resolved…", "text": "Helpful and prompt issue resolved immediately so I am pleased with service", "rating": 5}, {"title": "May was very attentive to my questions…", "text": "May was very attentive to my questions and concerns. She handled my problems norm immediately with the result that I was happy with. While I wasn’t able to receive my order due to timing with Christmas, I will place another order at another time. Thank you May!!", "rating": 5}, {"title": "Great Clothing", "text": "Renee was very good and processed everythingquickly.", "rating": 5}, {"title": "I had ordered a top from Rotita", "text": "I had ordered a top from Rotita.  They had a backlog so I did not get it for Christmas.  I decided to cancel the order.  May was very helpful in getting me a refund.  It came through on Paypal quickly.  I did order a different sweater awhile back.  I got that one and have worn it 3 times.  I have received many compliments.  It’s a Christmas sweater and very cute and festive.", "rating": 5}, {"title": "The customer service was exceptional", "text": "The customer service was exceptional. There was a delivery issue that was dealt with promptly and professionally. The garments are great value and lovely", "rating": 5}, {"title": "Thanks Alice", "text": "My package got lost and my customer care representative (Alice) was very willing to assist. She replied in a timely manner, was professional as well as pleasant.", "rating": 5}, {"title": "May made my Experience so Wonderful", "text": "May made my Experience so Wonderful! She went above and beyond to make sure I would receive my perfect size for my exchange! Her time and kindness is so very appreciated! I HIGHLY RECOMMEND ROTITA! High QUALITY clothing! EXTREMELY HAPPY with May in Customer Service! Thank you so very much!", "rating": 5}, {"title": "They were willing to update my order…", "text": "They were willing to update my order change without question.  I really appreciate that.", "rating": 5}]