[{"title": "I tend to wait until the last minute…", "text": "I tend to wait until the last minute and hate these types of complicated processes (I'm a bit of a world traveler and this isn't the first country I've gone through this process with). I would give 10 stars. I had to do much less than I thought and with the VIP expedited process, I was blown away. EXCEEDED my expectations.The only constructive feedback was around having to scan each passport page. While they were clear that images weren't going to be accepted, it was on my to make sure I read and followed those instructions. If they looked at my initial scan (with images) sooner, I would have saved a little time. That said, that is a ME issue not them. But had they looked at it originally when I placed the order, I may not have a few day delay. Regardless, HIGHLY RECOMMEND! ", "rating": 5}, {"title": "Excellent service.", "text": "Excellent service.Overall the process was very smooth and seamless. The company provided exactly what they said they would in the expected time frame. The online portal for uploading documents was slightly clunky at first, but once you got over that hurdle it was a really easy process and am very happy I used this service.", "rating": 5}, {"title": "e-residence.com Very Effective", "text": "The process through e-residence.com is unbelievably simple and straightforward.  Application took minutes and the NIF was achieved in a matter of two days.  e-residence.com is highly recommended!", "rating": 5}, {"title": "The only way to do your NIE at Madrid", "text": "If you’re moving to Madrid, it is pratically impossible to book an appointment for a NIE - and I’m sure it is also due to this “market” created by agencies like this one. Still, I had an urgent need to do my NIE and they delivered it within seven work days, so I’m grateful for it and for how easy the online process is. So my suggestion is: don’t waste your time booking in other cities (I got rejected in three places), or refreshing the website forever for an appointment in Madrid, and just pay e-residence to do it for you without any hassle. ", "rating": 5}, {"title": "Highly recommend this company", "text": "It was easy to go trough the whole prozess of applaying for my numero de seguridad social (España)I am really happy that I has choosen e-resicence.com The team was always very helpful and the process took even less days than offered on the website. ", "rating": 5}, {"title": "Excellent service", "text": "Excellent service, really happy to tell I got my NIE of Spain  sooner than expected. I would highly recommend their services. ", "rating": 5}, {"title": "Excellent process and communications", "text": "The level of communication is amzing, every step is being communicated very well.Process is exteremly fast and freindly.", "rating": 5}, {"title": "Diligent Service", "text": "Responded quickly; answered and provided assistance when asked; keep me up to date with process as it progressed.", "rating": 5}, {"title": "Nif Number ", "text": "great service, very helpful, would recommend ", "rating": 5}, {"title": "I am really surprised by the…", "text": "I am really surprised by the professionalism and dedication of the e-residence team. They sent me my NIF in a very short time.", "rating": 5}, {"title": "Communication was TOP", "text": "Communication was TOP! I was able to have things resolved via whatsapp immediately and email. Thank you team!", "rating": 5}, {"title": "Excellent service", "text": "Excellent service, I received my NIE and NUSS even faster than expected and the WhatsApp support was fast and helpful, very professional support, I can highly recommend this agency.", "rating": 5}, {"title": "Received the nie in a very short time", "text": "Received the nie in a very short time, and whenever I wasn’t sure about what I have to send they were quick to answer my questions, and with very detailed answers.", "rating": 5}, {"title": "Excellent!", "text": "Excellent!With appointments in the Berlin's Spanish embassy only available in three months, a need for notarized documents from other expensive services/lawyers as remote alternative and the flight+accommodation prices too expensive on short notice to do it in person in Spain - I'm glad I found e-residence services in the end!Process was smooth, automated with online verification of the passport, got my NIE within a week. All online.", "rating": 5}, {"title": "Did their job to get me NCC fast", "text": "Did their job to get me NCC fast, reached out for specific details required ", "rating": 5}, {"title": "I got my documents in 5 days", "text": "I got my documents in 5 days, customer service is very good, all my questions were answered. Very satisfied with the service! ", "rating": 5}, {"title": "Outstanding service! ", "text": "Outstanding service! It was speedy, efficient and they maintained excellent communication with me throughout the process via regular updates. I love the ability to ask quick-fire questions bank on WhatsApp throughout the process! ", "rating": 5}, {"title": "Outstanding service! ", "text": "napjaOutstanding service! I can't still believe this company made the NIE service so easy. Their communication with the clients is amazing. Whole process is very smooth and easy. And I got my NIE even earlier that I was expecting. I can only recommend this company!!!", "rating": 5}, {"title": "Easy, reliable and fast service!", "text": "I had to sign and notarize a Power of Attorney. All the process runned fast and smoothly by email. At the end they gave me the option to send the original document by mail too. Very good! I recommend it!", "rating": 5}, {"title": "Very quick and efficient", "text": "Very quick and efficient ", "rating": 5}, {"title": "La fiabilité ", "text": "Very very good service ", "rating": 5}, {"title": "Efficient application", "text": "The application went smoothly and efficiently.  I have no complaints about your service, in fact it was much better than I was expecting.  I would reccommend it to my colleagues.", "rating": 5}, {"title": "Quick and efficient ", "text": "Quick and efficient Thanks", "rating": 5}, {"title": "Very good and fast also multiple NIE numbers", "text": "Everything went smooth from the beginning. The company is professional and reacts fast through Whatsapp keeping you up-to-date and answering all questions. I have bought multiple NIE numbers for Spain here and they have a very good lawyer doing things fast! I received my NIE number long before the time limit they arranged everything at La Policia great now I can buy the property I want.", "rating": 5}, {"title": "Doubts but in the end it was incredible", "text": "At first I had the impression that the site was a very well done showcase of a scam. But in the end I took the risk and I'm not disappointed at all. A hyper-responsive and professional team of lawyers takes your request seriously.I recommend for everyone who does not want to go through a very long administrative system.Thank you for your services and maybe see you soon ;)", "rating": 5}, {"title": "Spanish NIE - great service and highly recommended", "text": "Spanish NIE. I saw the reviews and trusted them, and was right to do so. Absolutely fantastic service, very competitively priced and NIE received in under two weeks.Communication is fantastic! The company uses WhatsApp, and all my questions were answered very quickly, some of them immediately. If you are unsure, simply speak to them on WhatsApp. It is very simple and easy, and I would recommend to anyone to use E-residence. Thank you! ", "rating": 5}, {"title": "Wow excellent service related to…", "text": "Wow excellent service related to Portuguese NIF and delivered as requested: on time", "rating": 5}, {"title": "Spanish NIE", "text": "I am an American and used e-residence to obtain a Spanish NIE number. It was fast, very easy to nvaigate and was secure. The team communicated very well. I highly recommend this company.  ", "rating": 5}, {"title": "Very quick and efficient service", "text": "Very quick and efficient service, I can't fault anything", "rating": 5}, {"title": "These guys are AMAZING and so affordable.", "text": "The application and uploading of documents was a breeze. I was kept informed at every stage of the progress of my application. My NIF was delivered in just 4 days. AMAZING!", "rating": 5}, {"title": "Fastest most trustworthy online NIE application ", "text": "Incredible service! Honestly I wasn’t sure my NIE could be done completely online and in a matter of days. E-residence assured me with timely responses that I’d get my nie by email, and all for the lowest price I could find! Thanks so much for your ability to do this quickly and effectively! Eternally grateful! ", "rating": 5}, {"title": "Wonderful excellent service provided by…", "text": "Wonderful excellent service provided by this team. I had my reservations at first but they will quickly dispelled when the  document was notarised as promised with the 24hr window given over the weekend . Will definately be using this service again.  ", "rating": 5}, {"title": "Amazing service", "text": "Amazing service. I paid the 4 weeks service and got it in less time. Super helpful service by WhatsApp. If you are searching for this type of service. Don't hesitate. I was septic at first but couldn't be more happy now.", "rating": 5}, {"title": "It is expensive but very easy", "text": "It is expensive but very easy. In some countries like Greece it is impossible to notarize foreign documents. This company can do it as they are based in Sweden. They were also willing to hold on to my document longer. So if you need to get it done fast and efficient, this is your place.", "rating": 5}, {"title": "Great service", "text": "Great service, faster than expected. Looking forward to using their services in the future.", "rating": 5}, {"title": "Loved this service…", "text": "Loved the fact I could chat immediately on WhatsApp with questions and get answers came back instantly and service was very fast and very efficient. ", "rating": 5}, {"title": "Always polite and very helpful", "text": "Always polite and very helpful; finally pointed the way to get my NIF as I was having some trouble with the official website. Thank youCJ", "rating": 5}, {"title": "wow needed a modification to a…", "text": "wow needed a modification to a previously issued Spanish NIE that I got through the VIP package 3 month ago and the change was made same day without additional charge. Thank you !!! ", "rating": 5}, {"title": "Fast service at great price", "text": "I was paying 80 euro per month (960 euro for 12 months) for Portuguese fiscal representation from another company.  I received the same service from e-Residence for 150 euro for the first 12 months, a huge savings, and the responses were always quick.", "rating": 5}, {"title": "Everything has been handled with…", "text": "Everything has been handled with transparency and respecting the deadlines. Good communication the team is always available ", "rating": 5}, {"title": "Great WhatsApp support and help from the team…", "text": "WhatsApp support and help from the team on every step make a great solution for people who decide to relocate.", "rating": 5}, {"title": "Public Notary ", "text": "The service for getting my document notarized was very easy, professional, and they were really good about getting it done by the date I needed. The help chat is great and they replied promptly. Would highly recommend!", "rating": 5}, {"title": "I cannot be more impressed with this…", "text": "I cannot be more impressed with this company. Very clear instructions and extremely communicative with emails and WhatsApp messaging", "rating": 5}, {"title": "Super quick process", "text": "Super quick process, no additional forms to fill in, helpful customer service. I was very impressed. Thank you! I will be telling others!", "rating": 5}, {"title": "Fast&positive", "text": "Fast, professional service with great result! Very kind and positive dialogue, quick answers on questions.", "rating": 5}, {"title": "The NIF made nice & easy with speed", "text": "The great ease at which documents required to apply for the NIF can be summited", "rating": 5}, {"title": "I had a fantastic experience with…", "text": "I had a fantastic experience with e-residence website Service - NIF. The team was professional, attentive, and went above and beyond to meet my needs. The service was seamless, and I truly felt valued as a customer. Highly recommend them for their exceptional service and dedication to quality!", "rating": 5}, {"title": "Fast and easy", "text": "It goes very fast without going to notar. Just all you got is to sit at house and answear a view quastion and upload your documenty. Very fast. I wait 3 days until i got the N.I.E. Thank you very much.", "rating": 5}, {"title": "I got my NIE number within the time…", "text": "I got my NIE number within the time frame that was given and it was very smooth process.", "rating": 5}, {"title": "Great service", "text": "Great service, I got my NIF within 2 business days. ", "rating": 5}, {"title": "Amazing service", "text": "I was prepared to wait 4 weeks for my NIE, but it arrived just in a few days when I couldn't even get an appointment with the local police. Amazing service.", "rating": 5}, {"title": "Speedy and professional support!", "text": "The e-residence team were highly responsive, professional and super efficient! What a great service. They get 5🌟stars from me! Thanks to the team for your great & speedy support! ", "rating": 5}, {"title": "Everything fine", "text": "Everything fine: good support and documents received earlier than expected", "rating": 5}, {"title": "Very fast", "text": "The whole procedure was completed very fast. And also the support per Watsapp, I find it very practical. Quite satisfied with the service overall.", "rating": 5}, {"title": "It has been an excellent experience", "text": "It has been an excellent experience! The most efficient service ever! 10 stars! ", "rating": 5}, {"title": "Exemplary Service ", "text": "Prompt and clear communication Easy application processClear guidelines and friendly/professional follow upQuick response to queriesMakes the customer feel at easeMuch appreciation to this team", "rating": 5}, {"title": "> Quick reply to all my questions in a…", "text": "> Quick reply to all my questions in a super English> Uncomplicated proceedings> I am very happy that you took care of my matter", "rating": 5}, {"title": "Very helpful and friendly", "text": "Very helpful and friendly. I had faced a tech issue while submitting the form, they resolved it very thoughtfully and quickly. ", "rating": 5}, {"title": "This was a great service and saved me a…", "text": "This was a great service and saved me a lot of time, and headache, in receiving my Spanish NIE. I definitely recommend this service versus trying to navigate the process on your own. ", "rating": 5}, {"title": "Easy, fast and efficient!", "text": "I applied for a NIE and received it within a week, much faster than I expected. A very good efficient service.", "rating": 5}, {"title": "Fast and professional response", "text": "Fast and professional response! Had my NIE number in 2 weeks instead of the 6 weeks initially quoted. Fabulous. Great service!Thank you ", "rating": 5}, {"title": "Efficient and kind ", "text": "You clarified all doubts, were always very gentle and resolved everything efficiently and quickly.", "rating": 5}, {"title": "Friendly app.", "text": "Friendly app.Very responsive.Mails are very polite and welcoming.Fast responses ", "rating": 5}, {"title": "I got my Spain NIE and Portugal NIF within 7 days", "text": "These guys helped me get my Spain NIE and Portugal NIF within 7 days. These guys are not joking for real. They got the most elite team of lawyers in Spain and Portugal. They will not betray their clients. The clients’ efforts are worth it. 🥳 👏", "rating": 5}, {"title": "Super quick ", "text": "Super quick ! Great service !", "rating": 5}, {"title": "They are very friendly and efficient", "text": "The company does its work quickly and accurately. The employees are very friendly and explain everything about the work process. Thanks them for their quality work!!", "rating": 5}, {"title": "Perfect service", "text": "Perfect service. Would recommend. Got my Spanish NIE in 3 days. ", "rating": 5}, {"title": "Great Service!", "text": "I got what was promised and faster than expected.Fast reply over WhatsApp.I will use them again in the future.Thanks", "rating": 5}, {"title": "Excellent service", "text": "Excellent service. We got our NIE much faster then promissed in the product description. Fast and efficient communication. ", "rating": 5}, {"title": "Perfect!", "text": "Everything is great. Satisfied with all process and service. ", "rating": 5}, {"title": "Just received my Spanish NIE number", "text": "Just received my Spanish NIE number, was relatively easy process and had the number in less than 2 weeks. Brilliant service would recommend to anyone.", "rating": 5}, {"title": "They are the best", "text": "They are the best. I've used them several times and every time they are professional and fast. Highly recommended.", "rating": 5}, {"title": "Best company in all Spain", "text": "Best company in all Spain! So easy to work with them!Genuine proffesionals, : Vytautas...", "rating": 5}, {"title": "Quick easy with great customer service", "text": "Quick easy with great customer service  ", "rating": 5}, {"title": "Fast & Convenient ", "text": "e-residence has been extremely fast and easy to begin the process remotely. I highly recommend their services!", "rating": 5}, {"title": "Great service", "text": "Date of experience: October 21, 2024", "rating": 5}, {"title": "This was easy…", "text": "This was easy and the alternative seems to add more steps and uncertainty. So I’m glad to have found this site.", "rating": 5}, {"title": "Great service for NIF", "text": "Great service for NIF in Portugal", "rating": 5}, {"title": "Easy to use, clear direction.", "text": "Easy to use, directions were clearly explained. ", "rating": 5}, {"title": "The best assist I've ever experienced!", "text": "The best assist I've ever experienced!! Professional and fast. Thank you 🙏 ", "rating": 5}, {"title": "Got my NIE and NUSS in under 2 weeks", "text": "Got my NIE and NUSS in under 2 weeks, couldn’t be happier with the service", "rating": 5}, {"title": "The document was ready on time", "text": "The document was ready on time. Online services were easy and transparent. ", "rating": 5}, {"title": "Excellent service", "text": "Excellent service. Had my NIE number in two weeks. Highly recommend. ", "rating": 5}, {"title": "e-résidence always delivers", "text": "e-résidence always delivers, but this time faster than ever! Thank you 🙏", "rating": 5}, {"title": "It’s very fast process", "text": "Very fast process and easy to use!!!", "rating": 5}, {"title": "amazing service", "text": "amazing service, got my nie within 2 weeks of paying them, communication was fast and easy via whatsapp and answered any questions", "rating": 5}, {"title": "Clear and fast service", "text": "The process was very clear, I received regular updates, and everything was done very fast", "rating": 5}, {"title": "This is the fourth time I used them and…", "text": "This is the fourth time I used them and every time they exceeded expectations", "rating": 5}, {"title": "Great Experience", "text": "Great Experience, the team was prompt in replying to any questions and delivered the required document earlier than promised. Would definitely recommend them ", "rating": 5}, {"title": "Great and quick service .", "text": "Great service .I got it in same day less than 24 hours . With full support in response through whatsapp and email.", "rating": 5}, {"title": "Fantastic company I can't rate them…", "text": "Fantastic company I can't rate them highly enough. Would 100 per cent use them again .", "rating": 5}, {"title": "very friendly", "text": "very friendly, immediatly help per via mail.", "rating": 5}, {"title": "Easy and convenient communication. Super quick responses…", "text": "Easy and convenient communication through WhatsApp!Queries answered immediately and all documents arrived well within timescales. Super easy to upload all the requested documents and files on a mobile phone which made it effortless especially when requesting for a family  :) ", "rating": 5}, {"title": "Service & timing was exactly as…", "text": "Service & timing was exactly as advertised. No surprises. ", "rating": 5}, {"title": "I ordered a NIE number", "text": "I ordered a NIE number. It tooks only 3 weeks instead of 6 weeks in the offer. So i am very happy. Thanks a lot!", "rating": 5}, {"title": "I was impressed with the speed you…", "text": "I was impressed with the speed you work, and the interest you show to your clients. Excellent work.", "rating": 5}, {"title": "They were great..", "text": "They were great... responsive and clear communication of the process ", "rating": 5}, {"title": "Amazing organization ", "text": "The team is attentive and responsive. They have great follow through.", "rating": 5}, {"title": "Very fast turnaround for NIF", "text": "Very fast turnaround for NIF. Easy online process.", "rating": 5}, {"title": "Great", "text": "Clear instructions, very helpful customer service, got my NIE number way before the estimated time! 100% recommended ", "rating": 5}, {"title": "Very fast and convenient", "text": "The notary service was very fast and convenient. Thank you!", "rating": 5}, {"title": "It was a very fast service and a grrzt follow up via WhatsApp ", "text": "It was a very fast service and a great follow up via WhatsApp ", "rating": 5}, {"title": "Quick Friendly Service", "text": "Quick Friendly ServiceVery quick turnaround, good communication throughout the process, and helpful information.  Would definitely recommend for Spain NIE / other Spain-related requirements. ", "rating": 5}, {"title": "Easy to apply, fast to get the result", "text": "It was easy, fast and pleasant. I expected to get the result way later ", "rating": 5}, {"title": "Great service ", "text": "Service provided within dates agreed. Great update service ", "rating": 5}, {"title": "Could not be happier", "text": "Could not be happier! Book the WhatsApp Option, the Communication was great also! ", "rating": 5}, {"title": "Very fast service ", "text": "Very fast service . Very responsive and responsible team ", "rating": 5}, {"title": "Great service!", "text": "Fast and effective. ", "rating": 5}, {"title": "Fast. Reliable ", "text": "Much faster than the suggested time frame. Very grateful for this. Thanks ", "rating": 5}, {"title": "They deliver on time.", "text": "Great job well done, on time and quite affordable. Great company.", "rating": 5}, {"title": "Very fast Service", "text": "Very fast Service. Highly recomend. ", "rating": 5}, {"title": "The service and speed is fantastic", "text": "The service and speed is fantastic. Thank you again. ", "rating": 5}, {"title": "Loving the Frequent updates", "text": "Love that they update every steps of their process. ", "rating": 5}, {"title": "Very friendly & efficient ", "text": "Helpfull, polite, efficient and very friendly.", "rating": 5}, {"title": "Everything was perfect", "text": "Everything was perfect! Good service, they were nice and really quick!", "rating": 5}, {"title": "it was quick and painless and the…", "text": "it was quick and painless and the website is easy to use ", "rating": 5}, {"title": "An excellent service", "text": "An excellent service. Efficient and responsive. Thank you.", "rating": 5}, {"title": "Less stress", "text": "Less stress, fast process, and fast delivery ", "rating": 5}, {"title": "Excellent company", "text": "Excellent companyIt performed exactly as advertised.Documentation obtained and despatched on time.Everything  executed flawlessly.", "rating": 5}, {"title": "Handled taxes efficiently", "text": "Handled taxes efficiently. Worry free.", "rating": 5}, {"title": "Very reliable", "text": "They guided me through the process, always helpfull. Excellence experience!", "rating": 5}, {"title": "Very good experience ", "text": "Very good experience , and fast respond and super helpful. ", "rating": 5}, {"title": "Easy to use", "text": "Easy to use, great communication and quick!", "rating": 5}, {"title": "They made the whole process seamless.", "text": "They made the whole process seamless. ", "rating": 5}, {"title": "Beyond expectation", "text": "Within 24 hours I received what's was ordered. Unbelievably efficient. ", "rating": 5}, {"title": "Great service", "text": "They were very helpful and answered any questions I had", "rating": 5}, {"title": "Great service", "text": "Great service! I was supposed to get my NIF in 2 weeks, got it in a couple of days. ", "rating": 5}, {"title": "Commitment to excellence ", "text": "The team delivered services that were highly transparent, efficient, and successful, demonstrating exceptional performance.", "rating": 5}, {"title": "All went will 👍", "text": "Date of experience: October 18, 2024", "rating": 5}, {"title": "Very Efficient", "text": "Very Efficient! Thank you so much", "rating": 5}, {"title": "Fast responsive and friendly !", "text": "Fast responsive and friendly !! Great !", "rating": 5}, {"title": "Fast treatment", "text": "Date of experience: August 21, 2024", "rating": 5}, {"title": "Speedy and comfortable ", "text": "It was speedy and comfortable connection via WhatsApp ", "rating": 5}, {"title": "Quickly and very good communication", "text": "Quickly and very good communication.  Thanks ", "rating": 5}, {"title": "Everything fine :-)", "text": "Perfect, fast work :-)", "rating": 5}, {"title": "Fast and professional", "text": "Smooth service via Whatsapp", "rating": 5}, {"title": "Very good and efficient service ", "text": "Very good and efficient service ! Can recommend ", "rating": 5}, {"title": "Very fast service", "text": "Very fast service. I have got my NIF for 3 days. ", "rating": 5}, {"title": "Quick and quality service", "text": "Quick and quality service ", "rating": 5}, {"title": "In the nick of time", "text": "The process was swift and precise", "rating": 5}, {"title": "Great", "text": "Great. Fast, easy and safe. The team responds fast to the messages. ", "rating": 5}, {"title": "Seamless", "text": "Seamless. Easy. Fast. Very happy. ", "rating": 5}, {"title": "Quickly and trust ", "text": "In 1 week I had my NIE, really quick and trusted.", "rating": 5}, {"title": "Great Service ", "text": "Quick and pro response. Got my NIE in 3 weeks ", "rating": 5}, {"title": "Extremely timely.", "text": "Extremely timely. ", "rating": 5}, {"title": "very good", "text": "very good, quite easy", "rating": 5}, {"title": "high speed", "text": "speed. I asked for a fast delivery.", "rating": 5}, {"title": "Great and fast service", "text": "Date of experience: August 09, 2024", "rating": 5}, {"title": "Quick and accurate servcice.", "text": "Date of experience: September 06, 2024", "rating": 5}, {"title": "Obtaining an N.I.E. number", "text": "Fast order fulfillment time", "rating": 5}, {"title": "Super efficient and rapid", "text": "Super efficient and rapid ", "rating": 5}, {"title": "fast processing", "text": "Date of experience: June 11, 2024", "rating": 5}, {"title": "NIE was made even faster than promised", "text": "NIE was made even faster than promised. Thank you!", "rating": 5}, {"title": "Very good", "text": "Very good. Excellent service ", "rating": 5}, {"title": "Amazing experience!", "text": "- Great and helpful customer service.- Fast service delivery.", "rating": 5}, {"title": "Great service", "text": "Quick and effortless service", "rating": 5}, {"title": "Fast and Friendly.", "text": "Fast and Friendly. ", "rating": 5}, {"title": "A+ service!", "text": "Date of experience: April 29, 2024", "rating": 5}, {"title": "Great service", "text": "Great service, very fast, clear communication and requirements.", "rating": 5}, {"title": "Very fast", "text": "Very fast, recommend", "rating": 5}, {"title": "Very good service!", "text": "Date of experience: May 21, 2024", "rating": 5}, {"title": "Great service and fast document…", "text": "Great service and fast document delivery!", "rating": 5}, {"title": "Very helpful and fast execution", "text": "Date of experience: August 07, 2024", "rating": 5}, {"title": "This guys are just awesome", "text": "Date of experience: June 17, 2024", "rating": 5}, {"title": "NIE was fast and great service", "text": "NIE was fast and great service ", "rating": 5}, {"title": "Got the NIF and password very quickly", "text": "Got the NIF and password very quickly. Thank you!", "rating": 5}, {"title": "It was very helpful", "text": "Date of experience: June 28, 2024", "rating": 5}, {"title": "super happy thank you!", "text": "All Good super happy thank you!", "rating": 5}, {"title": "Very quick", "text": "Very quick. Excellent communication ", "rating": 5}, {"title": "Very quick", "text": "Very quick, very clear for a good price. Thnx!", "rating": 5}, {"title": "Great experience", "text": "Great experience - high availability, quick response, well support!", "rating": 5}, {"title": "They got the Nie In 48 hs", "text": "They got the Nie In 48 hs. Amazing", "rating": 5}, {"title": "Very professional service", "text": "Very professional service! Much better than other competitors", "rating": 5}, {"title": "Process was easy and the WhatsApp…", "text": "Process was easy and the WhatsApp communication was very effective.", "rating": 5}, {"title": "Very quick and professional.", "text": "Very quick and professional. ", "rating": 5}, {"title": "It took around 1 month to get my NIE.", "text": "Date of experience: May 29, 2024", "rating": 5}, {"title": "Great experience ", "text": "Fast and convenient service. ", "rating": 5}, {"title": "5/5 Recommended ", "text": "Great communication with clients and fast service", "rating": 5}, {"title": "Awesome experience end to end", "text": "Awesome experience end to end, delivering ahead of estimate.", "rating": 5}, {"title": "Quick and Easy", "text": "Very quick and easy to use. Thank you", "rating": 5}, {"title": "Very professional and fast ", "text": "Very professional and fast . Highly recommended ", "rating": 5}, {"title": "Extremely prompt & efficient service", "text": "Date of experience: August 12, 2024", "rating": 5}, {"title": "Excellent service", "text": "Excellent service! Documents received on time!", "rating": 5}, {"title": "Very efficient", "text": "Very efficient, informative and speedy service ", "rating": 5}, {"title": "Excellent service 👍,,,,", "text": "Excellent service 👍,,,,", "rating": 5}, {"title": "Very friendly", "text": "Very friendlyVery fast replies ", "rating": 5}, {"title": "Excellent service", "text": "Everything was quick and clear. Thank you!", "rating": 5}, {"title": "Recommended", "text": "Fast, responsible and reliable. ", "rating": 5}, {"title": "Efficient service", "text": "Speed and cost", "rating": 5}, {"title": "very efficient and good communications.", "text": "Date of experience: July 08, 2024", "rating": 5}, {"title": "Fast and relatively painless.", "text": "Date of experience: June 21, 2024", "rating": 5}, {"title": "Usability", "text": "UsabilityQuicklyClear", "rating": 5}, {"title": "excellent service", "text": "excellent service. fast and professional", "rating": 5}, {"title": "Fast and easy", "text": "Date of experience: July 05, 2024", "rating": 5}, {"title": "Simple and quick", "text": "Date of experience: June 07, 2024", "rating": 5}, {"title": "Great service", "text": "Great service. Recommended!", "rating": 5}, {"title": "quick turn around", "text": "Date of experience: April 16, 2024", "rating": 5}, {"title": "Very prompt", "text": "Date of experience: June 21, 2024", "rating": 5}, {"title": "Absolutely brilliant", "text": "Absolutely brilliant ", "rating": 5}, {"title": "Excellent service", "text": "Excellent service ", "rating": 5}, {"title": "Excellent", "text": "Very simple process and excellent communications at every stage.Thank you", "rating": 5}, {"title": "Effortless service provided a NIE in 4…", "text": "Effortless service provided a NIE in 4 days no issues at all", "rating": 5}, {"title": "Super service ", "text": "Super service ! Cheap and fast and good!", "rating": 5}, {"title": "Quick and easy", "text": "Quick and easy, no effort on our part at all!! ", "rating": 5}, {"title": "Great communication", "text": "Great communication ", "rating": 5}, {"title": "Notarization ", "text": "Very efficient communicationfirst class service", "rating": 5}, {"title": "Super efficient service", "text": "Applying for a new fiscal residence has never been so easy! Thanks for your service!", "rating": 5}, {"title": "Great service", "text": "24/7 response and fast service.", "rating": 5}, {"title": "Excellent service", "text": "Excellent service. Quick and easy. Would highly recommend ", "rating": 5}, {"title": "Very quick and efficient", "text": "Very quick and efficient, definitely above my expectations. But they do all electronically. So be sure that you need a document in electronic form.", "rating": 5}, {"title": "Genuine and responsive.", "text": "Genuine and responsive.I contacted them through their link, followed the online process.  Immediately received contact from them and they responded very quickly everytime I had a question.  Within 72h, have my NIF and on my way to getting a bank account and opening up a business in Portugal...Highly recommend.", "rating": 5}, {"title": "Amazing job", "text": "Amazing job. Thank you, guys!", "rating": 5}, {"title": "E-residence's top-quality service! ", "text": "E-residence helped me get my NIF in 2 days. On the 1st of April I had ordered to receive it ono the 9th of April. On the 3rd of April I received the digital version and already had a NIF. They are definitely the best option to get a NIF quickly for foreigners. Thank you E-residence for your kindness and great skill at keeping me informed throughout the whole process. You are the n.1 online service people should use for a NIF.", "rating": 5}, {"title": "Very efficient and personal service", "text": "Date of experience: March 27, 2024", "rating": 5}, {"title": "People should better know about you. We have learned coincidentally from the real estate agent who learned from some of your customers. ", "text": "I'm satisfied with the services your agency provide. Good introduction and preliminary information. Excellent briefing  and support throughout the process of application. Timely and professional advise. Keeping us updated and providing guidance how-to proceed further if needed. Excellent job. Thank you and regards D. Jelev", "rating": 5}, {"title": "Great job !!! It went beyond my expectations. I really recommend them.", "text": "It was a great experience, they went beyond my expectations fast deliver and very professional. I really recommend them!! Great Job!!!!!Thanks Winston", "rating": 5}, {"title": "NIE application ", "text": "Everything was just perfect, and it took just 20 days ro get my NIE. Can't be more satisfied from this service. Definitely will use again. ", "rating": 5}, {"title": "Thank you for your professionalism!", "text": "Thank you so much, the E-residence team, for the attitude to your work. I recommend you as a team of experienced professionals in the field of solving tasks such as registering a NIF or opening an account in Portugal. I will certainly continue to cooperate with you. Sincerely, with respect. Yauheni.", "rating": 5}, {"title": "Fantastic service", "text": "Fantastic service, quick and easy to use system. They kept me updated every move. 10/10", "rating": 5}, {"title": "Great experience", "text": "Great experience. Easy, hassle-free and quick service. Very happy with the outcome.", "rating": 5}, {"title": "Communication and professionalism are…", "text": "Communication and professionalism are top-notch. Answered my questions right away and processed my paperwork very timely manner. Will continue to use their service. ", "rating": 5}, {"title": "Everything was done very quickly", "text": "Everything was done very quickly, in two weeks I've received my NIE! And the attitude of the stuff was very kind and attentive.Thank you!", "rating": 5}, {"title": "e-residence.com was fast, accurate and easy", "text": "e-residence.com was fast, professional and communicative. When I had questions, I wrote and received speedy and accurate replies. I have already recommended their services to friends. Beware! There are many other options out there that provide the same services for much more money. e-residence will always be my go-to.", "rating": 5}, {"title": "Very good service and very fast", "text": "Very good service and very fast ", "rating": 5}, {"title": "Very efficient", "text": "Very efficient. My NIE was done really fast and they always reply WhatsApp to let us know the status. ", "rating": 5}, {"title": "The service was fast ", "text": "The service was fast , simple and easy to communicate. Response to questions were prompt. Prices were very competitive!", "rating": 5}, {"title": "Verry fast and helping fine whit wats…", "text": "Verry fast and helping fine whit wats app", "rating": 5}, {"title": "Outstanding experience", "text": "I have ordered two NIEs for me and my wife and got them very quickly, Thank you so much!", "rating": 5}, {"title": "Thank you", "text": "I got fast and competent help as I needed and received my NIF really fast. Thanks", "rating": 5}, {"title": "Amazing service", "text": "Amazing service, highly recommended! They have explained everything to me and solve my problems very quickly. Great team.", "rating": 5}, {"title": "super quick (less than a week) and…", "text": "super quick (less than a week) and friendly service with the VIP option for Spanish NIE", "rating": 5}, {"title": "Polite and efficient", "text": "In my interactions with the staffers at E-residence (all of them via email and via WhatsApp texts: I have not met them personally), I found them to be very efficient and polite. The completed the entire administrative task within a few weeks, whereas I had been told to expect that such matters would go on for months.", "rating": 5}, {"title": "Great experience!", "text": "Fast, easy and very effective.", "rating": 5}, {"title": "Perfect experience!", "text": "It was nothing but pleasure to work with them. The entire process took around 2 weeks, and I was informed about all changes throughout the entire period of application. They are extremely professional and caring. Such a level of customer service is rare these days. Thank you for your hard work!", "rating": 5}, {"title": "Fast and Quick", "text": "Fast and Quick. Waiting for my online password details.", "rating": 5}, {"title": "Excellent experience overall", "text": "The process was very professional, fast, and they made every step easy. I received good communication from them and they were very responsive on follow-up questions. I would definitely recommend them!", "rating": 5}, {"title": "Thank you for my NHR", "text": "Thank you with my NHR status support! Everything is so fast and easy with you! Relocation would be a nightmare without  your services. ", "rating": 5}, {"title": "Great job and ultra fast experience", "text": "Great job and ultra fast experience ", "rating": 5}, {"title": "App very easy to use", "text": "App very easy to use. Very quick turnaround. ", "rating": 5}, {"title": "Highly recommend the use of this Company! …", "text": "Highly recommend the use of this company. We used them and received our NIF very quickly, online experience was very easy and support team very responsive on WhatsApp. ", "rating": 5}, {"title": "An clear information", "text": "An clear information, I we made the timetable for the official steps to Spain", "rating": 5}, {"title": "Excellent service keeping me in the…", "text": "Excellent service keeping me in the loop all the time.  The delivery was in 5 days! I couldn't believe it. Thank you! ", "rating": 5}, {"title": "It was fast ", "text": "It was fast. The NIF was ready in about two days.", "rating": 5}, {"title": "Fast", "text": "Fast, efficient service.  Very good communications", "rating": 5}, {"title": "Loads of stuff over a 2-3 year period", "text": "Loads of stuff over a 2-3 year period. normally finding lawyers is difficult e-residency simplify it everything quickly ", "rating": 5}, {"title": "Online experience was super easy", "text": "Online experience was super easy. Support team very responsive on WhatsApp. Highly recommend this team for your tax representation needs.", "rating": 5}, {"title": "Highly Suggested Service for Americans ", "text": "I highly recommend the use of this company for any/all needs requiring bank account or NIF. I used them and received my NIF back the next day!", "rating": 5}, {"title": "Straight forward service + friendly team", "text": "The service was super straight forward and the team was very polite, friendly and helpful if you have any questions or are unsure about anything. All customer service teams should be like these guys! Gave off such. warm, friendly and helpful energy. More people like this please!", "rating": 5}, {"title": "Personal, fast and efficient service.", "text": "I am happy to recommend your services! There is full compliance with commitments and times, there is a response to accompanying service if needed. Immediate availability on WhatsApp. Highly recommended.", "rating": 5}, {"title": "Very good organization ", "text": "Very good experience ", "rating": 5}, {"title": "Good job", "text": "Good job! Thank you very much! ", "rating": 5}, {"title": "I have used e-residence moving to…", "text": "I have used e-residence moving to Portugal and had them fix with my NIF and tax and I have never experienced better service in my life. We had some problem, our own fault, and sent them a message on a Saturday and received an answer and solution same evening and answered a follow up question on Sunday. Super efficient and fast service. I can not recommend them enough", "rating": 5}, {"title": "Very fast", "text": "Very fast! From Sweden and did NIE for Spain. Paid for the Pro-plan, got the NIE in 1-2 week. That is VERY FAST! :)", "rating": 5}, {"title": "Great service", "text": "They were quick and kept me well informed of the process.", "rating": 5}, {"title": "great service fast response ", "text": "I was initially skeptical, but I must admit, I was pleasantly surprised. The service provided was exceptional, with prompt communication and feedback. The requested document was delivered by the advertised time without any hiccups. I highly recommend it.", "rating": 5}, {"title": "Exceptional service.", "text": "Exceptional service. ", "rating": 5}, {"title": "Amazing service", "text": "Amazing service ", "rating": 5}, {"title": "Wonderful service", "text": "Wonderful service, pleasantly surprised", "rating": 5}, {"title": "Perfect and fast.", "text": "I got 2 x NIE numbers, fast and easy. Recommended. 5/5", "rating": 5}, {"title": "Delivers what is promised", "text": "Excellent and much faster service then expected. Open communication over What-App. ", "rating": 5}, {"title": "I am very satisfied with the service", "text": "I am very satisfied with the service, they were very kind and quick! ", "rating": 5}, {"title": "Great customer service,replied…", "text": "Great customer service,replied fast,friendly staff!", "rating": 5}, {"title": "Professional and Super-Fast", "text": "The service for procuring my NIF was impeccable. I screwed up a few things with my documents and was promptly and respectfully guided to get it right. The turnaround once everything was submitted was 24 hours. Outstanding!", "rating": 5}, {"title": "Fast response time", "text": "Fast response time. Quality work. Friendly service. Amazing service - would use again.", "rating": 5}, {"title": "Perfect service", "text": "That’s the third time when I use the service. The E-Residence Team is always great. I highly recommend!", "rating": 5}, {"title": "Great Customer Service", "text": "Great Customer Service ", "rating": 5}, {"title": "Great experience, team of professionals", "text": "Ordered non residential NIF with my wife. E-residence team promptly answered all of my questions regarding obtaining NIF. They also issued NIFs much faster than we have expected. Highly recommended!", "rating": 5}, {"title": "Great service", "text": "Date of experience: February 01, 2024", "rating": 5}, {"title": "GREAT SERVICE", "text": "GREAT SERVICE, THANKS!!Received  my NIE in a few  weeks without  any issues,recommended to anyone  !!!Regards!!", "rating": 5}, {"title": "Was quick and easy", "text": "Was quick and easy. Thanks", "rating": 5}, {"title": "I was very pleased with the service I…", "text": "I was very pleased with the service I got. 10 ⭐️", "rating": 5}, {"title": "NIF in one day", "text": "This was faster than expected. Paid on weekend and got NIF on Monday.", "rating": 5}, {"title": "Easy and quick!", "text": "Easy and quick to get my Portugal NIF", "rating": 5}, {"title": "Excellent service.", "text": "Quick, friendly service! Recommended.", "rating": 5}, {"title": "Fast turn-around!", "text": "Besides the super fast turn-around of 13 days! E-residence demonstrated great communication throughout the process. Thanks and I will definitely refer my other American friends that need NIE’s also!", "rating": 5}, {"title": "Super fast and easy to use", "text": "Super fast and easy to use!  I would highly recommend to others!", "rating": 5}, {"title": "They are dedicated to help you get it sorted", "text": "I needed a NIF. Sent the request. Got some documents wrong. Git help to get the right on whatsapp. The day after, i had my NIF. Amazing!", "rating": 5}, {"title": "Wow! Amazing Service", "text": "Wow! We needed the VIP service for a super fast NIE, and did they deliver!!! It was an estimated 2-3 weeks, but we had ours in hand in 7 days. Amazing.They communicate mostly through WhatsApp - but are highly responsive and fast in resolving issues and ensuring that your initial application goes through.Would highly recommend. You can't do this faster if you  were actually in Spain.", "rating": 5}, {"title": "This was a very easy process", "text": "This was a very easy process. Customer service was excellent. All questions responded to in a reasonable amount of time and very friendly people to communicate with. Very happy with this experience.", "rating": 5}, {"title": "Very quick reliably service.", "text": "Date of experience: January 09, 2024", "rating": 5}, {"title": "All amazing", "text": "All amazing, thanks", "rating": 5}, {"title": "Muitos atenciosos", "text": "Date of experience: January 23, 2024", "rating": 5}, {"title": "Quick and easy", "text": "Date of experience: January 20, 2024", "rating": 5}, {"title": "great service", "text": "great service. quick and very helpful", "rating": 5}, {"title": "Good service and fast.", "text": "Date of experience: January 16, 2024", "rating": 5}, {"title": "The response time when a request is…", "text": "The response time when a request is made is extraordinary.whatsapp turnaround time for reply has been very commendable and staff extremely helpful and courteous . Something which is rare for other companies providing same services . Keep up the good work . Thanks", "rating": 5}, {"title": "Fast,simple.", "text": "Date of experience: January 08, 2024", "rating": 5}, {"title": "Amazing service really efficient and…", "text": "Amazing service really efficient and super quick service.", "rating": 5}, {"title": "Great experience.", "text": "Date of experience: January 05, 2024", "rating": 5}, {"title": "Very quick and easy", "text": "Date of experience: January 04, 2024", "rating": 5}, {"title": "Way more helpful than having to travel…", "text": "Way more helpful than having to travel to my consulate and can’t believe how smooth the process was!", "rating": 5}, {"title": "Faster than expected and very easy", "text": "Faster than expected and very easy. I was pleasantly surprised.", "rating": 5}, {"title": "Fast response", "text": "I needed my NIF really very quick and I got it in 24 hours.", "rating": 5}, {"title": "Your service provides was fast", "text": "Your service provides was fast, easy with no delays. Great!!!", "rating": 5}, {"title": "Great work", "text": "Great work, thank you", "rating": 5}, {"title": "Speed of processing", "text": "they quoted 2-3 weeks, it was all done within 7 days with minimal fuss", "rating": 5}, {"title": "Another service by e-residence.com", "text": "Another service by e-residence.com Muy Bien :)Applied for a friend, and it only took 10 days on the priority package, which was expected to take 4-6 weeks, before she got it.It's a simple process and I would recommend it in it's entirety.", "rating": 5}, {"title": "it was a quick response which i loved…", "text": "it was a quick response which i loved it. they were helpful and fast. thank you", "rating": 5}, {"title": "Great service!", "text": "I was in the midst of filling in my details when I got kicked out of the system. I almost gave up hope and thought I would have to start all over.Luckily the site has a whatsapp extension. I gave the person on the other end some details and I was back in the system within a few minutes.  With the person's link I could pick up where I left off. I received my NIE two weeks later, really fast.", "rating": 5}, {"title": "Applied for NIF essential last December…", "text": "Applied for NIF essential last December 22 and expected it to be completed by January 4. Surprised that it arrived earlier (December 29). Application process was quick, easy, and secure.", "rating": 5}, {"title": "Really good service", "text": "Really good service. It worked very well, super support and great communication. I got the NIF number quicker than expected. Thanks to the e-residence team.", "rating": 5}, {"title": "It was flawless and prompt service", "text": "It was flawless and prompt service! No endless support calls and follow up messages. Very well done!", "rating": 5}, {"title": "Very quick service", "text": "I contacted e-residence on Dec 21 to obtain the NIF number and received it on Dec 29. Taking into account a lot of holidays in that time, i assume that it was very quick with the basic package. Great service!", "rating": 5}, {"title": "Great Service", "text": "I used the standard e-residence service to obtain an NIE for Spain. The NIE was sorted quickly and sent to me by email in under two weeks. I’m very happy with the service I received and would definitely use e-residence again.", "rating": 5}, {"title": "Very fast service indeed", "text": "Very fast service indeed. Can not fault it.", "rating": 5}, {"title": "Super fast", "text": "Super fast! And super great guys!", "rating": 5}, {"title": "Reliable and professional", "text": "Reliable and professional. Good communication via whatsapp. I had my NIE very quickly in a couple of weeks", "rating": 5}, {"title": "Not quite 48 hours but always…", "text": "Not quite 48 hours but always responsive on WhatsApp. Many thanks Chris", "rating": 5}, {"title": "Quick and easy, application done in minutes.", "text": "Fast and time-saving process,it didn't take many minutes to enter all the information and be verified, then the application was in. And it didn't take more than 10 days, then the NIE was in place and the plan for Spain could continue. I recommend everyone to use e-residence.com.I'm a bit nervous about the new application I've helped a friend with, but I expect it will go through in the same professional way.", "rating": 5}, {"title": "Great experience", "text": "I got my docs remotely and right within the terms stated on the site - plan to continue with other services with the guys, way to go!", "rating": 5}, {"title": "I liked that i could pay by crypto and…", "text": "I liked that i could pay by crypto and i received my NIF very fast", "rating": 5}, {"title": "Really quick and easy.", "text": "Date of experience: December 15, 2023", "rating": 5}, {"title": "Wonderful experience", "text": "Wonderful experience, fast delivery. It is actually my second time using e-residence and in both instances I have been truly pleased with their services. Thank you! : )", "rating": 5}, {"title": "NIF Receving", "text": "Professional and very fast", "rating": 5}, {"title": "Very quick and efficient service", "text": "Very quick and efficient service, very easy and simple process to follow.  Cannot fault them", "rating": 5}, {"title": "This is awesome service", "text": "This is awesome service. I got nif on next day I contacted the e-residence company. Guys are professional! Will be use it again! Thank you so much! :)", "rating": 5}, {"title": "good sevice and quick", "text": "fast efficient no hassle", "rating": 5}, {"title": "Despite some challenges with the…", "text": "Despite some challenges with the wonderful administrative tools of Portugal government functions aquiring the NHR was successful.", "rating": 5}, {"title": "Fast and professional", "text": "Date of experience: December 07, 2023", "rating": 5}, {"title": "Excellent and fast service", "text": "Excellent and fast service. They delivered what they promised.", "rating": 5}, {"title": "Fast & Convenient", "text": "Date of experience: December 13, 2023", "rating": 5}, {"title": "Thanks for the great and fast service.", "text": "Date of experience: December 05, 2023", "rating": 5}, {"title": "Quick responses", "text": "Quick responses, NIF done in two days.", "rating": 5}, {"title": "Price/Performans Service", "text": "I was not expecting that much fast service. Smooth and clear! This service has saved my life.Wait for me, Portugal!", "rating": 5}, {"title": "Seamless process.", "text": "Date of experience: November 28, 2023", "rating": 5}, {"title": "Very quick", "text": "Very quick, friendly and helpful", "rating": 5}, {"title": "Great!", "text": "My NIF request was done very fast and also the whatsapp attention was equally fast, surely worth the price of the service.", "rating": 5}, {"title": "The NIF was so fast!", "text": "The NIF was so fast! Awesome! Good revert too by the customer service team. I liked their service. Taking further services from them now and will rate that later.", "rating": 5}, {"title": "My experience is wonderful and I really appreciate your response", "text": "My experience is wonderful and I honestly admire how things went very well and fast.", "rating": 5}, {"title": "Excelent experience", "text": "My experience with e-residence has been excellent. I highly recommend e-residence for the great support they have offered.", "rating": 5}, {"title": "Quick response & fast process", "text": "Date of experience: November 22, 2023", "rating": 5}, {"title": "Really fast and responsive team", "text": "Really fast and responsive team. Helped me get the NIF in Portugal", "rating": 5}, {"title": "Best service provider", "text": "I have acquired the service from e-residency.com, I found them very reliable, fast, and easy to communicate. I recommend the service of e-residency.", "rating": 5}, {"title": "Ordered documents for driver's license…", "text": "Ordered documents for driver's license renewal. Everything is fast, in the chat as necessary also answer.Everything is okay 👌", "rating": 5}, {"title": "Beautiful experience", "text": "Date of experience: November 18, 2023", "rating": 5}, {"title": "We used e-residence to set up NIF…", "text": "We used e-residence to set up NIF accounts in Portugal. The process was easy to follow and execute. The team was responsive when we noticed a discrepancy in our address to get it fixed with the AT office. Would definitely recommend.", "rating": 5}, {"title": "Tax code in 2 days", "text": "I get my tax code for moving to Portugal within 2 days and at cost 3 time less then I was suggested at other firms. It was really comfortable, tech-fast with online signing and the very comfortable follow-up in whatsup. Thank you a lot.", "rating": 5}, {"title": "E-residence.com has a great and easy…", "text": "E-residence.com has a great and easy online platform, and a very supportive, proficient, client centered staff behind it. I'm impressed.", "rating": 5}, {"title": "my nif arrived in just 1 business day", "text": "my nif arrived in just 1 business day, it was very very fast, I realized that if you fill out the form correctly and send it to the company as soon as possible your number will arrive, I liked it, thank you team", "rating": 5}, {"title": "Great experience", "text": "Great experience - easy, quick and reasonably priced!", "rating": 5}, {"title": "I have to give a 5 start rating to this…", "text": "I have to give a 5 start rating to this service, from the first contact they been very responsive on WhatsApp and try their best to clarify any doubt I had before using their services.I've applied for NIF and received in just 48 hours.Nothing else to say than all 5 stars are well deserved!", "rating": 5}, {"title": "It was very good", "text": "Date of experience: November 17, 2023", "rating": 5}, {"title": "real human What's app assistance", "text": "real human What's app assistance, fast and clear instructions. Delivered to my email in 3 days.Good service.", "rating": 5}, {"title": "responsiveness", "text": "responsiveness, speed, precise information💪👍", "rating": 5}, {"title": "Very good experience", "text": "Very good experience to get my NIF (done in 2 days)", "rating": 5}, {"title": "It was great working with this team. I recommend.", "text": "Thanks to the E-residence team for their professionalism and efficiency of work. Thank you for the quick feedback and for the help and correction of actions provided when registering a tax number and opening an account.", "rating": 5}, {"title": "Fast and reliable service.", "text": "Date of experience: November 06, 2023", "rating": 5}, {"title": "Responsive to questions and clear…", "text": "Responsive to questions and clear implementation guides.", "rating": 5}, {"title": "Always easy to work with", "text": "Date of experience: November 07, 2023", "rating": 5}, {"title": "You were super fast with your replies…", "text": "You were super fast with your replies and always pleasant to work with", "rating": 5}, {"title": "Great support & quick success!", "text": "Great WhatsApp supportQuick result (NIF < 3 days)", "rating": 5}, {"title": "Fast service", "text": "Fast service, very responsive customer communications", "rating": 5}, {"title": "NIF in Portugal via e-Residence", "text": "They helped me to get NIF in Portugal.You pay and then they sent you NIF sometime later, no hassle. Good customer support, when I need some extra details (password for Financas) they were able to provide it for me quickly.", "rating": 5}, {"title": "Great", "text": "Great, timely service.", "rating": 5}, {"title": "Really easy to do and good…", "text": "Really easy to do and good communication.", "rating": 5}, {"title": "Quick & concise", "text": "Date of experience: October 26, 2023", "rating": 5}, {"title": "Very nice people and the process is…", "text": "Very nice people and the process is good! Despite I didn’t manage to upload all the docs from the first time the guys helped me to get the nif quicker! Thank you!", "rating": 5}, {"title": "I had great experience", "text": "I had great experience, process was very simple and easy. I much appreciate.", "rating": 5}, {"title": "Very fast and efficient service", "text": "Very fast and efficient service,  not expensive!", "rating": 5}, {"title": "Excellent customer service and timely…", "text": "Excellent customer service and timely service delivery.", "rating": 5}, {"title": "Easy", "text": "Easy, Cheap, got it in few days!!", "rating": 5}, {"title": "Details in depth", "text": "Please assist with steps to know more about NIF login and how NIF can be used", "rating": 5}, {"title": "nice", "text": "It was pretty quick and well-organizzed", "rating": 5}, {"title": "The application process was very easy…", "text": "The application process was very easy to follow.  I had my NIF within 24 hours of submitting my application.  I highly recommend.", "rating": 5}, {"title": "Great customer service", "text": "Super responsive and got the job done, would recommend!", "rating": 5}, {"title": "Great", "text": "Great, prompt, responsive service. Highly recommend", "rating": 5}, {"title": "Super fast and easy to do", "text": "Super fast and easy to do ! I received my NIF in 24 hours. Completely worth it !", "rating": 5}, {"title": "Great follow-up and overall assistance!", "text": "Date of experience: October 19, 2023", "rating": 5}, {"title": "Efficient service", "text": "Great experience", "rating": 5}, {"title": "Very great.", "text": "Very great.. Very happy.. Respect.. Very quick response.. Always presents.. Immidiatly proceed.. Perfect I'm so glad to contact.. Professional services.. Thank you e-résidence that's it.. That's the work..", "rating": 5}, {"title": "Everything was easy and went smoothly", "text": "Everything was easy and went smoothly. They told me I needed to wait 2 weeks to get my NIF and instead, it arrived only a few days after I bought it.", "rating": 5}, {"title": "Quick And easy", "text": "Date of experience: October 24, 2023", "rating": 5}, {"title": "Quick and easy", "text": "Date of experience: October 24, 2023", "rating": 5}, {"title": "Quick and relevant answers via email", "text": "Date of experience: October 19, 2023", "rating": 5}, {"title": "Fast service with high quality and affordable price", "text": "Date of experience: October 19, 2023", "rating": 5}, {"title": "It was real quick", "text": "It was real quick, good online support.  Thanks a lot!", "rating": 5}, {"title": "Excellent service was fast and accurate", "text": "Date of experience: October 18, 2023", "rating": 5}, {"title": "Highly Recommended", "text": "E-Residency is super fast to get NIF number, I look forward to get other services, highly recommended", "rating": 5}, {"title": "Was super easy and quick turn around", "text": "Was super easy and quick turn around.  Got the NIF in a day!", "rating": 5}, {"title": "It was very accessible", "text": "It was very accessible, quick and confident.", "rating": 5}, {"title": "Quick response", "text": "Date of experience: October 10, 2023", "rating": 5}, {"title": "Terrific to deal with", "text": "Terrific to deal with!  Professional, quick, and accurate.  And, if you're like me, and do not do things exactly correct the first time, they guide you through your omissions and errors to expedite the process. Highly recommend them.  In fact, our daughter and son-in-law are planning their move in three years and we have recommended e-residence to them.", "rating": 5}, {"title": "I needed some consultation as a tax…", "text": "I needed some consultation as a tax advisor myself in my own country. Louis has got a vast knowledge of Portuguese and international tax law, and he has a very good understanding of people, which makes it very easy to communicate with him. I had a very good experience, and if I ever have any question related to Portuguese or international tax law, I'll surely contact him.", "rating": 5}, {"title": "Very fast service", "text": "Date of experience: October 13, 2023", "rating": 5}, {"title": "Fast NIF service", "text": "I ordered a NIF service. Received it the next day, really helped me a lot.", "rating": 5}, {"title": "It was very fast and easy.", "text": "Date of experience: October 04, 2023", "rating": 5}, {"title": "So fast and reliable", "text": "Date of experience: October 11, 2023", "rating": 5}, {"title": "Quicker than expected", "text": "It only took two working days to get my Portuguese NIF number. Impressive!", "rating": 5}, {"title": "Fast service", "text": "Fast service, good communication.", "rating": 5}, {"title": "Portuguese nif with foreign address", "text": "The experience was great. I have paid a premium price and got the nif in less than 24 hours which is 1/3 of the promised time.Furthermore, I was chatting most day with them on whatsup. Was getting updates every hour by the hour.If I would provide one improvement. Provide more services. Bunch of Portuguese services are missing and it would be nice to have an a-z full stop shop.", "rating": 5}, {"title": "The service was really fast and easy", "text": "The service was really fast and easy. I got my NIF in 1 day.", "rating": 5}, {"title": "Couldn’t recommend this site enough", "text": "Couldn’t recommend this site enough, they go above and beyond to help and assist with everything they can. I had left it way too late to organize my own NIE and at a last minute hope went for the most urgent option on the site I had it the same day the following week and am so thankful to all of the staff, this obviously can’t be the case for everyone so definitely give yourself more time than I did but great service and very very reliable Thank you!", "rating": 5}, {"title": "Amazing", "text": "Amazing! Got the NIF in 3 days, and their support answered all my questions.Highly recommend.", "rating": 5}, {"title": "Very prompt and responsive", "text": "Very prompt and responsive. Made the process easy", "rating": 5}, {"title": "Easy and straightforward process of…", "text": "Easy and straightforward process of applying for and obtaining Portugal NIF online.", "rating": 5}, {"title": "I have got my NIF in record time!", "text": "I have got my NIF in record time (half the average for my payment level). Even though a minor discrepancy on the identification format was identified, it was solved in just 24 hours!", "rating": 5}, {"title": "Professional and fast", "text": "Date of experience: September 29, 2023", "rating": 5}, {"title": "Great service", "text": "Great service, all online. Received my Spanish NIE within one week!", "rating": 5}, {"title": "Very good support", "text": "Very good support, you found resolutions for some issues.  Lovely staff people", "rating": 5}, {"title": "Very prompt", "text": "Very prompt, efficient and expedient service. Highly recommend!", "rating": 5}, {"title": "Great service", "text": "Great service, so fast!", "rating": 5}, {"title": "Extremely fast and great service", "text": "Extremely fast and great service. Worth the price.", "rating": 5}, {"title": "Very helpful team", "text": "Very helpful team. They even contacted me to let me know the eform hadn’t transmitted properly.", "rating": 5}, {"title": "Very impressive and efficient service", "text": "Very impressive and efficient service. Well done", "rating": 5}, {"title": "Excellent service, Highly Recommended", "text": "I ordered NIF for my family of 4, got it in 3 days. Excellent service.", "rating": 5}, {"title": "Thank you", "text": "All the process was clear", "rating": 5}, {"title": "Excellent service", "text": "E-residence team did an amazing job getting my certificate of criminal record with Apostille. The team was professional, efficient, and exceeded my expectations. I highly recommend them!” Thank you E-residence!", "rating": 5}, {"title": "Top service", "text": "Date of experience: September 19, 2023", "rating": 5}, {"title": "Smooth and easy process", "text": "Informative website, easy application, smooth and quick process, polite and helpful communication", "rating": 5}, {"title": "very fast service", "text": "Very fast service, and quick return .Helpful informations can be found everywhere", "rating": 5}, {"title": "Quick and easy to follow instructions", "text": "Quick and easy to follow instructions. And excellent customer service.", "rating": 5}, {"title": "Thank you for your speed", "text": "Thank you for your speed! The cooperation was polite and the service was lightning fast!", "rating": 5}, {"title": "Very good customer support.", "text": "Very good customer support.Quick and easy. Worth it.", "rating": 5}, {"title": "Ease of the entire process", "text": "How easy the process to obtain a NIF was to complete. It only took a couple days. Best bang for your buck hands down.", "rating": 5}, {"title": "Was fast and easy", "text": "Date of experience: September 21, 2023", "rating": 5}, {"title": "Very easy and legit.", "text": "Date of experience: September 20, 2023", "rating": 5}, {"title": "The confidence E residence provided us", "text": "The confidence E residence provided us. Also the explanations by chat.", "rating": 5}, {"title": "Well done.", "text": "Fast. Comvenient. Reliable.", "rating": 5}, {"title": "Recommended 100%", "text": "Super quick. Uncomplicated process. Very attentive. 1000% recommend.", "rating": 5}, {"title": "Gentle guides through a thorny process of remote bank account opening", "text": "Although it took quite a time and tones of iterations we managed to open a bank account together with e-residence team! Thank you very much for that! E-residence assoicates have always been responsive, eager to help and to find a solution to come to the desired result without wasting time and energy for finding explanations of why things go wrong or take long(er) time. So the team is very customer and result oriented! I do appreciate your attitude and support through the process of bank account opening, thank you!", "rating": 5}, {"title": "We apply online and they deliver it on my doorstep..thankyou", "text": "Online application is better and they deliver it on my adress..thankyou", "rating": 5}, {"title": "Good service", "text": "Really good. Only thing, when something goes wrong, they should be more specific about what the problem was. Otherwise, we enter into an infinite loop of emails…", "rating": 5}, {"title": "very friendly website and helpful…", "text": "very friendly website and helpful customer service❤️", "rating": 5}, {"title": "Very fast service", "text": "Very fast service. Highly recommend", "rating": 5}, {"title": "Communication was on point", "text": "Communication was on point , stress free service.", "rating": 5}, {"title": "Excellent service and they response…", "text": "Excellent service and they response very fast.", "rating": 5}, {"title": "Easy and professional", "text": "Date of experience: September 05, 2023", "rating": 5}, {"title": "Great customer service with good communication…", "text": "Great customer service with continued communication through the process, with regular emails and a WhatsApp number for questions. Service is efficient. Would highly recommended. Would use them again for future services.", "rating": 5}, {"title": "Great service", "text": "Great service! Fast and perfect! We ordered nif numbers and got it in 2 days.", "rating": 5}, {"title": "They were able to receive and send me…", "text": "They were able to receive and send me my apostille criminal record check while I was abroad just as advertised. What more could I ask for! I would recommend! Thank you!!", "rating": 5}, {"title": "Quick processing of NIF", "text": "Date of experience: September 06, 2023", "rating": 5}, {"title": "Good service", "text": "Good service. Everything was fast. I'm satisfied", "rating": 5}, {"title": "Great experience with e-residence", "text": "The process to get a NIF was quick and painless and e-residence support on Whatsapp was very helpful.", "rating": 5}, {"title": "Absolute satisfied.", "text": "Absolute satisfied.Easy communication through WhatsApp,they Guide you simple through the processes.  And I got my niff in no time.Pleasant experience,5 stars from me!", "rating": 5}, {"title": "Outstanding service", "text": "Outstanding service on whatsApp. I got my NIF in less than two business days after having chosen the super urgent option.", "rating": 5}, {"title": "Amazingly fast", "text": "Amazingly fast. Very happy !", "rating": 5}, {"title": "Positive experience", "text": "Date of experience: August 28, 2023", "rating": 5}, {"title": "Extremely professional and fast", "text": "I never believed in completing important documents on line. First of all I have to thank Portugalist for introducing me to e- residence as my experience has changed my outlook completely. Forth and foremost the politeness and patience of the service agent(s) understanding the anxiety and worry of applicants and managing it perfectly. Secondly, the o time response even to the silliest question sometimes and their dedication to make sure that we are on track together to achieve our task.  Last but not least, the speed of execution the definitely best my expectations. HIGHLY RECOMMENDED!", "rating": 5}, {"title": "Easy application process", "text": "Easy application process, good communication.", "rating": 5}, {"title": "Excellent service no hassle", "text": "Very good service no tension all process digital. I got my NIF very comfortably", "rating": 5}, {"title": "Got my fiscal number within a day", "text": "Got my fiscal number within a day. Great service", "rating": 5}, {"title": "We received nif ever earlier then was…", "text": "We received nif ever earlier then was expected. Exceptional user experience, the best customer care❤️", "rating": 5}, {"title": "Amazing service thank you", "text": "Amazing service thank youReceived my NIF in 24hours! Followed by original in the post 1 week later! Highly recommend", "rating": 5}, {"title": "Good , fast , professional service", "text": "Thank you to the Team of e residence , I received, good , fast and professional service😊😊", "rating": 5}, {"title": "The response was fast", "text": "The response was faster than anticipated. I had a few question before I attempt to apply for the NIF. They responded relatively quickly despite my forgetting the time zone difference. I am very pleased.", "rating": 5}, {"title": "Excellent and simple process", "text": "It was a very simple process and user friendly. I got my NIF the next day after I paid and filled the form, excellent service.", "rating": 5}, {"title": "that you can do it online", "text": "how easy it is", "rating": 5}, {"title": "Quick and easy service", "text": "Date of experience: August 29, 2023", "rating": 5}, {"title": "Excellent", "text": "Is very fast for service", "rating": 5}, {"title": "Excellent", "text": "Excellent! Everything was fast and with a lot of support", "rating": 5}, {"title": "fast and simple", "text": "Date of experience: August 27, 2023", "rating": 5}, {"title": "Great work..", "text": "Great work... understand better and no language problem", "rating": 5}, {"title": "This company doing well very friendly", "text": "Date of experience: August 27, 2023", "rating": 5}, {"title": "Swift service and helpful staff.", "text": "Date of experience: August 23, 2023", "rating": 5}, {"title": "Easy effektive service 👍", "text": "Date of experience: August 24, 2023", "rating": 5}, {"title": "Quick and easy process.", "text": "Date of experience: August 24, 2023", "rating": 5}, {"title": "It was good experience and highly…", "text": "It was good experience and highly recommend the services", "rating": 5}, {"title": "Super !!", "text": "Super !!! !!!", "rating": 5}, {"title": "Easy and straight forward process.", "text": "Easy and straight forward process. Would recommend.", "rating": 5}, {"title": "Good Service", "text": "Good Service.  Fast and Professional.Paid for the 5 day urgent NIF # but got it in 2.quickly answered my follow up question.", "rating": 5}, {"title": "Great experience", "text": "Great experience. Got my NIF fast without any problems.", "rating": 5}, {"title": "Quick service", "text": "Quick service, wonderful communication, thank you so much~!", "rating": 5}, {"title": "Easy process and quick turnaround time.", "text": "Date of experience: August 13, 2023", "rating": 5}, {"title": "Easy to use", "text": "Easy to use, easy to understand snd quick.", "rating": 5}, {"title": "Good", "text": "Choosing this plate form was a good experience", "rating": 5}, {"title": "It was a good experience and the staff…", "text": "It was a good experience and the staff l dealt with them were very professional.", "rating": 5}, {"title": "Flawless, fast, fantastic!", "text": "Flawless, quick, and communicative! Got mine within just a few days. I absolutely recommend!", "rating": 5}, {"title": "Communication was excellent", "text": "Communication was excellent! And, I received my NIF faster than I expected.Thank you.", "rating": 5}, {"title": "Everything was ok", "text": "Everything was ok. I’m very happy that company help me and explain everything. Thank you", "rating": 5}, {"title": "Fast and safe", "text": "All was done fast and without problems.", "rating": 5}, {"title": "Efficiency", "text": "Fast, efficient and professional", "rating": 5}, {"title": "Great!", "text": "Fast answers! Really friendly! And very professional!", "rating": 5}, {"title": "Great service!", "text": "Quick, efficient and great communication!", "rating": 5}, {"title": "Efficient and a sleek service", "text": "Date of experience: August 02, 2023", "rating": 5}, {"title": "Got my results in 3 days", "text": "Got my results in 3 days , Soo fast", "rating": 5}, {"title": "Reliable Services", "text": "Excellent service provider. They do everything on time and keep constant contact. I recommend", "rating": 5}, {"title": "Everything was extremely easy and…", "text": "Everything was extremely easy and fast…💯..thank you", "rating": 5}, {"title": "Timely communication", "text": "Timely communication, delivered the information on the date predicting.", "rating": 5}, {"title": "Everything went well", "text": "Everything went well, quickly answered all questions!", "rating": 5}, {"title": "No NIF! Money back!", "text": "We started process of getting NIF for our son who’s not 18 yet. Not knowing that in this case we should apply and get NIF first we made a payment for the most basic package and waited. Few days later we’ve got contacted by rep. and asked few questions that brought us to conclusions that service for our son should be cancelled. They did cancel and within few days we got refund. Very trustworthy organization and well organized processes! 👍", "rating": 5}, {"title": "super quick and very responsive", "text": "super quick and very responsive. was ver surprised.", "rating": 5}, {"title": "Easy to use and very helpful", "text": "Date of experience: July 31, 2023", "rating": 5}, {"title": "Easy tax registration", "text": "It was very quick and easy to register for this online and it got handled faster than they said it would be. Can recomend this very much", "rating": 5}, {"title": "Fast and efficient highly recommend if…", "text": "Fast and efficient highly recommend if needed", "rating": 5}, {"title": "Easy process", "text": "Easy process, clear communications and directions!", "rating": 5}, {"title": "Fast working and patient", "text": "Fast working company with a lot of patience. Thanks for helping me get my NIF.", "rating": 5}, {"title": "Clear website and instructions and fast…", "text": "Clear website and instructions and fast reply to inquiries.", "rating": 5}, {"title": "NIF success", "text": "Great company. Very reliable and informative. The communication through WhatsApp which is already a great service instead of emails and phonecalls, was super quick. They answer all my questions and I had my NIF done sooner than the deadline.", "rating": 5}, {"title": "very quick service and accurate", "text": "very quick service and accurate. i got my NIF in 24 hours", "rating": 5}, {"title": "We received our NIFs sooner than…", "text": "We received our NIFs sooner than expected. I had a question about the password and my question was answered right away with a  What’s App message. I appreciate the good communication.", "rating": 5}, {"title": "Very professional and quick to reply", "text": "Very professional and quick to reply. I got my NIF within a week.", "rating": 5}, {"title": "Very fast service!", "text": "Got my NIF in only 2 days!!!! Insane service, thank you! <3", "rating": 5}, {"title": "RELIABLE! TRUE TO PROMISE", "text": "Got our NIF and NISS from them. and got them on time!! No hassle! Completely online. They also come true with their NIF guarantee. Got 1 day late from the option we paid and they partially refunded our account. They set expectations in our NISS clearly. and are very responsive whenever you reach out on the status of your application. Thank you! its a bliss dealing with your company.", "rating": 5}, {"title": "Very Straightforward  and easy process and…", "text": "Very Straightforward and easy process and completed the work on time, Thanks for helping to get my NIF", "rating": 5}, {"title": "Perfect support and I would recommend to anyone", "text": "I tried requesting a NISS at the Seguraça Social for over 3 times and failed to get an adequate response. E-residence helped me by sending a lawyer to them in order to fix it in person for me. The response time on WhatsApp was perfect and the support team behind the service was friendly. I wouldn't be able to get the NISS without them!", "rating": 5}, {"title": "Thank you for the quick and easy…", "text": "Thank you for the quick and easy procedure to apply and receive my NIF within days.", "rating": 5}, {"title": "Swift and professional service", "text": "E-residence.com helped me save time and attended to my request in a swift and professional manner. I would definitely recommend this service to anyone.", "rating": 5}, {"title": "Amazing service.", "text": "Amazing service.If any one select e-residence.com, simply you can say \"Think Done\"", "rating": 5}, {"title": "absolute perfection", "text": "absolute perfection. It was a pleasent experience and very simple.", "rating": 5}, {"title": "Speed of response", "text": "Speed of response, value for money and at the end of txt/WhatsApp for any questions. An extremely positive experience.", "rating": 5}]