[{"title": "The team at Clever was amazing!!", "text": "The team at Clever was amazing!!!  A quick process to request support and the very next day, my account representative connected me with 3 local realtors able to help me list and sell my home.  Lindsay, at Clever, was always a text away, and super helpful throughout the process.  Clever will be my go to resource for connecting with agents, and my top recommendation to friends!!", "rating": 5}, {"title": "The best title company to choose", "text": "The people and the portal made process easier and less stressful.  If you are looking for a title company, choose Clever", "rating": 5}, {"title": "Adam is an wonderful at he job", "text": "Adam is an wonderful at he job. Very informative and honest. We felt extremely comfortable working with him. We would recommend him to everyone. ", "rating": 5}, {"title": "Satisfied Customer ", "text": "Satisfied Customer Clever introduced us to a bunch of different real estate agencies and direct buyers, which let us figure out who we wanted to work with. The realtors we ended up choosing were amazing. I would use them and Clever again. ", "rating": 5}, {"title": "Great Communication and Seamless Process", "text": "Clever made our home selling and buying process seamless! Initially, we were looking at houses in multiple states, and Clever simplified the experience by connecting us with a realtor in each area we were interested in. Throughout the process, they checked in regularly to ensure everything was going smoothly and that we didn’t encounter any issues. I highly recommend Clever to anyone looking to buy or sell a home – they truly make the process stress-free and straightforward.", "rating": 5}, {"title": "Loved the savings!", "text": "We loved the savings as it helped pay for the Interstate movers!  Just limited contact from clever which I appreciated during this busy time. Joe with Century 21 did a great job selling our home quickly due to medical issues. ", "rating": 5}, {"title": "Realtor Stephen Krieder was attentive", "text": "Realtor Stephen Krieder was attentive, easy to get along with and knowledgeable. Very professional and timely experience.  ", "rating": 5}, {"title": "Greg was responsive to all our…", "text": "Greg was responsive to all our questions regarding n a very timely manner. His predictions of the process were spot on. His knowledge and diplomacy were exceptional. ", "rating": 5}, {"title": "Chris Doss was amazing", "text": "Chris Doss was amazing.  He is so knowledgeable about the market and had great ideas to drive more traffic.  He was with me every step of the way and always very, very responsive (also available any time and any day).  Highly recommend you reach out to him if you're looking to buy or sell in the area.  He is with Dwelli brokerage.", "rating": 5}, {"title": "The Clever Way is the Best Way", "text": "Clever not only gave me three great realtor options, but the first realtor that contacted me was absolutely amazing. I feel so fortunate to have met her and would use her again. Additionally, the savings on the sale were incredible. Clever is a fantastic app and is the way everyone should go about selling a home!", "rating": 5}, {"title": "Just as they advertise", "text": "Just as they advertise, they put you in touch with a list of realtors, you interview them, and choose one and save when the home sells. Really easy along with contact from clever throughout. Praise God our home sold in a few days with a realtor given to us through clever. I would use and recommend them again. Thank you", "rating": 5}, {"title": "Clever Real Estate recommended a…", "text": "Clever Real Estate recommended a fantastic agent and we saved money. ", "rating": 5}, {"title": "There are hundreds of realtors out…", "text": "There are hundreds of realtors out there. We were looking for an agent that worked on a reduced or flat fee. Clever sent us three very capable agents to interview. It was difficult to choose, but we picked one that seemed most competent and had great reviews. We were not disappointed. And saved thousands of dollars.", "rating": 5}, {"title": "Great agent, great experience", "text": "Tiffany went above and beyond to help us sell our house. She is an excellent agent with great attention to detail and she gave us a sense of genuinely caring about our needs and our overall experience. Saving the high commission fees meant a lot as we enter into retirement.", "rating": 5}, {"title": "We loved using Clever..", "text": "We loved using Clever! They gave us 3 agents in the location we needed to move. And we chose the best agent! Our new agent is reliable, trustworthy, very competent and with 20+ years experience. She has become a friend now with so much knowledge to share about our new city. Thanks Clever for leading us to a tremendous agent & being so blessed! Blessings to you all! Peter & Sherry", "rating": 5}, {"title": "Highly recommended, one of the best agencies to find a competent and dedicated, full service real estate agent  ", "text": "I am not sure how I found Clever, but I was really impressed by the savings I made, a full 1% (at least) over the current, ongoing commission rate, with a full service real estate agent. With full service, I mean advertising, arranging for open houses, sign boards, professional pictures all at agent's expense etc., I was able to choose from several agents where I was given a chance to interview, personally talk to them and then make the selection. Clever sent me weekly messages, asking for any additional support, feedback and encouragement in the times for waiting. I firmly believe selling a property is much harder than buying as it entails lots of effort and dedication from the agent. I am very pleased with Clever and would highly recommend them over the known agents who take advantage and do not actively involve in making sales. ", "rating": 5}, {"title": "Great process!", "text": "Everything was wonderful! We interviewed many realtors and clever gave us the perfect one! Luvi was wonderful!", "rating": 5}, {"title": "The entire team was amazing", "text": "The entire team was amazing, on point, knowledgeable, and accommodating.  A special shout-out to team Chubb Dave, Dave was fantastic, outstanding service, his staff was attentive and helpful, making our experience exceptional. 100% recommended.", "rating": 5}, {"title": "Great experience! Great savings!!", "text": "Great interaction and follow-up. Their help in providing local realtors for us to review and contract with was very helpful. Best thing was the savings we enjoyed with the reduced commission percentage we received through Clever. ", "rating": 5}, {"title": "Easy Signup and Great Realtor for Less Money", "text": "The process of signing up with Clever was simple.  Identifying prospective realtors was also a breeze. The number of quality realtors in our area was very good. ", "rating": 5}, {"title": "The realtor took great pictures and got…", "text": "The realtor took great pictures and got home sold. The paper work was a little off with the numbers at the closing.", "rating": 5}, {"title": "Very informative and on point when…", "text": "Very informative and on point when documents were needed. Very friendly staff. Great communication, I would definitely recommend Clever Title to my friend and family!!!!", "rating": 5}, {"title": "My realtor Erick Dunn was fantastic", "text": "My realtor Erick Dunn was fantastic. I have referred him to neighbors that are considering listing there homes in the near future.  Mr. Dunn of NorthGroup kept us updated at all times of showings and was also to bring qualified buyers.  I feel our house sold very quickly.  Erick Dunn was very professional.  Thank you to NorthGroup for all your  follow ups during this process.  It was truly a great experience. ", "rating": 5}, {"title": "Brianna was a phenomenal realtor", "text": "Brianna was a phenomenal realtor! For over a year she helped me look at homes and was incredible on helping me purchase what is my dream home. I could not be more grateful!", "rating": 5}, {"title": " I listed my home with Clever", "text": "I’m very happy I listed my home with Clever Real Estate. The agent Clever referred to me is Carlos Rivero from Remax. Carlos is very professional and knowledgeable. My home was listed on a Thursday evening, Sunday we had 6 offers. My home was sold in less than a week.I give Clever Real Estate and Carlos Rivero 5 Stars. Thank You Clever. Will definitely recommend Clever to friends and family. Thank You.", "rating": 5}, {"title": " Great Service", "text": "The realtor you suggested Lori Rutherford was the best realtor we have ever had and we’ve had quite a few. She was professional, respectful, courteous and did everything in her power to accommodate us and found us a buyer through a lot of hard work. ", "rating": 5}, {"title": "It was a pleasure working with Clever…", "text": "It was a pleasure working with Clever and the agent Daniel Rochon. He really helped me through the home selling process. Thank you both for the help!", "rating": 5}, {"title": "Kristen Childers is an excellent real…", "text": "Kristen Childers is an excellent real estate agent and a pleasure to work with. She is professional and will actually offer a helpful opinion. She has our full trust. ", "rating": 5}, {"title": "Oscar's Rental", "text": "John was responsive to the few issues that came up during the sale of my property.  John kept me informed and demonstrated his ability to successfully negotiate on my behalf and provide options to me and keep the sale going forward.  John is very knowledgeable and experienced Realtor I would defiantly use again and recommend to others. It was a pleasure working with John", "rating": 5}, {"title": "Easy, convenient, and use Clever again", "text": "Clever made it very easy to review agents willing to take a lesser commission for selling our house. We knew the location was going to make it a desirable property and we were willing to do most of the work needed so this is why we chose this option. Very very happy with the agent we worked with, Jennifer Johnston. Highly recommend her. ", "rating": 5}, {"title": "Savings on closing cost & Execellent Realtor Referral", "text": "Savings on closing costsExcellent Realtor referredCorrespondence with me through the process & very helpfulI have already recommended your service to my step daughter, who has set an appointment with the same realtor I had.I will use Clever again when I am ready to buy in the near future.", "rating": 5}, {"title": "Eli and Jack Strickland were awesome!!!!!!", "text": "We had a great experience with Eli and Jack Strickland in San Dimas. They were instrumental in getting our home sold in the shortest time and for a price that was higher than asking. Eli is a great negotiator with lots of experience and knowledge of the real estate markets.", "rating": 5}, {"title": "Very happy outcome!!", "text": "I was sent 3 agents to pick from, all seemed very good but felt a connection with the one I chose. My agent did a wonderful job, especially since there were some challenges to overcome but in the end my house ended up with the perfect buyers and my agent stayed on top of everything all along the way! I’m most pleased with the outcome and would highly recommend. ", "rating": 5}, {"title": "The agent they recommended", "text": "The agent they recommended, Kristin Childers, is top notch. Thanks, Clever, for sending her our way. We highly recommend Kristen to anyone out there in the Central Texas area. If not in the Texas area, Clever is the way to go to find your local agent.", "rating": 5}, {"title": "Efficient, cost-saving professionals", "text": "My first experience with a Clever realtor was with the sale of our home in 2022.  The agent arrived the day after contacting the company, saved us a lot of money on commission fees, and sold our house in ONE DAY!  She was amazing, and made it all so easy for us!My last house sale transaction closed only days ago.  I had another great realtor to work with who not only saved me lots of money on the commissions, but really went the extra mile to make a difficult sale a success!  I will always seek out a Clever realtor whether buying or selling a home.", "rating": 5}, {"title": "Above Expectations", "text": "My experience with Clever Real Estate was excellent! My house went under contract for asking price after 3 days! Other houses that went on the market at the same time mine did are still on the market with decreased prices. Vikki Stickleman from Luma Realty provided excellent service! She gave me great tips and always answered my questions quickly. I am very happy with my experience - it was above my expectations!", "rating": 5}, {"title": "Loved the ease and non-pressure of this…", "text": "Loved the ease and non-pressure of this entire experience. Clever helped us with names of 3 agents whom we spoke with before making a selection. Our selected agent was awesome, gave us great advice on pricing in our market and we felt confident in her expertise and experience in our area. ", "rating": 5}, {"title": "The Tennant Group (A+)", "text": "I worked with Tom Tennant this summer 2024 to sell our home, and we couldn't have been more pleased! We received multiple offers the first few days the house went on the market, thanks in large part to Tom's incredible work. Tom brought in a fabulous photographer to showcase our home online, which brought in serious buyers.  Their marketing team is top notch and can't be beat! Although we received multiple offers, we ended up working with nervous first time buyers. Tom was wonderful in keeping the transaction moving along and getting to closing in a timely manner. He was always available to answer our questions. He was so responsive and a kind person. We had a great experience.", "rating": 5}, {"title": "I recently had the pleasure of working…", "text": "I recently had the pleasure of working with Kenny Monceaux, and I cannot recommend them highly enough! From our first meeting, it was clear that he genuinely cared about helping me find the perfect home.Kenny Monceaux took the time to understand my needs and preferences, providing valuable insights throughout the entire process. Their expertise in the local market was evident, and he guided me with patience and professionalism.Communication was excellent; I always felt informed and supported. Kenny Monceaux was quick to respond to my questions and provided thoughtful advice whenever I needed it.Thanks to his dedication, I found a wonderful home that exceeded my expectations. If you’re looking for a reliable and knowledgeable realtor, look no further than Kenny Monceaux!", "rating": 5}, {"title": "New home", "text": "Clever recommended a great realtor who listened to my needs and was able to find me a great home. Everyone on the team was easy to work with and professional asked for feedback along the way. This was a seamless process.", "rating": 5}, {"title": "My experience selling my condo", "text": "I live in Florida and was selling a condo in NJ....I never met Matthew Tully who was my realtor....he was wonderful....always available by text or phone and he recommended a handyman as well as a law firm...and we sold the condo within a week, for $10,000 more than we were asking!", "rating": 5}, {"title": "I received 3 separate referrals from…", "text": "I received 3 separate referrals from Clever for a trusted realtor.  I chose Susan Aviles and am extremely happy with her performance.  Very professional but down to earth and was willing to help with all requests.", "rating": 5}, {"title": "Super easy process and no hidden fees.", "text": "Super easy to get started, filled out my info online and within minutes I had local realtors contacting me about our home sale.  After meeting a few realtors we chose who we wanted and the process was simple and quick.  The house was listed within a few days and sold within 2 days of listing.  Tiffany (our realtor) was very professional, responsive and personable.  We saved thousands of dollars in commissions using Clever and would highly recommend it to anyone looking to sell their home.", "rating": 5}, {"title": "Your system WORKS. ", "text": "Things happened really fast for us. Tracy was fantastic, we were very lucky too land her.vary helpful. Informative, pleasant. Extremely happy the way things turned out.Better then expected. ", "rating": 5}, {"title": "I found a great real estate agent…", "text": "I found a great real estate agent through Clever who navigated my transaction smoothly through the process from beginning to end.  What's more, he was terrific to work with, thoughtful, friendly, and professional.  I would highly recommend him. ", "rating": 5}, {"title": "Vicky Beckman did a fantastic job", "text": "Vicky Beckman did a fantastic job. She notified us of activities every step of the way. The house sold quickly. And the reduced agent percentage rate really helped us out financially. I would highly recommend. ", "rating": 5}, {"title": "Sherri Sembly is THE BEST REALTOR EVER", "text": "We are thrilled to recommend Sherri Sembly for her exceptional service in helping us sell our home. From the very first meeting, it was clear that she was not only highly knowledgeable about the local market but also deeply committed to understanding our specific needs and preferences.Sherri was incredibly patient throughout the entire process, taking the time to explain every detail and guide us through all the complexities of home selling. She provided us with insightful advice, ensuring we felt confident in every decision we made. What truly stood out was her professionalism, constant communication, and attention to detail. No question was too small, and she always made us feel like we were a priority.Additionally, Sherri demonstrated outstanding negotiation skills, securing us an excellent deal on the sale of our home. Her expertise, combined with her personal touch, made what could have been a stressful experience feel seamless and enjoyable. She went above and beyond by also recommending an equally fantastic realtor in the state we relocated to. There were so many times she selflessly helped us with issues not directly related to selling our home. She made us feel like true friends she was helping.I cannot recommend Sherri highly enough to anyone looking for a reliable, experienced, and genuinely caring realtor. We are forever grateful for her hard work and dedication in helping us sell our home for asking price, and for doing so with outstanding service and excellence.", "rating": 5}, {"title": "I would do this again", "text": "I was connected to three very impressive agents. After phone or in person interviews I chose one. The professionalism was superior. Overall it was a good experience with a good result.", "rating": 5}, {"title": "Strongly recommend Clever Real Estate Agent, Tiffany", "text": "Tiffany made my sale of property go very smoothly. She went beyond Clever's full service ( with low commission)  when she vacuumed my carpet, and put personal touches to unit. Her husband, Jesse wired my ceiling smoke detectors.", "rating": 5}, {"title": "Clever gave us 3 highly qualified…", "text": "Clever gave us 3 highly qualified realtors to meet and choose from. This gave us a place to start, we don’t live in the area full time. We chose a wonderful realtor who did so much work to get our house ready and sold. We highly recommend Clever Realty. ", "rating": 5}, {"title": "I had contacted Clever for a reduced…", "text": "I had contacted Clever for a reduced sale percentage service. Having chosen a realtor from several they had for me to choose from, I chose Theresa Costa in Colorado Springs as my sellers agent. The property was challenging, an older mobile on land that was a unique property. Threasa was full service, professional pictures, always available, answered texts and calls punctually, kept me on schedule, and resulted in selling the home in under two months from listing to move out. Experience was two thumbs up!", "rating": 5}, {"title": "Sell and Buy w/ Danielle Bradshaw!!!", "text": "Danielle Bradshaw was an amazing agent. Very knowledgeable and well versed with real estate. Hands down best experience. Thank you again. ", "rating": 5}, {"title": "CLEVER is the clever way to do real estateate", "text": "I signed up with Clever, because I was happy to pay 1.5% commission. What made me even happier was that Clever made it easy for me to find a top notch, experienced and caring realtor the very next day.", "rating": 5}, {"title": "My buyer agent worked diligently", "text": "My buyer agent worked diligently, whenever I called her she replied, provided good solutions, she has not delay to work smoothly.  I'll recommend her when it's necessary.", "rating": 5}, {"title": "I was able to have a phone interview…Best Real Estate Agent I've ever had", "text": "I was able to have a phone interview with three agents, and one of them clicked with me immediately.  After I met Jordan McAllister, I realized she was a perfect fit for me and it worked out perfectly.  She was professional, kind, helpful and understanding.  I always felt my wishes were honored and respected and there was always complete clarity.", "rating": 5}, {"title": "So Glad I Took A Chance", "text": "The whole Clever process went amazingly smooth.  Within minutes of registration, I was connected with several agents in my area. I ultimately selected the one I felt most comfortable with. Our agent, John Ehlers with Remax was outstanding.  Super easy to work with and I would highly recommend him in the future. He provided current market analysis and developed a plan for us to maximize our home sale price.  ", "rating": 5}, {"title": "Good experince.", "text": "David Goodman agent exp gave us a great experience he was like a genie there at every command, with help, answers, on the spot when needed. His experience shows, very professional yet kind. Can't thank him enough. More than full service.", "rating": 5}, {"title": "The agents recommended were excellent", "text": "The agents recommended were excellent.  It was a tossup between the two and the one I used did an excellent job getting my codo sold in 2 months.", "rating": 5}, {"title": "Shannon Shaw is an amazing realtor!", "text": "Shannon Shaw is a fabulous realtor! He was a huge help in selling our house; he is extremely pro-active in getting things done and an excellent communicator. He took so much stress off of us during the entire home selling process that it made the whole experience better. We thoroughly enjoyed working with him!!", "rating": 5}, {"title": "Stand out experience ", "text": "The communication from start to finish was outstanding. Our agent, Danielle Dolan, as well as her team and all of the vendors she hired, were all great to work with and provided the best experience we could have hoped for. Clever called and emailed several times through the process to make sure we were getting what we needed and Danielle explained each step of the process and patiently answered all of our questions. We always felt we were getting her full professional attention and care. We would highly recommend Clever and Danielle Dolan to our friends and family for all their real estate needs as well. ", "rating": 5}, {"title": "Great experience ", "text": "Clever saved me money and I worked with a great realtor.", "rating": 5}, {"title": "Clever made the process easy and of…", "text": "Clever made the process easy and of course offers very competitive fees. My agent, David Goodman, was a pleasure to work with. He did a great job of representing my interests. I strongly recommend Clever and David Goodman anyone buying or selling a home.", "rating": 5}, {"title": "Professional and transparent ", "text": "When I first learned of Clever, I was looking to do a cash sale of my house.  However, after meeting with the realtor Clever matched me with, I decided to go to market.The process could not have been more flawless!  From listing to closing, Clever checked in on my progress and they ensured that they were doing everything they could to make sure I achieved success and had a good experience along the way.", "rating": 5}, {"title": "It was great working with your realtor", "text": "There were several interested buyers for this triplex.  The first buyer wanted me to replace the furnaces, water heaters, and electrical panels.  All units were in good working order, but the buyer wanted new stuff.  I was in the hospital going though cancer surgery.  My realtor was very professional dealing with this very demanding buyer.  ", "rating": 5}, {"title": "My agent was knowledgeable and helpful", "text": "My agent was knowledgeable and helpful.  She always kept me in the loop and was there to answer questions.", "rating": 5}, {"title": "Same service, lower cost", "text": "Hiring a  clever agent is EXACTLY the same as a full price agent.  I had every need met, every call answered.Things were done in a timely manner.  Closing was smooth as silk. Doesn't make sense not to use one.", "rating": 5}, {"title": "Ryan is a fantastic agent", "text": "Ryan is a fantastic agent. Answered all of my questions in a timely manner. His years of experience was evident in the guidance and recommendations he provided. The sale of my property was as smooth as can be. I highly recommend him.", "rating": 5}, {"title": "I had a great experience with the realty agent recommended by Clever Real Estate", "text": "I had a great experience with the realty agent and his associates which assisted me with my recent house purchase.  The realty agent and his team that were recommended to me by Clever Real Estate were very knowledgeable and effective.", "rating": 5}, {"title": "Justin Kirkwood and Patty Gracia were a…", "text": "Justin Kirkwood and Patty Gracia were a power house. They sold our house from 2 showings, we had to cancel the open house. We had 2 amazing offers. Signed the offer just a few days later. We are beyond happy. They went above and beyond.  Thank you again for finding them for us and connecting us with them. ", "rating": 5}, {"title": "Great Team of Realtors", "text": "The Realtors were very knowledgeable and delivered as promised. Clever did a great job on hand picking the realtors that were available at all times. ", "rating": 5}, {"title": "Quality experience as a Buyer! ", "text": "I was paired with the perfect agent; they knew what I was looking for; they broke down everything to me to be easily digestible; they had my back on the decisions for offers; and got us to closing on our very 1st home! Would definitely refer them to anyone who’s either looking for a new home or getting their 1st home!", "rating": 5}, {"title": "I’m so glad I went with Clever", "text": "I’m so glad I went with Clever rather than paying a 3% seller’s fee. The agent Clever provided was top notch, and the services received included high-quality photos and videos, open houses, etc. — essentially everything you’d expect from a high-end agent. ", "rating": 5}, {"title": "Great service from our agent Andy Barclay", "text": "Great service from Andy Barclay, the agent referred to us by Clever.com. A pleasant experience overall and a great savings!", "rating": 5}, {"title": "Fantastic ", "text": "We worked with Shawn from Keller Williams. She was fantastic. Clever messages me back quickly and sent me several realtors to consider. I would absolutely choose clever again! Erica ", "rating": 5}, {"title": "Great company and great agents", "text": "When i started the selling and buying process, my lender connected me to Clever They then connected me to their agents Howard and Tony who really did a fantastic job.They handled both the buying and selling of both properties.The agents were so effective from start to finish and we closed both properties on time in less than 30days.Above all clever real estate gave us a cash back which is not something that's common with real state companiesbottom-line,great company, great agentsI would highly recommend it.", "rating": 5}, {"title": "Great Job done by Clever Team", "text": "Clever did a great job for recommending three top quality realtors to us. It enabled us to do thorough research on them and picked one who we thought mostly suited to our needs. The end result was great and the selling price of our house was beyond our expectations. ", "rating": 5}, {"title": "Clever Real Estate gave me a Winning Selling Team!", "text": "Clever Real Estate gave me the opportunity to meet a few different agents to compare their background and skillset.  After interviewing three, I chose a real estate team that I felt would work in my best interest and I was not disappointed.  My team prepared open houses and buyer walk-throughs with enthusiasm and complete know-how for a good presentation.  My house sold within two weeks of listing and I could not be happier!!", "rating": 5}, {"title": "The realtor David Allen is the best in Ohio!!!", "text": "The realtor David Allen made the whole experience better. His professionalism, his knack for the details, persistence and knowledge of the process made the whole thing go a lot smoother. But most importantly he cared about me and my family and for that I’m forever grateful. ", "rating": 5}, {"title": "Josh Barnard and team were excellent", "text": "Josh Barnard and team were excellent! Very knowledgeable, great communication, smooth processes. I was contacted by many realtors throughout my process and I definitely made the right choice with Josh and his team. ", "rating": 5}, {"title": "Great results, Great savings!", "text": "Victor Lee was a great realtor & of course saving money on fees was very important!", "rating": 5}, {"title": "Sarah made it happen!", "text": "Sarah Steelman is what made our experience great! I've worked with quite a few agents in the past and she is definitely top tier! Very knowledgeable, dependable,  thorough,  consistent and professional! ", "rating": 5}, {"title": "Smooth Process - Saved 1.5%", "text": "We were pleasantly surprised to have the process work so smoothly! We chose a wonderful realtor from the three realtors that Clever provided. Bottom line, our home was listed and 30 days later we closed/sold it. It worked the same as other homes we’ve sold, but paid only 1.5% for the listing agent and 3% for buyers agent. Hindsight, we’d probably try to offer 2.5 for buyers agent next time. Our realtor was professional, communicative, and gave us great advice during negotiations to get top dollar for our home. Listing photos were beautiful and included. Absolutely no difference in using a Clever realtor than a regular realtor. We highly recommend using Clever or negotiating the same rate with your favorite local realtor if you are able. Clever does the negotiating work for you but does charge the realtor a ‘finders’ fee.", "rating": 5}, {"title": "Lori was great", "text": "Lori was great.  Was able to work with seller’s agent and lender to help us get to close in less than 30 days.  Amazing experience.", "rating": 5}, {"title": "Clever is the definition of quality", "text": "Clever is the definition of quality service with great savings.  Clever identified an outstanding local Real Estate agent to support the selling of my Mom’s home.  She (Shana) was a true professional who understood the local real estate market and executed a strategy that resulted in a timely sell.  Clever’s business model of having a reduced % on the sell of the home saved me over $5,000.  Working with Clever was definitely the right decision and I could not have been happier.   ", "rating": 5}, {"title": "Very processional.", "text": "Very professional and know the business. ", "rating": 5}, {"title": "Quick", "text": "Quick, responsive and efficient. Clever offered several realtors, we clicked with Edward and he made it happen! Knowledgeable and helpful, Edward always knows someone!!  We closed quickly and without issue. ", "rating": 5}, {"title": "Wonderful", "text": "The realtor recommended by clever was exceptional. He went above and beyond in every way. He made an emotionally hard sale go as smoothly as possible. Thank you!", "rating": 5}, {"title": "Wonderful ", "text": "The realtor recommended by clever was exceptional. He went above and beyond in every way. He made an emotionally hard sale go as smoothly as possible. Thank you! ", "rating": 5}, {"title": "Full Service at a Discount Price", "text": "My agent had many years of experience and he guided me every step of the sale. He communicated with me frequently. I never felt that I was getting \"less than\" service just because I was paying a lower commission.", "rating": 5}, {"title": "Kevin miller did the great work what…", "text": "Kevin miller did the great work what I'm searching h found exactly tat for me. I'm so satisfied with clever real estate.highly recommended.", "rating": 5}, {"title": "EVERYTHING WENT SMOOTHLY AND WE WERE…", "text": "EVERYTHING WENT SMOOTHLY AND WE WERE CONNECTED WITH A GREAT AGENT (RICK DAVES) AND TEAM. WE HGIGHLY RECOMMEND. ", "rating": 5}, {"title": "Lisa was great, very patient ,diligent getting work done on the home repairs ,going though 4 contracts before closing on the 4th . Lisa is a go getter with lot of energy.", "text": "Lisa was great very patient and diligent on getting things done. She definitely had to work for her 1% commission. She deserves 3% .She had to go through 4 contracts before she finally closing on the 4th.  .  ", "rating": 5}, {"title": "The BEST experience", "text": "The BEST experienceIf you are lucky enough to have Jayne as your selling agent thank the heavens.  Professional Knowledgeable Honest  Caring", "rating": 5}, {"title": "Our Agent gave us top line service!", "text": "Our Agent gave us top line service!ALWAYS responded immediately This was a great choice 👍🏻", "rating": 5}, {"title": "Everybody was so nice and experienced…", "text": "Everybody was so nice and experienced my house sold the first day on the market.", "rating": 5}, {"title": "Communication was excellent throughout…", "text": "Communication was excellent throughout the process.  Richard Alpizar with Iron Valley Real Estate Central Florida did an excellent job advising me and representing my property and got it sold in a timely manner.  Couldn't be more pleased as they took the whole process from start to finish.", "rating": 5}, {"title": "Christina Miller was excellent to work…", "text": "Christina Miller was excellent to work with,  we had some ups and downs, due to the buyers but she kepted me informed at all times.", "rating": 5}, {"title": "Great service ", "text": "We were given a very nice selection of agents to choose from . The agent we selected  was very helpful very knowledgeable and did a great job in getting our house sold the very first day.", "rating": 5}, {"title": "The process of choosing the agents…", "text": "The process of choosing the agents provided was easy and stress free. I was able to select the top agent and was very happy with his experience and ease to work with. ", "rating": 5}, {"title": "The Agents from Clever Real Estate was awesome ", "text": "The agent we were refererd to was fantastic  Leshin Realty Group Keller Williams  Partners Service was fantastic Jeff and his team work together  as a well oiled machine. We had great service from beginning to end. The reduced commission  allowed us an opportunity  to get a fast and quick closing  where I feel we where able to pass  on to the buyers  as well and have  a competitive  on the selling price which allowed for a quick and easy selling of the home we where basically  under contract within 24 hours these guys no what they doing  Thank You for putting  together this new way of buying  and selling  which keeps everyone happy", "rating": 5}, {"title": "Area expert", "text": "My agent was an expert in the area of my search. She provided direct insightful details where I was able to use to make the right decision. My offer was accepted quickly and within a day. My loan closed 1 week in advance.", "rating": 5}, {"title": "Great experience, clear and easy!", "text": "We spoke with 2 different agents, chose one to work with us. She answered all questions and did as we asked. Home sold quickly as we wished. Thank you, we would use your service again and will recommend it to others.", "rating": 5}, {"title": "4% Realtor Fee", "text": "The best part of going with clever was giving only 4% realtor  fee VS 6% that was one strong incentive. The realtor I ended up working with was great. I like the fact that I could chose from 3-4 realtors and was not stuck with one. ", "rating": 5}, {"title": "We had so many problems with our sale", "text": "We had so many problems with our sale.  Our agent kept working until all was finished.  She kept our hopes and dreams alive.", "rating": 5}, {"title": "Got results", "text": "Sold the properties when other realtors failed", "rating": 5}, {"title": "Brent Wilk was amazing.", "text": "Brent Wilk was amazing, and I will definitely recommend him and his agency. He was so very creative in his approach to my unique property. Rather than considering its uniqueness as a challenge, he used it as a marketing positive and it delivered immediate positive results ", "rating": 5}, {"title": "Great services and deal! ", "text": "My agent was great and provided excellent service! ", "rating": 5}, {"title": "The process was very smooth", "text": "The process was very smooth and the realtors available through Clever were very good.  We were very happy with the service.", "rating": 5}, {"title": "Working with Clever was easy", "text": "Working with Clever was easy.  The referred agents were good.  We saved 2-3% on commission, and that’s a lot of money. We received full real estate service.", "rating": 5}, {"title": "The people's choice for a job well done were very professional and…", "text": "The people were very professional and knowledgeable about what the real estate market was doing and how to market our home. I recommend them to everyone it was a great experience. ", "rating": 5}, {"title": "Clever sent 3 agents to us for…", "text": "Clever sent 3 agents to us for interviews and we picked the one that we thought we'd be able to work with the best.  Everything worked out great and we were able to save A LOT in realtor fees.", "rating": 5}, {"title": "The easiest home sale ever", "text": "The easiest home sale ever. I was sent a great agent that really excelled at what he does and made me feel confident that the sale would go well. Overall great experience!", "rating": 5}, {"title": "We were hooked up with an amazing…", "text": "We were hooked up with an amazing realtor. We sold our house quickly and found a new house shortly after and saved a ton of money! I would highly recommend Carissa Sutter as a realtor.", "rating": 5}, {"title": "Clever sent us names of 3 Real Estate…", "text": "Clever sent us names of 3 Real Estate agents.  The one we chose did a great job for us.  Don't believe that a full commission agent would have done any better.", "rating": 5}, {"title": "Great agent", "text": "Great agent. (Patrick Murray) worked with me through the process. And kept me advised about the market and other details. ", "rating": 5}, {"title": "It was easy to do", "text": "It was easy to do. They help you through to process and answer any questions you. A great experience.", "rating": 5}, {"title": "Rachele is the best!", "text": "Rachele is awesome!  I have bought and purchased many homes over the years and I have to say the Rachele is the best agent I have ever worked with.  Thank you!", "rating": 5}, {"title": "Great service for finding quality, respectable real estate agents", "text": "Clever representatives were responsive and communicated next steps of the process. The selection of potential realtors was top-notch. It was also assuring to know these candidates were screened by Clever, ensuring only serious, high-quality agents were offered.", "rating": 5}, {"title": "Referred me to a very professional…", "text": "Referred me to a very professional agent that worked very hard to get our home sold. Fee was reasonable. ", "rating": 5}, {"title": "The real estate agent recommended. Josh Plyler was the best I have worked with. He was top notch, the best!", "text": "The real estate agent recommended, Josh Plyler was the best I have worked with and I have worked with several over the years. Josh Plyler was top notch, best. ", "rating": 5}, {"title": "Simple connecting with realtors I…", "text": "Simple connecting with realtors I didn't need to overpay to help me sell my home.", "rating": 5}, {"title": "The real estate agent Ayesha Foote was…", "text": "The real estate agent Ayesha Foote was excellent to work with. We really enjoyed the experience. She was very professional and knowledgeable.", "rating": 5}, {"title": "Amazing Realtor", "text": "Randy Denlinger was amazing and he was licensed in both states so we only had to have one realtor. ", "rating": 5}, {"title": "Very good service and excellent work", "text": "Very good service and excellent work ", "rating": 5}, {"title": "hooked me up with a great realtor", "text": "hooked me up with a great realtor, a good person, she sold home in 2 weeks  everything was smooth and easyhighly recommend", "rating": 5}, {"title": "Quick closing", "text": "Quick closing and mostly hands off from us as the sellers. Pricing was better than traditional fees. Would use again. ", "rating": 5}, {"title": "Wonderful realtor to work with", "text": "Wonderful realtor to work with. Recommended to all our friends and family. Everything went very smoothly. ", "rating": 5}, {"title": "Everything worked out great because our…", "text": "Everything worked out great because our realtor has thier ducks in a row. Carl was a big help and I would recommend him and the team to my friends.", "rating": 5}, {"title": "Great Customer Service", "text": "Whenever there was a issue to crop up, Charlie  stepped up to resolve it as quickly as possible", "rating": 5}, {"title": "Chris Benson was very professional", "text": "Chris Benson was very professional, highly responsive and friendly.  Discounted rate helped the budget.", "rating": 5}, {"title": "Reshell was awesome", "text": "Reshell was awesome! She was helpful and there for us every step of the way. She got things done when others would drag their feet. She is an asset to your company. ", "rating": 5}, {"title": "Found a really great agent for a lower…", "text": "Found a really great agent for a lower price than the market average ", "rating": 5}, {"title": "Austin was great to work with and on…", "text": "Austin was great to work with and on top of everything! This was our first time selling and he walked us through every step!", "rating": 5}, {"title": "Great quotes and fast service", "text": "Great quotes and fast service. Just a small problem with communication but I think that was a DHI MORTGAGE miscommunication.", "rating": 5}, {"title": "Helpful!", "text": "Helpful, flexible with early morning or after hours phone calls, and accommodating my traveling and out of state situations, providing a mobile notary, etc.", "rating": 5}, {"title": "An excellent source to find qualified real estate agents. Full-service and more reasonable than a 3% typical agent fee. ", "text": "Ease of finding a qualified agent. Full Service at a lower cost.Communication with Clever was excellent.", "rating": 5}, {"title": "This was a fast easy sale", "text": "This was a fast easy sale. I was introduced to three excellent agents and chose one. It was an easy process and a good price. ", "rating": 5}, {"title": "Great experience", "text": "Great experience. We worked with a fantastic Realtor named Adam Arnello. ", "rating": 5}, {"title": "Ron Murray was very familiar with the…", "text": "Ron Murray was very familiar with the house area and very knowledgeable and responsive on the sale process ", "rating": 5}, {"title": "It went smoothly", "text": "It went smoothly. People were polite and professional. ", "rating": 5}, {"title": "Great realtor", "text": "Great realtor! The Clever team was always available and helpful.", "rating": 5}, {"title": "Saved money and they connected me with…", "text": "Saved money and they connected me with great realtors. ", "rating": 5}, {"title": "Vary easy ", "text": "This was a very easy transaction. Why pay more for the same result 🤔 ", "rating": 5}, {"title": "Full service realtor at a discounted rate", "text": "They found a realtor who would work with us at a discounted price and it was great.  ", "rating": 5}, {"title": "Great work I really liked working with…", "text": "Great work I really liked working with you on this transaction ", "rating": 5}, {"title": "Fast and easy", "text": "Clever was quick to recommend 3 potential agents and all were stellar! ", "rating": 5}, {"title": "The company (Clever) was very helpful", "text": "The company (Clever) was very helpful, professional and easy to work with. ", "rating": 5}, {"title": "The Realtor was excellent", "text": "The Realtor was excellent, did a great job.", "rating": 5}, {"title": "Our realtor Stacey Sebastian was…", "text": "Our realtor Stacey Sebastian was fantastic.  Very professional and made the process as easy as possible. ", "rating": 5}, {"title": "Bree our realtor was amazing to work…", "text": "Bree our realtor was amazing to work with!", "rating": 5}, {"title": "Great Program ", "text": "It was super easy to sign up for and they paired me with a great realtor! ", "rating": 5}, {"title": "We loved working with our agent…", "text": "We loved working with our agent recommended through Clever. ", "rating": 5}, {"title": "Good to work with", "text": "Date of experience: November 01, 2024", "rating": 5}, {"title": "Great experience with wonderful agents…", "text": "Great experience with wonderful agents (Charlie & Brian).", "rating": 5}, {"title": "My realtor was excellent", "text": "My realtor was excellent! She is knowledgeable, professional, friendly and very helpful and respectful!", "rating": 5}, {"title": "Their service is free and they saved me…", "text": "Their service is free and they saved me thousands of dollars.  The agent they hooked me up with was great.  What’s not to like?", "rating": 5}, {"title": "Great experience and great rates", "text": "Date of experience: October 01, 2024", "rating": 5}, {"title": "I had a great agent and saved money", "text": "I had a great agent and saved money.  Randy Schulenburg was outstanding.", "rating": 5}, {"title": "The Clever team was great", "text": "The Clever team was great, and kept me abreast of everything I needed to know.  Plus, they saved us some money…it’s in the bank now!  Thanks CRE!", "rating": 5}, {"title": "We had a great salesperson in Lisa…", "text": "We had a great salesperson in Lisa Lacey.", "rating": 5}, {"title": "Easy to use and the agent was fantastic!", "text": "Date of experience: September 13, 2024", "rating": 5}, {"title": "Great people to work with.", "text": "Great agents and good advice on handling the sale of my home.", "rating": 5}, {"title": "Reasonable rates that helped us save", "text": "Date of experience: August 20, 2024", "rating": 5}, {"title": "Clever found a really good Agent who…", "text": "Clever found a really good Agent who helped us to sell our home quickly.", "rating": 5}, {"title": "Stefen Ash was terrific. Easy to talk to, very responsive. I highly recommend him.", "text": "Stefen Ash was terrific ", "rating": 5}, {"title": "Sent recommendations for great agents.", "text": "Sent recommendations for great agents. ", "rating": 5}, {"title": "Easy-to-use app and saved thousands", "text": "Easy-to-use app and saved thousands ", "rating": 5}, {"title": "good to their customers", "text": "Very helpful", "rating": 5}, {"title": "Great Agent Dave Allen", "text": "Great Agent. Very Seamless process. No stress at all.", "rating": 5}, {"title": "Great accommodating people that were…", "text": "Great accommodating people that were really efficient.", "rating": 5}, {"title": "The realtor was great and very helpful", "text": "Date of experience: August 22, 2024", "rating": 5}, {"title": "Great agent", "text": "Great agent, reasonable fees", "rating": 5}, {"title": "Timely and efficient.", "text": "Timely and efficient. ", "rating": 5}, {"title": "Saved me approx $4K", "text": "Date of experience: September 17, 2024", "rating": 5}, {"title": "Great customer service ", "text": "Easy to get really good agents through this service ", "rating": 5}, {"title": "Affordable Price", "text": "Excellent Attitude of realestate broker", "rating": 5}, {"title": "fast response.", "text": "Date of experience: August 04, 2024", "rating": 5}, {"title": "I found a flat in only 3 weeks !!", "text": "I found a flat in only 3 weeks thanks to them ! I recomand !", "rating": 5}, {"title": "Great realtor", "text": "Date of experience: August 05, 2024", "rating": 5}, {"title": "Had a great realtor", "text": "Had a great realtor ", "rating": 5}, {"title": "The agency was professional", "text": "The agency was professional, efficient, and experienced.", "rating": 5}, {"title": "Im happy work with this company!", "text": "Date of experience: August 02, 2024", "rating": 5}, {"title": "Everything went great", "text": "Everything went great ", "rating": 5}, {"title": "The Real Deal", "text": "The service & communication from Clever was outstanding, would recommend to anyone. ", "rating": 5}, {"title": "We were matched up with a great agent!", "text": "We were matched up with a great agent! ", "rating": 5}, {"title": "I did in fact save over 6000 and full service. David Hakimi, the realtor also owns a staging company and provided staging for 1400, regardless of time frame. Very satisfied.", "text": "I did in fact save over 6000 ", "rating": 5}, {"title": "Brianna Bertoli was great!", "text": "Date of experience: July 29, 2024", "rating": 5}, {"title": "Everyone involved is attentive and…", "text": "Everyone involved is attentive and helpful. ", "rating": 5}, {"title": "Helpful ", "text": "Great realtors very professional ", "rating": 5}, {"title": "Great way to save. ", "text": "Great way to save", "rating": 5}, {"title": "Continued support throughout the…", "text": "Continued support throughout the process. ", "rating": 5}, {"title": "QuickFrom listing to closing was 38 days and received over asking price,", "text": "Quick, easy, professional ", "rating": 5}, {"title": "It was so simple!", "text": "Date of experience: September 15, 2024", "rating": 5}, {"title": "Excellent agent", "text": "Excellent agent, Dannel Malloy", "rating": 5}, {"title": "Good communication, great fees", "text": "good communication great fees", "rating": 5}, {"title": "Great pricing and seamless experience", "text": "Great pricing and seamless experience ", "rating": 5}, {"title": "Grateful in Gatlinburg", "text": " In 2 words...Jo Schulteiss !!", "rating": 5}, {"title": "Sachet White She was Great!!!!", "text": "Date of experience: July 16, 2024", "rating": 5}, {"title": "Good very good", "text": "Date of experience: July 14, 2024", "rating": 5}, {"title": "Very professional", "text": "Very professional ", "rating": 5}, {"title": "Brandon our agent did a great job", "text": "Date of experience: July 10, 2024", "rating": 5}, {"title": "Sarah Sibley was kind", "text": "Sarah Sibley was kind, efficient and knowledgeable. She was a good listener and 100% responsive. I would totally feel confident to use Clever again and would recommend Sarah.", "rating": 5}, {"title": "Excellent", "text": "Excellent.  Broker selection options were excellent.  Clever Title Company was excellent and professional. Clever customer service was great.  And we saved over $7000 on sales commission.  Our home sold in just five days.  I will recommend Clever to my family and friends who are selling a home.  ", "rating": 5}, {"title": "Cleaver team are superstarsClever team did great would recommend…", "text": "Clever team did great would recommend them to search out a trustworthy real estate agent ", "rating": 5}, {"title": "Clever is a great", "text": "Clever is a great! They offer great services. Not all the agents they recommend are good, but if the ones they recommend isn't to your liking you can request clever to connect you with others. So in the end, not all agents in clever are good, but the Clever team itself is very accommodating. ", "rating": 5}, {"title": "We got matched with a really good agent!", "text": "We got matched with a really good agent! ", "rating": 5}, {"title": "Agent Options", "text": "I liked that I was given several options of agents with a little blurb about them and their experience. The whole process was made very easy and I saved money which was the goal!", "rating": 5}, {"title": "Outstanding Support", "text": "The outstanding support from Lindsay and the staff at Clever certainly was helpful in dealing with the sale of my home.  They stayed in regular contact to ensure the realtor was doing all that was necessary to ensure the quick sale of my home. ", "rating": 5}, {"title": "Great experience and I would highly…", "text": "Great experience and I would highly recommend using Clever Real Estate.", "rating": 5}, {"title": "We sold our home in NH with clever…", "text": "We sold our home in NH with clever agent, Bobby V. Got a great price all went so smoothly and we saved a ton of $. Will def work with Clever again. ", "rating": 5}, {"title": "Clever put me in touch with great agents!", "text": "Clever put me in touch with several great local agents who were willing to work for a 1.5% commission.  We interviewed two of them and were very happy with Allison who we ended up working with.  Using Clever is really a no-brainer!", "rating": 5}, {"title": "The agent was a gem to work with", "text": "The agent was a gem to work with, all I need to say.", "rating": 5}, {"title": "The whole.ezpeeience has been s…", "text": "The whole.ezpeeience has been s pleasurable money saving easy to work with experience.and recommend give it a try and save some.money", "rating": 5}, {"title": "Good experience and saved money", "text": "The most expensive part of selling a house are the realtor commissions.  I was skeptical about Clever offering a low pre-negotiated commsion for the seller's realtor fee but they stayed true to their policy and didn't charge any more after closing.  The realtor Clever provided me was a seasoned realtor who knew the current tough market (higher interest, limited buyers) and was able to secure a buyer with a contract in 32 days.  He presented my home with detailed descriptions, professional stagging and photographs to set my house apart from the rest of    the 3 competive homes on the market at that time.  I had a smooth and wonderful experience using Clever and will recommend it to anyone looking to save money and not sacrifice on a qualified realtor.", "rating": 5}, {"title": "Great experience finding and ultimately closing the deal.", "text": "Three agents contacted me very promptly, but when I spoke to Jane Cresswell I felt that she was going to be the right person for this transaction. She was very thorough and responsive anytime I had a question. The house sold almost immediately and the whole process was seamless.", "rating": 5}, {"title": "Suanne was a huge help. ", "text": "Suanne was a huge help in helping us to locate, negotiate and purchase an absolutely wonderful condo. She went above and beyond including a FaceTime tour of the condo since we were in Texas at the time. The amount of effort and expertise she put into helping us was exemplary. ", "rating": 5}, {"title": "Felipe was a great agent to work with", "text": "Felipe was a great agent to work with. He took great pictures of our condo and always kept us in the loop on the sales process. We will work with Felipe on our future purchase . ", "rating": 5}, {"title": "Excellent and professional real estate…", "text": "Excellent and professional real estate agent.", "rating": 5}, {"title": "Highly recommend", "text": "Travis our realtor from Brick and Loft did an exceptional job from start to finish.  The savings going through Clever makes it even better! ", "rating": 5}, {"title": "Very efficient real estate agent", "text": "Clever provided three real estate agents that charged a reduced commission. It was a busy time and that was helpful. We chose one, Karyl Allen, and she got to work immediately helping us list and stage the house. It was an overwhelming time and it was great to have her support. She was very responsive to all our texts, emails, and phone calls. In the end we sold the house for well over the asking price, in one day!", "rating": 5}, {"title": "Winston made my experience great", "text": "Winston made my experience great! He went above and beyond to make my life easier. He came and helped me make my yard look better, now what agent does that? When I would have an anxiety attack, he would be right there on the phone making sure I was doing ok. So he’s the 5 star rating! ", "rating": 5}, {"title": "Women with heart", "text": "Very reliable, friendly and no pressure", "rating": 5}, {"title": "Great realtor assign to us.", "text": "Date of experience: July 02, 2024", "rating": 5}, {"title": "We found a GREAT agent through Clever!", "text": "We found a GREAT agent through Clever, and got a $500 bonus as well!!! Very happy to have used this service!!!", "rating": 5}, {"title": "The agent was fantastic", "text": "The agent was fantastic. He was the one that made this a great experience, not particularly Clever the company.", "rating": 5}, {"title": "Dana was an absolute exceptional agent", "text": "Dana was an absolute exceptional agent. She was agreeable and not bossy! She gave great suggestions and advice. She would answer me promptly when I had questions. ", "rating": 5}, {"title": "Great experience", "text": "Great experience with Cleaver. Vicki Loftis did an excellent job selling our home. ", "rating": 5}, {"title": "Deb Forte", "text": "Deb ForteCentury 21 NE - Centurion She was great. Everything you want in an agent. Accepted an offer within the 1st week Townhouse was on the Market. As of date, highest sales price, for any unit in the Townhouse association.", "rating": 5}, {"title": "Desiree was fantastic", "text": "Desiree was fantastic.  She is knowledgeable, easy to work with and quick to respond.", "rating": 5}, {"title": "Professional with results!", "text": "Our Realtor James Chubb was on top of everything throughout the whole process.Very knowledgeable, Professional and Constant updates with explanations of the process leaving us with a calming and stress free experience. Thank you Clever for introducing us to James!", "rating": 5}, {"title": "Great customer service and excellent…", "text": "Great customer service and excellent find on our realtor! Can’t say enough good things and Clever and Attain RE team Bryan Curtis and Mayra were amazing to work with the entire way!", "rating": 5}, {"title": "The lower commission was high priority…", "text": "The lower commission was high priority to me but it didn't compromise on the quality of service I received. I had an excellent realtor. ", "rating": 5}, {"title": "Premium realtor", "text": "Jerrod was very attentive to the condition of the house and keeping everything moving forward. There were several issue to deal with, but it was resolved seamlessly. ", "rating": 5}, {"title": "Very good response and the agent you…", "text": "Very good response and the agent you connected us with was excellent.", "rating": 5}, {"title": "seamless transition.", "text": "Made for a seamless transition.", "rating": 5}, {"title": "Fast ", "text": "We got a great agent Nick was very effecient", "rating": 5}, {"title": "My experice is very good", "text": "Date of experience: June 24, 2024", "rating": 5}, {"title": "Very Good company im very happy to work…", "text": "Very Good company im very happy to work with that.", "rating": 5}, {"title": "Good experience ", "text": "Low commission paid but received high end service ", "rating": 5}, {"title": "I had the pleasure of working with an…", "text": "I had the pleasure of working with an outstanding agent who was deeply familiar with our market and collaborated with us to achieve our goals. He consistently prioritized our interests and went above and beyond by assisting with numerous tasks related to selling and moving that typically fall outside an agent's responsibilities. ", "rating": 5}, {"title": "This is a 5 start company ", "text": "This is a good real estate company and if is the best one out there. ", "rating": 5}, {"title": "Thank you Clever", "text": "Thank you Clever, we’ll be your platform again in the future. ", "rating": 5}, {"title": "Clever- A+", "text": "This is the second time I’ve used clever! Both times my home sold quickly and saved me considerable money on commission! The closing process was quick and seamless!! Top notch in every way!!", "rating": 5}, {"title": "Our agent Michelle Lorme was excellent!", "text": "Our agent Michelle Lorme was excellent!We couldn’t have asked for a better person.", "rating": 5}, {"title": "Friendly,& knowledgeable ", "text": "David and Marly, are very personal and professional and a pleasure to have worked with. We hit the jackpot when we got them for our realtors. I pray, that everyone else is as blessed as we were!!!", "rating": 5}, {"title": "The Antonakos Group - Exceptional in Every Way!", "text": "Erica and Alex Antonakos,Thank you very much for the professionalism, expertise, and commitment you both exude as Real Estate Experts. Having worked with Clever before, I had exceptional confidence that I chose the right people to work with and Alex and Erica proved my decision 100% correct.Location, location, and location are well-known as the three most important elements when purchasing real estate. People seldom talk about the three most important aspects of selling real estate. In my view, they are Knowledge, Understanding, and Will. Alex and Erica always displayed those qualities throughout the experience of selling my property.Knowledge: The neighborhood, the marketplace, pricing strategy, negotiation tactics, and how to appeal to buyers.Understanding: My situation and desire for a quick no-nonsense sale, the buyer’s agent, taking the time to view the other homes on the block to determine our pricing strategy, and the ability to communicate for an absentee owner.Will: The will to push the sale forward and close as soon as possible. The willingness to be at the house whenever necessary and help the buyers. The diligence to communicate with me through email, text, and calls as soon as possible.The home was under contract within a week of listing. I am grateful for everything Alex and Erica did to ensure they met my goal for the home to close quickly. Clever is great to work with and well represented by the Antonakos Group! ", "rating": 5}, {"title": "Karina was pleasant and helpful from…", "text": " Karina was pleasant and helpful from the very beginning of my search.   She listened to me and was attentive to my specific requests and concerns.   She returned all phone calls and texts in a timely manner.  She always made sure to allot ample time for virtual tours and showings. She was adaptable to my limited schedule for showings due to distance and family obligations.  The entire process from beginning to closing went very smoothly.   No glitches.  I moved 2 years ago and that experience was a struggle from beginning to end.  I highly recommend Karina, especially if you are a first home buyer as you can depend on her to answer all your questions and guide you through the entire process. ", "rating": 5}, {"title": "Good Company and Great Agent", "text": "We were set up with a great agent who knew our market and worked with us to get the job done.  Bob Hoff guided us through the listing and sales process better than any agent I have worked with before and at a better rate.  He kept our interests as #1 priority and also helped with many of the other tasks involved in selling and moving that agents aren't required to do.  I would highly recommend him to anyone buying or selling in the middle TN area.", "rating": 5}, {"title": "Agent was great!", "text": "Date of experience: June 20, 2024", "rating": 5}, {"title": "Highly Recommended", "text": "Highly Recommended. I was so happy with the first house, I listed a second!!!It's a great service that is extremely valuable in this market and even hot markets. ", "rating": 5}, {"title": "Clever found me the best realtor in…", "text": "Clever found me the best realtor in California. Tom Tennant from Reliance Real Estate Services was excellent. I don’t think I have ever been treated so well by a realtor. I was able to save a lot of money and I still got top of the line service. ", "rating": 5}, {"title": "Easy to get qualified agents at a…", "text": "Easy to get qualified agents at a reasonable commission structure. ", "rating": 5}, {"title": "Extremely Helpful", "text": "I did not know how to find a realtor and just happened on your website. I wasn’t exactly sure what it was but I’m really glad I found it. Clever made it super easy to find a great realtor, Lisa Wilson, she helped me through the entire sell of my condo. ", "rating": 5}, {"title": "The savings made my experience great", "text": "The savings made my experience great.  The agent was not good, didn't even show up to the closing.  The house sold before the first showing while it was listed as coming soon.  ", "rating": 5}, {"title": "Fast efficient selling home service ", "text": "Fast, productive process on selling our home. We are very impressed with the simple yet thorough service for listing our home. Very satisfied, will definitely recommend to friends and family. ", "rating": 5}, {"title": "Review ", "text": "My realtor was top notch. I'd recommend Stephanie Anson to anyone who may be buying or selling. ", "rating": 5}, {"title": "Highly recommend this valuable service", "text": "In these tough financial times, and with real estate in such a downturn, Clever really came through for me! I will absolutely use their services again for real estate transactions!", "rating": 5}, {"title": "Cleverly helpful.", "text": "Chris Martinez reignited my hope! I went through 3 agents before him and when he got his hands on it, it was seamless and effortless for me. It might be luck, but I will recommend this service to anyone looking to sell. ", "rating": 5}, {"title": "Good Closing", "text": "Helpful, friendly, business relationship with Jenn Smith. ", "rating": 5}, {"title": "Great agent", "text": "Great agent!  Helpful in every way and very knowledgeable. ", "rating": 5}, {"title": "Renee Moran  makes dreams come true!", "text": "Renee Moran and her team made a fantastic video that really emphasized my home's unique features. There were two open houses and many individual appointments. She said that my home was worth more than any other agent and she got the price for me! Best of all, everything went fast! It took less than three weeks from listing to closing. Highly recommended!", "rating": 5}, {"title": "You helped me find a great agent", "text": "Date of experience: June 17, 2024", "rating": 5}, {"title": "The services Stephanie Caddo provided…", "text": "The services Stephanie Caddo provided were consistently outstanding. One of the best experiences with real estate agents!  She was knowledgable,  available, professional and responsive in all communications. She listened to our concerns and input and was a strong negotiator for us as sellers. ", "rating": 5}, {"title": "Michael Pelligrini was the best realtor…", "text": "Michael Pelligrini was the best realtor I’ve ever had. And I’ve had 5. He made all of it so easy. He held my hand and had my back. I would recommend him to everyone!", "rating": 5}, {"title": "Great job pairing me with Erine Dill he…", "text": "Great job pairing me with Erine Dill he is a heart realtor. Thank you ", "rating": 5}, {"title": "This is the second time I have used…", "text": "This is the second time I have used Clever, and it was seamless both times.  Saved $20K just in this last transaction.  Clever hooked me up with an established Realtor with a large broker and we were under contract in under a week.", "rating": 5}, {"title": "Our realtor was honest with his…", "text": "Our realtor was honest with his assessment of the home and did everything in his power to sell our home for a great price. Overall experience was great and loved the lower commissions rate!", "rating": 5}, {"title": "Highly recommend using Clever", "text": "Sign up with Clever was easy, I received quickly top notch agents to chose from who were willing to work with me for a 1,5% fee. Clever followed up several times with me to see if everything is going well. Will definitely use again and recommend to others.", "rating": 5}, {"title": "Great!", "text": "Worked great, quick and seamless!", "rating": 5}, {"title": "It was a very easy and pleasant way to…", "text": "It was a very easy and pleasant way to sell our house. Ms Jane was the best Realtor we could have asked for. ", "rating": 5}, {"title": "Need it!", "text": "Easy to work with.", "rating": 5}, {"title": "Our realtor was terrific.", "text": "Date of experience: June 13, 2024", "rating": 5}, {"title": "Great realtor connections ", "text": "Great realtor connections", "rating": 5}, {"title": "Easy and convenient ", "text": "Provided good list of local realtors to work with and gave a good discount on commission. What’s not to like?!", "rating": 5}, {"title": "A great way to save money in real…", "text": "A great way to save money in real estate transaction.  The participating agents are experienced and courteous as well.  ", "rating": 5}, {"title": "Clever made finding a reatlor easy and…", "text": "Clever made finding a reatlor easy and saved me money.  I would definitely use Clever again. ", "rating": 5}, {"title": "Jeffrey Mathurin", "text": "Jeffrey Mathurin ", "rating": 5}, {"title": "Joshua", "text": "Joshua, our agent that you referred, was outstanding. We wondered if the service we would receive would be below par due to the reduced rate but Joshua was the best!", "rating": 5}, {"title": "Both seller and buy agents were great.", "text": "Both seller and buy agents were great. ", "rating": 5}, {"title": "It was seamless and it saved me…", "text": "It was seamless and it saved me financially. The realtors you recommended were the absolute best in this area.Thank you", "rating": 5}, {"title": "Saved a lot of money AND my time", "text": "The agents that were initially recommended were all good and responded quickly.  The process for picking an agent was easy and quick.  Our Clever contact person reached out repeatedly throughout the process to make sure all was well.  I saved not just money, but my time, as well, through Clever.", "rating": 5}, {"title": "My Realtor, with the Clever Real Estate network, was fantastic!", "text": "My Realtor, Julie Millam, was great!I recently had the pleasure of working with Julie to sell my house in Cape Coral, and I couldn't be happier with the experience. From start to finish, Julie was professional, cordial, and incredibly knowledgeable about the real estate market.Julie ensured that the entire transaction went smoothly and that I was fully protected regarding any necessary disclosures. Her attention to detail and thorough understanding of the process made me feel confident and secure every step of the way.Thanks to Julie's expertise and dedication, my house sold for a great price, even in this competitive market. She was always available to answer my questions, provide guidance, and keep me informed throughout the process. Working with Julie was a wonderful experience, and I highly recommend her to anyone looking to buy or sell a home. Thank you, Julie, for your exceptional service!", "rating": 5}, {"title": "Smart Choice Great Experience", "text": "I had done everything myself expecting to list FSBO but then discovered Clever that sounded too good to be true.  I got brave and entered my request and shortly there were 3 leads offered to me.  I didn't even have to call because Agents were contacting me directly.  I was able to meet with the first one within an hour.  This Agent was professional, did not waste my time or his, and he explained all he had to offer, his thoughts and plans to get the house sold and actually scared me at first he was so confident. I let the other Agents know I found my 'guy' and they were fine and didn't contact me again. I was thrilled to be able to save 1% or more listing commission as I wanted to keep costs down.  He was worth full price, didn't cut any corners and was 100% available with immediate responses.  He looked out for my interest before his own.  He listened to my ideas and always included me in decisions with logical points.  Some improvements I didn't go with, but never a complaint, always positive.  Sold and closed in less than 30 days.  ", "rating": 5}, {"title": "Great!", "text": "They found me a great agent who helped sell my place fast.", "rating": 5}, {"title": "Highly recommend", "text": "Agent never pressurized me to make high offers in order to lock the deal. They looked after my interest before their own commission. ", "rating": 5}, {"title": "Clever introduced us to a few top agents and…", "text": "Clever identified a few top agents and then gave us the freedom to choose the best one for our needs. They helped with keeping our costs down while ensuring that our experience would be exceptional. Our agent worked very closely with us, listening to our expectations and supporting us at every turn.", "rating": 5}, {"title": "home sale", "text": "Carolina did an excellent job for us", "rating": 5}, {"title": "My realtor was very easy to work with…", "text": "My realtor was very easy to work with and very accessible when I had questions. ", "rating": 5}, {"title": "Clover did a great job matching me with…", "text": "Clover did a great job matching me with a very attentive Realtor.  The communication in the whole process was amazing. They kept me informed the whole way through and answered any questions I had.  ", "rating": 5}, {"title": "It was so nice working with the seller…", "text": "It was so nice working with the seller and buyer realtors. They were so helpful and kind. I can’t recommend them enough.", "rating": 5}, {"title": "I saved a lot of money and my realtor…", "text": "I saved a lot of money and my realtor Tracy Trammel was amazing", "rating": 5}, {"title": "Our Agent Herlinda Rojas was THE best", "text": "Our Agent Herlinda Rojas was THE best! This is the 9th home I’ve sold over the years and by far the easiest transaction. Linda is amazing in every possible direction. We could not be happier! Bravo, Linda! ", "rating": 5}, {"title": "Clever was able to find agents who accept lower commissions ", "text": "Clever was able to find agents who accept lower commissions. Worked out well!", "rating": 5}, {"title": "Great real estate agent", "text": "William our real estate agent worked hard and went beyond our expectations in order to complete the sale. Highly recommend him.", "rating": 5}, {"title": "Our Realtor was great", "text": "Our Realtor was great! She worked for our interest the whole time. ", "rating": 5}, {"title": "Clever connected me with competent and…", "text": "Clever connected me with competent and professional realtors who delivered full service for a lower fee.  The Clever team was great with follow ups and helping with any questions I may have had.", "rating": 5}, {"title": "Great service", "text": "Great service ", "rating": 5}, {"title": "The service is great because it enabled…", "text": "The service is great because it enabled me to find the perfect agent to work with who was willing to restructure typical commissions earned.  ", "rating": 5}, {"title": "convenient service when purchasing out…", "text": "convenient service when purchasing out of state ", "rating": 5}, {"title": "Highly recommend ", "text": "This is a stand up service, They really tend to your needs and the savings are real. we saved 2% in commissions a total of $8400.00 savings on a 420K sale. Our agent was with us every step of the way", "rating": 5}, {"title": "Quan had to navigate thru some problems…", "text": "Quan had to navigate thru some problems on closing. She did a great job marketing the house and the price I sold it for. She is truly the best at what she does. I would highly recommend her.", "rating": 5}, {"title": "Reliable Experienced Agent", "text": "Our experience with the recommended agent, David Allen, in Columbus, has been excellent. He is very experienced, understands the market, and how to do the best job for his client. He is also highly responsive to texts or calls and very reliable in all the many details. We recommend him highly.", "rating": 5}, {"title": "Excellent!", "text": "Excellent!! Worked with Mike Putman in Arizona  . He went above and beyond. Nice guy , knows his stuff . Got the job done quicker than I had expected. Would recommend him to anyone .  Robert Ryan ", "rating": 5}, {"title": "it works...", "text": "It works....", "rating": 5}, {"title": "I recommend clover to anyone", "text": "I recommend clover to anyone. At first I thought it was going to be a ( cheap service). It actually turned out to be an awesome experience. Jim the realtor was great and very knowledgeable about the area and comps. House sold quicker than I thought and I end saving $5,000 in commission. I highly recommend.", "rating": 5}, {"title": "Johnny Rice  my house sold", "text": "My realtor  Kelly she did her best to sale my house and she did it on May 25 closed escrow ", "rating": 5}, {"title": "Great company", "text": "You guys provided a truly professional Lady.she was on point. The house was on the market for a day when I receive 5 offers.", "rating": 5}, {"title": "Quick and easy.", "text": "Date of experience: May 28, 2024", "rating": 5}, {"title": "Justin rocked ", "text": "Justin was incredibly calm, professional and helpful. Thought the commission structure was fair and appreciated the strong effort, beautiful photographs and overall effort facilitated by our realtor. ", "rating": 5}, {"title": "All went well and easy.!!", "text": "Date of experience: May 24, 2024", "rating": 5}, {"title": "I connected with an awesome realtor…", "text": "I connected with an awesome realtor that really knew the market and how to get my property listed and sold.  Great experience ", "rating": 5}, {"title": "Use this service!  I was looking for a realtor to sell our…", "text": "I was looking for a realtor to sell our home. They all were charging 6% or more. I Googled low percentage realtors and Clever was one of the options that came up. I filled out the online form and immediately I received a call. We discussed my location and the property. They sent me names of three local realtors that charged 3.5%. We very shortly spoke with one who we contracted with and he was great! Sold our home quickly. We had some issues with inspections and he was right on top of it keeping communication open between us and the buyers realtor. Working through Clever saved us a lot of money!", "rating": 5}, {"title": "Josh Barnard was amazing!", "text": "Josh Barnard was amazing.  He had answers for every question and resources for everything I needed. I highly recommend him to anyone in need of a realtor", "rating": 5}, {"title": "Never heard of them before, love them now", "text": "I never heard of Clever before our recent home sale a did the research and read the reviews. The process was simple, answer some questions and the provide you with realtors to pick from an interview them, select and move forward. Clever did check in a few times but outside the set pricing structure it’s just you and the realtor. You can always go to Clevwr for 2nd opinions. We were very happy with our realtor and sold our house at list price (which other realtors wanted to go in much lower) in a tough rate market. Absolutely no reason to not use Clever unless your specific realtor isn’t part of their network.  It helped us save alot of money, they were a secondary sounding board, and they were a good way to identify realtors to interview. ", "rating": 5}, {"title": "My real estate agent was top notch and…", "text": "My real estate agent was top notch and she and the Clever team checked in on me often to ensure we had a good selling experience. ", "rating": 5}, {"title": "Same service but you save thousands", "text": "Same service but you save thousands.  Only way to go if you are selling property.", "rating": 5}, {"title": "CLEVER HOOKED ME UP WITH A GREAT…", "text": "CLEVER HOOKED ME UP WITH A GREAT REALTOR!", "rating": 5}, {"title": "All of the agents Clever sent…", "text": "All of the agents Clever sent underestimated the true value of my property, as though they took the Zillow values and generated their own through MLS information and software. But so did other agents not with clever. The agent I choose did not BS me when asked the hard questions as other had done. She had a very nice manner, smart, good communication and on top of the local RE.", "rating": 5}, {"title": "My realtor- Adrienne Gremore was GREAT!!", "text": "Date of experience: May 21, 2024", "rating": 5}, {"title": "Ease of use and the process worked as…", "text": "Ease of use and the process worked as advertised.", "rating": 5}, {"title": "Claver linked me with number of great…", "text": "Claver linked me with number of great agents, and Clever was nicely following on my experience and progress throughout sell process, making a whole agent selection and sell process much more easier and plesent. ", "rating": 5}, {"title": "While researching a competitor real…", "text": "While researching a competitor real estate company, I learned about Clever.  The reviews convinced me to use this company.  An agent used by Clever responded in maybe a whole minute later online when I requested info about Clever.  Great response time all throughout the process.  He always spoke with assurance & confidence-explained everything.  His help & knowledge about my solar roof was very helpful to potential buyers.  ", "rating": 5}, {"title": "I had an excellent realtor", "text": "I had an excellent realtor, Zac Rank. The settlement went smoothly. And I saved a significant amount of money going through Clever.", "rating": 5}, {"title": "Silent Real Estate Ninjas", "text": "I had no idea that Clever or a company like this existed. I reached out through Rabbu.com to purchase a STR investment property. I was immediately contacted by Clever who helped get me connected with a great realtor and finance person. The handoffs and introductions were as if I was in person, very smooth and professional. I quickly assessed who would be the good fit and in no time at all I found myself closing on a property 3000mi away with ease. I honestly thought the process was going to be a big headache, but I will be working with all of the parties involved that helped me acquire the property. Clever made everything streamlined and then checked in on me right around closing to see if I was good to go. Its amazing what you can do when the right people are involved and everyone is working well together. I highly advise you to check out clever and utilize them on your next property purchase.", "rating": 5}, {"title": "Excellent and professional service and…", "text": "Excellent and professional service and company! Referral to excellent realtor! ", "rating": 5}, {"title": "Loved my realtor", "text": "Loved my realtor! Thank you for making it all possible and keeping my costs lower.", "rating": 5}, {"title": "Maria Weaver was extremely…", "text": "Maria Weaver was extremely knowledgeable and helped us through the entire selling process", "rating": 5}, {"title": "Great experience ", "text": "I would recommend clever, I sold and bought with the agent they gave me and was very happy with the experience!", "rating": 5}, {"title": "Great experience ", "text": "Melissa Ricks and her team were easy to work with and awesome! Melissa is very knowledgeable on of the market and it was great to work with her. I’d definitely recommend her for her professionalism, experience, and immediate response if I had questions or concerns. She and the team made the selling experience less stressful.", "rating": 5}, {"title": "Shakyra works wonders!", "text": "Shakyra was right there all the way and gave immediate attention to all our issues. She is a hard worker, informative, and such a delight.", "rating": 5}, {"title": "Smooth Transaction/Agent Excellent", "text": "Our agent James Nicholson was great to work with and kept us informed during every step of the process.  The transaction went very smoothly and we are very happy with the outcome.", "rating": 5}, {"title": "Definitely recommend!", "text": "I saved a lot of money with a great agent!", "rating": 5}, {"title": "Dana did a great job and got us over…", "text": "Dana did a great job and got us over list price offers within  48 hours. THX", "rating": 5}, {"title": "Multiple references ", "text": "I got multiple references and was able to pick the perfect person to work with. our realtor was awesome to work with and of course we loved saving money!", "rating": 5}, {"title": "Not hounded", "text": "Not hounded. Recommended agent was great.", "rating": 5}, {"title": "A great agent.", "text": "Date of experience: May 14, 2024", "rating": 5}, {"title": "Great communication.....Brian ensured I…", "text": "Great communication.....Brian ensured I was in the loop every step of the way", "rating": 5}, {"title": "Thank you", "text": "I wanted to take a moment to express my sincere gratitude for your help in connecting me with a real estate agent. I recently reached out to Clever needing assistance, and your customer service team was fantastic. Thanks to your service, I was paired with an agent. One month later, I sold my house. Buyer agent 1.5% Seller agent 2%Thank you again for your excellent service. I will definitely recommend Clever to anyone looking for a hassle-free way to find a qualified real estate agent at a reasonable price!", "rating": 5}, {"title": "Oue realtors Shana and Alisha were…", "text": "Oue realtors Shana and Alisha were amazing. Very responsive, kind, and very hardworking. It had been an absolute pleasure working with them", "rating": 5}, {"title": "Awesome experience! My Realtor was amazing!", "text": "Awesome experience! My Realtor was amazing. Don't think they cut corners or you don't get 110% service because you do. Thanks Lisa Dixon in AZ, you are the best! XOXO", "rating": 5}, {"title": "amazing experience I must say", "text": "amazing experience I must say ", "rating": 5}, {"title": "Great Agent", "text": "Date of experience: May 14, 2024", "rating": 5}, {"title": "Josh did a great job selling my…", "text": "Josh did a great job selling my daughter’s condo in Springville UT.He was very professional right from the start and outlined everything at that time.And had it sold in less than a week.Great job all round.Irving Armstrong ", "rating": 5}, {"title": "Good good good", "text": "Date of experience: May 13, 2024", "rating": 5}, {"title": "Jordan went above me beyond in selling…", "text": "Jordan went above me beyond in selling our home. She know her market and the area and will help you navigate anything that pops up along the way. I can not recommend her enough! ", "rating": 5}, {"title": "Highly recommend", "text": "Highly recommend, smooth process", "rating": 5}, {"title": "Immediate contact with an agent", "text": "Immediate contact with an agent: Clever put me in immediate contact with John Bowen. He was wonderful to work with: answered all of my questions, gave pertinent advice when asked, worked through problem items/situations, and maintained a positive outlook -- even when I wasn't so sure. My house sold way faster than I thought it ever would. I feel this is due to John's knowledge of the home's area and correct price point.", "rating": 5}, {"title": "Amber Short was the realtor assigned to…", "text": "Amber Short was the realtor assigned to us and highly recommend!! Thanks ", "rating": 5}, {"title": "Love the process", "text": "Love the process!  I interviewed 3 Real Estate Agents and went with the one that is aligned with our goals. Most of all, I love the savings that we got in going through Clever!  Thank you!", "rating": 5}, {"title": "Home Listing", "text": "I was happy to save money on the listing side because I got stuck paying the buyers commission.", "rating": 5}, {"title": "I was referred to an excellent agent…", "text": "I was referred to an excellent agent and my house was sold within 60 days.", "rating": 5}, {"title": "Simple", "text": "Simple, cost effective, got an agent could trust", "rating": 5}, {"title": "Similar to a traditional commission structure with services", "text": "Great service no issues seller agent side", "rating": 5}, {"title": "Both Clever Realty and Century 21 with…", "text": "Both Clever Realty and Century 21 with Blair. Everything went very good for us in terms of keeping us informed using every media in order to market our house. Also, if there was any changes, they were quick to be taken care of and finally three days is the fastest we've ever sold our home so we are very pleased with the outcome and the savings that you just sent me $5085. That's a win-win. ", "rating": 5}, {"title": "John Kellogg EXP ,Once again", "text": "John Kellogg EXP ,Once again, Janet and I want to thank you for representing the Trust in selling the Alan house….The listing and selling process with your Broker experience and knowledge made the quick sale effortless.Results were beyond expectations!", "rating": 5}, {"title": "Great service", "text": "Great service, we saved over $9000 and our agent was very good.  Highly recommend.  Interviewed 2 agents and both were responsive.  ", "rating": 5}, {"title": "They were amazing", "text": "They were helpful, thorough, kind and motivated!", "rating": 5}, {"title": "We loved working with Melissa ", "text": "We loved working with Melissa ! She was very down to earth and always available to answer our questions ! ", "rating": 5}, {"title": "Top notch service from David", "text": "Top notch service from David, start to finish. He was ALWAYS available and responsive which was especially comforting as we were in another state during most of the process. We had several responses from Clever but David was excited about our home and very optimistic even in this uncertain RE environment. That made us feel positive, confident and stress free as well. Excellent experience and the savings in commission was a big bonus as this property was funding for our retirement. Would highly recommend Clever and especially David.", "rating": 5}, {"title": "Very attentive..communication was…", "text": "Very attentive..communication was there..gave us options ", "rating": 5}, {"title": "Referred to great agent and the…", "text": "Referred to great agent and the commission rate was unbeatable!", "rating": 5}, {"title": "As it turned out", "text": "As it turned out, I put a for sale by owner sign in the yard and sold it myself.  I did use Josh to help with closing.", "rating": 5}, {"title": "Matched us with a great agent!", "text": "Matched us with a great agent!! Easy to work with and very helpful!! I would recommend using Clever and highly recommend Hope Rhoades as an agent. ", "rating": 5}, {"title": "Chris Trumbach is a top notch agent", "text": "Chris Trumbach is a top notch agent. Hands down, the best agent I have worked with. Very knowledgeable. Great suggestions to sell my condo quickly. And we closed within 2 weeks once I had an offer.", "rating": 5}, {"title": "Danielle and her team were great", "text": "Danielle and her team were great ", "rating": 5}, {"title": "We saved $4,345.00 going with Clever Realistate!  If you guys need to sell choose to take a look at Clever", "text": "The process with Clever Realistate at 4.5% fees went really well with the Realtor we decided to go with out of 3 to choose from!We were given a website that requested showings and we could accept or decline or change the time of viewing.  We had set a time of day that we were comfortable with as well. So we could be ready for our showings.", "rating": 5}, {"title": "Overall a good experience with Cleaver and the Relator they recommended!!", "text": "Overall a good experience.Cleaver team got back very timely with some relator options for my area and had two separate relator's reach out to me to share what they could do. ", "rating": 5}, {"title": "Michelle Megann is fantastic", "text": "Michelle Megann is fantastic.  She knows what she is doing. She is confident and made me feel safe with her handling the sale of my house. I would recommend her to anyone needing real estate help.", "rating": 5}, {"title": "Rachele was absolutely amazing thru the…", "text": "Rachele was absolutely amazing thru the whole ordeal.  Anytime we needed anything or had questions she was there and had a great attitude thru the whole process.  Excellent service.  Thanks Rachele ", "rating": 5}, {"title": "House Sale", "text": "The follow-up texts by Clever were a comfort.Also, a special call-out for the Real Estate agent.  Went above and beyond to make sure a deal was made. Always was courteous, responsive, and flexible.   ", "rating": 5}, {"title": "Realtor was very knowledgeable and had…", "text": "Realtor was very knowledgeable and had a wonderful time. It was a great pleasure working with Brent Wilks-- the attorney ofgive he recommended AL Beaudreu was Excellent!", "rating": 5}, {"title": "SOLD!!!", "text": "Our agent Kelsey worked tirelessly to sell my home. Clever Real Estate referred me to her and then I sat back and waited. The savings was really worth signing on with Clever.", "rating": 5}, {"title": "Enjoyed paying less", "text": "I paid a lower fee for the seller’s realtor and received exactly the same service as if I had paid a higher fee. ", "rating": 5}, {"title": "Awesome and very knowledgeable! Pleasant to work with. ", "text": "Sold home very quickly. Had our best interest in mind at all times.", "rating": 5}, {"title": "I was guided thru the stressful steps…", "text": "I was guided thru the stressful steps of selling that took a lot of anxiety off my mind.  All questions were treated with interest and professionalism and no question was too stupid or asked too often.Considering everything, especially the experience of our agent, I do not think things could have gone smoother.", "rating": 5}, {"title": "Since the property being sold was in a…", "text": "Since the property being sold was in a different state from where I was located , all people & persons involved were so experienced & helpful all phases of the sale were made so smoothly. I have nothing but gratitude for all involved. ", "rating": 5}, {"title": "We didn’t know any local agents in the…", "text": "We didn’t know any local agents in the area we were selling our property. Clever agent sent us 3 matches, we interviewed 2 and selected an agent within 3 days. Our property was listed and we had 4 offers and accepted an offer 8% over asking price within one week. Seamless and professional and highly recommend this service.", "rating": 5}, {"title": "Had a fantastic experience with Clever", "text": "Had a fantastic experience with this company. I would highly recommend. They were easy to deal with and I didn’t have any issues interacting with their platform.", "rating": 5}, {"title": "Clever is a great way to sell your house…", "text": "Clever is a great way to sell your house. They paired us with Jason Cox who was great as our realtor. He was patient and explained a lot of what we did not know, when it came to selling our house. You will not be disappointed using Clever.", "rating": 5}, {"title": "Great experience. Definitely recommend.", "text": "Sent me several agents to interview. Found a great one. ", "rating": 5}, {"title": "Awesome", "text": "Awesome! Our house sold in less than month at the full listing price!! Closing was quick and easy. Our agent, Sandra Ballew, that was provided through clever did an awesome job! She even helped us find our new home and we were able to close on the sale/purchase the same day! Thanks Clever!!", "rating": 5}, {"title": "We were set up with a realtor right…", "text": "We were set up with a realtor right away, and she was motivated to sell. She was professional and communicative.", "rating": 5}, {"title": "Great deal", "text": "Fast, professional service at a great savings to us!", "rating": 5}, {"title": "Exceptional Organization", "text": "All i can say as a customer was Clever Real Estate followed through on every part of the process. All correspondence and follow ups were done in a timely fashion. What they said they were going to do was exactly what they did, which was to give superior service on their part. Great working with them, they made me feel like i was on the team. They always kept me in the loop on all stages of the  process also.", "rating": 5}, {"title": "My agent was knowledgeable", "text": "My agent was knowledgeable, fast, nice and helpful. She had showings immediately and kept in constant contact with me. I was out of state but I knew everything that was going on. I had Lauren McGuire as my agent and I would use her again!", "rating": 5}, {"title": "Fantastic realtor", "text": "Fantastic realtor, Matthew Reilly.", "rating": 5}, {"title": "They sold my house in seven days", "text": "They sold my house in seven days. They are fast, reliable, and awesome.", "rating": 5}, {"title": "Clever/Taylor Tolbert Review", "text": "I worked with Taylor Tolbert and this was the smoothest work done. I never had to worry about anything - Taylor was in good communication with me on everything. The closing was painless and easy. Now I am having Taylor find me a new place!", "rating": 5}, {"title": "Our agent,Tiffany Cruz", "text": "Our agent,Tiffany Cruz, was outstanding. She sold our property and got us extra time to get packed and moved since we had a large property and so much to move. She also got us a house to purchase that is wonderful!", "rating": 5}, {"title": "Great service!", "text": "Date of experience: April 21, 2024", "rating": 5}, {"title": "Our agent was great", "text": "Our agent was great. Went above and beyond anything we could have thought of.  ", "rating": 5}, {"title": "I had a great experience and saved…", "text": "I had a great experience and saved money listing my home. ", "rating": 5}, {"title": "An Informative Realtor", "text": "When the realtor came in she gave me specific ideas on what to do to get my house ready for market and what I didn't need to worry about. She gave me names and phone numbers of trades people to use that were reliable. When I was ready she put the house on the market and sold it the first week. The buyer had a long wish list of things they wanted done.  The realtor handled all of that and manage to close in 60 days!  I could not have asked for better service!", "rating": 5}, {"title": "Tracy was amazing. She gave us peace of mind. ", "text": "Tracy was amazing.  She provided a comprehensive market analysis and advised us on the strategic moves to get our property sold.  We are out of town.  So it was the little things she did to give us ease of mind through this process - checking on the property, ensuring internal temperature was properly set to avoid high utility bill, just to name a few.  We had an overall peace of mind in knowing that she would handle anything that needed to be done.  ", "rating": 5}, {"title": "Had a fantastic experience with Clever", "text": "Had a fantastic experience with this company. I would highly recommend. They were easy to deal with and I didn’t have any issues interacting with their platform. ", "rating": 5}, {"title": "2X Great Clever Experience ", "text": "This is the 2nd time I’ve used Clever to find a real estate agent and both experiences have been great. The agents assigned and their office teams were extremely professional and got the job done quickly to find me a qualified buyer.", "rating": 5}, {"title": "Great agent", "text": "Great agent, Thor Sorenson! Good communication and property sold quickly.", "rating": 5}, {"title": "Found a fabulous agent", "text": "Found a fabulous agent. Saved money. Great experience. ", "rating": 5}, {"title": "Very impressed with the service and…", "text": "Very impressed with the service and Petra", "rating": 5}, {"title": "Clever helped me find a fair commission…", "text": "Clever helped me find a fair commission price and an excellent real estate agent referral in my area. Thanks Clever!", "rating": 5}, {"title": "Great agent", "text": "Great agent. Professional personable and very efficient. If you need to buy or sell a home in Southern Utah Ryan Kramer with ReMax is your man.", "rating": 5}, {"title": "Great Experience", "text": "The ease of finding a realtor and the GREAT realtor you suggested.  She was patient with us and explained things well.  She kept us informed of any changes as well as helpful guidance through this whole process.", "rating": 5}, {"title": "A real professional.", "text": "Clever put us in touch with one of the best agents in our area. Jennifer Bradshaw knows the business and she made the sale easy for us.A real professional.Knows how to market your home.Jennifer had her work cut out for her. A previous agent had really messed things up. She knew what needed to be done and did it. ", "rating": 5}, {"title": "Great", "text": "Did not have any problems.", "rating": 5}, {"title": "Attention to Detail", "text": "Professionalism!  As a former REALTOR myself, my expectations were perhaps higher than a first time buyer or seller. Selling a home as a senior citizen with health issues was more stressful than buying or selling when we were younger and able to do more, and faster.  Lisa’s team exceeded my expectations in all aspects of the sale of our home and made the entire process easy and (almost) stress-free.  From the professional photography to listing details to coordinating showings to negotiating contract and closing details, we were always informed in advance so we could choose the best options to meet our needs. If we weren’t leaving the Willamette Valley, we would definitely choose Lisa for our next home purchase. ", "rating": 5}, {"title": "Everything went smoothly.", "text": "Everything went smoothly. ", "rating": 5}, {"title": "Janet ridgeway was so awesome", "text": "Janet ridgeway was so awesome!  She was easy to communicate with and was so attentive to our needs!  Thanks for a great experience!!!", "rating": 5}, {"title": "David with Key Realty came in and told…", "text": "David with Key Realty came in and told me that he recommended listing slightly lower than market value to help it sell fast and we were in contract within 9 days of listing. David really knew what he was doing!", "rating": 5}, {"title": "Lisa Higdon was awesome! 5 Stars! ", "text": "How to representative Lisa Higdon was exceptional! She was kind met our needs and worked with us to take care of a sale. Would recommend her to anyone in the state of Georgia!", "rating": 5}, {"title": "Real Estate Agents were top notch", "text": "Real Estate Agents were top notch. Made it all smooth process. They were there with assistance every step of the way. ", "rating": 5}, {"title": "Never once did we feel like we got a…", "text": "Never once did we feel like we got a discounted service. Our agent was top notch, knowlegable, and helped us every step of the way. We had already moved out of state and she stayed in constant contact with us.", "rating": 5}, {"title": "I found a really strong realtor..", "text": "I found a really strong realtor... made a difference.!", "rating": 5}, {"title": "Chris and Ian Trumbach did a great job", "text": "Chris and Ian Trumbach did a great job. From start to finish everything was made easy Thanks so much ", "rating": 5}, {"title": "Loved the savings of Realtors…", "text": "Loved the savings of Realtors commission.", "rating": 5}, {"title": "Very helpful with me I’m not tech savvy…", "text": "Very helpful with me I’m not tech savvy they were a big help ", "rating": 5}, {"title": "5 stars", "text": "Found a great realtor quick and easy that was easy to work with and very helpful.", "rating": 5}, {"title": "Sandra is a Great agent!", "text": "Great agent!", "rating": 5}, {"title": "A good company to work with ", "text": "Easy to find a realtor meets my needs ", "rating": 5}, {"title": "Susan was wonderful!", "text": "Susan was wonderful and helped guide me through my home sale during a time when I was task-saturated with daily life. The money I saved using Clever was very helpful to me!", "rating": 5}, {"title": "Easy, peazy... great experience", "text": "We had a great experience with our Clever Realtor.  He made the whole process of selling our house enjoyable.", "rating": 5}, {"title": "Agent Laura was very professional", "text": "Agent Laura was very professional, and very helpful.", "rating": 5}, {"title": "Allison was well organized and…", "text": "Allison was well organized and suggested some awesome tips on prepping our house for sale. The prep on the front end worked as the house sold in two days. It was a great experience.", "rating": 5}, {"title": "I was very pleased with the variety  of…", "text": "I was very pleased with the variety  of real estate agents  that you sent our way. We settled on Tropic Shores and agent Larry Eudaly did a fantastic job on getting our house sold. ", "rating": 5}, {"title": "Excellent team effort and efficient", "text": "Excellent team effort and efficient. Low cost and professional agents.", "rating": 5}, {"title": "Win-win for Realtor-Seller in slow market", "text": "Clever opens up the possibility for finding a great mainstream realtor who is willing to take a lower percent fee for their own reasons whether slow season or spinning off to start their own office, etc.  The process was flawless and simple except for having to turn away a few VERY eager candidates. My only wish is that I could have screened the realtor candidates' locations before they had my contact info as I was less interested in a realtor more than 5 miles away from my unique niche market, and I that would have saved both of us time and their hopes and futile contacts.", "rating": 5}, {"title": "Smooth transition from possible…", "text": "Smooth transition from possible listings agent to sale. Clever kept in contact to make sure process was going smoothly.", "rating": 5}, {"title": "Top notch professional performance ", "text": "Top notch professional performance They go beyond the extra step to help customers understand and help with more then expected with the sale of the homeThis team in number 1A+", "rating": 5}, {"title": "My experience with Clever…", "text": "The quick connection to a variety of Real Estate experts made the process easy and fast. I got in contact with Jimmy Diamond who sold my property super fast ", "rating": 5}, {"title": "Clever listening", "text": "Knowledgeable and attentive signing agent.  Listened and understood what I wanted. Did not bombard me with unnecessary questions or calls.", "rating": 5}, {"title": "John was great", "text": "Date of experience: March 31, 2024", "rating": 5}, {"title": "Easy process and Amazing Realtor", "text": "The process was very easy, and I was in touch with multiple options for Realtors almost immediately.  The Realtor we went with, Don Sheets from eXp Realty, was above and beyond amazing.  Saving some money on closing costs was important in my circumstance.  ", "rating": 5}, {"title": "Very satisfied customer ", "text": "Well, the obvious answer is y’all saved me money. 😀 I was in a time crunch and the agent Gabe Fitzhugh, called me right away, came over that afternoon and had my house listed the next day. He was professional, knowledgeable, very helpful and willing to answer my questions over and over. He always responded to my questions even on the weekends. I would highly recommend your service and especially Gabe. ", "rating": 5}, {"title": "Great agent, great service", "text": "The Great agent you put in touch with, did a sterling job. He was friendly helpful and professional in his approach.", "rating": 5}, {"title": "Realtors with heart and humanity", "text": "Sold three homes via Clever - they truly have the best realtors with heart and humanity!", "rating": 5}, {"title": "Sold in a flash", "text": "Clever did great marketing and the condo sold in three weeks ", "rating": 5}, {"title": "Easy", "text": "EasyQuick transaction ", "rating": 5}, {"title": "My agent was a great guy", "text": "My agent was a great guy, and was able to navigate unique situations. I was happy to keep more of my equity by choosing Clever.", "rating": 5}, {"title": "Will be back for our next home purchase", "text": "Clever matched us with a realtor that was ready to hop in and help us get our home sold quickly! Our home sold in under an hour and closed in a week. ", "rating": 5}, {"title": "Real estate is a job that gives you the…", "text": "Real estate is a job that gives you the courage to talk to people because it depends on promotion", "rating": 5}, {"title": "My realtor was fabulous!", "text": "Date of experience: March 27, 2024", "rating": 5}, {"title": "My experience with Clever Title Co", "text": "My experience with Clever Title Co. was very helpful, all the information was on time, they advise me, and they do it everything more easy. ", "rating": 5}, {"title": "Received calls quickly from realtors…Quick Response Great Experience ", "text": "Received calls quickly from realtors interested. ", "rating": 5}, {"title": "Andre did a fantastic job for me!", "text": "Andre did a fantastic job for me! I couldn't have gotten a better Realtor to help sell my home at any commission cost let alone the reduced commission that I paid him because of finding him through clover.", "rating": 5}, {"title": "Mike Alpert was great.", "text": "Mike Alpert was great.Quick, easy, professional.", "rating": 5}, {"title": "Great Job!", "text": "Easy process, fast and no surprises. Professional all the way through.", "rating": 5}, {"title": "Danielle was the most informative", "text": "Danielle was the most informative, helpful realtor we could have asked for.  Trul excellent.", "rating": 5}, {"title": "Matched with a wonderful agent", "text": "Matched with a wonderful agent. Found her to be experienced and timely. Made the home sale experience great.", "rating": 5}, {"title": "Sold", "text": "Clever sent me 3 agents to discuss our situation.  2 contacted me (one never attempted).  The agents gave me their opinions and let me decide how to proceed.Clever reached out several times during selection process to ensure happy with realtors and any concerns.  For a free service to me was not expecting that.Positive results all around", "rating": 5}, {"title": "Great realtor!", "text": "Renee Moran from Red Door was absolutely amazing! She was able to get the property listed quickly so showing appointments were made.", "rating": 5}, {"title": "Competent and Courteous", "text": "Through Clever I had superb real estate agents, competent and experienced settlement service, and I enjoyed the cash back following the closing. ", "rating": 5}, {"title": "Fermin and his team were great!", "text": "Date of experience: March 21, 2024", "rating": 5}, {"title": "Realtor choices", "text": "Providing me with choices in agents, letting me select who I think will be the best for me to work with.", "rating": 5}, {"title": "Shane was a great person to work with", "text": "Shane was a great person to work with.  We appreciate his professionalism and hard work.  He went above and beyond helping us sell our house! Thank you for all of your help Shane!", "rating": 5}, {"title": "Sherri was terrific", "text": "Sherri was terrific, we would highly recommend her and clever.", "rating": 5}, {"title": "Monica is very knowledgeable,helpfull…", "text": "Monica is very knowledgeable,helpfull and hardworking. She did a great job.", "rating": 5}, {"title": "We had an amazing realtor", "text": "We had an amazing realtor ", "rating": 5}, {"title": "Process was easy and real estate agent…", "text": "Process was easy and real estate agent explained everything in a clear to understand manner.", "rating": 5}, {"title": "Mike Noren went above and beyond to…", "text": "Mike Noren went above and beyond to help make a challenging sale close without issues. He was communicative throughout the process. The home was over 2 hours from our current location and was challenging for us to get back there as the sale progressed. Right before closing, some items remained and Mike volunteered to remove them on our behalf. After closing, both agents realized that they had been overpaid. Rather than pocket the funds and move on, they alerted everyone and returned the checks. This showed us unwavering integrity. Overall a strong recommend. ", "rating": 5}, {"title": "We selected a local realtor James…", "text": "We selected a local realtor James Holbrook who was knowledgeable and walked with us every step from listing to close of escrow. Highly recommend! The savings on commission was true and realtor service was fantastic.", "rating": 5}, {"title": "Very prompt responses from Greg", "text": "Date of experience: March 14, 2024", "rating": 5}, {"title": "The agent Brent Wilk was unbelievable", "text": "The agent Brent Wilk was unbelievably impressive in every manner every step from listing to closing. He is simply the best I have ever encountered in my life. Everyone that is lucky enough to have him is blessed.", "rating": 5}, {"title": "GREAT experience", "text": "GREAT experience!  Our realtor Chris McGary was superior and guided us through the whole process.  He was very knowledgeable of our neighborhood and set the price exactly as it should be. The whole process was straightforward, quick and successful!  Thank you for this service and for such a great realtor.", "rating": 5}, {"title": "Working with Tom was great", "text": "Working with Tom was great, kept us updated on all showings, negotiations, inspections and closing arrangements.", "rating": 5}, {"title": "Knew the agent Rick Daves.", "text": "Knew the agent. Knew my numbers before I listed so there were no surprises. ", "rating": 5}, {"title": "Very pleased with our experience", "text": "We had an immediate response from Clever locating an agent that we liked.  We had several to select from.  Our agent Daniel, was very communicative with us and knowlegable about the current market.  We have recommended him/Clever to others and they have listed with Clever as well.  ", "rating": 5}, {"title": "A Game Changer in Real Estate", "text": "After a failed attempt at the \"for sale by owner\" route, my cousin recommended Clever, and it turned out to be the best decision we made in our real estate journey. Upon submitting our inquiry, we received a prompt call and were connected with multiple realtors in our area.The realtor we chose through Clever was nothing short of amazing. Their expertise and dedication were evident from the start, guiding us through every step of the process with ease. Thanks to their assistance, we were able to close on the property without encountering any issues.One of the most remarkable aspects of using Clever was the financial benefit it brought us. Not only did we successfully sell our property, but we also ended up with an extra $5,000 in our pocket, a pleasant surprise that we attribute to Clever's efficient and cost-effective approach.I wholeheartedly recommend Clever to anyone navigating the real estate market. Whether buying or selling, Clever's platform simplifies the process, connects you with top-notch professionals, and ultimately helps you maximize your financial gains. Don't hesitate to give Clever a try; you won't be disappointed.", "rating": 5}, {"title": "Definitely Recommend ", "text": "Had a quick response after initial contact, a good agent and the commission situation worked out perfect. ", "rating": 5}, {"title": "Awesome experience with clever", "text": "Awesome experience with clever! We needed our house sold ASAP. It had been up on Zillow for a month as a for sale by owner. I called clever to get a real estate agent, and less than 24 hrs later we were under contract for an offer $10,000 over asking price. Thanks so much clever!", "rating": 5}, {"title": "They serve the best", "text": "They serve the best. No complaints so far", "rating": 5}, {"title": "Professional set up and easy to work with.  ", "text": "It was very easy dealing with the relator.  The showing site was clean and professional.  We had numerous showings and numerous offers on the property.  Closing was quick and easy. ", "rating": 5}, {"title": "Our agent made the process easy and was…", "text": "Our agent made the process easy and was wonderful at following up on issues.", "rating": 5}, {"title": "Best Realtor in my opinion", "text": "With no knowledge of how real estate market is,  all I knew is I needed a reliable and honest Realtor to assist in my sale so I could move to be near family for my husband and my own health. Clever was able to connect me with an awesome Realto, Lana Johnson. ", "rating": 5}, {"title": "Process was very easy from the…", "text": "Process was very easy from the beginning. I call them asked about if they help customers with selling their homes I was told yes and immediately sent several emails on what is offered. I was put in contact with clever team they sent e several agents and I picked from there. My agent Michelle Campbell was very knowledgeable and very accessible the entire journey ", "rating": 5}, {"title": "Would easily use again! ", "text": "I selected David Allen to facilitate the sale of my home through Clever. He was knowledgeable and friendly (and took great photos) and due to the lower commission rate, we saved about $6,000 compared to the standard 3% commission most realtors try to charge. ", "rating": 5}, {"title": "Susan was a great realtor..cannot…", "text": "Susan was a great realtor..cannot express how diligent n thorough she was..she gave great advise n counsel Saving money is a plus as well", "rating": 5}, {"title": "Professionals that know their stuff and deliver on their promises", "text": "If I could, I would give the entire team (from start to finish) a 15 out of 10! Brent and staff as well as the Daniel and his staff made a very stressful and difficult time in my life enjoyable. Professionals that know their stuff and deliver on their promises. Knowledgeable, personable, caring team… have already told family and friends how great everyone was. ", "rating": 5}, {"title": "Deedee Martini did a very professional…", "text": "Deedee Martini did a very professional job in representing us through Clever in the sale of our house. She was very responsive to our needs and questions. We highly recommend her as a real estate agent for buying or selling a home.", "rating": 5}, {"title": "Connected me with a great realtor Hope…", "text": "Connected me with a great realtor Hope Rhodes. ", "rating": 5}, {"title": "Nice and smart place", "text": "Nice and smart place ", "rating": 5}, {"title": "My realtor Kathy Miller was fantastic.", "text": "Date of experience: February 28, 2024", "rating": 5}, {"title": "Great Experience", "text": "I met with 2 agents recommended by Clever and spoke with a third agent by phone. I worked with one of the first I had met with. He was a pleasure to work with, and did a great job! ", "rating": 5}, {"title": "It was a very smooth and fantastic…", "text": "It was a very smooth and fantastic experience. Maureen Haney and her team are really top notch and go over and above. I feel so lucky to have found her thru clever.", "rating": 5}, {"title": "Hidden Gem", "text": "The team was very helpful in connecting me with agents in both areas.  This made a rather arduous task of moving - buying and selling at the same time - easier.  The commission rate was also a big plus, particularly when the mortgage rates are outrageous.  Thank you Clever for being a hidden gem!", "rating": 5}, {"title": "Fantastic Service and Company ", "text": "Clever was easy and fantastic from the first step!  A realtor contacted us within one day.  Our realtor was one of the best we have worked with, we have bought and sold 12 homes over the past 25 years!   Work with Clever if you want a great experience and to save money! ", "rating": 5}, {"title": "Found us a great agent offering a no…", "text": "Found us a great agent offering a no hassle discounted rate without discounting service.", "rating": 5}, {"title": "The Agent", "text": "The Agent. Paul is great!", "rating": 5}, {"title": "Perfect sale strategy ", "text": "The level of support from our agent was not always perfect. But the overall sale strategy, from pricing to sale was great. ", "rating": 5}, {"title": "Awsome they really do a great job", "text": "Awsome they really do a great job ", "rating": 5}, {"title": "Clever paired us up with an extremely…", "text": "Clever paired us up with an extremely knowledgeable agent who had a verifiable record of experience and success. Despite the discount listing, our realtor treated us like any one of her clients. The listing of our home for sale was first class, which included professional photography. Our home sold in one day for substantially over our asking price. I highly recommend using the services of Clever when selling your home. ", "rating": 5}, {"title": "Amazing Job with closing", "text": "Amazing Job with closingEverything went very smooth and is right on time", "rating": 5}, {"title": "Very happy with the service. ", "text": "The website made it easy to find a realtor willing to accept a 4% commission", "rating": 5}, {"title": "Good and bad agent recommendation.", "text": "Janet, the agent recommended was excellent in communication and was especially helpful when the buyer became difficult to deal with at times.I will say that the other agent recommended was very poor in her people skills and actually was insulting to me. She also wanted to list the house at considerably less than what we actually sold it for", "rating": 5}, {"title": "Great agent recommendation", "text": "My Agent Jordan really did an outstanding job, supported me all the way and kept me informed. I am very satisfied with Clever for recommending her.", "rating": 5}, {"title": "smooth transaction for sale of my home", "text": "Nicole was fantastic on promptly answering my questions, going way beyond call of duty and she showed a lot of care during the whole transaction!", "rating": 5}, {"title": "Clever did a great job of providing agents to interview", "text": "Clever did a great job of providing us realtors that we ultimately get to interview and \"hire\". Lisa was fabulous, talked us through each step and helped us find the home of our dreams. Highly recommend Cle er as the first step in selling your home ", "rating": 5}, {"title": "The realtor Carl was very good with…", "text": "The realtor Carl was very good with communicating. He was very on top of things to sell and close as soon as possible.", "rating": 5}, {"title": "The savings on my closing cost was…", "text": "The savings on my closing cost was amazing. The recommendations of the realtors was great.", "rating": 5}, {"title": "All around  great open to answer…", "text": "All around  great open to answer question responses were quick.  Paper work explained and easy filling out. All around no big promises, just realalistic of market area . The company is great. Commision rate is major reason for going with company  every little bit helps lol", "rating": 5}, {"title": "Clever was very easy to use", "text": "Clever was very easy to use. They were able to find me a real estate agent who lived very close to the small town where I was selling the property. The real estate agent was really fantastic. I would use clever again.", "rating": 5}, {"title": "Kiara Redmond was awesome from…", "text": "Kiara Redmond was awesome from beginning to the end. When I first called Clever Realty they immediately connected me with 3 realtors. All 3 were on the same page but Kiara Redmond stood out the most. We told her exactly what we wanted & she did exactly that expeditiously. I will refer her as well as Clever Realty to my family and friends. Thanks for the great experience. ", "rating": 5}]