[{"title": "My initial phone contact was with…Kendall", "text": "My initial phone contact was with Kendall.  He answered my questions courteously and was pleasant and professional. In my followup call I spoke with Amanda who was equally professional and polite. I am very satisfied, thus far, with the policy guidance and service I've received.  Thank you.", "rating": 5}, {"title": "With one quick call I was able to get…", "text": "With one quick call I was able to get the insurance coverage my wife and I needed for our recently booked cruise.  The AARDY representative was very helpful and friendly.  She found a policy that would meet our needs and went over the details of the policy with us.  I found purchasing our vacation insurance through AARDY very simple.  This is the second time we have used AARDY for our travel insurance and plan to use them for all future travel insurance needs.", "rating": 5}, {"title": "Several things were exceptional…", "text": "Several things were exceptional beginning with the woman who helped me. I am older and wear hearing aids and frequently cannot understand young agents because they talk too fast for me to comprehend. Not so Destiny. She was clear, concise, patient and very helpful. 2. I have used Aardy for travel insurance several times over many years. I like how clear their webpage is. Even a layperson like myself can make comparisons. 3. Destiny obviously had experience selling travel insurance because she was able to explain subtle differences in policies. I feel I am in good hands with these people. ", "rating": 5}, {"title": "Denise", "text": "Setting up the insurance was great with Denise but the rating of insurance should be once you MUST use it.  If it performs and covers you as you expected - if so, then you will get a 5 star rating!  Hard to rate when we are using it or hope not to.", "rating": 4}, {"title": "Very Helpful", "text": "My agent was well informed and gave good answers to my questions.  When I asked for a comparison between 2 policies, she suggested a better one than the 2 I was asking about.", "rating": 5}, {"title": "No Sales Pressure! ", "text": "I have used this site a few times before and have been pleasantly surprised with the use and ease of the process and information provided. No pressure selling, no pressure emails, just a reputable website offering travel insurance options to satisfy your security needs. ", "rating": 5}, {"title": "Great cost comparisons!…", "text": "The site was helpful at comparing various travel plans cost and coverage. Also once I chose a plan it pre loaded all my travel dates, destinations so I didnt have to enter it all again, very helpful!", "rating": 5}, {"title": "Easy to get quotes", "text": "Website is user friendly, simple to get quotes, live agent available to answer questions. Would definitely use AARDY again for travel insurance.", "rating": 5}, {"title": "I had an excellent experience…", "text": "I had an excellent experience purchasing insurance for an upcoming trip to Italy. I was first helped by Amber on the chat who immediately connected me to an agent Shanna and they were both excellent. They help me select the plan at an excellent prize. They guided me through the process and within minutes I received email confirmation with all the details that I needed regarding my policy, including ID cards. I highly recommend this company for travel insurance", "rating": 5}, {"title": "So far, so good!", "text": "Based on my experience researching and talking to a phone customer service person named Kendall, I feel like I made a good decision to buy travel insurance from AARDY.  I won't know anything more about the company until I see how it works out.  Hopefully, I won't need to use the policy.  And, if I need it, I will see how it goes. ", "rating": 5}, {"title": "I had lots of questions regarding…", "text": "I had lots of questions regarding travel insurance especially because I am a senior. Denise was very knowledgeable and was able to lessen my concerns about cost and coverage and advise me to what would be best for me and my travel partner.", "rating": 5}, {"title": "Praise for Katrina and Maranda", "text": "Praise for Katrina and Maranda, who were friendly, professional and knowledgeable. This is the second time I’ve worked with AARDY, and I will not hesitate to do so again", "rating": 5}, {"title": "Sereniti was Great", "text": "Sereniti was informative, knowledgeable, helpful and charming.   There was no sales pressure just answering of all of my questions allowing me to get up to speed with your products and services so I could make an informed decision.  I originally thought I wanted an annual policy (she did not hesitate to refer me to a company AARDY works with who offers annual travel insurance policies) but after my interaction with Sereniti's realized a trip flexi plan would meet my needs.  She took care of my every need. AARDY is a company everyone looking into travel insurance should contactThank you Sereniti YOU ARE GREAT,The Tiens ", "rating": 5}, {"title": "Easy to Review policies.Easy to review various policies and…", "text": "Easy to review various policies and select the best fit. I happened to pick a Travel Insured policy. I got better coverage at a better price than my sister did with the Travel Insured on a different site.", "rating": 5}, {"title": "Shawna was my agent and she was very…", "text": "Shawna was my agent and she was very pleasant to deal with, sent me all the forms I needed, was always available if I needed to speak to her about other issues. She found a policy for my husband and I right away and her follow up was amazing. So happy I had her as my agent", "rating": 5}, {"title": "Very informative and helpful", "text": "He explained the policy to so I understood what I was buying and helped me pick the policy I needed.  He was very polite and informational.  I would certainly purchase my next policy from him.  His name was Peter.", "rating": 5}, {"title": "Miranda in Alabama was excellent", "text": "Miranda in Alabama was excellent in every way helping me make a difficult decision. She was clear, helpful, and patient. An excellent person to make things easier for me. ", "rating": 5}, {"title": "GRATIFYING EXPERIENCE", "text": "After reviewing numerous travel insurances for a cruise, I had the privilege to speak to George at AARDY who was most helpful and polite with all his guidance.  He has so much patience and is the BEST.  I feel I have made the right choice.", "rating": 5}, {"title": "Great customer service! ", "text": "I found this whole process very confusing, but I was able to call your customer service. Melanie helped me so much. She was beyond patient and really gave me so much confidence and peace of mind. So few companies value customer service in this digital age, but I went with Aardy confidently thanks to Melanie. ", "rating": 5}, {"title": "have used AARDY in past", "text": "have used AARDY in past; Satisfied;This time, the link to \"MyAccount\" was expired, it took me 13min, vrs the tokens 10min !   I would suggest they allow more time, or use a website that allows other type login's;  Nonetheless, I would use them again.", "rating": 4}, {"title": "I had a great experience purchasing…", "text": "I had a great experience purchasing travel insurance.  I had the pleasure of working with Christiana who was so helpful with finding the right plan for us.  She helped us find a plan with the coverage we were requesting and a price that we needed.  We were very pleased with her pleasant attitude and friendly disposition.", "rating": 5}, {"title": "A wonderful representative", "text": "Your Representative Destiny was so very pleasant and helpful. She took the time to explain everything making it much easier for me. She is a great asset to your company.", "rating": 5}, {"title": " Great customer service", "text": "I called Aardy earlier in the year and spoke to Denise and got the basic information for trip insurance and when to call back to purchase it.Yesterday I spoke to Amanda and bought separate policies one for me and one for my traveling companion Nancy feller. She was very knowledgeable and answered all my questions. I called back later that evening because I was having trouble printing out my documents and my travel companion did not receive her emails. I spoke to George and he assured me he would resend them and he copied me on my travel companion so just in case she didn't get it I would have the copy. I received them and printed out everything we needed for our trip.", "rating": 5}, {"title": "Spoke over the phone with a…", "text": "Spoke over the phone with a representative and cleared up my questions regarding cost of trip estimates.  She also pointed me to a $500K Med/$1.5M evacuation policy for (wait for it), $96.  Wow.", "rating": 5}, {"title": "Christiana was so knowledgeable and…", "text": "Christiana was so knowledgeable and provided me with answers to all my questions.She also helped me choose the best travel insurance plan to meet my needs for an upcoming trip.She was also the sweetest person to talk to, obviously loves what she does!", "rating": 5}, {"title": "A great representative is key to getting the right Travel Insurance!", "text": "Our need for a Travel Insurance Plan involved having specific coverage for our needs. Sereniti, our AARDY agent, spent all the time needed to explain the differences between all the carriers they offer and together we came up with the right plan. Despite the fact that we then took some additional time to order the plan, (we were adding countries and additional days to our trip), when we got back together she reviewed the details of the plan to ensure we covered all our requirements. Sereniti did a great job.", "rating": 5}, {"title": "Agent was Maranda", "text": "Maranda was very helpful and a pleasure to work with. She is obviously experienced and knowledgeable in her field. I will request her next time. ", "rating": 5}, {"title": "Shauna Saved The Day!", "text": "Shauna saved the day!  I have been struggling with tons of travel insurance plans and info.  The smartest thing I did was call AARDY.  Shauna was so knowledgeable, professional, kind and patient.  She answered all my questions and gave me helpful information that I will need before and during the trip. Shauna is a true asset for your company!  ", "rating": 5}, {"title": "Great support and service!", "text": "Great support and patience provided by Don...Checked all of my current policies to ensure accuracy and generated two additional policies. Awesome service!", "rating": 5}, {"title": "Great experience", "text": "Melanie made the process quick and easy.  Rate was very reasonable and she only gave me the coverage that I needed.  Surprised how easy this would be.", "rating": 5}, {"title": "Helpful and Knowledgeable", "text": "Kendall was knowledgable and thorough with quick answers to all my questions. He was articulate and I could also understand him very well.  He seemed genuinely interested in helping and was not rushing or pressuring me into any decisions.  ", "rating": 5}, {"title": "The policy that I purchased", "text": "The policy that I purchased, IMG, has the best rate and has clear guidelines for coverage.  If I need to file claims, I hope that IMG and AARDY will come through with most care and efficiency.   ", "rating": 5}, {"title": "You guys are great", "text": "You guys are great! You actually answer the phone! Plus when I called during off hours I received a call back within less than an hour of their opening time.", "rating": 5}, {"title": "Hello! I’m relieved. ", "text": "Hello!! Wow!! I feel so much better now. A friend referred us to aardy.com to call for travel insurance. We were so confused and we were not sure which way to go. I called and spoke to a very pleasant woman named AMANDA. Amanda is so well spoken! She answered all of my questions and helped me sort it all out. We chose the best plan for us at an acceptable cost. Thank you for having a quality employee like AMANDA.Appreciated,Glenna & Kenneth Metoyer", "rating": 5}, {"title": "Peter with AARDY was very professional", "text": "Peter with AARDY was very professional, courteous and proficient with helping me decide which policy would best suit my family’s needs. I would highly recommend his help to anyone looking for travel insurance.  ", "rating": 5}, {"title": "Our choice for international travel insurance.", "text": "This is the 3rd time we've used AARDY to help us with international travel insurance. All their representatives have been professional, polite, patient and respond very quickly to our questions. All of that is sincerely appreciated...", "rating": 5}, {"title": "Destiny was GREAT to work with!!!", "text": "The agent on the phone (Destiny) was very patient, knowledgeable, and kind as I tried to understand the differences in the travel insurance policies.", "rating": 5}, {"title": "Denise W = outstanding customer service ", "text": "Denise W simplified the travel insurance decision process. I’ve been inundated with numerous travel insurance options from several companies. Denise listened to which benefits and coverage limits were important to me. She actually recommended 3 policies which met all my requirements. She was patient and answered all my questions and wasn’t hard selling the most expensive option. Ended up with the best coverage option for our European river cruise.", "rating": 5}, {"title": "Knowledgeable agent was greatly appreciated", "text": "Thank you for having such a knowledgeable agent to work with us.  Peter helped us make many decisions to get the best insurance to meet our needs.  It was a pleasure to work with him.", "rating": 5}, {"title": "Everyone was patient and willing to…", "text": "Everyone was patient and willing to answer all my questions and supported my looking at other options before I purchased their product. I worked with Christianna and Kendall.", "rating": 5}, {"title": "Phone agent Destiny was great!", "text": "Rapid quote was nice. I had questions so I called and spoke with Destiny. She answered all my questions with patience and in understandable detail. Her response and professionalism made me feel confident and she was a big reason why I purchased the policy.A great employee!", "rating": 5}, {"title": "Had online chat help to determine best…", "text": "Had online chat help to determine best rate and policy. Very efficient and satisfied with results of selection", "rating": 4}, {"title": "Best service", "text": "I always have the best service Dennise and Vianna, were great and they were very polite and guide you to have the best insurance. ", "rating": 5}, {"title": "Have used them for many years always…", "text": "Have used them for many years always very good prices for top teir insurance.When talking with agent they always have no problem provide quick and multiple quotes to pick from.Alway vey courteous and friedly.", "rating": 5}, {"title": "Easy site to navigate", "text": "Easy site to navigate. Chat agent answered all my questions quickly and accurately. Purchase process was very easy.", "rating": 5}, {"title": "Katrina in the chat and Amanda were…", "text": "Katrina in the chat and Amanda were great. They actually  answered the ques I asked about how the insurance works", "rating": 5}, {"title": "Kendall was absolutely fabulous.", "text": "Kendall was absolutely fabulous.. I run a sales force of 500 people and I would hire him immediately.  I am recommending your company to all of my fellow travelers ", "rating": 5}, {"title": "Christianna was wonderful and explained…", "text": "Christianna was wonderful and explained everything to us. It was good to actually talk to \"a live person\". Great customer service.", "rating": 5}, {"title": "This is my first time to use your…", "text": "This is my first time to use your travel insurance and I was very impressed and satisfied . Your travel insurance agent who helped me was awesome! Very professional and very helpful that’s why I bought my travel insurance right then. ", "rating": 5}, {"title": "Shanna was so helpful to pick the right…", "text": "Shanna was so helpful to pick the right policy for me. I had first spoken with Amanda who was also very helpful. Very nice company with good customer service.", "rating": 5}, {"title": "Peace of mind", "text": "The online options and explanations were clear. The ease of selection and purchase was good. The speed at which I received the confirmation and the detailed plan was excellent and gave me peace of mind.", "rating": 5}, {"title": "Destiny was knowledgeable and patient…", "text": "Destiny was knowledgeable and patient and was able to answer all my questions.  She gave me options and when I wanted to think about it, not a problem.  I called back and she responded very quickly.  Great experience - thank you, Destiny!  ", "rating": 5}, {"title": "Made it easy to buy travel insurance ", "text": "This site made it very easy to research, compare, and purchase travel insurance. I will definitely use again in the future.", "rating": 5}, {"title": "Destiny was very helpful", "text": "Destiny was very helpful, and did not push us on any policy, but rather just explained the differences so it was easy to understand.  She had a very nice talking voice to where it was very easy to understand what she was saying.  She was also very pleasant and kind.  She is the reason I bought my policy today!", "rating": 5}, {"title": "Easy to compare policies", "text": "Easy to compare policies, accurate pricing. Easy to get someone on the phone. Felicia was most helpful.", "rating": 5}, {"title": "Easy to find the best policy for my…", "text": "Easy to find the best policy for my trip. I like the compare feature. I didn't like the too frequent email reminders to choose a policy.", "rating": 4}, {"title": "The only way to make it better would be if it was free", "text": "Clear information, lower rates than the cruise line, higher limits and a fast, effective web site.  ", "rating": 5}, {"title": "The rep asked me questions about my…", "text": "The rep asked me questions about my needs and went through the various options clearly explaining each and the price and requested to choose the one that was suitable to my needs.", "rating": 5}, {"title": "I have purchased travel insurance from…", "text": "I have purchased travel insurance from AARDY for other trips.  They have always been helpful by answering all me questions.  Amanda was an excellent customer rep.", "rating": 5}, {"title": "Ask for Amanda Berg ", "text": "Amanda Berg is professional, easy to speak with and went over everything making it clear and concise. Would definitely recommend! ", "rating": 5}, {"title": "Peter was very thorough", "text": "Peter was very thorough, responsive and extremely kind to work with.", "rating": 5}, {"title": "The representative help me to…", "text": "The representative help me to understand certain terms I was unclear about medical coverage. She was pleasant and knowledgeable. Thank you ", "rating": 5}, {"title": "Great service", "text": "Great customer service from George and Denise!The product is just what we were looking for at a reasonable price.", "rating": 5}, {"title": "George was very helpful", "text": "George was very helpful, very professional! He answered all the questions that I had! ", "rating": 5}, {"title": "Detailed review of the policy coverage…", "text": "Detailed review of the policy coverage and process for claims, if necessary (hope not!!).", "rating": 5}, {"title": "Thanks Denise", "text": "Having Denise to talk with. She understood my needs and carefully found us the perfect insurance. She was efficient and made the process painless!", "rating": 5}, {"title": "Christianna was very patient with me…", "text": "Christianna was very patient with me and answered all my questions. She even looked things up for me to make sure she was giving me correct information. She is friendly and is a pleasure to speak to on the phone.", "rating": 5}, {"title": "Christiana was very personable", "text": "Christiana was very personable, knowledgeable, confident and professional. The same cannot be said for the myIMG website which lists 2 insured, but only provides ID card in 1 name.", "rating": 5}, {"title": "The best travel insurance agency", "text": "George was very informative and most helpful in selecting very good trip coverage.  I wouldn't use any other agency other than yours in the future", "rating": 5}, {"title": "The agent George was just very helpful…", "text": "The agent George was just very helpful and pleasant in recommending the two different policies I purchased and in explaining how it works.", "rating": 5}, {"title": "Excellent Representativez", "text": "Agents answered all questions/concerns re insurance policies thoroughly/ very knowledgeable. Destiny went above and beyond. Very patient and knowledgeable ", "rating": 5}, {"title": "Easy, affordable and comprehensive travel insurance. ", "text": "Peter was extremely helpful with my travel insurance needs. He thoroughly explained the benefits of the policy in a pleasant and professional manner. I would highly recommend going travel insurance through AARDY.", "rating": 5}, {"title": "Great service!", "text": "Peter was the agent I worked with and he was extremely helpful - he made several useful suggestions and answered all my questions!", "rating": 5}, {"title": "Agent was helpful and made great…", "text": "Agent was helpful and made great suggestions on options for insurance", "rating": 5}, {"title": "Easy to follow instructions online…", "text": "Easy to follow instructions online [especially for old people]I called with a question and they were helpful and very nice", "rating": 5}, {"title": "Easy website", "text": "Easy to navigate website.  A varitety of choices with various rates and benefits.", "rating": 5}, {"title": "Just booked.", "text": "Just booked, which was easy with knowledgeable agents, but haven't tried to make a claim!!", "rating": 5}, {"title": "We had many questions", "text": "We had many questions. And Denise was so patient and helpful.   We would recommend to others    Thank you so much ", "rating": 5}, {"title": "Easy to compare all policies available…", "text": "Easy to compare all policies available which come in from different companies.  Prices to fit all budgets and needs and does not give one policy for all.  ", "rating": 5}, {"title": "Peter R was so knowledgeable about all…", "text": "Peter R was so knowledgeable about all aspects of travel insurance. He helped me find the policy that was best for me and answered all of my questions.", "rating": 5}, {"title": "Quick and easy to obtain policy", "text": "Quick and easy to obtain policy. Person on phone easy to understand ", "rating": 5}, {"title": "We worked with Felicia", "text": "We worked with Felicia. She was concise, professional, and easy to work with. She did a great job.", "rating": 5}, {"title": "The agent", "text": "The agent, George, was very kind, informative and trust worthy.", "rating": 5}, {"title": "Destiny - great job", "text": "Destiny is what makes it, She knows her business and speaks clearly and concisely. Second time I have used her.", "rating": 5}, {"title": "Great service!", "text": "Denise was very knowledgeable about what coverage is available and was able to pinpoint the policy that was best for me.  Great service!", "rating": 5}, {"title": "Peter was great", "text": "Peter was great.  He explained coverages so it was easy to understand.  He was not high pressure which made it easy for me to make a decision.", "rating": 5}, {"title": "Easy to shop and compare", "text": "Process was easy with a good selection of options at all price levels. Easy to shop and compare.", "rating": 5}, {"title": "my experience was great", "text": "my experience was great, agent was very helpful and well mannerd", "rating": 5}, {"title": "Kendall was so nice and professional", "text": "Kendall was so nice and professional, explained everything to me did a great job. Credit to your company", "rating": 5}, {"title": "Professional and given details on all…", "text": "Professional and given details on all options in a clear and distinct manner!", "rating": 5}, {"title": "Great option to compare policies", "text": "Great option to compare policies. Adequate information to make a choice.", "rating": 5}, {"title": "Agent was very helpful", "text": "Agent was very helpful. Quick and friendly service in obtaining the coverage I needed. ", "rating": 5}, {"title": "Christiana was great in helping me…", "text": "Christiana was great in helping me obtain my travel insurance.  She is an asset to your Company.", "rating": 5}, {"title": "Questions were answered with easy to…", "text": "Questions were answered with easy to understand examples. ", "rating": 5}, {"title": "Our teamwork allows us to give good…", "text": "Our teamwork allows us to give good results to the client", "rating": 5}, {"title": " Completely covered", "text": "Insurance can be very expensive. This gave me the best options for the money!", "rating": 5}, {"title": "…Best price for the service", "text": "For what you are covered for the price cannot be beat.  Was understandable, clear in what was provided and again great price.", "rating": 4}, {"title": "Instant Customer Service", "text": "Instant customer service when there was a problem and a quick resolution, and, thankfully, no demands for text communication.  Regular email and landline is all I can manage.", "rating": 5}, {"title": "Will send review once we complete our…", "text": "Will send review once we complete our trip next Sept", "rating": 5}, {"title": "Serenity was very patient with me as I…", "text": "Serenity was very patient with me as I asked a lot of questions  ", "rating": 5}, {"title": "Kendall did a great job getting me…", "text": "Kendall did a great job getting me exactly what I needed, and he was quick and efficient!", "rating": 5}, {"title": "Maranda was informative and helpful in…", "text": "Maranda was informative and helpful in every way.  ", "rating": 5}, {"title": "Maranda was so helpful and polite", "text": "Maranda was so helpful and polite, it made getting our travel insurance a pleasant experience. ", "rating": 5}, {"title": "Thank you for sharing this experience…", "text": "Thank you for sharing this experience with me ", "rating": 5}, {"title": "Excellent Service ", "text": "Both agents I worked were pleasant and knowledgeable, very helpful, no pressure, throughout process.", "rating": 5}, {"title": "Thank you ", "text": "Thank you , simple to buy, I use AARDY everytime I travel.  I have not attempted to use a claim so I am not sure if it works easily if I had to.", "rating": 5}, {"title": "It was a simple process", "text": "It was a simple process, put the travel information in, a list of companies, with coverage details and cost is sent, plus the ability to  compare the information side by side to make an informed decision on what policy is best for your needs. ", "rating": 5}, {"title": "It was straight forward and helpful.", "text": "Date of experience: October 30, 2024", "rating": 5}, {"title": "Agent was very patient and helpful.", "text": "Date of experience: November 02, 2024", "rating": 5}, {"title": "It was quick and easy and easy", "text": "It was quick and easy and easy. Shauna was very informative and knowledgeable. ", "rating": 5}, {"title": "Easy to use and convenient", "text": "Easy to use and convenient ", "rating": 4}, {"title": "Immediate response", "text": "Immediate response.  Accurate prices.  No surprises.  Would use them again.", "rating": 5}, {"title": "Web site didn't work well", "text": "Web site didn't work well. The person a spoke to on the phone was very helpful (Denise)", "rating": 4}, {"title": "Easy online quotes.", "text": "It was very easy to use your online quote site. The agent was able to find my quote and set my policy up quickly.", "rating": 5}, {"title": "Simple tool for purchasing traveel insurance", "text": "Great tool to use to compare and purchase travel insurance. ", "rating": 5}, {"title": "Staff service outstanding ", "text": "There was a mix up in my policy at first but staff were able to fix the issue quickly and solve the problems.  I am very happy with the service.", "rating": 5}, {"title": "Quick quote", "text": "Quick quote, easy to navigate site.", "rating": 5}, {"title": "The professionalism and knowledge of…", "text": "The professionalism and knowledge of the representative I spoke with (Amanda) were evident throughout the my call.", "rating": 5}, {"title": "Everyone I spoke to was very helpful and patient.", "text": "My calls were all answered promptly and I was able to communicate very well.", "rating": 5}, {"title": "Peter did a great job of explaining the…", "text": "Peter did a great job of explaining the coverage and answering my many questions. ", "rating": 5}, {"title": "It is very easy to get quotes", "text": "It is very easy to get quotes and find the best option. The quotes are sent to your email so when you are ready to purchase you can find them again. ", "rating": 5}, {"title": "Excellent Service", "text": "Peter explained the details of my policy very well.", "rating": 5}, {"title": "Very good car and beautiful", "text": "Very good car and beautiful ", "rating": 5}, {"title": "Very helpful and very easy to get…", "text": "Very helpful and very easy to get travel ins . Would highly recommend Shanna ! Very helpful ! ", "rating": 5}, {"title": "She was very friendly and knowledgeable.", "text": "She was very friendly and knowledgeable. ", "rating": 5}, {"title": "Best coverage for the money", "text": "Best coverage for the money, easy to understand and simple application process.", "rating": 4}, {"title": "Good service", "text": "Agent was very helpful and reassuring.", "rating": 5}, {"title": "The agent was very knowledgeable and…", "text": "The agent was very knowledgeable and answered all my questions. ", "rating": 5}, {"title": "I haven't used the insurance yet", "text": "I haven't used the insurance yet, so I can't rate it.", "rating": 3}, {"title": "She very helpful and knowledge", "text": "She very helpful and knowledge. Customer services excellent. Thanks ", "rating": 5}, {"title": "KENDELL WAS EXTREMELY HELPFUL", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "Very helpful", "text": "Very helpful, patience and kind. Highly recommended.", "rating": 5}, {"title": " Satisfied Customer ", "text": "The young lady was patient and eager to answer all of our questions. ", "rating": 5}, {"title": "The agent was very informative and the…", "text": "The agent was very informative and the process was quick and simple", "rating": 5}, {"title": "Sereniti", "text": "The representative/agent that I spoke with was very informative, helpful and pleasant. ", "rating": 5}, {"title": "Good experience ", "text": "Offered comprehensive coverage at a reasonable price to Cuba. Not all companies offered coverage to the country. ", "rating": 5}, {"title": "Great Company", "text": "Great Company ", "rating": 5}, {"title": "Christianna was very helpful and…", "text": "Christianna was very helpful and informative in answering my questions about specific coverages and the pre-existing conditions clause.", "rating": 5}, {"title": "My Representative was very clear and…", "text": "My Representative was very clear and ensured I understood paperwork and different plans.", "rating": 5}, {"title": "easy to navigate and compare", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "All 3 agents that I spoke with were…", "text": "All 3 agents that I spoke with were polite and helpful.", "rating": 5}, {"title": "great experience ", "text": "Christina took the time to go over everything. She was great. Made helping me with a decision I needed to make. Would do again. Donna", "rating": 5}, {"title": "They were direct a got me the cheapest…", "text": "They were direct a got me the cheapest price", "rating": 5}, {"title": "Luis was very knowledgeable and helpful…", "text": "Luis was very knowledgeable and helpful in answering all my questions. ", "rating": 5}, {"title": "Jason was very helpful and answered all…", "text": "Jason was very helpful and answered all my questions. ", "rating": 5}, {"title": "Easy to navigate", "text": "Easy to navigate ", "rating": 5}, {"title": "Fast and friendly service", "text": "Fast and friendly service ", "rating": 5}, {"title": "Great service", "text": "Great service ", "rating": 5}, {"title": "The representative we talked to was…", "text": "The representative we talked to was very helpful!!!", "rating": 5}, {"title": "Destiny was amazing", "text": "Destiny was amazing! Really helped me find the right policy.", "rating": 5}, {"title": "Very quick and easy to get a quote", "text": "Very quick and easy to get a quote, compare, and make a purchase.", "rating": 5}, {"title": "User friendly website", "text": "Date of experience: October 28, 2024", "rating": 5}, {"title": "This app is very good love this app…", "text": "This app is very good love this app very well", "rating": 5}, {"title": "The contact person", "text": "The contact person, Amanda, was very knowledgeable and helpful", "rating": 5}, {"title": "Travel", "text": "Amanda and Destiny was GREAT!", "rating": 5}, {"title": "Very Friendly and informative.", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "Very quick with information", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "Traveling 1st time", "text": "The representative answer all my questions and helped me", "rating": 5}, {"title": "Peter was great", "text": "Peter was great. He helped me with what i needed and was very courteous", "rating": 5}, {"title": "EXTREMELY HELPFUL AND NICE", "text": "Date of experience: October 30, 2024", "rating": 5}, {"title": "Kendall was knowledgeable and…", "text": "Kendall was knowledgeable and efficient. He represents you well.", "rating": 5}, {"title": "Quick and helpful.", "text": "Quick and helpful. ", "rating": 5}, {"title": "Travel Insurance Application", "text": "Good prices and very easy to apply for the policy.", "rating": 5}, {"title": "destiny was extremely helpful and…", "text": "destiny was extremely helpful and informative ", "rating": 5}, {"title": "Kendall was a great agent!", "text": "Date of experience: November 01, 2024", "rating": 5}, {"title": "Christianna", "text": "Christianna was very patient and helpful", "rating": 5}, {"title": "Friendly objective comparison of plans without pushing any one underwriter!", "text": "Explanation of plan benefits and objective comparison of various plans.....very helpful!", "rating": 5}, {"title": "all the sales people I spoke with were…", "text": "all the sales people I spoke with were perfect ", "rating": 5}, {"title": "Easy and efficient.", "text": "Date of experience: November 01, 2024", "rating": 5}, {"title": "Aardy", "text": "Great rep, good pricing", "rating": 5}, {"title": "Very easy experience and helpful…", "text": "Very easy experience and helpful representatives.", "rating": 5}, {"title": "Very reliable,I highly recommend.", "text": "Very reliable,I highly recommend. ", "rating": 5}, {"title": "Shanna was amazing", "text": "Shanna was responsive, informed, efficient and gracious. Tremendous customer service.", "rating": 5}, {"title": "Representative was knowledgeable and…", "text": "Representative was knowledgeable and very helpful.  Purchasing travel insurance was quick and informative.", "rating": 5}, {"title": "Easy to compare policies", "text": "Easy to compare policies ", "rating": 5}, {"title": "Representative was extremely helpful…", "text": "Representative was extremely helpful and knowledgeable.", "rating": 5}, {"title": "Destiny was extremely helpful!", "text": "Destiny was extremely helpful! ", "rating": 5}, {"title": "Very informative and helpful.", "text": "Very informative and helpful. ", "rating": 5}, {"title": "Ease of use and great price along with…", "text": "Ease of use and great price along with a great policy.", "rating": 5}, {"title": "Easy to compare plans.", "text": "Date of experience: October 30, 2024", "rating": 4}, {"title": "Very professional", "text": "Very professional, friendly, and knowledgeable.", "rating": 5}, {"title": "Purchased travel insurance", "text": "Purchased travel insurance ", "rating": 5}, {"title": "Satisfied handling of my needs and…", "text": "Satisfied handling of my needs and expectations ", "rating": 5}, {"title": "Sereniti was fabulous and informative", "text": "Date of experience: October 31, 2024", "rating": 5}, {"title": "Knowledgeable and polite", "text": "Date of experience: October 29, 2024", "rating": 5}, {"title": "WAS VERY EASY TO DO!", "text": "Date of experience: November 04, 2024", "rating": 5}, {"title": "Amanda and Aardy a great team…", "text": "Amanda was informative and understood my needs immediately ", "rating": 5}, {"title": "Knowledgeable", "text": "Knowledgeable, patient, informative", "rating": 5}, {"title": "Ease of use.", "text": "Date of experience: November 05, 2024", "rating": 5}, {"title": "Shanna was wonderful and informative", "text": "Date of experience: October 31, 2024", "rating": 5}, {"title": "The representative was extremely…", "text": "The representative was extremely helpful!!!", "rating": 5}, {"title": "Very polite and professional.", "text": "Very polite and professional. ", "rating": 5}, {"title": "It was very quick and easy.", "text": "It was very quick and easy. ", "rating": 5}, {"title": "Excellent representative", "text": "Excellent representative ", "rating": 5}, {"title": "Excellent customer service!", "text": "Excellent customer service!  ", "rating": 5}, {"title": "Engineer ", "text": "Professional ", "rating": 5}, {"title": "Courteous & knowledgeable representative", "text": "Courteous & knowledgeable representative ", "rating": 5}, {"title": "It was very easy", "text": "Date of experience: October 30, 2024", "rating": 5}, {"title": "Clear explanation", "text": "Date of experience: October 25, 2024", "rating": 5}, {"title": "Ron the best", "text": "Date of experience: October 29, 2024", "rating": 5}, {"title": "Christiana was very helpful", "text": "Christiana was very helpful. She was pleasant and did a good job of explaining the policy. ", "rating": 5}, {"title": "My Agent", "text": "My Agent, Peter, was outstanding!Professional and personable. I enjoyed our conversation and the clarity that he provided. I will enjoy my upcoming trip without worry!", "rating": 5}, {"title": "The agent that assisted me was Denise", "text": "The agent that assisted me was Denise, she was very helpful and answered all of my questions ", "rating": 5}, {"title": "Great experience", "text": "Great experience. Went on line then called. Felicia helped me and she was very helpful and pleasant.", "rating": 5}, {"title": "Christianna was very helpful", "text": "Christianna was very helpful, patient and friendly. Price was competitive ", "rating": 5}, {"title": "Peter was professional and efficient", "text": "Peter was professional and efficient! You are lucky to have him on board!", "rating": 5}, {"title": "Easy to use...easy to view", "text": "Easy to use...easy to view. I was grateful for it to have been so simple.  I'll use it again with upcoming travel.  ", "rating": 5}, {"title": "I have used your service 3 times now…", "text": "I have used your service 3 times now and the communication is wonderful. Worked with Destiny today who was very clear, easy to understand and answered all of my questions with ease. ", "rating": 5}, {"title": "She was very exemely nice and new the policy…", "text": "She was very nice and new the policy and the product I was unquiring about extremely well.I felt her pure honesty and knowledge about the product I was purchasing.  And she answered all my questions. ", "rating": 5}, {"title": "The agent was very patient and…", "text": "The agent was very patient and explained the plans in detail.  Answered all questions.", "rating": 5}, {"title": "telephone call", "text": "destiny was very professional and knowledgeable and polite. made getting insurance a good experience.  ", "rating": 5}, {"title": "Clear information and options were…", "text": "Clear information and options were provided that I was not aware of.  ", "rating": 5}, {"title": "Destiny", "text": "Destiny, the representative was attentive and clear. She was quite reassuring and pleasant.", "rating": 5}, {"title": "It was easy to access the website and…", "text": "It was easy to access the website and get the necessary paperwork done to make sure we are safe on our trip to Las Vegas next month. ", "rating": 5}, {"title": "Christiana was excellent", "text": "Christiana was excellent. She compared many policies for me to find the right one. She was a delight to talk with.", "rating": 5}, {"title": "Travel Insurance made easy", "text": "Easy to narrow down my search for travel insurance.", "rating": 5}, {"title": "Peter was very helpful.", "text": "Peter was very helpful. He explained everything", "rating": 5}, {"title": "I just purchased the policy and it was…", "text": "I just purchased the policy and it was an easy process. The real good review depends on if there is a claim and how that is handled by the company.", "rating": 5}, {"title": "The system summarized all the different…", "text": "The system summarized all the different options which allowed me to select a travel insurance that fit my needs.", "rating": 5}, {"title": "Website is very user friendly", "text": "Website is very user friendly, quickly generates travel insurance company options, includes prices and benefits, and made the whole selection process quick and easy. ", "rating": 5}, {"title": "Shawna was very helpful", "text": "Shawna was very helpful. Described the policies and provided lots of information on two additional policies one for my son and daughter-in-law and one for my daughter and son-in-law excellent service.", "rating": 5}, {"title": "The representative I spoke with via…", "text": "The representative I spoke with via telephone, Katrina, was so very nice, polite and helpful in answering my questions. This is what made me decide and call her back to purchase the travel insurance plan", "rating": 5}, {"title": "My experience with your company was…", "text": "My experience with your company was excellent.   I am a senior citizen and worried about how to get cruise insurance.  Your representative, Peter made the process quick and easy in a way I could understand.  I will definitely contact your company again for any future needs.  Thank you!", "rating": 5}, {"title": "Great Live Chat", "text": "Immediate live chat with clear explanations of insurance terms.", "rating": 5}, {"title": "Rep was helpful and listen to us very…", "text": "Rep was helpful and listen to us very well we had several issues in trying to select the right policy and she was very patient", "rating": 5}, {"title": "Peter ", "text": "Peter Explained everything about the policy, step by step.Thank you ", "rating": 5}, {"title": "Reviewed all options and costs", "text": "Reviewed all options and costs. Answered all with patience and professionalism.Felicia was most helpful.", "rating": 5}, {"title": "The online search for the right…", "text": "The online search for the right insurance policy for our trip was easy and fast.  ", "rating": 5}, {"title": "I worked with Amanda B and she helped…", "text": "I worked with Amanda B and she helped me navigate the insurance coverage issues I had. ", "rating": 5}, {"title": "Easy to do! Easy Format to work with.", "text": "Easy to do!Easy Format to work with", "rating": 5}, {"title": "Jason did a fine job answering all mu…", "text": "Jason did a fine job answering all mu questions.  ", "rating": 5}, {"title": "Peter and Christiannna made the process…", "text": "Peter and Christiannna made the process so easy. They were very informative along with offering great value. ", "rating": 5}, {"title": "Best place to buy insurance from", "text": "Easy of use and options provided are unbeatable. ", "rating": 5}, {"title": "Easy to navigate", "text": "Easy to navigate ", "rating": 5}, {"title": "The agent was very respectful, yes", "text": "The agent was very respectful, knowledgeable and answered all my questions ", "rating": 5}, {"title": "Christianna was super helpful", "text": "Christianna was super helpful! She walked me through the policy parameters and answered all my questions. Thank you for offering this service and for having such wonderful agents like Christianna.", "rating": 5}, {"title": "Above and beyond service. ", "text": "Agent George was excellent. He was very friendly and knowledgeable. As a retired insurance agent I was impressed with his interaction with me. ", "rating": 5}, {"title": "My agent was receptive to my needs and…", "text": "My agent was receptive to my needs and was very helpful", "rating": 5}, {"title": "Miranda was very knowledgeable", "text": "Miranda was very knowledgeable, polite and helpful. ", "rating": 5}, {"title": "was easy and inEasy travel insurance to select plan", "text": "was easy and informative to select plan", "rating": 5}, {"title": "Felisha was very helpful", "text": "Felisha was very helpful, she took care of our problem. ", "rating": 5}, {"title": "Choice And Comparison", "text": "Good choice, and the comparison feature makes it easy to select what you need. ", "rating": 5}, {"title": "Easy and better offer than others", "text": "Date of experience: October 20, 2024", "rating": 5}, {"title": "This is the 3rd time I used AARDY for…", "text": "This is the 3rd time I used AARDY for my travel insurance needs. It is my go to. Serenti was great and she knew her product.  Also, she had great customer service skills.  My interactions with previous customer service representatives has also been great.  Keep up the good work.  ", "rating": 5}, {"title": "I recently used AARDY.", "text": "I recently used AARDY to compare insurance policies before my two-week trip to Italy. I was looking for coverage against unexpected situations like flight cancellations and medical expenses. The process was simple: I entered my trip details, and AARDY quickly provided several options. I could compare policies from different insurers and choose the best one that fit my budget. In the end, I found a great plan at a competitive price. The service is truly impressive, and I’m very satisfied with my choice! I recommend it to all travelers!", "rating": 5}, {"title": "Fast", "text": "Fast, easy and reasonable in price", "rating": 5}, {"title": "Insurance coverage answers!", "text": "They thoroughly answered my questions and followed through with me on my concerns.  Very pleased with the service.", "rating": 5}, {"title": "Professional", "text": "Telephone person was very competent and friendly and knew her products.  And was informative about the important parts of the travel insurance.", "rating": 5}, {"title": "Lots of research before finding AARDY", "text": "Did a ton of research for travel insurance and finally found AARDY.Maranda listened to my needs and helped me by suggesting the best policy that fit my needs. Will use AARDY again as this is the first trip of many. Thank you Maranda!", "rating": 5}, {"title": "Agents with AArdy know a lot about…", "text": "Agents with AArdy know a lot about travel insurance. Very nice as well.", "rating": 5}, {"title": "Obtaining a quote was painless and…", "text": "Obtaining a quote was painless and great cost insurance was offered among many options.", "rating": 5}, {"title": "Great website with useful travel insurance option", "text": "Jason was a superb help. He answered all my questions and with great details that assured me of what I needed to know for the trip and making sure that I had adequate coverage to address my concerns and needs. It was a place with great information choices, and policy selections, and I was very thankful to be able to get the coverage that I was looking for and have it all taken care of as of today.", "rating": 5}, {"title": "Excellent customer service and choice of policies", "text": "Kendall was very helpful and answered all of my questions succinctly.", "rating": 5}, {"title": "price and easy  enrollment", "text": "Date of experience: October 24, 2024", "rating": 5}, {"title": "Fantastic Agent!", "text": "My agent was great - friendly, efficient & helpful!", "rating": 5}, {"title": "Your rep did Great customer servicean out job…standing", "text": "Your rep did an outstanding job servicing my needs.", "rating": 5}, {"title": "Kendall was great", "text": "Kendall was pleasant, helpful, knowledgable and understood what I needed.", "rating": 5}, {"title": "Great prices and customer service ", "text": "Great prices, prompt response to email questions. ", "rating": 5}, {"title": "Great customer service and detailed…", "text": "Great customer service and detailed information from agent. ", "rating": 5}, {"title": "So easy to get insurance and peace of mind", "text": "We needed cruise insurance and it was so easy and cost effective", "rating": 5}, {"title": "Denise was knowledgeable and a pleasure…", "text": "Denise was knowledgeable and a pleasure to speak with.", "rating": 5}, {"title": "timely and accurate information.", "text": "Date of experience: October 16, 2024", "rating": 5}, {"title": "Agent was very knowledgeable and helpful", "text": "Agent was very knowledgeable and helpful ", "rating": 5}, {"title": "Better benefits", "text": "The price was good and the benefits were better than going through the cruise line.", "rating": 5}, {"title": "Travel Insurance ", "text": "AARDY had the coverage I was for at a great price.  The other companies I researched wanted $2,000 more ", "rating": 5}, {"title": "I felt the agent was genuinely…", "text": "I felt the agent was genuinely answering my questions and not trying to make a sale.", "rating": 5}, {"title": "helpful", "text": "the agent listened to my questions and answered them in a professional manor", "rating": 5}, {"title": "Amanda was an amazing representative", "text": "Amanda was an amazing representative, who was gracious in her explanation of plans and my ignorance of the insurance world.  She guided me through patiently and expertly, explaining each eligible and appropriate plan. Since traveling with SIL from another state, she was able to zig zag back and forth with plans best for each of us. I wish all reps were like Amanda.", "rating": 5}, {"title": "Amanda was extremely helpful and even…", "text": "Amanda was extremely helpful and even helped me save some money.  She explained the documents I would need and the emails I would be receivingThank you so much Amanda!!", "rating": 5}, {"title": "Prices were better than other sites", "text": "good prices", "rating": 5}, {"title": "Agent found our information quickly", "text": "Agent found our information quickly, and completed the purchase our the travel insurance accurately and efficiently ", "rating": 5}, {"title": "Extremely Helpful", "text": "I first talked with George.  He was very helpful and answered a lot of questions as I was attempting to compare with other companies.  I was not ready to make a decision.   I called back later and talked with Kendall. He was able to pull up my info which George had entered and with a few more questions, he took care of entering all my info and processed  my payment.  So easy.  Now if I have a problem with my trip, I hope the service and results will go as well as the initial setup.  ", "rating": 5}, {"title": "It was a pleasure working with Shanna", "text": "It was a pleasure working with Shanna. She answered all my questions.", "rating": 5}, {"title": "It was easy", "text": "Christina J and Felicia F Customer Service managers were really helpful and patient with me.  They made the process of understanding and purchasing travel insurance.", "rating": 4}, {"title": "Lady who answered phone was very…", "text": "Lady who answered phone was very pleasant and helpful.", "rating": 5}, {"title": "Peter did a great job educating me…", "text": "Peter did a great job educating me regarding travel insurance and helped me get what I was looking for.", "rating": 5}, {"title": "Recommended and Would Use Again", "text": "I always use Aardy when shopping for travel insurance for trips, especially out-of-country trips including cruises. I recommend everyone get such insurance because it doesn't cost a lot and can save you lots of pain if something goes awry. I always recommend Aardy, too. Products are good, support is excellent, sales and service folks know their stuff, are helpful, and prompt.", "rating": 5}, {"title": "Explained all my questions.", "text": "Date of experience: October 25, 2024", "rating": 5}, {"title": "Very nice", "text": "Very nice, professional and helpful to assure travel insurance was completed properly. Top ratings !!!", "rating": 5}, {"title": "Working with AARDY and my agent was a great experience.", "text": "Miranda, the agent I spoke with was excellent! She was very professional and knowledgeable about the policies. This allowed me to choose the best one that will work for me. She explained the basic policy and add Ons. She was very patient with answering my questions.I really liked having the opportunity to work with a company that offers so many options.", "rating": 5}, {"title": "I had the need for Cruise Travel…", "text": "I had the need for Cruise Travel Insurance and Miranda M. handled all the inquiry promptly.She was very knowledgeable regarding my request and handled all my questions. Excellent Job!!!", "rating": 5}, {"title": "Amanada was great to work with and very…", "text": "Amanada was great to work with and very knowledgeable on the different insurance coverage.She gave me peace of mind with my decision and made the process go very smoothly.She is a great asset to your company!", "rating": 5}, {"title": "Amanda was extremely helpful", "text": "Amanda was extremely helpful, knowledgable, and fun to visit with while getting all the information I needed and got right to the point of ordering my insurance in an extremely short amount of time.  She must have been trained by a wonderful person, Luis!  I like how Aardy was able to answer the phone right away and I was not put on hold.  ", "rating": 5}, {"title": "Denise was very helpful and professional", "text": "Denise was very helpful and professional ", "rating": 5}, {"title": "Miranda was very very helpful", "text": "Miranda was very very helpful. Thank you!", "rating": 5}, {"title": "Aardy agents are knowledgeable about…", "text": "Aardy agents are knowledgeable about the ins and outs of the different insurance plans", "rating": 5}, {"title": "I compared several companies for travel…", "text": "I compared several companies for travel insurance.  AARDY had the best price for what I need.", "rating": 5}, {"title": "I was very thankful to speak to a…", "text": "I was very thankful to speak to a knowledgeable English speaking helper.", "rating": 5}, {"title": "The agent was wonderful !", "text": "The agent was wonderful !! She listened to my concerns and needs and suggested the policy that was best for me. She was very knowledgable and honestly a pleasure to wor k with. Bravo!", "rating": 5}, {"title": "Will Never Buy From Cruise Again", "text": "Website easy to maneuver through. Signing up was easy. Loved that there were multiple companies and levels to reseach to make informed decision.", "rating": 5}, {"title": "EASY PURCHASE OF POLICY", "text": "Great array of options with thorough explanation of benefits. Made shopping and comparisons easy.", "rating": 5}, {"title": "Great Customer Assistance", "text": "Melanie was terrific! She connected me up with the same insurance as our traveling companions had.  She did offer another option but was very helpful explaining the differences and reasons to buy the same insurance program.  Very happy so far.  Hope we don't need to use them.", "rating": 5}, {"title": "Review of aardy.com", "text": "The site was easy to navigate and had valuable information about choosing travel insurance.", "rating": 5}, {"title": "It was quite easy to get quotes", "text": "It was quite easy to get quotes. You could select what you wanted and compare and if you have questions they have a chat that will answer them for you . So as far as getting insurance it was simple. ", "rating": 4}, {"title": " Just what we were looking for.", "text": "Easy to understand. Prices are great!", "rating": 5}, {"title": "Our travel advisor", "text": "Our travel advisor, Denise, was super helpful. We especially appreciated her thorough answers to our many questions. She also explored different options for us. ", "rating": 5}, {"title": "Thank You Serenity!", "text": "I was having an issue with filling out my request for travel insurance on line. I called the help center and was pleasently welcomed by Sereniti. She was courteous and very helpful! She actually found the application that I had started to fill out and continued to complete the information for me. She also helped me navigate through the various company options for the insurance. I made my informed decision and purchased a policy immediatley through Sereniti. It is a breath of fresh air to talk to someone so helpful. Thanks", "rating": 5}, {"title": "I worked with Serenty to secure my…", "text": "I worked with Serenty to secure my insurance. She was pleasant, thorough and helpful. She took the time to answer all my questions and to explain the plan in detail.", "rating": 5}, {"title": "Very efficient and easy to follow app…", "text": "Very efficient and easy to follow app thank you ", "rating": 5}, {"title": "The person I spoke with (Denise)…", "text": "The person I spoke with (Denise) reviewed my application and confirmed the information. She was very helpful.", "rating": 5}, {"title": "Very knowledgeable and quick", "text": "Date of experience: October 24, 2024", "rating": 5}, {"title": "Clear information and great customer…", "text": "Clear information and great customer service.  Miranda did an excellent job assisting me.  ", "rating": 5}, {"title": "I am 86 years old and have had problems…", "text": "I am 86 years old and have had problems in the past with health insurance with pre-existent conditions. If I understand the IMG policy correctly, they have outlined provisions for allowing pre-existent conditions, which allows me the assurance that I will have health coverage when traveling in Europe.", "rating": 5}, {"title": "Very easy to purchase and get necessary…", "text": "Very easy to purchase and get necessary information.Denise was professional and efficient.", "rating": 5}, {"title": "Maranda was excellent answering my many questions and helped to customize a plan for me. Thank you!", "text": "Maranda was excellent answering my many questions.", "rating": 5}, {"title": "Thank You", "text": "Destiny was so informative and very helpful in creating a plan that fits my needs and my budget!  Thank you.", "rating": 5}, {"title": "Amanda was very helpful with answering…", "text": "Amanda was very helpful with answering all our questions and guiding us to the best policy for us.", "rating": 5}, {"title": "Christianna was very courteous", "text": "Christianna was very courteous. She was knowledgeable about the products, and made sure I understood what I was buying and all my questions were answered.", "rating": 5}, {"title": "It was a good experience from the…", "text": "It was a good experience from the beginning to the end good job", "rating": 5}, {"title": "Christianna was very patient and…", "text": "Christianna was very patient and helpful.  Great experience!", "rating": 5}, {"title": "Serenity was very patient and…", "text": "Serenity was very patient and knowledgeable. Took time to answer all of my questions. ", "rating": 5}, {"title": "Agent provided great service", "text": "Agent provided great servic", "rating": 5}, {"title": "Destiny answered all of our questions", "text": "Destiny answered all of our questions. She was very knowledgeable and professional.", "rating": 5}, {"title": "AARDY TRAVEL INSURANCE ", "text": "Your representative George, was very professional and extremely helpful.  Not having purchased travel insurance before, I had made some mistakes on my original order.  He was very patient and understanding.", "rating": 5}, {"title": "Outstanding Customer Service", "text": "AARDY gave me a number of policies to choose from and I found their prices to be slightly lower than the options presented by my travel agent.  The key differentiator was the outstanding customer service I received.  My calls were answered immediately, by agents located in the US.  They were extremely friendly and knowledgeable.  When I needed to call back to make a change they were incredibly responsive.  Furthermore, rather than pushing me to purchase and review my policy online, they actually encouraged me to do it over the phone so they could answer any questions real time.  In 2024 this level of service is virtually extinct.  It was a real treat working with AARDY.", "rating": 5}, {"title": "Very user friendly!", "text": "Very user friendly. Able to easily search for a reasonably priced policy that met our needs.", "rating": 5}, {"title": "George the agent was patient and…", "text": "George the agent was patient and answered all my questions completely", "rating": 5}, {"title": "AARDY has been my go too for travel…", "text": "AARDY has been my go too for travel insurance for years. Always a no hassle, super easy  experience. Love that you show recommendations.", "rating": 5}, {"title": "Don't leave home without it!", "text": "This is my second experience with AARDY. Denise was helpful and thoroughly explained all details and answered all questions.The \"Travel Insurance 101\" tab on the website is a good tool and helped me to better understand what to ask for before getting on the phone. The chat feature was also useful.", "rating": 5}, {"title": "very satisfied", "text": "Very easy to understand. Helpful,thorough and informative. Denise did an excellent job at making me feel comfortable with my decision", "rating": 5}, {"title": "Left message", "text": "Left message. Phone call promptly returned. ", "rating": 5}, {"title": "Great service", "text": "Date of experience: October 24, 2024", "rating": 5}, {"title": "Speaking with Amanda and Kristiana was…", "text": "Speaking with Amanda and Kristiana was great experience. Both professional and helpful… no question left unanswered. Would highly recommend your services. Many many thanks.", "rating": 5}, {"title": "Ease of purchase and advice..", "text": "Date of experience: October 24, 2024", "rating": 5}, {"title": "Very easy & quick", "text": "Very easy & quick. Answered many questions that I had.  Endorsed by AARP.", "rating": 5}, {"title": "very helpful", "text": "Date of experience: October 16, 2024", "rating": 5}, {"title": "They are knowledgeable and straight forward with their dealings.", "text": "They are knowledgeable with their product and easy to deal with.", "rating": 5}, {"title": "Excellent customer service!", "text": "Miranda was extremely helpful and provided all the details necessary. Excellent customer service! I would definitely recommend. ", "rating": 5}, {"title": "Made it easy to choose the best policy…", "text": "Made it easy to choose the best policy for my circumstances", "rating": 4}, {"title": "Easy, clear, helpful", "text": "Clearly written description of policy benefits, cost, company.", "rating": 5}, {"title": "Great customer service!", "text": "The willingness to help, knowledge and excellent customer service provided.I called almost at closing time 9:57 P.M. and was afraid nobody would be able to assist me at that time. Peter helped and guided me, he was patience and polite. I was able to purchased insurance for our upcoming trip without any hassle. Again, thank you Peter!", "rating": 5}, {"title": "I had a variety of choices and all…", "text": "I had a variety of choices and all choices included the total policy information. ", "rating": 5}, {"title": "Great customer service!", "text": "Great customer service with all questions answered from Kendall and Denise", "rating": 5}, {"title": "The representative was very patient and…", "text": "The representative was very patient and informative when explaining the policy.", "rating": 5}, {"title": "Amanda was amazing and so helpful with…", "text": "Amanda was amazing and so helpful with my travel insurance for my upcoming trip. She provided insight information and guided me to the best plan for me. ", "rating": 5}, {"title": "Easy to use", "text": "Easy to use. Compare a number of policies at once", "rating": 5}, {"title": "I was in need of a travel insurance for…", "text": "I was in need of a travel insurance for my mother. Amanda was a great help me with all my needs. She is kind, knowlagable and very helpful.", "rating": 5}, {"title": "Peter was amazing!", "text": "Peter was absolutely awesome.  He was patient and gracious answering my many questions and helped me find the best plan for my trip.  Will definitely use your services again!", "rating": 5}, {"title": "The agent was very knowledgeable about…", "text": "The agent was very knowledgeable about the Travel policies.  She walked me through all my questions and explained everthing thouroughly.  Also she was very pleasant and polite.", "rating": 5}, {"title": "I called to get travel insurance and…", "text": "I called to get travel insurance and the agent, Denise, was very helpful and already had some of my personal info from previous insurance purchases. Fairly quickly and very smooth tp make the purchase.", "rating": 5}, {"title": "Excellent Customer Service", "text": "The follow up and  professional assistance given to me by Sereniti B. was extremely helpful. This is the type of company that I like to do business with. ", "rating": 5}, {"title": "Excellent!", "text": "Excellent!Destiny was awesome!", "rating": 5}, {"title": "Excellent plans and customer service", "text": "Peter R was professional, friendly and knowledgeable when I first spoke to him Oct 11th. He sent an email for the plan best for me. I subsequently called back and spoke to Peter today, reviewed the IMG plan again and made the purchase. Excellent customer service. Thank You Peter", "rating": 5}, {"title": "Sereniti was kind thorough and…", "text": "Sereniti was kind thorough and professional. She walked us through the information and helped us choose a policies that will suit our needs. ", "rating": 5}, {"title": "Met needs at fair price", "text": "Met needs at fair priceSereniti attentive and calming, reassuring", "rating": 5}, {"title": "Purchasing travel insurance. ", "text": "Amanda was extremely pleasant, patient,and helpful. Her explanations about the choice of options were clear and to the point. Now I can enjoy my vacation knowing that the bases are covered.", "rating": 5}, {"title": "Peter helped me and he was wonderful", "text": "Peter helped me and he was wonderful.  I have used them before . They are very reasonable and collect funds as you go so if you cancel the trip before you pay for it then you don't pay for any costs you have not not spent. ", "rating": 5}, {"title": "Purchased trip insurance", "text": "Maranda was most helpful in helping me purchase a travel insurance policy for my upcoming trip.  She explained it all so it made it easy for me to understand.", "rating": 5}, {"title": "Great price for my cruise insurance", "text": "Great price for my cruise insurance.  I pray I will not need it, but it is comforting to know that I have it.  ", "rating": 5}, {"title": "Easy to get the information", "text": "Easy to get the information ", "rating": 5}, {"title": "The agent was efficient!", "text": "The agent was personable, professional, respectful and efficient.", "rating": 5}, {"title": "Courteous and informative very helpful ", "text": "Courteous and informative ", "rating": 5}, {"title": "AAA+ Service", "text": "Shana gave me AAA+ service on my recent travel insurance purchase.  She was available on-line and on the phone when I had questions, and knew the ins and outs of all your plans and options. She took good notes on our conversations so that we did not have to start from scratch every time we touched base. Most of all she was very personable, patient and flexible with me as I purchased travel insurance    for the first time.  George Rand ", "rating": 5}, {"title": "Amanda B", "text": "Amanda B. is fantastic!! She spent time going over the various quote and explaine the coverages. I even canceled a policy I had purchased on 10/21/2024 with a competitor to purchase the policy with her. ", "rating": 5}, {"title": "Ease of use and price!", "text": "Date of experience: October 23, 2024", "rating": 5}, {"title": "Great team effort!", "text": "My chat with Katrina was helpful and answered my initial questions and then referred me to an agent, George, who provided more details about the policy. Together they made the process easier.", "rating": 5}, {"title": "I won’t know how positive this company…", "text": "I won’t know how positive this company is until I actually travel with them. It seemed to go well with applying process.", "rating": 4}, {"title": "I knew I needed insurance for an upcoming trip", "text": "I knew I needed insurance for an upcoming trip.  Along with providing a list of various plans, the agents explained quite a bit about some of the particulars of obtaining insurance.  I spoke with two helpful agents.  One explained the plans and the other helped me purchase the plan.", "rating": 5}, {"title": "Great Insurance!", "text": "The website was easy to navigate and clearly detailed the different travel insurance policies along with their costs. After deciding on the right one for us, the selection and processing were quick. I would highly recommend this site to meet your travel insurance needs.", "rating": 5}, {"title": "We have used Aardy multiple times", "text": "We have used Aardy multiple times. Each time they have provided a great service. Destiny, their phone representative, was helpful, knowledgeable and very informative.", "rating": 5}, {"title": "Medical ", "text": "Pleased with experience. Questions answered and price doable. Writing this pre travel, fingers crossed we won’t need any assist . ", "rating": 5}, {"title": "Great Customer Service", "text": "Peter and Kendall were both knowledgeable and personable. Peter answered all of my questions and explained the policy coverage, and Kendall put me at ease and asked for help when he needed it,I will use ARRDY in the future and recommend it to all my family and friends.", "rating": 5}, {"title": "It was a breeze to apply for a travel insurance", "text": "Very straight forward and clear numbers with their coverages. Hope we won't need it. But if we'll do, I hope, it'll be easy to claim it.", "rating": 5}, {"title": "I didn’t like that I couldn’t customize…", "text": "I didn’t like that I couldn’t customize my coverage—I don’t need overseas medical, just medevac and cancellation/interruption insurance. My regular insurance pays for overseas coverage. ", "rating": 3}, {"title": "Peter R", "text": "Peter R. was recommended to me by a friend and he was extremely helpful and answered all my concerns in a professional manner snd knowledgeable. Highly recommend him.", "rating": 5}, {"title": "Peter did a great job", "text": "Peter was very helpful and explained everything clearly.", "rating": 5}, {"title": "Simple to purchase", "text": "Quick and easy to purchase insurance.", "rating": 5}, {"title": "Helped Make a Daunting Task Easier", "text": "I spent considerable time shopping for the insurance for our trip.  The Aardy marketplace website made it easy to view offerings from different insurance providers and it made a recommendation on which best matches our needs.  The Aardy agent Destiny was very professional, friendly and knowledgeable which made the purchase process run smoothly.", "rating": 5}, {"title": "It was easy to navigate", "text": "It was easy to navigate ", "rating": 5}, {"title": "Very easy to get quotes", "text": "Very easy to get quotes. Questions answered within the home screen. Multitude of quotes given, offering a wide range of options. ", "rating": 5}, {"title": "Clear explanations without excessive…", "text": "Clear explanations without excessive details. Thank you Miranda and Kandell!", "rating": 5}, {"title": "Travel visa", "text": "Service was quick and easy, haven’t used the visa yet, I will know better in a couple of weeks if the service was great.  ", "rating": 5}, {"title": "Travel Insurance PurchaseOn October 21", "text": "On October 21, 2024, I purchased a policy on the phone with Don.  I had done research before, however he advised I buy a policy that saved me $200. The process for buying was very easy. On October 22, 2024, I spoke to Peter as I couldn't find information about the pre-existing conditions waiver.  He had us both looking at the policy, and he directed me to the correct page.I am very happy that both people spoke English, and the connections were excellent, and all my questions were answered!", "rating": 5}, {"title": "Large number of companies reviewed", "text": "Large number of companies reviewed.  Alway pleasant folks to ask online questions regarding your specific needs.  They will give suggestions/recommendations without putting any pressure on you for immediate decisions.", "rating": 5}, {"title": "amada helped me purchase plan", "text": "amada helped me purchase plan, easy and she explained everything", "rating": 5}, {"title": "Christianna was fantastic", "text": "Christianna was fantastic! She was able to help me find the exact policy we needed at a cost we thought was great. She was so friendly and helpful and we will definitely use AARDY for our future travel needs. ", "rating": 5}, {"title": "Easy to get info", "text": "Easy to get info. via 1-800 number.  Peter was easy to talk to and very forthcoming answering all my questions.  This was a very good experience!  I did purchase my travel insurance on this call. ", "rating": 5}, {"title": "Choices & reasonable prices", "text": "Choices & reasonable prices.  Easy to understand.  Questions answered.  ", "rating": 5}, {"title": "Many options.", "text": "Many options. ", "rating": 5}, {"title": "Great rep", "text": "Great rep, professional and knowlegable assistance ", "rating": 5}, {"title": "Piece of mind", "text": "Your Representative Kendall was OUTSTANDING! Extremely knowledgeable and professional", "rating": 5}, {"title": "Felicia was extremely professional", "text": "Felicia was extremely professional, helpful, patient, and well versed in the product. She answered all my questions.", "rating": 5}, {"title": "AARDY", "text": "This customer service representative, Shanna, was so patient and kind. She made us feel at ease and answered all of our questions.  Her explanations to our questions is what made us sign up for our policy right then and there. When we compare other policies based on our need, it seemed this was the right one for us.", "rating": 5}, {"title": "Jason was very polite and calm and…", "text": "Jason was very polite and calm and patient", "rating": 5}, {"title": "Easy to use", "text": "Easy to use.  Explanation of coverage is clear without all the legalese wording.", "rating": 5}, {"title": "AARDY saved time & money.", "text": "AARDY offered good coverage options at competitive prices.  Our agent, Christianna, was friendly, helpful, and knowledgeable.", "rating": 5}, {"title": "Just purchased travel insurance from…", "text": "Just purchased travel insurance from Destiny,who answered all my questions with patience and professionalism.  Hopefully, we will not have to file any claims", "rating": 5}, {"title": "Ease of site use", "text": "Date of experience: October 21, 2024", "rating": 5}, {"title": "Kendall was professional", "text": "Kendall was professional, informative and personable.  Very helpful and made it easy to understand, as to how things work,", "rating": 5}, {"title": "The agent was personable and efficient", "text": "Date of experience: October 21, 2024", "rating": 5}, {"title": "Getting the quote was very easy as the…", "text": "Getting the quote was very easy as the best company was listed on top.", "rating": 5}, {"title": "I was walk through the process…", "text": "I was walk through the process step-by-step. I appreciate that.", "rating": 5}, {"title": "yes very well", "text": "Date of experience: October 21, 2024", "rating": 5}, {"title": "very easy to work with.", "text": "Date of experience: October 21, 2024", "rating": 5}, {"title": "Expert assistance", "text": "Destiny was very helpful in explaining the different policies based on the type of insurance I was looking for.", "rating": 5}, {"title": "Christiana was a great help!…", "text": "I worked with Christiana and she helped me find the best policy and advised me what to do pre-purchase. Once I had received what Christiana advised, I called her back to purchase the policy. Christiana was busy but called me back promptly. Christiana explained everything in detail so I am happy with my choice and her service was outstanding! Nearing the end of our conversation the connection died. I eventually hung up and was pleasantly surprised when Christiana called me back to tell what had happened. Great service.Thank you! I always recommend AARDY to my family & friends.", "rating": 5}, {"title": "Great options", "text": "Your company offered 23 different options for trip insurance. I explained our wants and needs to Jason and he researched the different policies and recommended the best one for our needs.He was very informative and clear with his communication.", "rating": 5}, {"title": "Christianna was well informed", "text": "Christianna was well informed, and explained things clearly and helpfully.", "rating": 5}, {"title": "Talking to Jason was easy", "text": "Talking to Jason was easy. Everything was explained. I feel good about what we worked out.", "rating": 5}, {"title": "Easy to navigate website great pricing", "text": "Date of experience: October 21, 2024", "rating": 5}, {"title": "Just plain easy!", "text": "Very easy to communicate and shop for travel insurance.  Insurance is much less expensive than the insurance purchased thru the cruise lines.", "rating": 5}, {"title": "Great customer service", "text": "The agents, Miranda and Christianna, were very helpful, professional, friendly and knowledgeable. They answered all my questions, and they made it easier for me to decide if I wanted to buy the product or not.", "rating": 5}, {"title": "Gratreful", "text": "Total experience was helpful, informative and courteous.", "rating": 5}, {"title": "It was quick and easy!", "text": "Date of experience: October 20, 2024", "rating": 5}, {"title": "Great Customer Service", "text": "Whenever I call AARDY, I always speak to someone who is friendly and knowledgeable. When I was ready to buy the travel insurance, George, was so helpful, clearly explained the options and helped me decide which would be best for me. ", "rating": 5}, {"title": "Great price", "text": "Great price", "rating": 5}, {"title": "Christianna’s excellent service orientation-…excellent!", "text": "Christianna’s service orientation- listening, understanding and care to ensure our questions were answered!", "rating": 5}, {"title": "Good advisors ", "text": "Our advisors Peter R at AARDY was great! He was very patient and supportive to our request. ", "rating": 5}, {"title": "Great rates and wonderful customer service!", "text": "They have very competitive rates with great companies. I found it very easy to compare policies and purchase one. I had questions after my purchase, so I called the customer service number. The gentleman that I spoke with gave me exceptional customer service, sent me the files that I could not access. I highly recommend, going through AARDY!", "rating": 5}, {"title": "was easy to understand and knew the…", "text": "was easy to understand and knew the product", "rating": 5}, {"title": "Great Experience Choosing Insurance", "text": "Kendall was very helpful during our chat. When I said yes to speaking to an agent, Denise took over and helped me through the rest of the process. Both answered my questions and helped me chose the right insurance to cover my trip. I had looked at 3 different insurance sites and this was the most helpful by far. ", "rating": 5}, {"title": "Money Saver", "text": "Saved me money from the plan I had first intended to buy.  Gave me many options so I could choose which plan best suited what I wanted.Thanks for a great site.", "rating": 5}, {"title": "Many OptionsEasy-to-use and many options", "text": "Easy-to-use and many options ", "rating": 5}, {"title": "It was easy to compare plans and choose…", "text": "It was easy to compare plans and choose one best for my needs. ", "rating": 5}, {"title": "Excellent agent", "text": "Date of experience: October 19, 2024", "rating": 5}, {"title": "Denise was real helpful and…", "text": "Denise was real helpful and knowledgeable about the international travel policy. And got us a good price ", "rating": 5}, {"title": "eASY TO NAVIGATE WEBsite", "text": "eASY TO NAVIGATE WEBsite", "rating": 5}, {"title": "She knew what I wanted and helprd me…", "text": "She knew what I wanted and helprd me quickly.", "rating": 5}, {"title": "Knowledgeable & Pleasant", "text": "I was trying to figure out the best travel insurance policy for everyone involved on our next trip. Traveling out of the country, we're always concerned about the Medical insurance in these policies. I tried on my own by comparing plans & had questions & some confusion. Destiny at AARDY could not have been more patient answering my questions.  She was so knowledgeable & gave me honest answers. This should have been my first call instead of trying to figure out everything on my own & I could've saved myself a lot of time.  I've taken out trip insurance before & called an individual company.  This was a good way to compare plans to make sure I was getting the coverage that we need. I highly recommend. ", "rating": 5}, {"title": "Ireland Trip.y ainedery well to us. Gave us peace of mind now that we have travel insurance", "text": "Denise and Jayson were very, very helpful. Answered all our questions giving us peace of mind for our trip to Ireland to celebrate our 51st wedding anniversary!!", "rating": 5}, {"title": "UNPROFESSIONAL", "text": "Requested hard copy of insurance and it took multiple requests to get one!!!!!!!Not very professional !!!!!!", "rating": 2}, {"title": "Super easy to use this website", "text": "Super easy to use this website. I’ve had good response from Aardy in the past so I wouldn’t go anywhere else for my trip insurance. ", "rating": 5}, {"title": "Denise was extremely knowledgeable", "text": "Denise was extremely knowledgeable, articulate helpful, provided several options to suit my 3 week trip", "rating": 5}, {"title": "Miranda was patient and answered all…", "text": "Miranda was patient and answered all questions.  ", "rating": 5}, {"title": "Peter gave me great customer service.", "text": "Peter gave me great customer service.He was very friendly and knowledgeable and got me a great deal on travel insurance.", "rating": 5}, {"title": "Edfixient", "text": "Prompt, clear infoAnswered questions in way I could understand", "rating": 5}, {"title": "Very helpful and did not try to sell us…", "text": "Very helpful and did not try to sell us more than we wanted.", "rating": 5}, {"title": "Peter made it so easy to get a great insurance plan!", "text": "My three sisters and I just purchased travel insurance with Peter and he was great! He talked very clearly gave us all the important information and it was very easy to understand and it was a pleasure talking to him. The quote was excellent and we're very happy that we chose your insurance for traveling on our trip. We will definitely call you again. Thank you,  Linda J Baron", "rating": 5}, {"title": "Travel Insurance", "text": "Rasy to use, great comparisons", "rating": 5}, {"title": "Good Experience", "text": "Representative explained different options and suggested one right for our trip.", "rating": 5}, {"title": "Good coverages with reasonable price", "text": "Date of experience: October 17, 2024", "rating": 5}, {"title": "Able to help and explain clearly", "text": "Date of experience: October 18, 2024", "rating": 5}, {"title": "Amanda was great to deal with I have…", "text": "Amanda was great to deal with I have been using Aardy for the last 3 years of European travel", "rating": 5}, {"title": "Peter made it easy and quick.", "text": "Date of experience: October 18, 2024", "rating": 5}, {"title": "She was very polite n knowledgeable ", "text": "Very professional n very knowledgeable. ", "rating": 5}, {"title": "Pay for what you need!", "text": "Kendall was very helpful in discussing our travel insurance options and found us a significant savings using a plan that essentially had the same coverage as a more expensive plan that was presented to us by a representative who was not in the office when we returned her phone call.  Travel insurance is very expensive relative to the overall cost of the trip.  For that reason alone, one must not only be a practical but an informed buyer.  I realize there are risks involved for the insurance company but reasonable exclusions should be made available to the traveler who is already facing enormous costs when traveling.", "rating": 5}, {"title": "Amanda", "text": "Amanda was very helpful, knowledgeable, courteous.   I will consider buying  travel insurance for my future trips.", "rating": 5}, {"title": "I spoke to Peter", "text": "I spoke to Peter, He was very patient with Me.He explained the Insurance Policy for our Bermuda Cruise, very helpful. Thank You, DB", "rating": 5}, {"title": "My call was answered by a person and…", "text": "My call was answered by a person and Don was very helpful. I called before company was open and didn't leave message but someone called me back. Very one I talked to was helpful.", "rating": 5}, {"title": "George is amazing a very helpful person…", "text": "George is amazing a very helpful person you have working for you. Back earlier this year he helped us with a vacation package but unfortunately that feel through, not on his part however, on the vacation company.I kept his information and used him with our current travel plans. Very appreciative for all is information.", "rating": 5}, {"title": "The ease of purchase along with…", "text": "The ease of purchase along with comparison availability.", "rating": 5}, {"title": "Denise - excellent customer service", "text": "Denise was very helpful with understanding the plan coverage and definitions of key terms.", "rating": 5}, {"title": " Easy", "text": "Was very easy to compare rates and pick what I wanted.", "rating": 5}, {"title": "Quick easy straightforward.", "text": "Quick easy straightforward. ", "rating": 5}, {"title": "Easy setup experience", "text": "Easy to setup and very clear in the available options", "rating": 5}, {"title": "Travel insurance", "text": "Representatives that communicate in English.  Explained the benefits clearly and throuroughly, taking time to listen to our questions. Explained what they thought were best options for us.", "rating": 5}, {"title": "Easy and fast", "text": "It was easy and fast. Took the hassle out of the process.", "rating": 5}, {"title": "Quick, no frills ", "text": "This only took 10 minutes at most. The agent was professional and courteous.", "rating": 4}, {"title": "Courteous and Informative", "text": "I spoke to two reps.  Amanda and Denise.  Amanda was informative and courteous.  She shared additional information I requested and took my order.  Denise was also helpful when I called back and asked additional questions.  ", "rating": 5}, {"title": "Helpful agent", "text": "The agent, Destiny provided me great service and addressed all my needs.  It was a pleasant experience.", "rating": 5}, {"title": "Made it so easy", "text": "Peter helped me find the right policy and Destiny helped me purchase it.", "rating": 5}, {"title": "It's not easy shopping trip insurance.", "text": "It's not easy shopping trip insurance.AARDY made it simple to compare several providers and purchase the right plan", "rating": 5}, {"title": "Felicia was very helpful and patient…", "text": "Felicia was very helpful and patient with my various confusions about how travel insurance works.  She didn't rush me, but she clarified many details as she helped me find a policy that meets my needs.", "rating": 5}, {"title": "Just a phone call away answered all my…", "text": "Just a phone call away answered all my questions and concerns. The agent was very helpful and informed. Cover the policy and gave me piece of mind.", "rating": 5}, {"title": "Denise wasVery helpful and informative", "text": "I talked to Denise  to get a quote and she was very helpful.  She explained what the travel insurance covered and I was very pleased.", "rating": 5}, {"title": "Communicates well Clear communication with the agent…", "text": "Clear communication with the agent listen to what I needed for my trip and explain in detail what was covered from the first day to the end and had very nice hospitality", "rating": 5}, {"title": "Happy with both the policy and the agents", "text": "I'm very happy with both the policy and the help I got from AARDY agents. The agents I spoke with, first in a chat and then on the phone, answered my questions, found me a great policy and overall were very helpful. My mind has been put at ease on a couple key questions I had. Now I can enjoy the rest of my trip  planning with a few less things to worry about.", "rating": 5}, {"title": "Give Melanie a Raise!", "text": "Date of experience: October 16, 2024", "rating": 5}, {"title": "Easy  and convenient and plenty of…", "text": "Easy  and convenient and plenty of choices to chose from.", "rating": 5}, {"title": "Aardy was very responsive to all of our…", "text": "Aardy was very responsive to all of our questions.No pressure to buy.", "rating": 5}, {"title": "Helpful agent", "text": "Peter made it easy even though we never understood why my phone number wouldn’t allow me to buy online", "rating": 5}, {"title": "Very helpful agents —- both Miranda and…", "text": "Very helpful agents —- both Miranda and Destiny were wonderfully helpful, knowledgeable, patient, and efficient. This is my second policy taken through AARDY. Likely I will return each time I am traveling g, especially internationally. ", "rating": 5}, {"title": "I would have paid $550 for exactly the…", "text": "I would have paid $550 for exactly the same insurance had I purchased it through the Travel company. So glad I saw your ad and called. Peter was so patient and explained everything in a way that Made me feel confident in my purchase. From now on I will not purchase insurance from from the travel provider.", "rating": 5}, {"title": "Great experience", "text": "Great experience. Very helpful. Thank you. ", "rating": 5}, {"title": "Kudos and complements to Peter", "text": "Peter is friendly, patient and very accommodating. He was very prompt in returning my phone calls twice today. He answered all my questions very patiently. He is the epitome of excellent customer service!", "rating": 5}, {"title": "Destiny", "text": "Destiny, our contact person was very knowledgeable and helpful getting us the proper travel insurance.  Also very patient as we asked her many questions.", "rating": 5}, {"title": "Insurance questions", "text": "Denise answered my questions about terms in the insurance in language I could understand to be able to choose the right Travel Insurance for me.", "rating": 5}, {"title": "Amanda explained my options and…", "text": "Amanda explained my options and answered my questions in detail. She was polite and very considerate. She’s definitely a great representative for your company.", "rating": 5}, {"title": "Patient ", "text": "Explained my insurance answered questions and when I change dates or amounts wasn’t shook by it", "rating": 5}, {"title": "Amanda was very helpful and friendly", "text": "Amanda was very helpful and friendly! Great customer service!", "rating": 5}, {"title": "Kendal price", "text": "Kendal price, Was the nicest, Most professional agent I ever spoke toYou are very lucky to have such a knowledgeable person working in your company", "rating": 5}, {"title": "Great experience!", "text": "I had the most pleasant experience with Christiana Jeffrey; she was articulate in presenting the travel insurance plan with me.  I look forward to working with her.", "rating": 5}, {"title": "Miranda was extremely helpful and knew…", "text": "Miranda was extremely helpful and knew the system to get us insured.  great service ", "rating": 5}, {"title": "Jason was wonderful", "text": "Jason was wonderful. He was patient and thorough.  ", "rating": 5}, {"title": "My agent was very helpful and a…", "text": "My agent was very helpful and a pleasure to work with.", "rating": 5}, {"title": "Great Service!", "text": "Denise answered all of my questions, was polite, and thorough.", "rating": 5}, {"title": "Amanda was very helpful explaining what…the  policy information. ", "text": "Amanda was very helpful explaining what is included in the policy.", "rating": 5}, {"title": "Great experience", "text": "Great experience, my operator that assisted me was wonderful \"Miranda\" ", "rating": 5}, {"title": "Very easy to understand difference in…", "text": "Very easy to understand difference in packages, quick and easy service.", "rating": 3}, {"title": "Sereniti was very professional", "text": "Sereniti was very professional, knowledgeable, and most efficient.", "rating": 5}, {"title": "Easy to use", "text": "Easy to use. Found the same policy I researched for $1,000 less. ", "rating": 5}, {"title": "Reasonable price", "text": "Reasonable price, easy to understand ", "rating": 5}, {"title": "Explanation of benefits was simple to…", "text": "Explanation of benefits was simple to understand.", "rating": 5}, {"title": "Great experience", "text": "I wanted to ensure my trip but not at the price that most companies were willing to do so I chose AARP as a recommendation for a fair cost. I actually got to speak to a real person who could answer my questions.   ", "rating": 5}, {"title": "AARDY Review", "text": "They gave me best match for insurance and were able to compare many different companies in just a few minutes. Great coverage for great price", "rating": 5}, {"title": "Reasonable prices and helpful employees…", "text": "Reasonable prices and helpful employees made this transaction painless Amanda helped with the needed information to buy travel insurance-very kind throughout the process", "rating": 5}, {"title": "Answers quick and clear", "text": "Destiny could easily answer my questions completely and clearly so I could understand.", "rating": 5}, {"title": "Shawna was very knowledgeable and…", "text": "Shawna was very knowledgeable and helpful.  Would highly recommend her!", "rating": 5}, {"title": "Very easy to find what i was looking…", "text": "Very easy to find what i was looking for and peter helped me to find the right coverage for my trip to Asia ", "rating": 5}, {"title": "Peter is a very helpful and excellent customer service", "text": "I enjoyed talking to Peter. He was very patient and kind.His customer service was perfect. ", "rating": 5}, {"title": "Amanda was very helpful with deciding…", "text": "Amanda was very helpful with deciding what insurance best suited my needs for travel !", "rating": 5}, {"title": "She answered all my questions", "text": "She answered all my questions. This was my first time using this company and I would recommend it to others.", "rating": 5}, {"title": "Jason was very responsive", "text": "Jason was very responsive, helpful, knowledgeable and professionally cordial.  A pleasure to work with", "rating": 5}, {"title": "She was very nice on the phone", "text": "Date of experience: October 08, 2024", "rating": 5}, {"title": "Great Experience", "text": "Amanda was a great help and very polite", "rating": 5}, {"title": "Christianna was awesome", "text": "Christianna was awesome.  I really appreciate her patience and kindness.  She answered all my questions.  Went into great details. Great employee to have represent your company.Thanks", "rating": 5}, {"title": "Miranda was polite, kind and clear", "text": "Miranda was polite, kind and clearly answered all questions.", "rating": 5}, {"title": "Agent Review", "text": "The agent I dealt with was Maranda. She was very pleasant and thorough in answering my questions.", "rating": 5}, {"title": "Peter was knowledge and helpful", "text": "Peter was knowledge and helpful. Patiently answered all our questions.", "rating": 5}, {"title": "Very easy to register", "text": "Very easy to register. Fair pricing for benefits.", "rating": 5}]