[{"title": "The manager was awesome in helping my…", "text": "The manager was awesome in helping my brother & me in the loss of our younger brother regarding his accounts.  DuGood also came through & helped us with another issue when no one else would.  We truly appreciate your knowledge & caring toward your customers.  It did not go unnoticed & you now have several family members who are new customers because of it.  Thank you again! ", "rating": 5}, {"title": "Excellent staff and service provided by…", "text": "Excellent staff and service provided by this company, as a long time customer i have no problems with them, thanks!", "rating": 5}, {"title": "Everyone was so kind and welcoming the…", "text": "Everyone was so kind and welcoming the second we walked in. They were so friendly,  patient and so very helpful. It was a painless first experience and it couldn't have gone better. I am so glad I chose them and I look forward to all of my future visits. ❤️🥰", "rating": 5}, {"title": "Excellent credit union", "text": "Excellent credit union! I have banked with them for the last 11 years and they only get better with time! Fast, efficient service every time! ", "rating": 5}, {"title": "Absolutely amazing customer service", "text": "Absolutely amazing customer service, exactly what you want and need in your banking!!! It’s just what we received, when the team from DuGood Credit Union processed our new loan. Connie Tassin and Sandra Flanagan were amazing and handled every detail and made it quick and easy!!! We always recommend to our family and friends DuGood! Thank you!!!", "rating": 5}, {"title": "Jada Needham was amazing today", "text": "Jada Needham was amazing today. She helped me get a transfer done for my accounts and helped to get my student’s account linked. Thank you! She is amazing! ", "rating": 5}, {"title": "Professional", "text": "The speed in which I was helped; the professionalism of the ladies who helped me; and all were very polite.  ", "rating": 5}, {"title": "Extremely easy to refinance my truck", "text": "Extremely easy to refinance my truck.  I never had to leave my desk at work to go in and sign anything. Everything was done via text or Docusign. This saved me time and money !!!  I’ll be calling back to refinance my husbands truck next! ", "rating": 5}, {"title": "Went to DuGood to take care of some…", "text": "Went to DuGood to take care of some business with my sister and ended up opening a personal account. Everyone I encountered were nice, professional and gave great customer service. A big shout out to the lady’s at 1795 N Major Dr Beaumont Tx. Very sweet lady waiting to greet you in the lobby. Thank you new accounts Dept. Sorry I don’t remember names but I think one is Christy", "rating": 5}, {"title": "\"Good ole' Days\" Hometown Credit Union Service", "text": "Unbeatable customer service on every visit. This branch brings back memories of the \"good ole' days\" when hometown Credit Union service was first class..", "rating": 5}, {"title": "Kara did a great job!", "text": "Kara did a great job of helping us get our loan together and helping us understand the process. We are so thankful for her helping us get our car! ", "rating": 5}, {"title": "Last minute call ", "text": "I called in after 5 to have a payment stopped and Stephany explained everything to us and got the paperwork sent over for us to sign and return all before closing time. She was easy to work with and fantastic at customer service. I seriously cannot sing her praises enough ", "rating": 5}, {"title": "Outstanding customer service ", "text": "Cara Bryant has been overly patient and very attentive. She answers any / all questions and, if she doesn't know the answer, will find out any info needed to make things go smoother. 10/10 would recommend her to friends ", "rating": 5}, {"title": "Every time that I have used Dugood for…", "text": "Every time that I have used Dugood for any financial purposes I have been pleased. This last time was no different. The personal at Dugood have always helped with any questions that I have had without any pressure from them at all. ", "rating": 5}, {"title": "The help and open line of communication…", "text": "The help and open line of communication we had with Ashley during the loan process.", "rating": 5}, {"title": "New Du Good Customer ", "text": "I am a New Du Good Customer. I will say Branch Supervisor Kennedie at The Nederland Branch made my experience stress free and quick. Kennedie provide excellent customer service, very friendly greeting with a beautiful smile. Thank you Kennedie for make my experience stress free.😃", "rating": 5}, {"title": "Thanks  too  raven Smith every one…", "text": "Thanks  too  raven Smith every one from. Bottom  heart this bank is a awesome  place ....always makes you feel like  family  ...thank you  nall..street  port neches  dugood federal credit union ", "rating": 5}, {"title": "Great customer service and friendly…", "text": "Great customer service and friendly professional staff. Opening a new account was painless. ", "rating": 5}, {"title": "Great customer service ", "text": "I had a Great experience,Great customer service and friendly…Very easy to communicate withGreat customer service and friendly professional staff. Opening a new account was painless.", "rating": 1}, {"title": "The one thing that makes my experience…", "text": "The one thing that makes my experience great at DuGood in Lumberton, Texas is the customer service. From Deanna on down to the everyone else there’s always helpful great atmosphere helpful and that is a great experience at the Lumberton branch. Also, they are able to help me with any banking need that I have. I’ve never had a problem or ever had them not be able to help with something. I have been with several credit unions in the area over the years and do good outshines them all. I love DuGood.", "rating": 5}, {"title": "Joint account possible ...or no??", "text": "Customer service was stellar, however, we were expecting to be set up with a joint account (two names) and I was the only one on it. I think we figured it out though.", "rating": 4}, {"title": "Dugood works for its customers!", "text": "Taylor Amy went above and beyond to get my loan approved and funded. I also have excellent experiences in the past with the customer service agent, Stephanie Gallo", "rating": 5}, {"title": "Mrs Cudd", "text": "Mrs. D. Cudd went above and beyond on helping me with a truck purchase. The first truck had a break problem before I took delivery. Over the weekend a national recall was announced on the truck I had selected. On Monday Ms. Cudd canceled the deal at my request. After finding another truck she got me in it by Thursday. ", "rating": 5}, {"title": "Jada is awesome", "text": "Jada is awesome. I can usually figure out where things are on the website.  But I was stumped.  Called her and she was able to get me to what I needed.  She is beyond friendly and deserves all good things this life and DuGood have to offer!", "rating": 5}, {"title": "My expérience credit union I discovered…", "text": "My expérience credit union I discovered how à financial institution can genuinely for it's membres by offering personalized services that meet or unique needs", "rating": 4}, {"title": "Sandy Ferrell is fantastic to work…", "text": "Sandy Ferrell is fantastic to work with, we love her! She helped us work through our mortgage process and made it as easy as possible. ", "rating": 5}, {"title": "Because yall are very respectful and…", "text": "Because yall are very respectful and yall are very helpful ", "rating": 5}, {"title": "Tennille Ramsey was awesome", "text": "Tennille Ramsey was awesome. She was very professional and friendly. She went above and beyond her member services tasks to help me with my issue! If I had to score her 5- stars are not enough! She's definitely 💯 grand!!!", "rating": 5}, {"title": "A+ Service  Cara Bryant is the Best", "text": "A+ Service  Cara Bryant is the Best ", "rating": 5}, {"title": "Professional team", "text": "Working with everyone was great. Very knowledgable team who take time to make me comfortable with the procedure.", "rating": 5}, {"title": "I’m new in town and I decided to…", "text": "I’m new in town and I decided to enrolled in this new credit union.I would like to tell everyone,this is an awesome amazing credit union.The staff is extremely helpful and knowledgeable of all my questions I asked.Ms. Morgan was my representative and she informed me of all the key details.Like overdraft, password protection the savings plan and much more she told me about.Thank you DuGood credit union.", "rating": 5}, {"title": "Turned into great Experience ", "text": "From the first time I talked with Amanda Harrington I was made to feel welcome and that she was there to answer any question I had. She walked me through the whole process and I felt like a valued client.I had a deal on another vehicle and a loan from another institute but I choose to do business with DuGood because of her. I plan on doing more here as well.", "rating": 5}, {"title": "DuGood makes everything so easy", "text": "DuGood makes everything so easy! The loan process was simple our rep’s communication was excellent. Couldn’t ask for a better experience. Thanks DuGood!", "rating": 5}, {"title": "Working with the folks at DuGood has always been pleasant.", "text": "Working with the folks at DuGood has always been pleasant. When I applied for a loan in the past, the officers were helpful & made the application process easy. Times are hard right now & consolidating a credit card with another institution was my goal. My loan officer was kind & courteous. The process for approval was very quick & I am thankful. I believe this institution understands that communities are struggling, as a whole, & applying for a loan can be uncomfortable. I want to say that I am happy to be a member of DuGood.", "rating": 5}, {"title": "Mrs.Harrington went above and beyond to…", "text": "Mrs.Harrington went above and beyond to help us with our auto loan, going as far as working after hours to help us complete our process. We can’t say enough about how easy she made this experience. We can’t recommend Dugood and Mrs.Harrington enough!!! ", "rating": 5}, {"title": "I went into the Nederland location to…", "text": "I went into the Nederland location to open a savings and 3 checking accounts. Kennedy assisted me. I was in a time crunch with a pending grocery pick up and she accommodated me with a friendly, kind and knowledgeable attitude. It was much appreciated & I look forward to banking with DuGood. ", "rating": 5}, {"title": "Very flattering.", "text": "I call frequently to handle business and I find it very flattering when the ladies I speak to remember me by name and former conversation, as Jada did with my last phone call. My wife and I have been with Dugood for more than 25 years and feel like a part of a family.", "rating": 5}, {"title": "Erin gave me the best series experience…", "text": "Erin gave me the best series experience every.  ", "rating": 5}, {"title": "Mrs. Willie ", "text": "Mrs. Willie is professional, friendly and knowledgeable. She is a delight and I hope she is rewarded for her excellent customer service. Mrs. Willie was able to help resolve all issues in a timely, pleasant manner!", "rating": 5}, {"title": "I applied for an auto refinancing loan…", "text": "I applied for an auto refinancing loan and it was processed the same day. Tracy at the Beaumont Eastex Freeway location was walked me through the process and was extremely helpful, friendly and professional. I couldn’t have been more pleased. ", "rating": 5}, {"title": "Loan Officer Sara", "text": "Loan Officer Sara was very pleasant, professional, and knowledgeable. She was attentive to my issue and understood my concern for the requested loan amount. Sara promptly started the loan process. I received a call from Sara at 4:15 p.m. the same day with an approval. The contract was signed around 5:15 p.m. Thank you DuGood, and Sara, for your help! Great Company!!", "rating": 5}, {"title": "DuGood with no hassle experience", "text": "First of all, the workers behind the counter actually knew who we were.  So quick and easy to get a loan. No hassle. We were in and out in a matter of minutes.  Their helpfulness is very much appreciated. ", "rating": 5}, {"title": "Personal Business ", "text": "Tammy at the Vidor was very professional and took great care in handling our business. Thanks ", "rating": 5}, {"title": "Very reasonable and very helpful", "text": "Very reasonable and very helpful ", "rating": 5}, {"title": "First time refinancer", "text": "This was my first time to ever refinance a car.  Wasn't sure what to expect but it was such a speedy transaction.  Caryn took care of everything for me.  The whole process took less than an hour from the time I put in the loan request to signing the documents and her calling me to make sure I was happy with everything.  ", "rating": 5}, {"title": "Very patient", "text": "Very patient, considerate, and helpful lass helped me setup my account and the account on the app. Was even patient with me having to leave and do a few things and had to return to finish setting up the app on my phone.", "rating": 5}, {"title": "Amazing!!!!!", "text": "Amazing!!!!!!  I applied online.  The lady called me the next morning!!!!  She went above and beyond and I’m exceptionally happy!!!   I definitely recommend using this credit union :)", "rating": 5}, {"title": "Online auto refinance…", "text": "Applied online for an auto refinance loan. Received an email the next day as well as a response in one day. Erin answered my questions in a timely manner never had to wait long for a response. ", "rating": 5}, {"title": "Service with a smileI", "text": "I was greeted  by several people. A young lady helped me open a checking and savings account. And even made sure I could access the app on my phone .Thanks everyone ☺️ ", "rating": 5}, {"title": "New Customer Experience", "text": "I financed my car through DuGood and I needed to have a account through them. Decided switching banks was easier then having multiple accounts open. Talked with Christy and she was very nice and helpful. She walked me through the whole process and explained everything in a simple and easy way to understand. I got more benefits then I did with my other bank and staff was so much nicer. Thank you Christy! Would recommend doing business here if you need a good bank!", "rating": 5}, {"title": "Very responsive and took immediate…", "text": "Very responsive and took immediate action on my request, enabling me to move forward with my needs. Offered direct line of communication for third parties to streamline the process, knowing the urgency. And after the excellent customer service provided- offered one of the best rates on a loan that I personally think would beat any others in the region. ", "rating": 5}, {"title": "Auto Refinance", "text": "We just refinanced our car because the interest rates were better.  Allie made the whole process easy and she is so kind and sweet!  We will definitely call her when we need her help again!", "rating": 5}, {"title": "I’ve been dealing with this company for…", "text": "I’ve been dealing with this company for several years. I’ve had good service throughout the years. The loan manager there was very helpful and very prompt. I am completely satisfied with my service at Dugood.", "rating": 5}, {"title": "Great communication", "text": "Great communication. Stepped us through every step of the way. Worked with the dealer on my behalf. Made everything super easy.", "rating": 5}, {"title": "Very nice people", "text": "Very nice people. Rebecca was fast, efficient, very helpful, informative, and patient while setting up my account. Felt very welcome there. ", "rating": 5}, {"title": "The personal attention and prompt…", "text": "The personal attention and prompt responses made the loan process so easy. Our loan officer has helped us three times now and I would highly recommend her again. ", "rating": 5}, {"title": "Great service...", "text": "They are more family like than business .", "rating": 5}, {"title": "Fast and Painless Process", "text": "Great customer service.  My loan process was fast and painless.   This is my second time getting a personal loan from Dugood and the process both times was a great experience.", "rating": 5}, {"title": "Raven was very polite and very helpful…", "text": "Raven was very polite and very helpful making my loan application and approval go smooth. She is a very nice lady and was always smiling.", "rating": 5}, {"title": "Good friendly people to do business…", "text": "Good friendly people to do business with and I have heard great things about the bank in Vidor Texas so I opened a account with them and look forward to do all my banking with them.", "rating": 5}, {"title": "Great customer service!", "text": "Kayleigh was very pleasant and helpful and answered all of our questions.", "rating": 5}, {"title": "Loan", "text": "Great friendly service.", "rating": 5}, {"title": "Helped me get approved for a personal…", "text": "Helped me get approved for a personal loan. Communicated my options and gave me the best option to help with my debt. ", "rating": 5}, {"title": "Loan process was done exceptionally…", "text": "Loan process was done exceptionally well and fast. ", "rating": 5}, {"title": "The ladies were great at explaining…", "text": "The ladies were great at explaining everything and how it worked. They were very interactive and made me very comfortable .", "rating": 5}, {"title": "Excellent experience!", "text": "Had a great experience applying for a loan to purchase a residential lot. The loan officer, Sandra, was very professional and informative, often having more information than the agents or title company. It was an overall easy experience and I would definitely go back in the future for any financing needs!", "rating": 5}, {"title": "Excellent", "text": "Excellent! The service is brilliantly swift and the team is incredibly workable. Mrs. Craig in Mont Belvieu helped me and she was very kind and helpful!", "rating": 5}, {"title": "Very helpful", "text": "The ladies both on the phone and in the branch. Were very kind, patient, and helpful. I’m excited to be a member ", "rating": 5}, {"title": "Customer service was amazing!!!", "text": "Date of experience: November 01, 2024", "rating": 5}, {"title": "I think this is a great family oriented…", "text": "I think this is a great family oriented bank that cares for our community and wants to give whats best to us financially. ", "rating": 5}, {"title": "Easy and faster", "text": "Easy and faster, Ms Niki gave update periodically and she really did great job.", "rating": 5}, {"title": "Helped me understand how everything…", "text": "Helped me understand how everything works.", "rating": 5}, {"title": "My DuGood location has great customer…", "text": "My DuGood location has great customer service, there banking methods is Amazing and it’s alot of great perks", "rating": 5}, {"title": "The people are fantastic to work with…", "text": "The people are fantastic to work with especially a lady named Carrie Brown. She was very helpful ", "rating": 5}, {"title": "Loan officer was knowledgeable and…", "text": "Loan officer was knowledgeable and pleasant to work with-made an experience where a lot of money is being spent less stressful from the financial standpoint- thank you.", "rating": 5}, {"title": "Ultrapro exchange is Good ", "text": "Ultrapro exchange is Good My experience is well", "rating": 5}, {"title": "Great Job", "text": "Carrie was very quick and attentive to all my questions. Simple loan process and efficiency! Thanks! ", "rating": 5}, {"title": "The lady was very sweet", "text": "The lady was very sweet, and helpful in explaining different things such as options. ", "rating": 5}, {"title": "Ladies with smiles ", "text": "Plansant attitudes and clean environment coffee and a smile ", "rating": 5}, {"title": "Always a pleasure and Always easy doing…", "text": "Always a pleasure and Always easy doing Business with DuGood ", "rating": 5}, {"title": "My Review", "text": "My service experience of creating an account With DuGood was very comforting ,very Comforting,well explained  and handled in a Professional and Timely manner . All smiles ", "rating": 5}, {"title": "Everyone at the Vidor branch was very…", "text": "Everyone at the Vidor branch was very helpful and took as much time as needed to answer any questions.", "rating": 5}, {"title": "They suck the jasper branch committed…", "text": "They suck the jasper branch committed fraud by lying and stating that someone made an overdraft purchase that never happened then after asking for the statement they give me a fake merchant with no address and a scam phone number. This bank gets a zero rating ", "rating": 1}, {"title": "Jade and Mary ", "text": "I love the people at the Beaumont location they are wonderful woman with amazing personalities especially Mrs.Mary she is an amazing woman…", "rating": 5}, {"title": "Really took the time to explain about…", "text": "Really took the time to explain about the different loans & what I needed to do to get the loan.", "rating": 5}, {"title": "Questions about how the bank works ", "text": "Stephanie Gallo was extremely helpful with answering all my questions I had while just joining this credit union and made me feel comfortable and not rushed I’m very excited to grow with this credit union and see where it leads as a new member ", "rating": 5}, {"title": "Amazing staff", "text": "Amazing staff, helpful, kind and patient.", "rating": 5}, {"title": "Top notch professionals", "text": "Top notch professionals, our entire experience was so streamlined and hassle-free. I would wholeheartedly recommend DuGood for anything financial!MHH", "rating": 5}, {"title": "Customer service was great", "text": "They were extremely helpful, explaining everything clearly ands very patient and polite.", "rating": 5}, {"title": "The lady who helped me to open my…", "text": "The lady who helped me to open my account was very friendly and helpful as well professional ", "rating": 5}, {"title": "Thank you for all of your help", "text": "Thank you for all of your help, very experienced & friendly. ", "rating": 5}, {"title": "Amazing customer service", "text": "Amazing customer service! Went above and beyond to ensure that I had everything that I needed.", "rating": 5}, {"title": "Ms Thomas was very knowledgeable and…", "text": "Ms Thomas was very knowledgeable and kind she was very understanding of my problem she was convinced we could get this problem solved, and we did thanks to her, I must say I have not had a more delightful experience.", "rating": 5}, {"title": "Quick and simple", "text": "It was fast and easy. All the paperwork was good and the loan officer was knowledgeable, thorough, and friendly. ", "rating": 5}, {"title": "Quick and attentive staff.", "text": "Quick and attentive staff. ", "rating": 5}, {"title": "The overall willingness of the entire…", "text": "The overall willingness of the entire staff to assist in helping to remedy your problem.", "rating": 5}, {"title": "I opened a new account she was very…", "text": "I opened a new account she was very friendly a d very helpful.", "rating": 5}, {"title": "The important of credit union is to let you clients feel welcomed and appreciated,which that is very good and I love credit union because they have that kind of service we are looking for", "text": "For me the only thing I think about this company is the upgrade with master card etc,but otherwise they are a very good company and I do love it.", "rating": 1}, {"title": "A new beginning", "text": "well its only been 4 days . but so far things are good . .    .as for service madison A sandefer  was very nice and helpful                 ", "rating": 5}, {"title": "Erin kept in touch and very flexible", "text": "Erin kept in touch and very flexible. Always courteous and accommodating. ", "rating": 5}, {"title": "Dugood always works to help me with…", "text": "Dugood always works to help me with either questions,loans or safety with my banking. ", "rating": 5}, {"title": "I love the zero fee", "text": "I love the zero fee. Customer service is excellent 👌 ", "rating": 5}, {"title": "Great experience", "text": "The time was taken to fully explain everything.  Employees were super friendly and a pleasure to work with.", "rating": 5}, {"title": "Love them they always nice when I go…", "text": "Love them they always nice when I go cash my check ", "rating": 5}, {"title": "The loan officer took care of…", "text": "The loan officer took care of everything quickly and efficiently.   She was very kind and helpful. ", "rating": 5}, {"title": "Past Experience", "text": "We have several loans with DuGood and they have made the process easy and stress free.  They make you feel like you matter.", "rating": 5}, {"title": "Good", "text": "Very very good ", "rating": 5}, {"title": "Outstanding assistance ", "text": "The individual handling my request was very helpful and knowledgeable. Her concern to assist me was outstanding. ", "rating": 5}, {"title": "Staff menber was caring", "text": "Staff menber was caring. Listening to all our needs. I could not have asked for a better person", "rating": 5}, {"title": " Personal loan", "text": "I recently asked for a personal loan to cover auto deductions until I received some insurance funds were received. Having been a very long established customer I was upset when the loan was approved for a lessor amount. The very unusual extenuating circumstances were ignored and interest was very high. So I assume being a loyal customer doesn't count any more which leads me to consider moving my accounts to another business.", "rating": 2}, {"title": "Very friendly and helpful", "text": "Very friendly and helpful ", "rating": 5}, {"title": "Awesome customer service ", "text": "Yall did great. Deanna was awesome. Very helpful and knowledgeable ", "rating": 5}, {"title": "Great service and People", "text": "Easy and Very Professional. Treated us like we mattered. ", "rating": 5}, {"title": "Love my bank  they are always really…", "text": "Love my bank  they are always really friendly. Great customer service. ", "rating": 5}, {"title": "Nikki and Tammy were very helpful and…", "text": "Nikki and Tammy were very helpful and kind. They made sure the process was simple and easy to understand.", "rating": 5}, {"title": "Amazing customer service!!", "text": "Amazing customer service!!! Made you feel right at home ", "rating": 5}, {"title": "Pauline and her team were amazing", "text": "Pauline and her team were amazing! 10 out of 10 recommend them. ", "rating": 5}, {"title": "Fast and friendly associate.", "text": "Fast and friendly associate. ", "rating": 5}, {"title": "Super helpful and friendly customer…", "text": "Super helpful and friendly customer service!", "rating": 5}, {"title": "Very easy to make loan via telephone", "text": "Very easy to make loan via telephone. Very courteous and knowledgeable representative.", "rating": 5}, {"title": "I was successful with a small loan but…", "text": "I was successful with a small loan but not car loan.", "rating": 5}, {"title": "Completed setting up my new account", "text": "Date of experience: August 23, 2024", "rating": 5}, {"title": "Quick and Easy", "text": "Quick and Easy.  Very organized with collecting and getting documents signed.", "rating": 5}, {"title": "Loan", "text": "Applied for loan. Whole process was quick and easy, it only took 2 days to close. ", "rating": 5}, {"title": "All stuff are careful taking care the…", "text": "All stuff are careful taking care the business and customer needs.but it make so hard  to get approve that make me feels doesn’t want to do it anymore .to do any loan in future.I do thank you just to save me this once. I won’t do it again.", "rating": 4}, {"title": "They took care of me and answered all…", "text": "They took care of me and answered all of my questions. ", "rating": 5}, {"title": "Convenience", "text": "The convenience of doing the application online and approval and signing.", "rating": 5}, {"title": "Nice helpful an very Friendly ", "text": "They give their members a chance an I love that about DGFCU!!!", "rating": 5}, {"title": "Great customer service always", "text": "Date of experience: October 25, 2024", "rating": 5}, {"title": "Super friendly staff", "text": "Super friendly staff. Quick service. ", "rating": 5}, {"title": "Wing ", "text": "Hi good luck on the train and ", "rating": 4}, {"title": "The young lady", "text": "The young lady, I believe her name is Haley, was very nice and quick. She never missed a beat. ", "rating": 5}, {"title": "Everyone was very personable and…", "text": "Everyone was very personable and helpful during my loan process.", "rating": 5}, {"title": "Good service", "text": "Date of experience: October 02, 2024", "rating": 5}, {"title": "First contact", "text": "Your staff member was very pleasant on the phone.", "rating": 5}, {"title": "No hassle!!!", "text": "No hassle!Had my money in my account in less than 20 minutes!The DuGood Jasper Branch is awesome!!!", "rating": 5}, {"title": "Good to behold seems to be recommended…", "text": "Good to behold seems to be recommended for anyone out there", "rating": 3}, {"title": "Love Du Good and the staff are always…", "text": "Love Du Good and the staff are always pleasant! ", "rating": 5}, {"title": "Very helpful ", "text": "Love how they are everywhere. They are so nice and very helpful. ", "rating": 5}, {"title": "Great company with perfect conditions!", "text": "Date of experience: October 08, 2024", "rating": 5}, {"title": "The approach was very nice", "text": "Date of experience: October 08, 2024", "rating": 5}, {"title": "My experience was great the customer…", "text": "My experience was great the customer service I got was attentive, respectful and very professional, job well done.", "rating": 5}, {"title": "Kristin was the best", "text": "Kristin was so easy to work with, responsive and friendly!!", "rating": 5}, {"title": "Great", "text": "Their customer service is great.", "rating": 5}, {"title": "Great bank to do business with", "text": "Date of experience: September 26, 2024", "rating": 5}, {"title": "Great Bank", "text": "Friendly staff, fast, reliable. Very good bank", "rating": 5}, {"title": "The loan officer was very friendly and…", "text": "The loan officer was very friendly and helpful.", "rating": 5}, {"title": "My trusted life gcash 09453649255", "text": "My trusted lifeBank accountBPI 000649420157Branch 0064Marilao", "rating": 3}, {"title": "Fast approval", "text": "I was in, approved, and out the door in less than an hour.", "rating": 5}, {"title": "It’s always great service.", "text": "It’s always great service. ", "rating": 5}, {"title": "Great employees and customer service …", "text": "Great employees and customer service  is great", "rating": 5}, {"title": "The environment was very welcoming ", "text": "The environment was very welcoming, and the employees were very courteous and professional.", "rating": 5}, {"title": "Need to give more options but other…", "text": "Need to give more options but other wise good ", "rating": 4}, {"title": "Quick and helpful staff", "text": "Quick and helpful staff.  We were in and out in less than 15 minutes. ", "rating": 5}, {"title": "Great help with car purchase.", "text": "Great help with car purchase. ", "rating": 5}, {"title": "The manager Kim Dyer was exceptionally helpful. She made sure I had a great experience.", "text": "The manager Kim", "rating": 5}, {"title": "thanks", "text": "friendly, efficient peoples", "rating": 5}, {"title": "Great service ", "text": "Pleasant employees", "rating": 5}, {"title": "Great service", "text": "Date of experience: August 14, 2024", "rating": 5}, {"title": "Very efficient", "text": "Very efficient, friendly. ", "rating": 5}, {"title": "I Would like to know more about your…", "text": "I Would like to know more about your services ", "rating": 5}, {"title": "Very helpful 👌", "text": "Very helpful 👌 ", "rating": 5}, {"title": "Excellent Service", "text": "Quick service and helpful associates. ", "rating": 5}, {"title": "They were nice and helpful", "text": "Date of experience: August 31, 2024", "rating": 5}, {"title": "Its a good place", "text": "Its a good place, Rebecca was really helpful!", "rating": 3}, {"title": "That's perfect", "text": "Date of experience: June 29, 2024", "rating": 5}, {"title": "Why my account", "text": "Why my account ", "rating": 5}, {"title": "Great fast service", "text": "Date of experience: April 19, 2024", "rating": 5}, {"title": "Very good service", "text": "Very good service ", "rating": 5}, {"title": "The people who work here are ver nice and extremely helpful ", "text": "Great people, great service!", "rating": 5}, {"title": "The loan officer was so nice and…", "text": "The loan officer was so nice and friendly", "rating": 5}, {"title": "Quick and easy", "text": "Quick and easy.  Kennedy was awesome..", "rating": 5}, {"title": "Customer service excellent", "text": "Customer service excellent ", "rating": 5}, {"title": "Very helpful", "text": "Very helpful.  Calls back when she says", "rating": 5}, {"title": "yes i be leave in what you just said", "text": "Date of experience: July 05, 2024", "rating": 5}, {"title": "Excellent service", "text": "Excellent service ", "rating": 5}, {"title": "Very nice and helpful!", "text": "Date of experience: July 01, 2024", "rating": 5}, {"title": "Excellent service very professional and…", "text": "Excellent service very professional and very friendly", "rating": 5}, {"title": "Great customer service", "text": "Great customer service ", "rating": 5}, {"title": "Good experience", "text": "Good experience. I would prefer better faster communiciation via email.", "rating": 4}, {"title": "Very cordial ladies and very…", "text": "Very cordial ladies and very informative. ", "rating": 5}, {"title": "Great experience..the executive was…", "text": "Great experience..the executive was friendly and cooperative.", "rating": 5}, {"title": "supersuperr", "text": "Date of experience: October 07, 2024", "rating": 5}, {"title": "it is the best branch in this city.", "text": " it is the best branch in this city.", "rating": 5}, {"title": "Good good good good", "text": "Date of experience: October 15, 2024", "rating": 4}, {"title": "Nice and easy", "text": "Nice and easy ", "rating": 1}, {"title": "I love this bank", "text": "I love this bank, great service i can't lie", "rating": 3}, {"title": "Good bank account", "text": "Good bank account ", "rating": 1}, {"title": "Excellent customer service.", "text": "Excellent customer service. ", "rating": 5}, {"title": "Excellent customer service", "text": "Excellent customer service ", "rating": 5}, {"title": "Everything", "text": "Everything ", "rating": 5}, {"title": "People were very nice", "text": "Date of experience: July 18, 2024", "rating": 5}, {"title": "Norms", "text": "lorem ipsum", "rating": 5}, {"title": "Great customer service", "text": "Great customer service ", "rating": 5}, {"title": "good good good good", "text": "Date of experience: August 01, 2024", "rating": 5}, {"title": "Very good work", "text": "Date of experience: June 30, 2024", "rating": 5}, {"title": "Good people to work with ", "text": "Nice people ", "rating": 5}, {"title": "Really good.", "text": "Date of experience: May 06, 2024", "rating": 5}, {"title": "I am a very good man", "text": "Date of experience: November 15, 2023", "rating": 1}, {"title": "My name is Getu", "text": "My name is Getu ", "rating": 1}, {"title": "They be good to ", "text": "They be good to . Think you ", "rating": 5}, {"title": "Love the round up to savings!!", "text": "Love the round up to savings program and you can use any ATM for free. Very professional, courteous and respectful.", "rating": 5}, {"title": "Incredible support, thank you Jada.", "text": "I was helped by an employee named Jada Needham, and they earned all 5 stars and then some. I went into my chat angry about my situation, but by the end, I was incredibly happy and had my problem completely solved. If these reviews are at all considered when it comes to advancement, I hope the people in charge see this and treat their amazing employee properly.", "rating": 5}, {"title": "Process was very easy", "text": "Process was very easy. Everyone was very professional and very nice. ", "rating": 5}, {"title": "Sandy Ferrell was our handler and she…", "text": "Sandy Ferrell was our handler and she kept us up to date on all aspects of this loan. I needed help and she was there to guide me to a smooth processing of our loan. She is a very great asset to DuGood.  ", "rating": 5}, {"title": "Great service at DuGood!!!", "text": "Date of experience: June 21, 2024", "rating": 5}, {"title": "Best CD interest rate available and…", "text": "Best CD interest rate available and customer friendly!!!", "rating": 5}, {"title": "DuGood has always been good people to…", "text": "DuGood has always been good people to deal with; professional and polite, as well as, kind.  When I had to close my account and open a new one - the only negative comment I can make is they didn't tell me the suffix for ACH payments (for my bills) had been changed from 010 to 009; therefore, when I changed all my payment methods, I used what I had always used - 010 and my bill payments got returned.  Then when they set up my three accounts to transfer between them - they didn't tell me that you have to click a tab called \"Move Money\".  In the past I have always seen all the different accounts on the same page as the checking and savings, loans, etc.  So - they need to include those two pieces of information - especially with long established customers.  It took getting in touch with the lady over the digital dept. to tell me when it should have been customer service.  Otherwise, everything was great and I thank you all.  ", "rating": 4}, {"title": "I had applied online", "text": "I had applied online. The application couldn’t be completed online. I called to see what I needed to do. They said come to the branch. A little while later Stephanie Gallo called me, asked security questions and had everything completed shortly. I didn’t have to go in to the branch.", "rating": 5}, {"title": "We were kept informed on every step of…", "text": "We were kept informed on every step of the pro ess", "rating": 5}, {"title": "Very helpful thank you", "text": "Very helpful thank you ", "rating": 2}, {"title": "The customer service was amazing", "text": "The customer service was amazing. The loan officer Allison Medina was exceptional and would recommend her to anyone. I have had other credit unions but this one beats them all. We were at Rave but gladly switched to here. Great service and awesome credit union and the employees that work here.", "rating": 5}, {"title": "You Gave Me Hope Again In Fairness But…", "text": "You Gave Me Hope Again In Fairness But Much More Can Be Done In Communities Of The People Who Are Hurting!!", "rating": 5}, {"title": "I had a great experience!", "text": "I had a great experience! ", "rating": 5}, {"title": "All good, no complaints ", "text": "Very nice young lady that helped me , and professional.I want to say thanks you for letting my family do business with your credit union .", "rating": 5}, {"title": "excellent service", "text": "excellent service!     Thank You", "rating": 5}, {"title": "Kinzie was so easy to talk to", "text": "Kinzie was so easy to talk to! She listened to me very great people personality!& very thorough.", "rating": 5}, {"title": "Too much bad service.", "text": "Date of experience: June 11, 2024", "rating": 1}, {"title": "Very helpful!", "text": "Very helpful!Thanks WB", "rating": 4}, {"title": "We were treated with the utmost respect…", "text": "We were treated with the utmost respect and professionalism, thank you!", "rating": 5}, {"title": "Friendly people", "text": "Date of experience: June 11, 2024", "rating": 5}, {"title": "They were extra helpful in helping me…", "text": "They were extra helpful in helping me with my issue. I don’t think they could’ve been any one better to help me. They were tremendous ", "rating": 5}, {"title": "The bank receptionist was extremely…professional", "text": "The bank receptionist was extremely professional and very clear about the perks that  DuGood CU offers I really appreciate it.", "rating": 5}, {"title": "I don't believe I have ever felt more welcomed", "text": "I don't believe I have ever felt more welcomed anywhere. Every questioned was answered. Everything was explained to our understanding. We laughed, learned, and conducted business. A very pleasant experience.", "rating": 5}, {"title": "Awesome experience!!", "text": "Timely responses, knowledgeable personnel and low rates.", "rating": 5}, {"title": "Friendliness of the staffing and…", "text": "Friendliness of the staffing and knowledge of the type of accounts at DuGood.", "rating": 5}, {"title": "The communication and the friendly…", "text": "The communication and the friendly atmosphere. Making sure we were completely satisfied with opening our new account. ", "rating": 5}, {"title": "Everybody there was determined to Help", "text": "Everybody there was determined to assist me in opening a new account.", "rating": 5}, {"title": "Everyone was very nice", "text": "Everyone was very nice. They have many financial tools available. I look forward to doing business with DuGood in the future. ", "rating": 5}, {"title": "Great customer service", "text": "Great customer service.  Very prompt and efficient.", "rating": 5}, {"title": "Great ", "text": "Friendly & wonderful ", "rating": 5}, {"title": "Makenze was very helpful throughout the…", "text": "Makenze was very helpful throughout the whole process of setting up my new account. Highly recommend.", "rating": 5}, {"title": "Smooth lending process", "text": "Loan officer Tara was very helpful. She answered all questions thoroughly,  was prompt to respond and made the entire process smooth! She's fantastic (Please honor/reward/award her accordingly!) and because of this experience I will definitely turn to DuGood in the future for ongoing and new banking needs.", "rating": 5}, {"title": "Financing was quick and easy ram 2500", "text": "Financing was quick and easy ", "rating": 5}, {"title": "Great", "text": "From the time a person walks in the door of DuGood C.U. they are welcomed, every employee is professional and takes care of business in a timely manner. ", "rating": 5}, {"title": "Great Always Satisfied", "text": "Great Always Satisfied ", "rating": 5}, {"title": "Very easy setup ", "text": "Very fast, very friendly, very knowledgeable. Looking forward to doing business with DuGood Credit Union. ", "rating": 5}, {"title": "Great customer service", "text": "Great customer service l", "rating": 5}, {"title": "Awesome ", "text": "It was a good experience ", "rating": 5}, {"title": "Simple process with friendly customer…", "text": "Simple process with friendly customer service", "rating": 5}, {"title": "Very helpful and Pleasant just got it", "text": "Date of experience: May 16, 2024", "rating": 5}, {"title": "Very helpful and easy to set a loan up…", "text": "Very helpful and easy to set a loan up with. ", "rating": 5}, {"title": "I moved matured CD to open an account…", "text": "I moved matured CD to open an account with higher rate to DuGood.  I was in a time crunch that day due to weather issues and was pleasantly surprised at how easy and fast accomplishing this was.The staff member was more than friendly,helpful and knowledgeable.  I will do the same as other funds become availableIn addition, the Jasper branch is much closer to my home.  Thank you!!!", "rating": 5}, {"title": "I give Dugood five stars based on their…", "text": "I give Dugood five stars based on their customer service. Friendly attitudes, and helpful advice on how to improve my credit to get the things I want.", "rating": 5}, {"title": "The new account lady was nice and…", "text": "The new account lady was nice and walked me through everything. ", "rating": 5}, {"title": "Cara made the process as simple and…", "text": "Cara made the process as simple and smooth as possible. ", "rating": 5}, {"title": "Allison Medina was an absolute Angel to…", "text": "Allison Medina was an absolute Angel to work with.  So patient, kind, and respectful of an elderly person.  What a pleasure. ", "rating": 5}, {"title": "Great service, and convenience ", "text": "Great service, nice people, and very convenient. I never ever had to leave my office! Awesome job. I will be using Dugood from now on!", "rating": 5}, {"title": "I’m a new customer", "text": "I’m a new customer. I went in today to deposit a check that came in with a previous last name and the teller that assisted me was very courteous and helpful. I had all the paperwork that I needed including my ID so I didn’t encounter any problems. Everything went smoothly and I really appreciate it. I was in and out and about 10/15 minutes at the most, I feel like I made a good choice and choosing to DuGood as my credit union. I needed a local banking institution, a friend recommended Du Good and I’m happy they did! ", "rating": 5}, {"title": "Great customer service setting up new accounts", "text": "Great customer service setting up new accounts. Spent the time necessary to fully explain options that DuGoodFCU had to offer.  Thanks Kim D.", "rating": 5}, {"title": "Good people", "text": "Always have a confidence that DuGood will do their best to help the customers.", "rating": 5}, {"title": "Great customer service ", "text": "Awesome and friendly people", "rating": 5}, {"title": "Very prompt and professional service!", "text": "Date of experience: May 06, 2024", "rating": 5}, {"title": "Wendee Ashmore was great helping me…", "text": "Wendee Ashmore was great helping me with the information I needed and helping me to get everything set up.Everyone at the Orange location was very nice ", "rating": 5}, {"title": "People were friendly and professional", "text": "People were friendly and professional. Eager to help.", "rating": 5}, {"title": "All the ladies were kind and friendly", "text": "All the ladies were kind and friendly. The staff assisted with all items and all questions I had.", "rating": 4}, {"title": "People have to know  that you what you…", "text": "People have to know  that you what you can be helpful  though everything improve and show ", "rating": 1}, {"title": "I already had much experience with the…", "text": "I already had much experience with the app", "rating": 5}, {"title": "Very knowledgeable personnel", "text": "Very knowledgeable personnel. Explained everything in detail and was quick and very courteous. ", "rating": 5}, {"title": "Good Service", "text": "Very Good service. recomended from my side ", "rating": 5}, {"title": "Ms JoDeji she was very helpful", "text": "Ms JoDeji she was very helpful. She also was patient and was able to answer all of my questions and detailed about my the bank account.", "rating": 5}, {"title": " Free Checking ", "text": "I had a great experience opening a free account good customer service ", "rating": 5}, {"title": "Very professional and friendly", "text": "Very professional and friendly ", "rating": 5}, {"title": "The person made it very enjoyable easy…", "text": "The person made it very enjoyable easy to understand what she was doing gave me all the information that I needed was a great experience.", "rating": 5}, {"title": "Quick and friendly care", "text": "Date of experience: May 06, 2024", "rating": 5}, {"title": "Fantastic customer service the young lady was very professional but sweet at the same time", "text": "Very quick but everything was explained to me very good experience ", "rating": 5}, {"title": "The clerk helped me as much as she…", "text": "The clerk helped me as much as she possibly could .", "rating": 5}, {"title": "The friendly staff and readiness to…", "text": "The friendly staff and readiness to help and get me started ", "rating": 5}, {"title": "Excellent experience!!", "text": "I appreciate the fact that DuGood is still doing business like a small town credit union. I've been with another CU for almost 25 years and have been thoroughly disappointed due to them changing their business model to going with the \"industry standard\". Getting my vehicle loan done was as easy as it gets. ", "rating": 5}, {"title": "JimH ", "text": "Your agent Jo did a great job ", "rating": 5}, {"title": "It was absolutely amazing", "text": "It was absolutely amazing, timely, our representative was professional and knowledgeable! ", "rating": 5}, {"title": "Raven was super sweet and informative", "text": "Raven was super sweet and informative! Go see her for your banking needs!", "rating": 5}, {"title": "There great", "text": "There great ", "rating": 5}, {"title": "Requests and paperwork was prompt in…", "text": "Requests and paperwork was prompt in receiving", "rating": 5}, {"title": "Great Service Great Staff ", "text": "Great Staff, Friendly Faces ,Prompt Service I Love My Dugood Credit Union. They Take Good Care Of Me. Sheena Boykin ", "rating": 5}, {"title": "Good service when I visit the branch…", "text": "Good service when I visit the branch fast and efficient. ", "rating": 5}, {"title": "Great customer service", "text": "Great customer service. They answer any questions we have without hesitation. ", "rating": 5}, {"title": "They are always friendly and fast!", "text": "They are always friendly and fast! ", "rating": 5}, {"title": "Great experience ", "text": "From walking in the door to leaving, everyone that I dealt with was very welcoming and friendly. I was pleased with the help and knowledge that I walked out with. I would recommend to family and friends", "rating": 5}, {"title": "I have banked with DuGood for several…", "text": "I have banked with DuGood for several years. Their customer service is excellent. I just recently made a car purchase and my loan officer made the process so much easier.", "rating": 5}, {"title": "Great friendly customer service!", "text": "Date of experience: April 26, 2024", "rating": 5}, {"title": "This is the best among all others", "text": "This is the best among all others ", "rating": 5}, {"title": "Vehicle Refinance", "text": "The handling of my vehicle refinancing from 100 miles away could not have gone any smoother than what I experienced. I've been a member for close to 40 years and I have never had a bad experience. ", "rating": 5}, {"title": "Everything was ready when we arrived to…", "text": "Everything was ready when we arrived to close. ", "rating": 5}, {"title": "poor service", "text": "Date of experience: April 22, 2024", "rating": 1}, {"title": "It is good company", "text": "It is good company ", "rating": 5}, {"title": "This App is really useful and easy to…", "text": "This App is really useful and easy to use even for new users ", "rating": 5}, {"title": "How to claim my money", "text": "How to claim my money ", "rating": 2}, {"title": "Time is on your side at DuGood!", "text": "Can we begin with the amount of time it took only about 15-20 minutes. That’s the best part! The teller that assisted us was very helpful she went above and beyond to make sure my student knew the ins and outs to his new account! She helped him to setup everything so that he would only have to go through the process one time, and explained the many perks he would have with his new account! We are thankful for DuGood making the process so easy and simple! ", "rating": 5}, {"title": "Kennedie was very quick and helpful.", "text": "Kennedie was very quick and helpful. ", "rating": 5}, {"title": "Loan officer was real courteous", "text": "Loan officer was real courteous ", "rating": 5}, {"title": "Just moved to Baytown and first time to…", "text": "Just moved to Baytown and first time to visit Credit union. My visit was a pleasant one.", "rating": 5}, {"title": "Rachel and Bernadette were really nice…", "text": "Rachel and Bernadette were really nice and great at explaining and going over the papers. ", "rating": 5}, {"title": "Great representation very friendly and…", "text": "Great representation very friendly and very knowledgeable excellent ", "rating": 5}, {"title": "Very helpful when opening my account l.", "text": "Date of experience: April 23, 2024", "rating": 5}, {"title": "Always fast and friendly.", "text": "Always fast and friendly. ", "rating": 5}, {"title": "Everyone was such a joy and just…", "text": "Everyone was such a joy and just couldn’t do enough to help you. Also would not let the call end until they have answered all your questions and concerns. Recommend ", "rating": 5}, {"title": "Did a new car refinance ", "text": "Did a new car refinance Genise Griffin was very helpful and did a GREAT jobI live in Louisiana and we doing a lot of the work over the phone and text and emails She was there throughout the whole process and made sure everything went smoothly THANK YOU GENISE", "rating": 5}, {"title": "The staff at Dugood ", "text": "The staff at Dugood was very responsive and helpful,  they made doing business very pleasant. ", "rating": 5}, {"title": "I went in to refinance a new truck…", "text": "I went in to refinance a new truck which I had originally financed with GM.  Service was prompt, to the point, and it was easy to achieve my objective.  I didn't feel like there was any wasted time sitting around waiting or with wasted motion in the interview process.  I went into the branch office, got waited on promptly, and completed the deal in a reasonable amount of time.", "rating": 5}, {"title": "Everyone was very pleasant and…", "text": "Everyone was very pleasant and friendly.  Very knowledgeable of your services.  ", "rating": 5}, {"title": "DUGOOD HELPS EVERYONE!explains and walks me through…", "text": "Dugood explains and walks me through anything online business. The older generation isn't as knowledgeable with internet.Dugood has the patience and it is much appreciated!!!", "rating": 5}, {"title": "Easiest loan process ", "text": "Harlee,  was so great to work with. Did everything online and was patient working with us while husband was working nights. Always our go to credit union.", "rating": 5}, {"title": "Great service", "text": "Great service ", "rating": 5}, {"title": "Great experience with Dugood", "text": "Mrs Cara was very helpful and answered all my question about getting loan.  She replied to all my text or call in a matter of minutes. I would recommend using Dugood,  probably the best rate in town. ", "rating": 5}, {"title": "When I walk in I was greeted with a…", "text": "When I walk in I was greeted with a smile and good morning how can we help you today ", "rating": 5}, {"title": "Everyone was so nice and so helpful", "text": "Everyone was so nice and so helpful. Loved it. ", "rating": 5}, {"title": "Fast and friendly service", "text": "Fast and friendly service. No delay or complaints.", "rating": 5}, {"title": "Miss Jacob's is always very…", "text": "Miss Jacob's is always very professional, courteous, and helpful. I always have a great experience any time I need help. ", "rating": 5}, {"title": "New to Banking with DuGood", "text": "The service was wonderful and they help make sure you know every aspect of what to expect when you open a new account.", "rating": 5}, {"title": "The employees in the jasper branch made…", "text": "The employees in the jasper branch made my experience a great one and was able to assist me with everything i needed in a timely manner and a smile.", "rating": 5}, {"title": "Over all JoDeja at the Dowlen location…", "text": "Over all JoDeja at the Dowlen location was the most laid back person I could of done this process with. She was easy to talk to and got the job done is a good amount of time. Ten out of ten.", "rating": 5}, {"title": "Very Helpful and knowledgeable!", "text": "Caron and the teller (I do not remember her name...I was upset with what happened at another branch...they were very calm and extremely helpful...I ended up opening a new account with DuGood. ", "rating": 5}, {"title": "The company is very professional and…", "text": "The company is very professional and all they do they serve without any hassles ", "rating": 5}, {"title": "I'm still searching for a loan", "text": "Everything's okay ", "rating": 3}, {"title": "Kennedie C", "text": "Kennedie C. Took care of me on this recent loan. She was down to earth and my conversations with her were very friendly and she conveyed real sympathy for me and my situation.  I felt I had a new friend. I have also  dealt with the other loan officers and tellers for years and they have always been friendly,  down home and helpful as well.  She's a shining star as all are at the  Nederland office on Nederland Avenue. She and all there are very helpful. ", "rating": 5}, {"title": "Great customer service from walking in…", "text": "Great customer service from walking in the credit union to leaving out just Great environment ", "rating": 5}, {"title": "Very good ", "text": "Very good , a very good way of learning new things", "rating": 5}, {"title": "Bank job", "text": "Every thing", "rating": 5}, {"title": "Nope ", "text": "Everything ", "rating": 1}, {"title": "Very friendly and professional staff.", "text": "Date of experience: April 08, 2024", "rating": 5}, {"title": "Great Service", "text": "Kenzie was a great help to me setting up my financing!", "rating": 5}, {"title": "ExceptionalCostumer Service", "text": "I recommend DuGood Credit Union for its solid reputation for exceptional customer service, a wide range of financial products, competitive rates, and an intuitive online platform. Its dedication to security and technological innovation also makes it an excellent choice for those seeking a reliable and modern financial institution.", "rating": 5}, {"title": "Not good it was awful expensive", "text": "Date of experience: April 06, 2024", "rating": 2}, {"title": "Gud experience", "text": "Gud experience ", "rating": 4}, {"title": "Signature Loan was very easy", "text": "Signature Loan was very easy ", "rating": 5}, {"title": "This is great bank of us", "text": "This is great bank of us. We are so happy that we are amember of this bank", "rating": 5}, {"title": " can’t remember her name but it starts…", "text": "I can’t remember her name but it starts with a K.. She was so nice and kind and sweet she was able to open me an account and set up my direct deposit right then and there not only that she also helped me with my deposit she is the best and I love her her office is the first one when you walk in to the left and the customer service was great everyone spoke while entering the bank they also said have a great day when we were leaving I love it!!!!!", "rating": 5}, {"title": "The entire process was quick and easy…", "text": "The entire process was quick and easy and couldn’t have been more smoother. ", "rating": 5}, {"title": "Bad service", "text": "Date of experience: April 02, 2024", "rating": 1}, {"title": "The entire staff was very Helpful!", "text": "The entire staff was pleasant and very helpful. Opening my account was easy, and Deanna Cudd made the whole process seamless.", "rating": 5}, {"title": "Very friendly and helpful never had to…", "text": "Very friendly and helpful never had to go into a branch did everything over the phone and email. ", "rating": 5}, {"title": "This is not my first loan with DuGood", "text": "This is not my first loan with DuGood, and every time I have made a loan here it has always been easy and fast.", "rating": 5}, {"title": "Friendly, professional staff", "text": "The bank representatives (on phone and in person) were very friendly and helpful.", "rating": 5}, {"title": "Tara Baloney is a great loan manager", "text": "Tara Baloney is a great loan manager. She comes through almost every time.", "rating": 5}, {"title": "Katrina had my loan processed in less…", "text": "Katrina had my loan processed in less than 45 minutes! She was awesome! Everyone in the Jasper branch are very friendly.", "rating": 5}, {"title": "Everyone was very helpful and nice…", "text": "Everyone was very helpful and nice throughout the whole process ", "rating": 5}, {"title": "The lady that helped me was very sweet", "text": "The lady that helped me was very sweet. I felt good when I left the bank.  I hope to be a life long member.   Thank you DuGood", "rating": 5}, {"title": "I went there to open two accounts", "text": "I went there to open two accounts, I was helped right away. I was helped by a lady named Rebeca Anzaldug she was very helpful and I was out of there shortly. I was very happy with the service.", "rating": 5}, {"title": "good but can be better", "text": "Date of experience: March 27, 2024", "rating": 3}, {"title": "sweet people ", "text": "awsome and honest", "rating": 5}, {"title": "Side x side buying process", "text": "Dugood beat Can-Am’s interest rate and I was able to do everything over the phone including the signing process. ", "rating": 5}, {"title": "Very Helpful ", "text": "The young woman that helped me start my account was very helpful and informative explaining the services that where available to me answering any questions.", "rating": 5}, {"title": "A very pleasant employee...", "text": "My wife and I had to manage one of our accounts, and the employee that helped us was very nice, knowledgeable, and helpful.  Her name was Rebeka, she works in DuGood on Major Drive in Beaumont, TX We do hope she will be recognized, she does represent your credit union very well.", "rating": 5}, {"title": "Every thing was to fast", "text": "Every thing was to fast. really good experience they reduce mi interest and put the monthly payment as I need it. thanks ", "rating": 5}, {"title": "Have done business with DuGood for 17…", "text": "Have done business with DuGood for 17 years, Always received good service. Very Happy.", "rating": 5}, {"title": "Kristin was extremely professional and…", "text": "Kristin was extremely professional and efficient in facilitating our loan.", "rating": 5}, {"title": "Very helpful on any request..very nice…", "text": "Very helpful on any request..very nice and considerate", "rating": 5}, {"title": "Fast", "text": "Fast, efficient and easy process.  ", "rating": 5}, {"title": "Quick ", "text": "Quick and helpful ", "rating": 4}, {"title": "Good service", "text": "Good service.  Friendly.  Lots of perks", "rating": 5}, {"title": "Like the service ", "text": "Date of experience: March 18, 2024", "rating": 5}, {"title": "Very helpful", "text": "Date of experience: March 20, 2024", "rating": 5}, {"title": "Melissa was so helpful and she made the…", "text": "Melissa was so helpful and she made the process fast and easy", "rating": 5}, {"title": "not to good experince", "text": "Date of experience: March 14, 2024", "rating": 3}, {"title": "Speedy service", "text": "Date of experience: March 18, 2024", "rating": 5}, {"title": "Communication and ease of getting…", "text": "Communication and ease of getting things completed ", "rating": 5}, {"title": "It was all so easy", "text": "It was all so easy. Everyone I spoke to was polite and considerate of my time and my needs. ", "rating": 5}, {"title": "Very helpful and friendly staff!", "text": "Very helpful and friendly staff! ", "rating": 5}, {"title": "Truly wonderful experience ", "text": "Amazing friendly service. Quick easy to the point help. Got in and got out. With what I wanted. It was one of the easiest loan processes I have done at a bank. ", "rating": 5}, {"title": "Great very good thank you for the auto…", "text": "Great very good thank you for the auto loan", "rating": 5}, {"title": "Great customer service", "text": "Great customer service, friendly staff, they really make you feel good ", "rating": 5}, {"title": "It was my first time using DuGood…", "text": "It was my first time using DuGood Credit Union and I was very impressed with their customer service to open 3 accounts with the Jasper branch.  I switched from Wells Fargo, who I’ve had since 2002 because there wasn’t one close to where I bought my house in Jasper. I’m very satisfied with DuGood. ", "rating": 5}, {"title": "Easy Loan Process ", "text": "We have been paying someone to do our yard for years. We finally decided to get our own zero-turn mower. Allison M. made this a very swift and easy process for us. ", "rating": 5}, {"title": "Very professional and speedy", "text": "Date of experience: March 12, 2024", "rating": 5}, {"title": "Ms Denise", "text": "Ms. Denise at the Edison Plaza was very knowledgeable and professional . She gave us a time frame and it was exactly as she had said .", "rating": 5}, {"title": "The best bank I have ever used", "text": "The best bank I have ever used ", "rating": 5}, {"title": "VERY KIND AND NICE PLACE", "text": "Date of experience: March 13, 2024", "rating": 5}, {"title": "Fully recommend ", "text": "The staff I dealt with were EXTREMELY nice, and shoutout to Stephanie who always works with my dad and helped work with him to get my second car financed through them!", "rating": 5}, {"title": "Been with Dugood for years and am happy…", "text": "Been with Dugood for years and am happy with my bank. Recently applied for a personal loan and the entire process took minimal time and was super easy. Would recommend banking with them.", "rating": 5}, {"title": "Kind and Welcoming ", "text": "Very kind and welcoming when you walk in the door.  The Branch Manager went over and beyond to help me with setting up a new account and a legal issue on another account for my Husband. I couldn’t have asked for a better experience. I look forward to using DuGood Credit Credit.", "rating": 5}, {"title": "Taylor is the best at what she does. ", "text": "Taylor made going through with purchasing a vehicle so effortless and easy, and across state lines even. Constantly in communication with me and the dealership even when they were being hard headed. Taylor definitely deserves recognition for her attention to detail and her care to help me as a member. ", "rating": 5}, {"title": "Awesome company definitely recommend!", "text": "So happy couldn't agree more I recommend this company to anyone!!! ", "rating": 5}, {"title": "As always a great experience", "text": "Date of experience: March 04, 2024", "rating": 5}, {"title": "The lady helping me was very…", "text": "The lady helping me was very professional yet friendly,  I was surprised at the service and speed. ", "rating": 5}, {"title": "Refinanced my home and they were super…", "text": "Refinanced my home and they were super helpful.  Made the entire process pain free and even accommodated my irregular work schedule. ", "rating": 5}, {"title": "Why I continue to choose DuGood", "text": "My go to person at DuGood is Darlene at the Lumberton branch! Even though I just recently moved from Lumberton, I still would rather drive there which is 30 mins away because she always goes over & beyond. Nothing personal against any of the other branches but Darlene goes out of her way, and over & beyond for whatever it is I’m needing. I had a few not so great experiences at another branch but she is one of the reasons I continue to keep my accounts at DuGood. I hope she gets recognition for the amazing job that she does. It’s hard to find good service anywhere now days sadly. ", "rating": 5}, {"title": "Very helpful loan officer", "text": "Very helpful loan officer. She set everything up for me to meet at a branch in another city. Went very smooth ", "rating": 4}, {"title": "The office and staff provide a very user friendly service…", "text": "The office and staff provide a very inviting  environment. The staff members are very professional and supportive to help with providing the service you may need.", "rating": 5}, {"title": "avrage", "text": "i did not like how at the end of every process there is the red and green buttons. They do not look good quality and destroys the aesthetic .The start page of the website is good. maybe instead of the red and green the interface were to have a good color choice it would definetly increase the quality.", "rating": 3}, {"title": "I was helped fast and received…", "text": "I was helped fast and received excellent customer service.", "rating": 5}, {"title": "Fast and friendly", "text": "Fast and friendly!", "rating": 5}, {"title": "Kristen was great", "text": "Kristen was great. So very helpful and attentive. Very responsive and kept me up to date constantly on my loan process ", "rating": 5}, {"title": "Carrie Brown did a great job", "text": "Carrie Brown did a great job! She kept in contact with me every step of the way thru the loan process", "rating": 5}, {"title": "Great service and fast transaction", "text": "Date of experience: March 06, 2024", "rating": 5}, {"title": "Simple and easy", "text": "I was able to use my card as soon as it was set up. The process of setting it up was very straightforward too", "rating": 5}, {"title": "Rebecca was very helpful.", "text": "Date of experience: March 04, 2024", "rating": 5}, {"title": "Upfront interest rate disclosures", "text": "Upfront interest rate disclosures.  Very quick responses and very good customer service.  No hassle for increasing pre approval amounts.  No surprises at the final process.  Will be watching for mortgage rates to decrease.", "rating": 5}, {"title": "Carrie at mont belvieu tx did a very…", "text": "Carrie at mont belvieu tx did a very great job refinancing my truck! ", "rating": 5}, {"title": "My review ", "text": "The young lady that help open the account was very helpful ", "rating": 5}, {"title": "Great bank.", "text": "Date of experience: March 01, 2024", "rating": 5}, {"title": "Customer service!", "text": "Date of experience: March 01, 2024", "rating": 5}, {"title": "Very good easy to use", "text": "Very good easy to use ", "rating": 1}, {"title": "Tara was simply excellent in every way", "text": "Date of experience: February 26, 2024", "rating": 5}, {"title": "Always a great banking experience at…", "text": "Always a great banking experience at Dugood in Jasper.  Tammy Christopher is the absolute best at handling my finance issues.", "rating": 5}, {"title": "It was the communication skills and the…", "text": "It was the communication skills and the customer curticy for me!!  I like the fact that I could speak to a person instead of a computer 🥴", "rating": 5}, {"title": "The process of getting the loan and the…", "text": "The process of getting the loan and the employees made it so simple and easy. ", "rating": 5}, {"title": "Great Customer Service ", "text": "The staff was knowledgeable with the transactions I want to make.  Greatly customer service and satisfaction ", "rating": 4}, {"title": "Great service", "text": "Date of experience: February 27, 2024", "rating": 5}, {"title": "Good ", "text": "Good , very good", "rating": 5}, {"title": "Love doing business here", "text": "All of the ladies are so helpful. I love doing business here. They really do go above and beyond.", "rating": 5}, {"title": "New account ", "text": "Rebecca was very friendly. She was helpful in every way answering all questions with knowledge. Overall great experience!", "rating": 5}, {"title": "Not a bank! ", "text": "I corresponded by email with Danielle, who set me up an appointment with JoDeja at the Major Dr. location. Danielle told me everything I needed to know to be prepared. JoDeja spent almost 2 hours with me setting up multiple accounts that I needed. I am leaving a bank because the one time I really needed them, they gave me nothing but misinformation. The atmosphere, the people, and the banking options were wonderful. I am so happy to be a new member of DuGood. ", "rating": 5}, {"title": "Great customer service!", "text": "I needed to open an account and Deanna and Darlene made it a very easy process!", "rating": 5}, {"title": "The works was very helpful and…", "text": "The works was very helpful and friendly!!!!", "rating": 5}, {"title": "Good Job", "text": "Great work!", "rating": 5}, {"title": "Good job guys", "text": "Date of experience: February 23, 2024", "rating": 5}, {"title": "Loan process", "text": "It is always so easy to apply for a loan through Dugood.  The loan officer was awesome and made the process easy.  Thank you Rebecca.", "rating": 5}, {"title": "Easy professional banking experience ", "text": "Employee was very professional and knowledgeable at her job.  She was very courteous and helpful and very patient in answering all of our questions.  She made our experience there actually pleasurable.  I have been a member there since 1973 and she is the nicest person I've ever dealt with.  We really loved working with her.", "rating": 5}, {"title": "First of all let me give a big thanks…", "text": "First of all let me give a big thanks to Mis Tara  Me and my wife been with du good for years and always think we can’t get any credit but was wrong till I call to see if they can refinance my car from there every step was smooth mis Tara is a professional at what she do and patience with the customer All the way around I say 10 thank you DuGood and continue dugood for customers ", "rating": 5}, {"title": "Great customer service.friendly down…", "text": "Great customer service.friendly down home kind always helpful.thank you!", "rating": 5}, {"title": "A very enjoyable experience ", "text": "Haley made setting up an account very enjoyable. My goal is to transfer all of my finances to DuGood after how efficient the initial experience was. ", "rating": 5}, {"title": "The company is very good and giving…", "text": "The company is very good and giving excellent customer service.", "rating": 5}, {"title": "The service was fast and easy ", "text": "The service was fast and easy , I would highly recommend it to everyone I know. Happy to be a part of the.DuGood family.", "rating": 5}, {"title": "Always a seemless experience.", "text": "Always a seemless experience. ", "rating": 5}, {"title": "Mis raven was great to work with", "text": "Date of experience: February 13, 2024", "rating": 5}, {"title": "Great credit union! My parents have been members for over 40 years.", "text": "I had an amazing experience at the Port Neches location. I needed to help my mother who was bed ridden due to a recent illness and was able to get the forms electronically.", "rating": 5}, {"title": "Very Pleasant experience", "text": "Very Pleasant experience opening checking and saving accounts.  I was greeted upon entering the building, all my questions was answered. The teller was professional.  The branch manager made me feel special, she was patient and professional assisting me with set up online banking. Informed me on information pertaining to loans and cd’s.  I will Highly recommend this credit union to family and friends.", "rating": 5}, {"title": "Once decision was made it was smooth", "text": "I felt like you listened to my conversation", "rating": 5}, {"title": "It's all in the name..DUGOOD", "text": "Went in late after work with only minutes to spare. Mrs Wendee Ashmore was happy to see me and very welcoming. Helped me get a saving and checking opened and answered all my questions ! These folks are genuine !", "rating": 5}, {"title": "Very easy", "text": "Very easy. Friendly staff", "rating": 4}, {"title": "They were able to do everything by…", "text": "They were able to do everything by phone and email, so I did not have to drive to a physical location.", "rating": 5}, {"title": "It was fast and easy to do business", "text": "Date of experience: February 13, 2024", "rating": 5}, {"title": "Good service", "text": "Good and prompt service", "rating": 5}, {"title": "They are very nice and are very patient", "text": "They are very nice people and are patient with everyone", "rating": 5}, {"title": "Thank you DuGood!!!", "text": "My rep was so pleasant  and helpful.Marissa explained all benefits and terms. When you are my age, it means so much. DuGood gets it's name right and I am proud to be a member.", "rating": 5}, {"title": "Great  job", "text": "Yall have great employees  at credit union  on major drive good attitude  out of the people  and the Branch Manger yall have at location is really great and yall have great service", "rating": 5}, {"title": "First experience in a credit union loved it.", "text": "My first time ever being in a credit union.  My lady was very nice and really explained everything to me very slow and patient with me. She answered every question right away, even answered some before I even asked them. She was amazing.  I look forward to having a long relationship with my new bank in my new area since I got married this year and to continue my job hunt this week.", "rating": 5}, {"title": "Super Smooth Process and Great Staff", "text": "Every time I’ve requested a loan from DuGood it’s been super easy and their staff is extremely helpful!", "rating": 5}, {"title": "I dont know her exact name but if she…", "text": "I dont know her exact name but if she see this she will know who i am. It was a lady with a yellow pull over on and she was very sweet and helpful! Also, made the process very easy and fast", "rating": 5}, {"title": "Been using DuGood for years", "text": "Been using DuGood for years. Great people to do business with. Tammy Christopher in the Jasper branch is the reason I stay!", "rating": 5}, {"title": "My new bank family", "text": "The nice lady that helped me to become a member was very professional and made me feel at home. Thank yall", "rating": 5}, {"title": "The loan process was so fast and easy", "text": "The loan process was so fast and easy.  Tara was the best and will do business with her from now on!!", "rating": 5}, {"title": "Ms Stephanie was really helpful and got…", "text": "Ms Stephanie was really helpful and got me setup with the perfect account and different perks that’ll save me a lot of money.", "rating": 5}, {"title": "Great customer service friendly…", "text": "Great customer service friendly provided insight and helped make everything go smoothly and quickly", "rating": 5}, {"title": "In need of a loan", "text": "I was greeted when I entered the door! Asked to speak with a loan officer and barely sat down in the waiting area before I had someone tell me she could help me!  Ashante was very nice and listened to my needs.  In no time at all I was signing papers and on my way.  Every step of my experience was great!  Keep up the good work!", "rating": 5}, {"title": "Great experience!", "text": "Great experience!!  Genise was very knowledgeable about her work.  She was very, very helpful!!", "rating": 5}, {"title": "Always phenomenal service", "text": "Always phenomenal service.  Fast and easy to work with!  Best in SE Texas", "rating": 5}, {"title": "Fast and easy experience", "text": "Date of experience: February 01, 2024", "rating": 5}, {"title": "Ease of getting loan", "text": "The ease of getting the loan without having to come into the branch.  The loan officer was very prompt with response.", "rating": 5}, {"title": "The lady was so nice and understanding", "text": "Date of experience: February 01, 2024", "rating": 5}, {"title": "Friendly and helpful staff", "text": "Every time I walk into Dugood I am greeted with a smile. Literally everyone there is friendly, warm, and helpful. I recently needed to add am account and Ms. Wendee made it a nice and easy experience. She made sure I understood my options and helped me with whatever I didn't understand. Plus she's super sweet! Great staff at DuGood!", "rating": 5}, {"title": "Best credit union in town!!", "text": "The employees are awesome! Welcomed me like I was family as soon as I walked inside the branch, and set up my account in no time! I will ONLY recommend this credit union to EVERYONE!", "rating": 5}, {"title": "Great personal service and a wide…", "text": "Great personal service and a wide variety of services offered.", "rating": 5}, {"title": "Dugood credit union", "text": "Amazing service", "rating": 5}, {"title": "Talked to Nice people about my…", "text": "Talked to Nice people about my information.", "rating": 5}, {"title": "Very polite and friendly", "text": "Very polite and friendly. My wife and I were very happy during the visit.", "rating": 5}, {"title": "Everyone was so nice and helpful !!", "text": "Date of experience: January 26, 2024", "rating": 5}, {"title": "Great and knowledgeable people and…", "text": "Great and knowledgeable people and friendly.  Will highly recommend!", "rating": 5}, {"title": "Marissa did an excellent job at getting…", "text": "Marissa did an excellent job at getting me approved for my loan while I was at her desk.", "rating": 5}, {"title": "Great Customer service 👏", "text": "Date of experience: January 23, 2024", "rating": 5}, {"title": "How a few difficulties with my account…", "text": "How a few difficulties with my account Customer service was very helpful respectful and the problem was Resolved", "rating": 4}, {"title": "Haley was truely a professional", "text": "Haley was truely a professional and very knowledgable.  She respected our time and didn't waste any time assisting up opening an account with this institution.", "rating": 5}, {"title": "Great customer service!", "text": "I had such a great experience with DuGood. This was my first time applying for an auto loan and my advisor Kristin was such a big help. She answered all my questions and was very quick to respond with any follow up information. I’d highly recommend DuGood!", "rating": 5}, {"title": "Fresh start", "text": "They helped me to be able to get a fresh start and was honest with me on what I could do and couldn't do", "rating": 5}, {"title": "Taylor stayed in contact every step of…", "text": "Taylor stayed in contact every step of the way.", "rating": 5}, {"title": "Did everything online and over the…", "text": "Did everything online and over the phone with no issues! Perfect for someone who has a busy lifestyle! Thank you Dugood for making it easy on me!", "rating": 5}, {"title": "Nice   very nice", "text": "Date of experience: January 23, 2024", "rating": 5}, {"title": "The staff is knowledgeable and…", "text": "The staff is knowledgeable and courteous!!", "rating": 5}, {"title": "My husband and I have been with dugood…", "text": "My husband and I have been with dugood for many years.We mostly have interacted with Mrs. Tara Baloney She has been an absolute pleasure over the years. She makes every effort to give 100% always!", "rating": 5}, {"title": "Shout Out goes to…", "text": "Stephanie at the Vidor branch went above and beyond for me in trying to settle a dispute with an account I had.  Her expert way of handling the business matter was/is much appreciated and it made me feel validated and supported.  The transfer to Allie in the Lender Department was smooth and helpful.  Big thanks goes out to Allie as well for her expert way of handling a stressful situation and helping me with paperwork to resolve the stressful situation I was in.  Bless you all!", "rating": 5}, {"title": "Jada", "text": "As soon as I walked in, I was greeted by Jada Needham. She treated me like I had banked there for years. She is very well trained at her job. She answered all my question. Jada was very Professional and Friendly, her communication skills are the best I've seen! She took time with me, went over everything Dugood FCU had to offer. I don't remember the last place that had such Awesome Customer Service! So much so, my step son also opened an account. I rate her 5 stars. I would like to Thank Dugood FCU for hiring her. She is Awesome! She will get so much more buisness from me and my Family. My mother, fiance and children are in the process of moving there bank to Dugood just because of how well I was treated by Jada. We have never had such Awesome Customer Service! Dugood should give her a raise!", "rating": 5}, {"title": "Good place to visit", "text": "Date of experience: January 03, 2024", "rating": 5}, {"title": "very experience", "text": "Date of experience: January 20, 2024", "rating": 5}, {"title": "Speed and friendliest employees", "text": "Date of experience: January 18, 2024", "rating": 5}, {"title": "Very easy to open an account", "text": "Very easy to open an account. The Dugood representative was kind and very informative.", "rating": 5}, {"title": "Tara was amazing to work with", "text": "Tara was amazing to work with! She was very professional and polite! She got us approved quickly for the auto we wanted! We will always use her in the future for any other loans we may need.", "rating": 5}, {"title": "Kristin Daniels was great!", "text": "Date of experience: January 19, 2024", "rating": 5}, {"title": "The servicOne of the best in the industrye is quick and awesome", "text": "The service is quick and awesome", "rating": 5}, {"title": "The people at Dugood were very kind and…", "text": "The people at Dugood were very kind and extremely helpful! I had all of my questions answers!", "rating": 5}, {"title": "Always great staff and very helpful.", "text": "Date of experience: January 17, 2024", "rating": 5}, {"title": "It was a simple online application…", "text": "It was a simple online application experience and once the credit union opened the next day, I was given a courtesy call to tie everything together.  I'm immensely pleased!", "rating": 5}, {"title": "I have been with DuGood FCU for many…", "text": "I have been with DuGood FCU for many years. It's been nothing short of a great experience, whether I'm in the lobby to get a cashier's check, in the drive-through to make a deposit, or on the phone to refinance my house and/or car. I've found DuGood personnel consistently knowledgeable, convivial and easy to work with. I have no plans to go anywhere else.", "rating": 5}, {"title": "Right from the beginning I felt a…", "text": "Right from the beginning I felt a connection with DuGood Credit Union! This is the hometown branch I choose to trust my money with!", "rating": 5}, {"title": "Very nice handling customers and…", "text": "Very nice handling customers and helping them in reaching out reality", "rating": 5}, {"title": "Characters", "text": "Need a visit for the bank", "rating": 5}, {"title": "New Account", "text": "I would rate them and score them a 💯 the credit union was very nice they took the time to go over everything with me so I can understand and know about the account everything was great thanks for everything", "rating": 5}, {"title": "Very helpful", "text": "Very helpful, courteous, and excellent customer service", "rating": 5}, {"title": "DuGood has came through me and family a…", "text": "DuGood has came through me and family a lot and glad to have them as my bank", "rating": 5}, {"title": "The banker was really nice and helpful", "text": "Date of experience: January 11, 2024", "rating": 5}, {"title": "Refinanced a new car purchase", "text": "Refinanced a new car purchase. Quick and easy! Shelby knows her stuff. Bing, bang boom! In, done and out.", "rating": 5}, {"title": "Loan made effortless", "text": "Harlee was most diligent and helpful. She took me through the loan process and made it practically effortless for me.", "rating": 5}, {"title": "Very friendly and very understanding…", "text": "Very friendly and very understanding about everything..Heard a lot about credit unions but never had the chance to join one thanks for everything!!!", "rating": 4}, {"title": "New member", "text": "Opening an account was simple and easy. Staff were friendly. Very informative and could answer all my questions with confidence", "rating": 5}, {"title": "best in bank", "text": "Date of experience: January 09, 2024", "rating": 5}, {"title": "So helpful", "text": "So helpful! Was very patient with me. Respond quickly! Absolutely amazing!", "rating": 5}, {"title": "They’re providing great service to the…", "text": "They’re providing great service to the community!", "rating": 5}, {"title": "I realy like all the people at DuGood…", "text": "I realy like all the people at DuGood Mont Belviue/  Always friendly and accomidating.", "rating": 5}, {"title": "Customer service", "text": "Customer service was great. No time to set up a account and loved all the addons you get when opening up an account.", "rating": 5}, {"title": "Very quick and professional", "text": "Very quick and professional.  Love doing business with DuGood.", "rating": 5}, {"title": "Quick and Easy", "text": "I called about a loan, and next thing I knew I was getting it. I've never experienced such a quick and easy loan process online. From first phone call to finishing text, it took less than 3 hours. The agent was very informative and answered every question I had.", "rating": 5}, {"title": "great service", "text": "Date of experience: January 02, 2024", "rating": 5}, {"title": "excellent great", "text": "Date of experience: January 03, 2024", "rating": 5}, {"title": "I have to say by this being my first…", "text": "I have to say by this being my first time trying a credit union. I truly love the way I was greeted and treated by the whole branch. They were very helpful and informational.", "rating": 5}, {"title": "Quick fast and friendly service!", "text": "Date of experience: December 29, 2023", "rating": 5}, {"title": "The loan was for the full amount.", "text": "Date of experience: December 29, 2023", "rating": 5}, {"title": "Great customer service", "text": "Great customer service. Quick and easy auto loan. Great rates too.", "rating": 5}, {"title": "Refinanced multiple loans", "text": "The associate I  talked/worked with Caryn, helped me get everything I wanted moved to Dugood (refinancing) everything went smooth and I did not have any issues while working with her. I will be back to work with Caryn again.", "rating": 5}, {"title": "Everyone was nice", "text": "Date of experience: December 29, 2023", "rating": 4}, {"title": "Thank you Ms Marissa", "text": "Ms Marissa Carlin is the reason my latest experience with Dugood was great. She was very helpful, from answering my constant questions to giving me some great advice. Ms Marissa didn't stop at the first obstacle and give up on helping me, she worked to take care of my concerns and got me going in the right direction. I am very thankful for her assistance.", "rating": 5}]