[{"title": "I am overwhelmed with joy and so…", "text": "I am overwhelmed with joy and so grateful as a result of your excellent customer service, compassion and kindness. You went beyond the ordinary measures to resolve my issue.I am truly greateful!", "rating": 5}, {"title": "We had our trip cut short because our…", "text": "We had our trip cut short because our van was broken into with all of our luggage stolen. We purchased the insurance that allows trip interruption for any reason. Seven Corners was easy to work with and reimbursed us for everything covered by our policy. ", "rating": 5}, {"title": "Amber was very kind, patient and helpful…", "text": "Amber was very kind, patient and helpful when I called to file my first ever claim. She helped to simplify what is naturally an intimidating process.   ", "rating": 5}, {"title": "Quick response and no hassle when I…", "text": "Quick response and no hassle when I needed to cancel my policy within the 14-day refund period. The refund showed as pending with my credit card withina few hours. Laura was very professional", "rating": 5}, {"title": "They are able to collaborate with…", "text": "They are able to collaborate with information and clarification about our doubts, also they do beyond their job to help people who are dealing with health insurance for the first time. ", "rating": 5}, {"title": "Quick response!", "text": "Request for policy changes made via email at 11pm and update made and notice to me by 8am next morning.  Thank you!", "rating": 5}, {"title": "Candy: outstanding customer service", "text": "Candy gave me outstanding customer service.  She understood my frustration with EF Go Tours and the insurance claim.She answered all of my questions and made the process so much easier.  She is professional, knowledge, and helpful.  This woman deserves a bonus.  Note:  I even wrote Seven Corners a separate email!  Thanks Candy ", "rating": 5}, {"title": "Liars and non responsive", "text": "The process of getting the insurance was smooth (they were happy to take our money) however when it came time to pay a medical bill, they reneged on the agreement.My father paid a lot of money for their premium insurance when coming to the US. He needed to go in for an urgent care visit to look at a new rash ne developed. We looked up and went to an in-network provider where per the insurance document, we would only be responsible for the copay. We paid the copay as expected. After my father returned home, we received a bill from the urgent care provider for the full amount (~$300) minus a small adjustment (~$30). Disappointed, I called the provider to find out what the disconnect was and whether they connected with the insurance provider. Turns out they connected with the insurance provider who indicated we the patient was responsible for the bill. I then connected and submitted the bill to the insurance company who never responded after multiple attempts to connect with them.I ended up having to pay the bill in full. Disappointed! Seven Corners are liars. I intend on taking this further. ", "rating": 1}, {"title": "Trip Cancellation vs Cancel for Any Reason", "text": "I called Customer Service to find out if trip cancellation insurance for a destination wedding would cover cancelling the trip if the wedding itself was cancelled. (Answer: not unless I also bought \"Cancel for Any Reason\")  The customer service representative I spoke with was very helpful and kind, explaining things that I hadn't thought to ask about. Although I didn't receive the answer I wanted to hear, she did her job well, and I ended the call with a favorable impression of the company she represents.", "rating": 5}, {"title": "Candy was efficient and prompt in…", "text": "Candy was efficient and prompt in answering my questions about submitting my claims.  She saved me time and assured me that I did not need to resubmit a claim even though I could not view it in my account.", "rating": 5}, {"title": "Jeanette was professional", "text": "Jeanette was professional, answered my questions clearly and thoroughly. She even called me back after we concluded our call to ensure I was clear about a specific issue we discussed. She was correct that I was still confused and due to her callback (went the extra mile) I became clear on what was required in my claim submission. 10 out of 10. ", "rating": 5}, {"title": "Solid travel insurance features", "text": "Two things stand out with Seven Corners:1) The features on their travel insurance policies are the best I've seen at competitive prices.2) The customer service (non-claim related) is prompt, professional, and courteous.I cannot comment on the quality of their claims handling because I've never filed a claim with them (and I hope I never have to because filing a claim implies something bad has happened to me).", "rating": 5}, {"title": "Very helpful", "text": "Candy helped me and she was very patient, helpful and did not treat me like an idiot because I was having trouble with the claim forms. I've had people in the past (other organizations) who are rude because I'm just not understanding.  Candy was so nice and patient.", "rating": 5}, {"title": "I was having difficulty purchasing our…", "text": "I was having difficulty purchasing our plan online. We called the 800 number and were connected with Kendra. She quickly and efficiently took care of setting up our insurance plan. She was friendly and knowledgeable about the product.", "rating": 5}, {"title": "Trip Delay Refund", "text": "I called to ask about why members of the group received $500 more than I did in reimbursement.  I was directed to call EF Tours, which I did.  EF tours recommended I cal back to seven corners with neither being able to give me an answer.", "rating": 2}, {"title": "Client services have always been very…", "text": "Client services have always been very friendly and helpful.  (Candy)", "rating": 5}, {"title": "I would give zero stars if possible", "text": "I would give zero stars if possible.  They took our money but when it came time to pay for trip interruption due to a hurricane, they took two months to drag put asking for asking for documents that Sandals couldn’t provide.  This company is just a bunch of thieves.  ", "rating": 1}, {"title": "What redeems you folks is the…", "text": "What redeems you folks is the performance of Andrea without whose help the tedious process of reimbursement would not have been possible.She was loyal to your company's standards, but honest in dealing with me.  I am indebted to her.", "rating": 4}, {"title": "Didn't pay after GOP", "text": "I had extensive conversations with the agents to ensure that my hospital visit would be covered and a GOP was issued. Then, when the time actually came for them to pay, they refused and said that it was pre-existing (kidney infection...). I submitted evidence to prove that it wasn't but they have just ignored my emails. As if the health issue itself wasn't traumatic enough, I had to pay around $10,000 which I worked so hard to save and enjoy on holiday!!!!!! Appaling", "rating": 1}, {"title": "Agnes was very helpful and courteous", "text": "Agnes was very helpful and courteous. She quickly addressed my policy change and followed up with the confirmation email. ", "rating": 5}, {"title": "Janetta Wade was very helpful", "text": "Janetta Wade was very helpful. She was polite, pleasant and patient with my concerns. Unfortunately, people like this are becoming rare in customer service. She resolved my issue and was a pleasure to work with. ", "rating": 5}, {"title": "Extraordinary positive experience ", "text": "First, you can call and reach a real person. Jona was very pleasant and helpful in explaining the plans. Once our vacation was cancelled due to the hurricane, response time and reimbursement was extraordinary. Our new travel insurance company will definitely be Seven Corners Travel Insurance. ", "rating": 5}, {"title": "Flight delay expense not reimbursed!", "text": "My flight was delayed one day. I had already paid for an AirBNB  at my destination and lost one night due to the delay. Seven Corners refused to reimburse me for this expense because it was a \"prepaid expense\". They couldn't show me a clause in the policy that explained their position. They just said they don't do it.Don't use Seven Corners for your travel insurance!", "rating": 1}, {"title": "Excellent customer service", "text": "We called customer service to find out if delay or cancellation due to illness of a family member was covered under our policy.  Amber was very helpful.  She explained our coverage, how to make a claim, and the type of supporting documentation required.  She followed up with an email also.", "rating": 5}, {"title": "claim forms", "text": "phone rep was very helpful assisting me with refiling information about my claim....my dissatisfaction was with the information required....I filled out a lengthy form which showed that I went to a clinic & saw a doctor & filled three prescriptions & mailed receipts ....very simple....this was why l purchased insurance...the minutia doesn't change that", "rating": 3}, {"title": "A Suggestion", "text": "The person helping me was wonderful; she answered my questions.  One challenge - I called because I didn’t receive any confirmation letting me know my claim had been received. I emailed everything as requested, but no acknowledgement.  Even an automatic reply saying it was received would have saved 15 minutes on the phone waiting.  ", "rating": 4}, {"title": "not happy with how long it is taking to…", "text": "not happy with how long it is taking to refund the insurance money for my trip. Initial request done in April. Supposely a check was issued, sent to correct address, but never arrived.  Requested direct deposit sometime in May. Still no reimbursement and no communication.  I want to know when I will get my money.  I had to pay your insurance in full immediately. This is taking entirely to long. I am now wondering how reputable your company is.  ", "rating": 1}, {"title": "The Best Customer Service You'll Find", "text": "I have spoken with Seven Corners customer service reps several times and each time it has been a pleasure. They are always professional and have knowledgable, helpful answers. In addition, I don't think I have ever had to wait on hold for more than a minute. That in itself is amazing. We travel overseas a lot and Seven Corners' attention to customer service will always make it my number one stop for travel insurance.", "rating": 5}, {"title": "Fake Insurance.  Do NOT Buy. ", "text": "Purchased “cancel for any reason” policy for four travelers from US to Spain.  The air tickets were non refundable. A month prior to departure one of the four decided not to go.  I immediately notified Seven Corners of the cancellation.  I heard nothing.  The three remaining went to Spain and returned.  A week later, Seven Corners states that we needed to cancel the travel at least two days prior.  I notified a month prior.  They refused to pay stating I didn’t meet the requirements.  What a complete and total ripoff.  They had no interest or intention of paying.  Just looking for reasons to deny. Thanks for the reply.  Of course the need to notify the airline and get a cancellation would have been good to know when I notified you 30 days prior to the trip. You ignored my request for guidance and waited until after the trip to inform me.  Doesn’t sound fair to me.   You dropped the ball and I pay the price ", "rating": 1}, {"title": "Same as most insurance companies", "text": "Same as most insurance companies; they will go extra 7 miles not to pay the claim. At the end you will figure out that you spent more time than the claim is worth. I don't understand how they got good reviews, and why I trusted these reviews before buying policy with Seven Corners. No, I do not recommend them ", "rating": 1}, {"title": "Affordable trip insurance with responsive customer service.", "text": "This was a first time test for my wife and I to consolidate a single trip insurance policy provider for a multi-stop international trip with various airline carriers and a liveaboard diving operation.  Tristan, Richard and Laura assisted with teaching us, providing a thorough understanding of the coverage, and important documentation needed from us, in the rare event that we would be forced to file a claim for all or a portion of the eight week, six country trip.  Being recently retired, we're now extending trips and destinations.  We researched and always questioned whether or not it was more beneficial, both financially and for simplicity, of purchasing a single policy or with each airlines and, then a single policy for the liveaboard.  Seven Corners was referred to us by Divers Alert Network (DAN) as a reasonably priced and thoroughly vetted insurance provider.  We're giving it a test for this particular trip and are already feeling good vibes for the decision.  I'll let you know more, in the rare event we need to file a claim (hopefully not!), and how the process works.  Setting up the policy was affordable and efficient.  The Reps mentioned greatly assisted teaching us what was needed.  This is one of our most complex trips to date, but we're just getting started.  Thanks. ", "rating": 5}, {"title": "Proof is in the pudding", "text": "There are many travel insurance companies but I've only ever used Seven Corners and I have reasons to continue.  My most recent experience has been with customer service representative Tristan S.  My questions got into the weeds about what the car rental insurance covered (not spelled out on the website) and how to structure insurance for a travel partner that doesn't live with me.  Tristan had a great attitude, didn't rush me off the phone and got back to me with all my answers.  It was a pleasant experience.  The service solidified my experience with Seven Corners who had handled my claim from a prior trip better than I could have expected.  I suggestion Seven Corners to my contacts that are traveling. ", "rating": 5}, {"title": "Ting-Yu, Lin_Candy", "text": "Candy's explanation is very clear. She's very patient in confirming the informations for me and being very productive and prompt in my inquiries.", "rating": 5}, {"title": "It was quick", "text": "It was quick, efficient, and courteous.", "rating": 5}, {"title": "Every person I have talked with at…", "text": "Every person I have talked with at Seven Corners has been courteous and knowledgeable, and I have used Seven Corners for several European trips.  Also, they are in the US and are easy to understand. Janetta was especially helpful when I checked on an issue this morning. Carolyn Watson", "rating": 5}, {"title": "Poor customer service", "text": "Poor customer service. The Manager is very rude and disrespectful. Needs training and basic phone skills. I would not recommend or trust this pharmacy at all. Clearly they hire anyone off the street with no common sense or education. ", "rating": 1}, {"title": "Employee Performance", "text": "The employee on the phone was very pleasant, helpful, and knowlegable.", "rating": 5}, {"title": "Great customer service", "text": "After purchasing a basic plan, I changed my mind and decided I'd rather have the plan that my advisor, Troy, had initially recommended. He was very easy to reach and he was able to cancel the policy and arrange for the coverage I wanted. My call was transferred to accounts, and Agnes was able to process the refund quickly. Both were very professional, personable and helpful. Received confirmation emails of the new policy and the refund within minutes. I am a repeat customer and found the rate to be competitive.", "rating": 5}, {"title": "The process was awful", "text": "The process was awful.  I am in the insurance business and understand underwriting and claims but to take 30 days every time I supply information you ask for is there unacceptable.  SC would say they need info from EF Tours, I would call EF and they said they sent it to SC.  Then I call SC and they say they don’t have it then look and find it, then tell me it will be 30 days:  I shouldn’t have to call everyone to make sure they are doing their job.  I lost weeks in this process due to the inefficiency of SC.  Will not use again.", "rating": 1}, {"title": "Highly recommend Seven Corners", "text": "I had to file a claim for a medical reason.  The claims process was straightforward and easy to get through.   I had a few questions and a representative spent time with me over the phone to get all the correct documents in place and uploaded.  They were extremely helpful.  The claim was processed way faster than I had expected and I was given 100% reimbursement.   I was so relieved.   I would highly recommend Seven Corners for all travel insurance needs.", "rating": 5}, {"title": "Good customer service, and paid out claim in timely manner", "text": "Claim processing was simple and clear. Customer service team was very helpful, patient and courteous and answered my questions in detail ( thank you Candace!)Had to use the emergency room and had an overnight hospital stay, and the Seven Corners plan covered majority of the expenses. I did have some pending amount which was not covered by insurance, but overall the insurance company did a good job. I had heard of  experiences where many claims get denied or paid in part, but luckily in my case, the Seven Corners plan paid out most of the hospital bills. They worked directly with the hospital and i did not have to intervene. My experience with them was very good and will be using them again", "rating": 5}, {"title": "Worst travel insurance experience ever! 8/19/19", "text": "Worst travel experience ever!! We were scheduled for a trip of a lifetime for our 50th anniversary.  After arriving at the airport flights were being grounded due to weather after sitting for 5 hrs waiting for our flight it was finally cancelled. The airline had no other flights available for the next 48 hrs. Which meant our tour had already started overseas. So we went home and filed a claim. Our claim was denied.  I filed another claim and spoke to agents to no avail.  Then my 2nd claim was denied.  Needless to say...never again!!", "rating": 1}, {"title": "Best Customer Service experience…", "text": "Best Customer Service experience ever!!!!Bought last minute policy 9/28 for travel on 9/30 and had to cancel due to a change on how many people need to be covered. Called up on Sunday 9/29 and agent (Heather K.) helped me book new policy and cancel old policy in a span of 15 minutes. On top of that the wait time to connect to live agent was less than 5 minutes!!!", "rating": 5}, {"title": "Representative was great, the software wasn't", "text": " The representative answered promptly and was able to  answer my questions. That said, the reason I needed to call is that your claims software did not let me proceed past step five after I had saved the claim and returned to it.  I could also not submit my paperwork by uploading  to your site and had to send things in via email.", "rating": 4}, {"title": "Excellent customer service!", "text": "Excellent customer service! I spoke with a representative named Amber H. today, and she listed to my concerns, assured me regarding the claims process, and even provided tips for me to follow up with the claims team. She was not only knowledgeable and helpful, but friendly and empathetic as well. ", "rating": 5}, {"title": "Very friendly", "text": "Very friendly, professional English speaking representatives. Process took a month, but they made good on our unfortunate claim. Only reason not 5 star is website would not cooperate necessitating several extra phone calls. ", "rating": 4}, {"title": "I am able to travel with confidence…", "text": "I am able to travel with confidence that should a situation arise, my needs are covered by my travel insurance plan. I also appreciate the pay as the expenses occur.", "rating": 5}, {"title": "Gotta say it was an easy process and my…", "text": "Gotta say it was an easy process and my medical cost was covered in full quickly after I submitted my claim. ", "rating": 5}, {"title": "Good policy, not super fast with a claim", "text": "I don't like trip cancellation insurance because there are too many limitations about what qualifies as a legitimate cancellation.  Besides, most tour companies will postpone your trip with little or no penalty and most airlines will give you a flight credit.  Seven corners offers a policy that is primarily medical coverage with excellent limits for somewhere between 1/10th to 1/15th the cost.  I had to recently make a claim with them for trip delay.  The claim process is pretty slow, but they paid the maximum coverage.", "rating": 4}, {"title": "Seven Corners Came Through for Us", "text": "My girlfriend and I purchased a trip protection annual multi-trip plan from Seven Corners.  Two days before we were scheduled to embark on a three-week hiking, kayaking, biking trip to British Columbia, we both tested positive for COVID and Type A flu.  We had to cancel our trip, which involved more than $6,000 in nonrefundable costs.  I called a Seven Corners customer service representative, who was extremely helpful in explaining what was needed to file a claim.  My girlfriend and I each provided the necessary documents on July 25 via email. On August 9, we each received an email, saying that Seven Corners had approved our claims for the full amounts.  On August 12, we each received e-checks.  The quick service from Seven Corners helped take the sting out of our cancelled trip and confirmed our decision to use their travel plan.  ", "rating": 5}, {"title": "Clear explanation of policy before the trip", "text": "We bought a travel insurance from Seven Corners for trip to Europe. We still had some questions before the trip and called the company. Candace in customer service answered all our questions and explained the policy very clearly. Thank you!", "rating": 5}, {"title": "I feel 7-Corners is a kind company and…", "text": "I feel 7-Corners is a kind company and the assistance from Candy was kind and thoughtful as well as apologetic due to my claim not being with this company and she kindly past me to FALCK, whom I dealt with while on tour and they are AWFUL!!!!!!!!!!!! Seven Corners isn't handling my claim and Candy was delightful, I hope I NEVER EVER HAVE TO DO THIS AGAIN!!!!!!!!!!!!!!!!!!!!!!", "rating": 3}, {"title": "Great Customer Service", "text": "Letitia was kind, patient and extremely helpful.  She did not make me feel as though I was annoying her in any way.  Sweet personality. ", "rating": 5}, {"title": "SCAM INSURANCE", "text": "I don't even know what I can say about this insurance, it's a totally scam and they agents on the phone are very rude and disrespectful. My younger brother is currently lying dead in a mortuary fridge in Africa over two weeks now. Two days following my brother's death, we informed them about it and our incapacity of paying the repatriation costs up front. But they keeps telling us that we have to pay and submit for reimbursement although we told them several times that we are unable to do so. because the hospital bill we paid before his passing was too high.Seven corners is full of cruel people. Even though the policy certificate clearly states that in case of death of the insured, the insurer will arrange direct billing with the funeral home to repatriate the insured back to his country of residence. But they keep denying a deceased person access to his rightful benefits.I ADVISE ANYONE WHO WILL READ THIS TO BE AWARE OF THIS INSURANCE, BECAUSE IF SOMETHING HAPPENS TO YOU WHILE ON JOURNEY THEY WILL JUST ABANDON YOU LIKE THEY ARE DOING WITH BROTHER. THEY ARE JUST FAST ENOUGH TO COLLECT YOUR PREMIUM WITH FALSE PROMISES. AMERICANS DESERVE BETTER. SEVEN CORNERS IS A CRUAL AND CRIMINAL ORGANIZATION. PLEASE BEWARE!!!!!!!", "rating": 1}, {"title": "Knowledgable", "text": "Patient, courteous, helpful and knowledgable.", "rating": 5}, {"title": "Austria hospital visit", "text": "Very positive first time experience with 7 Corners. We took out a policy for medical coverage for our trip to Europe this winter. My wife got sick in Austria with a sinus infection and bronchitis resulting in hospital & pharmacy charges. We submitted a claim form online when we got back home. The claim process required a fair amount of documentation but was straightforward. We received our check in the mail w/in a few weeks. Will definitely use 7 corners again for our future travels. ", "rating": 5}, {"title": "It was great because I was attended to…", "text": "It was great because I was attended to swiftly, kindly and with great professionalism. To cap it up, i became more clarified and aware after the conversation ", "rating": 5}, {"title": "Terrible customer service, they will do all they can not to pay", "text": "Just don't, 1st their number IS NOT 24 hours, landed in Rome on a Saturday morning, no luggage I was beside myself, once I got past all the airline issues and to the hotel I called the toll free number and got a recording that they are only open weekdays. I have no luggage, no clothes, nothing, When I finally do get in touch with a human, they open a claim but cannot do anything until the airline has done what they need to do??? I bought insurance for just this reason, I now have to go our and buy everything to get on a cruise ship. No advance money, no direction, nothing.  After this call, I was not able to speak to a human again. I got emails with my \"adjusters\" name but no phone number. When I could get a live person, they said they do not put calls through to the adjuster at all. I had to spend thousands and get no help from them. After two months, the airline finally settled, pennies on the dollar for what I lost and what I spent. During the process, I send Seven Corners everything, copies of every claim form, receipt, email, and letter from the airline. They kept requesting it again and again and giving me excuses why they have not settled. Never able to speak to a human, I finally get a letter that they were only going to pay the $500 deductible on the delayed, portion and the $500 deductible on the missing portion. Between the airline and Seven Corners I am out a ton of money. The policy was worthless, the service was terrible", "rating": 1}, {"title": "Janette Wade was easy to understand", "text": "Janette Wade was easy to understand. She was sympathetic to our problem and clear in her instructions. She was very prompt in sending the information we needed. I wish all my customer service interactions went like my experience with Janetta. ", "rating": 5}, {"title": "Years of taking my money, but claim refused on a technicality", "text": "I had been repeat client for many years, paid several thousands of dollars in premiums, but the ONE time I had a claim, a claim which was less than that policy’s premium, it was denied on a technicality. The symptoms of my condition didn’t initially warrant a doctor’s visit, but it worsened over some months and ended up needing a small surgery. However, but because I didn’t seek medical attention within 30 days, even though the condition was extremely minor at first and wasn’t guaranteed to need medical intervention anytime soon, they denied the claim. If they were going to deny the claim for that reason, they could have done so immediately. Instead, they requested several documents as if they were going to pay the claim, but after a quite long review time by Lloyds of London (hardly a cash-strapped entity), it was rejected. Then, I was told by the sales team that due to changes in the laws of my home state, they could no longer insure me, which is weird because I’m now covered by one of their competitors who indicated there’s no problem whatsoever giving me insurance. I thought they were a reputable insurer, but they gladly took my money and yet found an arbitrary reason to deny my claim, a claim that was LESS than the amount I had paid them for the policy...then they suddenly couldn't insure me anymore.", "rating": 1}, {"title": "Give Julie a raise", "text": "Though I hope I never will have to make a claim, I am very grateful to Agent Julie Holtzapple who has walked me through the plans, advised me on the details, sent me the information promptly and continues to take care of my questions.  That Seven Corners values us as customers by having caring and expert agents like Julie gives me confidence in your company.  Give Julie a raise and the other agents, too.  They are the heart and soul of your success.", "rating": 5}, {"title": "Excellent service thank you for your…", "text": "Excellent service thank you for your support!", "rating": 5}, {"title": "Excellent Customer Service", "text": "Your company has handled my claim very timely and approved the claim as submitted.  Your customer service staff is very knowledgeable and helpful. I really appreciated the emails that were sent.", "rating": 4}, {"title": "Super easy", "text": "Quick, easy and super affordable.", "rating": 5}, {"title": "Great Customer Service", "text": "I called about a claim that I submitted in November. Schuyler was the person I talked to. She was fantastic. She has a very calm demeanor and extremely professional AND I could understand her. I thank Seven Corners for keeping jobs in the US. She led me in the proper direction and offered to resend anything I needed. I'm not used to getting customer service like this anymore. I felt she actually cared about helping me rather than trying to rush me off the phone.", "rating": 5}, {"title": "Great customer service", "text": "Laura was kind, cheerful, and helpful, and answered my questions very quickly, alleviating any concerns about potential policy changes. Thanks!", "rating": 5}, {"title": "Representative could not help me but another did the next day", "text": "Representative could not help me.  Attachments would not attach.  She could not help me in any way except saying try again later.I was very surprised when another representative from Seven Corners contacted me the next day.  She had investigated my problem and told me how to submit my claim.  She said she would personally make sure that it went through correctly.", "rating": 5}, {"title": "I contacted Seven Corners just to…", "text": "I contacted Seven Corners just to inform you that we had difficulties with our flights from Portland to Sidney, Australia and that we would be submitting a claim within a week or so after completing our cruise on 5/12/24. The person I spoke to was very professional and listened to the details of our journey to date. She said that she would open a file afterwards. Thanks. Gary Jacobsen ", "rating": 5}, {"title": "Seven Corners customer service is…", "text": "Seven Corners customer service is excellent.  Amber is very friendly and helpful. ", "rating": 5}, {"title": "Quick helpful service", "text": "I found out that we needed to cancel our trip due to my son tearing his shoulder, rotator cuff. His surgeon is not comfortable with him going to Africa now so we had to cancel our trip. I called and the agent answering the phone told me we could all reschedule our trip when my son's doctor felt comfortable he had healed enough to not damage the shoulder. They were so helpful and nice and so I am working with a tour company to rebook us for 2025. We were going to Africa for my 70th birthday so we will celebrate my 71 birthday next year in Africa. Also when it happen I thought \"Thank God\" I had insurance!", "rating": 5}, {"title": "Learn From Our Experience. Do not use Seven Corners For Travel Insurance", "text": "When we bought travel insurance we paid extra to get \"cancel for any reason insurance\" thinking that if we had to use it, it would be a simple and fast process. At least this is what they lead you to believe.And guess what, we did need to use it. It's been a month sense we filed a claim and all that's happened is once a week or so we get a automated email from them saying a claims agent is reviewing our claim.In the mean time we want to book another cruise and need our refund.Trust me, we will NEVER use Seven Corners again and I would advise you to learn from our experience.06/28/2024 Update:My Trustpilot review got a response.They said I would be hearing from someone today regarding my claim, and guess what, I got a email from them saying \"You should be hearing back from our claims team soon\". Pretty much the same canned response they have been sending my every week or 10 days !!!!UPDATE (07/02/24)Here it is closing in on two months and still nothing of substance from there claims department (THIS IS A CANCEL FOR ANY REASON !!!!). I'm wondering just how many employee's they have. I guess they could be a very same company, so If one person goes on vacation everything grinds to a halt. Either that, or it's just there policy to stall there customers hoping your give up and go away.", "rating": 1}, {"title": "Agents are very knowledgeable and…", "text": "Agents are very knowledgeable and helpful. They explain your options and what coverages you may or may not need. Luckily, I have not had to file a claim but I would expect from their star rating, that they would be both helpful and trustworthy to pay what is owed based on your policy, both quickly and efficiently.", "rating": 5}, {"title": "I have had to call Seven Corners two…", "text": "I have had to call Seven Corners two times now. Not for a claim or any inaccuracy in my policy. I just needed to update the terms of my existing policy and to ask a few questions. Both times, my wait time was minimal and the customer service representative was highly efficient and prompt and did exactly what she said she would do. I will continue using Seven Corners. I have never had a claim as of yet, so I can not speak to their efficiency in that regard however. ", "rating": 5}, {"title": "She was humble", "text": "She was humble, respectful, and was able solve my queries and requests in a very professional manner. ", "rating": 5}, {"title": "So far everything has been quick and…", "text": "So far everything has been quick and efficient. Customer service has been excellent Claim not finalized yet. But feel confident it will.", "rating": 4}, {"title": "ENJOYABLE EXPERIENCE", "text": "ENJOYABLE EXPERIENCEThe representative I spoke on 4/17/2024  was knowledgeable and friendly.  I merely wanted to have the policy indicate we were traveling to the Netherlands as well as Spain and she was able to make this change to the policy immediately.  She also sent revised documents to me.  The whole experience was easy and pleasant.John Torrente", "rating": 5}, {"title": "The fact that they actually communicate…", "text": "The fact that they actually communicate with you.  Your team answered voicemails in a timely manner.  I hate getting prompts telling me to press 1 to talk to someone!  With seven corners they gave me their direct number.  So nice to be able to talk to a person instead of a machine!", "rating": 5}, {"title": "Great customer service!", "text": "After my travel insurance cancellation date, I decided I wanted to change my cruise to a different itinerary but hadn't decided yet. They promptly said they would issue me a credit and it would be good until 5/26.  Promptly got the follow up email supporting this. ", "rating": 5}, {"title": "Stranded by Sevencorners- underwriter break-up", "text": "For decades myself and colleagues have used seven corners due to ease to extend a policy due the nature of our contracts never knowing length of time out of the country that is market extension can go for upto 365 days. I trusted messaging to arrive around 2 weeks before a policy would expire reminding me to extend. No email came and online renew told me to contact customer service which I did. Days passed and a few hours before expiration a response told me i can't renew. A phone call revealed they had ended their relationship with the underwriter of that policy. No contingencies were made for those out of the USA stranded with no ability to get another Seven Corners product as they don't cover once travel has begun. No communication ahead of time so one can prepare. How many others will find themselves stranded out of the USA with no coverage options. The told me to goto an aggregator to ind coverage, but nothing is working out for me as I am out of the USA. Added: Customer service did email a while later and was unable to sort me out with a policy that covered me given I was out of home country.  They referred me to an aggregator website where I was unable to find coverage given I was already on travel. For decades I always got policy renewal notices other than this time with no warning a renewal option would not be offered like it always had been. So sad as I’ve always really appreciated the humans I interacted with at the company for well over a decade. ", "rating": 1}, {"title": "Quickly Answered My Questions ", "text": "Answered my questions and sent required forms by email and suggested I fill them out and return them to that email address and they would be uploaded to my already filed claim. Great customer service", "rating": 5}, {"title": "Autumn was very clear and concise in…", "text": "Autumn was very clear and concise in helping me with my request. In my experience I am quite often confronted in a situation like this with someone who barely  has a command of the English language.Good hire on your part. Cert # 1TPC23-AOS-132304", "rating": 5}, {"title": "Great customer support", "text": "The customer support person was super helpful and walked me through the process of filing out the application.  She caught that my account number was wrong which would have slowed thing down.", "rating": 5}, {"title": "Customer service was patient and…", "text": "Customer service was patient and informed on what I needed. Was able to resolve my issue by providing me with the information and documents I needed to fill out.", "rating": 5}, {"title": "Thank You", "text": "I felt confident and relieved to have purchased an insurance before leaving for the trip. The unexpected and unfortunate situation happened that my father had a stroke during our trip. Seven Corners insurance answered questions quickly and efficiently. When I was ready to fill out the claim I was too overwhelmed to find my way in the website.  I called the company and received assistance immediately.  The representative was so courteous and patient that she remain with me on the phone until I completed the claim.The support I received in this difficult situation is greatly appreciated.  During unexpected situations when is hard to think and simple things can be hard to do, angels come along.  Thank you madam, did not get your name, for being so helpful in this process.Thank You", "rating": 5}, {"title": "I had a claim to file", "text": "I had a claim to file, and Andrea was an amazing customer servicie provider, guided me thru all the claim forms that I needed to fill out, over 40 minutes, very helpful knowledgeable and super patient.Thanks you Andrea ", "rating": 5}, {"title": "The lady helped me to fix my online…", "text": "The lady helped me to fix my online account by spending a lot of time with me. ", "rating": 5}, {"title": "Candy was so helpful walking me through…", "text": "Candy was so helpful walking me through the claims forms. I couldn’t have figured it out without her.Deb", "rating": 5}, {"title": "Call was promptly answered", "text": "Call was promptly answered. The agent was pleasant and checked to ensure my updated cost fell within the time sensitive period. Shortly thereafter, I received  a confirmation email of the change.", "rating": 5}, {"title": "The customer service reps helped me…", "text": "The customer service reps helped me fillOut the claim for my husband and I since I had difficulty understanding how to do both.  They were kind, patient and very knowledgeable .  It was a pleasure working with both representatives!", "rating": 5}, {"title": "She was sooo very helpful", "text": "She was sooo very helpful.  She gave me the information I needed to fill out my travel insurance claim form with accuracy.   She was professional, personable and truly a pleasure to work with.   She needs a raise !  :) ", "rating": 5}, {"title": "Reimbursement information ", "text": "I didn’t realize I would only get 75% of trip cost if cancel. Only saw that trip interruption would be reimbursed 150%.", "rating": 4}, {"title": "Great service", "text": "Call was answered quickly. Good telephone connection. Agent was knowledgeable and easy to understand--sounded like English was first language. Transaction (change in policy) was completed quickly. ", "rating": 5}, {"title": "Our recent purchase through Squaremouth…", "text": "Our recent purchase through Squaremouth autofilled in incorrect dates for the policy so I called Seven Corners to talk to an agent.  She was extremely courteous, helpful, and understanding and quickly corrected the problem.", "rating": 5}, {"title": "Courteous and professional service", "text": "I called to reassure I had done everything I needed and that my claim had arrived. I was happy to know everything had arrived safely and they were working on my claim. The lady I talked to was professional sweet and reassuring. Thank you it’s rare these days to get someone so good. I was so happy with her service 😊🌷 3E761793E543", "rating": 5}, {"title": "Janetta Wade in the Customer Service…", "text": "Janetta Wade in the Customer Service office did a wonderful job with my inquiry. She was professional and caring all whilst helping me resolve my problem I was experiencing filing a claim.She delivered excellent customer service!", "rating": 5}, {"title": "Taking so long to resolve even though…", "text": "Taking so long to resolve even though documentation has been provided long ago.", "rating": 1}, {"title": "Customer service was amazing and helped…", "text": "Customer service was amazing and helped me walk through all my problems.  They are willing to protect our mission work in areas the others would not even consider.  ", "rating": 5}, {"title": "Candy was very helpful and informative…", "text": "Candy was very helpful and informative about how to go about a claim.", "rating": 5}, {"title": "Very helpful service representative", "text": "Very helpful service representative - Ami Bolin helped us sort out some online issues we had.  Super friendly.", "rating": 5}, {"title": "Great service with SEVENCORNERS", "text": "I am very much satisfied with your great service.  Please keep on doing it.Blessed ", "rating": 5}, {"title": "Excellent service", "text": "Answers were quick & correct. The staff was friendly & helpful.", "rating": 5}, {"title": "Skylar", "text": "Skylar, the customer rep, was great. I noticed an error in the name listed on my ID card and letter for an upcoming policy and she fixed that on the spot. Thank you!", "rating": 5}, {"title": "Second time using for our Trip…", "text": "Second time using for our Trip Insurance, very easy to use and included everything we needed in the insurance.", "rating": 5}, {"title": "Skylar DeBruyn answered all of our…", "text": "Skylar DeBruyn answered all of our questions with expertise and good rapport. We asked to record a message regarding the great call we had with her.", "rating": 5}, {"title": "Policy questions after purchase ", "text": "I called to ask a few questions about the new policy I purchased online and I had a very nice and helpful person on the phone that answered all of my questions.", "rating": 5}, {"title": "I think these annual plans are very…", "text": "I think these annual plans are very comprehensive covering all areas well, and are also a good value when comparing to other annual plans.  I highly recommend Srven Corners for your travel insurance.", "rating": 5}, {"title": "The agent i spoke withSkylar", "text": "The agent i spoke with, Skylar was so kind.  Her voice was clear and easy to understand.  She made sure I was k with all the info she was giving to me.  She showed concern and care.  she eased my concerns about submitting a claim and how to do it.  She was through.  Thanks so much", "rating": 5}, {"title": "Candy was bright and professional!", "text": "Candy was bright, chipper and professional. She helped me with what I needed to know to prepare my claim and I thank her for her assistance!", "rating": 5}, {"title": "All my questions were answered", "text": "All my questions were answered. Kandy ( I hope I write their name correctly) was so helpful - they provided clarification on my insurance policy and all additional details beyond what I expected.Their acknowledgement of the complicated healthcare system and the need for clarification is also very important.Overall, I appreciate their time and resources provided.", "rating": 5}, {"title": "I was served by Andrea", "text": "I was served by Andrea, who was gracious and very supportive. Every question I had she answered and sent me supportive information. ", "rating": 5}, {"title": "We had no issues that required using…", "text": "We had no issues that required using the insurance. I do like the ease of purchasing healthcare as primary insurance and adjusting the amt of insurance as needed. ", "rating": 5}, {"title": "Exceptional staff great customer…", "text": "Exceptional staff great customer service! Andrea totally nailed it helping me submit a somewhat complex medical expense travel claim with ease! She was extremely patient and professional. The whole experience with SC customer service from purchase to submitting a claim has been excellent!", "rating": 5}, {"title": "The website was clear and easy", "text": "The website was clear and easy to navigate. When I had to make a change of dates the person who helped me was very pleasant and efficient. ", "rating": 5}, {"title": "Amber was great", "text": "Amber was so kind and helpful! Very professional and patient.", "rating": 5}, {"title": "Horrible company that hides behind its…", "text": "Horrible company that hides behind its small print to deny claims. ", "rating": 1}, {"title": "Peace of Mind knowing that if something…", "text": "Peace of Mind knowing that if something caused a travel problem, the insurance was there to protect me", "rating": 5}, {"title": "Great customer service", "text": "Great customer service! I was provided all necessary information.  This was a plan I purchased in 2/2023 for my trip 4/2024.", "rating": 5}, {"title": "Updates made easy", "text": "Every time I have called to ask questions I get polite responsive answers. The info is always very helpful. ", "rating": 5}, {"title": "My conversations", "text": "The people that I spoke to were helpful, listened and helped me to be comfortable making changes to my policy/", "rating": 5}, {"title": "Excellent service", "text": "The operator was friendly and eager to help. They know their job perfectly, and we resolved the issue in no time.", "rating": 5}, {"title": "We had to cancel our cruise before…", "text": "We had to cancel our cruise before departing, and Seven Corners let us save our insurance premium for a future cruise.", "rating": 5}, {"title": "Skylar was very helpful with…", "text": "Skylar was very helpful with information I called about. Also, very patient with my phone cutting out.", "rating": 5}, {"title": "Do not trust Seven Corners-I would give this company zero stars if…", "text": "I would give this company zero stars if I could. I purchased Cancel for Any Reason Insurance on 2/28/23 for a trip to the Middle East, which we canceled prior to any penalties, later in 2023. I was advised by a Seven Corners agent that I could simply shift the policy for our replacement trip to Japan in 2024, and I specifically asked in writing whether our Cancel for Any Reason benefits remained intact. I was told in writing that they would, so I trusted the Seven Corners agent that I was fully covered. Had I not been told this, I would have purchased new insurance. I indeed had to file a Cancel for Any Reason Claim but felt comfortable, based on the Seven Corners agent's assurances by email regarding my policy, that my claim would be straightforward. Additionally, I have my policy statement for the new trip showing the initial deposit date as 2/10/23. I just received notification three months after filing the claim that Seven Corners has rejected my claim, stating that my initial deposit date (which they revised and are now saying was in May 2023 even though it is listed on my official policy as 2/10/23) was after my insurance purchase, not within the 20 day window as required, in spite of the documentation that the initial deposit was within 20 days, a email request from the claims reviewer to provide proof of that documentation (stating in that request that 2/10/23 was the \"initial deposit date,\" which later the company, in its denial, says it was not), and the email from their agent stating that my Cancel for Any Reason benefits remained intact for the new trip to Japan. I am most disappointed and have filed an appeal including this documentation. In the meantime, do yourself a favor and please do not trust this company. I purchased an expensive policy in good faith and followed the advice of their agent and claims reviewer, only to find that they denied my claim based on information that is not what is clearly listed on my policy (initial deposit date) and was advised in writing by their own agents. If their agents made a mistake and misadvised me in writing, I should not be responsible for that, nor should I have an expensive claim denied on that basis. You would be wise to steer clear of this company.", "rating": 1}, {"title": "24F5335681B8 claim information ", "text": "Janette answered my questions and gave me helpful information about my claim24F5335681B8", "rating": 5}, {"title": "The agents are friendly", "text": "The agents are friendly, knowledgeable, and helpful. I will definitely use them again!", "rating": 5}, {"title": "My call was answered quickly and the…", "text": "My call was answered quickly and the solution was explained to me in a very understandable way.", "rating": 5}, {"title": "Great Customer service", "text": "I contacted customer service to clarify some policy questions and Candace, who supported me, was super helpful. I am satisfied with the customer service so far.  ", "rating": 5}, {"title": "Superb customer service! ", "text": "When calling to follow up on claim inquiry, the call was instantly answered by a fabulous, friendly, professional, knowledgeable, and helpful representative. I was VERY impressed! ", "rating": 5}, {"title": "Quick, clear advice from Candy @ Seven Corners", "text": "The representative, Candy, answered my questions about documenting claimed expenses very clearly and quickly. My situation was complicated because of (i) a combination of payments and refunds, and (ii) inadequate documents from the tour provider. ", "rating": 5}, {"title": "Great agent  ", "text": "The agent was very friencly and knowledgable.  She understood my issue and corrected my mistake quickly and accurately.", "rating": 5}, {"title": "Great Customer Service", "text": "I was able to extend the travel insurance on the phone with Scarlett, the insurance specialist; and received a confirmation email in less than a minute.", "rating": 5}, {"title": "Great experience", "text": "Overall, the wonderful experience for booking the policy as well as calling for cancellation due to unexpected changing. The agent was super helpful and efficient! Thank you. ", "rating": 5}, {"title": "They were very helpful with any issues…", "text": "They were very helpful with any issues that came up. Very professional !", "rating": 5}, {"title": "customer service was very helpful and…", "text": "customer service was very helpful and presented an alternative way to file a claim when I had difficulty with the online form. ", "rating": 5}, {"title": "easy to set up this insurance for my…", "text": "easy to set up this insurance for my trip and the price was fair", "rating": 5}, {"title": "She was very knowledgeable", "text": "She was very knowledgeable, helpful and kind", "rating": 5}, {"title": "Very helpful and prompt action", "text": "Date of experience: September 26, 2024", "rating": 5}, {"title": "Excellent customer service", "text": "Excellent customer service. Very friendly and helpful. I would highly recommend thus company for travel insurance", "rating": 5}, {"title": "The operator was very helpful and…", "text": "The operator was very helpful and informative. She explained the procedure with claims in details and made the things easier to understand.", "rating": 5}, {"title": "Excellent customer service", "text": "Excellent customer service. Answered all my questions and followed up with email. ", "rating": 5}, {"title": "Submitting a claim", "text": "Information and clarity on what to do to submit a claim was very helpful.", "rating": 5}, {"title": "Tristen was very helpful in getting…", "text": "Tristen was very helpful in getting travel insurance setup.", "rating": 5}, {"title": "Questions about our recent policy purchase ", "text": "Very helpful and answered my questions about our coverage.", "rating": 5}, {"title": "Clear response to questions", "text": "Date of experience: August 27, 2024", "rating": 4}, {"title": "I was able to get information regarding…", "text": "I was able to get information regarding my trip coverage quickly and easily. ", "rating": 5}, {"title": "Good People Ready to Assist ", "text": "Good people ready to assist me an d excellent outcome.", "rating": 5}, {"title": "Excellent Customer Service Experience", "text": "Great phone agent, got us just the information we needed.  Thanks!", "rating": 5}, {"title": "The representative who took my call was…", "text": "The representative who took my call was extremely helpful and friendly. Truly a great representative!", "rating": 5}, {"title": "She is so nice and kind", "text": "She is so nice and kind. Every problem was solved by her. I really appreciate it.", "rating": 5}, {"title": "RV Breakdown", "text": "I had to make changes to my travel dates because the RV broke down.  Your agents were very helpful.", "rating": 5}, {"title": "Skyler helped me with all my inquiries", "text": "Skyler helped me with all my inquiries ", "rating": 5}, {"title": "Easy to understand", "text": "Easy to understand! Quick response to change!", "rating": 5}, {"title": "The Seven Corners representative was helpful and solved the problem.", "text": "The Seven Corners representative was helpful and took care of the problem. ", "rating": 5}, {"title": "Helpful and friendly customer service", "text": "The rep I spoke to was not only helpful but also very friendly and pleasant.   ", "rating": 5}, {"title": "Great Customer Service with Laura!!", "text": "Date of experience: August 26, 2024", "rating": 5}, {"title": "Agents are very helpful and…", "text": "Agents are very helpful and Knowledgeable.", "rating": 5}, {"title": "Agents were very helpful and…", "text": "Agents were very helpful and straightforward.", "rating": 5}, {"title": "Agent polite and easy to understand.", "text": "Date of experience: June 11, 2024", "rating": 5}, {"title": "Took care of me right away and it was…", "text": "Took care of me right away and it was effortless ", "rating": 5}, {"title": "Good customer service ", "text": "Questions answered by competent agent ", "rating": 5}, {"title": "Skylar was friendly", "text": "Skylar was friendly, and helpful.", "rating": 5}, {"title": "Outstanding customer service👍👍👍👍👍  Will…", "text": "Outstanding customer service👍👍👍👍👍  Will recommend you to anyone who needs a reliable travel insurance. Carola", "rating": 5}, {"title": "Sven was great and helped me a lot.", "text": "Date of experience: October 10, 2024", "rating": 5}, {"title": "The professionalism of the customer service staff ", "text": "The professionalism of the customer service staff. She was courteous and polite.", "rating": 5}, {"title": "Easy to select the right policy", "text": "Easy to select the right policy. Value for what I’m getting. ", "rating": 5}, {"title": "representative Andrea was extremely…", "text": "representative Andrea was extremely informative and sent me a claim form within 2 minutes  ", "rating": 5}, {"title": "Staff was courteous and knowledgeable", "text": "Staff was courteous and knowledgeable ", "rating": 5}, {"title": "Gave me exactly what I wanted and saved…", "text": "Gave me exactly what I wanted and saved me over $1,000!", "rating": 5}, {"title": "Prompt", "text": "Prompt, clear and professional advice", "rating": 5}, {"title": "Efficient and effective", "text": "The associate was kind, efficient, and helpful.", "rating": 5}, {"title": "Excellent customer service.", "text": "Excellent customer service. ", "rating": 5}, {"title": "Excellent communication and clarity", "text": "Excellent communication and clarity.  Effective and quick responses and process. Pleasant demeanor and style.", "rating": 5}, {"title": "Kind and quick", "text": "Kind, patient, and quick help when I needed it. Thank you!", "rating": 5}, {"title": "Fast customer service ", "text": "Great service ", "rating": 5}, {"title": "Very helpful.", "text": "Very helpful. ", "rating": 5}, {"title": "Good service", "text": "Good service ", "rating": 5}, {"title": "Great customer service", "text": "Easy online quotes and coverage information.  Provides coverage to senior 70+!", "rating": 5}, {"title": "Quick help with detailed information", "text": "Quick help with detailed information. Friendly customer service. ", "rating": 5}, {"title": "great service by Joan", "text": "Date of experience: July 18, 2024", "rating": 5}, {"title": "Very helpful agent", "text": "Date of experience: May 01, 2024", "rating": 5}, {"title": "Fast courtesy service", "text": "Fast courtesy service ", "rating": 5}, {"title": "Great communication and professional…", "text": "Great communication and professional employees available to help.", "rating": 4}, {"title": "A relief to be insured ", "text": "The associate was very helpful and knowledgeable ", "rating": 5}, {"title": "Very responsive and helpful.", "text": "Date of experience: June 03, 2024", "rating": 5}, {"title": "Amazing and very friendly", "text": "Very patient and knowledgeable.", "rating": 5}, {"title": "Great knowledgeable and pointed answers", "text": "Date of experience: April 01, 2024", "rating": 5}, {"title": "Very nice rep to talk with (Candy)", "text": "Date of experience: July 17, 2024", "rating": 5}, {"title": "Very professional courteous and always…", "text": "Very professional courteous and always available", "rating": 5}, {"title": "Very helpful and professional", "text": "Date of experience: August 26, 2024", "rating": 5}, {"title": "Helpful customer service associates.", "text": "Date of experience: June 11, 2024", "rating": 4}, {"title": "Representatives were very cordial and…", "text": "Representatives were very cordial and helpful", "rating": 5}, {"title": "Quick reply to claim.", "text": "Quick reply to claim. ", "rating": 4}, {"title": "Insurance scam!", "text": "Date of experience: April 18, 2024", "rating": 1}, {"title": "The friendliness and helpfulness of the…", "text": "The friendliness and helpfulness of the representative.", "rating": 5}, {"title": "Good customer service!", "text": "Date of experience: June 26, 2024", "rating": 5}, {"title": "Super satisfied ", "text": "fast response Reliable insurance ", "rating": 5}, {"title": "Good customer service", "text": "Good customer service ", "rating": 5}, {"title": "Outstanding communication", "text": "Outstanding communication, very patient. ", "rating": 5}, {"title": "Representatives were excellent", "text": "Representatives were excellent ", "rating": 5}, {"title": "excellent customer service", "text": "Date of experience: April 19, 2024", "rating": 5}, {"title": "Efficient and cheerful customer service…", "text": "Efficient and cheerful customer service helper. ", "rating": 5}, {"title": "Seven Corners insured us on our second…", "text": "Seven Corners insured us on our second trip to British Columbia Canada. Not good at all. On the second half of our trip my wife got Covid for the first time and experience that kept her bed ridden in our hotel room. When we really needed Seven Corners, they 'ducked out', to bad and \"Sorry Charlie\", went AWOL, abandoned us in a foreign country. Shame on them! Over a dead horse would I recommend this company? Fred Klessig, retired Health Care Professional", "rating": 1}, {"title": "I purchased a tour for me and my wife…", "text": "I purchased a tour for me and my wife in September 2023.Then I was notified in December 2023 that part of the tour was canceled. I then attempted to cancel the entire tour,  but was advised by an agent of EF GO Ahead Tours to file  medical cancellation since I had back problems .What a mistake I spent a total $12,286.49 for the trip and only received $11,056.49 back. Seven Corner Insurance and EF Tours have keep the rest.                If this can happen to us, an 84 year man who (Can hardly walk)  and his wife then what was the need for insurance ?", "rating": 1}, {"title": "Very nice and efficient customer…", "text": " Very nice and efficient customer service!", "rating": 5}, {"title": "We filed a claim on this policy", "text": "We filed a claim on this policy.  The filing was very easy.  The company communicated with us immediately about it.  The claim was paid in full and quite quickly.  Thank you very much for a good customer experience. ", "rating": 5}, {"title": "Very easy to deal with", "text": "Very easy to deal with. Made us feel like we were important.", "rating": 5}, {"title": "The assistance I received from Tristan…", "text": "The assistance I received from Tristan was excellent.  He was able to answer all of my questions thoroughly.", "rating": 5}, {"title": "The consultant was very quick to help…", "text": "The consultant was very quick to help me take care of my travel planz.s", "rating": 5}, {"title": "Wonderful experience from day one.", "text": "I've had called the Seven Corners number of times and from the initial call, they were very professional and pro-active to assist me. Every person I spoke to was able to get access to updated information regarding my case and very helpful.  I really appreciate working with this company.", "rating": 5}, {"title": "Ease of use", "text": "Ease of use. Just the right cover at a reasonable price. ", "rating": 5}, {"title": "Awesome!", "text": "This review is for Laura M. She was very patient. She stayed connected with me while I worked on my claim to help answer all my questions.", "rating": 5}, {"title": "My concerns were being addressed.", "text": "Date of experience: February 23, 2024", "rating": 5}, {"title": "friendly and knowledgeable", "text": "Date of experience: March 01, 2024", "rating": 5}, {"title": "Agent responded succinctly to my query…", "text": "Agent responded succinctly to my query about coverage for a last minute cruise. ", "rating": 5}, {"title": "Hard to process claims", "text": "Too much info required to submit a small baggage damage claim.  Makes me feel like I have to jump through hoops to get you to pay a very small claim.  This feels like a delay tactic to get me to go away.  ", "rating": 2}, {"title": "Fast and easy policy modification", "text": "Due to airline scheduling changes we needed to add an additional day to the end of our current policy. I was able to get it done quickly and effortlessly over the phone.Thank you!", "rating": 5}, {"title": "Fantastic and professional.", "text": "Fantastic and professional. ", "rating": 5}, {"title": "Glad for Cancel for Any Reason Provision", "text": "We were able to use the cancel for any reason provision of our policy after our daughters dog was diagnosed with cancer 3 days before departure.  We were thankful we added this on.  The claims process is clunky and I feel like Seven Corners makes this process complicated and convoluted on purpose.  Like not requesting all the documents needed up front, but asking for documents one at a time week after week in the process and then taking a week to respond back.  But we able to get it done.", "rating": 4}, {"title": "Customer Service about Payment", "text": "Needed a more detailed invoice that was not available online.  I called in and the representative was quick to provide me the documentation that I needed.", "rating": 5}, {"title": "Outstanding company and service!", "text": "Date of experience: February 20, 2024", "rating": 5}, {"title": "Travel Coverage ", "text": "Mrs. Andrea so very polite, courteous, knowledgeable, and patient with me. Would highly recommend Seven Corners Travel Ins. Company to other travelers. They have the best rates for the coverage in my opinion. ", "rating": 5}, {"title": "Read the fine print!", "text": "We bought coverage believing that we were covered for ANY reason, but the fine print said our trip needed to be interrupted to receive reimbursement. We had a tropical storm disrupt our last day which caused the ferry back to mainland to be shut down, airport was shut down and I missed a speaking engagement! We were paid for extra hotel stay but not for work. Read the fine print before purchasing! ", "rating": 2}, {"title": "Very quick response", "text": "Very quick response, very attentive! ", "rating": 5}, {"title": "Great follow up /follow through ", "text": "I purchased this travel insurance on line. I immediately received all the info plus my own representative. I continued to receive updates. I also received my policy and what info I would need for my trip. Unfortunately, I did need some medical. Seven Corners responded immediately. And updated me almost everyday. 10 days after my original claim I received resolution and approval. Wonderful experience working with them and will definitely use them again. Thank you! ", "rating": 5}, {"title": "Candy is the best", "text": "Candy is the best! She had the thorough knowledge of claims and insurance policy and helped me so much with kindness. ", "rating": 5}, {"title": "The people answering the telephone were…", "text": "The people answering the telephone were very nice, efficient and answered my questions.  ", "rating": 5}, {"title": "Customer service is a big deal", "text": "The customer service representative was very personable and tried to understand my questions. ", "rating": 5}, {"title": "Helpful and honest ", "text": "Helpful and honest 1TPB23-AOS-122933", "rating": 5}, {"title": "Outstanding Customer Service", "text": "Prompt access to customer service rep and updating insurance.", "rating": 5}, {"title": "My travel companion and I both got sick…", "text": "My travel companion and I both got sick with the flu on our cruise. We had onboard medical expenses of $350 and $411 between us. We filed a claim with 7 Corners. The claims submission process is not easy. They ask for  things like credit card statement showing you paid for cruise. Then we waited 6 weeks, and heard nothing. I called and they said they needed proof we paid for the medical services (we had already provided the detailed medical bill and they did not specify wanting proof of payment of the medical charges at the onset). Obviously any company that deals with cruises as 7 Corners does, knows that no cruise line is going to let a passenger off the ship without paying their entire bill (for booze, t-shirts, medical services, etc). After many hoops, we got a final stateroom bill from Princess cruises and submitted it to 7C. But I believe the stall tactic and the ridiculous \"proof of payment\" was merely an effort to not pay a legitimate claim. The bean counters at 7C know that the more hoops they make people jump through, the fewer claims they have to pay. 7 Corners is not an honest company when it comes to paying claims and their responsiveness (or lack thereof) in customer service is pathetic. You can't just send them an email from the website, you have to upload documents and then wait for a reply (which they don't reply to).UPDATE: Seven Corners has gone from bad to worse. After providing my stateroom charges, they informed me they would pay $151 of my over $300 claim. They came to this figure as it was the \"balance\" of my stateroom bill when I got off the ship. This includes all charges and credits (I had several hundred dollars of credits after a port-of-call was cancelled at which I had paid for an activity, I cancelled a specialty dinner, and had a $100 credit as part of booking promotion). So, Seven Corners paid me only the balance of what I owed Princess Cruises, not the actual out of pocket costs I incurred for a covered claim from having visited the cruise medical center.They pulled the same scam with my travel partner's claim. I am filling a complaint with my state insurance commissioner and speaking to a lawyer. This company is a total scammer. They don't know who they are effing with!Update 2: After a lot of kicking and screaming, and making my case, 7 Corners said they are going to issue full payment of my claim. Laura and David at 7C were helpful, but it should not have been this hard to get a legit claim paid. ", "rating": 1}, {"title": "Absolutely fabulous great service great…", "text": "Absolutely fabulous great service great knowledge thanks for all your help", "rating": 5}, {"title": "Great customer service", "text": "Great customer service.   Representative was very helpful when I needed to make a change to my policy.", "rating": 5}, {"title": "Great Customer Service", "text": "The agent was cordial, professional, and able to answer all questions we had with regard to submitting a claim", "rating": 5}, {"title": "Independent Review", "text": "Autumn was a pleasure to work with.  She told me exactly what I needed to process my claim.  Certificate # 44440473-P", "rating": 5}, {"title": "They will deny everything you claim", "text": "My trip was delayed two days due to airline faults. We had no access to our luggage for two days because it was already checked. Seven Corners pad us nearly nothing. They denied the claim for luggage delay including clothes and amenities we had to purchase - this is fraud by this company because our luggage WAS INACESSIBLE. They refused to pay for any of the lost hotel days due to the airlines delays. A completely useless insurance that I will never purchase again and I will ensure everyone I know does not either.", "rating": 1}, {"title": "the team", "text": "the team!  your staff is outstanding!  I buy a lot of  insurance from you because your team - the voices on the other end of the phone make me feel like I am  important and that they care about me.  Thanks to all of you on the phones - please l ow your knowledge and kindness matter and that is why customers like me keep coming back and tell other people about your wonderful service! You matter, you make a difference, you are the backbone of Seven Corners!", "rating": 5}, {"title": "quick and efficient.", "text": "Date of experience: February 19, 2024", "rating": 5}, {"title": "Quick and friendly", "text": "Quick, friendly and easy customer service", "rating": 5}, {"title": "Easy to connect and had more questions…", "text": "Easy to connect and had more questions answered", "rating": 5}, {"title": "April Welch, Our Responsive, Professional Resource", "text": "We have worked with April Welch on at least 7 occasions. All of which included medical, extended stay and multiple countries. Our work together has included switching countries within a plan due to geopolitical issues and concerns. In all cases April has been very supportive, responsive, articulate, detailed and helpful. We have called on her for recommendations, to get her input and help us understand choices and logistics. We appreciate April’s help and professionalism!Dean & Lynda Duffy", "rating": 5}, {"title": "I have never purchased travel insurance…", "text": "I have never purchased travel insurance for a large trip before.  After researching and talking to several travel insurance companies, I found Seven Corners had the most comprehensive policy compared to others.  The Seven Corners representatives, I have spoken to, are well-informed and made the whole process of purchasing less intimidating.  I am hoping not to have to make use of the insurance, but I feel more protected now that I have it.", "rating": 5}, {"title": "Excellent agent", "text": "The agent went out of her way to ensure the issue was resolved. She was patient, persistent and provided clear feedback once the issue was resolved. Thank you!", "rating": 5}, {"title": "The agent listened to my concern", "text": "The agent listened to my concern, checked on it with a manager and then called me back to resolve the issue in my favor. I appreciate the follow through and the fact the company honored our signed policy.", "rating": 5}, {"title": "Clear communication", "text": "We appreciated April's clear communication and desire to work with us to find the best match for our travel insurance needs.", "rating": 5}, {"title": "Representative was friendly and very…", "text": "Representative was friendly and very helpful", "rating": 5}, {"title": "Fast resolution of my problem", "text": "Fast resolution of my problem.  I had an incorrect date on my policy and Ami fixed the problem quickly after asking a couple of questions.  The updated policy was emailed to me within a few minutes.  Easy!", "rating": 5}, {"title": "Didn't need to use", "text": "Didn't need to use, but process was easy!", "rating": 5}, {"title": "Very supportive and kind", "text": "The person was very supportive, kind, and helped me with my problem.", "rating": 5}, {"title": "Very helpful, well trained staff", "text": "I have been very happy with the service I have received from Seven Corners.  I had to cancel my trip 4 days before departure due to an unanticipated health emergency.  The staff at Customer Service was there for me from day one on this.  They have either answered my call immediately or returned my call quickly.  They have helped advise me on forms and documents needed to make a claim. Then once I had submitted them, they have reviewed them for me to assure they were all received and properly completed.  They, also,  advised me on what else I might need to submit. They have even helped me to understand how to go about getting the additional needed documentation. This has all be accomplished over the course of a week. I do, also, get email updates from the claims department acknowledging receipt of documents.  I am very pleased with the service so far.  At this point, I am waiting for word that my claim was accepted and a refund will be forth coming.", "rating": 5}, {"title": "It was nice to get a customer service…", "text": "It was nice to get a customer service person listen to reason and see the wisdom in allowing my reduction in coverage request due to airfare already being insured", "rating": 5}, {"title": "Great Service and Quick Claim Processing", "text": "Had to use our travel insurance for the first time ever due to an illness.  Filing the claim online was easy and spoke with a very friendly claims representative for assistance on ensuring that I filed everything correctly.  Filed our claim on 2/5/23 and our claim check was deposited into our bank account on 2/9/23.  WOW.... Never thought it would be that quick.  Seven Corners will be our go to travel insurance from now on.", "rating": 5}, {"title": "Issue Resolved", "text": "This is an update to my previous review/complaint titled \"Very Dissatisfied.\" The issue has been resolved to my satisfaction. Laura M. at Seven Corners took my case and resolved it. She was courteous, helpful, and responsive.Thanks, Laura!", "rating": 4}, {"title": "Talked to a representative…she was…", "text": "Talked to a representative…she was great…very knowledgeable.", "rating": 5}, {"title": "Call with policy dept. for indicative premium charge", "text": "The agent (Anyes) with whom I have had the pleasure of speaking with previously on the same policy, a month or so ago was helpful and responsive.", "rating": 5}, {"title": "Very helpful agent", "text": "Very helpful agent, took care of my problem quickly.", "rating": 5}, {"title": "Customer Service Rep was extremely Helpful", "text": "The Customer Service Rep was extremely knowledgeable and helped me make sure my previously sent information (as a reply to a request by the company for further information but provided the incorrect email address when I used the reply button) got to the correct email address, which she provided, and stayed on the phone with me until it came through.", "rating": 5}, {"title": "Long but satisfied with the result", "text": "The process of making a claim was a lot (months) longer than it should have been, but I will say that the specialist that I ultimately ended up working with worked really hard to process the claim. Satisfied with the result.", "rating": 4}, {"title": "Certificate number1TPB23-AOS-113838", "text": "Certificate number1TPB23-AOS-113838 Kaia R was extremely helpful and refunded the airfare insurance I added yesterday after finding out today that we are covered for that. She needed approval and it did not take long for her to receive it. The process was easy and I greatly appreciate the great customer service!", "rating": 5}, {"title": "I think their customer service is wonderful...", "text": "I buy the medical insurance for all of my cruises. I've had to use it once last August when I came down with COVID.I am confident of the customer service available with seven corners.", "rating": 5}, {"title": "Typical Insurance Company...maximize profits over customer satisfaction", "text": "I insured my trip to Israel with Seven Corners back in June of 2023.  I took the \"For any reason\" option for cancellation due to the unstable enviornment which exist in Israel.  Our trip was canceled in December, so I began trying to recover the fees not refunded by my travel company at that time.  Seven Corners has now denied my claim due to the fact that my cancellation letter from my travel company was not dated, even though they received the letter several days prior to the date the trip was planned to leave.  This seems an obvious attempt to keep as much of my fees as possible, and no reasonable person could in good conscious determine that the travel company letter which they received prior to the required 2 days before the trip could not have been written at least 2 days prior to the planned date of leaving.  I find this a shame, as I like the seven corners web site and tracking process, but unfortunately their desire to maximize profits trump their willingness to use common sense to help customers properly handle their claims.  My wife and I go on trips multiple times a year but I will be shopping for another travel insurnace company in the future.Follow up to my post above, I was able to get my travel company to give me a dated cancelation letter which verified my previous claim of cancelation well prior to the contract required date, so Seven Corners reviewed my appeal and finally agreed to pay my claim. I'm still unhappy with their desire to find a loophole to keep from paying my claim, but happy they finally agreed to pay.", "rating": 3}, {"title": "Great Customer Service", "text": "I had just booked additional Insurance for a Princess Cruise that was unfortunately cancelled with two weeks out.  I called immediately to cancel the policy and it was handled immediately and very professionally.", "rating": 5}, {"title": "They give themselves 30 days to respond…", "text": "They give themselves 30 days to respond to your inquiry, leading to months of inactivity (we're humans and we don't have an alarm clock for 30 days), until you're exhausted, and then they deny you with a long fine print that you'd need an attorney to read. I would've saved more time and money if I hadn't hired them in the first place.They have a curated system that effectively discourages people from actively pursuing their claims.", "rating": 1}, {"title": "andrea was very helpful and patient as…", "text": "andrea was very helpful and patient as she listened to my reasons for submitting a claim.she offered assistance in what docs. I needed and how to submit.", "rating": 5}, {"title": "5 months of back-and-forth without my reimbursement", "text": "I am compelled to share my nightmare experience with Seven Corners so that no one else has to endure the same disregard.I purchased Seven Corners travel insurance to go to Europe. In August 2023, during my travels, I faced a medical emergency. I diligently followed Seven Corners' procedures, submitting the claim right after the situation. The bureaucracy began agonizing, subjecting me to weeks of waiting for an answer. Then, it continues with asking to fill out countless forms over and over, with information already provided.After enduring five months of patience, I complained about taking around 150 days to process a claim of less than $200. Therefore, the supposed resolution finally arrived by email as a promise from the Customer Advocate on Jan 15th, 2024, that I would receive my reimbursement within 10 business days. However, the so-called \"Payment Confirmation\" document they provided came with an invalid tracking number. Fast forward to the 11th business day, Jan 30th, 2024, and I'm left empty-handed, still without reimbursement.I am beyond frustrated, feeling deceived and disrespected by Seven Corners. I would not recommend trusting them for your travel insurance needs.", "rating": 1}, {"title": "Great customer service with an agent…", "text": "Great customer service with an agent that answereed all questions.", "rating": 5}, {"title": "Ms Autumn was very patient with me and…", "text": "Ms Autumn was very patient with me and was very clear . I was filled with hope that my claim would be acknowledged . She e-mailed all the necessary forms needed for filing a claim .", "rating": 5}, {"title": "The representative was very helpful", "text": "Date of experience: January 29, 2024", "rating": 5}, {"title": "But it wasn't a good experience…", "text": "But it wasn't a good experience overall.... I tried to file a claim for by case being damaged with Qantas- but I should have done that within 7 days upon my return. It was 10 days after my return that I got around to trying to submit the claim.  The claim against the carrier is a prerequisite of my claim with Seven Corners.", "rating": 4}, {"title": "I thought I'd share a positive…", "text": "I thought I'd share a positive experience. After years of travel and being very lucky, we had to use travel insurance for our first time. We had planned a 3 and a half week trip nearly a year ago - scheduled to depart on January 21. Having an elderly parent and an elderly pet, we bought travel insurance with a cancel for any reason rider. Sadly we discovered one of our dogs has an aggressive cancer that needed immediate treatment. For us, the right decision was to cancel our trip.We have always purchased our insurance through Seven Corners out of Indianapolis. We notified the company of our decision to cancel the trip on January 16. We had gathered all the needed documentation (which was quite a bit) in the days leading up to the cancellation. I'm happy to report they accepted our claim with all documentation that I provided. No further questions. We had reimbursement for our claim in our checking account by January 25. So very happy we bought the insurance.", "rating": 5}, {"title": "Very efficient in answering questions…", "text": "Very efficient in answering questions and getting me the documents that I wanted.", "rating": 5}, {"title": "Customer Service extremely responsive…", "text": "Customer Service extremely responsive and addressed my question!  Thank you.", "rating": 5}, {"title": "Responsive", "text": "Responsive.  Understandable.", "rating": 5}, {"title": "Very good customer service", "text": "Very good customer service. Good availability.", "rating": 5}, {"title": "So far so good", "text": "So far so good. I had to change my coverage ti add another country. I got a call the next day to make the change.", "rating": 5}, {"title": "Quick response to my claim.", "text": "Date of experience: January 15, 2024", "rating": 5}, {"title": "The WORST TRAVEL INSURANCE EVER!", "text": "The WORST TRAVEL INSURANCE EVER!For the claim processed is about 1 year++ till appeal.I gave all the proof even forwarded the hospital email to the appeal team as they excuses they contacted the hospital but saying I don't have treated to the hospital while when I did email to hospital they confirm I have treated and I sent all the proof but still they rejected my claim with so many excuses even with another provider saying they cover me full still i sent all the proof to Seven Corner and they still reject and don't want to pay my medical expenses. Everything what i said and all the proof showed to them still they will never care and just saying a unreasonable words to not to pay it. What a poor travel insurance. No proof no money but still dare to selling travel insurance here what a SCAMS Travel Insurance saying without giving proof LOLBEWARE OF THIS TRAVEL INSURANCE!!!THEY ARE SCAMS!", "rating": 1}, {"title": "Talking to real person that was…", "text": "Talking to real person that was courteous and polite", "rating": 5}, {"title": "great service", "text": "great service, knowledgeable and very patient and kind.  Plus, friendly and thanked me for the insurance plan.", "rating": 5}, {"title": "Claim satisfaction", "text": "Communication with sales team and claims team was excellent.  Important to keep all documentation to substantiate a claim.  I faxed a package of invoices etcAnd received full reimbursement in 60 days.  No complaints.  Representatives were easy to talk to and helpful.  Best thing I can say is I would use Seven Corners again to insure a cruise vacation", "rating": 5}, {"title": "I needed to change dates and a country…", "text": "I needed to change dates and a country I was visiting based on changes to a tour.  It was so easy!", "rating": 5}, {"title": "The reps made it easy to understand to…", "text": "The reps made it easy to understand to available options.", "rating": 5}, {"title": "Intelligent agent", "text": "Your agent, Autumn, was very helpful and knowledgeable.", "rating": 5}, {"title": "fast customer service", "text": "fast customer service, courteus and informative", "rating": 5}, {"title": "Understanding Trip Delays", "text": "We are so grateful that your team decided to extend the period where policy changes can be made.  We experienced several delays in our trip (all of them out of our control) to a country that has experienced some serious political strive, making travel unsafe.  This extension was very much appreciated and we understand that you did not have to grant it.  Thank you for this!", "rating": 5}, {"title": "very helpful and patient with me in…", "text": "very helpful and patient with me in sorting out several questions about my policy.. Thanks", "rating": 5}, {"title": "Bad faith insurance at its worst", "text": "While I was in France last October, my tooth broke off at the gum line. If that doesn't qualify as a dental emergency, nothing does. I went to a dentist to get it glued on temporarily so I could eat, which cost a big $72. Seven Corners denied this obviously legitimate claim, and it took them 2 months to do so. Thank God we didn't have bigger problems. This insurance is worthless. Avoid this company like the plague. By the way, we purchased the best policy they offered, LOL.", "rating": 1}, {"title": "Very knowledgeable", "text": "Very knowledgeable,  and helpful staff!", "rating": 5}, {"title": "Very nice employees that are very…", "text": "Very nice employees that are very helpful!", "rating": 5}, {"title": "Travel Insurance refund request denied", "text": "Travel insurance purchased for an Israel trip, which has been cancelled and refunded for obvious reasons.  Seven Corners is unwilling to refund the travel insurance.  Granted, the contract states there is only a 14 day grace period, but given the circumstances in Israel and the fact Seven Corners had no outlay of money we thought they would promote customer relations and refund the money.  But they are refusing.  Yes, you can use the policy on another trip, but I was honest with them and stated that likely won't happen.  I also asked if the premium paid could be used for a number of smaller trips, but the response so far has been no (\"the system doesn't allow\").  Escalation of this issue within Seven Corners has been ineffective.P.S.  Other companies ARE refunding travelers their premium expenses under similar circumstances.", "rating": 1}, {"title": "Called to change travel dates on an…", "text": "Called to change travel dates on an existing policy. The woman I spoke to was fabulous ... knowledgeable, pleasant and efficient. She is a credit to her company!!!", "rating": 5}, {"title": "The customer service representative…", "text": "The customer service representative actually listened with empathy and understanding, made me feel valued.", "rating": 5}, {"title": "It did not take long to answer my…", "text": "It did not take long to answer my question.", "rating": 5}, {"title": "Solid Experience", "text": "I've had a solid experience with these guys. Not impeccable communication, but really didn't have any complaints and will definitely use again.", "rating": 5}, {"title": "Fast and good phone service", "text": "Fast and good phone service. Long delays in processing claim and constantly asking for additional information.", "rating": 4}, {"title": "Doing all they can to avoid payment", "text": "Doing all they can to avoid payment. Sending me multiple replies asking for more documents when everything needed provides. Very unhappy with the service. I recommend to avoid.", "rating": 1}, {"title": "Candy was wonderful and very thorough…", "text": "Candy was wonderful and very thorough in reviewing my travel insurance purchase and correcting a couple of errors I made on the application form.", "rating": 5}, {"title": "Prompt answer and correction of problem", "text": "Date of experience: January 08, 2024", "rating": 5}, {"title": "The person I talked to was very helpful…", "text": "The person I talked to was very helpful & informative.  I will have to admit I do not like these surveys!", "rating": 5}, {"title": "I needed more info on part of my policy…", "text": "I needed more info on part of my policy, the gal that answered the phone was helpful but needed to check more in depth. She got back promptly & answered what was needed.", "rating": 5}, {"title": "Claim reimbursed for trip interruption", "text": "I purchased  travel protection basic insurance for an intentional trip, just in case I needed medical attention. While traveling, a family member fell ill back in the US and I had to fly home unexpectedly. I reached out to Seven Corners after returning home to see if the policy could cover the cost of the ticket due to the medical emergency and the representative let me know it could cover up $1,000 if I had proper back up documentation. I filled out the paperwork, submitted the claim, and it was approved and the money was deposited into my account. One thing to know, it wasn’t a quick process. I filed the claim in October and it wasn’t reviewed until December. I had to resubmit the physicians form and then it was approved in January. I received the direct deposit to my account with 48 hours of the approval though! I would definitely use them again and look to add in the plan that fully reimburses costs due to a medical emergency/trip interruption.", "rating": 5}, {"title": "Canceling the policy was easy!", "text": "Canceling the policy I did not need was very easy. Thank you.", "rating": 5}, {"title": "Called regarding  medical claim", "text": "Called regarding  medical claim. So helpful and professional.", "rating": 5}, {"title": "Help when needed", "text": "The friendliness of personnel to help solve an issue.", "rating": 5}, {"title": "Customer service", "text": "The customer service representative was extremely helpful and friendly.", "rating": 5}, {"title": "Good service.", "text": "Date of experience: December 19, 2023", "rating": 5}, {"title": "Don't bother with this one", "text": "Don't bother with this one.  Our claim was denied even though we had a physician's statement.  My travel partner suffered a worsening condition just before we were scheduled to leave for a cruise.  Lost the cost of the cruise and the policy premium.  They DO NOT cover 'for any reason' as they claim.  We were not denied because we didn't purchase the 'extras' plan, but because they said my partner had a pre-existing condition!  Most 70-year-olds have some type of pre-existing condition!", "rating": 1}, {"title": "I contacted you but  It is not helpful…", "text": "I contacted you but  It is not helpful for emergency service. When I went to ER,  I paid medical expense fully. The insurance didn’t help.", "rating": 3}, {"title": "I was able to talk to a person right…", "text": "I was able to talk to a person right away and not an AI. She was very helpful and pleasant. I would recommend this insurance to anyone.", "rating": 5}, {"title": "SEVEN CORNERS IS A COMPLETE DISGRACE", "text": "I purchased travel coverage with Seven Corners ($648) before embarking on a trip in July 2022.  Whilst travelling, I broke my ankle and elbow simultaneously.  I submitted complete claim form along with a spread sheet listing each expense, copies of invoices, explanation of costs as well as proof of payment for each expense.  I was reimbursed a total of $1098.  This is a net of $450 after the premium.    Important to note is that any related physical therapy or other expenses 90 days past the date of incident were denied!  Not only did the insurance cover a pittance of my total cost, it took 18 months to recover this measly sum and the cost of my time to pursue this claim far exceeds the reimbursed amount.  The  amount of paperwork they requested in addition to the receipts and proof of payment was nothing short of nauseating. It is BLANTANTLY evident that Seven Corners modus Operandi revolves around finding flimsy excuses to either deny claims outright or systematically drain the claimant will to pursue rightful compensation. Their tactics are not only despicable but also emblematic of a company that prioritizes profit over the well-being of its clients.   Seven Corners is a complete disgrace.  I advise anyone considering their services to save  themselves the premium, headache and immense frustration. Steer clear of this company at any cost if you value your peace of mind and financial stability.   I will be using other reputable company’s like American Express moving forward. NEVER AGAIN", "rating": 1}, {"title": "Tristan Schilling was my agent", "text": "Tristan Schilling was the agent I booked my policy through. He was very professional, patient and knowledgeable. The epitome of caring customer service.", "rating": 5}, {"title": "When seven corners denied my claim", "text": "When seven corners denied my claim, I was really upset. Laura and I connected via Seven Corners facebook page. She went out of her way to help me submit an appeal and get it approved", "rating": 5}, {"title": "Great customer service!", "text": "Very knowledgeable and helpful customer service! Thank you!", "rating": 5}, {"title": "Excellent service", "text": "When I fell and injured my knee (requiring a visit to an E.R.), Seven Corners was seamless from from start to finish. The phone representatives were so friendly and helpful. I received my reimbursement in less than a month. I will definitely purchase the same product for future trips!", "rating": 5}, {"title": "Got the information I needed.", "text": "Date of experience: December 05, 2023", "rating": 5}, {"title": "It took over a month to get our money…", "text": "It took over a month to get our money back, which I felt was a bit slow, but I had no problems. My husband and I got COVID and were not able to go on our trip. We had both been paying separately for our portion of the trip through EF Ultimate Break for about a year and we both got our full amount back by submitting the physician statement and some medical records.", "rating": 5}, {"title": "3 Months and Still Waiting", "text": "It’s been 3 months since I filed my claim on September 1, 2023 with Seven Corners. Six weeks later I received notice they needed additional information, which I provided the same day. Seven Corners acknowledged receipt. That was October 11, 2023 - 50 days ago!  For the record and for anyone reading this review, Seven Corners’ process is to try resolve a claim within 30 days. However, anytime they need additional information the clock gets reset to zero and the 30-day clock starts all over again. I was told this by one of their agents. Since October 11th I have called several times to get claim status.  Each time I talked with an agent they found an error with the dates within their internal tracking system and was then told my claim would be escalated to the “escalation team”.  This was done on October 25th and again on November 20th. Each time I received a form letter from a nameless person on the “escalation team” telling me my claim has been escalated and says my “patience and understanding are highly appreciated”.  Well, after 3 months my patience is gone, and I don’t understand why my claim is taking so long.  Can someone at Seven Corners please help me with understanding this?", "rating": 1}, {"title": "Great customer service!", "text": "Date of experience: November 29, 2023", "rating": 5}, {"title": "had difficulty getting a e response", "text": "had difficulty getting a e response,  Once i got an individual the response time was great.", "rating": 4}, {"title": "It was quick and easy to make the change", "text": "It was quick and easy to make the change and the premium increase was lower than expected.", "rating": 5}, {"title": "Excellent Customer Service!", "text": "From the beginning  to completion of my request, the customer service was top notch!", "rating": 5}, {"title": "Very helpful lady on the phone", "text": "Date of experience: November 16, 2023", "rating": 5}, {"title": "Positive customer service experience", "text": "Easy to reach customer service for questions about coverage when making purchase decision. I called 3 different times while considering alternative insurance companies and the representative was always knowledgeable and helpful. I will be traveling in 2024 so I cannot comment on any other aspect of coverage.", "rating": 5}, {"title": "Andrea was outstanding in dealing with…", "text": "Andrea was outstanding in dealing with my question. She was knowledgeable and helped me in finding a solution. Thank you!", "rating": 5}, {"title": "Awaiting a response to my claim.", "text": "Well, this is a good time for me to write one of two reviews.  I have used Seven Corners many times before, but I have never put in a claim.  Today I did because my flight from Italy back to the US was outright cancelled after being delayed for six plus hours.  We had to spend another night and had to leave the next morning.  The airline paid for the hotel so I did not add that to my claim.  Only food, taxi transportation and one clothing item because I was cold. The claim was fairly easy to input although I had to send the validating documents separately because it kept deleting them (file was too big which I found odd since it was just a few receipts).  I sent them directly to their customer service email. I chose 4 stars for good phone customer service and some direction on the site that I had difficulty using. What remains to be seen is the ease of getting the few hundred dollars I submitted paid to me.  It was actually roughly the cost of the policy itself.   I am not a fan of and have not had good experiences with insurance companies to date.  I'm hopeful this will be different, and I'll upgrade and provide a review once I see how it goes.  Stay tuned!", "rating": 4}, {"title": "Associate was attentive", "text": "Associate was attentive, knowledgable and solved my problem. Thank you", "rating": 5}, {"title": "So glad I chose Seven Corners Insurance", "text": "No, extensive waits online. Very pleasant, helpful employee to answer questions. Resolved problem immediately.", "rating": 5}, {"title": "The company was most helpful in all…", "text": "The company was most helpful in all aspects of my needs I will use again", "rating": 5}, {"title": "We had few questions about claim form.", "text": "We had few questions about claim form.Customer service representative was patient and friendly, she answered all our questions in details. She knew what she was talking about.", "rating": 5}, {"title": "Ms. Fonville", "text": "Ms. Wade was SUPER  helpful!! After our call ended, she called me to let me know only ONE person in my family had received reimbursement. I am so grateful she noticed this and emailed me the documents to complete and submit for reimbursement.  OUTSTANDING customer service!!", "rating": 5}, {"title": "Everyone was very helpful and patient!", "text": "Date of experience: November 09, 2023", "rating": 5}, {"title": "Representative helpful", "text": "Today I called and spoke to representative Cindy who checked to make sure all forms were received. She was polite and checked everything out and told us we were in review and would take another 30 days until determination.  The paperwork and forms were difficult to fill all out on line.   Frustrating! On  August 25 EF Go Ahead Tours communicating to file claim.  Still going on, waiting for refund.  CINDY WAS VERY HELPFUL!cert# F 5E029B05563", "rating": 5}, {"title": "Agent was very responsive to my…", "text": "Agent was very responsive to my questions, and seemed to be well informed.", "rating": 5}, {"title": "Helpful and fair", "text": "Seven Corners was very helpful in getting our trip insurance for our South Africa trip. We had some problems getting there so now I’m filling out a claim for our lost vacation time. I’m assuming that Seven Corners is going to be just as helpful and fair in this process.", "rating": 5}, {"title": "Bait and switch", "text": "Seven Corners has an irrational out clause which let's them avoid paying legitimate claims.Never will use this company again.", "rating": 1}, {"title": "No hassles in trying to obtain a policy…", "text": "No hassles in trying to obtain a policy to suit my needs.  I like having several plans to choose from.", "rating": 5}, {"title": "Will Never Use Them Again", "text": "I have used this company several times but never had to make a claim.  I made a claim for a trip I took in August/September of 2023.  I had to make an emergency trip home because my son was hospitalized.  I had to change my return ticket to see him. Because of a clause on page 12 of the policy, I was denied $1000 because I returned to a different city than the original city.  It was a perfect example of an insurance company using obscure rules to deny a claim.  I will never use them again.", "rating": 1}, {"title": "Courteous", "text": "Courteous, prompt and efficient", "rating": 5}, {"title": "Your customer service rep", "text": "Your customer service rep. She was friendly, knowledgeable, extremely helpful and this made my experience a positive", "rating": 5}, {"title": "Call 2 times today", "text": "Call 2 times today.    Both times representative was helpful.  Have used seven corners before.    Find they are very reliable.", "rating": 5}, {"title": "No phone hold time", "text": "No phone hold time; got my answer quickly", "rating": 5}, {"title": "I needed to update my email", "text": "I needed to update my email. Skylar did so for me, quickly.", "rating": 5}, {"title": "Did not need to use them", "text": "Date of experience: October 22, 2023", "rating": 5}, {"title": "Excellent Customer Service", "text": "The agent was excellent at answering my questions and clarifying specific details of my policy due to unusual world events in this particular region.", "rating": 5}, {"title": "Helpful", "text": "Helpful, pleasant", "rating": 5}, {"title": "Easy to make contract change", "text": "Easy to make contact with the correct staff.  The woman I contacted was personable and helpful -- she understood my question about extending the return date and quickly made the change after reconfirming my new date.  And, she was easy to understand as well as an overall good speaker.  I was impressed by her ability to quickly locate my policy, review my return date change, and make changes to the policy as well as to forward the revised policy in a very, very short time.  I believe she would be good at teaching others how to provide great service.", "rating": 5}, {"title": "Excellent Customer Seervice", "text": "I spoke with Andrea in Customer Service. She was beyond helpful. Very professional and went way beyond what I was asking for.  Complete blessing to Seven Corners to have her working there.", "rating": 5}, {"title": "I needed to speak with someone on a…", "text": "I needed to speak with someone on a weekend and no one was available.  My luggage was damaged on the flight, but didn’t notice it until unpacking at the hotel.  Tried to call on a Saturday, but was informed by answering that no one would be there til Monday.  Our tour started on Sunday so I was unable to place the return call.  Had to purchase new luggage at my own cost to get home.", "rating": 2}, {"title": "Claim process was simple and smooth", "text": "Claim process was simple and smooth.  Will buy from again !", "rating": 5}, {"title": "Review", "text": "Great customer service!", "rating": 5}, {"title": "Seeking General Claims information", "text": "Was able to get information about how to file a claim, however, representative, could have sought to help me with general information about how to file a claim instead of telling me she could not help me without a release from the person I was seeking the info for.  My question did not require any personal or private information, just how soon a claim had to be filed, since in the coverage doc it talks about 20 days and 90 days.  Bottomline, please seek to be as helpful as Seven Corners typically is, before trying to shut someone down and create unnecessary anxiety and work.  In the end, it was fine and she was nice and helpful once we got to what I really needed to know. i.e. \"I can't answer specific questions regarding your mother-in-law's policy without her authorization, but policies provide 90 days from the event date to file a claim.\"", "rating": 4}, {"title": "Purchase of the insurance is great", "text": "Purchase of the insurance is greatAnd when we decided not to take the trip, cancelling the insurance and receiving a full refund was even greater!!", "rating": 5}, {"title": "I got a call back rather than have to…", "text": "I got a call back rather than have to wait until an agent was available. The agent was well-informed and clear in her instructions.", "rating": 5}, {"title": "Very good customer service in terms of…", "text": "Very good customer service in terms of reminders and access to representatives. Cost of the coverage was comparable and the coverage was very comprehensive allowing for choices to be made that were important to consider.", "rating": 5}, {"title": "GOOD VALUE", "text": "GOOD VALUE for what you get compared to other insurance. Their definitions and documentation was straight forward and when I called their customer service to make changes they were very cooperative and friendly.", "rating": 5}, {"title": "The policy I need and at a reasonable…", "text": "The policy I need and at a reasonable price", "rating": 5}, {"title": "Peace of mind", "text": "Well we had no issues but had peace of mind knowing if something did happen we were covered", "rating": 5}, {"title": "Thankfully didnt have to use your…", "text": "Thankfully didnt have to use your service.  I picked your company because of the excellent rate and insurance coverage.", "rating": 5}, {"title": "I highly recommend Seven Corners", "text": "I highly recommend Seven Corners.  Someone picks up the phone quickly when you call.  Staff are knowledgeable and resolve your concerns.  We had to claim reimbursement for a trip and the process was very smooth and efficient.  Thank you Seven Corners.", "rating": 5}, {"title": "Sicily", "text": "Efficient assistance", "rating": 5}, {"title": "Candace Sheetz", "text": "Candace Sheetz, Customer Advocate was extremely helpful", "rating": 5}, {"title": "I need assistance with my certificate…", "text": "I need assistance with my certificate number. I’ve been told it’s incorrect and I should ask the seven corners to change it with new ID card. I can’t claim because I’m told my certificate number is incorrect. I don’t understand because I was given this number.Update: I was assisted. Thank you so much!!!!", "rating": 5}, {"title": "Seamless communication", "text": "Seamless communication, willingness to help, smooth process", "rating": 5}, {"title": "Thank you to Tristen", "text": "Thank you to Tristen who did a great job renewing my managers insurance!  He made it informative and easy.", "rating": 5}, {"title": "Adjustments needed to policy", "text": "I needed to make adjustments to my policy after the initial purchase.I made numerous attempts to contact my agent through emails and voicemails until I finally again made contact, then the issue was quickly resolved, l but I was disappointed in how many times my attempts to contact were ignored", "rating": 3}, {"title": "Excellentseven corners  service", "text": "Excellent service", "rating": 4}, {"title": "Great customer service", "text": "Great customer service. Thank goodness we didn’t need to use the insurance however when I called with questions I received answers immediately from a caring, helpful employee!", "rating": 5}, {"title": "Josh actually answered questions and…", "text": "Josh actually answered questions and was able to do what I needed.  It was prompt, accurate, and easy.", "rating": 5}, {"title": "Phone rep very knowledgeable & Online experience easy.", "text": "Re: purchasing policy--Phone rep very knowledgeable, steered me to make change online, stayed on phone as I extended date of policy.  Online experience and site very easy to use", "rating": 5}, {"title": "Agent answered several questions that…", "text": "Agent answered several questions that resolved a problem in my understanding of the payment process.", "rating": 5}, {"title": "Andrea is the customer service person…", "text": "Andrea is the customer service person that I spoke with. She was beyond helpful immediately emailed me the forms that I needed and walked me through what I would have to fill out. She went out of her way to make my experience a good one excellent customer service.", "rating": 5}, {"title": "It was easy to access info and sign up", "text": "It was easy to access info and sign up. Fortunately, I didn't need to use it", "rating": 5}, {"title": "Stay away. It's Racketeering.", "text": "Seven Corners advertises coverage on their website and pamphlets that sound perfect. Then they sell you a package underwritten by another company. That company applies their rules. The first 5 pages of the insurance packet makes the coverage seem perfect.Then, on page 20, there are fine print details in legalese that exclude anything possible. They will ask for supporting documents, and lead you on for weeks. IF you manage to succeed with filing a claim, they will then bring up fine print and claim you aren't covered for it. So why ask me for all the supporting documents for something that isn't covered? Why waste six weeks of my time?This is racketeering by definition. You are given the illusion of choice, while in actuality they are running a racket. You do not have choice and their product is not what you think you are buying. One big bamboozle.They will send you a form letter \"signed\" by a claims specialist with their phone number at the bottom. The phone number takes you to the main 1-800 line, and they will tell you it is impossible to speak to H****** ******* - despite denying my claim and putting her name on a letter about it. So they either \"gate keep\" or lie as part of the racket. The \"license number\" \"H******\" uses is for the company, Seven Corners. There is no person by that name licensed in the state she claims.They advertise \"X coverage up to $5,000\", and that their medical policies cover more than just medical. Turns out, the extras only apply if someone died. That was on page 20 of the packet in legalese. Apparently I picked the wrong option for my trip. I have college degrees. This company, and their agents, are completely in violation of any fiduciary duty. So, what on my side could potentially even be a clerical error; is to them my mistake and I've lost all chance at a claim.I missed days in Europe, flights, hotels, tours, etc, then was dumped in Europe for a week without a bag or belongings, and now I'm SOL.", "rating": 1}, {"title": "Scotland 7/30]/2023 to 9/30/2023", "text": "All coverage information was readily available should we have had any issue during a 9 week stay in Scotland, UK.Explanation of coverage was concise.Customer Service response time is great.", "rating": 5}, {"title": "Thanks for laura M", "text": "I was very scared at first, but Laura helped me calmly and in detail by examining my entire file. thanks to her", "rating": 5}, {"title": "Fair Prices and Easy to Buy", "text": "Date of experience: September 27, 2023", "rating": 5}, {"title": "Hard to figure out where I could use…", "text": "Hard to figure out where I could use the insurance.", "rating": 1}, {"title": "Folks are so nice and helpful to work…", "text": "Folks are so nice and helpful to work with", "rating": 5}, {"title": "Great customer service with Andrea", "text": "Great customer service with Andrea!  Thorough, helpful, and very reassuring that my claim was being processed.", "rating": 5}, {"title": "Maximum reimbursement 30 days after filing claim", "text": "We cancelled our September trip to Peru due to my new and unexpected heart failure diagnosis. I created my claim on 9/1/2023, Seven Corners requested additional documentation, and I received a letter that we will receive the maximum cancellation benefit on 10/02/2023. I am satisfied with this outcome and would use this coverage on future trips.", "rating": 5}, {"title": "Hotel reimbursement", "text": "Our connecting flight on AA was cancelled by British Air without telling us.  We could not get a flight out that day and had to spend a night in a hotel.  I sent all the information and bill to Seven Corners and was reimbursed the hotel stay in a reasonable amount of time.", "rating": 5}, {"title": "Your a very professional company and…", "text": "Your a very professional company and all your reps are the same and very helpful.", "rating": 5}, {"title": "Very personable and helpful", "text": "Date of experience: September 07, 2023", "rating": 5}, {"title": "I had a no-problem trip", "text": "I had a no-problem trip.  but Seven corners was easy to deal with in the securing of the travel insurance and dealing with a few issues prior to departure.", "rating": 5}, {"title": "Things I appreciate", "text": "1) Competitive pricing especially because the medical evacuation coverage was substantial enough for overseas travel2) appreciate the email received just before my travel to remind me of documents to have on hand", "rating": 5}, {"title": "SCUM OF THE EARTH on all SEVEN CORNERS", "text": "I bought the insurance with every option possible, and when I needed Seven Corners, they just let me down.On my way from San Diego to Costa Rica, I fell in the airplane, before getting to Miami. I hit my head hard and fractured my pelvis and hip. I filed the paperwork on time as required, but had a hard time getting my medical records from the hospital and Rehab. I thought that I would have a special seat arrangement on the plane, and would recoup the money I paid for the hotel in Costa Rica ($2,000+), but SEVEN CORNERS advised me that the policy had expired although I did file the Fit to Fly/accident report on time. The hospital took too long to forward my Medical Records to Seven Corners, and while taking Morphine, etc., you are in no condition to monitor these types of things. In my mind, as long as I filed their forms and the \"Fit to Fly\" form, I thought I was ready to go. Do you see any mentions of Medical Records on the contract?I won't be getting a refund from my Costa Rica Hotel money, nor will have a special seat on the airplane to go back to San Diego. My mobility level requires assistance, and don't know anyone in Miami. I will be released in a couple of days and am in no condition to fly on my own.Read the contract and if it appears to be evasive, BELIEVE ME, their contract was purposely designed to deceive you.", "rating": 1}, {"title": "Easy to purchase coverage", "text": "Easy to purchase coverage. Did not need to use it, so no experience there but would use again based on how easy it was to purchase coverage.", "rating": 5}, {"title": "Flight delayed 10 hours & Luggage delayed 48 hours", "text": "Had an international flight delayed 10 hours in Lisbon come to find that out that our two main suitcases with clothes for a family of four did not make it to Rome, our destination. After living in the same clothes for 48 hours and no help from the airline to locate our two bags, I went back to the airport in hopes they arrived before we departed for a 10-day Mediterranean cruise. Thankfully, our two bags were in the lost luggage area and we would have clothes for the next 10 days. I filed a claim for our two delayed luggage bags that were delayed for over 48 hours. It took 4 months to receive a decision if I would receive the monetary benefit of $500 per bag that I paid for with the purchase of the insurance coverage. I did not receive what the insurance should have covered. I received a total of $100. So, I do not recommend Seven Corners. Not deserving one star.", "rating": 1}, {"title": "Signing up for and purchasing coverage…", "text": "Signing up for and purchasing coverage was easy", "rating": 5}, {"title": "If you pay when needed to be payed", "text": "Good servicegood pricefriendly  stuff", "rating": 5}, {"title": "Bali & Thailand", "text": "Our representative was amazing. She was professional and very patient especially dealing with a large group like ours.  Any changes that I needed done, were done with no hesitation. Thank you.", "rating": 5}, {"title": "Friendly customer service agent", "text": "Date of experience: September 13, 2023", "rating": 5}, {"title": "refused to pay claim!", "text": "Date of experience: September 21, 2023", "rating": 1}, {"title": "I have always gotten a quick response…", "text": "I have always gotten a quick response with a live person.   I placed a claim, we will see it their payment to me is as good as their customer service is.", "rating": 5}, {"title": "Easy to get access to my files and…", "text": "Easy to get access to my files and plan. Luckily didn't need it this time around, but happy to have had it!", "rating": 5}, {"title": "bicycle accident in Portugal…", "text": "I had a bicycle accident in Portugal and broke my wrist.  I called Seven Corners from the hospital, and they suggested I pay up front (since the costs weren't exorbitant) then submit receipts.  I did exactly that, collecting receipts until the cast came off five weeks later.  I then submitted everything and received the reimbursement checks today, four weeks later.  I definitely will use their insurance again!", "rating": 5}, {"title": "Seven Corners came through for me when…", "text": "Seven Corners came through for me when I was unexpectedly diagnosed with AL Amyloidosis and was unable to travel to the Galapagos Islands and Ecuador.  They were courteous, helpful, and refunded the cost of the trip according to the travel insurance contract.  I'm very happy with their service!", "rating": 4}, {"title": "Good policy options and pricing", "text": "Good policy options and pricing.  Like to purchase high coverage for medical without covering full cost of trips - like the options Seven Corners provides", "rating": 5}, {"title": "Quality customer service", "text": "Its easy to get ahold of a representative which is soooo refreshing. They give you 14 days to change your mind. If you change your mind they will refund you back the money. What isnt to like?", "rating": 5}, {"title": "Payment", "text": "I filed a claim towards the end of July, they told me it would be reviewed in 30 days, which it was. I got the confirmation email that it was review and it listed everything I was being paid for and told me that the delivery of my payment would take UP TO 10 business days, which you’d think that it would come maybe a little early or at least on the 10th day but it still has not. I could just be overreacting because it’s the 10th business day but it’s 10pm and obviously won’t be delivered. In my opinion, 10 business days is plenty of time to ship a check, it should be here by now.", "rating": 2}, {"title": "Polite and helpful regarding upcoming…", "text": "Polite and helpful regarding upcoming international travel.", "rating": 5}, {"title": "It is nice knowing you have insurance…", "text": "It is nice knowing you have insurance in case anything goes wrong.  The airlines lost one of my suitcases and eventually found it but was glad I had backup if needed.", "rating": 5}, {"title": "Great on buying end, didn't experience claims process", "text": "Obtaining the policy was easy and phone staff was very friendly and helpful. But, unfortunately -- or fortunately -- we didn't have to file a claim, so I have no idea how well Seven Corners does with ease of claims and reimbursement.", "rating": 4}, {"title": "Very easy and smooth experience", "text": "Date of experience: September 01, 2023", "rating": 4}, {"title": "It took entirely too long for the claim…", "text": "It took entirely too long for the claim to be processed (49 days); however we were compensated to our satisfaction in the end.", "rating": 3}, {"title": "Great Service", "text": "Pleasant, fast and efficient.  Couldn't have been any better!!", "rating": 5}, {"title": "My Seven Corners Medical Insurance", "text": "When purchasing my Seven Corners Medical insurance I omitted a destination. I called early this morning to fix this error and a young gentleman whose name I think is Richard was super efficient, sweet and professional and was able to add my destination right away. The service was excellent.", "rating": 5}, {"title": "I had several questions about the claim…", "text": "I had several questions about the claim form and direct, clear answers were given politely and professionally. I liked the call back feature during peak times 2RTB22-AOS-125722", "rating": 5}, {"title": "Confidence", "text": "Efficient personnel - ease of use - confidence in company from prior experience RTC - 130589", "rating": 5}, {"title": "This is an easy to use site that gives…", "text": "This is an easy to use site that gives multiple options for coverage.They are reliable, available and communicate well,Prices are competive", "rating": 5}, {"title": "Trip Interruption Wasn't Paid", "text": "What a joke.  Replied to their customer care as indicated and I get an email form letter response that their advisors are all fully trained and I could file an appeal if I wanted to.  Not sure what the point was in replying to my review but it lowered the rating even more.Had a pretty severe knee injury in Italy (Cinque Terre) and couldn't get to a doctor for a few days but knew I'd be unable to continue our trip in areas that required any kind of walking - most of Italy.  Because I changed my flight before the doctor confirmed that indeed I shouldn't put weight on my knee & should cancel the rest of my trip, they denied the claim - for less then $250 in change fees.  The small medical bill from the doctor in Florence was paid, but it took several weeks and follow-up phone calls told me just to wait until it was processed.  I gave it two stars because at least they paid the medical bill (under $200).", "rating": 1}, {"title": "Date change", "text": "Date of experience: September 05, 2023", "rating": 5}, {"title": "The person who I spoke to was very kind…", "text": "The person who I spoke to was very kind and understanding", "rating": 5}, {"title": "Steer Clear", "text": "I strongly urge you to steer clear of this company. I had trip insurance for a trip to Maui that we had to cancel due to the wildfires. I managed to cancel and receive refunds from every entity, including the airline, VRBO rental, rental damage insurance, car rental, every excursion/activity we had planned and prepaid, etc. You get the idea. However, Seven Corners refused to cancel our trip insurance although they would have had to pay me thousands of dollars for the legitimate trip cancellation as I had paid for an \"any reason\" cancellation. However, under the circumstances, each entity gave me a 100% refund although we were outside the cancellation time for the airline and condo rental, which was the significant portion of what the loss would have been. It is outrageous that Seven Corners lacked empathy and disallowed me to cancel the policy under this situation. For full disclosure, they did offer to \"suspend\" the insurance to allow me to apply it WITHIN 1 YEAR, in case we reschedule out trip. I tried to explain that does me no good since our plans were in West Maui, specifically in Lahaina, which will NOT be rebuilt within a year. I trust they will reply to this review with something about the terms of the policy not allowing a cancellation, but I remind everyone reading this that Delta Airlines and VRBO could have invoked their non-cancellation terms also and forced me into a credit situation. However, those companies showed empathy for an elderly couple who had saved for a bucket list trip to Maui to celebrate our 40th wedding anniversary. Shame on Seven Corners.", "rating": 1}, {"title": "When setting up account", "text": "When setting up account, there was a real person who worked with me. That went smoothly. And the cost was reasonable.", "rating": 5}, {"title": "Didn't Need the Insurance", "text": "Date of experience: August 26, 2023", "rating": 4}, {"title": "Crystal Gayle is wonderful!", "text": "Date of experience: September 02, 2023", "rating": 5}, {"title": "The customer service rep was great", "text": "Date of experience: September 01, 2023", "rating": 5}, {"title": "Amazing customer service and support", "text": "Amazing customer service and support.  Easy to reach a human !!!", "rating": 5}, {"title": "Why is my claim taking so long…", "text": "Why is my claim taking so long ($6,900). All needed material has been sent--Drs. letters---credit card payments---cruise co cancel info--travel co. letter of payment and cancel--ETCEach time same notice --info sent for review---It seems I always have been sent to the rear of the linr.I will be needing ins. for 2 future cruises--(I've been on 33 and only had to cancel 2 cruises that required Travel ins. intervention.I'm having second thoughts about Seven Corners!!Let me know why I should continue to use your Co.First contact to Seven Corners about claim  7/19/23", "rating": 2}, {"title": "Signing up was easy & quick", "text": "Signing up was easy & quick. I had no claims so i can't speak to that but i definitely felt more at ease knowing i was covered for all unexpected emergencies.", "rating": 5}, {"title": "Jenetta did a great job walking me…", "text": "Jenetta did a great job walking me through my claim form yesterday!", "rating": 5}, {"title": "Seven corners travel insurance", "text": "When looking at travel insurers make sure you only pay attention to reviews where claims were filed. We had a flight cancelled from Atlanta to Asheville NC after we’d been traveling for 28 hours straight from Germany. They rebooked our family of 5 all on separate flights over the course of two separate days including my 8 year old. It wasn’t an option for her to fly alone. There was not a single rental car available in a 30 mile radius for drop off in Asheville so we hired a very expensive Uber. In my claim I made clear that we were not expecting full reimbursement but did expect some kind of relief. Maybe fair market value of a rental car driven 200 miles (even though none were available). They denied our claim because they only cover “local” transportation. How in the world am I supposed to get home from Germany using only local transportation?? I guess they expected us to stay in Atlanta and fly one by one back to Asheville over two days with my 8 and 12 year olds by themselves. I’ll never use this company again and will happily tell anyone who brings up the subject of travel insurance about my experience. Save your money…you may need it for “non-local” transporation.", "rating": 1}, {"title": "Great customer service", "text": "Great customer service! 😊", "rating": 5}, {"title": "Fast and efficient to add to a policy.", "text": "Date of experience: August 29, 2023", "rating": 5}, {"title": "Very supportive team", "text": "Very supportive team. Thanks", "rating": 5}, {"title": "AVOID AT ALL COSTS!", "text": "They denied a claim for a return flight after my daughter's connecting flight was cancelled. They said they'd cover reasonable transportation, hotel, etc but not a return flight. COMPLETELY NOT OK TO EXPECT A MINOR SHOULD BE LEFT IN A MAJOR CITY OVERNIGHT UNACCOMPANIED! AVOID THIS COMPANY AT ALL COSTS! The flight I booked to get her home was less than the costs of a hotel and uber.", "rating": 1}, {"title": "Last minute policy update", "text": "Quick answer of my phone call.Fast answer to my question.", "rating": 5}, {"title": "A prompt response to my claim.", "text": "I needed to file a claim and spoke with three reps as I was putting it together.  They were competent and wonderfully kind on every call.  The documentation was complex, and I received detailed instructions and confirmations.  After I filed the claim, there were no follow-up questions or concerns on Seven Corners' part.  In a few weeks, my claim was accepted and the funds sent to my bank.  I was very impressed and would recommend their travel insurance to everyone.  Phillip Forester", "rating": 5}, {"title": "They were helpful and patient with…", "text": "They were helpful and patient with necessary changes and learning of their website.", "rating": 5}, {"title": "They come through", "text": "Customer service was very helpful in talking to me about how to file a claim.", "rating": 5}, {"title": "filed a claim a month ago taking too…", "text": "filed a claim a month ago taking too long to respve issue and be reimbursed. satisfied all requirements", "rating": 3}, {"title": "Great Communication from Seven Corners", "text": "Seven Corners communicated with me from the time before my trip, during and after. It provided me with my documents in emails more than once, so they were accessible and convenient. I appreciated having these communications even though I had downloaded the documents on my phone. It was nice to have them in various locations in case I needed them in a hurry.", "rating": 5}, {"title": "Trip extension insurance coverage", "text": "They understood that we had extended our trip, and they let us buy the insurance we needed going forward.  We purchased the insurance about 3 weeks before the extended part of our trip started.", "rating": 5}, {"title": "Made deposit on trip for April 2024 of…", "text": "Made deposit on trip for April 2024 of $99 in May then a payment of $475.80 for June & $475.80 for July.  In August I had to cancel trips for financial reasons only to be to told financial is not covered.  Only physical was acceptable!   Totally shocking & unacceptable to receive about $325 back . . .& losing over $700!   As if anyone - any age - could not have to cancel a trip a year away.  Will never use EF tours or 7 Corners again.  Shame on you . . . Letting everyone know how you keep $ that doesn’t belong to you.  You get zero stars!!", "rating": 1}, {"title": "My ID PS00353230", "text": "My ID PS00353230. I have been getting emails very quickly and they follow the whole process. Thanks.", "rating": 5}, {"title": "It was easy and clear to purchase.", "text": "It was easy and clear to purchase.Luckily I didn't have to use. So I can't speak to claims", "rating": 5}, {"title": "Tandy was quick", "text": "Tandy was quick, courteous and professional. My situation was handled well.", "rating": 5}, {"title": "Nathan in customer service was very…", "text": "Nathan in customer service was very helpful in helping me file my claim and that I was doing it correctly.", "rating": 5}, {"title": "We never had to make a claim", "text": "We never had to make a claim,  but knowing they were there for our entire trip gave us peace of mind", "rating": 5}, {"title": "Exceptional Service", "text": "Seven Corners is my primary travel insurance provider. Their flexibility and customer service is tremendous. I've used them for many years and have also handled a claim for me perfectly.", "rating": 5}, {"title": "Easy to understand and enrol", "text": "Date of experience: August 06, 2023", "rating": 4}, {"title": "I never had to use it", "text": "I never had to use it. I did feel well covered.", "rating": 5}, {"title": "Troy handled my wife and my travel…", "text": "Troy handled my wife and my travel insurance requests promptly, professionally and we shared some humor....I have been using 7 corners for years as we have traveled to 104 countries, all 7 Continents, circumnavigated Australia, Iceland and traveled around Africa and S America!", "rating": 5}, {"title": "Certificate 1TPC23-AOS-110507", "text": "I had a very pleasant and productive experience. The representative i talked to ( i apologize for not remembering his name) was super friendly, engaging, very knowledgeable, and most importantly He addressed all of my issues. So thank you so much for making my day and allowing me to check off one more item from my to do list.", "rating": 5}, {"title": "I found Seven Corners responsive", "text": "I found Seven Corners responsive, organized, and helpful.  My only problem was that I am not good at dealing with electronic devices, partly because I am 82 and did not grow up with these devices.  I did need a physical copy of the form I needed in order to fill out the application for repayment of the costs of an unexpected medical emergency.  I had to call a couple of times before receiving these forms, but they were sent to me eventually.  However, no one acted impatient with my lack of expertise and finally, we figured out how to print the online version of the form which we had been sent initially.  This is a really good company!! In addition, the agents I spoke with spoke clearly and understandably, without difficult-to-understand foreign accents.", "rating": 4}, {"title": "Heather was very helpful and we needed…", "text": "Heather was very helpful and we needed to reschedule our trip several times and she always made sure we continued to have excellent coverage for our trip to Ireland.", "rating": 5}, {"title": "My mother fell and broke her pelvis…", "text": "My mother fell and broke her pelvis while on an overseas cruise.  Seven Corners was a life saver.  They were responsive and helped us get her home.  Thank you!", "rating": 5}, {"title": "Very helpful extending our coverage…", "text": "Very helpful extending our coverage through the pandemic.", "rating": 5}, {"title": "MY FAMILY AND I WERE NOT PAID BACK FOR…", "text": "MY FAMILY AND I WERE NOT PAID BACK FOR THE COVID PCR TEST THAT WE TOOK BEFORE TRAVELLING EVEN THOUGH WE HAD COVERAGE FOR COVID. WE GAVE THEM THE REQUIRED DOCUMENTATION BUT WERE DENIED. NO PROPER EXPLANATION WAS GIVEN TO US WHY WE WERE DENIED COVERAGE. WE NEVER EXTENDED OUR COVERAGE AGAIN WITH THEM.", "rating": 1}, {"title": "Answered the questions and corrected…", "text": "Answered the questions and corrected wife's last name. Haven't used any of the features so can't comment on how well the actual coverage is done.", "rating": 5}, {"title": "Great customer service", "text": "Nathan was extremely friendly and helpful.  Excellent!", "rating": 5}, {"title": "Poor customer service", "text": "Representative never returned phone calls or responded to emails after the initial cancellation period was over.  It was a relatively large policy - trip cost per person was over US$50K.   I contacted Customer Service directly and have to be transferred a few times to get the right support.   I will never insured with this company again.", "rating": 2}, {"title": "Certificate #", "text": "Certificate #: 2RTCG22-OR-100006DeAwna Bailey was extremely valuable in helping me navigate the travel insurance policy for my group.It is because of her that I selected Seven Corners.", "rating": 5}, {"title": "Easily policy changes", "text": "Rep was professional and made the changes to the policy for my upcoming trip as requested.", "rating": 5}, {"title": "A Salutory Saga", "text": "Our return flights from Cairo to the US were cancelled by the airline due to a strike at Munich Airport, so we purchased alternative flights home and submitted a claim for the additional cost, which was modest after net refunds for the cancelled flights.The initial claim was denied \" as the interruption was not triggered due to the strike being a planned event \" Since the strike was NOT planned when we started the trip, let alone when we bought the policy, we appealed this decision.The appeal was also denied, but now for a different reason -  \" a strike must result in cessation of travel services for at least 48 hours of the carrier \". While the strike itself in Munich airport was 24 hours, the earliest flight option offered by the airline was 48 hours later !I did not expect Seven Corners to resort to differing and illogical explanations to avoid reimbursing a reasonable claim.", "rating": 2}, {"title": "It was great 😊", "text": "It was great 😊! At first I did not believe that I would get my money back , but I as soon as I completed the things needed ,!I got it quick! Thanks and is worth having a good coverage. Highly recommended 😊", "rating": 5}, {"title": "great service and execution", "text": "great service. excellent communication.everything was first rate. easy to do business with", "rating": 5}, {"title": "Easy clear helpful", "text": "Easy, clear and helpful.The representative was excellent!", "rating": 5}, {"title": "Don’t travel without Insurance.", "text": "Didn’t have to use it..this time. But had to twice in the past. Both times in Spain. Company was very responsive and fair. Took a little longer during Covid but they came through in covering unexpected expenses related to us catching Covid.", "rating": 5}, {"title": "great communication", "text": "Date of experience: August 01, 2023", "rating": 5}, {"title": "Cooperation is key", "text": "Cooperation is key. Especially when we canceled our trip due to the pandemic.", "rating": 5}, {"title": "Easy to work with", "text": "Easy to work with. Needed insurance for 4 couples from 4 different states. Got the coverage we needed at a decent price.", "rating": 5}, {"title": "Great customer service", "text": "Great customer service, great attitude, loads of help.", "rating": 5}, {"title": "I had an issue with the policy set up…", "text": "I had an issue with the policy set up when I missed a letter off my email.Seven Corners staff rectified the issue very efficiently.", "rating": 5}, {"title": "Communications", "text": "Communications.  They should ID company  and not just say claims. A person may not open email.", "rating": 4}, {"title": "Seven Corners Insurance", "text": "I needed information sent to me concerning my cruise insurance. I Needed to speak to two customer service individuals. They were very knowledgeable and courteous.", "rating": 5}, {"title": "Easy to communicate with", "text": "Easy to communicate with. Each time all transactions have been completed in a fast manner. Every person I have interacted with has been very nice and professional.", "rating": 5}, {"title": "am surprised by all reviews I see not Part of Reality", "text": "am surprised by all reviews and have clear doubts it is even accurate I suggest looking for BBB reviews. experience with Seven Corner Insurance Company, which has left me feeling deeply dissatisfied and concerned about their practices.Since January 2023, I have been attempting to settle a claim with Seven Corner Insurance Company, but to my dismay, they have continuously delayed the process by repeatedly asking for additional documents. I have dutifully submitted all the required documentation, but they seem to have made no effort to respond or address my concerns. Their lack of communication and unresponsiveness have left me frustrated and anxious about the status of my claim.I have tried reaching out to them via email and phone calls numerous times, but my attempts have been met with silence. It is disheartening to see such a lack of concern for their customers, especially when they are obligated to provide the services they have promised.As a last resort, I filed a complaint with the Better Business Bureau (BBB) in the hopes that it would prompt a response from Seven Corner Insurance Company. However, even the BBB complaint has not elicited any reply from the company. My research on the BBB website has further revealed that my experience is not an isolated incident, as there are other customers facing similar issues with the company. It is distressing to see Seven Corner listed as a company with multiple complaints and no resolution, despite their claims of being the best insurance company, as highlighted on their website with a Forbes award in 2023.I firmly believe that consumers should be protected from such fraudulent practices, and it is imperative that authorities step in to safeguard our rights as consumers. Misleading promises and lack of accountability from insurance companies can have severe consequences for individuals who rely on their services to protect themselves and their families.I kindly request your intervention in this matter and urge you to investigate the actions of Seven Corner Insurance Company thoroughly. They should be held accountable for their misleading practices, lack of responsiveness, and failure to fulfill their obligations to their customers, as outlined in their policy agreements.MOST ANNOYING THAT YOU WILL FIND THE COMPANY WILL RESPOND TO ANY REVIEW LIKE (I will put in an escalation request to look into your claims. Our goal is for the Escalation Team to contact you within 10 business days (Monday - Friday).) THAT MSGS I GOT 2 MONTHS AGO ON GOOGLE REVIEW then you will find a new 3 or 4 Positive 5stars reviews after each negative Reviews what magic in all these company reviews 😂", "rating": 1}, {"title": "The person I spoke with was easy to…", "text": "The person I spoke with was easy to understand, knowledgeable and very helpful.", "rating": 5}, {"title": "Gotta have it just in case", "text": "Travel insurance is something you hope you never need. We didn't need ours but it was good to know it was there. We had about 20k tied up. 7 corners was in constant contact with us from about 7 days out until the vacation was over. Good to know they were there.", "rating": 5}, {"title": "Fortunately I did not require any…", "text": "Fortunately I did not require any services. It felt really good to know someone had my back.", "rating": 5}, {"title": "Great representative during purchasing process", "text": "The representative, (Tristan), when we selected our plan was Excellent. He is Very well informed, spoke clearly and explained all completely.  Fortunately, we did not have to use your services during our trip as all went well.", "rating": 5}, {"title": "Could not find any hospital accept the…", "text": "Could not find any hospital accept the insurance in Lexington KY", "rating": 2}, {"title": "This travel insurance made us feel very safe and secure", "text": "This travel insurance made us feel very safe on our trip. Luckily we didn't need to use it.  We bought it last year and had to delay that trip and they let us keep the policy and upgrade it if use within 2 years. Awesome option!", "rating": 5}, {"title": "It was very easy to do and the person on the phone was very helpful", "text": "It was very easy", "rating": 5}, {"title": "No complaints here", "text": "I really didn’t need to use the service ..but I have been going with Seven for all my travel coverage for over 10 years . My trips have been smooth sailing Thank God !! Purchasing it online is seamless.", "rating": 5}, {"title": "the people at your company are very…", "text": "the people at your company are very helpful and courteous", "rating": 5}, {"title": "Requesting a refund was very straightforward", "text": "Requesting a refund was very straightforward. However, it did seem like there was a duplication of document requests.  Nonetheless, I was very satisfied with the process and outcome.", "rating": 5}, {"title": "Peru 2023", "text": "We had originally booked our trip to Peru in 2020. As everyone knows that year COVID stalled everyone's travel plans. So we re-booked for 2021, travel was still iffy, so then rebooked again for 2022, where travel was still concerning. We FINALLY went on our trip to Peru July 2023. Seven Corners worked with us, and was able to use the travel insurance we purchased back in in early 2020 and transfer it for 2023. As I had to do was contact them with our updated travel plans. I did not need to purchase new travel insurance due to change of date plans.", "rating": 5}, {"title": "Easiest thing I didn't have to use...", "text": "Thankfully I didn't need to use the coverage, but it was easy to sign up for, all the documents and info were easy to understand and print off to take with me on my trip.", "rating": 5}, {"title": "Excellent customer service so far", "text": "Excellent customer service so far. We have always gotten trip insurance but never had to use it until this past trip. Unfortunately, due to weather delays we were stuck in NY for 2 extra days that was not expected. This is the first time I've ever had to make a claim and so far so good. The customer service rep was super helpful and I am so glad that I chose Seven Corners for my insurance needs!", "rating": 5}, {"title": "No need for medical attention the five…", "text": "No need for medical attention the five months in Vienna.", "rating": 5}, {"title": "Great coverage for the price", "text": "The materials explaining what the insurance did/did not cover were clear and easy to read, and I determined it provided the best coverage for the price. Also purchasing was super easy and smooth. Fortunately I didn’t have to use it but it also seemed like there were many options for reaching someone in case of emergency.", "rating": 5}, {"title": "Completion of purchasing in stages of Payment of Costs", "text": "Completion of purchasing in stages of payment of actual costs is wonderful.  Deposit, final payment of cruise/tour, flights, transportation, etc.", "rating": 5}, {"title": "The representatives were courteous and…", "text": "The representatives were courteous and helpful  in answering my questions and getting to me the necessary forms and explaining the required information I would need  to file my claim.", "rating": 5}, {"title": "No help was provided", "text": "No help was provided by the representative. The customer service line was not working due off-hours even though it was supposed to 24/7. They claim more than they provide.", "rating": 1}, {"title": "Personal contact…", "text": "Speaking personally to an English-speaking representative who was able to answer my questions and facilitate the claim process.", "rating": 5}, {"title": "Apply early!", "text": "I didn't need to use the insurance so I can't speak to how well it works. The brochures and other material appeared clear and self-explanatory. It did take a while to register (done by the organization sponsoring my overseas stint). They said there was some complication particular to the state I am from (New York). So you may want to register early to be sure you are covered from day one of your travel.", "rating": 4}, {"title": "Compensation for Travel Delay", "text": "I had a good experience with the handling of my claim when travel was delayed for my tour to Italy. The compensation was quick and fair.", "rating": 5}, {"title": "Getting the insurance was easy and…", "text": "Getting the insurance was easy and quick.  I didn’t have to use it thank goodness.", "rating": 5}, {"title": "Excellent coverage, professional service", "text": "We submitted both medical and trip delay claims with Seven Corners while we were traveling abroad. Their agents are professional, informative, and kind. Both claims were fully covered and the process was facilitated with ease. The premium cost is very reasonable for the scope of coverage offered. We felt very secure traveling with Seven Corners' coverage plan, and I would gladly use their services again in the future. I travel often, both with and without additional travel insurance coverage, and after using Seven Corners, I can confidently recommend their services to anyone traveling abroad.", "rating": 5}, {"title": "Never reimbursed valid claims", "text": "Date of experience: July 01, 2023", "rating": 1}, {"title": "We purchased the insurance but…", "text": "We purchased the insurance but fortunately did not need to use it", "rating": 5}, {"title": "Sister died over in Chile on July 4th…", "text": "Sister died over in Chile on July 4th 2022 and we are still have a hard time being reimbursed from Five Corners. You do not respond to our emails and when you do it's to say that you don't have the paperwork which we have sent FOUR times. This has been an extremely difficult time for us and you have made it even move so. I would NOT recommend you at all and simply say that this company feels very much like a scam. Especially since we were FORCED to acquired your policy to enter Chile.", "rating": 1}, {"title": "Nathan Nowacki did a great job", "text": "Nathan Nowacki did a great job walking me through how to submit a claim and answer all my questions.", "rating": 5}, {"title": "Peace of Mind", "text": "I just completed a glorious trip -- riding horses in the Rocky Mountains of Wyoming. While I had no need to file a claim, having this policy gave me peace of mind --especially when someone else on the trip had an accident! Will definitely purchase a policy in the future.", "rating": 5}, {"title": "Insurance always finds excuses not to pay.", "text": "I was very disappointed that I did not receive a complete refund of my minimal expense. It is very frustrating to pay so much for insurance. Then, when you actually need help and submit a claim, the company finds every excuse not to fulfill their obligation.Cert#1994655DF244", "rating": 3}, {"title": "Fortunately I have never had to use the…", "text": "Fortunately I have never had to use the insurance I have gotten through Seven Corners, but I continue to be impressed with help I get when I call them for I travel insurance and advice.  I was recommended to them several years ago and have recommended SC myself.   It is just so seamless", "rating": 5}, {"title": "Great Customer Experience", "text": "Customer focused - easy to deal with and answered all questions. Sent documentation promptly and followed up as necessary.", "rating": 5}, {"title": "Great customer service and fantastic pricing", "text": "After researching several companies and having used others for past overseas trips, I decided to purchase a \"Cancel for Any Reason\" policy with Seven Corners for my most recent trip to the UK.  They had the most reasonable prices and easy to understand conditions.  I also appreciated how I can purchase an initial smaller amount and then as I continue to pay the final payments on my trip, I was able to increase coverage.  I did that by calling and Seven Corners representative was extremely helpful.  Everything was easy to understand.  I will definitely use them again.", "rating": 5}]