[{"title": "Great Insurance Coverage", "text": "I'm happy with the phone conversation with your agent. I wanted a good plan that fit my needs and new coverage for the area I have moved to. Speaking with your agent helped me get exactly what I was looking for and needed. Thank You!", "rating": 5}, {"title": "Professional", "text": "Professional, friendly, very informative.  Felt as if I got the best health insurance.  Very helpful.  Took time to answer all my questions.  Very through. Linda is an asset to your company.", "rating": 5}, {"title": "Satisfied client!", "text": "Started speaking with Truman Woodworth who was very thorough, polite, easy to follow along with but unfortunately, he was not licensed in Michigan where I live.  Truman forwarded me to Steven Orthun who also was very informative, patient and answered all my questions.  I am a satisfied client.", "rating": 5}, {"title": "Person I take to and how at ez they…", "text": "Person I take to and how at ez they made me feel ", "rating": 5}, {"title": "Tricia", "text": "Tricia, was very helpful and answered all of our questions. She was very personable and knowledgeable about the insurance! I'm glad we were able to talk to her Wednesday. 100% satisfied!", "rating": 5}, {"title": "Bryant was great. I wish I would’ve known half the things he told me it would’ve been very helpful but he guided us through a better plan and I want to thank him very much for that.", "text": "Talking with Bryant was a great experience.Bryant was very informative on everything that I needed to care of all our needs is the first time ever heard of this company and was a pleasure doing business.", "rating": 5}, {"title": "Awesome service from Sue", "text": "Awesome service from Sue. She sounded sincere and determined to find solutions to my issues. went over and beyond to make sure I got the coverage I wanted at prices I could afford. also she followed through to taking my payment aand making sure I was covered.", "rating": 5}, {"title": "A great agent makes all the difference.", "text": "Agent Robert LeClaire is very knowledgeable, personable, and creative in his consultations. We are extremely pleased with his work and recommend Ensurem and Mr. LeClaire highly. We have worked with him for 3 years and are always impressed with his attention to and his in-depth knowledge of insurance products for our needs in our state.", "rating": 5}, {"title": "Absolutely Great!", "text": "Starla is great! She answers my questions thoroughly and makes sure I understand my options so I can make the best decision for my needs. She's patient, knowledgeable and makes me feel like I'm talking to someone who cares about me. It's clear she loves her job. I've referred several friends and family to Ensurem.", "rating": 5}, {"title": "Listen", "text": "Listen, your representative, Elena Arkins, was (is) top-notch. She asked and answered every question. She was friendly, clear, and concise, and I was just impressed!I know I waited until almost the last day to make my changes and I know everyone in your business will be terribly busy until midnight tonight, but there was no indication of stress or \"let's hurry this up,\" and it was so pleasant!If this (she) is a reflection of your company, I know I'm going to be very happy.", "rating": 5}, {"title": "Always use Ensurem", "text": "The agent I have is totally knowledgeable in all the insurance companies he represents and thoroughly goes over every detail twice with you.  I've used Ensurem for over 3 years and have been totally satisfied.", "rating": 5}, {"title": "Great agent = Great experience!", "text": "What made my experience great was your agent Toshi. He’s extremely personable, professional and knowledgeable. It comes across very strongly how much he values his job and he works hard to provide the very best options for the customer. My sister and myself want to have Toshi as our agent for as long as possible. We’ve already been talking to a younger sister about him helping her with a Medicare plan when the time comes. Toshi is nothing short of exceptional!", "rating": 5}, {"title": "Phillip my agent was extremely polite…and helpful in all my needs", "text": "Phillip my agent was extremely polite and helpful in my matter!! He once again helped me choose a plan which would be better for me!! He explained everything to the fullest and went above and beyond!! Thank you again Phillip!!", "rating": 5}, {"title": "The agent", "text": "The agent, Patrice, who helped me was friendly, courteous, and really knew what she was doing.  She was very helpful, answering all the questions I had.  As far as Ensurum is concerned, it hasn't even been 24 hours since I signed up, so I really have no knowledge of the company itself (and I hope I never find out).", "rating": 5}, {"title": "Mr Davis Patience", "text": "Mr Davis patience, suggestions, and guidance were very helpful to me. He tried many ways to ensure I had proper and thorough coverage. Helped with procedures for my first payment of insurance coverage. Thank You Again James Staten", "rating": 5}, {"title": "Thewith treated us like…", "text": "The agent we spoke with treated us like old friends. ( not referring to our age)) She helped us last year and we were  very happy and satisfied. We has a few quick questions and I had a note in my phone that said call Mira Willright at any time and she will be able to help us.", "rating": 5}, {"title": "Pam is the GREATEST!", "text": "Pam is the GREATEST!! She helped me with everything !!! Deshawn tooke off my policy I should have stayed on !! He really screwed me over !! Pam fixed everything !!! ", "rating": 5}, {"title": "Franklin is awesome!", "text": "Franklin is awesome!! Had to re-enroll when doctor didn’t renew Aetna contract which didn’t show when I first enrolled", "rating": 5}, {"title": "i have been using Ensurem for all my…", "text": "i have been using Ensurem for all my health care needs for several years,as we are on a fixed income,and are always looking for ways to stretch our dollars,while finding the best policies available for our needs.My advisor there, has been the best.He has never been too busy to take a call,answer a question, or research a product for us.I have recommended  Ensurem to others .We have been very pleased  with the service.", "rating": 5}, {"title": "The Advisor", "text": "The advisor, Jessie Gardner, I believe her name is, was terrific.  I felt comfortable talklng, like a friend who knew a lot about inusrance.  I asked silly questions, I thought, but her answers were directed to me individually.  Made my day.", "rating": 5}, {"title": "I cancelled the Dental Insurance…", "text": "I cancelled the Dental Insurance because I wasn't given the opportunity to choose paper billing it was automatically chosen for me. And to change to paper billing would've been an extra 6.00 that's not the way to do business. Will I recommend you all No", "rating": 1}, {"title": "Wonderful experience with my Ensurem insurance agent!", "text": "Lisa Feinberg (#1036) is always a pleasure to work with!  She works very hard in finding the best insurance plan for you (re: Medicare client) and always follows up with you after new enrollment and throughout the year.She is an excellent insurance agent and I’m with Ensurem because of her.", "rating": 5}, {"title": "Excellent people skills", "text": "My agent Jennifer Frede is hands down the best agent I have ever worked with.  She was so patient and kind. It made me feel so comfortable and enolling with her. She was very knowledgeable and made sure I understood everything. We need more people like her in this world.", "rating": 5}, {"title": "CUSTOMER SERVICE!", "text": "Eduardo Melendez is the greatest in his job.  He explained everything so I could understand & was very patient in leading me thru the application process. Keep him as long as he will stay. Very knowledgeable!!", "rating": 5}, {"title": "Heather was very patient and…", "text": "Heather was very patient and sympathetic as well as empathetic to me and my situation.  She gave very good suggestions. And made sure to ask if I understood her reasoning for the suggestion. She got a little emotional at the end but so did I.  But she got all the disclaimers in. After the first hour. I was struggling to care just send the paperwork.  That would be my only complaint. But I understand 😊", "rating": 5}, {"title": "Excellent Representative", "text": "I called Barry Zuta to help with my insurance needs as I used him last year. He is very professional, friendly explains everything in details and compares everything and he just made the whole experience enjoyable. It’s great to just communicate with him as he is a very personable person. I feel I got the best service with Barry that is possible. I rate Barry 12 stars out of 10.", "rating": 5}, {"title": "Heather Ross was my agent", "text": "Heather Ross was my agent. She is very friendly and well informed. She listens carefully and is extremely easy to understand. I specifically chose her to help me with changing my Medicare G carrier because I had a similar excellent experience with her last year", "rating": 5}, {"title": "Top notch sales lady. My experience was great she was very helpful,didn't try to push me into a sales. She was very nice,explained everything and really enjoyed her as a person. Thank you Trish!!!!", "text": "The company is doing great hiring a lady who has time to explain what's going on,she didn't try to push me into a sales. She is top notch . Thanks Trish for your help", "rating": 5}, {"title": "I’m very happy with the company", "text": "I’m very happy with the company. The representative was so helpful and through they met my needs I’m looking forward to staying and getting all my benefits.", "rating": 5}, {"title": "I was glad to be able to communicate…", "text": "I was glad to be able to communicate with Rita Foster this year. She is helpful and very patient with me. Very knowledgeable. Speaks very clear which is easy to understand what she is saying. Always is able to answer my questions. Finds the best insurance that is appropriate for me.", "rating": 5}, {"title": "We have dealt with Brian Gindlovec for…", "text": "We have dealt with Brian Gindlovec for the last few years, he is very knowledgeable and informative. He explains things so we understand what we are getting. When we speak with him it is like talking with a friend!!👍👍👍", "rating": 5}, {"title": "Switching healthcare companies with Ensurem was like getting a 30% raise!…", "text": "You made me aware that there were tremendous benefits to switching to united healthcare. With the extra benefits I can pay my utilities and supplement my monthly food bill. I would have never been aware of these benefits that were available to me if it weren’t for you company, thank you.", "rating": 5}, {"title": "Salpy was Awesome and handled all of my questions and my needs for insurance and a drug plan.  Thanks for all your help for an outstanding employee!!!", "text": "Salpy did an Awesome job in answering all my insurance questions and getting everything set up for my supplement insurance and my drug plan!!  Thanks so much!!", "rating": 5}, {"title": "Best Insurance agent…", "text": "Rita Forest is the best Insurance associate with lots of patience to explain the differences between different plans and the Pros and cons of each plan.Also, she is very nice and friendly,s", "rating": 5}, {"title": "Nicole my seniority advacate did a…", "text": "Nicole my seniority advacate did a great job and worked hard to get me the benifits I needed she explained everything in detail to me", "rating": 5}, {"title": "In reviewing my 2023 Medicare plan with…", "text": "In reviewing my 2023 Medicare plan with UHC my Ensurem agent that was not available at Sarasota Memorial….That’s very important to me and happy my agent found another plan.", "rating": 5}, {"title": "Wonderful customer service", "text": "Very professional and personal. Helped me to understand the process,  and which insurance policy would be best for my situation.", "rating": 5}, {"title": "Lisa is the best insurance agent", "text": "Lisa is the best insurance agent.  She clarified things when l had questions. She help me to compare policies.", "rating": 5}, {"title": "Rhonda koslowski is amazing and always…", "text": "Rhonda koslowski is amazing and always willing to go above and beyond to make aureus I get what I need when it comes to my coverage", "rating": 5}, {"title": "Great experience our agent took care of everything!…", "text": "My agent took care of my needs and changed my insurance so I would be able to keep my current doctors.", "rating": 5}, {"title": "Excellent job and last review", "text": "Hello,I completed this surve the first time I received it. Please find it. I don't have time at the moment to rewrite my comments.In short the rep was informative, knowledgeable, and personable.", "rating": 5}, {"title": "Brian Berry", "text": "My agent, Brian Berry was the 1st person to get in touch with me!  After contacting several companies, I didn’t find anyone more knowledgeable, than he was!", "rating": 5}, {"title": "Reuben LaBrado was very attentive", "text": "Reuben LaBrado was very attentive, he asked many questions that defined the coverage that was the right for my needs. He answered all of my questions. He's a credit to Ensurem.", "rating": 5}, {"title": "Dion Sanders What's the representative…", "text": "Dion Sanders What's the representative that I had? He was well knowledgeable. And I really appreciate how he sit there and talk with me about the plans. I would recommend him anytime.", "rating": 5}, {"title": "Amazing! Such a quality interaction.", "text": "As usual, Mr. Joyner was amazing. I really appreciate that you have such quality people to represent your company. Thank you so much!Jennifer Collado", "rating": 5}, {"title": "Humans Dental plan.", "text": "Very profesional and kind agent. He drove me through to the best dental  plan options very clear and honest.", "rating": 5}, {"title": "Great knowledge and resources", "text": "Patient and kind customer service provided by Delhia Malie.  Covered in detail all the plans and timing and costs.  Highly recommend.", "rating": 5}, {"title": "Ms Nicole my broker is the best......", "text": "Ms Nicole my broker is very professional and knowledgeable... she has the customer needs in mind and helped me get best plan available... always a joy to talk to Nicole and she is always a call away....", "rating": 5}, {"title": "Rhonda Kozlowski agent is so helpful", "text": "Rhonda Kozlowski agent is so helpful, completely dedicated to helping me select a health insurance plan best suited to my needs. She gives me all the time and info I need. Can’t say enough about her help.", "rating": 5}, {"title": "Fabien is a great agent", "text": "Fabien is a great agent!  Very helpful, speaks clear English, stays with seniors to get them through the entire process.  Very much appreciated!", "rating": 5}, {"title": "Hello", "text": "Hello! Very nice and knew her information! Made me feel that I needed the insurance!I was very impressed with her ability to tell me everything I needed to know!", "rating": 5}, {"title": "People will love Ensurem!", "text": "The agent was very helpful and thorough, with my needs and explanations! Her knowledge is well of options and choices! She is my person. I understood everything and if I have questions she is very helpful.", "rating": 5}, {"title": "Vance Harper makes it so easy to make…", "text": "Vance Harper makes it so easy to make the right decision about medicare plans. His experience makes him knowledgeable of the good and bad of plans.  I am thankful for his help!!", "rating": 5}, {"title": "Simplifying Medicare using Ensurem", "text": "I've used Ensurem for 3 years now. What a good solid company. My Rep. Is Starla Echague. She is the reason I use this company. This lady goes the extra 10 miles for me and probably all her clients. What an asset to have working for your company. Thank you Starla for everything.", "rating": 5}, {"title": "The young lady gave a clear explanation…", "text": "The young lady gave a clear explanation of the insurances that was available to me and gave details of benefits offered. She was able to answer all questions asked.", "rating": 5}, {"title": "The agent I had was extremely helpful…!", "text": "The agent I had was extremely helpful and professional she took the time to explain all of my options she was reassuring and I was relieved to have acquired the coverage I needed . Thanks again !", "rating": 5}, {"title": "Ensurem experience", "text": "The representative was very thorough. She took my information and looked at all the options. She then explained the options and I signed up for the best.", "rating": 5}, {"title": "High marks for Chris Kaiser!", "text": "Chris Kaiser was, again, extremely knowledgeable, patient and personable! I would gladly refer him to friends.Grant Robbin", "rating": 5}, {"title": "Our agent Lisa Ford ...........", "text": "Our agent Lisa Ford made all the difference in the world.  She is helpful kind and really interested in finding us the best plan for our needs", "rating": 5}, {"title": "Rhonda Kowlowski is the best!", "text": "Rhonda Kowlowski is so helpful. She looked at the various programs to help find a good fit for my situation. She is very personable. The products are so helpful for limited income. Thank you!", "rating": 5}, {"title": "Max is knowledgeable", "text": "Max is knowledgeable, patient, great  personality, and goes the extra mile. I have been with him for a couple years and won't go to anyone else.", "rating": 5}, {"title": "The agent had not called back", "text": "The agent had not called back. Parents are signed up -- money is taken but no final signature done.   I was told will be getting email for elctronic signature and have not reveived it yet. Have called office.", "rating": 1}, {"title": "My agent Reuben Labrado (i apologize if…", "text": "My agent Reuben Labrado (i apologize if i misspelled the last name).He is so pleasant to speak with and very helpful. Doesn't rush and i feel that he has my best interest in mind. 5 + stars for him...", "rating": 5}, {"title": "The representative was very helpful", "text": "The representative was very helpful, knowledgeable, and patient with me. Answered all questions, and explained everything that I needed explaining. Big help.!!!!!", "rating": 5}, {"title": "My agent was informative and helpful…Devin", "text": "Devin Hammon the agent was informative and helpful and answered all of my questions. He was friendly and polite and I would recommend him for any one who would be interested in acquiring insurance.", "rating": 5}, {"title": "Nicole is the best … very informative…", "text": "Nicole is the best … very informative very caring person. If she doesn’t know something she will get back to you with it. She’s very thorough in her job.", "rating": 5}, {"title": "Truman made the process painless", "text": "Truman made the process painless. He was thorough and put together something that works for me. Thanks Truman for all your help", "rating": 5}, {"title": "Erica Santiago was very informativee and…", "text": "Erica Santiago was very informative and helpful she help me to the fullest explain everything so that I could understand it. I'm so glad she was the representative that help me couldn't have gotten a  better person.", "rating": 5}, {"title": "My agent Chris had thorough knowledge…", "text": "My agent Chris had thorough knowledge of the product, and, as important ,was patient in explaining .The whole process was detailed and instructive.", "rating": 5}, {"title": "That you can trust them.", "text": "The young man that I talked to was so helpful. He answered my question truthfully, He let me know that at anytime that I needed help with anything I can call on him.", "rating": 5}, {"title": "Was a good experience with the…", "text": "Was a good experience with the representative  I had right information about medical insurance I had answers all my cuestions and the Representante was so kind and nice. She knows her job. Thanks", "rating": 5}, {"title": "This company took the time to work with…", "text": "This company took the time to work with me. They were very helpful. They answered all my questions. They were descriptive. I have no complaints would definitely that way. Suggest to somebody to go with them. And yes, the company is very reputable in my area.", "rating": 5}, {"title": "My insurance agent made the transition…", "text": "My insurance agent made the transition easy and understandable.  He provided a lot of information and answered all my questions.", "rating": 5}, {"title": "She was very helpful and made the…", "text": "She was very helpful and made the process easy.  You certainly hired the right person for the job.", "rating": 5}, {"title": "That's awesome!", "text": "My agent was Heather Ross. She is just incredible, and very charming. Thank you for all the help she gave me. And a special thanks to her for lifting my spirits with her attitude", "rating": 5}, {"title": "Is it the right one?", "text": "The gal I talked to was very helpful but I am waiting to see if the dental insurance I got will work for me.  The dentist that I have is not on the plan with you and there are really none in the area .    I am hoping it will work.  So I am waiting to see.  I have a dentist appt soon.", "rating": 3}, {"title": "I have called and requested insurance…", "text": "I have called and requested insurance cards for my dental and vision that I’m paying every month and still have not received them or any type of information", "rating": 3}, {"title": "Mrs.sofia was very informative and made…", "text": "Mrs.sofia was very informative and made everything easy to understand! The overall experience was a 10! Thank you for your help.", "rating": 5}, {"title": "Brian Berry, Ensures Rep", "text": "Brian Berry was terrific!  His knowledge and professionalism was undeniable.  Brian explained all the areas of the Atena plan has too offer.", "rating": 5}, {"title": "Dev was very knowledgeable and answered…", "text": "Dev was very knowledgeable and answered all my questions in great detail.", "rating": 5}, {"title": "Fabian could speak well", "text": "Fabian could speak well, and it was a plesure to speak with someone that I could understand. he was also very knowledgable of the policies, and the poducts avaliable to me.  He also listened to my issues.", "rating": 5}, {"title": "Very pleased with Ensurem", "text": "Their representative - Trish, was fantastic in explaining clearly my various optionsAs a result my decision to choose plan was easy", "rating": 5}, {"title": "Great Experience!!", "text": "Sarah Horne was my agent. She was very friendly and helped me find the best Medicare Advantage policy for me. She explained everything to me in detail. This was a very good experience and I hung up very happy about my decision. Thank you so much Sarah Horne!!", "rating": 5}, {"title": "Kenny was exceptional", "text": "Kenny was extremely helpful and thoughtful and professional.Presentation way too long how many seniors actually follow this and understand all the different things covered at what point does one stop listening and just say yes/no to get to the end of all the legal stuff that probably is geared toward the insurer", "rating": 4}, {"title": "Thank goodness!", "text": "Easy breezy,all questions were answered, no pressured.I felt the best suggestions were to fit my needs and what I needed medically.My agent was patient and listened  to me. Thank you.", "rating": 5}, {"title": "Gold Standard of Excellence! …", "text": "Ms.Walton represents Ensurem with Excellence. Going above and beyond to find solutions with patient-centric compassion. A knowledgeable skilled navigator, Katheryn sets Gold Standard in polished professionalism. Highly Recommend. We are grateful.", "rating": 5}, {"title": "Susan is the best", "text": "Susan is the best I have always been able to depend on her, which makes this process so much easier.", "rating": 5}, {"title": "Excellent service", "text": "Excellent service. Dino was extremely nice and knowledgeable. He was great to talk to. He knew all about it answered all my questions", "rating": 5}, {"title": "Andy Roman is a GREAT 😊 asset to your…", "text": "Andy Roman is a GREAT 😊 asset to your Company and provides the BEST Service to his clients.", "rating": 5}, {"title": "Best Dental coverage for retired Veteran", "text": "Was able to explore different options, and connect with Aetna rep to navigate adding dental coverage , and not jeopardize my Tricare for Life/other VA benefits. AGent did 3 way talks with pertinent agencies to validate the benefits.", "rating": 5}, {"title": "Very Caring And Very Sharing.                                  t was very tentative and she…", "text": "The agent was very tentative and she answered my questions in a manner in which made me more informative.", "rating": 5}, {"title": "George very nice fellow!!", "text": "Spoke with George - who made the change in my health insurance very easy.  He is personable and kind.Rachel Smyth", "rating": 5}, {"title": "Barry Zuta is the best", "text": "Barry Zuta is the best! He took his time to find me the best plan to meet my needs. I have had nothing but a great experience with Ensurem!", "rating": 5}, {"title": "Victoria Patrick was a pleasure to work…", "text": "Victoria Patrick was a pleasure to work with. She made the process easy.", "rating": 5}, {"title": "Excellent advice Through review o", "text": "Excellent advice Through review of all plans Questions answered Very patient with all questions and very informed and very helpful!!!!!!", "rating": 5}, {"title": "David Sellers was informative", "text": "David Sellers was informative, courteous and very helpful. He knew and imparted the information so I understood clearly", "rating": 5}, {"title": "The policy was explained to me easy for…", "text": "The policy was explained to me easy for me to understand.  She was very nice and patient.  It’s nice to see have that, especially us seniors. Thank you", "rating": 5}, {"title": "She took her time and explained…", "text": "She took her time and explained everything thoroughly. She spent 2 hours and 40 minutes on the phone with me. The only thing I had a problem with was that she talked a little bit too fast. Other than that she was great!", "rating": 5}, {"title": "Not sure", "text": "Not sure what to write, as I haven’t actually used the insurance yet", "rating": 5}, {"title": "The Rep", "text": "The Rep, (Tabitha) was pleasant and personable.  She took the time to explain all my options", "rating": 5}, {"title": "Excellent!!", "text": "Excellent!!! So happy with the attention paid to us & the info explained. Very satisfied!!", "rating": 5}, {"title": "Rhonda was a great explainer and help…", "text": "Rhonda was a great explainer and help in getting my best insurance choice.  Great to talk with.", "rating": 5}, {"title": "Great experience", "text": "Barry made sure you understand every thing and was made it pleasant to make a decision", "rating": 5}, {"title": "Great interaction from Nicole riviere", "text": "The way she worked on my behalf and getting the right insurance for my needs", "rating": 5}, {"title": "Love Suzanne & wouldn’t work with…", "text": "Love Suzanne & wouldn’t work with anyone else!  She’s professional, trustworthy & very knowledgeable.", "rating": 5}, {"title": "Liked English speaking people", "text": "Liked English speaking people.  All was efficient and quick.  All was explained.", "rating": 5}, {"title": "My agent put me in a better plan", "text": "My agent put me in a better plan.  They explain everything to you.  Let you ask questions if you don't understand.", "rating": 5}, {"title": "Renewable insurance was very helpful and patient and he…", "text": "Rep was very helpful and patient and he told me about extra coverage", "rating": 5}, {"title": "Insurance", "text": "Kenneth was great gave me what I needed to get my insurance options", "rating": 5}, {"title": "Ryan Morse(not sure of spelling) was…", "text": "Ryan Morse(not sure of spelling) was very thorough and took time to explain the coverage.  I felt comfortable asking questions.", "rating": 4}, {"title": "Suzanne Svendsen was extremely helpful…", "text": "Suzanne Svendsen was extremely helpful and patient. She answered all my questions.", "rating": 5}, {"title": "I'm a new customer so ensure is alright…", "text": "I'm a new customer so ensure is alright so far.", "rating": 4}, {"title": "Salpy Forlwer is a wonderful person to…", "text": "Salpy Forlwer is a wonderful person to work with.", "rating": 5}, {"title": "Starla was a great agent for me…", "text": "Starla was a great agent for me exploring Medicare advantage options for 2024.", "rating": 5}, {"title": "Michael was great", "text": "Michael was great! He explained everything so I could understand it.", "rating": 5}, {"title": "I just love Lisa...she makes me laugh…", "text": "I just love Lisa...she makes me laugh and feel at ease  and over the last couple of years she has helped me understand the health care plans 100%Thank you LisaNancy Smith", "rating": 5}, {"title": "My experience with Dion Sandwrs was…", "text": "My experience with Dion Sandwrs was awesome.  He was so nice and helpful", "rating": 5}, {"title": "Kerri was very informative and she…", "text": "Kerri was very informative and she listen very well. She really knows her products.", "rating": 5}, {"title": "Stephen was very helpful and pleasant…", "text": "Stephen was very helpful and pleasant to work with.", "rating": 5}, {"title": "Agent made issues easier to understand", "text": "Agent made issues easier to understand, and very helpful with no pressure", "rating": 5}, {"title": "The lady who helped me was very…", "text": "The lady who helped me was very thorough and patient.  She explained everything in detail. Thank you!🙂🏆", "rating": 5}, {"title": "My agent fully explained the products I…", "text": "My agent fully explained the products I was interested in. He make the purchase easy", "rating": 5}, {"title": "Elizabeth Dale is the best!", "text": "Elizabeth Dale is the best!So knowledgeable, patient, & kind!", "rating": 5}, {"title": "Representative was knowedgeable and…", "text": "Representative was knowedgeable and very clear on what I needed.", "rating": 5}, {"title": "Took time needed to get the insurance…", "text": "Took time needed to get the insurance plan that best suited my needs.", "rating": 5}, {"title": "Ms.Wade was very helpful and friendly…", "text": "Ms.Wade was very helpful and friendly but most of all she was patient with me and explained a lot of things I needed", "rating": 5}, {"title": "Dominique is the best", "text": "Dominique knew the different plans and got the best for me.", "rating": 5}, {"title": "Insurance  agency  rating", "text": "Very knowledgeable  and patient agents. I'd  recommend  Ensurim to anyone  looking for information  or a Chand in their Medicare insurance.", "rating": 5}, {"title": "How the reps talked thru everything", "text": "The rep was very helpful.She asked questions and answered my question ❓ she went over everything with me.", "rating": 5}, {"title": "Lisa Graham is the best", "text": "Lisa Graham is the best. She was very helpful and patient with all our questions.", "rating": 5}, {"title": "Everything was explained to me and my…", "text": "Everything was explained to me and my husband. So glad to have been able to speak with David about this policy", "rating": 5}, {"title": "Very polite and explained things to me", "text": "Very polite and explained things to me. Was patient with me", "rating": 5}, {"title": "Explaining and helpful in making sure…", "text": "Explaining and helpful in making sure to the best plan of protection.", "rating": 5}, {"title": "Robert was very knowledgeable  and…helpful, answered my questions and I would highly recommend him!", "text": "Robert was very knowledgeable  and helpful", "rating": 5}, {"title": "David does a very good job of…", "text": "David does a very good job of explaining everything. We ave dealt with him in the past", "rating": 5}, {"title": "Mr. Kevin Thorp", "text": "Mr. Kevin Thorp is always a jewel to speak to. He goes above and beyond to find me the best insurance for my needs.", "rating": 4}, {"title": "Explained everything perfectly", "text": "Explained everything perfectly. Moya is wonderful", "rating": 5}, {"title": "Renee Davis is very helpful", "text": "Renee Davis is very helpful. And helped us find the best plan that fit our needs.", "rating": 5}, {"title": "How patient and informative they were…", "text": "How patient and informative they were with me.", "rating": 5}, {"title": "Quick and easy and very professional.", "text": "Date of experience: January 10, 2024", "rating": 5}, {"title": "Mainly", "text": "Mainly, Rhonda, she's very pleasant & fun to talk to. Made sure I'm getting the best plan for me!", "rating": 5}, {"title": "The lady never called me back about my…", "text": "The lady never called me back about my card information", "rating": 1}, {"title": "Vance Harper is awesome", "text": "Vance Harper is awesome. Very patient and knowledgeable.", "rating": 5}, {"title": "She was professional on everything", "text": "She was professional on everything. I'm happy for everything she did for me.", "rating": 5}, {"title": "Skill knowledge of plans", "text": "Skill knowledge of plan. Downside: Lot of info to listen to for patient", "rating": 5}, {"title": "Row was a great help", "text": "Row was a great help. He made it so less stressful and is a very easy going sole.", "rating": 5}, {"title": "The agent", "text": "The agent.  She is knowledgeable and personable.", "rating": 5}, {"title": "Cust serve rep was knowledgeable and…", "text": "Cust serve rep was knowledgeable and friendly", "rating": 5}, {"title": "Kerri Moodi is one of the most helpful…", "text": "Kerri Moodi is one of the most helpful people I've ever dealt with.", "rating": 5}, {"title": "The repicenative was very knowledgeable…", "text": "The repicenative was very knowledgeable and friendly", "rating": 5}, {"title": "BRIAN BERRY WAS WONDERFUL TO WORK WITH", "text": "BRIAN BERRY WAS WONDERFUL TO WORK WITH.  VERY PROFESSIONAL, THOROUGH AND PERSONABLE.", "rating": 5}, {"title": "They were very helpful and answered all…", "text": "They were very helpful and answered all my questions.", "rating": 5}, {"title": "level of detail", "text": "level of detail, and perserverance displayed by employee", "rating": 5}, {"title": "She answered all my questions and was…", "text": "She answered all my questions and was very helpful", "rating": 5}, {"title": "Great Service", "text": "Ease of scheduling appointments- friendly and knowledgeable representative - professional review of options.", "rating": 5}, {"title": "Useful information", "text": "Great person", "rating": 5}, {"title": "The sales rep was very polite and…", "text": "The sales rep was very polite and helpful", "rating": 5}, {"title": "The people who represent you thanks Deno", "text": "Date of experience: November 17, 2023", "rating": 5}, {"title": "Rueben was most helpful", "text": "Rueben was most helpful. Very professional.", "rating": 5}, {"title": "Satisfied customer", "text": "Starla is great. She's very knowledgeable and easy to talk to.", "rating": 5}, {"title": "Jevon was very thorough and patient", "text": "Jevon was very thorough and patient.  Tailored my plan to my needs.", "rating": 5}, {"title": "The agent was wonderful", "text": "Date of experience: December 04, 2023", "rating": 5}, {"title": "She was through", "text": "She was through, and kind and patient. Very helpful", "rating": 5}, {"title": "Very easy to follow", "text": "Very easy to follow. Ashley A+", "rating": 5}, {"title": "Great service", "text": "Date of experience: December 06, 2023", "rating": 5}, {"title": "Letty Saad very patiance", "text": "Date of experience: December 29, 2023", "rating": 5}, {"title": "Great company", "text": "Date of experience: November 27, 2023", "rating": 5}, {"title": "Everything went smooth", "text": "Everything went smooth. Your agent was well informed.", "rating": 5}, {"title": "I can can call my agent with my…", "text": "I can can call my agent with my questions", "rating": 5}, {"title": "Great Professional  Service", "text": "Very professional, knowledgeable, and friendly service.Adriane McNamee was outstanding.", "rating": 5}, {"title": "Changed carrier", "text": "Andre was pretty helpful.", "rating": 4}, {"title": "Kerry was awesome.", "text": "Date of experience: November 16, 2023", "rating": 5}, {"title": "The agent that helped me was wonderful", "text": "Date of experience: November 12, 2023", "rating": 4}, {"title": "David Pray is wonderful!", "text": "Date of experience: December 12, 2023", "rating": 5}, {"title": "Agent answered all my questions.", "text": "Date of experience: November 02, 2023", "rating": 5}, {"title": "Karri was very professional!", "text": "Date of experience: December 07, 2023", "rating": 5}, {"title": "John Savelli was efficient in handling…", "text": "John Savelli was efficient in handling our applications", "rating": 5}, {"title": "Great people", "text": "Sophia was great and got me the plan I needed.", "rating": 5}, {"title": "The customer service was extremely helpful", "text": "Date of experience: November 16, 2023", "rating": 5}, {"title": "Short and to the point", "text": "Date of experience: January 18, 2024", "rating": 5}, {"title": "Representative Karen Gregory was very…", "text": "Representative Karen Gregory was very informative and helpful", "rating": 5}, {"title": "Excellent customer service", "text": "Excellent customer service Thank you!!", "rating": 5}, {"title": "The representative was very informative…", "text": "The representative was very informative however, he was very hard to understand", "rating": 4}, {"title": "Great Service", "text": "Great sales they helped me very much", "rating": 5}, {"title": "Wonderful customer service", "text": "Wonderful customer service! Great product!", "rating": 5}, {"title": "Professional and informative", "text": "Date of experience: January 23, 2024", "rating": 5}, {"title": "Awesome customer service", "text": "Awesome customer service. Very professional!!", "rating": 5}, {"title": "Ask lots of questions", "text": "Patience, Concern, Knowledgable", "rating": 5}, {"title": "all of your links are broken", "text": "Date of experience: January 01, 2024", "rating": 1}, {"title": "Excellent communication and Skills", "text": "Date of experience: November 27, 2023", "rating": 5}, {"title": "Austin Joiner excellent", "text": "Austin Joiner excellent, knowledgeable,", "rating": 5}, {"title": "Patient and Honest!!!", "text": "Patient and Honest!!!Informative", "rating": 5}, {"title": "David was Outstanding", "text": "Date of experience: November 09, 2023", "rating": 5}, {"title": "Trustworthly", "text": "My Agent Nicole", "rating": 5}, {"title": "Personalized help", "text": "Date of experience: January 02, 2024", "rating": 5}, {"title": "knowledge", "text": "very knowledgeable", "rating": 5}, {"title": "Great employee.", "text": "Date of experience: November 16, 2023", "rating": 5}, {"title": "Everything good", "text": "Date of experience: November 22, 2023", "rating": 5}, {"title": "Friendly person on the phone", "text": "Xxxxxxxxxx", "rating": 5}, {"title": "No title needed", "text": "I don't do replys", "rating": 4}, {"title": "Rubber was very pacient and answered…", "text": "Rubber was very pacient and answered all my questions", "rating": 5}, {"title": "Good", "text": "Just seems like trust worthy people", "rating": 4}, {"title": "Phone rep was very helpful", "text": "Date of experience: November 03, 2023", "rating": 5}, {"title": "Robert LeClair has helped us  with…", "text": "Robert LeClair has helped us  with choosing and understanding advantage dual plans. He is very helpful and always there to answer any and all questions.", "rating": 5}, {"title": "Always ask ?.", "text": "Mr. Negron  was excellent,  he work very hard to make sure I understood the ins and out of the supplemental  insurance. He explain everything  in detail and always ask did I understand. He made sure to give me what I was needing to have full coverage  on a budget. He is awesome. I am so glad to have come across  a employee that loves his job.", "rating": 5}, {"title": "Mr Craig Dierking", "text": "Mr. Craig Dierking absolutely great, professional and knowledgeable.", "rating": 5}, {"title": "Had an absolutely great experience The…", "text": "Had an absolutely great experience The representative was knowledgeable professional courteous and smart. Patient  and caring", "rating": 5}, {"title": "I trust the age and I talk to I keep…", "text": "I trust the age and I talk to I keep his phone number in my phone at all times I can call him anytime of the year super good guy Javon Brown", "rating": 5}, {"title": "Representative was very informative and…", "text": "Representative was very informative and professional and polite.  Only drawback was it took 2 hours.", "rating": 5}, {"title": "Got super good help", "text": "She guided me through the loops and bounds of this insurance situation.", "rating": 5}, {"title": "My sales agent Lisa ford she is the best", "text": "Date of experience: November 01, 2023", "rating": 5}, {"title": "Very helpful", "text": "Very helpful in helping me get all the benefits available for me.  Friendly and very informative in explaining how to get the best resources", "rating": 5}, {"title": "JoAnna was priceless…", "text": "JoAnna was priceless… she’s the reason we switched!!  We trust her & she helped us do much!!", "rating": 5}, {"title": "To be honest up front", "text": "To be honest up front.  I did not choose your company. I am with United Healthcare. And am staying with them. I have and agent.", "rating": 1}, {"title": "Phil Smith was fantastic when…", "text": "Phil Smith was fantastic when explaining benefits of several options  I was considering.  He was clear with his explanation and helping me to compare, while seeking what would best suit my health needs. Thank you Phil.", "rating": 5}, {"title": "Understanding agents", "text": "John understands my needs and provides me with the best plan.", "rating": 5}, {"title": "Very Helpful", "text": "Date of experience: October 30, 2023", "rating": 5}, {"title": "The agent Barry Zuta did a wonderful job", "text": "Date of experience: October 18, 2023", "rating": 5}, {"title": "Professionalism", "text": "Professionalism, knowledge of the subjects & broadcasting a sense of acceptance.", "rating": 5}, {"title": "Just a good experience with all the…", "text": "Just a good experience with all the info I needed.", "rating": 5}, {"title": "Scott was wonderful!", "text": "Scott was wonderful!! Couldn’t have done it without his help.", "rating": 5}, {"title": "Spent a lot of time trying to find…", "text": "Spent a lot of time trying to find where my payment s/b sent to no avail.  Still don’t know. - payment due 10/1/23!  Can payment be made.by credit card?", "rating": 3}, {"title": "Someone who cares.", "text": "My experience was great.. the person who helped me went about and beyond to find the best health care package that is  suited for my needs...", "rating": 5}, {"title": "Agent Sofia was great", "text": "Agent Sofia was great. I had Anna Smith before and I really liked her, too.", "rating": 5}, {"title": "My Ensurem Customer Service rep Renee…", "text": "My Ensurem Customer Service rep Renee Davis was extremely helpful. Giving me all the current guidelines and updated benefits that would be available for me. So nice to talk with her.", "rating": 5}, {"title": "Jamie Negrow was outstanding", "text": "Date of experience: October 26, 2023", "rating": 5}, {"title": "It was fine", "text": "It was fine; Thank You", "rating": 5}, {"title": "Thanks for your information and…", "text": "Thanks for your information and kindness!", "rating": 5}, {"title": "Best Insurance Agent 👌", "text": "Vance Harper was able to get all the information that I needed to know about the policy that I wanted. He is the best person I have talked with about insurance.", "rating": 5}, {"title": "Very thorough in explaining information", "text": "Date of experience: October 27, 2023", "rating": 5}, {"title": "Great full for Mr Reuben Labrador", "text": "I'm Great full for my agent Reuben  and others like him because he went above my expectations and got the best of everything for my family !!!", "rating": 5}, {"title": "Andy was very good", "text": "Andy was very good. He responded to my call. He was very knowledgeable.", "rating": 5}, {"title": "Call them - you won't regret it!", "text": "This is the second time I've called Ensurem for help with choosing an insurance plan. I called them, quite by accident, 2 years ago when I retired. They found me a great plan, but unfortunately, that plan is no longer available this year. I called them again, and like last time, they were able to find me a plan that fits my needs at zero premium! I highly recommend this company. Both times, the person who assisted me was very knowledgeable and thorough and asked all the right questions. They explained everything in a way I could understand. Insurance can be so confusing, so this is helpful beyond measure! Call them - you won't regret it!", "rating": 5}, {"title": "Drew was terrific and found me a much…", "text": "Drew was terrific and found me a much better plan.", "rating": 5}, {"title": "My agent found an upgraded plan that…", "text": "My agent found an upgraded plan that sounds perfect for me.", "rating": 5}, {"title": "Good customer service.", "text": "Date of experience: October 19, 2023", "rating": 5}, {"title": "I have been working with Lisa far the…", "text": "I have been working with Lisa far the last 3 years. She is a super person to talk and learn all about madicare and percription drug programs.", "rating": 5}, {"title": "Very good listener", "text": "Very good listener. Provided detailed information.  Very knowledgeable.  Trusted and dependable.", "rating": 5}, {"title": "Vance ,he is the best agent I’ve ever…", "text": "Vance ,he is the best agent I’ve ever had he does look after Me and no matter when I call he always there to help. I’m very satisfied with my old and new plan . Thank you all for being there for me ‼️", "rating": 5}, {"title": "They listen to what you need and they…", "text": "They listen to what you need and they get it", "rating": 5}, {"title": "M mis seamore she is always helpful", "text": "Miss mis seamore she is always helpful. Bedt in suggession", "rating": 5}, {"title": "Trisha was very resourceful", "text": "Trisha was very resourceful, thorough and was happy to answer all questions and concerns! Thank you so much for helping me choose the best plan for me!", "rating": 5}, {"title": "I had great experience from this co", "text": "I had great experience from this co. The person that took me all the way thru the proses his name is Max I’m glad I called a broker.I didn’t now much at the end I have the best for my situation.thankyou and God bless", "rating": 5}, {"title": "Austin was great", "text": "Austin was great! He was very professional, patient, and explained everything so that my husband and I could completely understand.", "rating": 5}, {"title": "The company is always on top of things…", "text": "The company is always on top of things but my primary reason for praise is for employee George Williams out of Tampa. While some agents tend to rush through peoples concerns during this busy time of year George has always made the time and effort to make sure I fully understand everything presented to me.            Damon Paseman           Homosassa,FL", "rating": 5}, {"title": "Jessica", "text": "Jessica, my agent was magnificent.", "rating": 5}, {"title": "I loved the fact that Karen was…", "text": "I loved the fact that Karen was organized and yet still had time to be friendly. She fully answered all my questions regarding each section of the enrollment and gave feedback on how I could better assist with the process. My advice is, don’t be afraid to ask questions and ask them when you think of them, not later on. (If you can remember them) Found me an excellent plan with united healthcare and a new resource for all my healthcare insurance information. Thanks Karen", "rating": 5}, {"title": "Food card", "text": "Love working with David Pray", "rating": 5}, {"title": "Good quick work", "text": "Date of experience: October 19, 2023", "rating": 5}, {"title": "The concern the agent had for finding a…", "text": "The concern the agent had for finding a plan that would address my needs was very appreciated. Also, by explaining the plans and comparing the benefits of each I was able to make a determination with confidence.", "rating": 5}, {"title": "Excellent experience", "text": "My wife and I enjoyed review our options with Vance.  He was very knowledgeable and professional.  Excellent experience!", "rating": 5}, {"title": "Humana+Ensurem=WIN", "text": "Everything was explained in great detail so I could easily understand. I actually enjoyed that phone call! Mr. Barry Vuta at Humana should be given a reward of some kind. He was thorough and honest.", "rating": 5}, {"title": "Are agent Lisa Ford is really great and…", "text": "Are agent Lisa Ford is really great and she explains Very Well.", "rating": 5}, {"title": "Your representative Lisa Ghram-Fienburg…", "text": "Your representative Lisa Ghram-Fienburg was excellent.  She gathered all our needs, doctors and meds.  She found the best product for us.  She explained all our options and answered all our questions. She was very helpful.  Thank YouFrank & Debbie Tarantino", "rating": 5}, {"title": "Yovonne Henderson was such a pleasant…", "text": "Yovonne Henderson was such a pleasant and patient person who explained everything well, I can understand. I really appreciate her help.", "rating": 5}, {"title": "Personal touch", "text": "Personal touch, knowledge and patience of person Who was guiding me through to the details of the policy.", "rating": 5}, {"title": "The easiest and best way to find a Medicare policy, ever!!", "text": "The most comprehensive comparisons of all. Took as much time needed to explain the policies as was needed. With so many different policies it's confusing but mark made it easy. I will recommend to all to call ensurem .", "rating": 5}, {"title": "Informative and Successful", "text": "The rep. was well informed, very helpful, patient and kind.  A pleasure to work with.  She explained everything to me and answered all my questions.  I'm happy with the  outcome!", "rating": 5}, {"title": "Our agent was Dev", "text": "Our agent was Dev, he is an awesome agent. Very good at what he does. We appreciated him so much because everyone else we spoke to was misunderstanding. Not knowledgeable and at times, could not understand what they were saying. Thank you Dev.", "rating": 5}, {"title": "Lia was amazing", "text": "Lia was amazing. She is thoroughly the best customer serve reps I have ever dealt with. All agents should be like her.", "rating": 5}, {"title": "Your broker Hailey Osborn was wonderful…", "text": "Your broker Hailey Osborn was wonderful to work with and I was happy to get vision insurance!", "rating": 5}, {"title": "Kerri Moody is a wonderful agent", "text": "Kerri Moody is a wonderful agent.  She went through everything and I asked questions which she answered. I've spoken to her 3 or 4 years now.  Great service!", "rating": 5}, {"title": "Suzanne is a blessing", "text": "Suzanne always treats me like my needs and concerns are of genuine importance.  She is always knowledgeable and helpful in helping me make the best choices for me. She is such a blessing", "rating": 5}, {"title": "Agent took time to explain.", "text": "Date of experience: October 16, 2023", "rating": 5}, {"title": "Very helpful experience", "text": "Thanks to Amanda who helped us choose the best plan to meet our needs.", "rating": 5}, {"title": "Lisa is my “agent” and she is very…", "text": "Lisa is my “agent” and she is very informed and personable.", "rating": 5}, {"title": "Charlene Wolf", "text": "Charlene WolfMy time with Kerri MoodyKerri Moody reviewed information for enrollment for Medicare.  She was very thorough in asking me information that she needed and if she had a question about anything she would check it with some one or check about it in the information she had.  I appreciated all the time she gave to me.", "rating": 5}, {"title": "Great customer service", "text": "Date of experience: October 23, 2023", "rating": 5}, {"title": "Very thorogh and clear enrollment", "text": "Very thorogh and clear enrollment.  Answered all questions completely.", "rating": 5}, {"title": "Provided updates on the insurance", "text": "Provided updates on the insurance. Made sure I understood the info. Respectful and courteous.", "rating": 5}, {"title": "Katherine is the best.", "text": "Date of experience: October 23, 2023", "rating": 5}, {"title": "I’m new and all is good", "text": "Date of experience: October 23, 2023", "rating": 2}, {"title": "Victoria did a magnificent job of providing information and answering all my questions and concerns.", "text": "The agent, Victoria, made the experience 5-star.", "rating": 5}, {"title": "The agent", "text": "The young lady who helped us with our policy was very helpful and gave us a really good experience. We have worked with her in the past and have always had a good experience.", "rating": 5}, {"title": "Had a fantastic experience", "text": "Had a fantastic experience. Andy Roman was friendly, professional, informative and very easy to understand. I trust him in giving me all the information I need to make a  important decision concerning my health needs. Will highly recommend him.", "rating": 5}, {"title": "Malick Ead is a good agent", "text": "Malick Ead is a good agent, very helpful.", "rating": 5}, {"title": "Spoke with Rhonda this morning she is…", "text": "Spoke with Rhonda this morning she is excellent and a pleasure to speak with and is very helpful about the coverage that is needed.  Thank you very much.", "rating": 5}, {"title": "Explains things", "text": "Very happy with service", "rating": 5}, {"title": "Knowledgeable people with professional…", "text": "Knowledgeable people with professional manners", "rating": 5}, {"title": "My Ensurem agent is the best!", "text": "My agent is always looking for what she believes is the best insurance for my needs.My agent explains every detail and the diffrence between the plans available. I have been very happy with Ensurem. Thank You Jessica", "rating": 5}, {"title": "Karen was well informed & explained it…", "text": "Karen was well informed & explained it very well! Fast & Thoiral!", "rating": 5}, {"title": "benefits", "text": "jevon brown was helpful", "rating": 5}, {"title": "The agent was very knowledgeable.           and…", "text": "The agent was very knowledgeable and polite throughout the whole process. Organizations like yours are blessed to have employees that care for the clients and not only the sale as so many others do!", "rating": 5}, {"title": "Heather is nice and she is…", "text": "Heather is nice and she is knowledgeable about the plans.  She explained everything thoroughly.   She answered all the questions I had.", "rating": 5}, {"title": "Ensurem rep was great", "text": "Ensurem was able to connect me to the rep that helped me with Medicare from the start. Kim was very helpful, friendly and knowledgeable", "rating": 5}, {"title": "The Rep Daniel Davis", "text": "The Rep Daniel Davis , explained a lot to me and answered all my questions. I have never used a HMO before, the benefits were good so I will take a chance on it. Thank you", "rating": 5}, {"title": "Confident I was Served the Best From the Rest!", "text": "I would like to thank agent Keith Young for a thorough job of explaining the healthcare benefit plan package to me. He was very informative as well as relaxing to talk with, which took the sting out of the complicated insurance language and definitions unknown. He discussed plan options and what was involved in the plan that was most relevant for me. What I like most of all was that I did not feel rushed. He took his time explaining what I did not understand. I felt comfortable asking as many questions as needed. I appreciated that! Thank you Mr. Young! 😀", "rating": 5}, {"title": "Devon was knowledgeable and very…", "text": "Devon was knowledgeable and very helpful in helping with a plan,", "rating": 5}, {"title": "Rita Forest is thorough", "text": "Rita Forest is thorough, well informed, and helpful. She sold me my policy last year and this year. I remembered her because of her warmth and efficiency.", "rating": 5}, {"title": "Carie Moody is an angel", "text": "Carie Moody is an angel. We love her and trust her. She has been so amazing, taking time and making sure we understand everything. She is always been there when we have questions and problems. Thank you Carie for always being there for us ❤️", "rating": 5}, {"title": "I have been getting help from Jayme for…", "text": "I have been getting help from Jayme for years now. I don't trust nobody else. I know he's going to look out for me and make sure I have everything I need ❤️❤️ thanks Jayme 🥰", "rating": 5}, {"title": "Craig Dierking  always try to find the…", "text": "Craig Dierking  always try to find the best for me , he is extremely knowledgeable and so pleasant, quick to answer any questions I have for whatever plan I do get Very happy I have found him and been with him for several years now", "rating": 5}, {"title": "Nashana Allison did a terrific job in…", "text": "Nashana Allison did a terrific job in taking the time to not only help find me the best plan for myself and also found a good plan for my mother that's awesome", "rating": 5}, {"title": "Dave Pray is a wonderful employee", "text": "Dave Pray is a wonderful employee. He is thorough understanding and knows his work. He is a great man and deserves a big raise. Thank You", "rating": 5}, {"title": "Knowledgeable and Professional Staff", "text": "Elijah put in a lot of effort and time to \"ensure\" that I had a good understanding of the best plan for me in 2024. He was patient and willing to answer as many of my questions as necessary to accomplish our work this afternoon. He embodies the reason that I keep coming back to Ensurem for advice each year. When we wrapped up the call today, I felt comfortable that I had made a good choice.", "rating": 5}, {"title": "Ms. Ford", "text": "Ms. Ford is very professional person.She looks at all the plans that fit my needs,Explain to me why she thinks this plan would work for me.Ms.Ford answers my questions with the best knowledge she can look up.", "rating": 5}, {"title": "PJ Again", "text": "My Rep. Dion did an amazing job of getting me enrolled in my MCR plan. He was very thorough, answered my questions, and made sure I understood. every aspect of my policy.", "rating": 5}, {"title": "Your representative r very cooperative…", "text": "Your representative r very cooperative and courteous.", "rating": 5}, {"title": "Austin Joiner is an amazing agent and…", "text": "Austin Joiner is an amazing agent and he has taken care of all my needs for 2 years now. He is extremely professional, patient, thorough and has excellent follow-thru skills. I will be back next enrollment periond.", "rating": 5}, {"title": "Derrick white did an excellent job", "text": "Date of experience: October 19, 2023", "rating": 5}, {"title": "Dan was very nice", "text": "Dan was very nice, he explained everything", "rating": 5}, {"title": "Trisha Campbell and I have a very…", "text": "Trisha Campbell and I have a very strong relationship. She is the only person I know who gives you every piece knowledge to answer my concerns for the last 5 years.", "rating": 5}, {"title": "She was very helpful", "text": "She was very helpful. Wasn't pushy about what coverage to get. Very polite, listened to me about what I  wanted. She joked around some with me, asked about my family.  Lin Musa was very knowledgeable about the plans", "rating": 4}, {"title": "My experience with Tricia Campbell was…", "text": "My experience with Tricia Campbell was excellent", "rating": 5}, {"title": "the agent", "text": "the agent took her time in going over the plans and making sure I understand it.", "rating": 5}, {"title": "They kind people.will help you with whatever you need", "text": "They will make sure you got the right plans for you", "rating": 5}, {"title": "The agent was wonderful.", "text": "Date of experience: October 18, 2023", "rating": 5}, {"title": "Ensurem+Meagan=SUCCESS!!", "text": "Meagan went above and beyond to explain every detail for my new policy. And it sounds like a perfect fit for me. I will continue to use Ensurem for my insurance needs.", "rating": 5}, {"title": "Geneva was very patient with me and…", "text": "Geneva was very patient with me and answered my questions. After discussing several plans, I applied for the one that meet my health care needs. Thank you.", "rating": 5}, {"title": "Agent went to all ends to find a good…", "text": "Agent went to all ends to find a good plan for me to save a lot of money", "rating": 5}, {"title": "Professional helpful patient good…", "text": "Professional helpful patient good listener to my need", "rating": 5}, {"title": "Gives you options", "text": "Jayme gives you options to choose your plan and what is best for you.  Everything is explained in detail.  Easy and personable service.", "rating": 5}, {"title": "Great agent. Austin Joiner", "text": "Great agent, Austin Joiner.", "rating": 5}, {"title": "David Pray is an excellent Rep", "text": "David Pray is an excellent Rep. Took the time to explain everything and help us shop for the best healthcare package. We have been with David for 4 years now. Thank you David and Ensurem.", "rating": 5}, {"title": "First I wanted to know How much would…", "text": "First I wanted to know How much would they pay for glasses.  Then I said I didn't hear you and then said I need a hearing aid. So he switched to a better plan for me and that was the best.  I will be so happy with the new plan. Thank you, Berry !!                                                   Julane Scherer", "rating": 5}, {"title": "Awesome customer service!", "text": "The agent was very receptive to my needs he listened carefully we discussed different options he took well over an hour to make sure I got exactly what I needed so very very pleased!", "rating": 5}, {"title": "They explained everything Good", "text": "Date of experience: October 17, 2023", "rating": 5}, {"title": "she was very helpful to me had no…", "text": "she was very helpful to me had no problems at all very pleased", "rating": 5}, {"title": "I was impressed with the options.", "text": "Answers to my questions were researched and found in the different plans, so I could choose the plan that works best for me.", "rating": 5}, {"title": "The man on the phone was really nice he…", "text": "The man on the phone was really nice he explained everything and plus he gave me a good Medicare insurance plan", "rating": 5}, {"title": "Ms S. Wade", "text": "Ms. Wade was GREAT, and got me a better plan!!!", "rating": 5}, {"title": "Robert lacy was an awesome agent!", "text": "Date of experience: October 17, 2023", "rating": 5}, {"title": "Dan was great and navigated us through…", "text": "Dan was great and navigated us through signing up for myself and my wife. Even saved us some money on the Part N medicare suppliment.", "rating": 5}, {"title": "our agent heather ross is exceptional.", "text": "Date of experience: October 15, 2023", "rating": 5}, {"title": "Port Richey", "text": "Craig and I worked in Port Richey together. He is a varying person and his goal is to find the best plan for his clients... many agents just want to make a sale. He works hard and is dedicated to his clients!", "rating": 5}, {"title": "Our agent Mrs Shanks", "text": "Our agent Mrs. Patrice Shanks was most gracious, courteous, patient and knowledgeable.", "rating": 5}, {"title": "Happy Customer", "text": "I've been using Ensurem for a couple of years now and really like the service I receive! My broker Suzanne is knowledgeable and works hard to find the right plan for you.", "rating": 5}, {"title": "Patrice is a Real Gem!", "text": "Patrice is a Real Gem. She handled my insurance needs professionally and with a sweet manner.Easy to chat with.I highly recommend her to my peers for her great attitude and service.Thank you.JP FLANERY", "rating": 5}, {"title": "The agent took his time answered…", "text": "The agent took his time answered questions look through the different plans to see which one you're qualified.", "rating": 5}, {"title": "Rita Forrest is the best…", "text": "Rita Forrest is the best representative. She is very informative and thorough about each Medicare plan and any questions I have are answered.", "rating": 5}, {"title": "Jevon brown was very professional and…", "text": "Jevon brown was very professional and knowledgeable.", "rating": 5}, {"title": "From was great", "text": "From was great, he explained all the benefits", "rating": 5}, {"title": "Salpy knew her stuff and guided me…", "text": "Salpy knew her stuff and guided me through the process.", "rating": 5}, {"title": "Ensurem insurance agents", "text": "My agent was very efficient and professional. Explained all the options thoroughly so that I can understand easily. I'm very happy with Ensurem. This is the second year that I have dealt with Austin Joyner. I love him because he is very personable and we have developed a very close relationship. I don't want to deal with anyone else but him. You are very lucky to have someone like him.", "rating": 5}, {"title": "Patrice was well informed and explained…", "text": "Patrice was well informed and explained everything to me. Very professional.", "rating": 5}, {"title": "Phillip Smith is an awesome asset to…", "text": "Phillip Smith is an awesome asset to Ensurem!  He makes everything clear and is helping me to get the best Medicare plan that's right for me!  He is just precious and deserves a raise!", "rating": 5}, {"title": "Clarity of information is logically…", "text": "Clarity of information is logically easy to follow.  Drew research to find best policy for my needs.  He is truly concern for my welfare.", "rating": 5}, {"title": "Ensurem review", "text": "The agent was very knowledgeable about the plans offered. Agent was nice, understanding and did not rush through explanation of plans or answering my questions.", "rating": 5}, {"title": "I knew nothing about choosing the right…", "text": "I knew nothing about choosing the right Medicare Advantage plan for me.  Hang was very understanding and supportive of my needs.  She explained everything to my understanding and in the end I had a great policy that delivered more than I had hoped for and saved me money.  Thank you, Hang!", "rating": 5}, {"title": "I k ew what I need we d.", "text": "I knew what I needed", "rating": 5}, {"title": "Very knowledgeable and relating…", "text": "Very knowledgeable and relating information to clients.", "rating": 5}, {"title": "Nicole is Excellent!!!", "text": "I am extremely pleased with the service I received from Nicole Riveire.", "rating": 5}, {"title": "JoAnn", "text": "JoAnn was very informative, professional and understood my concerns.", "rating": 5}, {"title": "The  quality of the staff", "text": "The  quality of the people's that component of the staff for attending all the  requirements we need, very professional knowledge and expertise to provide the best for our necessity", "rating": 5}, {"title": "Chris Kaiser was excellent", "text": "Chris Kaiser was excellent. He explained things perfectly. Very Happy with ensure.", "rating": 5}, {"title": "A very pleasant conversation", "text": "A very pleasant conversation. Rhonda was a great help and very knowledgeable.", "rating": 5}, {"title": "Very helpful and kind", "text": "Date of experience: October 11, 2023", "rating": 5}, {"title": "Excellent", "text": "Your customer service employee, DeShawn was very knowledgeable and courteous.  Checked on all the Medicare PPO Advantage plan i.e., CIGINA, Humana. AETNA, United and BCBS helping me to make a decision on my Medicare PPO plan.  As dental is always a problem with any of the PPO.  Helped me get a dental plan and also a return on my Medicare B.  I am going to give his number to some of my friends.  He listen to your needs and explains and let's you know each plan and is patient with you to make your own choice.  He is a great asset to your company.  I would give him excellent to him as I am a hard person to deal with beforeI make a decision by asking too many questions.  He answered it very well.", "rating": 5}, {"title": "Austin Joiner...my agent", "text": "Date of experience: September 27, 2023", "rating": 5}, {"title": "Great experience.", "text": "I really enjoyed the conversation that I had with MISS Henderson. She explained things to me that were important to me. She was very knowledgeable and patient.", "rating": 5}, {"title": "Fabian makes the process a joy!", "text": "Date of experience: October 06, 2023", "rating": 5}, {"title": "Outstanding service!", "text": "My representative is Maximiliano Matamoros. Max does an outstanding job of explaining the different plans and details. He’s very personable and does his best to set you up with a perfect plan for you.", "rating": 5}, {"title": "My experience was great because Drew…", "text": "My experience was great because Drew walked me through everything that I would need and if I needed anything else I can contact him he was very helpful and he was very knowledgeable in my area of expertise", "rating": 5}, {"title": "Update my insurance", "text": "I love working with Rhonda. She makes it fun and simple. I added dental and eye to my account. Glad all is well.", "rating": 4}, {"title": "Helping me in making the best choices…", "text": "Helping me in making the best choices regard health insurance", "rating": 5}, {"title": "All my questions were answered and…", "text": "All my questions were answered and Salpy was a friendly and knowledgeable person to speak with.", "rating": 5}, {"title": "Froyd was great", "text": "Froyd was great! Very patient and helpful.", "rating": 5}, {"title": "Very informative", "text": "Genevieve was very knowledgeable about the information I requested she was very professional too I give her an A plus", "rating": 5}, {"title": "It was a great experienmrce talk me…", "text": "It was a great experience talk me through process very well", "rating": 5}, {"title": "Aetna is the worse medical insurance ever!!", "text": "We have been setting appointments for my husband for the past 2 weeks and they get canceled the day of we are very frustrated. Aetna is the worse medical insurance ever!!", "rating": 1}, {"title": "John is great to work with", "text": "Date of experience: September 27, 2023", "rating": 5}, {"title": "Thank you", "text": "Exceptional Agent", "rating": 5}, {"title": "Very knowledgeable most intelligent one I spoke with", "text": "Very knowledgeable. He has his head in the game. I’m a chef a stickler for details. He met all my expectations and answered all my questions clearly and distinctly and was prompt and accurate. I could teach him to cook. I would hire him right now. Thank you very much Chef Ron.", "rating": 5}, {"title": "Great to have those", "text": "They gave me dental insurance", "rating": 5}, {"title": "I think premiums are the most important part of being in people's health insures and the co-pays is not to high", "text": "This health insurance company has friendly sale agents, gave me this cheapest premium policy with very low co-pays, I ended up paying $0.00 premium", "rating": 5}, {"title": "Excellent", "text": "Kim was excellent, totally satisfied with how she took care of me.", "rating": 5}, {"title": "My person was very knowledgeable and…", "text": "My person was very knowledgeable and has answers for all my questions.", "rating": 4}, {"title": "The representative  we kept in touch…", "text": "The representative  we kept in touch until I qualified. He was always pleasant and there was no pressure. A great asset to your team", "rating": 5}, {"title": "One stop shopping and Dean is very…", "text": "One stop shopping and Dean is very knowledgeable and patient.", "rating": 5}, {"title": "Very patient and understanding and…", "text": "Very patient and understanding and knowledgeable about my concerns and desired benefits. Thank you. Job well done!", "rating": 5}, {"title": "Informative and great to talk with", "text": "Date of experience: September 21, 2023", "rating": 5}, {"title": "Knowledgeable agent", "text": "Complicated and time consuming", "rating": 4}, {"title": "Agent Austin a super agent.", "text": "Austin was super helpful and knowledgeable. He explained a everything and got it all fixed in minutes.", "rating": 5}, {"title": "To have all the information", "text": "I am very happy with my agent on how he took the time to research for the best possible plan for my needs. He also took the time to explain everything to me so that I understood everything and answered all my questions. He also found a doctor who was taking new patients in my area. Thank you very much", "rating": 4}, {"title": "Information", "text": "Date of experience: September 13, 2023", "rating": 5}, {"title": "😀great agent 😀", "text": "Date of experience: September 13, 2023", "rating": 5}, {"title": "Have someone thst u feel comfortable with an don't b afraid to ask questions", "text": "The person was knowledgeable in her field.explained things well an went to bat for me to try an find an get best deal..", "rating": 5}, {"title": "Care and patience to make sure I…", "text": "Care and patience of my agent to make sure I understood the plans, options.", "rating": 5}, {"title": "Nicole Riviere", "text": "Nicole Riviere, I such a diligent and caring individual. She, take pride in her every day task with her company Ensure. Nicole Riviere, has gotten the best plan that meets my needs. The people, that I mentioned about her work ethic, has also told me that Nicole Riviere, got the best plan for them also. Many blessings to you Nicole. Nicole Rivere should receive a large financial raise. Maxine Moseley-BrownSeptember 06, 2023. Your awesome, Nicole RivereGreat work. Your gifts has made room for you, dear.", "rating": 5}, {"title": "John is very knowledgeable and…", "text": "John is very knowledgeable and comfortable sharing the beneficial information. He presented information in a way, we can understand. His good customer service style is very much appreciated.", "rating": 5}, {"title": "Thank You!", "text": "Thank You!! I Would Like For You To Send Me More Info And Books!! As Well As Keep Me Informed And Direct On Each Material And Matter!! I'm Looking For A Partner To Help Me Build And Rebuild Beautiful And Heinous Work. Items From A Tech Job I Have From School And From Working The Field Has Put Me Into Position To Make Some Very Important Moves For Myself As Well As For My Family!! I Would Also Like To Add Incentives Into The Equation. My Number Is 2315319791 If You Could Give Me A Call And Send Me Some Emails And More Packages On The Job It Would Be Highly Appreciated!! Thank You!!", "rating": 4}, {"title": "The agent was warm and informed", "text": "The agent was warm and informed.  She was able to answer all my questions with ease.", "rating": 5}, {"title": "Not happy", "text": "I was told that I would get an monthly allowance of 75 dollars for over the counter expenses. But instead I've learned that I only get the 75 dollars once every three months So I was basically lied to, or maybe I misheard Mr. Labrado anyway I am most dissatisfied with this decision to go with Humana and this plan I will consider changing if possible.", "rating": 1}, {"title": "They took time and made sure we…", "text": "They took time and made sure we understood what we were getting.", "rating": 5}, {"title": "Yes very constructive", "text": "Date of experience: August 24, 2023", "rating": 5}, {"title": "The person I spoke to was very…", "text": "The person I spoke to was very pleasant,and explained the coverage excellent and that’s why I chose to get it. Thank you very much.", "rating": 5}, {"title": "Customer service was great", "text": "Date of experience: August 24, 2023", "rating": 4}, {"title": "Very helpful, we'll informed and knowledgeable staff.  Overall a great experience", "text": "Very helpful, we'll informed and knowledgeable staff. Overall a great experience", "rating": 5}, {"title": "What are you", "text": "What are you? Did I pick you? For what exactly?I can't say what service I am supposed be grateful for precisely?", "rating": 1}, {"title": "I had very good service from you", "text": "I had very good service from you . I couldn't find anyone better thank you", "rating": 5}, {"title": "The professional actions of employees", "text": "Date of experience: August 16, 2023", "rating": 4}, {"title": "The agent was personable and…", "text": "The agent was personable and professional, knowledgeable and answered all my questions thoroughly.", "rating": 5}, {"title": "The agent went above and beyond to…", "text": "The agent went above and beyond to explain the process and products", "rating": 5}, {"title": "Service", "text": "Agent was very knowledgeable and courteous.", "rating": 5}, {"title": "What Medicare and insurance companies cover.", "text": "The lady on the phone gave clear description of Medicare and other insurance options.  Very friendly and easy to communicate with", "rating": 5}, {"title": "everything", "text": "very helpfull", "rating": 5}, {"title": "Excellent", "text": "Very good, patient and informative!", "rating": 5}, {"title": "The agent was very helpful.", "text": "Date of experience: August 24, 2023", "rating": 5}, {"title": "Toshiya was a great help to me today", "text": "Toshiya was a great help to me today. He was very efficient in explaining a complicated process so that I was able to make decisions very quickly. Very satisfied with him and his professional knowledge of the products.", "rating": 5}, {"title": "Heather Was So Good To Me Explaining…", "text": "Heather Was So Good To Me Explaining everything to me and telling me about the plan she is great!", "rating": 5}, {"title": "Agent was very thorough and informative…", "text": "Agent was very thorough and informative very nice and helpful. Above and beyond", "rating": 5}, {"title": "MY ASSISTANT WAS VERY CLEAR AND…", "text": "MY ASSISTANT WAS VERY CLEAR AND HELPFUL,PRECISE AND MADE SURE I WAS UNDERSTANDING WHAT WAS BEING SAID.", "rating": 5}, {"title": "Amazing", "text": "Amazing the way they care about other’s and how great they explain thing making sure you’ve the right policy for your health just amazing people all the way round", "rating": 5}, {"title": "I use it when I need a extra boost", "text": "I use it when I need a extra boost. But, flavor is important to me. I would like to see more flavors.", "rating": 4}, {"title": "Good information", "text": "Date of experience: August 23, 2023", "rating": 5}, {"title": "The experience was wonderful", "text": "The experience was wonderful. Questions were answered very well. And alot of patience. Very helpful.", "rating": 5}, {"title": "Retired and insured with confidence", "text": "Ashley was exceptional and very knowledgeable!!!A real pro !So glad I made this choice.I feel comfortable and confident as time passes and situations arise I am in great hands!", "rating": 5}, {"title": "Representative made me feel walcome.", "text": "Date of experience: August 22, 2023", "rating": 5}, {"title": "Starla was amazing!", "text": "Starla was amazing she explained everything so I understood.  I couldn't be happier with my experience.  I will know after Sept 1st if I like the plan. But Starla was fantastic!!", "rating": 5}, {"title": "Ensurem presentation 👍👍👍", "text": "Kerri Moody is probably one of the best, if not the best, doing what she does! Knowledgeable, polite, thorough and a very pleasant person- especially her overall personality! Art", "rating": 5}, {"title": "Good experience from beginning to end.", "text": "Date of experience: August 15, 2023", "rating": 5}, {"title": "Great experience,very delighted with…", "text": "Great experience,very delighted with the results Thanks", "rating": 5}, {"title": "A awesome insurance", "text": "Awesome Insurance company to be wirh", "rating": 5}, {"title": "Fantastic Experience. Well Pleased", "text": "Excellent customer service knowledge and follow throughRobert Le Claire did a fantastic job. I will recommend to everyone I know looking for a policy", "rating": 5}, {"title": "very helpful", "text": "Date of experience: August 15, 2023", "rating": 5}, {"title": "I moved from  Illinois to Texas and…", "text": "I moved from  Illinois to Texas and found a whole lot of confusion  regarding my medicare coverage when I made a medical appointment. Your agent help with getting me coverage until  I can get on medicaid in another month or so she was very helpful.", "rating": 5}, {"title": "Agent made me feel comfortable in decision.", "text": "The agent made me feel comfortable in deciding on health care coverage.  This was especially important because I was using Power of Attorney to make the best possible choice for someone else.", "rating": 5}, {"title": "kerri moody was outstanding to get help", "text": "Date of experience: August 21, 2023", "rating": 5}, {"title": "The Agent I spoke with was absolutely…AMAZING!!!", "text": "The Agent I spoke with was absolutely wonderful.  She explained the Aetna policy very well.  She was a great listener and she answered all my questions, she was so well informed regarding various policies.  She insured my doctors were in network...she went over all copays for meds, hospitals, etc...Was a great experince!!", "rating": 5}, {"title": "Everything was fine.", "text": "Date of experience: August 10, 2023", "rating": 5}, {"title": "Bryan was very informative and…", "text": "Bryan was very informative and knowledgeable about the plan i enrolled in and also he was very patient with me when I know i was asking to many questions or asking him to repeat himself", "rating": 5}, {"title": "All the extra bentifits that i was not…", "text": "All the extra bentifits that i was not getting with my old company also the agent explained all my options. The best thing i liked is the ur card i can use for food with the cost in this day and time this is a blessing. I was really surprised with the dentle coverage where i can get extractions, Great! I feel i made a very wise choice. Thank you for the information you provided, the agent was very friendly and explained the plan all the way thru. Thanks again, Randy Jackson Ft Myers Fl.", "rating": 4}, {"title": "The agent is very professional", "text": "The agent is very professional,  patient , clear in his explanations and friendly.", "rating": 5}, {"title": "My experience was great", "text": "Date of experience: August 11, 2023", "rating": 5}, {"title": "Nicole was great to me she was very…", "text": "Nicole was great to me she was very helpful and she a life saver and she helped me get what I needed more than anyone I am very grateful for her if it wasn’t for her I wouldn’t be where I am today thank you Nicole Rivera for all your help", "rating": 5}, {"title": "Very thorough", "text": "Date of experience: August 18, 2023", "rating": 5}, {"title": "Alex Caldwell was very well informed", "text": "Alex Caldwell was very well informed. He also was very pleasant to talk to.  He helped me find a plan that met all my needs.", "rating": 5}, {"title": "Herndon healthcare journey 365 LV", "text": "One on one personal experience from beginning to the next step.", "rating": 5}, {"title": "Scott Weinbrand was very knowledgeable…", "text": "Scott Weinbrand was very knowledgeable and helpful. I would recommend him to my family and friends.", "rating": 5}, {"title": "Rep was very informative", "text": "Date of experience: August 11, 2023", "rating": 4}, {"title": "Make people comfortable", "text": "Nice sympathetic and kind", "rating": 5}, {"title": "Excellent 5 star .", "text": "I received  very good  knowledge I didn't know about health insurance. The agent was very knowledgeable and and  gave me insight about  the  plan I had before and  gave me a policy  that  I can afford for my situation", "rating": 5}, {"title": "Kelli my agent was very helpful and…", "text": "Kelli my agent was very helpful and patient.", "rating": 5}, {"title": "The agent was amazing", "text": "Date of experience: August 17, 2023", "rating": 5}, {"title": "Andrew was great giving info", "text": "Date of experience: August 17, 2023", "rating": 5}, {"title": "Great experience!", "text": "Experience was great due to agent Franklin Ramirez, very knowledgeable and helpful.", "rating": 5}, {"title": "Very satisfied", "text": "Done very well", "rating": 5}, {"title": "Everybody was helpful made it a lot…", "text": "Everybody was helpful made it a lot easier on me they explained everything that was going on.", "rating": 5}, {"title": "Agent was fantastic", "text": "Date of experience: August 07, 2023", "rating": 5}, {"title": "Great customer service", "text": "When I first called I thought I was calling Medicare to change my insurance. The come to find out the agent that spoke to me said he could help me. He was very efficient and helped put me in the right insurance that fit me best. I think if everyone working for your company is like him, then y’all are doing a great job. He showed kindness and patience and understanding when it came to what I needed in an insurance. All I can say is Thank you.", "rating": 5}, {"title": "Excellent service professional and…", "text": "Excellent service professional and knowledgeable", "rating": 5}, {"title": "Attention to detail", "text": "Attention to detail, excellent description of product's, Listened to  my input. Overall, just incredibly helpful.", "rating": 5}, {"title": "Max went over every plan and explained…", "text": "Max went over every plan and explained them so that I could understand them and which one would be the best for my needs", "rating": 5}, {"title": "Trying to help with a pleasant per specific.", "text": "Trying to help with a pleasant per", "rating": 5}, {"title": "Well very professional and down to…", "text": "Well very professional and down to earth answer to the guesting. Mr. Harper is well educated person hope everything he said and your recordings is very true I change from Simply plans to you folks", "rating": 5}, {"title": "Customer service was exceptional", "text": "Customer service was exceptional! Craig Dierking was very helpful and friendly", "rating": 5}, {"title": "Your agent Erika is awesome", "text": "Your agent Erika is awesome, she get 5 stars from me and my friends and family.", "rating": 5}, {"title": "I'm understanding all details including vision, dental, and medical.x", "text": "I think the company is doing good providing me to learn more experience opportunity as well.", "rating": 5}, {"title": "I like everything about it my coverage and my plans and my over the counter card I love this and I'm sure I will enjoy it thank you so much", "text": "I enjoyed talking to the representative he made me feel so much better and explain everything perfect to me I'm so excited about my new plan that I got with y'all and I will tell family members about it thank you all so much love the plan", "rating": 5}, {"title": "It was clear …interesting and…", "text": "It was clear …interesting and informative 🙏🏼", "rating": 5}, {"title": "I had Kathleen Sanders who is one of…", "text": "I had Kathleen Sanders who is one of the nicest women I’ve met on the phone. She is bright and cheerful and filled with compassion for those who have the pleasure of working out your insurance. She is smart and she wants to meet the customers needs and puts them first. I wish that all agents could follow in her footsteps. She is a pleasure to work with.", "rating": 5}, {"title": "Andy  treated me like a personal friend…", "text": "Andy  treated me like a personal friend or relative had my well-being in mind at all times made sure that I understood everything very respectful to the older generation", "rating": 5}, {"title": "Great 😊 very helpful", "text": "Date of experience: August 08, 2023", "rating": 5}, {"title": "Dj I was the first person that explained…", "text": "I was the first person that explained everything to detail and not me reassure me that any time I have a problem. I can give them a call and they will resolve it for me. And help me find it for the fr mind.", "rating": 5}, {"title": "Rhonda was a wonderful help!", "text": "Date of experience: August 08, 2023", "rating": 5}, {"title": "Excellent", "text": "The gentleman was excellent in informing me about everything", "rating": 5}, {"title": "Starla was so awesome at explaining…Starla the star.", "text": "Starla was so awesome at explaining everything. I felt well informed on everything I needed to know.", "rating": 5}, {"title": "SCOTT was very professional and went…", "text": "SCOTT was very professional and went out of his way to answer all my questions.", "rating": 5}, {"title": "The young man I talked to was great.He…", "text": "The young man I talked to was great.He knew exactly what I was looking for.", "rating": 5}, {"title": "It was a very long process but I really…", "text": "It was a very long process but I really like your representative Debra Giles.  Easy to talk to. Very down to earth.  It was a good experience however it long it took.", "rating": 5}, {"title": "When  I called to find out about  how…", "text": "When  I called to find out about  how this plan d was going to help me let did not  tell me it would cost me. About 40.oo dollars amount I was calling about how you were  going not cost me more called letty Saad 3 times she never called me back had to call another  her name wasjesica she was very helpful in letting me know how to cancel when some one misleads l loose all trust in that company letty never called  me back", "rating": 1}, {"title": "Not very hepfu", "text": "Date of experience: August 08, 2023", "rating": 1}, {"title": "The agent Was amazing", "text": "The agent Was amazing!  I appreciated her kindness, knowledge and expertise.", "rating": 5}, {"title": "Great and detailed", "text": "I'm new to this a great and informative experience 👍🏾", "rating": 5}, {"title": "Miguel did a wonderful job getting my…", "text": "Miguel did a wonderful job getting my plan set up!", "rating": 5}, {"title": "Awesome representative", "text": "Awesome representative! She did a great job of explaining things to me!", "rating": 5}, {"title": "Excellent service", "text": "Excellent service. Sofia explained everything perfectly. Very professionally and conscientiously.", "rating": 5}, {"title": "Objective:", "text": "This is a new experience for me so I'm planning on a good and positive outcome...", "rating": 5}, {"title": "The Ultimate Ensurem Experience!!!", "text": "I have been mulling over my health insurance for a while now, hoping one of these days an English speaking person, that I could understand would answer the call. Well, my wish came true and I spoke with a terrific man named David Pray. He was as professional as they come and explained everything to me in such a way that I got what it all means in 1 conversation...1 and done as they say. Couldn't be happier and hope you all get as lucky as I was to get a good customer service Rep that actually cares and wants you to have the best introduction possible into any new plans available in your area. Thanks again David...I will definitely reach out if I have any questions.😉💐", "rating": 5}, {"title": "Agent very helpful & polite", "text": "Date of experience: August 05, 2023", "rating": 5}, {"title": "My agent was absolutely delightful", "text": "Date of experience: August 11, 2023", "rating": 5}, {"title": "It took way too long", "text": "Date of experience: August 11, 2023", "rating": 4}, {"title": "What’s covered", "text": "Honest help me get right package", "rating": 5}, {"title": "The person who attended me is very…", "text": "The person who attended me is very friendly and knows the job perfectly. With people like Lynn my enrollment was very pleasant and satisfying. I commend you for having employees like Lynn who made me pleased and glad to easily find what I was looking for.", "rating": 5}, {"title": "My experience was great the…representative was honest and help me with the best plan for me", "text": "My experience was great the representative was honest and helped me with my insurance that best work for me", "rating": 5}, {"title": "Staff were very friendly and offered…", "text": "Staff were very friendly and offered their time for any additional questions.", "rating": 5}, {"title": "She was kind respectful and knew her…", "text": "She was kind respectful and knew her business", "rating": 5}, {"title": "Good Customer Service", "text": "The agent I spoke to was so kind and knowledgeable.Froylan Fernandez explained everything in detail and explained every benefit I was entitled to.He went over all the benefits and I was happy I spoke to him and got the help I needed.", "rating": 5}, {"title": "The man was very kind & polite,did not…", "text": "The man was very kind & polite,did not try to rush thru the information . He asked me if I had any questions after each segment and was very knowledgeable when I answered. His diction was clear and I heard every word.", "rating": 5}, {"title": "All my questions were answered", "text": "All my questions were answered. John was very professional and explained everything clearly so I understood. I am impressed with the plan he was able to get for me and will be sure to tell others. Thank you so much 👍", "rating": 5}, {"title": "A great company to work with!", "text": "Ms. Wright was really helpful, courteous, and knowledgeable. Ms. Wright explained everything in detail and she made sure that I got the biggest amount of coverage for my money.", "rating": 5}, {"title": "A good sales representative", "text": "Nothing in particular, the lady I talked to was a good sales rep.", "rating": 4}, {"title": "The process was great", "text": "The process was great!  My agent Sarah Horne researched and found the right plan for me that was tricky on some very important points.  Thank you.", "rating": 5}, {"title": "Final review", "text": "Pamela made it comfortable for me to talk about things and it was a very good final steps toward medic are", "rating": 5}, {"title": "My needs became her personal goal.", "text": "Date of experience: August 07, 2023", "rating": 5}, {"title": "Jayme was the representative who…", "text": "Jayme was the representative who assisted me. I was impressed with the ton of knowledge he has in reference to what I was looking for in my secondary insurance. He was extremely easy to talk to, patient, and very nice.", "rating": 5}, {"title": "Aseeking new insurance", "text": "Agent was well informed and pleasantly professional", "rating": 4}, {"title": "It was a long procedure", "text": "It was a long procedure.  I wasn't  aware of the  time needed to complete  it. The pe person helping me needed up to date equipment.  He was very polite and professional.  Answered question that I had, but just a long process!", "rating": 4}, {"title": "Ensurem", "text": "Kyle with Ensurem was very helpful with my needs.", "rating": 5}, {"title": "I think knowing I will get grocery money and other things", "text": "I think it was knowing that I had grocery money among other things", "rating": 5}, {"title": "Dion sanders was what made it great…", "text": "Dion sanders was what made it great very personable and patient", "rating": 5}, {"title": "Very helpful", "text": "Understand what I needed", "rating": 5}, {"title": "Listened to my needs and provide great…", "text": "Listened to my needs and provide great options", "rating": 5}, {"title": "Kim was great I have a strong accent…", "text": "Kim was great I have a strong accent French and she did her best to understand me", "rating": 5}, {"title": "Woman I talked to", "text": "The woman I talked to was very helpful and extremely nice, very easy to work with!!!!👍", "rating": 5}, {"title": "My experience was great because of…Arletti Duran", "text": "My experience was great because of Arletti Duran. She was so helpful and explained everything so clearly to me. I felt so relieved when we were done. I felt like I had an insurance that will help me.", "rating": 5}, {"title": "I spoke to Judie & Michella (?) and…", "text": "I spoke to Judie & Michella (?) and they were both so polite and helpful. I had hesitated calling because I had a previous experience with a representative who was rude and not helpful. Additionally, it was hard to understand him because he had a thick accent.", "rating": 5}, {"title": "I have nothing to do with Ensurem", "text": "I have nothing to do with Ensurem. I know nothing about the product, either.", "rating": 1}, {"title": "Changing Medicare Plan through Ensurem", "text": "Kelli was very personable and professional, and she answered every question I asked.  She looked up every doctor on my current plan to make sure they were on the new plan.  She did a price comparison for all my drugs and I am happy to say I will be saving costs in this area.  We covered out-patient costs and in-patient costs. She dotted every I and crossed every T.  I have never been given this treatment before when I was contemplating a new plan.  She made sure that I was comfortable with my new plan before I made the decision to change.  Thank you, Kelli.", "rating": 5}, {"title": "The agent who explained all the…Yvonne henderson", "text": "The agent who explained all the benefits..such a pleasure.yvonne henderson. Is great...", "rating": 5}]