[
    {
        "title": "The process was quick and easy",
        "text": "The process was quick and easy. I bought a Used 2017 nissan maxima and it had 2 previous owners BUT only has 55,000 miles on it when I received it yesterday. I will absolutely finance another vehicle from driveway. Cheyenne was the absolute best and she made the whole process smoother and easier! Thank you to all the associates who work for driveway! To anybody reading this review, Driveway is absolutely recommended!!",
        "rating": 5
    },
    {
        "title": "Definitely will buy it again",
        "text": "I recently purchased a vehicle from Driveway, and I must say, the experience was exceptionally smooth and straightforward. The staff were not only incredibly helpful but also very friendly. Without a doubt, I would choose to purchase from them again in the future.",
        "rating": 5
    },
    {
        "title": "My Sales Rep Ryan Made my experience…",
        "text": "My Sales Rep Ryan Made my experience Magnificent !! I was a little worried the site was a scam and it was to good to be true but Ryan helped me better understand Drive way and also reassured me 100% driveway was legit Ryan had made my entire purchase process easily , understanding and overall a great experience! I’d deal with him any day buying w house car whatever it is ! Count me in ! Also would like to shout out to a sales manager by the name of Brandon when arrived the Hyundai Dealership Brandon did whatever it was he needed to do so that I would be on the road by the end of the night !! Way from Texas he successfully helped me as soon as I called into the after hours number ",
        "rating": 5
    },
    {
        "title": "Great experience",
        "text": "Great experience! Super fast process the car I bought was from a dealership located close by me so we went to pick up my new car within 2 days! Shipping would take approximately 7-14 days we were told.",
        "rating": 5
    },
    {
        "title": "Worst experience of my life!",
        "text": "Worst experience of my life!! Save the hassle and find a car anywhere else. It was constant miss communication, you will talk to somebody new everyday, buying process was 10x harder than it should’ve been.",
        "rating": 1
    },
    {
        "title": "Best online experience ever everything…",
        "text": "Best online experience ever everything was easy straightforward they stayed in contact all through the process. I would definitely recommend someone to use driveway. And on top of all that Got a great deal on my new car.",
        "rating": 5
    },
    {
        "title": "After sale — support is nonexistent. May have underpaid by $1000.",
        "text": "BMW financial only receiver $42,000 instead of the around $43,000 they were supposed to be paid because we paid an extra month, bringing our total trade in total value down to only $46,000. They will NOT respond to my e-mails or texts.",
        "rating": 1
    },
    {
        "title": "Almost 5 stars ",
        "text": "I would have given them 5 stars if not for the fact that I had to redo some paperwork making it take that much longer. Other than that, everyone’s been very professional, courteous and willing to help. I would definitely recommend them.",
        "rating": 4
    },
    {
        "title": "Unsure about them",
        "text": "Process to actually buy the car was pretty simple and trade in process seemed easy. However, once the paperwork was signed communication was a little poor. Didn't get my temp tags right away so 3 days of the 7 day window were already gone when I got it. Car was filthy and I did ask for a detail but they only gave me $50 so I spent about 3 hours detailing it myself. They took my trade in and I am supposed to get money back but haven't heard anything yet on that so will update once I do hear that. I did reach out to the team who is in charge of my registration in my state and haven't heard anything back yet. ",
        "rating": 3
    },
    {
        "title": "It was easy your able to view the vehicles right on line without feeling haggled and pressured to purchase",
        "text": "It was easy your able to view the vehicles on line without having to go several dealers and wasting alot of time traveling and viewing vehicles. All you have to do is put in the year,make, model, trim, miles etc and bam you got your pick of vehicles. This was my first experience with driveway and it will not be my last. I like to thank the driveway staff for making this transaction a sucess.",
        "rating": 5
    },
    {
        "title": "Easy process",
        "text": "Easy process.Got real rates within 2 minutes of entering my information. Alot better rate than local dealership with no pressure from a sales person. Easiest car buying experience I’ve had.",
        "rating": 5
    },
    {
        "title": "Positive Car-Buying Experience with Room for Improvement",
        "text": "Overall, Driveway provided a great car-buying experience. I really appreciated their consistent communication throughout the entire process. However, I did encounter a couple of issues. First, even after making a down payment, the vehicle isn’t automatically held until all paperwork is completed and submitted, so you need to ask your representative to contact the dealership and request a hold on the vehicle.Another issue I’m facing is with the vehicle registration. I only have about two weeks left on my temporary tags. I’ve submitted all required information and have emailed a representative multiple times, requesting a status update or any steps I could take to expedite the process, but I have yet to receive a response.",
        "rating": 4
    },
    {
        "title": "I tried to sell my car through Carvana",
        "text": "I tried to sell my car through Carvana, and after hours of setting everything up, I was told I was outside their pickup area and to take it to a location hundreds of miles away. Driveway gave me a better price and picked it up without issue. My god, this is central NH. Rural, yes, but the hinterlands, no.",
        "rating": 5
    },
    {
        "title": "First vehicles were sold out from under…",
        "text": "First vehicles were sold out from under me, final vehicle arrived damaged. No help was offered,  couldn't even get a response.  Definitely will not go this route again.  ",
        "rating": 1
    },
    {
        "title": "Everything was simple and done online",
        "text": "Everything was simple and done online. Kayleen, one of the representatives, helped me and did such an amazing job. She was very professional and personable. I was very happy to have worked with her. She made it worthwhile.",
        "rating": 5
    },
    {
        "title": "higher offer from carvana",
        "text": "higher offer from carmax , carvana , promp process , car pickup at the house , fast payment , friendly reminder by text and email . ",
        "rating": 5
    },
    {
        "title": "Takes far too long ",
        "text": "The competition makes this process way easier and faster.  Driveway.com offered me a small but more then others but the amount of work and info they require before transacting, how long it takes to get approval and then they outsource pickup to a 3rd party and that was delayed; isn't really worth the extra bump.  At the end of the day, the deal got done and the payment was made.   ",
        "rating": 3
    },
    {
        "title": "Purchasing selection",
        "text": "Purchasing selection, flexibility and support were excellent. Made a number of changes along the way and the Driveway representative was a true advocate. The only cautionary note is, high costs for shipping and uncertain delivery scheduling with multiple changes.",
        "rating": 4
    },
    {
        "title": "Easy process",
        "text": "All instructions were very clear. Whenever I contacted them, I got immediate help or a very quick callback. I was given a good price for my vehicle and payment was very prompt.",
        "rating": 5
    },
    {
        "title": "Great experience with driveway",
        "text": "Great experience with driveway. From start to finish such an easy process. Would definitely use again. ",
        "rating": 5
    },
    {
        "title": "Great buying experience!",
        "text": "Driveway.com made my vehicle buying experience very comfortable with many helpful people that made the process easy and informative. Thank you!!!",
        "rating": 5
    },
    {
        "title": "Good price, convenient, would do it again",
        "text": "Would definitely use Driveway again and recommend their service.  I got a quick online quote and good price.  And the process was convenient.  My first time doing it so took me longer because I had to get a notarized lien release from my bank, and then was a bit concerned about signing away my title and mailing it to Driveway before payment, but they paid me real time into my bank account at the time of pick-up.  So worked out fine. ",
        "rating": 5
    },
    {
        "title": "Great customer service, not so great delivery quality",
        "text": "The responsiveness in all areas of customer support was great and everything was handled within a timely manner. However, the condition that the car arrived in was not what one would expect when purchasing a car. The car did not seem to be professionally cleaned prior to delivery (2 dead flies on the back dash, and there was dirt surrounding where a magnet was that the previous owner had), there was less than a quarter tank of gas in the car when it was delivered, and there were no bolts to attach the license plate to the car. ",
        "rating": 4
    },
    {
        "title": "Very Good Experience with Driveway…",
        "text": "Very Good Experience with Driveway selling my car. I uploaded the pictures and documents, got the Estimate. Once the estimate approved process started. Driveway sent the documents overnight for the signature. I had three days to sign and return the documents . Driveaway scheduled the pickup date once documents were received. Pickup truck came and picked the car. Every thing was hassle free.",
        "rating": 5
    },
    {
        "title": "Easy way to buy a vehicle ",
        "text": "The process was pretty easy, I found the vehicle I wanted put in a application and bought it outright, the only issue I had was that they sent me through three different sales representatives and one of them tried to throw me into a loan for a 2019 Toyota Tacoma but after I got to the third person I bought what I wanted. Overall it was a good experience, I would buy my next car from here again.",
        "rating": 5
    },
    {
        "title": "Good service with struggles occurring ",
        "text": "A lot of good communication at the beginning but once car was delivered, communication lacked for awhile  You can tell they don’t work with a lot of Washington customers or maybe they don’t check the Washington licensing rules oftenAfter more than a month of getting our car, we still couldn’t drive it because of not having our registration or new license plates sent to usAfter they heard I had issues with all my things, they reached personally to fix the issues and deliver my plates quicklyI am now able to drive my new car!",
        "rating": 4
    },
    {
        "title": "I felt everybody I spoke with was…",
        "text": "I felt everybody I spoke with was helpful and trying to make the experience easy. The only downfall is that the car came a day later than was scheduled for and we were not notified. I don’t believe this was the fault of the delivery driver as I am convinced he was communicating with somebody at the office, but I was not hearing back. Besides that everything was smooth and easy. ",
        "rating": 4
    },
    {
        "title": "Happy I tried it!",
        "text": "Despite my initial hesitation I decided to go with Driveway because their offer to buy my truck was quite a bit more than other online places. And I was pleasantly surprised by how easy and quick the process was once all was confirmed. Everyone was very nice and patient with all my questions since doing anything this big online can make one very nervous. I  would recommend anyone to at least reach out to Driveway for info. Happy I did!",
        "rating": 5
    },
    {
        "title": "Great Overall Experience ",
        "text": "This was a GREAT online car buying experience! Everything went fast and everyone was really helpful and knowledgeable!! I’ll do buy from Driveway again in the future!! ",
        "rating": 5
    },
    {
        "title": "Driveway did a great job in their communication ",
        "text": "Driveway did a great job in their communication with me. Never had an issue",
        "rating": 5
    },
    {
        "title": "I recently bought a really nice Silverado ",
        "text": "I recently bought a really nice Silverado through Driveway. Their customer service was excellent. Their dispatcher, Cheyenne, was excellent, providing me with shipping updates as the Silverado was shipped from Montana to New Mexico. Driveway is an excellent company to do business with.",
        "rating": 5
    },
    {
        "title": "The entire process was flawless from…",
        "text": "The entire process was flawless from start to finish. Such a great company and employees",
        "rating": 5
    },
    {
        "title": "I'll admit I was skeptical at first",
        "text": "I'll admit I was skeptical at first. But everybody I was in contact with during the process made sure I knew exactly what was going on, and what all the next steps were. I got a great deal and I love the car even better in person. Carvana was charging 5 grand over what I paid for my car with Driveway. I've already recommended Driveway to a few of my coworkers.",
        "rating": 5
    },
    {
        "title": "Reynechea was very helpful …",
        "text": "Reynechea was very helpful and got me squared away with my questions quickly, efficiently and courteously. ",
        "rating": 5
    },
    {
        "title": "Overall excellent experience selling my…",
        "text": "Overall excellent experience selling my vehicle to Driveway. Beautiful vehicle, fair price, ease of transaction, reliable, and straight forward from start to completion. Transport driver very courteous, careful, and thorough- conveniently picked up vehicle from home driveway. Would definitely recommend and transact with Driveway again!",
        "rating": 5
    },
    {
        "title": "Poor Communication",
        "text": "Although pleased with buy-out value, communication was extremely poor. No timeline of events given and did not have a consistent point of contact. Always left in the dark for several days where I had to initiate contact. Entire process took nearly a month!! ",
        "rating": 2
    },
    {
        "title": "Great job from start to finish",
        "text": "Great job from start to finish. I received a fair price. I recommend driveway",
        "rating": 5
    },
    {
        "title": "They were very nice and professional but beware of the vehicles.",
        "text": "The vehicle was worse than depicted in the ad.  The aluminum engine block was corroded badly as was the undercarriage.  I also found sand in areas of the engine bay as if it had been in a flood. Oh and water vapor came out of the air vents when the air conditioning was run.   They did allow me to return it but charged the entire shipping fee which should at least have been split or something with all the issues with this vehicle. ",
        "rating": 3
    },
    {
        "title": "It's one of the greatest experiences I…",
        "text": "It's one of the greatest experiences I have had. It was quick and convenient. i Had little bit doubt about this process cause it was my first time to sell my car via online. I didnt need to go any dealer. I submitted my car  photo and video via app and someone came to my house and checked the car and pick it up. I got the remaining balance right away and the bank was paid off in a week. thank you again",
        "rating": 5
    },
    {
        "title": "Very pleased with the service!",
        "text": "Very easy process representatives responded in a timely manner. Jennifer came to inspect and test drive my vehicle. She was very professional and kind. She walked me through the entire inspection process. Shout out to Tyler also who assisted me over the internet.",
        "rating": 4
    },
    {
        "title": "I am very thankful for Ms Briana Thomas",
        "text": "I am very thankful for Ms. BRIANA THOMAS she was just great with everything I needed process etc. Definitely will see her if I decide to get another vehicle Bless your heart Ms Thomas",
        "rating": 5
    },
    {
        "title": "Overall, it was OK",
        "text": "Overall, my experience with Driveway (so far) was “Just OK”. Not great, not terrible. Definitely agree with the sentiment of most people here that communication between departments is lacking. MASSIVE shout out to Cheyenne, my delivery coordinator, for being the only person assigned to me that I could get a reply from. She was extremely helpful, prompt to reply, let me know when she was going to be out of office… 10/10 there. The other departments, especially contracting, could use some improvement in their communication. I reached out to my contracting agent several times for questions and never heard back. My car was delivered 4 days ago and I still haven’t received my retail contract. Online chat support was helpful in giving me updates and adding notes to my account, but couldn’t do more than ensure someone would follow up (and most of the time, they didn’t).The process was straightforward. Put in request for car, got approved, sent $500 deposit. Uploaded all of my documents (insurance, ID, etc.). Waited for overnighted paperwork that took 3 days to deliver. Got that notarized at UPS and sent it back. Wired the rest of the down payment, and then waited to hear back. Stay communicative to keep the ball rolling. You might not hear back, but patience is definitely key here. You wouldn’t buy a car online if you wanted it instantly. After a few days my contract was approved and delivery was scheduled. The car/delivery itself is also just OK. I didn’t live near any Lithia dealers, so a 3rd party delivery service brought it to me. They gave me a 10 minute heads up that they were about to be at my address, which is a little short notice but thankfully I was already home. About 10 minutes for them to take their pictures and inspect, sign the delivery confirmation on their phone, and done. Car had a few problems I’ve noticed so far. For reference, it’s a 2021 Civic with 39k miles. I’ll be taking it to get a PPI today and will update my review depending on that. No issues/accidents were listed on the listing/CARFAX. However, both key fobs were completely dead, and one of the physical keys won’t fit in the door. The skid plate under the car is partially hanging. It seems to pull left and has something rattling in the back. Additionally, one of the tires was significantly under-inflated, so I’m assuming a leak, and all but one of the valve stem caps on the tires were missing. Needs new wipers and it was pretty dirty too, but that’s an easy fix. Overall, an OK experience so far, and we’ll see how long it takes to get my plates/registration as I know that’s a later roadblock for lots of folks. Just try to stay in contact the best that you can, but expect some delays and have some patience. The agents have 2 days off a week that you might hear nothing, that’s normal. My time from request to delivery was 10/20 to 10/31, so only 11 days. ",
        "rating": 4
    },
    {
        "title": "Overall a good experience",
        "text": "Overall a good experience. Taylor was exceptional at explaining the process and was fast, thorough, efficient, and courteous. Price was lower than I was hoping but you can’t beat the convenience. Including them coming out and picking it up! Taylor made it all work! ❤️",
        "rating": 5
    },
    {
        "title": "Awesome experience!!!!! 🤩",
        "text": "Awesome experience the whole way through, kept me up to date on all the paperwork, easy process from the initial online requirements to the ending of the car being picked up. Brian from PA took the car and made it such an easy transaction. Everything was smooth and easy. I definitely would recommend Driveway if looking to sell car. 😌",
        "rating": 5
    },
    {
        "title": "Poor Communication Process",
        "text": "Communication was horrible! I was having to initiate everything as whoever was working with me was always gone or didn't know I was in the buying process. I had a few great employees who were able to get some things spearheaded so it didn't keep drawing out longer but the buying process took well over a month to complete and not from my lack of providing information as requested. It was hard to get ahold of anyone when I needed assistance half the time and when I did get ahold of them I would be told one thing and that things looked good but then emails would say I didn't do things and it was delaying the process. I have a vehicle I'm happy with in the end but it was a LONG, PAINFUL process that I won't be going through again.",
        "rating": 2
    },
    {
        "title": "Smoothly!!",
        "text": "Everything went very smoothly, communication was great ever step of the way, start to finish was great whole process took a week to complete. Would use again and would recommend it to anyone looking to sell a vehicle with out the pain of people calling and showing up in your driveway!!",
        "rating": 5
    },
    {
        "title": "pleasantly surprised ",
        "text": "Although I ended up canceling the transaction in the end, the entire process was very smooth. Every person I worked with was efficient and very friendly. I worked with Tamie, and she was fantastic. When the time is right I will definitely consider using Driveway in the future. ",
        "rating": 5
    },
    {
        "title": "Sold my truck to driveway or so I thought.",
        "text": "Sold my truck to driveway, at least I thought I did. Filled out all paperwork and sent my signed title through UPS. Took the day off from work when the said they would pick it up on Monday. Waited all day and no one showed. Called several times and was told the driver was still scheduled to be there. Not so much as a call until I called and left a message that I wanted my title back. Would not recommend this company to my worst enemy!So now it’s the next day and I canceled the deal. The driver calls me to say he was on his way to pick up my truck! The communication with this company is terrible! What a joke!!",
        "rating": 1
    },
    {
        "title": "Smooth from start to finish",
        "text": "I was very nervous to sell my car online. You just can’t be too careful anymore. The whole process was smooth, I received a very fair offer. I could reach a person when I had questions. They paid out quickly and the pickup of my old car was timely. ",
        "rating": 5
    },
    {
        "title": "Just sold our 2019 Hyundai Santa Fe to…",
        "text": "Just sold our 2019 Hyundai Santa Fe to Driveway and the process was amazing! Initial valuation was a little lower than others, but David and Tyler worked with me to get everything uploaded and put in. Easy guided photo system is great. Good communication and follow up throughout the process. Their team came and picked up the car no added fees! Would absolutely check them the next time we have a car to sell/trade. ",
        "rating": 5
    },
    {
        "title": "Positive Experience ",
        "text": "The communication is easy. Fast process. Website is built well for finding what you want. Nice people to work with. ",
        "rating": 5
    },
    {
        "title": "OK experience",
        "text": "Offer was made quickly. The following steps were cumbersome. I didn’t agree with the downgrade in value of the car from the original, but was in a hurry to sell because of many other “balls in the air”. Was left with the feeling of being screwed by a company that is going to make a bunch of money on the deal. The pick up process was annoying, as the transport company was miserable to deal with. Did receive the payment quickly after the car was loaded. ",
        "rating": 3
    },
    {
        "title": "Best Online Car Shopping Experience!",
        "text": "I recently had the pleasure of using Driveway for my car shopping experience, and it exceeded all my expectations. From start to finish, the process was seamless and stress-free. One of the most significant advantages was the convenience of shopping online, allowing me to browse a wide selection of vehicles from the comfort of my own home. The website was user-friendly, with detailed descriptions and high-quality photos of each car, enabling me to make informed decisions effortlessly.The customer service at Driveway was outstanding. The team was incredibly responsive and attentive, answering all of my questions promptly and providing valuable insights into the vehicles I was interested in. Their professionalism and knowledge gave me confidence in my purchase, knowing I was supported every step of the way.Driveway also offered a transparent pricing model, with no hidden fees or surprises, which made the financial aspect straightforward and manageable. The option for home delivery was a fantastic feature, eliminating the need to visit a dealership and saving me a great deal of time.Overall, Driveway transformed what is typically a daunting task into a pleasant and efficient experience. I would highly recommend Driveway to anyone in the market for a vehicle, as they truly prioritize customer satisfaction and convenience.",
        "rating": 5
    },
    {
        "title": "Process was very easy in simple",
        "text": "Process was very easy in simple. Employee’s Mark, Samantha, and Taylor were very polite and helpful guiding me through this process. Never would have thought it would have been this easy selling a vehicle. Highly recommend Driveway. ",
        "rating": 5
    },
    {
        "title": "the whole process was very smooth and…",
        "text": "the whole process was very smooth and the pick up crew were very nice and explained each step of the process, Thank you Dallas hub guys! before they picked up the car, I call to find out how the payment worked, but the person at the answer desk had no idea, may want to train  the whole process to that team. ",
        "rating": 4
    },
    {
        "title": "Definitely worth the headaches",
        "text": "Overall my experience with Driveway has been good. However there a few frustrating instances during this whole endeavor that kept me from giving that 5th star. Overall I dealt with about 4 different people throughout. I'm not going to name names or point fingers but 3 of them were absolutely stellar at their job. 1 was pretty good but was also misinformed on a few things. That created more than a few bumps in the road. However overall they were fine to deal with. I would definitely use Driveway again based on this experience. Even with the hiccups ultimately the end experience was worth the headaches. ",
        "rating": 4
    },
    {
        "title": "They did a good job",
        "text": "They did a good job.  After the offer was made they kept in communication.   Only suggestion I would have is to say up front they will be requiring a notarized signature on a duplicate title just in case the original goes missing.   Just helps you plan better.  ",
        "rating": 4
    },
    {
        "title": "Every customer service professional was…",
        "text": "Every customer service professional was always extremely polite, very respectful, and truly helpful during this entire process.The sale of my Tacoma was efficiently handled by your company,Thank you for the excellent experience to sell you the pickup.",
        "rating": 5
    },
    {
        "title": "We are an older couple who use…",
        "text": "We are an older couple who use technology but are somewhat intimidated with some of it.  The customer service was patient and professional in explaining everything and helpful when we felt lacking.  Thank you to everyone in making the sale of our car painless and efficient.  ",
        "rating": 5
    },
    {
        "title": "Everything was great",
        "text": "Everything was great. Gave the best price for the vehicle. Third party pickup was delayed a couple times and on final pickup they just showed up out of the blue. Luckily I was just thirty minutes away, otherwise process was straight forward ",
        "rating": 4
    },
    {
        "title": "Valerie",
        "text": "Valerie, respectful honest and understanding and very patient. I actually enjoyed the whole process. Thank you to her. I don't know anybody else's experience but that was mine.",
        "rating": 5
    },
    {
        "title": "Don't bother with Driveway",
        "text": "Failed to title and register the car I bought in my name.  Got to spend quality time at my local DMV trying to fix this mess.  Currently trying to recover the cash paid for these services which were not rendered.Don't bother with Driveway.  Just contact the dealer and work with them",
        "rating": 1
    },
    {
        "title": "Customer service was much better than expected",
        "text": "Customer service and availability was first rate.  It wasnt fast money like stopping in for a trade in but they offered much more than other on line car buyers. The entire process was painless and took about 2 weeks to complete. Money hit my bank account 45 seconds after I sent photo proof of car being loaded! ",
        "rating": 5
    },
    {
        "title": "I saw THE car I wanted in less than 5 minutes ",
        "text": "I saw THE car I wanted in less than 5 mins, we were approved in less than 5 mins….the rest is done over a few days which is great. Any questions we had were answered. Everyone was nice and pleasant. We will 100% share our experience, recommend others to buy from you as well as buy from you again.",
        "rating": 5
    },
    {
        "title": "Very responsive staff and platform is…",
        "text": "Very responsive staff and platform is very user-friendly",
        "rating": 5
    },
    {
        "title": "There are pros and a few cons",
        "text": "Everything was very easy and the folks that handled everything over the phone and online we’re good to work with just a little taken back that the vehicle arrived and had 800 more miles on it then listed and the battery was dead and the company that dropped it off just dropped it in the driveway and took off",
        "rating": 3
    },
    {
        "title": "Outstanding service",
        "text": "I have never purchased a vehicle online.  I had a lot of questions and everyone was very helpful, and went above and beyond to ensure that this purchase was outstanding.  Even when there were a couple of wrenches thrown in, the staff still went the extra mile and helped out.  The vehicle is above expectations and I will enjoy it for years to come.  Thank you for your phenomenal service.  I would recommend Driveway to anyone looking to purchase a vehicle.     ",
        "rating": 5
    },
    {
        "title": "The EASIEST experience I’ve ever had",
        "text": "The EASIEST experience I’ve ever had! Sent the information over, they stood by their original offer, came and got the truck, and it was all over! Communication was super clear and informative, my questions were answered before I even got a chance to ask them, and everyone was super nice. ",
        "rating": 5
    },
    {
        "title": "Overall good experience",
        "text": "Everything went well buying the vehicle. You have to reserve it and then they send papers you have to notarize and send back. But over all pretty easy. I took off a star because from arriving at the local dealer to getting to my house took a week. It came from across country so I expected that trip to take time but not once it's at the dealership.",
        "rating": 4
    },
    {
        "title": "I received a great offer for my vehicle…",
        "text": "I received a great offer for my vehicle and communication was great, they help you every step of the way.",
        "rating": 5
    },
    {
        "title": "Amazing experience ",
        "text": "The communication was amazing from the start, everyone did their best to make me feel comfortable buying a car I have never seen. I love how honest and upfront they were with me and how smooth the whole process went.",
        "rating": 5
    },
    {
        "title": "I purchased a vehicle from…Driveway.com",
        "text": "I purchased a vehicle from Driveway.com. This was the first time I’ve ever shopped online for a vehicle. This experience was great & way easier than expected. The sales person Miracle kept in contact with me the entire time & offered me several vehicles to choose from. I finally made a decision on the vehicle I wanted & Miracle walked me through the process. The price was right & the payment were great. After getting everything that was required & signed, it took approximately 5-6 days for the vehicle to be delivered due to where it was located. The vehicle was exactly as it was in the photos & drives excellent. If you’re looking to purchase a vehicle, shop Driveway.com",
        "rating": 5
    },
    {
        "title": "I recently sold my car through this…",
        "text": "I recently sold my car through this company, and I couldn’t be happier with the experience. The entire process was smooth, efficient, and stress-free. From the initial inquiry to the final sale, everything was handled professionally. My payment was processed quickly and arrived in my bank account without any delays. I highly recommend this company for anyone looking to sell their vehicle easily and with confidence",
        "rating": 5
    },
    {
        "title": "I didn't really care who bought my car",
        "text": "I didn't really care who bought my car to be honest.  I bought my Jeep Wrangler when I retired and intended to keep it forever.  Sometimes in life circumstances change and I decided to move to France, necessitating the sale of my vehicle.  Driveway offered me the highest price of any of the \"usual\" online car buying services.  I submitted photos and they confirmed their offer via their online tool which was easy to use.  We shipped documents back and forth ang they picked up the car from my driveway in a week.  No haggling.  Nio hassle.  The money was in my bank account within a day or two.  ",
        "rating": 5
    },
    {
        "title": "Gave me best price",
        "text": "Gave me best price, better than Carvana or Car Max. Easy to do business with as process was quick and loved instant transfer of funds directly into my checking account.",
        "rating": 5
    },
    {
        "title": "Great experience with Drive way ",
        "text": "It was my 1st time buying a truck online, Driveway had the truck I wanted and their online reviews in my truck groups were good. Paper work and delivery took a week and half, 2023 Tundra Pro arrived in great condition. They came back a week later for my truck and everything is complete. ",
        "rating": 5
    },
    {
        "title": "Highly Recommend",
        "text": "I was very hesitant at first because I've never heard of the company. When 1st communicating with a representative, it felt like a scam due to the conversation, but after doing research, I decided to trust my gut. Driveway had individuals who like Dominique, Mark, and Tyler who were extremely helpful with my process. They made the process super easy. Pick up was easy and quick as well. I would use Driveway again if I ever want to sell my vehicle. ",
        "rating": 5
    },
    {
        "title": "For the most part good experience!",
        "text": "The overall buying process was good and relatively seamless.   There were some hiccups with the title work that I would think would be done on the front end but ended up delaying to process for 3 weeks.  Communication was tough at times and when calling the main line to get an update I would be put off because the person I needed to speak with was unavailable.  It seems that there is too much segregation of information so the customer service department is unable to provide any useful information.  Besides my complaint about the communication they have been otherwise super helpful in the couple of instances where the truck needed repairs before delivery and after delivery within the 60 day window.I will definitely use this company again for future car purchases!",
        "rating": 4
    },
    {
        "title": "Very easy compared to the others",
        "text": "Very easy compared to the others. Did exactly what they said they would do.",
        "rating": 5
    },
    {
        "title": "Vehicle Lease Sold",
        "text": "Just when I thought my sone would not be able to avoid having a repossession on his credit report, DriveWay stepped in to save the day. The process was fast. The  employee available to handle the processing of this purchase was very efficient.  The short of the story…My son still has great credit, Thank you DriveWay. ",
        "rating": 5
    },
    {
        "title": "Good follow-up (updated)",
        "text": "Car came unwashed with bird poop and pollen coating the vehicle, even the delivery driver remarked of the condition. The lack of a temporary tag included as well made for another headache. It's unfortunate because the first part of the process went smoothly. *** Updated - Driveway made it right which I can respect. Helpful follow-up that was swift and understanding. Thank you for making the process better, just wish the initial delivery had been a better experience and it appears it's a rare exception. Thank you again, love the car!!",
        "rating": 4
    },
    {
        "title": "Fast and Easy",
        "text": "I did not have time to shop at the dealership and I do not like haggling. Once I found my car online, contacted Driveway, I was done with the entire transaction within 2-3 hours (via online messages back and forth).  I could complete other tasks with purchasing my vehicle.  Cindy walked me through the process effortlessly. ",
        "rating": 5
    },
    {
        "title": "Performs as they say they will",
        "text": "Helpful, much better price for my car than from Carvana. A bit more work on sellers part, ( but worth it IMO). Payment very promptly.",
        "rating": 4
    },
    {
        "title": "How easy the paperwork and receiving…",
        "text": "How easy the paperwork and receiving the vehicle was.",
        "rating": 5
    },
    {
        "title": "Great experience from start to finish",
        "text": "Every step was easy from the initial call to pick up the service staff was friendly and helpful. Armani and Rafael who picked up our van were early for the appointment and very professional. They waited until the fund transfer came through before leaving.",
        "rating": 5
    },
    {
        "title": "Great followup to resolve an issue",
        "text": "There was some confusion regarding the registration of my Rav4. Once I brought it to Driveway's attention, Patrik was very helpful in figuring out what needed to be done and regularly following up until it was resolved. Thank you! ",
        "rating": 4
    },
    {
        "title": "The worst purchasing experience in my…",
        "text": "The worst purchasing experience in my life.  A complete disaster. From the time I wired payment for my vehicle, it took Driveway/Lithia 8 weeks and 3 days to register the vehicle.  A 7 day warranty is of no use when it takes two months to put the car on the road.  It just sat in my driveway for 59 days while neighbors asked why I wasn't driving my new vehicle. Instead of Driveway.com it should be called Disaster.com.  The vehicle was also missing floor mats and a 2nd key fob when it arrived and I was told I was out of luck.  A thoroughly miserable experience. Never, ever use Driveway.com. ",
        "rating": 1
    },
    {
        "title": "I was initially going to sell my car…",
        "text": "I was initially going to sell my car through CarMax but Driveway has a better offer and more convenient where they would come and pick up your car instead of driving it to a dealer and finding a ride home. Would definitely recommend everyone too sell to Driveway ",
        "rating": 5
    },
    {
        "title": "It was great communication and…",
        "text": "It was great communication and explanation about the process, and no delays. Great team work!Thank you!",
        "rating": 5
    },
    {
        "title": "Friendly service, unclear process",
        "text": "You need to explain the purchase and trade in process at the outset and what we should expect. First I was told I would have one main contact through the whole thing. Then I heard from 4 different people/groups along the way and not much from the main person. And I didn't know how to go about vehicle registration, I had to ask about it, then learned you handle it. Am still waiting for an answer as to how long that takes. Most of the info was provided via text, I would have preferred email which it's much easier to re-visit. When I asked a question via text, sometimes I had to ask it 2 or 3 times before getting an answer. One person still hasn't replied.Your team was always nice and friendly. The process and communications need improvement. ",
        "rating": 3
    },
    {
        "title": "Selling my car to driveway was the…",
        "text": "Selling my car to driveway was the easiest thing ever! They kept me in the loop during the entire process and everything was explained to me. And getting a hold of an individual over email or texts was very easy! ",
        "rating": 5
    },
    {
        "title": "Customer Care Team",
        "text": "I was very nervous about selling my vehicle because everything is done through email, chat, and phone.I was assured by the customer care team that everything would go smoothly.....To my surprise it did!!!Communication was great, every text, email, and phone call I sent was responded to in a prompt courtesy time frame.I am very pleased with the team that assisted me.Thank you.",
        "rating": 5
    },
    {
        "title": "Service was great!",
        "text": "Service was great they walked me through the process. answered all my questions! I will be using them in the Future!",
        "rating": 5
    },
    {
        "title": "Great company!",
        "text": "Everything was simple and easy! Representatives stayed in touch with me every step of the way! This was a fantastic car buying experience!",
        "rating": 5
    },
    {
        "title": "Thank you very much for your prompt and…",
        "text": "Thank you very much for your prompt and attentive service",
        "rating": 5
    },
    {
        "title": "everything went smoothly",
        "text": "everything went smoothly. car was picked up in a timely manner Dillon and coworker (sorry forgot his name) were both professional and communicative.thank you!",
        "rating": 5
    },
    {
        "title": "Carvana Should Watch Out",
        "text": "Damaris helped me get my Honda and it was an easy quick experience. She stayed in touch with me throughout the whole process and made the experience feel like I was being guided. Even with some issues with the ID validation, she kept me up to speed on what I needed to do.If everyone at Driveway is like Damaris, then carvana should watch out as they’ll be out of business with this competitor.",
        "rating": 5
    },
    {
        "title": "Communication STILL NEEDS WORK! Why still same mistakes?",
        "text": "I never thought in a million years I would ever purchase a car online without seeing or test driving, but I have to say it works.  I also would've loved to rate my experience higher, but the communication was TOUGH.  The review score of a 3 ( in total for Driveway)- is only because the car is super nice. I have to say I did get a beautiful car out of the deal - but it was very stressful at times.   I think the whole point of using an online dealer is to AVOID the hassles of a dealership - which was my thought process going into this.  Because of this - I believe Driveway is only shooting themselves in the foot - and losing a large clientele because you will never earn their trust with their current reviews (38% - Rate only a 1) with communication being the common complaint. THIS WAS MY EXPERIENCE;  sales people will be all over you to get the sale, BUT once that takes place - that's it!  There is not a representative assigned to you once the sale is done. Which there should be.  You find yourself floundering and asking people that cannot help you because it's not their job and you STILL have questions once the sale is complete.  You will get text messages where they do not even identify themselves - and at the beginning I thought they were scams ( and didn't pay attention to them).  I was assigned a wonderful (again I do not even know her title) sales person, let's call her, who did a great job to help get through the process and the red tape.  I reached out to her many times only because she was the only one to get back to me via phone or text me consistently. The individual that set up my delivery was also wonderful.  So the car gets to me, and as another reviewer stated, much to my surprise there was only ONE key/fob.  Apparently, because there was a picture of the ONE key sitting on a seat of the new car - I was suppose to assume that there was only one key fab?? I don't think so.   It also came with a BIG scratch that I did not see.  I did bring it to an auto body shop friend and he stated it was definitely a new scratch - which leads me to believe that it happened in the delivery process.    Maybe because the car was black and the pictures were not great - of which I asked over again to get better pictures, I therefore, never saw the scratch.  The  Customer Resolution team was of no help at all - NOW if I ever want someone to do business with my company again- I would do everything in my power to keep a positive relationship going.  No one was willing to get a quote for a new FOB (because it's much cheaper for a dealer to get a fob than a customer), to get me another key or even research the scratch.  It's called disclosure- no one along the way disclosed either of these things to me.  Watch the FINE print I guess.  That was an easy fix. Well, that was my experience,.  I love, love, love the car.  You can make the decision to move forward from reading not only my review, but others.   Driveway still has many things to improve on and I hope they do - because the concept is wonderful.    Thank you for the read!",
        "rating": 3
    },
    {
        "title": "It was honestly one of the most easiest…",
        "text": "It was honestly one of the most easiest transactions from the beginning to the end. And I didn't even have to do it in a dealership. Enrique was awesome he was the one who made my delivery exactly how they say right into the driveway! Thanks to everyone at driveway who made this all possible.",
        "rating": 5
    },
    {
        "title": "Very pleased with my Driveway purchase",
        "text": "Very pleased with my Driveway purchase.  While the process was online, the people involved were always available for calls.  The team was responsive to changes along the process. The person at the pickup took responsibility to make certain my experience was positive.  I recommend Driveway and will use it again.",
        "rating": 5
    },
    {
        "title": "It was great",
        "text": "It was great! Best car buying experience EVER! ESPECIALLY with no HIGH PRESSURE salesperson to deal with",
        "rating": 5
    },
    {
        "title": "This company was great",
        "text": "This company was great, Like the other guy said Carvana should watch out because to be honest they bought my car for $300 more than what I owed on it, they have speedy service they overnight paperwork. They do a great job, communicating back-and-forth even on the weekends. I will recommend them to anyone. ",
        "rating": 5
    },
    {
        "title": "Great communication!",
        "text": "Great communication, process was smooth and easy.  I had a good experience selling my car to Driveway.  I had multiple questions, all of which were answered promptly.  Driveway sent a driver to pick up my car at my house, so that made it much easier.  Would recommend selling your car to Driveway!",
        "rating": 5
    },
    {
        "title": "PARA COMPRAR TU CARRO NUEVO O USADO DRIVEWAY.COM",
        "text": "Great Place to Buy cars online. Best Place to sell your car also. Very Friendly people and also they speak your Language, Español. Gracias por tan buen servicio. 100% Recomendado para vender o comprar tu carro.",
        "rating": 5
    },
    {
        "title": "Tyler helped me with picking up and…",
        "text": "Tyler helped me with picking up and selling my vehicle to driveway. Made the process very easy. He was friendly and knowledgeable and made sure any questions I had were answered. Highly recommend and looking forward to doing business in the future.",
        "rating": 5
    },
    {
        "title": "This is our first experience with…",
        "text": "This is our first experience with buying a car on line and when we found the car we wanted it was through Driveway.All aspects were handled timely and as described. We are very pleased with our new car. When we had questions they were answered promptly and courteously.The only hangup has been with the NH license plates, but the temporary plates were sent on time. The DMV usually helps us to develop patience. Thanks for a positive experience. David Malone ",
        "rating": 5
    },
    {
        "title": "It was a cluster ---k ",
        "text": "It was a cluster ---k every step of the way with the exception of the gentleman, and I do mean gentleman, that inspected and picked up the car. ",
        "rating": 1
    },
    {
        "title": "Good clear communication throughout",
        "text": "Good clear communication throughout. No last minute surprises or changes. Fair price and better than some other similar services",
        "rating": 5
    },
    {
        "title": "The staff was very friendly",
        "text": "The staff was very friendly. They responded to every concern I had through out the whole precess. They also let me know when and what steps were being taken. I could not have asked for a more easier process, and would HIGHLY recommend Driveway for all our car wants!!",
        "rating": 5
    },
    {
        "title": "First car buying experience ",
        "text": "This is my first car and I did soo much research on what model make year mileage I could get for a certain price across multiple websites. But driveway had such an easy search option and huge array of vehicles. I found one at a reasonable price and it was shipped right to me. The process obviously takes longer than a day at a dealership for me it was roughly 10days. But I was in no hurry anywho so it didn’t bother me. The reps were very approachable and accessible. I highly recommend ",
        "rating": 5
    },
    {
        "title": "The company exceeded my expectations",
        "text": "The company exceeded my expectations. From the time I entered my car information on the driveway’s website to the time the car left my driveway, every step of the process of selling my car was accompanied by helpful on time communications thru texts and emails. I only called the company once to make sure they received my paperwork and asked for pickup eta.  The money was in my account the moment the car was ready for pickup. Not to mention that Driveway offered me 2k more than the local dealer at the time of trade in.This company was great, and all the people were super friendly. I will recommend driveway to all my friends, can’t think of the reason to sell the car on your own. Thank you Driveway!",
        "rating": 5
    },
    {
        "title": "Legit company and great service",
        "text": "Was skeptical as to whether or not it was legit, but I got my money and my car is paid off! Woohoo! Great customer service, will definitely use in the future if the need arises.",
        "rating": 5
    },
    {
        "title": "From start to finish the process was…",
        "text": "From start to finish the process was excellent. The pricing including shipping was very competitive.The car showed up much sooner than I thought it would. I will use them again.",
        "rating": 5
    },
    {
        "title": "Had a great experience with Driveway",
        "text": "Had a great experience with Driveway, transaction went thru smoothly. Received paperwork within days as promised. After my vehicle was picked up and I submitted a photo my payment came over within 5 mins .. thanks for the great service … ",
        "rating": 5
    },
    {
        "title": "Driveway was amazing",
        "text": "Driveway was amazing! They picked up my within the hour, and I got paid within 10 minutes. Just a great experience! ",
        "rating": 5
    },
    {
        "title": "Everything went well much better than…",
        "text": "Everything went well much better than going to the dealership. Everyone was helpful and any issues or concerns they took care of it right away. ",
        "rating": 4
    },
    {
        "title": "Sold a car through driveway",
        "text": "Sold a car through driveway. The process was very easy. They moved a faster than I expected. My car was picked up 3 days after sending the paperwork back.",
        "rating": 5
    },
    {
        "title": "Everything went smoothly except for",
        "text": "Everything went smoothly from the initial setup to the delivery. The only problem I had was when delivered the car wouldn't start. We had to jump start it to get off the delivery truck. Both batteries had to be charged before it was usable. You would think the dealer would have checked the car over before it was sent.",
        "rating": 4
    },
    {
        "title": "from the start the driveway staff went…",
        "text": "from the start the driveway staff went above and beyond to make everything a first rate experience.from the day I first choose my truck till the day my truck arrived they were there step by step.very freindly and helpful.always willing to help any way they could.I would highly recomend diveway to anyone looking to buy online.They were there from start to finish.",
        "rating": 5
    },
    {
        "title": "You made the operation of selling my…",
        "text": "You made the operation of selling my car seamless!Thank you.Mike",
        "rating": 5
    },
    {
        "title": "Horrible experience would not recommend…",
        "text": "Horrible experience would not recommend anyone to use again. So many diff calls from so many diff people to do so many diff things! ",
        "rating": 1
    },
    {
        "title": "Selling car online to Driveway for the first time",
        "text": "Thank you Kayleen, Jada and all team members at Driveway for helping me sold my first car online. At first, I was skeptical and thought it would be complicated to sell the car online. However, it was easy as 1 2 3 through Driveway. The transaction was smooth and straight forward. I would definitely recommend my family and friends to Driveway.This is how it works, Driveway send out both the online electronic Docusign through email and physical paperwork overnight to you with instruction where to sign it. You sign both the electronic and physical paperwork and postmark the physical paperwork within 3 days in the provided UPS envelop.  Once Driveway receive and process the paperwork, the car would be scheduled for pickup depending on where you live. Driveway then send a U.S bank link over email for you to fill in your banking information. Keep in mind, when the car is picked up onto the transport trailer, just snap a photo and send it to Driveway dispatch team. Call dispatch team for confirmation and the fund would be release to your banking account. That's it.",
        "rating": 5
    },
    {
        "title": "I made my first purchase with driveway",
        "text": "I made my first purchase with driveway, and it began with preston who was my online salesperson. He was outstanding and was very helpful and informative and really on the ball for answering all my questions before I even decided to make the purchase. He really went out of his way to contact the dealer and have them send me extra pictures.After deciding to make my purchase, I was passed along to dane, who was my go to guy for the delivery after delivery process. Dane was truly outstanding and answered a million questions on my part. There was a few issues with the car upon receipt that I was not aware of. Dane took it upon himself to reach out and get these small issues resolved and really went to bat for me and made me feel really great about the choice I made which made me happy with my purchase even though I had a seven day return window. If I'm being honest if it wasn't for these 2 gentlemen and their outstanding customer service, this would have been a  not so great experience. With that said every thing turned out great and I highly recommend the Driveway experience. I will definitely be back again if I have any future car needs.Also  a shout out to all the young ladies in the title and shipping department that helped along the way. They all had great communication skills.",
        "rating": 5
    },
    {
        "title": "Very nice staff take a little time but…",
        "text": "Very nice staff take a little time but holiday had something do with it but they a very very nice people to help you 👍👍👍",
        "rating": 4
    },
    {
        "title": "Massachusetts doesn’t have the option…",
        "text": "Massachusetts doesn’t have the option to drive without hard plates, therefore I don’t have the 7 day option to test, drive and decide, NOT HAPPY.",
        "rating": 1
    },
    {
        "title": "If I could give negative stars I…",
        "text": "If I could give negative stars I would!! Never been more dissatisfied in any customer service related industry or company in my 37 years! This company gives you the run around for days! It took three weeks from the day I put my down payment for the car to be delivered!! They give you no heads up and absolutely no time frame! I bent over backwards and called off an entire days work when told the car would be delivered at 9am and missed my day at work for nothing AND my daughters last football game to cheer at because they didn’t come until well after 6pm. The entire process was basically me hounding with phone calls every few days because they had my down payment and nothing- NOTHING was happening until I would call. I would get- the next step takes 3-5 days over and over!!! GO to a dealership!!! Save yourself the hassle and do not use this company. Unless you are retired and home everyday anyhow! ",
        "rating": 1
    },
    {
        "title": "Easy process with Driveway.com",
        "text": "Driveway.com made the sale of my vehicle such an easy process. The customer  service  was superb and they were available to help each time I reached out. The young man who came to pick up my vehicle was extremely nice and answered all my questions. ",
        "rating": 5
    },
    {
        "title": "Miscommunication …",
        "text": "Miscommunication between driver and Driveway customer service.  Was not informed truck had broken down for 3 days. I was never told driver had other vehicles and would be making drop off as well. I paid 1800 for delivery fee. Driveway needs a link where customer can track their large purchase. I was told my vehicle would arrive on a Thursday,  instead it was delivered on Sunday afternoon. To me Driveway customer service seemed disconnected. Not enough communication between driver and them.... Overall it gave me anxiety not knowing when vehicle would be delivered. Dates kept changing along with customer service giving me different delivery dates. Again, I had zero clue the driver was making other deliveries. Definitely need to work on some sort of tracking of vehicle for the customer.  I honestly expected a smooth transaction, but was disappointed. Vehicle arrived unharmed.  However when I drove it I noticed transmission issues. Took it to Nissan dealership here since it still has warranty.  Also missing handbook but honestly the one that was send to me digital was just how to adjust seatbelt and such. I need the complete 2020 nissan murano manual to learn what my vehicle is capable of.",
        "rating": 3
    },
    {
        "title": "Highly Frustrating and Disappointing",
        "text": "This has been the most frustrating and disappointing car buying experience I have had. The Tundra we purchased through Driveway was shown by the included Carfax, to have been fully serviced and Toyota Certified by Lithia Toyota of Missoula, Montana. Once the truck arrived we found that the A/C did not work, the tail lights did not work, the trailer light plugs did not work, the wiring harness had been ripped out of the back of the truck, the engine leaked oil, and the shocks were blown. It seems that they falsified the Carfax report or they lied about inspecting the vehicle. To top it off, after having a mechanic show us all of the things wrong with the vehicle and documenting it with photos, Driveway had the audacity to say it was insufficient proof of the vehicle's condition and that they were still going to charge us the transportation fee to send the vehicle back. We never would have purchased a vehicle in such bad condition. Negotiating the return of the vehicle has been just as disappointing. Each time the customer service rep. says that her manager will call us to help, it never happens. Each time the customer service rep. said that she would call us back, it would never happen and I had to follow up every time. All in all, I suppose the only good thing about Driveway is that they will take their vehicle back within 7 days.",
        "rating": 1
    },
    {
        "title": "I initiated the purchase process on…",
        "text": "I initiated the purchase process on 9/23 and received my car on 10/10. It's true you get bumped to a new \"specialist\" at every turn and step of the way, but at least everyone on my team was fast acting and responsive. I felt everything went smoothly EXCEPT for the actual delivery, which I believe could be improved on as an overall process:  1. The first driver missed the originally scheduled pickup. I wasn't informed of this until the day before delivery was supposed to occur. I could have been informed the day after it was missed.  2. I received an email when the vehicle was picked up stating my delivery date and time of 9am. I stayed home from work. 9am came and went and I called driveway and was told \"the system\" sends random times. Isn't that something you can just remove from your automation and/or repair?  3. Asking for a more specific time frame was impossible because of how many departments between Driveway and the shipper needed telephoned through for any information. Ultimately the driver didn't arrive until 8:30 pm. The policy of them calling you when they are 1-3 hours away is also too narrow of a time frame - not everyone has a job they can just run off from at a moment's notice and go home to receive a vehicle. If I had better communication throughout the day, I could've gone to work and not waited all day and evening.   Anyway, delivery issues aside, the vehicle is in good condition, and the dealership sent me photos of some paint damage before I committed to purchasing it, which I appreciated the integrity there. The damage is insignificant, especially after a detail, and I find Lithia to be a reputable dealer. I'd do it again, but I'd still be prepared for another delivery headache. ",
        "rating": 4
    },
    {
        "title": "Great Customer Service",
        "text": "This was my first time buying a car online, and it was so easy! Everyone I talked to was extremely helpful, waking me through every step and explaining things very patiently. No criticism from me!",
        "rating": 5
    },
    {
        "title": "Patience is the key ",
        "text": "The rest experience.  Once I accepted that nothing happens overnight, I was fine and was able to appreciate the process and the people that I worked with.  Every individual that  I came in contact with were friendly, professional and helpful.  ",
        "rating": 5
    },
    {
        "title": "Don’t make my mistake. Read the negative reviews and TRUST THEM",
        "text": "My experience with Driveway has been a nightmare filled with delays, misinformation, and irresponsible advice. I purchased a vehicle from Driveway and expected a smooth registration process, but since October 3, I've faced endless setbacks and a complete lack of accountability.On October 3, Driveway requested my insurance verification and state emissions test documentation, which I promptly provided. Despite confirming receipt of these documents, Driveway repeatedly requested my insurance card over the following weeks. When I reached out for updates, they assured me my paperwork was in progress, only to later reveal that they hadn't submitted it to the DMV until October 17—**two full weeks** after I sent everything required on time. This delay has left me with temporary plates valid only until October 31.As that expiration date approaches, I’m left in a terrible position, unable to legally drive the car I’m paying for. Despite the urgency of this issue, every attempt I made to speak with a manager was met with vague promises and no formal response. Shockingly, when I explained that my plates were set to expire, Driveway actually suggested I drive without proper registration—completely disregarding the fact that my state imposes severe penalties for this, including potential arrest and impoundment.Their refusal to expedite my registration or provide any temporary solution, such as rental reimbursement, is costing me financially and emotionally. Covering potential legal fees for following their advice would be far more expensive than providing a rental, yet they won’t help. This entire ordeal has forced me to seek legal counsel just to address the negligence and lack of support I’ve experienced. I’ve reported them to the Oregon Consumer Protection Agency, BBB, and I’m getting in contact with my attorney general as well.I urge anyone considering Driveway to think twice. This company’s delays, dismissive attitude, and irresponsible advice have been nothing short of appalling. If you value your time, money, and peace of mind, avoid Driveway. They have demonstrated a shocking disregard for customer well-being and legal compliance, leaving me without safe, legal transportation as my registration expires.",
        "rating": 1
    },
    {
        "title": "Great experience buying my truck",
        "text": "Great experience buying my truck! Would recommend the service to anyone looking to sell without the headaches of dealing with the public. ",
        "rating": 5
    },
    {
        "title": "They offered the best …",
        "text": "They offered the best out of every online dealer even the dealers and the process was very simple and quick to do. I enjoyed working with every person that texted me. Thank you so much. I Would recommend them and I would use them again.",
        "rating": 5
    },
    {
        "title": "This process was so easy!!!",
        "text": "This process was so easy!!!! The quote given was fair.  I am very happy I chose Driveway and will definitely refer them to others!",
        "rating": 5
    },
    {
        "title": "The whole process was terrific!",
        "text": "The whole process was terrific! Anytime you had questions, someone was always available to answer it, whatever it may have been. I’d use DRIVEWAY again!",
        "rating": 5
    },
    {
        "title": "They made a great offer",
        "text": "They made a great offer on my car, the selling process was quicker than the reviews online had warned about, and everything was straightforward and honest.",
        "rating": 5
    },
    {
        "title": "Very efficient process",
        "text": "Very efficient process. Extremely professional. Payment was made within minutes of final inspection.",
        "rating": 5
    },
    {
        "title": "Awesome customer service notified me of…awesome customer service and assistance",
        "text": "Awesome customer service notified me of every step of the way got a quick pick up and it's on its way thank you all so much for your assistance",
        "rating": 5
    },
    {
        "title": "Melissa and Bobby ",
        "text": "Melissa and Bobby Exceptional communication and I appreciated them explaining every step of the process in which they were apart of. They were professional and a pleasure to work with. ",
        "rating": 5
    },
    {
        "title": "Terrible response time after delivery…",
        "text": "Terrible response time after delivery of vehicle. I never received temporary plates and am unable to legally drive my vehicle after having possession for 4 weeks and counting now…",
        "rating": 1
    },
    {
        "title": "Very efficient and honest",
        "text": "Very efficient and honest. From now on, I will use Driveway only for selling my future used cars. Highly recommend it.",
        "rating": 5
    },
    {
        "title": "Very Satisfied.",
        "text": "Everything was so Great! From start to finish. Never bought a car online. Associates were great. Havanna was superior!!!",
        "rating": 5
    },
    {
        "title": "Satisfied Overall",
        "text": "Process was a bit more difficult than I expected. However, they did follow up with me and corrected the situation. ",
        "rating": 4
    },
    {
        "title": "You did everything you said you would",
        "text": "You did everything you said you would. Great customer service.Yes I would do it again and will if I ever decide to sell a vehicle again.",
        "rating": 5
    },
    {
        "title": "Everything went smooth",
        "text": "Everything went smooth. Great communication through the whole process. Car arrived earlier than expected. ",
        "rating": 5
    },
    {
        "title": "Driveway made the process so painless",
        "text": "Driveway made the process so painless. I would do it again. I got the price I wanted. Money direct deposited in my bank. Easy peasy. Great group people who i delt with. ",
        "rating": 5
    },
    {
        "title": "Super smooth process",
        "text": "Super smooth process. My car arrived on time and in perfect condition ",
        "rating": 5
    },
    {
        "title": "Honestly this was the best way to buy a…",
        "text": "Honestly this was the best way to buy a car was through driveway. They did everything for me and reassured about the updates on the car and literally everything was taken care of. Thank you 10/10 service!!",
        "rating": 5
    },
    {
        "title": "Easy to navigate",
        "text": "Easy to navigate. Was paid the price that was promised. Process took a bit longer than I expected but was informed step by step of Process and timelines.",
        "rating": 5
    },
    {
        "title": "Thank u to the staff for such an easy…",
        "text": "Thank u to the staff for such an easy sale we appreciate your help and patience with us during all of this ",
        "rating": 5
    },
    {
        "title": "My experience with driveway.com was…",
        "text": "My experience with driveway.com was extremely painless and easy. The company is very professional and quick to respond.",
        "rating": 5
    },
    {
        "title": "The people I dealt with were very nice…",
        "text": "The people I dealt with were very nice and knowledgeable. The price you offered was fair. The paperwork seemed to be very much to sell you my car",
        "rating": 3
    },
    {
        "title": "Smooth sale",
        "text": "Smooth sale. Gave me clear directions for paperwork. ",
        "rating": 5
    },
    {
        "title": "It was a great experience and the…",
        "text": "It was a great experience and the selling car process they made so easy and even price comparing with other competitors it’s very good . ",
        "rating": 5
    },
    {
        "title": "The whole process was smooth and no…",
        "text": "The whole process was smooth and no regrets dealing with Driveway.",
        "rating": 5
    },
    {
        "title": "Driveway is the best!",
        "text": "It was a great pleasure working with Driveway! Everyone was so nice and helpful. It was stress free. ",
        "rating": 5
    },
    {
        "title": "Great People, Great Service",
        "text": "Great service not having to go into a dealership to buy or sell my car. ",
        "rating": 5
    },
    {
        "title": "Great Experience ",
        "text": "The experience was absolutely wonderful!!! Thank you very much for making it easy!!",
        "rating": 5
    },
    {
        "title": "Good transaction ",
        "text": "Fairly reasonable offer Process was easy ",
        "rating": 5
    },
    {
        "title": "Amazing and fast customer service ever…",
        "text": "Amazing and fast customer service ever step of the way!",
        "rating": 5
    },
    {
        "title": "Good and quick service.",
        "text": "Good and quick service. ",
        "rating": 5
    },
    {
        "title": "FAST RESPONSE",
        "text": "Date of experience: October 30, 2024",
        "rating": 4
    },
    {
        "title": "Easy process",
        "text": "Easy process. Good communication and customer service. ",
        "rating": 5
    },
    {
        "title": "Driveway is a good company to purchase…",
        "text": "Driveway is a good company to purchase a vehicle from. The people are very helpful with everything. ",
        "rating": 5
    },
    {
        "title": "0 STARS - The WORSE EXPERIENCE ",
        "text": "I’ve had a highly unsatisfactory experience with Driveway.com and Lithia Motors. Since beginning the purchase process on August 20th, I have encountered numerous, unresolved issues that have caused extreme inconvenience, emotional distress, and financial strain. Despite my best efforts to work with the company to resolve these problems, I have been met with delays, inadequate responses, and lack of accountability.Below is a timeline of events, detailing my concerns and attempts to rectify the situation:* August 20, 2024: Initial contact with Akiree to begin the purchase process.* August 27, 2024: My credit union issued payment for the vehicle.* August 29, 2024: I paid $500, which was supposed to be refundable, to secure the vehicle.* September 4, 2024: After several requests, I finally received pictures of the vehicle. The pictures, which should have been provided prior to the $500 payment, revealed cosmetic issues, including scratches, nicks, and a small indent from a baby seat.* September 12, 2024: I received the vehicle but immediately noticed that two roof rails were missing. I called Akiree, who assured me the issue would be addressed.* September 13, 2024: Upon inspection, the vehicle had little to no gas, the coolant light was on, and there was no wiper fluid—raising questions about the so-called “inspection” process. Later that day, while driving, the car suddenly lost acceleration and started smoking, leaving me stranded on the expressway with my children. The car was towed to Land Rover of Chattanooga for diagnostics.* September 16, 2024: Land Rover diagnosed a major coolant leak, an incorrect battery, and other issues, all discovered just days after receiving the vehicle.* Despite these serious issues, Driveway declined to extend my rental car period until I requested to speak to a manager.* October 3, 2024: After receiving the vehicle back, I experienced further mechanical failure while driving to Atlanta. The car jerked, and I had to return to Land Rover, where they found a misfire requiring spark plug replacement. Once again, Driveway offered insufficient support, agreeing only to cover half of the costs despite the dangerous situation this car has repeatedly put me in.* October 10, 2024: I requested full coverage of the repairs due to the vehicle being in such poor condition at the time of purchase. Driveway refused, offering only a partial refund for repairs.* As of October 15, 2024, I am still without a functional vehicle, have yet to receive my $500 refundable payment, and have received zero updates or resolutions or my registration.October 15, after having an extensive call with the manager he called my husband back and said they would cover the spark plugs repair BUT NOT the rental car. I explained that we had no other transportation since we haven’t had our vehicle. I asked for themTo please cover all of the rental expenses because we still have not received the check from them to get our car. The manager Parker was clear that they will NOT cover the repairs and the rental - he said I had to choose one.Update: October 17 @4:48pm it was communicated that form would be sent for us to sign to even process the check. We then received a message at almost 7:00pm saying the form was sent which means it would take additional days for us to receive the check.October 19 @ 9:27am enterprise called to tell me that I have an outstanding bill for $721. I am just in disbelief. Driveway paid for two days but yet I have NO vehicle or check.Throughout this ordeal, I have experienced not only a lack of customer service, but also a disturbing lack of compassion and responsibility from Driveway.com. Despite having paid for this vehicle and insurance, I have only been able to use it twice—both times resulting in breakdowns that put me and my family in danger.I’ve been patient, polite and fair but at this point I can’t take it anymore. All I wanted was a functional vehicle and no $500 rental car tab.",
        "rating": 1
    },
    {
        "title": "Easy to  use ,friendly ,great communication ",
        "text": "Very easy to use, detailed instructions, would recommend to others wanting to sell their car",
        "rating": 5
    },
    {
        "title": "This process was so easy and the people…",
        "text": "This process was so easy and the people that help me were so friendly and available for all my questions!!",
        "rating": 5
    },
    {
        "title": "Go with that other car website instead ",
        "text": "Dropped the ball in basically every way possible ",
        "rating": 1
    },
    {
        "title": "Great job everything went smoothly came…",
        "text": "Great job everything went smoothly came to pick it up and got settled fast ",
        "rating": 5
    },
    {
        "title": "Great company to work with…",
        "text": "Easy to deal with and very clear on all aspects of buying your vehicle ",
        "rating": 5
    },
    {
        "title": "Everyone was very friendly and helpful.",
        "text": "Everyone was very friendly and helpful.",
        "rating": 5
    },
    {
        "title": "Sold my car to driveway and it was an…",
        "text": "Sold my car to driveway and it was an easy process. ",
        "rating": 5
    },
    {
        "title": "Everybody was professional and answered…",
        "text": "Everybody was professional and answered questions guickly.  Happy with the service.",
        "rating": 5
    },
    {
        "title": "Clear instructions on next steps and…",
        "text": "Clear instructions on next steps and easy process ",
        "rating": 5
    },
    {
        "title": "Very straightforward and no surprises",
        "text": "Very straightforward and no surprises ",
        "rating": 5
    },
    {
        "title": "Employees I spoke to were great",
        "text": "Employees I spoke to were great.  .  ",
        "rating": 4
    },
    {
        "title": "Great communication from start to…",
        "text": "Great communication from start to finish and in between ",
        "rating": 5
    },
    {
        "title": "Always helpful and kept me informed",
        "text": "Date of experience: October 11, 2024",
        "rating": 5
    },
    {
        "title": "Slow to pay",
        "text": "Slow to pay, otherwise everything was ok",
        "rating": 4
    },
    {
        "title": "Very informative",
        "text": "The company was very informative and keeping me updated",
        "rating": 4
    },
    {
        "title": "Good overall purchase",
        "text": "Customer service stayed in touch very well the entire process. Pricing was competitive without negotiating, and delivery was faster than expected.",
        "rating": 4
    },
    {
        "title": "customer service was excellent and…",
        "text": "customer service was excellent and drivers were very polite and respectful ",
        "rating": 5
    },
    {
        "title": "You did what you said you would do in a…",
        "text": "You did what you said you would do in a timely manner ",
        "rating": 4
    },
    {
        "title": "Happy car buyer",
        "text": "Easy, expedient, helpful, and friendly.",
        "rating": 5
    },
    {
        "title": "The purchase process is flawless so the…",
        "text": "The purchase process is flawless so the one star isn't for the sales team.  They are very professional, helpful and quick.  The customer service call center and chat operators are very good at their jobs and try to help.  The problem is with the delivery process.  I purchased a 2019 Lexus UX from Driveway on 9/21/24.  I loved the car, based on how it appeared on the website. From my car searches online, I hadn't seen another one like it.  You know how when shopping and you finally see the perfect item and get the feeling of \"That is it, That's the one!\"  I had that feeling and  therefore decided it was worth paying the more expensive delivery cost to bring it from California to North Carolina.  The interior is unique and very nice. However, I have yet to see it in person, let alone drive it, because it hasn't been delivered as of noon on Monday, 10/7/24.  When it was finally put on the truck on 9/29/24, Clara in shipping updated me about this status via text.  I got excited that my car was en route.  I checked in with Clara mid week and was told that it was on time for delivery to the distribution center on Friday, 10/4 and I would be updated once it was delivered. I am in eastern NC and the western part of the state was devastated by hurricane flooding.  I became concerned that the delivery drivers wouldn't be able to get through because large sections of I-40 are impassable.  Partially concerned for their safety and a potential delay, I checked in with Clara and informed her about the roads and asked her to please check on the drivers.  She replied \"Got It\" and kept insisting via text in what seemed like a robotic tone, that the vehicle is on time for delivery to the distribution center on 10/4.  It felt like my text questions were bothering her and I do not like to do that.  However, by 5:00 pm on 10/4 when I hadn't been updated the car was delivered to the distribution center, I texted Clara again and asked for an update and asked if they work late into the evenings.  I got her same robotic reply, delivery is confirmed on 10/4.  She then immediately texted me again and added the distribution center is neither open late nor open on the weekends.  It was a big let down because I was so looking forward to showing off my new wheels over the weekend. I asked her what happened to being on time for delivery to the distribution center on 10/4?  To that, she said she would have the supervisor contact me leaving me to wonder if there was an accident or some other issue that requires a supervisor to let me know about.  I have never heard from a supervisor.  I started the purchase process on 9/21.  Today is 10/7 and as far as I know, the vehicle could be on the moon.  I have no idea when it will get to the distribution center.  I have no way to get around as my other car was sold. I keep mentioning distribution center in my review because it is important to note that if you are expecting to get your car the day it arrives at the distribution center, you will not.  Clara fails to inform you that it has to go through a process when it gets there so only God knows when the actual delivery date to me is.  I sure have no idea when I am getting my car.  In the meantime, I have financed the car and the first payment will be due on 11/9/24.  I am going to be paying for a whole month for a car that I do not have. I am seriously considering canceling this purchase because I have been stuck at home with no car to drive since I started the purchase process on 9/21.  I cannot get to work and at some point, I am going to lose my job and then won't be able to pay for the car.  I have been lucky enough to work from home but do not want to keep pushing that.However, my down payment funds are now tied up in the Lexus and if I cancel, I would have to wait an additional unknown time period to get the money returned to buy another vehicle.  It is quite a conundrum and a mess.  Just know that if you need a car, do not consider an online purchase where the car is being delivered to you from out of state.  I know I naively made that decision; foolishly trusting that it would not take so long get from California to North Carolina.  I wouldn't be so upset if I was honestly communicated with about this issue/process.  But, I have been continuously told the car was on time for delivery to the distribution center on 10/4.  Even in the age of cellphones, no one actually checks to see if that is true. Obviously it was not delivered to the distribution center and I haven't yet been informed of that nor have I been told when I would actually have a car. I am losing money each day I am not able to use the car.  I am so disappointed. Driveway has to get a better handle on their shipping process.  Once they do, they will have a good system.  Until then, I believe these kinds of reviews will hurt them. ",
        "rating": 1
    },
    {
        "title": "From Good to STRESSFUL ",
        "text": "Things started off so well. The individual I first spoke with was very helpful and responded to my information provided very quickly. Then I got transferred to my paperwork coordinator, this is where things started to fall apart. If I had a question, I couldn't get a response. I kept receiving emails that stated things needed done in a timely manner, but I couldn't reach anyone. I finally reached out to a supervisor that was able to help me with the remainder of the paperwork. They claimed they didn't have my wire transfer sent 3 days prior, which was very concerning! After it was located, I was sent to ANOTHER person who was a delivery coordinator. He was very responsive...at first.  He originally told me I would receive my new vehicle on Monday, September 9th. Monday came and went with no communication and no vehicle. Late Tuesday I receive a call stating that the delivery driver will be arriving late and will deliver my car the next morning. I ask if it will be delivered prior to 2 pm, as I had to go to work. I get a text response of \"I can't tell you that\". At this point I'm frustrated, worried I spent money on a vehicle I'll never receive, or a who knows. Finally, I get a message stating it will be delivered \"sometime after lunch\". Great! I will be here. Noon comes and goes and still no word. Now I'm freaking out. I reach out to 3 different people and no one is able to give me an estimated time. After a bit I get an estimate of 3-4 pm. Mind you, it's WEDNESDAY now. The vehicle was supposed to be here Monday!! I have to inform them that no one will be here due to my work schedule and my husbands schedule. I have to try to adjust the time to 5 pm so we can coordinate. I get a response of \"that should be fine\". At 4:26 pm I receive a phone call from an individual who spoke very broken English stating he couldn't come to my house to drop off the vehicle and he needed someone to meet him on the main road out from our house, which is a VERY busy main road. I tried to explain to him that our road loops around. He can make it. But he refused to listen. My husband jogged down to the main road and waited. Once the truck arrived he stopped part way in someone's yard amd part in the main road!! My husband had to try to direct traffic around the truck while the deliverer proceeded to offload my new vehicle into someone's yard, onto a busy road and back it into this other individuals driveway. Meantime the homeowner comes home and needs in their driveway now blocked by this truck and my new vehicle. Luckily, the homeowner was very sweet and understanding. After signing the papers my husband proceeds to drive the new vehicle back to the house where he realized he only had one key faub. SO, the next day I contact the company about obtaining another faub. I was basically told no. I got a response of \"typically used vehicles only come with 1 faub\". Not my trade in! It comes with two! No informed me it was missing a faub when I purchased it and it wasn't stated in the description that it only had one faub. Nice! Onto the 7 day trial period. I made a point to have the vehicle FULLY inspected, especially after the whole ordeal I had been through. Thankfully, things were in order and is a sound vehicle. I expected a phone call of some sort asking of I liked the vehicle or if I planned to keep it before they picked up my trade-in. Nothing! I got a phone call the following Wednesday to let me know they were coming to pick up my trade-in. We'll, ok then. Good thing I planned to keep the new vehicle. The pick up was very uneventful, thankfully, and they were able to come down my street...imagine that! At this point I am STILL waiting on plates and a title. My temp tags expire in 6 days. Needless to say, I'm not optimistic that they will come in time. I began this whole process August 20th, didn't receive the vehicle until late September 11th, and as of September 30th I still don't have my title, registration, or plates. I do NOT recommend Driveway. Communication is terrible and there timeline to do things is very asscued.",
        "rating": 2
    },
    {
        "title": "Great costumer service agents",
        "text": "Great costumer service agents ",
        "rating": 5
    },
    {
        "title": "Thank you Damaris for the smooth…",
        "text": "Thank you Damaris for the smooth process, excellent service.",
        "rating": 5
    },
    {
        "title": "Easy transaction",
        "text": "Easy transaction ",
        "rating": 5
    },
    {
        "title": "Aways had good updates on the vehicle",
        "text": "Aways had good updates on the vehicle ",
        "rating": 4
    },
    {
        "title": "Everthing was great and very easy",
        "text": "Everthing was great and very easy ",
        "rating": 5
    },
    {
        "title": "Every step of the process was handled professionally and on time.",
        "text": "Every step of the process was ",
        "rating": 5
    },
    {
        "title": "Driveway review ",
        "text": "Tyler was very helpful in selling my vehicle. ",
        "rating": 5
    },
    {
        "title": "Easy process friendly customer service.",
        "text": "Easy process friendly customer service. ",
        "rating": 5
    },
    {
        "title": "Great Experience",
        "text": "Everything.. from price to pickup.",
        "rating": 5
    },
    {
        "title": "Very easy to deal with",
        "text": "Date of experience: October 12, 2024",
        "rating": 5
    },
    {
        "title": "Fast",
        "text": "Fast, honest, well communication. ",
        "rating": 5
    },
    {
        "title": "Nice and friendly",
        "text": "Nice and friendly ",
        "rating": 5
    },
    {
        "title": "Not quite hassle-free, but worth consideration.",
        "text": "I learned about Driveway.com after researching cars from Edmunds.  General perception is that Driveway.com is slow but eventually delivers on its promises.  My experience more or less matches this.  I had little difficulty identifying the vehicle I wanted, though the process of obtaining it was rather bothersome.At every step of the way, there would be delays or long periods of silence from the company.  From initiating the purchase, waiting for a delivery date, and when I would obtain final registration.  Sometimes I would have to make a stink before the ball got rolling.On the other hand, I obtained a vehicle that matched my needs perfectly and at a rather solid price.  I might have just been lucky, though I can’t really complain here.The customer experience leaves a bit to be desired.    But if you’re in the market for a new car, Driveway.com is good enough if better dealers or retailers don’t have what you’re looking for.",
        "rating": 3
    },
    {
        "title": "My experience with driveway is…Excellent.",
        "text": "My experience with driveway is flawless,Excellent. Whole Team is very helpful in professional manner. They earn my future business no doubt about that.",
        "rating": 5
    },
    {
        "title": "Once the car was delivered",
        "text": "Once the car was delivered, I didn’t hear from Driveway. I had to contact them to find out the status of my final paperwork and my title. To date I haven’t received anything.",
        "rating": 3
    },
    {
        "title": "The experience with Driveway was…",
        "text": "The experience with Driveway was seamless and very straightforward.  For me it was better than selling to a local and worrying about every scratch or future mechanical problem to come back for resolution.  The drive who picked up the car was very polite and professional .",
        "rating": 5
    },
    {
        "title": "Great experience doing business",
        "text": "Great experience doing business ",
        "rating": 5
    },
    {
        "title": "right from the very first phone call",
        "text": "right from the very first phone call, everyone was courteous, respectful, knowledgeable, very helpful. All my questions were answered. Everything happened in the timely matter and as they said, it would start to finish smooth transaction I couldn’t be happier.",
        "rating": 5
    },
    {
        "title": "Driveway Used Car",
        "text": "Everything was smooth and the process was easy. Why it’s not 5 is because of a few things: Delivery time and detailing issues.I received my car, understanding it was used, it smelled like someone had smoked in it before. Granted, they provided a history of the car and what it was used for prior to. Knowing it was a fleet vehicle that had an accident, I kinda knew what to expect but nothing else was mentioned other than the repair and the accident. Steering wheel has a worn joint or bearing, making a slight scraping sound when turning the wheel. Used a refresher for the interior to hopefully get rid of the smell and it did, but I know the upholstery will need to get cleaned as well.In addition, the wheel alignment was not done properly or properly inspected. After driving a couple of miles, the steering wheel would slightly jitter as I’m driving, especially on a straight road.Delivery time. Timeframe was given for an hour. Waited at my residence before the time of delivery just to get it almost 30 mins after the timeframe. Although 30 mins is pretty short, it defeats the purpose of the time slot window to deliver the car.Otherwise, pretty simple and easy process. Would recommend if you’re considering other car buying options aside from Carvana, True Car, and others. If anything just be cautious with the used car inventory and thoroughly check the info as the buyer.",
        "rating": 4
    },
    {
        "title": "Average due to car arriving without temporary tags",
        "text": "The delivery of the car and the documentation was good, but I had to chase the dealership down for the temporary tags which were not delivered with the car.  This forced me to rent a car, without reimbursement while I waited for 4 days, and eliminated the 7 day trial period.",
        "rating": 3
    },
    {
        "title": "Funds Transfer Angst! Everyone was excellent and the process…",
        "text": "Everyone was excellent and the process went very smoothly until the very end. I was told my RTP would take minutes once the car was loaded and pictures were sent to the Drivetime contact person. I started to panic when my car was gone and no money was transferred into my account. I sent 2 emails & 3 texts to various contacts with whom I was dealing but no response. If someone could have responded that the payment was delayed for some reason, I would have understood. But no response from anyone resulted in some wasted angst. Up until the transfer of funds, everything was perfect.",
        "rating": 4
    },
    {
        "title": "Chose Driveway for an easy sale!",
        "text": "The reason I choose driveway to sell my car was they offer real time payments.  They were easy to work with and accommodated some unexpected situations.  Definitely recommend them if you are selling a vehicle.",
        "rating": 5
    },
    {
        "title": "The process was super easy and there…",
        "text": "The process was super easy and there was great communication from everyone involved during the process. ",
        "rating": 5
    },
    {
        "title": "The communication was terrible",
        "text": "The communication was terrible. It seemed as though each person I spoke to had no idea what the last person was talking about or gave the opposite answer. The delivery drive also didn’t pick up the vehicle when scheduled to and we had taken the day off work to be available for the car getting delivered. They say 7 days or 400 miles to return the car if you don’t like it but the place I bought the vehicle from does not provide temp tags. The vehicle has to sit in my garage until I receive my actual plates in order to drive it. The agreement should be changed to 400 miles because the 7 day window of test driving the vehicle is already done and passed. I would not buy another vehicle driveway. ",
        "rating": 2
    },
    {
        "title": "The process was very fast and…",
        "text": "The process was very fast and communication was great. I suggest driveway over any online seller. No gimmicks and very transparent.",
        "rating": 5
    },
    {
        "title": "Above And Beyond Service",
        "text": "Hello everyone! To start, the team who served me in the DFW (TX) was wonderful. I was a first-time buyer, and they did all they could to get me a car; the Grapevine Honda dealership even got me an Uber to get me in my car before the first of October. My biggest help was Mr. Nathan, his manager, and his sales representative. The process of buying the car was quick, simple, and structured. The whole process, overall, took two days (since I picked it up). The Driveway Team and the Grapevine Honda dealership were efficient and helpful with their approach. I would recommend them to anyone who is interested in purchasing or selling a vehicle!",
        "rating": 5
    },
    {
        "title": "Not Consistent",
        "text": "I wanted to provide a detailed review of my experience with Driveway. I found a car online and contacted Driveway. I spoke with Savannah, who was friendly, knowledgeable, and attentive. She guided me through the car details, contract, and the $500 holding deposit. I submitted all the required paperwork, including a picture of my driver's license, current cell phone statement, and proof of insurance. Afterwards, I e-signed the documents and received DMV paperwork via FedEx for wet signatures, which I returned.Priscilla, my new representative, was also helpful and friendly. However, the next representative, Cheyenne, who is a dispatcher, provided incorrect information and was rude. She did not follow up with me and did not respond to my texts or calls, indicating a lack of follow-up and communication as the process continued.My credit union sent the check to the dealership, which was received on Monday, Sept 16th, and the car was delivered to my driveway on Wednesday, the 18th. The car was driven from the Valet Delivery Center to my home, and the Valet representatives were helpful. They pointed out a chip in my windshield and advised me to contact Driveway for repair, for which they were happy to reimburse me. However, I had to persistently follow up as there was a lack of communication, leading to delays in receiving the reimbursement.As for the $500 holding deposit, there has been a mix-up, and I am still waiting for them to contact me once the transaction is complete. Overall, my initial experience with Driveway was positive, but as the process continued, the service was not great. While I love my car and the price, I would not choose to buy from Driveway again.",
        "rating": 3
    },
    {
        "title": "Rude pick up person and the paperwork process is intimidating. ",
        "text": "It was very scary to send my signed documents before the transaction. Also, the person who came to pick up the car was going to be late and argued with me that I had the time wrong. I supplied my confirmation and she blamed it on the system. When she arrived she was extremely rude and communicated very poorly. When I asked for a receipt, instead of explaining that it’s emailed to me, she rudely stated that she doesn’t give me anything. This interaction almost boiled over. She was an awfully rude person who had zero communication skills. ",
        "rating": 1
    },
    {
        "title": "Customer service",
        "text": "Customer service, ease of purchase ",
        "rating": 5
    },
    {
        "title": "Everything",
        "text": "This experience was Everything so far from how i ordered until i got it delivered thanks DRIVEWAY ❤️",
        "rating": 5
    },
    {
        "title": "Drive time is awesome",
        "text": "Drive time is awesome! The best place to go for online car buying experience. So easy and flawless!!!!",
        "rating": 5
    },
    {
        "title": "I was happy to find Driveway",
        "text": "I was happy to find Driveway and the buying process was pretty simple. I like the online car buying experience and good communication all the way through",
        "rating": 5
    },
    {
        "title": "I just sold out my Volkswagen Passat…",
        "text": "I just sold out my Volkswagen Passat (2014/white) via driveway. Tyler, helped me all of process as well. He does excellent customer service( quick response, polite,knowledgeable) If someone wants to sell a car, I strongly recommend the drive way. Ask Mr. Tyler ! I got better   price than car max( sterling , VA ) ",
        "rating": 5
    },
    {
        "title": "Working with driveway is always good",
        "text": "Working with driveway is always good, have done the process about 5 time and I keep coming back because of the experience. It would be nice if that could be taken for consideration as returning customer, but the syste does not show that. Transportation could be cheaper, and other fees, 1800 dollars for cross country delivery on a company that ships multiple vehicles is too much, is understandable if they are only shipping 1 car every few months, but I know a major company as Drive is shipping multiple vehicles at the same time.Florida 1200 fee with no brakedown or what is the fee for is too much, and hard to understand.Due to the way the company is set up, trying to do the paperwork was a little challenging. I had people calling from Florida, Texas, and Oregon in different time zones was challenging. I did notice Driveway does not provide Veteran discounts. It could be nice the one of the biggest car companies to offer something to military service members.",
        "rating": 4
    },
    {
        "title": "The team was amazing",
        "text": "The team was amazing. From the start to the day the truck was picked up was an easy experience. Thank you and I would highly recommend drivewayThank you ",
        "rating": 5
    },
    {
        "title": "Great experience and nice staff that…",
        "text": "Great experience and nice staff that are attentive. ",
        "rating": 5
    },
    {
        "title": "I got my car fast",
        "text": "I got my car fast. It only takes 3days to get my car when everything done on-line. Only complaint is communication manager from driveway told me if I can pick up the car from the dealership is will be faster way to get the car. I have to request day off from work to drive from Napa, California to pick up my car in San Francisco. Then a guy from dealer call me that the car is here delivering to me at home in Napa. But I am already arrived at dealership in SF!  end up I have to wait for my car and it takes more time for me to wait at the dealer ship.I wish the company improved the way to communicate better. ",
        "rating": 4
    },
    {
        "title": "Got a lemon and don’t like lemonade",
        "text": "Once received we drove for about 15 minutes then parked the car. After the weekend we went to take it to DMV for tags. Upon getting in the fob would not open the doors. We had to use the emergency key to open the car. The dash stated that the battery needed to be replaced. After replacing the car went into reprogram mode. During this time every time we opened the doors the alarm would go off and the fob did not work at all. We requested the car be returned. The Rep stated it sounds like the fob just needed reprogramming. We attempted to call a locksmith with no avail and no help from the sales Rep. The power locks only lock from inside and do not unlock. We have stated that the car is not functioning and would like to return it several times. It has been in my driveway now 3 weeks and can’t even start it up. The staff with vehicle were very deceitful and never followed up on anything they said. We have had to call over and over. Just recently did we get the forms to return it. I would like to add that once getting ahold of a supervisor named Amy our return has started. She has been super helpful and compassionate. It WAS the dealership in Elk Grove that pushed out a lemon. ALSO the robo generated response is BULLS&@T!!!!! This vehicle has never been in a repair shop !!!!! So what are they monitoring. ",
        "rating": 2
    },
    {
        "title": "I was working with Justin,he was so…",
        "text": "I was working with Justin,he was so helpful and patient.everything was smooth ",
        "rating": 5
    },
    {
        "title": "Good experience with selling my car",
        "text": "Selling the car through Driveway was like a breeze. They gave the best price for my car and handled the process online effectively. The personal came for pick up Jake Kiley and Enrique Rico (from DFW hub) were very professional and completed the pick-up and payment process quickly. Overall its a great experience. Highly recommend Driveway to others! ",
        "rating": 5
    },
    {
        "title": "Great offer, fast response",
        "text": "Great offer, excellent communication, easy transaction. Help was readily available when I had questions",
        "rating": 5
    },
    {
        "title": "Had a great experience selling my car…",
        "text": "Had a great experience selling my car to Driveway and would definitely recommend for others to consider. Was initially nervous about the online approach but their communication and responses to questions was very good. You get handed off to different people on different teams, during each part of the process but the transition was seamless for me. For the final pickup, Jake & Enrique from the Dallas hub came out and were very professional in answering any final questions. Overall, great experience!",
        "rating": 5
    },
    {
        "title": "Great Experience",
        "text": "Great Experience! This company is willing to work with small business owners virus the dealerships & Carvana. Had amazing customer service every step of the way! Very much appreciated Luke (Manger) & Mireya(contract analyst) help and customer service! Will recommend to anyone! Can’t wait to receive my new car! ",
        "rating": 5
    },
    {
        "title": "It was super easy! ",
        "text": "It was super easy! Just a great process. Everyone I interacted with was professional, courteous and friendly. I highly recommend Driveway when ready to sell your vehicle. ",
        "rating": 5
    },
    {
        "title": "Recently I got my CAR through Driveway…",
        "text": "Recently I got my CAR through Driveway and overall experience was nice as well as they take care everything without any follow ups starting from delivery to title.Thank you.",
        "rating": 5
    },
    {
        "title": "Simple and easy!",
        "text": "Simple and easy! The agents were friendly and the communication was great. ",
        "rating": 5
    },
    {
        "title": "Easy peasy!",
        "text": "Easy peasy!Everyone was friendly and helpful.No negatives.",
        "rating": 5
    },
    {
        "title": "Driveway.com had the car picked up in…",
        "text": "Driveway.com had the car picked up in just a few days ago a reasonable price. Thanks!",
        "rating": 5
    },
    {
        "title": "Very good job",
        "text": "Very good job  thank you ",
        "rating": 5
    },
    {
        "title": "Kayleen is the best. ",
        "text": "Kayleen has gone above and beyond to be helpful and informative.  I appreciate the quick responses and will recommend Driveway.com to all my friends and family. THANK YOU KAYLEEN!!!",
        "rating": 5
    },
    {
        "title": "Driveway gave us the best price for our…",
        "text": "Driveway gave us the best price for our used vehicle, and was consistent with outreach and updates. I especially appreciated working with Krystal, Brandon, and Tyler.",
        "rating": 5
    },
    {
        "title": "I am very satisfied with my…",
        "text": "I am very satisfied with my interactions with Sarah, she was very supportive, patience with me, treated me with respect and consideration. Great professional customer service and she makes sure that the customer is satisfied. I can not ask for very service. God bless her and gives her long life for her keeps doing her job. I don't give her 10 stars because they are only 5, but she deserves more than that. Thanks 👍👍 Sarah ",
        "rating": 5
    },
    {
        "title": "No return calls from customer service…",
        "text": "No return calls from customer service charging cable was not with car when delivered took a week to get was supposed to be overnight did not get response until I threatened to give car back. Very poor follow up and experience. I know you won’t do anything with feedback ",
        "rating": 2
    },
    {
        "title": "Great overall experience",
        "text": "Great overall experience,  would highly recommend.  Way better than carvana who try’s to low ball people. Driveway gives you a good price for your vehicle. ",
        "rating": 5
    },
    {
        "title": "Good experience purchasing a quality…",
        "text": "Good experience purchasing a quality vehicle at a fair price, however getting the run around getting the vehicle registered and receiving plates. Driveway says it is the responsibility of the local dealership, the dealership says it is driveways responsibility. Bottom line is six weeks went by with no registration. Update: Driveway successfully registered my vehicle through the local dealership. It took a little longer than it should have, but I have to say overall the experience with Driveway was quick and easy, with a little hiccup involving registration. I would use their purchasing service again in the future, over going to a dealership in person. ",
        "rating": 4
    },
    {
        "title": "Driveway made the process of selling my…",
        "text": "Driveway made the process of selling my car truly painless. I looked around at several sites and most companies low balled the value of my car, driveway paid out really close to what I was expecting. The whole process was super easy, submitted pictures online, uploaded all my documents, signed the paperwork and returned in the deiveway provided envelope, and then a friendly drive way valet collected my car from my property. Thanks to everyone at driveway for making it so easy Raven, Brandon, Tyler and Brian ",
        "rating": 5
    },
    {
        "title": "Great experience with staff",
        "text": "Communication was great throughout the process, a worker named Simon was super helpful and straightforward over text messaging and expertly guided me to the information that I needed. ",
        "rating": 5
    },
    {
        "title": "The transaction was smooth and easy",
        "text": "The transaction was smooth and easy, straightforward and everyone was a great pleasure to deal with, I highly recommend buying or selling a car with driveway.com!",
        "rating": 5
    },
    {
        "title": "$899 documentation fee",
        "text": "Date of experience: September 09, 2024",
        "rating": 1
    },
    {
        "title": "Such a pleasant experience",
        "text": "Such a pleasant experience! Henry was very kind and courteous. He explained every step thoroughly. ",
        "rating": 5
    },
    {
        "title": "Great Staff",
        "text": "Every person we worked with on the Driveway team were helpful and made the entire process stress-free.  We wanted to sell our vehicle and they helped us with every step.  I will recommend them to my friends and family.  ",
        "rating": 5
    },
    {
        "title": "Tradein/Fullypay, experience.",
        "text": "Traded in my vehicle and paid difference in cash, 12 days to receive my car and get it registered. I was very surprised how much improvement Driveway have done since my first purchase 2 years ago. They actually asign a staff member to give you delivery update and registration updates. Dealership that actually had the vehicle was unresponsive and kinda rude when I had few questions about it, and local Dealership that does pre-delivery also wasn't very professional and delayed delivery for 2 days only to give it a wash and absolutely no maintenance (no oil change or brake check). BUT compared to my previous experience with Carvana, Vroom and Carmax. Driveway definitely worth getting 5 stars. Hopefully Lithia dealerships will keep up with Driveway's brilliance.",
        "rating": 5
    },
    {
        "title": "Quick and easy process",
        "text": "Quick and easy process, gave me a good price ",
        "rating": 5
    },
    {
        "title": "Everyone answered my questions and…",
        "text": "Everyone answered my questions and everything went quick and easy.",
        "rating": 5
    },
    {
        "title": "Absolutely no complaints!",
        "text": "Driveway has been an amazing experience thus far. I have had the pleasure of working with many great people on my truck deal, Ryan, Marc, Angelica, Corey, Kasandra, Dane, and others! I had read through the reviews and proceeded anyways. My experience is definitely my own and I can say that I would absolutely be buying again. Thank you everyone at driveway for making my first online vehicle purchase an awesome one!",
        "rating": 5
    },
    {
        "title": "ENTIRE DRIVEWAY STAFF",
        "text": "I personally want to thank, SUNRISE AT COLLIERVILLE, and their team, Leisha, Amanda,Jake, Cheyenne , my delivery driver and Raine also anyone who made it possible for my dream to own a brand new car, a memorable and pleasant experience! I highly recommend them to anyone and everyone, from beginning to end my experience was great! Thank all of  you from the bottom of my heart ❤️ 😊 MY Car was delivered today and it looks way better than pics! Great customer service does STILL EXIST !!",
        "rating": 5
    },
    {
        "title": "I've sold two cars to Driveway.com and",
        "text": "I've sold two cars to Driveway.com and, despite a small hiccup on pickup on the second, it was a great experience. So easy, and I got a more than fair value for my cars.",
        "rating": 5
    },
    {
        "title": "I am happy doing business with yo",
        "text": "Date of experience: September 20, 2024",
        "rating": 5
    },
    {
        "title": "2019 Ford",
        "text": "You're people were awesome you guys did everything you told you would thank you ",
        "rating": 5
    },
    {
        "title": "Good communication",
        "text": "Good communication, instant payment.  Great job.",
        "rating": 5
    },
    {
        "title": "They drug there feet on my original…",
        "text": "They drug there feet on my original offer, wasted my time then lowballed me. ",
        "rating": 1
    },
    {
        "title": "Absolute disaster",
        "text": "Absolute disaster. Do not use Driveway.comUpdate after car secured:I decided now that I have the car and the plates, I'll provide more substance to my 1 star review. My reason for using Driveway.com was that I test drove in person a dozen cars at Honda dealerships near my home. I knew exactly the car that I wanted, but I just couldn’t find it near me. I found it on Driveway and so I took a gamble. Looking back on it now, I should have settled for the purple version of the exact car I wanted at a local dealership. Or just kept looking locally.Simply put, if Driveway was the only place to buy a car, I would walk. Or buy a horse.Initially Securing the Car:I purchased the car with a combination of cash and a loan directly from my credit union. To secure the car, you need to show proof you can pay for it. The $500 deposit does not secure the car for you. My car was on a Honda dealership lot in New Jersey. Driveway reps were pushing me to get them proof I could pay ASAP. I had cash and pre-approval in writing from credit union. That was not enough, they said. The dealership will only hold the car if they have a pic of the actual check from the credit union. The problem is the credit union requires the VIN# and their check is based on that exact car. See the problem? There’s a gap in securing the loan and that car even being available. Someone could have walked on the lot in Jersey and purchased the car I just took a out a loan specifically for. At the time, it was really stressful, and the Driveway reps didn’t see this as a problem and seemed to wish I was financing through them directly (at a much higher interest rate). The car was available after I got the check from the credit union and the car was available, but I think I know why.State of the Car:Nobody was going to buy this car in person at the dealership. The reason? It stinks. It smells like someone chainsmoked four packs a day in the car. This was not disclosed prior to purchase, so please if you buy a car from Driveway ask specifically if the previous owner was a smoker. At one point in this process, because Driveway reps were not providing me information and I believe were stalling in order for my 7 day grace period to return the car was over, I reached out directly to the dealership. I asked the salesman, “Are all the cars on these online companies stinky cars?”He goes, “No, no … we also have new cars.”That’s all I’m going to write about that.Communication Breakdown:Despite the stink, the most frustrating part of the experience was the communication. Throughout this process I communicated (either via text, email, or call because it seemed to depend on their preference not mine) to no less than 13 Driveway employees.Some of these individuals were nice and good at their jobs. Others I could tell had no idea what they were doing. I don’t blame them, I blame Driveway for setting them up to fail. Each department is siloed from one another. Nobody knows what’s going on at any point. And I never knew who to reach out to. Every other day a new Driveway rep was texting me or calling me to introduce themselves. I’d follow up with that person, and I’d be told oh no that’s not the right person.Some of it was entertaining. At one point they told me they were shipping the car from Jersey to Massachusetts to a local dealership and a third party driver would bring it to me. That plan changed because they must have figured out Connecticut is between Jersey and Massachusetts. On a Monday, I got a call directly from a delivery company telling me they’d be there that night. But then no car that night. Nobody reached out to me to tell me it wasn’t coming, I called the # the delivery guy called from and he goes,“We’re not coming tonight. They didn’t tell you?”There was also a funny/scary moment when a Driveway.com rep called me and asked without any prelude, “Are you wiring the money?”“What? I sent you two checks. A certified check and a check from the credit union.”“I don’t think they’re here.”At this point I’m having a heart attack. Few moments later.“Oh. Here they are. We’re good.”There was a lot of this type of thing. My 2022 Civic came with the manual for a 2011 CR-V. Driveway sent me a 2022 Civic manual, despite their rep telling me I could just get the manual online via my phone. I insisted and they sent me a manual.When the manual was on its way to me, a rep told me they were sending me a link to my original TrustPilot review. “If you could update that to 5 stars.”“You want me to change my review from 1 to 5 stars?”They said that would be great. “These reviews are how my performance is determined.”Mind you, this was before my plates or registration were in my possession. They did come, on the day my 30-day temporary plates expired.If they hadn’t asked, I might have changed the original reactionary review from 1 to a 2 or maybe even a 3. But no, I am leaving it at 1 star.",
        "rating": 1
    },
    {
        "title": "I don't think I'll go back to buying locally",
        "text": "I wasn't sure what to expect but the process was smooth and everyone was very helpful. I picked the car I wanted on their website, talked to a few people, got some emails, made a payment, signed some online papers, signed some more papers sent to me in the mail some of which had to be notorized, sent them back, made my final payment, and got the car 5 days later. It arrived in PERFECT condition and is the most beautiful car I have ever owned. Honestly, I much prefer buying a car this way and probably won't go back to buying locally. Their inventory is just too large to ignore, it's all in great condition, and the process is fast and easy. It takes a bit longer than buying locally but for me it's worth it. So yeah, 10/10 for Driveway. ",
        "rating": 5
    },
    {
        "title": "Amazing experience!",
        "text": "This was a super easy process, everyone was very nice and clear on everything and made the whole process very easy to understand and get done from beginning to end.",
        "rating": 5
    },
    {
        "title": "Great service",
        "text": "Great service! Taylor is so trustful, she is so helpful! Really taking care the customers.",
        "rating": 4
    },
    {
        "title": "Just sold my car!",
        "text": "I had a really great experience with driveway! The customer service was top notch. Diana walked me through every step of the way and was consistently available via text , email or by phone to assist with any questions. Once all of the paperwork was completed they scheduled the pick up. An awesome gentleman named Noel Walkes reached out an hour before scheduled pick up time and was able to show up early. Noel conducted the final inspection and the RTP hit my bank account on the spot! He was very professional and had a great disposition. Beginning to end I had a great experience with Driveway and would absolutely recommend using them to sell your car!  ",
        "rating": 5
    },
    {
        "title": "Everything was easy and smooth until it…",
        "text": "Everything was easy and smooth until it was time to register the car. Then all communication stopped and I was told for the first time that I was not able to receive a temp tag for possibly 27 weeks! That was never mentioned in ANY of the conversations prior to receiving the vehicle.",
        "rating": 4
    },
    {
        "title": "This was the easiest car selling…",
        "text": "This was the easiest car selling experience to date. Simple guide for photographing the vehicle, fair value for the sale, easy communication with the service individuals via text and calls. No complaints!",
        "rating": 5
    },
    {
        "title": "Driveway.com went to distance to earn my business and dispel my doubts.",
        "text": "Driveway.com actually expects you to sign ownership of your vehicle over to them, THEN schedule and appointment to have your car picked up, After that, arrangements will be made for funds to be transferred, either immediately AFTER you have relinquished your vehicle or in some cases, 3-5 business days later. I'm ASTOUNDED that ANYONE would agree to such terms. At that point, if Driveway.com finds or INVENTS fault or changes their mind, they can pay whatever they'd like, and seller would have to resort to litigation to get redress? They aren't kidding when they say possession is 9/10s of the law. I told them to kick rocks, think you should too.UPDATE:After the initial review (above) I was contacted by their head of operations. He confirmed the policies, but assured me that he could verify that my bank participated in their Immediate Payment system, which in fact they did. Still wasn't thrilled about having to sign and ship documents prior to getting funds, but agreed to try.  But turns out it went like clock work. Dealer rep showed up on schedule to pick up the car, and when I asked about funds transfer, he said he had no idea since he wasn't with Driveway So I told him no go until I contact Driveway, which I did. The rep there spoke to the dealer's driver to confirm pickup, and IMMEDIATELY initiated payment. The funds hit my account before the vehicle left my driveway (no pun intended). Driveway went the extra mile to make the deal, and earned my trust. Can't speak to buying, but selling to them turned out to be easy and reliable, and they made BY FAR the most reasonable offer. I would recommend.",
        "rating": 5
    },
    {
        "title": "Great experience ",
        "text": "Great experience . honest and fair offer and smooth process from offer to the car being picked up and getting paid ",
        "rating": 5
    },
    {
        "title": "Great experience and the company lived…",
        "text": "Great experience and the company lived up to what they promised. In addition they made the highest offer for my vehicle. ",
        "rating": 5
    },
    {
        "title": "I was told different thing by different…",
        "text": "I was told different thing by different people.  I was laughed at when I wasn't understanding the process. The last lady I talked with was amazing so thanks to her I didn't back out.",
        "rating": 2
    },
    {
        "title": "GreatCustomer service was awesome",
        "text": "Customer service was awesome. Very helpful and  very nice and patient with working with us. ",
        "rating": 5
    },
    {
        "title": "Save yourself some grief, don't buy from Driveway",
        "text": "The vehicle I purchased was shipped in from another city. I bought this vehicle as I am starting a business and needed it asap. When it arrived to a local dealership, they pointed out some body damage that was not discernable in the original pictures. When I made this known to Driveway, they simply stated that as I agreed to the vehicle and the pictures they were unwilling to assist in covering cost of repairs. I did not have the time to start the search process again, so I kept the vehicle and paid for the repairs out of pocket. Driveway made not one inkling of an attempt to offer any sort of \"good faith\" effort. They could not even be bothered enough to make a 5 minute phone call to me, they simply continued to send emails with no true connection to their customer. I perceived the entire experience as \"we got one over on him and he is stuck\". I will need to purchase four more vehicles for my business in the next two years. You can be damned sure none of them will be purchased through driveway as they have a lack of transparency and poor business integrity. That being said, my agent Tamie, was a 5 star gem. I truly wish the people above her understood customer service like she does. Buyer beware. ",
        "rating": 1
    },
    {
        "title": "If I could give one star I would",
        "text": "If I could give one star I would, worst company I’ve ever dealt with from start to finish. Even threatened to keep my money if I canceled the deal. Screenshots of conversations were taken and given to the company but they didn’t care so bbb complaint was made. Stay away from this company if you value your time and money.",
        "rating": 1
    },
    {
        "title": "Would sell th driveway again",
        "text": "Was skeptical of selling on line but there were 1100 dollers above carmax and 100 dollers below carvana so we went with driveway. Every one along the way was very helpful and was willing to handle every question we had. The only negative I can see is the process took 13 days and the driver came from New York. I live I  illinois.",
        "rating": 4
    },
    {
        "title": "Driveway Has A Very Nice Customer Service ",
        "text": "Driveway has a nice customer service in every department. In person Kasandra in the post-delivery customer satisfaction dep, even though I forgot these guys' departments namely Ken, Jibril, and Ryan they are also cool and very good at their jobs.. Driveway is blessed to have these guys on their team.",
        "rating": 5
    },
    {
        "title": "This a nightmare my car need a whol",
        "text": "This is a nightmare. My car needs a whole new motor. I've only had it for 6 months. Please do not get your car from this place. They do not care at all about their customers. I've been reaching out to them since I first got the car, and they've only given me the runaround. This is so stressful.",
        "rating": 1
    },
    {
        "title": "The quote promised was the price I…",
        "text": "The quote promised was the price I received after showing my pictures.  signing over my title before pickup and being paid made me a little on edge but the process went easy and great.  ",
        "rating": 5
    },
    {
        "title": "Rocky start but overall good company.",
        "text": "We purchased a 4 runner for my wife. The process, paperwork and delivery of everything was very quick and prompt, very nice to see.  The issue came when the car was delivered.  There was damage to the car that had not been disclosed, we went above and beyond and went and got a repair estimate. Cost was just shy of 4,000. After some back and fourth Driveway is going to pay out a very large portion and I'm content with the outcome. My wife gets her dream car and I have had an overall good experience with driveway and would use them again.",
        "rating": 3
    },
    {
        "title": "Quick and simple process when they came…",
        "text": "Quick and simple process when they came to pick it up! Tyler was very helpful.",
        "rating": 5
    },
    {
        "title": "Smooth selling experience",
        "text": "Selling to Driveway was a very smooth and easy process. They were responsive and timely and guided me to through every step of the process. Paperwork was straightforward. Received the payment within an hour of pickup. No experience buying a vehicle from Driveway, so can't speak to that, but would definitely use them again in the future should I need to sell another vehicle. ",
        "rating": 5
    },
    {
        "title": "Slightly better than a dealership",
        "text": "UPDATE BELOW The buying side was easy. Communication was good at first. Taxes were wrong. They did tell me I would not receive a temporary tag due to NC rules, but that if I received a ticket they would take care of it, but then sent me paperwork that said they were not responsible. Typical car sales talk that I was trying to avoid. But overall, it has been smooth. Transport is a 1 star. Transport never called me for arrangements. I received a text 330pm the day before saying Driver will be there at 8am tomorrow. Umm, I work. So on delivery they did this. I complained, so on pick up of my vehicle a week later, they did the EXACT same thing. Both times I had to scramble to take care of it which was not convenient as I was out of town for work. I told driveway ahead of time and they assured me Transport would call in advanced. Also the car was delivered dirty inside and less than half tank gas. I called dealership directly and complained. Supposedly sending me a check for $150. I have not seen it yet. Patrick a customer service rep did reach out and sent me tracking for the check which I did receive and he was able to get a temp tag for me. So not a terrible experience, just know it will take longer than you'd expect. ",
        "rating": 4
    },
    {
        "title": "If communication is important, dont sell your car to Driveway",
        "text": "Overall the starting experience was fine. The first person I spoke with via text/call was very helpful. He did give me timelines that were not accurate, but not a big deal. Every couple days they pass you off to somebody else without warning. Once you get past talking to the first person in the process the communication deteriorates. It goes from instant responses to a day later and eventually you get no replies. I wont go through this process with the Lithia dealership group again. ",
        "rating": 2
    },
    {
        "title": "Good at Start, Need to Follow Through",
        "text": "Things started out well, with the team responding quickly and efficiently to my questions about the vehicle.  Once I took possession of the vehicle for the 7-day trial period, they did not adequately respond to my information requests.  Also, there was a significant blemish on the vehicle that I felt should have been hilited in the photos, similar to what I have seen other online car retailers post.  In the end, I got a great vehicle at a really good price.  Just wish the customer follow up would have been solid from start to finish.Amended.  I initially rated Driveway 3 stars, but have amended it to 4 stars based on the follow up care I got after I submitted my review.",
        "rating": 4
    },
    {
        "title": "Easy lease buy out ",
        "text": "Easy communication throughout the whole process of selling my car. They did a lease buyout. Very smooth and everything was completed quickly. ",
        "rating": 5
    },
    {
        "title": "Waste of Time and $$",
        "text": "I liked the car, but found an engine leak. I had the car inspected immedaiately upon arrival. Initially ghe warrenty department was very helpful. Saying it was no problem, as long as I paid for the diagnostic up front, they would reimburse me and pay for the repair. When they were unable to find the source of the leak with the initial diagnostic and recommended taking apart the transmition to find it (labor cost of $1100) suddenly the car was and older car (2020) and they weren't certain if the labor would be covered, even if they did find a faulty part and had it repaired. I feel like they would have used any tiny excuse to wiggle out of the return. I'm glad it was within the 7 days and I didnt drive it, so it was below 400 miles. They also advertised the vehicle without a remote start. It was the main reason I picked this car. Their remedy was $500 towards the install of a remote start. Turns out if remote start doesn't come with the car, it's not something that can be installed later. It was within the 7-day time frame, so I opted to return the vehicle. I can't get my money back until they decide to pick up the car, which they also don't want me to drive in the meantime. So now I'm out the delivery fee of $1600 or so. It took over 2 weeks to get the vehicle. A week dealing with the diagnoses, and now they are saying 12-15 days for them to pick it up. I will avidly be recommending anyone steer clear of any online car buying experience. ",
        "rating": 2
    },
    {
        "title": "Cheyenne at driveway is dope",
        "text": "Date of experience: September 17, 2024",
        "rating": 5
    },
    {
        "title": "Fast and easy.",
        "text": "Fast and easy.Great experience, zero complaints. Thanks.",
        "rating": 5
    },
    {
        "title": "The vehicle offer was really good.",
        "text": "The vehicle offer was really competitive. I a great offer for my Tesla model Y Performance. The paperwork process took a long time, almost two weeks. The people who picked up my vehicle were nice and very helpful. Overall it was a good experience, they just need to work on their paperwork process time.",
        "rating": 5
    },
    {
        "title": "Excellent ",
        "text": "Driveway always make sure their customer's is satisfied with what they purchased ",
        "rating": 5
    },
    {
        "title": "This was the best way to sell my car",
        "text": "This was the best way to sell my car!  They were great in all aspects of offer, paperwork and communication.   I highly recommend and already have! ",
        "rating": 5
    },
    {
        "title": "I had a great experience in selling my…",
        "text": "I had a great experience in selling my car to Driveway. They were very professional and helpful and always available to answer any questions I had throughout the process. I would highly recommend Driveway to anyone who’s looking to sell or trade their car. ",
        "rating": 5
    },
    {
        "title": "Lack of follow up and communication",
        "text": "Lack of follow up and communication. I am still waiting to hear back from a representative on a serious issue but no one has replied to my emails or messages in the last 5 days. ",
        "rating": 3
    },
    {
        "title": "Train the staff better",
        "text": "Train the staff better, everyone  was saying  different info. And only 1 person  call back out of the 10 person  I spoke to",
        "rating": 2
    },
    {
        "title": "Easy process in car buying",
        "text": "Easy process in car buying. They stayed in contact throughout the process and helped with any questions.",
        "rating": 5
    },
    {
        "title": "Great Experience ",
        "text": "The entire process was made so convenient. I really appreciated how often I was updated with every detail of the delivery process. Tim and Dillion delivered my new vehicle today and were so patient to answer all of my questions and encouraged me to drive it around my neighborhood before they left. I will definitely recommend Driveway to anyone I know who is looking to purchase a new vehicle.",
        "rating": 5
    },
    {
        "title": "Great experience",
        "text": "Great experience, made it easy!",
        "rating": 5
    },
    {
        "title": "Kaila's Review",
        "text": "I sold a vehicle through Driveway. The entire process was really quick & easy. A member of Driveway customer care is always available to answer any questions & they always responded to my emails within 24 hours. Once the vehicle was picked up, the money was in my account the very next day. The 2 guys who came for the pickup were friendly & very nice to work with. I'm very happy with my decision to use Driveway to sell my vehicle & I would use them again.",
        "rating": 5
    },
    {
        "title": "The process of selling Driveway my car…",
        "text": "The process of selling Driveway my car was a positive one. The people I had a chance to speak with were always courteous and concise. The Driveway team that picked up my car aldo did a great job. Thank you! ",
        "rating": 5
    },
    {
        "title": "The initial discussion through signing…",
        "text": "The initial discussion through signing paperwork was fine.    Then you all told me a trucking company would call to make an appointment to pick up truck and all hell broke loose.   I got a call while I was teaching and could t answer phone so trucking company said \"to bad\".  I was in the bathroom two days later when they called then wouldn't answer or return my call.  Then ai was teaching again and couldn't get call so again wouldn't take a return call.  I finally had to leave my cell phone home (thankfully my daughter moved back home) so she could be there to get call.  I was told by trucking company the drivers call when they are about 30 minutes away.   That is not making an appointment and now is it feasible for a working person.     I finally got an email the truck company would be there by 8:30 on A Friday morning.     He showed up at 630ish when we were heading out of the house for dinner.    No calls or updates on him.  I also noticed I received my money but the bank hadn't.  When I called you all to find out the guy I spoke to was an ass and sounded like he was reading a script.   I called back after talking to my bank and got a different person and she was extremely helpful   So.  I am not pleased with the overall service.  ",
        "rating": 2
    },
    {
        "title": "I received a vehicle from driveway when…",
        "text": "I received a vehicle from driveway when i received the vehicle it had a few problems such as False advertisement of a remote to start, message on the dashboard also front and back bumper had damages on it I reported this immediately I was recommended a dealership I took it there And I been waiting for an update and I asked them for a rental car they have me one for 3 days but they been having my car for a week now still don’t have an update but I had a time limit on the rental car I been missing a few days off work also had to pause my daily life because I don’t have any vehicle they are terrible with keeping you updated. they will keep you updated in tell you pay then updates will become less and less",
        "rating": 1
    },
    {
        "title": "I put my deposit down on a 2019 gmc…",
        "text": "I put my deposit down on a 2019 gmc terrain on 6/21 and by 6/28 I received paperwork to fill out and return, I received the car by 7/05 delivered to Arkansas which I purchased the car from Lithia Chevrolet of Redding which is in  California of course my main concern when I got the vehicle was where are the tags and registration or a temp tag, I had to reach out to driveway myself instead of someone already telling me that the tags can take up to 4-6 weeks to come and because I am an Arkansas resident I could not get temp tags of course I drove the car anyways luckily I didn’t get any tickets and the tags came earlier than I thought it took about 2 weeks for them to get my tags and registration over nighted to me after delivery I had a small problem with the battery which they said they couldn't cover it but I just went ahead and just bought a new one which put me behind from paying my first car note but overall my experience was scary at first because it was my first time purchasing a car online and out of state at that but driveway came through for me I will be making another purchase in the future I would like to thank Michaela, Kris, and Lidia from the post delivery department for all their help thanks!",
        "rating": 4
    },
    {
        "title": "Don’t do it!!!",
        "text": "Took four+weeks to get the title. Still waiting… can’t drive the car until we get the title from California  to North Carolina. 7 day guarantee is useless if you can’t drive the car!!! No warnings or updates and minimal communication after our first offer to buy ",
        "rating": 1
    },
    {
        "title": "Feedback: Good + Improvements",
        "text": "What was done well:Quick response when I first submitted my request to purchaseNice to speak to humans!At first, nice to know I have a case agent (see improvements below)Customer service agents always pleasantAltogether a good experience, bought 3 other cars from Carvana before this one.Opportunities for Improvement:Upfront, explain that customers will be talking to first agent, then contracting dept, then logisticsI was contacted by more than one agent in one dept sometimes, seems one agent doesn't stay on the case.Seems Logistics team's notes did not always sync with my instructions - I was out of state and could not receive the car until I returned, but agent tried to get me to offer options to leave keys somewhere, without me being present. Finally, I got all on the same page.",
        "rating": 4
    },
    {
        "title": "had an excellent experience selling my…",
        "text": "had an excellent experience selling my car with Driveway. From start to finish, the process was smooth and straightforward. Their communication was top-notch, keeping me informed every step of the way. The team was professional, efficient, and made the entire transaction hassle-free. I highly recommend Driveway to anyone looking to sell or buy their car. Five stars!”",
        "rating": 5
    },
    {
        "title": "I had a great experience",
        "text": "I had a great experience, The staff was top notch explaining things I didn't understand as a first time buyer! And the process was quick and easy everything was handled within a timely manner, I had my new vehicle within 2 weeks, and I just overall had a great experience! Will definitely use driveway for my next vehicle purchase! And I highly recommend everyone else do the same! ",
        "rating": 5
    },
    {
        "title": "Easy and fast",
        "text": "Date of experience: September 13, 2024",
        "rating": 5
    },
    {
        "title": "So I have to brag on them because I…",
        "text": "So I have to brag on them because I honestly didn’t think I was going to get a car I had a low credit score not even 600 and 2 open car loans  and they got me approved in secs now I have a 2023 bmv",
        "rating": 5
    },
    {
        "title": "Driveway",
        "text": "Driveway, what a great concept!   Lidia was terrific, responsive, and efficient!  She helped make my Ariya sale transaction smooth.  I like that Lidia's texts are very detailed-oriented providing all the info I need. Thank you for a job well done! 😊",
        "rating": 5
    },
    {
        "title": "Great selling experience",
        "text": "Everyone I dealt with was exceptional in the selling of my vehicle.  I had a unique situation and everyone from from Audrey to Tyler made it possible.   I would recommend Driveway for selling a vehicle.   ",
        "rating": 5
    },
    {
        "title": "I was hesitant at first dealing with an…",
        "text": "I was hesitant at first dealing with an online buyer. I Received a way better offer on my vehicle than other online buyers and dealerships were offering. Everyone involved communicated with me and answered all of my questions,except for one person on a weekend. Other than that my experience was just fine ",
        "rating": 5
    },
    {
        "title": "Excellent service",
        "text": "Excellent service! I was skeptical at first, but everyone was so kind and helpful. They gave me a good price also. I want to say big thank you to Tyler and Kiera. They really went above & beyond! I am so happy!",
        "rating": 5
    },
    {
        "title": "During transactions like these",
        "text": "During transactions like these, maintaining communications and constant updates is the key. Driveway accomplished that and made the experience very pleasant",
        "rating": 5
    },
    {
        "title": "Everyone I spoke with was helpful",
        "text": "Everyone I spoke with was helpful, knowledgeable and very responsive I could not be more happy with my experience!",
        "rating": 5
    },
    {
        "title": "Amazing service …",
        "text": "Very easy and friendly staff I highly recommended them amazing people from beginning to end ",
        "rating": 5
    },
    {
        "title": "The process was seamless",
        "text": "The process was seamless. It's the first time making a major purchase like this basically sight unseen. Being able to look and compare prices without someone pressuring you is awesome. I believe I got the best price for a new vehicle possible. The only complaint I had was despite repeated requests for  pictures of the flaws on the vehicle, I never received any and found that the previous driver had a dog that scratched the paint on the rear drivers side door and little effort was made to remove the hair and stains it left in the inside. Otherwise, I am satisfied with the process, thanks Kassandra and Jessica. ",
        "rating": 4
    },
    {
        "title": "Just ask for Patrik",
        "text": "I was truly having a bad morning, then called back to drive way and got the most amazing customer service rep (Patrik) he did not give me the runaround or ignore what the real issue was, he immediately jumped in and said not to worry and he did the dam thing, great customer service support I have ever encountered. Thank you Patrik,  he deserves a raise, he is the true call of someone that loves what they do. ",
        "rating": 5
    },
    {
        "title": "What a great experience",
        "text": "What a great experience.  They gave me a fair price and made the entire selling experience easy!  Tim, Rich and Ruben when the individuals who came out to pickup my truck.  Those three guys are super nice!  Payment was instant to my bank when they picked up the truck.  Highly recommend their service when selling your vehicle!",
        "rating": 5
    },
    {
        "title": "This is an update to a previous review",
        "text": "This is an update to a previous review. Ryan T. Was our go-to guy for the purchase. He is awesome! This was a first car purchase for our son who needs to follow step by step what is needed. Their process allows that. So much better than sitting in front of a finance person who shoves papers and a whole lot of double talk at you. Our issue was NOT with Driveway.com but with the dealership (of course). The dealership paperwork did not match the proposal we signed with Driveway.com and we didn't realize it until later in the day. Ryan went above and beyond his job responsibilities to work with contracts and the dealership to get this right. We did get a refund of the difference from the dealership. Patrik from Driveway reached out to us during this time based on our initial review and between him and Ryan they provided stellar customer service. Thank goodness because the dealership was not helpful nor responsive. I would definitely use Driveway.com again just to avoid dealing with a dealership ever again! Not much has changed with the dealership business model since I bought my first car 40 years ago! ",
        "rating": 5
    },
    {
        "title": "Seamless straight forward…",
        "text": "Seamless straight forward transaction..love the car. Customer service was goodJust a note: If your from NY buying a car check state regulations as states like CA does not provide a registration when you take delivery of your vehicle. I was stranded for 7 days without a vehicle to drive meanwhile I had a perfectly good vehicle sitting in my driveway! No registration! Couldn't move the vehicle!Other than that hiccup everything else went well...Thank you Driveway",
        "rating": 4
    },
    {
        "title": "car buying made easy",
        "text": "car buying made easy ",
        "rating": 5
    },
    {
        "title": "Transaction was easy",
        "text": "Transaction was easy, communication was consistent and clear.",
        "rating": 4
    },
    {
        "title": "Great communication",
        "text": "Great communication.  Every part went smooth even though I asked a million questions and had to work around my crazy schedule ",
        "rating": 5
    },
    {
        "title": "Nice customer service...but the process…",
        "text": "Nice customer service...but the process is long..And the car we got have things wrong with it and it's not listed...the inside of the car is mess up...",
        "rating": 3
    },
    {
        "title": "Got a good offer.",
        "text": "Date of experience: September 03, 2024",
        "rating": 5
    },
    {
        "title": "Scary internet",
        "text": "I have never done anything totally via the internet so it was a little scary but they reassured me and everything went well.",
        "rating": 5
    },
    {
        "title": "Driveway was very easy to work with in…",
        "text": "Driveway was very easy to work with in selling my car. All I had to do was sign some electronic and hard copy documents. Didn’t have to go anywhere. Would use again. ",
        "rating": 4
    },
    {
        "title": "Overall good, despite a some duds on my \"team\"",
        "text": "Most of the people at driveway were great, but my \"main point of contact\" Trinity stopped  returning any  calls or messages about two weeks ago. Same with the person in charge of my paperwork, Maria Johnson, I sent her 10 emails and got one reply, and then none despite me begging her for updates. I honestly started to wonder if these people were in some sort of accident? The amount of people who text you from different numbers can sometimes be confusing.However, if you have questions, the folks at the main number are always extremely happy to help, and very nice, helpful and capable. Despite those two people on my \"team\", the rest of the people on my team, especially the delivery coordinator Noemi, was wonderful, and so helpful. The car arrived yesterday, and is great! It took awhile from buying the car to get it, but so far seems to be worth the wait! It's just as described and drives great. Taking it to a mechanic today before the 7-day return window closes, but honestly it's  great! I did receive a concerning letter from my unsurance about the VIN being incorrect, and someone did reach out to attempt to solve this. Hopefully all goes smooth. ",
        "rating": 4
    },
    {
        "title": "good overall - some minor issues but quickly resolved. ",
        "text": "Good overall. Communication during the delivery process was not perfect but the team was quick to apologize and answer any questions I had. The car was delivered in a reasonable time, it was just the communication leading up to it that was not great. After receiving the car my mechanic discovered an issue that ended up costing a bit more than I expected, but Driveway was quick to respond to it and reimburse me, and that process was awesome. Overall a great experience and I would buy from Driveway again. ",
        "rating": 5
    },
    {
        "title": "This is the Future of Vehicle Shopping...",
        "text": "Everything about my experience was 100% positive.  From the stress of not knowing how the process of purchasing a vehicle online to all the paperwork and the elements of the unknown, it was all eased with the team that helped me obtain my new vehicle.  I have never purchased a vehicle from a dealership without feeling like I overpaid or was misled to purchase unnecessary add ons.  The team even worked through their breaks to make sure they got me the best financing options possible and kept an open line of communication the entire way.  I will never buy a car from a dealership again, and I will recommend Driveway to everyone who mentions that they may be in the market for a new vehicle.  They saved me precious time and money and I couldn't have imagined it would be such a smooth experience.",
        "rating": 5
    },
    {
        "title": "They helped me the to get the…",
        "text": "They helped me the to get the assistance I needed. Thank you",
        "rating": 5
    },
    {
        "title": "Great team work",
        "text": "Great team work ",
        "rating": 5
    },
    {
        "title": "Great experience! Best price!",
        "text": "I checked all available online options for selling my car because I kept getting low-balled by dealerships for using it as a trade in. Driveway was the best and most fair deal for me. The process was smooth and the staff was always pleasant to deal with. I definitely recommend them especially if the price is right. I was also paid promptly. Would always consider them again in the future.",
        "rating": 5
    },
    {
        "title": "The process took longer and was more of…",
        "text": "The process took longer and was more of a pain in the butt than I expected it to be. The process involved getting text messages from 5 or 6 different people at different phone numbers which created a lot of confusion. Overall, I would definitely prefer just dealing with a dealership next time.",
        "rating": 3
    },
    {
        "title": "Process was pretty slow and cumbersome…",
        "text": "Process was pretty slow and cumbersome at times and could be streamlined. Communication wasn’t as smooth as it should have been. Eventually everything worked out well . ",
        "rating": 4
    },
    {
        "title": "Transparency",
        "text": "Transparency, and straightforward process. ",
        "rating": 5
    },
    {
        "title": "Great experience happy with my 2022…",
        "text": "Great experience happy with my 2022 dodge Durango",
        "rating": 5
    },
    {
        "title": "Process was smooth",
        "text": "Offer was fair. Process is simple.  Everything is explained and happens as it is described.  Phone support is good.  ",
        "rating": 5
    },
    {
        "title": "It was a great smooth experience short…",
        "text": "It was a great smooth experience short wait no problems",
        "rating": 5
    },
    {
        "title": "It was easy and quick",
        "text": "It was easy and quick ",
        "rating": 5
    },
    {
        "title": "Buying the vehicle was a smooth and…",
        "text": "Buying the vehicle was a smooth and easy experience.  The only negative aspects were that the vehicle was equipped with only 1 key and no charging cable.  On a vehicle with less than 3,000 miles ",
        "rating": 4
    },
    {
        "title": "Easy fast done",
        "text": "Date of experience: August 31, 2024",
        "rating": 5
    },
    {
        "title": "Worst experience with driveway..bought…",
        "text": "Worst experience with driveway..bought a car with them out of state and they could not get me a temporary tag..had to wait and let the car sit in the drive way for about three to four weeks before I got my actual tags even though I had only one week to test drive it and secondly I did a trade in with my Hyundai Tucson and had 2000$ left to be paid off on it and they supposed to pay the 2000$ and up till now over a month now and they still haven’t paid that 2000$ off my trade in SUV..I have to be paying two car notes at this time even though I own only one vehicle and don’t own the SUV anymore..I still have to pay it off to prevent my credit from messing up…driveway is the worst car dealership I have dealt with with and I don’t recommend them to anyone..worst",
        "rating": 1
    },
    {
        "title": "2021 Nissan Altima Platinum ",
        "text": "Great communication and reliable information. Car was even better in person than I was expecting",
        "rating": 5
    },
    {
        "title": "Quick and clear process",
        "text": "Quick and clear process, best offer out of all locations I've tried in south Florida. Will recommend and use them again.",
        "rating": 5
    },
    {
        "title": "Efficient Transaction",
        "text": "Quick, efficient, helpful",
        "rating": 5
    },
    {
        "title": "Communication and scheduling ",
        "text": "I loved always having a contact. Texting was very convenient. It would have helped to have a list of steps and the anticipated length of time each would take along with scheduling options so that I didn't feel pressured to drop everything every time I received a call.",
        "rating": 4
    },
    {
        "title": "Once you go with driveway you will never go back ",
        "text": "Leave me most for my vehicle ",
        "rating": 5
    },
    {
        "title": "Communicated a little too well and knew…",
        "text": "Communicated a little too well and knew the process every step of the way. ",
        "rating": 5
    },
    {
        "title": "Every one was very professional",
        "text": "Every one was very professional.  They explained everything in great detail.  I would recommend Driveway to others.  ",
        "rating": 5
    },
    {
        "title": "Best car buying experience ever",
        "text": "I usually don't write reviews, but I've been so impressed with Driveway that I wanted to share my experience. From beginning to end, they have been fantastic to work with. Each member of the team that I communicated with was responsive and professional. And I do mean team. From sales to administration to vehicle delivery, everyone was top notch. Even now, after the sale is done, Driveway has impressed me with their followup no matter how small my concern may be. Definitely a great company to work with and one of the best car buying experiences I've ever had.",
        "rating": 5
    },
    {
        "title": "Great experience!!!!!",
        "text": "Everything went smoothly and everyone was super helpful",
        "rating": 5
    },
    {
        "title": "The car is wonderful, but…( +update*)",
        "text": "The car is wonderful, I love it. And it got here pretty quickly! It was a lot more scuffed up than I anticipated, but I plan on getting my own paint repair kit. That’s where the positive part of my review ends. Everything else was awful… The customer service was garbage. My car didn’t get cleaned as promised, no one responded to my emails within the 7 day/400 mile period, so good thing I didn’t want to return my vehicle. They forgot paperwork and I kept having to overnight things back and forth. Rude phone call with one woman. Others ignored my calls, emails and texts. Gave up trying to have the busted key fob replaced. Once phone call went on 10 minutes before the guy realized he was looking at the wrong profile and wasn’t talking about my car at all. It felt like no one wanted to do their individual jobs, dumping me on the next person again and again. Maybe they’re overwhelmed with business or short staffed… I’m still waiting on my plates/registration info when my temporary plates expired 2 days ago. (they just finally sent them today, not sure when I’ll receive them) Driveway will sell you a car! You will get the car! Just don’t expect any proper follow up outside of the required seemingly automated email updates. EDIT: update as of 10/3/2024Moved from two stars to four stars. Driveway reached out to me to help rectify the situation. Sarah Wolf was very diligent in meeting my needs. I wish my entire experience went as well as it did with the after care. I am satisfied and would definitely purchase another car through driveway again! Love my Mazda. ",
        "rating": 4
    },
    {
        "title": "I don’t typically take time for these…",
        "text": "I don’t typically take time for these kind of reviews, but I/O driveway a five star review. Their service was Johnny on the Spot and followed through on everything when they said they would. It is exceptional service done the old fashion way. When was the last time somebody answered their phone when you called. The team I worked w coordinated everything make my part effortless and on my phone or computer. The car was delivered spotless, like new and full of gas. I was skeptical about buying a car sight unseen. I wish my insurance company made my life as easy as this team did!",
        "rating": 5
    },
    {
        "title": "No vulture-istic sales people ",
        "text": "No vulture-istic sales people My ‘21 rave hybrid XSE is sitting in my driveway.. delivered on Sept 4th and I am very happy.I could tell that there was a definite pathway from first contact to delivery Customer service was terrific..The BIG hump is that all the great staff that are handling the purchase are nowhere near the car.. I asked if I could speak with the dealership get some more photos.. basically talk to me as the walk around the car… I was told this was not a normal practice but they will enter a request… I got a fast response… I got detailed pictures…I spoke with a person at the dealership Grant who addressed all my concerns So it was Grant who sold me my lovely Rave… yes i would recommend Driveway.  Thank you. Amanda Brian John Cheyenne!",
        "rating": 5
    },
    {
        "title": "For the most part the process was as…",
        "text": "For the most part the process was as expected.  However it was a very lengthy process it weeks to complete purchase and delivery as a posed to purchasing through a local dealership and receiving the car same day.  I wish you could streamline the process and have one point of contact throughout.",
        "rating": 3
    },
    {
        "title": "Worst buying experience in my life",
        "text": "Worst buying experience in my life. First they shipped the car without any paperworks,no Temp tags just a car and a key.I try to explained that my HOA going to tow it away because it have no tags ,their reply was \"Do you have a garage u could park it in\" Then they finally email me a picture of a tag telling me to print it, my reply was no because when it rain its just going to be destroyed. ( Never seen tag on regular printing paper before). It's been 36 days and I'm still waiting for tags so I can go do my state inspections and get my hard tags.",
        "rating": 1
    },
    {
        "title": "Wonderful helpful and such a delight I…",
        "text": "Wonderful helpful and such a delight I would like to personally thank Christina for all her help ",
        "rating": 5
    },
    {
        "title": "Excellent experience",
        "text": "Excellent experience! Quick, fast delivery of my Tesla Model 3. Very friendly staff to communicate with throughout! Thank you.",
        "rating": 5
    },
    {
        "title": "I had a great experience with driveway…",
        "text": "I had a great experience with driveway employees, I was kept updated with all the process when I purchased my truck. The staff were knowledgeable and professional. They guided me every step of the way and answered all of my questions. Sarah helped me with all the information I needed to get a couple things fixed on the truck and processed the paperwork I submitted to her very quickly. She responded to me in a very timely manner all the time. Overall, it was a very good experience!",
        "rating": 5
    },
    {
        "title": "First time car buyer",
        "text": "First time car buyer! Driveway made the process as simple and quick as they could and even answered my ridiculous amount of questions to find me the right vehicle for the right price. Compared to a dealership they didn’t gate keep numbers and information from me just trying to get me to sign on . The customer service is impeccable and I owe much thanks to Alden and Brandon at driveway for making the process much easier to understand and explaining things essential to a first time buyer with no idea of what they’re doing lol. I would send anyone to driveway with the experience I’ve had and if I’m ever in the market again I’ll be sure to come back.",
        "rating": 5
    },
    {
        "title": "Process was very easy selling my car",
        "text": "Process was very easy selling my car.  Customer service was top notch.  The people that picked up my car and finalized  the transaction (Tim and Dillion) were friendly, knowledgeable, and dependable. They kept in touch with me the entire process and arrived right on time. If I could give them more than 5 stars I would.  ",
        "rating": 5
    },
    {
        "title": "Seasoned purchaser, but very apprehensive.",
        "text": "This is my first time ever buying a car online without going to a brick and mortar store to look at it. I was very apprehensive, but it was seemingly easy and very affordable. I was amazed at the vehicle I got. They sold me a vehicle that was well priced and was delivered to my driveway. I would definitely recommend this for anyone looking to purchase a used vehicle.",
        "rating": 5
    },
    {
        "title": "I had a great experience in purchasing…",
        "text": "I had a great experience in purchasing my car 2025 Honda crv with smooth transition. ",
        "rating": 5
    },
    {
        "title": "Best quote and communication ",
        "text": "Best quote! Great communication! Packet that is mailed could have a checklist of what to mail back.  Also, having to wait for the hard copies to be mailed and having to mail back was inconvenient.  Carvana doesn’t do this. ",
        "rating": 4
    },
    {
        "title": "Expensive and zero guarantees",
        "text": "Initially, I called the Toyota dealership where the car was listed for sale.  The dealership said the car just came in and they knew nothing about it, neither the condition of the car nor the price & that the car was not for sale yet.  Since I am an out of state buyer, they directed me to Driveway.com. where the car was in fact listed for sale. Why? if the dealership hadn't checked out the vehicle, & told me that the car had no price yet. Driveway.com apparently lets dealerships list cars whose condition is completely unknown.  You could buy a car that has serious mechanical errors and believe it had been checked out by mechanics. The other reviews here reflect that many customers have exactly this experience, they purchase rusty cars, with dents and dings, that fail within 4-6 months.  Driveway would have added $2400 in shipping costs, taxes, and fees to the price of the car. If I had handled shipping costs, taxes and fees myself, I'd have paid $1000, not $2400 in addition to the price of the car.  What's more, Driveway.com's shipping costs are twice as high as those of other reputable shipping companies. This is basically yet another way in which consumers are being ripped off. ",
        "rating": 1
    },
    {
        "title": "This was the worst experience of my…",
        "text": "This was the worst experience of my life one thing to another to another, just kept going wrong. I started by purchasing a car and after two weeks, it couldn’t be shipped to me because The New Jersey dealership did not have possession of the title, and when they did have possession of it, they had to get it retitled to their dealership which would take over two months by the way.  After this happened, I did end up purchasing another car through  Driveway which was another nightmare they didn’t comp or change the shipping for me. I actually ended up paying over $3000 more to get the new car dealership and shipping fees since it was a little bit further in. Florida- the original car from nj that i cancelled & never actually received - i got a bill in the mail saying that I am almost $800 past due om 18000 loan- even though i verified over and over again that I would not get charged anything for this car . ..on my current car, it was delivered to me with scratches & a dent  on it that i was  not told about.it was not cleaned or detailed at all. - there was dirt and debris inside and out, and a candy stuck on the carpet in the backseat It was delivered almost a week later than the original date and when I tried to talk to the satisfaction team, they offered me $150 and wanted me to sign a form stating that I would release Driveway from any legal liability forever in the future . - contacting Lithia Corporate was a joke. They never even responded back to me even after five phone calls. and on top of that my current car payment I can’t even figure out how to pay since I haven’t even received a bill for this even though they told me that my payment was going to be due 98 which now is in four days -so I know have to try to make all sorts of phone calls today to figure out how I’m supposed to pay this car payment since they didnt send me any information. This was the worst experience of car buying I have ever had and I will never do it again, in addition to all the fines and fees that they have they also charge me $1049 more than what I was told on the price of the car - not the shipping intrest dealership state fees ect the cost of the actual car was different in my delivery packet than what I had initially signed for, but that’s an issue for another day all in all this was horrific. I don’t know how this is even open or why they even exist. I thought they would be better than Carvana since I heard Carvana has title issues, but at this point, I wish I just stuck with them. It was one issue after another after another after another never seemed to be able to fix anything or make it any better. yes, I did finally end up with a car, but it took a month and a half during which time I had to pay for insurance since day one because that’s their policy to get a car. Is that right after you pick the car you need to get insurance immediately after you place your deposit before they will go sny further. Personally, I wish I’d read a review like this because it would have made me stay away, and I hope whoever reads this keeps my warning and stays away",
        "rating": 1
    },
    {
        "title": " Chris, Angie, and Cherie ",
        "text": "Each of the representatives made sure that I received my purchase on time of the  delivery. The hole process Didn’t take long at all and each representative had patience with me concerning the process of delivery.",
        "rating": 5
    },
    {
        "title": "Great experience ",
        "text": "Was going on a family trip soon and explained and asked to hopefully pickup or receive the vehicle the day before our departure. They worked quickly and made the delivery in time and my family had a nice trip with the vehicle. No issues and they even helped get a charger for my tesla from the dealership. Quick and smooth transaction.",
        "rating": 5
    },
    {
        "title": "Vehicle was delivery without a details",
        "text": "Vehicle was delivery without a details. I contact delievery team right away and send proof. Video and pictures clearly shown how dirty the vehicle was and sticker from dealership was still on the vehicle. Was not able to get temp tags from MD like i was told by driveway team. Took almost 30 days until I was able to get my car. I had to go pick it up myself. I offer to do my own tags and title and arrange my own transportation... driveway refused to let me do so and completely drop the ball on everything.",
        "rating": 1
    },
    {
        "title": "Super easy and they took care of…",
        "text": "Super easy and they took care of everything for me",
        "rating": 5
    },
    {
        "title": "Highest offer",
        "text": "Highest offer. Simple process. Great customer service.",
        "rating": 5
    },
    {
        "title": "Great ",
        "text": "Fast experience, definitely will recommend ",
        "rating": 5
    },
    {
        "title": "Great experience",
        "text": "Great experience. Process was simple, straightforward and went as communicated it would. Really neat photo upload as well. Highly recommend. ",
        "rating": 5
    },
    {
        "title": "Excellent and quick response",
        "text": "Excellent and quick response, they did what they promised, fair and clear transparent pricing.",
        "rating": 5
    },
    {
        "title": "No more annoying car salesmen",
        "text": "I spent over four months searching for the perfect vehicle. Not only did the local dealerships not have the exact one I wanted , but their ridiculous high mark ups, fees and packages sent me running. With Driveway, I didn’t have to deal with car salesmen and their constant follow up emails/calls. I didn’t have to put up with them trying to put me in a vehicle of their choice. The entire process was so seamless with Driveway. I will absolutely purchase from them again. ",
        "rating": 5
    },
    {
        "title": "Thanks for my X6",
        "text": "I enjoyed working with your team, everyone was well informed and very helpful. It’s by far the best car buying experience I’ve ever had ",
        "rating": 5
    },
    {
        "title": "First online car purchase",
        "text": "First the car selection and search options was outstanding. The process after selection was very efficient.",
        "rating": 5
    },
    {
        "title": "Nope",
        "text": "I was a second time customer. The first time used driveway.com, I found the company to be somewhat unprofessional, but the advantages of the site made me think that the unprofessionalism was worth a second time, a poor choice on my part. The unprofessionalism at driveway.com had increased exponentially. ",
        "rating": 2
    },
    {
        "title": "AWESOME COMPANY",
        "text": "This company is awesome! They were very helpful with me while I purchased my first car! And everything went very smoothly. 10/10!",
        "rating": 5
    },
    {
        "title": "Quick and friendly",
        "text": "Quick and friendly. The group of people that helped me made the car  buying process easy and efficient. I knew that buying a car online would not be an instant gratification process but they made it as quick as possible and had great communication. ",
        "rating": 5
    },
    {
        "title": "I bought 2 cars from driveway",
        "text": "I bought 2 cars from driveway. The first time it was a peace of cake. The second time they sent me the car early which is a plus but they sent the car with no tags. After calling three days in the row I finally was able to speak with Corey who was able to get me some temp tags from the dealership quicker than expected giving it was right before the holiday weekend ",
        "rating": 5
    },
    {
        "title": "Got a new car at a good price",
        "text": "I had a mostly positive experience with Driveway. I purchased a 2020 Toyota Camry LE at a price that was better than anything I was able to find on similar platforms like Carvana. There was a delay in when the car was supposed to initially be delivered to me but Driveway always kept me updated each step of the way. The car finally arrived and was just as described. This was my first time ever buying a car online and I must say that overall the process was fairly easy. I am very satisfied with my purchase.",
        "rating": 4
    },
    {
        "title": "Don't give up if it gets difficult.",
        "text": "The workers on the other end were patient with me and helped me to complete the transaction. ",
        "rating": 5
    },
    {
        "title": "Very easy process",
        "text": "Very easy process, will definitely buy a car this way again! ",
        "rating": 5
    },
    {
        "title": "Everyone I dealt with made it a smooth…",
        "text": "Everyone I dealt with made it a smooth transaction would definitely give my business to them again! Thank you, Ryan and Cheyenne for all your help with getting me my new jeep:)",
        "rating": 5
    },
    {
        "title": "Driveway was so A Smooth Process easy to use to help us…",
        "text": "Driveway was so easy to use to help us with purchasing a vehicle from out of state. Any questions we had during the process were quickly answered for us. We ended up getting the car of our choice delivered right to our home. We would definitely recommend Driveway to anyone. ",
        "rating": 5
    },
    {
        "title": "Super easy",
        "text": "Super easy! Agents were friendly and helpful. Never setting foot in a car dealership ever again. Good price and I extra love that they do the tag& title and spare me the trip to the DMV. Car showed up exactly as pictured and runs great. I’d definitely recommend Driveway to a friend. ",
        "rating": 5
    },
    {
        "title": "The very quick and easy I was like wow",
        "text": "The very quick and easy I was like wow ",
        "rating": 5
    },
    {
        "title": "Great experience selling our vehicle.",
        "text": "Driveway gave us a fair offer on our automobile (car dealers offers were laughable).  The process was straightforward - we had to snap a few pictures and provide some documents and basic info on the car.  Steps were laid out clearly via email or text.  We were provided a representative for updates and questions. The customer service line was responsive and answered the few questions I had.  The car was picked up within about a week of starting the process",
        "rating": 5
    },
    {
        "title": "It was quick and easy",
        "text": "It was quick and easy. Less than a week from start to finish. ",
        "rating": 5
    },
    {
        "title": "I still have some questions that need…",
        "text": "I still have some questions that need to be answered/addressed.",
        "rating": 4
    },
    {
        "title": "Repeat customer for selling my vehicle",
        "text": "Repeat customer for selling my vehicle.  It is low stress and super easy",
        "rating": 5
    },
    {
        "title": "PLEASE READ THIS REVIEW!! You will not be sorry!!!!",
        "text": "I don't know where to start. Would I recommend this, ABSOLUTELY! The whole process was easy and fun. Also, probably the most important thing is this company is credible!! They never let me down. I don't use the word \"never\" often. But if they said they were going to do it THEY DID! After my purchase, which was EXACTLY as the picture showed, I had a tire that was leaking. They replaced all of them. My contact, Sarah, was top notch. She helped me through the process. She made me feel as if I was Driveway's best customer. She kept me in the loop through the whole process!! GIVE SARAH A RAISE!!! She answered every question and she was very patient. I can be quite the pain in the a..you get the picture.From Broderick,Justin, Naomi and a few others that I'm sorry i can't recall right now and of course Sarah, I would recommend Driveway to everyone. I would even do a commercial testimonial ad for them if they wanted me to!!!This is no bull. I tried Carvana, True car and the others . Driveway I just trusted from the first call!!  From the start of the whole process. Ooooh and the best thing is you actually talk to people!!!! Leave a message someone calls back!!! Anyone who reads this doesn't really know how picky person I am. But the people who DO know me would not believe i wrote this. I could write so much more that was great about them. Thank you all again. Sarah, you are top notch!!! I wish you and Driveway all the best!!",
        "rating": 5
    },
    {
        "title": "Cheyenne was super friendly and was…",
        "text": "Cheyenne was super friendly and was also keeping me up with what was going on with the vehicle I recommended using driveway ",
        "rating": 5
    },
    {
        "title": "Excellent customer service ",
        "text": "Fabulous Customer service. Very quick and efficient process selling my car! Overall fantastic experience!!!",
        "rating": 5
    },
    {
        "title": "Every one was very helpful and polite",
        "text": "Every one was very helpful and polite.  Thank for a great experience ",
        "rating": 5
    },
    {
        "title": "Leisha was the greatest she worked hard…",
        "text": "Leisha was the greatest she worked hard for me and her and her team gave me the best deal I called and talk to her on Wednesday and by Friday I had my car !",
        "rating": 5
    },
    {
        "title": "Amazing company to work with!",
        "text": "The customer service is very responsive, kind and understanding! We've had an excellent experience selling our vehicle to driveway! Would do business with them again for sure!",
        "rating": 5
    },
    {
        "title": "Great service",
        "text": "Great service, always able to talk with a real person if any questions. Quick responses!",
        "rating": 5
    },
    {
        "title": "Fast",
        "text": "Excellent service ",
        "rating": 5
    },
    {
        "title": "Excellent",
        "text": "Excellent professional service",
        "rating": 5
    },
    {
        "title": "I am pretty happy with Driveway ",
        "text": "This was my first time selling my car online. I didn't know what to expect. A Driveway staff reached out with a phone call, while the competition never bother doing. Drive staff did a great job explaining the process and answering all of my questions. The process went smoothly. I am looking forward to doing business with them again. ",
        "rating": 5
    },
    {
        "title": "Excellent all around",
        "text": "Excellent all around ",
        "rating": 5
    },
    {
        "title": "i will sell here again ",
        "text": "agent called me right away - quick & easy about a day later another agent assisted me - quick & easy , sent the paperwork off on friday got it tuesdaysent the paperwork back they received it the next business day available , processed them , took them about a week to get me a driver got a pickup scheduled - driver never showed up , lack of communication on their end , i had to call every few hours just to get an ETA but the agents were nice & i understood it was the drivers fault got a message this morning , a driver reached out to me about 40 mins ago said he could pick it up in 20 mins & he did , payment was initiated 5 mins later (this just happened today (lol)",
        "rating": 4
    },
    {
        "title": "Nice experience for first time online purchase ",
        "text": "Was looking for a used vehicle, happen to see it a nearby dealership. I’ve had no issues going to a dealership or negotiating in person. However, saw that it was also posted in driveway. I reached out to the team at driveway and they explained to me that they’re able to allocate the vehicle since their inventory comes from an actual dealership. Which sells new and used. Being that the vehicle is a used as is vehicle I decided to try it out, knowing I had the flexibility of returning the vehicle if  it wasn’t as expected. I picked up the vehicle once it was verified that it was still available, and made my deposit. Once at the dealership everything was a breeze. Did a pre purchase inspection and everything checked out.Pros- The team agents of driveway are quick to response back to your inquiry.-provide detail information of the vehicle.-Dealer allocated cars.Con-There might be a time zone difference depending what agent you reach out to.",
        "rating": 5
    },
    {
        "title": "They made everything go very smoothly…",
        "text": "They made everything go very smoothly and quick. And when I had a million concerns and questions they were always very quick to respond and clarify anything that I needed!",
        "rating": 5
    },
    {
        "title": "Easy to work with",
        "text": "Easy to work with, customer support was easy to get ahold of, and they answered all my questions in a timely manner. ",
        "rating": 5
    },
    {
        "title": "Driveway Fixed Every Issue!!!",
        "text": "Everything that could go wrong, has gone wrong. This has been the worst car buying experience ever. I was originally told I was approved for a vehicle with a certain downpayment. After sending the deposit I was told I couldn't get the vehicle promised originally. Selected a different car, received that car without any documentation. No temp tag no Bill of sale. I received it 3-4 days later.Received my car and the rear differential is trash and the gas tank door is stuck. Spoke with service department & was told it's under 60 day warranty.Took a week for approval to do repairs! My car has been at the dealership for 2 weeks now & still no update on when the parts will arrived! I’m here to express my appreciation for Driveway. Although, it started off rocky they definitely finished STRONG! Sarah is truly AMAZING! I know now, that Driveway wasn’t the problem. I just needed to speak with the right person! Driveway honored their 60 day warranty and even went above the warranty to assist me for my troubles. I’m truly grateful. I will definitely recommend using Driveway for your car needs! I would like to Thank Sarah & the General Manager AGAIN!!!!!! ",
        "rating": 5
    },
    {
        "title": "I sold my car to driveway",
        "text": "I sold my car to driveway. The process was smooth, everything was explained step by step. Tyler was especially helpful and even answered my questions after the process was completed. Five stars all the way ! ",
        "rating": 5
    },
    {
        "title": "Awesome Agent (Simon) - great experience!!",
        "text": "I had the best experience with driveway. The agent who help me was Simon and was very professional , he gave me all the details upfront which helped me not to mess up the best offer in the industry. Customer service is all you care about. I have dealt with few companies in the past to sell cars but driveway is the best by far. Highly recommended. ",
        "rating": 5
    },
    {
        "title": "Great selling experience ",
        "text": "Was looking to sell my car and shopping around offers. They beat all local offers and all other app offers by a Longshot. The process from first contact to getting paid was seamless. Everything made very easy by their exceptional employees who were in contact with me the whole way. I'd definitely do business with them again. ",
        "rating": 5
    },
    {
        "title": "They honored their warranty",
        "text": "They honored their warranty. They stayed in contact with me during the purchase process. Though, there were some hiccups. 2 cars that I saw and like were listed on their page yet they were already sold. They seem to not update their site as quickly as a product is sold. There was little contact during the warranty process. Overall, it was a good experience.",
        "rating": 5
    },
    {
        "title": "Very nice people , helpful & fast",
        "text": "They were very nice neat, professional made sure everything was in order in a timely manner ",
        "rating": 5
    },
    {
        "title": "I wasn't happy that it took 2 months to…",
        "text": "I wasn't happy that it took 2 months to complete the sale of my vehicle. To many hoops to jump through. I had to spend money that I didn't have, just to sell it. And never got reimbursed. Then screwed me outta $500 from the original sale price agreed upon.",
        "rating": 2
    },
    {
        "title": "Very easy and fast.",
        "text": "Very easy and fast. ",
        "rating": 5
    },
    {
        "title": "Super friendly helpfull staff",
        "text": "Super friendly helpfull staff ",
        "rating": 5
    },
    {
        "title": "Worst experience I have ever had doing…",
        "text": "Worst experience I have ever had doing any kind of transaction with any business anywhere. Save yourself the trouble and go to the dealership.",
        "rating": 1
    },
    {
        "title": "Consistent correspondence and step was…",
        "text": "Consistent correspondence and step was smooth along the way.",
        "rating": 5
    },
    {
        "title": "Good car, poor communication",
        "text": "Process was smooth and car was great, but communication was poor after receipt of car. Don’t know where I was in the process and didn’t get replies to emails regarding car registration status. After posting this review, the team followed up with me and provided status updates each day. I would definitely use Driveway again and each representative was great to deal with. However, there should be a status page with details about next steps, or improved communications. ",
        "rating": 4
    },
    {
        "title": "Quick",
        "text": "Quick, accurate, convenient, great offer on the car ",
        "rating": 5
    },
    {
        "title": "For sure I recommend this company",
        "text": "For sure I recommend this company. When was selling my car I checked  every where all possible offers with famous services  and not famous and Driveway gave my the highest offer and it's not only highest proportion the difference between driveway and with the highest proportion  of all rest companies or services  was significantly big!.  I saw some kind of negative experience to make payment  through  their system ect  so  I did not have it and thinking  might be this company  still young and of course it's could happened on this stage. So  in general  I think  this company has big future.",
        "rating": 5
    },
    {
        "title": "The whole process was so easy",
        "text": "The whole process was so easy! Find a car and then they have a team of people that make it happen. It was fast and with the 7 day money back it made it easier to try it out. ",
        "rating": 4
    },
    {
        "title": "Delivery option is amazing and great…",
        "text": "Delivery option is amazing and great service. I live hours away from all but one brand of dealership and didn't have a trade-in, so having a delivery option was a godsend, and being able to browse online until I found the deal I wanted was also great. Everyone I dealt with at Driveway was courteous and helpful, and overall they've got the system pretty well streamlined. But it was hard to get an overview of the entire process -- I got handed off to a new person at each step and never really had an idea of how long it would take to get my car until we were several steps in. And when we got close to delivery, a crucial step (the transporter calling me before they put the car on their truck for delivery) was skipped and I had to juggle a work trip at the last minute to be available for delivery. I love love love my car and my overall experience was really positive -- without that hiccup and with a better up-front overview of the process, I could easily have given five stars.",
        "rating": 4
    },
    {
        "title": "Simple. The whole purchasing process was…",
        "text": "The whole purchasing process was simple. All staff was super professional and customer focused ",
        "rating": 5
    },
    {
        "title": "The experience was really great",
        "text": "The experience was really great.  Associates were really helpful and they were able to explain and express all of the needed information. I would recommend doing business with this company.",
        "rating": 5
    },
    {
        "title": "Great experience!",
        "text": "No hassle, no nonsense approach! I really enjoyed the process! Will do business again.",
        "rating": 5
    },
    {
        "title": "Horrible experience ",
        "text": "Made the $500 deposit and was told the next morning the vehicle was not available. Picked nearly the exact same CR-V different color, 2022 not 2021, few thousand miles more, and roughly $4000 more. I used outside financing with a much lower interest rate and they took forever to process it. The vehicle arrives with a dent and needing a detail. The entire process took 20 days and I had to beg for updates. It felt like they did not care about me because I did not use the ridiculous financing options they offered. I was surprised the vehicle showed up as it seemed like I was being scammed with the original vehicle disappearing and having to place a larger down payment and having such trouble with my financing. It was just a horrible experience. I had it detailed, haven't had the dent repaired but the CR-V is great. ",
        "rating": 1
    },
    {
        "title": "Driveway is tied to Lithia Motors which…",
        "text": "Driveway is tied to Lithia Motors which should be more streamlined in getting to a point where the paperwork is already done and all the consumer has to do is walk in and go over the paperwork and sign. Was surprised dealership had to transfer over all the info into their system on their end since we had already done this with the Driveway website. It’s supposed to easy but was at the dealership for 3+ hours on a sunday.",
        "rating": 3
    },
    {
        "title": "Driveway are the best ",
        "text": "Everything ",
        "rating": 5
    },
    {
        "title": "My experience was great I will continue…",
        "text": "My experience was great I will continue to shop wit DriveWay from now on . ",
        "rating": 5
    },
    {
        "title": "The whole process was overall pleasant",
        "text": "The whole process was overall pleasant, uncomplicated and very reasonable with regard to the time it took from start to finish.",
        "rating": 4
    },
    {
        "title": "Start to finish the Car soldprocess went great.",
        "text": "Start to finish the process went great.",
        "rating": 5
    },
    {
        "title": "I heard about this website/program on…",
        "text": "I heard about this website/program on instagram as I was scrolling through my feed. I got curious and gave it a shot. In less than 24 hours a very efficient representative named Ndia reached out to me and started the process. I started the process on a Tuesday morning and had my jeep by Friday!!! I had a great experience overall! ",
        "rating": 5
    },
    {
        "title": "Positive experience All of the associates I interacted with…",
        "text": "All of the associates I interacted with were great. Good communication, good service. ",
        "rating": 5
    },
    {
        "title": "Great experience",
        "text": "Great experience! The offer was fair, the process was easy and the payment was instant. I will always use Driveway moving forward.",
        "rating": 5
    },
    {
        "title": "10/10 experience! (Selling)",
        "text": "The most pleasant experience I have had selling a car. I’m so glad I was told about Driveway. Everyone I interacted with was so kind and helpful and really patient with my many questions and inquiries. I was offered quite a bit more than Carvana was offering. Thanks so much! Will definitely use in the future if I am seeking to sell another car. ",
        "rating": 5
    },
    {
        "title": "Jada was Very nice to me",
        "text": "Date of experience: August 21, 2024",
        "rating": 5
    },
    {
        "title": "They were quick and informative and…",
        "text": "They were quick and informative and gave me more money for the car than other sites.",
        "rating": 5
    },
    {
        "title": "They made this very easy and very…",
        "text": "They made this very easy and very professional, and the car was delivered in excellent timing and overall great experience so far",
        "rating": 5
    },
    {
        "title": "Gave me the best price of all the…",
        "text": "Gave me the best price of all the online options. Car condition app is impressive. Process took about 2 weeks but inn the end everything went smoothly. ",
        "rating": 5
    },
    {
        "title": "Above my expectation ",
        "text": "Their team is very helpful. Every staff I contacted with is very polite and professional.  They are available the whole time for questions, either by phone, text or email. The deal was fair and went smoothly.  Above my expectation.",
        "rating": 5
    },
    {
        "title": "I’m dissatisfied with Driveway delay in…",
        "text": "I’m dissatisfied with Driveway delay in paying lien holder.",
        "rating": 3
    },
    {
        "title": "Selling a vehicle (the way it should be)",
        "text": "I was initially a bit hesitant, but selling my car to Driveway turned out to be a simple and straightforward process, exactly as I hoped. Not only was everything smooth, but they also offered me a few thousand dollars more than Carvana, CarMax, and others. Five stars from start to finish!",
        "rating": 5
    },
    {
        "title": "Great experience from start to finish",
        "text": "Everyone involved in the process was extremely helpful. Their estimate was better than all competitors. I’d highly recommend working with them.",
        "rating": 5
    },
    {
        "title": "Challenging experience ",
        "text": "Difficult getting paperwork turned in. Was not kept up to date with ETA of delivery. Waited all day when they gave us a two hour window. Only updated when we  requested update. Feeling like we are finished and then another request for information is made. Radio is non functional and details for car were scarce.",
        "rating": 3
    },
    {
        "title": "Fast",
        "text": "Fast, efficient, courteous",
        "rating": 5
    },
    {
        "title": "The process was easy and everyone was…",
        "text": "The process was easy and everyone was very helpful and friendly.",
        "rating": 5
    },
    {
        "title": "The most important thing was…",
        "text": "The most important thing was communication with the customer. All of your representatives did a great job!Appreciate you!                              August 2024",
        "rating": 5
    },
    {
        "title": "The truck I bought has issues that…",
        "text": "The truck I bought has issues that should have been seen in a pre sale inspection. ",
        "rating": 2
    },
    {
        "title": "Smooth and efficient",
        "text": "Date of experience: August 19, 2024",
        "rating": 5
    },
    {
        "title": "The experience all around wasn’t bad",
        "text": "The experience all around wasn’t bad, but some hiccups. First car I chose I gave a down payment and all but seems Driveway employee did not verify if that car was still available turns out it was not so I had to look for another car, needing 3 pages notarized costed $45 that came out of my pocket, communication during the delivery process was lack luster with not eta provided was always “I will update you” and never did I had to keep checking in. Turn around was a little over 2 weeks when I finally did get the car it was empty gas wise which was disappointing. Being that it was a out of state car now I need a vin verification and a smog done this was never mentioned to me so it’s definitely becoming a long process that isn’t as simple as just online shopping for a car is said to be. But I would still say it was an ok experience ",
        "rating": 4
    },
    {
        "title": "Company communication is terrible",
        "text": "Company communication is terrible. I spent weeks trying to get my registration transferred sending them documents countless times and calling,email and texting. Not once was I told of any issue so I paid to renew my tags at local DMV only to find out month and half later Driveway never transferred tags and got new ones because my husband was on registration of my old vehicle (which Driveway knew) because they had paper work and he signed off on title of my old vehicle. So I paid for 2 plates and now driveway refuses to refund me any money.So I did reach out and even asked for a phone call which I did not receive. Driveway never reached out after hearing from state regarding registration and made the decision on what to do own their own with any input from me the buyer. Once again highlighting the lack of communication and follow up with this company even after I reached out multiple times via phone and email for updates weekly. Even after asking for someone to call me to discuss yesterday and posting review I still have gotten zero follow up. ",
        "rating": 1
    },
    {
        "title": "Good experience",
        "text": "It was a little slow process but overall there was transparency and timeliness. ",
        "rating": 5
    },
    {
        "title": "The service I experienced with…Great Experience ",
        "text": "The service I experienced with Driveway.com was an amazing experience. Thank you to all that played a part in assisting with the sale of my vehicle.",
        "rating": 5
    },
    {
        "title": "Legit",
        "text": "A legit company I went with them because money was instant another company offered more money but 2 to 5 days to get money.",
        "rating": 4
    },
    {
        "title": "I’ve purchased two cars with driveway",
        "text": "**EDIT**I moved the score up one star as I was contacted after my first review by a representative who helped me resolve some communication issues and he stuck with me through the entire process. I am sure buying just one car is a bit easier to keep track of than two. We are very happy with our cars.I’ve purchased two cars with driveway. In the beginning, the customer service was great and everything seemed to go very quickly. Once my check was sent in and the paperwork was signed, communication just seemed to drop. My first car was delivered without warning or notice from the delivery company. Good thing I was there to sign for it. I was told to expect my second car today. After waiting around and two more calls, I find out that it’s delayed three more days. No heads up. All communication is done through text by many different people so following up with one person is difficult. I still have the titling and license plate process to wade through. Other revieeers say that takes a long time.",
        "rating": 4
    },
    {
        "title": "I was very very skeptical to buy online…",
        "text": "I was very very skeptical to buy online BUT we decided to an it was the best decision!! From start to finish easy breezy! They are helpful an make sure you understand everything. Diffentley will buy again! ",
        "rating": 5
    },
    {
        "title": "Car yes! Team no. ",
        "text": "Overall I’m extremely happy with my vehicle! But not the team I had. Poor communication with me. Took longer than the time they told me to get my vehicle. Didn’t disclose any imperfections. ",
        "rating": 2
    },
    {
        "title": "I had such an easy and great experience…",
        "text": "I had such an easy and great experience on my recent purch of my 2023 toyota highlander, thanks to Tamara Teskey! Not only did she guide me from the beginning,  but also checked on me constantly throughout the whole process, from my loan approval to paper work and shipping of my vehicle. I would definitely recommend drive way. Super easy, thanks again Tammy. ",
        "rating": 5
    },
    {
        "title": "This was so easy",
        "text": "This was so easy!  I picked out what I wanted.  A few texts, emails. A couple of calls and a little paper work later and I had my car in my driveway in a couple of weeks from the time I started looking. ",
        "rating": 5
    },
    {
        "title": "Good process just lost me when the…",
        "text": "Good process just lost me when the final deal went down I was kinda lost on when the payment would be submitted and kinda got the run around and couldn't get a true response on where payment was at but someone did get back with me and payment was made. Wasn't a deal breaker but was just a lil concern. ",
        "rating": 4
    },
    {
        "title": "Pretty horrible",
        "text": "Pretty horrible. Horrible communication after the deal is made. I felt like once things were signed I was just put on the back burner and not taken care of when I had questions or concerns ",
        "rating": 1
    },
    {
        "title": "very polite efficient and helpful",
        "text": "Date of experience: August 15, 2024",
        "rating": 5
    },
    {
        "title": "Very professional and trustworthy",
        "text": "Very professional and trustworthy. Every thing went accordingly. Will buy my next car from drive way. ",
        "rating": 5
    },
    {
        "title": "Stay away! ",
        "text": "I would never recommend Driveway.com to anyone. I ordered a car and paid $45k for it. I had asked them to show me damages or pictures so I know if something is defected, and they never did. I had to call the dealership and ask an associate to go and look at the car.Once I got the car I noticed many bumps and scratches that were not mentioned. The car was quite dirty and smelled, with bunch of dog hair still stuck on the roof and in the back. I had to spend time detailing it myself. Also, the backup camera is fuzzy/not clear, and clearly shouldn’t be like that. Overall, I don’t think this is an honest company and I would stay away.",
        "rating": 1
    },
    {
        "title": "Great communication",
        "text": "Great communication ",
        "rating": 5
    },
    {
        "title": "Easy experience",
        "text": "Easy experience, clear communication, best offer and prompt payment.  ",
        "rating": 5
    },
    {
        "title": "This has to be the worst company",
        "text": "This has to be the worst company. They need to learn from those that do online car buying well. I have a nightmare experience. It’s been two months since my car was delivered and I still don’t have title registration and plate. They don’t know what the issue is whenever I call. They also sold me a bad car and said they are not responsible for the issue and the problem is not covered by warranty. My nightmare now is that I have an option to sell the car but I can’t because I don’t have documentation. Buyers beware. Find reputable company that know what they are doing. ",
        "rating": 1
    },
    {
        "title": "The best experience ever…",
        "text": "I can’t even begin to tell you how easy this car buying experience was. From the beginning to the end they walked me through the process! I will never use another dealership or service again. The best! ",
        "rating": 5
    },
    {
        "title": "Not a scam..,.",
        "text": "The whole process was very well orchestrated! Staff was courteous and informative. I would definitely use this company again.",
        "rating": 5
    },
    {
        "title": "Delivery of vehicle acceptable",
        "text": "Date of experience: August 07, 2024",
        "rating": 4
    },
    {
        "title": "Lydia is a champion",
        "text": "Lydia is a champion, she along with the whole driveway team made the car purchase easy.  Lydia helped especially with the difficulty of an out-of-state title change.  Great team!",
        "rating": 5
    },
    {
        "title": "Best offer",
        "text": "Best online offer, most of the communication was through email or text which at first made me a little uncomfortable. Was rest assured once I reached the end of the process and was able call and speak with IIka and Samantha about any questions and concerns I had. Would definitely choose driveway again",
        "rating": 5
    },
    {
        "title": "My only issue with selling the car was…",
        "text": "My only issue with selling the car was the picture app is very sensitive to damage. It picked up on my dirty floor mats and marked interior damage so brought down the pricing. ",
        "rating": 4
    },
    {
        "title": "Very quick and simple process",
        "text": "Very quick and simple process.  There seemed to always be someone available to answer any questions and confirm the next steps in the process.",
        "rating": 5
    },
    {
        "title": "Superb experience ",
        "text": "Sold my Porsche to driveway and the experience was top notch. Their offer was very good, this also eliminated the need to list on facebook and deal with all the endless number of non serious buyers that just waste your time. Communication was superb and the transaction was quick and easy. Will definitely sell/buy with them in the near future. Neil",
        "rating": 5
    },
    {
        "title": "Great experience just had issues with one person",
        "text": "I had a pretty good buying experience. Reserved the cars on a Thursday, signed documents on Friday, and the car was delivered within 10 days  from original reservation. I'm loving the car and its everything that I wanted at a great price. Everyone that I worked with were super helpful and accommodating except for one person. My one negative experience was with W.R. from contracting. He wasn't very professional in his communication in my opinion. He stated that we was going to sign and send a form that same day that  the bank needed but he never did it. I had to call in and someone else , who was extremely helpful, had to fill out the form to preventing delaying the process. Another issue was that he failed to get my plates transferred like I asked. I called about it and someone else was able to explain the situation and we came up with a  solution where I would be reimbursed once I did the transfer at the DMV myself. Overall I had a great experience and would buy and recommend them. I would just say to switch to someone else is W.R. is your contracting guy.  ",
        "rating": 4
    },
    {
        "title": "I was a little nervous because I did…",
        "text": "I was a little nervous because I did not know the company and it is not as out there as the competitors, BUT I received the highest amount for my car. All of the staff I worked with were amazing and everything was easy. The money was transmitted quick and easy and the payoff to my lender. I would definitely use them again.",
        "rating": 5
    },
    {
        "title": "Selling from the East coast",
        "text": "My son sold his car through Driveway and I was skeptical since they weren’t one of the big names like Carmax or carvana. However, I was very pleased with the process and would definitely recommend Driveway when selling a car. Everything they did was very professional.",
        "rating": 5
    },
    {
        "title": "Company absconded with my down payment…",
        "text": "Company absconded with my down payment reservation fee AFTER selling the vehicle they reserved. ",
        "rating": 1
    },
    {
        "title": "They sell cars they don't have",
        "text": "They sell cars they don't have. They are intermediary not a dealership. Collect a lot of personal information. Do not refund deposit, I am still waiting for mine.  ",
        "rating": 1
    },
    {
        "title": "Selling a car made easy",
        "text": "Selling a car made easy. Taylor was awesome to work with. Fair offer and the process online, and overnight packages for signatures was seamless. Overnighted check, plus other options were available for ach and direct deposit. Good job Driveway. ",
        "rating": 5
    },
    {
        "title": "It was a very smooth process",
        "text": "It was a very smooth process. From picking out a car, to having to sign paperwork, to having it delivered. The team I dealt with was very helpful and always there for my questions. I am in love with my new car!",
        "rating": 5
    },
    {
        "title": "Sarah was amazing ",
        "text": "What started off as a bad experience was quickly turned around. Sarah went above and beyond to make sure that I was not inconvenienced in any way. Definitely not something she had to do but took it upon herself to do so. That being said I would definitely recommend Driveway to any potential car buyers. Thanks again Sarah! ",
        "rating": 5
    },
    {
        "title": "Hit the easy button. ",
        "text": "Very smooth process and easy to do, very pleased with the whole process. ",
        "rating": 5
    },
    {
        "title": "It was an easy process selling my…",
        "text": "It was an easy process selling my vehicle to driveway! There was never a point where they made me feel uneasy about the transaction. Pretty quickly and smooth transaction.",
        "rating": 5
    },
    {
        "title": "Monica is a Pro!",
        "text": "Despite the unpleasantness of the subject of my call, (fraud), Monica turned the whole experience around and I actually had a great time working with her.  She made me laugh!   Bonus.  Super great encounter.  Everything got worked out perfectly.   Total professional.",
        "rating": 5
    },
    {
        "title": "The service reps were very friendly and…",
        "text": "The service reps were very friendly and helpful. The contract and other paperwork process was easier and faster to complete than expected. I liked the line of communication throughout the order process up to the delivery of my new vehicle. I always knew what was going on with my order. Even the valet service guys that delivered my car were friendly and professional. All in all, a very positive experience, the best I've ever had buying a new car!",
        "rating": 5
    },
    {
        "title": "Slow payment ",
        "text": "I feel like I got a good price for my car but it took a long time to actually get the payment",
        "rating": 4
    },
    {
        "title": "I got car with cosmetic issue my…",
        "text": "I got car with cosmetic issue my problem was not solved.",
        "rating": 2
    },
    {
        "title": "Honestly, a complete mess and waste of time. Bought truck with bad tranny. ",
        "text": "There was very little communication, I was constantly being handed off to another person, I never knew the current status of my order without asking, and the process took 3 weeks. In the end I had to return the truck because the transmission was bad. ",
        "rating": 2
    },
    {
        "title": "Legit and good communication ",
        "text": "Our biggest concerns, having never really heard of the company was 1. is it legit 2. Will we get paid. And yes, it is legit and we got paid immediately. Tight responsive communication as well.",
        "rating": 5
    },
    {
        "title": "I purchased a used Ford F-150 from…",
        "text": "I was contacted by Sarah at Driveway and she kindly and quickly helped me navigate to what I felt was a fair and amicable result.  In the end, I am a satisfied customer.I purchased a used Ford F-150 from Driveway.  before signing contract I got a carfax report that showed minor damage on passenger side rear qtr.  I got pictures and verified it was acceptable - I asked if there was any other damage and was told NO.  upon delivery of vehicle, there was a dent (through the paint) in passenger front door.  I immediately filed a report and was told to take vehicle to dealer to get estimate which came in at ($1300).   two weeks later Driveway offers me $200 and I say, no thanks I'll return vehicle - they say I missed deadline after dragging their feet for two weeks.  they refuse to fix damage, refuse to pay estimate from their own partner, and refuse to accept return - Shady business practice at best.",
        "rating": 5
    },
    {
        "title": "Easy to work with.",
        "text": "Date of experience: August 05, 2024",
        "rating": 5
    },
    {
        "title": "Top notch services ",
        "text": "I had a great experience with Driveway. The staff is amazing, very friendly and helpful especially Brianna and Yaka. Thank you Brianna for your expertise and Yaka for your superb services. Driveway is an excellent way to find and buy your next car.",
        "rating": 5
    },
    {
        "title": "Simple process",
        "text": "Simple process - awesome customer service.",
        "rating": 5
    },
    {
        "title": "It was very easy,I'm a senior and they…",
        "text": "It was very easy,I'm a senior and they helped me through the hol process on the phone and always returned my phone calls promptly.there was some damage to a Minor on the transport and I feel it will be taken care of.And most of all I really like my car. No regrets    ",
        "rating": 5
    },
    {
        "title": "Fast and efficient ",
        "text": "Helpful team, makes things easy ",
        "rating": 5
    },
    {
        "title": "Stay away!!!",
        "text": "I received the 2021 Hyundai Sonata on July 17th. I have yet to receive my license plates. I had to repeatedly call to get another temp tag after the first one expired. Now the car won’t turn on, took the battery to auto zone and they confirmed it’s a bad battery. I reached out Hyundai since your agent advised that they would handle it but Hyundai told me they do not and batteries are not cover under warranty. Your agent advised me to “tow it” to the dealership. If I would’ve towed it to the dealership it would’ve been such a waste of money and time. I am beyond frustrated. I am now left without transportation until this is resolved, this has been a huge inconvenience. I have had so many issues with driveway. They also blocked me from their facebook since I commented about my experience. ",
        "rating": 1
    },
    {
        "title": "Awful experience ",
        "text": "We originally ordered a car, went through the entire financing approval process, credit pulls and all, and then were told the next day that the car was no longer available. They did nothing to make up for the unnecessary hit to our credit. Rather than going somewhere else and going through a credit approval again we decided just to pick a different car. It took almost 3 weeks for delivery, during which time driveway informed us that it was having work done on it. They never told us what was wrong. Once we received the car it quickly through a check engine light. We contacted driveway and they said they would reimburse us for the diagnostic and to get them an itemized quote with labor and part numbers. Turns out the check engine light is an easy fix, not really a problem. But thank goodness we took it in to a dealership, they did their normal multipoint inspection and found that head gasket, and oil pan seals are leaking, rear shocks bed to be replaced and one of the axels is leaking. Over $7000 worth of work. Needless to say, unless driveway cover this, we will be returning the vehicle. I don’t think the mechanical troubles are necessarily driveways fault, since the car is from a separate dealership, but maybe it’s a sign they don’t hold the dealerships they work with accountable.",
        "rating": 2
    }
]