[{"title": "Everyone was polite…", "text": "Everyone that I spoke with was polite and respectful. Brent did the evaluation.  Chase called to follow-up as we were considering a trade-in with a dealer. Ryan completed the transaction a few days later. They explained the process and answered our questions. They even provided information about returning the old license plate. ", "rating": 5}, {"title": "Cheryl was a very helpful", "text": "Cheryl was a very helpful, she explained the process thoroughly. She was very patient and clear in explaining the steps to the 90-year-old who was actually selling the family car. All family members present agreed that going through we buy any car was great, especially for 25-year-old vehicle. I hope that others who work for the company are as helpful as was Cheryl.", "rating": 5}, {"title": "My experience", "text": "I liked that setting up an appointment on line was very easy and fast.  Craig called me before the appointment to go thru the process, what to expect and the amount of time the process takes.  He also explained what he was looking for when doing the inspection.  Craig made the experience I was putting off, into very positive from start to finish. Craig also called me a few days after the sale to say thanks for choosing We Buy Any Car.  I would highly recommend WBAC to anyone wanting to sell a vehicle.", "rating": 5}, {"title": "Gabriel was honest and very easy to do…", "text": "Gabriel was honest and very easy to do business with.  She was clear about the process and very transparent throughout the assessment.  I would always recommend coming here if you don't want to deal with the hassle of private sale.", "rating": 5}, {"title": "I was skeptical about the process…", "text": "I was skeptical about the process involved. Josh made me comfortable right away. He was very professional and knowledgeable about buying my vehicle. I am grateful for his sincere desire to help me and make the process easier! I would encourage anyone looking to sell their vehicle to use WBAC. If you are fortunate,you will have Josh assisting you!", "rating": 5}, {"title": "5 Star, White Glove Experience!", "text": "As soon as we parked, we were met at the door by Terri.  She was welcoming, friendly, and sympathetic.  My niece is in FL attending school and had worked all summer long the previous summer to purchase a car.  Unfortunately, she purchased it from an unethical, dishonest dealership in OH and within 3 months, the engine was no longer working.  We reviewed a few different businesses that purchase vehicles and chose this one because of the stellar reviews.  Terri showed us the additional issues the car had that we were unaware of and put our minds at ease knowing we made the right decision to sell vs repair.  She made the process easy and turned a not so great day into a better one.  She got my niece the maximum amount she could for her vehicle.  I hope you never have to deal with purchasing a lemon, but if you do and the repairs exceed the value of the car, I FULLY recommend this company!  Terri is a cherry on top! ", "rating": 5}, {"title": "Excellent service ", "text": "Gabriel and his colleague showed up exactly when expected. They were courteous and expedient. Everything was completely taken care of in the time it took me to have a couple of cups of coffee. I would definitely use the service again if I needed to do so. ", "rating": 5}, {"title": "Great first experience at webuyanycar!", "text": "I believe Lou was the representative that helped my wife and I, along with his trainee. They were both very genuinely friendly and helpful. Lou explained the process and made everything clear. Overall we would highly recommend this location to friends and family. ", "rating": 5}, {"title": "Friendly and professional", "text": "Ryan and Chase were super friendly and very professional.  They did a great job. I think the most important thing for a seller to remember is to be realistic when bringing a vehicle in to be evaluated. Decide before you go what you are willing to accept.", "rating": 5}, {"title": "Great experience at Coral Springs, Florida!", "text": "The experience with Danny Munoz was very good. He was clear, straightforward, and made the process very easy and seamless. Highly recommend dealing with Danny, I believe his assessment of the car was very accurate.", "rating": 5}, {"title": "Great service", "text": "John came to my home on a Saturday which made it very convenient. He explained the process and was very thorough and made selling my vehicle a pleasant experience. The price offered was fair and a check was cut right on the spot.", "rating": 5}, {"title": "Like a cool breeze", "text": "Everything went very smoothly.  Even the hiccups on my end were easily dealt with.  I thought the offer was fair and was able to discuss some of the concerns in a reasonable manner and I think we reached a number both parties with. D was very personable, patient,  professional and even answered some questions in his off duty hours. It wasn’t the first appraisal I’d gotten on my car but it was the last one. Pleasure doing business then. Not to mention they paid off my lender, wrote me a check for the difference same day bought me an Uber and down the road I went. ", "rating": 5}, {"title": "We sold another car several years ago…", "text": "We sold another car several years ago at the same location and they had the best price. Jon is great to work with. Got dinged in the quoted price for some very minor paint chips on the hood but he accepted a counter offer from us to get us close to the original offer. ", "rating": 5}, {"title": "Alicia made selling my car a quick and…", "text": "Alicia made selling my car a quick and easy transaction. Would definitely recommend using webuyanycar.com for a pain-free deal", "rating": 5}, {"title": "Bad situation …", "text": "I just feel like knowing that the vehicle had issues.You guys picked it apart until you only had to offer us a hundred dollars. I understand we didn't have to accept the offer but you also knew that we I had a situation with the car and so I just feel like We were being took an advantage of", "rating": 2}, {"title": "In & Out in an Hour", "text": "Simple, quick…Kyle was very honest about everything and not one time did I feel like I made the wrong decision. He gives you time to think; a true no pressure, hassle-free experience. ", "rating": 5}, {"title": "Every thing was great but though the…", "text": "Every thing was great but though the guy who tow the car took the car with the Tag by mistake and I was upset but a guy from we buy car may be Iive in Frederick brought the Tag the next day !!!  Great job Matt !!! ", "rating": 5}, {"title": "Trust.", "text": "My good experience with you (We Buy  Any Car) is NOT New.Is a continuation since 2020.It started with Annie back then;and recently with Carter García & Carlos Acevedo.They were great.Each of them contributed  to make feel comfortable doing business with you guys.", "rating": 5}, {"title": "Laila at the Westfield branch made the…simple and easy", "text": "Laila at the Westfield branch made the process very easy and helpful. She did a very thorough and professional job checking out my car. She led us through all the paperwork and documentation in a quick and easy way. Also Mark helped us when we needed to bring in some additional paperwork. It was an easy and simple process to sell our car.", "rating": 5}, {"title": "Melanie whom came to my home to do the…", "text": "Melanie whom came to my home to do the inspection of my car and all the paperwork was amazing, personable and genuine. My only gripe is not with her but with your financial department who offered me less than half of what the online website suggested I would get compensated for. Online it was suggested that we buy any cars would offer me $4,585. After Melanie's inspection she populated the information in her computer system and I was offered $2,100. She rebutted with someone electronically in your finance department who said $2,500 was the final offer and was not willing to negotiate further. This is not very transparent, I could see maybe the price dropping $1,000 but not over half.  My car was in good condition, one simple dent on the back, needed a typical cleaning inside and out, by no means was the car a disgraceful mess, it had a brand new battery in it and was well taken care of with zero work ever required due to an accident or other mode of damage.  No justification to offer $2485 less than suggested online.  ", "rating": 5}, {"title": "Bernardo was personable and easy to…", "text": "Bernardo was personable and easy to work with. He inspected the vehicle and made an offer at about the amount I was expecting g. ", "rating": 5}, {"title": "May get slightly lower money but gain fast, reliable service with free ride home", "text": "Good, speedy service. I wish that my agent had talked me through more of the inspection part and had a slightly higher offer, closer to phone quote. But overall a good experience and I appreciated price negotiation. The free Uber was hugely helpful! ", "rating": 4}, {"title": "No lies, no hidden bullsh*t! Highly recommend. ", "text": "I sold my car to WeBuyAnyCar in Allentown. It was a great experience, and the whole reason behind our great experience is because of Carter. From the very first second he was very polite and inviting. Inspected the car, took it for a test drive and got right to business. Carter tackled everything with extreme professionalism and handled everything with the selling process in a timely manner. He explained everything he was doing and did not keep you in the dark about anything.  He helped me get a fantastic amount on my car too. Pretty dam close to what I would get private party honestly speaking. A real no bullsh*t company.But again Carter is the man to go to if you’re working with this branch. Great experience.", "rating": 5}, {"title": "Pre-appointment emails prepared us for…", "text": "Pre-appointment emails prepared us for documentation to bring, so there were no surprises or delays in selling our vehicle.  We received a fair price.", "rating": 5}, {"title": "Manager Tom was professional ", "text": "Manager Tom was honest, personable and professional. Took a bunch of pictures of my vehicle and in communication with his team, given the age of my vehicle, was presented with a low but fair offer. I highly recommend this company if you need to sell your car, ", "rating": 5}, {"title": "Professionalism", "text": "Matt was very professional and personable.  He took the time to explain the process of buying the van from us making it very easy.  The next time I have a vehicle to sell, I will contact Matt.", "rating": 5}, {"title": "Happy Lady in Old Hickory", "text": "Javier was very thorough and personable. He conducted himself professionally at all times. It took a little longer than I thought it should, but I still left a happy lady with a load lifted off my shoulders.", "rating": 5}, {"title": "Quick and mostly painless. ", "text": "Everything was fine. I would, of course, like to have gotten more for my old minivan, but the amount I got was fair. The vehicle was in poor condition, and I did get more than a scrapyard would have given me. The process was quick and the representative was efficient, thorough, and professional. I would recommend this company to anyone I know. ", "rating": 4}, {"title": "They made it very simple", "text": "They made it very simple, explaining in detail along the way.  You should, no surprise, expect the initial estimate to be high if your car has some issues but they explain reasons to lower it.  They do the title transfer so it is efficient.", "rating": 5}, {"title": "Christian was fine", "text": "Christian was fine, quoted $950 for car, as soon as I got there was told that deoending on condition, real value could be as low as $100.  Car was in very good shape, didn’t appreciated the bullshit starting so early", "rating": 3}, {"title": "The sale of my 2007 Ford went very…", "text": "The sale of my 2007 Ford went very smoothly—price was higher than CarMax.  I watched while the car was checked out and the whole process from bringing the car to taking a check home was about an hour or hour and a half. The representative was very professional and friendly. ", "rating": 5}, {"title": "Manager was great, Appointment Availability and Policies Terrible", "text": "Pedro was great to work with. The down sides were the available of appointments for at home visits. After deciding to sell car, the next available at home appointment was 2 weeks later. Also the policy of the company where the car worked fine but because transmission was having some issues shifting into 3 and 4th gear, that automatically meant the car maximum payout was $100. ", "rating": 4}, {"title": "The overall process went well", "text": "The overall process went well. I think the system that automatically gives a ballpark offer online should be closer to the final offer, which it was not. ", "rating": 5}, {"title": "Pleasurable experience", "text": "Dealing with James Owens was an absolute pleasure.  He was down to earth, professional & attentive.The entire process was a smooth and stress-free.   We Buy Any Car's operation is like a well oiled machine.", "rating": 5}, {"title": "Sahila from the Cary location of We Buy…", "text": "Sahila from the Cary location of We Buy Any Car did an outstanding job. I appreciate her efforts in helping me to sell my extra car. Thank you. ", "rating": 5}, {"title": "I sold my 2011 nissan altima and had a…", "text": "I sold my 2011 nissan altima and had a great experience. i was helped by Craig and he was very fast but not only that he made me feel like he genuinely cared about the interaction had a great conversation and got me a good price for my car and quickly to, can’t forget the front desk lady i can’t remember her name but another amazing person. 10 out of 10 recommendations if u are in west palm area check them out they won’t disappoint ", "rating": 5}, {"title": "My goats new life.", "text": "Patrick was very knowledgeable and enthusiastic about vehicles. He was pleasant to deal with and made the selling of my car easier than I thought.", "rating": 5}, {"title": "Honest", "text": "Quick, honest assessment of my vehicle’s value and a good offer with fast payment. ", "rating": 5}, {"title": "Great experience!", "text": "Lena in Pleasant Grove, UT is fantastic...as a manager if her branch and as a human being. Great experience and fair offer", "rating": 5}, {"title": "This was the second vehicle I brought…", "text": "This was the second vehicle I brought to Jim at the Lansdale location. Once again my experience was great, Jim was very professional and I was in and out quickly - highly recommended.", "rating": 5}, {"title": "Price in webuyanycar website and in…", "text": "Price in webuyanycar website and in brunch totally different,  they literally squeeze you cause they known you came from far. There target to minimize the price for your vehicle , if I know this before I would never come there  ( We buyanycar Pompano beach brunch )", "rating": 1}, {"title": "Worst experience ever ", "text": "Worst experience ever they will dump you with a very low offer. To sell my car l visted 3 dealership and webuyanycar was the lowest offer and l ended up selling my car through Facebook Market Place and l got more than double the amount that, webuyanycar offered me. ", "rating": 1}, {"title": "Transparent transaction ", "text": "This was my first experience .  From completion of intake form to saying last goodbye. Webuyanycar team were knowledgeable, professional and answered my questions.  Thank you Sheri. ", "rating": 5}, {"title": "Will Call Again!", "text": "They came out to look at my car the day after I called. Got an offer I would accept, completed the paperwork and got paid same day. Solid service!", "rating": 5}, {"title": "Although I didn’t get a lot for my car…", "text": "Although I didn’t get a lot for my car because of the issues with it. I would definitely recommend webuyanycar to anyone trying to sell their car. Osia was very professional and knowledgeable. He made the transition easy and explained everything as he took me through the steps of making the decision to sell my car. ", "rating": 5}, {"title": "It was difficult getting vehicle there…", "text": "It was difficult getting vehicle there but the guys and gals at wilmington were awsome and made the multiple day transaction smooth.Thanks wilmington", "rating": 5}, {"title": "The process was quick and easy", "text": "The process was quick and easy, and Josh was very professional, polite and organized.  Great service.", "rating": 5}, {"title": "Know what your car is worth vs what you need it to be worth", "text": "Very good experience, received a fair price.  The key here is truly understanding what your car is worth vs what you need it to be worth and that a fair profit needs to be made by We Buy Any Car.  ", "rating": 5}, {"title": "Chris was quite nice and professional…", "text": "Chris was quite nice and professional while we considered selling our truck! He listened to us and we felt he knew we were honest with him and he was honest with us! We enjoyed working with him! I would highly recommend working with WeBuyAnyCar😘", "rating": 5}, {"title": "Scott is a great guy", "text": "Scott is a great guy! Very professional and personable with excellent customer service. Scott was very patient and we didn't finish the deal till after work hours; what a guy.  I highly recommend Scott at We Buy Any Car in Apopka!", "rating": 5}, {"title": "We a very good experience at the…Coraopolis Branch", "text": "We a very good experience at the Coraopolis branch. Jerry made everything go very smoothly. Would never hesitate to use this company again. All in all we got a fair price for our vehicle. ", "rating": 5}, {"title": "Great experience!", "text": "Super quick, easy and a fair offer to boot!  Highly recommend (in fact already recommended to a friend!) ", "rating": 5}, {"title": "What made this experience so good was…", "text": "What made this experience so good was LuLU he was very efficient gave me the quote which I was happy about if I do this again I will ask him", "rating": 5}, {"title": "The process went very smoothly due to…", "text": "The process went very smoothly due to the experience and knowledge that Jim has with evaluating the vehicle and going through the paperwork step by step. Thank you.", "rating": 5}, {"title": "Joe Five Star!  was very transparent answered all…", "text": "Joe was very transparent answered all my questions as he reviewed the Escape.He is very knowledgeable on vehicles and the market and We Buy Any Cars is fortunate to have his experience!", "rating": 5}, {"title": "As being a senior and no selling…", "text": "As being a senior and no selling experience in selling cars. I believe I might have been short changed. I believe the buyer should be more open. I know it's a business and you guys are in it for the money. Truthfulness about the car's value would be the best way to go. The buyer John was very personable but he did make a couple of comments that made me think the car wasn't worth as much as your first quote was.", "rating": 5}, {"title": "Fantastic experience", "text": "Fantastic experience. I was a bit snobby about the location of the store bot I’m glad I got over my self. ", "rating": 5}, {"title": "We Buy Any Car - Indian Trail, NC ", "text": "Working with Jerry Birenbaum at the We Buy Any Car office in Indian Trail, NC was a very positive experience.  Jerry certainly made the process easy for us to sell our car.  He was engaging, personable, friendly, professional, and very thorough in his explanation on how the We Buy Any Car process works and what he would be doing to evaluate our vehicle. We found Jerry to be extremely knowledgeable regarding cars and the automobile industry.  It was clear he had great deal of expertise and experience in the field.  That certainly gave us a high level of confidence that this would be a worthwhile transaction and that choosing We Buy Any Car would be more beneficial to us than trading our car in at a car dealership.  When we agreed on a price, Jerry moved us through the paperwork process easily and quickly.  Overall, our meeting and interaction with Jerry was a very positive experience and I would definitely recommend We Buy Any Car and Jerry, in particular, to anybody I know that was looking to sell their car.  ", "rating": 5}, {"title": "Amy did a GREAT JOB helping us", "text": "Amy did a GREAT JOB helping us. Amy knows her job and what’s important, has knowledge about ALL the forms and processes. Thank you for having a person like Amy.Richard Armstrong ", "rating": 5}, {"title": "Fantastic Customer Service", "text": "Fantastic Customer Service! Absolutely the best and easiest process. They were genuine, down to earth, and compassionate. Would go to them again to sell a vehicle ", "rating": 5}, {"title": "Olivia was just AMAZING", "text": "Olivia was just AMAZING!  She was incredibly patient with our transaction and was very professional to work with.  I would recommend this business as it is simple, fast, and easy.Thank you for the transaction and an A+++ experience. ", "rating": 5}, {"title": "Easy process", "text": "Easy process. I took the car in, they inspected it, we chatted a little bit about the condition of the vehicle, they made an offer, and we closed out the transaction.", "rating": 5}, {"title": "Jon was very professional and this was…", "text": "Jon was very professional and this was a difficult dale as I was acting for an of state seller .it took a lot of work on both of us.  Jon is a very valuable asset for your company ", "rating": 5}, {"title": "Good customer service", "text": "The rep was very pleasant, knowledgable, and I felt comfortable speaking with him;  I didn't feel rushed or pressured in any way.", "rating": 5}, {"title": "Selling my car was quick and easy.I was…", "text": "Selling my car was quick and easy.I was amazed at the price Matt gave me for my vehicle. He was very courteous and answered all my questions. I have already recommended we buy any car to others", "rating": 5}, {"title": "Great", "text": "Great, easy and fast experience. Got the best deal for my vehicle vs the competitors ", "rating": 5}, {"title": "This experience was awesome", "text": "This experience was awesome!  Both Tyler and James were friendly and helpful.  They evaluated my car quickly and offered a very fair price with no pressure. It took less than 2 hours total to sell my car.  Fantastic service...I highly recommend!", "rating": 5}, {"title": "Fast honest experience ", "text": "Fast honest experience They came to my home and The representative Brendan answered all my questions and made the selling process a breeze ", "rating": 5}, {"title": "Trevor was great help", "text": "Trevor was great help. He knew his stuff and was very informative. He made the experience easy. ", "rating": 5}, {"title": "Jess was very professional and did a…", "text": "Jess was very professional and did a thorough job in inspecting the car, and I believe the price was fair.I would use this company again!", "rating": 5}, {"title": "Leon from the Delray office was very…", "text": "Leon from the Delray office was very pleasant and professional. He was thorough to survey my vehicle and communicated quickly until we agreed upon a sale price", "rating": 5}, {"title": "Matt was friendly and professional      ", "text": "Matt was friendly and professional and explained the assessment and transaction process thoroughly  I would sell a car with him again.  ", "rating": 5}, {"title": "We buy any car ", "text": "This experience was awesome! Both Keith and James were friendly and helpful. They evaluated my car quickly and offered a very fair price with no pressure. It took less than 2 hours total to sell my car. Fantastic service... highly recommend!", "rating": 4}, {"title": "They made the whole transaction…", "text": "They made the whole transaction transparent and explained the process for the price given for the vehicle. The monies were where I had expected for the vehicle minimal back and forth.", "rating": 5}, {"title": "He is good and helpful for providing…", "text": "He is good and helpful for providing high evaluation of our car, fast buying transactions.  We are happy and will refer our friends to him.  Thanks very much.", "rating": 5}, {"title": "This company is the best and they have…", "text": "This company is the best and they have quality services to their customers I give them 5/5 stars ", "rating": 5}, {"title": "Excellent service and fast discussion", "text": "Excellent service and fast discussion. Steve was awesome, he offered me water and took very quick decision on offer.", "rating": 5}, {"title": "Excellent service and technicians", "text": "Excellent service and technicians. I will definitely be using webuyanycar.com for future sales of my vehicles. They will come to your house , give you a fair price and get a deal with you fast. ", "rating": 5}, {"title": "I believe my person was named Jason", "text": "I believe my person was named Jason. I could be wrong but he was awesome! If I ever have to go through this experience again I would want him back. Great customer service. I was very pleased with the outcome.", "rating": 5}, {"title": "Lucas,Joel and the entire team of their…", "text": "Lucas,Joel and the entire team of their South Carolina location were extremely professional and courteous throughout our car selling experience and would highly recommend their service to anyone wanting to sell any vehicle.  Would have no hesitation in using them again or personally recommending their service.", "rating": 5}, {"title": "The agent at the West Chester Ohio…", "text": "The agent at the West Chester Ohio location was awesome and very detailed  ", "rating": 5}, {"title": "Quintin was great to work with ", "text": "Quintin was great to work with very knowledgeable and made it a fast and easy process. Would definitely use his services again ", "rating": 5}, {"title": "Communication was very good from the…", "text": "Communication was very good from the moment I reached out to we buy any car", "rating": 5}, {"title": "Great experience", "text": "Brandon was very knowledgeable, and made the transaction very smooth. Would deal with him again. ", "rating": 5}, {"title": "Very helpful", "text": "Everybody was very helpful anybody he was messaging on the computer got back to him fast", "rating": 5}, {"title": "Because I had very good person who was…", "text": "Because I had very good person who was professional and kind, knowledgeable. He was very understanding and helpful ", "rating": 5}, {"title": "Very fast process", "text": "Very fast process. Aziza has a professional knowledge and explained very detail to us. Great experience and happy to do business with. ", "rating": 5}, {"title": "Mason was very kind and transparent", "text": "Mason was very kind and transparent. He made the selling process very easy and simple.", "rating": 5}, {"title": "The person that we were dealing with…", "text": "The person that we were dealing with did his job explaining everything really well?", "rating": 5}, {"title": "Laila is amazing", "text": "Laila is amazing. My wife and I enjoyed working with Laila and will be referring family and friends in the future.", "rating": 5}, {"title": "Working with Josh was a pleasure", "text": "Working with Josh was a pleasure. Quick and painless process.", "rating": 5}, {"title": "Terry was very nice to work with", "text": "Terry was very nice to work with. However she wants to quit smoking. So make sure to make fun of her and bully and shame her if she is still smoking and hasn't quit yet! 😅", "rating": 5}, {"title": "The sale person did an excellent job…", "text": "The sale person did an excellent job with the entire process. They were very friendly and helpful.", "rating": 5}, {"title": "Great first experience ", "text": "We were welcomed and felt no pressure and nice experience!", "rating": 5}, {"title": "Quick and easy", "text": "Quick and easy, plus they are fair and tell you everything   even if you don't ask.would highly recommend.  And they were better than the new car dealer.", "rating": 5}, {"title": "Lexus es330", "text": "Great  quick experience  and honest people like sturt ", "rating": 5}, {"title": "Fast and easy process", "text": "Fast and easy process.  Stuart was knowledgeable and honest.", "rating": 5}, {"title": "Easy and Efficient", "text": "The process was thorough and efficient. Made it easy to sell an unwanted vehicle. ", "rating": 5}, {"title": "They worked hard to get me a great deal…", "text": "They worked hard to get me a great deal on the vehicle and explained everything that went into that offer.", "rating": 4}, {"title": "Honest assessment", "text": "Efficient and thorough review of my vehicle.  The offer was fair and met my expectations.", "rating": 5}, {"title": "Smooth transaction", "text": "Smooth transaction! Ask for branch manager Sherrie. ", "rating": 5}, {"title": "Alicia G was great!", "text": "Alicia G was great!I had a minor problem that needed to be worked out and she was there every step of the way.", "rating": 5}, {"title": "Good Experience. Stuart was very helpfu,friendly and…", "text": "Stuart was very helpful,friendly and efficient.the whole process took less then an hour.", "rating": 5}, {"title": "Quick and easy process", "text": "Steve was friendly and explained every step of the process. I was in and out in an hour. Super easy way to sell a car", "rating": 5}, {"title": "My experience was perfect", "text": "My experience was perfect, and I had the greatest help while in the Silver Spring location", "rating": 5}, {"title": "George was very pleasant and the…", "text": "George was very pleasant and the process was very smooth. We would definitely use the service again.", "rating": 5}, {"title": "Matt is what made our experience great", "text": "Matt is what made our experience great!  He made the entire process seamless and quick.  ", "rating": 5}, {"title": "Jim was an excellent rep and made…", "text": "Jim was an excellent rep and made selling my car easy and quick.  ", "rating": 5}, {"title": "the man that i dealt with was…", "text": "the man that i dealt with was nice,friendly and very professional", "rating": 5}, {"title": "Upfront and Honest ", "text": "They were able to match the quote from others in regards to the purchase of our vehicle. Lou went above to make sure the process was as easy as possible. Thanks 👍", "rating": 4}, {"title": "Mrs. DeBouse, was excellent.", "text": "Mrs. DeBouse was friendly  respectful,  and the process was fast. ", "rating": 5}, {"title": "Aziza was very informative and helpful…", "text": "Aziza was very informative and helpful making it a a very easy process ", "rating": 5}, {"title": "Darius was very professional and easy…", "text": "Darius was very professional and easy to work with.  ", "rating": 5}, {"title": "Easy process", "text": "Easy process! Got more than I expected. Would definitely recommend!!", "rating": 5}, {"title": "Great honest service", "text": "Lee was very knowledgeable and answered any questions we had. She was honest with both the good and bad. We thank her for her time", "rating": 5}, {"title": "Very Knowledgeable ", "text": "The person helping us had great knowledge and explained everything to us.  We weren't there very long and everything went very smoothly.  I would deal with We Buy Any Car for sure.", "rating": 4}, {"title": "Sale of my F250 King Ranch", "text": "He came to the house and it really didn't take long at all. I received a good deal for my F250 King Ranch andWe still owed money on it.", "rating": 5}, {"title": "Good negotiation", "text": "Evaluation was quick and transparent. Negotiation is straightforward and the price is good.", "rating": 5}, {"title": "John was great very friendly wish more…", "text": "John was great very friendly wish more people were like him. Company was good in responding to my calls ", "rating": 5}, {"title": "Fast and simple way to sell your car…", "text": "Fast and simple way to sell your car and very well knowledgeable made life easy", "rating": 5}, {"title": "Very painless process and staff were…", "text": "Very painless process and staff were excellent to work with.", "rating": 5}, {"title": "Great experience", "text": "Brendan was courteous and professional the whole time. ", "rating": 5}, {"title": "The task got completed", "text": "The task got completed,  when scheduled, without delay. Thank you.", "rating": 5}, {"title": "Terrie was fantastic in talking and…", "text": "Terrie was fantastic in talking and taking me through the whole process. ", "rating": 5}, {"title": "Simple & fair ", "text": "It was simple and fair and better than selling it to friends or neighbors. ", "rating": 5}, {"title": "Great experience", "text": "Great experience! Very helpful and friendly staff. ", "rating": 5}, {"title": "Smooth process", "text": "Smooth process, but received significantly less than the online offer, despite listing all issues.", "rating": 4}, {"title": "Craig was up front", "text": "Craig was up front, open and very knowledgeable about his job.", "rating": 5}, {"title": "fast and willing to work with you for a…", "text": "fast and willing to work with you for a reasonable price", "rating": 5}, {"title": "Quick and friendly experience!!", "text": "Quick and friendly experience!!! Thank you for the amazing help!!!", "rating": 5}, {"title": "1234,", "text": "Very helpful staffer in the office.", "rating": 5}, {"title": "Matt was excellent", "text": "Matt was excellent, explained everything and very nice", "rating": 5}, {"title": "Dean was terrific", "text": "Dean was terrific! Extremely personable and helpful. Would highly recommend him.", "rating": 5}, {"title": "Good", "text": "The place is pretty good. process was straight forward.", "rating": 5}, {"title": "The person I dealt with was very…", "text": "The person I dealt with was very friendly and considerate.", "rating": 5}, {"title": "The gentleman at the office who helped…", "text": "The gentleman at the office who helped us was wonderful ", "rating": 5}, {"title": "Fast and honest", "text": "The process was very quick and easy. It took less than an hour to do everything. ", "rating": 5}, {"title": "He was very freindly easy to work with…", "text": "He was very freindly easy to work with and very knowledgable about my vehicle", "rating": 5}, {"title": "Friendly service", "text": "Date of experience: November 03, 2024", "rating": 5}, {"title": " easy process ", "text": "Smooth easy process for selling your car. ", "rating": 5}, {"title": "Matt was very nice and he provided me…", "text": "Matt was very nice and he provided me with all the info I needed.  ", "rating": 5}, {"title": "Great service", "text": "Great service ", "rating": 5}, {"title": "The young lady I worked with was…", "text": "The young lady I worked with was patient and personable. ", "rating": 5}, {"title": "Great service", "text": "Great service, quick process.", "rating": 5}, {"title": "Josh made the experience super easy and…", "text": "Josh made the experience super easy and pleasant! Josh is extremely customer focused and an outstanding professional!", "rating": 5}, {"title": "D was very personable.", "text": "D was very personable. ", "rating": 5}, {"title": "Quick and easy", "text": "Quick and easy. Up front honesty in getting our quote.", "rating": 5}, {"title": "Great service on time precise and…", "text": "Great service on time precise and helpful.", "rating": 4}, {"title": "Very courteous", "text": "Very courteous ", "rating": 5}, {"title": "Jerry made the process fairly easy. He was friendly and went to bat for me when first bid was fairly low", "text": "Jerry made the process fairly easy", "rating": 5}, {"title": "Friendly and transparent.", "text": "Friendly and transparent. ", "rating": 5}, {"title": "Easy Process", "text": "     The whole process was easy and seamless. One hour sold all done.", "rating": 5}, {"title": "Sherri is amazing and very professional.", "text": "Sherri is amazing and very professional.  ", "rating": 5}, {"title": "They give a good deal", "text": "I sold my Honda CRV car and they given a very good deal.", "rating": 5}, {"title": "Felt we were treated with respect.", "text": "Date of experience: November 01, 2024", "rating": 4}, {"title": "Easy process and great sevice!", "text": "Date of experience: November 03, 2024", "rating": 5}, {"title": "Quick and easy process.", "text": "Quick and easy process. ", "rating": 5}, {"title": "Great communication before and during…", "text": "Great communication before and during appointment. Prompt arrival. Quick and efficient transaction. ", "rating": 5}, {"title": "Great service", "text": "Great and honest service ", "rating": 5}, {"title": "Nice and cool experience", "text": "Nice and cool experience ", "rating": 5}, {"title": "Great experience with no hassle.", "text": "Great experience with no hassle. ", "rating": 5}, {"title": "Your agent Luis Santiago was wonderful, personable, knowledgeable, and very helpful.", "text": "Your agent Luis Santi", "rating": 5}, {"title": "Easy", "text": "Easy, smooth and we got the outcome we wanted. ", "rating": 5}, {"title": "Fast", "text": "Fast, quick, easy process", "rating": 5}, {"title": "All good", "text": "All good! Treated well. Fast processing. Friendly staff. Fair price", "rating": 5}, {"title": "Liliana was great.", "text": "Liliana was great. ", "rating": 5}, {"title": "Donald is the best!", "text": "Donald is the best! Painless experience. ", "rating": 5}, {"title": "Debby was informative", "text": "Debby was informative, friendly and knowledgeable...", "rating": 5}, {"title": "He gave me just about what he said in…", "text": "He gave me just about what he said in his email.", "rating": 5}, {"title": "Mobile tech Wonderful ", "text": "Melanie was fabulous!", "rating": 5}, {"title": "Brandon was great and made the process…", "text": "Brandon was great and made the process so easy", "rating": 5}, {"title": "Very professional ", "text": "Professional, knowledgeable, and honest. Would recommend.", "rating": 5}, {"title": "Would go again. ", "text": "Steve was great. Very nice. Made the process easy and simple.", "rating": 5}, {"title": "Quick and straightforward.", "text": "Date of experience: October 26, 2024", "rating": 5}, {"title": "Super fast", "text": "Super fast. Easy. ", "rating": 5}, {"title": "It was fantastic", "text": "It was fantastic, enjoy the experience ", "rating": 5}, {"title": "Good guy he gave me a fare price", "text": "Good guy he gave me a fare price ", "rating": 5}, {"title": "The site is great", "text": "The site is great. The site makes money in an easy way", "rating": 5}, {"title": "Great experience Jim was awesome", "text": "Great experience Jim was awesome. would definitely  recommend", "rating": 5}, {"title": "She was so nice ", "text": "She was so nice , and friendly.", "rating": 5}, {"title": "Terrific", "text": "Terrific, fair and quick transaction.", "rating": 5}, {"title": "Very nice and worked out best deal!", "text": "Date of experience: October 30, 2024", "rating": 5}, {"title": "good customer service", "text": "Bernardo was very helpful and professional.", "rating": 4}, {"title": "Great customer service", "text": "Date of experience: November 01, 2024", "rating": 5}, {"title": "Quick and professional ", "text": "Friendly, honest, helpful.  Positive experience all around.  ", "rating": 4}, {"title": "Quick and easy Smooth transaction", "text": "Smooth transaction. Great experience ", "rating": 5}, {"title": "Great customer service", "text": "Great customer service ", "rating": 5}, {"title": "Great customer service", "text": "Date of experience: October 31, 2024", "rating": 5}, {"title": "He made it quick and easy.", "text": "Date of experience: October 30, 2024", "rating": 5}, {"title": "Fast and easy", "text": "Date of experience: November 03, 2024", "rating": 5}, {"title": "Very good experience!", "text": "Date of experience: October 31, 2024", "rating": 5}, {"title": "Fast and professional service.", "text": "Fast and professional service. ", "rating": 5}, {"title": "Great work!", "text": "Date of experience: October 30, 2024", "rating": 5}, {"title": "Easy", "text": "Easy and fast", "rating": 5}, {"title": "Excellent customer service!", "text": "Date of experience: October 31, 2024", "rating": 5}, {"title": "Very smooth", "text": "Very smooth ", "rating": 5}, {"title": "Number 1 customer service", "text": "Date of experience: October 30, 2024", "rating": 5}, {"title": "Thorough evaluation.", "text": "Date of experience: October 31, 2024", "rating": 5}, {"title": "Very professional.", "text": "Date of experience: October 31, 2024", "rating": 5}, {"title": "Great experience", "text": "Great experience ", "rating": 5}, {"title": "Chris was very comforting and kind", "text": "Chris was very comforting and kind. He did an excellent job explaining aspects of my car that I never knew before. I would work with him again if I needed to sell another vehicle.", "rating": 5}, {"title": "GREAT", "text": "GREAT!!!!!", "rating": 5}, {"title": "Liliana and Pricing Team", "text": "Liliana, the Branch Manager was great ! She was very personable and knowledgeable. We liked her.  I would have given 5 stars except I think the online pricing team was very tough. I had a check engine light caused by an easily installed $35 part. It made about a $1,400 difference in the original offer price. I could have installed it myself but I would have had to drive the car for 200 miles for the EMS to reset and that was too much of a delay so we did the deal.    ", "rating": 4}, {"title": "Brandon was fantastic! Will recommend.", "text": "Brandon was extremely polite and helpful throughout the process. The evaluation was quick and easy, which was well beyond my expectations. I'm incredibly satisfied with my experience selling my car on 10/25/2024.", "rating": 5}, {"title": "Dan was very friendly", "text": "Dan was very friendly, easy to work with and clearly explained the process.", "rating": 5}, {"title": "Jim was very helpful and walked us with…", "text": "Jim was very helpful and walked us with the process and transaction was smooth process. ", "rating": 5}, {"title": "Company has the the tools needed to…", "text": "Company has the the tools needed to value your car", "rating": 4}, {"title": "Such a wonderful car selling experience ", "text": "Such a wonderful car selling experience.John was very helpful in explaining what the value of the car was and gave me a very fair deal.Very respectful transactions and I am very happy i sold my car at this location.Thanks John once again", "rating": 5}, {"title": "We had a very pleasant and smooth…", "text": "We had a very pleasant and smooth experience with Jim Ruggiero at the Lansdale office. He was very professional, knowledgeable and fair throughout the process. My husband and I would definitely recommend anyone looking to sale their car to go see Jim...Thank you Jim", "rating": 5}, {"title": "VERY easy to deal with", "text": "Both of the two gentlemen that worked with us were great. they were professional, friendly and respectful.", "rating": 5}, {"title": "This is my second time selling a car…", "text": "This is my second time selling a car and it’s been again another great experience. Customer service is always amazing and this time I had them come to me and again the process was swift and smooth. This will always be my first choice when selling. ", "rating": 5}, {"title": "Quinton Made it Easy", "text": "He was friendly, patient and made the entire process seamless!", "rating": 5}, {"title": "Excellent Service ", "text": "D. Bland was extremely professional and courteous. I highly recommend We Buy Any Car.", "rating": 5}, {"title": "So Simple experience", "text": "Quick and easy to deal", "rating": 5}, {"title": "Fast, efficient and fair", "text": "Fast, efficient and fair. I will sell any car here and recommend it to anyone I know.", "rating": 5}, {"title": "By far one of the best customer…", "text": "By far one of the best customer experiences I have had. Carmen is God send, it was great working with her on the sale of my vehicle. Looking forward to doing business in the future!", "rating": 5}, {"title": "Service", "text": "Service, service, and service. Very polite.  Helpful.  ", "rating": 5}, {"title": "Honesty", "text": "HonestyCourtesyFairnessMade for an easy good experience with the price that I expected.", "rating": 5}, {"title": "All good", "text": "All good. Fair. No problems ", "rating": 5}, {"title": "Horrible Conpensation", "text": "I brought in a car that ran well, had 170k miles which is great for its age and had few issues cosmetically and I was only give $101 for it. ", "rating": 1}, {"title": "Professional", "text": "Professional, straightforward, courteous agent and no games ", "rating": 5}, {"title": "Very nice and super helpful", "text": "Very nice and super helpful. I would definitely recommend this location to anyone looking to sell their car. Great experience!", "rating": 5}, {"title": "Disappointed in our experience ", "text": "The online estimate was $750 which was comparable with the prices I saw people selling the same vehicles online for. Once there, we were told there was a noise under the hood (there wasn't) & the brakes were soft (they work perfectly) and they were only going to offer $101 for the vehicle. When we laughed at that, it went up to $300. We refused that, so then the offer was $400. They would not compromise at all after that. Obviously we were disappointed by this outcome after being there for over 2 hours. ", "rating": 1}, {"title": "Thank you very much", "text": "Thank you very much ", "rating": 5}, {"title": "Competitive price", "text": "Competitive price, great service ", "rating": 5}, {"title": "Great service ", "text": "I received excellent customer service from Ryan.Ryan took the time to keep me informed during the entire process and was very patient. It was a pleasure to do business with Ryan.Thank you", "rating": 5}, {"title": "My experience was seamless", "text": "My experience was seamless.  Konrad was very knowledgeable and explained everything clearly.After first going to a dealership, it was nice dealing with someone so pleasant.", "rating": 5}, {"title": "Very thorough and honest with their…", "text": "Very thorough and honest with their inspection. Gave me a very fair offer on my car. Scott and Lee friendly and amazing people!", "rating": 5}, {"title": "I was given a great deal on the vehicle…", "text": "I was given a great deal on the vehicle I sold. Very friendly great service, very courteous and professional. I recommend anyone who wants to sell their vehicle to go to this establishment, thanks again ", "rating": 5}, {"title": "Very helpful and considerate", "text": "Very helpful and considerate. WBAC representative. Very knowlegable and friendly. ", "rating": 5}, {"title": "Brandon was great and the process was…", "text": "Brandon was great and the process was easy and smooth.", "rating": 5}, {"title": "Chris was great to work with!", "text": "Chris was great to work with! ", "rating": 5}, {"title": "I had a wonderful experience", "text": "I had a wonderful experience. We were greeted by Shawn and let in to the office even though we arrived 20 min early. He explained the process, the tests he would complete. Allowed for questions. And completed everything including paper work within an hour. Very friendly and easy to work with. I would do business with him again. ", "rating": 5}, {"title": "Francine Dejesus review..", "text": "Francine Dejesus took care of me, I want to thank her. She did all she could to gift me the price that I wanted..nice to make business with you..", "rating": 5}, {"title": "Dominick was extremely professional", "text": "Dominick was extremely professional, positive and caring. An easy experience. ", "rating": 5}, {"title": "Quick", "text": "Quick, easy, fair, great experience all around ", "rating": 5}, {"title": "Great customer service and quick and…", "text": "Great customer service and quick and easy process ", "rating": 5}, {"title": "Ekamba was awesome", "text": "Ekamba was awesome.  No pressure tactics or anything.  Very polite and helped fix a matter that no one else even caught.  He was patient and answered all of my questions.  He's a great person and I will recommend this company because of my experience with him.", "rating": 5}, {"title": "Very helpful and informative", "text": "Very helpful and informative. Made the process as south as possible.", "rating": 5}, {"title": "The process was quick and easy and…", "text": "The process was quick and easy and Haneef was great to do business with.  Nice guy. ", "rating": 5}, {"title": "Quick and easy", "text": "Quick and easy. William was a great help", "rating": 5}, {"title": "Just an easy experience", "text": "Just an easy experience ", "rating": 5}, {"title": "Fast", "text": "Fast, friendly and fair", "rating": 5}, {"title": "Quick and Easy", "text": "Very nice people made the process quick and easy.", "rating": 5}, {"title": "Tim was amazing", "text": "Tim was amazing!  I would definitely recommend this establishment - personable, reliable, honest and straightforward. The sale was all done within one hour. ", "rating": 5}, {"title": "Dominic es El Rey!", "text": "Dominic was extremely professional, helpful, and went above and beyond to make the process as simple as possible. The Flea and Buena family would be more than proud of how he served us and what he’s doing with his branch! ", "rating": 5}, {"title": "Great", "text": "Great. Thanks. ", "rating": 1}, {"title": "We had an excellent experience— from…", "text": "We had an excellent experience— from the initial phone call Joe was pleasant and answered all my questions — to the sale of the car we felt very comfortable that everything was legitimate and we had no worries. Joe was easy to work with and very personable and reassuring.  Even the office was clean and appealing to be in. We appreciated the excellent treatment and experience.  Thank you.  ", "rating": 5}, {"title": "Andre at the Palm Harbor", "text": "Andre at the Palm Harbor, FL office was very transparent with the process, thoroughly inspected my car and worked hard to offer me a fair price.  Much more personal than other car buying services. Recommend highly.", "rating": 5}, {"title": "Very quick and fair", "text": "Very quick and fair!  Jeff filled in for Felix and was great. ", "rating": 5}, {"title": "Selling Pilot", "text": "Sale went very smoothly with no pressure. ", "rating": 5}, {"title": "The man who inspected the car was fair", "text": "The man who inspected the car was fair, and explained every detail.", "rating": 4}, {"title": "Is was an easy transaction", "text": "Is was an easy transaction. Manager was polite and made for a smooth transaction.", "rating": 5}, {"title": "John was great and made the process…", "text": "John was great and made the process very simple. Only thing keeping me from giving a 5 star review is how little they offered me. I understand they have to make their money but I feel they could be more fair with their offers.", "rating": 4}, {"title": "Easy and efficient experience", "text": "Easy and efficient experience. No complaints at all.", "rating": 5}, {"title": "Sold my car today and Bob made the…", "text": "Sold my car today and Bob made the experience exceptionally smooth.  He explained the process in detail, performed a thorough vehicle inspection and offered a fair and reasonable price.  Bob was very personable and customer oriented and I would highly recommend doing business with him at the Peters Township office!!", "rating": 5}, {"title": "Jim Trumbo helped me with my car sale…", "text": "Jim Trumbo helped me with my car sale today and was fantastic! ", "rating": 5}, {"title": "Nice experience", "text": "It was easy to schedule a time, and the company and the manager were friendly and professional. Even though I didn't sell my car, I will consider We Buy Any Car in the future as the offer was fair and I had a good experience. ", "rating": 5}, {"title": "Great customer service from Shawanda", "text": "Customer service from Shawanda was exceptional!", "rating": 5}, {"title": "Quick", "text": "Quick, Fast and upfront about process.", "rating": 5}, {"title": "The process was quick and painless!", "text": "Date of experience: October 26, 2024", "rating": 5}, {"title": "Straightforward and Pleasant Experience", "text": "Our appointment started on time and the review of the car was done in a timely fashion.  The interaction was straightforward and pleasant. ", "rating": 5}, {"title": "Honest and very friendly", "text": "Honest and very friendly.  Knows the job and tells it like it is.Very happy with working with him.", "rating": 5}, {"title": "A special shoutout to Dean", "text": "A special shoutout to Dean! He was very cordial and welcoming. I give 4 stars because of the usual initial lowballing. But we ended up settling for a fair evaluation of my car. I would do business again and highly recommend.", "rating": 4}, {"title": "Sold My Car!!!", "text": "Shawn was very helpful throughout the entire process. He made everything quick and easy, providing exactly what I asked for regarding my vehicle. I would highly recommend this route if you're looking to get rid of your vehicle! Thanks again, Shawn!", "rating": 5}, {"title": "Awesome experience", "text": "What a wonderful company ams salesman was on top and amazing. Recommend for anyone selling a car.", "rating": 5}, {"title": "great", "text": "was a great transaction great people to work with", "rating": 5}, {"title": "Good experience ", "text": "Simple. Upfront.  Done ", "rating": 5}, {"title": "Exceptional Service Made All the Difference", "text": "The experience was great because of Jess’s exceptional customer service. She was not only professional but also went above and beyond to make the process easy and convenient. Her kindness and attention to detail made a real difference.The company stands out in customer service, especially through team members like Jess who make customers feel valued and respected. Although I had other offers, the level of service I received here made the decision easy.", "rating": 5}, {"title": "Everything I expected!", "text": "Date of experience: October 20, 2024", "rating": 5}, {"title": "Fast fun easy and fair", "text": "Fast fun easy and fair. Jim Trumbo helped me on a Saturday morning super easy. ", "rating": 5}, {"title": "GREAT SERVICE AND NO HASSLE", "text": "JON WAS VERY HELPFUL IN APPRAISING MY TRUCK. HE HAS A SOFT VOICE AND HAS GREAT CUSTOMER SERVICE ETIQUETTE. HE ALSO OFFERS A FAIR PRICE WHICH MADE ME A HAPPY CUSTOMER AND WOULD RECOMMEND TO OTHER PEOPLE. THANKS PEACE.", "rating": 5}, {"title": "Dean explained everything that was…", "text": "Dean explained everything that was happening well. Very professional and courteous.", "rating": 5}, {"title": "very informative and comfortable space! ", "text": "our advisor was great! very informative ", "rating": 5}, {"title": "That guy dean", "text": "That guy dean! Very nice and very willing to help you out", "rating": 5}, {"title": "Thanks Dean! ", "text": "It was a pleasure working with Dean concerning the sale of my vehicle. He was very professional and offered to establish a tow truck up. Thanks Dean! ", "rating": 5}, {"title": "Great Team AAA+++", "text": "Date of experience: October 20, 2024", "rating": 5}, {"title": "Pleasant to deal with", "text": "Very helpful and courteous pleasure to deal with ", "rating": 4}, {"title": "Painless Experience ", "text": "It was a pleasant experience working with Larry.  He made sure to explain all paperwork and timeframe to complete this purchase of our car.  It saved us a lot of time and no hassles of not having to sell on-line.", "rating": 5}, {"title": "The process was quick and easy and we…", "text": "The process was quick and easy and we received a fair price.", "rating": 5}, {"title": "Daniel was friendly and informative", "text": "Daniel was friendly and informative. He made the process simple and rather enjoyable. He explained what was happening the entire way through and made the whole thing as easy as it could possibly be. I would recommend a friend to the Alexandria office specifically because of Daniel.", "rating": 5}, {"title": "Thank you for honesty ", "text": "Thank you for helping, have a clean, easy, positive and quick way to sale my vehicle. Thanks for the honesty, and upfront information about the sale of my vehicle. Thanks again!!!", "rating": 4}, {"title": "I think the sales experience was as…", "text": "I think the sales experience was as seemless as it could be.", "rating": 5}, {"title": "Jim Trumbo was GREAT", "text": "Jim Trumbo was GREAT! He was so knowledgeable and helpful, he made the whole experience a real pleasure. Too bad I don't have more cars that I need to sell.", "rating": 5}, {"title": "Sale my car", "text": "Very happy with the process.  Thanks", "rating": 5}, {"title": "My selling experience for my car Great!!was…", "text": "My selling experience for my car was great!! It was quick and easy. The documentation and ride back home with uber coupon is appreciated! I definitely would use webuyanycar for future car sales and would recommend to my aquentences ", "rating": 5}, {"title": "Great experience", "text": "Great experience working with Christian on the sale of our vehicle.  He is very knowledgeable and explained everything very clearly.  ", "rating": 5}, {"title": "They start out with a very low offer…", "text": "They start out with a very low offer that is ridiculous. Another customer was there and he left with his pickup truck. They should take into consideration that people are not trying to give their vehicle away. And stop making up excuses that something is wrong with the vehicle.", "rating": 3}, {"title": "Josh was awesome", "text": "Josh was awesome. Got me in and out without issue. Was skeptical at first.", "rating": 5}, {"title": "Tim was a grafull person the best no…", "text": "Tim was a grafull person the best no issues I give him 10 stars.", "rating": 5}, {"title": "Alixs was very sweet on handling…", "text": "Alixs was very sweet on handling everything, being I was the first one that morning.", "rating": 5}, {"title": "Thank you Daniel ", "text": "I'm very happy, Daniel helped me get more money than other places I went to before and a free ride home", "rating": 5}, {"title": "Very personable staff.", "text": "Our representative was very thorough and pleasant. Of course, everyone wants to get the best price, and there is no way to authenticate what may be negatives that are mentioned that lower the quote. All in all, it met our needs.", "rating": 4}, {"title": "good place to get cash for your car", "text": "Date of experience: October 22, 2024", "rating": 4}, {"title": "Car Sale", "text": "A quick transaction with complete information at every step.", "rating": 5}, {"title": "Bernard was very helpful and kind", "text": "Bernard was very helpful and kind, enjoyed working with him", "rating": 5}, {"title": "Daniel was Awesome", "text": "Daniel was Awesome. He was professional, friendly and very informed.  He walked me through the process every step of the way. Selling my car was seamless.", "rating": 5}, {"title": "Great end-end experience including…", "text": "Great end-end experience including follow up", "rating": 5}, {"title": "Ryan made my experience great", "text": "Ryan made my experience great. It was simple. I was honest about the condition of my vehicle and got an instant offer. I accepted the offer and was pleased there was no variation to the offer when Ryan inspected my vehicle.", "rating": 5}, {"title": "Sale of Mom’s car ", "text": "My Mom passed away and I had to sell her car. The manager, Jerry walked us through a complicated transaction. He did a great job explaining what we had to do and what documents were needed. We received a fair price and he made a difficult process as easy as possible. My wife and I were very grateful ", "rating": 5}, {"title": "John was on time", "text": "John was on time, very thorough and explained the process step by step and made us so comfortable. He was so personable.  We got a fair price.  He is such an asset to the  company.  Keep up  the  good work.The Ingrams", "rating": 5}, {"title": "Dominic was very personable and great…", "text": "Dominic was very personable and great overall representative and guy. ", "rating": 5}, {"title": "Great experience", "text": "Great experience ", "rating": 5}, {"title": "Rick was awesome", "text": "Rick was awesome, informative, and explained the process the entire time. Start to finish it was a great experience.", "rating": 5}, {"title": "Customer service is best", "text": "Customer service is best ", "rating": 5}, {"title": "Great experience.", "text": "Great experience. ", "rating": 5}, {"title": "Allentown PA", "text": "We had a positive experience dealing with We Buy Any Car on Hanover Ave in Allentown. I got a phone call the day I completed the online form and all requirements were explained as well as the process used to determine the purchase price. The inspection and paperwork for the sale was completed in just about one hour.", "rating": 5}, {"title": "Scott Montgomery provided us with…", "text": "Scott Montgomery provided us with excellent customer service. He answered all our questions and we received an offer on our car which was very favorable. Get help!", "rating": 5}, {"title": "Positive experience in stressful moment", "text": "William was helpful, efficient, and engaging. Thank you!", "rating": 5}, {"title": "Ms.Daphne …", "text": "Ms. Daphne made my car selling experience extremely easy, and was very personable & professional.  I will definitely recommend this branch for anyone selling a car.", "rating": 5}, {"title": "Scott was great!", "text": "Scott was great! Very professional and straight forward.", "rating": 5}, {"title": "Jacob was great to work with", "text": "Jacob was great to work with. He made everything easy and quick. ", "rating": 5}, {"title": "Everything was very easy", "text": "Everything was very easy ", "rating": 5}, {"title": "Tom explained everything he was doing…", "text": "Tom explained everything he was doing during his inspection.  He had great customer service skills and we felt very comfortable with him. ", "rating": 5}, {"title": "    N/a……", "text": "N/a……………….", "rating": 5}, {"title": "Lacey was fantastic", "text": "Lacey was fantastic, she had everything set up and ready and was very friendly and professional!", "rating": 5}, {"title": "Fair and easy transaction.", "text": "Hector was clear about the procedure and gave a better price than Carmax and the dealership.", "rating": 5}, {"title": "A fast easy nice to do employee very…", "text": "A fast easy nice to do employee very nice to do business with. ", "rating": 5}, {"title": "Trustworthy", "text": "Trustworthy. Easy.  That was my experience with selling my vehicle. William was excellent at explaining the process and walked away with a check.", "rating": 5}, {"title": "Very professional.", "text": "Very professional and fair pricing.", "rating": 5}, {"title": "Very relatable agent", "text": "Very relatable agent. Easy to work with. ", "rating": 5}, {"title": "100% legit!", "text": "Ravi Delehanty the general  manager is AWESOME! It was a great experience. I will never trade in another car again. Ravi gave us a fair deal. Everything was completed in about an hour. At first I was a little worried because of the location but this is 💯 % legit.  We got a check and cashed it the very next day. We could not be happier! Thank you Ravi.", "rating": 5}, {"title": "Christian was an excellent ", "text": "Christian was an excellent representative for your company. He was knowledgeable,polite, and made the process extremely satisfying. ", "rating": 5}, {"title": "Very professional and courtesy!", "text": "Date of experience: October 23, 2024", "rating": 5}, {"title": "Great experience!", "text": "Date of experience: October 23, 2024", "rating": 5}, {"title": "Easy and quick", "text": "I scheduled an appointment, and a few minutes later, the branch manager called to confirm the car details, timing, and location of the appointment. Shawanda was very helpful and walked me through the whole process. She shared with me her findings from the car inspections and gave me a good offer for my car. The whole process took about 30-45 minutes and I walked out with a check and $25 voucher for a Lyft ride home. It was a much better experience than having my car evaluated for trade-in at a dealer store and I got a better offer as well. Highly recommend!", "rating": 5}, {"title": "Just as advertised", "text": "Just as advertised, it really could not have been easier.Brendan Keenan at the Silver Spring Md. location was Great to work with, even called the next day as a follow up. ", "rating": 5}, {"title": "Great customer service, very spammy company.", "text": "The associate I dealt with this time was excellent, but the company itself sends too many messages, emails and calls. Super low ball to start, but went up significantly as soon as I said as much.", "rating": 4}, {"title": "Gabriel was efficient and thorough", "text": "Gabriel was efficient and thorough.  She was very pleasant to work with.", "rating": 4}, {"title": "The representative was very…", "text": "The representative was very knowledgeable. It was my ignorance on not knowing the procedure.", "rating": 4}, {"title": "Everything was very straightforward and…", "text": "Everything was very straightforward and easy to understand. Thank you for making the process easy. I will recommend to everyone.", "rating": 5}, {"title": "It was a great interaction overall", "text": "It was a great interaction overall. Titus did a good job of welcoming me in and discussing how the process worked. We talked about cars and life experiences. Overall good experience!", "rating": 5}, {"title": "He made it very easy and only took…", "text": "He made it very easy and only took about an hour. ", "rating": 5}, {"title": "see above", "text": "Simple: William went truly out of his way to assist me after the storms, taking in my car which should not have been returned to his location.  He kept in daily contact, recognizing the stress I was under (I am 83). eternally grateful William!!!", "rating": 5}, {"title": "Great experience.", "text": "Gio was polite and courteous. He answered all our questions honestly and professionally lHe made the selling process a good experience.", "rating": 5}, {"title": "Checked out my vehicle…did paperwork in…", "text": "Checked out my vehicle…did paperwork in a timely fashion…got check and left.", "rating": 5}, {"title": "The experience was quick and easy", "text": "The experience was quick and easy. Deana was great and is a genuinely nice person. She was very transparent every step of the way. I would absolutely recommend We Buy Any Car.", "rating": 5}, {"title": "Jim Trumbo was excellent", "text": "Jim Trumbo was excellent in providing me with helpful information, patient, answered all my questions, and sent me along with some wisdom about buying future cars. I would recommend him to anyone trying to use we buy any car for their services!! ", "rating": 5}, {"title": "Alicia did great and walked through the…", "text": "Alicia did great and walked through the process well. communicated the steps and real time activity .", "rating": 5}, {"title": "Amazing Experience ", "text": "From start to finish was amazing.  I called to inquire about services and Curtis answered the call and explained how it works and also made follow up calls to help guide me through the process.  I went to the appointment and met Daniel, who was so kind, professional, courteous, efficient and patient.  He made sure all my questions and concerns were addressed and all the paperwork was in order and complete. Amazing experience all around.  Highly recommend this company. ", "rating": 5}, {"title": "It was easy transaction went smooth 2018 Dodge ram and…", "text": "It was easy transaction went smooth and quickly", "rating": 5}, {"title": "Good experience ", "text": "Haneef presented great customer service. Easy process.", "rating": 4}, {"title": "Friendly service and transparent business practices.", "text": "Friendly service and transparent business practices. Jeremy was great to work with. I was satisfied with the methods they used to evaluate and buy my car. ", "rating": 5}, {"title": "Quick", "text": "Quick, friendly, organized and responsive ", "rating": 5}, {"title": "Deanna was extremely helpful and…Deanna is the best!!!", "text": "Deanna was extremely helpful and informative. She even explained to me what I should do when I by my next car. I was truly impressed by her knowledge of the car buying and selling process. ", "rating": 5}, {"title": "Salesperson was on time", "text": "Salesperson was on time, friendly and knowledgeable.", "rating": 5}, {"title": "Sherry was very respectful and honest…", "text": "Sherry was very respectful and honest right up front.Smooth transition,", "rating": 5}, {"title": "Fast", "text": "Fast, hassle free, and friendly service.", "rating": 5}, {"title": "Very professional", "text": "Very professional guy", "rating": 5}, {"title": "Positive Experience", "text": "Daniel was professional, courteous and truthful.  The process was very easy and we were very happy with what amount was offered to us.  It definitely beat a trade-in.", "rating": 5}, {"title": "Second time we used service", "text": "Second time we used service. Lee is simply one of your most important people. Top of the list in every way!", "rating": 5}, {"title": "Buyer showed up on time and it was a…", "text": "Buyer showed up on time and it was a good experience", "rating": 5}, {"title": "Dustin and Dominick were very helpful…", "text": "Dustin and Dominick were very helpful and transparent throughout the process. We were offered a fair amount for a that literally died after pulling into the location. ", "rating": 5}, {"title": "Shawn was courteous", "text": "Shawn was courteous, professional, and friendly.", "rating": 4}, {"title": "Tell your friends. ", "text": "I made the appointment because WeBuyAnyCar.com gave me the best offer online, and they did not disappoint. Easy process, pleasant interaction, 30 minutes start to finish.  ", "rating": 5}, {"title": "Stress free ", "text": "Communication was great. On time and Von was honest, friendly and made the process stress free. I have horrible social anxiety and I’m so glad I got paired with someone I could ease my worries with and trust. Thank you so much so much for buying my car and listening to me gush about my love for rats. ", "rating": 5}, {"title": "Chris Brainard was very efficient and…", "text": "Chris Brainard was very efficient and helpful in guiding us through all the paper work. The car was in a trust which made the process more complex. He was friendly and polite and a pleasure to work with. ", "rating": 5}, {"title": "Friendly service", "text": "Date of experience: October 19, 2024", "rating": 5}, {"title": "The customer service was great", "text": "The customer service was great, the woman that attend to me was wonderful 10/10, please keep her she is plus in that company ", "rating": 5}, {"title": "Curtis was wonderful to work with - patient, helpful and transparent through the entire process. We will definitely be back to sell our cars in the future!", "text": "Curtis was wonderful to work with - pâti- ", "rating": 5}, {"title": "I went into the office anxious and…", "text": "I went into the office anxious and nervous,but Tyler put my mind at ease.I don't enjoy car lot type businesses,but this went very smoothly! Thanks for a good experience!!", "rating": 5}, {"title": "Easiest way to sell your car.", "text": "Date of experience: October 21, 2024", "rating": 5}, {"title": "Very professional", "text": "Date of experience: October 22, 2024", "rating": 5}, {"title": "Fair deal with my vehicle", "text": "Fair deal with my vehicle. Was seemless from start to finish. Thx!", "rating": 5}, {"title": "A+ Experience ", "text": "It was a quick and easy experience. Friendly staff and I was taken care of throughout the process.", "rating": 5}, {"title": "The process was simple and he explained…", "text": "The process was simple and he explained everything.  Highly recommend. ", "rating": 5}, {"title": "Amazing experience", "text": "Amazing experience. Very honest and professional.", "rating": 5}, {"title": "Both Craig & Penny were knowledgeable", "text": "Both Craig & Penny were knowledgeable, courteous, and explained everything to my satisfaction. They gave me their full attention & made the process of selling my vehicle a positive experience.", "rating": 5}, {"title": "Fast and easy!", "text": "Fast and easy! ", "rating": 5}, {"title": "It was fast n easy", "text": "It was fast n easy", "rating": 4}, {"title": "My customer service representative was…", "text": "My customer service representative was professional, courteous and cheerful. She explained what was happening each step of the way through her procedure.", "rating": 5}, {"title": "Luis was great to work with and very…", "text": "Luis was great to work with and very thorough.", "rating": 5}, {"title": "Josh was excellent", "text": "Josh was excellent.  Although I felt as a better price was in order, Josh explained everything in detail and my understanding was enhanced.   Excellent service and follow-up!Very prompt with all communications.", "rating": 5}, {"title": "Reiki excellent service ", "text": "Reiki was fantastic! explained everything very well, good attitude and had excellent customer service and sales abilities! 10/10 would recommend. ", "rating": 5}, {"title": "Easy", "text": "Easy, no hassle, straight forward and quick ", "rating": 4}, {"title": "Great experience", "text": "Your man was friendly and knowledgeable", "rating": 5}, {"title": "great service from sheri", "text": "great service from sheribest customer service i experiencethanks again sheri!", "rating": 5}, {"title": "Quick and profession", "text": "Quick and profession. Did not mislead or lead us on. ", "rating": 5}, {"title": "While we were not able to arrive at our…", "text": "While we were not able to arrive at our desired price, the experience at \"webuyanycar\" was simple and quite seamless.  We were in and out of there in one hour. Bernardo communicated well, was friendly and professional, and took care of everything!", "rating": 4}, {"title": "Cars", "text": "Very quick and easy to sell my car.", "rating": 5}, {"title": "I took my 22-year-old car to sell", "text": "I took my 22-year-old car to sell. Everyone at the Fletcher office was nice. Dustin's customer service is excellent. He is training and learning fast. There is one thing I didn't like. Even though we agreed the price of sell. The vehicle purchase agreement states  a different purchase price I received.  Purchase price minus documentation fee equal check amount.", "rating": 4}, {"title": "Highly recommend!", "text": "I just completed my second transaction with this location and couldn't recommend it more highly. Jim is friendly and helpful, and he worked to get us the best price possible for a very old car! The process was smooth, quick, and easy.", "rating": 5}, {"title": "Fair and reasonable ", "text": "Wonderful experience.   No high pressure. Fair and upfront regarding the basis of the offer", "rating": 5}, {"title": "Bob was very helpful.", "text": "Bob was very helpful.   ", "rating": 4}, {"title": "Donald was fair", "text": "Donald was fair, honest and sensitive to my elderly mother’s situation…Thanks", "rating": 5}, {"title": "very nice ,get cash fast", "text": "very nice ,get cash fast ", "rating": 4}, {"title": "Get sale your car to Kyle!!very fair price for your vehicle from webuyanycarusa!", "text": "This is my first experience with the company and was very satisfied! I worked with Kyle who was very friendly and professional in evaluating my vehicle and explaining the process. I learned much about their multi-point checklist which allow me  to understand how they priced my car and I felt I would get a fair price. In the end , we agreed on a very fair price and felt we were both happy with the outcome . I highly recommend seeing them first!! KD", "rating": 5}, {"title": "Simple", "text": "Easy process", "rating": 5}, {"title": "salesman ------", "text": "Date of experience: October 20, 2024", "rating": 5}, {"title": "Great representative Tom", "text": "Great representative Tom. He was knowledgeable, professional and courteous. Gave me a very fair price. ", "rating": 5}, {"title": "Fast and efficient ", "text": "The process was very straight forward and efficient. Pedro, the branch manager, was very knowledgeable and personable which made the whole process quite easy.", "rating": 5}, {"title": "Brand was nice and very helpful", "text": "Brand was nice and very helpful. I would recommend We Buy Any Car!", "rating": 5}, {"title": "Quick and easy vehicle sale", "text": "Terry and Donald made our experience easy and efficient.   They were very helpful, and we have no complaints.", "rating": 5}, {"title": "fast and efficient", "text": "fast and efficient, I had no complaints.", "rating": 5}, {"title": "I love the Customer service aspect they…", "text": "I love the Customer service aspect they were helpful, Knowledgeable about the selling experience. Both of the gentlemen in the office were helpful.  ", "rating": 5}, {"title": "Fast service", "text": "Fast service. Everyone was helpful and considerate. ", "rating": 5}, {"title": "It was quick and easy.", "text": "Date of experience: October 20, 2024", "rating": 5}, {"title": "My agent Xavier was a stand out.", "text": "Date of experience: October 18, 2024", "rating": 5}, {"title": "Brendan built your brand", "text": "Brendan was helpful, friendly and flexible - he stayed after hours to meet with me. Excellent experience, just wish I rec'd a bit more for the car.", "rating": 4}, {"title": "Honest evaluation", "text": "Honest evaluation. Quick and professional ", "rating": 5}, {"title": "Smooth experience and Konrad explained…", "text": "Smooth experience and Konrad explained the whole process throughout!", "rating": 5}, {"title": "Oz Rocks!", "text": "Oz made the experience of selling our vehicle smooth and easy! Thank you!!!", "rating": 5}, {"title": "Great customer service ", "text": "Quick and easy!  ", "rating": 5}, {"title": "Tim Ray was very helpful and provided…", "text": "Tim Ray was very helpful and provided excellent customer service.  I felt my car was worth more than offered but Tim made the overall experience more palatable.", "rating": 4}, {"title": "Respect and kindness about all else.", "text": "I had gotten a quote from CarMax and due to the rudeness from the employee I decided to go elsewhere. I hear about We Buy Any Car and gave a call. Craig spoke to me on the phone and set an appointment for the next day. When we arrived he was very polite and kind. The other gentleman working with him was very attentive towards my mother. The two could not have been kinder or more respectful. When doing business it is not first the money, it is how your are being treated. I believe all were happy with the transaction. Thank you", "rating": 5}, {"title": "John is very helpful", "text": "John is very helpful. He gave us fair assessment and we got everything done in 1hour. Will do business again.", "rating": 5}, {"title": "The branch manager Bob made the process…", "text": "The branch manager Bob made the process easy and exceeded our expectations. ", "rating": 5}, {"title": "The representative was polite and…", "text": "The representative was polite and courteous", "rating": 4}, {"title": "Impressive Service!!", "text": "We were treated with professional yet friendly respect by a very knowledgeable manager. Each step of the amazing thorough inspection of our car was explained to us as it proceeded. We were impressed by the entire experience and would highly recommend We Buy Any Car to our close friends and relatives!", "rating": 5}, {"title": "Quick and Easy", "text": "Darius explained everything he was doing step by step and made the whole process easy to understand.  He was so nice and so helpful and the sale process was extremely smooth. I felt like this was the best option for the car. ", "rating": 5}, {"title": "The process was easy and honest", "text": "The process was easy and honest. Everything was explained well from original online quote to final sale price. We did not feel pressure. I would recommend We Buy Any Car if someone does not want the hassle of selling a vehicle.", "rating": 5}, {"title": "I sold a car to WeBuyAnyCar (Brookline…update. I just want to say that Webuyanycar reached out. Jim, the Manager did a good job when dealing with my family. I would add a star to this review.", "text": "I sold a car to WeBuyAnyCar (Brookline Office) on Saturday, 10/19/2024.  I want to say that Jim was very pleasant to deal with.   That being said, your website should state that there is a $399.00 fee for transactions, title, forms, etc. that will be deducted from the price of the car. Also the appraisal of the car was 9444.00. The appraisal also showed one accident which we were unaware of.  We were told by Jim that he could not tell what kind of accident it was.  We do not know if it was a severe accident or a minor fender bender. When we went for our appointment and Jim test drove and inspected the car he came back with an offer of 4006.10.  I understand that when you fill out the info on the website you should expect some devaluation on the initial appraisal.  But seriously, almost half!  Unfortunately we are trying to liquidate an estate and needed to dispose of the car sooner rather than later.  I certainly would never go to any WeBuyAnyCar branch again.  ", "rating": 3}, {"title": "Everyone was knowledgeable and…", "text": "Everyone was knowledgeable and professional. The entire transaction was transparent and well executed, no questions left unanswered. There was no pressure to sell and 100% honesty from entire staff ", "rating": 5}, {"title": "Very Smooth Process", "text": "Titus informed me of all the material I needed to bring to the appointment. He was very knowledgeable and helpful, and allowed for an efficient transaction.", "rating": 5}, {"title": "Mr. Tom", "text": "Mr. Tom very helpful and pleasant.  He was professional, honest and worked with us to get a satisfactory price on our vehicle. ", "rating": 5}, {"title": "Donald was terrific", "text": "Donald was terrific!  He was very welcoming yet professional. I had a little glitch in my transaction and couldn’t leave my car on the first day. He worked with me and accommodated my schedule on the next day.I would do business with him again.", "rating": 5}, {"title": "Lutz FL review", "text": "Dominic and Dustin were thorough and timely;  I appreciated the Uber voucher. ", "rating": 5}, {"title": "Easy-Peasy Lemon Squeezy", "text": "The whole process was easy-peasy.   Very friendly manager and explained everything perfectly.  We felt like we got a fair value for our vehicle.  We did not want the hassle of a personal sale so this was the perfect fit for us.  ", "rating": 5}, {"title": "It was fast with an easy process", "text": "Date of experience: October 17, 2024", "rating": 5}, {"title": "Smooth and Easy ", "text": "Pedro was friendly and knowledgable; he even gave me useful tips regarding general vehicle maintenance and care. The transaction went smoothly! ", "rating": 5}, {"title": "Pedro was professional and made the…", "text": "Pedro was professional and made the process easy and seamless.", "rating": 5}, {"title": "We buy any car +++++++++", "text": "Dealing with Jim R is a delight. So easy to work with. He is honest and very upfront. This is the 2nd time I have brought a car there and I am very satisfied. I would definitely recommend Jim R and his team and I will definitely be back.", "rating": 5}, {"title": "Terri was great she made everything easy. ", "text": "Terri was great. Very helpful. Made the entire experience easy. ", "rating": 5}, {"title": "Simple, fast and pleasant", "text": "The whole process was incredibly easy and the attendant came to my house. He was polite, upfront and helpful. After 30 minutes the deal was done and we had a check.", "rating": 5}, {"title": "A great place to sell your old car!", "text": "My experience with this webuyanycar.com branch office in Goodlettsville TN approved that this is a great to place to sell your old, used car. The manager Jim not only offered a fair value for my car but also made this selling process painless to go through. I truly appreciate their professionalism and care for customers.", "rating": 5}, {"title": "Fast and easy process", "text": "Fast and easy process ", "rating": 5}, {"title": "It was a great", "text": "It was a great, easy experience. Ed Moore was very knowledgeable and easy to work with. I would recommend We Buy Any Car USA and would go back to this location again if I have another car to sell. ", "rating": 5}, {"title": "Konrad was great to work with", "text": "Konrad was great to work with ", "rating": 5}, {"title": "Fast service and offered reasonable…", "text": "Fast service and offered reasonable price for car", "rating": 5}, {"title": "Friendly", "text": "quick, easy, friendly & no nonsense service", "rating": 5}, {"title": "Carmen was great", "text": "Carmen was great! She took care of me", "rating": 5}, {"title": "Shane was wonderful to work with.", "text": "Shane was wonderful to work with.He had to go some extra miles to help us sell our car. He explained everything well. He made this experience easy.  We received a very fair price too. I would recommend them for selling your car.", "rating": 5}, {"title": "The sales person", "text": "The sales person, Laila, was very nice and courteous, and explained the process completely. ", "rating": 5}, {"title": "Jen was professional and explained the…", "text": "Jen was professional and explained the process throughout.  Thank you Jen", "rating": 5}, {"title": "Got a same day appointment", "text": "Got a same day appointment, representative Gio did a great job explaining the process and then efficiently went through the steps to inspect and access the value and make and offer to purchase the car.  Based on the condition and age of the car. I though the offer was fair and agreed.  Gio then quickly processed the paper cut me check and even provided me with a  coupon number for a ride share service so i could get home", "rating": 5}, {"title": "Easy to make an appointment", "text": "Easy to make an appointment, total experience only took about an hour.  Brandon was great.", "rating": 5}, {"title": "Experience at Elmwood Location", "text": "Bernardo was very helpful and efficient throughout the whole process. Very nice and got me the best deal I could get for my very old car. Would highly recommend. ", "rating": 4}, {"title": "Second time I have sold a car at We…", "text": "Second time I have sold a car at We Buy. So fast and fair. They have started with the Kelly Blue quote (I checked) both times.", "rating": 5}, {"title": "Pete was from initial call to final…", "text": "Pete was from initial call to final sale of our Civic .  Thank you ", "rating": 5}, {"title": "quick and easy", "text": "Date of experience: October 19, 2024", "rating": 5}, {"title": "Very nice and very professional rep you…", "text": "Very nice and very professional rep you have. He was caring and made us trust the process. ", "rating": 5}, {"title": "Quentin did a good job of being…", "text": "Quentin did a good job of being friendly, giving us details that we needed, even though the offer was a lot lower than I was hoping for.", "rating": 5}, {"title": "Webuyanycar experience ", "text": "My experience with webuyanycar was pleasant and easy. The evaluation of the car thorough and efficient. The whole process was explained thoroughly before Kyle started the process.", "rating": 5}, {"title": "It was very convenient and quick way to…", "text": "It was very convenient and quick way to sell my car. The staff was very pleasant and helpful. ", "rating": 5}, {"title": "Mike was extremely knowledgeable", "text": "Mike was extremely knowledgeable. Professional, thorough and polits.", "rating": 5}, {"title": "Quick and easy", "text": "Date of experience: October 18, 2024", "rating": 5}, {"title": "I was sad to sell my car since it was…", "text": "I was sad to sell my car since it was my husband car.  I kept it clean, no accident, driving minimum and kept in garage, so the value of the car should be maximum.  If I keep it longer, it would be a classic Mustang.  But our garage is only two car garage, and felt it is time to release the emotional attachment.  Selling price was not that I wanted, but it's time to sell.  Luis I dealt with was very polite and pleasant.  I could tell he is very experienced on all kind of emotional situations.  That was help.", "rating": 5}, {"title": "I would say try to go defiantly somewhere else ", "text": "We agreed about the money then they tell me to bring the title. I came back with it the next day they give me less money. So they are using the costumers. ", "rating": 1}, {"title": "Your representative Chris was awesome", "text": "Your representative Chris was awesome!  He handled everything professional and efficiently.  Great service!", "rating": 5}, {"title": "Thank u for everything", "text": "Thank u for everything ", "rating": 5}, {"title": "Mylann was very courteous", "text": "Mylann was very courteous. He made me feel comfortable, and the process was easy. Even though the offer was not as much as what was evaluated online, it was still a generous offer and more than the trade-in value of the truck. This is the second vehicle I sold to webuyanycar.com and their team is very generous with a well maintained vehicle.", "rating": 5}, {"title": "Very helpful", "text": "Very helpful. Easy and simple process", "rating": 5}, {"title": "Excellent customer service", "text": "The customer service was awesome all around from first making the appointment to actually making a deal on the vehicle.  We would definitely sell to We Buy Any Car again!", "rating": 5}, {"title": "Haneef was kind and considerate very…", "text": "Haneef was kind and considerate very good experience would recommend them to anyone", "rating": 5}, {"title": "The process was simple", "text": "The process was simple, quick and fair. Jim was upfront and a pleasure to deal with. ", "rating": 5}, {"title": "He made everything easy and he…", "text": "He made everything easy and he explained everything. Good customer service ", "rating": 5}, {"title": "We Buy Any Car.Com...Any, Any, Any", "text": "Jeff, at We Buy Any Car. Com was extremely helpful, and gave us a fair evaluation and price for our car. Within less than an hour, we walked away with a check in hand, and were completely satisfied.", "rating": 5}, {"title": "Good processing detail report on car on…", "text": "Good processing detail report on car on sales with valuations of price for plus sign for purchaser easy cash in. Friendly and cooperative purchase manager.", "rating": 5}, {"title": "Bernard is the absolute best", "text": "Bernard is the absolute best! Informative pleasant and easy to work with I cannot say enough - he has handled the buying of 3 cars for us. Thank you ", "rating": 5}, {"title": "Couldn't have been easier!", "text": "Date of experience: September 11, 2024", "rating": 5}, {"title": "Made the selling process easy ", "text": "Made the selling process easy , Thanks to Pedro", "rating": 5}, {"title": "Quick process", "text": "Quick process, reasonable offer. Not clear why initial offer was so low .", "rating": 4}, {"title": "This is the second time I went to…", "text": "This is the second time I went to Webuyanycarsusa. I sold both my cars to them, the experience was very good. Raymond was polite, explained the whole process and I got a fair price both times.", "rating": 5}, {"title": "being poliJoete and honest", "text": "being polite and honest", "rating": 5}, {"title": "The process was simple and Rick was…", "text": "The process was simple and Rick was professional and a pleasure to deal with.", "rating": 5}, {"title": "Friendly", "text": "Friendly, knowledgeable and helpful service.", "rating": 5}, {"title": "First time selling my truck", "text": "The price they said on computer was different than what I sold my truck for. I agreed to price. ", "rating": 5}, {"title": "No problems work with Larry", "text": "No problems work with Larry. Everything he said was open and honest", "rating": 5}, {"title": "I was very anxious about this…", "text": "I was very anxious about this interaction but Don and Patrick made it as painless and easy as possible!  I would recommend We Buy Any Car to anyone interested in a fair, friendly, fast transaction.", "rating": 5}, {"title": "Ellie was great!", "text": "Ellie was great! ", "rating": 5}, {"title": "Scammed", "text": "The response here was a passive-aggressive reply - 50k worth more than you essentially.The area manager called , left a vm , I called back and no response so left a vm, same again. He should be all over this and asking when I am available for feedback to have a direct chat. Felt scammed and lowballed from the start. “The algorithm says your car is worth $100”“There is structural damage” No proof offered and the car was meticulously maintained and serviced. There is none.Online quote was $1600 which was less than half of dealer/KBB quoted anyway.“What do you want and I’ll see what I can do but the 1600 comes down to 1300 with doc fees and there is … body… structure …. That deducts even more ““You have to pay for the document fees” What?Never again", "rating": 1}, {"title": "Lee made the transaction seamless and…", "text": "Lee made the transaction seamless and she's awesome.Made me feel welcome like we knew each other for awhile although it was the first time meeting her. This is way better than being haggle by the stealership/dealership. I recommend 10/10", "rating": 5}, {"title": "Positive experience.", "text": "Very friendly staff and well versed in their job. Just a positive experience all around.", "rating": 5}, {"title": "Manager was very helpful", "text": "Manager was very helpful. The process was very smooth.", "rating": 5}, {"title": "He explained the process and encouraged…", "text": "He explained the process and encouraged me to observe and ask questions. I felt he did a excellant job presenting my car to the boss to get a fair price. I would definitely do business with him again", "rating": 5}, {"title": "Knowledge is perfect", "text": "Knowledge is perfect ", "rating": 5}, {"title": "Fair Price -  Excellent Service ", "text": "I appreciate that Kevin was able to work with my schedule. He gave me a price and was able to hold that price for 24 hours while I cleaned out my car. I will not hesitate to send friends and family to Kevin and WeBuyAnyCar.com", "rating": 5}, {"title": "Thank you Rick!", "text": "Rick was so amazing to work with! He was a genuine guy that you can tell is truly just a kind human in his every day life! I had so many issues trying to get my title and he remained patient throughout! Definitely went above and beyond for me, especially with Hurricane Milton hitting at the exact same time! Great customer service does exist and I’d 10/10 work with him and this company again! :) ", "rating": 5}, {"title": "Lee was able to explain the process of…", "text": "Lee was able to explain the process of selling the car. Very professional in her demeanor.able to put the customer at easeb and able to go above and beyond the call of duty to decrease the customer . ", "rating": 5}, {"title": "Best Pricing for your car", "text": "They were friendly, informative, and honest explaining the entire process each step of the way.  We were able to negotiate the price, they beat Car Max's offer, and provided a full check at the end.  I will definitely use them if I need to sell my car again.  ", "rating": 5}, {"title": "Terry was efficient", "text": "Terry was efficient, pleasent , knowledgble and kept us informed as to what was going on with the car.I'm finish giving reviews!!", "rating": 5}, {"title": "Dominic tortaglia", "text": "Date of experience: October 18, 2024", "rating": 5}, {"title": "Criag was great ", "text": "Criag was great , very smooth process and had great customer service. Definitely will recommend to friends and family ", "rating": 5}, {"title": "Brandon was awesome!", "text": "Date of experience: October 13, 2024", "rating": 5}, {"title": "Dorian was great to work with", "text": "Dorian was great to work with. He was friendly and yet very professional. He answered all my questions with straightforward answers. He fully briefed me on the criteria he used to evaluate the sale price of the car. We came to a mutually agreed price for the car which made  both of us happy. My wife is handicapped and Dorian made every consideration to ensure she did not have to leave the car to sign off on the paper work. Overall, working with Dorian was a positive experience.", "rating": 5}, {"title": "Everything was done with professional…", "text": "Everything was done with professional help and was done with the customer in mind. ", "rating": 5}, {"title": "The car selling experience was fast and…", "text": "The car selling experience was fast and easy. I got a fair price on my vehicle and was completely satisfied with the service I received. The buyer I felt with, Kyle, was friendly, knowledgeable, and professional.", "rating": 5}, {"title": "Easy to work with manager.", "text": "Easy to work with manager.Friendly Curtious", "rating": 5}, {"title": "Felix was honest and I like being…", "text": "Felix was honest and I like being around and working with people that are honest and don’t sugarcoat anything.", "rating": 5}, {"title": "Excellent Experience", "text": "We had a great experience at WBAC on Capital Blvd because Daphne MacDonald provided outstanding customer service.  She was very professional and friendly with excellent communication skills. Daphne fully explained what she was checking during the inspection process and the purpose of each form we signed during the administrative process. Overall, we were impressed with the efficiency and ease of working with WBAC - an inspection, some paperwork, and you walk out with a check. The roughly 2-hour procedure couldn't be any easier, and we believe we received a fair price for our vehicle. ", "rating": 5}, {"title": "I thought it was a stress-free and fair…", "text": "I thought it was a stress-free and fair experience. Matthew was great to work with and the whole thing only took about an hour. My only note is that I missed the building initially because I was looking for a lot. It is more of a building with a garage and a side parking lot.", "rating": 5}, {"title": "The rep was very nice and explained…", "text": "The rep was very nice and explained everything so I could understand ", "rating": 5}, {"title": "Xavier was very professional and…", "text": "Xavier was very professional and explained the valuation process clearly and transparently. Although we had hoped to get more for our car we were glad that the process was simple and efficient.  Xavier was a pleasure to deal with. ", "rating": 5}, {"title": "👍👍👍 Great best ever", "text": "👍 Tell all my friends👍👍", "rating": 5}, {"title": "Stuart was great", "text": "Stuart was great. He explained the entire process before and during the whole thing.It was quick and painless. It only took about 45 Min.", "rating": 5}, {"title": "Cheryl was very helpful and friendly.", "text": "Cheryl was very helpful and friendly. ", "rating": 5}, {"title": "The person who help me throughout my…", "text": "The person who help me throughout my deal .", "rating": 5}, {"title": "The person I dealt with was very…", "text": "The person I dealt with was very professional ", "rating": 5}, {"title": "Adam made the experience super easy and…", "text": "Adam made the experience super easy and fast. Would highly reccomend to anyone", "rating": 5}, {"title": "They r very professional ", "text": "Very courteous and professional ", "rating": 5}]