[{"title": "Fast transfer", "text": "I'm very glad with WU system , cause it has a comfortable menu  that is very simple to use and the process of sending money is really very fast. ", "rating": 5}, {"title": "Understandable ", "text": "There are always things which need upgrading and in cases like mine where you are an elder person things should be made easier to understand. Otherwise it is easy enough to understand.", "rating": 3}, {"title": "It works quite good", "text": "It works quite good. At the beginning it takes a little bit of patience, about 1 or 2 minutes as the login repeatadly comes and disappears.", "rating": 4}, {"title": "My money is always sent without any…", "text": "My money is always sent without any conflict. I have been a customer for several years. Once I received and my points via of gift card. Now I noticed that points given is very slowly accruing. I love using the western union. I feel safe using it. ", "rating": 5}, {"title": "WU works", "text": "WU works. I use it at least twice a month, as it is fast and reliable. It takes less than a minute to transfer to a bank account on the other ide of the world and the same to a WU agent somewhere in Africa.", "rating": 5}, {"title": "Faster and better than most of the…", "text": "Faster and better than most of the banks out there definitely my go to place for transfers", "rating": 5}, {"title": "Good service and quick.", "text": "No hassle,  fast and fees are ok (30 % of what you pay via credit card, However one point is not correct; the monthly limit of 1000 EUR. Sometimes - in emergency situations - you need more and then its getting complicated.", "rating": 4}, {"title": "You do your thing well and reliable and…", "text": "You do your thing well and reliable and affordable through the years, you're a life-line. ", "rating": 4}, {"title": "The service is very good very…", "text": "The service is very good very efficient,Fast and easy, i love this platform it makes my life so easy thank you western union thank you who ever is behind this success ⭐️⭐️⭐️⭐️⭐️⭐️", "rating": 5}, {"title": "I don't know what is suddenly happening…", "text": "I don't know what is suddenly happening with WU. Only had one historic bad experience but now two payments have gone missing in three days! The customer service and lack of correspondence is shocking. You have been warned!", "rating": 1}, {"title": "Its so much faster and better than…", "text": "Its so much faster and better than using bank transfer", "rating": 5}, {"title": "I am Erik De Pauw ", "text": "I am Erik De Pauw , from Belgium , Good system and nace girl , very professional , helped me today. Good Luck , ( French Bonne  chance)", "rating": 5}, {"title": "FYI ‼️‼️worst possible way to send your…", "text": "FYI ‼️‼️worst possible way to send your money is trough this WESTERN APPLICATION! your expecting maximum 24hrs for your money to be sent in your account yet this western union will hold your money. imagine i sent the money 24hrs ago yet when i tried to follow up my money, the costumer service said that my money will be sent on NOVEMBER 18?! like really Western Union ?! how convenient for you to hold costumer’s money for that long time ? they have the worst costumer service and you cant rely on them specially when that money you sent was for emergency purposes. AFTER THIS NEVER AGAIN WESTERN 👎🏻❌🙅‍♂️", "rating": 1}, {"title": "No one chose their race, humanity is the best race. advice", "text": "With advice? And the suggestion of internet friends, I understood that you are trustworthy. Yes, honesty is definitely the key to success.", "rating": 5}, {"title": "PERFECT AND FAST", "text": "Well any time am transfering money I have no problem at all either in process of sending or the procedure for the receipient. The process is so easy and takes less than three minutes to complete", "rating": 5}, {"title": "My money was not transferred in full amount. . …", "text": "I sent money to my friend in Turkey couple times but she is receiving less than what she is supposed to.She was supposed to receive the amount in Turkish lira but Western Union agent said they do not have enough so they gave her the amount in US dollars which is ok. The problem is that they gave her the amount $20 less than what she is supposed to receive.  I checked the amount in Lira, dollar and Euro before i transferred..This is not the first time they do this ..I reported the case but no one called back.  I reported it a second time.. hope someone can assist", "rating": 1}, {"title": "Fast. Safe. Reliable.", "text": "Money can be sent literally in seconds around the world. Fast. Safe. Reliable.", "rating": 5}, {"title": "Western Union has been essential part…", "text": "Western Union has been essential part of paying my bills, this has been a reliable way for be to take care of my expenses. Great service, I would highly recommend the services this company provides.", "rating": 5}, {"title": "Money Transfer", "text": " I have been using Western Union's services for many years and have always had a smooth experience. Their platform makes transferring money simple and hassle-free. I appreciate the reliability and ease of use that Western Union provides for all my transactions.", "rating": 5}, {"title": "100% trust and confidence each time I send ", "text": "Every transfer i send digitally to my fiancé's Gcash in the Philippines she receives within minutes. I've done at least 10 transfers. I've had 0 problems each time. Thank you westernunion.com ", "rating": 5}, {"title": "Cannot change phone number", "text": "Tried updating my phone number, after multiple attempts keep getting same error: \"We're having technical issues. please try again later.\" Asked customer service; they can only deactivate my account so I could try creating another one with the correct number. Their system doesn't work properly AND they cannot change it for me! This is simply mind-boggling.", "rating": 2}, {"title": "It’s not possible to send money using…", "text": "It’s not possible to send money using an iPhone; when the process reaches the authentication stage, it fails and doesn’t show anything. However, the transfer goes smoothly in a browser.", "rating": 2}, {"title": "I have no problem so far in using this…", "text": "I have no problem so far in using this company. They always update and send Info regarding the status of my transaction. It feels so safe..! ", "rating": 5}, {"title": "The Fastest & most secure way to send money!", "text": "Western Union Offers a really streamlined experience. To send money to Vietnam in the past, I would need to physically drive money to a location in Orlando to guarantee my money would be received. Thanks for your service!", "rating": 5}, {"title": "It's super fast and super easy to…", "text": "It's super fast and super easy to transfer money.", "rating": 5}, {"title": "Smooth sending from anywhere you are…", "text": "Smooth sending from anywhere you are registered. And the first transaction is free of charge. Who wouldnt like that?", "rating": 5}, {"title": "It was faster this time than last", "text": "It was faster this time than last. No complications or frozen interface. ", "rating": 4}, {"title": "The connection was slow at first.", "text": "Date of experience: November 04, 2024", "rating": 4}, {"title": "THE ONLY DOWNFALL FOR WESTERN IS THAT…", "text": "THE ONLY DOWNFALL FOR WESTERN IS THAT IT IS NOT AS QUICK AS \"WISE\", BUT I FEEL THE EXCHANGE RATE IS BETTER FOR THE RECIEVER BY ABOUT 8 TO 12%. FEES ARE COMPARABLE.", "rating": 5}, {"title": "Good process but there is an invisible discount", "text": "The transfer process is done quickly and simply, but there is a problem. It says we will receive a specific amount but in fact there is another discount built in and we receive a smaller amount than what is stated on the home page", "rating": 3}, {"title": "Western Union are good service.", "text": "Date of experience: November 03, 2024", "rating": 5}, {"title": "Make sure you keep all stubs and receipts if they are lost", "text": "Don't lose your money orders bc you'll be waiting until Christ comes to get refunded. ", "rating": 1}, {"title": "Highly recommend this service", "text": "Highly recommend this service, even the customer service is really good. Sending money has never been this easy ! Not a bot lol trust me this is a great app to send money home when away from home 🫶", "rating": 5}, {"title": "The website is easy to use and is…", "text": "The website is easy to use and is customer friendly. I can send money with no problems. And they protect my personal Informantion, and help to avoid scammers.", "rating": 5}, {"title": "always swift and good service ", "text": "always swift and good service , even sent to africa, thumbs up", "rating": 4}, {"title": "VERY UNRELIABLE SERVICE", "text": "VERY UNRELIABLE SERVICE. If you need money transferred in minutes DO NOT USE Western Union. I sent money for transfer at around 7.00am on 28/10/2024 to Nigeria as i write it hasn't been received! Customer service do not seem to have the resource to deal with it. They are trained to flob you off. I tried another money transfer company to the same receiver it went instantly! I have literally begging western union to transfer my money or refund my money! Please i am begging western union to please transfer the money. I have no business or contract with the receiver bank. Please please please transfer my money. ", "rating": 1}, {"title": "very fast but no cheap and promotions usually ", "text": "very fast, sure but almost no promotion like Paysend usually allows free sending and adds points for next sending and the sending price is not cheap like Paysend but i have the problem identify so i must transfert here ", "rating": 3}, {"title": "Great experience.", "text": "Great experience.Easy and reliable tool to send money overseas.", "rating": 5}, {"title": "Money transfer is quick and safe", "text": "Money transfer is quick and safe. I highly recommend western union for money transfer. Thank you to the entire team.", "rating": 5}, {"title": "Cannot delete profile and chat is a blank page", "text": "I need to delete my profile. Support page says to contact the customer service, but the page at the link is a blank page with only this text \"Chat is available 24 hours / 7-days a week\" - which sounds like a joke. Tried it in multiple browsers.", "rating": 1}, {"title": "Wow so easy with my card and direct…", "text": "Wow so easy with my card and direct deposits ", "rating": 5}, {"title": "Why the wait?", "text": "its convenient but I dont understand why there is a 30 min review of transfer when ive already done transfers thru you.", "rating": 4}, {"title": "Easy to transfer money", "text": "Easy to transfer money, no hidding fees ", "rating": 5}, {"title": "In times of trouble", "text": "In times of trouble, Western Union was there and made a difficult situation acceptable.Thanks!!", "rating": 5}, {"title": "Stiil a wrong Bankaccount were showed…", "text": "Stiil a wrong Bankaccount were showed on the receipt such as MTCN 9923215146; MTCN 9933936737; MTCN 1593867574. I can't choose my own Bankaccount.", "rating": 3}, {"title": "Your website has not been functioning…", "text": "Your website has not been functioning on desktop and on mobile. It stops as soon as I enter the payment then it doesn’t work. It’s been happening for past couple of months.", "rating": 5}, {"title": "Great service", "text": "Great service. I use Western Union often for my humanitarian work. Their website makes every transaction worry free.", "rating": 5}, {"title": "Easy and reliable ", "text": "Easy, fast and reliable ", "rating": 5}, {"title": "Western Union Bank", "text": "Date of experience: October 28, 2024", "rating": 5}, {"title": "I Western Union will not fulfil their duty of care!", "text": "I was scammed through western union, I deposited €1500 at my local post office for what I believe to be a transaction with the receiver. The idea was I give the receiver the.MTCN after we have completed transaction of the product (a car ) but before I even provided the MTCN  to the receiver the had already collected the money. I was lead to believe my money was safe with western union until the MTCN was provided and this was not true. Western union have been terrible sorting this problem and have just been sending me from one department to the next. One day I’m told I will get a refund and the next day I’m told I will not. ", "rating": 1}, {"title": "I really appreciate being able to get money safely and quickly to my loved one in Thailand. ", "text": "Date of experience: October 13, 2024", "rating": 5}, {"title": "Good Life", "text": "They are trustful an because i work with they before", "rating": 5}, {"title": "Just to send 100$ from UAE to bank…", "text": "Just to send 100$ UAE to bank account in Egypt...it take 15th days....Is too much time all this hard proses after sending money with online services...is too bad transfer service..This last time to use This company..It's easy to go Egypt to handling by my self ", "rating": 1}, {"title": "I have 8 transactions that WU promised…", "text": "02.11. Response regarding your message dear WU. I have sent 5 mails to you without your answers. I have called you, but no call back as your system has been down in all those times when I have called. So please stop that kind of lying and act. You can see my messages for sure. I have 8 transactions that WU promised to return to my account. They have not done it within the time limit promised. I have over 10000 Dkr hanging in their account and they do not even bother to answer to my mails, call me back etc... This is WU Denmark customer service. Absolutely unacceptable. ", "rating": 1}, {"title": "The site is not user friendly", "text": "The site is not user friendly. The bill pay review came up looking totally different than previous, like it was in a new language", "rating": 3}, {"title": "transfer takes too long! ", "text": "the service has been a huge disappointment. If you’re counting on timely transfers, look elsewhere—your money might take days to arrive. I’ve reached out to their support team several times, but all I got were generic, pre-written responses that didn’t help at all. It’s clear that customer satisfaction isn’t a priority for them. The whole process feels unreliable, and if time matters to you, I wouldn’t recommend using this service.EDIT: I provided this identification number of the transfer in my review. where should I send it to so you can take a look? ", "rating": 1}, {"title": "Easy to use service and with a great…", "text": "Easy to use service and with a great overview of all transactions.", "rating": 5}, {"title": "I open my app the sending rate is 39.56…", "text": "I open my app the sending rate is 39.56 I log on its 39.56. I put in amount to be transfered then the sending rate is 37.31. Regardless of pickup or bank account. Disingenuous advertising fix it western thats close to fraud.", "rating": 1}, {"title": "Exchange rates are still low", "text": "Exchange rates are still low; as compared to competition; for example 3700 Colombian pesos per 1 dollar is too low; as compared to 4100 and 4200 to your Competiton", "rating": 5}, {"title": "different exchange rate  ", "text": "Hi guys, I'm sorry, yes, I have to leave you a negative review, but today, after 4 years of using the application monthly, I was very disappointed to discover that my friend, to whom I recommended the application, had a much higher exchange rate than I had oh me, although I refuse to believe that I was so gullible, but today was the last time I used the application and I'm not just talking like that, I have proof of the receipt from you, the same city, the same country, and the exchange rate is different. I greet you with disappointment  ", "rating": 1}, {"title": "Worst customer experience", "text": "Worst customer experience! I tried to send some money to my family in N.Z. and it was a disaster from start to finish. Three times I had to ring up and ask why the money had not been sent, only to be fobbed off with excuses and false promises. I was told I had not replied to an email they had sent (they hadn't), would claim they never received my email when that issue was sorted and they would then process my request within 30 minutes (4 hours later, it was still pending). On the final call, when I proved I had more than sufficient funds to cover the transfer, they wouldn't accept it as I had to provide additional documentation regarding proof of income and amount of assets! As if anyone would provide financial details to a call centre in a third world country! Out of sheer frustration, I cancelled the transaction and now refuse to use this company again. I cannot believe a company can be so inefficient and indifferent to customer service and they should be ashamed of themselves.", "rating": 1}, {"title": "I transfer $50 using Australia post’…", "text": "I transfer $50 using Australia post’ paying cash physically, providing all the information and bank details of the receiver, more than 24 hours, money transfer is on hold. When called 1800, they want me to provide date of birth of the receiver whose bank details already provided. Common sense prevail. My money is on hold, if ask for refund will take 45 days. Looks that I have to lodge official complaint to the govt authorities ", "rating": 1}, {"title": "Unreliable Service and Unhelpful Support – Frustrating Experience with Stuck Transactions", "text": "My recent experience with Western Union has been deeply disappointing. I made two back-to-back transactions, both of which ended up being stuck in \"processing\" for over a week. My funds have been held up with no clear resolution or helpful guidance from Western Union's customer support team.Every time I reached out for an update, customer support offered the same repetitive explanation: the receiver’s bank is unresponsive. However, I tried sending money to the exact same bank account using a different app, and it went through instantly. This clearly indicates that the issue is specific to Western Union, not the receiving bank.To make matters worse, each interaction with customer support felt like a loop, with agents repeating the same vague response and providing no real solution. It's frustrating and concerning that a service as large as Western Union lacks the efficiency and transparency necessary for smooth transactions. I expected more reliability and accountability, especially with funds being held up for this long.Until they improve their support response and issue-resolution process, I’d recommend considering alternative services for smoother and faster transactions.", "rating": 2}, {"title": "Unreliable service ", "text": "Unreliable service, don't expect your money to reach in time, if time is important to you use another service  . Money transfer by them takes days if not weeks. Support don't have any satisfactory answer. I tried contacting support multiple times but received an answer in a pred defined template format.They don't care about the customer satisfaction at all.", "rating": 1}, {"title": "User friendly and sent money within 5…", "text": "User friendly and sent money within 5 minutes! I can paid it using my Dutch bank with IDEAL. Love it!", "rating": 5}, {"title": "Had to send a PHOTO of my card for…", "text": "Had to send a PHOTO of my card for verification. This was after having to send a photo of my passport and after having to authenticate/approve the payment with my bank - which both in itself would be plenty secure enough. To take a photo of my card, I have to still have my card. If I had my card, I would not need to send myself money to Western Union, would I.", "rating": 1}, {"title": "Even after uploading source of fund…", "text": "Even after uploading source of fund every time I sent money, they still ask the source of fund and it is pain in the ass.", "rating": 1}, {"title": "Always prompt and reliable", "text": "Date of experience: November 03, 2024", "rating": 5}, {"title": "You're overcharging to transfer money", "text": "You're overcharging to transfer money. $10.00 is a lot. The exchange rate to Europe is highway robbery.I sent $154 and ended up paying almost $200.", "rating": 3}, {"title": "I send money on Saturday but they…", "text": "I send money on Saturday but they process my money on Tuesday. That money we need ungetly. Because we are using that money for travel abroad one of my family supposedly her flight tuesday evening. But need to cancel because the money that I send last Saturday they process on Tuesday. I asked them whats the reason why they delayed the money that I send they said because I send it on weekends but on that they I send to different bank accounts the other one just only few minutes then they received the money already. I spend more money for expenses because my family waiting in other country, need to stay in the hotel while waiting the money to credited to her bank accounts. There sorry and apologize can't help it's causing stress to much when they delayed your money specially the money that you send is in need urgently.", "rating": 1}, {"title": "Service was quick.", "text": "Date of experience: November 01, 2024", "rating": 5}, {"title": "It is always fast", "text": "It is always fast, secure and always working...perfect system", "rating": 5}, {"title": "Needed money for family medical…", "text": "Needed money for family medical emergency. And it went through very fast as needed.", "rating": 5}, {"title": "good and precise", "text": "Date of experience: November 01, 2024", "rating": 5}, {"title": "Awesome", "text": "Awesome. Great UI with many features I need. Also efficient.", "rating": 5}, {"title": "Quick & Affordable", "text": "Quick, Easy, Affordable!", "rating": 5}, {"title": "Very happy with WU services", "text": "I cannot complain about anything. I am very happy with your service!", "rating": 5}, {"title": "Its always trusting and reliable.", "text": "Date of experience: November 03, 2024", "rating": 4}, {"title": "Excellent service of Western union", "text": "Excellent service of Western union, the trasnfer are very easy and fast, and the better rates than other remittance companies", "rating": 5}, {"title": "As an international company", "text": "As an international company, try to use terms that might be common to different countries and cultures.... as for example a PIN code and a ZIP code ??? Very different meaning depending where in the world you are. Thanks", "rating": 1}, {"title": "Every Second their Rate Change", "text": "Every Second their Rate Change, just Open Website will High Rate As Soon you Log On to your Account the Rate Drop by 10% and Never will be the Same.Go to their Agent they will you Totally Different Rate.Tried it more than 10 times a day will Never get the Rate Soon before Log ON. As for Rate they will ask 100 of Question and than they Give you Rate, why don't you give me Rate First, If I am happy than I will Proceed, No answer their 100 Question FirstWish could give them Less than 1 Star.", "rating": 1}, {"title": "Requesting refund for lost money order is a challenge", "text": "I had to request a refund for a money order that was never received by the vendor.  The process can be completed online, but the charge for receiving a refund is unclear.  There's a $15 charge for research but any additional charges are not listed anywhere on the website or refund form.  Second, the refund form says you can add more than one money order, but WU will not process more than one money order per form.  Why can you list another money order but it won't be processed?  The refund process is not user friendly nor is it well documented so a customer can understand the actual costs.", "rating": 2}, {"title": "Behind the times with WU", "text": "Such a old fashioned company. They're like being in the stone age when it comes to transfers. I use Wise Payway and MoneyGram. All great online transfers. If you have family and friends overseas and they have difficulties none of these companies Will make you go into an actual shop after your third transaction. In my humble opinion this is just my review.", "rating": 1}, {"title": "it is something that I do without…", "text": "it is something that I do without stress, and this is very important to me", "rating": 5}, {"title": "It helps to send money to the family", "text": "Date of experience: October 31, 2024", "rating": 5}, {"title": "£11.00 fees for £200 transfer", "text": "£11.00 fees for £200 transfer, plus 10% loss on exchange rates.Outrageous. Used WU only because was an emergency, otherwise would never ever us it, nor will I use it again in the future. For context, £1 = 22.78MDL today, but WU decided that 20.80DML for £1.00 is good enough. Stay away. Use any other, just no WU.Thanks", "rating": 1}, {"title": "Easy and user friendly to use", "text": "Easy and user friendly to use. So far there are no issues regarding safety.", "rating": 5}, {"title": "Fastest and savest way for sending…", "text": "Fastest and savest way for sending money. ", "rating": 5}, {"title": "The easy way to transfer money…", "text": "The easy way to transfer money immediately.", "rating": 5}, {"title": "Safely and on time completed several…", "text": "Safely and on time completed several transactions to Europe and Caribbean ", "rating": 5}, {"title": "so easy and not so expensive", "text": "so easy and not so expensive  ", "rating": 5}, {"title": "Sending Money With Western Union is So…", "text": "Sending Money With Western Union is So Easy And Simple.", "rating": 5}, {"title": "My new best friend!", "text": "Easy to use. So very convenient sending money via WU from home.", "rating": 5}, {"title": "It's always a gamble whether an online…", "text": "It's always a gamble whether an online transfer will actually go through, or whether the transfer will say it didn't go through and is \"incomplete\" but Western Union will still remove the money from my bank account. Numerous times now I have had to dispute the transaction with my bank and prove to them that the money was not delivered to the recipient even though they charged my account for it.Customer service is poor. They love to gaslight you and tell you nothing went wrong until I provide proof. For instance, repeatedly telling me that it's just a \"pending\" charge that will be removed from my checking account, when in fact the charge posted days ago.", "rating": 2}, {"title": "good service", "text": "Date of experience: October 28, 2024", "rating": 5}, {"title": "Easy system", "text": "Date of experience: October 28, 2024", "rating": 5}, {"title": "My mtcn not faund or unavilable", "text": "Date of experience: May 29, 2024", "rating": 4}, {"title": "I experienced a fraudulent situation…", "text": "I experienced a fraudulent situation through the Western Union (WU) mobile app. After sending money, I was offered a $20 cash back deal through a third-party site called free-shipment.com (also known as free-delivery.com). The process required me to submit personal information, including my bank details. Initially, $1 was deducted, but a few days later, I noticed an additional $19 charge. When I contacted the company, they explained that the charge was for a membership, which was surprising. After several calls, they agreed to cancel the membership and process a refund.The most frustrating part was trying to report this issue to WU for the safety of their customers. The wait time to reach customer service was extremely long, and when I finally connected, the representatives couldn’t provide any real help. It felt like a waste of time, and overall, the experience was very disappointing.", "rating": 1}, {"title": "You are giving them a loan when you send moneyb", "text": "After send money for three years to the same person they decided to put 7 day plus holds on the transfer. They blame it on the bank which is nonsense. That money left my account 4 days ago and they are playing the float. So they lie to you, too", "rating": 1}, {"title": "Seamless", "text": "Easy to use and seamless on sending money to my family.", "rating": 5}, {"title": "Card refused and impossible to send my order", "text": "You have refused my card i have sent x times money with how can you refuse now? My account is provided in money for this ,,its unbearable", "rating": 1}, {"title": "thank you WU for sending money very…", "text": "thank you WU for sending money very fast for my family abroad", "rating": 5}, {"title": "Speed and security", "text": "Date of experience: October 29, 2024", "rating": 5}, {"title": "Account was hacked. $1000 missing and Western Union could care less. ", "text": "I had a terrible experience with Western Union. My account was hacked, and $1000 was transferred from my bank to a stranger without my permission. When I reached out to their customer service for help, they told me there was nothing they could do! This is completely unacceptable. As a customer, I expect a company like Western Union to take responsibility for security breaches and provide support to resolve issues like this. Instead, I was left frustrated and with no assistance. I will not be using Western Union again, and I strongly advise others to be cautious with their services.", "rating": 1}, {"title": "NEVER USE WESTERN UNION", "text": "901-366-0884. NEVER USE WESTERN UNION.Since 9 October, my transferred fund was rejected. Been calling their customer services, they told me by 7 business day. they funds will be CONFIRMED refunds to how I am transferred to them. On 17 October, no refund. On 19 October, I called their customer services, they told me to wait and they will checked. On 21 October, they ask me to show them prove that I have transferred them the money and did not received. I have emailed to them. On 23 October, they said it is not cleared. I resend sender and receiver bank statement. 25 October, told me to wait for their accounting reply. Till now since 9 October, you can see their process from one department, push to another one then another one. They did not practice what they have been saying within 7 business day. I have been following up but my response to them to delay and delay. Excuses and excuses that their customer services (which I think someone later will reply to this review to tell me to contact or email to them) cannot do anything but to forward my request. Please see it for yourself how this company works and how inefficient is this company. Please do not transfer any money more than US$500 if not your money will be struck or might be gone. I really wondering are they scammer company, tested the small money can go through but when come to big money. it will be gone? Today is 1 Nov, case no solved. Their answer is still WAIT. ", "rating": 1}, {"title": "Simple et rapide", "text": "Simple et rapide ", "rating": 5}, {"title": "Easy to use and very fast money…", "text": "Easy to use and very fast money delivery. You get email updates step by step", "rating": 5}, {"title": "Their rewards program is a farce", "text": "Their rewards program is a farce - it never works (bait and switch), and when you need the funds to be transferred immediately they don't- when you don't they do! Customer service, while nice, never can do anything to help.", "rating": 1}, {"title": "Website is easy to navigate", "text": "Website is easy to navigate.  Directions are clear.", "rating": 5}, {"title": "WU was good at one time but recently my…", "text": "WU was good at one time but recently my friends and I are experiencing problems and when contact customer services they ask us to participate in app removal and reinstating, clearing browsers etc etc, which only cause us more grief. The problems are not with us! They're of WU that have made changes to their app like removal of price estimation from the menu and other things that are causing transfer failures and transaction breakdowns I suggest they need to reverse their changes so that life can continue and get rid of the person they employ making these changes to something that operated smoothly ", "rating": 2}, {"title": "Walmart Employee Theft ", "text": "My son and daughter went to Lloydminister Alberta to visit their grandfather who is 84 so I sent them each  $150 for a meal or gift to buy him. My son went to the Walmart to pick up cash, since he had a USA drivers license and I used a postal code from Saskatchewan which I never told him they said no cash payment could be made and would have to go on a debit card. So he never received his cash and funds disappeared. I rang the Walmart and a lady asked for a description of the person working. The lady on the phone was Philippine which ironically when I rang my son back he said the lady was Philippine. Do not use Western Union for Cash pickup only use if the recipient has the App and can redirect the funds into their account. U.K. toll free is in India and said phone breaking up and would talk on phone. A Complete Fraud Corrupt Service! ", "rating": 1}, {"title": "Quick", "text": "Quidck, efficient, easy to use", "rating": 5}, {"title": "Software is complicated and bad", "text": "Software is complicated and the worst from banks. Totally user-unfriendly. I hate it using WU.The worst software-developpers ever and not good tested.App and also PC - it is both the same bad quality.Only problems.You promised me a voucher in June 2023 - now it dissapeared.also today: I had 153 points and could pay my transaction with points. Then they disapeared after changing the default payment (there should be NO default) from Google pay (not often used in Europe) to Credit Card.Really bad sowftware and my points earned are gone. Why do I collect points when you steal them and this bad software deletes them?Really bad software and not tested and the business it testing all cases. Backward and foward.Software written from beginners.", "rating": 1}, {"title": "It's simple ,it's a love hate…", "text": "It's simple ,it's a love hate relationship,I used to love WU but now I have to take so long to transfer money from WU to bank back to WU then wait to see if it got trough ? Too long too stressful so I'm looking elswherwe..elsewhere", "rating": 1}, {"title": "I am scared W", "text": "I am scared W. U. will change my instructions.  This time I caught that you changed the name of the receiver and I changed it back to correct name.", "rating": 3}, {"title": "Simple, fiable et rapide", "text": "Simple, rapide et fiable. Je recommande", "rating": 4}, {"title": "Straight forward and easy transactions.", "text": "Straight forward and easy transactions. ", "rating": 5}, {"title": "Best rates + fastest transfers = WU!", "text": "Best rates + fastest transfers = WU! ", "rating": 5}, {"title": "Fast and low fee", "text": "Fast, convenient, and low fee. *****", "rating": 5}, {"title": "Fast, never failed", "text": "Fast, never failed.", "rating": 5}, {"title": "do not like changes", "text": "not sure why but all the new changes have made it a little more difficult", "rating": 3}, {"title": "Transfer fees are too high", "text": "*I like the transfer of money in minutes. *The transfer fees are too high. *I have not been able to access my points for months now.", "rating": 3}, {"title": "SIMPLE ET RAPIDE", "text": "Date of experience: October 25, 2024", "rating": 5}, {"title": "Rubbish platform", "text": "Expensive  and inconvenient system. Other platforms are much more better than this.It gives too much headache while transferring money. I have used it three four times since 2020 and every time I faced problems and had to go to the agents at the shop again and again for troubleshooting. Yesterday I sent money to Afghanistan through post office, but received text message today that it was not proceed. I called the customer service they told me to go to any agent and receive the money back. I asked him to send me the locations, he sent me the link for nearby locations, although on Google map the shops were shown open,  but when I went thereThey were closed. I went to two locations. First one was 36 High st, lye Stourbridge DY9 8LB, but the agent was very rude and impolite, first he did not want to talk just shakinghis head, when I asked questions, he was telling me that it is Sunday very rudely. Then I went to the next location No 25 same street and it was closed. Finally I came to another location 5 Halesowen, the agent told me that I should go to same location which I went yesterday. I told her that she needs to talk to a manager as there should be a way. She was kind listening to my request abd inally after two hours I managed to resend the money but it cost us to pay £25 more than yesterday. The actual amount was £240What a rubbish system. I will never use western union again. ", "rating": 1}, {"title": "Simple et efficace", "text": "Simple et efficace ", "rating": 4}, {"title": "great service", "text": "Date of experience: October 23, 2024", "rating": 5}, {"title": "Really easy and save to send money.", "text": "Really easy and save to send money. ", "rating": 5}, {"title": "always the best", "text": "Date of experience: October 25, 2024", "rating": 5}, {"title": "Soooo easy to send money to parents", "text": "Date of experience: October 25, 2024", "rating": 5}, {"title": "It is a straight forward and easy to…", "text": "It is a straight forward and easy to use service. ", "rating": 5}, {"title": "ON HOLD Every time", "text": "Every time I send money it shows on hold and it’s just a big issue. I’m actually in the process of looking for a different way to send money since this happens every single time!!", "rating": 1}, {"title": "quick and easy ", "text": "easy to use.  never any hidden charges.", "rating": 5}, {"title": "Great company to do business with", "text": "Date of experience: October 12, 2024", "rating": 5}, {"title": "All great and very fast delivery", "text": "Date of experience: October 11, 2024", "rating": 5}, {"title": "Western I ask to stop giving other…", "text": "Western I ask to stop giving other deals and or offers from other business to shop for products and to join a service and start the new points/discount plan you promised since January 2024.", "rating": 1}, {"title": "The process was quick and smoothe.", "text": "Date of experience: October 24, 2024", "rating": 5}, {"title": "Nice", "text": "It's an easy and fast way to send money. Also, the agents are so nice to help me. ", "rating": 5}, {"title": "Good service and safe", "text": "Date of experience: October 24, 2024", "rating": 5}, {"title": "Hands are tied making a payment", "text": "I am very disappointed that credit/debit cards cannot be used on business accounts and bank to bank takes 8 days! That is unconscionable.", "rating": 2}, {"title": "Quick and easy", "text": "The online services are very convenient.", "rating": 5}, {"title": "Simple et rapide", "text": "Date of experience: October 21, 2024", "rating": 5}, {"title": "Simple et Rapide", "text": "Simple et Rapide ", "rating": 5}, {"title": "Excellent service", "text": "Excellent service ", "rating": 5}, {"title": "sometimes working sometimes not.", "text": "Date of experience: October 24, 2024", "rating": 5}, {"title": "the best site for sending money", "text": "the best site for sending money! thanks!", "rating": 5}, {"title": "My account was suspended ", "text": "My account was suspended because of verification issues.I did send in my passport for verification but no reply.", "rating": 1}, {"title": "So frustrated…", "text": "I've been using WU for a long time and never had an issue, until very recently. When sending money a little bigger than I usually do, the WU system asked me to provide additional information like DL, my kind of job, my position, etc. which I provided as I understand I am sending a bit bigger than usual. Then updated my address since I changed address. After all those details have been provided, the system is giving me an error message: \"This address cannot be a PO box.\" I was like...what??? My address is NOT even a P.O. Box! I checked multiple times if I entered my address correctly and yes it's been entered correctly. How come it's giving me that error message! Then I called customer service and I was asked to provide A copy of my ID via email which I did. The customer service said it will take 24 hrs to fix the issue and I will receive email confirmation. After more than 24 hrs I am not receiving email. I went in again in WU website, using the App, still giving me the same error. then switched to my desktop, and then laptop. again, the same error. What is going on? Until now I am not receiving any email confirmation. My brother needs the money already. I called customer service to follow up but only told to wait for the confirmation and can no longer do anything since I already provided my ID. WU is no longer reliable. I am so frustrated.", "rating": 1}, {"title": "Irriresponsible & Non reliable", "text": "Hello,I have been a customer of Western Union since 2012; my parents are also customers.My brother-in-law was recently diagnosed with Leukemia, and I sent $480 to him in India to help him pay the hospital bills. I have several transitions to prove that he has been receiving money. Only on 10/03/2024 did I send the money to him using the saved receivers in the Western Union Account, and my brother-in-law didn't receive the money. We waited one more day to see if it was a transaction delay. On the 4th, the money was delivered, but my brother never received the money. So I returned and found that the account and phone numbers were changed in the saved receiver. I thought someone had hacked the account, so I called Western Union. They responded poorly by saying the transaction was complete. So I had to call them three times to start an investigation finally. Minus the wait time and transfers! They told me I would get an email from them after the inquiry. On 10/06/2024, I got an email saying that the transfer was complete. It is as if I need an investigation to find out the status of a transfer; shame on the people who made this system and shame on people like me who believe in it.I am on a call with them today, 10/11/2024. I hope I can find some answers.Sincerely,Mridhul George", "rating": 1}, {"title": "Convenient and quick", "text": "Convenient and quick ", "rating": 5}, {"title": "Great service but fees have increased…", "text": "Great service but fees have increased 200% in the past few months from $4.99 to $14.99.", "rating": 3}, {"title": "It always steals my reward points when…", "text": "It always steals my reward points when I try to use it, never vets applied to my discount. ", "rating": 2}, {"title": "Best service for o send my money ever .", "text": "Best service for o send my money ever . ", "rating": 5}, {"title": "Good ", "text": "Good service ", "rating": 5}, {"title": "Easy to use", "text": "Easy to use, and quick responce", "rating": 4}, {"title": "Takes 24 hours to confirm my bank…", "text": "Takes 24 hours to confirm my bank payments - no \"money in minutes.\"", "rating": 1}, {"title": "Easy to  send  money to bank account", "text": "Date of experience: October 17, 2024", "rating": 5}, {"title": "Always works,", "text": "Always works,   ", "rating": 5}, {"title": "👍👍👍👍👍👍👍👍👍👍", "text": "Date of experience: November 04, 2023", "rating": 5}, {"title": "very good thank you Westernunion", "text": "Date of experience: October 15, 2024", "rating": 5}, {"title": "easy en quick", "text": "easy en quick to transfer money", "rating": 5}, {"title": "Very quickly process", "text": "Very quickly process ", "rating": 5}, {"title": "The first and the best in the world", "text": "The first and the best in the world ", "rating": 5}, {"title": "quick and reliable", "text": "Quick and reliable", "rating": 5}, {"title": "secure", "text": "secure, quick, easy abordable website platform.", "rating": 5}, {"title": "fast easy correct", "text": "Date of experience: October 12, 2024", "rating": 5}, {"title": "Its quick and easy and don't have to…", "text": "Its quick and easy and don't have to leave my house", "rating": 5}, {"title": "Fast and efficient", "text": "Date of experience: October 12, 2024", "rating": 5}, {"title": "Reliable For Money Transfer", "text": "Reliable for Money transfer.", "rating": 5}, {"title": "Easy to transfer funds", "text": "Date of experience: October 13, 2024", "rating": 5}, {"title": "Great and prompt service", "text": "Great and prompt service ", "rating": 5}, {"title": "A great headache", "text": "Just not wearing well. Three refunds for one try. Not acceptable", "rating": 1}, {"title": "fast and easy", "text": "Date of experience: October 29, 2024", "rating": 5}, {"title": "Very easy and fast....Thank you!!!", "text": "Date of experience: October 22, 2024", "rating": 5}, {"title": "Reliable", "text": "Reliable, fast, confidential.", "rating": 5}, {"title": "Good app very fast and easy to use", "text": "Good app very fast and easy to use ", "rating": 5}, {"title": "Best of the best", "text": "Never dissapoints. Fast delivery. Incredible. ", "rating": 5}, {"title": "tres bonne experience", "text": "Date of experience: October 22, 2024", "rating": 5}, {"title": "very professional", "text": "Date of experience: October 28, 2024", "rating": 5}, {"title": "app desent show the details its cut off…", "text": "app desent show the details its cut off when sending the money ", "rating": 1}, {"title": "Expérience ", "text": "Good and easy to handle", "rating": 5}, {"title": "Unprofessional stuff", "text": "Unprofessional stuff, slow response and longer processing times ", "rating": 1}, {"title": "Easy Easy Easy and fast !", "text": "Date of experience: October 19, 2024", "rating": 5}, {"title": "Quick and simple to use", "text": "Quick and simple to use ", "rating": 4}, {"title": "Too many failed transactions and waste…", "text": "Too many failed transactions and waste of time.", "rating": 2}, {"title": "Easy to use thank you.", "text": "Date of experience: October 12, 2024", "rating": 5}, {"title": "Easy and quick to use.", "text": "Date of experience: October 13, 2024", "rating": 5}, {"title": "prompt and hassle free.", "text": "Date of experience: October 14, 2024", "rating": 5}, {"title": "Good customer service", "text": "Good customer service ", "rating": 5}, {"title": "Very good", "text": "Very goodThanks ", "rating": 5}, {"title": "Service hit the bottom", "text": "Date of experience: September 30, 2024", "rating": 1}, {"title": "my rewards points are lost or stolen or…", "text": "my rewards points are lost or stolen or can't use them", "rating": 1}, {"title": "Simple", "text": "Simple, fast, safe", "rating": 5}, {"title": "Easy and fast", "text": "Date of experience: October 14, 2024", "rating": 5}, {"title": "Easy transaction", "text": "Date of experience: October 13, 2024", "rating": 5}, {"title": "Easy and fast", "text": "Easy and fast ", "rating": 5}, {"title": "Fast and easy", "text": "Date of experience: October 13, 2024", "rating": 5}, {"title": "Gone very well", "text": "Date of experience: October 11, 2024", "rating": 5}, {"title": "timeless professional easy to manage", "text": "timeless professional", "rating": 5}, {"title": "Transfer fee", "text": "The fee has increased, I DON'T like it!", "rating": 2}, {"title": "Very long connecting.", "text": "Date of experience: October 11, 2024", "rating": 1}, {"title": "never had an issue", "text": "Date of experience: October 11, 2024", "rating": 5}, {"title": "Quick and effective ", "text": "Easy and quick", "rating": 5}, {"title": "your system needs up dating", "text": "your system needs up dating, I have not been able to see my transactions on your web site since 7/21/2024", "rating": 1}, {"title": "Imposible to make a transfer on the website", "text": "I encountered multiple issues attempting to complete a transfer, which was repeatedly declined. The representative indicated that the bank was declining the transaction; however, I tried using three different cards from three different banking institutions, each with the same result. This experience raises concerns for me, as it appears to direct customers to make in-person cash transactions instead. It feels unusual for all banks to flag these transactions as suspicious. more than 1 hour to get help over the phone.", "rating": 1}, {"title": "good rate but still has problem doing…", "text": "good rate but still has problem doing the online which they have never fixed.", "rating": 4}, {"title": "Even tho I talk to a agent every time I…", "text": "Even tho I talk to a agent every time I send my mom money they still freeze the transaction first. When she need the money we have to wait hours on it because the pre scan it Everytime.", "rating": 1}, {"title": "Very slow ,I sent money from UK to…", "text": "Very slow ,I sent money from UK to Zimbabwean mobile wallet it only took all day and going into the second without it delivered to the recipient.....very slow ,not good for urgent issues and emergencies ", "rating": 1}, {"title": "I'm using WU since 2008", "text": "I'm using WU since 2008, never got any problem....Quick and safe!", "rating": 5}, {"title": "Excellent service", "text": "Excellent service, fast and user-friendly.", "rating": 5}, {"title": "great for sending money friens and…", "text": "great for sending money friens and payments. l will send every month", "rating": 5}, {"title": "Delayed deposit in receiver account…", "text": "Delayed deposit in receiver account than originally promised.", "rating": 3}, {"title": "Super easy to navigate.", "text": "Date of experience: October 11, 2024", "rating": 5}, {"title": "Awesome job", "text": "Awesome job ", "rating": 5}, {"title": "Horrible customer Service…", "text": "I had an outstandingly embarrassing situation with this company as  Moneygramm had a cyber security issue earlier this month, my parents decided to fund my studies and send some money through Western Union, soon as I filled out their form with my details I was told to hat my name and surname does not match, I have shown them my UK driving licence, the next day I brought my passport and still was told that they don’t understand which is my first name which is my family name??? So after a brief explanation that am Hungarian and we have our family name first then our given name still had no luck with this issue, I dragged my parents twice to go back to the post office and change my name details but they were told that everything is fine and that she has done the right thing! My parents called me several times to let me know that is not their fault, is this poor company Western Union who doors not accept your family name if it is written the other way around! After 2 days I have called their customer service, guess what Robot Service, after awaiting 5 minutes on the line I was going into detail again, but the customer service assistant could not resolve this issue! Please, I do beg everyone, go for REVOLUT online card as Western Union is a joke and waste of time! Uptill nowadays did not receive my money, I will fill out a dispute towards them, it is what it is, not worth this money grabbing company, because you will only have headache! Shame on You!", "rating": 1}, {"title": "I always complete my transaction with…", "text": "I always complete my transaction with ease. It's soo convenient and never had a problem. ", "rating": 5}, {"title": "Efficace ", "text": "Efficace ! Merci beaucoup !", "rating": 5}, {"title": "too much confudion", "text": "Date of experience: October 11, 2024", "rating": 1}, {"title": "That their money and transactions go thorough successfully personally so far I am very happy ", "text": "Happy customer That our monies go through successfully and on time and receivers are happy also.Thank you .", "rating": 4}, {"title": "TODAY'S EXCHANGE RATE FOR US$50 ..", "text": "TODAY'S EXCHANGE RATE FOR US$50 ... IS KES 6450.  THIS MEANS I'M SHORT-CHANGED 751 SHILLINGS (US$5.84)", "rating": 1}, {"title": "I love this !", "text": "I love this !! i been using this western union for years ", "rating": 5}, {"title": "Western Union Equates Super Convenience and Absolute Security", "text": "Western Union Equates Super Convenience and Absolute Security!!!", "rating": 5}, {"title": "Graet", "text": "This is very good ", "rating": 5}, {"title": "Your guys are the best in the area of…", "text": "Your guys are the best in the area of money transfer, Western union is not only good one but the Master.", "rating": 5}, {"title": "On previous occasions I had no problem…", "text": "On previous occasions I had no problem send money via Western Union. But recently whenever I have tried sending money a message comes up telling me to go to one of my local agencies which is annoying when want it done with straight away online. Why is this happening????", "rating": 3}, {"title": "everything went smoothly", "text": "everything went smoothly, no hassle; I made the transaction in less than a minute. that's great", "rating": 5}, {"title": "Fast excellent service", "text": "Date of experience: October 11, 2024", "rating": 5}, {"title": "Quick", "text": "Quick, reliable and safe way for sending my neice school fees. ", "rating": 5}, {"title": "Easy Transfer", "text": "It'd easy and user friendly.", "rating": 5}, {"title": "One of the best", "text": "WU is on of the best .", "rating": 5}, {"title": "First name letter error", "text": "I tried to send myself money from the US account and it kept saying that my receiver first name (who just happens to be myself) had a character that was not a letter, and my name doesn't have any strange characters at all. I had to transfer from my US account to my BE account, losing money on that transfer, and then lost some more money on the WU transfer.", "rating": 1}, {"title": "Longest money transfer is western…", "text": "Longest money transfer is western union.They say , they can’t expedite it.This sucksMTCN 1340440570", "rating": 1}, {"title": "It's ok but some time it's failed ", "text": "Within time get money in my account ", "rating": 5}, {"title": "Everything was working as supposed to…", "text": "Everything was working as supposed to be.", "rating": 5}, {"title": "Customer Service is no help", "text": "Been having issues sending a transfer which the receiver needs urgently and customer service has not been able to help with verification", "rating": 1}, {"title": "This company is small but not scared!", "text": "The pulled me out of a very stressful  situation dealing with money I'm trying to send to family since yesterday.Thank you so much!", "rating": 5}, {"title": "Very easy to use", "text": "Date of experience: October 10, 2024", "rating": 5}, {"title": "WU is the best ", "text": "I've always been using WU and I have never any serious problem. Always working properly and when I had any issue concerning my account and contacted them, they replied me pretty fast. ", "rating": 5}, {"title": "Fast", "text": "Fast, easy process!", "rating": 5}, {"title": "I qualified for fast delivery", "text": "I qualified for fast delivery! YAY!", "rating": 5}, {"title": "i was given faster delivery", "text": "Date of experience: October 10, 2024", "rating": 5}, {"title": "Great service", "text": "Great service. Superfast. All info in place from last transfer. ", "rating": 5}, {"title": "You all transfer fee to send money is very high and I don't appreciate that", "text": "You all needs to adjust that rate it's a bit to high", "rating": 3}, {"title": "Easy to complete", "text": "Date of experience: October 10, 2024", "rating": 5}, {"title": "My last transaction was returned", "text": "My last transaction was returned. I'm very sad.", "rating": 5}, {"title": "Quick", "text": "Quick, reliable and safe.", "rating": 5}, {"title": "Last month I sent money but taking a…", "text": "Last month I sent money but taking a longer time.totally different last year it was good ", "rating": 1}, {"title": "Au top western union", "text": "Date of experience: October 10, 2024", "rating": 5}, {"title": "Very easy to use", "text": "Very easy to use. Quick send option is my fav. Hope to have options to easily change the amount though.", "rating": 5}, {"title": "I am the least tech savvy person I know…", "text": "I am the least tech savvy person I know and I was able to figure this out. Love when things go smoothly", "rating": 5}, {"title": "Security", "text": "Western Union sent debit card transfer with our asking for security code for the card.  This is a security error that should be corrected.", "rating": 4}, {"title": "Your Customer Service is the worst I…", "text": "Your Customer Service is the worst I have ever dealt with.   No one knows anything.   No Supervisors are available.   They can't tell you why transactions are denied, They can't tell you limits (are they daily, per person, per month).   They can't send or receive email.  I spent 1:20 on a call today only to get hung up on twice.   YOU GUYS SUCK.   FOLLOW-UP:   A guy claiming to be from Trustpilot contacted me, but he was in the backyard with dogs barking and pots clanging.   He was going to change WU to resolve my problems.   WHAT A JOKE.   Some guy in his backyard in South Asia will change WU's policies.     OK.1.  Tell the sender why a transaction has been declined and what they need to fix. Is the amount too high? Is there a monthly limit for sending to a country? Is there a maximum amount you can send to an individual? You guys don't know. Your website is contradictory, and your customer service \"CAN'T\" answer anything. 2.   Have the ability to escalate a question to a supervisor.  The person at the base level doesn't have the authority to explain the issue.   One month, I can send a person $500.   Next month, I will only be able to send $250.   WHY?   If the base-level WU partner doesn't know, transfer me to a supervisor who can look into the question and get back to me. 3.  Money transfer is essential in some situations to fund transactions, feed families, and allow construction/travel.   You are hurting people if you can't tell me what's wrong with a transfer.   Maybe the zipcode is incorrect.  Maybe the bank that is receiving the money has an issue but when no information is pro.   The Customer Service folks don’t know anything.4.  The language used by the agents is poorly chosen.  “Sir, I’d like to help you with an answer but I am not allowed to tell you what is wrong”   “Our policy is to not tell people why their transactions failed”   AGAIN,  is this a joke.", "rating": 1}, {"title": "instead of continue there should be…", "text": "instead of continue there should be submit button and confirm button. People think it is still not completed when they click on continue button after review.", "rating": 3}, {"title": "Incredibly useful", "text": "Incredibly useful ", "rating": 5}, {"title": "Easy to work with this web site", "text": "Date of experience: October 09, 2024", "rating": 5}, {"title": "Very convenient!", "text": "Very convenient!! Quick and easy and from the comfort of my own home ", "rating": 5}, {"title": "good service, at a cost", "text": "though the process is quite streamlined, the fees for paying with cash are quite high, not to mention you guys stopped your WU points.", "rating": 3}, {"title": "The main thing is that", "text": "The main thing is that: i am in Honduras - and it is \"easy\" to send money from the US.", "rating": 5}, {"title": "Easy  To Follow &^ Very  Quick .Save…", "text": "Easy  To Follow &^ Very  Quick .Save Customer Time ", "rating": 5}, {"title": "This is my personnel account----not a…", "text": "This is my personnel account----not a scam like you claim on my CC. Get people who understand English. The Dates were Oct 8th. When this happens. Not happy Western union sucks ", "rating": 1}, {"title": "Easy money transfer", "text": "Not applicable ", "rating": 5}, {"title": "My transaction was completed easily and…", "text": "My transaction was completed easily and accurately.", "rating": 5}, {"title": "It was easy to send transfer on line", "text": "Date of experience: October 09, 2024", "rating": 5}, {"title": "despite having to do so many re…", "text": "despite having to do so many re verifications, the team always fix it ", "rating": 5}, {"title": "Way better than PayPal for Interntional Transactions", "text": "Date of experience: October 09, 2024", "rating": 5}, {"title": "gold ", "text": "VELIGOD THANK ", "rating": 5}, {"title": "Love This", "text": "I love this, makes it so much easier to send money to family...simple and easy!", "rating": 5}, {"title": "The Quick and easy", "text": "The money went through quick, and had no problems.", "rating": 5}, {"title": "I love using western union they are…", "text": "I love using western union they are definitely my #1 go to when sending money ", "rating": 5}, {"title": "customer service ", "text": "I called customer service for help with missing history on my app. Last transaction showing is in May but we are in October now. I send at least once or twice monthly. Customer reps I talked to are just making me wait with advices that are not actually solutions. I called several times daily 10/6, 7, and 8 since the advice actually didn’t help. One example is I have to wait for 48 hours for tech with the repair order which nothing happened coz I was not even given a ticket number as I was this time which again I have to wait for 72 hours this time. Not to mention the long wait time and long hold they put me in every call. Your customer service reps are just running the time and are not helpful. One rep  talks over me and won’t let me finish my sentence. I am waiting for my transaction history to be fixed so I can view my transactions and send the needed money asap. Please help. Thank you! ", "rating": 3}, {"title": "Improved on fast delivery", "text": "Date of experience: October 09, 2024", "rating": 5}, {"title": "Fast", "text": "Fast, convenient, and smooth transfers of money.", "rating": 5}, {"title": "I was able to complet my transfer", "text": "I was able to complet my transfer, thank you.", "rating": 5}, {"title": "I had to re-enter the receiver's bank…", "text": "I had to re-enter the receiver's bank information but it did not arrive and was refunded. This is distressing on both ends. Also, the receiver has to go to a store and re-register every so often. It is also a problem that I hope can be fixed that if the banking info does not change, then no re-registration is needed. When the system works, it does so very well. Thanks.", "rating": 3}, {"title": "The convenience of not having to go to…", "text": "The convenience of not having to go to a branch to make the transfer.", "rating": 5}, {"title": "U canceled points", "text": "Date of experience: October 09, 2024", "rating": 1}, {"title": "price gouging", "text": "since moneygram had their problem, WU is price gouging", "rating": 2}, {"title": "its taken 4 hours to do a simple…", "text": "its taken 4 hours to do a simple transfer.. and its still not done. ", "rating": 1}, {"title": "Stupid site", "text": "Stupid site, stupid creators. Many times they blocked the account and the translation without explanation, when all the documents are in order. \"Wait 30 minutes\" while they check the translation. Waited for several hours.", "rating": 1}, {"title": "It is secure and fast", "text": "It is secure and fast, wli don't worry about, and doing with comfort of my bed.Really thanks.", "rating": 5}, {"title": "I wish all transactions were this fast", "text": "Date of experience: October 09, 2024", "rating": 5}, {"title": "Very easy to make a transfer and very…", "text": "Very easy to make a transfer and very simple to do it. ", "rating": 5}, {"title": "It's the easiest way to send money to…", "text": "It's the easiest way to send money to family, especially in emergency situations. There's no lining up at the store. Just a few clicks, and you're done! ", "rating": 5}, {"title": "Demanding phone number was a annoyance", "text": "Date of experience: October 08, 2024", "rating": 1}, {"title": "More than 10 Years", "text": "Its been long time i have use WU.. and never had any big issues ,except errors on my part. Fast service and easy transfers to send...", "rating": 5}, {"title": "EVERY TIME I try to log in I have to…", "text": "EVERY TIME I try to log in I have to change myy password      I am getting tired of this.    See thaty it does not happen again      I could NOT recomened your service to anyone if it keeps happening", "rating": 1}, {"title": "Money not available on proper time.", "text": "Date of experience: October 08, 2024", "rating": 1}, {"title": "This makes my life simple whereby I can…", "text": "This makes my life simple whereby I can transfer funds from my desktop.", "rating": 5}, {"title": "it was sweet and fast", "text": "Date of experience: October 08, 2024", "rating": 5}, {"title": "Fast and reliable transaction!", "text": "Fast and reliable transaction! ", "rating": 5}, {"title": "Great service", "text": "Great service, easy and super fast and user friendly!", "rating": 5}, {"title": "western union the beste", "text": "Date of experience: October 08, 2024", "rating": 5}, {"title": "I do not like the processing time which…", "text": "I do not like the processing time which takes way too long", "rating": 3}, {"title": "Giving error while input payroll card", "text": "Date of experience: October 08, 2024", "rating": 3}, {"title": "Transaction has no SUBMIT ", "text": "The option to write an info are not clear. At the end, there is a \"stupid\" option to send a message with no option \"no thank you, I don't want to send any additional message\". I do not know when is the end of transaction because there is no SUBMIT. BUT you do have \"submit your review\".", "rating": 2}, {"title": "Easy and convenient way to submit a…", "text": "Easy and convenient way to submit a request and it saves time when I go to the WU location.", "rating": 5}, {"title": "Have been using western union for many…", "text": "Have been using western union for many years and it has been just fine for me and my family in Colombia!", "rating": 5}, {"title": "Best remittance ever and it allows me…", "text": "Best remittance ever and it allows me pay my workers seemlessly.", "rating": 5}, {"title": "Verify my State", "text": "At one time when I sighed into my account, I merely went to setting up the transfer; now, each time I want to do the same, I get an error about my ID; nothing has changed except W.U. process because I get emails telling me about how my account has changed after the transfer. What's teh point of my 'secure' account and yet teh inconvenience of each time getting stopped because of an invalid ID and asked to verify my information again for each transfer", "rating": 3}, {"title": "very very slow", "text": "Date of experience: October 08, 2024", "rating": 2}, {"title": "Convert US Dollar to Philippine Peso", "text": "Convert US Dollar to Philippine PesoWestern UnionYour weblink worldwide wide western union . com indicated this rate › usd-to-php-rateFX: 1.00 USD – 57.6959 PHP Exchange Rates and Fees shown are estimates, vary by a number of factors including payment and payout method. The only problem rate quoted me was 56.56 pesos to the American Dollar. Why the variation", "rating": 5}, {"title": "took me 3 attempts to complete this…", "text": "took me 3 attempts to complete this transaction.", "rating": 3}, {"title": "ALWAYS BEST ", "text": "ALWAYS BEST , AND FAST SERVICE, VERY HAPPY ALL THE TIME", "rating": 5}, {"title": "You no longer delay my money from…", "text": "You no longer delay my money from reaching my recipients as you once did. This is very good. I am also thankful for the measures you take for insuring that it is really me that is sending the money, however, it does take some time to confirm on occasion.", "rating": 5}, {"title": "fast and reliable", "text": "Date of experience: October 08, 2024", "rating": 5}, {"title": "Transaction is very fast and very…", "text": "Transaction is very fast and very simple my family gets my transfer money very fast. Thanks a lot for good service", "rating": 4}, {"title": "Duration for transfers is random", "text": "Duration for transfers is random? Between the same two accounts, have been transferring money between these accounts for more than a year, some transfers are instant, others are up to 5 days. Why?", "rating": 1}, {"title": "Problems with my US Bank account being…", "text": "Problems with my US Bank account being accepted.  Finally had to use a Debit Card.   Also, scammers are using Trust Pilot reviews to contact people saying they are Western Unit.  I was called by two different people wanting to log into my bank to give me a refund.  Typical Indian scammers.", "rating": 2}, {"title": "Самый быстрый способ отправить деньги с…", "text": "Самый быстрый способ отправить деньги с карты на карту.", "rating": 5}, {"title": "VERY POOR CUSTOMER SERVICE RESPONSE", "text": "Your contractor for customer service gave me an incorrect MTCN and the receiver made a dead run to WU to retrieve their funds to no avail. Without a MTCN your contractor said he could not search and find the transaction that was in question. Very pathetic customer service which is not their fault but the tools WU provides them. I spent a lot of time on this problem and was kept going around and around with no resultion. No very happy with WU!!!", "rating": 1}, {"title": "Rapide et simple", "text": "Date of experience: October 08, 2024", "rating": 5}, {"title": "The instructions are clear", "text": "The instructions are clear, easy to follow. The cost of the service is great value. I recently had to change the order of the name and the customer service representative was polite and efficient. Thank you.", "rating": 5}, {"title": "Quick and efficient", "text": "Date of experience: October 08, 2024", "rating": 5}, {"title": "fast and effecient", "text": "Date of experience: October 08, 2024", "rating": 5}, {"title": "Zero", "text": "Why the fees are so high, and My points are in hold. ", "rating": 1}, {"title": "Great service!", "text": "Date of experience: October 08, 2024", "rating": 4}, {"title": "I am sick to the back teeth with…", "text": "I am sick to the back teeth with western union, I send money regular to family in Africa, and the regularly block payment and ask me to provide the same evidence again and again, surely someone there knows what they are doing and not totally inept.Hmmmm....maybe not!", "rating": 1}, {"title": "Easy & Fast", "text": "Easy & FastI'm sendig regulary medical aid", "rating": 5}, {"title": "Great", "text": "Great! I transferred money to outside of US and the receiver get the money in a minute!", "rating": 5}, {"title": "I like the quick send option.", "text": "Date of experience: October 07, 2024", "rating": 5}, {"title": "Easy for transfer money", "text": "Date of experience: October 08, 2024", "rating": 4}, {"title": "More convenient and easier to transfer.", "text": "Date of experience: October 07, 2024", "rating": 5}, {"title": "realy helpfull", "text": " realy helpfull", "rating": 5}, {"title": "Very helpful", "text": "Very helpful ", "rating": 5}, {"title": "The transfer fee become higher", "text": "The transfer fee become higher. Money transfer takes longer.", "rating": 3}, {"title": "So glad western union remains…", "text": "So glad western union remains trustworthy with so much going on in the world.", "rating": 5}, {"title": "They cancel transfers without giving a…", "text": "They cancel transfers without giving a reason. They take your money immediately but when they cancel they take 7 days to refund. They send email to say money will go back in account but when you log into apo it says you have to pick up refund. Very confusing and worrying as you do not know until 7vdays later if you are getting refund in bank", "rating": 2}, {"title": "It’s the best one", "text": "It’s the best one, the easiest and more secured!! ", "rating": 5}, {"title": "The best and most secure way I can send!", "text": "The best and most secure way I can send money especially to my loved one in a federal prison.", "rating": 5}, {"title": "After many many e mails and phone calls…", "text": "After many many e mails and phone calls I got my bank involved and they told me the fault of Western Union. it is now sorted. But it has taken Western Union $ MONTHS to reply to my 3 reviews. Speed is not their forte.", "rating": 5}, {"title": "Easy", "text": "Easy, efficient, and cheap.", "rating": 5}, {"title": "Every transaction is on hold.", "text": "That service is horrible ", "rating": 1}, {"title": "Simplicity", "text": "Date of experience: October 07, 2024", "rating": 5}, {"title": "Convenient", "text": "Convenient, easy to use, great tool to wire money overseas.", "rating": 5}, {"title": "Take so long", "text": "Take so long, i need sent money right a way.It was i sent money on oct 5 2024 and arrive on oct 7 2024.", "rating": 2}, {"title": "Incompetent", "text": "Incompetent. Call center employees are Incompetent. Your system is Incompetent. Get it together. Thanks!K.clar,", "rating": 1}, {"title": "quick and easy", "text": "Date of experience: October 07, 2024", "rating": 5}, {"title": "I forgot to unlock my debit card", "text": "I forgot to unlock my debit card. I unlocked and then hit the add another card. But it also allowed me to resubmit with the unlocked card.", "rating": 5}, {"title": "absurd experience on mobile", "text": "absurd experience on mobile. You will be the next blockbuste", "rating": 1}, {"title": "Great experience", "text": "Great experience, very helpful ", "rating": 5}, {"title": "I dislike the fact that now I cannot download the receipts for my transfers in a pdf form anymore.", "text": "I dislike the fact that now I cannot download the pdf of the transfers I do and I need those for my taxes. I tried to send a message on the chat group but did not get an answer . I called the phone number (0800 ..) for France but the agent could not help me. he gave me an email address and told me to email them for the confirmation of the transactions. I need to know why I cannot download the pdf now. it is very frustrating", "rating": 3}, {"title": "Works as a clockwork!", "text": "Date of experience: October 07, 2024", "rating": 5}, {"title": "Excellent", "text": "Is easy to send money in my country", "rating": 5}, {"title": "Easy , Safe , Fast , Perfect Service", "text": "Date of experience: October 07, 2024", "rating": 5}, {"title": "Transferring money is very simply", "text": "Transferring money is very simply", "rating": 5}, {"title": "You are very clever to follow my change…", "text": "You are very clever to follow my change of location pity you had me jumping all over the place filling out forms that didnt  work...what is my home post code? You are not ready for Ai", "rating": 4}, {"title": "Your system works very well", "text": "Your system works very well. and it is safe.", "rating": 5}, {"title": "Always it shows review your transaction…", "text": "Always it shows review your transaction ,later it get declained, web page is very slow.", "rating": 1}, {"title": "Tres pratique", "text": "Date of experience: October 07, 2024", "rating": 5}, {"title": "quikly and easy", "text": "quikly and easy, nice", "rating": 5}, {"title": "Ease of sending to family", "text": "Able to send money to family with ease", "rating": 5}, {"title": "The transfer is fast and reliable.", "text": "The transfer was fast and WesternUnion is reliable. I've been using it for thirteen years and I've never had any major issues during my past transfers. That's the reason why I continue using it. I've tried a couple of other money transferring companies and, according to my own personal experience, WesternUnion is the best.", "rating": 5}, {"title": "Cannot send money via the website", "text": "Cannot send money via the website.  Keeps asking for a different payment option.  When I call customer support it tells me that I have exceeded my monthly limit and I have to go to the store to pay to release the block.  There is no where on WU's website that shows monthly limits.  I've gone to the store and sent payments six times now and still cannot send on-line.", "rating": 1}, {"title": "Quick and easy to use", "text": "Date of experience: October 06, 2024", "rating": 5}, {"title": "reliable and efficient", "text": "Date of experience: October 18, 2023", "rating": 5}, {"title": "western union.", "text": "Web site ie awful.I put in the amount it keeps changing iy to 400.00when I try to put in my 3 digest code it keeps kicking it outHORRIBLE web site to use", "rating": 2}, {"title": "Transactions are very quick with no…", "text": "Transactions are very quick with no delays.I'm thankful", "rating": 5}, {"title": "I'm from Dallas Texas", "text": "I'm from Dallas Texas ", "rating": 5}, {"title": "Everything was an a great level", "text": "Everything was an a great level. Thank you", "rating": 5}, {"title": "It is easy and simple to send money", "text": "Date of experience: October 06, 2024", "rating": 5}, {"title": "Never allows me to pay via online", "text": "Never allows me to pay via online. Customer service is no help, just advise to pay instore. Not only paying online saves me time and money its very convenient because im disable and dont move about well. If i could give 0 stars i would.", "rating": 1}, {"title": "My ID and transaction information were…", "text": "My ID and transaction information were abused in an illegal private investigation. The customer service agent in London provided the information of my legitimate receiver in violation of the Swiss constitution's Article of Data Privacy. This information was later presented to the Regensdorf cantonal police illegally. It's in the hands of the Muslim communities in the Zurich area.", "rating": 1}, {"title": "The inmate receives money fast.", "text": "Western union is convenient.", "rating": 5}, {"title": "the best rite and fasteru", "text": "Date of experience: October 06, 2024", "rating": 5}, {"title": "Easy ", "text": "Easy and quick", "rating": 5}, {"title": "Straightforward way to send money to…", "text": "Straightforward way to send money to friends and family", "rating": 5}, {"title": "Fast & secure transaction.", "text": "Date of experience: September 02, 2024", "rating": 5}, {"title": "The process is super fast reliable", "text": "The process is super fast, reliable, thrustful and not too expensive..", "rating": 5}, {"title": "fast", "text": "fast, easy and efficient service", "rating": 5}, {"title": "Other screens were presented from old…", "text": "Other screens were presented from old \"sending of funds\", hence I had to find the correct file.", "rating": 4}, {"title": "Easy process in sending money back home.", "text": "Easy process in sending money back home.", "rating": 5}, {"title": "Fast...Price", "text": "Date of experience: October 05, 2024", "rating": 5}, {"title": "Wrong receiver name issue", "text": "I sent a 1500P yesterday and I had to change the debit card info, when I sent it the amount was sent to the wrong person that was on the list. I attempted to change/edit the name, it said it was sending a verification code to my cell number, resent it the second time, never received it. Then the system locked up... I need help with a refund, I have already sent again to the right person, now I need to reverse the prior send to a Anna Fe Chan of 1500P back to my debit card", "rating": 1}, {"title": "Reliable", "text": "Reliable, Fast, On Time ", "rating": 5}, {"title": "Great customer service", "text": "Great customer service. Transfer always on time ", "rating": 5}, {"title": "It Quickly and easily and stafe 😊😊", "text": "Date of experience: October 05, 2024", "rating": 5}, {"title": "Straight forward", "text": "Straight forward, quick and easy.", "rating": 5}, {"title": "Fast and quick ", "text": "Money in seconds. Great service.", "rating": 5}, {"title": "The page does not fully upload", "text": "The page does not fully upload. I am not sure if I am sending the money two times or not. I need to click on the 'send' button several times before it is sent. When dealing with money I expect a more clear delivery system.", "rating": 1}, {"title": "The money get to the people who I want", "text": "The money get to the people who I want ", "rating": 4}, {"title": "Best money transfer service i used", "text": "Best money transfer service i used. You just need to work on your transfer rate, Moneygram gives little better rate.", "rating": 5}, {"title": "Good service", "text": "Quick, easy, fairly cheap. The only downside is that the interface isn't always all that clear, but it's not too bad.", "rating": 4}, {"title": "You are not accepting my Bank account…", "text": "You are not accepting my Bank account information, and sending me the code: C7773.I validated my third part transactions with Bank of America and it worked, for one transaction, then on the second transition I received the C7773 code again.The bank verified you as a payee, but on your end it is not allowing me to continue with the payment???I had to eventually use my debit card, which I don't want to expose.", "rating": 1}, {"title": "EASY AND FAST", "text": "EASY AND FAST, I APPRECCIATE HOW EASY IT IS TO TRANSFER MONEY TO MY FAMILY", "rating": 5}, {"title": "Very fast money transfers!", "text": "Date of experience: October 05, 2024", "rating": 5}, {"title": "Easy to use and a time saving…", "text": "Easy to use and a time saving application.", "rating": 5}, {"title": "The money went in without trouble", "text": "The money went in without trouble.  I'd like to ask a question? How do I remove debit cards that are saved if they are closed? I really need to delete most of them they have been hacked.", "rating": 4}, {"title": "I dislike to wait up to 11 days to…to received the money in the bank. specially when several transfers already established the integrity of the client and  account.", "text": "I dislike to wait up to 11 days to received the money in the bank. specially when several transfers already established the integrity of the client and  account.  ", "rating": 3}, {"title": "I tried sending money over a dozen…", "text": "I tried sending money over a dozen times the web page is not responding correctly", "rating": 1}, {"title": "Why aren't previous transactions saved…", "text": "Why aren't previous transactions saved in history?", "rating": 1}, {"title": "best way to send money", "text": "best way to send money ", "rating": 5}, {"title": "Convenient & fast", "text": "Date of experience: October 05, 2024", "rating": 5}, {"title": "Good service and good exchange rate as…", "text": "Good service and good exchange rate as well. Thank you ", "rating": 5}, {"title": "It's always fast.", "text": "Date of experience: October 05, 2024", "rating": 5}, {"title": "fast and easy", "text": "Date of experience: October 05, 2024", "rating": 5}, {"title": "Unable to verify identification", "text": "Unable to verify identification due to technical issues within the UK. So 'money in minutes' has so far been 24hrs and still unable to send urgent funds! Response from WU...keep trying or we can refund! Not a happy customer 😒. ", "rating": 1}, {"title": "Entry and transfer done Quickly", "text": "Date of experience: October 05, 2024", "rating": 4}, {"title": "you offer a discount but naturally when…", "text": "you offer a discount but naturally when I try to redeem it...Glitch...Why not just offer me nothing instead of stupid flashy BS that don't work.", "rating": 1}, {"title": "The process for sending money to an…", "text": "The process for sending money to an inmate is very quick and has definitely been improved. I appreciate it!", "rating": 5}, {"title": "The money takes too long to Venezuela", "text": "The money takes too long to Venezuela, they need the noney", "rating": 3}, {"title": "Every time I try to use a promo code my…", "text": "Every time I try to use a promo code my transfer won’t go through. The minute I delete the promotion code, my transfer goes through.", "rating": 1}, {"title": "Reliable and expedient way to transfer…", "text": "Reliable and expedient way to transfer funs when traveling the world.", "rating": 5}, {"title": "Fast easy and great service for sending…", "text": "Fast easy and great service for sending and receiving money", "rating": 5}, {"title": "Regular Customer", "text": "Easy, Safe, and Convenient.", "rating": 5}, {"title": "Fast and good rate, only seconds money already arrived in my bank account ", "text": "Fast and good rate, just seconds the money already in my bank account ", "rating": 5}, {"title": "system issues", "text": "While the system works, it is slow and clunky. Perhaps a software problem that need updating. ", "rating": 3}, {"title": "Very good way to send cash anywhere…", "text": "Very good way to send cash anywhere quickly and easily! Online, phone app or at a location! Each method is easy and quick the kiosks at the locations are easy to understand!", "rating": 5}, {"title": "rapid", "text": "rapid, good rate easy", "rating": 5}, {"title": "Good service", "text": "I had very good service ans would use your company again.", "rating": 5}, {"title": "Site way too slooooow.", "text": "Date of experience: October 04, 2024", "rating": 2}, {"title": "Easy to make transfers and my transfers…", "text": "Easy to make transfers and my transfers are always cleared quickly.", "rating": 5}, {"title": "Ease of using application on website", "text": "Date of experience: October 04, 2024", "rating": 5}, {"title": "Smooth and Quick", "text": "You must have upgraded your site, because transactions are faster than before.", "rating": 5}, {"title": "It is easy and fast and user friendly.", "text": "Date of experience: October 04, 2024", "rating": 5}, {"title": "Fast,efficient", "text": "Fast,efficient, smooth.", "rating": 5}, {"title": "Excellent service as always", "text": "Date of experience: October 04, 2024", "rating": 5}, {"title": "The best", "text": "Make past to sand monney.and good ", "rating": 5}, {"title": "Easy to resend monies.", "text": "Date of experience: October 04, 2024", "rating": 5}, {"title": "Easy Process ", "text": "I enjoy the convenience of sending money right from my computer or phone. The process is easy and take less then 5 minutes. ", "rating": 5}, {"title": "Great work!", "text": "Western Union does a great job online for sending funds to friends and relatives.  THANK YOU!", "rating": 5}, {"title": "Easy to use👌", "text": "Date of experience: October 04, 2024", "rating": 5}, {"title": "It is unacceptable what they are doing", "text": "It is unacceptable what they are doing. They are putting my money on hold although it was taken from my account for 3 days and still going. I need the money transfered I wrote them to either release the funds or return them back to my account I cant wait 5 days for them to get their stuff together there are too many other providers that I can use, I regret using their s**t service. Aside from that you cant contact them directly automated responses everywhere. Just trash", "rating": 1}, {"title": "having to wait for a transfer", "text": "having to wait for a transfer, after not ever having to wait is stupid...and unprofessional.  My gawd, this is so annoying.... clear the transaactions and let's move along. ", "rating": 1}, {"title": "everthing is ok but sometime it go for…", "text": "everthing is ok but sometime it go for review and then have to cance and try again thats make trouble", "rating": 4}, {"title": "Great Job", "text": "Great service and fast transaction and sending money. Keep it up and keep on improving.👍👏", "rating": 5}, {"title": "Always easy very fast transfer", "text": "Always easy very fast transfer ", "rating": 5}, {"title": "You can not use promo codes even when…", "text": "You can not use promo codes even when excepted,  spent 47 minutes on hold with 3 different people and no one could help and then when I tried to do it with a representative it was a disconnected line.  Your web site is slow and does not function properly.  I wasted over 2 hours and the only way I could get my transfer to go through was to delete the promo code.  Its just a game for you guys.", "rating": 1}, {"title": "It says 1 to 2 days for international…", "text": "It says 1 to 2 days for international transfers. I sent it on the Thursday and my receiver won't get it until the following Tuesday. That seems like more than two business days to me. Why do you lie on your website and say it will be 1 to 2 days and then send me an email saying it will be a week? I'm going to find a new way to transfer money and stop using you. It used to be instantaneous and now it takes all this time. Don't tell me it's the bank I'm transferring it to because I have already talked to them and you're holding my money. You're making interest off my money. It almost seems like a criminal act to me and I'm going to report you to the better Business bureau. You're straight up lying on your website.", "rating": 1}, {"title": "YOU KEEP SAYING REWARDS ARE ON HOLD SO…", "text": " YOU KEEP SAYING REWARDS ARE ON HOLD SO HOW LONG IS THIS GOING TO BE ???? I HAVE 20 POINTS AND HAVE NOT BEEN ABLE TO USE THEM AND WHY IS IT THAT IT IS CHEAPER WHEN I GO TO A STORE AND SEND MONEY???? BECAUSE IT IS ALWAYS HIGHER WHEN I SEND FROM MY COMPUTER. WHEN ARE YOU GOING TO FIX THIS???", "rating": 1}, {"title": "sLow", "text": ".. the site is very sLow and hard to use .. Moreover, the rate is Low ..", "rating": 2}, {"title": "The truth is that I'm very upset…", "text": "The truth is that I'm very upset because they are canceling my deposits that I make to my country", "rating": 1}, {"title": "It's fast and easy", "text": "Date of experience: October 03, 2024", "rating": 5}, {"title": "Very easy to transfer money", "text": "Date of experience: October 03, 2024", "rating": 5}, {"title": "This site is really hincty and slow.", "text": "Date of experience: October 03, 2024", "rating": 1}, {"title": "Why do I not get any promo codes for…", "text": "Why do I not get any promo codes for using this service for so long? I see if you click on a certain WU link, you will see a 100% no fee usage charge refund. But if I try to use that link, it won’t give me the discount. Why doesn’t it work for me and why don’t I get any discounts?", "rating": 3}, {"title": "Reliable service.", "text": "I have been using WU for years,  It's very reliable and the fees have gone done a lot.  I trust this service.", "rating": 5}, {"title": "COST FACTOR", "text": "IREALLY WISH DEBIT CARD TRANSFER FEES WERE SUBSTANTIALLY LESS AMOUNT.", "rating": 3}, {"title": "Snabbt och smidigt!", "text": "Date of experience: October 03, 2024", "rating": 5}, {"title": "The reliability of the service provided…", "text": "The reliability of the service provided when picking up cash, ease of request using the online requests and contacting customer service when it has been needed. ", "rating": 5}, {"title": "It works and family gets their money. Site is just so slow to respond", "text": "The site is so slow to respond to the different pages it makes it hard to use. I use it very often to send money to the Philippines. But sometimes have to start over because the pages time out.It works, my family gets their money just so clumsy to use.Been using the site for several years. Wish you would upgrade your servers or ?", "rating": 3}, {"title": "Fast service", "text": "Date of experience: October 03, 2024", "rating": 4}, {"title": "Slowest it's ever been", "text": "The website was so slow, I kept thinking it was frozen. It's not on my end – I have gigabit fiber internet. ", "rating": 2}, {"title": "The best money transfer ever..", "text": "The best money transfer ever... thanks ", "rating": 5}, {"title": "Easy and User Friendly Website", "text": "Date of experience: October 03, 2024", "rating": 5}, {"title": "I don't understand why on hold", "text": "I don't understand why on hold ", "rating": 1}, {"title": "Refund money order", "text": "On July 31, I opened case to get a refund for money order. They told me it would take approximately 30 days and I waited. When I saw that I had no response, on September 9, I chatted and they told me it was processed, and on September 13, they told me it was already in delivery. Today, still without a response, I chatted with Mayuri V again and she told me that the case was not processed and that she would reopen it. Nobody gives me an answer, on the contrary, they even lie to me saying that it is already in delivery (you can verify in the chat). I don't think it's fair that after two months it hasn't even been processed and she just tells me that they can't tell me how much longer I have to keep waiting.", "rating": 1}, {"title": "No points at all", "text": "Date of experience: October 03, 2024", "rating": 1}, {"title": "I've been using this site for a couple…", "text": "I've been using this site for a couple of years, and it's a good one.", "rating": 5}, {"title": "Later delivery of money ", "text": "When submitting transfer it said money would be delivered same day.  I sent one transfer on Sept 27th and it is still not there.  I just send another and again it said it would be delivered real time then a notice popped up saying that it would be delayed.  The late delivery notices where after transfers were submitted.  If I cancelled then it takes along time to get money back", "rating": 1}, {"title": "Quick and easy", "text": "Quick and easy ", "rating": 5}, {"title": "Quick resend button is useless", "text": "Quick resend button is useless, always take a longer time and I don’t understand the need of reviewing my documents everytime i want to send money.", "rating": 2}, {"title": "Very easy and fast", "text": "Very easy and fast ", "rating": 5}, {"title": "Very fast and efficient", "text": "Very fast and efficient ", "rating": 5}, {"title": "FAST AND EASY DELIVERY ONLINE", "text": "Date of experience: October 03, 2024", "rating": 5}, {"title": "Easy transfer", "text": "Date of experience: October 03, 2024", "rating": 5}, {"title": "slow internet maybe u maybe me ---i am…", "text": "slow internet maybe u maybe me ---i am glad I can use western union thanks alot !!!", "rating": 5}, {"title": "Sending Money", "text": "I like how I can start a transfer online and pay in store so it saves me time; however, the only issue I have been having is the system automatically changing around the last names of the person I am sending money to, so it has made me have to go on the support page to fix the name since it can be done at the store.", "rating": 3}, {"title": "I like because I can made transfers…", "text": "I like because I can made transfers from my home easy and quick", "rating": 5}, {"title": "I made I transfer of 578,86euro to…", "text": "I made I transfer of 578,86euro to $Argentine Pesos.I dont like to be requested a picture of my bank card. ", "rating": 1}, {"title": "Easiest way to send money", "text": "Date of experience: October 03, 2024", "rating": 5}, {"title": "Great Services", "text": "Easy and customer services very helpful", "rating": 5}, {"title": "Quick and safe service", "text": "Quick and safe service, easy to use app", "rating": 5}, {"title": "Excelent all", "text": "Date of experience: October 03, 2024", "rating": 5}, {"title": "Site does not perform as easily as it…", "text": "Site does not perform as easily as it used to. History doesn't show unless you refresh and then it no longer shows latest to oldest transfers and date filters don't work well. It takes much more time now to do a transfer, and no longer shows records of all transfers and can no longer start another transfer because they now go to under review despite many years of doing the same transfers", "rating": 3}, {"title": "Easy and simple", "text": "Easy and simple ", "rating": 5}, {"title": "Easy access", "text": "Date of experience: October 03, 2024", "rating": 5}, {"title": "everything is fine", "text": "everything is fine ", "rating": 5}, {"title": "Good customer service!", "text": "Date of experience: October 03, 2024", "rating": 4}, {"title": "Extremely straight-forward", "text": "Extremely straight-forward, fast and efficient.  ", "rating": 5}, {"title": "Easy and fast and good exchange…", "text": "Easy and fast and good exchange currencyThank You", "rating": 5}, {"title": "great service", "text": "Date of experience: October 03, 2024", "rating": 5}, {"title": "Already 5 payments didn't come to the…", "text": "Already 5 payments didn't come to the receiver. I'm the sender. One payment are done on 22/06/2024 and still NOT at the receiver!!!! I have make each time complains, but no result even now on 3/10/2024!!!My name is Willem H. from Belgium. With My WU # 466.594.054Pls contact me in WhatsApp +32..endid 513 or in my E-mail address you have.", "rating": 1}, {"title": "I got this problem i always claim…", "text": "I got this problem i always claim western through gcash yet it says i was locked out due to 3 invalid mtcn tries but the mtcn was correct. Could someone help?", "rating": 3}, {"title": "The money isn't delivered.", "text": "Reference number 28573874Tracking Number (MTCN) 2138891210Western Union website shows the transfer transaction is complete. However, the money isn't delivered as it should be received on September 22, 2024. The money has never showed up at the receiver bank. Contact Us section at WesternUnion.com is a dummy chat which isn't actually talk it's just give options. The option to complaint is to contact Customer Care.Customer Care gave me Transfer Code and asked to go to the receiver bank. The receiver bank mentioned the Transfer Code isn't exist. Western Union sent me a letter saying that the money has been picked up. Logically, the receiver bank stated they don't have the transfer code, how the money has been picked up? Please ...Contacted Customer Care again and they admitted there was system update and some transactions were affected. They said will give me update but never heard anything and they haven't delivered the money. Please send the money as my family need it.I will update this review when the money is actually delivered and note the actual date of delivery.", "rating": 1}, {"title": "Generally it does OK", "text": "Generally it does OK. Last time I sent money for commissary, I had to pay for the urgent delivery. My son checked several days for the money, but it wasn't there in time. I put the money in and it cleared on Tuesday, September 17th, it didn't show until Saturday, September 21st. I paid for urgent delivery, but didn't receive it.", "rating": 3}, {"title": "Website is very slow", "text": "Website is very slow. Also I had to restart my transaction several times before it went through.", "rating": 2}, {"title": "I have spent 50 minutes trying to send…", "text": "I have spent 50 minutes trying to send money to my inmate son. I tried the new inmate thing.  I would not go beyond  chasing inmate. I tried over and over.  Then I added the app.. it wasted 20 minutes of time.  Finally came back to basic.  Signed in.  Wanted to resend. Tried adding new card. It took 4 or 5 times to get it to work. What is going on with your site and app??? ", "rating": 1}, {"title": "It kept coming up in Spanish", "text": "It kept coming up in Spanish, altho I've been doing this in English for years.  I kept losing the space for my US ammount.", "rating": 3}, {"title": "always fast and easy to send money", "text": "always fast and easy to send money. i send my daughter money every other week and i never have problems. two minutes is all it takes.   Thank You", "rating": 5}, {"title": "because I sent someone some money…", "text": "because I sent someone some money yesterday, and today, I went to do it again, and now it says that they have to review it, before they can send it to that person, ok? I'm very disapointed with this action, thank you", "rating": 2}, {"title": "in the past 2 weeks sending money ha…", "text": "in the past 2 weeks sending money has required multiple calls to my bank and western union. I have been making these transitions for a couple years, WHY is this now a problem?????", "rating": 1}, {"title": "i love this  app", "text": "Date of experience: October 02, 2024", "rating": 5}, {"title": "Great experience", "text": "Great experience, easy and fast", "rating": 5}, {"title": "I’ve used this service a couple of…", "text": "I’ve used this service a couple of times, and the transfers were quick and smooth, with my recipient receiving the money almost instantly. However, when I returned for an urgent transfer, it was unexpectedly canceled without clear explanation. This was frustrating, especially since I needed the money to arrive quickly. Reliability is key for services like this, and I hope they improve their consistency", "rating": 3}, {"title": "It was simplified and easy to use. My only", "text": "It was simplified and easy to use my only problem with it is that it says debit card you you have to use urgent delivery and they charge you $8.95. I understand a fee being charged but then I'm told my transfer is on hold so why do I have to pay a fee if they're going to hold my transfer and not send it immediately or urgently.?", "rating": 4}, {"title": "Too high commission", "text": "Date of experience: October 02, 2024", "rating": 1}, {"title": "Awesome money transfer service ", "text": "Easy to use and transfer money seamlessly.", "rating": 5}, {"title": "Safe and easy!", "text": "Date of experience: October 02, 2024", "rating": 5}, {"title": "Always some problem.", "text": "Always some problem.Transfer cancelled for whatever reason.And when it finally works it takes way too long.This has been going on for years.", "rating": 1}, {"title": "Usually a very smooth transaction", "text": "Usually a very smooth transaction. This time I tried to leave a message, then it took me to emogis, I tried to back out, but ended up 2 -3 pages back then a couple of continues to get to the send page.", "rating": 3}, {"title": "It’s very easy to use ", "text": "To use western Union it is very easyTo use and the person recieves the money very fast ", "rating": 5}, {"title": "Super unreliable site!!", "text": "Date of experience: October 02, 2024", "rating": 1}, {"title": "Great quick", "text": "Date of experience: October 02, 2024", "rating": 5}, {"title": "Cumbersome", "text": "Would not accept valid card, interface cumbersome", "rating": 2}, {"title": "The app is user friendly and the…", "text": "The app is user friendly and the transfer set up is very efficient.", "rating": 5}, {"title": "Fast and simple.", "text": "Date of experience: October 02, 2024", "rating": 5}, {"title": "Sending money to myself, not easy (I am in the Philippines right now)", "text": "Sending money to myself is an absolute nightmare. To your support, the Norwegian Bank ID system is also horrible, like turning back the time when we were using steam engines.", "rating": 1}, {"title": "Perfect", "text": "It was great", "rating": 5}, {"title": "I can't to send my money yet.", "text": "I can't to send my money yet.I'm doing all regular process and this isn't enough. I hope that Western Union resolve my case as soon as possible.I should to clear that is the first time that I have inconveniences with Western Union in 3 years. However I'm keep trusting of them.", "rating": 1}, {"title": "Fast and smooth", "text": "Date of experience: October 02, 2024", "rating": 5}, {"title": "its so good but sometimes i experience…", "text": "its so good but sometimes i experience it takes how many days before i recieved my money in my bank. ", "rating": 3}]