[{"title": "Everyday", "text": "Everyday, affordable, trending,  \"synthetic\" apparel for everywhere ! Vs other brands. Now, the brick and mortar stores with the employees are rude ! ", "rating": 3}, {"title": "Return To Your Winning Identity ", "text": "Hello, I logged on to the RainbowShops.com App on my phone to do some Birthday shopping for my wife (Yes, I'm a man) and the website shut down on me in the middle of it. I believe that it was about an hour later when a Customer Satisfaction Agent reached out to me via text because apparently she noticed that I hadn't finished adding merchandise to my cart or making a purchase. Also, for some ungodly reason, the selection wasn't good either. It didn't seem to matter whether I was looking for decent matching sets or individual pieces to put together to come up with a few stylish outfits, this batch of clothes just wasn't as good as usual. I've been having this account for SEVERAL years now, and I believe that this was the worst I've ever seen Rainbow advertise. There were wayyyy too many mid-drift, see-through, and just plain old bad patterns with style miscues.", "rating": 3}, {"title": "Okay but, needs an overhaul ", "text": "The price points seem pretty good on most items but you need a better selection and much more forward fashion especially in your plus sizes.  Some of the clothes show the obvious poor quality, are ill-fitting and not well made and it is evident even on the models. ", "rating": 3}, {"title": "This was my first time ordering online…", "text": "This was my first time ordering online from Rainbows. I ordered 4 pairs of shorts and two skirts. I was very disappointed with the quality of the clothes. I am an elderly woman and the materials used in these clothes are very thin, cheap looking and NOT flattering at all. So, I probably won't be ordering from the website again. Thank you", "rating": 3}, {"title": "First time online Rainbows experience …", "text": "I enjoy shopping at rainbows for certain items in-store however, this was my first time shopping online and I was quite disappointed to be honest.  Expected to see the items that are available in-store online as well. Unfortunately every time I pressed on the item I wanted it was sold out.. I suggest that sold out items should be taken down off site. Also to restock the plus sized turtleneck selection. Thank you", "rating": 3}, {"title": "Wish the site had categories to better…", "text": "Wish the site had categories to better find things I might like instead of trying to go through 18 pages of mixed pieces. I stopped at page 3 or 4 once I found the leggings I wanted, but if there were categories, I probably would have spent more time and money. Going through smaller categories is nicer than going through entire inventory in one long run.", "rating": 3}, {"title": "Kindly stated", "text": "Kindly stated, pages are fairly easy to navigate. There could be some improvement on returning to the exact same images after viewing one then hitting the back button. The site could also adjust the response time when buttons are hit; it was as bit slow (and it was not my internet or 5G connection). And lastly it would help if the site did not require confirmation as to whether the potential customer wants to continue shopping; just add the items to the cart without all of the extra.", "rating": 3}, {"title": "Love the items and prices", "text": "Love the items and prices! I had trouble creating the account.  I hated having my cart go empty  several times while still shopping, that was very frustrating, couldn’t remember all the items I had placed in my cart.  I was uneasy with the sizing, I’m usually an 8 ,choices were 7 or 9, a customer review would be helpful with sizing. Overall happy to be able to purchase on line!", "rating": 3}, {"title": "You should have a in-store free…", "text": "You should have a in-store free shipping method available for customers that want to pick up at a store location. It is much harder to pick $100 of clothes (since they are not as nice as years back) in order to receive the free shipping with minimum amount on delivery. Really disappointed……..", "rating": 3}, {"title": "More Selections Please", "text": "The clothing ( jeans) that brought me to the website was only available in limited sizes, or was no longer available. The filter ( by size) really limited my selection even more. I had to be creative in my selection technique to find more items in my size, or that interested me.", "rating": 3}, {"title": "Y’all need free shipping for jewelry or buy online but free pickup in store", "text": "Had a really good discount for jewelry but not much of a discount anymore because you guys give no option to buy online but pickup in store for free especially for jewelry. The jewelry bought was only online so I HAD to purchase online. Y’all should have free delivery or even if the item isn’t in store & is only online y’all should have free store pickup. Ended up paying $30 for some fake jewelry cause of shipping costs. Ridiculous", "rating": 3}, {"title": "Plus Size Shopper", "text": "Rainbow always offer clothes that are fun to wear and trendy. The company also offers a wide selection. I am a plus size woman who often shops at Rainbow online and in stores. However, on this visit online there wasn't a wide selection of tops for plus size women. I was only able to find two incredible pieces and at a good price.", "rating": 3}, {"title": "I love rainbow because it sticks to its…", "text": "I love rainbow because it sticks to its business model, understands its customer in all ways. It feels like in spite of economics and size you try to help women feel beautiful . I have wishes that Rainbow would have sizes in plus that are not the Chinese plus sizes and that bra manufacturers understood that big breasts with  small chest size are not the norm. Band width counts . One more wish , that underwear for big women was made with pretty in mind. Thank you for everything else ,you have made a difference in my life,", "rating": 3}, {"title": "I like shopping at Rainbow but when I…", "text": "I like shopping at Rainbow but when I purchase an order my shipment from FedEx is always tendered or fail to make attempt delivery or order is pending. No one came by or attempted to make a delivery. Someone is at the house all day. My package were to be delivered on June 25th. Its June 27th no delivery. FedEx delivery service is horrible and it is not getting no better. Rainbow I use to be a valuable customer but your carrier is horrible.", "rating": 3}, {"title": "I like shopping with rainbow online…", "text": "I like shopping with rainbow online store but I have had some experiences where I received clothes with either a stain or a little tear etc. sometimes the clothes look like it was actually worn and returned and then sold online. This has been totally indigenous to me.  Other than that the experience has been good.", "rating": 3}, {"title": "Reasonable prices not alot of stock!", "text": "I just placed my online order, haven't actually received the items yet. So can't review the quality, but the prices are really good especially for young girls clothing. However the size 8-10 girls in almost every single 2 piece outfit was not available, as well as most dresses and pants. This is the one size I was actually shopping for. I would have probably spent alot more money if they actually had the sizes that I needed.***Edited for quality of clothing****  Unfortunately the quality was not great ....the stitching on the sweat pants and zip up sweater were very poor. A hole appeared in the crotch after just one wear, and balling on the material after one wash....disappointing.", "rating": 3}, {"title": "It’s hard to tell how the clothes actually fit", "text": "While I love Rainbow selections and prices, I find it hard to shop. In my area there isn’t a store close so I mostly shop online. The problem that I have is your models all have flat stomachs so it’s hard to see how the clothes will actually fall on me. I’m a short woman wearing a size 22, I would like to see how the clothes look on my body type and I don’t see how that’s asking a lot from a store with a large plus size line. A person wearing a 10 or 1x should not be modeling the entire plus size line because it’s just not helpful.", "rating": 3}, {"title": "On Facebook prices maked one price only…", "text": "On Facebook prices maked one price only to go on Rainbows   website and found that they  changed, I  had already hit the purchase button,  yet there were other items I was interested in purchasing,  but will not be deceived . I will return those items I speak of.", "rating": 3}, {"title": "So this as been my first time,I don't…", "text": "So this as been my first time,I don't normally comment,rate or so on.but I had to tell you about my experience because I was having trouble with the items in the cart,so when I add items to the cart,it's like it is showing a glitch or something like that,so it was very hard for me to place the order and etc,but I hope it's not gonna happen like that again.", "rating": 3}, {"title": "I wanted to pay through Klarna but was…", "text": "I wanted to pay through Klarna but was never given the option. It would also be nice to get free shipping on a lower total. Other than those 2 things, the online shopping & purchase experience was fine.", "rating": 3}, {"title": "I love rainbow shop", "text": "I love rainbow shop, but because I had an account before 2021 I had to create another account and it didn't go thru. Thankfully I was still able to make my purchase.", "rating": 3}, {"title": "Paypal doesnt work to pay", "text": "Love the amount of clothe you are selling and the prices. Hated that the system had a glitch of some sorts and didnt let me pay with my paypal account. I tried different channels . In the app, outside, with my husband’s and nothing. It didnt work. I wanted to pay with paypal so that  I could buy more and split my paymemts in four.  Maybe in the future🤷🏻‍♀️", "rating": 3}, {"title": "I was told if I use my email I would…", "text": "I was told if I use my email I would get 10 percent off nope didn't work then it said if I gave my phone number I would get 10 percent off that didn't work as well I had to call up what a pain ", "rating": 3}, {"title": "I brought 3 different color MotOr Babe…", "text": "I brought 3 different color MotOr Babe leather jackets and they All have some kind of marking on they. So if you purchased these jackets. Jackets are nice but markings are noticeable. So I rated it a 3 star.Check to see if they have markings on them. I will upload pics if it lets me.", "rating": 3}, {"title": "Browsing Issues / Great prices", "text": "There were lots of shoes to browse however, once a shoe was clicked it went back to the beginning of the list. That was quite annoying after literally scrolling through hundreds of shoes. Other than that, checking out was a breeze!", "rating": 3}, {"title": "I couldn't find a coupon", "text": "I couldn't find a coupon, and an item sold out before I checked out.  Plus, I had a hard time connecting my order via FaceBook once I signed into my account.  I had to go in and recreate my entire order, or should I say the items that were still available.  Once I logged in it should have updated the items on my app.", "rating": 3}, {"title": "I DON'T RECIEVE ANY CUPONS FOR ONLINE OR IN THE STORE!!!", "text": "When a customer register with Rainbow Shop. WHY DON'T WE GET SOME CUPONS THAT SAYS TO US YOU APPERICATE OUR BUSINESS. THATS NOT RIGHT OKAY!!! I BUY A LOT FROM THE ONLINE STORE GIVE NE SOME CUPONS PLEASE!!! HOW DARE YOU ACT LIKE I'M MOY A VALUED CUSTOMER!!! SAME ON YOU RUBISH!!! DON'T LET THIS HAPPEN AGAIN THANK YOU LISA M!!!", "rating": 3}, {"title": "I wish Rainbows had customer reviews", "text": "While Rainbow Shops has a variety of clothing and sizes for affordable prices, it would be great if there were customer reviews on the store site. I was unsure of fabrics and the fit of the items I had in my cart and I hesitated immensely on whether to make my order or not. Reviews can help speed up the decision making part of shopping online, thus completing sales faster before customers have the chance to decide not to purchase at all due to uncertainties.", "rating": 3}, {"title": "Angela's review", "text": "What I did not like was I didn't know the full total until after I put my credit card number in it showed me one tool then it changed I didn't like that other than that everything else was okay", "rating": 3}, {"title": "I like the products from rainbow but…", "text": "I like the products from rainbow but from rainbow and other merchants I get an offer for 10% off if I provide my email or phone number and then I provide it and it’s like oh you’re already signed up so I do NOT get the 10% off. ", "rating": 3}, {"title": "Frustrating Experience", "text": "Monday 3/27/23Rainbow is Shipping my shoe orders to wrong addressBilling address is also wrong I gave my correct Billing addressand shipping address when orderingon Rainbows Order AppMy Order is paid in fullRainbow has my gmail and cell #", "rating": 3}, {"title": "Need to conduct user friendly focus group ASAP", "text": "There were no reviews to read and assist with decision making. The quality of the pictures once you click on an item is poor. I was unable to purchase a hand bag because it couldn’t be shipped. Why place items on an online shopping platform if they can’t be shipped?", "rating": 3}, {"title": "It's a challenge shopping for an item I want on line, but, it's good to have the option..", "text": "Was looking for a Jolie & Joy multi print body suit I bought in a szL from the 125th & 8th ave store in Harlem.  Some items have a lot of stretch & fit up to 2 sizes smaller, which a lot of stretch is good. I wanted to order 1 in XL. Also I couldn't find my size XL in 2 piece sets jacket & pant in outer wear (sweat suits) except 1 I had bought in a large, in the fushia purple color, from the store when I couldn't find in XL. I was surprised I saw it here online in an XL & ordered it, when I couldn't find it b4. May have to alter the 3X. I took a chance cause the sizes aren't always true to size in sweat outerwear.  I gave the sight a 3 Stars cause, though it's possible the sight only showed whats available online. The site didn't give the chance to key in items in search, nor let us know what store has it, which I think is a good idea. Searched for 1 item I didn't find, on line, & ended up buying 6 other items.", "rating": 3}, {"title": "Shipping costs suck", "text": "Shipping costs will result in me abandoning a cart almost every single time. Boooooo to $7.99 👎🏾 but it's my daughter's birthday I needed something very specific.", "rating": 3}, {"title": "I want to place my order but the…", "text": "I want to place my order but the sandles that I’m choosing keep coming up a wrong color so I had to cancel my order 😔I really wanted these sandals I’ll call customer service on Monday", "rating": 3}, {"title": "Back then you had an ideal  of clothersthe clothers some…", "text": "I like the way the clothers some whatbthe same price & or why don't they still have winter clothers it's 40 degrees out side nobody can't buy shorts right now..... I dis like not much to pick from", "rating": 3}, {"title": "I had a problem logging into my account…", "text": "I had a problem logging into my account because it had my old phone number. It had my new number on file but the site kept giving me a code to my old number. I couldn’t log in properly and I ended up purchasing as a guest.", "rating": 3}, {"title": "Need for improvement", "text": "The items and quality are good BUT the items listed as plus size or extended plus size are sooo very limited. Women 40 and over shop here give them some optoins and a want to come back for more.", "rating": 3}, {"title": "Not all items can be shipped to me.", "text": "I have been shopping at Rainbow for years. I do not have an actual store near me so I can only shop online. Today I had to remove 7 items from my cart (all kid shoes) because they wouldn’t ship to my address. Why??? All the other items are good to ship. Kinda inconvenient.", "rating": 3}, {"title": "I had a 10% off coupon and spent over…", "text": "I had a 10% off coupon and spent over $100 but couldn't use the coupon & it didn't say why or what I could use the coupon on. I received the coupon for signing up for emails and text through the website. ", "rating": 3}, {"title": "No modest skirt/top matches", "text": "I was disappointed that there were no modest plus size matching skirt and jacket/top items. I am not interested in buying a short, short skirt.", "rating": 3}, {"title": "It is user friendly.itI ", "text": "I think you should be able to check on your cart anytime, not just after you put something in the cart.  It is not very user friendly overall.It just needs some fine tuning,so everything is a little easier to navigate.", "rating": 3}, {"title": "Where’s my 10% off?", "text": "I was supposed to get an extra 10% off for the spin that I did when I signed onto the website and downloaded the text/email notifications. I know it’s only 10%, but it’s more the principle.", "rating": 3}, {"title": "Missing 3 items from my order .", "text": "Missing 3 items from my order .Oder took almost two weeks to arrive. Dissatisfied at best.", "rating": 3}, {"title": "Rainbow has great prices and the…", "text": "Rainbow has great prices and the website is easy to navigate. I do wish that if you shop with them frequently you get points or some kind of system to earn free shipping or deals.", "rating": 3}, {"title": "Purchases in the past have been…", "text": "Purchases in the past have been canceled without explanation! I will see what happens with this order and whether or not it gets canceled! Thanks Ms. McQuiller", "rating": 3}, {"title": "Need more style options in more sizes and colors", "text": "I have been checking for long sleeve girls green French Toast school uniform polo in size 7-16 for over a year now, and you guys will not stock it. You have it in yellow, red, navy, lots of colors, but refuse to stock the green polo in long sleeve. The only green long sleeve polo is for 2T-4T, and that's too small. Children grow you know. This is very disappointing every time I shop on rainbowshops.com.", "rating": 3}, {"title": "Shopping on the site was easy but …", "text": "Shopping on the site was easy but there are not enough filters. There should be more filters to filters size price and color on the kids selections. I would also like to shop for one gender at a time and I didn't have that option.", "rating": 3}, {"title": "prices and variety (redundancy)", "text": "I liked the prices and variety; however I did not like that it kept repeating the same item, in a different color. It made shopping confusing.", "rating": 3}, {"title": "I love the prices but would like to see…", "text": "I love the prices but would like to see an equal variety of modest pieces to choose from. The majority of the fashions are gaudy, form fitting, and 'street' attire.", "rating": 3}, {"title": "Not Much Left To Choose From", "text": "Half of the things I wanted weren't available. Even the things I had in my cart to purchase as a set, I had to put the other piece back because the top or bottom was not in stock.", "rating": 3}, {"title": "It took me 7x to try to checkout with…", "text": "It took me 7x to try to checkout with Apple Pay and I finally had to check out as a guest for my transaction to be completed ", "rating": 3}, {"title": "Your online shopping should have all…", "text": "Your online shopping should have all the colors and opportunities that people are looking for. And because you don't it makes shopping hard for the customers.", "rating": 3}, {"title": "Didn't have too much for plus sized…", "text": "Didn't have too much for plus sized people and the prices are higher online then actually going to the store ", "rating": 3}, {"title": "The only reason I ordered was bc 1) You…", "text": "The only reason I ordered was bc 1) You offered free shipping with $35 orders instead of the absurd $75 it was the past year, when I didn't order at all.  2) You offered some products that were a blend of COTTON and POLYESTER. I need blends bc they last longer and don't need ironing. I am disappointed bc: 1) I used to find nice tunic and long shirts I could wear with tanks and leggings, at work. Past 2 years, your website has looked like a cheap dollar store nightclub attire. Ugliest clothes lately. Glad I found a few nice items today. 2) Where are the 95% cotton, 5% spandex solid thong panties you had back in 2007ish? 5-7-9 brand. So comfy. Now the stupid ones you sell say \"Love\" all over the waist band. Hate clothes with words on them. I was actually going to buy some and paint over the word LOVE, but you had NO black ones in size small. Stock your website properly for a change! Thanks!", "rating": 3}, {"title": "The shirt I bought was a little smaller…", "text": "The shirt I bought was a little smaller than I expected. The package was so packed tight, I accidently cut the shirt trying to get it out. The package did arrive early though.", "rating": 3}, {"title": "I had new items in my cart that were…", "text": "I had new items in my cart that were showing available then when I checked out they weren’t available. ", "rating": 3}, {"title": "Disappointed", "text": "My tops were delivered today. It took forever to get here. Over a week. Fed Ex is horrible. They always take a long time for delivery. Tops are cheap material. I expected more for what i paid.", "rating": 3}, {"title": "Shipping charge when wanting to pick up", "text": "Prices fine. Hope items are good.Shipping when wanting to pick up and still charge shipping is unacceptable.", "rating": 3}, {"title": "Fast shipping but....", "text": "The shipping was fast so that was a plus.  I wasn't a fan of the materials. The looked nice but I hated the way they felt so unfortunately, I returned them all.", "rating": 3}, {"title": "I like that the items are very well…", "text": "I like that the items are very well price at a very reasonable amount however I couldn’t fine very many items in stock in my size", "rating": 3}, {"title": "I feel like some of the shoes that was…", "text": "I feel like some of the shoes that was still of a high price should’ve been on the $12 sale because I definitely would’ve bought more but the ones that I like far as the style was alil high. But overall definitely great sale on the shoes I bought. Thank you😀", "rating": 3}, {"title": "Check out was a bit stressful I ordered…", "text": "Check out was a bit stressful I ordered with you all before so many times never had such a hard time to make my payment", "rating": 3}, {"title": "Maybe next time", "text": "My experience wouldve been Great if i had the Option to purchase item i returned for larger size in store and have it shipped home. Maybe next time.", "rating": 3}, {"title": "Cart Automatically Emptied", "text": "I really don’t like the fact the cart is cleared after an hour. I added over 25 items in the cart, went to a meeting, and came back to make a purchase and everything was gone. It’s a little frustrating. ", "rating": 3}, {"title": "Decided to give your company a three…", "text": "Decided to give your company a three stars. This was due to size difference and a item that was for a man was sent. Instead, I received a perfume, which ok. Thanks for the order. It cam e faster than expected.", "rating": 3}, {"title": "I would love if I could peacefully log…", "text": "I would love if I could peacefully log in and locate my orders, the app keeps jumping all around the place.. very annoying but I love the products.", "rating": 3}, {"title": "I just Love the way the clothes fit", "text": "I just Love the way the clothes fit. It's just too much taxes. So It'll be a minute before I order something unless my husband orders something for me.", "rating": 3}, {"title": "I like the clothes but the girl tops…", "text": "I like the clothes but the girl tops for 7 year Olds are too similar.  It's like buying the same styles in different colours", "rating": 3}, {"title": "I tried to stop processing through…", "text": "I tried to stop processing through Shops in order to update the addresses and was unable to. There should be a confirmation button.", "rating": 3}, {"title": "Slim picking", "text": "It's seems like there's less to choose from online. If in the store it should be online and online should have a few things that's not in stores", "rating": 3}, {"title": "No Discounts", "text": "I would give it a Four star but they have you set up your email for a 10% discount an you never get it dis honest.", "rating": 3}, {"title": "Your online descriptions are not clear", "text": "Your online descriptions are not clear.  You have to go in and see if you are talking about both items or one even if it claimly states that its a two piece set. You want to sell by the piece", "rating": 3}, {"title": "Rainbow is a wonderful  place to shop", "text": "Rainbow is a great place to shop , I love there clothes and shoes ok just need more sizes all always running out my size. Otherwise it’s a great place shop", "rating": 3}, {"title": "I so dislike putting items in my…", "text": "I so dislike putting items in my shopping cart and everytime I go back to purchase half the items are missing from the cart. This so annoying", "rating": 3}, {"title": "The sizes are not accurate and there…", "text": "The sizes are not accurate and there are no dressing rooms! Had to exchange for a larger size. Very inconvenient!!", "rating": 3}, {"title": "No discount coupons with being a loyal…", "text": "No discount coupons with being a loyal customer. I’m have been a loyal customer but I never get any discount coupons.", "rating": 3}, {"title": "Packages", "text": "Other than one of the items being open and another one not being wrapped everything was delivered fine.", "rating": 3}, {"title": "So far so good", "text": "So far so good, I'd like to receive the product before I make any real decisions on my experience.", "rating": 3}, {"title": "After purchasing items!", "text": "Things I had in my bag went on sale after i purchased and I couldn't  cancel my order had to repurchase them separately...", "rating": 3}, {"title": "Overall they do have items that are…", "text": "Overall they do have items that are greatly priced. But I guess you do get what you paid for. I have two sandals that are falling apart after less then 4 wears.... it just makes no sense. I will probably just pay the extra and get them somewhere else from now on.", "rating": 3}, {"title": "Well I got a mistake to put the wrong", "text": "Well I got a mistake to put the wrong apartment number and I can’t changed … Supposed to say 6141 metrowest Blvd 303 , not 301 .. I don’t know how to changed ", "rating": 3}, {"title": "My size sold out", "text": "It seems every time I want a pair of boots or shoes, my size is sold out.Apparently, the larger shoe sizes are quite popular.Will you PLEASE stock more size 11s and 12s and solve this dilemma? Thank you", "rating": 3}, {"title": "Some prices are reasonable…For a first…", "text": "Some prices are reasonable…For a first time online shopper…no coupons were available.", "rating": 3}, {"title": "I was unable to use my MC debit card…", "text": "I was unable to use my MC debit card and instead had to purchase a gift card to order my clothing.", "rating": 3}, {"title": "Some features were buggy", "text": "Spin to win refused to give me my coupon and i had to contact customer service. By the time everything was settled one of the items I wanted was no longer in stock", "rating": 3}, {"title": "Said my order was free shipping but…", "text": "Said my order was free shipping but still got charged 7.99 for shipping so not truly understand thst", "rating": 3}, {"title": "Limited selections", "text": "The selection was very limited in the upper sizes ( l)12- 14. The app kept freezing I kept having to go out and come back in.", "rating": 3}, {"title": "I would appreciate if there was an…", "text": "I would appreciate if there was an option for pick up at the nearest store instead of paying for delivery.", "rating": 3}, {"title": "Easy shopping", "text": "Site is good but it would be nice to know stock at stores. Therefore if you want something soon you can potentially pick it up.", "rating": 3}, {"title": "The articles that I wanted to order we…", "text": "The articles that I wanted to order we not available for my size. Clothes run small I normally buy 2X but even the 3X were hugging me.", "rating": 3}, {"title": "I was not able to use my military id…", "text": "I was not able to use my military id for the discount or did not receive any discount", "rating": 3}, {"title": "I don't like there were limited sizes…", "text": "I don't like there were limited sizes of every item I chose to purchase online. ", "rating": 3}, {"title": "Well my ova all experience shopping…", "text": "Well my ova all experience shopping with rainbow shops is wonderful the choices and selections are great🥰 But the checkout is where my problems occur it often times gives me one ova all price but it jumps up and most of time causes me to have to remove some of my choices  dats my only complaint🙋", "rating": 3}, {"title": "PRO- I like the prices CON - Slow shipping, no site to store option", "text": "PRO- I like the pricesI like the variety of plus sized optionsCON- I dislike not being able to have my items shipped to the store.Free shipping is extremely slow.", "rating": 3}, {"title": "All the clothes looked nice on the…", "text": "All the clothes looked nice on the site... I haven't to received my items to say anything else... I look forward to my items", "rating": 3}, {"title": "The prices were good but shipping is…", "text": "The prices were good but shipping is outrageous and only offered for free if you spend a certain amount.", "rating": 3}, {"title": "The captcha had trouble", "text": "The captcha had trouble so I get getting an error on the payment page. Otherwise, everything was fine.", "rating": 3}, {"title": "What I liked are the prices and…", "text": "What I liked are the prices and selection. Everytime I wanted to check out one or more items were out of stock. I had to do it several times. It was very frustrating. Other than that I would shop with them again.", "rating": 3}, {"title": "Sent the wrong items.", "text": "Sent the wrong items.They have this awful smell like oil & funk.Could not find a way to contact customer service.Some of the clothes seem worn already.", "rating": 3}, {"title": "No go back or exit button", "text": "Your app does not have a go back button after viewing clothing. You have to start all over again by going to the menu to exit out.", "rating": 3}, {"title": "I have the app and it is very difficult…", "text": "I have the app and it is very difficult for me to access it. I try my username and password and nothing happens", "rating": 3}, {"title": "The app has been freezing", "text": "The app has been freezing, and should allow coupons or discounts for frequent users", "rating": 3}, {"title": "Your app is very easy to use and very nice", "text": "Your app is easy to use and very nice but when I press my everything that I picked out in the size and color was not available that’s very frustrating to have to go back in the shop something different or just cancel it because the item is no longer there before I can even press by", "rating": 3}, {"title": "I place an order on 3/1/2024 and have…", "text": "I place an order on 3/1/2024 and have yet to get a confirmation from you guys. ", "rating": 3}, {"title": "The check out was difficult", "text": "The check out was difficult, it kept bouncing me from one place to another.", "rating": 3}, {"title": "I like your dresses", "text": "I like your dresses, but sometimes your prices are a little too high $10 is more than enough or under $10", "rating": 3}, {"title": "1st time on the site as I shop in the…", "text": "1st time on the site as I shop in the store. Will see how thing go as far as shipping and product it self upon receiveing.", "rating": 3}, {"title": "$200 deserve a bigger discount …", "text": "i should have received a bigger discount on total purchases i spent over $200", "rating": 3}, {"title": "Good search experience but did not have…clothes for everyone", "text": "Good search experience but did not have clothes for everyone", "rating": 3}, {"title": "Better staff and friendlier with more…", "text": "Better staff and friendlier with more assistance instead of having to purchase on line and paying fees for shipping.", "rating": 3}, {"title": "The necklace I wanted was discontinued", "text": "The necklace I wanted became discontinued.  My promo code did not work.", "rating": 3}, {"title": "the shipping cost was so high I felt…", "text": "the shipping cost was so high I felt forced to spend minimum $75 when I only wanted to spend $50", "rating": 3}, {"title": "I like the clothing style but there 4x…", "text": "I like the clothing style but there 4x is like a 2x they need to make there clothes off a true 4x,3x,2x or 1x.", "rating": 3}, {"title": "Not accepting discounts codes", "text": "You did not accept any of my discount codes .  Causing me to go over my budget spending", "rating": 3}, {"title": "There is Need More Variety of styles", "text": "There is not a variety of styles that are other tan bodycon style", "rating": 3}, {"title": "Stop click bait", "text": "Remove all items that are sold out, it's a waste of this customers time.", "rating": 3}, {"title": "It’s ANNOYING that I can’t use my gift…", "text": "It’s ANNOYING that I can’t use my gift card on your app or website. It’s 2023 get with the times already!", "rating": 3}, {"title": "I had unsubscribed from your site", "text": "I had unsubscribed from your site; but emails continue to come.", "rating": 3}, {"title": "The shipping charge", "text": "The shipping charge. The total amount is high for the customer to get free shipping. ", "rating": 3}, {"title": "Didn't receive 10% off order for…", "text": "Didn't receive 10% off order for signing up for email/text.", "rating": 3}, {"title": "I cancelled my order on Monday", "text": "I cancelled my order on Monday, Memorial Day, and received notification on Wednesday that my order shipped.... not acceptable ", "rating": 3}, {"title": "I didn't like that we were not allowed to try on clothing.", "text": "I like the styles and various sizes of clothing, accessories, and shoes.", "rating": 3}, {"title": "Shipping Cost", "text": "The shipping fee is too high and the \"free shipping\" amount is too expensive", "rating": 3}, {"title": "They didn't have my size available", "text": "They didn't have my size available. But I do like the selections and the prices.", "rating": 3}, {"title": "I like the prompt service", "text": "I like the prompt service.  When I received the items some of the items were too small. I even ordered a size up.  So you can't go by their size chart.  Even the shoes! I ordered a size 10 but should have gotten a size 11. The shoe said size 10 but the tag said size 11.  They fit like a 9.5.", "rating": 3}, {"title": "When you advertise everything $5 and…", "text": "When you advertise everything $5 and its not.  False advertisements", "rating": 3}, {"title": "I liked the prices", "text": "I liked the prices. I would like a bigger selection  for women’s shoe size 12", "rating": 3}, {"title": "I like my orders", "text": "I like my orders, but is not every time good, and I don’t like shipping is to high amount", "rating": 3}, {"title": "Love Rainbow online shopping beautiful…", "text": "Love Rainbow online shopping beautiful clothing at a great price..Highly recommend", "rating": 3}, {"title": "4x shirts", "text": "I purchased multiple shirts in 4x size, they fit more like a 2x. Sizes seem to run a little small. Overall, I like the styles. I just wish they were true to size.", "rating": 3}, {"title": "It was very easy to place my order", "text": "It was very easy to place my order, let's see how long it takes to get it delivered😉", "rating": 3}, {"title": "Disappointed", "text": "the picture of the product did not truly represent the item. I returned it.", "rating": 3}, {"title": "Cost", "text": "My order was not that much but the shipping was almost the same price.", "rating": 3}, {"title": "The site crashed couple of times", "text": "The site crashed couple of times. Lost my items that I had placed in my cart. I did figure out how to utilize my wish list so I don’t have to start over. Thank you", "rating": 3}, {"title": "My order is being shipped to the wrong…", "text": "My order is being shipped to the wrong address ", "rating": 3}, {"title": "When I went to check out it said my…", "text": "When I went to check out it said my item was out of stock. It should never allowed me to select it.", "rating": 3}, {"title": "I sing in but never received the 10%…", "text": "I sing in but never received the 10% Off of my first purchase.", "rating": 3}, {"title": "Love your products", "text": "Love your products, shipping options are drastic, only free at 75 bucks.", "rating": 3}, {"title": "Worn Dirty Clothes", "text": "I ordered about 20 items. 2 of the items that I received were untagged, used, and one was even dirty!!! ", "rating": 3}, {"title": "mirrors", "text": "Where are the \"Full Length Mirrors \" in the huge store. It's enough that you can't try on anything.", "rating": 3}, {"title": "Limited options", "text": "The boots I wanted were out of stock and this is one of the only shops that has my size 10 big feet", "rating": 3}, {"title": "I love product but only was displeased…", "text": "I love product but only was displeased with not able to use my discount.", "rating": 3}, {"title": "In My Opinion, I say this...", "text": "I liked the clothes and the sale factor!  I spent too much time reentering on the on line shopping!-", "rating": 3}, {"title": "Items should not be shown if sold out", "text": "Items should not be shown if sold out. It’s a waste of my time to click on an item, click the size and it’s not available.", "rating": 3}, {"title": "The site had some styles that wasn’t in…", "text": "The site had some styles that wasn’t in the size I wanted but the size I wanted I saw in the store", "rating": 3}, {"title": "Easy checkout", "text": "You charge too much for shipping and you don’t tell us that upfront", "rating": 3}, {"title": "I just got email around 8.00.PM that…", "text": "I just got email around 8.00.PM that you all have 10 percent, after I order today at 3.42 PM.This is madness", "rating": 3}, {"title": "Big Foot", "text": "I had trouble finding a lot of shoes in my size. A size 11.Need to have more shoes in the big sizes like 11or 12 Thanks", "rating": 3}, {"title": "I always shop here for summer in Caribbean", "text": "I love the style. I was waiting for some more new kids style for this year   some of the stuff I bought it get some last year", "rating": 3}, {"title": "I need to  change  address  it lete", "text": "I got my order  yet trying to  change  it would let me hi", "rating": 3}, {"title": "Not In My Size", "text": "The dresses that I truly wanted to order were not in my size or out of stock.", "rating": 3}, {"title": "Most of the stuff I liked was out of…", "text": "Most of the stuff I liked was out of stock and that's why I gave y'all a Three Stars", "rating": 3}, {"title": "Minimum purchase for free shipping too…", "text": "Minimum purchase for free shipping too high", "rating": 3}, {"title": "The prices were much too high", "text": "The prices were much too high, and there needs to be more variety of plus size jeans and tops. Thank you.", "rating": 3}, {"title": "I had to keep putting the same info in…", "text": "I had to keep putting the same info in before it would take.", "rating": 3}, {"title": "Payment page kept redirecting and I was…", "text": "Payment page kept redirecting and I was almost delete my order", "rating": 3}, {"title": "The clothes need to be changed on the…", "text": "The clothes need to be changed on the site with new selections", "rating": 3}, {"title": "It was slow & navigation could be…", "text": "It was slow & navigation could be better.", "rating": 3}, {"title": "The plus size clothing needs more…", "text": "The plus size clothing needs more option and stretch", "rating": 3}, {"title": "Lower the shipping minimum and allow…", "text": "Lower the shipping minimum and allow for customers to leave reviews", "rating": 3}, {"title": "Have to order to many items to get free…", "text": "Have to order to many items to get free shipping.", "rating": 3}, {"title": "Not available", "text": "A lot of sale items were not available. Should be removed from site.", "rating": 3}, {"title": "Missing discount", "text": "I was told that I was going to get a 10% discount. It was was never sent to me", "rating": 3}, {"title": "Really needs an update in style for…", "text": "Really needs an update in style for clothing", "rating": 3}, {"title": "Most of the items from Rainbow some… A Comment", "text": "Most of the items from Rainbow some people would not buy or like.", "rating": 3}, {"title": "Spin the wheel", "text": "I spin the wheel and it  said  I had 15% off but it didn't give it to me", "rating": 3}, {"title": "I don’t like overpriced shipping fees", "text": "Date of experience: August 15, 2023", "rating": 3}, {"title": "once prices are cheaper than in store", "text": "online is cheaper than in store", "rating": 3}, {"title": "U were out of the kind I wanted  so I…", "text": "U were out of the kind I wanted  so I had 2 sub something else.", "rating": 3}, {"title": "I didn't like I couldn't us my 10% off…", "text": "I didn't like I couldn't us my 10% off coupon.", "rating": 3}, {"title": ":/ it's okk", "text": "Clothes are made very cheap and are ruined after one wash. Many items are see-through as well", "rating": 3}, {"title": "Got confused of how to make payment", "text": "Date of experience: June 06, 2023", "rating": 3}, {"title": "Shipping cost", "text": "Shipping cost is to high an I couldn’t use code for 10%", "rating": 3}, {"title": "I did not receive one package.", "text": "Date of experience: March 08, 2023", "rating": 3}, {"title": "Difference in store and online options.", "text": "Date of experience: March 01, 2023", "rating": 3}, {"title": "Like rainbow", "text": "Date of experience: May 14, 2023", "rating": 3}, {"title": "A review should be done after the transaction is complete", "text": "My experience is not complete until I receive the merchandise.", "rating": 3}, {"title": "Wish it cud get here soon than the 8 jun", "text": "Date of experience: June 04, 2024", "rating": 3}, {"title": "Let's see how long shipping takes", "text": "Date of experience: September 28, 2023", "rating": 3}, {"title": "No discount/promotion was given", "text": "No discount/promotion was given,  compared to other online sites.... for first time customers.", "rating": 3}, {"title": "Discount not applied at checkout", "text": "I like your merchandise.  However,  i personally went to three of yours stores in Maryland area. None of them had the size i needed.   I was told to try online.   When  i did, I wss given the option to receive 10% off order for subscription to texts and emails. I did. No code was received.  Tried twice.  Then, i was offered the price of 10 ea on an item if i bought more than one.  I bought 3 and still paid 16.99 for each.  I saw the actual item in the store so I knew I wanted them, so I still purchased the items.  I just wish I could have received the discount as offered.  Overall,  I think I would still purchase from this merchant.  Nice quality items and great clearance sales.", "rating": 3}, {"title": "Why are we rating now?", "text": "I don't know why they are asking me to rate after I only just placed an order. There's nothing to rate based on that. But, I like the low prices. I always wanted gogo boot and the ones on Amazon were at least $50, but I got ones on Rainbow for $34 plus shipping!", "rating": 3}, {"title": "i ORDERED A SIZE 11 SHOE", "text": "i ORDERED A SIZE 11 SHOE, AT CHECK OUT IT WENT TO 10", "rating": 3}, {"title": "Was not able to delete address of card…", "text": "Was not able to delete address of card location!!@", "rating": 3}, {"title": "3x is more like an xl in the things i…", "text": "3x is more like an xl in the things i ordered", "rating": 3}, {"title": "Shipping fees", "text": "I think the shipping should be FREE", "rating": 3}, {"title": "Shipping fee was a little high", "text": "Date of experience: July 03, 2023", "rating": 3}, {"title": "I love rainbow", "text": "Date of experience: March 17, 2023", "rating": 3}, {"title": "Glitches in your website", "text": "Date of experience: April 05, 2023", "rating": 3}, {"title": "Low stock", "text": "Some of the items I wanted were out of stock", "rating": 3}, {"title": "The shipping is too high,", "text": "Date of experience: November 12, 2023", "rating": 3}, {"title": "Easy to order and great price", "text": "Date of experience: August 07, 2023", "rating": 3}, {"title": "Tracking", "text": "My orders tracking number was incorrect.", "rating": 3}, {"title": "It was fine", "text": "It was fine. Easy to find what I wanted etc.", "rating": 3}, {"title": "Not enough up to date clothes or shoes", "text": "Date of experience: March 24, 2023", "rating": 3}, {"title": "Most of the item were sold out 😒", "text": "Date of experience: June 03, 2023", "rating": 3}, {"title": "Large taxes I think is to much", "text": "Date of experience: August 12, 2023", "rating": 3}, {"title": "Size", "text": "Size, are cut very very small", "rating": 3}, {"title": "It took long to ship.", "text": "Date of experience: September 28, 2023", "rating": 3}, {"title": "I didn't like the face that I couldn't…", "text": "I didn't like the face that I couldn't track my order and I didn't see an invoice or got a delivery notice", "rating": 3}, {"title": "As far as ordering and receiving…", "text": "As far as ordering and receiving experience was great. I normally shop in the store. Material was not great, very cheap looking faux leather. Was very disappointed. Leggings too big.", "rating": 3}, {"title": "I had a difficult time logging in and…", "text": "I had a difficult time logging in and then having the purchase sent to a different address. I had to do it multiple times.", "rating": 3}, {"title": "All I did was place an order for wide…", "text": "All I did was place an order for wide calf boots. I didn't have any contact with anyone, so I can't really evaluate my experience. Once I receive my order in a timely manner, I will have more to say..", "rating": 3}, {"title": "I had 7 coupon codes and could not use…", "text": "I had 7 coupon codes and could not use one of them", "rating": 3}, {"title": "A lot of the dresses are too…", "text": "A lot of the dresses are too restrictive even though they say plus size it's not really plus size fashion and it looks like most of the dresses are for plus size with no stomach. There are a few dresses on there that are made for plus size women with a belly and they're cute but a lot of the times they are out of stock also with a lot of the shirts they're short they're not longer shirts", "rating": 3}, {"title": "It Used To Be So Good", "text": "As a teenager, I used to shop A LOT at Rainbow. My mother would give me money every month and I'd stop at Rainbow to buy shoes or clothes. Back then their stuff was cute. Maybe it's because I'm adult and my style has changed a lot, but it's just not the same. Always shop a size UP. Whether it's shirts, shoes, bottoms. I had to make a in store return and could only exchange 2 out of the 3 items I had. In the end, I'm still not completely satisfied with my purchase. Rainbow just isn't it for me anymore.", "rating": 3}, {"title": "There a few items that I wanted but…", "text": "There a few items that I wanted but when I clicked on them they were not available. But the keep showing up on the selections.", "rating": 3}, {"title": "This is my 1st time Shopping on Rainbow", "text": "This is my 1st time Shopping on Rainbow. It was easy to navigate Through the site. I was looking for a plus size leather jacket I found 1 that I really liked. It came Rather quickly Which was great. Put sadly when I tried it on it was too small So I'm going to have to return it. I may give this site another go in the future.", "rating": 3}, {"title": "Didn't know if I could complete my order", "text": "I had a hard time getting to checkout. I had to go back to it later, at which time it worked. I appreciate Rainbow's adorable styles and affordable prices", "rating": 3}, {"title": "Even though I have the app I have to…", "text": "Even though I have the app I have to log in almost every time I click on it. Also the app doesn't allow you to look at your wish list fully.", "rating": 3}, {"title": "seriously getting really frustrated…", "text": "seriously getting really frustrated with your SIZING.  A 3X is more like a 1X and forget about finding more than 5 items in a 4X- even though you advertise you have 4X.  EVERYTHING is considerably smaller and thinner in material- and I have been buying from rainbow for almost two decades.  Finally, rainbow naturally assumes that if you are a 3X, you must be 5'11\".  Clearly, not every fat woman is nearly 6 feet tall.  Im considering ending my years long relationship with you.  It's also interesting that there is NO FITTING ROOM in the physical store.  But there is clothes for children- and who cares?  STOP trying to be everything to everyone- and stick to doing a few things well.", "rating": 3}, {"title": "Have haven’t received an order as of yet not received the merchandise that…", "text": "Have not received the merchandise that I ordered and haven’t received a confirmation", "rating": 3}, {"title": "quality was so so", "text": "quality was so sosize was accuratedelivery was prompt", "rating": 3}, {"title": "Shipping costs are ridiculous", "text": "Date of experience: January 08, 2023", "rating": 3}, {"title": "They charged me twice", "text": "Date of experience: January 07, 2023", "rating": 3}, {"title": "I did not receive any coupon for my…", "text": "I did not receive any coupon for my first purchase", "rating": 3}, {"title": "I dislike that I haven't received…", "text": "I dislike that I haven't received anything from my order and it's been 3-7 days I suppose to received it yesterday but hopefully today I hear back from someone in my email", "rating": 3}, {"title": "Summer clothes should of been on…", "text": "Summer clothes should of been on clearance prices same all year", "rating": 3}, {"title": "Took a long time and received no emails…", "text": "Took a long time and received no emails back from me emailing questions.", "rating": 3}, {"title": "Love rainbow. Site is meh", "text": "The filter options only kind of work, and for free shipping you need to spend75?!?!? That’s too much. I’d rather shop at a place with free shipping.", "rating": 3}, {"title": "Already signed up for an account but…", "text": "Already signed up for an account but wouldn’t let me sign in or make a new one. So stupid", "rating": 3}, {"title": "My iti don't know em is not here", "text": "My item is not here", "rating": 3}, {"title": "Not enough vibrant styles to choose from", "text": "Date of experience: December 23, 2022", "rating": 3}, {"title": "Disappointed", "text": "The quality and size of my items did not meet my needs.", "rating": 3}, {"title": "Your site kept bleeding on and off", "text": "Your site kept bleeding on and off.  It wouldn't give me the option to use PayPal.", "rating": 3}, {"title": "I had a 10% discount code I never used…", "text": "I had a 10% discount code I never used and it was rejected and very frustrating.", "rating": 3}, {"title": "Rainbow website & Shopify app is always…", "text": "Rainbow website & Shopify app is always glitching for some reason. It feels like somethings is always up with rainbow. They clothes are nice and that's what keeps me coming.", "rating": 3}, {"title": "I didn’t like the idea that the…", "text": "I didn’t like the idea that the shipping fee was so high but I understand postage", "rating": 3}, {"title": "30%.", "text": "I don't know if this is a goodwill company but it seems I always get things that were already worn before I keep tracking back to see if the same results happen and it does I ordered one more order and if it's the same I will no longer purchase anything from here again the shipping take forever and your paying for shipping which is 7.95 I will not pay for 100$ worth of things from this site I maybe got one good shirt from here all the graphics Tshirt kinda suck and the ones I do like have a face on them it's very weird I'm sorry I were so blunt but I thought you should know I can go on but it's to much writing", "rating": 3}, {"title": "I ordered items on the 30th of last…", "text": "I ordered items on the 30th of last month, ayer I completed my oder, I was informed I get premium shipping. I received an email stating my order would be delivered Sat. The 3 re. On Sat. The 3rd I received another email from fedx informing me my order would be delivered on the 5th of December. My problem is that if I purchased a certain money amount my order would be premium, so the only one that got a good deal was you, my delivery is standard delivery according to fedx,You don't need to state your going to do something and then don't. I would have ordered the same things anyway, the only person that benefited was you. Just be honest in your business dealings. Thank you Monica Allen", "rating": 3}, {"title": "Ordering was very easy", "text": "Ordering was very easy. As for the items purchased, there were 2 leisure outfits that were purchased separately that when worn the bottoms don’t stay up.As for the 2 piece leisure jogging fit that comes in black with green and black with purple accents, they fit great! They compress the body and fit snuggly! 10/10.", "rating": 3}, {"title": "For certain items to be restricted…", "text": "For certain items to be restricted because of a state is truly ridiculous. Clothes are clothes why are certain styles restricted? It makes zero sense!", "rating": 3}, {"title": "False advertisement", "text": "I was sent a text message with a 10% discount code but was inactive when I tried to use it. Ckmeax was the code. Was disappointed but I took the time to load the cart and my kids needed so I went ahead with the purchase", "rating": 3}, {"title": "Website wasn't user friendly", "text": "Website wasn't user friendly. Unable to login to my account to track order history. Thus, I only ordered 1 item as a guest basically because I was frustrated that I couldn't access \"My account\" locked out. and other options after multiple attempts", "rating": 3}, {"title": "The shipping cost is high", "text": "The shipping cost is high! In store pick up option would be great. With  no extra cost", "rating": 3}, {"title": "There are not too many clothes in style…", "text": "There are not too many clothes in style you might see on other sites. Too much grandma style and ugly patterns for plus sized tops. Not like 2019 Rainbow at all… The prices and shipping has increased too much as well.", "rating": 3}, {"title": "The shipping is to expensive", "text": "The shipping is to expensive. The amount of money for shipping it's like your purchasing an outfit!!!", "rating": 3}, {"title": "I dislike the fact you didn’t have all…", "text": "I dislike the fact you didn’t have all my daughter sizes in the underwear for girls and some clothing", "rating": 3}, {"title": "Provocative", "text": "I'm older and my daughters go to church often so I feel the clothes are to provocative. However I do find some clothing to be acceptable. Everything so short or cropped", "rating": 3}, {"title": "There are no coupons", "text": "Date of experience: November 24, 2022", "rating": 3}, {"title": "It was hard shopping", "text": "It was hard shopping. When I clicked on certain items the page would start to glitch.  I had items saved in my my wish list and it only showed me one item, but it was saved 10 times. It did not show the other items I has saved.", "rating": 3}, {"title": "I wish there was more in her size", "text": "I love the selection, yet most of what I wanted was either out of stock or not available in her size.", "rating": 3}, {"title": "Coupons and inability to access them at Checkout", "text": "I dislike the fact that I was unable to access the 10% coupon that I qualified for when I signed up during making my purchases.", "rating": 3}, {"title": "Easy and Convenient Shopping", "text": "Date of experience: November 21, 2022", "rating": 3}, {"title": "rainbow needs a rewards program or a…", "text": "rainbow needs a rewards program or a rainbow card!", "rating": 3}, {"title": "always out of stock and confirmation slow", "text": "Styles and sizes are slim. The jeans are great! They fit well and everything but the size I need in the style I liked most was out of stock. I ordered a different style so hoping I like it as much. Sadly I ordered a wrong size by mistake and wasn’t given the option to cancel my order to correct it because I received the email confirmation well after their 15min window (like over an hour after). I emailed hoping they can just fix the size since it doesn’t change the price but who knows. :(", "rating": 3}, {"title": "I wasn’t able to use my discount upon…", "text": "I wasn’t able to use my discount upon ordering.", "rating": 3}, {"title": "I like that she tried to accommodate me…", "text": "I like that she tried to accommodate me as much as she could and very apologic about me not able to use my gift card which cause a great inconvenience.", "rating": 3}, {"title": "Good but need improvement", "text": "I think your shipping process is fine. But I think it should be waived sometime if the customer is regular.", "rating": 3}, {"title": "Unable to sign into my account", "text": "Date of experience: November 18, 2022", "rating": 3}, {"title": "Missing one pair of jeans I ordered 6 pairs got 5", "text": "I only received 5 out of the 6 pairs of jeans I ordered  missing 1 the black with paint on it only got 2 the blue all 3 pairs was there", "rating": 3}, {"title": "Good clothes for less", "text": "Clothes are decent for a good price. I have has some stuff in the past color fade after two washes and also had some clothes I've purchased stitch or seam were busted when I looked at the clothes before even wearing", "rating": 3}, {"title": "Wrong item", "text": "If the item I oder is finish I should have been notified..and am seeing something  I don't like..", "rating": 3}, {"title": "Some of the items in my cart sold out…", "text": "Some of the items in my cart sold out by the time I went to purchase and I didn't realize until I was almost through my transaction. I would have bought something else in place of.", "rating": 3}, {"title": "Was out of a lot of the size for…", "text": "Was out of a lot of the size for certain items I was interested in", "rating": 3}, {"title": "WRONG Color!!", "text": "I order BLACK panties  and received Cocoa panties, not black. Not happy for our color choice!!If I had wanted Cocoa, I would have ordered Cocoa.However, I needed them, so kept them.  Please when unable to fulfill an order send an emil, don't just substitute at you will.", "rating": 3}, {"title": "Things I wants were not in my size", "text": "Things I wants were not in my size.  Need to add more online I believe in store shipping is better but nonetheless the price is always good.", "rating": 3}, {"title": "I can bearly log into my account", "text": "I can bearly log into my account.  Plus before you had free shipping on Sundays which is when most of your customers did shopping.", "rating": 3}, {"title": "Did not have the jeans I wanted in…", "text": "Did not have the jeans I wanted in larger sizes 11 or 13; repetitive pictures of the same item", "rating": 3}, {"title": "They didn't have the leggings I wanted", "text": "They didn't have the leggings I wanted, and they gave me what they wanted me to have.  I didn't want that color.", "rating": 3}, {"title": "Thanks for the first item that was…", "text": "Thanks for the first item that was given to me, and that was for my church event. I am so worried about. I don’t know why.", "rating": 3}, {"title": "I love the prices as well as the…", "text": "I love the prices as well as the variety of clothing. I have shopped with them in person when i was visiting out of state and loved it. I feel like the clothing sizes are not true to size. Unfortunately some of the products i ordered online came in damaged. There were holes in a couple of products.", "rating": 3}, {"title": "Need better discount codes", "text": "Need better discount codes ! 30% off would be nice .", "rating": 3}, {"title": "Honestly", "text": "Honestly, I love the styles. However, I'm overwhelmed with all the changes Rainbowshop.com has made. From my perspective, it was easier before to navigate through the website. Now, it's not as easy.  Also, you had many beautiful dresses in the past and now most of the dresses are so skimpy. Furthermore, how many items do you put on clearance? In the past, I was constantly buying because of clearance sales.  Now, when I look and like an item it's out of stock or my size is unavailable. This disappoints me because it happens constantly, and as you will see I'm not buying as often as I did. How many items do you actually put on sale? As a customer I know the quantity isn't a lot because as stated before it's out of stock or not my size.", "rating": 3}, {"title": "Site was very slow", "text": "Site was very slow, took long time to load pages and an even longer to checkout.Other than that great deals as always I love rainbow. Just have to fix the site.", "rating": 3}, {"title": "Rainbow seems to be getting better…", "text": "Rainbow seems to be getting better without crushing the average buyer's budget and it's really appreciated!", "rating": 3}, {"title": "I like shopping online because I find nice clothes that are not instore…", "text": "I like shopping online because I find more clothes my size that are not in-store.  I don't like that I was given 10% off which was $12 taken off, but $9 in taxes were added back on.", "rating": 3}, {"title": "I give them 3 stars because I had…", "text": "I give them 3 stars because I had selected several Jean and at the time of payment there is no size.  I have been trying to buy them for several months and there is no size. Pd. but I still buy from them because I love Rainbows one of my best stores", "rating": 3}, {"title": "Have not recieved my order don't know a…", "text": "Have not recieved my order don't know a delivery date either", "rating": 3}, {"title": "Nothing everything went smooth", "text": "Date of experience: October 29, 2022", "rating": 3}, {"title": "I ordered a really cool sweatshirt for…", "text": "I ordered a really cool sweatshirt for my son to wear on picture day. It arrived on time as usual and the rest of my purchases were all there but the sweatshirt was an issue for me because it was in an open package balled up inside of it.I wish I could post the pictures of it. It literally disgusted me because it was clearly a returned item and wasn't checked over before sending back out. I washed the shirt and my son was able to wear it. But I've been shopping with Rainbows for years and this is a first time experience for me. They're usually very on point.", "rating": 3}, {"title": "You promise a 10% discount code and…", "text": "You promise a 10% discount code and when I put the code in, it didn’t work.", "rating": 3}, {"title": "You are not doing what you said you will do.", "text": "Did not work for me.", "rating": 3}, {"title": "The experience is good but you guys…", "text": "The experience is good but you guys shipping fee is way too much.", "rating": 3}, {"title": "No tracking or receipt no idea when…", "text": "Found my order information can't wait to receive my daughter outfits easy shopping experience", "rating": 3}, {"title": "NOT ALOT SIZE XL IN WHAT I WANTED", "text": "Date of experience: October 16, 2022", "rating": 3}, {"title": "I was supposed to get 10% off and after…", "text": "I was supposed to get 10% off and after I logged in and even had my number set up it wouldn’t allow me to stay signed in or enter a coupon code so I ended up paying full price.", "rating": 3}, {"title": "Site running slow", "text": "When I first went on the site it was running very slow and a few items that I did wanna check out and see them when I clicked on them it said there was an error and that page couldn't be found then it wouldn't let me exit. I kept on clicking on the go back but it did nothing. Other than that it was okay", "rating": 3}, {"title": "You are advertising stuff for sale that…", "text": "You are advertising stuff for sale that are not available and it's annoying and time consuming to say the least also very disappointing when it's something I want to buy.", "rating": 3}, {"title": "Love everything I purchased....The…", "text": "Love everything I purchased....The problem I have is with your shipping methods...It was LATE ...I thought FEDEX was delivering the purchase and it ended up coming thur the post office....I had no idea where the items were..... Shipping method was the worst.. A  PLUS SIZE PETIET category  would also be a GREAT add on to the site.....", "rating": 3}, {"title": "No discounts codes", "text": "No discount codes … barely any size 14 pants . Hopefully the 2-5 day shipping only take 2-3 because the 2day shipping is overpriced.", "rating": 3}, {"title": "okay", "text": "ok nothing special", "rating": 3}, {"title": "MorePLUS SIZEE", "text": "They have good selections but not enough PLUS SIZE!", "rating": 3}, {"title": "I was sent 2 of an item i only ordered…", "text": "I was sent 2 of an item i only ordered 1 of. Its a set. My first😤 experience in 2 yrs of online ordering!", "rating": 3}, {"title": "Shipping should be free on spending $30.", "text": "Date of experience: October 07, 2022", "rating": 3}, {"title": "Ripped jeans overkill", "text": "I just wish they had a better variety of pants that weren't all ripped jeans 😫", "rating": 3}, {"title": "The plus size items need more stretch.", "text": "Date of experience: September 23, 2022", "rating": 3}, {"title": "The color scheme does not match the…", "text": "The color scheme does not match the actual material. Also, not enough pink boots.", "rating": 3}, {"title": "Uniforms", "text": "I’m happy to find my girls uniforms for pants but the checkout page was taking longer than wanted but overall I’m glad I finally got purchase.", "rating": 3}, {"title": "I just had a little trouble with…", "text": "I just had a little trouble with checking out. I did not what them to have  my bank information", "rating": 3}, {"title": "Too high", "text": "Too high ! A few nice items only thing is the tax and shipping put the price really high (which I understand). The sections for plus size women is ok but is not the best. If the items were better it would definitely be worth the price. Thank you", "rating": 3}, {"title": "Easy to navigate", "text": "Easy to navigateEasy to shopShipping fees hidden til the end- NG", "rating": 3}, {"title": "Some what satisfy", "text": "Over all I’m somewhat ok with my boot purchases. However, they were somewhat pricey, but I do like them. Next time, please take in consideration that people who are value customers should be discounted who make purchases online. Thank you 😊", "rating": 3}, {"title": "FedEx is the worst delivery service", "text": "FedEx is the worst delivery service. I have placed orders over the past year and have moved to a new location. It doesn't matter where you live service is terrible. They throw packages anywhere in the bushes flower beds in the middle of the driveway and always late", "rating": 3}, {"title": "Need ship to store option!!!", "text": "I would have given a 5 star if it had ship to store!!!!!!", "rating": 3}, {"title": "The abilities figure out how did the $ale fit in and I'm still trying to figure it out how did I get 70% off my order", "text": "The ability to figure out what cell was going on and trying to figure out where does it say that was very very complex also the fact that you have to close out sometimes because it takes a lot of time to shop just like you're in the store when you're online and if you close out it doesn't have nothing where you can like go back to where you started off at I had to continually start over from scratch and there was nothing easy about it this is coming from someone who's not a computer savvy like that very little experience so I think it was a little less complicated and a little bit more clear I'm sorry I was supposed to get 70% off my my purchase and I never did and I still feel like that and I'm kind of upset about that so I would like someone to contact me about that I'll via email or by phone 860-503-22-37 and I still have not received the quality and the clothing yet so that's the really big part I'm looking forward to thank you have a good day thank you for wasting time and keeping time and thank you for wanting to know time about your customer because a lot of people don't think customer service is worth anything customer service is everything.", "rating": 3}, {"title": "Too high to get free shipping", "text": "Date of experience: September 16, 2022", "rating": 3}, {"title": "1st time ordering", "text": "Date of experience: September 15, 2022", "rating": 3}, {"title": "Shipping needs to do better", "text": "I love Rainbow, however I am unable to ship my order to Sandiego. I have to ship it to Vegas and have a family member ship to me. I think it is ridiculous to have a online shopping experience that you can't ship everywhere.", "rating": 3}, {"title": "My order", "text": "I'm OK with the selection I only have a problem with the shipping the price has went up", "rating": 3}, {"title": "I love my items but I feel after a…", "text": "I love my items but I feel after a certain amount shipping needs to be free", "rating": 3}, {"title": "First time user Having to spend $75 for free shipping…", "text": "Having to spend $75 for free shipping should be shown upon browsing and free ship to the store options it could be more appreciated for first time user. Thank you. Also, there’s not a lot of trendy clothes.", "rating": 3}, {"title": "I like how rainbow has a lot affordable options…", "text": "I like how rainbow has a lot different affordable fashions for my toddler but the shipping price is horrible! I have to spend too much to get free shipping… the discounts are always a plus and the variety could be a little better", "rating": 3}, {"title": "I enjoyed shopping just wished all the…", "text": "I enjoyed shopping just wished all the sets were right next to each other or in the same link and there was a lot of refreshing I had to do to make sure I looked at everything I wanted", "rating": 3}, {"title": "Not enough Plus Size inventory.", "text": "Date of experience: September 06, 2022", "rating": 3}, {"title": "A little upset some sizes were not…", "text": "A little upset some sizes were not available", "rating": 3}, {"title": "Ordered several times from here", "text": "I had things in my cart but kept getting sold out before I could look at other clothing. I have ordered from you several times and absolutely loved the Feathers brand leggings.  Wish I knew what other leggings were the same brand so I could purchase them.", "rating": 3}, {"title": "The site I think needs to be updated", "text": "The site I think needs to be updated. When scrolling thru I had to click on the item then add to my favs. It was kinda annoying because when I go back to look for more products sometimes the page would be scrolled to the bottom. This made me lose my place a lot. Also after clicking and item and going back I would have to take off any custom search options to see any products. Then I would need to reapply filters each time. The wishlist is also having problems. I was first using my computer to add everything online but when I wanted to continue by using the app on my phone, none of my saved wishlist items were there. Even after signing in again to see a difference. One last thing is on the wishlist it’s hard to see everything because it’s lined up in a row and this makes it difficult to decide what to get. I wish there were like rows of 3 so it would be easier to get to things. And also the wishlist should be organizable or filter able so things can be grouped together and make it easier to decide.  My favorite thing on the site is easy access and simple look of the guide to certain pages. I also like the red labeling on things on sale.  Though simplistic the webpage seems kind of boring for a place called rainbow. Some nice color schemes or unique effects can make the site seem more memorable. I would also give customers the option to select more than one size because sizes may vary depending on the product. Such as slides not being available in half sizes sometimes.  Thank you for your time and for asking for my customer experience.P.S I love making online sites :)", "rating": 3}, {"title": "Pickup from store for free", "text": "Finding what I want and checking out was fine but, I would have like to have seen an option to where I can pick up from the store for free and save me some shipping cost.", "rating": 3}, {"title": "One of my outfits was the wrong color", "text": "Date of experience: August 23, 2022", "rating": 3}, {"title": "I've always shop at rainbow but they…", "text": "I've always shop at rainbow but they don't have decent clothes to wear , I just bought a pair of shoes I hope they come in time.", "rating": 3}, {"title": "I had difficulty picking the sizes and…", "text": "I had difficulty picking the sizes and it was a hassle getting bk to the shop", "rating": 3}, {"title": "The quality", "text": "The quality of the fabric is not the best, but for the price is not bad.", "rating": 3}, {"title": "Variety", "text": "Not a large selection for uniforms as expected.", "rating": 3}, {"title": "I'm not able to go back on the site and…", "text": "I'm not able to go back on the site and view my order to know when I'm going to reveal it", "rating": 3}, {"title": "Limited plus size options and no plus…", "text": "Limited plus size options and no plus size shoes.", "rating": 3}, {"title": "Sizes out of stock", "text": "There are nice options but a lot of sizes that are being advertised are unavailable or out of stock.", "rating": 3}, {"title": "Trendy but modest", "text": "You have good prices..I am in my 40s and a lot of your styles are geared toward younger people..very short shorts..tight tops..revealing..older people want to look edgy and trendy too..with a little modesty please..thank you😁✌️", "rating": 3}, {"title": "Fast delivery but I'm disappointed...", "text": "Fast delivery but I'm disappointed because the sneakers I but where low quality but are cute. Overall I enjoyed my products.", "rating": 3}, {"title": "Rainbow is affordable but the items I…", "text": "Rainbow is affordable but the items I prefer they run out my size and don't restock often. If they would I would most definitely give 5 stars.", "rating": 3}, {"title": "Website is great", "text": "Website is great, but you just don’t have a lot in the size I need 4X.", "rating": 3}, {"title": "It took to long to get the order to go 10Minutes…", "text": "It took to long to get the order to go  Through", "rating": 3}, {"title": "I did not get the code via text for my…", "text": "I did not get the code via text for my 10% off.I requested it 2x but never received it.However, I only received a text confirming my order was placed after and of course without the 10% off", "rating": 3}, {"title": "I was supposed to get 10% off my order bc I created an account never got a code and didn’t get it when I checked out.", "text": "I was supposed to get 10% off my order because I created and account", "rating": 3}, {"title": "Wish there were more selections on…", "text": "Wish there were more selections on uniforms", "rating": 3}, {"title": "I had problems trying to pay for my…", "text": "I had problems trying to pay for my order.  I made 4 attempts before it finally went through.  I was about to give up on my final try then it went through.", "rating": 3}, {"title": "It’s ok but no useful promo codes", "text": "Date of experience: August 04, 2022", "rating": 3}, {"title": "Navigation of the site could be more…", "text": "Navigation of the site could be more user friendly by allowing more filter selection options at once. Found it frustrating to browse and go back and forth while selecting my items due purchase.  Hopeful everything is as pictured and sized as indicated.", "rating": 3}, {"title": "could not redeem 10% off", "text": "could not redeem 10% offNever ordered online, said I was already registered but gave no code to use.", "rating": 3}, {"title": "Was a pleasure to shop at a bargain…", "text": "Was a pleasure to shop at a bargain price.. thank you rainbow for these cute pieces", "rating": 3}, {"title": "Plus size women apparel", "text": "Greetings all, As I thumbed thru the pictures of the items offered, I wish they could be shown in a better way catogory. Listed just such as: blouses or slacks or dresses.  It would save much time. Otherwise, you have great selections ! Thank you to all your staff. Best regards, a happy customer.", "rating": 3}, {"title": "Just wish there where more options for…", "text": "Just wish there where more options for boys clothing", "rating": 3}, {"title": "Strings swimsuit", "text": "The top ran small I don't think it was a true to size. Overall I like the swimsuit", "rating": 3}, {"title": "Good but not enough good!", "text": "Your selection is ok but overall too many choices are not available in my size.  Darn!", "rating": 3}, {"title": "Need more Variety", "text": "There isn't many options for me and I wasn't able to create an account.", "rating": 3}, {"title": "Bare minimum", "text": "Should have been more clothing to shop for.", "rating": 3}, {"title": "Your website was difficult to use", "text": "Your website was difficult to use. It took four times to complete purchase and then the total items was incorrect. I was missing one tee shirt. If I tried to reorder it, I would have had to pay another shipping fee.I will Never shop online with your store again!!!’", "rating": 3}, {"title": "There very nice but I thought that they…", "text": "There very nice but I thought that they were cotton not like that stretchy material 🤷‍♀️", "rating": 3}, {"title": "First time buyer", "text": "Date of experience: July 12, 2022", "rating": 3}, {"title": "Shipping was bad", "text": "Shipping is bad. Ordered on 7/1 its not 7/6 and still no items. The tracking was wrong and stated would be delivered one day. Checked again and it's not even in NY. First time ordering and might be the last. At least be accurate. Then you all reply to me and say use expedited shipping which costs but still didn't get my items to me in the allotted time YOU STATED. How does that help me???", "rating": 3}, {"title": "Your website was working at the time…", "text": "Your website was working at the time before I made my first purchase", "rating": 3}, {"title": "I gave you 3 stars because I've always…", "text": "I gave you 3 stars because I've always shopped at Rainbow's since I lived in Brooklyn, NY as a child. Now that I live in North Augusta, I try to patronize the Rainbow here but it gets frustrating, trying on clothes, over my own clothes, in the mirror, at the front of the store. When will the dressing rooms be available?", "rating": 3}, {"title": "I can’t save things to my wish list", "text": "I can’t save things to my wish list. I didn’t get to use my 10% off from the spin wheel when I started my account.", "rating": 3}, {"title": "I have received merchandise that was…", "text": "I have received merchandise that was torn and also had a hole in it. Please do better. You have beautiful clothes but it shouldn't arrive damaged.", "rating": 3}, {"title": "should have a store pick up option.", "text": "should have a store pick up option.I wanted one thing for $12, and had to pay $7.95 shipping.I'd rather do store pick up, I know my store didn't have that color/size.Even the online coupons only took off a little over $1 off.", "rating": 3}, {"title": "I had alot of trouble scrolling kept…", "text": "I had alot of trouble scrolling kept jumping back to the top", "rating": 3}, {"title": "shopping", "text": "it was average.", "rating": 3}, {"title": "Great selections, shipping methods needs improvement!", "text": "I do enjoy buying from rainbow stores online because the local stores don’t have most of the items found online, which makes it convenient. However, it takes about a month to receive my order every time.  Improvement on the shipping methods are necessary.", "rating": 3}, {"title": "Offer free shipping!!", "text": "Date of experience: June 26, 2022", "rating": 3}, {"title": "I'm lock of my account bc rainbow said…", "text": "I'm lock of my account bc rainbow said I had to create a new account since my old 1 was after a date. It will not allow me to create a new one", "rating": 3}, {"title": "Just plased the order have to receive…", "text": "Just plased the order have to receive and review the  quality of the  merchandise.  The prices  are great. But need to get the  clothing and sandals  to review.    MM", "rating": 3}, {"title": "Almost", "text": "I gave three stars because didn’t have more in my size, The clothes I liked and wanted to purchase was out of my size.", "rating": 3}, {"title": "I.had some issues trying to make a…", "text": "I.had some issues trying to make a purchase", "rating": 3}, {"title": "Website is easy to use however the…", "text": "Website is easy to use however the shipping rates are high if I didn't like the dress so much I wouldn't have purchased   because the shipping was almost half of the price of the dress", "rating": 3}, {"title": "Cute stuff", "text": "You have cute , affordable things. While I was trying to adjust my cart, it wouldn't let me take some things off. Then when it would, and I went to pay, the item I took off was on there again. It finally let me take it off and proceed with my purchase. I almost gave up.", "rating": 3}, {"title": "Thank you for the perfume", "text": "Date of experience: June 15, 2022", "rating": 3}, {"title": "Well one two outfit has the wrong color…", "text": "Well one two outfit has the wrong color and the shorts are the wrong size so I'm going to exchange in Ohio at the rainbow store here so it's unfortunate.", "rating": 3}, {"title": "Most of items I pick were sold out", "text": "Date of experience: June 12, 2022", "rating": 3}, {"title": "I’ve ordered from rainbow online…", "text": "I’ve ordered from rainbow online multiple times and had no problem. I just order this last time and never received my order and fed ex and rainbow wasn’t any help on me getting my products or refund.", "rating": 3}, {"title": "My experience shopping on the app was…", "text": "My experience shopping on the app was fine, my only complaint was alot of my 1st choices were out of stock", "rating": 3}, {"title": "I love Rainbow and the website was easy to navigate", "text": "I love Rainbow and the website was super easy to navigate. I gave 3 stars because I kept getting a message that they couldn’t deliver to my address. I tried my mom’s address same thing. So I had to get it delivered 4hrs away to my brother’s house which is really annoying. Other than that I love this store!", "rating": 3}, {"title": "Good", "text": "Good customer service and excellent care, Thank You", "rating": 3}, {"title": "You don’t deliver to my address but do…", "text": "You don’t deliver to my address but do deliver to an address 1/2 mile away.", "rating": 3}, {"title": "Ughh 🙄", "text": "Canceled part of my order and didn’t refund me my money….", "rating": 3}, {"title": "Coupon’s", "text": "Need more options for coupons", "rating": 3}, {"title": "Always been shopping at Rainbows since…", "text": "Always been shopping at Rainbows since young now I’m in my late 40s and still rocking your style but never my sizes when Im searching. Need more X-Large and 1X but everything else I can’t complain. Love all the styles for a woman my age.                                                             U Rock😃", "rating": 3}, {"title": "The site would not accept any coupon…", "text": "The site would not accept any coupon codes.  I was disappointed.", "rating": 3}, {"title": "i can't create an account", "text": "i can't create an account Every time I sign up i never get the confirmation email i try to log in and no account and been created. everything I go to a new window my cart keeps getting empty. website is not great at all.", "rating": 3}, {"title": "Just ordered so can’t give a fair…", "text": "Just ordered so can’t give a fair review at this time. I will update when my item arrives", "rating": 3}, {"title": "Shipping is too high!!", "text": "Date of experience: June 01, 2022", "rating": 3}, {"title": "I gave you 3 star because ordering was…", "text": "I gave you 3 star because ordering was simple, but Now I need to see how fast is your delivery, thank you.", "rating": 3}, {"title": "They have a cute shoe selection", "text": "They have a cute shoe selection, I found 5 pairs!  However, the clothes are not my style. They were either too casual or too revealing for a day out and about. I was able to find my 1yr old granddaughter some really cute summer clothes! ** I may be a grandma but best believe I still got it! You don't need to be almost naked to be sexy, just sayin.. ;)", "rating": 3}, {"title": "In general you have cools things", "text": "You could add more “classy” styles .In general you have cools things which I enjoy, but they could be more refined, at least some of them. Thanks !", "rating": 3}, {"title": "Some items are not true to size", "text": "Date of experience: May 24, 2022", "rating": 3}, {"title": "This is my first order", "text": "This is my first order, so once I receive the items, maybe I will provide a better review. It's difficult to review what hasn't been delivered or viewed.", "rating": 3}, {"title": "The shipping cost is too high.", "text": "Date of experience: May 23, 2022", "rating": 3}, {"title": "Discount code provided doesn’t work…", "text": "Discount code provided doesn’t work online. Website could be updated and better filtered options.", "rating": 3}, {"title": "Paid for 1 day ship on Thursday", "text": "Paid for 1 day ship on Thursday, received my order on Monday..Was expecting on Saturday. Then wanted to place another order can no longer use 10% coupon.", "rating": 3}, {"title": "The shipping cost is expensive every…", "text": "The shipping cost is expensive every little bit helps. The store should offer customers the opportunity to pick up order at the nearest Rainbow store. This option (ship to store) is very cost effective for customers because it is free!!", "rating": 3}, {"title": "They don’t have enough sizes for plus…", "text": "They don’t have enough sizes for plus size women in certain brands the best styles that they have is not enough in stock  and also they don’t have enough shoe size’s in stock for online sales", "rating": 3}, {"title": "more variety and styles", "text": "There needs to be more variety and styles for women sizes 16W. I need to see sexy underwear size for women.", "rating": 3}, {"title": "Your website does not update the cart", "text": "Your website does not update the cart. I tried to remove items and add items...but it still shows the first cart and price and I couldn't delete it.", "rating": 3}, {"title": "I enjoy shopping some thing didn’t have…", "text": "I enjoy shopping some thing didn’t have but overall have no problems wth Rainbow", "rating": 3}, {"title": "The new layout to shop is terrible maybe…", "text": "Th new layout to shop is terrible maybe I need to switch to desktop or something", "rating": 3}, {"title": "You can't filter by size on your app", "text": "You can't filter by size on your app. It's frustrating to like an item and when you click on it it doesn't have your size", "rating": 3}, {"title": "Spent 53 dolkars and still had to pay…", "text": "Spent 53 dolkars and still had to pay for shipping  not happy with that", "rating": 3}, {"title": "I just would like to use my giftcard", "text": "I just would like to use my giftcard. There is not the somethings online as in the stores.", "rating": 3}, {"title": "Just don't have my size", "text": "Just don't have my size, which is 3x in the jean crop jacket :( More 3x, More 3x :)", "rating": 3}, {"title": "More plus sizes", "text": "I wish Rainbow offered shirt sizes larger than 3x. I'm usually a 2-3x but I find that the sizes run small.", "rating": 3}, {"title": "Need better bag record and viewing", "text": "The checkout process was difficult and viewing the bag.", "rating": 3}, {"title": "I'm confused", "text": "I'm confused! I ordered the color Denim! However after placing the order, I look at my order status it said Multi-color! Denim NOT Multi color!!", "rating": 3}, {"title": "Plus size to small", "text": "The styles and the price are pretty good . Unfortunately the plus sizes are not true to plus size measurements. I'm size 18 I bought 3X and it was way too tight for a shirt.", "rating": 3}, {"title": "Isn't user-friendly", "text": "Isn't user-friendly. I would like for filter options. Especially for the lids clothes. I couldn't narrow down the selection to a specific clothing nor would it accept my size and color filters... both the app and site need work.", "rating": 3}, {"title": "Could use easier way on getting back…", "text": "Could use easier way on getting back and forth between products.", "rating": 3}, {"title": "Just average", "text": "Just average; haven't made any improvements in years. To have to register again after only a year is unnecessary.", "rating": 3}, {"title": "More cotton outfits", "text": "More cotton outfits More collar shirts More day wear blousesAnd need more (Pants) soft material More jeans🛑 ✋🏽 stop sailing cheap 🚫 jeggings ✋🏽Stop🛑 sailing 100% elastin /Spandex clothes✋🏽 I am  34 I would buy my clothes from this store since I was 13 yr old do the math.", "rating": 3}, {"title": "Logging in problems.", "text": "Picking items and putting in cart great. Trying to log in a problem. Will not accept my email. Tried several times just gave up!😩😩😩", "rating": 3}, {"title": "Was so excited that Rainbow shops…", "text": "Was so excited that Rainbow shops carried size 12 shoes but they all ran small. Returning was hassle free though.", "rating": 3}, {"title": "Shopping cart won’t save items…", "text": "Shopping cart won’t save I switched from phone to computer and signed in and no items in cart. Couldn’t find much, wax jeans  stretch out too much and that’s the only brand that’s carried. Two items in my cart on my phone, I couldn’t find once I switched to my computer even by using item number.", "rating": 3}, {"title": "The size chart was not accurate", "text": "The size chart was not accurate. My 4 year old granddaughter currently wears a size 10. I ordered a size 10. They are 2 inches longer than any size 10 shoe. I will return them for a smaller size. But not actually sure if the next size down will be her size.", "rating": 3}, {"title": "Good quality, high shipping rate", "text": "I love the prices and the quality of their shoes and clothes. I do think think that the shipping is a little high and is offputting to making me want to purchase.", "rating": 3}, {"title": "…Remove What’s Not Available", "text": "Lots of choices on the website but items that are no longer available should not be shown as an option to purchase.", "rating": 3}, {"title": "My bag doesn’t save from my app to my…", "text": "My bag doesn’t save from my app to my computer log in I had to re-enter my items 2 different times. Other then that it’s perfect.", "rating": 3}, {"title": "The shipping costs are ridiculous high…", "text": "The shipping costs are ridiculous high and spending a certain amount shipping is free that not true  cause shipping is included we still paying we just don't see it on the order", "rating": 3}, {"title": "Too much for shipping one product", "text": "Date of experience: April 17, 2022", "rating": 3}, {"title": "Nice variety of products", "text": "Nice products variety of products. I feel it’s just hard to fit a shoe online.  Just no way to tell how long you can walk nor comfortable of a shoe.", "rating": 3}, {"title": "There are no customer reviews on the…", "text": "There are no customer reviews on the clothes online. Not enough pictures of the items. Not all items list the size the model is wearing.", "rating": 3}, {"title": "Had login issues", "text": "Date of experience: April 14, 2022", "rating": 3}, {"title": "Didnt have what I was looking for", "text": "Date of experience: April 13, 2022", "rating": 3}, {"title": "There were not many clothes to choose…", "text": "There were not many clothes to choose from that I wanted and in the sizes I needed(14/16 boys, 7/8 & 10/12 girls.)I wanted more graphic shirts/tees in XL/1X but they pretty much were sold out f the ones I really liked.Thank you", "rating": 3}, {"title": "Overall", "text": "Overall, good shopping experience. My main issue is that plus size jeans go out of stock extremely fast. I wish they would order more stock. I mostly need dark wash jeans with no rips and they always run out of them fast.", "rating": 3}, {"title": "Why don't you offer ship to the store…", "text": "Why don't you offer ship to the store to save money on shipping? There are more options online. However, if I could get my items in the store. I would definitely do it, especially since the mall where the store is is only 5 minutes away from me.", "rating": 3}, {"title": "I paid extra for the premium shipping", "text": "I paid extra for the premium shipping, but I could've saved my money. Clothes look cheap", "rating": 3}, {"title": "Shipping and handling is way too much", "text": "The dress I bought was 21 but the shipping and handling was made the dress come up to 32 dollars which is a lot", "rating": 3}, {"title": "Not a wide variety of spring/summer…", "text": "Not a wide variety of spring/summer fashions or sizes in stock. Plus some things were a tad pricey. Wanted more clearance merchandise available.", "rating": 3}, {"title": "Product Pricing/Availability is a Plus. No Customer Rewards is Not", "text": "Overall, I'm satisfied with my experience shopping online with Rainbow Shops. I do have 2 suggestions to improve customer experience. #1. When removing an item from the cart on both mobile & desktop, the images & description of remaining items in cart are not accurately displayed. i.e. the item image doesn't match the item description. This can cause items to be removed from the cart in error. To correct this issue I had to click the Cart icon, which updated the page.#2. This is an important one: Some type of Reward, discount, or other incentive should be offered to customers based upon the amount being spent, frequency of repeat shopping etc. Today, I spent over $500 with \"free shipping\" for my order meeting or exceeding $75. This is not a real incentive anymore due to nationwide shipping delays; even paying for expedited shipping doesn't mean items will be received as estimated. Side note: 2 of my orders were placed prior to 10:00 am est. today; it's now 8:45 pm est. & neither order has even been prepared for shipping. I know staffing is an issue everywhere; with that in mind, if orders placed & paid for prior to noon cannot be prepared for shipping the same day; having to meet a $75 limit to get free standard shipping that's going to take additional processing time prior to even being ready to ship, is not an incentive or reward to your customers. All that said  🤣 I am pleased with product availability in plus sizes & pricing.", "rating": 3}, {"title": "Color is coming off of sandals where my…", "text": "Color is coming off of sandals where my feet are. Poor quality on that aspect.", "rating": 3}, {"title": "Don’t have a review yet…but when my…", "text": "Don’t have a review yet…but when my items arrive I will gladly give you a review.", "rating": 3}, {"title": "I spun the wheel and never received my…", "text": "I spun the wheel and never received my 10%", "rating": 3}, {"title": "Just a bit disappointed", "text": "First off let me say I love rainbow, ordering amazing, shipping amazing, communication amazing…. But I’ve ordered several things in the last month and the first item was missing a button ( no problem) I can put that on …. But this item I got today had a hole…. I can also take care of tht… but if I’m going to continue to spend my money I need you all to do better", "rating": 3}, {"title": "I liked you shoes but when I tried to…", "text": "I liked you shoes but when I tried to apply your coupon they didn't work.  I had a larger order but when the coupon didn't work I decided to get only two items.", "rating": 3}, {"title": "Not enough variety of button front…", "text": "Not enough variety of button front shirts in plus sizes", "rating": 3}, {"title": "Was simple because t haven't received…", "text": "Was simple because t haven't received merchandise yet to fully say of quality and was looking at refund policy it's not very good so I hope it fits correctly and it is of quality.", "rating": 3}, {"title": "Using the site on mobile", "text": "Using the site on mobile, in the cart I can’t  access the lowest item. Just realize it was  quantity of 2 and couldn’t edit.", "rating": 3}, {"title": "I wish you had the item I purchased at…", "text": "I wish you had the item I purchased at store or ship to store for free.", "rating": 3}, {"title": "I was so excited about a pair of white…", "text": "I was so excited about a pair of white sandals to see out of stock. There went my whole Easter outfit", "rating": 3}, {"title": "Need more cute item in size 16", "text": "Date of experience: April 03, 2022", "rating": 3}, {"title": "I love shopping Rainbow but for some…", "text": "I love shopping Rainbow but for some reason i have been having a difficult time viewing all my items in the shopping cart before i check out.  Only 4 items show at a time in the past i have been able to view my entire cart.", "rating": 3}, {"title": "It’s my very first time shopping on…", "text": "It’s my very first time shopping on here and I like what they had for children clothes, So I will rate a 3/1 stars and I will come back on this app to shop …", "rating": 3}, {"title": "$75.00 high for free Shipping", "text": "Date of experience: April 01, 2022", "rating": 3}, {"title": "Dont have size 13/14", "text": "Date of experience: March 31, 2022", "rating": 3}, {"title": "Miss Rainbow…", "text": "I love Rainbow and have shopped there for years. Now that they have closed their dressing rooms, I will not shop there. I tried it for a while but got to be a hassle. Not going to run back and forth from store to my house trying on clothes and bringing them back. I understand for a while during the covid that happening but come on people. I pass by my store all the time and I never see anyone in there. Really wish you would open them up! Really miss shopping there.Thank you", "rating": 3}, {"title": "Received text copoun code and tried to…", "text": "Received text copoun code and tried to use it for purchase did not work", "rating": 3}, {"title": "Wish that when I selected the size…", "text": "Wish that when I selected the size filter, all the shoes that popped up were my size.", "rating": 3}, {"title": "You have to spend to much to get free…", "text": "You have to spend to much to get free shipping", "rating": 3}, {"title": "Nice clothes", "text": "Nice clothes, but not true to size. They run smaller than the actual size chart,  I usually have to get a size bigger to get the look and fit I want.", "rating": 3}, {"title": "coupon code", "text": "I couldn’t get back to the coupon wheel and therefore didn’t save 10%", "rating": 3}, {"title": "A little  unhappy with the price", "text": "Date of experience: March 24, 2022", "rating": 3}, {"title": "Shopping Rainbow: On-line and In-Shop", "text": "I've been shopping in Rainbow stores for years.  Was back in one today but couldn't find my size in the style I wanted.  Figured I could find it on-line.  Alas, couldn't even find the same style on line.  That's why they didn't get more stars.  Overall, this is a good place with cool merchandise and pretty friendly staff.", "rating": 3}, {"title": "I hope this order will get on the day…", "text": "I hope this order will get on the day that the Rainbow store promised already and when I receive the order I was told before that I could go to a local Rainbow store and exchange the item to a different color o size, I hope that decision happens", "rating": 3}, {"title": "It took to long to complete the payment", "text": "Date of experience: March 22, 2022", "rating": 3}, {"title": "There are coupon codes for Rainbow…", "text": "There are coupon codes for Rainbow Shops that I was unable to apply at the time of my purchase. Normally when I’m shopping online I receive a coupon otherwise I could go into the store and shop for what I want.", "rating": 3}, {"title": "I like the app", "text": "I like the app,  it works good, but the issue i have is that items are shown that aren't necessarily in stock.  So when you go to submit your order,  it tells you it's no longer in stock,  which is disappointing.", "rating": 3}, {"title": "Nice shoes i wish they could be shipped…", "text": "Nice shoes i wish they could be shipped to my home address", "rating": 3}, {"title": "I love the site and the clothes", "text": "Date of experience: March 18, 2022", "rating": 3}, {"title": "I ordered 4 peplum blazers", "text": "I ordered 4 peplum blazers. The gold is described as tan and the tan is described as gold, So I ordered both to make sure that I get the gold one which was the one I want.", "rating": 3}, {"title": "I like shopping online at rainbow I…", "text": "I like shopping online at rainbow I only had one complaint I didn't receive my order last Easter and I never heard back from Rainbow about my refund", "rating": 3}, {"title": "Paying $7 dollars for UPS…", "text": "Paying $7 dollars for UPS shipping..what happened to Fed-Ex?... Not good takes so long to receive package.", "rating": 3}, {"title": "Some styles were out of stock however l…", "text": "Some styles were out of stock however l found something. Prices were great!!!", "rating": 3}, {"title": "More of a selection for work attire", "text": "More of a selection for work attire. Add multiple lengths for pants in regular and plus.", "rating": 3}, {"title": "Zzzzz z-A;’zviewEra", "text": "Amazing shopping experience.. heelzzza", "rating": 3}, {"title": "Not what I was looking for", "text": "Nothing was in stock and they didn't offer that many options like in the store. I was disappointed with Rainbow Kids.", "rating": 3}, {"title": "More incentives for returning…", "text": "More incentives for returning customers. Coupons and points would be good", "rating": 3}, {"title": "You snagged me on those shipping…", "text": "You snagged me on those shipping charges!!!!No need to be that high, REALLY?!?!!A 12$, purchase in now almost 20$!!!!!", "rating": 3}, {"title": "Free shipping would be great.", "text": "Date of experience: March 05, 2022", "rating": 3}, {"title": "Didn't get my coupon when when I signed…", "text": "Didn't get my coupon when when I signed up.  False advertising.", "rating": 3}, {"title": "Sucks you guys don't take gift cards…", "text": "Sucks you guys don't take gift cards online anymore. I got a $150 gift card that I now can't use since I don't have any stores around me.", "rating": 3}, {"title": "Easy checkout", "text": "Date of experience: March 03, 2022", "rating": 3}, {"title": "confused", "text": "confusig because i could figure how I kept ending up on klarna erder,should hv bn told your orders r actually klarna. Don't know if I hv rainbow account or klarna account.", "rating": 3}, {"title": "Quality of product could be better", "text": "Quality of product could be better. Shipping could be better.", "rating": 3}, {"title": "i really haven't formed a decision", "text": "i really haven't formed a decision. I'm waiting for my order to arrive.", "rating": 3}, {"title": "I love Rainbow shops but i think $75…", "text": "I love Rainbow shops but i think $75 for free shipping is too much. This means i will not be shopping a lot.", "rating": 3}, {"title": "The distressed purple shirt was very…", "text": "The distressed purple shirt was very short to be a 4x", "rating": 3}, {"title": "I wd give you a four if delivery of…", "text": "I wd give you a four if delivery of item was quicker based shipping charge .  it takes a long time to get your item.  should improve thst..", "rating": 3}, {"title": "One if the items was damaged and the…", "text": "One if the items was damaged and the other was not a true fit.  I returned them the same day, but have not received my refund yet.", "rating": 3}, {"title": "When viewing my cart", "text": "When viewing my cart, not all the items show up.  I have to select checkout THEN view summary in order to see everything in my cart. Also,  your prices are not that great, generally speaking.   I can get better quality   items AND name brand designers cheaper from Amazon, Macy's, TJ MAXX, Burlington, etc.   There are some things you carry that I cannot get anywhere else, and those are what I order.", "rating": 3}, {"title": "Shipping charges to much", "text": "Date of experience: February 24, 2022", "rating": 3}, {"title": "I like alot of the clothing", "text": "I like alot of the clothing, I enjoy shopping online than in the store because the store is (both locations) too cluttered. So, I really do my shopping online, & it will be great if ya’ll will give coupons/discounts to VIP and any customer sometimes. I have never received any discounts, even if something is on sale, I can’t tell because of the high shipping fee.", "rating": 3}, {"title": "I Love  it,but the shiping is too…", "text": "I Love  it,but the shiping is too expensive because I live in Puerto Rico", "rating": 3}, {"title": "Needs more options", "text": "I wish your site had more conservative options.ex for work and family gatherings.", "rating": 3}, {"title": "I have not received   my merchandise .", "text": "Date of experience: February 19, 2022", "rating": 3}, {"title": "Problems with address and payment", "text": "Date of experience: February 18, 2022", "rating": 3}, {"title": "i enjoy shopping at Rainbow online.", "text": "i enjoy shopping at Rainbow online.. shipping is free if your order is high enough.i refuse to set foot in the store in Prince Frederick Md. the sales people are too busy talking to each other and playing on their phones than help a customer.", "rating": 3}, {"title": "Double check items before shipping", "text": "1. Some shoes had one size on the bottom then a different size on the top. 2.I ordered a particular size, I was sent the wrong size for some.3. I ordered 15 pair of shoes and had to/choose to return 6 because of false advertising.4.I had to take time out my day to return the shoes to a location close to me when I ordered them on-line.One good thing all 20 items came in 1 large box.", "rating": 3}, {"title": "This was Ok", "text": "The system wouldn’t recognize my saved password, in order to receive 10% off I had to sign up for not only email but text, the system kept on glitching", "rating": 3}, {"title": "Actually nothing happened but ordering…", "text": "Actually nothing happened but ordering the item was quick and easy had no problem of the price as long as the item I get is of quality.", "rating": 3}, {"title": "Normally no problem but being as though…", "text": "Normally no problem but being as though my stuff hasn't arrived and I was told today and I haven't gotten any updates.", "rating": 3}, {"title": "Website loads too slow", "text": "Date of experience: February 14, 2022", "rating": 3}, {"title": "I did not receive what I ordered on one…", "text": "I did not receive what I ordered on one of my items. I ordered a black shirt and it came brown. although I am very unhappy with the shirt. If there's anyway I could get a black one I'd appreciate it.", "rating": 3}, {"title": "it was kind of hard to find what i…", "text": "it was kind of hard to find what i needed and had to get a extra shirt because it would not delete out of my cart", "rating": 3}, {"title": "Love the clothes", "text": "Love the clothes but wish more were in the size I wanted.", "rating": 3}, {"title": "Good", "text": "Food and healthy sounds.hanhing.dont forehead stand the same today I'll fly finally+1 George foosery the bad jaa", "rating": 3}, {"title": "The cost of shipping to PR is expensive.", "text": "Date of experience: February 09, 2022", "rating": 3}, {"title": "The App is slow", "text": "The App is slow. Navigation on the App is not simple and disorganized. The fliter/sort system is very basic. You have to know exactly what you looking for to sort. Sometimes I just want to be able to browse and sort/fliter as I go. Also, measurements for specific clothing would be nice. For example if I am looking at a 1x shirt, be nice to know the exact measurements of that shirt size.", "rating": 3}, {"title": "I tried placing an order online and was…", "text": "I tried placing an order online and was unable to complete it because some items wouldn’t ship to my address but it wouldn’t tell me which ones. After a lot of frustration and calling customer service, I was told that because I live in California some accessories cannot be shipped to me. Perhaps that should be mentioned on the specific items. I was told that if you order on the app it does tell you which items don’t ship to California. I removed the accessories and then I was able to place my order.", "rating": 3}, {"title": "Home", "text": "I love to shop there", "rating": 3}, {"title": "It took almost an hour to process my…", "text": "It took almost an hour to process my payment system couldn't get shipping information", "rating": 3}, {"title": "I would figure if more than 2 if the…", "text": "I would figure if more than 2 if the same item is purchased...it should have been a discount.", "rating": 3}, {"title": "I was looking for a Wide width loafer", "text": "I was looking for a Wide width loafer. I Searched wide loafers and some platform loafers showed up so I was looking for reviews on them to find out about the sizing to decide what size I should purchase.  There were no reviews and no direction on how the sizing ran. I purchased my normal size and hoping it will work out.", "rating": 3}, {"title": "wish i could have a wishlist", "text": "Date of experience: February 06, 2022", "rating": 3}, {"title": "I love this store it just when it came…", "text": "I love this store it just when it came to checkout it took awhile to process things", "rating": 3}, {"title": "This is my first time ordering from you.", "text": "Date of experience: February 05, 2022", "rating": 3}, {"title": "I couldn't edit the cart items where…", "text": "I couldn't edit the cart items where all sold out lacking variations", "rating": 3}, {"title": "I wish there was a way that everything…", "text": "I wish there was a way that everything I put in my cart was in stock", "rating": 3}, {"title": "I haven't received my purchase was…", "text": "I haven't received my purchase was supposed to get it yesterday but I didn't", "rating": 3}, {"title": "Unable to create a new ot log into old…", "text": "Unable to create a new ot log into old account", "rating": 3}, {"title": "the reason I go to rainbow is because…", "text": "the reason I go to rainbow is because of your plus size fashion. and your always running out so fast. my cart would of been more then 300 dollars worth and at the end of it i ended up just getting 2 pair of tights because everything else was sold out. I think keeping your stock up in all sizes would be helpful to your company.", "rating": 3}, {"title": "Your site does not work like it used…", "text": "Your site does not work like it used to. Same clothes and prices, but the site is tricky to use. I have to refresh the page to make deleted items go away. The Klarna option blocks me from editing items lower in the cart. I don’t like that.", "rating": 3}, {"title": "I have been to 3 Rainbows for one lace…", "text": "I have been to 3 Rainbows for one lace shirt and couldn't find it. I don't like online purchases but I had to.", "rating": 3}]