[{"title": "Not too happy", "text": "The guy that we started the process with went on vacation and our lain package got passed around to difficult people. I feel like we got lost in the in the mix and no one worked or package until we called. The process seemed a lot longer then previous times. ", "rating": 3}, {"title": "Disappointed ", "text": "Initially, I was told that my first payment would not be due until January 1st, and I agreed to those terms. However, upon closing, I discovered that my first payment was actually due on December 1st. When I contacted your company to rectify this situation, I was informed that there was nothing they could do, despite the fact that the company records and archives conversations. As a result, I am revising my initial rating of 3 stars to 2 stars. Additionally, prior to the conclusion of the process, I was transferred between three different representatives from Rocket Mortgage. The rationale behind this excessive number of transfers to different representatives remains unclear to me.", "rating": 3}, {"title": "The best!", "text": "Everything from start to finish went great! Flawless even, with the clear communication between everyone and help along the way when needs. ", "rating": 3}, {"title": "Delays delays delays it was terrible…", "text": "Delays delays delays it was terrible the amount of redoing lost paperwork. Then I’m co on the deed and they only spoke to the first on the account as well as mailed to the originator of the deed not me.the repayment check for our creditors was promised in a day and it took 2. Then creditors had to wait a week for the checks to clear after we were told don’t pay the creditors after we sign final paperwork. So now some payments are late to creditors. I was not impressed. But now that it’s over I’m happy with the outcome, I have no more credit card debt!!!", "rating": 3}, {"title": "Dissatisfied ", "text": "I disliked the manner of handling which creditors to pay. I was issued a check for over $600.  to pay a creditor with a -0- balance and in fact never used. I asked to pay those with above $1K balances and paid several below that. I asked to keep Safe Home credit out due to personal reason and was denied that option. 😠 ", "rating": 3}, {"title": "Natalie Lang was excellent to work…", "text": "Natalie Lang was excellent to work with! She responded to questions in a timely manner, made dealing with all the documents much easier, and listened to all of my concerns. The 3 star is related tohigher than average closing costs and having to buy points. ", "rating": 3}, {"title": "We were looking for fast service but didn't get it", "text": "We were looking for fast service. Instead our account got shuffled three times to different agents. Our fully owned home - paid off five years ago with help from a prior Rocket Mortgage - was subjected to an unnecessary and time-consuming appraisal. The new loan amount was 2.9% of the value of our home and an appraisal should not have been necessary. We had to wait weeks for the appraisal, it came in far below the average of EVERY Real Estate Co in our area, and REQUIRED that we reinstall the smoke detectors we had recently removed. ALL of this caused substantial delays and should have been avoided. ", "rating": 3}, {"title": "They were not consistent with the…", "text": "They were not consistent with the dissemination of information in a timely manner.  I felt the process could have been smoother and easier if communications were timely and consistent. ", "rating": 3}, {"title": "Amazing intial contact, with Brenton, slow going after. ", "text": "The individual who was our inital contact, Brenton, was amazing.We would easily give him 5+ stars. He was articulate and answered all of our questoins. However, the closing process was a bit of a nightmare. They needed to be more specific on all that they needed to complete the loan process, but were not. They continually told us that had all they needed, only to come back a day later with something new they needed in order to complete the loan. Due to this back and forth, the entire process took over a month for us, and we ended up having to pay more payments to my mom's account in the interim. If they could give the client a confirmed and accurate list of items needed at the start, and stick to the list, it would be so much more helpful, and the process should be more smooth. ", "rating": 3}, {"title": "Verify Everything!!’…", "text": "We found out that the loan we took two years ago to buy our mother in laws home wasn’t completed correctly and our names were never put on title!!!!!!! We were refinancing to do a cash out and also remove her from the title and mortgage and lo and behold we find out we can’t because of the errors from two years prior! So that’s gonna cost my family another 7k to do another loan later in the year. Way to go! Not. Make sure you get confirmation on everything! ", "rating": 3}, {"title": "I was repeatedly misinformed", "text": "I was told that I wouldn't need an appraisal because I was an existing customer when I refinanced, but when I got the paper.work it included an appraisal and I was only given an explanation after I asked about it. I was also told that it would take about three weeks to close and it took well over four weeks instead.  my agent also said that the closing would be done virtually, but the attorney came to our home.  Nothing really major but it left me feeling less confident about exactly what I was getting into.  This was much different from my last experience with Rocket Mortgage which was flawless and I had an agent that communicated frequently with me. This agent was pretty hands off. ", "rating": 3}, {"title": "Mailed checks!", "text": "Having checks mailed to me to mail out for paying off my credit cards. Please! electronically paid is much more efficient, less risky(do you know how much mail is stolen in the US daily?), and saves paper and postage two ways. The last time we refi'd through Rocket Mortgage they did everything electronically, talk about moving backwards. I did however like signing online.", "rating": 3}, {"title": "I would like to say that my experience…", "text": "I would like to say that my experience with Rocket Mortgage was great due to the care that Jennifer Geer gave me. She worked for two days searching for the best solution to the problem I had and I could not be happier with the results. Because of what she did for my family and I allowed me to be able to pay off my wife’s car and made our lives more enjoyable and eliminated a big part of our debt. We are now in a situation where we can save money in the future. Thank you Jennifer for your support and your dedication to your customers. Great job!", "rating": 3}, {"title": "Hiccups with Amrock and not all loan processors are good", "text": "The first loan processor I reached out to was not helpful and was going to let us just not be helped. After I brainstormed an idea, I presented that to our new loan processor and she was wonderful. However, Amrock messed up our paperwork, which delayed everything for us by about 5 days, which is frustrating. ", "rating": 3}, {"title": "Some good some bad", "text": "fees high, processors kept asking for documents after they were sent.  People I dealt with on the phone were very pleasant and helpful.  It's the people working on documents that were often frustrating.  ", "rating": 3}, {"title": "Our loan officer sent us multiple forms…", "text": "Our loan officer sent us multiple forms of communication with a lack of professionalism. My husband’s first name was in lower case on our closing docs.  His emails to us had many words that were lower case.  Not very professional.", "rating": 3}, {"title": "Closer was unable to correct address so…", "text": "Closer was unable to correct address so he hit the sign button anyway. I did not sign it he did, very upset to think anyone can just hit sign and my signature will then be signed. Did not think this was very professional as he did not even ask if it was ok to do that. He just did it.", "rating": 3}, {"title": "You advertise that getting a home…", "text": "You advertise that getting a home equity loan is easy but it was not.It took weeks and much frustration on our part.We had to fax and refax the same information.The closing was great.She was very pleasant and easy to work with.", "rating": 3}, {"title": "All went well until closing", "text": "All went well until closing. We were sent to a Stuart title close to us. Arrived on time and found company no longer had residence at address given to us FOR OVER A YEAR. A realtor near the location sent us to a stuart title in Kingwood (an additional 15 miles) They were unable to get any info on where our signing could be. Seems as though they had several similar people arriving so they call nearby places with no results. We went home and got on computer to actually cancel the entire deal but instead opened my account and got a number for the closing agents with AMROCK was able to get correct information through them (another 15 mile trip, so total of 45 miles in rush hour traffic). I would think Rocket mortgage would be more accurate on the information sent to consumers especially since we discovered numerous individuals had to do the same. Really closed down for aver a year and you did not know, very dissappointed.", "rating": 3}, {"title": "Do not like having Amrock require my…", "text": "Do not like having Amrock require my having to finish up process with handling check to Synchrony Home..  don’t have ability to get and print statement..", "rating": 3}, {"title": "Neither Rocket or the \"closer\" Amrock…", "text": "Neither Rocket or the \"closer\" Amrock notified my former mortgage holder that they were paying yhat mortgage off. They took another payment out of my bank acct. JULY 1st, 2024.When I called Rocket, I was told it was my responsibility to stop payments.Between Rocket & Amrock, that's a half-assed way to handle this outcome. What do I need them for if I'm responsible in letting my former mortgage holder of a payoff.TOTAL DISCONNECT BY BOTH SERVICES !!!  ", "rating": 3}, {"title": "The underwriters were inefficient for…", "text": "The underwriters were inefficient for lacking to organize required documents at once, thereby dragging the process unnecessarily ", "rating": 3}, {"title": "Did not do as promised. Not Happy", "text": "As we went through the refinance cash out procedure in June, our rep toward us not to pay any of July's payments because we would receive checks to pay off the creditors. We didn't receive the checks until the end of the first week in July so we had several late paements with service charges. Not good. And even when we received the checks by the time they ere mailed and credited more charges received.Also, the officer that closed the loan told us the payments would not start until September. Afterwards we received notification that they would start in August. Not happy.", "rating": 3}, {"title": "Requested documents and tests without specific requirements…", "text": "Was requested documents and tests without direction or requirements and had to do several multiple times costing a lot of extra money.  Was told initially it would be quick but took twice as long.  Was told that time was not an issue but a week before closing was told I had 4 days to complete the tasks.  I was told closing would happen 1 to 2 days after everything was complete but is took 8 days.", "rating": 3}, {"title": "I wish the process went faster and I…", "text": "I wish the process went faster and I also am very annoyed at how many phone calls came through. There needs to be a way for Rocket mortgage to protect us from so many advertisements.", "rating": 3}, {"title": "Had to do a lot of extra phone calls&…", "text": "Had to do a lot of extra phone calls& bactracking...wich coused a delay in dispercement& was told my first payment would not be till september...by lizbith lopez now she saying august....im not satisfied with the lack of tranparency& comunication issues.", "rating": 3}, {"title": "Exhausting process", "text": "I liked working directly with one person, in my case, Lonny. Hate the numerous emails demanding action that could have been done directly thru him.  He helped every time I asked. The process took too long. Near closing there was one action that rocket needed to do that I didn’t understand from what was on the website. Lonny explained it to me and I was able to obtain that Penthouse document the same day. You had the wrong info but did not reach out to me.", "rating": 3}, {"title": "Rocket found me the best rate, but needs to request all requirements initially.", "text": "Rocket was able to find me the best rate for my Home Loan, the Loan Expert was great, but there were a few steps that need definite refinement.All requirement for the purchase, particularly homes with well water supply, need to be given ahead of time. We completed the well inspection, then a request for a \"well water quality\" inspection was requested three days before our closing date. This was followed by yet another request for a specific test required for the well water. This caused us to miss our closing date by 11 days. Fortunately, there was no problem with the seller.", "rating": 3}, {"title": "We basically got dropped at the end of…", "text": "We basically got dropped at the end of our loan cycle. We were handed off to a new person who kept calling saying everything was on schedule when the original technician was working the account, but ghosted us because he wouldn’t take our calls or call us back. Ultimately delaying our closing and sending our stress level through the roof. Absolutely hated the last week of working with Rocket! Definitely has us rethinking our decision to use Rocket in the future.", "rating": 3}, {"title": "See my comments re my mortgage…", "text": "See my comments re my mortgage specialist. Your company changed the rules several times & underwriting would not approve what she promised. On the very last day you changed the terms again and required additional down payment of $14,000 that was a total surprise to me.", "rating": 3}, {"title": "All in all very pleased…", "text": "The app was not uploading the correct documents and we had to make many phone calls to have many people work to help get the issue resolved. It was frustrating but it was finally fixed. Then the day of the closing, the documents were not ready when they were originally stated to be and we ended up wasting a large part our day waiting for our closing. All in all we were really happy with how extremely quick Rocket was able to do our refinance and speaking to everyone they we all very polite. ", "rating": 3}, {"title": "Why do I have to mail checks to creditors with a 6k closing cost.  ", "text": "Rocket mortgage was extremely easy to work with, understanding if you wanted to change something, and quick to make the adjustment.  The only thing I did not like under any circumstances was I had to mail out checks to consolidate my bills.  They are not certified and adds extra time and interest charges to the accounts due to the some creditors putting a hold on it.  In addition I was not even aware I had to mail checks out until they showed up UPS at house my on July 8 and my loan closed June 30.   I do not understand why they did not make wire transfers to pay off creditors.     ", "rating": 3}, {"title": "Need to step up the performance of the realtor", "text": "The realtor assigned to me was less than stellar.His attorney referral was sub par and the home inspector he recommended missed the shower water from the bathroom would leak into the basement.  The seller hid this fact and I didn't find out until after I bought.   I flooded on day two of owning the house.  ", "rating": 3}, {"title": "Later than expected closing ", "text": "12 days ago, we finally closed. It was much later than what was anticipated.  The process, at the beginning was great - our rep Demetrius was on top of our loan process. But when it went to the processing and closing team, it became unhinged with communication.   We had to constantly follow-up. It seemed the left hand didn’t know what the right hand was doing.  For the most part, it was figured-out, but it was still a challenge- just for a simple VA refinance.  ", "rating": 3}, {"title": "The Unknown Hassle ", "text": "Paying off my debts has been a slight hassle. When I started the process I thought Rocket would automatically send the debtors the funds to pay them off, but, that did not happen. So now I have funds coming out automatically from my account and I don’t know if the Rocket checks are clearing.", "rating": 3}, {"title": "The employee we dealt with was very…", "text": "The employee we dealt with was very nice but the she didn't seem to quite understand fully how to get our contract done. We had to get two other employees involved to get it done. Lots of information given to us ended up to not be the case as it took months to get this done. ", "rating": 3}, {"title": "My appraisal was not what it should…", "text": "My appraisal was not what it should have been. My house was appraised 7 months before over 15k higher.  In a neighborhood with rising prices, this was not realistic.  I understand that's a 3rd party, but you guys selected them.  This was not beneficial to me and my loan and caused increased stress for closing. I was trying to pull more equity out and was limited.", "rating": 3}, {"title": "Everything went great until closing", "text": "Everything went great until closing. It was frustrating trying to do it online. I spent hours trying to get on to get my things done before closing time. I was unable to get on, so someone came in person a few days later.  Communication was not great either through the closing process. We loved our loan officer and he communicated great with us as we were applying and getting it all in order. P", "rating": 3}, {"title": "Would do again", "text": "James Hardwick was hard to get hold of, I was told by him he would be with me throughout the process, He got me started and that was the end of hearing from him. The document process center was great, helped me through a few problems. And the closing was great, no wasted time, took about 30 minutes. Funds arrived in account 2nd day after closing", "rating": 3}, {"title": "The amount of paper submission is frustrating.", "text": "The banker/agent that helped us through the loan application and processing was excellent. She guided us every step of the way. That is the reason we gave this a 3 star rating. The paper processing was another story. It is seems like each department was not coordinating. The title company we have chosen was told to coordinate with us with the details of payoff and closing dates than them doing it the other way around.", "rating": 3}, {"title": "Was informed  that on our loan that mip…", "text": "Was informed  that on our loan that mip protection was  included in our loan which is not.had your company call me about  getting it.Also one of the payees was not included  in the loan.", "rating": 3}, {"title": "Second time around 👎🏼", "text": "We used Rocket Mortgage again for our Second Home Buying because we had such a great experience the first time. This Second time was not the same. There was many “Typos” on the loan estimate that would’ve cost me THOUSANDS of dollars if I wasn’t paying attention. ", "rating": 3}, {"title": "Good Rates Slow Painful Process", "text": "Must admit rates were very competitive. Documentation and paperwork easy to upload. The problem starts when turned over to the title company. Amrock is awful. There is no communication and they really drag their feet. Everything came out alright as I had a little longer timeline to work with, although it was much much longer than their upper end of their estimated time, I don’t think I would use them again. ", "rating": 3}, {"title": "I requested an equity loan on my…", "text": "I requested an equity loan on my property. The process of getting this loan should not have been more complicated than a request for a personal loan.  Getting a small equity loan when a company can lien on a property valued at over $600,000.00 should not be as complex as getting a mortgage for the $600,000.00 house.", "rating": 3}, {"title": "Like all mortgages it takes too long…", "text": "Like all mortgages it takes too long and causes people to second guess what they’re doing. When I buy a car I go in test drive it and usually before I leave I know whether the car is mine or not. When buying a house it takes several weeks to get everything done before you know if it is yours or not! ", "rating": 3}, {"title": "Process Feedback", "text": "Process was too long. I was ask for additional information after I was told you had everything you needed. I did like overall ease of use, functionality,& design of the user dashboard on the Rocket Mortgage.com. The actual closing and funding were seamless. ", "rating": 3}, {"title": "The person I initially spoke with to…", "text": "The person I initially spoke with to set up the loan never circled back to give me any info everything from that point on was done through automated emails & texts. Luckily I am familiar with the process but for someone who is not this was very poor service", "rating": 3}, {"title": "My Experience process was very long", "text": "The loan process to 2.5 months to close.  Way to long.  Seemed like everytime all ready to sign and close there was always another document to get or to sign.  Jacob did an outstanding job in communicating what what happening with the loan.  He was very professional.  ", "rating": 3}, {"title": "Process is okay but...", "text": "Instead of sending us checks to pay off our credit cards it would've been better to just put the funds in our account so we could pay them ourselves. Sending checks through the mail (untrustworthy) causes stress and the amounts they have on the checks are almost all incorrect because as we waited for closing we still have to make our payments on time.", "rating": 3}, {"title": "I had to upload tax documents several…", "text": "I had to upload tax documents several times.  Had to confer with my CPA to get updates.  That cost me a fee. I was not satisfied with the appraisal that was provided.  It was lower that the value of my home.Several different individuals from Rocket requested information, made me feel unsafe. ", "rating": 3}, {"title": "I told the pp I was working with 4…", "text": "I told the pp I was working with 4 times that one of the larger debts was overstated n even sent them a payoff letter from debtor yet it was never fixed n now I have to wait for a $2k refund from debtor.  Plus closing asked me to e-sign everything and I did but agent never showed at appointment time. When I called her asking why she didn’t show,she said she received multiple notifications saying I had to now sign all documents on paper n she had to go back to her office to print them.   I did not receive any notification of this   Then because she had another appointment I had to reschedule for a two hr wait.  ", "rating": 3}, {"title": "Cost additional time and money ", "text": "I had to spend more than 3 hours preparing and mailing checks because Rocket Mortgage didn’t pay off debts when we refinanced the house, instead sending the checks to us…made out to the debtors. That makes zero sense and caused additional interest and cost additional time and money. ", "rating": 3}, {"title": "Process was s imple but was delayed…", "text": "Process was s imple but was delayed because of a 8000 balance due on my credit report it was one of the reasons why I was getting a home equity loan.  I feel I should have not had to go through the delay and wondering what was going on as I have did my research on home equity loans. Especially when I have my primary mortgage with rocket loans and my on time payment history. ", "rating": 3}, {"title": "Fun working with them ", "text": "For the most part the team did really well, Sean's loan guy was awesome and I loved working with him.. however the phone call I got from another person whome I received to increase my loan amount needed to learn to take no for an answer not keep on keeping on.. it was annoying and I almost backed out. But the lady who answered calls and chatted with me to get it right and put me at ease was also very nice and helpful.", "rating": 3}, {"title": "The original loan manage Quinn was…awful.  He kept harassing us.  ", "text": "The original loan manage Quinn was extremely persistent and harassing.  Whenever he needed something he would call 8 to 10 times in one day.  Some of the calls were only 5 mins apart.  It was to a point that we asked him to only communicate with us through email.  It was awful.  Our cell phone numbers were also sold to outside vendors who kept harassing us as well.  We were both receiving over 20 calls a day for 3 weeks from other lenders.  We will never use Rocket Mortgage again.  The only reason why I selected a 3 star rating because the person who helped us at the end to close the mortgage was great.   ", "rating": 3}, {"title": "Average experience ", "text": "I was unimpressed with the communication from the Rocket Rep. She never called to discuss the rate change-just sent the paperwork.Also, the man who came to have us sign our closing paperwork was unprepared, did not have papers in order. We were unimpressed.", "rating": 3}, {"title": "Confusing and annoying process", "text": "I was bot happy with the overall experience during this mortgage process.  The constant bombardment of \"info requests\" were annoying and I did not feel like a repeat customer of Rocket Mortgage.  The closing costs, Rocket's fees were way to high and not competitive although when I brought this up a discount was applied, but only after I brought it to their attention.  I felt I could have gotten a better interest rate as well with a credit score of 850, but I had locked it in.  Overall the process was confusing and the hand offs to someone in the next step was not appealing.  The customer should have one single point of contact throughout the process.", "rating": 3}, {"title": "Too mush time", "text": "Every thing went quick to start but ended up taking twice as long. If the lawyers list that was supplied were closer than 1 1/2 hours, which then we had to use a lawyer closer but seemed like Rocket wouldn't talk to them. This is just to say a little.", "rating": 3}, {"title": "Performance Cannot Be Sped Up", "text": "Performance at industry standard. I asked for two things at the outset: Speed and no government-backed lending. I got the latter. Several times team asked for information already sent and received electronically.  I had to chase people in your end, generally without any positive effect. ", "rating": 3}, {"title": "Not happy with Rocket", "text": "Having to manually research the addresses for 11 accounts, print out statements and pay to send these checks was a huge hassle.  I wasn’t told about this until days before closing and I would have cancelled if it wouldn’t have reflected on my credit rating. The time delay in getting these checks means most will be overpayments. I’ll have to fight with 11 accounts to get back the nearly $1000 I paid unnecessarily. Also, the closing costs were ridiculous.  I should have researched this more as other lenders waive some or all of these fees to new customers.  I trusted Rocket based on past experience but I was very disappointed this time.  ", "rating": 3}, {"title": "Best for simple situations", "text": "Rocket is very easy to work with both people wise and website wise, provided you have a very simple situation. Because they have a large team, not all team members are aware of different aspects of the business like their partnerships with other orgs that provide bridge loans and home equity lines of credit. This meant I got different answers depending on who I talked to which took a while to sort out. Since I only had a 14 day no bump on my offer to purchase, I had to scramble to get my house sold in just 2 weeks which was really difficult. If you aren't on a timeline like this you may not experience this.Their costs to close were pretty high compared to other lenders, though their rates are very competitive.If you're just trying to sell and not looking to sell and buy simultaneously you'll love being able to do everything online and the good customer service.", "rating": 3}, {"title": "…Sorry I had to settle at this time in our lives!!!", "text": "I truly appreciate the support and encouragement you gave to continue the journey because I was really ready to stop the process. What pushed me forward was that I expected enough funding to pay off some debt however, I was not able to do updates and repairs and pay off bills. I’m grateful however.", "rating": 3}, {"title": "Great in some areas and not so much in others", "text": "The main person I worked with on my loan was great.  Ryan was on top of everything and checked on me through the process without being pushy.  I have not been as impressed with other employees during the process.  When Ryan was out, the person filling in for him seemed to not be too concerned.  After making a deal, Rocket moves you along to someone different within the process and they were ok, but nothing special.  After closing on my second property with Rocket.  They paid my insurance with my primary mortgages escrow and apparently they don't understand how it happened.  I'll use them again, but only for three reasons.  Ryan, the ease of using their website and app, and the rate was the most competitive. ", "rating": 3}, {"title": "I didn't feel like my mortgage officer…", "text": "I didn't feel like my mortgage officer was necessarily giving me all of my options and recommending the best option based on what I said I needed. It felt like I had to ask the same questions multiple times and probe to get additional information. I also didn't like having 4-5 different people to work with. Information got lost in translation and led to errors. ", "rating": 3}, {"title": "Overall", "text": "Overall, experience was good but mainly due to my banker, Maryana Zakharkiv. This lady went over and above to get the deal pushed through and closed. The only part that was a mess was closing. The date changed at last minute and it messed up the money amount for closing transaction. Once again, Maryana to the rescue. She ended up making good on my out of pocket expenses. Thank you Maryana and Rocket mortgage. ", "rating": 3}, {"title": "It took Way too long", "text": "It took Way too long. Very bad communication between the staff and myself. I had to keep calling rocket mortgage to ask what do they need to finish the process because they had bad communication among each other and they never communicated it to me", "rating": 3}, {"title": "Honest Review", "text": "The process started out great and seemed to move quickly. We then started getting calls, texts and emails from various depts which was overkill. Once we locked in our rate, it seemed like we were just another number. We were also overcharged on the appraisals that were done. Honestly, we almost backed out of this deal 3 times and went to another lender.", "rating": 3}, {"title": "Slow but steady service grade on our Rocket loan.", "text": "Although we eventually got the loan, it took three times longer than expected. While I received daily advertisements from Rocket in my email about the speed in which you closed your loans.", "rating": 3}, {"title": "When this process started someone would…", "text": "When this process started someone would call us or respond to us quickly. As that process continued the communication was less and less. I would have liked more consistant  communication . When we finally signed and closed the loan 4 of the checks that were going to pay off a student loan were made out to the wrong payee. We have made a phone call to get help with this but have not gotten a call back yet. This is very concerning to us. We are not sure how and what is going to happen.", "rating": 3}, {"title": "Was disappointed when checks arrived to…", "text": "Was disappointed when checks arrived to pay off creditors and found 3 out of 4 checks were for not enough $ to pay off account,  including my pickup truck. I appreciate the help by giving me the check and helping me pay down balance, but I was told these accounts would be paid off.", "rating": 3}, {"title": "I was very confused as we proceeded to…", "text": "I was very confused as we proceeded to the closing.  I was  not certain of what documents I should address and who should I take direction from.  My closing documents are incorrect and I do not know what happened to my escrow as far as insurance as I am paying out of pocket for my home owners insurance and this is a first.", "rating": 3}, {"title": "I felt considering rocket holds my…", "text": "I felt considering rocket holds my morgage , why did I have to supply all the required materials including another appraisal!  You folks have cost me a lot of money!  I used you for my 2nd to avoid all the bull—- !", "rating": 3}, {"title": "truly Rocket can charge a bit less for…", "text": "truly Rocket can charge a bit less for closing. if the credit score do not factor in on any thing important stop checking it. if the customer is with the company some of the stuff you ask for can be waved.", "rating": 3}, {"title": "Disappointed ", "text": "We have used Rocket Mortgage on several occasions in the past and were well pleased. We recently refinanced and the process went smoothly until closing. It appears that that our closing documents were mishandled causing an untimely delay in closing and a major inconvenience. We are very disappointed!", "rating": 3}, {"title": "I liked how quickly the process went ", "text": "I liked how quickly the process went However I feel like if we had used my income all-be-it small and my credit score (better then my husbands) we could have gotten more $ I still do not understand why we couldn’t use my info", "rating": 3}, {"title": "The first agent Julian was the worst…", "text": "The first agent Julian was the worst one of 13 properties I have bought and sold ( that’s 26 transactions). If it were not for Will I would not have scrapped the whole transaction and gone with Loan Depot. I have texts ( that he never answered leaving me in the dark ) if you care to see them ", "rating": 3}, {"title": "my representative did not listen about…", "text": "my representative did not listen about payoffs . consequently i now have a large overage on my lowes card . which i do not use very often . other than that my experiance was great", "rating": 3}, {"title": "The initial process was great", "text": "The initial process was great!  Filing out the information, uploading documentation for my refi was a breeze.  What was the most challenging process was trying to understand what the underwriting team wanted and needed when I had the roof inspection done which held my approval longer than usual. When I finally received my closing package, I reviewed the banking info with the loan signing agent and I did not received my funds on the fourth day after closing. I called to follow up and was told that I should give it another day. It didn't show up the next day and I called again.  I was then told that they were trying to call me to verify my bank information.  I never received any calls from anyone for verification. This held up receiving the checks to payoff my accounts to pay them on time because all the checks had to me mailed out.  I am still having problems as some of the companies still have not received payment.  ", "rating": 3}, {"title": "Started strong, finished weak", "text": "Staff was friendly. App is helpful. But the way the funds were dispersed was not made clear until the very end (kinda too late by then) and has caused some significant challenges, delays, and costs. A few other unexpected costs as well. I won’t know for a week whether all the funds went where they were supposed to or not. ", "rating": 3}, {"title": "I loved the service we received from…", "text": "I loved the service we received from Caroline Roberts , I would give her a TEN. But your underwriting department gets a ONE, they are terrible ", "rating": 3}, {"title": "The transfer of the money was very complicated", "text": "The transfer of the money was very complicated. Some of the initial documents was very complicated. I did everything they wanted and asked for then when it was time for me to receive the money, became a lot of problems if I was being updated if there was a problem I would feel better. ", "rating": 3}, {"title": "Would not accept signed city work permit ", "text": "Would not accept city work permit for HVAC changeout.That was inspected and signed by building code enforcement inspector", "rating": 3}, {"title": "We were applying for a Home Equity…", "text": "We were applying for a Home Equity Loan, but that very quickly became a refinancing agenda instead, without much of an explanation. We also had to wait for a number of days, going into a few weeks to actually receive anything not resembling a task we had to perform. Almost at the last moment we were informed that we had to do some exterior work on our house in order to qualify, so I had to spend some time, effort, and of course money over the course of three days and many hours in the rain to get the job done! In other words we had to spend money in order to receive it. Very discouraging. Also, at times there appeared to be a communication problem within your office(s). Now we are having to make payments at a higher interest rate for a much longer period of time! How is that to our \"Benefit\"? Even after we got the go-ahead on our \"Loan\" we had to attempt to decipher just who we had to payoff. All we were given were acronyms for other financial organizations, plus postage, etc. Not a very easy adventure at all!", "rating": 3}, {"title": "Agents were pleasant but process…", "text": "Agents were pleasant but process delayed because agent didn’t understand that when you have a pension of $60,000 and a mandatory IRA withdrawal of $39,000 annually from a half a million account that means annual income is just under $100,000. Also since loan was to pay off credit cards, having RM send the checks to me by UPS ( they left the envelope with the checks on the doorstep - luckily not taken before I got in) was poor business action ", "rating": 3}, {"title": "Meh. ", "text": "I find it odd that in 2024, Rocket is unable to issue payment for a debt payoff electronically or update the amount after an initial credit pull. I reached out to the loan originator we spoke to first to clarify this and they never bothered to respond at all. Not very professional or helpful. ", "rating": 3}, {"title": "I would have liked a little more…", "text": "I would have liked a little more response from our mortgage person Ali. We dealt with I belive Jake who had to fill in for ger, he was right on top of things. I dealt with Leslie, grat. Just didn't appreciate not hearing back from Ali at 5:15 Friday when I would leave message on Tuesday. ", "rating": 3}, {"title": "This is our third property, first time using RM", "text": "This is our third  loan on a property, I chose rocket mortgage because of the promise of making things easier and faster through technology. To my surprise, this was not the case. In some instances the process was just as long, tedious, and convoluted as going through a traditional mortgage broker. We had a good banker who was on top of the process through the 1+ year it took us to find the right place. The work and professionalism he display was outstanding. When it came to get our final rate we felt like we had to haggle a bit to get the best possible rate, with excellent credit score, consistent and stable income, we would have expected to get the best deal from the get go, and almost pulled the trigger on a different lender… this whole process was very stressful and is not something you expect from one of the largest players in the country. In the end we ended up with a loan and a rate we were happy with, the human interaction where the best parts of rocket, I just don’t think they are disrupting the market with a better process and technology, some time I think technology just gets in the way. They need a better ui, improved mobile experience, and a much simpler/improved process. ", "rating": 3}, {"title": "Not a smooth process. ", "text": "The previous refinance team was very efficient and the process was smooth. This time it was not as smooth as the last one. My closing date was being pushed back a couple of times. To the point where I was told that the May mortgage payment would be covered on the loan. So I didn't make the payment for May, causing it to be late and not being able to get my VA refinance loan because of the late payment. ", "rating": 3}, {"title": "Had to start a new loan", "text": "Had to start a new loan. First one was not correct. Didn’t get the money I needed for the home improvements. Told loan officer what we wanted back. Second loan was corrected the problem, but some how my property insurance didn’t get paid. Until I notified them. ", "rating": 3}, {"title": "Clyde Mataj was a great loan officer", "text": "Clyde Mataj was a great loan officer.  Closing team was so bad I almost switched mortgage companies.  Closing team was accusatory and kept asking for one more thing after I provided them more data.", "rating": 3}, {"title": "Would of rated a 5 star but paper check in the end ", "text": "Great service by Patrick and closing went smoothly. The one major issue I had was that I received a paper check in the mail via UPS and had to forward it to pay off a loan. This part of the process is very poorly executed. There should be an option for Rocket to pay these directly at the time of closing. ", "rating": 3}, {"title": "From equity loan to refinancing ", "text": "I asked for a home equity loan, but ended up refinancing a home that was already paid off. How? I'm still not sure. But in all, I received a great interest rate and the processing time was excellent. There WERE a few things that I wasn't made aware of until after signing, but nothing worth canceling my agreement.", "rating": 3}, {"title": "Fristrating  differences  in what we were told versus what actually occurred.", "text": "Well, we were told that we would receive  approximately  a  1918.00  refund  on our refinanced mortgage  proceeds due to  it improperly being withheld to begin with, and then we were told that we could  have it electronically deposited into our bank account and that  would save the two week period  of getting it back to us, however,  come to find out, all it would do would be to save the mail time  if they had  sent it by  check in the mail.  There were some other  situations  that  bothered me a great deal, but  its a mute point now as it has been completed.  I was very frustrated at times  because of what we had been told, and  what actually occurred. It was not the same, and that is not good for customer relations.  Bob Grafe", "rating": 3}, {"title": "We are still waiting for the loan to…", "text": "We are still waiting for the loan to fund.  We were promised that it would fund on the 6th and it is not.  For all we know; the payment to Bank of America is considered late.  We habw not been notified of any issues amd are in limbo", "rating": 3}, {"title": "Website payment process not working at…", "text": "Website payment process not working at this time. Do not know why the timer is constantly spinning after trying to make my first mortgage payment.", "rating": 3}, {"title": "The loan process itself was great", "text": "The loan process itself was great, Mike was really great to work with.  But we have not received any paperwork or a flash drive with our signed paperwork after completing.", "rating": 3}, {"title": "I completely understand that when doing…", "text": "I completely understand that when doing a full refinance the company needs lots of information and clarification on your home and property. Believe me Rocket Mortgage is very thorough in all they do. It was a little frustrating at times but we worked through it and I’m completely satisfied with all that was done. ", "rating": 3}, {"title": "There was a few things that made it…", "text": "There was a few things that made it frustrating, stressful and seemed unnecessary to make things more complicated.  But in all, a decent quick experience with people good to work with. ", "rating": 3}, {"title": "Closing was perfect", "text": "Closing was perfect! Communication was great during the process. I was disappointed that the interest rate went from 8.5 with a payment of 369.00 to 9.3 with a Payment of 413.00 by the time I closed.  Very disappointed.  My whole purpose was to consolidate and lower my Payment.  Basically my Payment was lowered by a mere 4.00. Very disappointing. ", "rating": 3}, {"title": "Great rates, mediocre service", "text": "Very favorable rate and my loan officer helped me pick the right product. Disappointed with the underwriting process as Rocket couldn’t get the documents they needed in a timely manner and ended up officially closing late due to that. ", "rating": 3}, {"title": "I was told I could change my payment…", "text": "I was told I could change my payment due date at the beginning of this process and after everything was done I was told I just need to make the payment late. I would like to see the date able to change so I don't have to make a layer payment. ", "rating": 3}, {"title": "Trust God! All others verify!", "text": "All went surprisingly fast. I didn’t appreciate being lied to X 2! The Appraisal was more for you than me and I had to pay for it after being told I wouldn’t be paying for that. Your Guy called me excited that his Boss was giving me a 7.4 interest rate! It cost me $8,000.00! I would recommend to new customers to get promises in writing! I believe this could have gone a lot better. ", "rating": 3}, {"title": "I feel like there should have been more…", "text": "I feel like there should have been more options on the payout. I would have liked to give you the account number and address and had you sent it direct to them or had you just wire them a payment. I did not like it being mailed and i was not told this upfront and i just happened to click on a tab to find this out.", "rating": 3}, {"title": "When you listed the companies that…", "text": "When you listed the companies that would be paid off with the extra money from this loan, I assumed wrongly that you would simply mail them a check instead of me having to run around finding invoices and addresses. You have all this, why couldn’t you have just taken care of it? Frances, Who I worked with mostly, was awesome! She answered all of my questions.", "rating": 3}, {"title": "Mixed Results", "text": "Process moved very quickly, but an aborted esigning -- which i'm guessing happens all the time -- lasted an exasperating 45 minutes, with two of Rocket's technicians and the closing attorney unable to help. Then, polite requests from my insurance agent for some elementary documentation went unanswered. A follow-up phone call from me received a similar stonewalling. Felt like we were only the customers until the product was sold. ", "rating": 3}, {"title": "Made me sweat for the best rate.", "text": "Rocket gave me the best rate and there staff were friendly and professional.  On the other hand, my loan was not formally approved until 12 hours before the closing and the cash to close changed $1500 in the wrong direction because of an accounting error (by Rocket) on the initial estimate.   ", "rating": 3}, {"title": "Everything was good except the title…", "text": "Everything was good except the experience with the title company amrock and the closing agent, where there’s room for improvement. They did not give us the deed, which caused us stress and problems with the city trying to turn on the electric etc. The realtor mentioned he has never seen this happen before. ", "rating": 3}, {"title": "Tyler Lovejoy went above and beyond for us. I would give him 5 star anytime as a mortgage broker. ", "text": "Tyler Lovejoy went above and beyond for us. I would give him 5 star anytime as a mortgage broker. The rest of the team had us rushing to sign paperwork for no reason only to have an addendum signed to turn around and say we couldn't gave it signed and it needs to be signed again. Multiple occasions when they would not listen to me or my real-estate agent and we ended up heing right. In the end everything worked out and we are in our home.", "rating": 3}, {"title": "Communication could be better. “Chat” don’t answer questions, just regurgitate what you already say with no answers", "text": "Morning of the closing, I could not get a hold of my broker.. What I thought were imperative questions. No return phone calls for two days. I did finally get answers to some of the questions but was referred back to him or a couple others and still have nothing.", "rating": 3}, {"title": "Needed the loan quickly", "text": "Needed the loan quickly. Rates were higher, we were told that it would be a quick closing it was not.  Hit us with flood insurance at the last minute knowing it was a water front property that delayed the closing more. Every one involved was pleasant and nice to talk to. Just feel it could have been handled better.  ", "rating": 3}, {"title": "Started strong, but last 30 days were not good.", "text": "This is my 4th mortgage with Rocket, which tells you I have had good experiences with them in the past. This experience started strong with the banker as we were house hunting and decided to build a new house (6-month process), but in the last 30 days things did not go well. We had issues with the appraiser having the incorrect contract price, which resulted in an appraisal deficit (in new construction which is uncommon), day-before-closing scrambling asking for addendums for earnest money (could have been done months before), a delay on the final Alta, and my closing date was this-close to being delayed. We were able to close on time after some miracle work from my Realtor, but the stress had already been caused.  ", "rating": 3}, {"title": "Everything was great until we scheduled closing", "text": "Everything was great until we scheduled closing, then 15 minutes before we were to close rocket called and said they couldn’t find someone to do the closing and we would have to reschedule, we were leaving for vacation out of the country and had postponed leaving till later after closing or we would have left 2 days earlier.. the Amrock lady was great and got us set up with a notary and a teleconference lawyer to close later that day in a town close by… while we were waiting at the meeting spot for the notary rocket mortgage canceled the meeting g again.. the notary called me and told me and I said we were at the meeting site so came anyway we called AmRock and they got got in touch with the lawyer  and made it happen.. Tyler and amrock was amazing and 5 stars", "rating": 3}, {"title": "The worst part was piecemeal information", "text": "The worst part was that all communication didn't go to both of us. There were 2 of us on the mortgage and some of the stuff would go to one of us and some to the other. It all either needed to go to just one of us or all of it needed to go to both of us. It was very hard to keep track of what needed to be done when both of us needed separate accounts to finish the process.  That needs to change. We now have 2 accounts for this mortgage and one of them will never be used again. We had problems with things not getting done as quickly as they could have because one of us was in charge of making sure everything was being done, but not all of the information was being sent to that person. The other person didn't realize that both of us weren't getting the same communications. ", "rating": 3}, {"title": "Not the service I expected ", "text": "The numbers for my flood insurance were not added to my closing documents. I had uploaded the numbers to the system, discussed it with the loan processor and my insurance called to confirm the information prior to closing. They never added the final number and the check was never sent to the insurance company causing the account to become delinquent. I then had to pay the full amount out of pocket and wait 30 days for coverage after waiting 30 to find out the check was never sent. I emailed Alma and was told since I don’t need the coverage they don’t add the premium unless requested (although it was). I responded, I had requested it and we even discussed it and I have not received an email back since. I suppose the best way to handle the situation is to ignore it. Also, I was completely unaware that I was going to be paying 4K for points to lock in a rate of 6.99 when I work for a bank and could have gotten 7% with no points. ", "rating": 3}, {"title": "Origination/Approval ", "text": "The process was long and my monthly amount increase by approximately $100. I was fully transparent about a bill that was in dispute and it seemed to have been disregarded. ", "rating": 3}, {"title": "The closer guy missed two documents…", "text": "The closer guy missed two documents that they then had to send us and that delayed our receiving money several days. Other than that it went well. ", "rating": 3}, {"title": "I have been a Rocket Mortgage client…", "text": "I have been a Rocket Mortgage client for many years.  I wanted to get a home equity loan, but without even discussing it with me, I was in the middle of a refinance.  I didn't appreciate how that happened.  I asked about it, and was told this was the best thing for me.  I think I should have been the one to make that decision.  i feel like I was somewhat railroaded into the refinance.  ", "rating": 3}, {"title": "There were many instances where the…", "text": "There were many instances where the Rocket Mortgage staff dod not communicate well, asked me for items that they had already received, and delayed the process.", "rating": 3}, {"title": "Everyone was super helpful and nice", "text": "Everyone was super helpful and nice. Only complaint is there ended up being 2 appraisals and we got charged for both, which we were told would not be the case ", "rating": 3}, {"title": "There were clogs in the system", "text": "There were clogs in the system. Your reps weren't doing their job timely.  Had to constantly make phone calls and send emails.  Because of this we closed 3 weeks after anticipated.  The only thing that went smooth was the closing.  I even called the closing team for a copy of my signed papers.   Still waiting ", "rating": 3}, {"title": "Things started well then too many…", "text": "Things started well then too many people got involved and things git forgotten. You get a 3 because Candace in the end heard us and did something!", "rating": 3}, {"title": "I was under the ipression that you…", "text": "I was under the impression that you were directly going to pay off my accounts not sending me a pile of checks to sort thru and become late by the time they get through the mail ", "rating": 3}, {"title": "Who makes the DECISIONS ?", "text": "This is my Mortgage Loan experience. The website was difficult to negotiate. I disliked you deciding to cut a $25K check being cut without my consultation to payoff one of my creditors. The overall experience was not the \"Best and Rather Unfavorable\" compared to my Original Mortgage. ", "rating": 3}, {"title": "Everything went good", "text": "Everything went good. A few things missed throughout the process but was fix ed fast. I was disappointed on how long the process took. Overall I am satisfied ", "rating": 3}, {"title": "50/50 ", "text": "You guys did good, but i really wanted to use my VA loan. Ive talked to people who do VA loans and showed them all the paperwork. They are saying that you guys were wrong and i could have used my VA loan and wouldn’t have need to refinance my van or get a down payment. Kinda pissed about that. To later now, but the people that were here before were hiding something very bad that wasn’t noticed by inspectors. The whole under the house is full of water. Because now the house is sinking and the water bill is going up. I just dug over by the rear water hydrant and up against the house and i just opened the flood gates. I wish someone would have checked under the house. Now im probably going to lose this house, because no one looked under it. ", "rating": 3}, {"title": "I got the money", "text": "I got the money, that's good, but you continuously listed the address in the wrong town, even after I told you at least 3 times that it was wrong and gave you the correct address:538 N Wildcat PlaceBENSON, AZ 85602NOT:538 N Wildcat PlaceMESCAL, AZIt's in Benson, NOT Mescal", "rating": 3}, {"title": "Stick with it! It will have a good outcome!", "text": "Some of the associates were pleasant and very helpful! Some seemed they were being bothered by questions.", "rating": 3}, {"title": "Overall Good", "text": "The overall experience was good. The initial process was outstanding dealing with the representative setting up the loan. The portal used for communication is also excellent. However what is very frustrating was dealing with their affiliate as the title company. That part of the process was a very frustrating. The repetitive request and miscommunication from title company was terrible. After getting to far in the process we found out that we could have chosen our own title company instead of using their affiliate in Detroit. I would recommend getting a local title company in your area.", "rating": 3}, {"title": "It was annoying ...to receive emails…", "text": "It was annoying to receive emails claiming we are almost there for 6 weeks. \"We need a another....\"I recall this last time  Not sure if I'd recommend to a friend ", "rating": 3}, {"title": "Here's why the \"3\", why that is a generous rating", "text": "What's wrong:*Timeline to get to closing and to get the equity funds deposited to our account. WE had to completely redo our plans because of the delays.*The whole process seemed aimed not at helping me, but to get the most interest and money to someone else's pocket; I felt very used -- extorted --; to put more money in to someone else's pocket, and then I have to pay (in the interest) to put it there. .*last-minute disclosure that We would have to travel over nine hundred (900!) to sign the closure documents. Very costly, inconvenient for us; and antiquated!!!!!I am not shooting the messenger.  The up-front folks trying to get things moving were outstanding.  It's was the behind-the-scenes bureaucracy; seeming to prolong closing by introducing different documents and asking for different information -- information you should have already had, since we have had our mortgage with y'all since 2016.  This should have been a simple refi with equity cash out, and with payments about the same as I understood when we first started (You weren't in danger of loosing any money!). Instead, the behind-the scenes people treated us like we were unknowns to them. We had to start completely over, it seemed, with a new mortgage with an unknown mortgage company. You have come a long way, downhill, from the refi experience we had in 2016. I am VERY disappointed.", "rating": 3}, {"title": "Mixed review ", "text": "The initial process was smooth - my agent disappeared and became unreachable - options around interest rate and guidance were non-existent.Performing financial transactions could be stressful and the process or lack of communication didn't help.Guidance on payment and how to quickly pay it off shoukf be discussed ", "rating": 3}, {"title": "Don't recommend if consolidating debt", "text": "My biggest disappointment with my HELOC/Cash-out Refi was upon choosing to consolidate debts, rather than Rocket directly mailing a check to the debtors, they mailed the checks to me, then I had to go to the post office and mail off the checks to the debtors myself. This is ridiculous. Additionally, they used the amounts that were listed on my credit report.1. Credit reports are never up-to-date.2. A total of 2 months had passed from the credit report check until I received the checks to mail off. As you can guess, the amounts changed. 2 of the debtors had a balance of $0 while the rest were considerably less. So now I am dealing with trying to get refunded the overpayments. My suggestion would be for Rocket to contact the debtors themselves the day that they plan to print the check and send it themselves. Better yet, SEND THE PAYMENT ELECTRONICALLY!!!! Who still uses snail mail?? While everyone that I have come in contact with at Rocket has been exceptionally pleasant to talk to and/or work with, I would never again choose Rocket when doing any kind of debt consolidation as their process is very outdated and cumbersome. ", "rating": 3}, {"title": "Delay in responsiveness ", "text": "Once we decided to proceed with the loan we didn’t get quick responses and was totally disappointed in the appraisal, way below what homes like are are selling for.  ", "rating": 3}, {"title": "Rocket/Amrock Review", "text": "This is hard for me to rate and 3 stars is too low for Rocket Mortgage and waaaay too high for Amrock and the closign experience.  Don Bishop and his team at Rocket should be given a 5 plus for their professionalism and Amrock not stars if possible.   Title company was lost and have no idea why we were there.  After the lady in charge figured out why we were there she printed off the paperwork, took us in the closng room and left.   I was under the impression when you signed something the Notary needed to be there when you were signing.   She did come back after about 10 minutes and stayed throughout the rest of the signing.   She made the comment that she hoped we had read the contract because she was not allowed to explain anything to us.    Maybe that is the way 3rd party closings are but that was not explained to us.    We were told by the closing team that we would receive the fund 3 days after closing and would have our money Tuesday and Amrock did not follow up on the paperwork being sent to them from the Title company.   We ended up getting our money on Friday which was not the end of the world but were told that Amrock had received the paperwork on Tuesday and when I called again Wednesday they said the same thing.  I called Thursday and the lady informed me they had not even received the paperwork yet.  I will say the last lady I talked with at Amrock was very professional and helpful.  So overall 5 Stars for Rocket and 0 for Amrock .   ", "rating": 3}, {"title": "I believe in Honesty and tranceparency …", "text": "I believe in Honesty and transparency  which is why I went with Rocket Mortgage..I did not receive this !!", "rating": 3}, {"title": "All of the Rocket Mortgage agents were…", "text": "All of the Rocket Mortgage agents were great. The process for getting the 2nd mortgage took too long. Lots of snailmail, with home insurance delays and checks.", "rating": 3}, {"title": "Loan was fine too many mortgage protection calls & mailings", "text": "Loan was fine, but after closing, WAY too many phone calls and mailings from mortgage protection insurance marketers!!", "rating": 3}, {"title": "Ashley was great and the best during…", "text": "Ashley was great and the best during the application process. The underwriters is an opportunity for improvement. Not excepting a state issued identification for proof of residency, that expires in 2026 is stupidity. This was just one example of several. State healthcare documents had to be push above the underwriters position to get them to accept. ", "rating": 3}, {"title": "VA guidelines", "text": "I am pleased to be able to re mortgage with Rocket Mortgage. I Am although upset with several factors. First I was told to achieve a 620 score in which I was able. And then I was told that the VA changed it guidelines 2 years ago to 640. So before I could move on I had to achieve that. So I borrowed money to do so and achieved a 659. So it went back to the table to be approved. Than someone said I had to have enough money in my account to cover my first payment which is ridiculous because after I signed closing papers I could have pulled the money out. So a long story short we should not be making up guidelines as we go. We should follow what is in place and treat everyone equally and follow protocol. If the VA has certain guidelines in place you should know them and follow them.", "rating": 3}, {"title": "Misinformation ", "text": "I was told my wife didn't have to be present. She signed a form required ahead of time.  The day of the closing. The Notary informed me she had to sign documents and her presence was required. ", "rating": 3}, {"title": "Easy process nice folks but the banker…", "text": "Easy process nice folks but the banker quoted me 5k over what we got back in cash out at closing. Kinda disappointed but C'est la vie.    ", "rating": 3}, {"title": "I wa never told in what way the checks…", "text": "I wa never told in what way the checks for my creditors were coming.It caused an unnecessary delay", "rating": 3}, {"title": "in the first place i was gthere may not be another timeoing to get 2…", "text": "in the first place i was going to get 2 mo. with no payment which was post phoned twice that mesed my finances. then i was told that i will get a rebated fore appears payment. that has not happened i was told that it would be in my check. that did not happen.  it appears that you have very little concern as to those actions on my finances, thank you very much for that lack of concern.  need i go on?", "rating": 3}, {"title": "When I asked about equity loan", "text": "When I asked about equity loan, I was told Refinancing was better. Heloc was not mentioned. Check I received was not as much as was told I would get.", "rating": 3}, {"title": "it took many steps or unexpected errors…", "text": "it took many steps or unexpected errors to accomplish to a closing day but thanks anyway ", "rating": 3}, {"title": "Having to mail pre-written checks have…", "text": "Having to mail pre-written checks have still not reached businesses while I could have paid online", "rating": 3}, {"title": "It was all right", "text": "Well, when I first started this process, I was given an interest rate and then the next day it changed and then a week later it changed again I kept going up and then I was told very from the get-go this would take about two weeks to do it was a little over a month to get it all done", "rating": 3}, {"title": "I got 4 solicitations in the mail…", "text": "I got 4 solicitations in the mail YESTERDAY for insurance on the loan. Would rather you wouldn’t have sold my information. ", "rating": 3}, {"title": "Items that had already been sent as…", "text": "Items that had already been sent as conditioned for double and triple times. Rather than put the fire out it appeared to be keeping it going", "rating": 3}, {"title": "How desperate are you to get a mortgage? Think twice about Rocket!", "text": "I hope this is the last one of these you ask for! I am tired of answering the same questions over and over. Moving forward I will simply say RM sucks! My initial contact was great. Pete made things simple and helped me understand things more clearly. After he passed me to the next person - I don’t recall her name because she was horrendous- argued with me and insisted I HAD to escrow insurance and property taxes, when I had a question she would just give me another persons email or phone number to contact (isn’t her job to do the footwork for me - the paying customer? I knew more about mortgages than she did! She had different closing dates in her emails which then required me to keep changing my HOI effective date AND cancel a doctors appointment that took over 2 months to get when in the end, none of the dates she provided were accurate. Mike replaced her and I was able to get the help I needed. Once a closing date was set, apparently I was the only person that knew - nothing had been communicated to the title company, the realtors or the sellers until a few days prior to RMs close date - how does that happen? Lastly and only because the more I think about the process the madder I become - I set up auto-pay on the RM portal last night, only to see that you still showed my previous address as my mailing address. Really? You just loaned me money to buy a home and you can’t even have my address correct? And that is after I corrected it when I reviewed my closing docs prior to closing. Speaking of which, the closing docs were wrong - not only did you have the wrong mailing address you showed that I still had to pay for HOI - which you already had proof of payment. I will stop here. ", "rating": 3}, {"title": " When I started this process I was told…", "text": "When I started the process I was told it would be done in a certain amount of days. And I explained that my lung was due on that day. I got the money 4 days. After the loan was due. ", "rating": 3}, {"title": "Coordinating is poor.I had to request…", "text": "Coordinating is poor.I had to request and get most of the documents they could have done.Timelines does seem to matter.", "rating": 3}, {"title": "All of the qualifications were met or…", "text": "All of the qualifications were met or exceeded yet rocket found ways to charge me more interest than originally proposed in their quote. The first person who called me gathered information from me and sent me onto a banker with the end result of a loan with interest more than a half a point higher than originally quoted. When I asked about this, the banker was not able to find a recording of the original quote or any documentation to support it. The first appraisal of my property came in $70,000 under market price which led to confusion and delay as I had to make a request for a review of the appraisal upon review the proper value of the home was established. When I asked my banker, why they did not honor the original quote he said his supervisor provided information that prohibited honoring that because of a 5% rule which I didn’t fully understand other than it sounded like a big excuse to not honor their really original quoteI went to rocket mortgage as I had two previous mortgages with them, which were great so I was extremely disappointed in the actions they took and handling a repeat customerI plan to pay off the loan or refinance as soon as the economics makes sense.", "rating": 3}, {"title": "I'll start with saying my initial…", "text": "I'll start with saying my initial interaction with Rocket with Max made me want to go with Rocket mortgage right away. He was personable and knowledgeable and made it easy to reach out with any questions or concerns. I had issues however when it came down to getting mixed messages regarding being approved for my loan. I had gone through a divorce and there were some questions whether I could be approved for my mortgage without being taken off my previous one even though my divorce documents clearly relinquished me from any responsibility for that mortgage. Another mortgage company didn't even bat an eye at approving me and I had to use their approval to get my mortgage moving forward with Rocket with Max's assistance.Unfortunately once I was approved I moved to the next person who wasn't nearly as helpful and messed up my closing documents twice. He wasn't nearly as available for contact and didn't seem to be as knowledgeable. Going through this whole process was incredibly stressful with the back and forth regarding being approved and buying a house is already a stressful process so it's unfortunate I had to have this extra stress added on when other mortgage companies didn't have any issues with approving me.", "rating": 3}, {"title": "The communication Wasn’t good compared…", "text": "The communication Wasn’t good compared to the first loan I had with you years ago calls went unanswered, but the representative told me was gonna happen not a few times in the process", "rating": 3}, {"title": "I really liked Elizabeth the first…", "text": "I really liked Elizabeth the first person I dealt with.  But, then was passed off to someone else who wasn't as good then passed again.  The handoffs were not smooth or helpful.", "rating": 3}, {"title": "Initial application process was smooth", "text": "Initial application process was smooth, got a little rocky when it came close to closing.", "rating": 3}, {"title": "HAPPY THAT IT'S ALL OVER", "text": "My initial encounter was all I could ask for and a little bit: encouraging, clear instructions, excitement and anticipation. But I soon became disillusioned and regretful; and labored through the remainder of the process.", "rating": 3}, {"title": "The process  mortgage was very hard and for us…", "text": "The process was very hard and for us older people the having to do it all online made this whole process a nightmare for me I’m glad I will not have to do this again now that I have a 30 year mortgage because I never want to be stressed out like this again.", "rating": 3}, {"title": "Everything went well", "text": "Everything went well. The only problem I had was with the underwriters about my job a d the delay that caused.. I missed out on other things I had planned out because of the delays !!", "rating": 3}, {"title": "The process could be better.", "text": "The process took too long. I went from one person for about a month and then to another person. But overall, we made it through.", "rating": 3}, {"title": "closing dates", "text": "Timeline on closing date was way off. I was getting money back and this messed up my plans, caused me to lose money on a item I put a payment on to hold.", "rating": 3}, {"title": "Not happy with the process ", "text": "I feel like I  was rushed through the process and I wasn't given enough time to think about it.  I'm still having doubts, but it's too late.", "rating": 3}, {"title": "They were disorganized", "text": "They were disorganized. They didn't communicate among themselves to verify final figures for closure. They gave conflicting instructions. ", "rating": 3}, {"title": "your company did not do as i requested", "text": "your company did not do as i requested, the from sell did not make it to the new loan, and was sent to me.", "rating": 3}, {"title": "Requested too many documents", "text": "Requested too many documents. Yes then no. This will work no changed our mind we need more. To wish washy.", "rating": 3}, {"title": "Easy Process", "text": "Easy process and was completed within a couple weeks of starting the process.", "rating": 3}, {"title": "One check I received i have no clue who…", "text": "One check I received i have no clue who it is.  The checks I received ask for account numbers not sure what to do.", "rating": 3}, {"title": "Everything was great till the mishap on…", "text": "Everything was great till the mishap on closing day. Would have loved to give a 5 star. Things did get fixed in a week but that’s why I’m giving it a 3 star", "rating": 3}, {"title": "The rep was really nice but wrong…", "text": "The rep was really nice but wrong information was given. ", "rating": 3}, {"title": "Took longer then told it would and rate…", "text": "Took longer then told it would and rate was a little higher then expected. Will shop more when rates drop", "rating": 3}, {"title": "I wasn't told I had to mail out checks…", "text": "I wasn't told I had to mail out checks to creditors myself. ", "rating": 3}, {"title": "To many things you have to keep doing", "text": "To many things you have to keep doing! I was borrowing 60000 on a 400000 dollar house ", "rating": 3}, {"title": "The last minute requirements that they…", "text": "The last minute requirements that they say are needed to close. Need to improve on this!", "rating": 3}, {"title": "average", "text": "constant changing of \"points\" added to the loan. Not happy. ", "rating": 3}, {"title": "Communicate needs to be more clear and…", "text": "Communicate needs to be more clear and concise. ", "rating": 3}, {"title": "They over complicated issues", "text": "They over complicated issues, and I provided documents multiple times", "rating": 3}, {"title": "Not returning calls is a real problem!!", "text": "Date of experience: May 31, 2024", "rating": 3}, {"title": "2nd loan", "text": "Easy company to work with, I was not a fan of the closing costs. I feel most could have been avoided.", "rating": 3}, {"title": "$8000 in closing  cost was extreme.", "text": "$8000 in closing  cost was extreme. ", "rating": 3}, {"title": "I didn't like the false ads stating…", "text": "I didn't like the false ads stating cheaper loans...but it is what it is  ", "rating": 3}, {"title": "It took to long and you didnt update the payoff amount of checks being issued now i need to wait to get refunds on the overpayment", "text": "Too long a process and never recieved copies of documents", "rating": 3}, {"title": "I disliked the repeated requests for…", "text": "I disliked the repeated requests for the same information and the constant pestering of my employer to verify my employment (3 times)", "rating": 3}, {"title": "I was initially told the costs on a…", "text": "I was initially told the costs on a second mortgage were about 2600.  Ended up over 3600", "rating": 3}, {"title": "The process the closing .it was…", "text": "The process the closing .it was terrible.", "rating": 3}, {"title": "No extra discounts to help me with my…", "text": "No extra discounts to help me with my loan", "rating": 3}, {"title": "I didn't like the cashiers checks that…", "text": "I didn't like the cashiers checks that had to be sent out, what a pain.", "rating": 3}, {"title": "Lengthy ", "text": "It took over 60 days to close on my refi. and I feel that was way too long", "rating": 3}, {"title": "Time line was too long", "text": "Date of experience: October 13, 2024", "rating": 3}, {"title": "I had to do most if not all of the foot…", "text": "I had to do most if not all of the foot work ", "rating": 3}, {"title": "Miscommunication on closing info and…", "text": "Miscommunication on closing info and time frames", "rating": 3}, {"title": "to many hands,like to deal with less…", "text": "to many hands,like to deal with less reps", "rating": 3}, {"title": "Not a good experience overall", "text": "Not a good experience overall ", "rating": 3}, {"title": "Working with green inexperienced", "text": "Working with green inexperienced; not very knowledgeable ", "rating": 3}, {"title": "All the leg work and $$$ I had to spin", "text": "All the leg work and $$$ I had to spend ", "rating": 3}, {"title": "It took to long to close loan", "text": "Date of experience: May 28, 2024", "rating": 3}, {"title": "took over 2 months to close", "text": "Date of experience: July 06, 2024", "rating": 3}, {"title": "Rate was too high!", "text": "Date of experience: May 19, 2024", "rating": 3}, {"title": "Everything was fine", "text": "Everything was fine ", "rating": 3}, {"title": "Well done", "text": "Very well done", "rating": 3}, {"title": "I did not like having to mail my own…", "text": "I did not like having to mail my own checks to my creditors. Getting all the information needed took  me so long. Cost to mail them was a lot. $9.85 to mail one check (preferred mail) just to make sure nothing got lost. The last time I did a refi. everything was done for me. It was quick and easy. Diane Gieler", "rating": 3}, {"title": "All good except one main point reason for…", "text": "All good except one main reason for mortgage was to have enough money to pay state and federal taxes. Everything else was fine. Esite was difficult to upload files and kept one invasive question wlwhich was never answered but stayed on esite. Web page was frustrating throughout process", "rating": 3}, {"title": "some information needed for closing was…", "text": "some information needed for closing was not clearly provided. ", "rating": 3}, {"title": "Liked it was on internet I did not like…", "text": "Liked it was on internet I did not like it because they sent us to non existing title company and after two weeks rocket still has not paid credit cards off???!", "rating": 3}, {"title": "It was the worst house buying experience ever. ", "text": "It was the worst buying experience ever. Every time I turned around there was a document to sign or I had to get several ppl to sign. It was ridiculous. I've bought three houses in my life and this one was the worst experience I've ever had. I'll not recommend Rocket Mortgage again. ", "rating": 3}, {"title": "The secondary team I dealt with needs…", "text": "The secondary team I dealt with needs customer service training again.  Also just received mail from you sent to my investment property address not my physical address as indicated when applying for loan.  Anthony was exceptional my 1st contact with Rocket Mortgage ", "rating": 3}, {"title": "I do not want paperless", "text": "I do not want paperless. We got statements before.", "rating": 3}, {"title": "Meh   Shop around ", "text": "Our agent was decent but there were lots of last minute needs to resubmit paperwork   The rest of the team was slow to respond   We are still waiting on a refund of the auto pay mortgage that came out   It would have been nice to be told to turn that off   Rocket also didn’t credit us a discount on closing costs like is  advertised ", "rating": 3}, {"title": "SLOPPY", "text": "ALL BILLS WERE NOT PAID,I HAD TO PAY OFF THE BILLS AND  I'M NOT SURE I SENT THEM TO THE RIGHT ADDRESS", "rating": 3}, {"title": "Great", "text": "Great originators like Cass Hart, but invasive prompts again and again in emails for “to-do” already done, then surprises at the closing: pre-paid interest not previously mentioned (and an oxymoron) and 2 new options for disbursement: a check (no thanks!!) or a wire transfer geared to basic bank checking accounts, not the Fidelity brokerage trust account with very different hurdles to pass over. Natalie as a stand-in for Cass sent a link saying we were out of luck, but fortunately a women at Amrock said no worries: Fidelity brokerage wires are done all the time!!!!!", "rating": 3}, {"title": "The process was pretty easy to complete…", "text": "The process was pretty easy to complete remotely. Andrew B was the best! He was there every step of the way and answered any question I had. Even after his job was done. Thank you Andrew!Our underwriter however was awful at communicating. I had to pull information out of her. And Rocket did not accurately calculate our states property taxes by several thousand dollars, making our monthly house payment unnecessarily high by a couple hundred dollars per month. Making it smarter to go with a local lender that is familiar with local tax rates. ", "rating": 3}, {"title": "The loan process from start to end was very easy.", "text": "The loan process from start to end was very easy and straight forward. However, paying off the credit cards has a lot to be desired. You sent me the checks made out to the credit card companies with instructions how to handle them which caused much frustration and worry.  It would have been much easier if all the monies were sent to my checking account allowing me to electronically disperse the monies to the credit card companies.", "rating": 3}, {"title": "Didn't expect all the fees that I was…", "text": "Didn't expect all the fees that I was charged and got back a lot less than expected ", "rating": 3}, {"title": "Don't want to go through this again. ", "text": "There is too much asking the same questions over & over. If the income doesn't meet your criteria or fit your mold there is VERY little flexibility.  The convenience of the website is good & time saving.  My banker was sympathetic but very little he could do & it seemed like he was caught in the middle.  I felt bad for him. ", "rating": 3}, {"title": "Communication was not great", "text": " Communication was not great. Now none of my information is available on the app as I was told it would be. I received 24 emails in the 2 days before closing even though I had nothing in my to do list in the app. ", "rating": 3}, {"title": "The agent for our VA refinance did NOT…", "text": "The agent for our VA refinance did NOT disclose the VA Finance Charge until the very end toward closing! He’s a supposed specialist in VA financing. Very disappointed! If he’d explained this from the beginning there would have been no issue. ", "rating": 3}, {"title": "The Florida Home", "text": "Braden Walter was amazing.  Very professional and was always advocating for us.  He walked us through the process start to finish.  Was always available when called or text.From there on it was a disaster.  The underwriters have no common sense.  They would ask for proof of something and then we're told it wasn't good enough.  A total disaster from our point of view.  I know the country as a whole has lost common sense and that was evident with the underwriters.", "rating": 3}, {"title": "Post closing you will drown in junk mail", "text": "Closing process was fine. What is HORRIBLE is getting 42 urgent pieces of mail after closing clogging up your mail box and adding totally unnecessary stress at a very stressful time.STOP selling your customer information to everyone!", "rating": 3}, {"title": "If Time is Money, I paid too much", "text": "Timelines were not met. Closing date appointments were not honored after making them. Everyone was very nice and cordial but I had to get involved on a couple of occasions where it seemed like I was doing someone at Rocket Mortgage’s job.", "rating": 3}, {"title": "I AM NOT HAPPY", "text": "I AM NOT HAPPY.   It was a bad policy to send ME the written checks to send to the companies I was paying off from my refinance.   I mailed EACH ONE by priority mail and it still took over a week to get to the company.   I have spent hours on the phone trying to figure out WHEN these payments will be posted. MEANTIME, I have accrued late fees, interest and spent $120 to send priority mail. I'll never do this again.   I would insist on having the $$ deposited into my checking account and I could immediately pay them all on the internet...   ALSO... I am told that the checks were in such a high amount they have a hold onto some of them until MAY 16th..l. GOOD GRIEF.....   this loan has ended up costing me about $400 and resulted in one company LOWERINg my credit limit from 2500 to $2000.... I have never paid late to ANYoNE and yet THIS has cost me too much money.   ", "rating": 3}, {"title": "Did not return calls consistently", "text": "Did not return calls consistently. Their, will have an answer for you tomorrow never happened. I would ask to explain something they said, but afterwards I still didn't understand their explanation, actually they confused more. I told them it didn't make any sense, and I would see if my husband could explain it to me. 4/16-17/2024 were the last ones. Mary Lovato", "rating": 3}, {"title": "process was long", "text": "process was long, They send you the checks instead of just sending them to the places they go to", "rating": 3}, {"title": "I was told by the ROCKET MORTGAGE…", "text": "I was told by the ROCKET MORTGAGE representative that paying off all of my credit cards would be included in this refinance. All were not included.  And, it was difficult and confusing to mail out all the checks, especially the payment to Rocket Loan. Rocket should have been able to handle this payment directly. Disappointed with the transaction.  ", "rating": 3}, {"title": "Average", "text": "Average 3stars1. Took longer than expected to close due to last minute changes and requests which could have been addressed up front and sooner.2. Rates and fees are higher than average vs. competition with no identifiable customer benefits.", "rating": 3}, {"title": "The process for a refi was extremely…", "text": "The process for a refi was extremely slow. Took over a month,which had us paying extra payments to credit cards. The checks for the credit card payoffs were poorly printed and did not match what we owed. ", "rating": 3}, {"title": "Ineffective Handoff and Communications ", "text": "The Rocket team needs to do a better job of understanding when communicating something is urgent or an emergency. There were multiple instances where (1)  I was told I would be called and then not called by whichever Rocket representative said they would call me, (2)  asking me to communicate to my broker and the attorney representing me that my loan was at risk of not closing on time because they were not familiar with the state of Illinois title process finalizing 1-2 days prior to closing and (3) making misguiding statements and then trying to gaslight me with a completely different set of statements made to me. In an ATT to misrepresent what they said. This process was very frustrating ", "rating": 3}, {"title": "Fast precise answers", "text": "Fast precise answers, and following up on loan. What was disturbing was I just wanted a small 2nd Mortgage on my house. The salesperson tried to be coy and tricky and tried to push a full Mortgage deal. Got upset on the phone call and had to state if you I don't get the type of loan I want I am pulling the deal. She did transfer me off to the loan officer but it was several hours of work on my end to get a simple 2nd for 60k. ", "rating": 3}, {"title": "There were a few nerve raking moments", "text": "There were a few nerve raking moments. In the end it all came together. But I spent an extra $400 to get it done. ", "rating": 3}, {"title": "How to treat a customer", "text": "I would have rather had 1 individual to deal with.  It appeared that everytime that I had a qustion I was directed to a different individual.  I signed off on several documents at the first meeting but kept being directed back to those documents, even though they had already been signed.The most negative issue I had was the arrangement with the closing proces, that individual was totally negative about being flexible for arranging that proces.", "rating": 3}, {"title": "Having to resubmit same documents…", "text": "Having to resubmit same documents multiple times.  Having loan rep making decisions for debt payment without approval and having to remove after fact.  Correspondence between Rocket mortgage reps was slow ", "rating": 3}, {"title": "We needed a bit more money back and the…", "text": "We needed a bit more money back and the appraisal was wrong...", "rating": 3}, {"title": "In the beginning all calls and…", "text": "In the beginning all calls and questions were answered quickly . As it got closer to closing that time frame became longer and longer .I was also told that before any pay out checks were issued I would have a chance to update amounts that needed to be payed out and/or changed to different accounts.I told Ali Shahin about the difference amounts due to payments that were made and a couple of reoccurring charges. I was told to submit new statements which I did before closing on the loan.After closing there was no attempt to correct payout amounts and all checks were issued for wrong amounts. ", "rating": 3}, {"title": "If it was 100% electronic it would be a 5 star process.", "text": "The entire process was fast. The home inspection was easy and painless. All the documents for the closing were handled electronically. If it could have all been handled electronically, it would have been a 5 star adventure. Since part of the money for my mortgage were going toward paying off bills, Rocket sent the money for the creditors in the form of pre-printed checks.  This required me to create paper copies of my account statements, that had previously always been communicated electronically, so I could mail the checks to the companies via snail mail.  What a huge negative ending to such a positive beginning. ", "rating": 3}, {"title": "I probably should rate this at lower…", "text": "I probably should rate this at lower than 3 stars, but Elizabeth got us over the finish line by actually listening and coming up with solutions to otherwise arcane requirements. The fact that a physical appraisal was required for a small equity loan was an is ridiculous. It not only delayed the process but also created significant inconvenience. If there was a good reason for it that would be understandable. But the reality is that Rocket owns the appraisal company and this earns additional revenue. Totally unacceptable! In addition it’s beyond comprehension that they don’t offer a HELOC. ", "rating": 3}, {"title": "Fees are insane", "text": "Fees are insane. You don't make enough money off the interest so you charge huge fees that after I researched just seem to be an overreach.  In the future I will be more careful about my mortgage. ", "rating": 3}, {"title": "Since our ", "text": "Since our home was paid so hard to get equity loan. Using another company to pay off visas was not acceptable. We had  paid off some little amounts but they sent us checks to mail off. Too this date some have not credit us yet although Sent checks out same day. What happened to direct payment to visa. Also with Rocket talked to so many doff e rent people not good no wonder you have so many charges T closingWe used Rocket before no badexperience but this time terrible.", "rating": 3}, {"title": "Serious omission ", "text": "Not until our closing disclosure were we told that our closing costs would include paying off a debt. We had discussed the amount we wanted to put down, and then we when we received our disclosure, Rocket had tacked on several thousand dollars in cash-to-close to pay off a debt we had. They NEVER told us this would be part of the fees until the week we closed and received the disclosure. We had three people during the loan process and not one of them told us we would need to have $9k to pay off a debt. We are lucky that we had the money to pull when liquidizing assets, and it benefits us to pay it off, but it’s awful that they did not make this clear until we read the disclosure and saw it, and our title company provided clarity. Otherwise, the process was pretty smooth and most hang ups were from other institutions. ", "rating": 3}, {"title": "Please stop sending the check  payable …", "text": "Please stop sending the check  payable  to debtors to the customer. Technology is advance enough where you could handle this through wire. You would have gotten 5 stars if  it wasn’t for this. ", "rating": 3}, {"title": "I didn’t like not having one sole…", "text": "I didn’t like not having one sole contact person. It was a very systematic experience, not human. Particularly, when trying to call someone, they were always busy with other customers. However, the loan conditions were better than other lenders.", "rating": 3}, {"title": "Unexpected difficulties", "text": "Overall, we did get our refinance done. Not as quickly as it should have taken. Everything up to closing went great other than having to have two appraisals done which we were not informed about in advance which caused a delay and extra cost in closing. Once closing arrived we noticed that we would be paying off our daughter’s car loan and not our personal loan and they couldn’t get the exact current payoffs for our credit cards added into the loan. We told them the exact current amounts owed on each credit card, but since it wasn’t shown on our credit report there was no help with those amounts. Because of this we had to extend the first payment date for the loan so we would personally have enough money to pay those credit cards off ourselves which cost us extra in interest payments added into the loan. Lastly we had to have an in person notary for the closing because the online closing couldn’t recognize us based on our answers to their questions based on prior city’s that we were not affiliated with and questions about different automobiles that were also incorrect. Not sure where they get their information from, but it might not actually apply to you. So we were unable to do everything online which pushed our closing date back another 5 days. At least they can still do an in person notary. After all of that, we got our loan and are hopefully in a better financial position. ", "rating": 3}, {"title": "There were a lot of hiccups in the…", "text": "There were a lot of hiccups in the process. It seemed to be on the Amrock end but it still caused a delay in receiving our money and instead of paying off debtors directly, paper checks were mailed to us delaying debt consolidation even further. I feel like we had to put a lot of work into this process that we shouldn’t have had to do. ", "rating": 3}, {"title": "The whole process took over a month and…", "text": "The whole process took over a month and I wasn't informed on updates and the app didn't update on time.", "rating": 3}, {"title": "Interest Rate and Closing Date", "text": "Make sure you understand if rate quoted is true or a buy down rate.  I thought mine was true and was not. Our closing date seemed in jeopardy up to the very last minute because of the way rocket handled things.  Very stressful experience.  Rocket great on front end but we felt like we were falling thru cracks at the end.", "rating": 3}, {"title": "Rate change last minute and no…", "text": "Rate change last minute and no communication toward the end and I have to find out rate bump myself . That is a bad taste in the mouth.", "rating": 3}, {"title": "Miner issue ", "text": "Parts of the experience was great. The man helping with the loan did an amazing job. But us continually have to show more of our assets when our assets are worth more than the loan,  was a little frustrating. I understand it is a process but it could have went smoother if they had not been an issue.", "rating": 3}, {"title": "Should’ve been better ", "text": "Credit rebuild in the beginning was great. Ryan Cash was super helpful. After that communication failed. Our rep left, we didn’t know. Very unresponsive and many of our items were forgotten about. A lot of things were done twice. Closing was easy and relatively quick. ", "rating": 3}, {"title": "Had to provide same documents ", "text": "Had to provide same documents multiple timesThere was a social membership included on the first set of closing docs received. We questioned what that was and were told they would give us the info. Didn’t receive any info on it. It was excluded at closing w/o approval. Now we find out we can’t get it after closingSo now we can’t use golf course or restaurant facilities in the neighborhood we live in.", "rating": 3}, {"title": "The communication level wasn't really…", "text": "The communication level wasn't really there.  Never really knew who to contact with questions Our mortgage specialist never called to check on things.   Not the experience we had with the purchase of our home 2 years ago.   ", "rating": 3}, {"title": "The experience until the closing…", "text": "The experience until the closing process was great.  Due to a glitch in the system, the closing was rescheduled and I did not receive funds on time and as a result had to pay wire transfer fees.", "rating": 3}, {"title": "Disappointed in the process", "text": "Disappointed in the process. Felt rushed and too many points of contact.  I didn't realize rocket does business in a team format. Which is helpful for you not so much for the consumer.  Information gets missed and miss managed exchanging so many hands.  This whole process felt robotic. I've bought you previous properties and it was alot more smoother.  I didn't like the fact Information got changed at the last minute and I was not notified.  Please do better.  The only person that was good was Brian ", "rating": 3}, {"title": "Dealt with way too many people ", "text": "Dealt with way too many people , always a different statement . Anyway it’s done and thank u ", "rating": 3}, {"title": "Mixed Feelings", "text": "The end product was very good as I knew it would be as an existing customer but the processing of this loan was unduly complicated by an inattentive and unhelpful mortgage banker.", "rating": 3}, {"title": "It was a stressful experience due to…", "text": "It was a stressful experience due to the underwriting department.  They keep changing the requirements.  For example they said show 10k in a 401k or Ira  I showed 16k in an annuity I had started through farm bureau insurance.  The statement was not good enough.  Then you wanted the contract do I provided that not hood enough.  Then you asked for stocks 10k on it I showed southern co , Lowes and Duke energy , I have held since 2014 . Then wanted monthly statements.  They only send if you send money or they pay dividends.  So went on line got the past few months as well as a year ago and sent it in . Now you needed the picture of the back of the statement.  Needed a copy of the mortgage that was paid off in 2014 even though the home had a mortgage with another bank in 2017 and you were paying them off. Had to go to the bank and register of deeds to get this information for you. You can't seem to do your on leg work.  I remember seeing a payment for the home depot in the list before signing and a second payment for Lowes never received those checks to pay them. I was ready several times to tell you where you could stick your loan and did share that with the loan officer I was working with asking him if you all had any money to loan and I was ready to forget the whole thing and go local back with northeast credit union and do my loan there. The reason I went with you is the loan officer said if rates go down I can refinance for free. I hope never to repeat this again.  I think I'd rather stick a needle in my eye. ", "rating": 3}, {"title": "Positive experience for most of the process", "text": "The people who worked with me were very helpful.  The challenge at times is trying to complete all of the required paperwork on line.", "rating": 3}, {"title": "Usually rocket mortgage does a really…", "text": "Usually rocket mortgage does a really good job, but this time they dropped the ball. We finally got things worked out but the underwriting process was a nightmare. First I was told 0 out of pocket then they changed it to $2,700. When I complained and threatened to cancel the loan suddenly we came to a mutual agreement that I would not pay my monthly payment and only pay $900 at closing.  That amount changed 3 times but in my favor.  Then there was a rush to close before the end of the month. If they would’ve done what was promised in the first place there wouldn’t have had been a rush, the underwriters mistakes delayed the closing by 2 weeks. I still love rocket mortgage and will work with them in the future. I just hope they get the underwriters straightened out by the next time I go to use them. ", "rating": 3}, {"title": "Too much red tape in your process", "text": "Too much red tape in your process ", "rating": 3}, {"title": "Everything went well until afterwards…", "text": "Everything went well until afterwards when they sent us the checks to pay off our debts, which I was understanding they were doing, and found out that there were several of them they didn’t pay off. We were understanding that the reason we were getting more back was because they appraisal came in higher than expected so we were getting and extra $9k back, which we were going to use on home renovations we originally had hoped for but couldn’t do.  I made the mistake of trusting the mortgage guy and not reading everything with a fine tooth comb. At least we had the money to pay off the debts but felt completely misguided because of his lack of clear communication. Would change companies if I could have!", "rating": 3}, {"title": "Get verbal promises in writing", "text": "Get all terms in writing so you don’t get different numbers when it comes time to close.  ", "rating": 3}, {"title": "We have been with Rocket Mtg for years, but this time was frustrating", "text": "We have been with Rocket Mtg for years. Now closed with the 3rd home purchased with Rocket. We have always felt that the company has been reasonable and very personable with handling all of the loans, until this 3rd purchase with Rocket. Everyone was helpful, except when it got into the underwriter's hands. They asked for document after document after document, and our closing was postponed because they kept asking for a document which was a Quarter statement of our one savings account. The problem was, the statement could not be provided because the Quarter had not ended , but they could not realize that we had given them the exact last full quarter statement, but they kept asking for a statement even though the last quarter had not ended and was impossible for us to give them the statement when it had not been posted because it had not ended the quarter for Jan-March. They already had all the proof that we had the money we needed to close in our bank accounts but still demanded that one document.  Finally they realized what we were trying to explain to them and agreed they would waive it, but it still held up our closing because they could not get their paperwork filed in time.  We have been loyal customers of Rocket Mtg for years with great credit history with them , and it was just very frustrating for us during this last home buy with Rocket. We wish Rocket would realize that good customers with good credit who have been with them for years are not a financial risk, and not treat them as such. We understand that they require lots of paperwork, and proof of what is needed, but we feel this time asking for a document that was totally impossible to give them was a little much to the extent of excessive frustration we went through. We still love Rocket and the people who we dealt with were great, especially Dan McCarthy. Also Shannon Porath was helpful  and the other lady we spoke with to close also. Wishing the best for all, Thanks for all you do!. ", "rating": 3}, {"title": "Your appraisal company doesn't know how…", "text": "Your appraisal company doesn't know how to appraise a house. ", "rating": 3}, {"title": "There are still a couple items that are…", "text": "There are still a couple items that are not finished. I can't give a complete review until everything is done.", "rating": 3}, {"title": "Loan broker was not truthful and difficult to deal with", "text": "Loan broker was not truthful and didn’t return calls or emails for 3 days, even when emailed by another person from the company emailed him. Priced agreed upon for the loan was not  truthful either. Closing time it was $1,700 more than asked for. Would not recommend. ", "rating": 3}, {"title": "Creditor Payoffs", "text": "I do not like the fact that I have to mail check to my creditors for the payoffs. It seems to take forever for them to receive the payment therefore leaving the customer with having to make a payment anyway to prevent a late fee. This part should be tweaked as to maybe wired to the customer, the customer responsible for paying and if they do not show proof of payment in 10 days then they forfeit the loan or something of that nature.", "rating": 3}, {"title": "The process was the most confusing", "text": "The process was the most confusing, frustrating process I have ever done.  The request for information was redundant and you never talked with the same person any time.  The people answering the calls were helpful but never got the same person when you called again.  The loan originator that initiated the contact did not obtain necessary information at the beginning of the process resulting in unnecessary request that we costly to me and stressful.", "rating": 3}, {"title": "Some confusion in their communications", "text": "Some confusion in their communications, evaluations, sales protocols, and final approval.   Too many people involved, too much vague promises, that don't come out in the final numbers.   But we finally got it all worked out and agreed to move forward, then fine and firm from there.    2nd time through the process with Rocket.   I would recommend, but just read carefully.  ", "rating": 3}, {"title": "Mixed feelings", "text": "Mixed feelings.  Amrock's appraiser used the lowest sold homes to average our home value that resulted in a smaller jumbo cash out loan.  This is new, my neighborhood bank has always appraised at or higher estimates as provided by Zillow or Redfin.  Amrock didn't come close.  The lowball appraisal delayed our renovation project. We don't want to apply for a new HELOC or jumbo with a lower interest rate because we can't have an ongoing renovation when we apply for a new loan.  Rocket also instructed Amrock title to issue checks to our creditors for us to mail out ourselves. Another first, payments from other lenders were wire transferred in the past.  In this case, money should have been issued to me so that I could've used Bill Payor with efficiency and tracking to my creditors within a day from funding.  Now I have to wait 15-21 business days for Amrock to reissue checks that weren't cashed by our creditors.  Silver lining, cash out was faster than expected which makes renovation plans possible for 1/2 or our project.  And the notary was exceptional and flexible.  I leave this review for you to decide your deal breakers based on your needs to refinance a jumbo cash out loan with Rocket.  ", "rating": 3}, {"title": "The team was rock star until the end. ", "text": "Heather Murphy, my banker, was exceptional. Going thru the process from approval was pretty seamless. I was very impressed overall and closing was a breeze. THEN came the distribution of funds and my world was turned upside down and straight downhill. The funds I was to receive were to be wired to my bank account. Imagine to my surprise, when I called to find out why at 12pm they were not in my account I was told by Rocket Mortgage ...\" our system could not verify your credit union account so we overnighted the check to you\" I could not believe it and asked why someone did not call me to get another bank account to send the funds after all every other step in the process I have 24/7 communication??? I was told sorry that is the process. Here I sit today, 4.9.2024 NOT able to access the funds until 4.12. This is unacceptable and could have easily been made right. I would think twice doing future business with Rocket Mortgage . ", "rating": 3}, {"title": "Kept changing people no warning David…", "text": "Kept changing people no warning David was out of town a lot I had to send things several times ", "rating": 3}, {"title": "Poor communication!", "text": "Date of experience: April 04, 2024", "rating": 3}, {"title": "Closing issues", "text": "We had several closing dates, and finally closed 1 week later than expected.", "rating": 3}, {"title": "It took forever to provide necessary…", "text": "It took forever to provide necessary documents. I had to send everything three times. I had to get on a shared call to Army Accounting to prove that I would receive SBA for the rest of my life. That was the silliest thing I have ever been asked to do. I'm sure that they have other military personnel apply for home loans.If you plan to use them, make sure that you are aware of your age and your name is a simple \"American Sounding,\" name. ", "rating": 3}, {"title": "Okay but I've had better", "text": "RG rushed me at every turn and he kept switching up the amount. If you aren't sure, then tell me that.  You say I am getting x but then the paperwork says y, RG tried to say I didn't tell him everything.  I did and YOU said no problem.  He also was a little patronizing.  I am in Finance as well so I know what you're talking about.", "rating": 3}, {"title": "Disingenuous", "text": "First, i want to explain how well the process went.  It as very smooth and quick.  Now for the downside. My agent Lydia Orow was amazing on the initial call.  She was very friendly but then the only time I heard from her was when I had a question and that was twice via text.  After the fact I can say she is very disingenuous. I never even received a thank you call etc.  the only hiccup was the closing. It was very confusing.  The rocket mortgage app indicated the closing was at my home address.  That isn’t accurate.  It is done online which is fine but I was expecting someone to arrive and when it was 5 minutes after the closing time I called only to find it was an online virtual appointment.  I loved rocket mortgage however I was not so thrilled with my disingenuous agent.  Very phony and I was clearly just a number to Lydia.  ", "rating": 3}, {"title": "Very Little communication", "text": "Not very good communication about the purchase process for the mortgage refinance. No explanation about how the fees faffect the prices we pay for the charges in the mortgage. Next time we will probably look for a mortgage company that specializes in VA loans such as new day mortgage and other Veteran or military companies. ", "rating": 3}, {"title": "Stated good need bad", "text": "Started good ended bad I had to call rocket or they would of not been working on my loan ", "rating": 3}, {"title": "Agents did well", "text": "Agents did well, quick response. Closing was good, streamlined.Monthly payment came in higher than expected, want to se if there something I can do to bring payment down. Other than that I'm satisfied with the whole experince", "rating": 3}, {"title": "My overall experience with my refinance…", "text": "My overall experience with my refinance was very good but in the process somehow my escrow payment for my home insurance did not happen and I got a notice from my insurance company that my coverage had lapsed.  I called today and it was handled very quickly.", "rating": 3}, {"title": "Was very happy with my experience with…", "text": "Was very happy with my experience with the loan officer, was not happy with how long it took to close and out of pocket money we had to spend!", "rating": 3}, {"title": "The staff at Rocket Mortgage was very…", "text": "The staff at Rocket Mortgage was very nice, however, Amrock did not directly wire checks to the creditor, and the first batch had to be recently out due to it being lost in the mail.  Two weeks later I still have open accounts because the creditors are holding them since they are third-party checks. In my past experiences, the title company would just wire the money directly to creditors and I never had any issues.  It is very disappointing that I am still getting late fees and chasing checks. ", "rating": 3}, {"title": "Girl Power gone wrong!", "text": "The overall refinance process was very good however, someone at Rocket decided to change the principal lender from the old loan to the new loan. While it may seem like a minimal issue to some it is a big change for how we handle our finances. For us it adds complexity, thanks Rocket.", "rating": 3}, {"title": "FHA is almost impossible", "text": "Your different departments do not communicate well. I cant be the middle man. I would rather of had 1 contact the entire process. FHA loan requirements are a nightmare to get through.", "rating": 3}, {"title": "Easy service but bad communication", "text": "Everything was fine until it came time for me to actually receive my money. It was not done properly which resulted in me being issued an incorrect check which had to be cancelled and finally the funds were wired as they were supposed to be to begin with. Zero communication about me receiving the funds which was aggravating. ", "rating": 3}, {"title": "Speed that reduces productivity is not helpful.", "text": "Employees talk to fast and don't listen.Kept asking for duplicate paperwork.They were friendly and tried to be helpful.", "rating": 3}, {"title": "Things moved very quickly upfront but…", "text": "Things moved very quickly upfront but as we got closer to the closing date it turned into a blame game with the title company. The closing specialist kept blaming the title company for not having final numbers but everytime I called them they answered the phone and my questions. The closing specialist was supposed to go over the final numbers and all she did was send an email with an overview.", "rating": 3}, {"title": "It took 3 weeks longer to close than I…", "text": "It took 3 weeks longer to close than I was told and I had to do the appraisers job getting a plot map", "rating": 3}, {"title": "Your information will be sold to Mortgage Insurance Companies!", "text": "My primary POC was amazing as were most of the people I worked with.  There was a gentleman at Amrock that I found to be quite rude.  I am also extremely disappointed in the fact that you sold my information and I am now getting hounded (thru mail and phone) by companies trying to sell me loan insurance.  One is even attempting to look like it is Rocket Mortgage contacting me.", "rating": 3}, {"title": "Thank you I definitely did not expect…", "text": "Thank you I definitely did not expect to be paying $2,649 a month on a $335k mortgage loan ", "rating": 3}, {"title": "The entire process is too demanding and…", "text": "The entire process is too demanding and very, very stressful.  The system needs revamping.", "rating": 3}, {"title": "Poor communication when  transitioning  from banker to different  agents ingot information  from the banker that the closing  agent  said  was wrong and kinda set me back  I lost money closing ", "text": "Poor communication when  transitioning  from banker to different  agents i got information  from the banker that the closing  agent  said  was wrong and kinda set me back made me lose money closing ", "rating": 3}, {"title": "The people initially were very nice and…", "text": "The people initially were very nice and helpful, BUT the closing company took too long, did not keep us informed enough and didn’t have the right amts for payoff which meant we had to compensate for the extra.  I emailed closing agent these issues right after I got their proposal.  They never responded even after additional efforts to contact.", "rating": 3}, {"title": "Originator was exceptional Underwriting not so much", "text": "Originator was exceptional. He was thorough, helpful, and seemed to care that he was doing his best effort for my benefit.Underwriting really seemed to be “the Sales Prevention Dept”.", "rating": 3}, {"title": "You need not have your clients have to…", "text": "You need not have your clients have to jump thru hoops .excpesually those of us that live remotely. It was crazy the things you expected us to do", "rating": 3}, {"title": "Rocket is not the best option but my scenario was…", "text": "Not the best option but my scenario was too far in to go through the hassle all over again with other lenders. I always felt like Rocket is just out for their benefit. You have so many other people involved your transaction that it gets confusing, one rep says something and another rep contradicts but they never seem to find the notes the last rep typed in so diligently. You ask for the original guy you talked to and he's nowhere to be found or happens to be out the office. but they'll bug the crap out of you when they need something or are pushing you to close their loan. ", "rating": 3}, {"title": "I have been with Rocket for around 10…", "text": "I have been with Rocket for around 10 years.  I am recently divorced so I was looking to defer payments for a couple of months to avoid possible bankruptcy.  When I called I got an agent who explained that I could do that or I could roll over all my cards onto my house payment.  He then said that with the equity I have in my house that I could take out $5000 of that and it would make my payment an even $900.  I asked him multiple times if it would be exactly $900, no hidden or surprise fees.  I was assured that there would not be.  I explained that I am a single mother and recently divorced and that I could not afford much more than that.  I am currently working 2 jobs.  In the process of all of this, I am contacted by at least 3 different people everyday, but phone calls and texts.  Some text to ask if I would consider using Rocket to refinance. He said I could get a better rate than what I was quoted.   I called that one back and asked how that was possible since I was already going thru Rocket and had my current mortgage thru Rocket.  It was very confusing.  I would then get texts, back to back, from different agents.  When I would call them back I would have to explain the whole process to each of them.  I have very limited time with working 16hrs a day 6 days a week.  When they finally came back with the final cost, it was $933.  I was very confused.  When I called him he explained about fees and all that.  I was angry because I was promised it would not be over $900.  At this time I was still getting the $5000.  When I spoke with the closing title company I was told I was getting back only $280.  So I called again and he now said my debt ratio was more than he realized.  The agent made me feel as if I was stupid.  I talked to another agent at one point and I told her that I felt I was being taken advantage of because I was a single woman.  I truly felt that I was tricked.  I used the title company that Rocket picked out.  They told me I was not getting any money back at all and that I owed them $280.  After I paid them they  then realized that they owed me the $280.  I was told by the agent that this process of refinance would be quick and easy.  It has been anything but.  He made it seem like within the week it would be over.  It has been over a month or more.  It was just closed.  I was told everything would be online and yet I had to leave work to go to the title company.  The title company called Rocket and explained that a couple of the credit cards that were rolling over into the house payment had been paid off.  I was told not to stop paying on them so since the process has taken so long a couple were paid off.  The title company tried to explain that to Rocket and the agent was not concerned. I had even sent in recent statements and they did not want to see them.  They paid off my cards so now I have a credit to those cards.  That money would have been more useful elsewhere.The app to set up my payments and autopay is not allowing me to set up the correct date.  I had thought that my old autopay would have stopped on its own since the loan was paid off.  Yet my payment was taken out last week. I tried to set up the new loan and dates, but it won't let me go into May, which is when my first payment is due.  It has been a hassle.  I do not have time to keep calling and having to explain everything.  I literally have about 30 minutes between jobs.  I was upset that they are not including my second job as income.  My debt ratio would be better then.  I have not been at the job for 2 years yet.  I work in a school so every summer I would get a summer job.  So now they won't consider any jobs as a second income because I have not been at any for 2 years.  I started almost full time at a restaurant in Aug when my marriage broke up.  I also have a consolidation loan with my ex.  Because of that it has made the debt ratio not great.  The whole loan is being considered my debt even tho the divorce decree states that we are both required to pay half.  So  that it why I am not able to get the 5000 from the equity.  My furnance went out and I had been counting on that money to get a new one.  I would have never refinanced just to refinance.  He explained that I would get 5000 dollars to help get the furnance and have a cushion since my house payment is going up.  Now I am not getting it.  I feel I was tricked and every single person had a different idea or explaination.  I am very unhappy and when I am in a better position I am very seriously considering doing another refinance with another company.  I felt very stupid, talked down to, tricked, and mislead.  This is not how I should have been treated, especially after going thru everything else that I am going thru.  Very disappointed.  ", "rating": 3}, {"title": "For an existing mortgage holder I was…delay after delay", "text": "For an existing mortgage holder I was told it would probably wrap up in two weeks but it took 6 weeks due to your staff requesting documents from wrong HOA company. Instead of checking with me they ignored it and then the insurance came up for renewal which caused further delays. I was not pleased at the incompetence and then I had to go in person to office to retrieve correct documents for your company to proceed after several calls from me to see what delay was. I would seriously think twice before recommending Rocket to anyone else", "rating": 3}, {"title": "Tedious refi", "text": "I have financed with rocket Mortgage several times.  this was the first time that the process took forever and was painful.  I don't think my agent was very well trained, he neglected to tell me what was happening.  some of the problems may have been my fault, I did not know what to ask, but he did not communicate well with an elderly person.  The closing did go smoothly however.", "rating": 3}, {"title": "We had three different bankers who…", "text": "We had three different bankers who asked the same questions.  Representatives did not consider that we where at work and wanted information right away.  Referring us to AMROCK was a mistake.  It took them 5 days after closing to pay the seller.  Not by wire but US mail.  Terrible experience", "rating": 3}, {"title": "Overall okay, but got messy at the end", "text": "Our initial enquiry about loan rates turned into a loan application asap—the rush was on on their part! So if you’re in a big hurry, you may be a happier customer than me. They wanted us to upload our documents that same day to ensure a quick processing time. Once we did everything on our end (in 1 week no less!), things slowed down significantly! The loan took much longer than they said and I was dissatisfied with the appraisal and title companies they work with. Everything was delayed, so much so that I ended up having to pay a penalty because we were late paying what we owed. Communication could have been clearer too.", "rating": 3}, {"title": "Pros and Cons", "text": "Cons:The loan originator seemed very inexperienced. He told me from the start that my numbers were wrong on my VA funding fee. But after it went to underwriting the numbers changed back to what I told him they would be. He never followed up and explained to me why he was incorrect. He then told me I needed to pay $500 to get the appraisal ordered and that I was paying for it. In the end Rocket funded me this money back but it was not properly explained by him. There was some handoff with who I was working with which made it hard to have one contact through the whole process. In the beginning the loan originator didn't really listen to my goals with money on hand and best options for rates. I had to stay firm on what I wanted to do which was best for me.Pros:The rate is amazing. The underwriting and process time was super quick. They were ready to close early. In the end I'm happy with the finished loan and the rate I was able to get with Rocket. ", "rating": 3}, {"title": "They sell your info to everyone even scammers. ", "text": "I liked everything but the hard credit check. Because it kicked off a cascade of scam calls like I've never seen only heard about in fairytale. ", "rating": 3}, {"title": "The agent rushed the process", "text": "The agent rushed the process, didn’t explain all of my options to me, instead just stated what he thought was best. I sent an email complaining that I didn’t feel heard, So many different people were involved that I was confused and felt unsupportive with the transaction. ", "rating": 3}, {"title": "Customer Service I received from Juan…", "text": "Customer Service I received from Juan Leon was not great. Did not return calls. Did not explain thins well. Told me things that were not accurate. ", "rating": 3}, {"title": "Tried to do a remote closing", "text": "Tried to do a remote closing. it was nice to pre sign. but then the qr code did not work and the email link did not work to get a photo of our ID. called the help line and then we got stuck doing it on my phone. i did not want to do this on my phone. i had bought a camera to do it on my computer and now that was a waste.", "rating": 3}, {"title": "The underwriter’s were to difficult uncaring repetitive and don’t listen to reason ", "text": "The underwriter", "rating": 3}, {"title": "The delay caused by the documents not…", "text": "The delay caused by the documents not arriving in Ohio from New York was troubling. Then closing wasn't rescheduled for another 10 days.", "rating": 3}, {"title": "Process was very good except closing…", "text": "Process was very good except closing company chosen was NOT good", "rating": 3}, {"title": "Representative was very professional", "text": "Representative was very professional, knowledgeable and helpful.  However, I didn’t like that I had to receive physical checks and then mail them directly to the lenders.  This cost unnecessary money out of customer’s pocket.  You should provide electronic services for the customer to avoid additional stress.  Other companies provide this service.", "rating": 3}, {"title": "My HEL Process", "text": "I applied for a Home Equity Loan from Rocket Mortgage becsuse I have my 1st mortgage through them. I assumed them (via refinance) for my mortgage in 2020. Process at that time was smoother and a better experience.With this experience my agent was not as enthusiastic as the previous. I felt that I had to ask for information which I think that he should have proactively provided to engage a customer (especially one who is not in the finance/real estate business). That aside I would rate him a 4My dissatisfied was after my home appraisal, I was told that \"unfortunately your home is on 20 acres and we can't move forward with the loan\". Thats it. Apparently Rocket Mortgage has a limit on providing loans to customers who have large acreages....(assumption as no rationale was given). I was given a phone to contact for an appeal of the appraisal. Which I did and I must rate Jon Ager a 5 star as he got the issue resolved in 24 hrs. I spoke with him on Friday evening, he called me on SATURDAY evening with an answer and a resolution.I questioned the competency of the approval department for the following reasons: 20 acres of land is equivalent to approximately FIVE football fields; I owned a TOWNHOUSE.  I have never heard or seen a townhouse with 20 acres of land. My townhouse is attached on 1 side; They had pics of my home, front and back which clearly showed that I had minimal land space around my townhouse. I have my mortgage with them, THAT was approved. The loan was for the same property. Common sense would have alerted a Red Flag that there was an error....and maybe, just maybe they would review my records....since it WAS  the same company and WAS the same property that was mortgaged and applicable to the loan request. The appraiser documented incorrectly or not as he should. He documented the size of my COMMUNITY. Again thank you Jon Ager for realizing that it made no sense and followed up.The loan was eventually approved shortly after but I did have 2nd thoughts after that experience. But since I have had no issues with the company, my current mortgage or prior mortgage process I proceeded.Again the process was going well until post appraisal.", "rating": 3}, {"title": "Closing costs are incredibly high", "text": "Closing costs are incredibly high, and not discussed early on in a forthright manner. ", "rating": 3}, {"title": "Too much work.", "text": "Will not return phone calls. Talk a good game but no follow up.", "rating": 3}, {"title": "I did not like having more than one…", "text": "I did not like having more than one person to work with throughout the loan process. I also got discouraged by the wait time. Finally, what I was told would happen did not in the time frame stated. Since closure, I have received many correspondences and my name has been misspelled on some of them. I have used Rocket before and was pleased, but this time was not my best experience. S Morrow", "rating": 3}, {"title": "Poor communication", "text": "Poor communication. We were told one thing and then they did another. I’m not sure that I would go to them again. It took along time, and their app doesn’t work right half the time. But at least we finally made it to the end of it.", "rating": 3}, {"title": "I tould you I paid off all my credit…", "text": "I tould you I paid off all my credit cardso and you didn't believe me", "rating": 3}, {"title": "My loan originator Ryan Glenn was very…", "text": "My loan originator Ryan Glenn was very knowledgable and easy to work with.However, I thought the closing process took too long...so the payoffs were different and most of my creditors need to issue me a refund, which can take 90 days or more.In addition, the rep from Amrock came to my house and was not very personable. Not sure why....because I made her feel very welcome but I felt like she did not care to be at my house.", "rating": 3}, {"title": "Jumping through hoops", "text": "Everything was going fine until the inspection. The day of the inspection there still was water in the basement following the flood warnings. Because of the water I was required the the foundation inspected along with adding a railing to the attic stairs and remove clutter from the basement. I had to have the basement inspected 3 times to prove there was no structure damage. Then there was an issue with the POA paperwork. It seemed like every time I completed a task a new one appeared. I applied for the loan in August and didn't have the closing until March.", "rating": 3}, {"title": "Being transparent of exactly what the…", "text": "Being transparent of exactly what the fees are", "rating": 3}, {"title": "A good company but not really a VIP", "text": "I disliked being taken away from our local representative and given to a “VIP” team. This team didn’t respond to me, only my husband, they were located in a completely different state and time zone and requested documents multiple times when they were previously uploaded. ", "rating": 3}, {"title": "I found it absurd that I wasn't allowed…", "text": "I found it absurd that I wasn't allowed to take a slightly larger loan that's payment would have been a few dollars higher but still significantly lower than the payments I was already making on all the cards/loans I was paying off with it.  I'm glad the loan went through at the lower amount but the higher amount was, literally, like $50-100 per month more than the one that was approved.  The total payment for the larger would have been about $1200 when I was eliminating well over $2200 in monthly payments with the loan so there was no question I could have paid the larger loan w/o issue.  ", "rating": 3}, {"title": "Surprisingly disappointing ", "text": "I’ve used Rocket for a while and never had a bad experience. But this time I ran into multiple issues. I didn’t get updated on status, they didn’t follow through with requests and I everyone I talked to gave me different answers on the same situation I was having. I ultimately decided it wasn’t worth pressing the issues and went through with the closing but I was disappointed to say the least. ", "rating": 3}, {"title": "Very disappointed", "text": "I am not very happy with the escrow company Rocket Mortgage use.  the way they treat me and paying my credit card off the very unprofessional it cost me two extra week of interest matter fact double interest.Unfortunately, the escrow company don’t care. I have not heard back from Rocket Mortgage yet.I have read the reply from Rocket Mortgage. Yes, I have dealt with Ms Candice Twymon she was the only person  working so hard to help me to solve the problem I had Everybody was passing the ball to somebody else Unfortunately. My biggest issue was with the escrow company Rocket Mortgage use. If anyone wants to talk to me, they are welcome to call me.", "rating": 3}, {"title": "I was told that I would have two months…", "text": "I was told that I would have two months without paying my mortgage and it ended up that I only got one month without paying my mortgage really that’s the only reason why I entered into the deal with rocket mortgage because they gave me the best deal and then it didn’t work out", "rating": 3}, {"title": "Two many fees and constant changes from…", "text": "Two many fees and constant changes from first deal too final contract. VA  involved and rate  was 4.99 and ur rate 5.89. Constantly adding cost that toke my escrow from 1600.00 too 205.00. Just feel lost to unclear cost. Never use u for future loan. ", "rating": 3}, {"title": "Difficulties but did close. ", "text": "When I first started talking to Rocket Mortgage, I was set up with one agent, younger and very nice and it wasn’t long and he told me I was ready to close but then it was like he vanished. Someone put a bid on the house and it sold, so I lost my first choice. Then I was connected with another agent, he was also very nice and started requesting many more documentation. Not long after, he was taken off my case as well. I started the process in Dec 2023 and finally closed at the end of Feb 2024. In all, I believe I was bounced around with 11 different agents total. Two days before closing, another agent I’d never talked to before, emailed me and informed me they would be combining my old credit card debt that I had been making monthly payments on, with my closing cost. I was unaware that they would be doing that. I asked if I could just pay those amounts off separately but I was told no. I went ahead and rolled with it. The debt amounts, other than one, were incorrect but I’m told I’ll get refunded. I am still waiting on that. The only overpaid amount I have received was from my title company. They corrected one amount, my car payoff, because their process took so long, I had made two more monthly payments since their first request of the payoff. They also assured me they’d keep my mortgage payment under a certain requested amount, that was also not fulfilled. Everyone was mostly professional except for one agent who told me he’d “keep it real with me” and used slang language with me and blamed a lot of the later closing date on the title company, when in fact, my title company and realtor were ready and waiting. That agent was very rude and unprofessional with Security First Title Co and Lyons Reality and myself. I do appreciate the work the whole team put in and that I did finally close. My best friend had a great experience with them, I just unfortunately didn’t have a 5 star experience. It was great at first but then it was one thing after another that would slow everything down. I would get very late emails or tasks on the app. My realtor said this is the first time she’s struggled with Rocket. I’m not sure why my case was so difficult and took so long to figure out, but in the end, I’m thankful for my new home that I got my family into, so I will give a 3 star rating. Had everything been quicker, smoother, more professional, my rating would be different. My fiancé believes 3 stars is being generous. I PRAY I receive my overpaid debts. ", "rating": 3}, {"title": "Show better visually where I am at in…", "text": "Show better visually where I am at in the process. Suggest maybe a totem pole/traffic signal with filled in items. Communicate better between different offices. Sometimes different info is given out. If a customer asks for electronic disbursement of funds make sure that happens instead of sending a paper check out.", "rating": 3}, {"title": "Shop around and use a local lender", "text": "Pros: I liked the email notifications informing us what step of the process we were in, worked directly with the relocation company and we didn’t have to pay certain closing expenses since they billed the Relo directly, worked with us in using local county taxes Cons: The rate wasn’t the best vs what the local lenders offered but RM worked with the Relo, they weren’t familiar with the local county taxes and tried to apply a standard rate based off the purchase price (which is not the way they work in our state), have the incorrect mortgage payment in the website and not our agreed upon Buydown rate, have various people handling the loan instead of one point of contact throughout the length of the loan process which led to bouncing around a couple of people when we had questions, not available after 5 ET for questions vs the local lenders who gave us their personal number and answered questions in the evening when we were available after work If it wasn’t for the fact that they billed some closing expenses directly to the relocation company due to an agreement between them, we wouldn’t have used RM. But working with them in our specific situation reduced the cash to close,which we wanted. I suggest you shop around and cross shop with your local lenders. RM had a high rate vs the local lenders. ", "rating": 3}, {"title": "Micks review", "text": "The only real issue I had was the first person I spoke to and the lack of communication from them. I had to to go online to the chat to find someone who could tell me what was going on. It took over a week just to get a couple questions answered. Everyone past the first woman named Nancy I believe was great. After the very first day with her I never heard from her again. Other than that it went well", "rating": 3}, {"title": "Mixed feelings ", "text": "I liked the ease of doing things online. I did not like that it was not explained to me upfront that I would be required to PMI on the loan. I realized it the day before closing. The fee adds up to thousands of dollars over the life of the loan. Had I known this sooner, I would not have gone through with the loan. Also do not like that I have to mail checks to creditors as I do all of this online normally. This should be able to be done electronically. ", "rating": 3}, {"title": "While the loan process went smooth some of our concerns/questions were ignored. ", "text": "While the loan process went smoothly, I reached out to your chat service to ask about our PMI being cancelled with the new appraisal completed through your company.  I was told that a message would be sent to our loan officer and he would get in touch about this.  To date no one has reached out and will give us a straight answer about how to remove PMI and we definitely qualify to have it removed. ", "rating": 3}, {"title": "Rate went up an mortgage payment went up", "text": "Date of experience: March 03, 2024", "rating": 3}, {"title": "I disliked that I’ve made numerous…", "text": "I disliked that I’ve made numerous phone calls, and they still have not sent me hardcopies of the agreements. I signed with the notary. I am not technology based an old, retired teacher, and all I asked for is hardcopies so I could read it before I had the three day cancellation fee. Apparently that’s how they got me And I want the hardcopies I’ve called numerous times no reply     All talk,   No action ", "rating": 3}, {"title": "I think the fees are overkill", "text": "I think the fees are overkill. All I wanted to do was change from a 30 yr mort to a 15 with the same mort company, it cost me a ton of money. Rip off comes to mind.", "rating": 3}, {"title": "First off Austin and Micheal were…", "text": "First off Austin and Micheal were awesome,  these two employees kept fighting to keep me involved.  The VA process, the issues with the VA  sucks because no real way to challenge them straight up.  Why do we need things that building code doesn't  require, why the difference between appraisers, why not the same standards for these individuals.  Time limits are a joke,false advertisement when you said quick, 5 months was NOT quick.", "rating": 3}, {"title": "Good customer service but…", "text": "Billy that I worked with really made this an excellent customer service experience. He kept it tuck with me through it all. I didn't like that closing was delayed because the bank was concerned that my property has \"excess acreage\" or that I lost square footage because my 3rd floor didn't meet some new ceiling height regulation and is now considered a \"finished attic\". ", "rating": 3}, {"title": "Amrock was very poor", "text": "Amrock was very poor. Rocket was outstanding.", "rating": 3}, {"title": "Not enough communication", "text": "Date of experience: March 04, 2024", "rating": 3}, {"title": "I loved Rocket Mortgages customer…", "text": "I loved Rocket Mortgages customer service. I am rating the experience a three star for two reasons. 1) The appraisal experience. In August, I had an appraisal done through Rocket mortgage to see if I could have the PMI removed. The appraisal came back at $398,000. We paid $200,000 for the home so the PMI was removed. For the new loan, Rocket could not use the previous appraisal. The new Appraisal came back at $320,000. That's a BIG difference, especially when a home smaller than ours had just sold for $320,000 in our subdivision. So our loan was denied and we had to go a different route for financing. 2) Rockets other loan department was able to utilize all our information from the first application. We were told should take a week to process. I called to see after a week what the hold up was. Turns out they needed more info, but we weren't told until I called. There was no notification in our portal. I would like to see the appraisal process more stream lined. Or use the same appraiser in each area. That was very frustrating. The closing experience was very good.", "rating": 3}, {"title": "A frustrated senior.", "text": "While the first part (contract, closing) was really a rocket, the last was quite the opposite. I think the process of paying my debt did not match Rocket Mortgage promises and has huge room for improvement. Found it inconsistent, archaic (stub...) , confusing (statement - referring to transactions) and risky (some Post Offices were closed and did not deliver mail; based on my accuracy in writing 14 huge account numbers and addresses) instructions.  ", "rating": 3}, {"title": "They start off great", "text": "They start off great. But from there it went uphill. Phone calls weren’t returned. Additional information requested was already in other documents. Was over 6 weeks later than the original date to close. I felt like there was no communication or working together from departments. Once I had finally had enough of the stalling I contacted a manager. Once she got involved things moved smoothly and quickly. I’m not sure I would use them again. ", "rating": 3}, {"title": "The team was polite and cordial", "text": "The team was polite and cordial, but too many people handling the logistics", "rating": 3}, {"title": "The whole process was smooth until we…", "text": "The whole process was smooth until we received the checks to be paid to our creditors. Checks were sent back to me for mailing which delayed the process.  My husband and I have some accounts that are NOT joint accounts but ALL of the checks listed only my name as the account holder.  Having to mail the checks cost us weeks worth of extra interest. It would have been better to just receive the cash and pay my bills electronically. Unfortunately, they don't disclose that they mail you checks vs. paying directly until its too late to change without prolonging your closing.  ", "rating": 3}, {"title": "BEWARE ", "text": "Caleb Edwards with rocket mortgage called me after I requested a refi on my mortgage so I could consolidate some debt, he said I’d been late on my mortgage five times recently and I know that this is not true. I contacted my mortgage company, they also say that it’s not true. ", "rating": 3}, {"title": "The closing company waited until 2 days…", "text": "The closing company waited until 2 days before my scheduled closing to verify my employment, that happened to fall on a holiday weekend causing a delay. Poor timing", "rating": 3}, {"title": "Our lender banker was not communicating…", "text": "Our lender banker was not communicating to the underwriter the information and documents I was sending to him.", "rating": 3}, {"title": "Misleading on using home equity ", "text": "Rocket mortgage does not allow people to us the equity in there house for a line of credit. You only offer refinance loans. You charge way over current interest rates. You charge fees for all info on clients you already have. Would not recommend you to other clients now. ", "rating": 3}, {"title": "Good loan terms", "text": "I want to start and say that the rates, fees and time frame for the this whole process were excellent in comparison. A few things I encountered were a bit of a surprise but not a deal breaker. To start, my loan officer was very pleasant to deal with but really rushed through a lot of things and I felt like I was trying to be sold a gold watch at a pawnshop to some degree. There were some details about the loan that were not made evident to me until After signing some things. I was not aware that my debt would be rolled into the loan, which turned out to be fine but I just was not told that outright and had to find out after the fact. Also several times I tried to reach customer service people with the title company and my loan officer and they were always in meetings or on conference calls with their bosses or something. This happened more than five times. It seems like the management there really values team meetings over customer service . it seemed to be a nuisance to me. Lastly there was a computer glitch in the system which caused a delay and nobody seem to know how to fix it and I was not able to receive my closing paperwork and there had to be a manual workaround that took a few days to fix, also one of the customer service people that was helping me was unable to help me for a whole day due to meetings. I guess those meetings are more important than getting a loan closed. Other than that though generally a good experience but I think some more things should be discussed outright and loan officers should not have such a rushed demeanor. Take your time and embrace the details with the customer. When it comes down to it though the good rate and low fees or what matters and I'll forget about all the other details literally the minute that Check goes in the bank. Good deal", "rating": 3}, {"title": "Overall good service", "text": "Overall good service.  Prompt in getting everything done.  However escrow was a problem.  I did a Home equity loan to pay off high interest debt.  Instead of paying creditors directly I was mailed checks with their names that I had to turn around and mail to the creditors.  On two of those I have just been hit with interest fees that would not have happened had they been paid off directly or if the money had been direct deposited to me to pay off directly.  ", "rating": 3}, {"title": "Took over three months to get things…", "text": "Took over three months to get things done felt they could of pushed more to get things done", "rating": 3}, {"title": "All of my reason for getting this loan…", "text": "All of my reason for getting this loan was to pay off a number of credit card debts. By the time I can get the checks and I’m trying to pay them off now I have to get money back from everyone of them because you sent paper checks that I then had to mail out. I have never had that happen ever and M flummoxed by why those checks weren’t sent out directly from the mortgage *****Your apologies don’t pay late fees or get me my overpayments back faster", "rating": 3}, {"title": "Good at first, execution needs some work…", "text": "The experience of getting the home equity loan was smooth and the people were great.  However, I had thought the debts getting paid would be paid electronically which would be quick and efficient, but instead I was mailed paper checks, which then required me to dig up mailing addresses which was not easy, then I had to go get envelopes and stamps to even mail them, because who mails checks anymore, and I have no way to track anything to even know if the checks have arrived, and it's been a week and still none of the debts are showing paid.  It would have been significantly faster and more efficient to electronically send all the money to me if it was not going to be paid directly to the debtors so I could pay and track everything electronically and it would all be done by now.  So not happy at all with the ending of the process ", "rating": 3}, {"title": "This experience was overall…Disappointing ", "text": "This experience was overall disappointing. I did not like having a paper check issued to consolidate debt. I much prefer paying bills online, versus mailing checks and wondering when the payments will post. Expected much more from Rocket Mortgage. This was my first time doing a cash-out refi. Did it mainly for the experience, but will never do it again. All of the additional fees, cost, and “good faith” deposit off-set any potential savings compared to taking out a personal loan. ", "rating": 3}, {"title": "Good until disbursement of funds", "text": "Good until disbursement of funds.  I think you could have had the computer fill in the info you requested on the checks.  you also used abbreviations for names rather than spelling them out forcing me to look up or guess what they were.  I could have been done much faster if not for that.  ", "rating": 3}, {"title": "Very tiring", "text": "The process was too much back n forth. Yes you’re approved but now we need this or that. It was a very nervous experience. Not enough communication to resolve issue or a problem. This was an equity withdrawal and it took almost 6 weeks . Which is ridiculous!", "rating": 3}, {"title": "No option to say no", "text": "I really disliked that you didn't have an option to say no I don't want any more money when our appraisal came back higher than anticipated. Instead I couldn't complete the task in my to do list and ended up getting multiple calls about it, even after I told people NO. ", "rating": 3}, {"title": "Home loan", "text": "Alot of info was asked for and the team wasn't always on the same page ", "rating": 3}, {"title": "This would have been five stars if it…", "text": "This would have been five stars if it wasn’t for Rocket Mortgage sending us checks to mail to creditors. It would have made more sense to just send the funds directly to us, as several of these items were paid off before the checks were sent to us. Not a good process", "rating": 3}, {"title": "At first it was things went well", "text": "At first it was things went well, great communication. But after I got moved to the other representatives there was no communication. Also never went over closing documents with anyone. Very poor service at the end.", "rating": 3}, {"title": "Originally dealt with Brendan rest of…", "text": "Originally dealt with Brendan rest of his team sucked kept messing up the numbers and paperwork had to draw out closing because of the mistakes", "rating": 3}, {"title": "I THINK THAT THE FIRST PERSON WE DEALT…", "text": "I THINK THAT THE FIRST PERSON WE DEALT WITH WAS MR AUTHOR AND HE WAS FANTASTIC. THE PROBLEM WAS With his team. They got the numbers wrong and seemed to me very inexperienced. ", "rating": 3}, {"title": "Hearing Crickets..", "text": "A lot of silence between one group and the next - process was slower than I expected. Interactive dialog was minimal.I have had 14 first and second mortgages, RM was slower than a conventional bank.I would recommend some POCs for each step. Try using a unknown person and test your process.", "rating": 3}, {"title": "Shame I could not give them 5 stars", "text": "First, the positive. Process was very fast and very easy, good communication from their agents, very straight forward process. I'm very happy.The con. It was only only one, but a very important one.  I would have given a 5+ rating if it wasn't for the fees. Rocket Mortgage is super expensive, the only reason I used them was because I was in an emergency and time was of an essence. I hope they adjust their prices to be more competitive, there are a lot of companies with no closing costs out there,  ", "rating": 3}, {"title": "Awesome with one escrow issue", "text": "Everything went very well with the exception of the  multiple corrections I found regarding the amount being included (>2years of home ins) in my loan for escrow. The Customer service was top notch.  The ease, communication, availability and technology made it a very welcoming experience.", "rating": 3}, {"title": "We done four loans with Rocket", "text": "We done four loans with Rocket.  We were very pleased with the first three.  The last one not not good.We have a million dollars in assets and less than $200k debt.  High credit scores and were looking for a small second mortgage to remodel the kitchen.  Things went well until we got to underwriting.   Your system wanted me share login information including passwords for our financial account to a third party!We said no, simply tell us exactly what was needed and we'd scan that information and upload it to Rocket.   This went on for nearly two weeks.  I was ready to switch to another lender but finally got one of your employees to talk with underwriting for us.The next day I uploaded one more document and finally the loan was approved.  This was not a good experience and I doubt we will use Rocket again.The idea that you use a third party to verify financial that requires login information is simply crazy.  We used another mortgage servicer who was hacked, lost our information including e-mail, phone, address and social security numbers.    They sent us a letter apologizing for the breach and offering a free year of credit monitoring.  Why should anyone share login information to financial account without assurance or better yet insurance to cover our loses if they were to loose our information?   ", "rating": 3}, {"title": "Great loan officer, Horrible Closing communication", "text": "The loan officer, Kevin Nguyen, was great. He was so good, he may have set the bar for others too high. Once past Kevin, there was little to no communication from the Closing Team. I received an email in the evening, the day before closing, stating the closing attorney would arrive @ 10AM which was already setup by the attorney. I sent emails to the closing team, no response. When they did respond, I found answers elsewhere or their response took so long, the inquiry became irrelevant. A+ for Kevin, F for the closing aspect. They refer to themselves as The Closing Team... but I experienced nothing from that department that resembled a \"team\". Once in closing with the attorney, simple, easy, efficient, and quick.", "rating": 3}, {"title": "Although I appreciated the entire Rocket Mortgage customer service experience, Amrock proved to be seed a NEGATIVE TASTE in my mouth.", "text": "Although I appreciated the entire Rocket Mortgage customer service experience, Amrock proved to be seed a NEGATIVE TASTE in my mouth.In the future, should I decide to do business with Rocket Mortgage and Amrock is involved in the title and closing process, I will opt out of doing business with Rocket!", "rating": 3}, {"title": "took too long", "text": "Date of experience: February 16, 2024", "rating": 3}, {"title": "It was very confusing going back and…", "text": "It was very confusing going back and forth on how much the payment was going to be and the amount of cash back changed a few times also. Everyone was nice but I was confused and the payoff amounts I think have changed so I will probably have to pay more out of pocket to get them paid off.", "rating": 3}, {"title": "LOTS of communication before the deal…", "text": "LOTS of communication before the deal was confirmed, then afterwards is slowed considerably. A call from a person with an actual voice would be nice just to hear that everything is going along as it should. When we first took out our Mortgage with Rocket the guy was absolutely the best....a lot of reaffirming calls...answered questions I didn't even know I had. This time....not so much. But it turned out ok.", "rating": 3}, {"title": "Very dissatisfied happy due to the fact Rocket was…", "text": "Not happy due to the fact Rocket was suppose to send the pay off check directly to BMO, but instead they sent it to our home in Peru NY and we are in Florida. It was left on our doorstep. Had to have my daughter get it and mail in to BMO at me expence. It’s still in transit and should arrive to them by 9pm this Tuesday. I’m not happy", "rating": 3}, {"title": "No Proper Communication", "text": "Wasn't told about any damage that needed to be fixed, then was only told 1 thing at a time, then it was paint door trim & other. Was told what our monthly charge was going to be then ended up being almost couple hundred difference. Got phone calls daily and it was always someone different asking for the same already submitted paperwork.  No one was communicating with each other at their office, just annoying crap out of me daily.  Started process in November 2023 and finally got to close in February 2024. Was absolutely ridiculous in my opinion.", "rating": 3}, {"title": "Terrible underwriting dept.", "text": "There was a miscommunication between the loan officer and the underwriter on my closing date and I was told I was going to owe $1300 more at closing. I was give this information 6 days before closing. The loan officer worked to get 800 covered but the other 500 I had to pay and it was another mistake by the underwriters. They forgot to add the 500 onto my escrow estimate for the actual cost. This was after I had already signed closing disclosure paperwork. This put me in a bind having to come up with addition money to close and the response from underwriting was it’s just a few hundred more dollars and acted like it was no big deal. Very unprofessional on the underwriting. In my opinion should have ate the cost of their mistake since it was so close to closing. But my loan officer was great and stuck by his word on everything. Wish underwriting would have been better r", "rating": 3}, {"title": "aaaa", "text": "aaaaaaaaaa", "rating": 3}, {"title": "The Agent I worked with lied and…", "text": "The Agent I worked with lied and mislead me. he misrepresented the numbers and manipulated them to is his advantage. I accepted the loan then all of a sudden when the final numbers came in, all the so call credit I was given disappeared. apparently, I was giving those credits to win me over from Wells Fargo only to turn around and adjusted them to almost zero. He knew I was in tight spot with the market and my closing date and would not be able to back out. Word for the wise\" if they say give me the quote from the competition and i would beat it, run for your life.\"", "rating": 3}, {"title": "Miscommunication", "text": "The amount of, or lack there of, between \"team members \" is a problem.  I had my closing date moved back 2 times due previously submitted documents \"expiring\" because dates weren't within time limit. That time limit expired because they couldn't get there department synced on completed task.", "rating": 3}, {"title": "Not as good as they use to be", "text": "This is the second time I've bought a house through Rocket Mortgage.  The first time was a lot better experience for sure.  This time they were a lot more nit picky over every single detail on the house.  The initial financial end was quick and easy.  The part regarding the home itself was misery.  Every little detail had to be inspected by a specialist in that field.  Appraiser couldn't figure out how to turn on the heat?  Have a certified contractor come out and check it on your dime.They kicked back against the first house I chose so much I moved on.  Bought another house (that I love), but it had way more problems I had to fix upon moving in compared to what I would have had to with the first one.", "rating": 3}, {"title": "I didn’t like the constant changing", "text": "I didn’t like the constant changing. One week I’m good at 5.9% with debt being paid off and I’m looking at 20k cash out. Then it’s $500 the next day and the entire loan was changed. Then the loan gets fixed but now I need more points and go to 5.6% which cost $20K and I end up with 9k. I didn’t like the inconsistencies on why certain things needed to happen. My insurance quote was wrong. My loan payoff was never updated and I have to recoup the over payment. I didn’t like being given checks (never told until loan was finalized and I read it in the app) to pay off my debt. Why couldn’t you just send the payment to the entities being paid? A while additional step that cost me $80 to mail. Just really stressful and honestly I feel like I lost equity money with all the redicukius charges and points “needed” to make the debt to income work even though I was paying off all debt and didn’t need those points in the beginning. I’ve bought 6 houses in the last 4 years and I won’t go through this with this company again.", "rating": 3}, {"title": "1ST PHASE WHEN WELL,", "text": "1ST PHASE WHEN WELL,2ND PHASE, NOT SO WELL.TO MANY COMMUNICATION MISHAPS ON FINALIZING CONTRACT.", "rating": 3}, {"title": "My banker told me that WE WILL issue…", "text": "My banker told me that WE WILL issue checks for some major bills to be paid as part of my 2nd mortgage, I did not like being told what YOU had decided to do. I would have preferred a collaboration to decide what checks to be given to me. One of the checks I could NOT have used. It was an online company. Less arrogance/arbitrary decision on the part of Rocket would be helpful.", "rating": 3}, {"title": "Easy and Quick Process", "text": "I was told that I would be able to add my husband to the deed before closing. At closing I would need to reschedule the closing because he was not on the title deed, or if I did not want to reschedule, I would have to reach out to Amrock after the closing to have his added. I choose to move foward with the closing because I wanted to make sure my creditors were paid on time. I was led to believe that Amrock would be able to add my husband after closing. When I reached out to Amrock, the following day, I was told that I would need a real estate attorney to have him added to the title deed. My first concern and question at the beginning of the process was \"can my husband to added to the title deed?\" Throughout the process, I was reassured that he could and would be added to the deed. At this point, I have mailed the checks to my creditors and am awaiting them to clear. Other than that, the process was easy and efficient.", "rating": 3}, {"title": "repetitive ask for income verifications…", "text": "repetitive ask for income verifications and constant phone calls made the process more difficult and unwelcoming.  my loan was a small one too!  I cannot imagine using rocket for higher value homes.", "rating": 3}, {"title": "Closing was easy because of app.love it", "text": "Closing was easy because of app.", "rating": 3}, {"title": "Okay Experience", "text": "RM violated the spirit of the SC law requiring them to provide me with my choice of lawyer by allowing the attorney I selected to farm out the loan closing to a third party attorney. I’m a licensed attorney and so is my husband so that’s disappointing. We have received 8 offers from RM’s business partners this week alone offering to sell us expensive insurance products that we don’t want or need. I’m only writing this review because the experience wasn’t stellar and I want RM to stop asking me to write it. I also found it less than ideal that the loan officer won’t respond once the loan is conditionally approved. The loan officer is your best friend until s/he/they earns your commission. The loan officer is more than likely told not to contact you after conditional approval. None of this is shocking because I foreclosed loans for 20 years. Closed a few too. I know how it works and I know why. It’s just an ordinary experience. I gave 3 stars since the entire process was fast. Please keep in mind that the process was fast in part because it was a second mortgage loan, not a purchase money loan, we keep good records, and we aren’t self-employed or credit challenged. We’ve closed loans as attorneys and are familiar with every piece of paper requested and included in the closing package. We also know our title is free of other liens, clouds, and encumbrances. Pay close attention to the loan documents at closing, particularly the bank account number you provided on the loan disbursement form. Our bank account number was wrong. It was difficult to communicate with the rude, poorly trained representative at Amrock. I followed up with an email to the disbursement team alerting them that we corrected our bank account number in writing on the form. Fortunately, the disbursement team received the email and contacted me prior to loan disbursement to confirm the correct account number. Most of the RM and Amrock employees were excellent other than that one employee who I spoke with the day of our closing.", "rating": 3}, {"title": "Sierra was great", "text": "Sierra was great, support staff too many mistakes.  Our Back office was never right.", "rating": 3}, {"title": "Did not follow through with what they had told me", "text": "In the past I had been happy using Rocket Morgage but thos refi they did not follow through with what they had told me and did not notify me that it would be different. I found out at the signing which was a surprise.", "rating": 3}, {"title": "Communication issues", "text": "The mortgage person we dealt with seemed ditzy most of the time and had us send stuff then forgot she had us send it. We were told if we sold items that we just needed a written invoice which we had the person do but then underwriting said they needed more. We feel like the mortgage person should know more of what is needed up front to help avoid issues. We did not know the person so we could not reach him and it ended up causing a lot of problems. This experience was so much worse than anyone else I have talked to.", "rating": 3}, {"title": "Home refinancing was refreshingly easy though there were some bumps during proces", "text": "The home refinancing was quick and relatively painless.  Felt a better explanation of available products would have been helpful.  While getting the process underway was quick, it left us unsure if we had made a good choice.  It was convenient Rocket Mortgage could easily access my financial information, but my wife needed to manually upload her salary info.  Overall, it was a good experience.", "rating": 3}, {"title": "Paper work", "text": "A lot of me having to send forms and texting information. All to make things move faster. But it still took about 5 or 6 weeks.  Closing was very nice.", "rating": 3}, {"title": "Well I did not like the fact that many…", "text": "Well I did not like the fact that many of my credit card balances were incorrect.You uded info from 2 months ago.Now i Have to call many cards for refunds.The processors were Good.I need R M to send me a reminder bill each month,I prefer to make payment cheduled for 17 of month.TO atch my pay cycle. Thanks.", "rating": 3}, {"title": "Agent was not knowledgeable about how…", "text": "Agent was not knowledgeable about how rate applies to available loan options. The information provided was incorrect and management attention was requested before the correction information was checked and corrected, could have lead to different loan option locked that is not the first choice for customers. Also she wasn’t able to explain the numbers on estimate closing documents. Realtor from rocket mortgage was not helpful, unavailable to show houses on many weekends and after 3:30pm. However, the incentive of 1.25% credit toward closing cost was very helpful. Otherwise, please consult with other lenders to verify all provided information for loan options.", "rating": 3}, {"title": "Very bad how I had to mail my own…", "text": "Very bad how I had to mail my own payoff checks to each credit card for my home equity loan adding an additional amount to pay in order to overnight those checks.", "rating": 3}, {"title": "Convienent but stressful", "text": "Overall I like the platform and making my mortgage payments and principal payments seems easy and straight foward. However I would not recommend Rocket Mortgage for first time home buyers. Vu was very vague on things like buy down points and closing credits. I bought $1750 worth of buy down points for a rate .7% ABOVE the fed rate. When I finally did some research and shopped around I found multiple mortgage companies offering me better rates with no buy down points. When I spoke with Vu and expressed I was upset I wasnt aware there would be buy down points when I agreed to the loan, he told me he could either offer me additional credits to offset the cost or lower my interest rate, I opted to take additional credits which I never recieved. If I wouldve shopped around  first and had been more knowledgable on home buying, I wouldve saved myself a big headache. All in all rocket seems okay and the user interface for the mortgage app is very nice, however I would never recommend a first time home buyer to use Rocket.", "rating": 3}, {"title": "They made the process too complicated.", "text": "Date of experience: January 26, 2024", "rating": 3}, {"title": "Better communication between your…", "text": "Better communication between your people with each other. I ended up sending the same info to three different people doing the same job.", "rating": 3}, {"title": "it took to long", "text": "it took to long . had to fight to get what we were promised", "rating": 3}, {"title": "Very slow on payoff", "text": "Very slow on payoff. Other companies have everything  ready at signing. Applications was very long.", "rating": 3}, {"title": "Rushed did not get final pay off amounts", "text": "Date of experience: January 26, 2024", "rating": 3}, {"title": "Not as smooth as before.", "text": "This was third time I used Rocket Mortgage and didn’t feel it went as smooth as it has in the past. Don’t feel I was given truthful  information when I first talked with them or at least it didn’t end up being how I was originally told or agreed to. Not so happy.", "rating": 3}, {"title": "I liked how easy it was to begin with", "text": "I liked how easy it was to begin with, but got more frustrated as we went on. I felt like there wasn't communication between representatives. I was ask to do the same things over and over again, after I had told them I had completed the task. Some of the representatives need to learn about different aspects of homes before they tell you what needs to be inspected. Just got stressed when speaking to multiple people and getting multiple different answers.", "rating": 3}, {"title": "My banker did not keep me well informed…", "text": "My banker did not keep me well informed about my loan progression. The closing department had the wrong information about forms in my loan. One department would tell me one thing and another group would tell me something else. Very confusing.", "rating": 3}, {"title": "Some things were left to closing which…", "text": "Some things were left to closing which made a difficult  They were not given to  me unti closing closing after repeated triedThis was highly annoying.  This is just one one example  This is is just one are example", "rating": 3}, {"title": "Your insistence on a 2nd appraisal was…", "text": "Your insistence on a 2nd appraisal was a hassle. Turns out was not in your favor. Please trust Alaskans to know their market.", "rating": 3}, {"title": "My Mortgage", "text": "Took longer than expected to close", "rating": 3}, {"title": "The process started well and I was…", "text": "The process started well and I was happy with the numbers and elected to move forward. Hard credit was pulled and rate was quoted. When closing docs were sent interest raye was slightly higher than quoted with no explanation. Not as honest as I would like but docs and paperwork were done. Didn’t want another hard pull going somewhere else. Lesson learned.", "rating": 3}, {"title": "Relay of information was not clear", "text": "There was a great deal of misunderstanding abount confirming some paperwork, it took much longer to get approved and required me to request my original loan person to esclate the issue.  It was finally very simply resolved but the difficulty of not talking to someone who really understood what was needed was fustrating", "rating": 3}, {"title": "It moved quickly", "text": "It moved quickly; however, I was told that I’d get back $7000 at closing but only got $6000. In addition, you didn’t have all of the totals for the credit cards. There were pending charges unaccounted for.", "rating": 3}, {"title": "Stop playing games", "text": "I felt like I was in a car dealership.  They kept coming back with a new offer and a new reason why it had to be this way.by the end it got so ridiculous  and it was like we were backed into a corner with no other options. The offers were change Atleast 5 times and it soured our dealings with you.", "rating": 3}, {"title": "I had to double my down payment", "text": "I had to double my down payment. That was not discussed. Seems like the costs were higher than expected as well.", "rating": 3}, {"title": "Very poor in paying what you said we…", "text": "Very poor in paying what you said we needed to pay. Had to use my envelopes and my stamps and physically mail out the payments.  You would think it would have been easier to do wire transfers.  Your system is old fashioned.", "rating": 3}, {"title": "Too long of a process", "text": "Too long of a process. Victor was great but the whole process wore us down. Not a pleasant experience.", "rating": 3}, {"title": "The communication between people and…", "text": "The communication between people and departments is horrible. Resenting of the same document is very frustrating.", "rating": 3}, {"title": "The process got off to bad start due to…", "text": "The process got off to bad start due to conflicting information about construction issues. As we had started a remodel prior to applying for loan, the master bath was unfinished. Despite us disclosing that up front in writing and with photos we were first assured it was ok due to functional 2nd bathroom, then we were accused of not disclosing. I then had to spend $5k out of pock to \"finish\" the bathroom knowing full well it would all be demolished when we secured the loan to pay for the remodel.", "rating": 3}, {"title": "Bumpy at first", "text": "not smooth at first had to walk away once then they came back with a decent offer that they should have showed me to begin with would have saved us both time and me money", "rating": 3}, {"title": "Like the simplicity of the loan…", "text": "Like the simplicity of the loan process, the gentleman that helped was pushy and the appraiser was very rude and if I could change one thing it would be that the description of our house was poor and the comparables not even in the ball park talked to the loan officer he said yeah and agreed but did nothing to help the situation. After feeling hopeless I seen you can request a different appraiser but it was to late at that point. Overall I felt force to take the loan hopefully can refi again at some point when it isn't so pushy and miss representation of my property.", "rating": 3}, {"title": "Should only have to send info once!!", "text": "My loan application associate was fantastic, quick, efficient. She was great. The underwriters on the other hand were sent the same info multiple times without looking at what was there. If they had. They would have realized that it was sent originally. No need for the second and third round!!", "rating": 3}, {"title": "It was quite stressful when I was…", "text": "It was quite stressful when I was upfront and honest about everything. I told Leslie I was on a note with my husband. She sad due to my credit score note a problem. When it came very close to closing time then I find out by Jason that without a co signer I could not buy my new home. Fortunately my son was able to help me out. As u know it’s stressful enough without added unknown unforeseen misinformation. Jason was very helpful. Other info about Leslie I would be happy to talk to someone.", "rating": 3}, {"title": "There are too many hand-offs in the…", "text": "There are too many hand-offs in the process and conflicting information. It was exhausting.", "rating": 3}, {"title": "Poor communication, and lots of confusion", "text": "First of all, Zach was amazing. I would have walked away and started over with a different company if not for him.The rest of the team seemed to really struggle with consistency and with communication. No one was on the same page and it caused me some serious delays, nearly losing the house.", "rating": 3}, {"title": "Distribution of funds", "text": "My only criticism was the distribution of funds.  They didn’t designate the checks totaling over $60000  were sent certified which would require my signature.  Instead  they were hung on my mailbox a quarter mile from my house after dark.", "rating": 3}, {"title": "Your loan process", "text": "The site that was used to process the loan was very user friendly..  However, the processing of the loan was slower than expected. Because the loan is processed on line, the process seemed to lack that personal touch. Sell you product then the people are gone.", "rating": 3}, {"title": "Closing cost was too high", "text": "Closing cost was too high. Closing numbers didn’t match with closing numbers provided by Title Agency. Lack of follow up calls from Rocket Mortgage loan officers.", "rating": 3}, {"title": "The initial sale was very promising", "text": "The initial sale was very promising. Between our options we went with them. Some information was not very well explained and we really had to scramble at the end to get everything done in time. We also had 3 different people that we were passed between during the whole process. One of them was not the nicest person.", "rating": 3}, {"title": "Zia was my representative from Rocket…", "text": "Zia was my representative from Rocket mortgage and he was fantastic! Explained everything very well and the whole experience from start to closing was very simple.  Would definitely recommend to all my family and friends.  Thank you Zia!", "rating": 3}, {"title": "We needed better communication", "text": "We needed better communication. Three accounts needed me to pay them off, no one stated loan would not move forward until the accounts were paid. I finally had to ask. Your associates were all very respectful and friendly. I like dealing with your company. Sometimes you just need to give better explanation of what is needed.", "rating": 3}, {"title": "Last year I had my house refinanced…", "text": "Last year I had my house refinanced through rocket Mortgage.  The appraisal came back as we anticipated.  This year they reached out again stating I’d get a lower rate, pay off my credit cards, and have extra left over.  Plus, my mortgage would go from 30 year to 18 year.  We got my house appraised again, and it depleted by $45,000!  So everything they stated, and the hoops I had to go through for this refinance, I was not happy with. I ended up with an extra $4000, still a 30 year mortgage and nothing paid off. Last year I would’ve given five stars. This year, unfortunately, only three.", "rating": 3}, {"title": "NEVER AGAIN!", "text": "Even though rates were high, thought process would be smooth. No such luck. Changed approval conditions on me AFTER I was locked into a purchase. Then kept requiring petty actions. Even to the point where a $12.41 check was required to be printed at Closing to pay Lowes. NEVER AGAIN! Will be looking to refinance before end of year.", "rating": 3}, {"title": "Not super pleased, wouldn't say I recommend", "text": "Our actual mortgage banker was kind and informative but the whole process was like pulling teeth. The last time we purchased a house there wasn't nearly the amount of hoops to jump through. This time around start to finish took like 3 months. Thankfully we were purchasing from family otherwise we would have been homeless for 2 months. At one point they tried some fear tactic to get me out of my 2.5% auto loan. Had to put my foot down and almost walk away from the deal because that was insane. If it weren't for one of our good friends referral I would probably have given this time around a 1 or 2 star rating.", "rating": 3}, {"title": "It Was okay.", "text": "Date of experience: January 13, 2024", "rating": 3}, {"title": "Took longer by two weeks then what was…", "text": "Took longer by two weeks then what was originally talked about", "rating": 3}, {"title": "I was told that my closing would be…", "text": "I was told that my closing would be before Christmas and it was well after Christmas. I didn’t like the checks because I pay everything online through bill pay and had to call companies to get mailing addresses and account numbers", "rating": 3}, {"title": "Disappointed", "text": "Poor communitcation", "rating": 3}, {"title": "I should have waited!", "text": "You gave me a 5.49% rate after several rounds of negotiation effective on January 3, 2024. 0nly 15 days later (today) Quicken Loans has offered me 5.1% with a $428,000 total loan amount. So now I am stuck with your loan (434,000) until at least August. I wish I would have been advised by you to wait until new rates were available to see if you could do better. I learned a hard lesson! How can Quicken do so much better than you only 15 days later?", "rating": 3}, {"title": "Patient agent.", "text": "Patient agent.Underwriting very picky.", "rating": 3}, {"title": "Stressful with Rocket Mortgage", "text": "ROCKET mortgage was very stressful to work with. Our loan officer made us a lot of promises that weren't kept! Also, Cameron dropped the ball toward the end, so we didn't close on our original date, which caused us a huge expense of having to live in hotels for a month!", "rating": 3}, {"title": "Not always trust worthy", "text": "Use any excuse to break promises when it comes to lock in APR! Normally customer friendly but I now see another side as they grow larger.", "rating": 3}, {"title": "Sales rep made untrue promises", "text": "Sales rep made untrue promises. i.e. first payment won't be due for 2 months. Not true.  Will close within 2 weeks. Not true. Can cut 30 year mortgage down to 15 years by paying extra 500 per month. Not true.", "rating": 3}, {"title": "Stressful", "text": "Had to do too much back & forth with them.im 79 years old.and they needed so many things from me for the loan..Spent a lot of hours on the phone and a lot of time going to different places trying to provide what they needed. It was a stressful experience...", "rating": 3}, {"title": "Lock in rates can cost you", "text": "While the process is generally easy, this go around was quite disappointing.   The title company did not perform timely therefore costing me additional funding for extending my lock in rate and the Rocket team would not use new and existing rates which were lower when my lock expired.  I am not sure this is even legal", "rating": 3}, {"title": "Okay", "text": "The person we were working with was great. Always available and answered our questions. But when he went on vacation and someone else took over just days before we were to close, it all went downhill. Lots of \"issues and more needed documents\" were suddenly needed  just hours before closing. We were so anxious and mad that we just about called the whole thing off.", "rating": 3}, {"title": "Still Waiting", "text": "Although we generally enjoy your services I’m very confused about the payout on this loan. We were told that as a requirement for our loan the money would need to be sent to the creditors. Why did these not get sent through wire transfer? Sending us the checks to send delayed the process by weeks. I mailed the checks the day after I received them and they still have not cleared a week later. I called originations to make sure the checks hadn’t been cleared from them and they said the mail can take up to 3 weeks. In the meantime we are paying interest and minimum payments. I’m addition the account balances they used to create the checks were 3 weeks old and did not match the balances on the accounts causing us to send more money to accounts then needed to payoff. I was told that I would be getting an updated list of payoffs but never received until closing day. They added a creditor that was 0 interest which I did not want to pay off and instead left a creditor that we are not paying off at 22%. I did not want to delay the closing further so I let it go but looking back at it this was done very poorly on your part and I wish we had the money sent to us to payoff or for the money to be wire transferred immediately. Still waiting on all checks to clear and I’m making overdue payments. When I called and spoke to originations and asked why we had to deal in paper checks they responded by saying “I don’t know that’s a good question”. I could have shopped around for this loan and I have loved your services in the past so I didn’t bother to but now I wish I had.", "rating": 3}, {"title": "3 stars", "text": "Better clarification of important details for first time homebuyers and to provide genuine help towards what's right for the client and not just trying to get a client under contract to purchase a mortgage", "rating": 3}, {"title": "Rocket representative", "text": "Rocket representatives missed one of the accounts and stated did not show up on credit report", "rating": 3}, {"title": "Could have been a better experience", "text": "First let me start by saying all of the people I worked with were great and polite. My issues were they don't communicate very well amongst each other. I would receive 3 calls all from different people asking the same questions. Many times it would be asking me to upload a document to their site which I had already posted. Now after my closing I am having to deal with my insurance company wanting to cancel my insurance because they were not paid in full. Turns out that when my paperwork was completed by Rocket they had an error in the paperwork shorting the insurance payment.This is not my first mortgage with Rocket, and I generally have had decent experiences with them. I would like to see them develop some tools to communicate with each other better to reduce the amount of calls I receive.", "rating": 3}, {"title": "fees where crazy", "text": "fees where crazy, after refinancing not to long ago.", "rating": 3}, {"title": "Service review", "text": "I like it until it was signed. Tried to get ahold of Akeem to get some information and he never got back to me. Also looks like they are already taking payments out. I was told that would not happen until February.", "rating": 3}, {"title": "I was assigned to a representative that was \"let go\"", "text": "I was assigned to a representative that was great.  I was told she was \"let go\".  From there, it went sideways.  Had repeated calls with things that did not pertain to me, or had already been complete.  Many different callers that were unfamiliar with my case, leaving me having to repeat myself again and again.  Amrock called to confirm an appointment with me in Fla, I live in Mass. They had to visit the sellers for signatures twice, as the documents were done incorrectly.    Overall, if the staff wasn't so nice, it would have given one star.", "rating": 3}, {"title": "Na na na", "text": "Na na na na na na", "rating": 3}, {"title": "Sent same documents several times", "text": "We were required to submit some of the exact same information, three or four times. In total we had to upload 124 documents, some of them 10 or 20 pages long. It just became ridiculous after a while.", "rating": 3}, {"title": "Took too long compared to previous…", "text": "Took too long compared to previous processes.", "rating": 3}, {"title": "messed up twice on trying to get my…", "text": "messed up twice on trying to get my loan done and it still isn't done", "rating": 3}, {"title": "Somehow you leaked my phone number and…", "text": "Somehow you leaked my phone number and I received hundreds of calls from mortgage companies", "rating": 3}, {"title": "The time it took & problems with the…", "text": "The time it took & problems with the web site", "rating": 3}, {"title": "Lengthy experience", "text": "The agents working on it were nice but the communication process and the time it took to finish the process was longer than expected especially when we have done business with them in the past and they have a majority of our information.", "rating": 3}, {"title": "Certain items were asked for over and o…", "text": "Certain items were asked for over and o er again.  When we thought everything was finalized they would find something else and it lingered longer than it should costing us more money than expected.  I felt like we had to push the communication to get loan closed.", "rating": 3}, {"title": "I disliked the slow way to get closed", "text": "I disliked the slow way to get closed.  Issues were raised one at a time and had they all have been raised at one time, the process would have moved much faster.  The closing statement included payoffs and I received checks to pay them off but no information as to how to pay who with what.  The information appeared to come from a credit rept.  I had to make many calls to match the payoffs.   I feel like that was a wrong way to handle them.  I still have 2 checks to figure out what to do with.  I have called and no one seems to be able to help me.", "rating": 3}, {"title": "The fact that was promised a certain…", "text": "The fact that was promised a certain date and could not deliver. Do not have protection in place to print documents when data is breached.", "rating": 3}, {"title": "messed up twice on my loan", "text": "Date of experience: December 30, 2023", "rating": 3}, {"title": "Extremely pushy …", "text": "I went online to check the rate and was immediately called by a rocket mortgage representative. They then continue to call and text message me repeatedly for the next week. Sometimes I would receive upwards of six phone calls in one day the actual process of filling out the documents, and completing the closing, was smooth uneventful though, but they are extremely aggressive and pushy in their marketing.", "rating": 3}, {"title": "Process was easy until I got the the…", "text": "Process was easy until I got the the preprinted checks to pay off debts. That was horrible. Several checks were not made out to the right companies. It took over 5 hours on line and by phone collecting statements and payment addresses. Would have been perfect if I could have just made the payoff payments on line. Most of the checks were over payments and I will have to wait for them to be mailed back to me. It was just very stressful and aggravating.", "rating": 3}, {"title": "Day of price change", "text": "Our reps were great but the price change the day of closing wasn’t cool", "rating": 3}, {"title": "My HAPPY, Sad, Finally GLAD Experience", "text": "I started out a 5-STAR rating, but by the end, I could only give a 3-STAR.  There were TOO MANY delays (4 mos worth), waiting 3 days to verify each piece of info.  Jay was my original contact person and the best overall.  Even knowing time was critical to us, made no difference as EVERYONE INVOLVED had to dot every 'i' and cross every 'T'.  It made me feel like a second-class citizen for even starting the whole process.  Since we were paying off an 'INTEREST ONLY LOAN', it was just 'throwing money away every day' (by delaying) and never reducing the principal that we STILL had to pay off.  (We had to pay over $5K in interest payments that was just money thrown away!)  After our house appraised at $100,000 more than we were getting out, someone should have been able to relax some procedures - knowing you could always get your money back.  I was glad to get loan but because of DELAYS, DELAYS, and 3-day waiting periods, interest was higher than what we started with and the STRESS and DELAYS made the 'ending' anticlimatical for me.  I hope I never have to go through that whole experience again.  I guess my biggest piece of advice would be to 'know' the people you are dealing with, have a better understanding of their situation, and try to 'save' them money through the whole experience.  When you decide someone is 'Approved' for a loan, then GO FOR IT in the speediest way possible.", "rating": 3}, {"title": "Normally tttttttttttt", "text": "Date of experience: December 29, 2023", "rating": 3}, {"title": "I felt that I was treated as someone…", "text": "I felt that I was treated as someone who had never had a loan before. I almost canceled the whole deal several times because of this. I'm not sure why I stuck with it, but I did. Everyone I dealt with was cordial though.", "rating": 3}, {"title": "The random people handling the the…", "text": "The random people handling the the different processes I found myself responding to ppl who were not even aware of the situation", "rating": 3}, {"title": "Closing process was not smooth", "text": "Closing process was not smooth.  I will not utilize Rocket mortgage again.", "rating": 3}, {"title": "I was told that if I download the…", "text": "I was told that if I download the Rocket App we would close earlier than the expected closing date.  That did not happen.  Felt that there was a lot of down time where our application went no where. Other than that it was great. Our loan officer was a great lady.", "rating": 3}, {"title": "Lack of communication within the system", "text": "What was frustrating was the amount of times that I had to submit documentation sometimes three times and at different times .  I still have not received monies due me at  closing!  It is almost like to many hands are involved in the transaction and no inter communication within the system .  Yesterday I was asked to provide proof of homeowners insurance and when I went on the website the insurance policy pops up and is current ! Perfect example", "rating": 3}, {"title": "Overall process was good but two…", "text": "Overall process was good but two hiccups.  1) a rocket employee chose to call me and argue with me over a roof inspection.  She was not even in her bounds of her job description.  2) Rocket took a single word from the appraisal and made it a requirement vs recommendation.  And the appraiser's own words conflicted.  He rated the house fair yet said recommend roof inspection.  Recommend.  Rocket decided that meant require.  Its bs and it cost me unnecessary anxiety and money.", "rating": 3}, {"title": "After getting a more aggressive agent…", "text": "After getting a more aggressive agent to help us things moved much faster. I felt like the fees they charged were very high as well .", "rating": 3}, {"title": "Disbursal of payouts was a nightmare!", "text": "Everything was great and moved quickly and smoothly through the closing.  That was where the problems started.  We were not informed about how or when we would receive the funds for the cash out, and the payoffs for the various loans and credit cards.  It took a number of calls to several different individuals (our original loan adviser ghosted us after the closing and failed to answer, return calls and/or texts.)  We were able to determine that the vehicle loan and former mortgage were paid off quickly by the new lender, and the cash out amount appeared in our requested account, however we did not know how the other creditors were to be paid.  After a week of trying to find that out, we finally received individual checks for all the remaining creditors.  Since the checks were made out to the creditors, I had to research each one to find a proper place to send them and who should receive them.  Some of the checks showed they were My husband's account, and he was not on the account, causing more confusion.  It took three full days of hunting down addresses and phone numbers for 9 different creditors.  In addition, I was advised by Rocket Mortgage to send using a tracking number.  I wanted to get them out as quickly as possible to avoid additional interest charges, and since it was Christmas season I fought the lines at UPS and USPS (UPS doesn't ship to P.O. numbers and some of the addresses I eventually got for several of the creditors were P. O. Boxes).  It cost me nearly $300.00 for all of the shipping charges.  Then the follow up started.  Only a couple of the creditors received and posted the payments in a couple of days after receipt.  As of 16 days post closing, two of them have still not posted the payments, causing additional interest to be added, and at least two more awkward days of hunting down someone to speak with me about it.  All of this could have EASILY been avoided if the payments for creditors had been made available to me to post electronically immediately after being received, since that is how they were all being paid.  Several of them don't even allow (they are not set up for) for paper checks as payment.  Or, if we are not \"trusted\" to make the payments ourselves, then AmRock could make the payments directly themselves.  Either way would save nearly a full week of excruciating research and dispersal and substantial additional cost for mailing and tracking, in addition to the unnecessary additional interest charges accrued by the additional time for the payments to be posted.    I feel I should be reimbursed at least for the cost of postage and interest.  This was a VERY inefficient way to complete the pay outs and needs to be implemented in a better fashion.", "rating": 3}, {"title": "Several miscommunication issues", "text": "Several miscommunication issues.  I would ask has loan been approved, never got a yes just it's conditional.  Still don't understand the insurance issue we had.  Then name spelled wrong on documents notified the day before closing.  At closing name still wrong.", "rating": 3}, {"title": "The speed in which it started and…", "text": "The speed in which it started and approved to lend us. It however totally fell apart at appraisal. There was an unqualified/minimal experienced appraiser, and then your collateral department really didnt know what was up, or its actual meaning with the appraisal report", "rating": 3}, {"title": "very slow", "text": "They are very slow at getting everything done after they tell you it would be good and then they give you a whole bunch of stuff that you got to do just to get the loan.", "rating": 3}, {"title": "It took to long for the entire process…", "text": "It took to long for the entire process especially being a rocket mortgage customer already. Then i was rushed at one point by having to call to verify something and i was told if i didn't call by the end of the day, my case would be closed. i called the next day and it was corrected but this is not how you do things especially when i submitted everything timely.", "rating": 3}, {"title": "Unacceptable experience!", "text": "Blake did a very good job with our initial loan procedure. Our process was delayed by our original lender, as their service was \"down\". When payoff was finally obtained from our lender, which was an extended amount of time, the payoff numbers for our other debt consolidation were not. We continue to be $2500 in credit card debt after a refinance to consolidate everything. Of course, our final disclosures indicated this, however, it was too late!", "rating": 3}, {"title": "Good enough", "text": "Craig was helpful and informative. Other members of the team were less helpful. Craig’s cover rep on a day when he was out of office quoted us a rate almost 1% higher than the actual rate available to us, which nearly led to us not making an offer. A day before closing our agent found us cheaper title insurance. Somehow this led to a $150 increase in our cash to close. No one from Rocket Mortgage could be reached after 3pm that day to explain the issue. Throughout the loan process it seemed that most employees had no idea the specifics of relocation program reimbursed loans.", "rating": 3}, {"title": "Overall", "text": "Overall, it was easy and quick. But when o had questions, it often took a long time to respond. In particular, our house payment was due on December 1 and we were still finishing the process for the new loan. I asked our loan officer if we should make the payment. He said to do whatever the app says. Well, since it was still our current mortgage and not the new loan, I made the payment. He later said we should not have made that payment and we would have been able to skip a payment in December and January. That would have been useful information to have and it’s why I asked before making that payment. I know it applied to the new loan, but having that extra money in pocket would have been very helpful.", "rating": 3}, {"title": "Great until pre-closing", "text": "Great until pre-closing.  Everything had been set, then we had to show letters of things that were paid off.  We had to submit a few multiple times.  I was told via email and verbally this was taken care of.  Then at closing one of the major ones that was paid off months prior was never updated on their end and added almost $3k to our closing.  Otherwise happy with the service.", "rating": 3}, {"title": "Keystone Cops of Communicatin", "text": "Very personable team but seemed like one group didn't know what the other team was doing.  Rocket could should use better lines of communication and maintain the same information through the process. We provided the same info multiple times and received a word salad explanation each time we asked for an explanation.  Even the closing was confusing.  We scheduled a closing at one specific location (because that's where we were and the final paperwork and checks were sent to another location over 1200 miles away. We were asked to do followup on work already provided  up and check on issues that, in the past, was always done by the lender / mprtgatge team. We've purchased 3 homes and refinanced a few times over the years with Quicken (now rocket Mortgage?) and it was always a clean process.  Clearly stated next steps and follow ups were precise and initiated by Quicken.  Everytime I was asked for additional info,, I was told, \"Just need one more thing.\" ALWAYS resulted in another \"one more thning\".  Got to the point I was ready to drop the whole thing but my wife said, \"we've come this far, lets finish it\". I could go on but you get the gist, very frustrating..... Don't get me started on the closing company Amrock.", "rating": 3}, {"title": "I am still not sure what I learned 1st…", "text": "I am still not sure what I learned 1st with Mark.Told if rated go down so will yours and it would never go upWes told me I would need to refinance??", "rating": 3}, {"title": "The processor was short", "text": "The processor was short, difficult to talk with and get in touch with. The closing attorney was an hour late, holding us up as well as our witness. Communication was not the best, appointment made should be appointment kept, regardless.", "rating": 3}, {"title": "Had difficulty downloading documents to…", "text": "Had difficulty downloading documents to file. Also had to send the same documents several times to the same person. It would be nice to have calls returned and the ability to give explanations to documents.", "rating": 3}, {"title": "Second time was not a good experience!", "text": "I was disapointed with the amount of time it took for the process to take place and lack of communication.", "rating": 3}, {"title": "Too many reduntant questions", "text": "Too many reduntant questions. There were questions that were suppose to be ready the next day and she had only begun to calculate the numbers when I called", "rating": 3}, {"title": "Much too long to reach closing", "text": "Much too long to reach closing. Advertise quick money if you make a loan. Entire process took a month. Payoff of loans should be done by Rocket instead of mailing checks to lender.", "rating": 3}, {"title": "Things started great but finished poorly", "text": "While the Loan Officer and Processing team were great, someone dropped the ball because my title company wound up sending me the payoff checks so I could send them to the payees because Rocket never provided account numbers or statements for the title company to use. After multiple attempts, the title company relied on me to add the missing information and overnight all those checks even though I had already provided statements, more than once, for each account, to Rocket during the underwriting process so as the keep the figures accurate. How do you provide a payoff without the account details and/or statement so that the payment can be properly applied? This is basic stuff.My loan closed on 11/30 and its now 12/15 and we just ran over to UPS to overnight the checks and avoid making another monthly payment on some of these accounts. A few could not be avoided because they were due early in the month. Tighten your ship Rocket. Front end was awesome. Back end, not so much.", "rating": 3}, {"title": "THE FEES AND THE INTEREST ARE TOO HIGH", "text": "Date of experience: December 08, 2023", "rating": 3}, {"title": "Trying to get my old mortgage straightened out while refinancing", "text": "MortgageTrying to get my old mortgage straightened out was a nightmare.  Payment being returned without explanation when all Rocket Mortgage needed to do was inform me that the account # was missing.  There was plenty of time since the payments were made well in advance.  After being with rocket mortgage for many years, you'd think you could extend the courtesy instead of reporting me to the credit agencies.  My payments have been on time or early all along and this was the first mess up.  Even when I asked why the checks were returned they could not give me an answer until it was too late and the damage was done.  I had a great impression of Rocket Mortgage previously, but now I would definitely think twice before recommending Rocket Mortgage to anyone. Gone from a strong 5 star rating to a weak 3 star.                                                                                     (edit 12/16) Got yet ANOTHER request for payment for mortgage payments when they WERE PAID when I refinanced WITH Rocket mortgage, They were informed SEVERAL times that this was the case and in fact told me that there was a zero balance on my previous mortgage when I spoke with them,  Seems that they do not know what they are doing in accessing the same information , Their 3 star rate is rapidly becoming a shooting star to a 2 star rating.", "rating": 3}, {"title": "They had a hard time getting all the…", "text": "They had a hard time getting all the paperwork right. I signed on 12/04 /23 and still have more paperwork to sign tomorrow.", "rating": 3}, {"title": "I disliked that I was lied to", "text": "I disliked that I was lied to, i did not get the 1+ loan and no explaination was given as to why I did not get it. I am not satisfied with Rocket Mortgage.", "rating": 3}, {"title": "I have used Quicken Loans/Rocket…", "text": "I have used Quicken Loans/Rocket Mortgage MANY times over the past dozen years. This was my worst experience to date. You really need to educate both your staff and your customers on the nuances of financing a manufactured home. Your staff gave incorrect information in several areas and late information in others. Informing the buyer up front would remove a LOT of headaches.", "rating": 3}, {"title": "Conflicting information from different…", "text": "Conflicting information from different people.  Couldn’t process loan as I wanted.", "rating": 3}, {"title": "Kicked off great", "text": "Kicked off great. Communication was poor during closing.", "rating": 3}, {"title": "Useless customer or client relations section", "text": "I give Darr Grodi five stars for his dedication and professionalism that he exemplified during the entire process.  Now, the rest of my loan experience deserves ZERO stars. Prior to our closing we were told that our first payment would be 45 days after the closing. On November 28 a representative that Rocket Mortgage sent to my house came in for the closing. He had everything highlighted for signature and this happens very fast.After, everything was signed he stated that the funds would be deposited within 48 hours.  I checked everyday the Rocket Mortgage app because we were told by Darr that if anything needed to be done it would be in the app.   Days went by and no deposit was made. On December 7, I received a phone call by Christopher Betancourt and he told me that an error was made in the calculation of the loan and that is why I had not received the money.  So basically, the loan was not closed unless I signed the new document. At that time I asked if my due date would be change because of the error and he told me to contact Rocket Mortgage.  I called Rocket Mortgage and was transferred a couple of time after inquiring about the due date. Finally, I was transfer to customer relations or client relations and spoke to a women who I cannot remember her name.  It was obvious that she may had been in charged because of her demeanor on the phone.  I explained to her what had happened and she said that despite the issue my first payment was going to be due on January 1, 2024. I told her that that was 24 days away and that I have not received the money.  She said, again 1 January my payment was due.  I said, I have not received the money lady, so why would I make a payment on money that I have not received. She said, that during my 28 November closing I signed a document that stated so and no one could change that.I told her that I was told that about the 45 days after payment was received. She said that I didn’t have a payment in December and I said, “off course not, you haven’t pay me yet.” She said, you got a free month December because you didn’t pay your previous loan.  I said, listen lady check your facts because my house payment is paid through March 2024. This has nothing to do with you not wanting to honor the 45 days and by this time her blabbing was annoying.  This woman that is supposed to be able to help is totally useless at best. If this is what she does on a daily basis why waste payroll.  Just get rid of the entire section because all it is, a charade that no customer deserves to have to put up with. Lastly, The three stars are due to her actions and her demeanor. Darr deserves five stars, so apologize to Darr because this is not a reflection on him, but the la k of common sense of a useless section. You may contact me if you have any questions.", "rating": 3}, {"title": "dripping request after request after…", "text": "dripping request after request after request after request on a tiny acquisition.", "rating": 3}, {"title": "Quick response by the RM loan team", "text": "Quick response by the RM loan team. I was kept updated on the loan process, during the entire application. After loan was complete, I became inundated with Insurance applications, of various companies, containing my personal bank information associated with RM.", "rating": 3}, {"title": "Expect the unexpected, not in a good way.", "text": "There was a lot of nonsense about our thirteen year old solar system, which we purchased in full.  Ridiculous requests for a statement from the solar company on what would happen if the home was foreclosed on.  Look, if you also asked for a letter from the plumber who installed our toilet what would happen to it if the home was foreclosed on, it might make a tiny bit of sense.  To throw this curveball at us after we were told that everything was done, left a very sour taste.", "rating": 3}, {"title": "This is my third Lon with Rocket…", "text": "This is my third Lon with Rocket Mortgage. This last experience was not pleasant. The staff were nice but it took too long to review documents and approve. It took 4 weeks to get a closing date!!! That’s not acceptable  PERIOD. We went to closing review the final estimate and it was found they’re were not including my home insurance and they i needed to bring in money for the closing. If I would have known that 4 weeks prior I could have closed in the house. Most of the exchanges were done by text!!! What a  wrong approach! Some things need to be handled with one of your professionals on the other side of the phone so they can explain the details of the loan. The texts should be for clarifications or please go check the app.", "rating": 3}, {"title": "Long and tedious", "text": "Date of experience: December 07, 2023", "rating": 3}, {"title": "The communication from the initial…", "text": "The communication from the initial start was great but wants to process got started and it seems as if it was noticed that the loan would be approved. Communication became distant. When prompted with information online an asked would you like to speak to someone, no one called back.", "rating": 3}, {"title": "Paying off my debtor by sending a check…", "text": "Paying off my debtor by sending a check causes more delay and late fees for your customer. Everything is digital these days and that should be also", "rating": 3}, {"title": "Did not pay off what we asked to", "text": "Did not pay off what we asked to. Added a low interest debt instead of paying off high interest credit debt as requested. Only sent preliminary to husband and then changed. I never saw what was paid off until after signing. Did not go over it at signing just handed pages to sign with absolutely no explanation. Extremely frustrated as the whole point was to pay of high interest credit cards.", "rating": 3}]