[{"title": "It was good in beginning very weird at end ", "text": "Honestly kinda stuck between 3 and 4 stars.  Individual I spoke to daily/weekly for a month . Soon as agreement was reached he was no longer around . No return of texts or phone calls . Before he'd call back before I could even get a message out . I left message still no return its been a week.  Cashout did happen exaggerations were made and like I said when guy disappeared after I guess \"his part\" was done felt very scripted and did not give me  warm n fuzzy or specifically want me to use new day again in future. Also payout they wrote checks to each company then mailed me the checks then wired me the cash leftover . Then i mail said checks out ? I'd prefer all cash pay way I always do not send out 9 cashier checks to credit card companies . Everything seems to have worked out not exactly as explained to me but Noone around to answer again after the fact ...not even a congratulations or I've had some send me a packet with cupcake before ...new day ghosted me and sent me this survey ..lol", "rating": 3}, {"title": "I wish my contact was more clear about…", "text": "I wish my contact was more clear about noticing my insurance had increased to the point of not having a change in my monthly mortgage payments.  I knew my insurance went up however it looked like it went up even more.  I received several mail packages from New Day and didn't think the mail days before closing would have a change. ", "rating": 3}, {"title": "Took a long time", "text": "Took a long time.  Issue with 1st termite.  No evidence but inspector felt like we should ward off evil spirits.  Huge red flag.  2nd inspection was professionally done.  I'm a FHA/VA underwriter.  Julian was good.  My husband had never used his VA benefit.  I wanted to refi to VA so that when rates come down we can do a VA IRRRL.", "rating": 3}, {"title": "QUIT ALREADY, WITH THE INCESSANT IMAGES OF BLONDIE McNIPPLES!I don't much care about their loan…", "text": "I don't much care about their loan programs. I just wish they'd slow down a bit with their incessant TV commercials, flooding us all with images of their pathetic Marilyn Monroe look-alike, Miss Blondie McNipples!", "rating": 3}, {"title": "Experience was mediocre at best", "text": "Experience was mediocre at best. On top of it all the company (Newday USA) turned around and sold/gave my account (after rep assured me this wouldn't be the case) to another company causing me to lose a good chunk of time invested toward credit. Wasn't until after the deal that I found other companies offering better offers. I took the company at face value due to being \"led\" by a veteran but feels more like he's used as poster person.", "rating": 3}, {"title": "We applied for a simple partial equity…", "text": "We applied for a simple partial equity loan. We had multiple employees working with us. Our credit score is high. Our mortgage payment changes constantly and we received multiple reasons. We would never use this company again and would not use recommend it to anyone. Reading the reviews posted makes us wonder if we are the only unhappy customers or if the company only loads the good reviews for potential customers.They made us lots of promises that constantly changed or never occurred!", "rating": 3}, {"title": "Shop Other Lenders", "text": "I did not use them for my original home loan but did evaluate them for my refinance. I was offered several options with lower interest rates/costs, much lower. I realize loan terms can fluctuate rapidly and they may have advantages in processing or other factors I’m not aware of because I did not use them. But I had good experiences with all my lenders. I just warn veterans to shop. Using them would have cost me thousands.", "rating": 3}, {"title": "We provide all documents required but…", "text": "We provide all documents required but still had a issue paying off ore bills.The check amounts were $130 to $170 short to pay off.We anticipated closing on the 9th but it was the 13th so we missed our cut-off time for most payments. I would like to take to you personally.  Not by email.  My number is 253 330 1885. ", "rating": 3}, {"title": "The management and staff were very…", "text": "The management and staff were very decent, all i'm saying is having low credit scores should'nt deteremine how you get good loans approvals. Apart from that, the whole scheme was fast and effective.", "rating": 3}, {"title": "At first my loan helper was very good…", "text": "At first my loan helper was very good at keeping me informed on the stages and helping me with the loan. Since getting loan, I haven't been able to get a hold of him with some serious questions I have. I've left messages for him to call me back but nothing. I still have those serious concerns and questions", "rating": 3}, {"title": "The payoff checks were delayed…", "text": "The payoff checks were delayed resulting in late charges.   I have not had any late payments in years.  I also did not receive our check as promised.  The process was easy enough,  but the end result was unsatisfactory.", "rating": 3}, {"title": "Brendan was super nice and walked us…", "text": "Brendan was super nice and walked us through everything. He communicated everything to us. I didn't like that we were told the process would take 2 weeks because our mortgage was with you before and it ended up taking 6 weeks. We were also told we could do a 100% refi with $17000 coming to us then it was $4000 coming to us and in the end we got $2900. It would be nice to know some information up front and not fluff to get us to sign with you. New Day is a great company and we would go with you again because your service is great just be honest with the facts from the beginning.", "rating": 3}, {"title": "Whatever", "text": "I don't like having to go through all the crap to refinance. I also do not understand why I can get a loan for $380,000+ but I cannot get a loan for $45,000.", "rating": 3}, {"title": "If I’m borrowing money I should be able…", "text": "If I’m borrowing money I should be able to get one check or deposit.  If I chose to pay bills using checks is a pain. Also stick to numbers you quote at the beginning don’t change them the day of signing", "rating": 3}, {"title": "Sloppy work when it comes to obtaining…", "text": "Sloppy work when it comes to obtaining creditors payoff figures. We were made aware only AFTER receiving creditors payoff checks!", "rating": 3}, {"title": "Bad experience with NewDay USA.", "text": "We applied for an Equity line of credit loan.  We have about $250,000+ of equity in our home.We needed the money to pay off about $75,000 in credit debt. Our income is above $80,000.I am an Air Force veteran and a NewDay VIP Veteran.We did not get a return call from our agent for 2 days. He finally rejected the loan due to income.This loan would have saved us about $1,200 per month in debt payments. Apparently, no matter how much equity you have in your home, $200,000 or even $500,000, NewDay USA cannot help.", "rating": 3}, {"title": "Seemed to be alot of uncertainty  as to…", "text": "Seemed to be alot of uncertainty  as to when we would close? I myself had a cash back loan  and they paid off Credit Cards! But They said they would write Checks to do that! But seems they did not consider the amounts? I paid my bills and still got my checks late? So now I have to pay again! And wait for these Companies to REBATE ME? WHY YOU COULD NOT DIRECTLY  PAY THEM TOO STOP ALL THIS CONFUSION? Just is a HUGE waste!! Money out there everywhere! This could take me 2 Months to get this straight? Who knows how much late fees? Just a Sad waste! Ending on a good note! I do Appreciate  the loan! Thank you !! HOPE THIS HELPS OUT ANOTHER VETERAN WITH HIS LOAN", "rating": 3}, {"title": "Give people more time to decide what…", "text": "Give people more time to decide what the would really like to do.", "rating": 3}, {"title": "Dont wait till last minute to get VA approval …", "text": "Insure that loan officer has all documents needed was informed at 1530 on Friday afternoon That I needed a form from VA that they did not have and closing was scheduled for the following Monday at 0800 this caused my wife and I to be with out a home for two weeks and the loan officer said we were all good to close on Friday", "rating": 3}, {"title": "I often felt during the later portion…", "text": "I often felt during the later portion of my loan process disconnected from my loan officer up until the final approval the. I felt important again", "rating": 3}, {"title": "Disappointing", "text": "Disliked the need to supply so many verifications of employment. Disliked the length of time it took to finalize the refinance.", "rating": 3}, {"title": "Because of the holidays nothing was…", "text": "Because of the holidays nothing was done on time. I’m still waiting on my payi", "rating": 3}, {"title": "Captain", "text": "The whole thing was good until the closing.  Then everything crazing", "rating": 3}, {"title": "final check sent instead of direct…", "text": "final check sent instead of direct deposited", "rating": 3}, {"title": "and you can skip a payment.......NOT", "text": "same as last time I refinanced,  I was told multiple times that I would skip a mortgage payment, and it didn't happen, my plans  were to use that skipped payment and escrow refund to pay on the principle so that would take the ouch out of closing cost, this same thing happened before on a refinancing ,its a scam ,they'll say the funding was late, and its after the 3 day cancellation clause", "rating": 3}, {"title": "I would’ve rated you five if y’all…", "text": "I would’ve rated you five if y’all would’ve sent my account and the addresses to the people that I need to send them checks off to but you didn’t do it and I called three times so far and no one has answered", "rating": 3}, {"title": "personal service up to closing", "text": "personal service up to closing. Too much paperwork added stress to my experience.", "rating": 3}, {"title": "everything seem to go fine up until we…", "text": "everything seem to go fine up until we get ready to close. The person who closed our loan was very nice however she overlooked a couple of forms which became a bit of an issue for us. Also the loans that were to be paid off were not paid off directly we received checks which we were required to fill out and mail and it did not expedite the process. We were very frustrated by this as our institutions held the checks for payment until they cleared some of them up to 7 to 10 days. EXTRA interest", "rating": 3}, {"title": "Disappointed!", "text": "At the beginning we were told we were eligible for a certain amount so we could do our driveway and get our house painted. Then we had to pay for our water inspection and termite inspection which we didn't have to which  when we refinaced 6 months ago with New Day.Then when we closed the dollar amount was half the amount we were given :(.This rep talked so fast I had to have him repeat . Both my husband and I are trully disappointed with NewDay.", "rating": 3}, {"title": "Issue was loan manager told us based on…", "text": "Issue was loan manager told us based on appraisal we would get bills paid off and $70k, then $5ok, then $35 k, and get $2200 from escrow, and by time we knew bottom line we were a few days from closing and the interest rates on the market was on the rise so we just went thru with it. Also previous Morgage company Morgage said we will only get $400 back from escrow… so it was disheartening to be told one thing and weekly it was changing.", "rating": 3}, {"title": "Mortgage Payment Issue!", "text": "I have not received my statement in the mail for the month of August and the website says my account is no longer active. This is an issue because I'm unable to make my mortgage payment, and the fault is not on my end.", "rating": 3}, {"title": "Questionable", "text": "It's hard to explain exactly why I'm only giving a 3 star but I guess it's not the service it's the cost involved. Certainly not happy with the charges are I guess you called them fees and then the VA percent it's totally out of line. So not sure that a VA loan is actually saving a veteran any kind of money and I really don't think I would recommend it to anyone else either. I was told not to get a VA loan by someone I valued their opinion but needed to get off of the ARM I had.", "rating": 3}, {"title": "Great service, dissatisfying result.", "text": "Although Mr. Flamm was very professional, attentive, and knowledgeable, I was very dissatisfied with the results of the appraisal, the final interest rate which lead to an overall increase in my monetary outlay. My current mortgage fell far short of my expectations.", "rating": 3}, {"title": "Too much wasted time waiting", "text": "Too much wasted time waiting ", "rating": 3}, {"title": "Poor communication", "text": "Newday finished the loan and I’m satisfied with the results. That said, I will say that the loan closed almost a month after the agent said it would, and the communication from the agent was poor at best.  I initiated most all of the communications between us. At one point the agent was sick with COVID, which I understand, but there was zero communication about this and no other agent called or worked or informed us what was happening.", "rating": 3}, {"title": "It took way too long to get to closing", "text": "It took way too long to get to closing. Part our fault for a complication but it was a slow process causing the interest rate to go up.  Other companies are still down by about 1% so I don’t know why New Day went up.  It was never explained. We were way too far to stop.  Person we worked with was very good and pleasant to work with.  Would I do it over again, only if the interest rate we started with we finished with.", "rating": 3}, {"title": "The first thing I was told was how…", "text": "The first thing I was told was how deeply I was in debt and that I could get money to get out of debt by refinancing my home. Then I was told my rate would be 2.99%. When I heard that I assumed that was the best I could do. Someone called me afterward , while I was driving my car and asked me if I was ok with that rate and I said yes. I wish I would have asked for a better rate but felt it was too late. My fault I guess.", "rating": 3}, {"title": "Generally it was an OK experience", "text": "Generally it was an OK experience, but difficult to contact at times. After closing, I have tried to contact Nigel both in writing and by phone several times as I have some important questions, at least, to me. To date I have not heard anything. I put average as I had fairly low expectations not  knowing what to expect.", "rating": 3}, {"title": "The overall experience was good but at…", "text": "The overall experience was good but at times was not always kept informed of where we were in the process. my only negative is that i had asked for a little more in cash from my home equity after first starting the process and the representative from new day quoted me a payment amount for the new request but when the paperwork went through the added  $10,000 i requested was noy part of the amount at closing so basically  I received a higher interest rate and payment without receiving what I wanted  from the equity in the house which far exceeded the value of the home", "rating": 3}, {"title": "The service from Jared was great", "text": "The service from Jared was great, the closing was a complete disaster. Form was missed, delays, more paperwork was signed after the official closing, so I know the dates don't match, routing numbers not transposed correctly (that we did not write) It was not the best closing unfortunately.", "rating": 3}, {"title": "Our service from Mr", "text": "Our service from Mr. Harkness was fine. However due to the COVID pandemic going forward with our application certain parts of our process took longer than normal as our country was shut down. Because of this we lost our lower interest rate. I feel that these circumstances should have been considered and our original rate which was 2.25 given to us. I have waited to write this review hoping I would feel differently with time, but I do not.", "rating": 3}, {"title": "Everything was extraordinary until the…", "text": "Everything was extraordinary until the very end.  REFI was completed, all papers signed transaction finalized.  I had one final question about the loan amount which had gone up.  The agent who had taken care of me perfectly well to that time, was nowhere to be found and did not return any of my calls.  One of your other personnel answered finally.  I did not feel the answer was satisfactory, but I accepted it just the same.  As I said previously, all was exemplary until the end.  Apparently, the loan went over a cut- off date.", "rating": 3}, {"title": "We recommend New Day ONLY IF you are…", "text": "We recommend New Day ONLY IF you are loan savvy /mortgage experienced. Our banker Labella was very accessible. The process went quickly. We stressed that it was important to us to have no surprises. Unfortunately there were new documents and errors in our closing documents to the point where we nearly had to rescind after a month of work and a half day of closing. While our final result did agree with what we were quoted, an IRRRL should not be this hard.", "rating": 3}, {"title": "Average service", "text": "Average service.  Numerous mistakes in projected closing dates.  Even had a notary show up at my house for closing before we reviewed the final documents.  The \"teaser\" rates advertised in the numerous letters were lower than the actual rate we received.  Closing dragged out over a couple of weeks.  Bottom line.  I got a better rate and will save money in the long run...but, advertising was faulty and service was average, adequate, and disappointing.", "rating": 3}, {"title": "The process was going great until it…", "text": "The process was going great until it came to paying of 1 creditor and that is when my contact guy Jessie LaFauci dropped the ball.  His part was done and that was it for him.  Then a guy names Jim Murphy got involved and every thing got fixed.  1 man Jessie would get 2 stars and Jim 5.", "rating": 3}, {"title": "It took way too long to complete…", "text": "It took way too long to complete transaction. And the va appraisal took weeks. Money dispersal wasn’t explained well.", "rating": 3}, {"title": "Nice people weak system", "text": "Nice people, weak system. Your system for  processing mortgage applications needs work.  It took me 3 tries with three different people to finally get to closing. Had to repeatedly send form and records that had already been requested and sent. It was neither an easy nor simple process. I hung in there because the mortgage rate was good and the costs fair.YOUCAN DO BETTER.Thanks for asking.", "rating": 3}, {"title": "Nothing more that a number in the system.", "text": "Still nothing more that a number in the system.  No concern, caring, interest, condescension or support.  It was just a job to get all the information, i's & t's and move on to the next vet trying to live on a fixed income.  Might as well have worked with a computerized robot. The Notary was excellent. I am thankful for the refi.  I called with a couple of simple questions. I don't appreciate being talked down too.", "rating": 3}, {"title": "Working with NewDay was fast and easy", "text": "Working with NewDay was fast and easy! I would have given 5 stars however the debt that was supposed to be paid off was not because I had a loan that occurred interest every day and that was not factored into the loan. Also as to not occur anymore debt I had to overnight checks to all the creditors so no new debt occurred from interest, and this cost me an extra 80+ dollars! Again over all was great however I would be hesitant to use them again! If your going to mail me checks to mail to a creditor why not just deposit into my account so I can Paula directly?", "rating": 3}, {"title": "Your mortgage will be sold!", "text": "Be forewarned...We refinanced our home loan with NewDay USA in the summer.  But, before our first payment was made, we were notified of a different address of where to make our payment.  By the time our payment was due, we were given a different company.  Now with our second payment due, we find out that our mortgage has been sold and the payment is to be sent to yet another company.  We asked specifically before we refinanced if they sold mortgages and were told no.  I wish we'd stayed with Loan Depot.  NEVER any issues with them.", "rating": 3}, {"title": "I was supposed to close August 26…", "text": "I was supposed to close August 26 didn’t hhappen finally closed September 21-2020 there was two other closing date in between Jasmine Martin was person working on account.Ben Ross was here supervisor he called one day said Jasmine was gone for 7 days back and forth my loan went until David called don’t know last name 877-410-5283 he was a great help David I’ll give 5 stars", "rating": 3}, {"title": "A great experience", "text": "A great experience. Getting my mortgage refinance was s good a business process I have ever experienced. Nick Barth, the man who walked me through the process, was totally professional, and way more than competent. He made it not only easy, but a pleasure to go through what is normally a trying experience. Thank you, NewDay, and thank you, Nick.", "rating": 3}, {"title": "It felt like I was being pushed to…", "text": "It felt like I was being pushed to close on a certain date instead of a date that was beneficial for me. I used my own title company and some pressure was applied by Liam to try and sway me from using a title company of my choice. I think they purposely delayed the closing date I wanted because I would not close on a date they wanted..", "rating": 3}, {"title": "We had used your service before and…", "text": "We had used your service before and were very pleased. But our recent re-fi with your service was quite lacking. We would wait for days to hear any updates on where we were with the closing and would end up having to call ourself to find out. We did, however, like the fact that the notary came to our house  for our signatures. Even though the lack of communication kept us in the dark and we had to personally make calls to find out where we were in the re-fi, we will use you in the future and just hope for faster, more informed service.", "rating": 3}, {"title": "My wife and I were looking to…", "text": "My wife and I were looking to refinance. Our current mortgage company couldn't give us what we were looking for. After talking it over with my wife. I decided to give Newday a call and see if they could help. From start to finish it was about the easiest thing I ever done when it comes to financial situation and salutations. No hassle or billions of unnecessary emails. Straight and to the point. Check my update very unhappy", "rating": 3}, {"title": "Dumped loan after 2 months without notification", "text": "I did a refinance with NewDay a couple of months back, one of the reasons I went with these guys is I was given the impression they do not sell their loans. Well surprise, 2 months into this loan it was pawned off to another company. The real suckey part is I found out when I was called because the new company did not receive my October 1 payment, despite me sending it in on Sep 30. This is totally upsetting to find out about this after the fact because your payment is late.", "rating": 3}, {"title": "Lack of communication", "text": "CommunicationThe process to set up the loan was OK. My loan officer went on vacation and communication went out the window. I had a little problem with the timing for the paperwork. I received a call to confirm my appointment for the signing, but I didn't know I had an appointment. I called the gentlemen who was covering my account and never received a call back. I called him three times with no response.", "rating": 3}, {"title": "Everything started out great", "text": "Everything started out great. 2 months later (approx) I finally had approval to refinance through IRRL. The communication was absolutely horrible, however, a Supervisor called me it seemed like to pacify me because I was getting annoyed about asking what was going on. We finally closed. I’m not sure we will ever refinance with them again.", "rating": 3}, {"title": "I was very satisfied at first", "text": "I was very satisfied at first .  In the end I called 51 times that I have documented and never got a return call.  I also called today after funding on Monday to request the VA funding fee be returned to me as I have received my disability dated 1 August.  The VA said since the fund s haven't been released yet to them that you could send them directly to me.  Again I never received a return call.", "rating": 3}, {"title": "I am a 100 disabled veteran the tax…", "text": "I am a 100 disabled veteran the tax certificate shows that I am exempt on my property taxes but closing statement set up account for escrow and a monthly payment and the loan officer, processer, underwriter, even the closer was not paying attention and collected taxes at closing. That does not empress me at all", "rating": 3}, {"title": "OK experience", "text": "Even after closing and having my mortgage sold to another company, I still receive numerous solicitations from NewDay trying to sell mortgage insurance.  I get at least one a week and they will not stop (waste of money sending these things).  After making my first payment to the company NewDay sold my mortgage, NewDay sends a bill.  My mortgage representative, Zach, was very kind, attentive, and professional.", "rating": 3}, {"title": "The day I called New Day USA I was told…", "text": "The day I called New Day USA I was told we were looking at a closing date of 09/26.  Then I was told it would be 10/15, then 10/18, then 10/25.  We actually closed 11/14.  Granted the dates were pushed back due to mistakes made by the appraiser, but I would have appreciated honest answers rather than given answers he thought I wanted to hear. I wish now in hindsight that I had gone with a local company.  That's what I get for falling for a TV ad.", "rating": 3}, {"title": "I thought everything was just ok", "text": "I thought everything was just ok, I also thought the overall expenses were a lot more then I expected, I was quoted about 3800.00 for total cost but ITV was 5300.00, and when I talked to my agent he came up with va lot more expense the he didn’t know so I just went ahead and excepted it but wasn’t happy but went ahead with.", "rating": 3}, {"title": "Everything up to closing was very good", "text": "Everything up to closing was very good. Taylor Kim said we could close in 2 weeks, but it took almost 4. It's been 2+ weeks since we closed and I still don't know who hold the mortgage or where to send payments. I left a voice mail for Taylor last Friday , but he has not returned my call I will try again tomorrow.", "rating": 3}, {"title": "Not as good as the hype", "text": "Not as good as the hype. Did an IRRL was told no income vaifaction and so on but in the end had to provide it even thou already had a VA Loan.My wife was not part of the old loan but we she had to sign papers stating she knew what I was doing with the mortgage. I don't need someone getting that involed with myself and my wife of 37 years.", "rating": 3}, {"title": "Generally", "text": "Generally, process was simple (second loan through your company) and service rep was helpful.  Biggest problem was appraiser undervalued property substantially and this was not reviewed after my complaint.  Thus, I refinanced my home to add an additional $35000 to the mortgage and received 11500 which did not meet goal of reducing credit card debt. Looks like you folks made out just fine but I got very little for my efforts.  Will not use your service again.", "rating": 3}, {"title": "Well Short of Goals New Day Established", "text": "New Day USA told me their goal was to complete the home loan application process in 4-6 weeks.  It actually took 12 weeks.  They planned to close on 3 different dates but less than 2 days before each closing they needed additional documents to review.  They said they would keep me apprised at least weekly of their progress but did not contact me at all unless they needed more documentation.  The rate they initially discussed with me was below 2.5 % but ended up closing at 3.25% which was above the average market rate at the time.  My credit scores were in the 725-745 range.", "rating": 3}, {"title": "LOAN PROCESS REVIEW", "text": "We felt that if the necessary documents had reached us sooner, we could have locked in a better rate. Also, there was far too many documents to deal with, and the process was drug out to the very last minute. We barely had time to get the cashier's check in time (for closing) to still be able to make the 2 day drive to N.M. We also felt that the asst. vice president who helped us should have known more than she did, for having the title that she has.", "rating": 3}, {"title": "I felt there was not enough…", "text": "I felt there was not enough communication. I had to reach out several times to find out status of the loan application and even once approved didn't know until I got email about closing. I was told by the closer my funds would be deposited into my account but that was not the case funds were delayed by several days as they were sent to me not direct deposited. I started the process the end of September and did not close until the end of December.", "rating": 3}, {"title": "I was only interested in taking money…", "text": "I was only interested in taking money to pay off bills, which is what I expressed to our agent.  I did not fully understand when he said bills would be paid off plus have additional amount of money.  As it turned out, not only was the money for paying off bills received by additional $12,000 which now makes  my monthly mortgage over $1700, $400 more than before the refinance.", "rating": 3}, {"title": "The process was very slow", "text": "The process was very slow, they kept me from seeing when the end would come. It was suppose to close on July 26th, it actually happened on the 19th of August. If I had to do it over I would probably go straight to he bank here. I thought since I was a vet from Korea this would be the better route. Live and learn !Clyde Wiley", "rating": 3}, {"title": "Went very well", "text": "Went very well, but I've not gotten my checks yet.", "rating": 3}, {"title": "Joseph Rosati dropped the ball really…", "text": "Joseph Rosati dropped the ball really hard in the first round and almost caused me to choose a different Mortgage Company. Jared Wayne Linton​ saved the day! The notary person Meredith Cline you chose to finalize the signing was completely obnoxious and very demanding.", "rating": 3}, {"title": "The process was NOT as easy as commercials portray.", "text": "At the end of the day I got a good rate and saved money each month.  The process was NOT as easy as the commercials make it sound.  At times, I felt untrusted and if it would not have been that I was fairly deep into the process I would have withdrawn and gone with another lender.", "rating": 3}, {"title": "Overall the experience was good", "text": "Overall the experience was good. The process took way longer than I expected based on previous refinancing with other lenders. There was a glitch (which was my fault) with final step and I tried to email and call the loan officer and he never called me back. I finally got it resolved with the title person.", "rating": 3}, {"title": "Over all it was a little trying on me,I…", "text": "Over all it was a little trying on me,I was told that my loan would close on a certain day ,but when that day came , I had to provide more and more information which added stress to my wife and my self.  The loan did finally close and now I feel better. But a better way to handle things like this is for more calls to be made to put people at ease. From a Viet Nam veteran I want to thank you for your help and please tell Paul Moore thanks and sorry for any grief I may have caused himWilliam Edmonds", "rating": 3}, {"title": "Seemed like a lot of pressure to get …", "text": "Seemed like a lot of pressure to get the contract to a close. The agent was considerate but again seemed to be n a hurry. Overall I was not pleased with the Closing Costs. I could have gotten the same loan at a local bank, here in Gainesville, with no closing costs, saving a few thousand dollars. I guess my experience with the military kept me from dropping the whole thing and going locally.  Probably would not do this again without more searching on my part.", "rating": 3}, {"title": "Pro’s and Con’s", "text": "The overall process was good. The best thing was the service and professionalism of the individuals we worked with. The negative and reason for 3 star review, is the technology was not smooth. Some aspects, such as signing the documents, was done very well, but the smoothness off the process further highlighted issues such as login and account access problems or browser support to be able to open documents in the first place. I would strongly suggest further investment into the technology to make a smoother, start to finish experience for the client.", "rating": 3}, {"title": "Dropped the ball big time.", "text": "We were refinancing to get a lower interest rate.  We would fax important papers to her but never let us know if she received them or not.  The agent wanted us to call the lawyer to set closing date up.  When it was her job. Not impressed at all.  Would always take her at least 2 days to return a phone call. On any given question.", "rating": 3}, {"title": "Stepped back in time.", "text": "The loan process was very smooth but disappointed with the mortgage company.  I will have to pay a fee to make a payment online or by phone.  So I guess, I will have to make payment like I did 10 years ago by mailing a paper check.  I feel like I just stepped back in time.", "rating": 3}, {"title": "Refinancing mortgage", "text": "It took three applications and over three months to finally close.  Problems encountered. 1. Had to remove property from a trust by initiating a quit clam deed, 2.  Redo initial appraisal,  3. Abstract update took time, and lastly several phone calls, e-signatures, and updates/changes delayed the final closing.", "rating": 3}, {"title": "Disappointed", "text": "We were told we would close on Dec 6.  Instead we closed on January 9.  We always had our info requests in A timely fashion.  There were many unanswered calls and e mails.  Apparently the whole place closed down from Christmas to the New Year.  Never heard of a business running like that", "rating": 3}, {"title": "Rep was thorough", "text": "Rep was thorough, however, after I let him know that this was the forth or fifth time we've refinanced over the years, and that my wife is a Realtor and clearly understands the process, he spent a lot of time telling us the same things over and over.  Also, the numbers were nearly $2k off from what was projected.", "rating": 3}, {"title": "Very uncertain", "text": "We have to sign twice. And now we are waiting for our final paperwork. I’m not really sure if refinancing is complete.No follow up. No acknowledgment.Do I still need to pay my mortgage from previous lender? I need to know what is going on. Please help.", "rating": 3}, {"title": "For the most part everyone was friendly…", "text": "For the most part everyone was friendly and professional. But when I call with a question or, waiting for a return phone call. Your team is very lax in returninga phone call", "rating": 3}, {"title": "Documention requests and timeliness", "text": "Hello, although, I was very pleased and grateful that Newday was able to assist with my refinance and debt consolidation; I was disappointed with the timeliness of the closing and information gathering.  I provided all of the contact information for my homeowners and home association on Nov. 5th and these entities were not contacted until the beginning of December pushing my closing date back to Dec 13th and I was supposed to close on November 30th.  This caused me to incur additional charges, due to these delays.", "rating": 3}, {"title": "Underwriting", "text": "I was asked numerous times about a vacant, undeveloped, rual lot that my mother left me just after she died.  They wanted to know my intentions with this as if it was a major development.   I was quizzed numerous times about how I came into some money that was put into my bank account.  After advising that it was from  a matured CD I WAS ASKED TO PROVE IT.  I was called two to three times per week to explain certain things.  If the rate was not as good as it was I would have told New Day to stick it.Your underwriting needs an overhaul especially if you are going to sell my loan.", "rating": 3}, {"title": "This was our first experience…", "text": "This was our first experience refinancing with New Day USA and the experience turned out great until we got to the appraisal process. We thought our home was appraised lower than it should have considering the home values in our area within a 3 miles radius. We really wanted to stop the process and get a second appraisal but our agent Xavier Cunningham advised us that if we got a second appraisal the home value would not have changed much to make a difference. We think we really lost about $20k to $30k on this appraisal. That was the only bad experience about this refinance. Our agent Xavier Cunningham was very professional and detailed about the program. We completed the whole process in about 3 weeks very quick.", "rating": 3}, {"title": "The people at NewDay that I dealt with…", "text": "The people at NewDay that I dealt with were great. The average rating is because NewDay immediately sold the mortgage to someone else. I thought I would be dealing with a veteran run organization and now I have an unknown entity.", "rating": 3}, {"title": "It started out great", "text": "It started out great! Then on closing day it went bad we had been told if we had any questions on that day we could call you....we tried and tried all attempts failed and we had to wait from Thursday to Monday before we heard from anyone. The notary that came did not know what he was doing evidently. He had to make three trips on two different days to get all of the correct information he needed to close properly. Service link made out a check that was wrong and had to resend a check with the proper name on it, but they fixed it after we called.", "rating": 3}, {"title": "Would somebody please tell me what is going on?", "text": "My interraction with the Newday rep was smooth and cordial.  There were a lot of documents that needed filled out and signed.  I took care of all this from my home computer and printer.  I had only a rather small mortgage so the reduction of my mortgage payment was minimal, even though the interest rate went from 4.75 to 2.75.  I was told that there would be no mortgage payment in May, 2021 that my first new mortgage payment would be in June.  However, to my surprise my current? former? mortgage company deducted a mortgage payment in May.  So, right now I am not sure who my mortgage company is.  Hope to get this straightened out.", "rating": 3}, {"title": "The process got done!", "text": "The process got done, however we think that things could have been a little faster.  We appreciate any organization that attempts to help veterans, but we believe that your fees could have been positioned a little more competitive.", "rating": 3}, {"title": "Getting started was no problem however", "text": "Getting started was no problem however, after providing all the information needed, plus filling out all the forms, I started getting calls that, who ever was going over the application, must need glasses, because they said it was hard to read so they wanted me to go to an \"office\" and \"re-sign or re date\" the document.  Also I had to fax a copy of our home owners insurance, twice, because they said they could not read it.  I stated I was disabled and could not get out to any \"office\".  So they had to go with what I sent them.  Other then that, the process was ok.", "rating": 3}, {"title": "Worst experience with a lender", "text": "By far the least smoothest procees to refinance. Even after 3 days of closing the loan hasn't funded. And I'm still being asked to provide documentation or the loan won'tbe funded. Waiting for time to pass on loan to go on to another lender.", "rating": 3}, {"title": "I made my first payment", "text": "I made my first payment! It would not let me pay online without a form. I ask could we sign it electronically and I was told no they would mail it to us. The Rep was sending me a receipt paying my mortgage by phone. She said it could take one hour. No receipt by the next evening.I called today talked to a different Rep she said it wasn’t showing our email address from the previous day and said we could sign the form electronically. She sent both through our email but still haven’t received either one. During our initial emailing to Ben Groff we emailed back and forth with no delay. Hopefully this is isolated if not maybe it can be streamlined", "rating": 3}, {"title": "Can't say it has been an awesome …", "text": "Can't say it has been an awesome experience loan officers like Lou F was fantastic but they seem to have no structure like a funding check list so the buyer knows what stipulations is needed to get the approval done, instead of two three this different all the time!!!", "rating": 3}, {"title": "The process was difficult at times with…", "text": "The process was difficult at times with the appraisal process. The appraiser knew we were remodeling the bathroom, but the lender insisted on it being completed prior to us going into closing we would not have started this if we had known this would have held up the process before we started the refinance. Jacob was good at keeping me up to date on things. We thought the accounts that they were going to pay off were going to be done through EFT, but instead a check was issued and sent to us to send to the creditors. I could have done this myself if the money was sent to our account instead.", "rating": 3}, {"title": "My wife and I refinanced our home", "text": "My wife and I refinanced our home. We have done this in the past going thru a local Bank when the interest rates were lower than when we purchased our home.Our loan went thru in less than 30 days. However with New Day, it was a very long and drawn out process. The agent who helped us did everything possible to make sure things went smoothe for us. So it was not his fault. He told us that there were so many people who were refinancing right now because of the low interest rates.So that was part of the reason why it took as long as it did. All in all I do appreciate that New Day accepted me as a customer.", "rating": 3}, {"title": "Something Needs  Fixing on the Process", "text": "NewDay did a good job of keeping me informed through the process and an above average job of timeliness of completing my refi.What keeps them from having an above average overall score in my case was arranging for the closing. The closing itself was a simple, quick process. But when the original closing date is moved closer, only to later be cancelled because no lawyers are available is a procedural failure - something is wrong with the procedure. Then to have the time on the second date moved, again because of lawyer availability, really 'made me feel important'. My state requires a witness during the closing process.  This was a lot of jerking someone else around besides just me!", "rating": 3}, {"title": "OK but not Great", "text": "I have owned 4 homes and have almost always used Quicken Loans (Rocket Mortgage). They have been great but I wanted to try New Day for a while. I did so and I encountered troubles I haven't in the past. For example, there was some kind of hit on my background check regarding a bill collection of some sort. I've never had that happen. I have always paid my bills and my FICO score is nearly 800. Another issue was the notary that came to my house, which seemed lost as to what documents required a signature. I had to re-do some of the paperwork. Also, the points New Day charges on the mortgage are pretty steep and my closing costs were outrageous. Not sure if I'll stay with them. We'll see if this improves from here on out.", "rating": 3}, {"title": "Buyer beware", "text": "the process was fairly simple the reason I cannot give five stars is because the person who handled my account Kelly in my opinion did not make it clear to me that New Day has a board who meets to raise interest rates and those interest rates are not in line with the national average so one day I had one interest rate and the next day it went up 1 point so basically new day raised its interest rates and I am sure you looked at how many loans you had in the pipe line and so your company made a lot of money from quite a few veterans like myself by internally raising your interest rates", "rating": 3}, {"title": "Not as smoothly processed since my last…", "text": "Not as smoothly processed since my last re-fi 2years ago with you. Would not offer me cash out option. Only lower rate. Happy with rate may consider other mortgage company's next year as I still want to cash out enough for remodeling.", "rating": 3}, {"title": "It was a very easy process", "text": "It was a very easy process. Was able to submit all requested data and refi in weeks. However, the only issue is this. We were told that the loan would or could be assumable to our children if they were to acquire the property if something was to happen us. During the signing the document regarding the assumability of the loan came up. Though we did sign, we attempted to contact our loan originator for more clarification. I believe we text/emailed twice and have heard nothing but crickets.Moral of the story, ensure you are well versed and understand what you are signing. Yes it’s nice to have a 2.25% loan. But, once the notary came, docs are signed, the deal is complete and they quickly move on to the next customer.", "rating": 3}, {"title": "So/So", "text": "Everything was Great, until it wasn’t. I was told that once the closing was completed the next Friday, almost a week later the checks to pay debts and additional cash would be delivered via FedEx. That isn’t what happened and I wasn’t worthy enough to get a phone call letting me know of time table changes. Which would be absolutely fine. However, now I’m departing in less than 24 hours for three weeks. So said package will likely arrive when no one is there to receive it. Nor do I know if I should make my routine payments or not. Not that I signed the papers I guess it isn’t so important to keep me informed.", "rating": 3}, {"title": "Closing Delays", "text": "I started the process in early November with a closing date of 15 Dec.  I asked to have the title details performed by a local company here in Clermont Fl.  Something happened and New Day used a company that you use.  When I asked to have that duty transferred to my choice, the closing date was extended.  My closing date was subsequently changed at least 3 times when paperwork had to be approved again and again.  My case was given to a second team member when Jordan dropped out of the picture.  He did well for the first 30 days of this process.  Grant took over after that and he finally got it closed.  The delay forced me to make an additional payment under the 3.50% loan.", "rating": 3}, {"title": "VA Refi in NC", "text": "This was a very stressful period. We had several closings pushed from Oct 19 thru Nov 10. I had to point out that I needed both city and county taxes escrowed along with my taxes. It took three times to get it correct.", "rating": 3}, {"title": "Although the process started well the…", "text": "Although the process started well the signing of closing documents was not timely due to notaries not available and the mortgage to be paid off has not yet happened and we will be subjected to additional monies out-of-pocket.", "rating": 3}, {"title": "I initially called New Day at later…", "text": "I initially called New Day at later week of August and Mr. Zadowski took my call.  I gave him the info to open my refi.  I also sent documents he needed to open my refi: DD214, mortgage company and home insurance.  One month passed and nothing happen.  I called again at the early week in September, and Mr. Scott and told me he will takeover my refi.  I did receive a letter from New Day and indicated that my initial refi was closed because my house market value at $675 K was less than the refi amount at $400 K. My refi process took another one month and I called early October why the delay.  Mr. Jordan answered my call and refi completed and signed the close of escrow on October 29, 2020.", "rating": 3}, {"title": "If you want me to be honest", "text": "If you want me to be honest, this was one of worst experiences we have had.  We had to fax signed papers twice and then you sent a notorary and we signed same papers.  We had numerous calls trying to get this accomplished.", "rating": 3}, {"title": "A difficult process", "text": "At first theaccount executive assigned came across as condescending towatds my credit report and then with the results of the appraisal which came in over the needed value for the loan amount but had some deficiencies.  I was not able to tell him immediately how soon the deficiencies would be corrected. I requested to speak to his supervisor. He got a person to say he was his supervisor; I found out on a subquent call it was not his supervisor. I did end up with a person higher up in the organization on another phone call. This person was attentive and continued in a professional matter.  I hope no one else experiences what I went through with the first person.", "rating": 3}, {"title": "Took too long", "text": "Took too long.  Was not sure the person helping me knew what he was doing.  I provider all info requested and it took several days to make decision concerning my road situation.  Seemed he was not sure about anything.", "rating": 3}, {"title": "It took longer than it should have to…", "text": "It took longer than it should have to get the loan approved. I applied on May 8 and the loan was approved for close on June 6. The loan officer would not return my calls and keep me posted on the status of the loan.", "rating": 3}, {"title": "Lack of communication", "text": "The problem I faced was not knowing the next steps and communication with your staff.i would leave messages and it would take 3 to 4 days to get a call back other than that everybody was pleasant to talk to.", "rating": 3}, {"title": "Seemed almost every couple of days we…", "text": "Seemed almost every couple of days we had to provide yet another document. If we hadn’t been days away from closing, we would have canceled the loan. We will not be recommending New Day to other Veterans.", "rating": 3}, {"title": "GETTING THE LOAN....Very easy", "text": "GETTING THE LOAN....Very easy! (5 stars).Paying the first mortgage payment (1 star)...confusing, a run around with 3 different players....a real disappointment.  At closing: pay NEW DAY Financial on 1 NOV. Today, 3 letters, two from PHH mortgage Services, one says pay New Day Financial on 1 Nov, another pay PHH, Mortgage Services on 1 Nov...and finally, a letter from Tom Lynch saying in the next couple of days, I'll get another letter from Service MAC to start paying the loan through them..... sure would like to know who I'm supposed to pay without such a 3 ring circus. Who owns the loan? And why the rigmarole?  Good thing I have a week to try and figure out who's who.....and the loan processors aren't any help...their advice was wait for the letter from mortgage services.", "rating": 3}, {"title": "Figured  refi rates would hit 2% or…", "text": "Figured  refi rates would hit 2% or less. Selected New Day after 3 month review.  Past Navy career probably affected decision to select New Day.  NFCU could not beat 2.25% offered.  Tried to get refi rate reduced when fed went under 2% APR but New Day was as low as they would go.  New Day agent worked hard, very professional, kept me informed.  The title company was overly picky and demanding. I would have fired them. I would have stopped the process if i could have gotten a better rate elsewhere. Closing delayed 6 weeks by title company actions or inactions.  Closing agent was a gem! Professional, Knowledgeable, Helpful.  When is New Day going to stop sending me mail ads. Get 3 or 4 a week even during the process. Got one today. Very, very annoying!", "rating": 3}, {"title": "New Day USA is a decent company in…", "text": "New Day USA is a decent company in regards to getting a mortgage. My 2 concerns I had with the process were as follows:   1.  I was not told what was needed step by step in the beginning of the process. I would ask and was told nothing. Then would be hot with tons of extra steps I could have completed if was told earlier.    2. The funding company they use are very rude and unprofessional. I had them call me 4 times in one day in regards to my file. Instead of reviewing my whole file first. Then calling me once with the deficiencies I needed to correct. I even asked the person if that was all they needed the first time turn called. They said yes. Which was a total lie. Very unprofessional", "rating": 3}, {"title": "The process was what I expected", "text": "The process was what I expected. This is my 3rd VA loan and none of them have been much different. The amounts always change, the people never call you back with updates. There is always something else you need to complete the loan. This time it was mine subsidence insurance. I have never had to have that in the 15 years I have been paying a mortgage. I had to contact our broker to extract any information I needed. I felt like getting the deal done was most important. Filling a quota for the month maybe. Veteran or not I didn't feel like I received any better treatment that someone who didn't serve our country. I would not recommend New Day USA to anyone I wanted to stay friends with.", "rating": 3}, {"title": "Refi", "text": "From the beginning,  I stated the refi was so I could put down a large sum down from the sale of my old house.  Somehow that was forgotten and I had delays in closing while everything was redone.", "rating": 3}, {"title": "Vets be careful-demand info or don't do it.", "text": "I contacted New Day to find out information on refinancing my house. However, they really just gave me a runaround with wanting all my info, SSN for credit check, income info, my present finance rate, etc. However, when I ask what the finance rate was or closing costs, they refuse to give me any information. Banks will normally give you an idea of what these costs are because they are critical to the consumer. New Day's refusal to even discuss ( i.e. give even a range) strongly indicates there is something they want to keep you in the blind about. Remember, these people intend to make money! I refinanced at a local bank where they gave me the info I needed to make an intelligent financial decision. It appears that vets refinancing with New Day just need short-term cash, and are not thinking long term.", "rating": 3}, {"title": "John Griffin was very helpful…", "text": "John Griffin was very helpful especially with signing information via email which was very time consuming due to loss of signal on our end being out in the middle of no place he answered all our questions promptly and then kept us informed throughout the process but here is the main problem I have two we have two bags and the information you request is very difficult to comply with when you make a deposit it does not show how many check was deposited how much cash deposited on the same deposit which means a three-way conversation with us the bank and your side and some banks will not give out the information even if I'm on the line all they will do is send me a copy of my bank statement which will be the same bank statement I get to begin with it makes you feel like you're  aCriminal", "rating": 3}, {"title": "Process was long and there were some…", "text": "Process was long and there were some problems that could have been avoided if someone at your end paid closer attention.  Sometimes explanations were not clear.  Glad it is finally over and done with.", "rating": 3}, {"title": "I started this with Matthew Taylor and…", "text": "I started this with Matthew Taylor and was given 2 1/4% interest rate, that was on a Friday in Nov.  On Monday I was told I did not get the e signed contract in on time and now the interest rate was raised to 2 3/4 %.  I e signed the 2 3/4% contract and was told that it has to go through some reviews.  I waited a couple of weeks and tried to contact Matthew Taylor and no response to my messages I left on his voice mail.I called sometime in December and was informed that my account was put on hold and Matthew was no longer my contact.I then heard from Bradley Whittaker and he informed me he was my new loan agent. Again, after running my account thru a review it was decided that I had to get a 30-year loan not 15-year loan and my interest rate is now going to be 3.75%.  I had no other choice but to take it or go thru all the paperwork with other companies and more time wasted.", "rating": 3}, {"title": "I thank the long distance made it more…", "text": "I thank the long distance made it more difficult,Calls were not returned quickly,and two phone appointments were never kept.We are pleased with the rate and will recommend your company", "rating": 3}, {"title": "I was very disappointed in NewDay USA…", "text": "I was very disappointed in NewDay USA handling of my refinancing of my home.  One at the beginning of my process I wanted to remove my Ex wife off of my title.  This was a major reason I refinanced my house. When I came to closing the first time it wasn't done. So that turned into a disaster. But I got past thatv. Then on my second closing I asked could my money be Put in a different account? Not once but three times !!! Christopher ensured me I could and that turned out to be not true because they put the money in my old account!! I am all about taking care of business when I was asked for something I made it happen in a timely manner. I felt like New Day was not making my needs their priority therefore it caused me a lot of heart aches and money.", "rating": 3}, {"title": "prompt and courteous, but some dissappointment", "text": "Very prompt and courteous, but I hate surprises, like the interest rate \"changing\" before it's locked. And the loan being immediately sold to another servicer.", "rating": 3}, {"title": "Painless experience with a caveat", "text": "The overall experience wasn't too painful. However, the disappointment as I found out after the fact (didn't really want to take hits to credit report pulling): NewDay made it seem like they are there for/catering to the veteran. In hindsight, there are other companies out there that offer the same deal(s) and there are some that offer even more/better incentives (loan origination discount, better interest rates, more than 1 month until first payment is due, etc) to veterans. In my opinion, NewDay is just like all the other companies, in it for the money, nothing outside the normal. So, if you're a veteran looking at this company expecting better deals because you're a veteran, I can honestly say this wasn't the case. The company might have a veteran who started it and the company may make you feel all welcome and special --- please make sure you explore more than just this company. Again, hindsight...", "rating": 3}, {"title": "I understand that buying a house is …", "text": "I understand that buying a house is stressful for most, but in our case it was past just stressful. Our loan officer was great, Sasha Malcolmson, she put up with my wife's outbursts and still held her composure. Our only problem was everyone getting their ducks in the same row. For five months we were told six different dates that were suppose to be closings. Needless to say it didn't happen because either the lender missed something, the realtor did or the title company didn't send paperwork back in time. For our first time buying, I'm quite sure it will be our last. On a positive note, we did FINALLY get into the house we wanted and couldn't be more happier. Thank you Sasha for all your hard work and thank you for sticking with us!!", "rating": 3}, {"title": "I appreciated the verbal support as a…", "text": "I appreciated the verbal support as a veteran, and the expressed understanding that some veterans had difficulties in these types of situations.  In actual performance, with the immediate understanding for refinance needs, my refinance closed a month and a half behind schedule, required multiple days off to accommodate third party title companies, and even after closing required more time for both the title company and New Day to “fix” paperwork.  With multiple home sales/buys/refis under my belt, this was by far the most cumbersome.  I did, however, always feel respected and felt as though I was the customer during interactions.  Just always loaded with apologies.  Having a fellow sailor in charge drove my decision to use New Day, and would certainly do it again while flinching.", "rating": 3}, {"title": "This is the second time that I have…", "text": "This is the second time that I have worked with you for a refinance of my mortgage. The first time was the best as far as agent capability!! The second agent seemed to find more info that was needed one bit at a time...\" we need this info, then we also need this info, etc. It seemed to me that the agent didn't have all of his ducks in a row either because he didn't know or he forgot to ask!!! He was hard to contact on many occasions...voicemail, voicemail. I had to resort to calling the number on some of your ads on TV which resulted in getting a phone number for his supervisor. I called her.voicemail. I never got a return call from her!! In all, the process was not a good experience!! I'm very glad it's over!!!May I thank you in any event for your help and process!!!!", "rating": 3}, {"title": "While the person on the other side of…", "text": "While the person on the other side of the phone was very helpful the process took too long. Also some of the checks given to pay off some collections were not written for the right party.", "rating": 3}, {"title": "Once my rate was locked in", "text": "Once my rate was locked in, even if the rates went lower, I was not allowed to lock in a new lower rate. i was told that a NewDay refi was so fast. Mine took several months.", "rating": 3}, {"title": "The VA int rate dropped from 2.75% to…", "text": "The VA int rate dropped from 2.75% to 2.25% during the processing of my loan.Why wasn't The rate automatically reduced to the 2.25% at the time of final agreement ??", "rating": 3}, {"title": "Follow up after the loan closing is…", "text": "Follow up after the loan closing is terrible. My request for an amortization schedule in print has not been acted upon. Very sad and disheartening.", "rating": 3}, {"title": "Poor Communication", "text": "A couple of things happened showing miscommunication within the \"New Day USA\" team. The person assigned to my account called to see how things were going when I informed him that the Notary had contacted me and set an appointment to close he said the system showed I had outstanding items. I closed on schedule but why would one section send out a notary when my agent showed there were items outstanding. After I closed I received a letter from New Day USA which looked like a check and I thought \"man that was fast\" but when I opened it it was an advertisement trying to get me to re-finance with you. I had been in your system for almost a month. It makes me feel like the company does not communicate properly. If I had know this before I would have went with another company because you could not match the rates in the advertisement.", "rating": 3}, {"title": "I do not know why I should enter this…", "text": "I do not know why I should enter this review as last time I took the time to point out some discrepancies, I got in return a \"boilerplate\" answer from the reviewing individual, so I believe the management courses you all had to take did little to help overall.Anyway, this time with you was better than last time but there was much less to do overall to get the loan finished; however, the interest rate was raised just days before we could lock in the rate (bait and switch?) and that was very disappointing with the representative saying that the rate could not be locked in until the loan was review and approved which did not make sense as if it was not approved then no harm would have been done but if approved I would have gotten the lower rate rather than the rate being raised a week or so before closing.", "rating": 3}, {"title": "Things began well", "text": "Things began well, but turned south rather quickly.Most of the issues stemmed from the closing company.  I had expressed my concerns with my Newday representative early-on after I did some research on Newday and the closing company.  He assured me those were isolated problems, but that wasn't the case.  They simply did not pay attention to details and it just snowballed from there.  What was supposed to be a 30 day closing ended up being almost 3 months.  The only reason I stayed on board was that it was only a matter of time before rates started to climb and mine was locked in at 2.25%.My representative tried to do a good job, but the arrangement between NewDay and their closing company is destined for disaster.  I believe that Newday actually owns them.I would not recommend them.  There are other mortgage companies with a better track record.Dave T.USN, 1970-74", "rating": 3}, {"title": "New Day Refinance Experience", "text": "Alexis Carpenter was our licensed representative here in Alabama. Alexis was thorough and very professional. She handled a very difficult, long, drawn out process. One, that was in our opinion, very labor-some,  redundant and to the point of being ridiculous about excess information and re-verification of information over, over, and over. Our process went on for three months. This process really needs to be re-engineered and streamlined to make everyone involved more productive. Even at closing, we had to sign two documents giving NewDay permission to acquire information that was already in the closing package! Because of this delay our interest rates increased,  and overall it was an unpleasant experience. That being said, Alexis Carpenter did an excellent job of working through this difficult situation with us. She was the only bright spot as we dealt with NewDay. I have to admit, I only came to NewDay because I am a veteran.  Ultimately I almost choked on the red tape. Best regards, Greg Williams", "rating": 3}, {"title": "Veterans should receive better closing cost rates", "text": "Overall experience was positive. One area of concern is closing costs. Industry standards may be comparable, but my opinion were too high. Closing for the refinance was Ok.", "rating": 3}, {"title": "Joe was excellent and very helpful when …", "text": "Joe was excellent and very helpful when dealing with him, the problems were he didn't always return our calls, it also took months to close but it wasn't his fault", "rating": 3}, {"title": "I heard a lot about new day on tv and…", "text": "I heard a lot about new day on tv and was expecting great service. My first contact was very profesional talking but apparently not very profesional doing. After a while he was replace by someone who said was his manager. He proceeded to work on my paperwork and had me clean up paperwork that the first guy was supposed to have me sign. During this time I was also receiving my income tax return checks. I was , after I had already use the money to pay part of a bill, that I needed to close an account that if your company would have been doing their job I would have known sooner and could have use that money to pay for it. But instead I had to scramble and get yet a short term loan to pay for it because I was told that if this was not cleared everything would be lost. At the end everything was solved but your company drop the ball and although you recover it was less than great.", "rating": 3}, {"title": "I got charged  1 point", "text": "I got charged  1 point. If I hadn't been  so  far  into my  refinance I might have changed  my mind.  I was  offered no points by other lnstutations.", "rating": 3}, {"title": "Process was fine", "text": "Process was fine. Interest rate changed prior to signing. Still waiting to resolve one issue, been waiting 7 days for an answer.", "rating": 3}, {"title": "I called New Day because of the add on…", "text": "I called New Day because of the add on TV. The initial call and working with my POC-Andrew to complete the paperwork was very easy. Andrew was very helpful and easy to get a hold of if I had questions. All went well until I had to sign the paperwork. They set up the appointment time to sign all the documents, the closing agent went through all the documents with us and he was going to forward them to the finance company. We were told a few days latter that they the finance company didn't receive one of the documents they needed. A day or two latter a notary came out to our house to have us sign the form and she had us sign the entire packet again. And then again we were notified that a form was missing, she came out again and this time brought out the form we needed to sign. There was a misconnect some where with the finance company and getting /confirming all the documents were reading and complete to sign.", "rating": 3}, {"title": "Repetitive and annoying process.", "text": "1.  Your advertising department obviously does not communicate with the rest of your company - all through the process, I kept getting advertising from your company offering a VA refinance, even as recently as yesterday.  The printing and postage for such redundant advertising is a waste and an annoyance.2.  We had to electronically sign the whole series of documents, the same ones over and over again.  Then, the final session was with a local notary, to sign the same agreement documents over again.  Another redundant, repetitive and annoying process.3.  It seemed like every day something new was needed from us, instead of asking for the whole package at one time.  Again, repetitive and annoying.We have done refinancing before, without as much paperwork and daily requirements as with your company.The final result was acceptable, but it was sort of a pain to get there.", "rating": 3}, {"title": "When i started this process was about 9…", "text": "When i started this process was about 9 months ago. Now with that being said. I do believe other than getting calls back I do believe I was treated faily.", "rating": 3}, {"title": "Excellent communication from Originator.", "text": "As a person who does door to door deliveries as an occupation, I witness my share of fraud, waste and abuse of taxpayer funds. Mainly excessive benefits without verification i.e. EBT cards addressed to persons who don't reside where being delivered to, statements addressed to vacant houses etc. I also witness long lines of people in public receive free phones, tablets, suboxin for free and no questions asked.But a working class veteran on the other hand, has to crawl in a muddy craw space to take a picture to prove there is a heat pump installed in the home. All because I misspoke to the appraiser. It's shameful veterans have to jump through hoops to refinance their home.Additionally when one thing would get resolved another issue would arise instead of being proactive and providing a list of everything that needs done at once.Lastly on a good note, my originator was an excellent communicator, prompt and responsive to any questions or concerns. I understand due diligence has to be done to protect investments but the underwriters and the VA are excessively nitpicky.", "rating": 3}, {"title": "Not sure", "text": "My 20 day fast refinance started May 20th and closed mid September....not sure you want me to write a real review over the nonsense I went through.", "rating": 3}, {"title": "Mixed Results", "text": "Positive: My agent was friendly, and the process to close was faster than that of other companies, from what I learned.  Despite the misinformation and disappointment (below), ultimately I still saved money, compared to my previous mortgage.Negative: I only returned to New Day when my agent promised that they would provide a better interest rate and points than one of their competitors. Then over the next 6 days, I asked several times for an update, with no response.  Finally, my agent admitted that New Day was NOT going to beat the interest rate and points of their competitor - they would only match the competitor's terms. At the time, I chose to remain with New Day only because the other company had been even less forthright, having formally \"locked\" my interest rate and points, and then reneging on those terms. I found it not only frustrating but also very discouraging, that neither company would honor the terms that they had promised me.", "rating": 3}, {"title": "Great experience this was second time…", "text": "Great experience this was second time the only thing I would change is more feedback on process there was not enough second time around thank you", "rating": 3}, {"title": "taken advantage of my credit condition", "text": "I feel that because of my situation I was taken a bit of advantage of, in regards to my credit rating and my percentage rate which results in my payment.", "rating": 3}, {"title": "Obtaining this loan was somewhat of a struggle.", "text": "Obtaining this loan was somewhat of a struggle.  New refi had to be delayed a bit but we understood why. As loan proceeded, we began to be worried whether it would be completed by the deadline date.  After attempts by Rep to schedule Pest Inpsect & Appraisal, it was left to me to contact them & schedule. Rep didn't disappoint when keeping our interest rate at original offer though. At one point, I even emailed to previous Rep we had last year & asked him to take over the process. My email apparently went through channels & current Rep continued with us. We received at least 3 packets of docs in mail with a certain loan number. When loan finalized, it had entirely different number & only doc we received to know that was the first loan payment info & new loan number. I emailed Rep stating we hadn't received any closing loan docs, with new loan number. Didn't get a response. I had to call to have them emailed to me from Help Dept. We were disappointed as previous refi's with you were done so smoothly, carefully and professionally. We were frustrated with loan progress but we do say we are grateful for New Day USA", "rating": 3}, {"title": "Well it was great but we were told out…", "text": "Well it was great but we were told out of our out of pocket money we would have payoff checks for certain accounts. Turns out all the money was wired", "rating": 3}, {"title": "There was a lot of going back and forth…", "text": "There was a lot of going back and forth with two different loan officers so it got a little inconvenient", "rating": 3}, {"title": "The process started out well enough but…", "text": "The process started out well enough but I experienced a few misleading situations. The first one was the lending fees. I feel like the fees were all rolled up into one so I couldn't get credit for the origination fee as a 90% disabled veteran. So basically I was charged almost $9,000.00 dollars for a loan application process which reduced how much I got back for myself. The second thing was the not being able to get my money myself and do with it what I please. I had to wait for some checks in the mail to send to my creditors which caused over payments and some of them haven't given me my overpayment yet or I had to apply for it. If I had to do it all over again I would have chosen another company because I just didn't feel like I was being taken care of as promised. The only benefit I got was the fact that I am a veteran and there are plenty of companies out there that handle VA loans. It wasn't a terrible experience but it wasn't the best either.  Just average with a few procedures that need to change for the betterment of the veteran.", "rating": 3}, {"title": "Home Refinance with cash out option", "text": "We made our first call to New Day USA to get information on interest rate for a home refinance. We wanted to compare 15 to 30 year rates.  We were referred to a Loan Executive and after giving some of our information were promptly informed. We decided to do business with New Day USA since there were no upfront costs and we were happy with the interest rates. William, our Loan Executive walked us through the process and was a great help when we were feeling technically  challenged. He touched base often. The process was very easy and we had a check in our hand 6 and 1/2 weeks after our first call. The level of respect and professionalism was second to none. We were provided with a list of required documents and simply uploaded them to a portal.We were provided with a list of termite inspection services and I just had to make an appointment. The Notary for our closing contacted us and we just  had to make the appointment. The whole process just flew by.Thanks for a great job. We would definitely recommend New Day USA to our fellow Veterans.", "rating": 3}, {"title": "New Day Experience", "text": "I believe it would be extremely helpful if your loan officers were trained properly. Our loan officer is Joseph Stanton and he was very helpful to start with however closing did NOT go as he indicated it would. At closing we were told we would receive 6 checks. We received none but were told there was a 3 day wait in case we changed our mind then the checks would be overnighted to us. First off if we were going to change our mind we would have done so long before closing. Secondly it was 6 days before we received our checks except there were only 5 not 6. Our check coming for us is STILL not here. I ended up talking to WFT on Friday and they had problems with the money wire so overnighted it yesterday however now it supposedly will be Monday. This is ridiculous. WFT people I spoke with were extremely nice however before I was able to reach them I kept being told to contact the loan officer-Joseph Stanton. He would not answer any calls or emails since as far as he was concerned the case was closed. Very frustrating to say the least.", "rating": 3}, {"title": "Dear Sir,", "text": "Dear Sir,  My experience with A New Day USA was OK,  I was expecting a much lower rate, instead of the 5.675% I received as well as a lower monthly note on my home - which is what I didn't receive. All the information gathered and provided by me went well, but then when it came to signing a few electronic documents is when we started running into problems.  After all that was completed, we then had to set up a couple of appointment's for inspections, which delayed the closing of the whole transaction and we went round and round with a couple of thing's pertaining to said appointments - but managed to push through them all OK.  Since the closing of everything I have received phone calls as well as corresponding mail with much lower rates being available for the same type of refinancing I had just completed.  My only wish is that I would of gotten the lower rate I was originally looking for. Thank you for your Service and the opportunity to work with your team.", "rating": 3}, {"title": "it took longer than was originally…", "text": "it took longer than was originally stated and in the process I incurred late fees, which I hope don't effect my credit rating.", "rating": 3}, {"title": "The only problem I had was it took 2…", "text": "The only problem I had was it took 2 months to close due to personal changes etc. No fault of my own. so much for Streamline Refi.", "rating": 3}, {"title": "The process was very trying", "text": "The process was very trying. I will not call names. They should be easy enough to identify. The first agent with whom I spoke was supposed to give me the weekend to talk with my wife about following through with the re-finance and was to call me on the following Tuesday. Two weeks elapsed and I had to call back and request a different agent. The second agent was at least faithful about calling me with updates. After we did the closing, several days later, the agent called and wanted me to have a notary come by on no notice because there were a few documents that needed resigning and should only take 5 minutes.. I had appointments that day and arranged for the notary to show up on Saturday morning. She telephoned me on Friday afternoon to say she had 57 documents for my signature! At 3:15 PM EST I telephoned the New Day agent and left a voice-mail message saying that he needed to call me and explain what was going on. To date, he still has not returned my call. Because of this, I will not refer any of my veteran friends to New Day.", "rating": 3}, {"title": "was told in I would receive 16k at end …", "text": "was told in I would receive 16k at end in cash. yes I had a lot of debt and back debt and thanx for allowing me to get all that off my back. my problem is that as it went along and we found the back debt and it was added to the loan I was never told that it was taking it from my cash out. if I would have known that I would have adjusted it to be able to fix the rest of my house now I cant. all I was told was there was no problem there was enough room In the loan even when I asked about the cash still told there was enough room, no  one called emailed or said a thing about reducing my cash. don't get me wrong i thank you for getting me out of debt. but please let people know if this is the case up front that your cash is being reduced. know I have to figure out.  how to pay for fixing inside sense they seemed only interested outside. I will be looking to do something other now with this loan. but probably wont be able  so might have to sell it to come out ok. thanx anyway for all you did. jim jones", "rating": 3}, {"title": "The refi took longer than expected", "text": "The refi took longer than expected. There were several glitches when they had the wrong phone number linked to the account.", "rating": 3}, {"title": "My rate was 3 %", "text": "My rate was 3 %, new rate 2.25% thought refinance would lower it more than $22. As you might assume I was not happy.", "rating": 3}, {"title": "The process took longer than what was…", "text": "The process took longer than what was communicated originally. The dates kept changing.", "rating": 3}, {"title": "I can say Mr chestnut did an ok job but…", "text": "I can say Mr chestnut did an ok job but he did not caudate very well or can I say often enough for me", "rating": 3}, {"title": "Mostly Good through closing then much worse.", "text": "I found Courtland Womble very responsive until closing day.  We closed on 18 Jan and I still have an pay off check that has not been resolved almost one month later.  The check is for $1550 and now that we have closed I cannot get any help closing this action.  I thought it unusual that I had to actually mail the checks to the agencies after closing.  In the past this has been done by the title company.  That was tedious and unpleasant since in some cases I did not have information on the agency that was to be mailed the check.Some details were overly pursued while others were overlooked.  Conference calls with several closed accounts to insure they were closed but one that has been closed for 7 years needed to be sent a check.  That turned out to be impossible and source of my first, and ongoing, complaint.  I had to provide contact info so Courtland could call my HOA treasurer (I am the president of the HOA) to verify that I would not have to make a $68 payment this year.  How trivial and time consuming.Overall, I am glad we were able to close in a reasonable amount of time, although it took several weeks.  Now, I wish we could complete the action as it annoys me and frustrates me daily.", "rating": 3}, {"title": "Do what they say they will", "text": "Overall assisted me in a cashout refinance, however it wasn't a seamless process. Starting out I had a much much lower interest rate, the initial I was offered was .1% higher than my previous. Come to find out paperwork had issues and all of a sudden I get a .6% increase. It is what it is, I accepted it. Just wasn't expecting to get blind sided like that. It added $350 to my payment which wasn't expected as I had already been told the previous apr.My biggest issue is the fact that I was never given the option to receive the full loan amount or to have it separated and have debt paid off directly. They sent me checks for all of my debts of course. However, I'm not really sure why if I was directed down this payment option, I the customer in this situation, has to deal with paying off debtors with checks filled out by another organization. It has nothing to do with the organization, I think they do what they say they do. The processes however in my situation, created a lot more of a headache than it really should. however not everyone’s situation will be quite like mine regards to this or personal life. My loan officer phil was absolutely excellent and went above and beyond by keeping me updated even through the christmas holidays. at the end of the day i achieved what i sought overall. new day helped me have a fresh start.  too with new day.", "rating": 3}, {"title": "A Less Than Satisfactory Experience", "text": "I have financed and refinanced several homes in my lifetime. I found your company to be the less personable of any I have ever dealt with. In fact if your interest rate on my VA loan was not cheaper than any others, I would have definitely refinanced elsewhere.  Upon closing or a few days prior to closing, I never received a call from the loan officer to see how things went etc….  In fact most of the correspondence between him and I were initiated by me. He did return calls and answer emails, but the personal caring touch was not there as other home loan establishments I have dealt with over the years. He even had the spelling of my name wrong on the first documents, stating that he would have that cleared up on the following documents. On some information that was requested, I received an email from him sent to another individual. Another individual contacted me after the closing to make some minor corrections to documents and his attitude was awful. I emailed the corrections to him, never got a reply that he received them, a thank you or anything.  I found the entire experience, excepting the closing notary, who was great a very professional and personable, a less than satisfactory experience, excepting the interest rate. Training in customer service, in my humble opinion, is very much needed by the personnel at NewDayUSA that I dealt with.", "rating": 3}, {"title": "This Loan has been a lifesaver!", "text": "This Loan has been a lifesaver, lowering our liabilities to a manageable level. Except for the loan, we will be free of our lower-level liabilities by the end of the year so thank you so much. The Account Executive, Michael Xavier Aufiero Jr provided outstanding service during the loan process. The only recommendation I have, is to include in your initial application process a checklist that will identify documents required during the process (see list below). Even after closing and additional request was made for another employment verification. This will allow the applicate time to accumulate all required documents so they can be provided at the beginning of the process, reducing time, communication, frustration, and the lack of confidence in the process. In addition, I found your company’s lack of trust in my ability to pay off a personal obligation that was not associated with any financial institutions insulting. Checklist:1.\tHomeowner’s Insurance Declaration2.\tCurrent Mortgage Statements3.\tPension Verifications (Military, Jobs…)4.\tBenefit Verifications (SSN or others)5.\tNearest living relative information6.\tW-2s last 3 years 7.\tMilitary DD2148.\tPay distributions last 3 months9.\tProof of Employment10.\tEnsure Transunion and Experian are not frozen 11.\tHome Appraisal12.\tWood Destroying Organisms/insect Report (WDO Inspection)All could have been completed in 2-3 emails.Regards,Kevin Wilkins", "rating": 3}, {"title": "I am pleased and proud to be a part of…", "text": "I am pleased and proud to be a part of the new day. family. A special thanks to Mr. Silva.", "rating": 3}, {"title": "NEW DAY REVIEW", "text": "The experience was no better or worse than other mortgage companies I have used in the past.", "rating": 3}, {"title": "Admiral Lynch", "text": "Admiral Lynch,            We just recently closed on our IRRL loan with NewDay and were not very satisfied with the overall process. First of all we closed on a VA loan last year with NewDay and was very pleased with the whole process. Our loan officer then was Carleton Stephenson and he was exceptional. So this year we wanted to lower our APR and decided to refinance again to get a lower monthly payment. The best NewDay could do was 2.99% APR even though several other lenders were offering lower rates. But we stuck with NewDay because of your good service from before. This time we were not informed as to when the closing would be until the last minute and when the notary came to our home she did not give us a copy of what we had signed until several days later. It was hard for us to determine what our closing costs would be and even the amount of the new loan and the monthly payment. This process drug out for over three months and one delay after the other. I am a retired Navy chief and expected better service from NewDay. Our loan officer, Tim Dawson, was very polite and tried to stay on top of this loan but every excuse came up as to why it was delayed. Please try to do better next time. Thanks, Delden and Judy Farrington                                                     (904) 683-7466", "rating": 3}, {"title": "New Day was great to work with but the…", "text": "New Day was great to work with but the people who handle the account PHH are worthless", "rating": 3}, {"title": "The ad on the tv is not what actually…", "text": "The ad on the tv is not what actually occurred.   Borderline \"bait and switch\"", "rating": 3}, {"title": "The process was well but took longer…", "text": "The process was well but took longer time. The end was very confusing. Very nice employees", "rating": 3}, {"title": "Not a bad experience, but then again, not great.", "text": "Not a bad experience, just things that should of been taken care of were not.  My representative stated that it would be good to pay off past due accounts that were 6 to 7 years old.  I told him that those accounts had been passed around so much that I don't know who I owe what to.  He told me he would help me clear that up.  No where was I told what the time line, I thought I would receive funds 30 days after approval, escrow!  I mentioned to him just days before it closed and he sent me a list of credits without any other information.  The refinance was approved and closed almost immediately, which is a good thing..  Things moved so fast that I did to call those accounts and negotiate a settlement, which I told my representative I wanted to do before everything closed.The escrow company mailed the checks to my house for the past due accounts.  I got home and they were sitting on my porch, no signature required.  We're talking probably $25,000 worth of checks!  Upon review the checks there was not information provided as to how to get hold of anyone.  Checks had typos, poor quality printing and one was issued for the wrong account.  Like I told the representative, I don't know who I owe money too.Over all, it was a great experience with the exception of customer support and keeping agreements.  I would recommend NewDayUSA to my friends.", "rating": 3}, {"title": "Quick & easy", "text": "Quick & easy.  Higher fees and rates, could have saved $$, but needed fast.", "rating": 3}, {"title": "Kept asking for alot of things that…", "text": "Kept asking for alot of things that l've never had to provide before.", "rating": 3}, {"title": "I experienced two delays in closing…", "text": "I experienced two delays in closing date, none of which were caused by me.   I was also told initially the only option in cash-out refi was to have checks made out to the lenders I wanted to pay off, which caused me significant time lost in handling manual checks for payments which are normally electronically made.    Of the 13 checks I received  -- ONE is still pending being credited to the account I was paying off (over $5500), it appears it may have been lost in transit or miscredited.   I am working with the creditor and they are searching for this check in their system.   But I will shortly have another payment with this creditor due and wasn't planning on sending them one more payment.  Very late in the process I was told by NewDay that I could have had the disbursement in cash, but I would have had to delay the closing for a third time to change this.   It would have been nice to know this earlier on, because I did ask that when checks were brought up.   I opted not to further delay the closing.  There was also an issue with my water test.  The need for it was introduced late, and likely is what caused one of the closing delays, it should have been known up front. I was clear that my house did in fact have well water with its own well during the application process.  But I was also told by NewDay that I would have to pay for that out of my pocket, which I did to the technician who came to collect the sample.   Then I found out it was on my closing statement that NewDay paid for this, so I appear to be owed $107.00 at this time, which I am searching for my paid receipt from a Square Transaction I was asked to perform on my front porch, for followup on this matter.", "rating": 3}, {"title": "A communication breakdown occurred and…", "text": "A communication breakdown occurred and I lost out on money.", "rating": 3}, {"title": "Took a lot longer than I expected", "text": "Took a lot longer than I expected. Pushed a month back to close.", "rating": 3}, {"title": "I wish we had simply gone through our…", "text": "I wish we had simply gone through our local bank.", "rating": 3}, {"title": "Not an easy task took to long rates are…", "text": "Not an easy task took to long rates are higher than banks.", "rating": 3}, {"title": "I rate this company and people 5 stars…", "text": "I rate this company and people 5 stars all the way around.", "rating": 3}, {"title": "Deal seems a little shady..,", "text": "My experience was good for the most part. I was able to refinance my mortgage and save $117 on my monthly payment.There was some disappointment with part of the process, related to my interest rate. I was originally offered 2.99% on a 30-year loan. I was fine with that rate, as my current rate was 4.375%. I asked my advisor, if I could receive a lower rate, should there be another rate reduction, during my loan application process and he said YES. When I called back about a week later, regarding an advertised rate by New Day USA, of 2.75% on a 30-year fixed loan, my advisor said that he would inquire about offering me the better rate. A few days later, he called back to tell me that the rates went back up and 2.75% was no longer available. He said, “but at least you are locked in at 2.99%”. Well my “locked in” status lasted until my loan was approved and in the underwriting process, when I received an 11th hour call from my advisor, saying that New Day USA would not be able to offer me the 2.99%, because it would not provide me with the required “benefit” of doing the refinance of my current mortgage. OH!...but wait!!! Somehow agreeing to a new rate of 3.115%, was now in my best interest?! I agreed to the new rate, because I was tired of all the screwing around and wanted to get the deal completed ASAP!Did I save some money? Yeah...probably, if I stay in the house long enough to pay for the additional fees / closing costs that were rolled into the loan. I never received a good, reasonable explanation, of how 3.115% was so much better for ME, than 2.99% on a 30-year loan. I feel like I got worked over by New Day USA and I’m considering reporting this experience to the VA and the Department of the Treasury.", "rating": 3}, {"title": "Questionable", "text": "The experience I had with agent Joseph Potochney was great. His vast knowledge and willingness to go beyond the minimum exemplified the first class service I received. He always kept me informed and follow up with me to see if I had any concerns or questions. I give NewDay an (A) for service provided. The only draw back I had is the underwriter over kill I experience to verify income I received from selling property I recently sold. In this area NewDay went as far as to make me feel that I was being call a Laundering  thief. After I gave NewDay verifying documents showing them the receipt for selling the property and my bank statement showing matching money received for selling the property, NewDay verbally talk to the Law firm that handle the sell of the property and the Land Estate on a few occasion that I purchase the land from as if NewDay didn't believe I shouldn't have had that balance of money. Maybe someone else but not me. That's just the way I received it and personally felt. Then NewDay came back to me and wanted to go back at lease a year on my bank statement and want to know who and why I gave certain people money. People like my wife. At this point I drew the line and stated, \"that's was no one business my mine and if that was a deal breaker than so be it\". That was just too much of an insult and I was ready to pull out at this time. I felt that they stop doing their duty to verifying information and start a personal investigating of my personal life. But NewDay came back and stated they had all that they needed for finalize the process. In this area, I give NewDay an (F). Will I ever apply for another loan using NewDay is questionable.", "rating": 3}, {"title": "Every day was something different…", "text": "Every day was something different someone needed", "rating": 3}, {"title": "I was not impressed by New Days…", "text": "I was not impressed by New Days Representative.", "rating": 3}, {"title": "a lot of items were missed and delays…", "text": "a lot of items were missed and delays ocured", "rating": 3}, {"title": "To slow.", "text": "To slow and not enough communication", "rating": 3}, {"title": "Thanks for the lower Interest rate.", "text": "Date of experience: January 15, 2021", "rating": 3}, {"title": "Had several communication problems.", "text": "Date of experience: June 16, 2020", "rating": 3}, {"title": "Was a little taken back by loan fees", "text": "Date of experience: January 02, 2018", "rating": 3}, {"title": "acting time was a little to slow", "text": "Date of experience: October 10, 2017", "rating": 3}, {"title": "Did not agree with appraisal", "text": "Date of experience: April 22, 2019", "rating": 3}, {"title": "Tatana on tv to much", "text": "Date of experience: August 24, 2021", "rating": 3}, {"title": "Have nothing nice to say", "text": "Date of experience: November 22, 2019", "rating": 3}, {"title": "Finished but not thrilled about somethings", "text": "To be honest I was fine with this process at first. I was quoted that we would be able to consolidate 6 of my current bills into the loan. After the assessment of my property was done we could only do 2 at most, and that wasn't even guaranteed. I was told that based on what was in on my credit that my house was put up as collateral and had a lean on it from a 10k loan for my roof. I am not stupid and would not do something like that. I had to jump through hoops to show that it wasn't when all that was needed was a title search to ensure that there were no liens or anything of that nature, which was done later. I feel that the title search should have been done before even mentioning this, it would have saved some stress from happening. After that got cleared up I was able to add two things to my loan to get them off of me. I was not happy with a few things. the initial quote was based on a hope that my house would come out at 155k and we could take 6 total bills plus the house and consolidate them to make my life easier. I was looking forward on this and I had signed the documents for this. After my house was appraised it was only at 132k. As stated above this made things tighter and I could only put two things on the loan instead of six. In my honest opinion there should have not of been a quote at first, the appraisal should have been done and then the quote. This would have made it more practical and not got my hopes up that I was going to be able to get a lot of bills off of me. The process took a little more than a month to take place, the timing turned out to put me to a point where I had to make two payments on the bills that I was putting on this refinance. I was able to pull my account status offline but was not allowed to use that to show how much was owed as a new balance. This made no common sense, I wanted to make sure that I was not over paying the bills. This part in my opinion should have not had to wait for statements, the statements came from me printing them out from the same way that I printed out the account status earlier. Lastly: During this process I was required to get a termite inspection for the house. The company that did the inspection did not spell my last name right. It was not caught until the closing documents had been sent back to NewDay after I had signed them. I was called and emailed by Mr. Michael C. Coleman and told that I needed to resign the form the way that the termite company had put it on their form. This to me is unethical due to that not being my name at all. I understand that they had a section stating what my name could come out like at the beginning of the closing but if the name is wrong on the documents NO one should be told to sign incorrectly. It took a few hours and I had it corrected.\"Hi Mr. Kindley, We have a document that needs an easy correction for your loan to fund tomorrow. Just need you to print this out and add “Michael David Kinley Jr” on the first blank line and initial next to it.The termite inspector spelled your last name without the “d” so we need “Michael David Kinley Jr” added as a name variation.Thanks,Michael Christian Coleman II​Assistant Vice President ‑ Loan OriginationMLONMLS # 1788971Company NMLS # 1043\" I called and spoke with Michael Coleman's supervisor (Jacob Field) to express my concerns about the second two of my problems with this process and all he did was make excuses about how things were not in NewDay's hands to change or look at things in a different manner. Even told me that it was common place to have people sign how the forms state even if it isn't their names due to the start of the closing that it shows the variations of the names. I was not at all happy with Mr. Field's manner in taking care of concerns.", "rating": 3}, {"title": "Mostly positive experience with some avoidable frustrations", "text": "Overall, our experience has been positive, but we experienced some irritating, possibly costly problems.  Doing a refinance over the computer and the phone was an interesting experience. The application process went fairly rapidly, the appraisal scheduled quickly, and the signing with a local notary went well. The loan funded after the three day waiting period, and loan proceeds minus credit card payoff amounts were electronically transferred into our checking accountOur frustration came from credit card debt payoff.  In a past refinance (long before the computer age) our payoff to a credit card was paid directly to the creditor.  That did NOT happen this time. Checks made out to the creditors were issued on the loan funding date and then MAILED TO US WHICH REQUIRED US TO THEN MAIL THEM TO THE CREDITORS.  We were NOT informed that was your policy.  Had we known that, we would have had ALL payoff monies deposited to our checking account and could have made payoffs ourselves a LOT FASTER.  Both payoff checks were for incorrect payoff amounts (and overpayments) and we had to mail them to creditors (as they could not be processed at the store electronically).  Posting the payment will take 10-14 days after they receive it (one went to Florida from Idaho.)  The due date for a monthly payment will likely come before these checks are posted, and a refund received and deposited, so we will have to remit another payment to all three cards to avoid late fees and will accrue MORE INTEREST!  I (Lynette) had done a balance transfer of two credit card balances to a long-held credit card that had offered a 15-month ZERO % interest.  Just days after, husband Greg decided to do a refinance of our mortgage to do home improvements and he decided to pay off credit cards with loan proceeds.  The credit report that New Day pulled did not reflect the current correct balances of the original two cards and there was no record of the balance transfers to the third card.  Greg called with updated figures but they were not entered into your system. When Greg tried to call all day long one day to verify correct payoff information, his calls were not returned. The person assigned to our account while our loan person was out of the office simply ignored the calls and messages. That is poor customer service.So the loan funded with payoff checks that had incorrect payoff amounts. As a result, we now have to formally request a REFUND for each one after they finally post.  One company can do the refund as an electronic deposit to our checking account (which is estimated to take 3-4 days), but the other one only issues a check to be mailed to us, which will then take another 10-14 days to receive and then must be deposited into our checking account..  Because monies are tied up, we are unable to payoff the balance transfer credit card company. We will have to pay additional interest on two cards and possible late charges on all if another payment is not made on all THREE credit cards by their due dates.  So New Day may COST us money.  It's the principle of the whole situation that bothers us the most.  We did not receive good customer service; and, as a result, may incur additional interest costs we did not anticipate.This situation with payoff has made our whole experience frustrating.  We DO like the low interest rate, found the interaction with New Day loan people mostly positive, and are happy the loan funded so we can make home improvements and (eventually) pay off credit card debt.Because of our experience, we suggest your staff make your procedures for paying off credit cards VERY CLEAR to loan applicants so they don’t run into the frustrations we did.  We believe it reasonable to assume you pay off balances directly and others may assume the same. Clear and complete communication is necessary for customer satisfaction.  Greg and Lynette SaliBoise, Idaho", "rating": 3}, {"title": "My loan specialist was pretty …", "text": "My loan specialist was pretty responsive, and walked me through the process; however, he did not ensure I knew about key deadlines that ultimately delayed my loan closing. In addition to the delay, my payoff and cash out checks were sent to the incorrect address despite my confirming the address on two occasions.", "rating": 3}, {"title": "Refinancing and use of equity in home.", "text": "We had initially dealt with Quicken Loans to refinance our home but they were out for a quick buck and were basically lazy and did not show effort, so we did not refinance with them.Our experience with NewDay began very  positive but subsequently there were some problems with figures and amounts initially presented changing several times and some last minute requirements that were not outlined at the initial onset. Trying to explain that the math did not work regarding the estimate, essentially not listening to the customer, is not rapport setting; it turned out later to actually being a math entry error. SSubsequently things were worked out and we got all the funds we initially requested, and within the discussed time frames, so in that regard we are pleased.I would make  a few suggestions to a company which I believe has very good potential to be exemplary:- Those individuals dealing with customers with the ongoing requirements to complete the paperwork should have a checklist or \"cheat sheet\" that lists the stages and associated paperwork that must be completed in each respective stage, to include anything specifically mandated by VA requirements.- If there is a discrepancy, mathematical or otherwise, the representative should look into that potential error and then get back with the customer and explain it, either pro or con, rather than assume that the customer is wrong and is just not getting it.- Stating that the final numbers outcomes for the loan will not be available until the signing causes only problems at the signing; there were no real problems at our signing but only because we were diligent in finding out some answers prior to the agency bring the paperwork to the closing. All mortgage agencies have computer programs that can extrapolate those figures in advance so it should be a no brainer to provide to the customer something that is more accurate with no last minute significant surprises.Customer perceptions are their realities and good intentions can go only so far in terms of advancing goals of success in efforts made by any business.I know your efforts were sincere and we thank you for completing my VA loan which allowed us to pay off obligations and restructure our finances.", "rating": 3}, {"title": "once papers were signed no further …", "text": "once papers were signed no further contact from new day regarding refunds or if questions. still waiting for refund of escrow 18 days later", "rating": 3}, {"title": "The application part went smoothly even …", "text": "The application part went smoothly even with several last minute requests with days until closing.  My BIG problem was after closing and with your insurance dept.  I received a rather threatening letter in August saying they didn't have a copy of my current homeowners policy even though it was paid at closing.  This month I get a similar letter saying they were going to buy a policy covering the period from July to August 2017 because they didn't have proof of coverage..  This info was provided in the application package as my coverage goes from August to August.", "rating": 3}, {"title": "Refinance 2017", "text": "I started the request for a refinance with New Day at the end of March, 2017. We finally finished and got refinanced at the end of August, 2017. Each time I spoke with a rep, there was something else that they needed. It would have been more efficient if they would have told me all that they needed from me up front, instead of bits at a time. The reps would call me numerous times during the work day, even after I advised them that I am unable to speak to them during my work hours.", "rating": 3}, {"title": "Two forward, one back...", "text": "Switched agents midway through the process (Both good, btw).Every time we'd meet a requirement, a new one would pop up, instead of presenting the requirements at one time. It was as if the underwriters were trying to weed out the weak.", "rating": 3}, {"title": "Would have been nice to have all …", "text": "Would have been nice to have all documentation at hand so would only have to send one time, rather than requesting new info every couple of days.", "rating": 3}, {"title": "Honest", "text": "Honest, fair, thorough.", "rating": 3}, {"title": "Im satisfied with my experience", "text": "Im satisfied with my experience.  I do feel the closing costs are to high, but I went ahead with the loan with full knowledge. My experience with Andrew Herold his great.Good man.", "rating": 3}, {"title": "Completing my loan application was …", "text": "Completing my loan application was fairly easy. Tyler Tait was very helpful but he didn't properly explain haw the VA gaurantee works. I asked him if I my wife would have the loan paid off if something were to happen to me and he implied that that was right, she wouldn't be stuck with a mortgage payment. After a little more research on the VA web site I found that it wasn't so. New Day would get there money but my wife would still be liable for the loan, therefore I would still nee Mortgage Insurance to protect my wife from having to make mortgage payments. Other than that the loan process was a pleasant experience. Your loan processors need more training in explaining how a VA mortgage actually works. The only persons benefiting from not making you get Mortgage Insurance is the lender. You also need to make it clear that in order to protect your wife and estate, you will still need mortgage ins. I started reasearching this after New Day started sending me request to buy Mortgage Ins. from them. That's when I found out from the VA web site that I still needed Mortgage Ins. to protect my my wife from having to continue making Mortgage payments.", "rating": 3}, {"title": "Right up until it was time for the loan …", "text": "Right up until it was time for the loan to fund the procedure was fairly smooth...The closing was bumpy and the number of days for the money to move after closing went from three to five to seven days. Paper checks that I had to re-mail? Seriously?Payoff amounts exceeded the amounts owed by over $400 on my car and $1000 on my truck loan.", "rating": 3}, {"title": "After dealing with Christopher Khokhar …", "text": "After dealing with Christopher Khokhar this First time Home buyinrg experience has most Evenful. Things you may discuss may need to be recorded on your end ! If I ever buy another house it will not be with NEW DAY USA., Things will change by closing.", "rating": 3}, {"title": "The fees are exorbitant", "text": "The fees are exorbitant. The appraiser was smug & had an attitude. We had a couple of surprises at closing as well....additional fess that we were not told about beforehand.", "rating": 3}, {"title": "I called NEWDAYUSA AND INQUIRED ABOUT …", "text": "I called NEWDAYUSA AND INQUIRED ABOUT REFINANCING.  i WAS TOLD YOUR ORGANIZATION DOES NOT FINANCE MANUFACTURED HOMES, SO YOU ARE UNTRUTHFUL WHEN YOU SAY YOU HELP ALL VETERANS OBTAIN REFINANCING.", "rating": 3}, {"title": "It's been said", "text": "It's been said, \"The end justifies the means\".  That may be true and, in my case, the end was quite satisfactory as I was finally able to close on the property of my dreams.  The means, however, became very frustrating.  My New Day Account Executive did a terrific job working with me throughout the entire process; but it was a process that began on February 16 and didn't finalize until May 5.  That's seventy-eight days.I became frustrated.  The realtor became frustrated.  The title company became frustrated.  Various inspection services became frustrated.  The seller became frustrated almost to the point of backing out of the sale!There was no issue with my VA eligibility.  There was no issue with my credit, employment status, property appraisal, inspections or anything else.  So why did the process take so long and create so much frustration?  Certainly, I understand the requirements any lender will have for a buyer to provide evidence of financial stability.  In addition, the item being financed must prove to be of equitable value.  This is especially true in the case of a home mortgage.  Maybe it's even more true now in the wake of our bursting housing bubble in the U.S.  I get that...What I don't get is that with each piece of evidence I was asked for (and was able to provide same day in most cases but within 24 hours in all cases), why was it not possible for New Day to provide a comprehensive list of everything required so that I could submit it as a complete package for review.  Rather, one or two items would be requested and then a few days later one or two more items would be requested.  This dragged on for weeks.  After a while, some of the requests for items became duplicated and, in a few cases, the same documents were requested three different times.  Inspection reports were submitted only to find out later that a specific Form should have been used.  Why couldn't this have been mentioned in advance?  More time lost.  The Sales Agreement had to be revised numerous times.  I started to feel like my perseverance was being tested as part of the approval process.  Maybe it was but it almost cost me the home.  After the first seven weeks, it took daily reassurance to the seller on my part to not back out.  The process could easily be better structured.  Maybe do some benchmarking against other institutions or take advantage of Best Practices training.  I'm sure this ain't your first rodeo...As I said, the end was quite satisfactory and I do appreciate the efforts of my New Day Account Executive who at times I believe went above and beyond.  He deserves recognition.  His name is Matt Ferguson.  Nice work, Matt!  I would like to have added another star to my rating but I just couldn't go along with the words \"...very little friction.\"  I'm sure you can understand why.", "rating": 3}, {"title": "I AM HAPPY NO CHANGES R NEEDED AT THIS …", "text": "I AM HAPPY NO CHANGES R NEEDED AT THIS TIME", "rating": 3}, {"title": "Took too long to close.", "text": "Date of experience: April 14, 2017", "rating": 3}, {"title": "In the end it all worked out but had …", "text": "In the end it all worked out but had some delays and miscommunications.", "rating": 3}, {"title": "Thank you first of all for assisting …", "text": "Thank you first of all for assisting me. However, I spent around $100 just on faxing. This could have been done in one fax if everything you needed would have been told up front instead of in parts. The same with the termite inspection. That cost me over $100 because when told I needed it I was not told on the garage also so that necessitated two trips from the inspection company. Although the gentleman I worked with was extremely nice, it was almost as if he was new to the job and I actually grew to dread \"what next\" when I would see his number on my screen. Also, because it took longer than I anticipated and I had to purchase a new appliance on my credit card, the payoff on that card was more than originally planned. This affected the amount of cash I received and I won't be able to have the garage finished as I planned. BUT, I do appreciate you allowing me to get back on my feet after my husband's death from Agent Orange. If the government had seen fit to continue to me the amount he received, I would never have had a problem in the first place. I lost my husband but I was still left with the financial responsibilities we had when he was alive. Thank you.         Marie A. Davis", "rating": 3}, {"title": "Lack of experience for our situation", "text": "Our mortgage specialist was very polite and respectful however he didn't know much on how to handle our unique situation (chapter 13). We were constantly having to gather more and more documents which delayed our refinance by several weeks. I understand that dealing with bankruptcy is challenging but he should have done research before requesting the needed documents. At one point my husband and I joked what do they want now, a DNA sample. The free appraisal was definitely a bonus. We did get a lower interest rate and a somewhat lower payment so we are happy with the outcome.", "rating": 3}, {"title": "Took longer than Expected.", "text": "Everyone I dealt with was very courteous.  The problem I had was that every time I communicated with the representative they asked for additional material.  Even after they said they had all the information they needed.  This prolonged the process from late December to the end of February.I have a suggestion.  During my application process, 5 months, I continued to receive mailings about NewDay.  It may not be great savings to compared your mailing list against  those applications in process but it was a little annoying to continue to receive them throughout the process.", "rating": 3}, {"title": "communication issues", "text": "Our loan manager did not communicate with us in a timely manner leaving open questions and concerns.  His excuse was usually that he had been \"very busy\".", "rating": 3}, {"title": "Things done that I wasn't aware of", "text": "Insurance was changed to your company long before loan closed. This was not right. Was told you paid up to 600 for appraisal. Total was 600 I paid 150.00 also was told your fee was 2000.00 it was more. Not good. Plus agent took of before closing and left me hanging with someone else. Should finish what he starts or not start it if he couldn't see it through.", "rating": 3}, {"title": "Lengthy Process", "text": "Submitted all requested paperwork in August 2016. Loan was eventually closed January 30, 2017.Process reminded me of Peter Falk in Columbo, \"one more thing\" was always the next line.", "rating": 3}, {"title": "Yes our loan went through but", "text": "During the loan process the group of people reviewing the loan never took the time to fully review it at one time. They always needed more info.  If someone would have sat down and actually reviewed it completely at each major milestone during the loan they would have cut down my running around a lot. They were disorganized at best.", "rating": 3}, {"title": "IT TOOK OVER 1 YEAR TO GET THIS MORTGAGE", "text": "OUR FIRST CONTACT WAS TYLER SMITH. HE LEFT MID SUMMER[HAVING WORKED WITH HIM SINCE JAN. 2016] AND WE WERE TRANSFERRED TO [MATT STAMPER] AND WITH ALL MATERIAL NEEDED I WAS SLOW IN GETTING NEEDED MATERIAL FOR MATT. FROM THE FIRST TIME WE TALKED TO MATT WE  FELT HE WOULD DO WHAT WAS BEST FOR US. OVER NEXT SEVERAL MONTHS WHILE GETTING EVERYTHING TOGETHER [MANY FORMS WE HAD GOT FOR TYLER WE HAD TO GET UPDATED FOR MATT] WE SPOKE TO MATT AS MUCH AS 4-5 TIMES A WEEK. HE NEVER LOST HIS COOL AND ACTED TOTALLY PROFESSIONAL AND A TRUE ASSET TO NEW DAY. WE  THANK YOU FOR HAVING SOMEONE AS GOOD AS MATT. THANK-YOU DON&MARGUERITE MACPHAIL", "rating": 3}, {"title": "Not as smooth as I had hoped, but good customer service.", "text": "I had never taken advantage of my VA loan benefit so this time, while refinacing, I thought I would.  The NewDay USA commercials make it sound like the process will be easy, but our experience was long and drawn out.  Our total experience took nearly two months.  A very different experience than previous refinances with traditional mortgages.  In addition, the very nature of VA loans, requires additional requirements to be met that we never had to do before.  Some of which could have easily been accomplished before, or when we first applied, so we could have saved time.  Instead, it was like we accomplished one task, only to be told there was yet another to fulfill.  Certified lab water tests- which take days to weeks for results, home inspections, wood destroying insect reports, just to name a few.  Our interest rate wasn't anything special either, only about average.  I must say, the gentleman who handled our application process was great though.  He kept us informed in a timely manner of the progress and was very apologetic that the process was being delayed.  I didn't feel he was any part of the obstacles, the the process itself is the obstacle.  Having a list of things that should be accomplished before the application process is started, would help streamline the process.", "rating": 3}, {"title": "Appraiser was not timely.", "text": "The appraisal process was honest in his appraisal. The process, however took over two months. The account executive is a very kind gentleman and seems to need more experience managing the process involving the  unique VA requirements on rural properties.", "rating": 3}, {"title": "Would have been more effective to tell customers ALL requirements for paperwork in advance, instead of peicemeal which caused unnessary delay.", "text": "Experience was fine, but as stated above, the practice of \"slow leaking\" requests for data/paperwork was irritating.  Provide future customers with a complete list of all required actions on Day 1 of the process.This will give them time to work the many requests simultaneously instead of asked for one type of doc, get doc, provide doc, then asked for additional paperwork in dribs and drabs.", "rating": 3}, {"title": "Not easy for a self-employed veteran to use his VA benefits", "text": "The process started out seeming quite simple, but as we got into it, it became extremely frustrating. It felt like we were being treated like we were trying to hide something. We didn't appreciate having to continuously prove that we were on the up and up. My wife works 2 part time jobs and goes to school and she had to sign an affidavit that she took the week of Thanksgiving off and didn't receive a paycheck, even though the supplied pay stubs showed the correct total income. We gave everything we had to to get this done in a timely manner but it seemed it was always one step away from being finalized. Our agent was extremely patient with our frustration and should be commended for his hard work and dedication in trying to get the veteran approved.", "rating": 3}, {"title": "The end.", "text": "Everthing was great till the end the person I was working with went on vacation left a number for me to have for any questions or when I called I didn't really get my questions answered and it felt like it cost me some money because it took longer than I thought it would take", "rating": 3}, {"title": "Seemed like New Day had little experience", "text": "For the most part everything went OK until the very end. I was notified that New Day was having trouble getting a payoff from Quicken. I got the payoff info with one phone call. There were questions about my property taxes and all they had to do was tell me and I sent them my exemption paperwork, which I told them I had from the beginning. They then told me that I would have my cash in hand 72 hours after I signed the documents. Actually it took several days longer because they forgot about the upcoming holiday. Had to make other arrangements for Christrnas.", "rating": 3}, {"title": "Appraisal Reconsideration", "text": "The initial appraisal came in well below the market. I knew it and felt that the person did a very poor job. The explanation given by the Loan Associate did not fit basic logic. After discussion, I wrote and sent a request for VA reconsideration; however, while (a few short days, less than three days) the Loan Associate said the original loan was declined due to value less than loan amount. At the same time, VA , within the same time period, reviewed my reconsideration and added the value above the amount needed for the refinancing to be approved. My problem with this was the fact I had a Loan Rate Lock at 3.5% which would expire on or about 1/17/2017 and the Loan Associate explained that a new loan application would have to be generated. The new loan generated used my same/revised appraisal; the same Wood Infestation Report; the same credit report; the same loan amount request and everything else contained within the previous application, except, the Loan Rate which the apparent new application would be 3.75%. I felt then and do now feel that my loan rate lock should have been honored by New Day and/or upfront disclosure of New Day's policy of loan review process while the current loan is under review by a process apparently approved by The Veterans Administration for a VA Loan. As a VET I feel honored to have my loan with New Day Financial finally approved and set for new savings to my family. Thanks New Day for your assistance it is truly a bitter and sweet deal.", "rating": 3}, {"title": "To long closing", "text": "To many documents, long closing time", "rating": 3}, {"title": "VA refi with a second mortgage and many challenges", "text": "My refi was very complicated and it took months to bring the loan to completion. However, New Day handled every challenge with professionalism and a positive attitude.", "rating": 3}, {"title": "Refi", "text": "I went with New Day because I had never used my VA benefit for home loan purposes and was unsure of what my home value would be, so the free appraisal was appealing to me.  In the end, I have a lower rate and consolidation is complete, but there were so many hoops to jump through to get qualified and get to closing and we felt like over 2 months is a long time to wait.", "rating": 3}, {"title": "Used old credit report", "text": "Date of experience: November 29, 2016", "rating": 3}, {"title": "It could hve been much better", "text": "I was told to use the wrong forms. They had to be redone.  After it was done, there was suddenly more to be done.  The settlement Co. you picked was a disaster. They dribbled out task they demanded that need not be done in this case as noted by the notary they picked.  I would not use them again.", "rating": 3}, {"title": "A decent experience, could have been better.", "text": "The process was acceptable; however, there was some difficulty in finalizing the loan.  The main issue was that I was told that all was in place for closure on the refinance, when in fact the flood certification wasn't completed, yet.  When it was completed, it was determined that I needed flood insurance, for the first time in almost 15 years.  I spent the money to get flood insurance, only to be told a week later that the flood certification had been in error, and I could cancel the flood insurance.  Poor communication on this issue!  The rest of the process came off without too much difficulty.", "rating": 3}, {"title": "Good experience", "text": "The experience from start to pay-off was alright.  They gave use the incorrect initial contact (we didn't want any 'money out' of our refi, so we had to be transferred to a different specialist).  Rest of the process was smooth, everything was as was presented to us, UNTIL we received our first mortgage payment coupon.  Apparently, to pay by phone or by web there is up to a $17.50 surcharge...dont remember seeing that in any of the paperwork.  We'll be sending checks, until we can a) get another lower rate or b) it gets transferred off to another lender.", "rating": 3}, {"title": "We were told our Appraised valuation was met and then later that we missed it by $18,000.", "text": "Agent very cordial and easy to work with.  However, after the VA Appraisalwas completed he told us we had met the Appraised Valuation that we hadsubmitted on the application.  The next day he informed us that that the Appraisal came in $18,000. less than the day before.  This createdconfusion.  Why wasn't the correct information given to us on the first day he called?", "rating": 3}, {"title": "Acceptable but with friction is a good description", "text": "The first individual we spoke to was right on top of the situation and provided excellent advice in the process. After discussion we decided to not take any cash out in the process and were transferred to another loan officer. Though we got through the process, we felt we were always the ones initiating contact and felt we were always wondering what the next steps were instead of being advised and kept up to date. Refinancing a home is a big endeavor, and the customer should never be left wondering what is next, or why the process is moving slowly. In fact, we were given several closing dates, only to have them not materalize on those dates. Some of it was due to the underwriter which is always an unpleasant part of the process, but other parts was lack of communication with the loan officer. Like I said before, that was not the case with the first loan officer we talked to, so doubt it is a corporate culture of New Day, but only this specific individual. Needless to say the process became frustrating.", "rating": 3}, {"title": "Ok service. Expected more from a company that services vets", "text": "Loan officer was disinterested. The whole transaction felt like dealing with a typical bank. If Newday touts that they are looking out for vets I'd expect the service to be better in that sense. The \"thanks for serving\" routine wasn't genuine. The third party notary service was terrible, the escrow company sent me someone else's paperwork. End result I refinanced my house, rate was ok, it fit what my goals were but I definitely wouldn't give a stellar review or recommendation to friends.", "rating": 3}, {"title": "Poorly informed and not well organized on the required tests and dosuments.", "text": "I have bought and sold homes before. If I had been a young first time veteran go through this process it would have been very scary. The requirements for an easement agreement changed several times with new day requirering me to start and stop with my neighbors. To the point I had to call the title company who then gave me number to call someone in an executive position at new day and finally get some answers. The water test was not needed then it was needed then the one I did wasn't good enough and I had to do another one. Then after I had done the pest inspection on my house I was told I had to get another inspection on my steel building which was as I said is steel and had no wood of any kind in it and after two weeks of back and forth I found out I didn't have to after I had already got the inspector  to come back. The process took nearly two months and while the rate was good I could have got a lower rate with other lenders but I was so involved I just went with it.   I would not recommend this program.", "rating": 3}, {"title": "Veteran Respect", "text": "Although NewDay USA got our refinancing taken care of, the representative we worked with seemed to have no respect for my wife and I, was rude at times and ignored emails and phone calls", "rating": 3}, {"title": "Sloppy Experience", "text": "We refinanced earlier this year with New Day and it was a FANTASTIC experience. However, due to our air conditioner going out (we live in the desert) we decided to refinance and pull money out. This experience was not anywhere as good. Our person did not keep us informed and we almost missed closing due to him waiting on everything.", "rating": 3}, {"title": "NewBay", "text": "I was hoping for easier more helpful service, we did get it done but ever time we we're getting to the end I was asked for something else more information needed, it just took way to long. I was also hoping for a much lower interest rate.", "rating": 3}, {"title": "COULD HAVE LOST EVERYTHING", "text": "I must say I was very excited to be getting my first home.  I did everything on my end that NEWDAY required including getting homeowners insurance and an estimated closing date.  Something very scary occurred that could have been terrible.  Original closing date was set for 10/06 tentatively, but then was moved up to Sept 30th. Once we closed, we realized that we had a major leak upstairs that had been undisclosed involving a process that would have to tear out most of the second floor of our home to repair.  I went to my insurance company and they were not updated on the new closing date. When I filed my claim, we WERE NOT COVERED.  NEWDAY let this slip through the cracks and now I am forced to pay for this huge repair on my own.  But I also think of what could have happened, what if I lost the home to fire in those days ......Total Loss and still have to pay my mortgage payment with nothing to cover it.  All because they never updated my homeowners start date.  I am very upset and now faced with going the legal route to recover my expenses.    My realtor stated that in 20 years, he has never seen a mortgage company fail to update all important paperwork and Insurance prior to a closing.  Very Unsatisfactory.   SGT Vance/USMC Disabled", "rating": 3}, {"title": "Not one fax!", "text": "I'm not sure this isn't just the way mortgages are handled now, but it was VERY nice to be able to do everything via email and e-doc signing. Even when an ink signature was necessary, all I had to do was scan and email.My ONLY complaint at ALL was when Charles Glatz didn't call me back when he said he was going to, he lied and told me he DID call, but just didn't leave a message. Hello... Caller ID worked every OTHER time you called, suddenly it doesn't work the ONE time you call and \"didn't leave a message\"?? While only a \"white lie\", it was still extremely disappointing to be lied to at all instead of simply acknowledging he forgot to call.", "rating": 3}, {"title": "Lengthy experience", "text": "The people were ok to work with but the process was was very long and drawn out.", "rating": 3}, {"title": "I had some bumps, closed late,", "text": "I had a really simple refi, plenty of income, home value good, good credit score, but still delays and delays, closed lateMy agent was excellent, closing attorney very good, new day, I don't know", "rating": 3}, {"title": "The VA got a better deal than the Vet.", "text": "I was hoping the VA loan would pay off all my debts  My contact was Ian and initially told me and sent me work sheets that showed not only lowering my mortgage payments but also paying off all my debts.  It turned out that the VA's part increased by 16K and this was almost exactly the same amount of debt that remained unpaid.", "rating": 3}, {"title": "Too Lengthy", "text": "I was upset with increase in interest rate quoted at 3.25 and increased to 3.375 even though national interest rate did not increase, and the length of time the whole process took -- almost 4 months.  My contact, Dylan Hughes, was totally professional and seemed to be doing the best he could to help me.  Having just lost my husband, who served our country for 21 years in the Marine Corps, the whole process was extremely tedious for me.  I, however, am pleased with the end result.", "rating": 3}, {"title": "Worth It in the End", "text": "We refinanced our mortgage from another company and got a lower interest rate which will save us $400/month. In our 30+ years of home ownership, this is the 6th time we have refinanced a home, and this was by far the most difficult to get through. Every inch of our lives was scrutinized and the amount of documentation that was required was ridiculous. The person who worked with us  expressed understanding of our frustration and eventually got us through the process.", "rating": 3}, {"title": "They got the job done", "text": "The bottom line is that NewDay successfully funded our home mortgage, which is what we came to them for.  Their loan officers didn't seem very experienced, and often their professionalism was lacking compared to traditional large banks.But, at the end of the day, they were able to finance our purchase and put us in a home!", "rating": 3}, {"title": "Took way to long, needed way more info than I thought necessary, though my situation was a bit unusual, still, they kept needing this,needing that over and over. The Account Executive was very good .", "text": "Honestly, I believe the underwriters are a bit overly paranoid. They wanted more and more when in the beginning I had provided all the necessary documents, showing income, and all. But still, they needed more and more and more. I showed them within a month I had the finances to to afford the refinance easily. But in the end, they finally came thru with the approval to close, many many months later. The poor account executive was really in the middle having to ask over and over for what they were demanding. Glad the whole deal is over and got the refinance finally. If I'd of known it was gonna be that long and detailed I'd of gone elsewhere.", "rating": 3}, {"title": "Over Rated", "text": "When I was getting close to my closing date I was required to sign e- documents. When reviewing the closing cost break down I noticed the VA was charging $ 3400.00 dollars in VA Fees. My total closing cost exceed $ 10,000 dollars approximately 5,000 more then a regular mortgage company. The representatives are great and easy to work with. I was very disappointed in the cost of the VA fees. Ed", "rating": 3}, {"title": "Nice,buy interest a little high.", "text": "It worked alright in my postion but my only complaint is closing & the interest rate which was higher then  Freddie-Mack rate. Otherwise it was very simple. Thanks Ronald Helsel USN", "rating": 3}, {"title": "it was great sometimes .", "text": "IT was hard at times", "rating": 3}, {"title": "Great Account Executive, Excessively bureaucratic underwriters.", "text": "I am 60+ years old.   Simply stated, if it had not been for my NewDay Account Executive, I likely would not have stayed with this 3 month process.   On two occasions, I encountered irrelevant & unnecessary 'requirements' by the Underwriters for completing a loan process that  had nothing to do with my Financial wherewithal.   Indeed, one 'requirement' was simply snooping into my methods of banking... after having completed the financial approval of the loan.On the other hand... the Account Executive and his Supervisor... were stellar in handling my impatience with the Underwriters, my own delay, and coming thru with an excellent package to refinance my house.   for that I am grateful.", "rating": 3}, {"title": "Good but not good.", "text": "Newday approved us when other places would not. Good! Unfortunately the process took much much longer than it should have. Four months for a VA mortgage loan with (no realtor involved) for a company that only does VA loans is unacceptable.  Telling us a survey is needed a week before closing was typical of the process. New or updated info every 2 or 3 weeks for 3 of the 4 months?? Isnt there a list from day one?", "rating": 3}, {"title": "Refianced", "text": "Went pretty well with a couple of glitches but Ian worked very hard to make it a good experience for us.", "rating": 3}]