[{"title": "Understandable ", "text": "There are always things which need upgrading and in cases like mine where you are an elder person things should be made easier to understand. Otherwise it is easy enough to understand.", "rating": 3}, {"title": "On previous occasions I had no problem…", "text": "On previous occasions I had no problem send money via Western Union. But recently whenever I have tried sending money a message comes up telling me to go to one of my local agencies which is annoying when want it done with straight away online. Why is this happening????", "rating": 3}, {"title": "Good process but there is an invisible discount", "text": "The transfer process is done quickly and simply, but there is a problem. It says we will receive a specific amount but in fact there is another discount built in and we receive a smaller amount than what is stated on the home page", "rating": 3}, {"title": "Verify my State", "text": "At one time when I sighed into my account, I merely went to setting up the transfer; now, each time I want to do the same, I get an error about my ID; nothing has changed except W.U. process because I get emails telling me about how my account has changed after the transfer. What's teh point of my 'secure' account and yet teh inconvenience of each time getting stopped because of an invalid ID and asked to verify my information again for each transfer", "rating": 3}, {"title": "Stiil a wrong Bankaccount were showed…", "text": "Stiil a wrong Bankaccount were showed on the receipt such as MTCN 9923215146; MTCN 9933936737; MTCN 1593867574. I can't choose my own Bankaccount.", "rating": 3}, {"title": "very fast but no cheap and promotions usually ", "text": "very fast, sure but almost no promotion like Paysend usually allows free sending and adds points for next sending and the sending price is not cheap like Paysend but i have the problem identify so i must transfert here ", "rating": 3}, {"title": "Website is outdated, slow, not user friendly…", "text": "Response times (along with refreshed screens) are grudgingly long. Error messages are not sufficiently highlighted, not user friendly. Sometimes it is not clear what the next step should be. WU does not recognize the same customer under different user IDs. The transfer is not immediately available in history. In my case, it does not show even after money was picked up.  ", "rating": 3}, {"title": "Site does not perform as easily as it…", "text": "Site does not perform as easily as it used to. History doesn't show unless you refresh and then it no longer shows latest to oldest transfers and date filters don't work well. It takes much more time now to do a transfer, and no longer shows records of all transfers and can no longer start another transfer because they now go to under review despite many years of doing the same transfers", "rating": 3}, {"title": "I had to re-enter the receiver's bank…", "text": "I had to re-enter the receiver's bank information but it did not arrive and was refunded. This is distressing on both ends. Also, the receiver has to go to a store and re-register every so often. It is also a problem that I hope can be fixed that if the banking info does not change, then no re-registration is needed. When the system works, it does so very well. Thanks.", "rating": 3}, {"title": "Generally it does OK", "text": "Generally it does OK. Last time I sent money for commissary, I had to pay for the urgent delivery. My son checked several days for the money, but it wasn't there in time. I put the money in and it cleared on Tuesday, September 17th, it didn't show until Saturday, September 21st. I paid for urgent delivery, but didn't receive it.", "rating": 3}, {"title": "The site is not user friendly", "text": "The site is not user friendly. The bill pay review came up looking totally different than previous, like it was in a new language", "rating": 3}, {"title": "Earlier transaction was lost", "text": "Earlier transaction was lost. hopefully i didn't get charged for  it on Sept 28 around 10:35pm. please let me know. I use my card number and the security code also. hopefully the transaction was cancelled.its currently doing the same thing again. its not submitting my concern", "rating": 3}, {"title": "I have been with you for years your…", "text": "I have been with you for years your service is good but sometimes you give people hard times over the verification, even the account is already verified, that is my dislike, your family needs money for expenses, you kind of put the transfer on hold for no reason at all. Comparing the people names for what ", "rating": 3}, {"title": "We need to let customer know if online website if they having technical issue", "text": "Needs to emailed or contact the customer if they having a technical issue website to send money online. Also customer service. Needs to tell customer whats going on.Nobody can tell us why the western union website is not working.Bad customer service.She give me a reference number so i can have 50% discount for fee.The reference number is not working. Wrong reference number.Reference Q56096007324 didnt work.she lied to me. I got embrassed.Next time give us a heads up. If the system is not working.", "rating": 3}, {"title": "instead of continue there should be…", "text": "instead of continue there should be submit button and confirm button. People think it is still not completed when they click on continue button after review.", "rating": 3}, {"title": "Your speed of delivery is good 1 star", "text": "Your speed of delivery is good 1 star, you automated help just runs FAQ and it showes, someone should have tried all situations it's annoying to be told to switch the light on an not provide the switch. In point...misspelling the name, bet that's never happened!! OK can't edit... oh dear, so, cancel ok go the transaction oh no no cancel button, oh go help, are you are in xxxx so it answers in local language ok look for flags no you idiot they have written it in local language oh go to dark room sh she don't cry ", "rating": 3}, {"title": "customer service ", "text": "I called customer service for help with missing history on my app. Last transaction showing is in May but we are in October now. I send at least once or twice monthly. Customer reps I talked to are just making me wait with advices that are not actually solutions. I called several times daily 10/6, 7, and 8 since the advice actually didn’t help. One example is I have to wait for 48 hours for tech with the repair order which nothing happened coz I was not even given a ticket number as I was this time which again I have to wait for 72 hours this time. Not to mention the long wait time and long hold they put me in every call. Your customer service reps are just running the time and are not helpful. One rep  talks over me and won’t let me finish my sentence. I am waiting for my transaction history to be fixed so I can view my transactions and send the needed money asap. Please help. Thank you! ", "rating": 3}, {"title": "good service, at a cost", "text": "though the process is quite streamlined, the fees for paying with cash are quite high, not to mention you guys stopped your WU points.", "rating": 3}, {"title": "I like that it’s quick and simple…", "text": "I like that it’s quick and simple however I don’t like the fact that there’s zero customer service support. I have emailed, rang and Facebook looking for help from western union with no response whatsoever and it’s just not helping on this regard as a long time customer who has been using western union since 1998. What happened to customer service even over the phone is no longer there. ", "rating": 3}, {"title": "Improve conversion rate and coupon codes for recurring transfers.", "text": "Please consider having coupon codes for existing customers. All coupons are only for ”first” transfers, but never for recurring transfers. I send monthly transfers and the transfer fee costs too much. Another area to improve is providing better conversion rate/transfer fee when choosing credit card as the payment  method. Thanks.", "rating": 3}, {"title": "Fast, but expensive", "text": "Transfer orders are usually executed quickly. However, the fees are not exactly cheap.And there are still no new benefits for regular customers, as promised a long time ago!", "rating": 3}, {"title": "I’ve used this service a couple of…", "text": "I’ve used this service a couple of times, and the transfers were quick and smooth, with my recipient receiving the money almost instantly. However, when I returned for an urgent transfer, it was unexpectedly canceled without clear explanation. This was frustrating, especially since I needed the money to arrive quickly. Reliability is key for services like this, and I hope they improve their consistency", "rating": 3}, {"title": "I dislike the fact that now I cannot download the receipts for my transfers in a pdf form anymore.", "text": "I dislike the fact that now I cannot download the pdf of the transfers I do and I need those for my taxes. I tried to send a message on the chat group but did not get an answer . I called the phone number (0800 ..) for France but the agent could not help me. he gave me an email address and told me to email them for the confirmation of the transactions. I need to know why I cannot download the pdf now. it is very frustrating", "rating": 3}, {"title": "Receiving Funds", "text": "Having Western Union (WU) getting my money for transport works fine.However, one complaint I have is that when I transfer money from my bank to my recipient's bank, it takes a week or more for the funds to arrive at the bank account I sent it to.  Why is that?  If the funds were sent for individual pickup at a WU location, it would be available in minutes.  But the recipient would have to go to WU to get the funds.  In today's digital environment that is a pain in the butt!", "rating": 3}, {"title": "It works and family gets their money. Site is just so slow to respond", "text": "The site is so slow to respond to the different pages it makes it hard to use. I use it very often to send money to the Philippines. But sometimes have to start over because the pages time out.It works, my family gets their money just so clumsy to use.Been using the site for several years. Wish you would upgrade your servers or ?", "rating": 3}, {"title": "You're overcharging to transfer money", "text": "You're overcharging to transfer money. $10.00 is a lot. The exchange rate to Europe is highway robbery.I sent $154 and ended up paying almost $200.", "rating": 3}, {"title": "I have not received any reward points…", "text": "I have not received any reward points in a long time Update , your response didn't help. Ive been hearing this for a year . I don't receive any points for the transactions during this time . Cant redeem points if they never increase. You only receive stock scripted answers with customer service. ", "rating": 3}, {"title": "Good at first but cash pick up was a challenge", "text": "The initial stages of the transfer to the US went very smoothly but once the money was ready for pick up in the US, that is when the challenges started.It turns out that the instructions provided on the website of sharing the 10 digit MTCN number with the WU agent did not tally with the experience on the ground. The US agent was asking for an 8 digit pin (not 10) and there were no instruction anywhere on the WU website or messaging how to get an 8 digit pin rather than the 10 digit MTCN. It was only through blind luck that my recipient figured out how to get the 8 digit pin. WU needs to update their instructions to make dealing with a US based agent much clearer.", "rating": 3}, {"title": "It’s 2024 your transfers take too long", "text": "It’s 2024 your transfers take too long. Can’t wait until crypto transfers become mainstream. You prices forsame day pickup are outrageous. I can transfer crypto instantaneously for fractions of a penny. Your time is coming, your greed will be your downfall. ", "rating": 3}, {"title": "It has been interrupting!", "text": "It has been interrupting! Also, I have problems when I do send about 110 or 120 USD to my family in Egypt every month! Your system insist to send Egyptian pounds instead! ", "rating": 3}, {"title": "For some reason your system keep…", "text": "For some reason your system keep showing my Information from 2014.I took me a while to be able to change my profile, and once changed it still doesn't recognize my account. I've got 2 cellphone numbers but my profile, email is the same, now I am not sure if I do have two different accounts with the same profile except my phone numbers...Either way Wester Union is a very useful website, thank you,Daisy 424-343-4090 424-844-6817", "rating": 3}, {"title": "It s going backwards instead of forward.", "text": "It always takes 3 to 4 times to enter the information again and again, the identity, passport, etc, and then it blocks and freezes and the transfer has to wait another two to three days. Very frustrating. A website with many flaws and glitches. Problematic in a financial universe. But this time, at least, at the end it went through. ", "rating": 3}, {"title": "Usually a very smooth transaction", "text": "Usually a very smooth transaction. This time I tried to leave a message, then it took me to emogis, I tried to back out, but ended up 2 -3 pages back then a couple of continues to get to the send page.", "rating": 3}, {"title": "No Action at All", "text": "I have been sending money through Western Union for more than 10 years and everything seems good. I could see/track my money transfers by logging into my Western Union account and looking through \"History\". I didn't need to call Customer Care every single time after I send money to track the my money transfer because I could track them online. HOWEVER, this change on the month of August and September 2024. I've sent money 3X already and couldn't see those transactions at all in my WU Account. I called the customer care number ( 1-800-325-6000) 3X already and chat with WU reps multiple times and I was told that they will take care of it and the issue will be fixed after 48 hours (that was a month ago) and until now, nada! I still could not see my money transfer in August and September 2024 in my WU account. What is going on?", "rating": 3}, {"title": "price too high", "text": "price too high for Cambodia why is it 10% or more to send small amounts?  When to Thailand only $2.99 for $50 this is using debit card,,, CC is higher  Otherwise the process is good for helping people out", "rating": 3}, {"title": "WU app required \"cash pick up\" as the only option. ", "text": "I am a regular WU user. In my recent transactions, I realized that the WU app automatically selects the \"cash Pick up\" option. I couldn't make the transfer without that option, which I don't prefer, and it required me to pay unnecessary transfer fees. The system stopped working if I didn't select that option. I was in a hurry, and I had to transfer the money. ", "rating": 3}, {"title": "I dislike to wait up to 11 days to…to received the money in the bank. specially when several transfers already established the integrity of the client and  account.", "text": "I dislike to wait up to 11 days to received the money in the bank. specially when several transfers already established the integrity of the client and  account.  ", "rating": 3}, {"title": "Simple and easy procedure", "text": "Simple and easy procedure. Usually rather fast. Only negative point is the bad exchange rate. If you accept that (make calculation!!), it is a good way of transferring money. ", "rating": 3}, {"title": "Why I am not getting rewards points?", "text": "Why I am not getting rewards points?I suppose to send 200 dollars but I hit wrong button for 100 dollars and I have to send again another 100 dollars to make it 200 dollars and western union charge me twice and cost me 7.56 sending fees?I want western union should charge me only one time sending fee of 3.78 ", "rating": 3}, {"title": "Sending money by western union is very…", "text": "Sending money by western union is very easy and faster but transfer money from visa card to my country the transaction rate is too low then the actual rate in Bangladesh now.western union should fix this issue urgently.  ", "rating": 3}, {"title": "I got this problem i always claim…", "text": "I got this problem i always claim western through gcash yet it says i was locked out due to 3 invalid mtcn tries but the mtcn was correct. Could someone help?", "rating": 3}, {"title": "It works but beware of how they make money and their outdated system", "text": "I've used WU for probably 15 years both in person and online sending.  The $ gets there but you need to know:If you can send from and into your currency, you'll lose less money - not only are you paying their fee either way, but their exchange rate is WAY below market so you lose $$$ if you can't keep it in the same currency.  Once \"lost\" a HUGE percentage and they explained it was getting \"exchanged\" multiple times: once from USD to local to arrive at bank, then back to USD then back to local again (for what reason I do not understand but that's messed up).In person will always give you less issues and generally lower fees.The reason for this post is I keep being giving errors when using my bank account to send now (won't work with checking or savings despite using the manual input and reviewing it's all correct).  This is forcing me to pay more than double to use my debit card associated with the same bank account instead.  The online system also won't let me start a new transfer from scratch, I have to use the \"quick resend\" of an old transfer.  The system is clearly old and bugging.  Costing time and money every time.  So be aware, if you can go in person it'll take a few minutes but give you less of a headache, and always keep it in your home currency if possible to avoid loss on their exchange rates.", "rating": 3}, {"title": "WU does NOT have a Good Exchange Rate!!", "text": "WU does NOT have a Good Exchange Rate!!Therefore Many Times I Don’t Choose WU but other Currency Transfer Apps who have a Better Rate & Most time Free of Fees!! But All Apps are a Rip Off especially when Charge a Fee cause they Short Change you with the Rate of Exchange!!", "rating": 3}, {"title": "Easy to send but very expensive!!", "text": "It's very easy to send money to anyone at anytime. However, the fees associated with transfers are outrageous! Please, please review and modify these fees.", "rating": 3}, {"title": "Today was more difficult than usual", "text": "There seemed to be a bug and I had to try many times before I could get each transaction completed.  The problem may be that I had to update my debit card information while I was in the middle of the first transfer.  And perhaps this is what affected subsequent transfers but normally it is much smoother.", "rating": 3}, {"title": "\"Sending money was very easy", "text": "\"Sending money was very easy, and everything in the app is very good. However, the recipient always receives the amount short by approximately 5% of the sent amount. Can you clarify this?\"", "rating": 3}, {"title": "limited vs unlimited sending amount for the customer", "text": "well i have use the app and it doesn't allow a customerunlimited amount on what you can send. Previous times before it doesn't allow you to send what you want. I had to go to western agency to send. The company of the app need to improve on this so customer can feel useful of the app online. I was dis- pleased with the fact I'm limited to how much i can send online. ", "rating": 3}, {"title": "Website needs improvement", "text": "Usually Western Union online works just fine, but yesterday I had a lot of frustration trying to update my info on the website. Second, It make no sense to me that I can't use Cashapp with Western Union.", "rating": 3}, {"title": "Why do I not get any promo codes for…", "text": "Why do I not get any promo codes for using this service for so long? I see if you click on a certain WU link, you will see a 100% no fee usage charge refund. But if I try to use that link, it won’t give me the discount. Why doesn’t it work for me and why don’t I get any discounts?", "rating": 3}, {"title": "Receive in minutes is deceptive! ", "text": "I transferred $ to receive in $. Money transfer/transaction with corresponding service fee indicates, \"receive in minutes\". The next day, I was told by the Receiver that the WU branch she visited did not have the $ available and that the money will not be available for pickup until Friday. She went to another WU and had the same issue, was told to book the pickup with the WU branch and then wait for 48hrs or so before it can be available.I wasnt expecting it to be available immediately but I wasnt expecting to wait for 48hrs either! Inconvenient is an understatement. ", "rating": 3}, {"title": "I realise imade a mistake and made it…", "text": "I realise imade a mistake and made it pay cash instead of debit card i had problem with one location but i realise they are new at this location. Went  to another location and it was fine.", "rating": 3}, {"title": "I am a loyal customer and I've been…", "text": "I am a loyal customer and I've been sending money monthly and trying to send at least 1k per month but instead I can only send $600 dollars and I am not happy about it.", "rating": 3}, {"title": "its so good but sometimes i experience…", "text": "its so good but sometimes i experience it takes how many days before i recieved my money in my bank. ", "rating": 3}, {"title": "I have tried for days to send money…", "text": "I have tried for days to send money both by my cell phone and laptop. I've tried multiple payment methods and each time they timed out or failed. Just now it finally processed, but now needs \"verification\" with no indication as to why. VERY frustrating. ", "rating": 3}, {"title": "Send to corrections system need work", "text": "Send to corrections system gives no feedback in app I did not revive any confirmation or any indication that my transfer was complete. I then went to the standard page of WU to learn that the original transfer was complete.", "rating": 3}, {"title": "Why I am not offered discount on my…", "text": "Why I am not offered discount on my transactions when I am eligible for it?Many times due to rush we tend to forget about the discounts available and miss using them.", "rating": 3}, {"title": "System processes", "text": "System processes / transitions are PAINFULLY SLOW.Also, RE; I need to CHANGE my profile phone #.SENDING A VERIFICATION CODE TO THE PH.# THAT I NO LONGER HAVE FOR CHANGING IT IS THE EPITOMY OF STUPIDITY!!!!!!!!", "rating": 3}, {"title": "Sometimes it takes a couple of times to…", "text": "Sometimes it takes a couple of times to get a transaction to go through. It tells me to come back later! Also would like to see better pricing on the transfer fees for customers who use WU multiple times a week. Transfer fees are way too high. ", "rating": 3}, {"title": "Transactions had been extremely rough, needing several tries to get through.", "text": "Transactions had been extremely smooth. The experience today was a little rough, having to attempt several times.It might be the time (early 7:00am PST).", "rating": 3}, {"title": "It kept coming up in Spanish", "text": "It kept coming up in Spanish, altho I've been doing this in English for years.  I kept losing the space for my US ammount.", "rating": 3}, {"title": "exchange rate not competitive", "text": "I have used WU frequently, so this is easy to use.  Your exchange rate is lower than other providers, so will likely be changing to others for their better exchange rates.", "rating": 3}, {"title": "Honest review is that while it is most…", "text": "Honest review is that while it is most difficult to send money, I do like the security.   I feel well protected and feel well advised to be wary of potential spam.  ", "rating": 3}, {"title": "Gateway issues September 1st week…", "text": "Earlier this month there were too many web site issues opened a chat with service rep the answer wan canned it’s a gateway issue try later. Did not work for 5 days ", "rating": 3}, {"title": "Review", "text": "I don’t like that every time I send money to the same person I’m asked to verify what is the reason I’m sending money. In addition, there are no more rewards program.", "rating": 3}, {"title": "This new thing about adding a layer of…", "text": "This new thing about adding a layer of protection would be OK if it worked, but having to wait almost 5 minutes to get a code is ridiculous.", "rating": 3}, {"title": "checking money...it takes a long time and you check users who send their parents money every monthI've been using your application for a few years... every month I send my parents money... last month ", "text": "I've been using your application for a few years... every month I send my parents money... last month you checked the amount of €460, which is ridiculous... it's not from €46,000, but from €460 and it lasts for days...  and maybe my parents needed the money urgently... I don't know why the verification of users who send every month almost every time on the same date... and such a small amount of money", "rating": 3}, {"title": "High service charge", "text": "Overall the service is good, but there is no rewards for regular customers. I send money frequently but there is no promotion for service fee at all, infect the service charge is keep increasing.", "rating": 3}, {"title": "I find with Western Union where they…", "text": "I find with Western Union where they make money is giving a very very poor Exchange rate on Transfers so my Recipient always seems to be short when she collects", "rating": 3}, {"title": "system issues", "text": "While the system works, it is slow and clunky. Perhaps a software problem that need updating. ", "rating": 3}, {"title": "Change of address challenge", "text": "I had trouble sending money due to change of address which I had done on line. I had to spend a stressful hour on the phone and finally someone helped me resolve the issue. I send money monthly and hope that last month was a one time occurrence?", "rating": 3}, {"title": "The website lags too much", "text": "The website lags too much. When you change a name in your reciever's list, it does not take. Very difficult to maneuber through because of the lag ", "rating": 3}, {"title": "i disliked having to initiate this…", "text": "i disliked having to initiate this money transfer 4 times and finally had to call the help desk to resolve the issue.Seems that i had to clear cache and wait 10 minutes.It took me 40 minutes to discover that however.", "rating": 3}, {"title": "I would like to be able to pay via…", "text": "I would like to be able to pay via PayPal. I also tried to register my credit Union to add a new bank account to pay with but was unable to add them. ", "rating": 3}, {"title": "Last time I waited a long time for a…", "text": "Last time I waited a long time for a transfer, people on the other side who are the recipients are very unhappy, since last Friday they have not been able to receive the transfer ", "rating": 3}, {"title": "Problem with website", "text": "Every time I go in to website to send money the site is under construction and it's always around 5pm same thing always what is going on?", "rating": 3}, {"title": "The process may not go through but you don't know it. ", "text": "Even though you go through the whole process, the money may not go to your loved one.  It says the money transfer is on hold even though I paid extra for the instant transfer fee.  ", "rating": 3}, {"title": "Inconvenient to re-upload the passport, for bigger amount..", "text": "Been transferring money from my US$ payroll account to my own local bank account for the past years, recently, I transferred a bigger amount (double the amount) from my usual transfers as I need it for investment. It's quite inconvenient as the system was asking me to upload again the copy of my passport details and my transaction still needs to be check and reviewed.", "rating": 3}, {"title": "I am scared W", "text": "I am scared W. U. will change my instructions.  This time I caught that you changed the name of the receiver and I changed it back to correct name.", "rating": 3}, {"title": "The website is very unstable so I tried…", "text": "The website is very unstable so I tried using the app which was really good until I got to the receipt page which kept booting me out and I couldn't continue but other than that it was very easy to use", "rating": 3}, {"title": "The recipient to which I send money…", "text": "The recipient to which I send money monthly, lives in Uganda. He and his family are poor and do not have a bank account. Therefore it’s a cash pick. I use my credit card and I feel WU overcharges for the use of credit cards. ", "rating": 3}, {"title": "How do you delete names and cards that…", "text": "How do you delete names and cards that are no longer being used? I hate sorting down the list(s)09/30/2024 that always shows up.", "rating": 3}, {"title": "Took my money prior to account…", "text": "Took my money prior to account validation. Would have preferred this to be done the other way around.Good rate and fees", "rating": 3}, {"title": "Where is the rewards?", "text": "Haven’t been able to access the rewards for a very long time and I always looked forward to using the points I would pay for rewards, They haven’t been available for a long time.", "rating": 3}, {"title": "Since the last year i use western and…", "text": "Since ths last year i use western and every week i send money to my family in Haiti but you never give my discount", "rating": 3}, {"title": "I don't understand why on my history…", "text": "I don't understand why on my history transactions it shows unavailable but on my bank account it's already posted taken out .", "rating": 3}, {"title": "It's average", "text": "It's average. I wish they bring back the rewards. As a member and I send/transfer monies monthly. That was disappointing.", "rating": 3}, {"title": "your website is not working properly", "text": "your website is not working properly, takes too long to login pages, refuses card already used before.", "rating": 3}, {"title": "Getting the money exchange in Kenya ", "text": "Could stand some improvement with sending  money to these countries. Crazy things are happening in Kenya 🇰🇪 😳 🤔 NOW I just need my money back.$100 in total ", "rating": 3}, {"title": "do not like changes", "text": "not sure why but all the new changes have made it a little more difficult", "rating": 3}, {"title": "Transfer fees are too high", "text": "*I like the transfer of money in minutes. *The transfer fees are too high. *I have not been able to access my points for months now.", "rating": 3}, {"title": "Your website is slow like turtle and It…", "text": "Your website is slow like turtle and It has been almost Ten years like that since I remember when I am using this site is very slow, Specially when I send money changing the amount it takes sometimes for ever and when use back button for number while changing the amount take for ever and sometimes it would not even work. ", "rating": 3}, {"title": "COST FACTOR", "text": "IREALLY WISH DEBIT CARD TRANSFER FEES WERE SUBSTANTIALLY LESS AMOUNT.", "rating": 3}, {"title": "\"technical difficulties\" ", "text": "\"technical difficulties\" have been a big issue for me logging in the last several times.  Eventually I get in but it's been weird that the site regularly tells me I cant access my login because of technical difficulties it doesnt explain", "rating": 3}, {"title": " customer support…", "text": "You need to improve customer support response. Even after commitment they don’t respond rather we have to do regular follow up ", "rating": 3}, {"title": "YOUR WEB PAGE IS NOT WORKING PROPERLY", "text": "YOUR WEB PAGE IS NOT WORKING PROPERLY, IT SHUTSDOWN, IT DESAPEARS ALTOGETHER, ....REGARDSMRS RAGONE", "rating": 3}, {"title": "I had issue sending money to the…", "text": "I had issue sending money to the recipient even though I have sent money to them before. It took three days for them to get the money ", "rating": 3}, {"title": "I don’t like the high cost of…", "text": "I don’t like the high cost of transferring money, especially since i’m supporting ministries and Orphans with the money.", "rating": 3}, {"title": "It is very good but they cuted extra…", "text": "It is very good but they cuted extra money before giving it to the receiver ( in Libanon)", "rating": 3}, {"title": "Very cheap ", "text": "The dollar is very cheap for a customer who uses the service frequently. It should be at least 7.80 quetzales. ", "rating": 3}, {"title": "The system is giving me a hard time to…", "text": "The system is giving me a hard time to send money on other banks except banco de oro. I used to send money thru land bank and seems to be problem.", "rating": 3}, {"title": "The transfer was taking to many days", "text": "The transfer was taking to many days, specially the last one I did send. The first 3 transactions they did go through very fast. But little by little are taking too many days ", "rating": 3}, {"title": "The transfer fee become higher", "text": "The transfer fee become higher. Money transfer takes longer.", "rating": 3}, {"title": "Still don’t know what happened to the…", "text": "Still don’t know what happened to the rewards program, WU is not being transparent with their costumers regarding the rewards program.", "rating": 3}, {"title": "Fast and convenient but does not accept bank acct payment", "text": "After the initial step of entering exact details of address and bank branch, service works super fast and conveniently -except that it will not accept bank account payment, despite the fact that it says it does and claims it is the cheapest route. ", "rating": 3}, {"title": "I know longer get rewards points for my…", "text": "I know longer get rewards points for my transactions.  The cost of the transactions have also increased ", "rating": 3}, {"title": "Credit card payment failed", "text": "Credit card payment failed. Which always leaves you in doubt whether it will have been charged anyway or not.", "rating": 3}, {"title": "Mobile money ", "text": "Everything is working great except the transfer is NOT instant like other Apps.  It can even take up to a day.  So if you have time to wait then it’s all good.  ", "rating": 3}, {"title": "Sending Money", "text": "I like how I can start a transfer online and pay in store so it saves me time; however, the only issue I have been having is the system automatically changing around the last names of the person I am sending money to, so it has made me have to go on the support page to fix the name since it can be done at the store.", "rating": 3}, {"title": "Lately it has been very difficult to…", "text": "Lately it has been very difficult to send money to my receivers, why??", "rating": 3}, {"title": " Rates not being accurate & Money  transfer takes too long", "text": "The money transfer takes too long, two days or more. I pay with my ATM. It should take minutes, not days; that's what it says right under. Also, the rate at the front says one rate, but when you send the money, the rate changes to a lower rate. Also, the fee transfer changes, too, which is not fair. WU should honor what it says!! ", "rating": 3}, {"title": "Asking about ID when account is over 10 years old", "text": "Why you are asking about my ID now when my account is over 10 years old. Why asking the reason for transfer. None of your business.", "rating": 3}, {"title": "Penger går fort.", "text": "Penger går fort.Currency exchange rate er dårligere enn RAI.", "rating": 3}, {"title": "I like the money reaching on time", "text": "I like the money reaching on time. But I don't like is the increase of money for transaction. Before was good when it was 2.99. But it's feel little expensive 4.99.", "rating": 3}, {"title": "The first attempt failed", "text": "The first attempt failed, down to recipient. Second attempt was a 5 star experience - very smooth and efficient", "rating": 3}, {"title": "Exchange rate is not competitive and…", "text": "Exchange rate is not competitive and money takes too long to be delivered. ", "rating": 3}, {"title": "should give discounts for customers who…", "text": "should give discounts for customers who have been using your services", "rating": 3}, {"title": "It takes a bit longer time to have my…", "text": "It takes a bit longer time to have my money transferred done to my local bank account. ", "rating": 3}, {"title": "Reason for this I immediately cancelled…", "text": "Reason for this I immediately cancelled the first transaction today is the 17th of September transaction was on the 30/8/24 no reflection of my money in my account the process is too long", "rating": 3}, {"title": "The app works well", "text": "The app works well. However I don't like the annoying sales pitch at the end of the transaction. ", "rating": 3}, {"title": "Easy instructions…", "text": "After reading the instructions it was relatively easy to send payment to parties abroad.", "rating": 3}, {"title": "The service fee is too high", "text": "The service fee is too high. Consider scaling it. I remember when it was so. The more money one sent, the higher fee paid.", "rating": 3}, {"title": "i dont know why my transaction getting…", "text": "i dont know why my transaction getting cancelled its really urgent for me to do transaction", "rating": 3}, {"title": "The transfer rate is too high", "text": "The transfer rate is too highI tried to redeem the rewards it did go throughSometimes the prompt was really slow and asked the same question ", "rating": 3}, {"title": "I have been making many transfers but…", "text": "I have been making many transfers but aren’t getting any points for free transfers! Like before!", "rating": 3}, {"title": "Giving error while input payroll card", "text": "Date of experience: October 08, 2024", "rating": 3}, {"title": "Great service but fees have increased…", "text": "Great service but fees have increased 200% in the past few months from $4.99 to $14.99.", "rating": 3}, {"title": "Says points on hold and i have used wu…", "text": "Says points on hold and i have used wu quite a bit not good for a loyal customer.", "rating": 3}, {"title": "took me 3 attempts to complete this…", "text": "took me 3 attempts to complete this transaction.", "rating": 3}, {"title": "Stringent condition ", "text": "There are very stringent conditions,may as a result of government regulations to international business,thereby making it difficult for customers to send or receive money.Some of these customers usually source for alternative ways of sorting themselves out.", "rating": 3}, {"title": "I keep having the error C7777 R1943", "text": "I keep having the error C7777 R1943. Is blocking me at the time I need to send money by emergency ", "rating": 3}, {"title": "Using a new Laptop", "text": "Using a new Laptop, and all displays ae not coming through!", "rating": 3}, {"title": "As expected my money transfers are…", "text": "As expected my money transfers are provided quickly however I’ve been a customer for so long and the absence of the reward program and points never being accumulated is not acceptable. ", "rating": 3}, {"title": "I DON'T LIKE THE RATING ICON JUMP IN…", "text": "I DON'T LIKE THE RATING ICON JUMP IN FRONT OF MY WESTERN UNION CODE. ", "rating": 3}, {"title": "Transfer fees", "text": "Unlike other money transfer services Western Union charges both the sender and recipient, which disadvantages the recipient as they end up getting less than they would be expecting. ", "rating": 3}, {"title": "My transfer did not go thru the first…", "text": "My transfer did not go thru the first time, so when i did it next my discount of 1.99 disappeared.", "rating": 3}, {"title": "Delivery time is erratic even though I…", "text": "Delivery time is erratic even though I am sending similar amounts, in USD to the same person and location.", "rating": 3}, {"title": "the fact that it's on hold when this…", "text": "the fact that it's on hold when this never occurred before. Have been doing this for years.", "rating": 3}, {"title": "Transfer speed is good but increasing…", "text": "Transfer speed is good but increasing the transfer charges is very much disappointed.", "rating": 3}, {"title": " Extra Charges.", "text": "Totally disappointed with extra charges. Thinking to switching with Zella", "rating": 3}, {"title": " promo code useless", "text": "Ywhen i use promo code , western union wont send the money. If they get the money to send, they will send.  That is wrong. If you give us a promo code we should be able to send the money.", "rating": 3}, {"title": "Why am i getting limited on sending the…(exceeding limit)", "text": "Why am i getting limited on sending the money?", "rating": 3}, {"title": "All was going well", "text": "All was going well, until the last money sent took 11 days to be picked up.", "rating": 3}, {"title": "I dislike that it doesn't give you more points", "text": "I dislike that it doesn't give you enough points. But I like that it's easy and quick.", "rating": 3}, {"title": "Fees going up and frequently exchange…", "text": "Fees going up and frequently exchange rate is low ", "rating": 3}, {"title": "I dislike the amount of money you…", "text": "I dislike the amount of money you charge for just senting $200.00.  I can see it it was more money, but that is too much.", "rating": 3}, {"title": "I do not like the processing time which…", "text": "I do not like the processing time which takes way too long", "rating": 3}, {"title": "Need to bring back sending to accounts directly ", "text": "For certain countries it's 5/5, however for countries like Nigeria, other companies send directly to bank accounts. ", "rating": 3}, {"title": "Legit but expensive", "text": "Legit but the website can be slow and the fees are way too high", "rating": 3}, {"title": "You all transfer fee to send money is very high and I don't appreciate that", "text": "You all needs to adjust that rate it's a bit to high", "rating": 3}, {"title": "Recent transfers have been refunded and…", "text": "Recent transfers have been refunded and now I cannot access my account.", "rating": 3}, {"title": "I don't like the fact that we are not…", "text": "I don't like the fact that we are not getting any rewards for months. I wire money at least 2 or 3 times a month", "rating": 3}, {"title": "There always trusted and reliable with…", "text": "There always trusted and reliable with their service. ", "rating": 3}, {"title": "You are good at sending money", "text": "You are good at sending money. Very happy. But not happy that I can not retrieve some of my points.And I send money every week to Ecuador ", "rating": 3}, {"title": "It takes a long time to become effective", "text": "Date of experience: August 30, 2024", "rating": 3}, {"title": "Really fast service but really…", "text": "Really fast service but really expensive fee! ", "rating": 3}, {"title": "I would like my remittances delivered…", "text": "I would like my remittances delivered within 24 hours ", "rating": 3}, {"title": "Rewards program", "text": "I supposedly have a reward for some of the fee. There is no way that works to apply it. ", "rating": 3}, {"title": "Very quick transfers but very low poor…", "text": "Very quick transfers but very low poor exchange rates", "rating": 3}, {"title": "My payments get refunded randomly even…", "text": "My payments get refunded randomly even after calling and explaining the purpose for the transactions", "rating": 3}, {"title": "Easy and quick", "text": "It's a pretty easy app to navigate but it's pretty spendy! ", "rating": 3}, {"title": "Money was transfered in 7 days", "text": "Money was transfered in 7 days, not acceptable", "rating": 3}, {"title": "The amount of money being charged to…", "text": "The amount of money being charged to send money. Plus you take away the points system. ", "rating": 3}, {"title": "The fee is rises more often and getting…", "text": "The fee is rises more often and getting higher ", "rating": 3}, {"title": "It took 3 attempts to complete my…", "text": "It took 3 attempts to complete my transaction.", "rating": 3}, {"title": "where are mu rewards been sending twice…", "text": "where are mu rewards been sending twice a month", "rating": 3}, {"title": "website needs improvement", "text": "website needs improvement. it just goes automatic by itself.", "rating": 3}, {"title": "It takes a longer time for the receiver…", "text": "It takes a longer time for the receiver to get the money  ", "rating": 3}, {"title": "service is ok but fees are high and no…", "text": "service is ok but fees are high and no rewards", "rating": 3}, {"title": "Don't Accept any \"offers\"", "text": "After sending my money my information was collected and I started receiving spam calls ", "rating": 3}, {"title": "I needed to find an online business to…", "text": "I needed to find an online business to send a small amount of money for a relative’s birthday, and one where I could safely provide bank details without any scam involved, and I was very lucky that I knew of this business and found the whole process reasonably straightforward so as I started to process my application, various “technical glitches” started, particularly when I’d completed the application, every time I went to press submit, it kept coming back as an error message, so I looked for a “physical” store, and discovered WU at the back of a Cash Generator store and as I went to do this over the counter, to my annoyance, and considerable frustration, I did not have any of the required ID and even phoning the HQ and asking to do this over the phone, I was informed that they weren’t able to do this for me, which I had to leave and try another day, and by then, in a much better WiFi connection area, I was able to process it. I am one of those people that do not possess either a driving licence or passport, so you’re excluded from their counter services if you can’t provide these.", "rating": 3}, {"title": "Where in the states are  WU based  and…", "text": "Where in the states are  WU based  and what's the time difference between them and U.K.", "rating": 3}, {"title": "The fees are expensive and can’t use…", "text": "The fees are expensive and can’t use points", "rating": 3}, {"title": "Too much annoying ads", "text": "Too much annoying adsWorse yet, they do not want to go away!", "rating": 3}, {"title": "needs improvement on your website", "text": "needs improvement on your website ", "rating": 3}, {"title": "The money takes too long to Venezuela", "text": "The money takes too long to Venezuela, they need the noney", "rating": 3}, {"title": "Delayed deposit in receiver account…", "text": "Delayed deposit in receiver account than originally promised.", "rating": 3}, {"title": "The transaction is not completed easily…", "text": "The transaction is not completed easily except after several attempts.", "rating": 3}, {"title": "I miss real discounts", "text": "I miss real discounts, and I am tired of all the adds.", "rating": 3}, {"title": "Online site needs update", "text": "Date of experience: August 27, 2024", "rating": 3}, {"title": "Your system went down", "text": "Date of experience: October 02, 2024", "rating": 3}, {"title": "Delivery times", "text": "Delivery times vary significantly which is not helpful.", "rating": 3}, {"title": "The first attempt did not work", "text": "The first attempt did not work.  I have no idea why.", "rating": 3}, {"title": "Excelente y quickly ☺️", "text": "Date of experience: September 19, 2024", "rating": 3}, {"title": "The website is very glitchy I’m not sure what’s going on ", "text": "The website is very glitch y I’m not s", "rating": 3}, {"title": "Tevreden over service", "text": "Date of experience: September 17, 2024", "rating": 3}, {"title": "Too much of form to feels and not…", "text": "Too much of form to feels and not enough rate ", "rating": 3}, {"title": "Better exchange rate", "text": "Date of experience: August 14, 2024", "rating": 3}, {"title": "fast", "text": "good app to transfer money", "rating": 3}, {"title": "Rewards", "text": "Still can't use my rewards ", "rating": 3}, {"title": "slow", "text": "slowit took a while make the transfer", "rating": 3}, {"title": "Easy service to use", "text": "Date of experience: September 19, 2024", "rating": 3}, {"title": "too many questions", "text": "Date of experience: August 28, 2024", "rating": 3}, {"title": "Best and reliable services ", "text": "Money is sent at a fast rate and quickly", "rating": 3}, {"title": "Your sending fee getting expensive", "text": "Date of experience: August 21, 2024", "rating": 3}, {"title": "Rates are too high", "text": "Date of experience: September 08, 2024", "rating": 3}, {"title": "Nice apps", "text": "send money quick", "rating": 3}, {"title": "Doesn’t work", "text": "Doesn’t work ", "rating": 3}, {"title": "timeleness", "text": "Date of experience: September 26, 2024", "rating": 3}, {"title": "ISSUE RESOLVED. NOT W/U FAULT.", "text": "REMOVING MY PREVIOUS REVIEW", "rating": 3}, {"title": "beaucoup de temp 12h/24", "text": "🤝 va bene va bene", "rating": 3}, {"title": "Inadequate Error Messages", "text": "When a transaction fails, the error message does not adequately explain why. You just have to keep trying, or use another source.sometimes a transaction will fail and display as 'not completed'. Then, a few days later, the exact same transaction will process. Very frustrating...", "rating": 3}, {"title": " Employees do not know how to process money transfers. ", "text": "I had to send my sister some money for a gift. She drove around to 1 Walmart super center, a tobacco plus, and 3 Dollar General stores before she found one that knew how to process a Western Union money transfer. All of the places she went to provided Western Union services, but no one knew how to do them. ", "rating": 3}, {"title": "Unable to redeem my rewards for…", "text": "Unable to redeem my rewards for transfer fee.  Get message I have a reward waiting but it will not apply to the recent transfer fee", "rating": 3}, {"title": "Bank transfer takes too long", "text": "Date of experience: August 17, 2024", "rating": 3}, {"title": "Delivery time is too much", "text": "Delivery time is too much. It was instant few times ago. It is instant with other companies.", "rating": 3}, {"title": "Worked once and never again", "text": "The service works as needed, I tried to use it a second time and for some reason the same card I used for the first transaction, did not work again for the second time I wanted to try. So I had to let a friend send the money to me instead. So basically Western Union blocked my card so that I was not able to use the service again. I decided that I would just send the money to my friend first via wise and let them use their Western Union account to send me money instead. ", "rating": 3}, {"title": "It takes 2 -3 days to transfer the…", "text": "It takes 2 -3 days to transfer the money. ", "rating": 3}, {"title": "The exchange rate given by WU was lower…", "text": "The exchange rate given by WU was lower than the open market rate. The transfer of funds takes a few days but there are no issues with that.", "rating": 3}, {"title": "It's fast and easy I like that", "text": "It's fast and easy I like that. what i don't like is that I had accumulated reward points that i never got to use, they just disappeared. that is not right", "rating": 3}, {"title": "What's wrong your Fraud Agency", "text": "I'm sick and tired get calls frim your fraud agency ever month over and over for the same person I may send money too.  The fraud agency makes appear this person's name is the only one in whole country.  So stupid and I fell harassed. When I acf question I get know answer the can't tell if the person is a man or woman. Also, they can't say where funds are big picked up.  Cameras are in banks request for them and match to see if it's the same person.", "rating": 3}, {"title": "Too easy to make a mistake", "text": "Too easy to make a mistake.    I lost 850$ just recently.  I sent it 2x.  I could not get in back.  ", "rating": 3}, {"title": "My first experience was great when I…", "text": "My first experience was great when I went back to use it a second time the conversion rate was significantly lower and there was a large fee. So I opted out not to use western Union again. ", "rating": 3}, {"title": "Whenever I want to send money to…", "text": "Whenever I want to send money to someone there was a lot error interrupt 😞.Please make it easy for sender 🙏", "rating": 3}, {"title": "I have troubles always sending money I…", "text": "I have troubles always sending money I do not have the time to always call in and answer a bunch of question just to send the money I want to to whom ever ", "rating": 3}, {"title": "Suspended the rewards program and…", "text": "Suspended the rewards program and raised the transaction fee.. ", "rating": 3}, {"title": "Random rate increase", "text": "It is a shame that mid year and out of nowhere, the bank account transaction fee increases. I will stop using western union's platform and stick to others that don't increase their rates just because.", "rating": 3}, {"title": "The stop doing the point", "text": "The stop doing the point ", "rating": 3}, {"title": "Good day", "text": "Good day! I was using western union since 2012.. I send money 2x every month before I can earn points and able to use it.. now since how many years I didn't see I earned points anymore? ", "rating": 3}, {"title": "It's good but sometimes its ask for us…", "text": "It's good but sometimes its ask for us billing address cause I am from India and I sent money from Italy to India but why it ask for us billing address because of that I can't send the money ", "rating": 3}, {"title": "I already have a profile with Western…", "text": "I already have a profile with Western Union but then when I am trying to send money it's asking me upload my legal documents like passport or driver's license. Why m I suppose to upload this if I already have profile with you guys. Thanks ", "rating": 3}, {"title": "The website is not user friendly", "text": "The website is not user friendly. It takes too long to load, and transactions take too much time. I have a very high speed connection so that is not the issue. It's every time I use the Western Union website. ", "rating": 3}, {"title": "No dollars ", "text": "The last couple of times that I sent money in dollars, the receiver was told that they did not have dollars and he had no options than to received the payment in bolivianos. The official change is way lower than the market. ", "rating": 3}, {"title": "Better rates", "text": "Better rates ", "rating": 3}, {"title": "This is hard to use", "text": "Date of experience: August 15, 2024", "rating": 3}, {"title": "The system is great", "text": "The system is great! Unfortunately when we went to pic up the money in Santorini the store said they were closed dispite their hours on line", "rating": 3}, {"title": "Fees are way to high to send to Malawi", "text": "Fees are way to high to send to Malawi. It was easy to pick up the money but i just can’t do those fees ", "rating": 3}, {"title": "Same day service should be for your regular customers ", "text": "I like services offered by western union. But I would suggest to improve it's services so that I can receive this money the same day. It should be free for regular customers who just rely on you. There should be something special for your regular customers. ", "rating": 3}, {"title": "For some reason it won’t let me send…", "text": "For some reason it won’t let me send more money to the person I’m trying to send when in the past it would work just fine ", "rating": 3}, {"title": "The exchange rate is cheaper than the…", "text": "The exchange rate is cheaper than the competitors ", "rating": 3}, {"title": "I don’t like the rate in your app", "text": "I don’t like the rate in your app. I found some app is better “taptap send”", "rating": 3}, {"title": "Handy", "text": "I love how convenient it is with the app from my phone and quick and easy but what I don’t like is how low they pay for the dollar exchange compared to the real value of that day for example if the dollar is $4000 Colombian pesos for $1 dollar they exchanged it for $3640 peso for $1 so if you send $100 dollars they eat a proximate $10 off the value plus the fee transaction it should be closer to the exchange value of the day to be more fair because you’re already charging a fee ", "rating": 3}, {"title": "Transfer fee is very high", "text": "Date of experience: August 09, 2024", "rating": 3}, {"title": "The commissions are too much!", "text": "Date of experience: August 16, 2024", "rating": 3}, {"title": "I don't like having to wait while my…", "text": "I don't like having to wait while my transaction is put on hold. The account number is confirmed, and there's money to cover the transaction. Therefore, my transaction should be processed and a receipt generated as soon as I press the SEND button.", "rating": 3}, {"title": "I don’t have a choice but to like it", "text": "I don’t have a choice but to like it. The interface is not user friendly. Its rivals are less cheaper but better. ", "rating": 3}, {"title": "Time of transfer transaction are not consistent", "text": "Transactions time to complete from bank to bank are not consistent. Delays have been happening lately. The last experience took 8 days for my family member to receive funds.  Sometimes it only takes one day. Other times the transfer takes longer.I send money to my family through WU every month for usually the same amount, so why is there inconsistency?", "rating": 3}, {"title": "Decently easy to transfer. ", "text": "For the most part, sending money to someone with Western Union has been relatively easy. However, my receiver is now unable to receive money through local pickup. The Western Union partner they were going to, to receive the money, started to refuse them service because I wasn't sending more than $1000 at a time. They stated that anything less than $1000 wasn't acceptable because it's \"too little\" of money. I have since started transferring using the bank transfer option, and other than taking up to 7 business days, it has been ok. I don't see anything on the Western Union website about needing a certain amount for a local pickup, so just be mindful, your receiver may not be able to accept your money via local pickup unless you're sending over $1000 at a time.", "rating": 3}, {"title": "Takes too long.", "text": "Takes too long.Received error messages that were vague.I had to repeat the process several times before a successful transaction.Customer service was not helpful.I did not receive an update when money was finally received.", "rating": 3}, {"title": "fast", "text": "fast, neat but expensive, and rarely gives free sending like Paysend ( cheap fee and free transfer frequently )", "rating": 3}, {"title": "I'm looking for sending money to…", "text": "I'm looking for sending money to another country, but the rate lowers 7 cents after I signed to cmplete.my.transfer.   I feel cheated and look for another app. Thanks, Nella", "rating": 3}, {"title": "I have been having trouble sending", "text": "I have been having trouble sending ", "rating": 3}, {"title": "I am having trouble getting refunded…", "text": "I am having trouble getting refunded $100.00 that did not get sent to son.", "rating": 3}, {"title": "Confusion", "text": "Before, when I sent money the next day the fund was available to the recipient. Now, it takes one week before sending, at times, they do not take funds from my account until the day they promised date. Now, one week before the date, they take the fund and wait a long week to send it to the recipient.", "rating": 3}, {"title": "i use my bank credit card from my…", "text": "i use my bank credit card from my checking acct and i'm  charged 17.99  why if i use my checking acct number 8.99", "rating": 3}, {"title": "Increase in fee, decrease in speed of delivery!!", "text": "I have been using the WU since an year and I till the month of june-2024 my family received money in India almost in 2 - 3 hours. Since July there is a delay upto 7 working days. From August 2024 there is a un announced increase in transaction fee of 100%, i.e.., $0.99 to $1.99.Plus my experience of interaction with the agent on chat is very bad regarding my transaction. Except for sorry and It depends on financial institution theya have no other answers! It's money! It's emotion when you wire money back home. I see none of these organisations really understand this!I sincerely believe unannounced moves and the kind of response like these surely wanes trust and reputation of the organisation ", "rating": 3}, {"title": "bring back the rewards ", "text": "I am NOT happy with the fact that they seem to have terminated the rewards system....I send money frequently and am disappointed in this.", "rating": 3}, {"title": "I need to send money and was told I had…", "text": "I need to send money and was told I had already reached my limit so I had to go to another company Remitly. ", "rating": 3}, {"title": "This may be the last time I'd use…", "text": "This may be the last time I'd use Western Union sending to Phils. My rewards haven't been coming as promised, unlike the previous years. I was a loyal client then. There're a lot local money transfer firms with better deals right now. ", "rating": 3}, {"title": "First transfer is cheap but not timely", "text": "WU waived the fee for the first transfer. The pricing was excellent. The funds arrived much later than they had predicted. Perhaps this was also because for the first time they need to ascertain my bank accounts etc. Hope that it will be timely next time. ", "rating": 3}, {"title": "I don't like the transfer fee.", "text": "I don't like the transfer fee.. make it more economical as well as convenient...especially for the low income...this is not very economical at all...at least have an option or some way to help especially the low income ppl.. to make their lives easier to send money to their love ones...", "rating": 3}, {"title": "4 days for a transfer money?", "text": "Very Good it ", "rating": 3}, {"title": "It was working fine", "text": "It was working fine, loved how fast it was but my card hasn’t been working lately. I don’t know.’", "rating": 3}, {"title": "Not reasonable fee and slow", "text": "I dislike the following:1. Huge fee: $8 for $100 transfer.2. Slow transfer (4-5 days)", "rating": 3}, {"title": "Service within the United States. ", "text": "I wanted to wire money to Arkansas to my grand daughter but was shocked at how expensive it would be.  So I logged off of westernunion when I realized that wiring money in the united States is very expensive.  ", "rating": 3}, {"title": "you don't take American express", "text": "you don't take American express ", "rating": 3}, {"title": "I like using your App ", "text": "I like using your App But I haven’t got any points lately towards my transaction to use as fees.", "rating": 3}, {"title": "Opinion ", "text": "In my opinion I am a little against it because they have me waiting 30 days to be able to send money. I have not sent a million dollars for them to keep me waiting for a long time. I think I have sent like 15 thousand dollars, that is not a lot of money to be restricted for 30 days.", "rating": 3}, {"title": "allow for a first test transfer…", "text": "Please allow for a first test transfer of token amount. Then consider the next transfer as the first for the promotion to apply. Waive the fee for the transfer after the first test transfer.Thanks. ", "rating": 3}, {"title": "SLOW", "text": "I do not understand in this day and age of technology why it takes a week to transfer money from one bank account to another. ", "rating": 3}, {"title": "Exchange value waas not great", "text": "Date of experience: August 01, 2024", "rating": 3}, {"title": "Credit card payment", "text": "Through out the summer 2024, the web site allowed me to click \"credit card\" as a payment option, then when the money transfer form was completed, I received a notice telling me to use another source.The offer to send 5K never works.", "rating": 3}, {"title": "I don't like the changes to the app", "text": "I don't like the changes to the app. it made the whole experiance longer then needed and the needed information was covered up by promotions and useless information.", "rating": 3}, {"title": "Never had this problem before but it…", "text": "Never had this problem before but it took over a week to transfer the money. Unnerving!", "rating": 3}, {"title": "It took over a week to get money…", "text": "It took over a week to get money transfer and a week to get a refund ", "rating": 3}, {"title": "Same info asked twice after a week", "text": "Same info asked twice after a week, delaying payment. ", "rating": 3}, {"title": "Domestic transfers are more expensive…", "text": "Domestic transfers are more expensive than International. Needed to send $80 and fees were $18. That is outrageous", "rating": 3}, {"title": "Easy transitions but it cost too much", "text": "Easy transitions but it cost too much ", "rating": 3}, {"title": "First time I used it was ok but then…", "text": "First time I used it was ok but then realized that the exchange rate is lower then most other remit companies. I used it once realized my mistake and never used it again. Deleted the app off phone.", "rating": 3}, {"title": "It took a long time to deliver the…", "text": "It took a long time to deliver the money 4 days! I found another application only 20 minutes maximum 4 hours.", "rating": 3}, {"title": "The payment methods did not work at…", "text": "The payment methods did not work at first until I called and followed up with my case enquiry multiple times.", "rating": 3}, {"title": "The transfer took longer that before…", "text": "The transfer took longer that before and made complications for the receiver. Customer service was not the best. Hard to understand and the answers were not clearly ", "rating": 3}, {"title": "I could not send the money because…", "text": "I could not send the money because there was a problem with your setup. I was denied the option to send the money from my account, which would have cost me a few dollars, but the option to use my credit card was available,08 which is four times more costly.", "rating": 3}, {"title": "Your website is extremely slow", "text": "Your website is extremely slow. It's pissed me off many times. Many customers could leave and will leave because of your slow speed.", "rating": 3}, {"title": "Service is good", "text": "Service is good. But Even for bank transfer, there is a $1.99 fee,it was $.99 and changed within a few days.", "rating": 3}, {"title": "I feel like you guys shouldn't charge…", "text": "I feel like you guys shouldn't charge us to transfer money , I feel like you charge way too much for that. You say 0 fee when you first use it I think it should be like that period . ", "rating": 3}, {"title": "My grandson does not have a government…", "text": "My grandson does not have a government ID now I can’t send money to him western Union because am told he has to have government ID. I have always sent a private question. I use western Union app to have money wired. Now my grandson has to find someone to use their Venmo, cash app ect. What happen to getting points??", "rating": 3}, {"title": "My husband is overseas and I send him…", "text": "My husband is overseas and I send him money for family support. I had to call and let you know it wasn't fraud. I understand your concern but I don't just send money to anyone. He's my husband ", "rating": 3}, {"title": "Inconsistent with final sendingGenerally the process for sending is…", "text": "Generally the process for sending is straightforward, but I have made several recent attempts that gave me the reference #, but was then cancelled later - without me being notified.  It was several days before I was able to re-make the sending attempt.", "rating": 3}, {"title": "I don't like that you limit the amount…", "text": "I don't like that you limit the amount of times I can send money. I don't send that much money and I don't like that. It's I can't send any at this point", "rating": 3}, {"title": "Long wait", "text": "It took many days for the money to arrive and I got the money returned 3 times.", "rating": 3}, {"title": "Money was not deposited to Receiver’s…", "text": "Money was not deposited to Receiver’s account as per the promised date. Western Union team is saying that they are not responsible for it", "rating": 3}, {"title": "Good for money transfer to gulf countries", "text": "Good for gulf transfer.Dislike - no MFA authentication. Did not allow second bank transfer when doing it. Had to use a debit card that was not I wanted", "rating": 3}, {"title": "Delivery time is too long.", "text": "Date of experience: August 12, 2024", "rating": 3}, {"title": "The platform kept freezing", "text": "The platform kept freezing. I tried to get help from customer support and they didn't know what to do other than wait a day and try again. ", "rating": 3}, {"title": "While trying to start up it just goes", "text": "While trying to start up it just goesoff all the time", "rating": 3}, {"title": "Good and fast delivery ", "text": "Good and fast ", "rating": 3}, {"title": "Better exchange rate.", "text": "Better exchange rate.the other service have a better rate. I am thinking to change it because of thath Otherwise the website is very good.", "rating": 3}, {"title": "western union is not good choose ", "text": "exchange rate on the web side advertisement is higher before log in.  when long in the exchange rate come down , which looks like cheating . addition  western union exchange rate is much lower then market rate . plus western union charge transaction fee .  I will not recommend  to any one and will send money again via western union  ", "rating": 3}, {"title": "I cannot pull up my History no more", "text": "I cannot pull up my History no more. Which made it easer to send the money, because I send to inmate all the time.", "rating": 3}, {"title": "Missing Reward Points", "text": "The new system doesn't register the reward points every time I'm sending money and I had some accumulated from before the system was updated. What happened to my points and the current points??", "rating": 3}, {"title": "I think you guys are not giving us the…", "text": "I think you guys are not giving us the right exchange rate compared to what online after we pay to send money you are still reducing the exchange rate", "rating": 3}, {"title": "There shouldn't be any fees", "text": "Date of experience: June 19, 2024", "rating": 3}, {"title": "Sent a $300 to a friend in the USA in…", "text": "Sent a $300 to a friend in the USA in April which he never received. Your app still says in progress.", "rating": 3}, {"title": "I do like about low rate commision to…", "text": "I do like about low rate commision to send money what I dont like you are not close exchange rate with others mony transfer campony for example, like Ria monye transfer & ext", "rating": 3}, {"title": "Send money to a relative back in…", "text": "Send money to a relative back in Jamaica. I was informed it would be so much quicker if the money was sent straight to their bank account. On arrival, the receiver finds it very difficult and invasive just to get the money cleared. I did not expect such rigmarole just to collect a money gift. In the end, the money was returned without being collected. I will never send money again this way. Very disappointed ", "rating": 3}, {"title": "as not allowed to send  at the first…", "text": "I was not allowed to send  at the first  attempt.  I had to go to customer service before I was successful. ", "rating": 3}, {"title": "Ripoff again", "text": "Ripoff again ", "rating": 3}, {"title": "There are problems with sending…", "text": "There are problems with sending smoothly and swiftly.  New card addition is difficult to complete.", "rating": 3}, {"title": "Family ", "text": "Sporting family ", "rating": 3}, {"title": "To many questions.......which were not…", "text": "To many questions.......which were not there before. ", "rating": 3}, {"title": "My App not working", "text": "My App not working. I tried to send money but did not work.", "rating": 3}, {"title": "Why money was refunded ", "text": "I sent one urgent payment I made the payment via my bank account I kept on receiving messages to make the payment eventually instead of sending money abroad it was refunded back to me I don’t understand what was wrong with the system ", "rating": 3}, {"title": "my transfers are taking to long to get…", "text": "my transfers are taking to long to get to the account here in the Philippines, I can see same day to 3 days buy it's taking longer each time I do a transfer.I'm not liking 7 days, my transfer is supposed to be in today, and still processing???I use western union all the time I should have a better delivery system", "rating": 3}, {"title": "I’ve had to place a complaint as I’ve…", "text": "I’ve had to place a complaint as I’ve had personally a bad experience when receiving or sending money the advisor was very pleasant and helpful so I’m still holding hope that this service will be better moving forward ", "rating": 3}, {"title": "Exchange easy to do but exchange rate…", "text": "Exchange easy to do but exchange rate not good especially as we already pay bank charges this end.", "rating": 3}, {"title": "Custos altos", "text": "Taken into account the soaring number of generic applications/alike platforms, WU should consider lowering the transfer costs and be quick in reimplementing the customer loyalty program asap. I have been regularly making transfers and not been earning any points, which I hope will be compensated in the future. ", "rating": 3}, {"title": "Your exchange  rate an your charges are…", "text": "Your exchange  rate an your charges are not very competitive compared to other company's ", "rating": 3}, {"title": "Doing well good servic", "text": "Doing well good service", "rating": 3}, {"title": "Refund reasons", "text": "There is no proper message for the Refund reasons. ", "rating": 3}, {"title": "It is very often a problem with banks…", "text": "It is very often a problem with banks in Bosnia and Herzegovina, especially if the amounts are biger than 500 Euros. In 50% of cases, banks say that the system does not work, some only work for two hours/day in the morning or in the afternoon, if you don't come at that time they refuse you (there is no notification anywhere when they work). Last case Monday 05/08/2024 GradacacBosnia and Herzegovina, 5 banks rejected me, in the end I had to cancel WU (losing fee) and withdraw mony at the ATM (+5Euro and sepa cost of minimum 15Euro for 100 Euro....). The reason why banks refuse is the commission of 5 Euros they receive during ATM withdrawals until they can earn it with WU. Therefore, WU needs to decide which banks it will work with and which it will not. The problem make banks , not WU, and the banks sistem in Bosnia is one big mafia, and 4 time expencive then in Germany", "rating": 3}, {"title": "I don't like the fact that the rewards…", "text": "I don't like the fact that the rewards point program is down and has been down for months now. For months customers are unable to accumulate points. BRING THE REWARDS POINTS PROGRAM back!", "rating": 3}, {"title": "Sending fee is high", "text": "Sending fee is high. Difficult to redeem my reward points", "rating": 3}, {"title": "I do not understand", "text": "I do not understand, when and why some transfers from the US to Uruguay take 4 business days and some are instant. It is confusing and does not help planning.", "rating": 3}, {"title": "WU rewards 2024", "text": "Tell me what is happening with WU rewards.?????", "rating": 3}, {"title": "Always have trouble with sending money…", "text": "Always have trouble with sending money always declining my debit card ñ, and I have to use money gram instead ", "rating": 3}, {"title": "Wouldn't allow me to use my debit card…", "text": "Wouldn't allow me to use my debit card (which i've used before). This costs me more money. i hope it makes you more money...", "rating": 3}, {"title": "too slow web portal", "text": "Date of experience: August 01, 2024", "rating": 3}, {"title": "American living in Germany", "text": "I am an American living in Germany. Using Western Union to transfer dollars from my U.S. checking account as Euros to my German account was very cumbersome and difficult.  ", "rating": 3}, {"title": "All of a sudden after years of using…", "text": "All of a sudden after years of using this web page, My transfers are put on hold that is if I can even get it to load!", "rating": 3}, {"title": "I recently added a Capital One Debit…", "text": "I recently added a Capital One Debit Card to use for Transfer.  The first transfer I attempted, was put in review and cancelled. The Second Transfer attempt is now in review again. Could you please advise what the problem is. ", "rating": 3}, {"title": "1\"well\" presentation and services you…", "text": "1\"well\" presentation and services you offering. 2\"Improve\" Questionings and delays for security-related reasons. your customers once approved to inter your system should be sufficient.  3. WENT TO PICKUP $$ @ WALMART (CUSTOMER SERVICE) AND WAS SENT TO A LONG GROCERY LINE TO WAITED 35 MIN TO COLLECT MY MONEY:( THIS SHOULD OF BEEN DONE AT THE SERVICE DESK.", "rating": 3}, {"title": "How delete receiver names?", "text": "I have asked repeatedly how to delete from the WU list the names of receivers which I no longer use. ", "rating": 3}, {"title": "Average company", "text": "Average company", "rating": 3}, {"title": "Took too long to complete the transfer", "text": "Took too long to complete the transfer, very stressful ", "rating": 3}, {"title": "the staff at the Post Office in…", "text": "the staff at the Post Office in Lymington were not very helpful on Monday so had to go back on Tuesday to complete this transaction for a refund that was owed to me from the 28th May 2024  on Tuesday the Lady  could not have been more helpful ", "rating": 3}, {"title": "Its so hard doing transfer with…", "text": "Its so hard doing transfer with website.. Because some bug.. Like slow response when i typing. Can you provide aplication / app for android for INDONESIA country ?? ", "rating": 3}, {"title": "Disappointed In Unable to Earn Rewards Point - Exceedingly Long Pause", "text": "For a very long time now earning rewards points has been on \"pause\". Prior to the pause I used to enjoy more doing my transactions. With this long period of pause it is very disappointing.", "rating": 3}, {"title": "Some surnames have a hyphen and your…", "text": "Some surnames have a hyphen and your system doesnt recognize them in 2024. It's shocking... ", "rating": 3}, {"title": "During processing", "text": "During processing, a lot of page changes and flashes of pages. But went through 5th try.", "rating": 3}, {"title": "Site is difficult to navigate and user…", "text": "Site is difficult to navigate and user has to constantly choose new receiver instead of default receiver in account. Also, constant interface errors. Please do better.", "rating": 3}, {"title": "I have been However there are no…", "text": "I have been However there are no rewards i can use towards my transactions :(", "rating": 3}, {"title": "Complicate if internet is slow", "text": "Its necessary fast internet to complete transactions, and for crew on board is not so easy process with slow internet ", "rating": 3}, {"title": "Debit card fees are too much", "text": "Debit card fees are too much. Why did I stop getting reward points?", "rating": 3}, {"title": "Charges too high and the rates are too…", "text": "Charges too high and the rates are too low. Too expensive to use western union…", "rating": 3}, {"title": "WU Shop good... WU App not", "text": "Cannot send money to Venezuela through the WU App or WU Website ... but it works via the WU agent!   Please fix.", "rating": 3}, {"title": "The advisor was confused about my form…", "text": "The advisor was confused about my form of identity and had to be corrected by the branch manager again ", "rating": 3}, {"title": "website is not good,", "text": "Date of experience: July 22, 2024", "rating": 3}, {"title": "I wanted the receiver to receive…", "text": "I wanted the receiver to receive dollars not pesos.", "rating": 3}, {"title": "I have not got en MTC number", "text": "I have just sent money but I do not have MTC number", "rating": 3}, {"title": "the website is really slow and doesn't…", "text": "the website is really slow and doesn't provide information. normally it is amazingly great , 5 star. but have experienced problems for about a week.also mi lost all my credit forWU rewards and never got it back", "rating": 3}, {"title": "The 30-minute hold", "text": "The 30-minute hold. This seems to be something that recently started Can you please explain?", "rating": 3}, {"title": "i tried to send money to a bank and it…", "text": "i tried to send money to a bank and it took too long for the transaction also the bank said money was never sent but wu reported it was rejected it's unknown what happened but if this service is offered it should be more reliable ", "rating": 3}, {"title": "Good", "text": "Good I appreciate the way talk handled business", "rating": 3}, {"title": "I initiated/sent three transfers last…", "text": "I initiated/sent three transfers last Friday, July 12.  Western Union said they would all be delivered July 12.  They weren't.  I checked on July 13 and 14, and WU estimated delivery on July 15.  Today is July 15, and now WU says to expect delivery on July 19th.  This is poor service, and misleading expectations as to delivery.", "rating": 3}, {"title": "Interest rate is high", "text": "Interest rate is high. I feel like 10% is high. Maybe reduce the rate after certain amounts or frequency of use. ", "rating": 3}, {"title": "rates are less compared to other apps…", "text": "rates are less compared to other apps especially bank to bank transfers", "rating": 3}, {"title": "Its taking too long to deliver funds", "text": "Its taking too long to deliver funds. 4 working days is too many.", "rating": 3}, {"title": "Every time I go to sign in", "text": "Every time I go to sign in, I have to keep resetting my password.i  adding to this review to say, the last tim I used it on 07/17/2024 I had no problem and everything went smooth ", "rating": 3}, {"title": "The rates to send within your country…", "text": "The rates to send within your country of residence is too high and almost made me change the service I was using to send the money.", "rating": 3}, {"title": "Things to fix", "text": "Many things to fix. Some time we have errors that stop us from sending money and there is no explanation of them. I have called support even to ask and they find a problem somewhere else instead of where I had the issue. Are those 'software' issues? No idea, but can't always send properly and the app/web won't let me know what is happening. Therefore, I can't do anything about it.", "rating": 3}, {"title": "Somtimes inexcusably slow", "text": "The site is sometimes so slow that its basically unusable.  During these periods of extreme slowness, it's not uncommon for me to arrive at the confirmation page with an incorrect transfer amount, without any idea how the amount was changed.  I understand that everything needs to be checked and rechecked throughout the entire process, but this is ridiculous.  ", "rating": 3}, {"title": "Sort of Expensive", "text": "Sort of Expensive. The system would not accept my 15% discount code (WU15). It's not like $4 made all the difference, but I woulkd have taken the discount. Need to shop around for better transfer rates.", "rating": 3}, {"title": "Finally I was able to login again…", "text": "Finally I was able to login again .Usually there have been problems but now it seems to work. So its going better but there are still problems preventing a seamless login.", "rating": 3}, {"title": "When I used your automated outlet at…", "text": "When I used your automated outlet at CVS kept getting cut off via your overseas call center,, and my info was out there , the app is 89% better ", "rating": 3}, {"title": "1) WU Abuse ", "text": "1). WU is not listening to its users.  2). WU is also abusing the charges they assert.   If WU is charging us as customers PER TRANSACTION and the ALSO making money on reducing the rate of exchange on a different currency …that I call that abuse of position, specially when many customers don’t understand it.", "rating": 3}, {"title": "I tried to log in on the app service…", "text": "I tried to log in on the app service and they took to long to get me a verification code.  I finally went to the website", "rating": 3}, {"title": "I did not like that my points for…", "text": "I did not like that my points for previous wiring was not able to be applied and is still waiting for you  all to change to a new and updated system!!", "rating": 3}, {"title": "Progress ", "text": "online programs has improved but needs further improvements. the notification by email is a great feature to let the customers know when to expect the delivery and when the money was received.", "rating": 3}, {"title": "Taking more time than my expectations.", "text": "Taking more time than my expectations. ", "rating": 3}, {"title": "Good rates", "text": "Good rates, easy to use but my money takes alot to get transferred! From 7-9 days", "rating": 3}, {"title": "Interest to high", "text": "Date of experience: June 25, 2024", "rating": 3}, {"title": "The pro is that western union cash pick…", "text": "The pro is that western union cash pick up has a large variety of locations for the receiver. The con is high fees and not so great converting rates.", "rating": 3}, {"title": "I had a hard time sending money to my…", "text": "I had a hard time sending money to my caretaker the last timeIt was an emergency that time but it took her 2-3 days before claiming the money I sentSorry but I was so dedicated to WU beforeBecause of that I am now looking for another option to send moneyThank you", "rating": 3}, {"title": "It's good but to expensive to do it…", "text": "It's good but to expensive to do it online.", "rating": 3}, {"title": "Tough time getting my account set up", "text": "Difficult to communicate with customer service. When setting up my account, it took several days because when WU needed more information, they didn't contact me, I had to ask customer service. Then when the first transfer was rejected again I didn't receive notification, WU just assumed I knew. Difficult and frustrating process because I never knew what else was going to be needed. ", "rating": 3}, {"title": "Why before is very past to send money like 10 minutes but now need to wait for yhe next day", "text": "Why was it so easy reciev money before.Now it’s the next day?", "rating": 3}, {"title": "App is not responding well. I have to send with other agencies because your app was not responding ", "text": "Improve your app to be friendly also your fees are too high compared to others e g World Remit", "rating": 3}, {"title": "serious program error", "text": "Your program keeps chamging the receiver's name. I send \"Kelly Norman Giem\" and Your porgram changes it to \"Kelly Giem Norman\". He cannot pick up the money like that. You have a major bug in your program or you have been hacked. This happened yesterday and again today.", "rating": 3}, {"title": "Customer Service is not so good", "text": "Customer Service is not so good. I spoke to 3 representatives and even simple issue couldn't be resolved. I finally asked for the manager and he was able to fix the problem.", "rating": 3}, {"title": "The transfer rate is lower than what…", "text": "The transfer rate is lower than what showing in western union web siteMany time it happened The last transaction was on 6/18/24", "rating": 3}, {"title": "last confirmation unnecessary", "text": "excellent service but the last step you have of confirming a wire transfer is unnecessary for existing contacts. The UX for this step is also very poor; I often forget to hit submit at that step.", "rating": 3}, {"title": "The charges are increasing day by day…", "text": "The charges are increasing day by day first time i sent money with it tgan it was i think 2.99 and now within a month its 3.99 , you are offering the less rate as compared to the current rate of usd i am getting 82.70 something but current rate is around 83.50 , + no promotional codes etc from your side to deduct the less fee", "rating": 3}, {"title": "Delayed Transaction and Unclear Self-Verification Process", "text": "I initiated a transaction, and it took 7 days for the funds to be available in the receiver's account, which exceeded the promised date mentioned in the email. Additionally, the status of my transfer was shown as \"on hold\" with a link provided for self-verification. However, there were no such options in the app or on the website to complete the steps mentioned in that link.", "rating": 3}, {"title": "i appreciate the speed of the money…", "text": "i appreciate the speed of the money availablity.   however.  many times i am unable to complete more than 4 transactions per month.   i often receive messages that transaction cannot be completed.  even though i always send it to the same person.  ", "rating": 3}, {"title": "Didnt like the fact that i had sent…", "text": "Didnt like the fact that i had sent instant money but only for it to appear 5/6 hours later. Please improve on that. Otherwise you guys are great", "rating": 3}, {"title": "Consistent Monthly Transfers Questioned", "text": "I’m making monthly transfer for the same amount to the same person at around the same time of the month, yet you insist on denying the pickup until I call you guys and verify.  I understand the 1st time but month after month?", "rating": 3}, {"title": "Stoped working on me", "text": "Good service.Suddenly stopped working on me Called support and got no answers.Did plan to stop using WU but were forced to", "rating": 3}, {"title": "No fees", "text": "Don’t charge extra fees for transfers ", "rating": 3}, {"title": "Hard to use", "text": "Hard to use Make it more easier Clik start a new transfer it always show the previous transaction can't do new transfer to a new person ", "rating": 3}, {"title": "Your rates for dollars are quite low…", "text": "Your rates for dollars are quite low compared with other channels...kenya shillings to dollar is 128 but your still on 124.440", "rating": 3}, {"title": "I like the quick availability of  funds…", "text": "I like the quick availability of  funds to the receipient.What I dont like is the amount of conversion rate in the final transaction change to lower amount", "rating": 3}, {"title": "The Cons of WU", "text": "I'd mention the cons :- Methods of receiving limited to Cash Pick Up whilst it should have the Bank Account & Wallet methods available.- Can't transfer from USD to USD but it force you to transfer USD to the currency of the country of destination & currency transaction fee is high.- The transfer fees is higher than other service providers.I was searching if there's better money transaction service provider than MoneyGram & I thought WU would be better but it's not so I'm going to stay using MoneyGram. ", "rating": 3}, {"title": "Disliked your app privacy concerns", "text": "Disliked your app wanted full access to contacts and other phone info. Locked everything down and couldn't send $$ without giving permission.  Once finally figured out why I was doing loops and couldn't proceed to screen to process the payment was easy. Just a real hassle to get ti that point. Would likely only use when absolutely necessary vs consistent because of the privacy concerns. ", "rating": 3}, {"title": "Your transfer fee is too high compared…", "text": "Your transfer fee is too high compared with world remit", "rating": 3}, {"title": "Code and cost.", "text": "Sometimes the email with the verification code takes a while to arrive, I consider that the shipping cost is a little high", "rating": 3}, {"title": "Transfer successful but it was too long…", "text": "Transfer successful but it was too long to receive the money. The transfer should be instantaneous in real time like competitors. Waiting 30min to receive the funds is not a good customer experience. ", "rating": 3}, {"title": "sometimes itt is hard to log in my…", "text": "sometimes itt is hard to log in my account. the website seems not functionalother times it changes the country or the names before finishing writing the infothe service is fast and delivered smoothly.", "rating": 3}, {"title": "The service was good but the disparity…", "text": "The service was good but the disparity in the exchange rate was way too much", "rating": 3}, {"title": "Exchange rate is very low", "text": "Date of experience: July 01, 2024", "rating": 3}, {"title": "I thought WU was an easier way to send…", "text": "I thought WU was an easier way to send money overseas but unfortunately the fees are high and if you do a bank deposit it takes way too long", "rating": 3}, {"title": "good experience so far", "text": "Date of experience: June 28, 2024", "rating": 3}, {"title": "FEE IS low, but Transfer time needs improvement ", "text": "I like that the fee is not to expensive but I don't like that it takes 5 days for the transfer to get to Mexico.  Other places take less than an1 hour to transfer the funds to Mexico 🇲🇽 You need to improve that time frame, if you want more Mexican customers that live in the USA 🇺🇸 to make transfers faster then 5 days ", "rating": 3}, {"title": "It was okey but the disappointing part…", "text": "It was okey but the disappointing part was that the transfere information you share with your recipient don't have the total amount she is to receive. So in Togo when they asked her how much she was expecting she has to call me back because it was not stated in the info . I was so disappointed and did not like it. No money transfer company does that. Please please rectify...it was no no no!!", "rating": 3}, {"title": "Need higher rate for online transactions", "text": "Have been using the services of WU for quite a few years now, to send money back home to family. So far I'm satisfied, and have no major issues with their service. However, I'm not too happy with the rate calculated for the receiver when transaction is done online, vs in a store or third party. ", "rating": 3}, {"title": "Took long time", "text": "Date of experience: May 23, 2024", "rating": 3}, {"title": "To many verifications on transactions.", "text": "To many verifications on transactions.2 transactions and the 3rd time it was held for review/ verification. ", "rating": 3}, {"title": "Didn't allow me to change Bank of origin", "text": "Date of experience: July 02, 2024", "rating": 3}, {"title": "What ever happened to rewards??", "text": "What ever happened to rewards??", "rating": 3}, {"title": "it seems the system allows only certain bank accounts", "text": "Able to send money via online is good. What's not so good is that it seems the system allows only certain bank accounts.", "rating": 3}, {"title": "Money transfer bank to bank very slow", "text": "Money transfer bank to bank very slow.  Will not use this type of transfer again.  Debit card only.", "rating": 3}, {"title": "Cancelation Ease", "text": "Locating where to cancel transaction after incorrect amount was to be sent; ", "rating": 3}, {"title": "Customer service is very slow", "text": "Customer service is very slow. Even when everything is fine with all the data, the transaction continues for a long time. All problems are solved slowly with them.I have to verify my identity again and again, even though I've been using the same app and account for a long time.Very short selection of sending destinations, I can't enter my own transfer destination or message.", "rating": 3}, {"title": "Why are you reviewing my transfer since…", "text": "Why are you reviewing my transfer since when", "rating": 3}, {"title": "Time to make a change", "text": "The exchange rate is too low.Western Union has discontinued the loyalty rewards points.I have used Western Union for years but i think it is time to make a change.There are more choices now for money transfer services than ever before.", "rating": 3}, {"title": "I really like you sending money that…", "text": "I really like you sending money that you have a choice to send it with your checking account but the bad thing is that it takes too long to get to your bank card when you need it", "rating": 3}, {"title": "I didn't like answering this popup…", "text": "I didn't like answering this popup before even notifying recipient.", "rating": 3}, {"title": "Good way to send money ", "text": "Good way to send money , but some countries branches only pay in that destination coin, and limits the reception of the money. For example , to Bolivia you send 300$us they receive 1900Bs to conversion and there's is no dollars in Bolivia. And your ask me to review popup is annoying!!", "rating": 3}, {"title": "I've been sending money to an inmate…", "text": "I've been sending money to an inmate for well over a year and now the last two times my transfer has been put on hold.", "rating": 3}, {"title": "Exchange rate could be better…", "text": "Exchange rate could be better especially for long time users of WU", "rating": 3}, {"title": "I had to change browser", "text": "I had to change browser, because both credit cards were not accepted and there was a message the cards have a problemI also miss the benefit of the points as a regular user. there is no award for using WU often", "rating": 3}, {"title": "If it's not one thing it's another", "text": "If it's not one thing it's another. Now you have to review my transfers? I send money to one person on a regular basis and that's my brother.  For almost 7 years ... What's the issue to review ? There's been occasions he never received what I sent. ", "rating": 3}, {"title": "The price to send money keeps changing", "text": "The price to send money keeps changing. Keep it consistent. When I am in the US it is always 2.99 but now I am sending from my account but in Mex anicod it is more expensive. The only thing that has changed is where I am physically located at eh time of the transfer.", "rating": 3}, {"title": "why does it cost so much", "text": "why does it cost so much? Also why is on hold when it used to go immediately?", "rating": 3}, {"title": "Why charge me $8.95 when I am not in a…", "text": "Why charge me fee $8.95 when I am not in a rush to transfer the money??", "rating": 3}, {"title": "A lot has changed w WU since the…", "text": "A lot has changed w WU since the update, not the best experience…card won’t save, payment are said to be on hold for review lately, just doesn’t seem to be a seamless process ", "rating": 3}, {"title": "Problem storing and using new card info.", "text": "I had to reenter my new card information 5 times to get the system to accept and list it. It kept trying to use the old card.", "rating": 3}, {"title": "Your web site is too slow", "text": "Your web site is too slow. It's been like that for years.you are certainly aware of that.", "rating": 3}, {"title": "Rewards", "text": "No more rewards and it keeps on saying, it will accumulate and have a new Rewards, but it has been month and don't see that happening, before it was very nice. ", "rating": 3}, {"title": "Money not arriving on time", "text": "The money never arrived in the moment announced in the website, which is quite frustrating when it is urgent…", "rating": 3}, {"title": "I tried to redeem points", "text": "I tried to redeem points, but they did not reduce the amount/fee charged", "rating": 3}, {"title": "Transfer fee should be 0.99$", "text": "Transfer fee should be 0.99$2.99$ is too much expensive", "rating": 3}, {"title": "It always seems to hang up", "text": "It always seems to hang up, so you have to wait a while then start over,, Hard to tell where you are in the transaction,", "rating": 3}, {"title": "good", "text": "cheap, fast, effective, only problem is when i was trying to send me money in the philippines, Western Union refused ( for security reason i guess, i got no explaination at all even through a call ) and it screwed me a lot at that moment ", "rating": 3}, {"title": "The review process of the transfer…", "text": "The review process of the transfer takes too long, I’ve been trying to send money just as I always do and it has been held and then just canceled", "rating": 3}, {"title": "What happened to the points earnings", "text": "What happened to the points earnings system? Why are you not activating it even if can only be used later...will you reward back the points from the period you suddenly decided not to reward the points?...Without the point system, it is better to use other transfer apps because it makes western union even more expensive than it already is since WU has always terrible rates. ", "rating": 3}, {"title": "The bank always takes long to process…", "text": "The bank always takes long to process so the receiver complaints", "rating": 3}, {"title": "Site says 0 to 4days and you deposit on…", "text": "Site says 0 to 4days and you deposit on the 4th day. Status - It never reflects the right status. It always shows it is on hold", "rating": 3}, {"title": "the bank transfer rates could be better.", "text": "Date of experience: June 14, 2024", "rating": 3}, {"title": "Very bad UX experience", "text": "There's no issue with the money transfer process itself. However, I am somewhat dissatisfied with the user experience. For instance, when I initiated a transfer, it initially indicated that \"Your receiver will get it on xx/xx/xxxx,\" but a day later, the date was changed to yy/yy/yyyy. Additionally, I find their iOS app homepage confusing. It seems it wasn’t designed with users like me in mind, who may not have excellent IT knowledge.", "rating": 3}, {"title": "Website not user friendly...too…", "text": "Website not user friendly...too repetitive and doesn't store information", "rating": 3}, {"title": "Slow log in.", "text": "Date of experience: June 12, 2024", "rating": 3}, {"title": "I hope someday to transfer money to my…", "text": "I hope someday to transfer money to my family in Syria by Western Union by the normal price not by Syrian government prices", "rating": 3}, {"title": "It would be nice if the site maintained…", "text": "It would be nice if the site maintained the \"send to\" info like on the regular Western Union site.", "rating": 3}, {"title": "WU is good most of the time", "text": "I always will recommend Western Union, especially for my sister, who was travelling around the world and lost her bank card, it really helped her. Thee only thing is, I cannot send money to her in Villa de Leyva Colombia, the only bank that has western union in Villa de Leyva, told her she can only transfer within Colombia. That makes no sense. Is the whole point of WU not to transfer between countries? ", "rating": 3}, {"title": "Generally ok but their 'reward…", "text": "Generally ok but their 'reward programme ' has been stopped with messages of 'it's being upgraded ' todate nothing has happened so I'll look to alternatives that deliver discounts rather that a company that doesn't  !! ", "rating": 3}, {"title": "Exchange rate is low and fees charged…", "text": "Exchange rate is low and fees charged every time of transfer. Could not use my rewards point for transfer. ", "rating": 3}, {"title": "Speed of service", "text": "Speed of service ", "rating": 3}, {"title": "Difficulty changing payment card at the…", "text": "Difficulty changing payment card at the time of the transaction", "rating": 3}, {"title": "Couldn’t find an agent on time.", "text": "Date of experience: June 06, 2024", "rating": 3}, {"title": "No longer money transfer in minutes 😢 ", "text": "I seem to not be able to transfer money so straight forward this year. I have so far chased up a transaction at least 2 or 3 times. Alongside thus, provide ID or proof of income. This is such an inconvenience. ", "rating": 3}, {"title": "Western Union is a great service to…", "text": "Western Union is a great service to send money to overseas but unfortunately the points you earned every time you send has been stop to further notice which means the sending fee costs you more ", "rating": 3}, {"title": "No problem with the transfer this time…", "text": "No problem with the transfer this time but the increase in fees is not justified will use Remitly fee only £1.99 and easy", "rating": 3}, {"title": "Very good and quality services", "text": "Very good and quality services ", "rating": 3}, {"title": "Poor rate plus charges", "text": "Date of experience: June 01, 2024", "rating": 3}, {"title": "Really really bad customer service", "text": "Really really bad customer service ", "rating": 3}, {"title": "It was very convenient and less hassle.", "text": "Date of experience: June 10, 2024", "rating": 3}, {"title": "I am restricted in how much I send to…my dependants.", "text": "I am restricted in how much I send to my dependants each month. Legally I can send up to £4,000, but W.U. only permits £800. When I use other transfer companies I am unlimited. ", "rating": 3}, {"title": "Normally ok but they restrict the…", "text": "Normally ok but they restrict the amount of transactions you make in a week which can be extremely annoying causing me to use another provider.. I've been a loyal customer for many year's and I asked western union why they put a restriction and they couldn't give me a satisfactory answer. It's my money and I'll send it to who the hell I like as often as I like.. I'd score them a 5/10 for this reason. ", "rating": 3}, {"title": "Good if all goes well", "text": "Good if all goes well.  But when they want me to call back because apparently there was an issue to my beneficiary it took an hour for someone to answer my call.  And as I was using old system such as online transfer but on my laptop I could not scan or send the documents needed.  It was a struggle when something doesn't go to plan, easy when all things goes well.", "rating": 3}, {"title": "I like the security of the system", "text": "I like the security of the system, however I disliked the slowness of the time between sending and receiving. It used to take at maximum 1.5 - 2.5 hours. In recent sends it has been 6-12 hours.", "rating": 3}, {"title": "Good sevice and i am happy", "text": "Date of experience: June 10, 2024", "rating": 3}, {"title": "Starting a new transaction", "text": "I dislike the fact , there is no completely new space for new transaction ,Even though it days new transaction you are returned to the old one .You then have to delete the previous numbers ", "rating": 3}, {"title": "Exchange rates far to low", "text": "Exchange rates far to low ", "rating": 3}, {"title": "Unfortunately there was a delay in a…", "text": "Unfortunately there was a delay in a refund from western union, then blaming it on my bank and my bank blaming it on WU, I think you should make the refund procedure more sick and not keep blaming it on the bank when you didn't send the reversal form in the first place so a process that should take 2 weeks actually took over 2 weeks despite me doing all the leg work to retrieve the money", "rating": 3}, {"title": "Rates are not good", "text": "Rates are not good ", "rating": 3}, {"title": "Transfer Fees have Gone too High. Am not happy. ", "text": "The Amount paid to Send has Gone Too High. Am not Happy about it", "rating": 3}, {"title": "The exchange rate is wasn’t good enough", "text": "The exchange rate is wasn’t good enough ", "rating": 3}, {"title": "Every time i send money", "text": "Every time i send money. You guys keep on asking to fill up our information which is you already have records on it. Keep on repeating repeating.", "rating": 3}, {"title": "Quite a fee for a 500 dollar transfer", "text": "Quite a fee for a 500 dollar transfer. 6.99", "rating": 3}, {"title": "Changing prices to send money.", "text": "Date of experience: June 08, 2024", "rating": 3}, {"title": "your online app for Mobile is horrible", "text": "your online app for Mobile is horrible. I always need to shift to desktop application to do anything. ", "rating": 3}, {"title": "the website is very slow also  no more…", "text": "the website is very slow also  no more reward points ", "rating": 3}, {"title": "C'était normal.", "text": "C'était normal. ", "rating": 3}, {"title": "it s my best ", "text": "he was great very month when i sent the money for my family's ", "rating": 3}, {"title": "I am only aloud to send few…", "text": "I am only aloud to send few transactions then won’t let me send any more even though my account is verified ", "rating": 3}, {"title": "Scam interviews ", "text": "Every time I transfer money to pay for work a research collaborator does for me, I have to undergo an interview. I understand and think it is good to protect people from being scammed, but this is a tiresome process, especially when you just want to transfer money to the same people with whom you have long-term collaboration. ", "rating": 3}, {"title": "My hundred pound that I still haven’t…", "text": "My hundred pound that I still haven’t got back and been trying to get back for the 2years", "rating": 3}, {"title": "I've been pretty unhappy with Wester…", "text": "I've been pretty unhappy with Wester Union for a few months now. After every bank transfer, I have to provide proof that the money transferred was actually deducted from my account and not transferred back to my bank account. This means that I have to send a bank statement (for a period of 14 days starting with the date of the \"failed\" transfer!!!) after every transfer, I receive unnecessary phone calls from Western Union and my Western Union account is blocked during this time. All in all, very annoying and inconvenient.In addition, the transfer fees have risen dramatically and you can no longer profit from the reward program since they are working on renewing it (which they been working on since months but nothing ever happend). At least the money arrives extremely quickly and usually there are no problems when the recipient collects it, which is very pleasing.", "rating": 3}, {"title": "Jag har int fåt MTCN NUmber hur ska min famil hämta pengar ", "text": "I have made a transaction but I got no MTCN number How is my relative going to get the money.I only got to this page to Rate the transaction but did not get the Wu number I am not happy at all my relative is waiting for money. ", "rating": 3}, {"title": "To Long it takes", "text": "my transactions have been taking forever to deliver into recipient's back accounts, other providers send funds more quickly, not satisfied, poor show, ", "rating": 3}, {"title": "My transfer seems to be taking longer…", "text": "My transfer seems to be taking longer these days to go through after I updated my profile with you. I had to resend ", "rating": 3}, {"title": "Western union", "text": "Simple d'utilisation", "rating": 3}, {"title": "Western union used to give points for…", "text": "Western union used to give points for every transaction but now I don't get a single point no matter how many transactions I make. They charge me the full sending fee which I used to get help with through the points they used to give me..I don't know why they've stopped giving me points for each transaction i make..", "rating": 3}, {"title": "It's ok so far", "text": "It's ok so far. Keep up ", "rating": 3}, {"title": "It took almost two days to deliver the…", "text": "It took almost two days to deliver the money.", "rating": 3}, {"title": "Money Collection ", "text": "I sent money for a service and did everything right but when the reciever got to collect, he was told the tracking number didn't exist, and because of that he came banging on the apartment door and disturbed my sleep. After fiddling about on my phone to sort out, I phoned Western Union, and informed everything was OK, and told me to tell the reciever to return and call an agent for help which should have been done originally, and everything was rectified.", "rating": 3}, {"title": "You said customers are allowed to send…", "text": "You said customers are allowed to send up to 5000 pounds and I send 1750 pound and you guys ask me to send bank statement which I did and you did not release the money so I have to cancel my point. Why would you say, you can send up to 5000 and I did not even send up to off off of that amount, but you guys did not release it that does not make sense ", "rating": 3}, {"title": "The problem is with receiving the…", "text": "The problem is with receiving the money, the sending process is easy and straightforward either via the website or app - the problem I have had is that despite the numerous places that have Western Union signs outside the majority do not actually still act as agents so you cannot obtain your money, this is time consuming and frustrating - and impacts an otherwise great service ", "rating": 3}, {"title": "I am unable to complete the transaction…", "text": "I am unable to complete the transaction after entering the card security code. It says error please try again!", "rating": 3}, {"title": "Keep it simple to use for elderly…", "text": "Keep it simple to use for elderly people not educated in the computer generation ", "rating": 3}, {"title": "Tried to change to my new address", "text": "Tried to change to my new address, but unable to do so. Annoying.", "rating": 3}, {"title": "Not good ", "text": "They said I had gone over the allowed limit for 30 days not good when trying to help family ", "rating": 3}, {"title": "First of all are the fee's", "text": "First of all are the fee's, they' are to big , when you make the conversions ", "rating": 3}, {"title": "Low exchange rates", "text": "Date of experience: June 03, 2024", "rating": 3}, {"title": "Not the best", "text": "Western Union is sometimes is the only option.The annoying thing is dynamic exchange rate, where by the time you get through form filling  exchange rate could go down (or up), other services the exchange rate is fixed for 20 minutes ", "rating": 3}, {"title": "I would like to make sometimes 2…", "text": "I would like to make sometimes 2 transfers in a week but cannot", "rating": 3}, {"title": "The rate is less little bit. Last month.", "text": "The rate is less little bit.Money reached quickly deposited.Only rates problems.Thanks.", "rating": 3}, {"title": "Lovely doing well and safe", "text": "Date of experience: June 04, 2024", "rating": 3}, {"title": "My last transaction has not gone thru…", "text": "My last transaction has not gone thru up to now.", "rating": 3}, {"title": "Was hard to get connected I had to try…", "text": "Was hard to get connected I had to try several time to get your server to respond ", "rating": 3}, {"title": "You have no promos", "text": "You have no promos, no rewards or do not offer any type of incentive to your customers to keep using your platform to send money.", "rating": 3}, {"title": "Easy but poor rates", "text": "Like it’s quick and easyDislike the terrible exchange rate plus charges on top ", "rating": 3}, {"title": "The service is great but the website is…", "text": "The service is great but the website is horrible.  ", "rating": 3}, {"title": "I can’t send more than 1000 dollars", "text": "I can’t send more than 1000 dollars ", "rating": 3}, {"title": "Why debt collection!?!?!?!", "text": "Often I am asked to confirm my identity which drastically delays my transfer. Despite my immediate bank deduction using the App, your debt collection contacted me because there was a delay in them receiving the funds in the background for which I could assist but affects how frequently I will ever use it again.", "rating": 3}, {"title": "Web page gets stuck randomly at…", "text": "Web page gets stuck randomly at different stages. Took 3x more time to complete remittance.", "rating": 3}, {"title": "I keep on trying to use my WU points with no success", "text": "I keep on trying to use my WU points for a discount and they never seem to apply. Today, they stated that my 50 points would take off $5.00 and it still did not.  I go through the same process each time with no satisfaction.", "rating": 3}, {"title": "Website could improve", "text": "Money transfer is efficient, but the website fails sometimes.I can´t disable the automatic login, because the \"Save changes\" button doesn´t work. ", "rating": 3}, {"title": "I always have complicated issues with the payment section", "text": "I always have complicate", "rating": 3}, {"title": "The cost of money transfers is simply…", "text": "The cost of money transfers is simply too high!", "rating": 3}]