[{"title": "claim forms", "text": "phone rep was very helpful assisting me with refiling information about my claim....my dissatisfaction was with the information required....I filled out a lengthy form which showed that I went to a clinic & saw a doctor & filled three prescriptions & mailed receipts ....very simple....this was why l purchased insurance...the minutia doesn't change that", "rating": 3}, {"title": "I feel 7-Corners is a kind company and…", "text": "I feel 7-Corners is a kind company and the assistance from Candy was kind and thoughtful as well as apologetic due to my claim not being with this company and she kindly past me to FALCK, whom I dealt with while on tour and they are AWFUL!!!!!!!!!!!! Seven Corners isn't handling my claim and Candy was delightful, I hope I NEVER EVER HAVE TO DO THIS AGAIN!!!!!!!!!!!!!!!!!!!!!!", "rating": 3}, {"title": "Nothing went wrong but I felt prepared", "text": "Nothing went wrong but I felt prepared. The customer service prior to travel was great, but the one time I called while traveling, I wish the agent had known more. They were not able to confidently answer my question and seemed to just read information directly from my policy before telling me how I could enter a claim online. Not too helpful, but luckily a claim wasn't necessary.", "rating": 3}, {"title": "I was in a car accident while traveling…", "text": "I was in a car accident while traveling overseas and contacted seven corners. The first contact was good and claim forms were sent. But I’ve emailed since then trying to get some clarification and not getting any response. Two of my girlfriends have Allianz and they have been extremely responsive. Right now I’m thinking I chose the wrong insurance??!!", "rating": 3}, {"title": "5 month wait for resolution of claim", "text": "I filed a claim on August 1st and the claim wasn’t paid until the end of December.  Multiple promised deadlines  for resolution set by them were broken and I had to make multiple phone calls in order to get my claim resolved.  I’m not confident it would have ever been paid if I hadn’t been persistent.  On the positive side, they responded to all emails in a timely manner and were always pleasant on the phone.", "rating": 3}, {"title": "Took a while but ultimately paid", "text": "Updated Jan 2023: After some back and forth and submitting more paperwork, I did finally receive reimbursement for some covid related travel extension costs making the original premium worthwhile.original review: Consider another policyI bought the Roundtrip Choice policy for our family last Christmas, just in case there were any covid related travel issues. Out of 5 people, I got covid and had to change flights to come back days later. Much of my costs incurred should have been covered, but it has been a year of \"we are reviewing your paperwork\" and I still have nothing reimbursed. At this point, I would be happy with my policy premium back if nothing else.", "rating": 3}, {"title": "Took forever to review claim, then denied it", "text": "It took nearly 5 months for them to make a decision on my claim.  My husband got sick in Peru and as a result, we could not continue to travel with our tour group.  We had to spend an extra hotel night and then hire a private driver to take us to catch up with group.  Total cost was $600.  They denied our claim, although the coverage document describes this scenario and says it is covered.  I have appealed and awaiting a response.UPDATE: after a 30 day appeal review, they did approve my claim and I had the full amount deposited into my checking account in about a week.", "rating": 3}, {"title": "Delay, more paper work to be done. Wow!", "text": "I filled up all the forms and uploaded thru Seven Corners website. Then I received an email with more forms to be filled up as well as more documentation to be sent.Besides, the timing to be reimbursed is too long. I have paid all the expenses with my credit card during my trip in April/May 2023 , the billing has being paid and no money from the insurance received yet.Now I have to send them my travel ticket that I trew away. More work to be done .I am going to travel abroad again for 30 days next November. I am really thing about those issues.regardsMaria Henderson", "rating": 3}, {"title": "Insurance always finds excuses not to pay.", "text": "I was very disappointed that I did not receive a complete refund of my minimal expense. It is very frustrating to pay so much for insurance. Then, when you actually need help and submit a claim, the company finds every excuse not to fulfill their obligation.Cert#1994655DF244", "rating": 3}, {"title": "No experience", "text": "We have no idea about the performance of Seven Corners. We just bought the insurance through their website for a single trip. There were no incidents during our trip, so there was no further contact needed.", "rating": 3}, {"title": "Good phone service but slow  claim payment", "text": "Knowledgeable and friendly customer service response to my questions on their phone line. Unfortunately, claims payment is slow and delayed. I've received multiple emails saying they are busy and overwhelmed with claims but no information on when I can expect payment. I recently had my auto totaled in a hit and run and the claim was paid in days by another insurance company. I made a small, clear medical claim with Seven Corners and they offer no information on when I can expect reimbursement. I've had better experience with other travel insurance companies.", "rating": 3}, {"title": "Adjustments needed to policy", "text": "I needed to make adjustments to my policy after the initial purchase.I made numerous attempts to contact my agent through emails and voicemails until I finally again made contact, then the issue was quickly resolved, l but I was disappointed in how many times my attempts to contact were ignored", "rating": 3}, {"title": "I contacted you but  It is not helpful…", "text": "I contacted you but  It is not helpful for emergency service. When I went to ER,  I paid medical expense fully. The insurance didn’t help.", "rating": 3}, {"title": "If you get sick overseas and I did", "text": "If you get sick overseas and I did, it’s likely an emergency. You will go to the nearest place that WILL TAKE YOU and it doesn’t take this insurance. They will look at the card and say whatever. That means you have to pay for everything upfront and then spend a lot of time and effort to go chase Seven Corners for each claim. It’s not fun. It feels like a waste of time because medical care overseas is much cheaper.", "rating": 3}, {"title": "Signing up was easy", "text": "Signing up was easy. Can't say much about anything else as I have not had a reason to file a claim yet and experience that process and turnaround time.", "rating": 3}, {"title": "It took entirely too long for the claim…", "text": "It took entirely too long for the claim to be processed (49 days); however we were compensated to our satisfaction in the end.", "rating": 3}, {"title": "3 Stars given only because we didn’t…", "text": "3 Stars given only because we didn’t need to use any of the travel insurance that we purchased so really can’t give a review", "rating": 3}, {"title": "cannot really say how my experience…", "text": "cannot really say how my experience would have been as I never (thank goodness) needed to file a claimwhile traveling. thank you tho.", "rating": 3}, {"title": "filed a claim a month ago taking too…", "text": "filed a claim a month ago taking too long to respve issue and be reimbursed. satisfied all requirements", "rating": 3}, {"title": "5-star until you have a claim ...", "text": "Still waiting for a payment 4+ months after filing claim. They're not even sending regular updates any more.  I suppose they can use the excuse that they needed my cc statements and not just paid invoices, but they didn't ASK for them until 2+ months into it, which leads me to recommend that some first-tier person check claims upon receipt to see if something is missing, or in this case -- PUT ON THE CLAIM FORM to include CC statements.  (Perhaps it's something used to justify stretching out the claim response.)  It's a large amount ($20K), and I know they've got staffing issues.    I just hope this isn't being dragged out because they're strapped for cash.  And if that's the case -- that their liabilities are covered in case of a bankruptcy.  Maybe this is standard for travel insurance companies, but if this goes on much longer, I'm going to write Forbes, which is where I heard about them in the first place.  (And this is NOT the only trip I've insured with them.)UPDATE:   It has been almost 5 months since I filed my claim and sent them multiples pages of hospital discharge notes for the heart attack that caused me to cancel my trip as well as paid invoices -- every documentation that they asked for on the claim form.  It has been about 2 mos. since they got around to asking me for credit card statements, which I promptly provided.   I wouldn't have bothered to update this except Trustpilot sent me an email, which led to me reading other reviews on the company on their site.   Interestingly enough -- everyone seems to love them ... EXCEPT for the people who file a claim.    Lots of positive reviews about how easy it is to buy a policy ... and no good reviews on claim experience.", "rating": 3}, {"title": "Still waiting for the claim", "text": "Still waiting for the claim , no follow up call or email or text yet .It only been less than a month so I guess timing is still acceptable", "rating": 3}, {"title": "Typical Insurance Company...maximize profits over customer satisfaction", "text": "I insured my trip to Israel with Seven Corners back in June of 2023.  I took the \"For any reason\" option for cancellation due to the unstable enviornment which exist in Israel.  Our trip was canceled in December, so I began trying to recover the fees not refunded by my travel company at that time.  Seven Corners has now denied my claim due to the fact that my cancellation letter from my travel company was not dated, even though they received the letter several days prior to the date the trip was planned to leave.  This seems an obvious attempt to keep as much of my fees as possible, and no reasonable person could in good conscious determine that the travel company letter which they received prior to the required 2 days before the trip could not have been written at least 2 days prior to the planned date of leaving.  I find this a shame, as I like the seven corners web site and tracking process, but unfortunately their desire to maximize profits trump their willingness to use common sense to help customers properly handle their claims.  My wife and I go on trips multiple times a year but I will be shopping for another travel insurnace company in the future.Follow up to my post above, I was able to get my travel company to give me a dated cancelation letter which verified my previous claim of cancelation well prior to the contract required date, so Seven Corners reviewed my appeal and finally agreed to pay my claim. I'm still unhappy with their desire to find a loophole to keep from paying my claim, but happy they finally agreed to pay.", "rating": 3}, {"title": "I feel the money belongs to the…", "text": "I feel the money belongs to the customers and should be able to request for a refund if they are no longer able to attend the trip without hesitation or need of approval.", "rating": 3}, {"title": "other companies gave money back for…", "text": "other companies gave money back for ports that were not visited.   you did not.  other tan that, I didn't use your product.  it was just there", "rating": 3}, {"title": "2022 Seven Corners Experience", "text": "I’ve purchased and used multiple travel insurances and I wouldn’t recommend seven corners. I chose them recently because of the reviews and decided to purchase their more expensive coverage. Thankfully I didn’t need to use them during the trip, but when I contacted them after for damaged luggage, they were so slow to respond and it took months to even get a response that wasn’t even the completion of the claim. Their excuse is covid but if you’re going to charge people for a service and can’t handle the influx of claims, you shouldn’t be handling travel insurance. They’re not a scam and have been fine when they responded, but I never used them to completion when I needed them and gratefully I didn’t have to use them while on my trip because they would’ve been so frustrating and unhelpful.Update: I just wanted to add to my review after the seven corners’ response because saying you’re going to follow up, doesn’t negate my underlying feedback and review. I said the response time and overall coverage was inadequate, which I still believe it is. Saying you’re going to follow up to publicly appease viewers is poor form and to be clear, a customer advocate did not follow up and since seven corners seems to respond faster to reviews than it’s actual customers, I won’t be moving forward with my claim. I actually opted to go through my credit card, which resolved this faster.", "rating": 3}, {"title": "easy", "text": "the purchase went fine.  didn't need to use it so no way to judge the ease of reimbursement, etc.", "rating": 3}, {"title": "Hard to sign up or make sure uou have…", "text": "Hard to sign up or make sure uou have the right product without talking to someone there. Website ok.  Not great.", "rating": 3}, {"title": "Too long to process a claim!", "text": "While the prices for insurance are competitive with other companies, the wait time to get resolution of a claim is totally unacceptable!  Six weeks!….", "rating": 3}, {"title": "I filed a claim in July and still have…", "text": "I filed a claim in July and still have not been paid.  My son and daughter received theirs but not me.  It has been 6 months", "rating": 3}, {"title": "Policy date extended was denied", "text": "I try to do policy date extend by online, but I was notifying “We are unable to extend your coverage online.’this response was not explained the reasons.So, I was very anxiety and inconveniences.Also, I sent email several times, but your response was not timely.", "rating": 3}, {"title": "Communication concerns", "text": "Fortunately I did not have any reason for filing a claim. The reason I gave a 3 star is due to the difficulty I had with communication especially with calls and desiring to talk with a representative. Return calls were untimely.  I did receive email notices prior to my trip providing phone numbers and coverage summaries which were appreciated.", "rating": 3}, {"title": "The one time I needed to call Seven…", "text": "The one time I needed to call Seven Corners - to get a referral for a doctor while traveling - I got put on hold and never spoke to anyone. I ended up solving the problem on my own, but the lack of responsiveness with this phone call is a service issue for me.", "rating": 3}, {"title": "Not explained well.", "text": "Explanation was never complete.Never comfortable we actually knew what was covered.I suspect a response will include something about full explanation and receiving all documents.We were expecting answers to specific questions that the sales agent could not provide.We went on our trip hopeful, but not thoroughly informed.", "rating": 3}, {"title": "A little disappointing", "text": "It was difficult to reach the claims department. When I did, the representative was pleasant and helpful, but it had been 1 month since my claim was submitted, and I was told they are so busy it might take up to 3 months to hear anything. While it is good for them that they are busy, I think I will look elsewhere next time. Maybe they need more employees?", "rating": 3}, {"title": "“Stay Away!!!!” I had a heart attack in…", "text": "“Stay Away!!!!” I had a heart attack in Egypt two days before my policy lapsed. I was so thankful that I had travel insurance to help with medical expenses as well as hotel and flight interruption.  I had a policy, it’s been six months now I have been calling providing all documentation required and still they ask for the same documents at least five times over.  I call my supposed dedicated claim advisor with no answer nor reply. I don’t even think “Maxwell Stutesman” is a real person. I am going to file a claim with the Oklahoma insurance board, as far as I can tell up until this point, it seems as if they are just a telephone bank. I highly recommend you find someone else to insure your travel needs!!!UpdateAfter placing this review, I finally got a phone call instead of a email that was asking for the same thing over and over again my issue was soon there after resolved. It took nine months, but they finally paid out the claim.", "rating": 3}, {"title": "Well I filed and nothing has happened…", "text": "Well I filed and nothing has happened yet… I keep on getting emails that are back logged in because of Covid and everything else at this point I don’t know what to think I’ve submitted the documents and all I’m getting is please be patient please be patient so my review was noncommittal I don’t know what to send", "rating": 3}, {"title": "My first problem is with the very slow…", "text": "My first problem is with the very slow turnaround by you on my claim.  My second problem is that the claim process, using Docu-sign and uploading documents to your portal requires technology infrastructure and know-how that is difficult for some people, and then trying to get personal help is difficult and slow.  My claim is fairly simple and straight forward and should not be so difficult to file!", "rating": 3}, {"title": "Overall price versus coverage was okay", "text": "Overall price versus coverage was okay. But when I had to cancel the trip due to COVID, I was expecting a refund not a credit towards future use. I don't think that was what should have been done. I told the company that but they said they don't issue refunds...just credits for a future trip.", "rating": 3}, {"title": "Site does not work on iphone", "text": "Difficult to navigate website and get quote when using iPhone, had to call another person who could access the site from their laptop in order to do it. I will look for alternative insurances if unable to book easily via mobile next time. The chatbot was useless for helping resolve the issue.", "rating": 3}, {"title": "Claim Process Shortcoming", "text": "I filed a claim on the following and have received a partial refund and then an email saying I was denied.  There are not details of what was accepted and what was declined.  Very confusing process and it took over 3 months to address from time of filing.1RTB21-AOS-110320", "rating": 3}, {"title": "I fortunately havent yet needed to use…", "text": "I fortunately havent yet needed to use my insurance, but my experience with renewing it was consistently a bit challenging. The site wouldnt let me renew my own and i needed to reach out to an adjuster. The person assigned to me was slow to respond, like beyond the expiry which felt stressful. I also never got a response to a question i asked 3 times. Overall its not a huge deal, but it makes me wonder how challenging it may have been to make a claim!", "rating": 3}, {"title": "Great except claim times", "text": "Everything has been great about the company except for one thing: I've been waiting 6 weeks now to hear about my claim. It's taking far too long to process my claim. It makes me worried it won't be processed.", "rating": 3}, {"title": "Waiting on Claim", "text": "I've always been Very Satisfied and have used them for years.  However Right Now I'm awaiting a claim filed on 3/4/22 and have been told it will take 84 days to be processed.  Since I have a terminal disease, first symptoms started showing in 08/21, the other outstanding policy I currently have, a claim also be filed as there is no way I can take the trip. Heaven knows when I'll see action on both policies.  These policies were purchased literally Years ago, before covid 2020.", "rating": 3}, {"title": "Never had to use it so can't comment", "text": "Date of experience: March 07, 2023", "rating": 3}, {"title": "Customer Service", "text": "The initial purchase and product gets 5 stars. The renewal/ extension gets only 2 stars. I called prior to the end of the contract to extend the insurance. Due to an IT issue the extension was not possible.  After more than 48 hours and multiple phone calls to customer care department, the insurance contract was extended. Unfortunately, this delay created a gap in coverage and caused significant anxiety.  There needs to be a better process to overcome IT issues.", "rating": 3}, {"title": "Useless Insurance", "text": "Purchased insurance prior to COVID for our dream trip to Europe. When The pandemic erupted, our flights were canceled, but the insurance was useless. We lost a lot of money. Additionally, the money paid for the insurance was lost because they only allow you to extend it for one year. I’m sure seven corners made a lot of money due to the pandemic. Frustrating policy and when I called customer support, they were not compassionate.", "rating": 3}, {"title": "All went well", "text": "I appreciated having trip insurance. Given the current status of Covid worldwide, it was important to me to have insurance. My 3 star rating is because I didn't need the insurance - everything went smoothly on my short vacation. Therefore, I don't know how great the insurance is/was. I will definitely use your insurance again in the future.", "rating": 3}, {"title": "I just submitted my claim and feel it’s too soon to give an accurate review.  However, I’ve been informed of timing.", "text": "I just submitted my claim an", "rating": 3}, {"title": "Very, very slow - do not count on getting your money back in a timely manner, it at all.", "text": "We have been purchasing travel insurance for years, but have never had to use it until this year. We saw that Forbes recommended Seven Corners and chose their \"cancel for any reason\" plan this year.  Due to a family medical issue, we had to cancel our trip.  We have been working on this for two months now, and keep getting emails telling us that they are running behind....then, they couldn't see the dates on my fax....etc., etc.  I honestly don't know that we will ever see this money, and it is so disappointing.  I do understand that places are behind due to coronavirus, but they give you the impression that you are getting the runaround, and they don't even address you by name.", "rating": 3}, {"title": "It’s very easy to buy this “insurance”.", "text": "It’s very easy to buy this “insurance”. However, it’s extremely difficult to find a doctor or urgent care who will even recognize it as insurance or understand what it covers.  Therefore, If someone wants to become an expert on submitting a claim themselves, this is the product for them!  I think I’ll look around for a more recognized product next time.", "rating": 3}, {"title": "The responder did a good job of not…", "text": "The responder did a good job of not committing the co to anything.  So I was unable to get any indication on a situation would qualify for expense reimbursement if one or both us should get Covid-19 and have to quarantine in a foreign country. I sure you have dealt with the issue in the recent past.", "rating": 3}, {"title": "Seven corners has been very good at…", "text": "Seven corners has been very good at providing us with medical insurance but it has been over six months that we submitted a medical claim and still no response as to why it had taken so long. I’ve contacted your representatives several times and they have been of no help. Please follow up on this review. We have just submitted an additional claim and waiting for a reply. Thank you,Joe R PenaMaria Del Rosario Paz 210-7932138", "rating": 3}, {"title": "Three stars is average from me", "text": "Three stars is average from me.  I never had to use the service but I did get it before the country lifted the band on heath insurance.  I did travel without an incident but it is nice to know you have it if you need it.  They wouldn’t allow me to renew through the website I had to start the whole process over even thought there was no claims made against the policy.", "rating": 3}, {"title": "Poor Android phone app installation", "text": "Poor Android phone app installation, which hinder the potential effectiveness of communication between clients and the company. Glad that I don't need to file claims this time. What if I did and need to call the company all the time?", "rating": 3}, {"title": "I got this travel insurance for get my…", "text": "I got this travel insurance for get my Visa,and supposed to cover my medicine and costs but it didn't work.i sent email and they ask me to send forms and all recipes,so I did .I paid for clinic and pharmacy out of my pocket not  insurance covered me. So after all ,my trip done and back to USA , coverage expired and my money didn't return to me.", "rating": 3}, {"title": "Commentary", "text": "So many coverages and not clear as to what some terms meant. Submitted small claim and I am told 100 days to resolve. This feels like a scam to have my money to float in your account. 30 days max and a claim should be processed.", "rating": 3}, {"title": "From good to mediocre", "text": "My experience began well, but then my agent retired and suddenly they were very difficult to contact. I felt like every message was automated and my voicemails, messages and attachments were not even locked at or listened to. In the end, it all worked out, but it was a frustrating experience.", "rating": 3}, {"title": "Good except for 1 thing.", "text": "Everything was fine. They were one of the few companies I could use to travel to my destination overseas, in my particular situation.The issue I had with them is I was renewing my plan month to month, and when I happened to turn 40 during my trip, the price almost doubled. Customer service didn't give me any warning about this. I would have thought that the same price would apply from the beginning of my policy.", "rating": 3}, {"title": "Hard to review if you don’t need to use", "text": "I have a 3 star review because frankly I was fortunate enough not to need to use insurance while I was traveling. Thus, I really wasn’t sure if it was easy to use or not. Then someone asked me if it had covid-19 coverage or not (for example, would it cover a hotel if you needed to quarantine for two weeks) and I wasn’t sure.", "rating": 3}, {"title": "When I first signed up for travel…COVID omitted", "text": "When I first signed up for travel insurance online I mentioned I was going to Costa Rica but your system did not include the extra COVID coverage required by the Costa Rican govt. fortunately I read through policy before leaving and called customer service. They corrected the oversight and everything worked out. Please tighten up your online process.", "rating": 3}, {"title": "Apparently way understaffed", "text": "Good coverage but it shouldn't take months to settle a legitimate claim (death of a spouse). And being told that it would be three weeks between email updates is a little upsetting.", "rating": 3}, {"title": "No experience to provide a review", "text": "I did not experience any medical issues during the period of my insurance coverage so I did not have to use the insurance. Therefore, I do not have any experience to offer a meaningful review. I will set my review to average for this reason.", "rating": 3}, {"title": "Waiting on claim to be processed", "text": "I am rating as 3 stars because both my wife and I have claims against our medical travel policies and was told it might take 45 days to process. Hopefully processing and reimbursement will occur faster as i have always recommended 7 Corners to our 100's of travelers we sent to Israel each year.Pete Craig Taylor & Cynthia Hamilton TaylorProject Manager ICEJ-USA", "rating": 3}, {"title": "Took ages to pay me back for a simple…", "text": "Took ages to pay me back for a simple broken arm, still haven't paid back the smaller payments for getting the cast, Xray etc which add up over time. No reassurance that ill ever get these back. Not great if you're strapped for cash and need to book flights etc. If they were a bit faster to respond or even call to reassure everything is processing would be better, especially when you are feeling vulnerable.", "rating": 3}, {"title": "The process of buying the coverage was…", "text": "The process of buying the coverage was pretty straight forward.  Unfortunately, we needed to file a claim due to my wife getting sick just before the trip.  It is really hard to say that you deserve any rating yet as there is no basis to evaulate.  If you reach out again, i could raise the rating, but for now the best i can offer is average.", "rating": 3}, {"title": "Not good communicators", "text": "On the website the button to get the plan documents never worked. Contacting them did not work very good, they never answered my question on how to get the plan documents. They just kept telling me to hit the button that didn’t work. And one time they never even answered my email. Poor communication and not a very good website to help with information.", "rating": 3}, {"title": "Lousy customer service", "text": "Lousy customer service - the insurance is good until there is a claim.Poor follow up on claims - they close out claim cases with no explanations and follow up with customer service is impossible since you are always redirected back to the web portal when you request for more details on a claim. Patriot insurance plans are way better.", "rating": 3}, {"title": "They don't always do what they say they'll do...", "text": "I requested to have the 60 health insurance cards we purchased for our students to be sent in a single email and received confirmation of this from the representative I spoke with. Instead, I received 60 individual emails with the cards. This was unexpected, disappointing, and ultimately resulted in extra work and delays for our small team.", "rating": 3}, {"title": "I wanted to renew my policy before it…", "text": "I wanted to renew my policy before it expired. The system wouldn't let me. Then I received an email regarding my recent purchase. I didn't know what was going on. When I tried the chat option, it wasn't available.  I'll give Seven Corners one more chance but if the service doesn't improve, they'll have lost my confidence and business.", "rating": 3}, {"title": "Mixed review", "text": "It was a pleasure purchasing the insurance from Violetta Wooster, but I was disappointed that I was requested to complete the Proof of Loss form several months after I informed in writing Seven Corners of my medical problems, instead of immediately after the situation occurred. In order to give the most accurate details in the form, I should have been informed that I need to complete the form immediately after the medical problems occured in order to give the most accurate details.", "rating": 3}, {"title": "Not too excited with the service", "text": "I had a hard time figuring things out on the website. I called and was told I'd receive a call back, which never came. I decided to go for the chat and the chat person helped some, but making me wait a lot for the answer (I asked several times if she was still there), and eventually became unresponsive. I closed the chat. I bought the policy more out of necessity and good reference than that of a good experience.", "rating": 3}, {"title": "A generous rating for your online…", "text": "A generous rating for your online interface. I had to fill the form 2 times providing all my details again (multiply that by 5 people on the insurance) because it would incorrectly show error on DOB and address with no additional details. I spent 15/20 mins troubleshooting the first time and gave up. If I hadn't bought travel insurance from you before, I would not have come back the 2nd time to try again...", "rating": 3}, {"title": "The policies are not flexible", "text": "The policies are not flexible. Should be able to individually decline coverage for things not wanted or needed.  If forced to accept coverage, they should explain why. You have to call in to get anything explained to you. Watch out for pre-existing conditions. After all, they are an insurance company who's motive is not to pay out.  I still purchased it. Could not fine anything better. Its like they're in bed with one another. And the plans get worst each year.", "rating": 3}, {"title": "In my honest opinion", "text": "In my honest opinion, it is a quite misleading to advertise insurance for loss of personal items and electronics and not cover smartphones which in this day and age are items that most people would want to be insured. Once you purchase the coverage and are provided with the full coverage details it is stated that telephones are excluded from the list of covered items. Your competitors do offer this service and in hindsight, I would have rather purchased insurance from another vendor.", "rating": 3}, {"title": "My dental insurance is somewhat that I …", "text": "My dental insurance is somewhat that I don't have one! I cracked the tooth with some food and came to the dentist and realised that I need to pay full amount out of my pocket!!! It is not intentionally that I broke my tooth and the insurance didn't cover anything though I have 650 dollars limit for dental!!! That's inappropriate!!! And that was rea disappointment!!!", "rating": 3}, {"title": "There are few points would like to …", "text": "There are few points would like to share....1.Insurance fees are pretty high for the comprehensive. It can be reduced further atleast 20%.2. it would be helpful if you could highlight anywhere that deductibles are based on per visit for the scheduled policy.3.Its an good option to add if someone wants to switch it to another policy , and cancellation fees should be waived off. I was requested same , but it was denied.", "rating": 3}, {"title": "The price quoted  by your quoting…", "text": "The price quoted  by your quoting system was higher than  the daily rate as per table.Your sales rep on +1 (317) 575-2652 could not fully explain why.He mentioned that there is an $5.00 admin fee , which  did not cover  the full difference between daily rates and price  I paid. The sample policy did also not mention any initial costa  to enroll.", "rating": 3}, {"title": "Who Knows????", "text": "I purchased a policy.  We went on vacation.  Everything went well. Had a great time.  Never used the policy. All good.  Most insurance companies are great at sales, but the measure of an insurance company is how they perform when there is a claim.I have no way to answer this question.  Silly for them to ask.", "rating": 3}, {"title": "Better training needed.", "text": "Better training needed.My second time getting a policy with seven corners, and a very different, difficult experience this time.The representative I worked with had a great deal of difficulty with the very simple requirement: \"I'd like exactly the same short-term policies as I bought this past August.\"After many calls and emails, over several days, I finally managed to guide the rep to what should have been a 10-minute transaction.", "rating": 3}, {"title": "A little disappointing", "text": "First I was disappointed that Jeremy Kelso does not appear to be with you any longer, he was quite helpful on our last 2 trips.I've been using you folks for the past several years, but this year seemed a little harder only because each time I checked out a different option, I had to fill all my information in again.  I found that to be annoying.  Otherwise, I believe you folks are still competitive and will continue to use you for our upcoming trips.", "rating": 3}, {"title": "A purchase", "text": "A question arose on the website while I was purchasing trip insurance. I called the toll free number & the operator was a tad condescending & not helpful. I was able to continue & purchased the necessary insurance. The only way I will know if this is a good company is if I have a claim. Hopefully I won’t know.", "rating": 3}, {"title": "No documentation provided", "text": "I have not been sent any of the documentation for my plan - not ID card or letter for visa or anything, 2 days later. You're supposed to be able to download them from the website, but it just hangs and never downloads. I have emailed for assistance and although have had a response, it has been of no help at all!   EDIT: this did get sorted out, 2 days later. It worked out okay for me in the end, but if I'd needed the docs for a visa application it would have been a disaster", "rating": 3}, {"title": "dealings with customer service was not…", "text": "dealings with customer service was not ideal. one customer service did not follow up, despite my email and follow up email.Secondly they do not cover martial arts training even in the hazardous sports option, despite the fact it is safer than many of the hazardous sports options, and more popular.", "rating": 3}, {"title": "I have been buying Seven Corners travel…", "text": "I have been buying Seven Corners travel insurance for about 7 years for family that visits us from Mexico. Fortunately, there was only one time that I had to file a claim. The process was somewhat long but I got paid after several requests of additional information concerning the nature of the illness.", "rating": 3}, {"title": "I bought Trip Cancellation and Trip…", "text": "After filing an appeal and sending documentation of our losses, Seven corners did agree to reimburse us for part of our losses.  so I have updated my review.I bought Trip Cancellation and Trip Interruption Insurance for $810.  Now they are saying that they don't have to pay.  Our trip was cancelled one day before we were to fly to Nepal and Bhutan because they closed their borders because of Corona Virus.  Seven Corners says they aren't covering it.  This company is a SCAM.  They cover if you lose your golf clubs but not if there is a disaster.", "rating": 3}, {"title": "I kept having to go back on your…", "text": "I kept having to go back on your website to change things and see how that might affect the price. When I did so I then had to re-enter a whole lot of info all over again. I'm also not sure how I go about informing you as I enter various components to the trip - like airline info, train info, etc.", "rating": 3}, {"title": "Sending a survey before responding to…", "text": "Sending a survey before responding to my claim puts me in an awkward situation. Your survey should be sent after claims have been reviewed for me to give valid feedback.", "rating": 3}, {"title": "RE frustrating getting reimbursements", "text": "RE: certificate # 2INBCRL20-100063 I submitted my claim for reimbursement in August and was told that it would take up to 55 days to process the claim due to COVID-19. I reached out to get status on my reimbursement on the 60th day and was told it would take another 60days to get the reports needed to process my reimbursement. These delay tactics are very frustrating, what exactly was being processed initially (from Aug- Thru Sept)? The annoying part is that I have to send an email requesting an update. The is no email sent from the insurance carrier alerting me to additional delays", "rating": 3}, {"title": "your web site has some issues", "text": "your web site has some issues. on Mac it could not pursue the purchase as kept opening  a web page about translate etc and would not go anywhere. The agent was also at a loss in guiding me when talked to her phone. shifting to windows based computer worked.i have been sent a thank you note for purchasing the policy. a link is provided to get all the detailed information about my policy. Clicking on the link irrespective of the kind of computer goes nowhere and comes up with translation etc page. It needs a look in. thanks", "rating": 3}, {"title": "I didn't have cause make any claims so…", "text": "I didn't have cause make any claims so am unable to rate the company. I did receive adequate information about the policy up front and have no reason to doubt an adequate follow through if it had become necessary.", "rating": 3}, {"title": "I wanted to purchase travel insurance…", "text": "I wanted to purchase travel insurance for Cuba. The agent was very helpful and friendly. Since Cuba is a restricted country, the first two policies she tried were invalid. She thought the last option was bad in Cuba but after I gave my credit card info, she said that the policy did not go through. However, my credit card was charged. When I called 7 Corners back, they again we're very helpful and reversed the charges. The confusing party was that that agent said the policy would have been valid but by that time if already purchased insurance somewhere else.", "rating": 3}, {"title": "I travel quite frequently and have…", "text": "Update: changed from 1 to 3 stars,  within a week of working this review I received payment for my claim.  I travel quite frequently and have always purchased travel insurance. Have only had to use it a couple of times and have always been reimbursed within 4-6 weeks. This is my first time using Seven Corners as it was recommended by a fitness travel group I am in. I purchased a Cancel for Any Reason policy, canceled that trip in February, filed a claim immediately. It is now mid June and still no payment from them. In the beginning I was told 30 days on payment of claims. Then later I was told over 90 days! We are now at 4 months with little to no communication from them! When purchasing insurance customer service is great, but if you file a claim do not expect any type of customer service whatsoever! Claim #14723026Certificate ID: 1RTB21-IL-100662", "rating": 3}, {"title": "Website failure/fantastic customer service", "text": "The website was if no help.  Tried to purchase travel insurance at least 10 times.  Kept having error messages.  Called representative and she was fantastic!  She asked website questions and then was able to secure/sell me our travel insurance in less than 15 min.", "rating": 3}, {"title": "I have alerted on revised travel dates…", "text": "I have alerted on revised travel dates since effectivity starts when we travel. however, it appearsthe policy was not revised, so effectively we are only getting 30 days' coverage despits purchasing 60 days' coverage.", "rating": 3}, {"title": "The coverage is great, but experienced a glitch in their online system.", "text": "The coverage is great, but the company must have a glitch in their system. I was very deliberate with dates I requested for coverage, but just before the flight, I discovered my coverage started the day after I purchased the coverage, not the date I requested it to begin. Luckily, the ending date did cover my trip. My son and daughter-in-law purchased coverage on the same day and their dates for coverage were incorrect as well, beginning and ending before the trip. Obviously, we should have reviewed the confirmation, but we were very careful entering the dates so didn't think there would be an issue. My son didn't have time to get it corrected through the company before the trip, so he had to buy another policy.", "rating": 3}, {"title": "Comparing policies and signing up for coverage was a breeze", "text": "Signing up for travel medical insurance was a breeze.  We have never had a problem with the webpage and finding information about the policies that allowed us to compare coverage.  We have used the company previously and found them responsive to our need regarding purchase of insurance coverage.  In this respect, I would give them 5 stars.  I gave three stars because I feel the review could be misleading and should refer only to purchase of the policy.  We have never needed to actually use the policy, and that is where we would find the true clarity of the policy and service provided by the company.", "rating": 3}, {"title": "I don't know how to rate a 'service' I…", "text": "I don't know how to rate a 'service' I paid for but didn't need to use (i.e., the three stars).  Probably, the best way to look at it: it's the same as insurance ... paid the premium but never had to file a claim. (Happy Face?)", "rating": 3}, {"title": "Never had any issues with Seven…", "text": "Never had any issues with Seven Corners. All bills were taken care of. Obviously, an awesome experience.  I will definitely choose Seven Corners anytime.Thanks for the support.", "rating": 3}, {"title": "Expensive.", "text": "Rather expensive for a policy with a lot of ifs, ands and buts.  One wonders if they will actually cover anything.  i may find out.  My airline has misplaced one of my bags.", "rating": 3}, {"title": "Couldn't update payment info", "text": "Tried to extend the coverage on the last day and when I tried to change the payment card, it said the service was not available. Had to start over and buy a new policy, instead. Somewhat disappointing but oh well...", "rating": 3}, {"title": "Claim process is a nightmare", "text": "Claim process is a nightmare. Takes forever to process. They cancel the check without notifying us.", "rating": 3}, {"title": "Exceptional people by phone but awful …", "text": "Exceptional people by phone but awful online software. Could not access my account because a second factor verification was supposedly sent to my phone but didn't arrive and you do not have an alternate verification (email) listed. It is foolish to use a phone verification because you sell INTERNATIONAL TRAVEL insurance. I have a +44 number (of course) when I'm in London.Without the assistance from your in house people I would have purchased my insurance elsewhere.Please notify your internet development folks that you are a international travel support company. I'll try your online site again next fall before I go to Australia.", "rating": 3}, {"title": "agent needs to follow up with group insurance", "text": "We bought the insurance in a group and the agent did not follow upwith all insurance cards prior to our departure.  Some team members has to request many time before getting their insurance card in time for our trip.", "rating": 3}, {"title": "the website was not working for at…", "text": "the website was not working for at least 2 days and customer service was not responding.  When I finally reached them they were unaware of the website problem but confirmed during the call that the website was not working.", "rating": 3}, {"title": "Problem with explanation of Trip Cancellation coverage limit", "text": "The only serious problem I noticed with Seven Corners is how it describes the Trip Cancellation benefit on its website and in the some of the documents (e.g. Travel Insurance Coverage Letter) it sends to customers after a policy is purchased.  With the RoundTrip Economy plan I purchased, the language used is \"Trip Cost up to a maximum of US $20,000\".  This is needlessly confusing and potentially misleading.  The Trip Cancellation Coverage limit is the specific dollar amount entered by the customer on the website during the purchase process.  This dollar amount (in my case $4000 per traveler) is the amount that should be shown on the website and in all documents sent to the customer at all times so they always see exactly what their coverage limit is.I've purchased travel insurance through other insurers in the past and they have always been crystal clear about coverage limits.  I see no reason why Seven Corners shouldn't do the same.", "rating": 3}, {"title": "Need improvement on written communication response times", "text": "Seven Corners customer service is responsive when they are selling to you...but not so much on follow up.  I've been increasingly frustrated with their written communication - I wrote to ask about renewing my policy 2 weeks ago, I received an automated response that the email was received and they would get back to me with an answer...but never received an answer.  I suspect they wanted my policy to lapse as they have redone their whole policy structure.   In general, they take a really long time to respond to email, if you need a question answered, you'd better call. And good luck if you're travelling on the other side of the world and US office hours are not convenient for calling.", "rating": 3}, {"title": "The price for travel insurance was…", "text": "The price for travel insurance was affordable. I ended up contracting Dengue Fever in Thailand and the claims were dealt with promptly, although you do have to wait 35 calendar days for reimbursement.There was a large discrepancy with the currency conversion so be very careful when looking at the amount you were charged vs what is reimbursed. To get the correct amount of money back was a huge pain.. it took 3+ months of calls, empty promises, and unanswered emails.. It was very clear that no one wanted to deal with it.Finally, after a strongly worded email, we were lucky enough to get a response from Julia who was very responsive in getting our money backin a timely fashion. She was a pleasure to work with.", "rating": 3}, {"title": "Did not have to use the services", "text": "Did not have to use the services - however would have appreciated someone reaching out to tell us about the services in more detail once we subscribed- like a welcome call with clear contact details", "rating": 3}, {"title": "Positive and negative", "text": "On the positive side, seven corners was very helpful to me when I was in Peru and needed emergency surgery.  On the negative side, it has been very cumbersome to file a small claim due to trip interruption.", "rating": 3}, {"title": "the policy was easy to apply", "text": "the policy was easy to apply, but nothing happened during our trip and we didn't have to claim anything so I don't have any useful feedback on Seven Corners, hope they come in handy one day.", "rating": 3}, {"title": "Found this insurance expensive and…", "text": "Found this insurance expensive and limiting coverage with high deductible. We were in a pinch as our previous insurance had ended the day before and could not be extended after expiry.", "rating": 3}, {"title": "nothing", "text": "nothing eles", "rating": 3}, {"title": "It was a good experience the only thing …", "text": "It was a good experience the only thing that make me confused was the way the system is set up for the value of the trip. My trip is for $ 4.000 and the system took it as $ 400. Is a big difference.", "rating": 3}, {"title": "Never able to login to my account; no help from customer service.", "text": "I never needed to file a claim, so I have no comment here...However, I was never able to login to my account via the Seven Corners website. I contacted customer support and never received a reply.", "rating": 3}, {"title": "Never had to use it but \"24/7\" is very misleading", "text": "Certificate 1RTB21-AOS-100240I never had to actually file a claim so I don't have any idea about how responsive Seven Corners is during an actual emergency; but I was made VERY wary with my interactions with them prior to my trip. They seemed chronically short-staffed. Every time I called, I was put on hold and usually forced to leave a message or was transferred to an answering service; and once was called back the following day. I feel very deceived by the \"24/7 availability\" promise and will probably choose a different provider for my next trip. Also, they don't have great attention to detail (which is very important). For example, my wife changed her name after we got married and I needed to update her name on the policy. They did so, but they forgot to update the confirmation letter; so I had to call back, wait on hold again, leave a message, get called hours later, and have them press the right button.", "rating": 3}, {"title": "Glad we didn’t have to use it", "text": "We didn’t need to file a claim during our vacation, but it was nice to know we had insurance in case we needed it.", "rating": 3}, {"title": "I am only giving 3 stars because I am…", "text": "I am only giving 3 stars because I am waiting for the results of a claim I have filed before I would change the star rating.  So far so good, though.", "rating": 3}, {"title": "You guys used to be great.", "text": "You guys used to be great.. lately, I called sales department because I am not comfortable purchasing a travel / medical policy without getting clarifications.  Sales NEVER answered the phone!  I'm trying to buy a product from you and no one answers the phone!  I called another department and insisted they get someone from sales ... to answer the phone.  She stayed on with me until Sales took my call.  Sales said they were all in a meeting.  Seriously?? You're a business, and no one is left to answer the phone?   Also, your webpage is acting up.  Ron Fulton is someone I dealt with in the past, he was extremely good.  Violetta was fine, once someone got her on the phone.. I have purchased several policies from you all and have a decent history upon which to make this comparison.", "rating": 3}, {"title": "Unacceptable customer service, lack of relevant info.", "text": "Certificate #9RTC19-26276 Paid $$No claims.No reminder before end of policy term.Decided to extend stay abroad by month as COVID increasing at home, (“ don’t travel home for Thanksgiving” health warnings.)Tried calling 7 Corners right before the policy-term end to extend and spent ages hanging on.Cant do new policy as must be initiated before travel commences.No way to extend either on website.Eventually  reached Someone who ‘took notes’ and said I would be called back in 24 hours. 24 hrs later got short message on phone as we had gone to supermarket.Called back to # given in message, explaining issue again on message machine as line busy and asking for call/email etc. Still no response, no info emailed to us.Tried # again, no answer.Unacceptable customer service for travel medical policy during COVID for two 70+ people!Pat", "rating": 3}, {"title": "We had an incident with a motorbike…", "text": "We had an incident with a motorbike accident while in Thailand. Though we filed our claim months ago, the claim is still processing. Will update when it finally goes through.", "rating": 3}, {"title": "claim review", "text": "Waiting for claim to be processed. Further review ( higher or lower ) will be based upon Seven Corners handling of our claim. Trip cancelled due to Corona quarantine .", "rating": 3}, {"title": "I didn't use the health insurance…", "text": "I didn't use the health insurance provided by Seven Corner. So cannot rate it according to experience in services.", "rating": 3}, {"title": "Could have been better...", "text": "I had called but “all their telephone lines were down”. This is what I was told by an answering service. They also told me that I could talk to “live help”, but none were to be found on their website. When I reached a live person eventually (couple of days later), she was ok, but not great. That is, I asked for a few details and again in a subsequent call. She referred me more than once to read the Contract. She was ok, just not Great. Has to learn to be a bit more cheerful and bubbly. That’s what a good salesperson is!  I called one final time before ordering a month-long policy. The guy that answered was terrific. Lastly, as it is an insurance policy, there’s dozens of variables to consider that most people never read about. One must familiarize themselves with details, otherwise you may find yourself NOT covered the way you thought!", "rating": 3}, {"title": "My trip was rescheduled several times", "text": "My trip was rescheduled several times.   Seven Corners was easy to update.   Fortunately, I did not have to use the policy.", "rating": 3}, {"title": "I wasn't very impressed", "text": "I wasn't very impressed with the service I received. When I needed to return home early due to the death of a parent, I called the help line eight times before I finally reached someone. She told me that the \"care team\" would contact me within 24 hours. I don't know what her job was; I thought I WAS calling the care team, as required for trip interruptions. Twenty-four hours later I received an email telling me to buy my own ticket and ask for reimbursement later. Why couldn't they tell me that 24 hours earlier? Why did I need to call their help line in the first place? In the 36 hours between my first call and that email, airline tickets had increased by $300. But they are throwing their own money away, not mine. I received my reimbursement 22 days after submitting my claim. For some odd reason, they reimbursed me 65 cents less than my claim. ?!?", "rating": 3}, {"title": "It was quite good", "text": "Date of experience: May 29, 2022", "rating": 3}, {"title": "Easy to sign up and print card.", "text": "Easy to sign up and print card.I may use this service again.However, when I made a claim a the past I never heard from the company and received NO reimbursement.", "rating": 3}, {"title": "The resort is beautiful", "text": "The resort is beautiful, the actual room and location was five stars, however the service was 3 stars. We were there a total of 4 days and the way we were treated was quite disappointing. We were definitely being treated differently because we weren't blonde, blue eyed, geriatric, celebrating our retirement or turning 75 years old. That's not to say there wasn't one or two that seemed genuine and happy we were there. I called the front desk once or twice and both times felt as though I was bothering them. I'm only guessing that if you don't fit the I'm rich and old description they will give you mediocre service. Definitely felt that they treated us like we weren't worth the hassle or we weren't going to tip. Our tips sucked because service sucked maybe next time they don't judge a book by its cover, if anything we tip just as much or more than most people. Additional pros: breakfast was great, the omelette chef was kind, the pool was nice.", "rating": 3}, {"title": "Not as easy as would be expected to …", "text": "Not as easy as would be expected to book insurance as learning their system, availability of certificate privacy number and procedure seemed frustrating at times,", "rating": 3}, {"title": "I had faced many challenges to close up …", "text": "I had faced many challenges to close up several claims due to miscommunication between seven corners and the health providers. Hope this will be improved. thanks", "rating": 3}, {"title": "communication", "text": "Not clear communication for non native English speaker. If there is an international team that can help communicate in different languages will be great.", "rating": 3}, {"title": "Have never had need to use this…", "text": "Have never had need to use this insurance, but it is easy to sign up for.  As a person on Medicare, I am grateful to have this option for overseas travel.", "rating": 3}, {"title": "The website is crap", "text": "The website is crap. I tried 9 times to make it all the way through to payment. At different points in the process, I got the “unexpected error” message.", "rating": 3}, {"title": "Be sure to read the small print", "text": "Be sure to read the small print. When you actually look into it, even the most expensive option doesn't cover much....", "rating": 3}, {"title": "Online chat was terrible this time", "text": "Online chat was terrible this time. I was chating with an agent and when I said I already have the plan, she didn´t reaponse to my other questions.", "rating": 3}, {"title": "The purchase process was easy and …", "text": "The purchase process was easy and comfortable.But I have a question regarding the covered dates, and i asked this question, but no response. Sad.", "rating": 3}, {"title": "Not super flexible or transparent", "text": "I apparently mistakenly booked two policies for travel and didn't need the second one (I thought it was only a query, not an actual booking). It is my fault that I didn't open the links they sent to access my documents, but I thought they were just duplicating emails for the same policy. The initial emails did not contain details I needed (i.e. travel dates) that would have alerted me that these were two different policies. Granted, I should have paid closer attention, but I think the company could have also have been more detailed upfront and clearly identified the relevant dates. I called to explain and they declined to refund me for the second, unused policy. I probably won't use them again because of lack of transparency and willingness to see the second policy was in error. Oh well.UPDATE 10/11. This company replied to this review, indicating they would reach out to me, and as of yet—nearly two weeks later—they have not. Just sayin'", "rating": 3}, {"title": "I would like to claim of my damaged…", "text": "I would like to claim of my damaged suites case.Let me know how to do it.Mami Nonoguchipolicy number4ARTL17NY-106768", "rating": 3}, {"title": "I had some trouble navigating the site …", "text": "I had some trouble navigating the site and the plan options, and called the number listed for assistance. No one answered, so I left a message. No one returned my call. I may have also sent an email, I can't recall. After about three weeks I asked a colleague for advice on how to proceed and she gave me helpful suggestions about which policy to choose. When I tried to do this, however, my order would not process. I used the chat tool to ask for help, and got my first contact with an employee! She guided me through the process, and discovered that the site was malfunctioning. After consulting with I.T., she suggested I try again in 30 minutes. Later that same day I got an email from tech support alerting me that the site was again functional. The next day I made my purchase without incident, and printed off the card that was issued. I hope that, should I need this travel insurance, that using it goes more smoothly than buying it!", "rating": 3}, {"title": "Poor claim service", "text": "I put in a claim for cancel for any reason policy since 3/11/2020. The more I work with this company it seems like a scam then a real company. 1. Try calling them no one calls back with auto call back.2. Filed claim online then sent all information they requested and they sent new email to file a paper claim.  Start all over again I'm not doing that.3. I would be happy to just get a refund of money I paid for this useless policy. My claim amount is only about $250.00 for airfare. For that little amount the time is not worth it.4. I think I would have better luck trying to get refund from airlines then dealing with this company. 5. In fact I was able get huge refund from delta airline but European airline Olympic air refuses to grant refunds even though by law they are required too. Got email yesterday and they did find claim and all paper work. But status online still says waiting for paper work.Well they finally agree to a refund 75 percent of ticket amount about 160 dollars", "rating": 3}, {"title": "We can do better...", "text": "So difficult to enter my Agent's code to receive my commission sold to myself. Unbelievable. Your Agent's Site needs revamping.", "rating": 3}, {"title": "reinstating coverage can be hard-- you…", "text": "reinstating coverage can be hard-- you have to call them directly and cannot do it online.  would be great to reinstate online.", "rating": 3}, {"title": "poor coverage", "text": "Was dissapointed that you did not cover covid19 since I have been with you for 5 years without a claim", "rating": 3}, {"title": "Where's the customer service representatives?", "text": "Couldn't contact customer service when I needed to! Left a message and never heard back from anyone!", "rating": 3}, {"title": "It was not a bad experience but almost…", "text": "It was not a bad experience but almost miss my flight trying to fill that form out too much information and time consuming", "rating": 3}, {"title": "Not sure the benefit was worth the…", "text": "Not sure the benefit was worth the money.  Confusing options and probably chose the wrong coverage for the trip.", "rating": 3}, {"title": "There was no claim involved", "text": "There was no claim. The insurance is as good as how it process claim(s). All insurance companies can collect premium.", "rating": 3}, {"title": "Good", "text": "Quick setup, competitive pricing, smooth handling of paperwork. No issues, no claims (10-week travel to 3 countries).", "rating": 3}, {"title": "reasonably priced", "text": "reasonably priced, insurance, don't know if they are any good with claims, as I haven't had to make a claim", "rating": 3}, {"title": "Can't say", "text": "Can't say, was told that decisions take an average of  87 days", "rating": 3}, {"title": "Only used once so far", "text": "Only used once so far. did get the paperwork we needed for Costa Rica. will see the rest as the year goes on.", "rating": 3}, {"title": "Concerns over scheduling and itinerary…", "text": "Concerns over scheduling and itinerary s. Not to mention baggage theft and covid testing", "rating": 3}, {"title": "I had an accident and insurance didn’t…", "text": "I had an accident and insurance didn’t help . I paid everything out of my pocket", "rating": 3}, {"title": "You were doing fine until you kept…", "text": "You were doing fine until you kept sending me reminder emails that my coverage was up.", "rating": 3}, {"title": "Didn’t have to use", "text": "Didn’t have to use, so basically paid close to $1000 for nothing.", "rating": 3}, {"title": "Had a problem with the actual purchase…", "text": "Had a problem with the actual purchase of our policy. Using a agent, we had gotten the policy in place and ready for checkout, and then I discovered that due to a spending limit on my debit card, the purchase would not go through. I called my bank and had the limit extended pretty quickly. When we tried the transaction again, it still wasn’t working. Again, I contacted my bank and was informed the wrong address was being associated with the debit card (because my billing and shipping adresses are different), which is why it wasn’t going through. I called the Seven Corners agent again who denied this could be the issue. She tried multiple times to run the transaction the same way as before. She eventually tried some other method in which she had to manually enter the billing address before it finally worked. The whole time she blamed my bank saying that she thinks my bank was lying to me and that they probably just didn’t raise my spending limit until right at that moment. She never accepted responsibility for just running the transaction wrong and wasted about 25 minutes of my time while I sat on the phone waiting for her to figure it out.", "rating": 3}, {"title": "Disappointing Declaration", "text": "The policy was fine, the customer service representative was friendly and knowledgeable.  I bought a bare bones policy strictly to cover the new Covid-19 insurance mandates and meet the requirement for my host country (Argentina).  My gripe is with the \"Declaration\" or \"Confirmation\" page that I was to present as proof of my purchase.  Instead of stating that the coverage was for Covid, quarentining, hospital, ER, etc., it was a tick list highlighting what I DIDN'T purchase - all of the extras I didn't opt for - cancellation insurace, flight reimbursement, hotel costs, etc. etc. etc.  There was a slight mention of \"Covid\" at the bottom of the initial paragraph, and nothing else.  It was underwhelming.  When I talked to the agent again, she mentioned that I could \"upgrade\" (appx. $100 more) to a similar policy that actually 'highlighed' the policy as Covid Insureace (in the page header, the narrative, etc.  She offered the upgrade as I seemed disappointed with the policy I had purchased.  I explained that I was quite happy with the policy - it suited all of my needs.  The problem was with how they presented it - the declaration buried the Covid coverage, the 'upgrade' would highlight Covid coverage for a vastly increased premium.  Clearly a marketing ploy.  = (", "rating": 3}, {"title": "I have sent an inquiry email 2 days…", "text": "I have sent an inquiry email 2 days earlier about receiving confirmation email. No one has responded yet.", "rating": 3}, {"title": "I never had to use any of it,strictly…", "text": "I never had to use any of it,strictly for the One Health Pass for Philippines", "rating": 3}, {"title": "Was easy to sign up for but can't rate…", "text": "Was easy to sign up for but can't rate service because thankfully I didn't need to use it", "rating": 3}, {"title": "I had to renew my policy as my trip was…", "text": "I had to renew my policy as my trip was extended and wish it had been easier than reapplying.", "rating": 3}, {"title": "Fortunately", "text": "Fortunately, I didn't need the service, so I can't really review it very thoroughly.", "rating": 3}, {"title": "Very Disappointing 24/7 Assistance Response", "text": "A member of our traveling team fell ill while in a small village in Asturias, Northern Spain and had to hospitalized in the remote rural small hospital with life threatening condition.Seven Corners 24/7 Medical Assist was contacted the same day. All that was received from them in response was an email with what appeared to be a standard verbiage explaining the company policy regarding medical evacuation- to make sure that the patient is getting “adequate” care for the condition and if not to be evacuated to the nearest facility where such a care will be rendered. However, no attempt was ever made to gather more information/ data to assess & evaluate if the facility had the appropriate capacity , staffing or expertise to treat her condition being treated or the potential complications there from. Indeed, no action was taken to determine the  status or the severity of the person’s condition. Amazingly, it was five days before another response was received to my email on the day of hospitalization questioning how they determined that a medical evacuation was not warranted. Overall, I was perplexed & very disappointed with the level of professionalism, caring & efficiency. Fortunately & thankfully the person affected turned the corner after six days in the hospital.", "rating": 3}, {"title": "WhatsApp responses are great and fast", "text": "WhatsApp responses are great and fast. However, response to emails is slow.", "rating": 3}, {"title": "ID document printing", "text": "I reported an issue on ID document printing, and had reply following day.  It's ok now.", "rating": 3}, {"title": "The date of travel was upon us and we…", "text": "The date of travel was upon us and we had not yet received the confirmation on the policy.", "rating": 3}, {"title": "Your premium is extremely expensive…", "text": "Your premium is extremely expensive compared to other travel insurances", "rating": 3}, {"title": "Good insurance with good medical…", "text": "Good insurance with good medical network and low copays but Claims takes very long", "rating": 3}, {"title": "I had to undergo surgery", "text": "I had to undergo surgery. It took them seven months to pay. But they did pay.", "rating": 3}, {"title": "I didn’t need to use it so it was good…", "text": "I didn’t need to use it so it was good back up but it didn’t cover OTC meds.", "rating": 3}, {"title": "Covid 19 caused the trip to cancel and…", "text": "Covid 19 caused the trip to cancel and was not covered by the policy.", "rating": 3}, {"title": "A bit expensive for an item that you…", "text": "A bit expensive for an item that you hope you don't have to use.", "rating": 3}, {"title": "Cust service not upto mark", "text": "Cust service not upto mark. Not knowledgeable about certsin products.", "rating": 3}, {"title": "So far I didn’t use it so I can’t share…", "text": "So far I didn’t use it so I can’t share my opinion but looks good.", "rating": 3}, {"title": "The issue has solved.", "text": "I do not understand why I can't get a refund for my travel insurance plan to go to Japan, even I haven't fly yet, and my airline , United Airline announced to reduce only 5 times a week from March 28th to April 24th.  I don't understand what I signed up for this travel insurance for?  ( My travel date is from April 10 to April 17th ) Who wants to reschedule within 60 days to go to Japan under this circumstance?   You edited that you wouldn't accept to cancel a trip of the reason is due to coronavirus.  I can't understand it as well.  You created the status after the coronavirus outbreak happened. That is not fair. I would not ever use Seven Corners. \" We received your request to cancel your plan. Unfortunately, the plan does not allow cancellations more than 10 days from the purchase date of coverage, 02/11/2020, as stated in the plan document:\"If the Insured is not completely satisfied with the insurance You must notify the Company within 10 days of purchase and return the certificate. The Company will give the Insured a full refund of premium provided You have not already departed on the Covered Trip or filed a claim.\"Because of this state requirement, we cannot cancel the plan nor can we refund the plan cost. However, the plan may be used for a different trip, if the new trip start date is within 24 months of the original purchase date, 02/11/2020. To change the travel dates to a new trip, please provide the new trip dates and destination country within the next 60 days.Kind regards,  \"-------------------3/5/2020They tried to help me.", "rating": 3}, {"title": "Cheap", "text": "Cheap, hope its good. I am a new buyer. No good customer service.", "rating": 3}, {"title": "Didn't wind up using your services---at…", "text": "Didn't wind up using your services---at all.", "rating": 3}, {"title": "Easy to purchase", "text": "Easy to purchase, but dificult to decide and compare products", "rating": 3}, {"title": "It was acceptable realted to the fees.", "text": "It was acceptable realted to the fees.It s really affordable", "rating": 3}, {"title": "Fine Coverage", "text": "I am trying to find my ID since it was not emailed to me.", "rating": 3}, {"title": "you spam my email wat to much for a 1…", "text": "you spam my email wat to much for a 1 week insurance", "rating": 3}, {"title": "I didn’t use the service", "text": "I didn’t use the service.   My trip had no issues.", "rating": 3}, {"title": "great work", "text": "great work but quit expanseve..................", "rating": 3}, {"title": "Got too much time for the payment.", "text": "Date of experience: April 05, 2022", "rating": 3}, {"title": "i dont see much coverage's in this…", "text": "i dont see much coverage's in this service.", "rating": 3}, {"title": "I compared travel insurance extensively…", "text": "I compared travel insurance extensively prior to my six-month trip overseas. During my time traveling, I had three minor medical issues, all of which I decided to pay out of pocket due to the ease and cost of payment. Given that, I did not need to utilize the insurance at all. There were several components of Seven Corners policy that were attractive features for me, and several that I felt I wish were better. (+) Cost is affordable! Compared to many options on the market, this is a good price for emergency coverage. The price was right in mid-range of what I found on the market.(+) You can buy last minute. For several people traveling with me, they ran into issues with other companies not having bought \"in time\" (more than two weeks prior to departure), whereas this was not an issue with Seven Corners.(-) Length of policy. I was not allowed to buy a policy that extended the entire length of my trip. I believe that the coverage had a 3 or 4-month max, and then you had to buy a second policy. This may work if you are traveling places with guaranteed internet, but if you are traveling in remote areas, this can be a huge hassle. (Not to mention, if you are out climbing mountains, \"I think my insurance policy runs out tomorrow\" is probably not the first thought in your mind.\" The option for longer-term policies would be much appreciated and something I would look for specifically in the future! (-) In regards to the point above, I received no reminder email from Seven Corners stating that the policy would run out in a week or even a few days. Only an email on the date it ended. I would definitely recommend this as an easy fix to Seven Corners to improve Customer Satisfaction and ensure that their clients have continued coverage!Overall, it was there for backup emergencies if needed (luckily, did not) and I would use them again in the future for shorter travel.", "rating": 3}, {"title": "lele", "text": "It was nice to have Japanese customer service！", "rating": 3}, {"title": "You guys very much care for there…", "text": "You guys very much care for there customers.", "rating": 3}, {"title": "Health Insurance", "text": "getting Policy Process is Good But Expensive.", "rating": 3}, {"title": "Poor customer service, (Addendum, Pandemics not covered)", "text": "Poor customer service. I was in Hong Kong, and wanted to leave early do to the concerns about the new corona virus, and flights being cancelled.At the time the state department had just issued a level 3 travel advisory due to the virus. I called to see if my medical insurance would cover flight change fees or evacuation due to the travel advisory. My customer service rep kept talking about level 3 or 4 travel advisory due to terrorism and said that would be covered, but that a level 3 or 4 travel advisory due to the epidemic would not be covered. This made no sense. Either the insurance is worthless or the customer service agent didn't know what she was talking about.Addendum: Seven Corners got back to me quickly, so I raised my rating to 3 stars.  They confirmed what the customer service rep told me, that level 3 or 4 political travel advisories are covered, but health travel advisories are not covered even though I bought travel health insurance. They told me that evacuation or flight change fees due to an epidemic are not covered, even with a level 4 travel advisory. They confirmed that medical care if I got sick in China would be covered. Medical evacuation would be covered if I was hospitalized while traveling, and they determined the care I was receiving was substandard. (Don't die while waiting for this determination)According to Forbes,many travel insurance policies exclude coverage due to epidemics and pandemics, so I rate seven corners average in this regard.  I think Seven Corners should make this clear to people before they buy a policy, and let people know if there is a premium policy upgrade which will cover travel changes due to a new level 3 or 4 health travel advisories.  I buy insurance to cover me for an unexpected emergency, I would consider a pandemic due to a previously unknown virus to be exactly the reason why I buy insurance!In my case I paid the airline change fees and left early. The airline later refunded my change fees. And yes, Im still healthy.", "rating": 3}, {"title": "Poor customer support.", "text": "Date of experience: April 19, 2022", "rating": 3}, {"title": "The claim  process is too slow.", "text": "Date of experience: March 01, 2019", "rating": 3}, {"title": "Poor service.", "text": "Poor service.no more revew", "rating": 3}, {"title": "Good", "text": "It was good for the price", "rating": 3}, {"title": "Love it", "text": "Love it. Very affordable", "rating": 3}, {"title": "Didn’t make a claim.", "text": "Date of experience: December 11, 2019", "rating": 3}, {"title": "It’s good to be here.", "text": "Date of experience: April 18, 2018", "rating": 3}, {"title": "Thanks", "text": "Too early to review", "rating": 3}, {"title": "price was high", "text": "Date of experience: August 27, 2019", "rating": 3}, {"title": "Good experience", "text": "Date of experience: September 17, 2017", "rating": 3}, {"title": "Travel Insurance Website Purchase", "text": "My purchase experience was completely online (no agent interaction). While navigation was reasonably intuitive, I was confused by the sites disabling of one coverage option (my preferred one) for travel insurance. It forced me to a higher coverage (and premium) then needed with no explanation why.", "rating": 3}, {"title": "Little more descriptive on each option …", "text": "Little more descriptive on each option you are providing which a common person will be able to understand and digest.", "rating": 3}, {"title": "Couldn't get the website to work using …", "text": "Couldn't get the website to work using Internet explorer - finally had to switch to Chrome to be able to complete the application process. Even then, it took multiple tries to get some fields properly filled in. The website definitely needs some qa testing on a variety of platforms.", "rating": 3}, {"title": "I couldn't find clear explanations of …", "text": "I couldn't find clear explanations of the attendants.", "rating": 3}, {"title": "I successfully complete my purchase", "text": "I successfully complete my purchase, but the screen froze and I wasn't able to complete my partners' transaction. Had to 'chat' with agent who steered me to a new screen.", "rating": 3}, {"title": "Used many times but have never had to …", "text": "Used many times but have never had to make a claim.  Sending reminders to renew before the term of the insurance is a little bit anoying.", "rating": 3}, {"title": "Professional and courteous.", "text": "Liked the experience, especially, answers I got to queries in realtime via the chat feature. Three stars is tentative. I wish I never get to use the policy. Star rating may be revised after availing services under this policy, if ever.", "rating": 3}, {"title": "I purchased the LIAISON INTERNATIONAL …", "text": "I purchased the LIAISON INTERNATIONAL plan for my mother while she visited me for three weeks in the US.  After two weeks she started to have a bad earache so we went to and urgent care, it was a good experience to see the insurance was accepted and there was no copay for her visit. Unfortunately our experience at the pharmacy was not as pleasant, the cost of one medicine using the discount voucher provided by the plan was going to be $200 and only with a manufacturer discount used by the pharmacy people its final cost dropped to $85. Still quite pricey.", "rating": 3}, {"title": "Easy to sign up for products", "text": "Easy to sign up for products, hard to get customer service, slow response, but does ultimately address the issue.", "rating": 3}, {"title": "Very late on renewal reminders and …", "text": "Very late on renewal reminders and reaponding to emails. Reimbursement could be done more quickly. Evrything else is great!", "rating": 3}, {"title": "Have not gotten to use the insurance", "text": "Have not gotten to use the insurance, because I am not sure if I can use it for a regular doctor appointment.", "rating": 3}, {"title": "Didnt get to use it", "text": "Didnt get to use it, thankfully. But good price in comparission. So i give a more than half rating.", "rating": 3}, {"title": "Here's the deal", "text": "Here's the deal. I have used seven corners several times for foreign travel. In acquainted with Kathy the claims guru, a wonderfully emphatic lady. However I was very, very upset with the person who took my last insurance policy request. She was extremely unprofessional, kept on coughing loudly into the phone. I found her very disrespectful, exhibiting totally unacceptable customer service skills. I'm 73, a veteran. I would like a written response from the owners to my concerns.", "rating": 3}, {"title": "Claim process can be cumbersome", "text": "Claim process can be cumbersome - I have filed claims with Seven Corners before for my young brother.  The process required me to file separate claim form for every doctor visit he had.  A way to help consolidate all those different claim forms into one would be a big time saver.", "rating": 3}, {"title": "I did not have the oportunity (very …", "text": "I did not have the oportunity (very lucky) to fall ill or have an accident, It was only an asurement, and i fell quite.", "rating": 3}]