[{"title": "Had problems with whomever validates…", "text": "Had problems with whomever validates the credit card. Made several attempts even after contacting Chrono24 and confirming that payment method. Not sure what happened, I also checked with my card company and no problems. I believe I also paid customs on shipping charges? But, I had fairly good communication and updates from Chrono24 during the whole process. ", "rating": 3}, {"title": "Watch looks ok", "text": "Watch looks ok, but it runs not to my expectations since it is supposed to be cosc regulated. And  I stil don’t have the right certificate of origin.", "rating": 3}, {"title": "QC needs to pay attention to details", "text": "QC needs to pay attention to details ", "rating": 3}, {"title": "What annoys me is when I look at a…", "text": "What annoys me is when I look at a watch and try to go back to my personal feed it goes back to a different group of selections or does not go back to the place that I left to review a watch. Also a lot of sellers never have the courtesy to reply to enquiries.", "rating": 3}, {"title": "The 3D verification locked out my…", "text": "The 3D verification locked out my credit card 3 times! since i am traveling I wont be able to unlock my cards in a while.I had to reach to Chrono24 to turn off the 3D verification after which I had to use a different credit card which ended up being 5% more expensive (in terms of charges). I was not too happy about it.", "rating": 3}, {"title": "Did not see option to buy Certification…", "text": "Did not see option to buy Certification after checking out using seller's offer.  Could not remedy this even thought I contacted Chrono immediately.", "rating": 3}, {"title": "I like the money are secured for 2…", "text": "I like the money are secured for 2 weeks and I can return in this period the watch.I don’t like you don’t have any guarantee the products we receive are original one or a fake. ", "rating": 3}, {"title": "Bad experience ", "text": "The first time I bought a watch was okay. The second time I tried buying an 18 lkt  yellow gold Rolex submariner. Picked out the one I liked tried to do The Wire transfer and the bank in New York wouldn't accept it because they said it was too much money you would think with a company that supposedly sells as many watches like chrono24 would already have things set up to where the bank would accept the money. So I was unable to get the watch that I wanted because the bank wouldn't accept my wire transfer.", "rating": 3}, {"title": "Chrono24 released payment before I did", "text": "As a buyer, I dislike that Chrono24 automatically releases funds once an item is received.  I should have time to inspect a watch to ensure I agree with how it was represented in the listing, then, and only then, am I comfortable releasing funds to the seller.  As a seller I have never found the same to be true.  I have waited days for a buyer to release payment.  Are larger sellers and/or “dealers” given preferential treatment on Chrino24?  My experience say yes.", "rating": 3}, {"title": "Lack of import duty awareness specified!", "text": "I recently purchased from the US however was unfortunately subject to a £725 import charge!! This made the sale unfortunately pointless given you obviously use the platform to save money. Buyer beware as this kind of inclusion could have some serious consequences on decision on weather this platform is the best choice. I’m not an expert on buying from overseas but If this had been flagged up (an idea of possible costs expected) I wouldn’t have taken the risk.", "rating": 3}, {"title": "Seems sketchy", "text": "Buying here was OK. Hopefully I got an authentic watch. I had thought the system was set up so that my payment would be held in escrow, then I would have an opportunity to inspect the watch and verify authenticity before my funds would be released to the seller, but instead Chrono24 released my funds immediately upon delivery, so I had no opportunity to do that. Also, the whole experience felt \"sketchy.\" After I submitted payment, I got a weird call from the seller interrogating me about things like what I did for a living and why I even wanted the watch. Not exactly a pleasant buying experience. I wasn't going to write a review but they sent me an annoying email asking me to write one, so here it is.", "rating": 3}, {"title": "Good purchase through Chrono24 but high exchange rates", "text": "Good purchase through Chrono24, but the exchange rates aren't realistic. The difference is huge, when converting between Japanese Yen and US dollars. For example when converting 735000 japanese yen to US dollars, it should equal roughly around 4,700 USD. However on Chrono24 I was charged 5,019 USD because of very bad exchange rate. Which actually isn't that interesting for me after all to save up some 100s of dollars to buy on Chrono. I would rather get the watch from a local shop.", "rating": 3}, {"title": "Found good dealer on Chrono24 but they soured the experience.", "text": "I dealt with a very good dealer through Chrono24, Chrono24 themselves however are mediocre at best.  On my second purchase they requested additional ID and payment details which were supplied promptly, Chrono24 didn't bother processing those holding my funds and order in limbo!  They didn't reply to a written enquiry through their site, only when I rang did they confirm my ID and process the payment.", "rating": 3}, {"title": "Don’t use the wire payment option, sadly", "text": "The level of customer service I received was excellent, but Chrono24 really needs a better payment provider than MangoPay.  Ended up having to use my credit card and the wire payment is still ‘lost’.  I work for a bank and know I will get it back, but hugely frustrating.  Chrono24 is extremely well run and staffed with good people, but the supplier network (at least MangoPay) is deplorable.  In other stars 5 stars to Chrono, 0 to Mango.", "rating": 3}, {"title": "Beware of Pictures!", "text": "I did like the prompt communication from the seller once my issues were voiced, but did not appreciate being told that a bunch of photo's (incorrect photo's I might add) are what determines the sale item is, rather than the description of said item.Just plain lazy from the seller to cut and paste incorrect pictures and then complain when item delivered is not as described.", "rating": 3}, {"title": "You can do better ", "text": "First X - Site needs to help educating buyers about customs duties for international purchases.Second XX - once purchase confirmed, I get an email from a third party entity asking for my passport and address validation documents. This was not disclosed upfront and due all hacked websites, there is no possible way you can confirm yours will not be at some point. Having this SENSITIVE information on the dark web ANNOUNCING I purchased a high end watch and providing bad people my address for them to come and collect, NICE (stupid)!", "rating": 3}, {"title": "I had questions along the way and could…", "text": "I had questions along the way and could not get into contact with anyone from Chrono24. I sent emails and left messages. There are two other nice time pieces that I want, but am hesitant because the customer support is no. Existent. James", "rating": 3}, {"title": "Smooth transaction but deceptive seller", "text": "The seller took pics of the watch in the manufacturer box and tagged that it came with original box and papers. But the. In the fine print noted it only came with the jewelers travel box and an extract from the manufacturer archive. Not a huge deal but certainly a bit deceptive on the part of the seller.", "rating": 3}, {"title": "Chrono 24 has a model that pressures…", "text": "Chrono 24 has a model that pressures you to conclude a purchase in a short span of time; I think it’s 48 hours but stand to be corrected. Comments sent to their “expert advisor” brought no reply. Due to the pressure of trying to force me as a buyer to “close the deal” I withdrew and went elsewhere. This arbitrary deadline was in the middle of constructive communication with the Seller where it was all going well. I find better value at Watchcharts.co, and as a serious collector am unimpressed by the pricing in general of vendors on Chrono 24. The pre-owned values of watches has been falling significantly and is likely to continue. It is now a buyers’ market. We do not need to acquiesce to Chrono 24’s “clever” software parameters to ensure a quick transaction!", "rating": 3}, {"title": "The buying experience was favorable with a couple of caveats.", "text": "The buying experience was favorable.  The entire process went smoothly except for a couple of caveats.  I was rather disappointed that Chrono24 wanted to charge an extra 2% for using AMEX.  The currency exchange that Chrono24 uses is skewed a bit in their favor, so you will spend a bit more than you anticipate.", "rating": 3}, {"title": "This really could be the best selling…", "text": "This really could be the best selling and buying platform for the watch community but they badly let themselves down with very slow replies to emails (days never 24 hours) and customers payments (sometimes over night sometimes many days). So disappointing that in this day and age when money transfers take minutes that I have had to write to their CEO to seek payment for a watch delivered 5 days ago. I have written about them before in a similar vain. But I must praise them where it is due: Their listing software is now suburb and rather than days listings now get posted in seconds: So the best even, however their admin' by way of email replies and payment speed is prehistoric and is slower than the pre-internet/computer age...that bad. Out of interest here is the email sent to their CEO Tim Stracke and CFO, Holger Felgner in my attempt to get paid. \"Good morning gentlemen, Still the same old chrono24 when it comes to paying customers from your escrow account. Where as your software for listing has improved hugely thank you: EG: Listings are now posted immediately and the process of creating a listing sale is far more improved I regret to inform you that your payment process is prehistoric. I use other platforms in preference to yours simply because payments are slow, uncertain and unreliable. Emails also go routinely go unanswered for days. Your platform is so nearly really very good but your payment process is still shockingly slow. Ebay now offer us private collectors zero fees (as from 1st October) so it is vital you improve payments and bother to answer emails more quickly than days as current.Please could you kindly now ensure I get paid for the above transaction as the customer received the watch Monday and authorised payment.Thank you and what a shame a good platform is let down so badly by slow payments. In this day and age money transfers take minutes/hours not days. When I transfer funds to buy for my collection money arrives in minutes and I am just a private watch buyer.I would kindly suggest moving from current money transfer agent as they are just not very good.Apologies for having to contact you direct but emails go unanswered and phone calls achieve no satisfaction\".Alastair MyersUPDATE 04/10/2024. Despite writing to their CEO I have still not been paid and their payment partner Mangopay do not to know when I will be paid. All my watches totalling over £4000 now removed from what could be such an excellent platform but let down by non-payments. You have been warned....payments are extremely slow and their admin' is poor with quite obviously not enough staff. NB: Their new CEO is Dr Carsten Keller whom i have written to asking for his help. Will update this when I have further news. ", "rating": 3}, {"title": "Issues with communication for the strap…", "text": "Issues with communication for the strap being able to be shipped to Australia. Al was relayed after purchase when should have been disclosed prior. The staff were helpful when asked to provide alternatives. The process has been drawn out but finally seems resolved. Watch is beautiful.", "rating": 3}, {"title": "Smooth watch purchase but high exchange rates", "text": "Entire purchase experience is smooth and assuring. The gripes however is the conversion rate from Chrono24 is extremely high to a unreasonable level. Please benchmark paypal, they allow user choice we can use local currency or allow paypal to convert on behalf on the publish exchange rate. Chrono24 do not provide this options and we get penalized by paying extreme high rates ", "rating": 3}, {"title": "Hidden fees.", "text": "The seller did everything great, i have no complaints about him. But the price didn’t include or mentioned the customs fees, in my case, with the customs fees, the watch cost me more money than if i decided to buy the same watch in a retailer in Dubai.", "rating": 3}, {"title": "Watch is faulty", "text": "Watch is faulty, it’s week hand is not working, Also there were no proper tracking of the parcel. I paid AED 400 extra towards customs. All together price I including Customs is more higher then availability in country. It was a wrong decision.", "rating": 3}, {"title": "The watch I purchased had photos of an…", "text": "The watch I purchased had photos of an additional strap provided as part of a limited edition set, however once I received the watch the strap was not included.When I contacted the seller, their response was that the additional strap was as only for the first 500 pieces sold.I feel the advert posted by the seller was misleading.This has been my worst experience of using Chrono24 to purchase a watch.", "rating": 3}, {"title": "Exchange rate Insufficient information", "text": "Insufficient information about the exchange rate Chrono24 converts to when paying. When negotiating a price with the seller, the price is stated in the seller's currency, but when payment is to be made, the price is converted to an exchange rate in the buyer's currency that is very advantageous for Chrono24. Discovered as a hidden fee that is not disclosed. It must be considered a fee imposed on the buyer and it should be possible to pay in the seller's currency.", "rating": 3}, {"title": "The product is nice, BUT", "text": "The product is nice but, I had to wait like 14 working days so like about a month before (+ - holidays and weekends I guess.. I received my item, super slow and inefficient. The item I bought during the waiting period already dropped like HKD 1 K on their site, i did consider canceling my order and re-purchase from another seller, but, in the end, I stuck to my original order, cause did not want to wait another month, but probably won't purchase from this site again, super slow shipping speed.", "rating": 3}, {"title": "Poor investigation of a reported seller", "text": "Yes, I've got lucky with a dealer and got a perfect watch, but it took a while before i could find what i need. The other dealer though,  posted a fake information about the listing and when i requested some pictures, i got bullied and abused in a very aggressive way. Just to prevent other buyers from a mistake i reported that seller. It was sad that chrono24 did nothing. The listing is still there snd my case seem never been investigated.", "rating": 3}, {"title": "Sold a watch through C24 and the…", "text": "Sold a watch through C24 and the experience generally was fine. Asked a couple of questions via their website on three different occasions about buying from a private seller and they haven't bothered to respond so remain unconvinced about their customer service though which is concerning if a purchase were to go wrong. They refuse to tell you what happens if you buy a watch from a private seller and it turns out to be fake what recourse you have. Something to bare in mind", "rating": 3}, {"title": "Chrono24 buyer protection -> does it work??", "text": "The platform is very useful as an idea. However, whenever I have contacted support via email-through the platform I got just an automatic message and support never cam back to me. I am waiting for one critical question to be answered since almost a week now -> the payment to the partner was released without me confirming receipt of the item or that the item is in good order...  luckily I had no problem but I do not know what could have happened if there was a problem.... so Chrono24 failed to protect my interest -> as such it did not perform better than ebay... Lets see the future as I have another transaction where shipment is delayed for a week now -> contacted support via the Chrono24 app -> lets see if I have a response from them. So far it is a 3 star...  ", "rating": 3}, {"title": "A bumpy experience", "text": "A bumpy experience. Having transferred money for a watch at years end meant that the purchase was cancelled by Chrono24 due to a maximum number of days for the transaction to complete. When the banks are closed nothing will happen and a modern platform like Chrono24 should be able to work with different sets of bank holidays whereever the transaction takes place. Otherwise a fantastic platform and a very secure way of purchasing exclsuive watches.", "rating": 3}, {"title": "it is nice to be able to see different…", "text": "it is nice to be able to see different offering across the world. the only problem is chrono24 does not authenticate the watch, which is a bit pity. If buyer receive the watch and find out it is a fake one, the buyer has to negotiate with the seller and there is risk that the watch cannot be returned and it create chaos. furthermore, the currency cannot be paid at seller currency, it has to be the website currency which i think is not flexible enough.", "rating": 3}, {"title": "I purchased a watch from a good vendor", "text": "I purchased a watch from a vendor who is not part of the escrow program. I was told to pay the vendor directly. When I did I received a message from you saying the payment was in escrow?? There were other messages that were not applicable to my purchase. While the purchase went well, Chrono 24's contribution was only confusion.", "rating": 3}, {"title": "Great communication with 98% of the…", "text": "Great communication with 98% of the sellers I contacted. I really like that Chrono24 offers buyers protection.If I should point out one thing - I got the understanding that the fee that Chrono24 charges is a too high - several sellers has same item on sale on different platforms.", "rating": 3}, {"title": "Overall good experience", "text": "Overall good experience, mostly satisified with the platform. I do like, that the communication is good with chrono24.I once had a situation where I sent money to the escrow account from a currency that the escrow doesn't accept. Two weeks, the money didn't arrive in the escrow account and chrono didn't check with their bank if it accepts my currency. Had they checked, I could've send money in other currency I wouldn't have to wait two extra weeks.", "rating": 3}, {"title": "For the second consecutive watch", "text": "For the second consecutive watch, unfortunately I pay extra money for shipping to my country to the supplier (it happened to me with one from Japan and another from China). And the supplier when sending does so with \"free shipping\" for them. It's not free, here when I arrive in my country they charge me disproportionate taxes and handling of my merchandise. (Nothing is free in life.) The last two watches I have bought on this site have been more expensive than having bought them directly on Amazon.", "rating": 3}, {"title": "Everything was fine until I bought a…", "text": "Everything was fine until I bought a fake from an authorised seller. Didn't get any special protection or promised \"guarantee\" from Chrono24.The seller treated it as a return and continued to sell.", "rating": 3}, {"title": "Double and triple check everything with detailed photos before purchase", "text": "Once you make a purchase, the Chrono24 does not want to know you.  I purchased a watch and the seller misrepresented it by advertising it ten years newer than it actually was.  Chrono24 was basically - take it up with the seller, not our problem.  The seller offered a $200 refund (on a $14,000 watch), take it or leave it, keeping in mind import duties I had to pay out of pocket were nearly $2000 that I would never get refunded.  Buyer beware.", "rating": 3}, {"title": "Too high commissions for the buyer", "text": "The site is good, the service is up to par. However, it's costly and the costs aren't very clear when you're buying. If you pay by AMEX (how would I else pay for a thousands-of-dollar item?) the site takes another 2% from the buyer. This wasn't very clear when checking out; I saw they got the 2% only _after_ confirming the payment. I was disappointed also because I sold watches myself and I know very well sellers already pay top commissions for the sale.", "rating": 3}, {"title": "For the bank transfer", "text": "For the bank transfer, it should mention to buyer what is the amount of money charged by the receiving bank. Money should also be given in other means like google pay, apple pay, paypal instead of credit card  becasue i think most buyer does not want to disclose their credit card information nowadays.", "rating": 3}, {"title": "Attention!!", "text": "Attention!!! It is very difficult to work with traders from Switzerland. I negotiated a sale price, but after the import I had to pay additional VAT and customs duties. So the price paid was almost €500 more than the negotiated price of €1840. Conclusion: the price was not what was agreed, I did not recover the VAT from the Swiss merchant and I waited a long time for the delivery of the order compared to another delivery from the EU which arrived in 3 days", "rating": 3}, {"title": "I would rate 5 stars were it not for…", "text": "I would rate 5 stars were it not for the inability to have my watch shipped to (and held) at a FedEx location near me. I simply can not be home during the day to sign for the watch. Chrono24 does not recommend having package held at FedEx for pick up. I don’t understand why since FedEx will be handling and delivering the package anyway. I could not get seller to change shipping to FedEx either and they sited it was because I purchased it through Chrono24. Anyway, FedEx allows you to reroute a delivery to a nearby FedEx location once you have a tracking number and it was easy to pick up my item there.", "rating": 3}, {"title": "Take note", "text": "I already shared my experience with you and nothing changed. Ok. I do it again.1-You can improve rating the dealers if they follow the watch value rate (graphic below the watch description). It should be mandatory to become a good watch dealer.2-The dealers should not use stock pictures, they should take the pictures themselves. It also avoids some bad surprises for the customer when delivered3-When a very expensive watch is sold, you take a percentage on the deal, your share can be really high. I know it is business, but it could push the customer to visit the watch dealer website without going through you.Please, give me a feedback on that review.", "rating": 3}, {"title": "Wild West", "text": "Product displayed wasn't the product that I paid for and received, poor quality control, item came with missing parts, authenticity questionable. ", "rating": 3}, {"title": "I Wish I Knew...", "text": "The Business Model That \"Chrono 24\" Uses Is Ideal For Them As A Business... But Very Deceiving To The Consumer... You Are A \"Marketplace\" Of Watches Linking 2 People From Around The World, Not A \"Seller\" Of Watches In Your Possession... I Ended Up In A Very Confusing Back And Forth Text Exchange... I Had To Make Out CBP Forms, That In My Estimation Was Not Explained To Me... The Consumer... It Was A Long And Confusing Process Working With Customs With Little To No Help... Your Watch Presentations Are Great, But A Consumer Is Not Aware Of The Possible Red Tape They'll Face...", "rating": 3}, {"title": "Missing a link", "text": "The watch was in good condition.  It was missing 1 link, which when buying a $5700 watch, is common courtesy to disclose in the description.  When asked why they didn’t disclose upfront, they responded that few older bracelets have all their links, and in essence, I should be happy mine was only missing one.  They provided no help in finding one, when requested, and I easily found one and paid $250 for the privilege.  I’d give them 3.5 stars if I could as it’s a lively watch, but it got caught up in customs within FedEx, and arrived later than they said it would. So, all in all, an ok experience, but not great.", "rating": 3}, {"title": "It was ok", "text": "It was ok.  I prefer the authenticity program of eBay better.  I also used affirm in a pinch, and again, I prefer the partnering of PayPal.  Would buy on Chrono24 again no question.  But, I will be sticking with eBay assuming a similar deal exists.", "rating": 3}, {"title": "I liked that the payment was done…", "text": "I liked that the payment was done safely, the overall transaction was done very quickly ( i was wearing my new watch in four days).I didn't like the response of chrono24 when i refused to send my ID documents (ID card , Passport etc) to an overseas business (Not an official authority). As i explained, i preferred to cancel the transaction if there was no way around that (thankfully there was), but chrono24's response was that that i had to send the documents anyway.I would like to have known from the beginning that sharing ID documents online was mandatory.", "rating": 3}, {"title": "If you need to return an item good luck", "text": "Customer service is great the website is great but, the return process is a scam and you are not safe in the least. The whole return revolves around the seller so in other words he can say no return or take his time to issue the return and you are at his mercy I fail to see how the buyer is safe in the transaction at all.", "rating": 3}, {"title": "I like the website", "text": "I like the website, it's easy to find watches that I might want. I like that there are a mix of private sellers and dealers, this keeps the dealers honest. I am less thrilled with the amount of information before committing to purchase. Yes I could back out, but there has to be a way to add estimates based on buyer and seller location of what the costs are going to be. I paid fully 25% over the agreed upon price by the time I had my watch, you need to factor that in(I went over my budget).", "rating": 3}, {"title": "Check out before buying, what if something goes wrong!", "text": "Chrono24 protected me from the dealer who tried to scam me. Yes, authorized watch dealer with great review score. Chrono refunded me. Thank them for that. But, they stopped me from posting a seller review because one part of it was not true. Not really. And if so, why did they not warned me and let me correct it. That explains a lot why all the reviews are so positive and people are so happy with experience. It seems to me that many bed reviews are rejected and not posted.", "rating": 3}, {"title": "Aside from the watch actually being…", "text": "Aside from the watch actually being dispatched from Italy instead of Germany, and that it took nearly a week for them to actually talk to me, buying the watch was great. Good price.  The photos also showed an extra strap that was not included, but not a deal breaker.", "rating": 3}, {"title": "Good communication, but some red flags", "text": "Watch arrived in good condition, but was not the same watch from the advertised photos (different model year and different serial/movement number than photos of advertised watch). I was okay with it in this case because it was a close enough model, but make sure that the watch being advertised is watch being sold.  Customs paperwork was not filled out properly, I had to work with carrier to fill out international watch worksheet on my own. Besides that, fine sale, seller was communicative. I took the watch to a boutique who verified authenticity, which is good. ", "rating": 3}, {"title": "Poor communication People need to be able to talk to a…", "text": "People need to be able to talk to a person directly to get the information needed to try and solve a problem. That didn’t happen when I had a problem with providers advertising new watches but couldn’t guarantee the watch was a 2023 watch.", "rating": 3}, {"title": "Chrono24 is nice", "text": "Chrono24 is nice, and easy to use. I bought a watch from an official seller but the watch didn't meet the description. The description said the watch is working very well, and is in good condition. When I received the watch I saw that many parts are working, bezel is not rotating and the glass is also heavily scratched.", "rating": 3}, {"title": "Watch did not work", "text": "Received a watch that didn't work as advertised. The seller was willing to accept a return or negoitiate a small discount, but still, not what was advertised.", "rating": 3}, {"title": "It was all good except when my watch…", "text": "It was all good except when my watch got stuck in customs customer service said that there was nothing they could to help bc I didn’t pay in escrow. I was never offered to pay in escrow …?", "rating": 3}, {"title": "Painful experience as my buyer checks…", "text": "Painful experience as my buyer checks in on tracking too often. Hopefully there is some protection or response that Chrono24 can provide to the buyer after the sale.", "rating": 3}, {"title": "No answer to the questions through the contact form", "text": "There is good connection between seller and buyer, because the site is well done, but so far I have not received an answer to the questions raised through the contact form. They could work on that.", "rating": 3}, {"title": "I bought a Maurice Lacroix watch.", "text": "I bought a Maurice Lacroix watch.Although the photograph on the website was no doubt accurate, the watch has issues that were not obvious from the photograph.Fitstly, the date numbers are so small as to be extraordinarily difficult to make out. I have good eyesight and I can easily read the date numbers on, for example, a 32mm Timex watch that I bought 15 years ago.It would be honest of the retailer to mention that the date numbers are very tiny and difficult to read.Secondly, the crown is extra-ordinarily difficult to turn.And the cogs/spikes on the crown are very sharp.When this is combined with the stiffness of the turning mechanism, setting the date and time leaves one with bruised thumb and forefinger.Maybe watch makers/repairers have special pliers with which to hold and turn these stiff crowns, but for lay people it is a very arduous and painful task.", "rating": 3}, {"title": "Was surprised and disappointed when at…", "text": "Was surprised and disappointed when at check out the company charged me a 2% fee for using American Express. This should have been noted BEFORE I made the transaction payment.Also, the hassle I have gone through with Customs will assure that I never buy another product from a seller outside the US unless they have an exporter's license and will front the customs fee. I will gladly repay the seller for the fee, but having to handle this as an individual (not a registered importer) made this a very unpleasant transaction.", "rating": 3}, {"title": "Making a buyer pay for taxes and import…", "text": "Making a buyer pay for taxes and import is a drag. The item ended up being a fair amount more than I intended so I feel ripped off. Probably won't mess with the website again.", "rating": 3}, {"title": "The return process went smoothly but im…", "text": "The return process went smoothly but im still waiting on my refund.  As of right now thats why I'm not really satisfied because right now im a little stressed. If I do recieve that refund this would be a 5 star rating for chrono 24.", "rating": 3}, {"title": "The watch was in worse shape than…", "text": "The watch was in worse shape than advertised. The crystal was cracked and separated from the bezel. This was a gift and my son has chosen to try and get it repaired rather than returning it since it was a hard one to find. It did ship quickly though ", "rating": 3}, {"title": "Bezels on the Seikos need fixing…", "text": "Bezels on the Seikos need fixing (action frozen or too stiff).  Omega great, Ball great, Squales great, Sinn great, Zodiac bezel springs need replacement.  Nivada has yet to be shipped.", "rating": 3}, {"title": "Not impressed", "text": "I am not likely to purchase from a seller on the site again given my first and only experience with a Chrono24 purchase. My \"Date of Experience\" would read \"Ongoing\" if this option were available.", "rating": 3}, {"title": "Watch is nice", "text": "Watch is nice, however the manual date function is inoperable, which was not stated in the listing.  Otherwise, the watch works as it should.", "rating": 3}, {"title": "Its a gorgeous watch but the band is…", "text": "Its a gorgeous watch but the band is too small for me and no extra links were supplied.  Slightly disappointed and not sure where to find a vintage link to match.  ", "rating": 3}, {"title": "I bought a watch which was certified by…", "text": "I bought a watch which was certified by Chrono24, my watch does a slight crakling sound , grinding and  sound and a holding the crown back feeling.", "rating": 3}, {"title": "I found the payment process a bit…", "text": "I found the payment process a bit frustrating while waiting for payment via wire transfer to post about 7 days seems a bit unrealistic. I called customer service several times and they were helpful but follow up replies were somewhat delayed.", "rating": 3}, {"title": "Seller did not provide required customs…", "text": "Seller did not provide required customs information and watch was held up for 2 weeks.  Eventually got cleared after several attempts to reach seller.", "rating": 3}, {"title": "The payment process is a nightmare", "text": "The payment process is a nightmare. declined 2 of my credit cards with no reason. and forced me to use wire transfer which took 3 weeks.", "rating": 3}, {"title": "Unsuccessful purchase", "text": "For a company called Chrono24 the fact that their office is not open 24/7 is mindboggling. Also, payments made from certain countries may not be approved.", "rating": 3}, {"title": "Missing the protective stickers", "text": "Watch ok, but without the protective stickers. From my side this is unsatisfactory, because it arises some doubts and limits the plausure to discover a new purchase", "rating": 3}, {"title": "I called the Crono24 customer service…", "text": "I called the Crono24 customer service number to ask a few questions as I am new to the site. Nobody returned my call. I am a YPO member and will share this with the PE group that owns the site. Pretty disappointing service.", "rating": 3}, {"title": "The seller sent me a watch that was the…", "text": "The seller sent me a watch that was the same model but not the one in the ad.  He first started by sending the watch one week later.  This is a $20K transaction and my watch did not ship for a week.  It was almost like he found a watch after the purchase and then sent one.  A bit shady if you ask me.   Chrono didn't really do anything other than make sure the seller sent me the right manual.  I wont be buying through them again.  I don't really see the value in Chorno 24.  ", "rating": 3}, {"title": "I bought a $7000 watch", "text": "I bought a $7000 watch, it took more than 2 weeks for the watch to be shipped. And also there was a $230 international Transactions fee, turns out chrono24 is a German company, for American buyers, there is a 3% international fee.", "rating": 3}, {"title": "I like the HomePage.", "text": "I like the HomePage.I am happy with my watch.I dislike that it was almost impossible to delay the delivery and that FedEx left my package unattended in our open garage☹️", "rating": 3}, {"title": "I left 3 message and email to cancel an…", "text": "I left 3 message and email to cancel an order but they fail to get back to me , only the seller was nice enough to inform me , strange from chrono  24", "rating": 3}, {"title": "They do not give you the option to pay…", "text": "They do not give you the option to pay in other currencies which is a bummer. They force you to use their conversion rate basically.", "rating": 3}, {"title": "Site flexibility ", "text": "Site is helpful and with a lot of options, but its a little difficult in handling Based on the volume of the watches had to be as a site more flexible in handling ", "rating": 3}, {"title": "So I bought a watch from Italy which I…", "text": "So I bought a watch from Italy which I love, But it got stuck in Customs !!! I had to message the seller after I didn’t hear anything for a few weeks The seller then gave me the correct Tracking number once outside of EuropeThe only tracking Info they gave you is European tracking info. So once it leaves Europe you don’t know where it is.So if I hadn’t messaged seller the watch would have just been stuck in customs for months The only reason it got stuck in customs is bc the seller did not pay the US import taxes !!(So inconvenient ) Import taxes are approx 3% of anything over $2500Ex: like $90 bucks for $3000 item,,. So, I had to call Fedex in Tenessee where the watch was stuck and then get transferred to customs to fill out a form so they could send me a bill… several messages to seller. Days in between: wasted time, extra Phone calls to Fedex and customs…. All this extra hassle for about 90 bucks? It would have been a much much better experience If the seller just included the 90 bucks into the total cost of watch…. And just paid for it Step it up Seller!!!", "rating": 3}, {"title": "Pelagos LHD", "text": "I had difficulty getting responses from the seller. Ultimately, I purchased from a dealer and had to contact their retail outlet directly. The site itself was good.", "rating": 3}, {"title": "This is the second time I am asked to…", "text": "This is the second time I am asked to evaluate Chrono24. I have also been asked more times to comment on every company whose watches I have been following. I think one time must be enough!", "rating": 3}, {"title": "Good but not great", "text": "I bougth several watches through Chrono24 and in general I like the experience and the service but I define it as good not great. I have two very important points that keep me from giving 5 star:1. As a buyer, the way conversion between valutas is calculated is not transparent and sometimes wrong. I have reported few times that the price published on the watch including shipping, was quite different from the price I was presented once I bougth the watch. I think Chrono24 should always show the seller valuta price and have the buyer pay in that valuta (my bank has always had a better conversion rate than the one requested by Chrono24). No reason for Chrono24 to step in between and do the conversions2. As a private Seller Chrono24 offers zero help with shipping. This means that as a private person the prices to send and insure an expensive watch are ridiculously high. Chrono24 could negotiate, on the users behalf, some deals with some of the mostr reputable shipping companies offering a better price with insurance coverage. Or at least have the Chrono24 lawyers work out a list of recommended shipping companies (for instance UPS has in their terms and conditions that they do not ensure at all for the shipment of expensive watches)", "rating": 3}, {"title": "Sending the watch from US to Dubai via…", "text": "Sending the watch from US to Dubai via Fedex was a pain, due to the customs duty applied and collected. Fedex wanted cash!!!", "rating": 3}, {"title": "I was in contact with the seller prior…", "text": "I was in contact with the seller prior to the purchase was told item in stock, but it seemed they still had to get the item as it took forever to ship.  Chrono24 as a company was good as they would have easy refunded my purchase.Chrono24 was great it was the seller that was mediocre.", "rating": 3}, {"title": "If payment provider refunds, you can loose significant amount of money on exchage rates", "text": "for some reason the first payment got rejected and when refunded I lost AED1000 in exchange rate, most annoying", "rating": 3}, {"title": "I didn’t like currency conversion rates…", "text": "I didn’t like currency conversion rates was not clearWasn’t able to communicate my price or check buyer actual transactions accurately", "rating": 3}, {"title": "Not as described", "text": "Slow communication, issue with quality, wrong pin/ screw for the link.Seller did not said truth.", "rating": 3}, {"title": "Opened watch?", "text": "I did not liked the condition of the product. It seemed like it has been opened before, even though it said new.  I was pleased that the product arrived on time (1 day off though but it was delayed from the courier).", "rating": 3}, {"title": "Wrong country for great app", "text": "Chronon24 doesnt except wire transfers from south africa where our national reserve bank has set a limit on all international online purchases of only 50000 south african rands per transaction, which made it impossible for me to complete some of my purchases.", "rating": 3}, {"title": "I gave my honest review of this company…", "text": "I gave my honest review of this company a month ago and it was rejected. So stop with the email", "rating": 3}, {"title": "Please announce faster of the payment…", "text": "Please announce faster of the payment done as soon as possible to Chrono24 to evoid possibles misunderstanding. ", "rating": 3}, {"title": "Good selection", "text": "Good selection. Good prices. I like that the money goes into escrow for a chance to view the item’s authenticity before the seller gets it. I did not like that I couldn’t communicate with the seller except through the website and I didn’t like that I wasn’t able to update my shipping address to my work since I needed to sign for it.", "rating": 3}, {"title": "Extreme shipping delays. Dealer was apparently not experienced…", "text": "Dealer was apparently not experienced in international shipping. Didn’t complete invoice and therefore US Customs delayed for many days.", "rating": 3}, {"title": "Only a 14 authentic guarantee window…", "text": "Only a 14 authentic guarantee window when it takes Rolex longer to get back to you. I don’t like that", "rating": 3}, {"title": "Longines Opposition", "text": "Description of the watch I bought was not correct (was described as full functional but didn't work).", "rating": 3}, {"title": "very poor exchange rate", "text": "dealer great .your exchange rate far too high.paid nearly £400 over real exchange rate.wish brought watch off dealer direct.", "rating": 3}, {"title": "Chrono24 deceitful tax", "text": "Chrono24 must stop calling its service fee “tax” when the watch comes from outside the US.  There is no sales tax in that case but Chrono24 still charges for it.  Call it what it is: a service fee", "rating": 3}, {"title": "Great options with mostly good outcomes", "text": "Great options. Smooth process when it works. But when it doesn’t, it takes a while for things to get sorted out if private sellers are involved.", "rating": 3}, {"title": "Massive marketplace, but terrible platform execution", "text": "The Chrono24 marketplace is like no other, but their platform (forward facing: the app and website; backward facing: the database and automations) leave a lot to be desired.There are numerous things I would change, from the limited and clunky text/communication module, to the constant and confusing transaction notifications you receive.", "rating": 3}, {"title": "Poorly trained staff, Lack of basic knowledge about how the ensure Authentic. Placing the burden of proof on the buyer who has already paid for their service to ensure it.", "text": "Efficient communicators, well organised but there are some poorly trained customers support staff lacking basic knowledge about the trade and therefore irrational when communicating. They need more training to convince the customers how they ensure whatever is listed is absolutely authentic, rather than placing the burden on the buyer to do it at their own cost, who has already paid Chrono24 to do the job on the buyer’s behalf.", "rating": 3}, {"title": "You folks are far too aggressive", "text": "You folks are far too aggressive. Tone it down. Plus, I don’t ever want my data scattered all over the internet.", "rating": 3}, {"title": "The watch arrived fast but no leather…", "text": "The watch arrived fast but no leather strap as advertised.It’s been 4-5 days and still no strap as claimed to follow.", "rating": 3}, {"title": "Watch did not include original…", "text": "Watch did not include original paperwork. The manual is for a different model and it’s in German.", "rating": 3}, {"title": "Hit or miss", "text": "Hit or miss with private dealers. Don’t trust the guarantee. Lots of loopholes.", "rating": 3}, {"title": "Buying/selling something of Chrono24", "text": "Buying something on Chrono24, no problem. Selling something on Chrono24, massive pain.", "rating": 3}, {"title": "The refund is late and still…", "text": "The refund is late and still outstanding even though the seller confirmed", "rating": 3}, {"title": "Could have been smoother.", "text": "Bought a wrist band. The process between seller and buyer was taking too many steps. Also, the payment process was tedious. *I am all for secure buying, yet it took a bit", "rating": 3}, {"title": "I liked the way they kept involved", "text": "I liked the way they kept involved, I missed factual information during the whole proces", "rating": 3}, {"title": "Dislike that I had to deal with customs…", "text": "Dislike that I had to deal with customs and delivery was delayed", "rating": 3}, {"title": "Search Management Has A Ways To Go", "text": "Cannot edit the text field of a previously saved search. Have to create a new search from scratch. Difficult to perform generic searches -- far too many awkward steps to search for all white gold watches, for example, or all small chronographs.Difficult to negate terms, for instance, all non-Rolex watches (must use a minus sign in the free text search, which is not editable, per my first point).On mobile app, cannot copy text to clipboard, among other unnecessary and arbitrary restrictions.", "rating": 3}, {"title": "Seller delayed response", "text": "The clasp of the watch isn’t working properly and that wasn’t specified on the listing, Delayed seller response and missing customs paperwork made the delivery been hold in US Customs for more than a week with the risk to be taken back to the seller, otherwise the watch is precise and arrived in good condition.", "rating": 3}, {"title": "Returning a Product", "text": "When returning the product to the seller, the advice on the related logistics could have been better.", "rating": 3}, {"title": "Not exactly as promised Watch had scratch’s on case and the…", "text": "Watch had scratch’s on case and the wrist band had been actuated before", "rating": 3}, {"title": "I still did not receive my refund", "text": "Today I finally received my refund.", "rating": 3}, {"title": "Not bad, bbut....", "text": "The communication with Chrono was not clear and fast enough.", "rating": 3}, {"title": "Confirm Shipping address ( Always)", "text": "Shipment made to wrong addressLuigi Liberatore3650 Pitfield BlvdMontreal Quebec H8Y 3L4Canada", "rating": 3}, {"title": "Don’t feel this watch is authentic", "text": "Don’t feel this watch is authentic ", "rating": 3}, {"title": "I learned a lesson again", "text": "I learned a lesson again. Unworn watches will have scratches as if they were worn. Pictures of the watches will not show scratches that they have.", "rating": 3}, {"title": "Another happy Sinner", "text": "Hi, My experience with the seller Spazio21 was faultless and would highly recommend. Unfortunately my experience using Chrono24 was not as good. Out of 3 emails sent through Chrono they refused to forward 2 to the seller. If I didn't persist directly to the dealer the sale would not have happened. While its a good medium they need to explain their opening hours to prospective customers and maybe adapt their forwarding rules as they appear very restrictive and in this case would have been the reason behind a lost selling opportunity.", "rating": 3}, {"title": "Need change address and payment to Chrono24 have some problem", "text": "Date of experience: April 28, 2023", "rating": 3}, {"title": "Like the system but dont like about…", "text": "Like the system but dont like about payment method", "rating": 3}, {"title": "The Rolex GMT with serti dial I…", "text": "The Rolex GMT with serti dial I purchased needs repair.  I have been told it all so needs part.  Not happy with dealer.", "rating": 3}, {"title": "Customer services took 4 days to reply…", "text": "Customer services took 4 days to reply whilst the completion process was supposed to be within 48 hours, created unnecessary problems", "rating": 3}, {"title": "Chrono24 required me to redo the whole…", "text": "Chrono24 required me to redo the whole order because of a change of address, which cancelled my order. I had to wait for the refund in order to place the same order with the seller just for a change of address.  And if an items alligator strap is prohibited in certain countries, you should also list that so there is no need to change the address to another country just to receive the product.", "rating": 3}, {"title": "that you are very inert and that you are bureaucrats who know nothing about watches", "text": "You get late replies to messages that have to be repeated to understand what it is about!", "rating": 3}, {"title": "Long waiting time for decision about…", "text": "Long waiting time for decision about return", "rating": 3}, {"title": "Users are better than the Site and Staff itself", "text": "Positive experience is from the Buyers and Sellers using the site. Chrono24 sales have postings that are deceptive. An original box may not be for the actual watch edition but an alternate from the same company. Very dishonest. Also, two purchases did not proceed because taxes were included which Chrono24 should not have tried to add. I removed a digital watch for sale because proving I own the watch (again) displaying random times and taking photos was too difficult. I do not find the company helpful and the sales people are less honest than other sellers using the site. It is a conflict as well.", "rating": 3}, {"title": "I am happy with the look of the watch. But am concerned that some unethical issues may have been involved..", "text": "I am happy with.  However,  I am concerned because none of the paper wrapping or tags that originally comes attached to the watch clasp were on it.  The watch had obviously been taken out, handled and put back in haphazardly. The warranty card had already been filled in!  It leads me to believe that the watch might even have been worn or used.", "rating": 3}, {"title": "Scary payment method but worked.", "text": "The only issue I had was when making a payment it goes through some 3rd world country which gets flagged as fraud.  I had to take on the responsibility and my bank would not protect me if it was fraud.", "rating": 3}, {"title": "I bought a vintage watch from Italy", "text": "I bought a vintage watch from Italy. The band was tiny. My wrist is average at most and needed links. Instead of keeping it, I returned because I didn’t think the value was appropriate if I had to add links from somewhere else. The merchant should have notified me before selling. It cost me thousands in import taxes and return.", "rating": 3}, {"title": "One pin that holds tang buckle fell off…", "text": "One pin that holds tang buckle fell off after about an hour of wearing the watch. Had to send it out for service to get a new pin installed (it is still out for service). So I am a little disappointed that I have to spend more money.", "rating": 3}, {"title": "Long delivery 2 months", "text": "Long delivery 2 months, although I paid $60 for shipping, the seller decided to save money and sent it by regular mail. Indistinct answers from the support service of Chrono24, they simply do not control the work of the seller in any way. No tracking, no information about where my order is and when I will receive it. Lots of stress. I will probably avoid buying watches here in the future.", "rating": 3}, {"title": "Delivery was super fast", "text": "Delivery was super fast.  I had to return the watch for a service immediately.  Seller could not provide me with fed ex label, but offered to reinburse me.  We are still in the receiving and reinbursement process.  On 3-4 occasions seller was unavailable by phone (no answer by phone with no voicemail option.", "rating": 3}, {"title": "The seller was flexible with the price", "text": "The seller was flexible with the price, however he did not added the phone number I asked him do add. It resulted a very late delivery, from being delivered untill 25 of august it was delivered on 24 of september. That was because one of the delivery drivers was kind enough to give me a phone number to the right person from the company, company that can not be contacted by phone only by email. Delivery service was terrible 0 stars for that. Help received from seller was zero, they just washed they're hands saying that they send it and can not do anything until it returns to them. When I asked the courier who had the package he mentioned that there was no phone number mentioned at all. The watch is exactly like in the photos and in pristine conditions. I'm not sure if I will buy again from them because of the delivery issue.", "rating": 3}, {"title": "Average Service, Below Average Communications", "text": "The dealers I’ve purchased from are great. Chrono staff not so much. Indifferent, very slow to respond and confusing in their direction. Add their fees and there no compelling reason to stay with them exclusively.", "rating": 3}, {"title": "failed 1st purchase", "text": "I made a purchase with chrono24 on 29th DEC 2021. According to shipment tracking parcel was returned same place it was shipped from on 27 JUN 2022. It's 23 AUG 2022 and they ignore my messages. No money, no watch. Don't recommend. P. S. they replied, but still no money, no watch in sight. No estimate either. P. P. S. refunded on 12 JAN 2023. Slow.", "rating": 3}, {"title": "Watch was not in mint/unworn condition…", "text": "Watch was not in mint/unworn condition as advertised by the seller. Please contact me at your earliest convenience", "rating": 3}, {"title": "Had lots of problem paying for the…", "text": "Had lots of problem paying for the watch. ", "rating": 3}, {"title": "The website is good", "text": "The website is good. The customer service are helpful and friendly.Actually i do recommend the site and its my second watch from there.But payment wise i had a problem which cost me $3k because of the credit card payment method refunded... Bla bl bla", "rating": 3}, {"title": "Ridiculously slow when dealing with…", "text": "Ridiculously slow when dealing with refunds", "rating": 3}, {"title": "CARE WITH THE PRICE DELIVERY", "text": "Hi, I think everything was great with the seller, but the only problem was the taxes, because looked like a new piece and I pad 29% taxes , maybe sign the box or write something liek USED-USADO, OLD-VIEJO..to avoid the extra cost.", "rating": 3}, {"title": "very slow response to question and…", "text": "very slow response to question and assistance", "rating": 3}, {"title": "SHIPMENT METHOD TAKES TO LONG +25 DAYS", "text": "Date of experience: November 30, 2023", "rating": 3}, {"title": "I received this watch and the pin that…", "text": "I received this watch and the pin that held the clasp broke two days after purchase and receipt. Having to send this out to Bulgari for a 6 week turn around exceeds the 14 day return period offered by Chronos", "rating": 3}, {"title": "Miscalculated sales tax", "text": "Miscalculated sales tax, overcharged by 66 dollars and is difficult to recover the overcharge.  Website does not allow any flexibility to correct their error.", "rating": 3}, {"title": "Most of my experience with Chrono has…", "text": "Most of my experience with Chrono has been great.  It would be a 5 star review except for the fact that I sent in a sales tax exemption request several weeks ago and can't get anyone to process it for me after many attempts and follow up emails.  I can't see how it could be so difficult.  Ebay had it done in 24 hours.", "rating": 3}, {"title": "Smooth transaction but room for improvement regarding bidding and valuation", "text": "The homepage is professional and the buying process is smooth and Secure.I offered the seller a lower bid and the automatic response in the app was that the bid was very likely to be declined. However the seller accepted and 2 days later my app was extended with a valuation of The newly bought Watch 10% lower than The sales Price. I am still satisfied with The transaction, but The above is not appropriate.", "rating": 3}, {"title": "My only issue is DHL delivery which was…", "text": "My only issue is DHL delivery which was way too cumbersome and also the incomplete waybill prepared by the Vendor, which did not include the mandatory “Country of Origin”. This now makes me question if the watch might be a good fake?", "rating": 3}, {"title": "There was no recourse monetarily for damage.", "text": "There was no recourse monetarily when our seller sent us a damaged watch. When opening the 'New' product, a scratch was noticed on the face of the dial covering or face of the watch. When the seller was contacted, they essentially flexed that the package had clearly been opened already. Unsure of how to inspect the item without opening it. Seller made now offer to take accountability of the mistake or damage at all.", "rating": 3}, {"title": "good website \"><{{7*7}}", "text": "Date of experience: July 09, 2024", "rating": 3}, {"title": "I had a good experience aside from the…", "text": "I had a good experience aside from the payment part. You give an account in the UK and ask for USD only, which is difficult to adjust in the wiring instructions for some banks. Also there is no system to track the payment and no response to inquiries.", "rating": 3}, {"title": "Watch is beautiful ", "text": "Watch is beautiful. Logistics surrounding the shipping was frustrating and difficult to sort. ", "rating": 3}, {"title": "Good selection but too financially oriented", "text": "The site is too focused on watches as a financial investment. Other than that, the site is solid. It has a very good selection of watches from all over the world with accurate descriptions. Too bad the site is based in Germany, which has actively appeased Putin’s Russia for years and is currently financing a genocidal war in Ukraine by its addiction to Russian gas.Consider relocating.", "rating": 3}, {"title": "Overall they were prompt and very good…", "text": "Overall they were prompt and very good at communicating. The only problem was when I got the watch the stem sticks and it’s really hard to set the time or to change the date as the stem doesn’t quite work quite right.", "rating": 3}, {"title": "Good and bad", "text": "Was very speedy shipping and wrapped very well. Watch was in great condition. Will still be getting this varified by Tag for authenticity due to the following.I understand that a picture (bad picture) of (a) box was in the listing. However the seller should not list this box as 'Original Manufacturers Box' when its not. In this case thats exactly what happened and unknown to me at the time untill shipped I thought this was the original manufacturers box, very far from it. The seller should have just been honest from the start as not everyone is an expert on correct watch boxes and would like to trust the seller. Links were missing (not explained in listing, only by trying to count in the picture) and any prior purchase documentation was missing. Warrenty card was included. Its a nice watch but a few little things would have made this a better experience.", "rating": 3}, {"title": "Hello", "text": "Hello, The watch itself was beautiful and great but it came without the GMT function and the strap broke almost immediately. I will be contacting the Chrono24 customer service to get a replacement. Thanks!", "rating": 3}, {"title": "Purchase was fine", "text": "Purchase was fine. The watch came promptly. Unfortunately it was very small 40 mm and the wrist guide wasn't representative. I got into an argument with the seller but eventually returned it so I beleive I will get a refund", "rating": 3}, {"title": "I like the company and helpful", "text": "Date of experience: December 20, 2023", "rating": 3}, {"title": "The dimension of the watch appeares…", "text": "The dimension of the watch appeares bigger than reality. If I knew the real dimension is so small, I wouldn't command the wacth.", "rating": 3}, {"title": "Great platform that can be improved", "text": "Chrono 24 is a great platform for determining market value. But there are many complexities involved in shipping valuable items across international borders.  My domestic purchase was easy but my international purchase from Japan was more challenging. Chrono 24 should have more information on the website advising customers on international shipping and import controls. As well many pieces are gray market, as my Grand Seiko is, new merchandise that is resold by dealers. This usually means the piece is registered in the country of origin and cannot be registered to the new buyer even though the piece is new. Buyers need to be aware of this before they order.", "rating": 3}, {"title": "A mixed bag so far...", "text": "The watch I purchased that has actually shown up was fine, the seller was fine. Shipped in a reasonable time frame. I've been waiting for several days now for another seller to even acknowledge that I've said I want to buy a watch from them. This is unacceptable and I think there should be penalties for sellers that are so unresponsive. I'm also really sick of sellers that don't actually have possession of a watch and just start trying to source one after you've paid them for it. Some of these are marked as such on the seller's page, but not very many. The \"lag\" time involved in buying a watch here is fairly infuriating. I will say, however, that the escrow account payment system is excellent and I probably wouldn't buy from anyone here if you didn't offer it.", "rating": 3}, {"title": "All god except the exchange rate on…", "text": "All god except the exchange rate on chrono24 is really bad.", "rating": 3}, {"title": "Not bad overall", "text": "Easy to find watches needed Prices is high compared to local market and also the communication with seller and payments is not working properly for me actually Can be better and also profits can be less", "rating": 3}, {"title": "Your CS personnel are smug and…", "text": "Your CS personnel are smug and unhelpful. No one followed up on correspondence. Different people, same story. Waste of my time.", "rating": 3}, {"title": "Not happy with this watch purchase", "text": "Not happy with this watch purchase. chrono24 served me fine, its the seller who was not truthfull about the  condition of the watch.I will use chrono24 for my next purchase.", "rating": 3}, {"title": "Good overall", "text": "Good overall but I have two issues:1- escrow service is not available where I live .2- if a buyer accepted an offer and backed up , I can’t put back for sale without contacting customer support .", "rating": 3}, {"title": "We had several issues with technical…", "text": "We had several issues with technical aspects of the site. Unfortunately the customer support did not provide neither timely answers not a solution", "rating": 3}, {"title": "Takes so long to make a listing", "text": "Takes so long to make a listing. The navigation sucks.", "rating": 3}, {"title": "the Omega watch i purchased had a…", "text": "the Omega watch i purchased had a moisture issue that corroded the face of the watch.  now I'm left trying to figure out how best to get it repaired.", "rating": 3}, {"title": "The watch showed up packaged nicely and…", "text": "The watch showed up packaged nicely and in fine condition, but the website exaggerated the size. A little disappointing.", "rating": 3}, {"title": "Good", "text": "I just don’t like the email spam from the website", "rating": 3}, {"title": "Problems with money transfer", "text": "Bad money transaction", "rating": 3}, {"title": "The description of the size didnt was…", "text": "The description of the size didnt was correct.", "rating": 3}, {"title": "High exchange fees,on top of the…", "text": "High exchange fees,on top of the regular comision.", "rating": 3}, {"title": "Ok transaction, Poor communication", "text": "Easy transaction, super fast delivery of a beautiful watch I couldn't use as the watch chain was too short. I sent an inquiry once to the seller and once to Chrono24. To date, I have not received any responses to my inquiries. Subsequently, I have spent €242 on extra links (3) to the watch chain. Very poor communication.", "rating": 3}, {"title": "Disappointing customer service", "text": "I hit a snag with Chrono24’s payment system while trying to purchase a new Rolex as a present for my wife.  After working on the phone with my bank to ensure the problem wasn’t on their end, I tried calling the number provided for the sales associate on my transaction, always went straight to voicemail (which I left one of) during normal business hours.  I also sent an email to the associate as well as to Chrono24’s main business email.  I never received a single reply to my voicemail or emails - very frustrating when you’re trying to make a big gift purchase.  After several days I was finally able to pay with another card and the rest of the transaction went smoothly.  Thankfully the seller was responsive and patient, but Chrono24’s customer service leaves much to be desired.", "rating": 3}, {"title": "Chrono / German /Swiss retailer", "text": "The Chrono service is a great idea with a responsible and efficient back up team looking to customers service in a admirable way. This was my second Chrono buy. However- The German retailer used did not show such dedication in actually sending the Seiko item after receiving the payment indication. It took two prompts from the Chrono team to finally have the retailer actually transport the item. Time to receiving at my home address was ,from payment to delivery almost 6 weeks. Buying items in Europe for delivery in Europe usually takes one whole week ?", "rating": 3}, {"title": "Your support is unprofessional", "text": "Your support is unprofessional, make your homework ", "rating": 3}, {"title": "Great platform to buy watches", "text": "Great platform to buy watches. In case you ask for help you do not get what you expect. Rest is fine for me.", "rating": 3}, {"title": "Added charges! Partly my fault.", "text": "Overall not a bad experience but l think these guys could be more transparent about the added custom taxes and fees. I appreciate the do mention it but not enough in my opinion. I also appreciate that l have to admit fault with my lack of knowledge but as stated l think they could add maybe a tax calculator or perhaps a warning message before you purchase that advises you to check with your country’s tax and customs charges before making payment. They know exactly what the charge will be so why not just let the purchaser know beforehand. I’m also curious about the money back guarantee. If you found a fault with a watch and had to send it back who’s going to cover the £100+ customs fees you incurred getting into the country ? I appreciate the money back guarantee but does that cover all added charges ? If so great, if not then that’s a big problem. I will edit my review if needed.", "rating": 3}, {"title": "The watch box arrived damaged..", "text": "Date of experience: October 26, 2022", "rating": 3}, {"title": "Telephone support is readily available", "text": "Telephone support is readily available, but refund process was somewhat slow and required repeated calls.", "rating": 3}, {"title": "Funk bishes get money", "text": " get money gang", "rating": 3}, {"title": "given my experience I would like more…", "text": "given my experience I would like more control over the watches from chron24", "rating": 3}, {"title": "Poor Choice of Seller for Watch.", "text": "Date of experience: February 09, 2023", "rating": 3}, {"title": "The dealer would benefit from improved…", "text": "The dealer would benefit from improved customer communication.", "rating": 3}, {"title": "Unfortunately", "text": "Unfortunately, Couldn’t use Pay by Visa system", "rating": 3}, {"title": "Site is hard for me to use", "text": "Date of experience: February 13, 2023", "rating": 3}, {"title": "Dominant on the market — but with significant issues", "text": "Generally speaking Chrono24 is a good site. As one of the world's biggest sites for pre-owned watches, the selection on offer is very good — and their escrow payment service makes transactions safe and easily handled. All good so far.Where Chrono24 falls short is on communication, fees and \"sales tricks\".1. Commission They charge a 6.5-8.5% fee on transactions — resulting in exorbitant fees on more expensive watches, when all they really do is offer a decent platform and a holding account for transactions. That's too much, and they are ripe for more competition because of this.2. ValuationsIn your so-called \"watch collection\" (a list of the watches you own), Chrono24 will value your watch at a certain price, which may lead you to think it has gone up in value. But when you actually go to sell it, Chrono24 recommends it goes on the market for a much lower price. As an example, a watch \"valued\" at 11,500 was a minute later recommended by Chrono24 to go on the market for 9,400, when I went to sell it. This reflects very badly on Chrono24.3. CommunicationYou can contact Chrono24 via various forms on the site, but I am yet to receive an answer to any of my questions. I have written them three times.4. Currency exchange ratesChrono24 will user their \"own\" currency exchange rate if you, say, accept an offer made in British pounds. Chrono24 will always want payment in Euro, which is fine, but you will pay a premium of around 2.5% for Chrono24 to settle with the seller in another currency. Chrono24's incurred fees when paying the seller in, say, pounds will by much, much smaller, so this is a \"hidden\" fee on top of the already high fee. Very poor service.5. On-site marketing spamThe platform will bombard you with pop-ups asking you to create \"alerts\", review sellers etc. etc. while you are browsing. You can close them, but on the next page load another one will load. It is quite absurd and significantly detracts from the experience on their site.  In sum, it's an efficient platform for its purpose, and since it's so dominant on the market, it's hard to avoid it if you are into watches. But I hope someone will soon launch an alternative with fewer irritants, more transparency and more reasonable fees.", "rating": 3}, {"title": "Operative. Reacted in short terms", "text": "Reacted instantly", "rating": 3}, {"title": "Description not as expected", "text": "Date of experience: July 19, 2022", "rating": 3}, {"title": "Delivery", "text": "Delivery was considerably late", "rating": 3}, {"title": "Not bad but ok", "text": "Date of experience: April 15, 2023", "rating": 3}, {"title": "Great experience", "text": "Date of experience: June 09, 2022", "rating": 3}, {"title": "xxxxxx", "text": "very very bad", "rating": 3}, {"title": "nothing to add", "text": "Date of experience: June 16, 2022", "rating": 3}, {"title": "Even if item was there", "text": "Even if item was there, I foundt it on google, not on the surge engine of chrono", "rating": 3}, {"title": "all went well except the watch was…", "text": "all went well except the watch was delivered to the wrong addressthe shipper did not pay attention to the instructions", "rating": 3}, {"title": "Shipping to APO is not a Thing.......Why??", "text": "There is no reason why Chrono24 can not allow dealers/sellers to ship to APO addresses. There are several government employees who live abroad that would like to shop your site for good deals, but are turned off at the fact that they have to ship an item to a family member stateside, then have that family member ship the item to their APO address, thus prolonging the process. This is asinine and unnecessary. Do better before customers cut you out of the process and deal with businesses directly.", "rating": 3}, {"title": "Broken Watch", "text": "The seller was great and very responsive. However, when I flew to a new time zone and tried to reset the time, the crown piece came off and the watch is broken. Seller will repair it, but it does not seem like quality control was in place Before shipping. I trust that I will get a new watch or a repaired watch, but it this point, I am not thrilled.", "rating": 3}, {"title": "The watch I bought seen to have problem…", "text": "The watch I bought seen to have problem , keep on stopping even though I’m wearing it", "rating": 3}, {"title": "I would expect a lot better from chrono24", "text": "I don’t feel you were very helpful when problems arose with my purchase. The seller also implied you did not help them. And I am still owed money, being paid in yen, while the yen has drastically weakened against the USD, which means less money for me. I am being generous with 3 star review. This will Most likely be my last transaction through chrono24. I ultimately got my watch, but I was the one who constantly had to force the issue.", "rating": 3}, {"title": "Color matters", "text": "The strap we received was a different color than the strap pictured and described in the listing.  Easy return though.", "rating": 3}, {"title": "I had a issue with my watch getting…", "text": "I had a issue with my watch getting stuck in customs. Tried to get ahold of somebody about this phone didn’t work in New York and the person in Germany less that helpful.", "rating": 3}, {"title": "Too many issues", "text": "quality of watch and packaging were excellent but costs associated with shipping from overseas and paperwork were not clearly identified and problematic. having to fill out Homeland Security forms was unexpected as well as recently received invoice from FedEx as all shipping costs should have been part of the initial cost (I will be formally denying these fees). need more clarity on costs and paperwork from product coming from overseas.", "rating": 3}, {"title": "Buying experience has so far been good…", "text": "Buying experience has so far been good especially when dealing with private sellers. As respects professional sellers I am a little frustrated at the selling behavior of certain sellers. I have been declined for 3 times in last 2 months with the same excuse of “unable to deliver to the destination country” which is indeed not true ( as I keep ordering and receiving items from the sellers’ countries such as Italy and the USA. This behavior has inevitably created a contract certainty issue from buying with these sellers I must say.", "rating": 3}, {"title": "unexpected foreign transaction fee for Florida purchase", "text": "Transaction was smooth up to the point that I received an $82 foreign transaction fee.  This was not part of  the agreed upon final price.  Since the Chrono24 seller was located in Hollywood, Fl and I’m in Orlando, Fl I think Chrono24 could’ve figured out how to eliminate this unexpected charge.", "rating": 3}, {"title": "Hard to get customer support on the…", "text": "Hard to get customer support on the phone...", "rating": 3}, {"title": "I bought an unworn gold watch", "text": "I bought an unworn gold watch. The gold strap was asymmetric and was tampered with. The Chrono24 customer service called me up on my first review and offered partial compensation for which I am thankful.", "rating": 3}, {"title": "A great collection of new and used…", "text": "A great collection of new and used watches. The escrow service enables certain sales that might not otherwise happen. But the communication is confusing and not always reflective of the facts at that point in the process. The user interface is OK but not great given the commission paid.", "rating": 3}, {"title": "Far too many people wasting my time…", "text": "Far too many people wasting my time with bottom feeding offers and I have had  3 people agree to purchase then ghost me. People selling high end watches do not like having their time wasted.", "rating": 3}, {"title": "Need improvement on security, data using and transparency", "text": "It is a nice system, but some situation are not clear. Like the payment with the credit card if in the US market still a foreing payment even if the currency is USD. So this raise for a variable percentage base on our own credit card the purchase from 2% to 6%. This is not reveal until the transaction show on your credit card bills. At that point is too late. Even looking deep in the FAQ and in every normal channel this information is not available.Sometime they arbitrary asks for more documents without have a clear way to deal with private information and how this document are going to be stored or used. I used a couple of time. But I can't tell that I never have a completely nice, smooth or fulfill experience. There is too much room for the seller to try to use bate price techniques and to lost control over the money with uncleared sell price, hidden fee and so on. Also the way that the seller has to do bad practicing and still trusted seller or extremely high in rating it makes totally unuseful the raiting system and obviusly there is no control over the final seller.", "rating": 3}, {"title": "C24 offers a personalized service from…", "text": "C24 offers a personalized service from a watch expert curator who does not seem to have time to answer questions. I have asked several with no response.  It's better not to offer such services if C24 is not able to keep up with demand.", "rating": 3}, {"title": "It's a decent place", "text": "It's a decent place. The commission is a bit high and you can sell much faster on eBay or Amazon", "rating": 3}, {"title": "I bought a Ulysse Nardin through…", "text": "I bought a Ulysse Nardin through Chrono24. The watch - an ‘07 was beautiful, as depicted, then began to fail weeks after I was in possession. I contacted the seller, and they didn’t believe that the watch worked perfectly for three weeks then began to fault. Nor did they care to help me get a diagnosis from UN themselves. The watch quits working within minutes after being taken off the watchwinder. Chrono24 says their warranty is only 2 weeks after receiving. Im proof that a watch can fail weeks after receiving. Chrono24 should be more proactive in helping me to gain satisfaction.", "rating": 3}, {"title": "It took long time to deliver and at…", "text": "It took long time to deliver and at last I got it.", "rating": 3}, {"title": "Love the site", "text": "Love the site. Only issue was the payment process. Site won't let me use Affirm and support never reply to my request for help.", "rating": 3}, {"title": "Seller is excellent but shipper sucks big time", "text": "Seller is excellent, but shipping is unbelievably poor by FedEx. My parcel arrived at FedEx Guangzhou hub at 2:42 am on January 27 Thursday and stuck there for 2 days without moving. FedEx ignored my repeated requests that the item needed to be delivered by Friday 18:00 as shipping address closes on weekends. I ended up have to go to their facility in Chaiwan Hong Kong to pick up on January 29 Saturday noon and the shipping cost of USD 189 paid in addition worths nothing.", "rating": 3}, {"title": "Easy transaction", "text": "Easy transaction. But I wish they'd told me that the watch advertised as a men's watch came with such an unusually short strap. And they weren't very responsive when I raised this issue with them.", "rating": 3}, {"title": "Took such a long time to arrive", "text": "Date of experience: January 16, 2022", "rating": 3}, {"title": "Many listings not availble", "text": "Good search engine, but many listings are actually sold or not available upon enquiry with the vendor. This leads to a false impression that there are more watches available than in reality. Maybe each vendor should be required to confirm their listings once a week or once a month?", "rating": 3}, {"title": "Good platform", "text": "Date of experience: January 04, 2022", "rating": 3}, {"title": "Watch assortment A+, customer service C", "text": "Watch quantity and variety are unparalleled. Costumer service however from CHRONO is slowand not terribly helpful.", "rating": 3}, {"title": "The overall experience was painful", "text": "The overall experience was painful. Throughout my search for a watch, most sellers would not negotiate even for a few hundreds. Then when I decided to buy the watch I got assess international fee although I bought the watch in the US, from a US vendor and paid in US$. The transaction is done by a German bank and whether your bank or them assets foreign transaction fee. I never experienced that before. I will not use that site for my next purchase.", "rating": 3}, {"title": "Communication left much to be desired", "text": "Communication left much to be desired; both by phone and email. There were issues with the watch. Ultimately everything worked out and Chrono24 took care of me, but it was a lengthy process and there was no need for the additional stress arising from the failure to timely communicate.", "rating": 3}, {"title": "Item arrived safely but was handed off…", "text": "Item arrived safely but was handed off to a random person at my office.  The watch I purchased was expensive but not 5-6 figure expensive -  I would be concerned about buying big ticket items if they are just letting fedex hand off packages.", "rating": 3}, {"title": "Watch availability", "text": "My only problem with Chrono 24 is that they do not investigate whether the watches they show on their website are actually available at the dealer. I recently ordered a watch, paid the money to the escrow account and waited several weeks before the dealer finally admitted he could not source the watch. As an extra service, Chrono 24 could have checked availability of the watch at the dealer and saved me time and money.", "rating": 3}, {"title": "About tax payment", "text": "Generally good interaction, but the final price is the one declared by Chrono24 PLUS taxes. This is not appropriate! Taxes (or an estimate) should be mentioned, even if the transaction with the dealer does not include them. Thank you,", "rating": 3}, {"title": "hello gents", "text": "hello gents, it's my first time purchased a rollex.The sellar was polite and collaborative. The one think that I want to share is the idea of the sellar to put a different/lower price on the FedEx lable. I had a issue with this on the customs and took more then 3 weeks to free the item. Another thing is the watch papers and box, which I don't received. In general the purchase is successful. Regards! Anton", "rating": 3}, {"title": "Very difficult to get in contact on…", "text": "Very difficult to get in contact on mail and phone", "rating": 3}, {"title": "The watch didn’t accurately match the…", "text": "The watch didn’t accurately match the description. Did not come with original box and papers as indicated. Seller blamed this on chrono24. I’d also note that prior to this purchase I experienced around 6 listings where the watch I was trying to buy wasn’t in fact available.", "rating": 3}, {"title": "Total was not presented up front", "text": "Date of experience: December 06, 2021", "rating": 3}, {"title": "Sales Tax Collected When It's Not Necessary.", "text": "Honestly, Chrono24 is great They get only 3 stars from me because there is no provision for not collecting sales tax regarding used watch sales between individuals. These are not transactions where sales tax is collected. Where does the sales tax collected end up? How do they make their determination? They should have a separate forum for individuals selling to individuals, where sales taxes will not be collected. At least in Illinois, where I live, if I sell something of mine which is used, I am not obligated to pay sales tax if I resell it. As long as reselling watches is not my business. I also am not a fan of following eBay's lead and charging commission on the sales price PLUS sales tax. This is adding insult to injury. The seller cannot receive the sales tax collected. That is (allegedly) reserved for the State. Why charge a fee based on money I will not, and can not, receive?", "rating": 3}, {"title": "From a seller standpoint you’re in a…", "text": "From a seller standpoint you’re in a dilemma when the buyer claims otherwise then you. It can take weeks before any settlement. Chrono24 team is helpful and polite. Would have some improvements to make on the time for answers on mail otherwise a ok experience.", "rating": 3}, {"title": "Protect much the seller Thank buyer", "text": "Date of experience: November 17, 2021", "rating": 3}, {"title": "F/X spread", "text": "It would be fairer for the buyer if Chrono24 is willing to accept payment in local currency of seller, thus allowing buyer to save on helfty F/X spread charged by the Escrow agent.", "rating": 3}, {"title": "Chrono24 Customer Support is NOT the Best in my opinion.", "text": "Not sure what the point of purchasing from Chrono24 is considering the publicized topic of Trusted Checkout and being a secure guaranteed way of purchasing. I made a purchase which took over 3 months to arrive. Raising concerns with Chrono24 Customer service, didn't really achieve much. eBay/PayPal also afford similar purchase protection with faster resolutions from my experience.I have purchased many watches from Chrono24 and this is the first time i have had to use customer support and was not a great experience. i will think twice before making my next purchase.", "rating": 3}, {"title": "Are you selling or buying?", "text": "Its a good site just make sure you get your watch examined asap to verify its authentic. If you are aelling expect weeks in delay before your add is approved for publication!", "rating": 3}, {"title": "Good platform but annoying currency…", "text": "Good platform but annoying currency setup.", "rating": 3}, {"title": "I asked via the message service to have…", "text": "I asked via the message service to have the watch bracelet adjusted to a given size. It was cofirmed they would. The watch came unadjusted, my request was totally ignored. For the rest, the watch is as described.", "rating": 3}, {"title": "Not as helpful as they could be", "text": "Not as helpful as they could be.  You need to push them for any help", "rating": 3}, {"title": "First Timer", "text": "I never use this site, it was my first time, in certain moment I try for help. The answer was absurd, I was asking to pay with Paypal, the answer was: use it. But you don't have this option. So, I cross my fingers and did it directly with MC. The payment was secure, I was rewarded with a new watch. The seller receive his payment, all happy. But with this support, well....", "rating": 3}, {"title": "Hidden cost due to exchange rates.", "text": "Date of experience: September 21, 2021", "rating": 3}, {"title": "Great watch from what appears to be a…", "text": "Great watch from what appears to be a very reputable dealer in Japan. But shipping was incredibly slow (I'm talking about when they got around to packaging it to ship out), the watch got hung up in customs so I had to make a million calls, and arrived after about two weeks. Foreign shippers need to fill out a watch checklist for customs, and the seller hadn't done that. Pretty standard stuff. I communicated with them, but they are slow to respond and very pithy. Average experience.", "rating": 3}, {"title": "I did not get my watch that I bought", "text": "I did not get my watch that I bought! Porsche Design woman's version!", "rating": 3}, {"title": "The platform is very good with a cost", "text": "The platform is very good. It would be better if they allow buyer to pick their own currency in order to save the exchange fee. Customer pay unexpected fee (including credit card charge and the exchange fee charged by Chrono24) in settling the bill and /or receiving refund. (Both charged with exchange spread and credit card handling fee)", "rating": 3}, {"title": "No impressed.", "text": "Date of experience: August 31, 2021", "rating": 3}, {"title": "No Doubt", "text": "No Doubt; Chrono24 provided a huge & wide range wrist watch trading platform with sufficient support, backup & safe environment for both trader & buyer.However, I really don't like the extremely currency rate \"tricks\" without clear noticfation or communication with new buyer/trader. You will only noticed/found the extremely high currency rate AFTER you confirmed a trade when you going to make your payment. Full understand that a business should have reasonable profit; but at least I think most/all customer have their own rights to know the currency rate should be considered as a part of the cost.", "rating": 3}, {"title": "Expensive but safe..sort of", "text": "Chrono24 is expensive. Safe and secure though due to escrow account BUT money is released to seller as soon as watch has been ‘delivered’. Not once the buyer has inspected the watch. This is an issue as if I’m at work and watch is delivered to my home, fund are released before I can verify watch is exactly what I paid for. Isn't this the whole purpose if using an escrow account? There should be a 24hr window from ‘delivered’ status to allow the buyer to physically see watch etc and then click on Chrono24 ‘received’ etcNot that I have ever had any dodgy watches that I’ve purchased via Chrono24, but when I see it as delivered and then Im powerless for 3-4 days while seller gets paid is of concern.", "rating": 3}, {"title": "Trust is based on a guarantee that the…", "text": "Trust is based on a guarantee that the product I buy is authentic.  When I asked you how your trust pilot guarantees an authentic purchase I was told that you expect your sellers to only sell authentic watches, hardly a reassuring thought.  My last watch purchase from ebay went to an authentication center before it came to me.", "rating": 3}, {"title": "I payed your commission weeks ago but I…", "text": "I payed your commission weeks ago but I still can’t see that I payed.", "rating": 3}, {"title": "As a platform Chrono24 is quite hands…", "text": "As a platform Chrono24 is quite hands off. I have experienced a number of issues and had to work through each with the seller/dealer as Chrono staff were not willing to step in. Considering their fees they need to take more responsibility for issues that arise.", "rating": 3}, {"title": "Beware of hidden aditional costs that are not mentioned when you list your watch. Beside that, Chrono24 looks a reliable way to sell watches.", "text": "I´m really surprised that there is a warning about using offensive words, and keep constructive.Why? Do you have angry customers? If that is the reason, that means that in some way, if Chrono24 gets bad reviews maybe there is a reason.As a user, that warning makes me feel that maybe you are afraid of something, what is it? I don´t know, but in my opinion, that backfires directly to your reputation. You should not warn about what to write, that makes you look untrusted.Well, my experience was some kind of regular, because you don´t tell the seller what other expenses should be considered: your fee, the shipping cost and the cost of using different ways of payment. So I had to pay around the 20% of the advertised price. There is a HUGE lack of information about what expenses do the seller has to consider. Also, you are not transparent about what happens if the buyer gets the watch and decide to return it; that means more losses. I believe that is your obligation to let to know buyers and sellers about all the hidden additional costs.", "rating": 3}, {"title": "It’s touch and go with their dealers..", "text": "It’s touch and go with their dealers... some never get back to you; let’s say on a $30k purchase request. Some cancel the order with the lame explanation “I changed my mind” ( from a dealer!), meaning I had someone interested in the item for more money ( no honor whatsoever). Other times the dealers have been responsive and honest, Chrono24; you need to vet your “Professional dealers” much better.", "rating": 3}, {"title": "Japanese seller was great", "text": "Japanese seller was great, Chrono middleman less sono 24/7 customer support, strictly M-F office hoursrejected payment card for no apparent reason, causing 48 hour delay", "rating": 3}, {"title": "My first purchase was a five star", "text": "My first purchase was a five star.  From purchase to delivery.  My 2nd purchase, not so much.  It seemed once I secured the purchase & the timepiece shipped I was on my own.  It has take twice as long to get delivery this time and it was purchased within the US.  I have not received it yet.  The seller can't find out anything and Chono24 hasn't responded to my emails as of yet.  This has not been a bad experience, but it's not one I want to repeat.", "rating": 3}, {"title": "troublesome sellers", "text": "Watchvault was my first contact.   No response to my offer and then a phone call to them got an out of service message.   The second seller played a bait and switch tactic, which was off putting.   Tarrytown Jewelers were my third contact and this yielded a sale.   I like chrono24, but you could police the participating sellers a bit better.", "rating": 3}, {"title": "Beautiful, but not working properly", "text": "The watch is beautiful and communication with the seller was excellent immediately after the purchase; however, it seems like the cannon pinion is broken/old as the watch's minute and hour hands periodically stop or move at half their proper speed. This is the case even with an appropriate full winding of 20-30 rotations on the crown. The cannon pinion issue surfaced 1 week after purchasing the watch. Unfortunately, I have already left the country where I had the watch delivered (the US.) So repairs and reimbursements are not really a viable option. The latter part is on me I suppose.", "rating": 3}, {"title": "Watch arrived damaged after being…", "text": "Watch arrived damaged after being delayed in customs for a month.  Now I must find an authorized dealer to repair.  Highly inconvenient.", "rating": 3}, {"title": "I made a mediation but it was ignored…", "text": "I made a mediation but it was ignored by chrono24", "rating": 3}, {"title": "Hotline doesn’t take question seriously.", "text": "Date of experience: July 17, 2021", "rating": 3}, {"title": "Lots of loopholes", "text": "The concept of C24 is fantastic, but the buying experience could be improved.1. There's no option to rate sellers you do not buy from (i.e. initiate a purchase and they cancel and \"ghost\" without any reasoning)2. There's a lot of contradictory information in the purchase process - it states the total amount, no hidden costs, but sellers can still add additional VAT at their discretion (happened to me with Montredo) 3. What you are or are not committing to (and the seller) when you select to \"BUY\" something is unclear. More info should be given on the steps and what they mean4. There doesn't appear to be a complaint process, to escalate inappropriate behaviour of a particular seller.5. I do like the escrow system, however. It maintains a degree of safety not possible elsewhere.", "rating": 3}, {"title": "Everything went as expected.", "text": "Date of experience: July 05, 2021", "rating": 3}, {"title": "The watch was pretty much just as…", "text": "The watch was pretty much just as promised, except the band was dirty and grimy. It was advertised as new and unworn. The case is in excellent shape. No box, no papers as advertised.  Shipping was good with no damage. This was my first purchase through Chrono24.  I am not confident that you get exactly what is advertised, so I probably won’t buy higher end watches through Chrono24.  Fine for lower end watches.", "rating": 3}, {"title": "I have had an overall plesant…", "text": "I have had an overall plesant experience with Chrono regarding the sheer variety, availability, price and genuine ness of watch reselling and other grey market services. However, Chrono24 needs to implement quality checks on the watches supplied to safeguard buyer's interest. Also, if there is any issue with a watch, the return policy, especially the shipoing back cost aspect is not buyer friendly in my opinion. There should not be absolutely no defects or malfunction in the watch because returning is a hassle.", "rating": 3}, {"title": "Credit card process", "text": "Purchase process was too complex, credit card charged for several days before confirmation was received", "rating": 3}, {"title": "Improvement needed with International shipping", "text": "The product was absolutely as advertised, a fair value, and received in new condition ad advertised. I had problems with delivery thru customs into the United States, which delayed the arrival by 2 weeks, and resulted in a graduation gift being 1 week late. If delivery by postal services is your business, I would expect the ability to navigate international shipping/customs. I had to fill out forms for the shipment to be released. Improvement is needed.", "rating": 3}, {"title": "Customer protection?", "text": "Not sure how to rate my experience. I have no intention to harm or praise Chrono24.My experience was not up to my expectation because the item I have paid for was already sold through eBay.I have never faced such an issue before.Based on the value of the items selling through the site, I am considering the event unacceptable.", "rating": 3}, {"title": "In general", "text": "In general, Chrono24 operate a good service as 'host and middleman', but when there is an issue with a 'bad dealer', Chrono24 do not offer a great intermediary service to a successful resolution. I have bought quite. a few watches via Chrono24, one went very badly and has left a nasty taste in my mouth, that dealer was dishonest with their photos and offered NO resolution AT ALL, very disappointing.", "rating": 3}, {"title": "Settlement procedures could be better", "text": "Lack of working escrow payments for many countries complicates selling. Otherwise great site.", "rating": 3}, {"title": "Late delivery", "text": "Date of experience: May 17, 2021", "rating": 3}, {"title": "I had to pay twice", "text": "I had to pay twice. Communication wasn't clear. Otherwise happy with the product and the seller.", "rating": 3}, {"title": "Slow service", "text": "In the past, my experience with Chrono24 has been excellent. This time, communication was slow and unclear. Watch dealer didn’t have actual watch in stock which led to delays in information and ultimate delivery.", "rating": 3}, {"title": "shopping experience is A+. Payment process is C-", "text": "I had lots of trouble paying and checking out.  Citi and Barclays both had issues with Chrono24 payment clearing and tagged the transaction as fraud REPEATEDLY, despite my contact with the card companies PRIOR to attempting to make payment. Otherwise the shopping experience is very nice. Buying experience was awful.", "rating": 3}, {"title": "Listings should include condition guarantees or disclaimers", "text": "Nothing wrong with Chrono 24, but the watch I bought was defective and required a $450 service. Seller became difficult  and I finally had to block his calls and texts.Suggest listings require either guarantees of working conditions or “as is” disclaimers.", "rating": 3}, {"title": "The delivery schedule was out of…", "text": "The delivery schedule was out of expected", "rating": 3}, {"title": "The UX of the app isn’t so pleasant", "text": "The UX of the app isn’t so pleasant A lot of bugs and robot responses on messages Very difficult  and un pleasant process to verify you as a buyer Overall not a very pleasant process to buy Sorry", "rating": 3}, {"title": "Overall a good experience with an important caveat", "text": "Overall a good/positive experience. The seller was highly professional, the watch arrived remarkably quickly and in great condition. More importantly from Chrono24's point-of-view, I would have been unlikely to find this international seller from a non-English speaking background, were it not for this website. The *major* frustration is with Chrono24 charging you in your own currency with a 2.5% commission over the exchange rate to Euro, but still requiring you to send your payment overseas, thereby incurring another commission cost from your own payment provider (e.g., 3% on the total cost including the 2.5% commission, from Mastercard in my case). Chrono24 are adamant this is non-negotiable nor discountable but fail to appreciate it nullifies a lot of the cost benefit the website offers over other online secondary market retailers/solutions. I can't see a reason why the buyer shouldn't be able to transfer funds to the Luxembourg-based Chrono24 escrow account privately using their own payment system of choice (e.g., Wise - FKA TransferWise), so as to avoid incurring duplicate costs and high exchange rate commission. An even simpler solution would be to register a 'normal' online retailer account where a buyer could simply use PayPal a la eBay/Etsy/AliBaba/other major third party online shopping vendors. It's unfortunate, but that aspect of the experience really manages to leave a bad taste in the mouth...", "rating": 3}, {"title": "Watch not received - in progress.", "text": "Customer service is working with me to see why I haven't received the watch I purchased.", "rating": 3}, {"title": "A lot of product is available here", "text": "A lot of product is available here, but the fees are too high.", "rating": 3}, {"title": "Overall experience has been good but I…", "text": "Overall experience has been good but I think they could do better with controlling sellers, far too many times I’ve inquired about a watch only to have the seller give some excuse as to why the watch isn’t available. Ie. out for service, I’m not in office ( then never hear back from them). Find sometimes a seller only posts for click bait. Just my experience.", "rating": 3}, {"title": "Not much help when the delivery was…", "text": "Not much help when the delivery was delayed.", "rating": 3}, {"title": "Deceptive Advertising, Suspicious Shenanigans", "text": "I ordered a watch for $6,500 from a dealer in Des Moines, Iowa.  My Visa was charged for that amount.  Just tried reconciling my Visa account, and it was off by $130.  After further research, I discovered that the watch had been sent from Philipsburg, St. Martin, not Des Moines, and that there was an extra charge on my Visa account as an International Fee for $130.  That is deceptive advertising.  No where in the offer did it say there would be an additional International's Fee.  Also I noticed after I bought the watch that that vendor changed is offer price to \"contact seller for price\", so something suspicious is going on.  His price is now back to $6,500.  The watch as received is exactly as advertised; love it.  Only the price is the issue.", "rating": 3}, {"title": "All went well as far as the watch and…", "text": "All went well as far as the watch and seller were concerned, but UPS held things up insisting there was no customs invoice.  It finally arrived after a delay of many days.", "rating": 3}, {"title": "Great product,but...", "text": "Great product! Exactly as described. However, shipping arrangements was unacceptable. No insurance. Very limited and inaccurate tracking. Contradicting information about the pick-up point...Watch ended up waiting for collection in a petrol station... And it is a $15,000 watch..Next time I need to make arrangements with the seller to ensure secure delivery- even with an extra cost.", "rating": 3}, {"title": "Not what I expected from a major watch platform", "text": "Not what I expected from a major watch platform. Poor communication and not at all expertise in the watch sector", "rating": 3}, {"title": "Very quick and secure service", "text": "Date of experience: March 13, 2021", "rating": 3}, {"title": "I like the format and I like the…", "text": "I like the format and I like the inventory as well as the customer service. I don’t like the currency exchange uncertainty as well as the time it take Chrono24 to act on an action. This is especially true when it comes to refunding you the money.", "rating": 3}, {"title": "I would say that the current system of…", "text": "I would say that the current system of registering the buyers delivery addresses is not user friendly. The registration system should be improved. System should allow multiple address specially when buyers want to buy the item as a gift and to be delivered in other addresses. I have experienced a secure payment and a non secure payment method. In this case, Chrono24 should improved the payment system wherein Buyers will have a peace of mind and will feel safe when payments are made. Thank you.", "rating": 3}, {"title": "I have not been on Chrono long enough…", "text": "I have not been on Chrono long enough to give a  5 star and understand the complexities of problems people may face in using this platform.  Like buying out of the country, not quite familiar how smooth a sale or purchase may go.", "rating": 3}, {"title": "Process is way too slow", "text": "Process is way too slow. Communication was fair, but that might have be a difference in time zones. Online chat was good, very cordial and helpful staff on the other end. Seller was slow on responses. Slow to ship also. In a nutshell, buying a high end watch is a dream for some of us, but the experience is dimmed by the long process. Contrast watchuseek or eBay with no middle man and the process is a fraction of the time. I understand the diffence in your businesses , and appreciate your guarantee... But IMHO, you need to streamline the process a bit.", "rating": 3}, {"title": "Customer services seems to be on…", "text": "Customer services seems to be on autopilot, copy and paste templates... for high value transactions, I would have appreciated real support.", "rating": 3}, {"title": "Process less than smooth", "text": "It's great to be able to find watches all over the world, so many from sellers that one couldn't find on their own. And, I liked the process and potential protections provided by Chrono 24 up until it was time to make the purchase.  After obtaining an accepted offer from the seller, Chrono 24 sent an email informing me that I had an offer to accept, despite the fact that the seller already told me that they had accepted my offer. I accepted the offer again and made payment. I was then informed that my payment was being validated by their external payment service provider. They requested an unaltered copy of the front and back of my drivers' license and a copy of the front and back of my credit card, with the first six and last four digits visible.I have made many watch purchases over the past 20 years and have never been required to provide identification after they had already received my payment. In an era where identity theft is rampant, I found the request unsettling, so I inquired as to why this was necessary.  I received a response that they are reviewing the matter and to please be patient. A day later I received another system-generated email from Chrono 24 restating that they required the identification in the exact manner they previously requested.I contacted the seller who expressed confusion and frustration at the delay but didn't have an explanation as to why this was going on.  In the end, I sent the two forms of identification they requested (driver's license and credit card) but I altered them, hiding some of the numbers. The transaction was approved.To conclude, the process took too long, was impersonal, and the request for additional, unaltered identification could make me less likely to use the service again. Especially, when you can go directly to a seller you know is trustworthy and reliable.", "rating": 3}, {"title": "The TRASER watch seller", "text": "The TRASER watch seller refused to communicate with me.Seller was preparing the shipment for a very long time. Delivered me the item from the European Union from export, but the value added TAX was NOT REMOVED.P.S. The watch is good.", "rating": 3}, {"title": "First purchase on Chrono24", "text": "First purchase on Chrono24. Dealer/seller was excellent. Open and honest. Thankfully the seller was very communicative as Chrono24 was not. Multiple changes of address had to be made (due to postage and pandemic conditions) and Chrono24 really dropped the ball. Luckily seller was extremely good at communicating (even better as his native language was not English) or the item may never have been delivered. Pros:- Escrow account payment system- Honest reviews- Ease of paymentCons:- The sales process (checkout) feels ‘rushed’- Communication from Chrino24 when things happen (and things do happen!) could improve", "rating": 3}, {"title": "You need to update your credit card…", "text": "You need to update your credit card processing company for US buyers.  I had two credit cards declined and had to call fraud departments on both.  It seems I am not the only one who has this problem.", "rating": 3}, {"title": "Received the desired watch in good…", "text": "Received the desired watch in good condition but case was relined with non original cloth & labelling Disappointing considering the expense of the purchase", "rating": 3}, {"title": "Chrono was fine but it could have been…", "text": "Chrono was fine but it could have been better. Took a little too long to respond and several glitches actually delayed the transaction.", "rating": 3}, {"title": "If it wasn't for the fact that Chrono24…", "text": "If it wasn't for the fact that Chrono24 is the biggest market - I would only put 2 stars at best. For example, even if you contact several dealers with questions - Chrono will soon offer buying protection in so much frustrating way, that one can easily turn it on for wrong lot. And then Chrono will send you emails, call you (sometimes being pretty rude) and try to make you admit you're hiding this transaction, as if it isn't the market for luxury market but a Saturday flea market for junk and you're some shady character. Also, if you stumble upon the dealer who clearly isn't OK there's nothing you can do until you buy anything. Then, the timing which they give you to authorize payout is very tight: if you do not have respective dealer in your own town to check your purchase - be ready to plan far ahead in order to be protected from counterfeit stuff. I would not risk something like Rolex with current level of counterfeit watches at all.", "rating": 3}, {"title": "currency conversion rates and taxes excessive", "text": "I found that currency conversion rates are higher than what you get from a US banks. And the tax charged for total amount including shipping which is not required by some localities. Chrono24 might have done better job to provide competitive conversion rates and tax properly based on buyer location.", "rating": 3}, {"title": "There are too many things to take into…", "text": "There are too many things to take into consideration when you're trying to sell your watch online like one of the things I faced in my watch while selling. the buyer needs my address and contact information to complete the international money transfer and on Chrono24 I can't give or send my personal info to the buyer.my advice is if anyone already has an account on Chrono24 you must build a trust relationship with the user. this is the only way he will make sure that his watch or money ar safe and guaranteed on Chrono24.Thanks & regards,", "rating": 3}, {"title": "Fix the Trusted Checkout process", "text": "Trusted Checkout process is great concept, however there are kinks to work out. Notably, listing prices for an item and for shipping separately, but then conflating them when processing local charges results in Chrono24 ultimately collecting sales tax on shipping charges, which is illegal in some states, mine (CA) included.", "rating": 3}, {"title": "Poor exchange rates!!", "text": "Had to pay my watch in my national currency which made it 200 Euro more expensive. Chrono24 uses very poor exchange rates. For future purchase I will leave chrono24 out.", "rating": 3}, {"title": "Service is fine however Chrono24…", "text": "Service is fine however Chrono24 converts the selling price currency into the currency of the purchaser at a poor exchange rate, thereby skimming the difference in exchange rate from what my credit card would have charged. Should have the option of paying in the currency of the seller, and let the bank/credit card do the currency exchange, NOT Chrono24.", "rating": 3}, {"title": "If you can’t protect my interest…", "text": "If you can’t protect my interest through the escrow service with dealers, I might as well build a relationship with a few international dealers and not use Crono24", "rating": 3}, {"title": "A expensive learning experience for my first international transaction.", "text": "I was very surprised by the 2% ‘surcharge” for the foreign exchange bank transaction. It significantly raised the agreed price of the watch. If i had a choice i would have transferred funds in the local currency rather than USD.", "rating": 3}, {"title": "Product is fine", "text": "Product is fine, but the courier is doubled. I have paid shipping charges and when the package arrive, Fed-ex is asking for another 298 AED for the courier charges which is too much. If i have only known this charges earlier, i could have purchase it locally.", "rating": 3}, {"title": "Watch out for extra CC charges", "text": "Very good, except for excessive amex charges which popped up at the last minute.", "rating": 3}, {"title": "Need more accurate pictures", "text": "The watch I received was not like it was illustrated in the advertisement pictures. It was very dull and needs to be polished. Also the box was full of makeup stains. The watch was is good shape and in working condition however. The seller did offer full refund however, I decided to keep the watch and have it cleaned.", "rating": 3}, {"title": "There was an issue with the delivery…", "text": "There was an issue with the delivery which was dealt with but still required a lot of work on my end even i was the receiver of the watch. The process if the package went missing is not clearly outlined and communication can be improved.", "rating": 3}, {"title": "Chrono 24 is great if you use the…", "text": "Chrono 24 is great if you use the escrow service. if you dont use that and there is a problem chrono 24 does not help at all.", "rating": 3}, {"title": "Let’s Understand Verification", "text": "I understand that fraud protection is important for buyers and sellers on C24. However, in my experience, I don’t understand why if my credit card company has already verified that a payment to C24 was made by me why C24 then has to deeply verify the payment. These sorts of delays significantly hinder timeliness of transactions.", "rating": 3}, {"title": "Chrono 24 is OK, why bother with the escrow???", "text": "Chrono 24 is a fair outfit overall, however there are some problems.  Many of the dealers are fishing for clients, this means they have a watch advertised in perfect condition using stock photos, advertised as genuine photos taken of the authentic piece.  When one inquires and makes an offer the dealer, divulges the watch is out of stock, and they will track you the exact model down, which never happens quite as advertised, wasting every ones time.  This sale transaction a Rare Tudor, unworn, box and papers, was smooth but there were problems. On direct inquiry the dealer claimed they do not ship out of the EU. The dealer likely said this because they loose a few bucks with shipping and insurance premiums.  I purchased the watch outright no further inquiries and they had to sell the watch to me and honor their agreement with Chrono24.  Silly dealer games, cherry picking and misleading consumers.  My hope is that Chrono24 purges the dealers that do not take down stock that is long gone and hold dealers to a code of conduct.  Chrono24 really did not have a representative check in with me after delivery to make sure this very expensive transaction was smooth, the watch was not counterfeit and I was happy with the transaction to let the escrow account release the funds to the dealer.  Essentially the courier communicated the watch was delivered and that was it....funds transferred no after delivery due diligence with the buyer. The watch is now in a Rolex dealer being authenticated, there is risk", "rating": 3}, {"title": "This experience on Chrono was great but previous experiences were not", "text": "This experience on Chrono24 was great and this dealer was phenomenal and I purchased through the online system - but my previous experience with The Golden Line dealer was a complete disaster and Chrono24 did not help resolve my issue and I still have a non working watch valued at $6400. Through my ignorance of the escrow process I purchased directly from the dealer, at the original price and the watch was faulty and did not have a global valid warrantee - Chrono24 told me to sort the issue out myself with the dealer - who now does not respond to emails. This was a watch advertised and promoted on Chrono24, a highly unsatisfactory experience that I would advise all customers to be aware of.", "rating": 3}, {"title": "My .02", "text": "All of my transactions have worked out. Chrono 24 is really slow in responding which makes it frustrating. I put more faith in the sellers than I do in the site. So just make sure you’re looking at your reviews and ratings of sellers and you’ll be fine.", "rating": 3}, {"title": "Chrono24 has work to do…", "text": "I have experienced both exceptional service from chrono24 sellers, as well as extremely poor / bordering on fraudulent transactions from sellers on the site.  Chrono24 so far has always corrected the situation, but I feel that Chrono24 could do a better job in terms of vetting the quality of their sellers.", "rating": 3}, {"title": "Payment methods./", "text": "Need to take paypal and discover or let us know somewhere that you do not take those payment method ahead of time. Also would be nice to get update from someone.However every time I called with question, they were helpful and answered all my questions.Support and web is excellent. Some suggestions about paypal and discover mentioned above.", "rating": 3}, {"title": "I bought a watch but it terns that it…", "text": "I bought a watch but it terns that it is fake and I always trust your site I used to buy from other sites but when I see that they don’t check before add I stopped buying from them so to prevent such action try to check the products if it was from private seller after checking the item they can ad in your web site so no body will be cheated and waiting for my money for long time", "rating": 3}, {"title": "I was a little apprehensive about…", "text": "I was a little apprehensive about sending money abroad (HQ is in Germany) for the transaction although the watch was located in the US. Once money is sent it takes a while for Chrono24 to post it. Plz check with your bank/credit card if the payment went through. Do not redo the payment if the bank says it has been paid. I was misinformed by Chrono24 chat personnel that the payment had not gone through within some allocated time - then mysteriously they came back and said it was posted and all is good. This was a little disconcerting! After that it was smooth sailing. The local US vendor sent the item promptly. I had to contact Chrono24 to get the item certificate - they sent me an electronic copy. I still have not recd. any warranty information or the certificate from the vendor.  I was expecting a printed out certificate as the picture showed (like an appraisal). On the whole it was a positive experience but not as smooth as it could be.", "rating": 3}, {"title": "I was generally happy with the site but…", "text": "I was generally happy with the site but Chrono24 didn’t ask for a billing address and instead used my shipping address when they ran my credit card. This set off fraud alarms resulting in my credit card being frozen and the sale not going through. After numerous phone calls with them and my bank we discovered the reason. Chrono24 told me they had to cancel the order and I would have to resubmit it listing my billing address as the shipping address and contact the seller to make sure they sent it to my shipping address (my winter home). Until the watch arrived I was concerned that it would be shipped to the wrong address. Fortunately the seller, Crown & Caliber, was excellent to work with and I received the watch. I like Chrono24 for helping me find what I was looking for but one would think many purchasers of expensive watches own more than one home and that their billing and shipping addresses are different. Hopefully they will remedy this issue and ask for both addresses like every other online seller I have worked with.", "rating": 3}, {"title": "The dealer was much more helpful than…", "text": "The dealer was much more helpful than chrono24. Will use site again, but I will only communicate with the dealer.", "rating": 3}, {"title": "Quite stupid that there is no option to…", "text": "Quite stupid that there is no option to specify currency for payment. I bought a watch from the US but wasn't allowed to pay in USD because my profile address was based in HK. USDHKD is a pegged currency (between 7.75 to 7.85) but chrono24 tried to charge a HKD amount at an implied rate of 7.99. Now i am okay paying away money for service but in this case I didn't see where the value-add was?", "rating": 3}, {"title": "I already wrote a review", "text": "I already wrote a review. I got a watch out of Hon Kong and not the USA which is what I thought I was getting. It took a month to deliver. Merde.", "rating": 3}, {"title": "You guys could have been more proactive…", "text": "You guys could have been more proactive when I wrote back about my purchase and the delay highlighted the dealer.", "rating": 3}, {"title": "Love my watch. Hated the payment process.", "text": "The payment process is super weird and confusing for a first time user. I ended up making two payments like an idiot because the balance owed didn't dissapear after the first payment. Pretty clunky website that could use a refresh on the payment side. The fact that it even allowed me to make two payments is silly. Apart from that it was a good experience. I was given a refund for my second payment pretty quickly after calling them. The seller was awesome. I'd buy here again.", "rating": 3}, {"title": "My initial order was declined because…", "text": "My initial order was declined because the dealer did not really have the article in stock despite they claimed so on your site.", "rating": 3}, {"title": "Poor service in call center", "text": "Calling Chrono24 does not seem to be a good idea. The assistant was only capable of stalling any question and attempt to clarify", "rating": 3}, {"title": "Item is as described but communication…", "text": "Item is as described but communication is bad. Communication up to the point of shipping the product is okay but once the product is out the door it severely lacks responsiveness. With my checkout instructions I provided invoicing information which was simply ignored and later advised that if checkout was through Chrono24 they would need to use the address on file with Chrono24. Total nonsense. They are good however at sending spam on a daily basis. I would not buy again.", "rating": 3}, {"title": "Great for buyers, not so great for sellers.", "text": "The site is great for searching and researching and for buying. I was quite disappointed with their support for sellers. I sold a watch and shipped it and the buyer then refused to pay his country's import duty. The customer refused to reimburse me the $150 I spent for return shipping and Chrono24 did nothing to help. They said to just work it out. I ended up losing over $75 on the deal and they had the nerve to take a percentage cut of the money that was returned to me!", "rating": 3}, {"title": "I didnt really receive any real…", "text": "I didnt really receive any real supports from the platform. I felt like all it did was to hold my deposit as a 3rd party.", "rating": 3}, {"title": "Sort out your UX when purchaser shows…", "text": "Sort out your UX when purchaser shows up with cash.", "rating": 3}, {"title": "The app is good for searching but…", "text": "The app is good for searching but purchasing, suggesting a price, and bidding needs to be cleaned up.", "rating": 3}, {"title": "Seller shipping responsibility", "text": "They need a policy that specifies a max delivery time to a country, which if exceeded, enables the buyer to get their money back to purchase the watch from another supplier. Alternatively  specify the period of time that describes when a watch has been 'lost' so money can be refunded to buyer. The seller makes the shipping decision. Yet the buyer waits in limboland for the watch to show up with no time limit provided.", "rating": 3}, {"title": "so and so but swiss", "text": "I tried to negociate for 1 year almost. You may remove the button with the price proposal. It s useless in this case. The watch did not came with the minibook on how to use, no wallet for the warranty card, no blue sticker on the crown like in photo. Therefore were scratches on the crown in the logo side. Fine ones but present. No sticker on the back too. No scratches there. The inside of the box is broken on the left side. Shattered. Not suitabble for a gift option. The watch works great, looks great, solid, 9 seconds in 3 days, in one word, swiss sellita precision. Free international shipping in my case.", "rating": 3}, {"title": "The mechanics of the website are great", "text": "The mechanics of the website are great, the process  of selecting and purchasing products is seamless and very secure. The problem is that some vendors list products that they don't actually have in stock and then either try to stall or sell you another product.", "rating": 3}, {"title": "Omega Seamaster 300M", "text": "Watch received has a noticeable mark on the back area of the case , otherwise condition is fine.", "rating": 3}, {"title": "Bank transfer info incorrect", "text": "The main complaint I have is that the banking information that was provided for me to transfer the funds for the purchase was incorrect! It was resolved due to the efforts of the salesperson at the store (European Watch Company) that I was communicating with. It all worked out in the end but there was no excuse for Chrono24 not having the banking info correct.", "rating": 3}, {"title": "Escrow services disabled after I paid.", "text": "After I paid the money to Chrono24 escrow, they sent me an email for identity verification due to some money laundering issues. They also told me that escrow is no longer active and they ended up paying the vendor without my approval. Really disappointing. They should have done their checks before the payment.", "rating": 3}, {"title": "Chrono24's Is Safe, But Expensive", "text": "Chrono24's is still a safe place to buy/sell high end watches.  Unfortunately their fees are getting too high and you still have to pay state taxes even if you purchase from out of state.  When you factor that and any possible shipping charges into the final sale price, it may become cost prohibitive to use their site.", "rating": 3}, {"title": "Good first experience but more information needed.", "text": "Overall the experience with Chrono24 was positive mostly as a result of the support of the seller. The issue I had was with a hold on the delivery of the watch by Canadian Customs. I would have been helpful if I was told that I would have to arrange for a broker to pay duty and expedite process of clearing customs. I assumed incorrectly that Fedex would do this. I was vert pleased with the watch and with the seller. I would buy through Chrono24 again.", "rating": 3}, {"title": "The retailer has not kept its promise", "text": "The retailer has not kept its promise, which resulted in that the first purchase via Chrono24 has not been something to remember and enjoy or do more times.", "rating": 3}, {"title": "Average", "text": "Vendor fulfilled his requirements. Item as described. Received in about a week.", "rating": 3}, {"title": "Zodiac GMT Aerospace", "text": "This was my first purchase on on Chrono24 and no way this effects them as a company. The issue I had was with the dealer. The product was a Zodiac gmt aerospace. The gmt doesn’t set nor can you adjust the date as the crown on slides out only one click. I reached out to the dealer JUVAL in Switzerland and stated they would get back to me. But have not heard a word! Now I  need to take it to a local watch maker To have them access the situation.", "rating": 3}, {"title": "Conversion fees and excessive attention are unpleasant", "text": "I am still receiveng inquiries about every watch that I liked.  Despite the fact that I have already answered that I did not buy it, after a few days I receive another inquiry again ... Separately, when you return a watch, the conversion fees are quite high, something that is not described anywhere in the terms of the site", "rating": 3}, {"title": "This time I've purchased the watch…", "text": "This time I've purchased the watch which was not working & I'd to spend extra AU$450 to repair it.", "rating": 3}, {"title": "Never received my item from the seller.", "text": "Date of experience: October 26, 2020", "rating": 3}, {"title": "Terrific marketplace", "text": "Terrific marketplace. Credit card processing had issues and Chrono24 did not respond to calls and emails to support. Seller ultimately assisted to resolve the issue.", "rating": 3}, {"title": "The try it on feature of the site shows…", "text": "The try it on feature of the site shows the watch that i purchased larger than what it was in real life. Every other aspect of the site was great i can see how that feature could catch out others in the future and is something to be careful of.", "rating": 3}, {"title": "Currency onversion fees surprised me…", "text": "Currency onversion fees surprised me unpleasantly, and they are not small ...", "rating": 3}, {"title": "Caveat emptor", "text": "I believe Sarasota Watch Company's description and photos did not give a true assessment. I was extremely disappointed that I did not get the watch I thought I had bought. The over polishing of the watch case to minimize the the damage of the chip took away the original look of the IWC Mark XV. Caveat emptor.", "rating": 3}, {"title": "No way to search by country alone and…", "text": "No way to search by country alone and other search engine abilities are needed.", "rating": 3}, {"title": "I'm not sure what value is received for…", "text": "I'm not sure what value is received for the 5% fee.", "rating": 3}, {"title": "Chrono24 needs to improve Escrow system", "text": "I have purchased many watches through Chrono24 and have been very impressed with the platform so far until now. With TC-2708421, I did not receive the watch when Fedex said that it was delivered and that I signed for it. They even have a pic of some signature that said \"A Lee\". The seller Bob did the right thing and hunted it down and after almost 3wks we found it in one of their staging places.Chrono24 did the wrong thing and released the funds to seller the minute Fedex ticked the \"delivered\" box. What's the point of the Escrow? Luckily this seller was responsible enough but other sellers might not be, so Chronno24, you need to improve Escrow. Adrian", "rating": 3}, {"title": "I sent a question to Chrono24 and…", "text": "I sent a question to Chrono24 and didn't get an answer until I followed up on it. Also, the payment process wasn't clear. I had trouble at my bank because they insisted on having an address in Luxembourg for Chrono24, but Chrono24 doesn't have an address there. Finally another person at the bank was able to send it. Then Chrono24 rejected my MasterCard payment, because my bank doesn't use an extra security feature on MasterCard accounts. Chrono24 then asked me to send a photo ID and my card number. But then nothing happened and I had to follow up again with Chrono24. I was left with the impression that my file had been forgotten, because the charge went through on my credit card immediately after my call.", "rating": 3}, {"title": "Payment very difficult to process", "text": "Payment very difficult to process - doesn't support Apple Pay, charges extra for Amex....no PayPal option.  If your Visa/MC doesn't support the \"enhanced identity\" features you can't use it.  Charges US customers 5% to purchase.  Will not purchase via this site again.", "rating": 3}, {"title": "Not thrilled", "text": "I was very surprised with the fee charged, most items for sale any fee is paid by the seller not the buyer.The seller was great and walked me through the process", "rating": 3}, {"title": "Good luck in the future", "text": "Date of experience: September 22, 2020", "rating": 3}, {"title": "Poor experience", "text": "Date of experience: September 21, 2020", "rating": 3}, {"title": "Bad experience", "text": "I have bought a watch (quite expensive price range), off of a dealer from chrono. The watch was as described and as seen on photos, except for the fact that it smelled, not only smelled, it reaked of cigarettes, the only possible solution being, to replace a watchbelt with a new one...Thats is an feature that cannot be verified over the photos, especially problematic when buying online, without possibility of inspecting the item in person first...", "rating": 3}, {"title": "Be careful of the new sale fee of 7 percent", "text": "Be careful of the new sale fee of 7 percent. They said his is new after August 2020. Also be care when you paid. Their  office is in UK. Wire change is for over sea  rate  is you located in USA, even the item you get is from next state.  So do credit charge may cause you foreign transaction fee. Customer service is  of no help.Had  get  few watch  through them.  I may need to look for another way to get watch.", "rating": 3}, {"title": "Great to look and learn but would buy another way.", "text": "Easy to find a watch and verify a good vendor.  When it came to locking in the final price the vendor ghosted me and basically got to pay more.  If it was not a  gift I would have gone to another vendor and or done the deal at another site.  Not the best way to buy a watch in my opinon.", "rating": 3}, {"title": "I received the watch.", "text": "I received the watch.Yet, the cover falls off.I have no idea if it is due the shipping process or other", "rating": 3}, {"title": "Good products but services not as expected", "text": "Communication is delayed, price has been changed from $ 875 to $ 1021; shipping delayed also.First Contact Chrono 24 was in July 31'20, and package has been received by Aug 14 '20", "rating": 3}, {"title": "You had 5 stars until I made the last…", "text": "You had 5 stars until I made the last watch purchase and you charged me a sales fee ahead of the implementation date and without informing me ahead of time that a new charge was being implemented. Then you wanted to charge 7.5% instead of the stated 5%. It took me a while to get it corrected.", "rating": 3}, {"title": "Incredible Selection!", "text": "Their selection and pricing is wonderful, but the communication is not at all what I would have expected. As someone purchasing a higher-end item from overseas for the first time, it was not at all made clear that I may have to pay hundreds of dollars in additional fees once the item entered the US, in order to have it delivered to me. Apparently, there was general information about this somewhere on the site, but it certainly wasn't prominent when I was browsing watches nor when I checked out. It seems I would have had to search it out, which I didn't know to do. I would have liked this made more obvious. I would not have ordered from an overseas dealer if I knew about the potential customs fees, which in my case totaled an additional $350!", "rating": 3}, {"title": "The seller was perfect but the…", "text": "The seller and the watch was perfect but the conversion rate used by Chrono24 is too high and unfair!!", "rating": 3}, {"title": "My experience is satisfactory", "text": "My experience is satisfactory but not outstanding. When you purchase such an expensive watch, you expect Chrono24 to contact you more often with a dedicated person to make sure everything went well... You should also, as a customer, be offered some advantages to increase customer's royalty... Chrono24 is a good website, for sure, but I expected more attention and dedication to customers.", "rating": 3}, {"title": "I would not recommend", "text": "I bought a Vacheron Constantin form the seller - the watch was shipped very quickly but arrived with a scratch. The seller maintains there were no scratches when shipping the watch but the watch was nearly wrapped in plastic cling film on arrival, hence I think it is most likely it was damaged prior to shipping. Regardless though, The seller did offer solutions - 1) return the watch with a refund or 2) send the watch to VC is Switzerland with the seller’s insurer covering the costs. The 1st solution did not work for me as the taxes I paid on the watch would not have been refundable on returning the watch. The second possible solution meant I would have had to send my brand new watch to Switzerland for a period of at least 8-9 months, hence not ideal. I reached out to Chrono24’s mediation team for help but they weren’t helpful. Hence, as things stand, I paid the price of purchasing from grey market sources (albeit from a retailer who is an authorised retailer). So, I’ve decided to keep the watch and move on and be more mindful of buying from grey market in the future. I will however send a note to VC outlining my experience with one of their authorised retailers. Kind Regards,Ghazi", "rating": 3}, {"title": "Charges on debit card should be…", "text": "Charges on debit card should be detailed and warned before transaction.", "rating": 3}, {"title": "Chrono24 should take charge and control of logistic", "text": "In my view Chrono24 should define transportation policy and logistic partner . The watch was sent by normal post and took 6 weeks to be delivered or better to reach the destination then I have to go and collect at the local post office .", "rating": 3}, {"title": "Chrono24 is just a platform connecting…", "text": "Chrono24 is just a platform connecting Seller and Buyer, holding your funds in an \"Escrow\" account (whatever that is). And if you have problems with an order, they will hang onto your money indefinitely regardless if your problem can't be resolved by the seller... So, if you buy, make sure that your Seller has a legit feedback/reputation/reviews and sells actively AND sends your item over DHL, UPS or FedEx.... DON'T accept anything else. I recommend to use PayPal only... which Chrono24 sadly doesn't offer... for apparent reasons. I will never buy over them again... too risky. I am still trying to retrieve $1890, had to inform the credit card department.", "rating": 3}, {"title": "I couldn't use the payment system at…", "text": "I couldn't use the payment system at checkout because they don't accept US credit or debit cards, this was very frustrating. They did send me an email saying I should be able to use an alternative payment method but that did not work either. I has to move money between accounts before I could pay causing a delay, luckily the dealer understood and even suggested what I might use. Now I know about it, it should not be a problem next time, but it is still a hassle. Other than that the process is a good one and the Chrono24 system works very well. I do like the service.", "rating": 3}, {"title": "It was very difficult to use AMEX to…", "text": "It was very difficult to use AMEX to pay for the watch. A Chronos rep told me that it would let work on my IPad and that I had to use a computer, to which I don’t have access. Finally I arranged a conference call with Chris - another Chronos rep who was very helpful and who acknowledged that the problem was on the Chronos end, and my AMEX rep, and it finally went through. But the process was not user friendly and much too time-consuming.", "rating": 3}, {"title": "Chrono24 was great. Prestige Luxusuhren GmbH, not so much.", "text": "Chrono24 was great. The company doing the import (Prestige Luxusuhren GmbH) not so much. Several delays. Paperwork was not filled out to US Customs needs so timepiece spent 3 days in Cincinnati before continuing its travels. The importer had a Seychelles phone number associated with my US number. Importer requested further information twice but in the end, I dealt directly with DHL and US Customs since the information wasn't making it. Furthermore, US Customs required that I fill out the import paperwork since Customs didn't know what the item was, based on the invoice. I will not purchase from this importer in the future. Watch was scheduled for 29 June, arrived 2 July.", "rating": 3}, {"title": "Foreign transaction fees!", "text": "While my experience with my dealer was exceptional, I was dissapointed with Chrono24 for not telling me the transaction would be processed in Europe. Hence, I ended up paying 110 dlls in foreign transaction fees. Had I known that I would have just used another form of payment. The site is great and have a good system, but really need to be transparent on the fees!", "rating": 3}, {"title": "Surprise importation fee", "text": "I was unpleasantly surprised and disappointed when I was billed by FedEx for a $180.00 importation fee for the Casio watch that I recently ordered from the Merchant in Japan.  It would have been more appropriate to be apprised of this additional fee in advance of the purchase.", "rating": 3}, {"title": "Had issues paying for the watch", "text": "Had issues paying for the watch. Had to call to get my order through. Also I didn't know Chrono24 was a company from Europe resulting in a exchange rate credit card fee. I would have been great to have a little warning.", "rating": 3}, {"title": "He took long time to send the watch…", "text": "He took long time to send the watch that was paid over month ago.", "rating": 3}, {"title": "Good site but too expensive", "text": "Date of experience: June 28, 2020", "rating": 3}, {"title": "Not the greatest experience", "text": "I bought my watch from a shop in Rome. He assured me that the watch had had a service - which it had had, but a poor one. When I received the watch, it came with a \"guarantee\" card with no purchase date and an incorrect reference number. I went straight to a local horologist and they told me to send it back and ask for a full refund. I sent a message to Chrono24 telling them of the suspicions and they just told me to reach out to the seller. I decided to send the watch straight to the manufacturer, who then assessed the watch to find out that it had been serviced with the incorrect tools and very bad oils. Not the greatest experience shopping for an expensive watch, I have learned my lesson.", "rating": 3}, {"title": "I buy the brand new watch", "text": "I buy the brand new watch, however the accessories found damage and reject to replace parts.", "rating": 3}, {"title": "i think if seller sent a damaged item…", "text": "i think if seller sent a damaged item buyer shouldn't be the one paying for the return label.", "rating": 3}, {"title": "The watches and presentation are…", "text": "The watches and presentation are phenomenal. However, I was completely unable to pay on the Chrono24 site.  The pay page needs to be updated.  My dealer had to send me a PayPal link so I could pay.  I paid immediately on the PayPal site and then Chrono24 began to send me email after email stating I did NOT pay and that I must pay immediately. Not enjoyable when you have paid $6,550 and the entity claims you have not paid.  I bought a second watch and called Chrono24 help and they were incredibly professional and helpful. They adjusted the pay page and I was able to pay immediacy.", "rating": 3}, {"title": "CITES issues w shipping.", "text": "Seller had no idea what the CITES requirements were for a crocodile strap being shipped to the US. I had to resolve it on my own and it took a great deal of my time. I run my own business and my time is valuable. I may buy through chrono 24 again but  I wouldn’t recommend it unless they put more effort into making sure their sellers understand all shipping requirements. The seller did communicate well and also reimbursed me the price for the strap which was confiscated by fish and wildlife but the entire process  was unacceptable.", "rating": 3}, {"title": "Could have been a better system", "text": "I bought something here as a “trial purchase” for future more high end purchases. The platform looks promising for watch enthusiasts. Not so happy about it in the end.First and foremost, my Visa card (3 of them) doesn’t work.  Amex worked but has 2% surcharge.  The escrow service is shady.  After paying for the purchase, it doesn’t seem to know I bought the item and I’m getting email to “activate buyer protection”- why not do so automatically, everyone wants protection!  The platform doesn’t seem to know if transaction went through, I’m getting email asking about my inquiries- so how can a buyer be protected from frauds if your system doesn’t even keep track of successful sale and relies on reporting?No expiration on “suggest of price”.  Though this may not be binding, having an expiration time would make it clean and clear to nonresponding sellers. Verified dealers are also questionable.  It shows a shipping cost to USA but then a foreign dealer I contacted isn’t used to shipping and prefer in person purchase which ain’t going to happen.Lastly, I tried calling to cancel my “suggest a price” to non responding seller. No real person to speak to.  If a huge purchase went south, I would imagine it’s the same runarounds. With several layers of what seem inefficient or shady system, I wouldn’t buy anything 5 digits value through here at this point.", "rating": 3}, {"title": "You can't have 5 stars without pay pal…", "text": "You can't have 5 stars without pay pal paying metod.", "rating": 3}, {"title": "Bank transfer on the escrow payment", "text": "While my purchase experience with the seller was great, the experience with Chrono24 on the payment side was a bit less. I had some issue with using bank transfer for the escrow payment, and funds were sent back to me (which also cost me some transaction fee). I asked chrono24 support why the bank transfer did not work, as I followed their banking instructions but got no reply at all, even now after the purchase has been finalized. I switched to payment by CC and that went smoothly. But the time wasted during the bank transfer (about a week) and the nervousness caused by not knowing if it was successful or not was, is something I would not want to go thru again.", "rating": 3}, {"title": "Chrono24 is really good if you are the…", "text": "Chrono24 is really good if you are the buyer, but if you advertise here, you cannot sell it anywhere else without paying them their cut. Even if you decide to keep a watch, they will fight you for their cut.", "rating": 3}, {"title": "Okay so far", "text": "Okay so far, quite alright.", "rating": 3}, {"title": "Quite a lot of frustration and impoliteness.", "text": "Surely Chrono24 is the biggest market for watches, but some of the things about the experience a completely strange, annoying and frustrating.One of the simplest things is system's reaction if you've contacted more that one seller with desired watch. Which is super normal if you are going to spend several thousands on expensive watch, right? You want to compare everything, ask additional questions and so on. But later on Cgrono24 starts to ask questions like 'did you buy this watch?' and later on pushes you to 'add watch to the collection'. Yep, as if I'd bought 5 same models. Interface and the whole thing is done in such a way that you're pushed to press 'yes', especially if you're not extremely attentive, as if some KGBguy on the other side tries to catch your lies. That way they try to figure out if you've bought the watch not through Chrono24. This is completely stupid and frustrating. Not even sure what would happen if I'd press 'yes' occasionally, since I did bough 1 watch out of possible 5 options, s the question with a photo 'did you buy this watch?' is not about 'did you use THIS dealer?'.Also at times Chrono24 does make phonically to ask if you bought a particular watch and this is over the top. They do not set up a call with you on agreed time. As if it is hard to assume that somebody who is buy-in a luxury expensive watch might have a tight schedule. Once I was called almost during the other meeting and even though I did point it out to a lady that I am busy she just pressed on more aggressively if I did do a purchase!!! Who came up with idea that it is a good way to talk to customer in such way in a field of luxury watches? There are other little things here and there which are strange, like if a dealer is impolite, or does something odd, you cannot do anything if you did not purchase a watch. This is stupid as well. Obviously there must be some protection for dealers. But if you see a strange or even suspicious dealer there should be a way to point that out, at least somehow. But no, somehow you have to go all the way and then thy will try to step in if something goes completely wrong.", "rating": 3}, {"title": "Five star if we can get it fixed.    They stand behind their product.", "text": "The watch does not kept the right time. It’s adding about four hours every two hours.  My brietling jeweler is looking at it Wednesday.  I hope all is well. I really enjoy the look of the watch.", "rating": 3}, {"title": "Okay", "text": "Okay, so far not sure and uncertain .I am new in dealing with Chrono24 Company.", "rating": 3}, {"title": "Seemed like the purchaser would be the…", "text": "First time purchase and it was made to sound like the purchaser would be given time to verify purchase and condition of watch. But, as soon as fed ex dropped off delivery, the purchase was automatically confirmed and funded to dealer. luckily everything was in good shape. Chrono24 should specify that the purchaser should verify content prior to signing fed ex as that is the only time given prior to funding dealer, which in my opinion is not enough time.", "rating": 3}, {"title": "Consistent Payment Difficulties", "text": "Inability to have different delivery and billing addresses complicates would should be a simple payment process and delivery process.  I live in a different country from my banking country and the payment platform does not recognize or allow for  this global reality.It confuses the seller and complicates would should be a relatively simple purchase.", "rating": 3}, {"title": "I had a lot of troubles with the Dealer…", "text": "I had a lot of troubles with the Dealer himself thats why the 3 stars. However I have nothing but good things to say about Chrono24 itself. Its a very reliable platform that can guarantee that you won't lose your money if you use trusted checkout. Also my negative feedback to the seller never appeared to his page.", "rating": 3}, {"title": "Website functionality needs some work…", "text": "Website required going back and forth several times. Also, customs was expected but \"Brokerage fee\" was not mentioned until AFTER I made purchase.Clean up the website functionality and I will be happy to use again.", "rating": 3}, {"title": "I found  it difficult to contact them…", "text": "I found  it difficult to contact them with telephone and I feel alought it was in terms and conditions somewhere,first time users like myself  should have been pointed out the part about tax issues concerning money being paid out on timepieces coming into the country and I was not given my discount of buying at £7100 ipayed more than that and the timepiece was in bad shape", "rating": 3}, {"title": "Chrono 24 response", "text": "Chrono 24 response was lacking,,,,, there never was a follow up with a person! they were always automated messages,,,, Their response was more of a automated this is what could happen with old watches so just live with it. Never did anyone actually reach out and contact me or to my knowledge read any of my emails to the seller. I received a Venus 170 movement 18 karat gold watch that would not run through the evening.", "rating": 3}, {"title": "They do mediate in the event of a…", "text": "They do mediate in the event of a misunderstanding but the 6.5% commission is very high in my opinion.", "rating": 3}, {"title": "Good service", "text": "Good service, could be better in some aspects.", "rating": 3}, {"title": "Good, but have had at least one delivery mishap...", "text": "Pretty good when I can find a communicative and proactive seller. I have had one bad experience so far with a watch gone missing in tracking... Major FedEx delays with no visibility over delivery date = not ideal.", "rating": 3}, {"title": "Great but expensive platform", "text": "The platform and service is great to reach the world of serious watch buyers and sellers but the 6.5% commission for private individuals is too high and should also be capped at a certain amount.", "rating": 3}, {"title": "Delivered late", "text": "I bought a watch that said it was available on the site, however, since it was used they decided to change the band.  I told them when I paid for the watch that I needed it on a specific date that was two weeks away.   It was coming from Japan to USA. Long story short,  holding up the shipment and then US customs made the watch late by sever days after my daughters 18th birthday, during the pandemic quarantine", "rating": 3}, {"title": "Ordered a watch from the UK", "text": "Ordered a watch from the UK. Took 3 weeks despite $75 delivery charge.  They were very responsive with the communication, however the company and seller seemed unaware that a \"watch worksheet\" was necessary for customs.  Fed Ex called me and I had to send them the paperwork, and send multiple follow up emails to resolve the matter.Hopefully an aberrant occurrence.", "rating": 3}, {"title": "Good products of course, BUT...", "text": "Good products of course, and helpful people, but a very cumbersome purchasing process.  It took three extra days and having 3 perfectly good credit cards declined before I was able to even order the watch.", "rating": 3}, {"title": "Impossible to get money back from…", "text": "Impossible to get money back from Chrono24 if watch is not sold.", "rating": 3}, {"title": "Support for private sellers can be…", "text": "Support for private sellers can be improved", "rating": 3}, {"title": "Fedex suppliers should be bettre ones", "text": "Date of experience: April 13, 2020", "rating": 3}, {"title": "In this recent purchase", "text": "In this recent purchase, I had to pay an amount just short of £1000 in import duties, bringing the total price to me to £5400, as opposed to the advertised £4400.This could have been pointed out in advance, but wasn't", "rating": 3}, {"title": "Box missing watch manual", "text": "Watch was in good condition and looked new. In the listing the seller stated that a Certificate of Authenticity can be requeted, whch I did request, but when i received the watch, there was no Certificate and when i asked for it, the seller was slow to respond. Also, the box was missing the watch manual. I asked the seller for the manual and I asked Chrono24 to help and I'm still waiting for a resolution. I may change my review after I receive the watch manual. This is my first time using Chrono24 and waiting to see how they are going to resolve this issue as the mediator or middleman in this transaction. I will wait and see before purchasing any more watches through them.", "rating": 3}, {"title": "Good service but unexpected charges", "text": "First time using the platform and overall I am pleased with the service and link with the dealer that I bought that watch from. What wasn't clear to me was the charges applied, without disclosure or explicit permission, for the use their Escrow/platform service. This was applied to my bank account after the delivery was confirmed. Given that I was working to a budget and price point, this was a surprise and  disappointing. Maybe think about full disclosure before purchases are confirmed?", "rating": 3}, {"title": "Good price, slow delivery", "text": "Good things about this dealer:- Very good price.- Answered my questions. Bad Things:- Did not uphold the original delivery date. When I bought the watch it was supposed to be in stock and be delivered in december. Yet, due to multiple delays it first arrived in late february.- The dealer did not give me a clear arrival date at any point. - On a minor note; the english of their personnel does leave something to be desired. I would still recommend this dealer if you are willing to wait.", "rating": 3}, {"title": "Watches are not vetted and vendor did…", "text": "Watches are not vetted and vendor did not commit to the general obligations promised by Chronos. Although after the fact actions where somewhat good, the service level good be way better. Too little support of the customer.", "rating": 3}, {"title": "Payment difficulties", "text": "My experience was great because of the seller. I don’t understand that you can’t pay the transaction with and international credit or debit card. Only can pay with PayPal but if you are from another country and want to buy and receive the product in USA is almost imposible because the shipping address has to be the same as the billing address. You must check this problem.", "rating": 3}, {"title": "The dealer is prompt in replying.", "text": "The dealer is prompt in replying.The package took some time to be delivered to HK due to the postage service. Package is okay. The only thing I would probably add to consider for improvement is that the watch was placed in the box without any plastic or protective layer. Purpose: prevent any scratches during delivery :)Thank you very much", "rating": 3}, {"title": "Delivery issues", "text": "Sometimes you want a watch but the overall delivery is not what you expect it to be. I hope the delivery issues could be solved. I want to buy a watch and purchase it on the fly without any hesitations that it would be delivered trough my door step, without any issues what so ever...", "rating": 3}, {"title": "Product and seller great - Mangopay is awful.", "text": "The watch that I purchased was great, as was the buyer.  My complaint stems from you use of Mangopay, which I found to be cumbersome and annoying.  Just use paypal, like everyone elese on the planet!", "rating": 3}, {"title": "Do it the way you used to", "text": "I, as I have said, am very annoyed that you have changed, or are trying to change, your search format. I wonder if your I.T. guys have convinced this you this will save you money. It won't.Your search format was GREAT. It is now...fair, at best.But, then again, I've said this before to no result.So do I think this will cause you to reconsider?No, I don't.", "rating": 3}, {"title": "UNION Belisar, Overall satisfied with the purchase", "text": "Overall satisfied with the purchase, the watch looks fine and works ok. I was looking for this discontinued model for a long time. Yet, seller claimed the watch was new/unworn, witch was not. It had visible signs of wear on the case (bezel at 6) and on a screw on the side of the case. Also seller said it works within COSC specs... -8,-10 sec/24h is far from that. A real and sincere description of the piece would have been appreciated.", "rating": 3}, {"title": "Great website with lots of positives.", "text": "Great website with lots of positives.Unfortunately keeps asking me to review the same dealer multiple times despite having already submitted review.Did not accept my credit card even though payment was cleared.Took a long time for my direct bank transfer to clear.", "rating": 3}, {"title": "Not too happy that from Denmark", "text": "Not too happy that from Denmark, we can only pay in DKK and not in EUR. The difference is about 5% for Bank Transfers, money which Crono24 scores additionally.", "rating": 3}, {"title": "Didn’t do much to resolve the issue I…", "text": "Didn’t do much to resolve the issue I had with a faulty watch. I ended up contacting the dealer direct and had him pay part of the watch repair/service.", "rating": 3}, {"title": "I say average to low", "text": "I say average to low. The processes with the seller were excellent. The process and guidelines with Chrono24 were not as seamless as I would expect. Several of the guidelines afforded the seller and buyer should be reconsidered.The refund process is also not a seamless process either. Our bank does not take 5 days to post a refund.The purchase process is completed instantaneously yet, I'm finding it difficult to expect the same process for a refund.", "rating": 3}, {"title": "Forex Headaches", "text": "I kinda like their website and client service (although it takes 2-3 reminders if query is difficult,  as I discovered from a recent transaction), but hesitant to buy more due to foreign exchange charges. If I ship to Canada, buy from the USA and have a USD credit card, I should not be FORCED to convert to CAD and pay a 2.5 % fee. Plus another 2% extra if I pay on Amex. This is an international set up. Just simplify by accepting Paypal,as your biggest market is perhaps the US. We're spoilt here with 'ease of doing everything'. I buy watches frequently, and would buy more if problem resolved,  and clarity obtained as to how vendors are approved. As an example, one seller of a PP Gondolo on C24 says his watch is unworn, whereas the SAME watch on EBay is being sold as used. What gives ?", "rating": 3}, {"title": "Good connecting site, but", "text": "Good connecting site.  Just a heads up, depending on the CC you use, there may be a \"foreign transaction fee\" of 3%.  Although you may be dealing with a US dealer (if that is the case), and in US dollars, the CC company considers it foreign since you actually transact with Chrono24 who then pays the dealer. Just be sure to figure it into your price competitiveness decision. I tried to use AMEX gold which charges no fee but Chrono up charges 2.5% for AMEX cards. I did not see any of this disclosed anywhere by Chrono24.", "rating": 3}, {"title": "Bad exchange rate when paying through Trusted Checkout", "text": "Everything went smoothly in my purchase through the Chrono24 web. But there are issues that left me with a sour taste.One thing that I would suggest to improve: display clearly that when you buy abroad the taxes that you will behave to pay when the watch enters your country will be at least the VAT and maybe higher. You mention that there can be taxes but I have not found a reference of how much can it be.And the one thing that I really didn't like is that when I paid through Trusted Checkout, instead of paying the $ amount of the offer, I had to pay in € at a really bad exchange rate. So in effect the Trusted Checkout commission has been much higher than expected.", "rating": 3}, {"title": "Note the name.", "text": "I misspelled the kanji in my name. It's uncomfortable.", "rating": 3}, {"title": "Nice service with payment issues", "text": "Nice service, very smart Trusted Checkout system with one drawback considering payment provider, which blocks transfers from credit cards marking them 'unreliable' basing on some internal reasons and procedures. Chrono24 promises to fix it.", "rating": 3}, {"title": "All was good till I received the watch…", "text": "All was good till I received the watch without warranty card !!", "rating": 3}, {"title": "Wrong Currency", "text": "I didn't understand why I had to pay in US$ when the price was quoted in Euros", "rating": 3}, {"title": "No historical pricing available.", "text": "Your company needs to starting allowing users to view historical pricing or listings that have sold. Consumers cannot be informed unless they know what watches have sold for, and hiding this information allows for manipulation of the market among sellers. I understand this is a platform for both buyers and sellers, but it should be an equal playing field. Dealers can see what other dealers are asking for price wise, and buyers should be able to see what other buyers have paid.Otherwise, this is certainly one of the best platforms out there for buying watches.", "rating": 3}, {"title": "Chrono should have better control of…", "text": "Chrono should have better control of what is offered. 50% of the time the piece you want to buy is marked at available and when you buy it you get an email that it has just been sold.Otherwise a great platform.", "rating": 3}, {"title": "Communication is very poor.", "text": "Date of experience: January 06, 2020", "rating": 3}, {"title": "While Chrono24 seemed to work with…", "text": "While Chrono24 seemed to work with customers, I had a bad experience. The Omega watch I purchased showed up on Christmas Eve. I wore the watch on Christmas for about an hour before the back plate and gasket fell off the watch. Upon taking it to a local Omega dealer I found that it will cost me an additional $328.00 to bring it up to industry standards. I am willing to give Chrono24 another chance although I will be far more cautious.", "rating": 3}, {"title": "Chrono24 seems to be a passive…", "text": "Chrono24 seems to be a passive middleman / market / broker. I had one seller fail to deliver and one deliver. In my experience, it seems Chrono24 is entirely hands off and not responsible for any transaction success or failure.", "rating": 3}, {"title": "Great medium but not clearly displaying…", "text": "Great medium but not clearly displaying what you buy in terms of scratches or damages.", "rating": 3}, {"title": "Unfortunately the watch I purchased got…", "text": "Unfortunately the watch I purchased got lost by the courier (TNT) they found it a week later but during this period I found the help chrono24 provided was sadly lacking. I will not use chrono24 again.", "rating": 3}, {"title": "Overall the platform was pretty smooth", "text": "Overall the platform was pretty smooth. The escrow process was a bit unusual in that they didn't wait for me to confirm I received what i ordered and that there is no mention that the escrow is going to be overseas. Therefore I paid a foreign exchange fee to my CC costing me extra money for an order that was shipped from the US to the US. Had they told me that the escrow was going to be out of the country and in a different currency I could have used a card with no fees. When I inquired afterwards I got a generic response.", "rating": 3}, {"title": "take few days to await chrono24…", "text": "take few days to await chrono24 confirmation on payment. message to seller, seller also inform me chrono24 abit slow, especially on weekend. nothing can do, only to wait", "rating": 3}, {"title": "One great experience and one disaster experience", "text": "My first purchase through Chrono24 was seamless.  The process of purchasing was efficient and easy to navigate the website to connect me with the right buyer who had the watch I wanted,.  If fact, I am currently wearing the first watch I purchased using Chrono24’s website. However and sadly, my second purchase shortly thereafter was not a pleasant experience, primarily due to the dishonest nature and the vendor misleading me about the watch.  I’ve been collecting watches for over 30 years and this is the first time I’ve ran into challenges with someone that was quite slick and did not fully disclose issues that any buyer should be informed of prior to purchasing a watch even after I asked a number of times.  He clearly stated to me the watch was in “Perfect” working order and will come 100% complete.  After I gave this vendor a negative review, he contacted me immediately in an unprofessional manner and was in fact quite angry.  Trying to coerce me into changing my negative review.  There was a difference of opinion. However, at the end of the day, this vendor did Not fully disclose issues with the timepiece or missing bracelet links even after I specifically asked if the watch will come complete with “Everything”’, as if i were to purchase the watch new.  Upon the timepiece arrival, the Chronograph was not functional and bracelet links were missing.  When I inquired, his comment was “Well, I received it that way” and “The Chronograph must have been damaged during shipping.” That is definitely misleading the buyer.  As a long time collector we want the watch complete ie. No missing parts.  To top it off, I had to have the watch I just purchased be completely repaired and serviced by the manufacturer.  He claims the watch Chronograph was functioning perfectly prior to shipment and it must have been damaged during shipment,  I’ve owned  many Chronographs over 3 decades, so I understand what kind of motion can damage a Chronograph.  The package delivered did not have a single mark or dent in the corrugated box.  The watch inside the watch box was vacuumed seal in a suspended position away from the outer box walls again with the outter box zero signs of dents or even scratches.  My point being that this timepiece Chronograph complication was not functioning properly prior to shipping.  In the end, I have a watch I had to pay extra to have it serviced and now missing links which cannot be found as the watch was a limited production of only 250 pierces.  If I want to obtain the correct number of links would require me to purchase a brand new bracelet at approximately $1,500!  After this fiasco, I did not want to speak to this dealer any further.  Again, to make matters worse the retaliation after my negative review just made me feel uncomfortable.  Basically, indicating he did nothing wrong and we should correct the problem in order for me to remove my negative review.  He claimed to want to help resolve AFTER my negative review.  Who in their right mind would want to do further business with a misleading dealer, just so he can rid of my negative review?  I think Chrono24 should remove this dealer from their roster.", "rating": 3}, {"title": "except for one suspicious sale in…", "text": "except for one suspicious sale in Spain, my experiences have been very good.", "rating": 3}, {"title": "I dont appreciate the funds being…", "text": "I dont appreciate the funds being automatically disbursed when the item was delivered, before I was ever able to negotiate a problem with the seller about a misrepresented item.", "rating": 3}, {"title": "Great system, needs more policing of descriptions", "text": "I keep getting asked for feedback, and always giving the same response is starting to get a bit wearisome now. But here goes: great system - but I need to see evidence that they are cracking down on the description cowboys.", "rating": 3}, {"title": "Good platform terrible customer…", "text": "Good platform terrible customer services take days to answer you back no instant chat service and a being in germany will cost alot of money to get hold of them quickly.  Not good for a big company probably the slowest customer service i have encountered", "rating": 3}, {"title": "Hi Chrono24,", "text": "Hi Chrono24,I purchased two (2) watches, both where advertised with original boxes and books. Unfortunately the boxes where only standard Pulsar boxes and not original for these watches as they where a \"limited edition\" and no books supplied. OK, that's maybe why the price was so good but still not as advertised. After opening the watches, on one the light and alarm did not work. After looking online this seems to be a battery issue.. already on a brand new watch? I rang the Chrono24 number and left a message, but no reply. I created a mediation request and requested a return or replacement, however all I heard from the store was to take it for repair.. the end.Well at least it was only two (2) Pulsar watches and not a Richard Mille. I am sure you have many thousand successful transactions, unfortunately I can not say this from my experience with your site.Kind regards, Michael.", "rating": 3}, {"title": "There is sometimes problem in…", "text": "There is sometimes problem in communication. For example I ask a question in English and they answer me in Italian because I order a product from Italy But I don’t speak Italian. Some other time I ask a question in Greek and nobody understood what I was saying.", "rating": 3}, {"title": "Communication", "text": "Communication was not very good. There was two queries mailed to Chrono24 that was not answered. No response at all.", "rating": 3}, {"title": "Long delivery time than expected", "text": "Date of experience: December 02, 2019", "rating": 3}, {"title": "Good Business Model Bad Execution", "text": "Your business model is amazing in idea. It connects all sorts of buyers and dedicated sellers around the world. However, your fundamental flaw currently is your execution. Purchasing my Patek was a very tedious affair, I filled up the immigration forms 5 times because FedEx didn’t relay information properly to me. But also, the delegate for Chrono24 was not aware on what had to be done when they called me early mornings and late afternoons. Being a middle person, the responsibility lies on the mediator to facilitate the transaction as most of us aren’t importing thousand dollar watches everyday.", "rating": 3}, {"title": "the watch bracelet was missing links", "text": "the watch bracelet was missing links, it was fitting a very small wrist.It was not explained by the seller. Consequently, I had to buy more links.", "rating": 3}, {"title": "The watch was shipped well and arrived…", "text": "The watch was shipped well and arrived on time, I do have to get it serviced by Breitling because the seal wasn’t working and the crown wasn’t tite which is frustrating right after the purchase.", "rating": 3}, {"title": "Very good overall but lack of communication", "text": "Overall great service. But issue with the bank payment which i called several times about, no-one called me back, i had to follow up myself with my bank. I was told Chrono24 would get back to me, but not once did they.", "rating": 3}, {"title": "Escrow good, descriptions vary", "text": "Escrow system works well, and your money is safe from disappearing sellers. Good dealers have the opportunity to showcase their wares in a way that helps the buyer. But sales descriptions are extremely variable in quality and extent. The site does not police this, so it's still buyer beware. You need to know what additional questions to ask the sellers. If you don't return a bad buy within 14 days, you're on your own.", "rating": 3}, {"title": "the check for fund received took…", "text": "the check for fund received took several days. which is slow.", "rating": 3}, {"title": "I am disappointed to just one thing But !!", "text": "I am disappointed to just one thing. Because, radio control function is only Germany, so I can't use it in Japan. It was my mistake to didn't ask about it before order. But, I'm happy to get the nice watch which nice disign and many functions.regards,", "rating": 3}, {"title": "Proper site for vintage watches", "text": "Proper site for vintage watches and to assess the true market trends. However, they have a tendency to protect more their sellers than the buyers. Disappointing  experience with their customer service.", "rating": 3}, {"title": "No right to return any item sold by a…", "text": "No right to return any item sold by a Private Seller. General enquiry responses very slow.", "rating": 3}, {"title": "Import Duty", "text": "It would be very helpful if you can implement a process in which the approximate import duty that a buyer has to pay for an item if the buyer is an overseas buyer. Because in my case, the amount of duty that I had to pay was exorbitant and shocking.", "rating": 3}, {"title": "I made the mistake of not trying out…", "text": "I made the mistake of not trying out what size Band was on my watch Unfortunately the watch did not have the same amount of links a OEM watching has.", "rating": 3}, {"title": "The watch can’t open pls call seller…", "text": "The watch can’t open pls call seller don’t sell to customers, Jz wasting customers time", "rating": 3}, {"title": "Website is great but several phone…", "text": "Website is great but several phone calls to New York and Hong Kong were never answered even though it was work hours.", "rating": 3}, {"title": "I was disappointed with the way…", "text": "I was disappointed with the way Chrono24 dealt with me and two other watch purchases I made through Chrono24.  They rejected my payment for these two watches and did not explain to me why the payments were stopped.  Also I am still waiting for the VAT on my watch purchase, that was successful, to be returned to me.  Chrono24 have the VAT amount but have yet to return it to my credit card.", "rating": 3}, {"title": "There should be flexibility in…", "text": "There should be flexibility in determining the currency of the transaction. While I live in Canada I wanted to pay in USD and could not. This is very rigid. The clearing of my wire payment took too long. ( 4 days)", "rating": 3}, {"title": "Item have scratch", "text": "Item have scratch, need to return and buy again. How the platform could help customer or sellers to avoid such time consuming process. Maybe by have more strict policy on selling damage item?", "rating": 3}, {"title": "In some cases bad in some cases good to…", "text": "In some cases bad in some cases good to excelent. I will buy no more from Italians and Americans. Germans are the best to trust. Bye", "rating": 3}, {"title": "Finally I have found the watch with the…", "text": "Finally I have found the watch with the right leather bracelette I have been looking for for years. And I was convinced I had chosen the one with leather bracelette from a Dutch dealer. When I got the confirmation, picture was posted with iron bracelette and yes, I was concerned and wondering to caccel the order. So I was unsure and checked the offerings of the model and the one of the dutch dealer with leather bracelette had disabeared. As such, I was convinced I had chosen the right one and that the picture shown in the confirmation was the a reference picture. Thas assumption proved to be wrong. Otherwise, procedure was ok. Watch I received was all well and very quick and I have now MY watch with certificate and everything. But no the one with the leather bracelette. What shall I say Chrono24 ???", "rating": 3}, {"title": "Excellent service by Chrono24.", "text": "Date of experience: October 02, 2019", "rating": 3}, {"title": "Good price, but...", "text": "Good price, took 3 months to receive watch after payment", "rating": 3}, {"title": "Lacking in support", "text": "Process was ok, but support is very lacking. I don’t know why it took them 2 days to verify my payment even though they already charged my account. No way to call in and help speed up that process. I email support a few time for different reasons and got zero responses. For a company that wants you to spend tens of thousands it’s not very efficient.", "rating": 3}, {"title": "My last purchase went smoothly with no…", "text": "My last purchase went smoothly with no issues.Unfortunately the previous (attempted) purchase, the seller never completed the transaction or ship the watch. I brought this up with Chrono24 but never even received a response to my message from them. Without knowing that staff will step in when an issue arises, it does not leave me feeling this is any more trustworthy than any other online sales site.", "rating": 3}, {"title": "The charging process is very opaque", "text": "The charging process is very opaque. My 7500 euro purchase ended up being 7800+ euro and their simple explanation is that it is due to currency conversion, which is beyond the limits of any conversion rate I experienced in previous purchases. I believe there are hidden charges.", "rating": 3}, {"title": "Chrono24 team did not respond to my…", "text": "Chrono24 team did not respond to my inquiry as to how to change shipping address", "rating": 3}, {"title": "The process went well", "text": "The process went well. But the app have too many reminder. Even just a day after negotiating app would just try to ask to confirm purchase. Pretty annoying", "rating": 3}, {"title": "Service is ok and trustworthy, responsiveness could be better.", "text": "Service is ok and trustworthy, but they do not answer all messages. I have asked questions and help recently, with no response.", "rating": 3}, {"title": "Incredible amount of inventory", "text": "Incredible amount of inventory. However when I had a shipping issue with the seller and contacted Chrono24 I did not ever get a response which regardless of the seriousness of the individual case is highly unprofessional.", "rating": 3}, {"title": "Telephone support is readily available", "text": "Telephone support is readily available, but refund process was somewhat slow and required repeated calls.", "rating": 3}, {"title": "After I bought the item", "text": "After I bought the item, Chrono24 reveals that I overpaid for the item. I would have thought you would tell a buyer before we make a purchase.", "rating": 3}, {"title": "Don't blindly trust in the Guarantee of Authenticity", "text": "Chrono24 makes promises that are not practiced well. The guarantee of authenticity gives the burden of validation to the buyer with minimal support of the Chrono24 staff.", "rating": 3}, {"title": "reject my TC for no reason", "text": "Date of experience: July 09, 2019", "rating": 3}, {"title": "I like the protection but not happy with the bait and switch", "text": "I like the protection but not happy with the number of watches I have tried to buy which looked like good deals and then the vendors claimed were already sold.  This is BS and clearly an attempt to bait and switch to more expensive watches.  Chrono24 needs to police this and drop vendors who do this.  Every other company is able to update inventory real time when it is sold. NOTHING should be for sale on this site that is not still available!", "rating": 3}, {"title": "Payment release too late", "text": "I do not like how much time is needed for payment release. Since buyer got my item, money was sitting for 8 days on top of that in escrow for no reason. Payment should be released day after buyer confirmation that item has arrived as expected.", "rating": 3}, {"title": "Poor communication", "text": "Chrono24 never responded to two emails. Nothing.", "rating": 3}, {"title": "Great concept", "text": "Great concept, a shame that the app crashing constantly, especially while typing in textfields like this. To find the right trustworthy dealer, ask them question and request further pictures, to seperate the serviceminded, from the not so.", "rating": 3}, {"title": "Creating an ad was simple and…", "text": "Creating an ad was simple and straightforward. I had good response rate and managed to sell it no problem.The fees can be lower though. It was a buzzkill for the sale as it chewed up my profit.", "rating": 3}, {"title": "Difficult to avoid poor exchange rates", "text": "Difficult to avoid poor exchange rates. I would have preferred to use my TransferWise account but this was not available on C24", "rating": 3}, {"title": "It's a good service that could do more…", "text": "It's a good service that could do more to build community. Would love to work there.", "rating": 3}, {"title": "Tiring transaction", "text": "Seemed like a lot of hoops to jump through to be vetted to make a purchase. I understand security but the entire process was exhausting.", "rating": 3}, {"title": "why do you ask me if I bought the watch…", "text": "why do you ask me if I bought the watch when I used trusted checkout? get it together", "rating": 3}, {"title": "Very difficult to use a credit card as…", "text": "Very difficult to use a credit card as Chrono24 credit card service provider doesn't take some cards.", "rating": 3}, {"title": "Can you trust Trusted Checkout?", "text": "I bought a watch using trusted checkout.Now my experience was positive, I got the watch in time, it was authentic and as expected.However Trusted Checkout doesn't wait for the receiver to confirm the watch has been actually received, but relies on the Parcel Service confirmation. This means that if they send you no watch or a counterfeit watch Chrono24 releases the payment anyways and you're left to deal with the issue later. Not exactly the protection against fraud I was expecting...", "rating": 3}, {"title": "Use carefully", "text": "Let me first say that I admire the people who opened this business and I would recommend them just watch the process.I used a credit card that was good but it was rejected and this is where it got sticky. I used a different card so there would be no issue and had problems. It is here the confusion got more confusing. On a previous purchase I was required to use a bank draft and I did not want that again as it costs more.I then got mixed signals was told to do one thing checked the purchase it showed ok and ended up in limbo. Messages were slow and overlapping.  I gave up. Then the watch came back available and I put in for it. This time a secure source to use a credit card was recommended but process was confusing and then I decided to call. From here things went well. They stayed on line till all was done. The credit card went through immediately. The lady on line made it happen. Bottom line the on line process and answers were slow coming and added to issues.", "rating": 3}, {"title": "Happy to sell via Chrono24...", "text": "Surely happy to sell via Chrono24, but...well, the commission is just too much recent years - all things considered. About half commission would have been 5 stars here for me!", "rating": 3}, {"title": "Good site", "text": "Good site. Lots of information on it.", "rating": 3}, {"title": "I found the Wire Transfer process…", "text": "I found the Wire Transfer process unclear and cumbersome---European Wire information on Chrono 24 website did not clearly translate into US bank wire requirements at Wells Fargo.", "rating": 3}, {"title": "Cumbersome and superfluous", "text": "Cumbersome and superfluous. Would have been easier to negotiate directly.", "rating": 3}, {"title": "Purchase was more expensive probably…", "text": "The watch was more expensive than the price displayed for the purchase (+4%) probably due to double exchange of currency. I did not get clear answers why the price went up that much independent of the fees my bank charged me for currency exchange.", "rating": 3}, {"title": "Not a bad experience", "text": "Not a bad experience. Return process was an ordeal and their communication was vague and uninformative when I asked questions. Still, when the return went through my money was refunded in about a day, which is a great turnaround.", "rating": 3}, {"title": "I got  nice watch at a good price of…", "text": "I got  nice watch at a good price of $4850.00, I live in the US.  I was surprised that my bank charged me a 3% international transaction fee because it was processed thru a foreign bank.  Fortunately, I was able to get them to waive this fee. You need to advise your customers that they may get charged this fee when they use a credit card.  On an expensive watch purchase this fee could be very high.", "rating": 3}, {"title": "On the \"adding watches\" to my…", "text": "On the \"adding watches\" to my collection feature, there are a lot of my watches that don't appear.  I can sort of understand in the case of older watches, or limited editions; but some of these watches are not that old, and not uncommon.", "rating": 3}, {"title": "the search engine is not accurate", "text": "the search engine is not accurate, as the description of items.why don't build a database with the most popular models for brands in order to have a more accurate description ?", "rating": 3}, {"title": "Unfortunately", "text": "Unfortunately, Iz was unable to sell my watch on this site. The site is fantastic and the customer service is exceptional. However, I just don’t  think enough potential buyers look at this site in the US.", "rating": 3}, {"title": "Overall trade was very satisfactory…", "text": "Overall trade was very satisfactory only if chrono 24 could be more responsive or even interactive to queries", "rating": 3}, {"title": "Complaint /concern", "text": "The system is good but I  called quite a few times to the hK office number but never got a real person reply.In fact, i never got a proper reply except directly from the watch supplier. please check why that happened and i like to get a personal feedback really", "rating": 3}, {"title": "Stop with all the pop-ups.", "text": "Date of experience: March 11, 2019", "rating": 3}, {"title": "Chrono24 needs to find a way to clamp…", "text": "Chrono24 needs to find a way to clamp down on sellers who do not advertise their watches correctly. I have no idea how they can go about doing this, but the sheer number of bogus descriptions and lousy photos, in my oppinion, are crippling the legitimacy and doubt-free buying experience of this app. I guess this is an open market so buyer beware! ..and buyer be-eductaed enough!", "rating": 3}, {"title": "Feel like I’m being harassed", "text": "Feel like I’m being harassed. So many emails regarding offers made. Incoherent online experience.", "rating": 3}, {"title": "Did not communicate well with delayed…", "text": "Did not communicate well with delayed shipments.", "rating": 3}, {"title": "I found it tough to call you ppl.its my…", "text": "I found it tough to call you ppl.its my experience more then email or chat best way to win over deals is to talk !its my suggestion talk to ppl can create trust most important in this kind of business also bring more awareness as too what the customer or buyer really needs !", "rating": 3}, {"title": "This was my first time buying through…", "text": "This was my first time buying through Chrono24 and was a little skeptical but the process was smooth and the seller was very easy to work with. The only issue I had with this process is that Chrono24 did not make it clear that the transaction would be made through Germany and a foreign transaction fee would apply. Since there is a headquarters in New York City this is less clear for US buyers. The fee was only 50 US dollars but it was something that was unexpected. When I emailed Chrono24 regarding this issue all they said was take it up with my bank since they charged the fee. However I feel this is an issue with Chrono24 since they are a web based company and they should be clear at checkout where the transaction is taking place so we know if this is a foreign transaction. So the first time experience was maybe ok, certainly not perfect.", "rating": 3}, {"title": "Payment made Jan 18 received Feb 23", "text": "Payment made Jan 18 received Feb 23. Time mentioned at order time was 2-3 weeks. It was challenging to track my package arrival at Doha. Upon box opening I experienced that watch straps are smaller.  Replacement with larger straps would attract additional cost to me. :(", "rating": 3}, {"title": "System glitches spoiled the experience.", "text": "I agreed a price with the dealer but the Chrono24 check out process was showing a higher figure so we had to go through the process again, but I was also getting repeated automatic emails about the aborted transaction. The system should have recognised the second transaction had superseded the first as it was for the same watch. It was also very alarming, once I had paid for the watch so see an indicated 14 day delivery period. The watch actually arrived in 4 or 5 days.", "rating": 3}, {"title": "Communication is bad all around..", "text": "Communication is bad all around... sellers and Chrono24Either no responses or woefully slow ones", "rating": 3}, {"title": "too slow responding to queries", "text": "Date of experience: February 19, 2019", "rating": 3}, {"title": "Things like safe and trusted payment is…", "text": "Things like safe and trusted payment is very reassuring to potential buyers. Also, Chrono24 is a one-stop shop for a world of watches! But much more is needed to be done in terms of having sellers market their watches properly. The base template and product description for watches displatyed is greatly flawed. Sellers often have no idea what they are selling and cannot input accurate information. For instance, when filtering through the search fields for a watch of a particular size, almost half the quantity of watches are grouped in the 'no details' part. This field should be easiest to determine as all you need to do is take a metic ruler to the watch case and measure. This is much easier than determining the era that the watch was produced in for example. So really, Chrono24 needs to crack-down on the accuracy of information provided by the seller and really hold them to a higher level of accountability. The consequences for not are that a buyer can request a refund based on a watch sold with innaccurate information - and I'm sure this happens more than Chrono24 would like to admit. Anyways, this really needs to be addressed because buyers like myself shouldn't have to rant about issues like this. The company offering the services should be forward thinking and make necessary changes to promote a better buying experience for its clients - the buyers - US! Come on Chrono24, be better than ebay. You have far more potential!", "rating": 3}, {"title": "Had some issues with purchasing using…", "text": "Had some issues with purchasing using one of my credit cards. My bank said it had to do with the Chrono24 verification process. Ended up using another credit card but was definitely not a smooth transaction.", "rating": 3}, {"title": "Checkout was a pain in the a$$ due to…", "text": "Checkout was a pain in the a$$ due to some 3d verification process used with Mastercard, but wasn't even available currently to initiate with Mastercard.", "rating": 3}, {"title": "limited services for Russia", "text": "Date of experience: January 29, 2019", "rating": 3}, {"title": "Suggestion for increasing Chrono24 dealer reliability and quality", "text": "Some dealers back out of a transaction after accepting the offer. Chrono24 just notes that \"the transaction was cancelled\" which is not adding to the reliability of the site or dealers offers.This should not be possible and these \"trusted\" sellers -mostly professional dealers- should be banned here.", "rating": 3}, {"title": "Still waiting on a refund", "text": "Date of experience: January 25, 2019", "rating": 3}, {"title": "While the individual sellers are good…", "text": "While the individual sellers are good to deal with, I've had payments refused by Chrono24 which has necessitated me having to wait for the return of funds before trying another payment option, thus causing delays in purchasing items. If a certain payment method is going to be rejected, it shouldn't be made available in the first place.", "rating": 3}, {"title": "Mediation probably won't help you", "text": "Very hard to reach the call centre.  An average waiting time of 15 minutes. Not sure if the mediation services will ever help the buyer. I had a small misunderstanding with a seller (sent empty box by mistake) and contacted the mediation team. Not sure if they did or would  do anything but the issue was solved directly with the seller some days later.", "rating": 3}, {"title": "Taking too long in respiring…", "text": "Taking too long in respiring overcharges that Dealer has agreed to.", "rating": 3}, {"title": "the search service and communications…", "text": "the search service and communications link is outstanding and I have made two purchases through Chrono 24.  I am disappointed that I was charged $83.00 US more than the 6300 Euro purchase price after it was converted to dollars with out apparent recourse.  I paid as requested by Chrono 24,  The seller could not answer why it was charged that amount.  Other than that oversight I am pleased with the service.", "rating": 3}, {"title": "Generally a good experience", "text": "Generally a good experience, but they don't accept all credit cards. (In my case, a Visa card issued by Chase.) An email to them trying to resolve the problem did not receive a response. I finally gave up and used another card, which did not offer the same benefits.", "rating": 3}, {"title": "Slow at answering emails", "text": "Slow at answering emails, and slow service in returning funds for returned items. No explanation as to why it is slow, or what the delay is. No personalized service, granted it is an app based program, so maybe I am expecting too much. Polite otherwise, and not difficult to make transactions occur, just SLLLOOOOOWWWW service.", "rating": 3}, {"title": "Their marketplace offers quality and…", "text": "Their marketplace offers quality and security.  I was frustrated in the payment process when my US credit card was not accepted.  This forced me to pay by wire, raising my cost.", "rating": 3}, {"title": "Buyer Brilliant! Chrono24 Confounding.", "text": "The buyer was great, but the Chrono24 fee structure and communications were confounding. I have no idea what the fees are going to total until the transaction is completed. They really need more ad and sales fee transparency for me to put 5 or 6 figure watches on their platform.", "rating": 3}, {"title": "I had a bad experience when I sold one…", "text": "I had a bad experience when I sold one of my watch.   This was because when I proposed an offer to my potential buy, the escrow charge that the buyer had to pay had mislead me.  While the escrow charge had to be absorbed by the buyer, I should not need to take care and did not need to know.  However, as such piece of information had shown on the screen, I had accidentally included the cost in my calculation.  Given I had already sent out the watch when I discovered the problem, your company did not help me to contain the problem but just advised me to request the buyer to pay me back the escrow charge.  Although the buyer had promised to pay be back, I still had not received the refund at the moment.", "rating": 3}, {"title": "No payment, no communication!", "text": "My problem was when I sent my watch by courier and delivery was confirmed, there was no communication from Chrono24 and after 7 days (Payment period for escrow service) I received nothing. This went on for several more weeks and sending numerous emails, I still received no payment and no communication at all.I eventually had to telephone head office at considerable expense, and finally resolve the problem.This has happened twice - the long wait for payment and complete lack of email replies.", "rating": 3}, {"title": "They were not open to help me.", "text": "Date of experience: December 14, 2018", "rating": 3}, {"title": "Despite some confusing messages…", "text": "Despite some confusing messages concerning my client account it all went well in the end ;-)", "rating": 3}, {"title": "get rid of the app download spam", "text": "Date of experience: December 01, 2018", "rating": 3}, {"title": "It works", "text": "It works. Easy to check and compare a lot of different watches. I can reccommend it.", "rating": 3}, {"title": "Reservations About the Trusted Checkout Process", "text": "I have some reservations about the Trusted Checkout process created and managed by Chrono24. I think Chrono24 should not release the funds to the Seller until AFTER I VERIFY that I find the watch acceptable.  This should be done asap after delivery and inspection of the watch, within the 14 day hold period.The process now is Chrono24 sends an email asking for confirmation that the watch is delivered. Confirming delivery lets all parties know the watch has arrived safely. Chrono24 does not release any funds to the dealer until after the 14 day withdraw period is over, in case the Buyer is not satisfied with the purchase and mediation is required.Instead, Chrono24 should send another email after delivery is confirmed, verifying that I accept the watch and the condition it is in. In this way, when I notify acceptance of the watch, they can release the funds to the Seller ... this is a fairer process for both Buyer and Seller.Perhaps the 14 day wait period is easier for Chrono24 because it requires no action by them, and money in escrow account can earn interest during the entire transaction process, and that interest is paid to Chrono24 ???", "rating": 3}, {"title": "Marketplace should require consistency…j", "text": "Marketplace should require consistency in the info they require dealers and sellers to include. The site allows sellers to pick and choose what they fill out. Also requiring at least one “real” picture of the product for sale would be nice. And a more obvious way to contact customer service. It’s a new site so problems are to be expected. I’ve still purchased a couple of watches from this market.", "rating": 3}, {"title": "I would want a better level of protection", "text": "I would want a better level of protection, like one I have used eBay/PayPal services. I had a sense that if the deal would be problematic Chrono24 won't be able to help me.", "rating": 3}, {"title": "No replies", "text": "Occasionally, I send messages to the support team but never get a response past the default \"we have received you inquiry and will replay as soon as possible\"", "rating": 3}, {"title": "Currency conversions", "text": "I had already converted sterling to eurocurrency to pay the dealer but Chrono24 refused payment in euro currency...for reasons that I still fail to understand.Take care not to pre-empt payment instructions until Chrono advise you to do so otherwise you may end up paying two sets of currency conversion charges, as happened to me.", "rating": 3}, {"title": "First time user", "text": "I called . No answer. I left a message. No call back and it takes days to get response on email.These things reduced my confidence when making my first purchase on Chrono24,,But everything went well and the system works", "rating": 3}, {"title": "Chrono24 should make site easier for…", "text": "Chrono24 should make site easier for buyers and sellers to check price easier for both buyers and sellers. I notice the rates and price agreed were not so accurate somewhat due to poor communication, perhaps. Only for international buyers (out of Europe) like myself can communicate and understand perfectly with UK and US sellers.", "rating": 3}, {"title": "Great site but beware how you pay", "text": "Great site and easy to find what you are looking for and complete your transaction.  The issue was the payment is routed through a non United States entity and depending on how you pay, you may get hit with considerable fees from your bank or credit card.  Mine was an extra $320!", "rating": 3}, {"title": "The delivery was too long", "text": "The delivery was too long, longer then indicated when I made the payment. There was no information or explanation of the delayed delivery. The watch arrived in good condition and fulfilled my expectation.", "rating": 3}, {"title": "I was charged with aprox 30euro for a…", "text": "I was charged with aprox 30euro for a don’t know what.The price was 1265euro , including transport.I was charged with aprox 1295-1300euro.Because chrono24 kept my money , and after the transaction , they paid the seller.Both the seller and i , where from the samecountry.I paid in RON , and chrono charged me in euro , at an exorbitant currency , far from normal.I paid in RON , because de price was in RON.After they transformed my RON in EURO , they paid the seller in RON again , after changing again from EURO to RON.I don’t know why......The normal currency is 1 EUR = 4.65 RON and i paid 1 EUR = 4.83 RON.It isn’t the end of the world , but they could mentione this somewhere , because if i knew this , i would pay the watch directly in euro , from my euro account.", "rating": 3}, {"title": "Chrono 24 did not make the fact I would…", "text": "Chrono 24 did not make the fact I would be charged a fee to purchase as clear as it could have been made.", "rating": 3}, {"title": "Escrow account was a foreign…", "text": "Escrow account was a foreign transaction so I was charged additional fees. Would have just used a different CC if I'd known, but most of my CCs were declining for expected fraud.", "rating": 3}, {"title": "Does not seem to accept credit cards issued by Chase", "text": "For some reason, their e-commerce credit card provider does not accept credit cards from one of the largest US issuers, Chase.", "rating": 3}, {"title": "I have a problem with the payment.", "text": "I have a problem with the payment with Chrono24 because they don’t recognize Puerto Rico as part of the United States Of America. Wich it is. If you are born in PR you’re an American citizen by birth. But the problem was solved and I have my watch.", "rating": 3}, {"title": "You delay the refunds and looks that…", "text": "You delay the refunds and looks that you protect the seller instade of the purchaser who is the one that produces your income.", "rating": 3}, {"title": "Good platform overall", "text": "Good platform, but took longer than expected to clear out a wire transfer, and while the Customer Support staff was nice, it was a bit slow to answer. Other than that, I'm satisfied with the provided service.", "rating": 3}, {"title": "MEASURES AND RULES THAT SHOULD BE TAKEN BY CHRONO24", "text": "THE PRIVATE SELLERS, EVEN ANONYMOUS SHOULD ALSO BE PUBLICLY RATED, TO INFORM THE BUYERS.SHOULD NOT BE ALLOWED ANY OFFICIAL OR STOCK PHOTOS OF THE WATCHES.ONLY ALLOWED REAL AND RECENT PHOTOS FOR EVERY SELLER EVEN PROFESSIONAL ONES.SHOULD NOT BE ALLOWED PHOTOS TAKEN WITH VERY FEW LIGHT AND VERY FAR AWAY FROM THE CAMERA LENS.AND SHOULD BE IMPERATIVELY MANDATORY BE TAKEN PHOTOS FROM ALL SIDES OF A WATCH.I ASKED ONE OR TWO QUESTIONS, AND I RECEIVED STANDARD ANSWERS, SO I NEVER GOT ANY REAL ANSWER.", "rating": 3}, {"title": "After agreeing a price with the Spanish…", "text": "After agreeing a price with the Spanish dealer the automated responses did not make it any clearer as to how I should proceed. The dealer himself was more helpful.", "rating": 3}, {"title": "Why no American Express?", "text": "Why no American Express?  I went through two days of headaches dealing with security problems (Verified by Visa and 3D for Mastercard) on both of my cards, and in the end I had to do an international wire transfer at my expense that caused further delays, and headaches.If Chrono supported Amex, I would have had the payment go through in 10seconds, the seller would have gotten his money quickly, and the product would have been in my possession the previous week.  I would happily pay an extra fee to use AMEX.Seriously, rich guys who buy 10k watched all have AMEX cards...Personally, I will avoid Chrono24 in the future if at all possible due to this issue.", "rating": 3}, {"title": "Recent purchase", "text": "It was very difficult to get my credit card authorized to process a transaction through Chrono24. It took almost one hour.  Hours of phone customer service in the US are very limited. For the amount of the transaction, I was expecting a flawless process and a 24 hours support.", "rating": 3}, {"title": "payment verification took days", "text": "Date of experience: August 28, 2018", "rating": 3}, {"title": "Foreign exchange confusion", "text": "There was unnecessary confusion over the conversion of my funds into another currency.This was not requested as I had deliberately sent the currency of the seller.It was all resolved eventually but I had to send several long and detailed emails explaining why they were wrong. Service was just satisfactory.", "rating": 3}, {"title": "BE WARNED,,,", "text": "On one occasion the transaction did not go to plan with a dealer, because the watch was not functioning correctly, I took it up with Chrono24 and the dealer and basically got nowhere, even when I sent a message Chrono24, saying I would send the watch to Omega repairs for a valuation, I was told by Chrono24 I could not do that, even though the dealer message me before, and stated it had been service and everything  was good, I even offered to send it too Chrono24 so they could inspect the watch, which they declined, saying we do not inspect watches, we are just a forum site too sell!So in my opinion, if something goes wrong Chrono24 will sit on the fence an side with there dealers, not allowing you too prove your case, and end up costing you money, so before you buy, check and recheck and then check again and any doubts about a seller do not buy. David H Bowers", "rating": 3}, {"title": "Poor communication when there's an issue", "text": "Date of experience: August 06, 2018", "rating": 3}, {"title": "did not know that Chrono charged an…", "text": "did not know that Chrono charged an international fee in addition to the sellers cost.  If I knew I would not have used Chrono24", "rating": 3}, {"title": "Very inconsistent,Very difficult to…", "text": "Very inconsistent,Very difficult to communicate,I still have no answer of two watches tha  I bought were returned more than $10000 and I don't know what going on.I need my  money Back.One of the watches never was delivered and was returned by fedex trac.#772636150584,a Breguet. item # TC 790952.The other arrived broke Maurice Lacroix I accepted to return it to be fixed ,I retuned  USPS 9468903699300003463440 ,the seller received it and I don't know wha'ts  going on.I hace bought other Watches from you I am a good costumer so please HELP HELP HELP", "rating": 3}, {"title": "In the end the experience was not bad", "text": "In the end the experience was good. Originally the website didn't inspire confidence. I asked them a question and I got a responce a week after saying the qyestion was lost in their sysyem. In the end I managed to buy the watch I wanted in a fair price.", "rating": 3}, {"title": "Overall Chrono24 was ok", "text": "Overall Chrono24 was ok, I had issues with my payment via credit card being declined by Chrono24's payment service and would recommend asking what the best option is before paying. Chrono24 was very responsive to questions.", "rating": 3}, {"title": "Chrono24: You need better payment system", "text": "Chrono24 is amazing for helping you find your watch, but is equally amazing in its frustration to purchase it. I understand that combatting fraud is a major concern for them, but as a result (1) they only accept visa and mastercard payments that can be 3d-verified and (2) they don't accept American Express. So if you have chase cards, like I do, which don't participate in 3D verification or American Express, your only way to pay is to do an international wire transfer, which they hold in escrow, and so you're adding another $50 of fees on top of the purchase price. They really need to fix this.", "rating": 3}, {"title": "Chrono24 - recommended pre owned watch market place, which needs some tweaks", "text": "Chrono's watches collection is the  most complete one; escrow payment facility makes the settlement much easier (especially for expensive watches) since normally buyer does not know the seller well.But Chrono's responses to inquiry is very slow, 24 hour per reply at average. Calling in to the Germany office is not always easy.And the supports staffs is not knowledgable enough on international remmitance process, which is not supporting the payment thru escrow account.One more feedback, C24 needs to provide dropshipper service.", "rating": 3}, {"title": "The payment process was painful and…", "text": "The payment process was painful and communication was slow.I am told the first was the hardest. otherwise a great site and I would recommend.", "rating": 3}, {"title": "Not entirely satisfactory.", "text": "Sent a number of emails all of which which were acknowledged but two were  not answered during the purchase process.", "rating": 3}, {"title": "Cross currency transactions not transparent.", "text": "The watch price was displayed in GBP, so I made and offer in GBP. The seller was in Germany so their counter offer back to me was in EUR, with no GBP conversion. I used a market rate to estimate the cost to me in GBP, but it was only after I accepted the offer in EUR that Chrono24 showed me the cost in GBP. They use a terrible FX rate and the watch cost more then expected. I offered to pay in EUR and was told that was not possible unless dealt with the dealer directly. I didn't want to do this as I liked the safety of using Chrono24 payment escrow service. I would have given 5 stars if Chrono24 presented the counter offer back to me in GBP before I was committed to the purchase.", "rating": 3}, {"title": "No response to emails", "text": "Date of experience: May 29, 2018", "rating": 3}, {"title": "Please reduce commission fee for chrono…", "text": "Please reduce commission fee for chrono 24 dealer. It will more conbinience of trade for us.", "rating": 3}, {"title": "My 1st experience using a website in…", "text": "My 1st experience using a website in charge of handling sell of products between people.The watch I received is back to the dealer because it stopped working after one night... Not really an issue and dealer is for the moment not reluctant at all in repairing the item and it looks like I have good contacts with him.Nevertheless, all of this is now done out of Chrono24 control and I can't imagine what may happen if it goes into problem while repairing the watch I have now paid.So as a result, my 1st impression is that Chrono24 is only a site allowing people to get in touch, nothing more. But it is done with a cool and clean web interface \"giving the impression\" this site is doing more. Not the case and obviously not clear at all I think.Hopefully, products are nice and problems shall be solved...", "rating": 3}, {"title": "too many unnecessary emails.....really…", "text": "too many unnecessary emails.....really not sure how does Chrono24 help me if someone ships me a fake watch", "rating": 3}, {"title": "Charged vay", "text": "Charged vat for importing outside from EU. Of course this makes sense but it was not brought to my attention until I got a call from customs", "rating": 3}, {"title": "Payment had to be made in HKD even…", "text": "Payment had to be made in HKD even though the Seller was accepting USD.  Furthermore, the exchange rate used by Chrono24 from HKD to USD was not good.", "rating": 3}, {"title": "Expected more from Chronos support", "text": "Expected more from Chronos support, but it was slow, bad communication and little comprehension to buyers needs.Chrono needs to learn more about transnational (customs) purchases.Best Regards,FSh", "rating": 3}, {"title": "We can not split payment to an escrow…", "text": "We can not split payment to an escrow account and due to restrictions by Chinese government this will limit business opportunities in the long run and we have to deal with the sellers direct.", "rating": 3}, {"title": "For some reasons rejected my Visa card…", "text": "For some reasons rejected my Visa card in the beginning.", "rating": 3}, {"title": "The website provides a service that is…", "text": "The website provides a service that is needed today but the customer service in US is simply not acceptable. I was waiting for them to solve an issue for so many days the seller sold the watch I ordered somewhere else. Also there was a bug where my personal data changed without me doing anything relevant!The platform needs to mature technically and they also need to invest in much better customer support.", "rating": 3}, {"title": "Fine functions", "text": "Date of experience: May 03, 2018", "rating": 3}, {"title": "USD transaction done in Euro", "text": "My experience with Chrono24 was adequate at best. This comes from the fact that I purchased an expensive watch from an American company using an American credit card and was charged in Euro.  The exchange rate was not favorable and wound up costing me close to $300 dollars extra than I had planned for.  I wish I could choose the currency to be charged in so I can avoid this in the future.  :(", "rating": 3}, {"title": "As of this date lacking real help for a…", "text": "As of this date lacking real help for a customer with a problem due to a seller's mistake.", "rating": 3}, {"title": "No help in settling an unnecessary…", "text": "No help in settling an unnecessary shipping charge incurred by the ineptness of a seller as of this date.", "rating": 3}, {"title": "I deal through trust check-out", "text": "I deal through trust check-out, but I found before I comment the watch and press the receipt button.  It shows deal completed after the watch arrived. I thought Chrono24 will confirm with me if the watch is right before paying to the seller. Otherwise, if I received a rubbish, you also complete the deal automatically after it arrived, then why I need to use trust check-out and remit the money to Chrono24 but not the seller directly.", "rating": 3}, {"title": "Excellent seller but some issues with Chrono24 itself", "text": "I was disappointed in Chrono24 and its website for two reasons:1. UNFAVOURABLE CURRENCY CONVERSION: Chrono 24 does not make it plain on the website until you’ve actually agreed to buy a watch and get to the checkout that payment can only be in the currency of your country of residence. International sites for many other products let you choose the currency in which you wish to pay.  It’s absurd that a buyer cannot pay in the vendor’s currency in which the selling price was originally set. Living in Australian and being forced to pay in A$, as calculated by the unfavourable Chrono24 conversion rate, instead of US$ (the seller was in New York) I paid 10% more in real terms. On a luxury watch, that’s a lot of money.2. PROFESSIONAL SELLERS UNDERMINED BY THE BAD ONES: Luxury Horology, the seller from whom I bought my watch, was excellent in every way. However some of the other Chrono24 sellers to whom I had previously emailed enquiries  either fudged facts and would not answer questions directly or didn’t reply at all. If Chrono24 screened who they allowed to sell on the site more thoroughly it would stop  slippery operators tainting the reputation of the good ones like Luxury Horology who conduct business with integrity and professionalism.", "rating": 3}, {"title": "Almost a great service", "text": "The only issue I have that may keep me from using Chrono24 is the payment options. Since the money is not held in the US it costs me extra to pay.", "rating": 3}, {"title": "Foreign transaction fee", "text": "My seller in Chrono 24 was super nice. However, I did not know Chrono24 would charge me a foreign transaction fee. The fee will be kind of pain in the neck if you buy a high price of watch.", "rating": 3}, {"title": "Great selection of watches, terrible currency interface", "text": "Great selection of watches and some neat features. Points are deducted because of an extremely confusing and almost hostile currency system. I can only make offers in MY local currency. Seller can only make offers in THEIR local currency. The amount to pay into escrow is in a completely THIRD currency (presumably Chrono24’s). Additionally, despite advertising escrow is a free service (for the buyer), a percentage was added to the final price (which is hard to figure out given the THREE currency conversions that took place). Not unreasonable, but no where was I shown what the fee was, and what the requested amount for the watch itself was. (Which again was converted from one currency to another, so no way to know the exact amount). So in conclusion: great marketplace, large selection, great sellers, but Chrono24 should figure out currency if they want to sell multi-thousand euro watches.", "rating": 3}, {"title": "My main concern was with the monetary…", "text": "My main concern was with the monetary transaction and processing of Canadian funds into an Escrow account.  More precise directions should be provided when executing a Global Transfer Payment.  Customer service personnel were accommodating and professional.", "rating": 3}, {"title": "Slow to credit wire transfer to their…", "text": "Slow to credit wire transfer to their escrow account. It could most assuredly be done quicker than 3 business days, at this level of technological advancement.", "rating": 3}, {"title": "Made a bit of a hash in trying to match…", "text": "Made a bit of a hash in trying to match up payments, which should have been an easy task, but managed it in the end", "rating": 3}, {"title": "The trusted checkout system is…", "text": "The trusted checkout system is excellent. The main problem is that there seem to be a lot of listings for watches where, quite often, the product is not available, so the listing is misleading . On two occasions I have had to contact four sales outlets before I have found one which can fulfill my order........", "rating": 3}, {"title": "There was no notice on the web page…", "text": "There was no notice on the web page that I ordered the watch from about all the shipping charges that I was responsible to pay to get my purchase through Customs.", "rating": 3}, {"title": "Needs to standardized shipping prices", "text": "Needs to standardized shipping prices, as they can vary greatly, I have seen differences ranging from free, to over 200 US dollars shipping to USNeeds to provide more info (easy to understand) in terms of duties & shippingWhen do buyer/seller cover all fees? Should be plainly stated", "rating": 3}, {"title": "Not fully support to the buyer.", "text": "Date of experience: February 22, 2018", "rating": 3}, {"title": "Speedmaster", "text": "Initially tried to purchase my watch with a trusted seller. Had to cancel the order due to lack of communication and no receipt of the watch. The fact that a trusted seller could offer really appalling service was worrying. However, by using a different seller the process was fast and painless. 3 stars seems a fair reflection.", "rating": 3}, {"title": "Mixed experience", "text": "When things went as planned the website worked well. However when a dealer increased the price and I wanted to cancel the order it took a while to get a response to emails, although everything was subsequently sorted. However it was only luck that I hadn’t made payment already.", "rating": 3}, {"title": "Use bank transfer not Visa..............", "text": "Overall my first experience buying through Chrono24 was fine apart from my Visa payment being refused for some obscure reason, the first time it's ever happened to me buying anything. Did me a favour in the end as the Visa fees were a ripoff and the international bank transfer fees were a fraction of the cost and the transfer went through smoothly..............don't use Visa!!!", "rating": 3}, {"title": "When I received my watch it did not work", "text": "When I received my watch from a verified dealer the watch did not work. I have managed to come to a solution now which involved the dealer paying to service the watch, however this was not a result of Chrono24’s help. When I called them they asked me to contact the dealer to try and come up with a solution. My dealer - Watch Vault NYC - was great and I have, as stated, come to a solution to the problem now. However, I did feel as if Chrono24 could have done more to help by trying to sort out a solution for me when I first contacted them as this is what should be expected. They do have a great website though and are definitely a good price to find the best offers on watches and I’m sure if worst came to worst they could have refunded my money for the watch I bought, but I just thought that maybe more could have been done on their behalf to help resolve my situation.", "rating": 3}, {"title": "Slow communication", "text": "Slow communication. Could have used a better, more timely explanation of how the escrow process works on my individual purchase.", "rating": 3}, {"title": "Support responses from Chrono24 are …", "text": "Support responses from Chrono24 are slow and lack helpful insight.", "rating": 3}, {"title": "I had a really bad experience with a so …", "text": "I had a really bad experience with a so called trusted seller in Portugal.It was suppose to be a trusted seller.Nothing more far from the true.I think Chrono24 should be more careful when it comes to rate dealers and sellers.I ended it up paying custom fees and shipping fees for inaccuracies on the made by the dealer, since the seller refused to correct their mistake and considering that Chrono24 cancelled the transaction.", "rating": 3}, {"title": "need inprovement", "text": "Chrono 24 is a good thing, but feel that it needs fine tuning/inprovement, when I needed to pay for my item, I needed help with money transfer, and I was given a short time pay after accepting an offer, and when I needed help I emailed them, only then to be told that I would not get a reply for 7 days, which was not helpful when I had to pay before then", "rating": 3}, {"title": "My Experience with Chrono24 is Mixed", "text": "Chrono24 has sellers on their site that probably don't have the watches in stock that they are selling.  As a seller, their costs are very expensive.", "rating": 3}, {"title": "Good, but with slight delay in payment processing", "text": "Payment processing was somewhat slow over the Christmas holiday period, took 2 days longer than I had expected.", "rating": 3}, {"title": "A little frustrated", "text": "Would have been more impressed if Chrono24 had called the seller directly to find out why the watch I ordered had not been dispatched within the  time-frame promised, rather than just forwarding my emails on to them. I did not anticipate that I would have to call the seller directly. The watch was a 50th wedding anniversary present for my husband and I would have been very disappointed if it had not arrived in time.", "rating": 3}, {"title": "Initial sale was good....but.....", "text": "Initial sale was good. Tried to buy again from same seller, but failed. Turned out it was Chrono24 issue with my countries \"security system\" that rejected my credit card.Not good enough.", "rating": 3}, {"title": "It takes a lot of time to answer my …", "text": "It takes a lot of time to answer my questions.", "rating": 3}, {"title": "Washed hands if any responsible", "text": "Washed hands if any responsible.  Not sure if I would trust using a non dealer.  No ownership of issues.", "rating": 3}, {"title": "I am very pleased generally", "text": "I am very pleased generally, however I consider a lot of potential customer time is wasted by  trying to determine case size...this could be improved upon by clearly stating the case size of the watch  in initial picture.Regards,John.", "rating": 3}, {"title": "Unexpected foreign transaction fee for …", "text": "Unexpected foreign transaction fee for escrow.  Was not completely disclosed - and cost me extra that was not anticipated.", "rating": 3}, {"title": "It's a great idea and generally works", "text": "It's a great idea and generally works, but keep sending me erroneous messages, e.g. messaged me saying order cancelled due to non-payment, after I had paid and dealer was preparing the watch for shipment. Caused a bit of panic, but dealer was able to see I had in fact paid already.", "rating": 3}, {"title": "poor communication from chrono24.", "text": "poor communication from chrono24.. but the escrow works well.", "rating": 3}, {"title": "I have 3 purchases behind me", "text": "I have 3 purchases behind me; 2 which were International. While things went relatively smoothly when buying from a business, the purchase from a private seller was disastrous.My problem with Chrono24 is that it offers no help in realizing this type of transaction; yet it takes fees from both parties to the deal. To be a first class watch-buying site with a great experience Chrono24 should be interceding with private sales to help get the deal accomplished. Until it takes more responsibility in seeing the transaction through it gets 3 stars from me.", "rating": 3}, {"title": "Refund", "text": "Still haven't had my refund?", "rating": 3}, {"title": "I had a problem accepting the terms and …", "text": "I had a problem accepting the terms and conditions and there was some delay in responding to my requests for another link to be sent to enable me to initiate my account with Chrono 24", "rating": 3}, {"title": "While I got the watch I wanted I found …", "text": "While I got the watch I wanted I found time between paying and actually having the watch in my hand was frustratingly long. I purchased a watch from Watchfinder here in the UK  pay one day wearing the next. I'm not sure if it was the fault of Chrono 24 or the dealer. Never the less 6 weeks from ordering to wearing seems too long.", "rating": 3}, {"title": "Your listed New York phone number there …", "text": "Your listed New York phone number there is no one  answer. I called a few times even left my number but no one called back", "rating": 3}, {"title": "The so called trusted checkout is …", "text": "The so called trusted checkout is pretty much a self service. Noone actually contacted me asking if everything was right or not. No info was provided on what follows when a payment is made so you feel somehow left out, especially if the seller is also not too kin on talking about any of the details. As a paid service I would expect a bit more info and attention, however the trasaction was sucessful and that is the most important thing. I have saved 1000 eur buying from chrono24 and not from the local AD for basically the same watch.", "rating": 3}, {"title": "Payment process challenging with foreign entities.", "text": "Had trouble with the payment process through Chrono24. Credit card company would not allow payment because of 3D and a foreign entity. Seller said this is a common problem when paying through Chrono24. It made the payment part of the transaction frustrating.Otherwise, Chrono24 was easy to use with great communication applications and documentation.", "rating": 3}, {"title": "Poor Shipping Experience...", "text": "For what I had paid you,Chrono24, I would have expected some involvement by you when I and Billy had to deal with UPS and their way of communicating their delivery and customs information to me and Billy...", "rating": 3}, {"title": "Good", "text": "Good,easy to use, but the TC (Trusted Checkout) seems not working with some regions;So wish you good luck with more improvments...thanks", "rating": 3}, {"title": "The Chrono24 payment system has some …", "text": "The Chrono24 payment system has some issues.  The staff was able to point me in the right direction, but it's too much work to have to call each credit card company to allow a payment to go through.  I almost gave up on a purchase until the last credit card company I called was able to contact the right person and allow the payment to go through.The good and bad part is that Chrono24 has an extra level of credit card security which may require USA purchases to request authorization from the credit card company to allow the payment.  The problem is that out of the three cards I have 2 of them didn't even know what I was talking about.  The last one understood, but it required them to reach out to Visa security to allow the payment.  Too much work.", "rating": 3}, {"title": "Ratings are not based on actual …", "text": "Ratings are not based on actual consumer satisfaction.", "rating": 3}, {"title": "Arrived Rolex Oyster Perpetual", "text": ".I purchased a Rolex Oyster Perpetual.  There was some mistakes by the seller including sending me an email to say I had received the watch. However this was rectified and I did receive the watch.  It looks OK.  But I will update this message when I have verified the authenticity of the watch.", "rating": 3}]