[{"title": "Pine Pollen / Thors Hammer", "text": "I give Lost Empire Herbs 5 stars for dispatch time but the herbs that I tried, so far, have not made a significant difference. ", "rating": 3}, {"title": "I have now been taking pine pollen for…", "text": "I have now been taking pine pollen for about a month. I have seen no real changes. I’m not giving up. I will continue to take it for the next three or four months to see if it has any help for me but as far as the company goes excellent service fast shipping. ", "rating": 3}, {"title": "I dislike that I received this message…", "text": "I dislike that I received this message asking for a review before I got a tracking number confirming my package has shipped. That’s a big deal to people. Did you communicate with our team? NoHow was that ?Not sure yetDid you take our quiz? Was that helpful?It made everything more convenient, thanks for that!Was checking out easy?It was Did you find our site, blog posts, and categories useful to your shopping experience? I did. When will Goji Berry freeze dried concentrate organic (250 grams) be back in stock?", "rating": 3}, {"title": "Mushroom Brain Tincture effects", "text": "Been taking the mushroom brain tincture everyday since mid July and on my second bottle. The only thing noticeable at this time is I do feel a little calmer, so that in itself is keeping my BP in check.", "rating": 3}, {"title": "Maybe quicker shipping.", "text": "Date of experience: September 10, 2024", "rating": 3}, {"title": "Not as good as it used to be.", "text": "The website was really slow and seemed to be hung up and my internet security kept warning me that your website had dangerous activity going on. I had to log out once or twice. I needed a couple bottles of Nettle Root Tincture and the website said there were only two left so I added them to my cart. When I went to pay it told me there was only one available and I needed to change my order. This was frustrating because I had just received the email about the sale that morning. So now I'll have to return at a later date to buy more at regular price and probably pay shipping as well. I've run into this problem in the past because it doesn't seem like there is enough stock to support running sales. Also, shipping seems to be taking much longer ever since you moved the shipping point from Salt Lake City to Kansas City.", "rating": 3}, {"title": "Products seem to be good quality", "text": "Products seem to be good quality.  Time frame from ordering to receiving is slow ! There is only 1 standard shipping method so it takes at least a week to receive order once placed .  There is no potency description on the bags to help with actual dosage which should be considering the high prices.  A lot of items are always out of stock .", "rating": 3}, {"title": "It was a very confusing experience…", "text": "It was a very confusing experience purchasing a product to qualify for the  $375 Free Gift. The deadline was midnight. It didn't recognize\"Free Gift\" at checkout. I ordered the $100.00 Deer Antler Tincture.I called for assistance but it was the weekend and I sent an email for good measure. No phone call on Monday or email follow up. I've been a customer for several years with not one complaint and will continue purchasing from Lost Empire Herbs.", "rating": 3}, {"title": "Had problem easily selecting products…", "text": "Had problem easily selecting products wanted. Checking out with discount code was problem. Not all items wanted available ", "rating": 3}, {"title": "Skeptical from CHINA", "text": "Well skeptical at best since we live in the pines of the Sierra Nevada mountains.  Had to give it a try for my hubby.  Very responsive company and got the order quickly.  NOT happy with this supplement coming from CHINA!  However,  like the results with energy, and stamina.  Will search for other companies that produce Pine Pollen in the USA.  🇺🇸", "rating": 3}, {"title": "Placing an order online", "text": "I placed an order for Mushroom Brain Tincture and an error message popped up during checkout.  The error message did not specify what the error was.", "rating": 3}, {"title": "Product function", "text": "No problems with dealing with the company in regard to product purchased, but the product itself did not aid in supplementation in bedroom activities. It did give me an overall physicality pump though. Any wisdom as to why the product would not work as described?", "rating": 3}, {"title": "The order included a subscription for…Pine Pollen", "text": "The order included a subscription for Pine Pollen, and next month the shipping cost (if I don't call ahead and add on a product to bring the total to $100. to get free shipping) out weighed the subscription savings. I suggest charging $100. for the Pine Pollen and add an equivalent amount to the package of Pine Pollen. Otherwise I have to cancel the order before the re-order time and make another order with an add on to bring the sale over $100 to get the free shipping and retain the subscription discount. And I have to call Kelly and she has to call me back and do it for me in house.", "rating": 3}, {"title": "I was lead to believe I would receive a…", "text": "I was lead to believe I would receive a 15% discount on my purchase. Yet, when I entered the code my the the discount was not processed. Needless to say, I am very disappointed and I feel like I was deceived. ", "rating": 3}, {"title": "Tried repeatedly to order online", "text": "Tried repeatedly to order online. Tried many approaches. Your system kept me in an endless loop no matter how I tweaked the parameters. Nothing worked. Ended up calling instead.", "rating": 3}, {"title": "Disappointed   I feel like you should have let me have…", "text": "I feel like you should have let me have the deep tester discount on the clinical strength   PHYTO AND IGF NOT THE WEEKER BOTTLES  :(   im wanting to see what kind of power and kick this stuff has", "rating": 3}, {"title": "1-My biggest complaint about  this…", "text": "1-My biggest complaint about  this company is that there is no expiration date on any of the products.2- I have bought more than 500 dollars from this company,for the first time I wanted to return the black ants because It gave me severe stomach pain.I Emailed Karen in customer service and she said that if the package is opened they will not take it back! I sent her a part of the company’s policy and then she accepted the return.She just waisted my time!", "rating": 3}, {"title": "3 tsp every night - no morning wood", "text": "Took pine pollen using 3 tsp aro 10~11pm every night, no morning wood after 7 days, really wanted to believe but alas nothing happening, nada", "rating": 3}, {"title": "I've been using Lost empire herbs since…", "text": "I've been using Lost empire herbs since it was superman herbs.   I contacted the staff a couple of times and always found them to be very helpful.  Great products great service.  I also appreciate the military discount.", "rating": 3}, {"title": "I haven’t noticed anything…", "text": "I haven’t noticed anything life-changing since taking this product. I do believe in the ingredients so I will likely order once more to give it a more than fair trial.", "rating": 3}, {"title": "Steep learning curve", "text": "Information could be expanded.  I had no idea that the pine pollen packet I bought had such a small amount of Pine Pollen.  I took one tea spoon dosage for the most part and I don't think it even lasted a week.  I would have tried a bigger packet if I had known.  Then after I ordered I found a free sample of the size I had just bought but I couldn't order it because I had already ordered.  Then I ordered tablets because I thought it would be better to use.  But after I ordered I read that the capsules didn't work as well as the powder or tincture.  So I struggled finding information in a timely fashion.", "rating": 3}, {"title": "The information your agent gave me…", "text": "The information your agent gave me seemed rather vague and not perhaps based on true herbal experience And authority.", "rating": 3}, {"title": "Everything was great in terms of the…", "text": "Everything was great in terms of the website and ordering of product-no complaints there, but just wondering about the bonus gift. Not sure how to redeem that and there was no communication on that.", "rating": 3}, {"title": "Will it really work", "text": "A lot to absorb information try to dissect if it’s a good product or not fell I’m taking a big chance on hope it’s the real stuff that can fix me up to stuff", "rating": 3}, {"title": "The company is fine", "text": "The company is fine, the shipping was lightning fast, the product (pine pollen) did not agree with me.  It's the only reason I give it 3 stars. At least I know. The pollen was put into capsules and taken that way. It made me feel \"loopy\" which is a feeling I don't care for. I still recommend the company and their products, who knows, I may try to make a tincture with the powder I have left and see how that goes, but orally with capsules didn't do it for me.", "rating": 3}, {"title": "Very long wait for you to restock vip…", "text": "Very long wait for you to restock vip tinctures I require, it’s forced me to look for another supplier. You seem to be slow in shipping products that I do buy", "rating": 3}, {"title": "ordering", "text": "Took me numerous attempts to place my order. Couldn't get the autoship discount at first. A later attempt at the same order went through.", "rating": 3}, {"title": "Service was excellent with timely…", "text": "Service was excellent with timely shipping. I have not noticed a great deal of difference at this point. Perhaps in all fairness, I just need to take it for a longer time. I would say the taste is not pleasant but tolerable.", "rating": 3}, {"title": "Something is wrong with the Ordering!", "text": "I received 2 orders and of course was charged for 2 orders. But I wanted just the one. This is the second time this happened! Confusing! ", "rating": 3}, {"title": "The products are great. Prices are high.", "text": "The products are great.  The prices are too high.  I’ve looked elsewhere and found products in larger quantities at a lower price and apparently the same quality and taste. So far what I’ve found is cordyceps. Same value and greater quantity for 1/3 less in cost.  Time to get it together.  Bring your prices down or stay small.", "rating": 3}, {"title": "You add more deals after purchase is…", "text": "You add more deals after purchase is made. Why not be straight forward? Still don't know if my purchase went thru, or if you added on the bonus purchase, I tried to purchase. ", "rating": 3}, {"title": "The good and the bad", "text": "I ordered the herb for two reasons first I wanted to try it. Second the add said that a course would be available with order just put in code.  I put the code in where I could but didn't get access to promised course. Very unhappy about that outcome.", "rating": 3}, {"title": "So far all i did was order and paid…", "text": "So far all i did was order and paid for. haven’t heard anything like getting ready to ship or nothing,be nice to hear something ", "rating": 3}, {"title": "My Oder did not have everything", "text": "My Oder did not have everything. It showed wrong after payment. So I made another order. You are a good company but it takes forever to get to me. ", "rating": 3}, {"title": "I could not order on your website", "text": "I could not order on your website, had to call in to get help and do the order.", "rating": 3}, {"title": "4 questions, 1 review, too hard", "text": "You asked 4 questions before asking for the review rating. The first 2 were no, the 3rd was good and I can't remember the 4th", "rating": 3}, {"title": "The only thing is I never received my…", "text": "The only thing is I never received my 15% off my first order when I signed up for newsletter.", "rating": 3}, {"title": "I was logged into my account and…", "text": "I was logged into my account and sending herbs as gifts to friends.  I could change the address to my friends’ addresses but I did not see how I could add my friends’ names.", "rating": 3}, {"title": "Didn't honor special u send out", "text": "Didn't honor special u send out. Callie came back with bad response.", "rating": 3}, {"title": "I ordered megadose pine pollen but I…", "text": "I ordered megadose pine pollen but I received a different bag with less than usual", "rating": 3}, {"title": "I believe this is a good company", "text": "The price was reasonable, the shipping was fast. The product did nothing for me. I had blood work done to check my testosterone, checked after a month, then two weeks later. No change.", "rating": 3}, {"title": "I sent a question", "text": "I sent a question: any herb can increase the antidiuretic hormone(ADH) ?, and get no answer", "rating": 3}, {"title": "As a shipping review", "text": "As a shipping review, things went smoothly. products arrived punctually. I am satisfied with the process and communication for the delivery.", "rating": 3}, {"title": "Hi there~ HERE IS MY EXPERIENCE", "text": "Hi there~What i liked was the customer service and help i received about which products to order and how quickly the herbs arrived. What is difficult is that none of the 3 herbs i ordered for relaxation and sleep are helping me. So I'm sad about that. I'm following the protocols, and for some reason I don't feel the effects even though I take more than what is suggested> I might try again to see if anything changes.", "rating": 3}, {"title": "Company and ease of buying was…", "text": "Company and ease of buying was excellent! But the product sucked and didn’t work, not even a little bit!", "rating": 3}, {"title": "My order was shipped to my old address", "text": "My order was shipped to my old address, even though I provided my new addresses.", "rating": 3}, {"title": "I did not get the reaction that I was…", "text": "I did not get the reaction that I was hoping for. I had little to no reaction from the herb.", "rating": 3}, {"title": "Sad....Took a month did not notice a…", "text": "Took a month did not notice a difference..was hoping ....", "rating": 3}, {"title": "Shipping speed is slow", "text": "Shipping speed is slow, It takes 7-12 days. Last shipment of in stock pine pollen took 11 days!", "rating": 3}, {"title": "Waiting for some results", "text": "product currently not making any difference - but i am taking MEGA doses and remain optimistic ~", "rating": 3}, {"title": "Get stronger", "text": "Takes too long to work when taken. Improve its ingredients…", "rating": 3}, {"title": "I DO NOT LIKE THE WAY THEY DO THIER…", "text": "I DO NOT LIKE THE WAY THEY DO THIER DISCOUNTS.!!! &THIER PRODUCTS ARENT THAT GREAT.!!!!", "rating": 3}, {"title": "I did not like going to the coupon page…", "text": "I did not like going to the coupon page and none of them working over the last 6+ months! The products have been good.", "rating": 3}, {"title": "Order late again", "text": "This is the second time that I don't get my order on time. I am traveling and had to leave without the products I ordered.", "rating": 3}, {"title": "I like the products but shipping takes…", "text": "I like the products but shipping takes a bit too long", "rating": 3}, {"title": "Keep trying", "text": "It was good , prices are ok , I just have trouble getting the right width .", "rating": 3}, {"title": "I thought I ordered drops", "text": "I thought I ordered drops based on the picture.  I was sent the powder for 2 out of 3 products I ordered. I don't like having to mix drinks. I like only drops so I was surprised and dissapointed.", "rating": 3}, {"title": "I just purchased the products recently", "text": "I just purchased the products recently; therefore, i cannot provide an honest feedback on rating.  So far, the product that was supposed to do what it says it would do, is not happening.  Ask me in another 60 days and see what the outcome is with the supplement I’m using.", "rating": 3}, {"title": "I have only recently begun to use your…", "text": "I have only recently begun to use your products.  It is still too early to give a complete evaluation.  Your service has been very good and prompt.  I would fault the lack of instructions with some of your products, e.g., Gynostemma.. It does not say how often to drink the tea.  Other products do not say how long they should be taken before there will be results.", "rating": 3}, {"title": "Haven't seen any results yet", "text": "Haven't seen any results yet, don't like how it tastes", "rating": 3}, {"title": "Did not get my discount.", "text": "Date of experience: August 12, 2024", "rating": 3}, {"title": "It takes more than decent products", "text": "I used to buy a lot more but there seems to be little appreciation for repeat customers that spend $1,000 + a year. The only way I got a discount was to search for coupons on the internet available to everyone. Too time consuming so I found other sources. Too bad as they are good products but as I found out they are not the only ones out there.", "rating": 3}, {"title": "Stagswag", "text": "The product \"stagswag\" works really well and can tell the difference. However, I'm going to be in search of a different brand. Seems like since the supplement is selling well enough to run out of stock, the price would be better. I went back to reorder the supplement and the price was doubled. This is a great quality product but I know that others will have a great product and could be even better. Great product it works but price shouldn't have doubled. $63.00 just too much for a 30 day supply.", "rating": 3}, {"title": "I would give a 4 or 5 but you are…", "text": "I would give a 4 or 5 but you are constantly faking me out with the timing of your sales and aggressive sale pitching, there was a time you would give a big discount on your birthday, also labor day, not anymore.I am on a fixed income and get money on the 1st of the month, I am over 63 and have followed Peter Ragnar for over 10 years which is how I found Superman/Lost Empire herbs, the product id great, the timing of the stock up sales are off.", "rating": 3}, {"title": "Seems to be decent quality but I've…", "text": "Seems to be decent quality but I've found better quality for cheaper which is why I gave 3 stars. I did like their schizandra Berry extract and would give it 5 stars based on quality but was very overpriced for how small of a bag I got,I might order again if they run a deal/discount on it.", "rating": 3}, {"title": "Tried Horny Goat Weed and the feeling…", "text": "Tried Horny Goat Weed and the feeling was moderate.  A bit pricey based on my experience but perhaps this item is not the best fit for someone who’s overall system has acclimated to other, stronger pre-workouts/supplements.  Lost Empire does a very good job of educating and providing powerful feedback to their customers so I’ll give a few more items a try to see what works best.  I also tried their pollen powder but may try the tincture (as recommended by their team) for a stronger reaction.", "rating": 3}, {"title": "Purchased a couple of different herbs", "text": "Purchased a couple of different herbs , formulas,if I'm really honest I was a bit disappointed with their potency, didn't have the desired effect I was hoping for, but that said it wouldn't discourage me from trying new formulas as I believe lost empire to be a very reputable company,.", "rating": 3}, {"title": "Everything is good now", "text": "Everything is good now. I have ordered in the past.This delivery (still on it's way) has one item with wrong size, which I will be credited once it arrives. You guy's notified me. So anyway- I love your products, great service.I am impatient now because of what's going on today (Covid 19) and waiting is hard, because I am now in France. The only thing I would suggest, is for shipping to have Fed-Ex as an option. They seem to get here faster. That's all.Patiently waiting (and my girlfriend) for the Pine Pollen!!You guy's ROCK!-Stretton", "rating": 3}, {"title": "Disappointed.", "text": "I tried albizia to help me with my sleep quality. However, it didn't do what was claimed on the website. I am disappointed.", "rating": 3}, {"title": "Been taking product for about three…", "text": "Been taking product for about three weeks now and do not notice any difference at all. Like most supplements advertised on line, no difference at all but spend a lot of money for them. JW", "rating": 3}, {"title": "Purchased the megadose of Pollen Powder…", "text": "Purchased the megadose of Pollen Powder and was pleased first few days however my body adapted quickly and it didn’t seem as potent or powerful as anticipated.  More factual studies on the herb would prove beneficial for new customers considering to purchase from Lost Empire  Herbs.", "rating": 3}, {"title": "Very disappointed", "text": "The product arrived in a few days. I ordered the Thor’s hammer. I have taken this regularly and just before sex. Result absolutely nothing. Very disappointing. Maybe something else would work better but I paid $50 for this so I’m not sure I want to waste any more money.", "rating": 3}, {"title": "Help and customer service is Great", "text": "Help and customer service is Great. Shipping also. So far have not noticed any positive outcomes from the herbs. Going on 3 weeks, will continue with your recommendations. Will be waiting for the herbs to kick in, and then will happily change my post.", "rating": 3}, {"title": "The customer service is awesome", "text": "The customer service is awesome.  Really they are amazing.  As for the product I purchased, I have noticed a small improvement but I am honestly disappointed in what it has done.  Maybe my expectations were too high after reading other people's comments.", "rating": 3}, {"title": "the herb was amazing and the results…", "text": "the herb was amazing and the results are instants but i was worrying to much about the herb and not my body way to strong for me. evan my mother knows it *(what have you been taking making you sound all squeeky and loud) now i think about it it makes me sound like i did alot of cocaine. i was looking to be stronger in the bed going with my soul not choosing thors hammer because it proabbly wont work anyways lol wanted to make my own recipe but the results are more than i needed. now i just want to be simple, wanted to give yall my honest review btw, im 5'8 asian 140lbs. before i was 168lb till i quit drinking alcohol", "rating": 3}, {"title": "i CANNOT WIN THEM ALL...I HAVE…", "text": "i CANNOT WIN THEM ALL...I HAVE PURCHASED A PRODUCT THAT I HAVE A BAD REACTION TO; HENCE CANNOT TAKE IT ANY MORE.          THOUGH \"LOST EMPIRE HERBS\" ARE EXCELLENT AND I WILL CONTINUE TO USE THEM AS ONE OF MY TOP HERBAL SUPPLIERS.", "rating": 3}, {"title": "Still Evaluating Results", "text": "Still evaluating results. Slight improvement in energy, but still not wholly convinced. Will probably need to take more of the supplements to see if there are any significant results. My main concern is shrinking my prostate gland.", "rating": 3}, {"title": "I've been trying a few of the products…", "text": "I've been trying a few of the products just to see what best fits my biology and so far it seems that Tongkat Ali,Gotu Kola & Pine pollen combined is givin me my sexual life back so I know I'll be taking this product indefinitely.But I've also been trying to take some herbs that would help my brain function better but so far every product I've tried (Lion's mane,and cordycepts) seem to somehow interfere with my body's ability to keep blood flow in my pelvis area so i think that mabe I'll just have to only stick to the 3 herbs I mentioned before,but I'm not giving up on my brain since thats truly the most important muscle.", "rating": 3}, {"title": "No difference", "text": "So far haven’t felt any real energy or drive from these supplements. Almost done with the bottle. Don’t know if I will reorder again.", "rating": 3}, {"title": "The packaging is great and the…", "text": "The packaging is great and the description of the herb is worth the read. However there should be instructions/ directions/ suggestions for using the herb and amount to use would be beneficial for any consumer.", "rating": 3}, {"title": "The alcohol is too potent for my taste", "text": "The alcohol is too potent for my taste. Burned my tongue!Something should be done about the flavor as well, I added a bit of vanilla with it and maple to make it taste better. The effect is excellent though!", "rating": 3}, {"title": "Disappointed", "text": "I wasn't satisfied with a product that was marketed for providing immediate results and requested a refund.  I received an insensitive response from the person granting the refund saying I didn't give the product enough time to work.  That angered me.  The product says on its package that it provides results within 1 to 2 hours.  It didn't.  Then another refund I requested wasn't processed in the time promised, and the person I spoke to in customer service couldn't seem to understand why I was upset, or the real source of my concern.  The customer service manager reached out to me asking if he/she could e-mail me.  I'm fine with that, but I don't want to publish my e-mail address here.", "rating": 3}, {"title": "I think I need to give your product…", "text": "I think I need to give your product some time , I will say iam experiencing some change with the products I have received, may be its because i’am a 62 year old male I don’t know but I will give it some time", "rating": 3}, {"title": "Still testing results", "text": "I've been taking Longkat Ali for about 50 days an it seems like it's actually help to regulate my overall being mentally,sexually,and physically.Im also taking gotu kola which I actually stopped taking aftet i ran out of the first batch but when i stopped i realized my body and mind started changin then thats when i realized the  effects were so gradual I didn know they even happened till after I stopped takin the herb but now im goin to continuously take it.I even just purchased Lions mane but today is the first day I've takin it so I don't havr anything yet to say about it.I feel like im gettin closer to \"Balancing myself\" than I've ever been before.Thanx for You'r existence Lost Empire herbs", "rating": 3}, {"title": "Botched the first order entirely", "text": "Botched the first order entirely.  They blamed it on the Warehouse.  Eventually came thru with what I ordered.  Delayed by about 3 weeks in the process.   So overall  --  \"myeh\".", "rating": 3}, {"title": "I ordered the Pine Pollen Tincture", "text": "I ordered the Pine Pollen Tincture, but I think I'm allergic, due to coming down with a runny nose, and a mild headache when I take it. Oh well, nothing ventured, nothing gained.", "rating": 3}, {"title": "I have been using this for nerve pain", "text": "I have been using this for nerve pain. It seems to be helping but doesn’t take the pain away completely.  I’m hoping that the longer I take it the better I will feel.", "rating": 3}, {"title": "Took it like I was supposed to", "text": "Took it like I was supposed to,  never felt  any difference. I was taking  Tong Ali , pills  -   Pine, tinacton ,  never got any morning  wood , or anything else .!!", "rating": 3}, {"title": "Program is good", "text": "Program is good. the computer part needs a real upgrade. Lately I am unable to download any thing. the screen freezes I have to reboot the system to do any function.", "rating": 3}, {"title": "The products are fantastic which is…", "text": "The products are fantastic which is also reflected in the prices. They were one of my favorite herbal companies, but I had to go around and around with three or four people within the company about a service issue. It didn't seem like anybody had a proper response for what was going on so I was left in the dark for about 2 weeks. Then they did they found out what the problem was when it could have been resolved much sooner. They were gracious enough to just give me my order for free to make up for the terrible experience. All I can say is get a tracking number. Also they need to be able to check their voicemails and they should be returned back within 24 hours. You want to charge top dollar you need to provide top service. I've been in retail for decades, and they made it right I'll order from them again but with hesitation as far as our customer service is concerned", "rating": 3}, {"title": "Most of the products I have used have…", "text": "Most of the products I have used have not performed as described. I am almost out of the products and I am still on the fence as to whether I will reorder.", "rating": 3}, {"title": "I have still not received my order and…", "text": "I have still not received my order and even the tracking was inadequate. I do not know how much longer it will take to arrive.", "rating": 3}, {"title": "If a product is 100% pure  then it…", "text": "If a product is 100% pure  then it should say it on every bottle that is 100% pure and it should say  100:1  or 200:1 on  every bottle  also", "rating": 3}, {"title": "Jury still out", "text": "Jury still out. I'd prefer capsules. Hercules product is like drinking dirt. As for what it suppose to do for your workout not sure just yet.", "rating": 3}, {"title": "Your constant advertising after I…", "text": "Your constant advertising after I bought from you is preposterously absurd to the extreme. It overshadows your products.", "rating": 3}, {"title": "Eh not impressed.", "text": "Took a  while for shipping, then the pills did absolutely nothing, no where near what was advertised.", "rating": 3}, {"title": "It was difficult to communicate even…", "text": "It was difficult to communicate even though the issue was ultimately resolved after some back and forth emails and voicemails.", "rating": 3}, {"title": "High hopes", "text": "These products seem legitimate though reactions haven't taken affect as I had hoped, so I will post a comment afterwards.", "rating": 3}, {"title": "I have ED and none of the natural…", "text": "I have ED and none of the natural ingredients worked. I understand.not all people are alike and the effects are different.", "rating": 3}, {"title": "I did not get the desired/advertised…", "text": "I did not get the desired/advertised effect from using the products.Not making any complaints about the quality or service.", "rating": 3}, {"title": "repeat customer..generally good service…", "text": "repeat customer..generally good service and great products but didn't honor my last coupon - little disappointing.", "rating": 3}, {"title": "You send to damn many emails", "text": "You send to damn many emails, 1 every 2 weeks would be about right and if it keeps up I will be forced too cancel!!", "rating": 3}, {"title": "shipping less than urgent", "text": "I could be wrong but I believe that delivery appears to be less than urgent...", "rating": 3}, {"title": "Pine pollen liquid", "text": "I ordered the pine pollen liquid a month ago and followed the directions, but have not had the expected results.", "rating": 3}, {"title": "Somewhat good serivice", "text": "Somewhat good serivice. Shipping seems slow but non the less, good products.", "rating": 3}, {"title": "Delivery issue", "text": "Hi, All went well except you delivered to billing address and not the delivery address.", "rating": 3}, {"title": "Ordering on line", "text": "Ordering on line, there was no \"customer service\" to speak of, so really nothing to rate.", "rating": 3}, {"title": "I am fed up with all these automated…", "text": "I am fed up with all these automated emails - please stop sending them or I will simply go else where!", "rating": 3}, {"title": "I don't think I've been on it long…", "text": "I don't think I've been on it long enough yet.  So I continue to work on it. Thanks.", "rating": 3}, {"title": "Did not work for me so far", "text": "Well, it didn't work for me, tried 3 then 4 and 6 capsules but did not notice any difference", "rating": 3}, {"title": "Order process is fine but I haven’t…", "text": "Order process is fine but I haven’t received product yet so hard to do a review", "rating": 3}, {"title": "I havent noticed much difference in how…", "text": "I havent noticed much difference in how i feel since taking Pine Pollen over a month ago.", "rating": 3}, {"title": "So far 3 of  5 in the fururd we will…", "text": "So far 3 of  5 in the fururd we will see short period but it is going in right direction", "rating": 3}, {"title": "I find that the people at this company…", "text": "I find that the people at this company are some of the finest in this business. I have purchased many products from this company and most have been very good. My fav all time is the Pine Pollen Tincture when the Tincture looked more like the Pine Pollen Powder. This last batch was definitely not my favorite as it tasted and looked more akin to alcohol than the Pine Pollen Tincture that I am come to know from this company so not so happy with the product this time which is why I going with 3 STARS. I much prefer my PPT to look like the Pine Pollen Powder which has a yellowish hue to it as well as the flavor. I do prefer all my tinctures to be alcohol based, but I should not taste the Grain Alcohol as if I am drinking a bottle of Smirnoff's without anything else. The results may indeed about the same in the end, but my preferences still stand. That stated, I prefer this company over many others because they know what honor and integrity is. They also listen to what their customers suggest for new ideas and enact upon them as soon as they can. I rate this company a 5 STAR overall. I much prefer people and companies that have Integrity especially since we as customers do not see anything but the end product so trust is a very important factor with me. I refuse to do business with companies and people in general that know not of Integrity.", "rating": 3}, {"title": "The staff when I called in did not seem…", "text": "The staff when I called in did not seem knowledgeable of herbs and even the products.", "rating": 3}, {"title": "Did not do what bu expected from third…", "text": "Did not do what I  expected from thore hammer I will try few more times and see", "rating": 3}, {"title": "Some of the people who work for you do…", "text": "Some of the people who work for you do not seem to know the products/herbs well.", "rating": 3}, {"title": "Great product wish shipping was faster", "text": "Great product, just took forever to receive it in Sydney Australia.", "rating": 3}, {"title": "Return/refund policy did not seem to be…", "text": "Return/refund policy did not seem to be honored as posted on company website.", "rating": 3}, {"title": "I found no advantage adding another…", "text": "I found no advantage adding another vendor to source my supplements", "rating": 3}, {"title": "Tasted like hell works ok not worth the…", "text": "Tasted like hell works ok not worth the awful taste", "rating": 3}, {"title": "I don’t think the product has worked…", "text": "I don’t think the product has worked like they said it would.", "rating": 3}, {"title": "Haven’t really noticed a difference in…", "text": "Haven’t really noticed a difference in anything yet", "rating": 3}, {"title": "Product did not work like I hope it…", "text": "Product did not work like I hope it would", "rating": 3}, {"title": "reasonable delivery time", "text": "Date of experience: March 26, 2024", "rating": 3}, {"title": "Overall experience was nice", "text": "Date of experience: May 30, 2022", "rating": 3}, {"title": "not what i  expected", "text": "not what i  expected, but ill try again.", "rating": 3}, {"title": "Faster shipping ", "text": "Good products. ", "rating": 3}, {"title": "Customer Service Staff Is Less Than Helpful.", "text": "I think your products are great, but the customer service staff is less than helpful. They always address a question as \"see you health care provider\", which is BS in my opinion. In fact, I no longer call or post, LEH I haven't for over a year and my purchases have also gone way down.  I think you need more specific information on dosing, telling someone use about 30 drops under the tongue is good for who? A 18 year old or a 90 year old person. I know you don't have the time, or possibly the resources to \"treat\" all your customers. I believe you guys truly, work very hard, to help people, so why drop the ball at dosing? I think if you used statements like if your over 65 you should consider 40 drops a day, or if you weight is above 180lbs you should use x. I believe these statements are broad enough so you wouldn't be blamed with \"prescribing\".Here is an example. I'm 65, and I take testosterone injections and  If I want to go only natural to lower my estradiol as a result of the testosterone injection, how many drops of SN should I take?  But if you stated in the website that men on testosterone replacement found help at 100-140 drops a day was helpful at lowering estradiol you would be ok as far as \"prescribing restrictions go\". By offering that guidance, I could then go to and get a blood draw after a week or 10 days of that guidance and see where my estradiol is and I could dial it in from there. Your broad statement just gave me a place to begin, that's all we need. Those of us who try do do everything natural need all the help we can get and we will pay what it costs to get the help we need But, it's also true if we don't get  the help we seek we will just continue to look until we find a place we can get it.I believe these statements are broad enough to keep you and your business out of trouble and still help your clients. Additionally, no matter how many customers you have now, if you gave that extra \"personal\" touch in the website description you would have a more dedicated customer base and frankly we could use the help. I think you guys in natural healing think we actually have an alternative source to help us, most of us don't we're on our own to prevent, heal and get cured.Also, it's nice way to build a loyal client base.Good luck!Thom", "rating": 3}, {"title": "Too soon to give a full review.", "text": "Date of experience: March 29, 2018", "rating": 3}, {"title": "Perfectly adequate.", "text": "Date of experience: February 27, 2020", "rating": 3}]