[{"title": "Good to behold seems to be recommended…", "text": "Good to behold seems to be recommended for anyone out there", "rating": 3}, {"title": "avrage", "text": "i did not like how at the end of every process there is the red and green buttons. They do not look good quality and destroys the aesthetic .The start page of the website is good. maybe instead of the red and green the interface were to have a good color choice it would definetly increase the quality.", "rating": 3}, {"title": "Came in to purchase cd’s and open an…", "text": "Came in to purchase cd’s and open an account.  No customer in bank, but was asked to wait while a room was opened to do business, this was at 10:30 am.  The representative that took care of us was perfect, and appreciated.  Made me wonder…", "rating": 3}, {"title": "Communication", "text": "I really like and appreciate the folks at the Mont Belvieu office, they always go above and beyond. The experience with my loan officer, not so much. She failed to call me, answer my calls or even text me on the day I was to pick up my new vehicle to inform me that I had to drive to Mont Belvieu to sign docs and pick up the check. So it was very inconvenient for me and took hours to resolve. When I mentioned that she left me hanging out there, she didn't seem too concerned she was \"at lunch\". I will go directly to the Mont Belvieu office from now on.", "rating": 3}, {"title": "I just completed my second loan with…", "text": "I just completed my second loan with DuGood working with Kristin Daniels. Again she handled it with efficiency and completed it in a very timely manner. Kristin always makes the process as easy and convenient for you as possible. I highly recommend DuGood and Kristin.", "rating": 3}, {"title": "Its a good place", "text": "Its a good place, Rebecca was really helpful!", "rating": 3}, {"title": "I went in for 1500 dollars express…", "text": "I went in for 1500 dollars express loan. I have been a loyal customer been with dugood almost 2 years with direct deposits the whole time. I got in a bind and got stuck using overdraft. Since I used courtesy pay over 15 times I was only allowed 750. Only reason I needed 1500 was to get out of that. Y'all get my pay before I do my fees r always paid every week. 1500 shouldn't have been a problem like I said y'all get my money before I do. I just Think courtesy pay should not be a determining factor.i am glad I was able to get what I did. It somewhat helped. Thank you dugood vidor location", "rating": 3}, {"title": "My trusted life gcash 09453649255", "text": "My trusted lifeBank accountBPI 000649420157Branch 0064Marilao", "rating": 3}, {"title": "I am very pleased with the timeliness…", "text": "I am very pleased with the timeliness in which I had received a response but could've used a little more direction as to what steps need to be taken to fix credit errors so that I may be able to get a loan", "rating": 3}, {"title": "Its is one of the best and most…", "text": "Its is one of the best and most interesting account ever used .", "rating": 3}, {"title": "I love this bank", "text": "I love this bank, great service i can't lie", "rating": 3}, {"title": "I been with this bank for years", "text": "I been with this bank for years. The staff are very kind and friendly. However, the only thing that gets me is the NSF fees. I understand the courtesy pay, but charging someone $30.00 NSF off of .59 cents, yes I said .59 cents is ridiculous. I don’t understand why banks charges NFS fees.", "rating": 3}, {"title": "not to good experince", "text": "Date of experience: March 14, 2024", "rating": 3}, {"title": "I was disappointed with the decision of…", "text": "I was disappointed with the decision of my loan approval. I was not granted the full amount due to finance history of another account and not based on history with you guys, I have never had a problem paying in fact I cleared debt with you guys in early 2020. My thoughts are leaning toward discontinuing business with DuGood Credit Union.Sincerely Disappointed Adrian", "rating": 3}, {"title": "Felt Uncomfortable.", "text": "Felt Uncomfortable Maybe they were tired, or had something was on there mind. Just didn’t feel like the loan was the number one interest. Sorry been a member sense the 80s, don’t feel l’ve been getting a fair shake from this location. They asked questions they already had the answers and didn’t seem excited I got a counter offer. Trying to understand,Derrick L. Ford", "rating": 3}, {"title": "Good interest rates, but a hassle to repay your loans", "text": "Good interest rates, but very antiquated app and way to repay loans. You can’t repay your loans using an external account. You will need to show up in person at any of the branches to make the transaction. That is a inconvenience for anyone that travels constantly and is not available to stop at the branch at all times.", "rating": 3}, {"title": "Unable to finance auto loan out of…", "text": "Unable to finance auto loan out of state. Louisiana, I had to finance with another Institute, then come back and wait to refinance auto with Dugood. I will be moving to another state, but worry if I should join elsewhere because this federal CU seems to be a state only CU. I also have trouble using other federal CU's atm's.Thank YouDavid E. Mays", "rating": 3}, {"title": "There are a few items that can be …", "text": "There are a few items that can be improved with online banking.  One is the length of time something stays online.  There have been many times I have went to print a copy of a check for tax records and there has been no photo proof of the check as well as a few times I have lost a statement and had to call in because it goes away on the system.  correspondence with Quickbooks could use some help as well.", "rating": 3}, {"title": "The sign up for the loan was smooth but …", "text": "The sign up for the loan was smooth but not enough information was given initially for possible payment methods. I signed for the loan in my name but that made it hard for wife to make payments for me and I work a great amount of time far from home.  It was a great inconvenience for my wife to have to go through the trouble of making payments for me and some of the people were not as courteous as they could have been concerning her.", "rating": 3}, {"title": "During my last visit", "text": "During my last visit, I needed to transfer some money from my IRA to my checking account at the North Major branch.  The branch manager was tending to a couple, after she was done, she decided to make phone calls while I was still waiting to see a bank representative.  As a result, I ended up waiting an extra 15min. in the lobby before someone took care of me.  I guess phone calls are more important than taking care of customers who are waiting in the lobby to do business.", "rating": 3}, {"title": "A little disappointed when I applied…", "text": "A little disappointed when I applied for a $6000 dollar loan and was turned don’t but offered me $3500 because of my credit score. After all the time Covid pandemic is happening I never missed paying my loan or credit card payments. Never.  Not one time. And this is the way dugood treats a member for making all payments. This may be my last time asking for a loan from dugood. I am a member that has paid every payment and none of the employees have had to call and ask for loan payments. Stop judging your members but there credit score and take into consideration how the member pays there loans and cc payments. Again very dissatisfied", "rating": 3}, {"title": "When I go in to make a deposit or pay a…", "text": "When I go in to make a deposit or pay a bill people are nice and friendly. But when you go in to pay extra on a bill I mostly get a bad attitude like I'm inconveniencing them and they usually have to call someone to make the payment. I wish some of the tellers could have more training and were nicer to bank members.", "rating": 3}, {"title": "I’d rate more stars if it weren’t for…", "text": "I’d rate more stars if it weren’t for the fact that my card gets denied every single time I try to make a large purchase...there should be a better system for this. Same for the max limit on atm withdrawals..I’m getting quite tired of being told how much of my money I can have or spend at a time.", "rating": 3}, {"title": "Not Bad", "text": "I like Dugood. Only thing that irritates me is that it seems like every time I go in to deposit into my IRA I get stuck with someone who has never done it before. Obviously I don't mind them training people, but it makes me nervous that no one seems to know what they are doing.", "rating": 3}, {"title": "No longer member friendly", "text": "There were a couple of times that I went into the branch on Major drive and they were not very helpful with my needs. The manager seemed dis-interested to my problem. The credit union used to be more member friendly.  I was very disappointed in the way things are now", "rating": 3}, {"title": "It would really help alot if we could…", "text": "It would really help alot if we could call a number to check our card for pending deposits, balance as is and also other questions along the way. The app isn't working for me and won't let me log in. Other than that everything is absolutely great. Thanks", "rating": 3}, {"title": "I don't like their policies when it…", "text": "I don't like their policies when it comes to how they handle transactions.  I find that they will charge an NSF Fee based on a pending transaction without giving you time to deposit money to cover it, and will not refund the fee.  I'm switching...", "rating": 3}, {"title": "Our loan officer was great on my loan …", "text": "Our loan officer was great on my loan done in a day but with my husband's I think took a month. Not returning calls she didn't pursue the loan, we had to call and see where we stood on the loan. It was really bad customer service.", "rating": 3}, {"title": "good but can be better", "text": "Date of experience: March 27, 2024", "rating": 3}, {"title": "They're great", "text": "I like that they where helpful.", "rating": 3}, {"title": "Good service", "text": "It’s good service", "rating": 3}, {"title": "Had a little trouble getting a loan for…", "text": "Had a little trouble getting a loan for a dozer, appreciate the help.", "rating": 3}, {"title": "The young lady that opened my account…", "text": "The young lady that opened my account could have been a bit more friendly. She was professional just not very friendly.", "rating": 3}, {"title": "Dupont needs to improve the process for…", "text": "Dupont needs to improve the process for fraud incidents.  Dupont needs to hire more people to work in their fraud dept.", "rating": 3}, {"title": "The service was awesome,but I wasn't …", "text": "The service was awesome,but I wasn't told about over draft are anything like that didn't explain nothing to me", "rating": 3}, {"title": "I dont understand why it takes so long…", "text": "I dont understand why it takes so long to run a check", "rating": 3}, {"title": "vehicle loan", "text": "fast and easy. everyone very helpful. was a pleasant  experience.", "rating": 3}, {"title": "Very lengthy for the little bit of…", "text": "Very lengthy for the little bit of money needed. Too many visits.", "rating": 3}, {"title": "I'm still searching for a loan", "text": "Everything's okay ", "rating": 3}, {"title": "Ok experience", "text": "Ok experience. The women were just okay.", "rating": 3}, {"title": "Good experience drive thru", "text": "Good experience", "rating": 3}, {"title": "Good service", "text": "Date of experience: September 21, 2018", "rating": 3}]