[{"title": "Beware of returning products!", "text": "Buy from Rotita is simple. But if you don’t want to exchange your items you have to jump thru hoops. Getting a refund is very hard. Luckily I paid thru PayPal and they were able to get my refund. The product I did keep are good. But returns are a pain.", "rating": 3}, {"title": "Shipping takes too long ", "text": "My order was supposed to be delivered by April 10th, but it still hasn't been delivered. I wouldn't mind if I didn't pay for shipping, but I did and I expect it to be on time. ", "rating": 3}, {"title": "Takes a while but ok …", "text": "Took a very long time to arrive. Tried the ‘contact us’ online form which rejected it so just had to wait. Items were fine when they did arrive. ", "rating": 3}, {"title": "Clothes were exactly as described and…", "text": "Clothes were exactly as described and fit and looked great but their site could use a lot better security. Immediately after I place my order with them I began getting 100's of texts every week from various email addresses all  from adult sites. Since these were from email addresses getting them blocked took a lot of time a trouble and I ended up having to get my wireless company involved.", "rating": 3}, {"title": "Hoping to see shipping progress", "text": "I can't comment on the quality of the products, because haven't arrived yet. One order says it's still processing (It was supposed to ship by 11/30 at the latest). The other order seems to be stuck here: On Its Way to USPS Departed Shipping Partner Facility, USPS Awaiting Item COMPTON, CA 90220 December 1, 2022, 5:26 amShipping Partner: FAST TRACK EXPRESS INC.I am hoping to get both orders here by my wife's birthday in mid Dec. At this point I'm not too optimistic. I will re-do review when product arrives.", "rating": 3}, {"title": "I submitted several orders while on…", "text": "I submitted several orders while on vacation. This seemed to be a problem. The number of querries sent by your firm was annoying. The delivery address was given over and over and over ... very annoying. The the preorder item was cancelled ...I don't know why., more frustration. The prices were fair, however a proper assesment could only be made upon receipt of the items.", "rating": 3}, {"title": "RETURN POSTAGE FROM UK EXPENSIVE", "text": "The bikinis I ordered were gorgeous and well made. However I wanted to return the tops and exchange for a larger size. The cost of return postage from UK was £16 - more than the tops are worth. But Rotita replied to this comment and suggested I looked for another cheaper courier which I will do.Looked for cheaper courier and cheapest is £20!!So no returns then. What a shame.", "rating": 3}, {"title": "Website is horrible", "text": "Website is horrible.  Can't sign in.  Can't reset your password.  Went through support and had to disclose my password. ???    Website will BOMBARD you with emails.  Yes, I know you can unsubscribe, but 4 or more a day?  Come on.  Will not recommend.ADDED:  Just try to leave this review and it wouldn't accept the new password that was JUST put on my account.  Had to sign in with Google to leave this.Just read company review. Did you even read my review???  I never complained about your product. If you are going to respond to a review, try READING it. You posted a form response that has nothing to do with my critique.", "rating": 3}, {"title": "Holidays are not good to order!", "text": "First time customer. I’m giving a 3 because I don’t have the tops to check for satisfaction of quality, style & fit. Im hoping I will be happy with them whenever they do come. The guaranteed time passed on 12/15- 12/27/22, and today is 12/28/22, ugh.  I had 4 events including my Birthday and I had to buy new tops for each one. I’m will not buy again  if I need it Asap since you can’t deliver on time. I’m so frustrated. I’m hoping I can wear one for New Year’s Eve but it doesn’t seem possible. Your Live Chats are robotic when trying to inquire about your purchase, so no date can be given for arrival of order. Customer should be aware that it’s from coming China, if you live in another state, it will take awhile.", "rating": 3}, {"title": "Terrible at shipping of products within an acceptable timeline.", "text": "Ordered products on 03Dec22 with priority shipping and insurance.  Requested on 08Dec22 that the order be shipped so I can receive it before Christmas.  Shipping was to take place before 16Dec22.  Requested update on 17Dec22 and now, like every item it seems are \"hot\" and they don't have stock?  Why don't they post this on the product page?  Told me they need another 3-5 days to ship 2 of the 4 items on the order.  They haven't responded to my request to cancel and issue a refund.  It would be nice if they actually followed their shipping times.  If they did, I'd have probably received the items before Christmas.  Since they cannot ship items in a timely manner, I have requested to cancel the order and be issued a refund.  Still haven't heard back !  Hopefully they will do what is right and refund my money.  UPDATE, THEY REFUNDED MY MONEY!  THANKS FOR THAT AND I'LL ENSURE I ORDER WELL AHEAD OF TIME IF I NEED SOMETHING, THANK YOU", "rating": 3}, {"title": "Product reviews lacking", "text": "Why aren't there any reviews about the products? All reviews concern returns, wrong email addresses and sizes.", "rating": 3}, {"title": "UK potential customer", "text": "I’m from the UK and prices seem quite high for what they are, I’m still a bit reluctant to order off them. If it’s incorrect it’s a lot of stress to send it back to the US. I need to think about it.", "rating": 3}, {"title": "One top fit but the material really not…", "text": "One top fit but the material really not really pleasing", "rating": 3}, {"title": "Ordered in March 2022 and never…", "text": "Ordered in March 2022 and never received the garments I was so looking forward to receiving, each time I contacted them they apologised and said there was a delay in shipping due to COVID yet there were reviews from other people in the UK at this time, in the end I gave up and cancelled my order, I did get a full refund, but I would have liked to have received the tops as they looked lovely. After reading all these bad reviews too scared to try and order anything again", "rating": 3}, {"title": "The beautiful tops i ordered didn't…", "text": "The beautiful tops i ordered didn't fit. I contacted the company & found that the returned goods were to go via USA. I think that's the part that lets them down. The clothes are so pretty & i would love to order more but to send them back is not an option for me. If you can have a UK return address then i think that will be better for you. I loved the earrings though. They are gorgeous!!", "rating": 3}, {"title": "Disappointed...I ordered through Rotita…", "text": "Disappointed...I ordered through Rotita several years ago and loved my swimsuits. Everything went great so I did not hesitate to order again. But this time it was a disaster. I only received one of my 3 items and had to contact them 3 times about my remaining order and unfortunately ask for a refund. At this point I am waiting to see if the refund goes into my account. Really disappointed! I was so looking forward to the two bathing suits I picked out😞", "rating": 3}, {"title": "Returns process is cumbersome and had a problem resetting my…", "text": "I too had a problem resetting my password.  The quality of the items I got was very cheap so I am returning.  The return process is a bit cumbersome.  But the customer service rep  Losliya was very helpful.  I am still waiting for return information.  It said it will take an hour.  I give customer service 5 stars, products I ordered 1 star, and ease of return one star.", "rating": 3}, {"title": "Working woman", "text": "The website was easy to use. The products came quickly. I was disappointed that I had to pay return shipping on the stuff I didn’t want. This was not prominently posted that you had to be in the US to get free return shipping. Not all the sizes were right. And not all the tops were made of nice material. I tried to order tops with high ratings, but material was shiny nylon. Not my style.", "rating": 3}, {"title": "Thanks to Sumie who assisted in…", "text": "Thanks to Sumie who assisted in cancelling my orders. I tried to cancel my orders with your company but continue to receive messages regarding shipment  I decided to contact the company through live chat and received the needed help from Sumie.Appreciate her assistance and look forward for the reflection of my credit to my account. Thanks  J.Isaac", "rating": 3}, {"title": "finally received the 3 tops I ordered", "text": "finally received the 3 tops I ordered. Very happy with the tops. they fit nicely. was very disappointed with the time they took to arrive. Ordered them the first of nov. and never got them until Jan. 13. I would order again even knowing now that it takes almost 2 months to get the clothes to a Canada address. There clothes are very nice.", "rating": 3}, {"title": "I really love this website", "text": "I really love this website. I love all the choices that are available.  Website is easy to navigate through. However the sizes are not consistant. I have returned more products than I have kept. I am normally a medium size in everything. I have been purchasing large from Rotita. When I try on my items, they are eiather too big or too small.  Can not find a happy medium. Very disappointing.", "rating": 3}, {"title": "I ordered 4 swimsuits and realized I…", "text": "I ordered 4 swimsuits and realized I ordered the wrong size, within minutes I cancelled the order as I could do on the order page but you ignored my cancelation and sent the order anyways. So now I have to send the order back for a refund,  I shouldn't have had to do this. .The only good thing that helped is that I received a return label", "rating": 3}, {"title": "Not a fine material. Bad package", "text": "I ordered this blouse:split-neck-roll-tab-sleeve-printed-blouse-g228207 and came bad packetted: Just a plastic bag, allowing the product to wrinkle. Not a single cardboard.It smells like a new car upholstery, just like the material of umbrellas.On the product it is sewn:35%cotton 65% polyester, but in the product specifications it is:95% polyester 5% spandex.I don't see spandex anywhere.", "rating": 3}, {"title": "Good experience", "text": "I purchased  2 items. Returned one and it was dealt with fairly and quickly. The other I had to ask for an exchange as they sent me the wrong size. They handled it equally as well. Love the dress. Will probably order from this company again. Nice selection with good prices. Quality is good too.", "rating": 3}, {"title": "Cheap prices reflected in quality", "text": "Cheap prices - but the quality of the clothes reflects that - e.g. very cheap looking buttons on an otherwise nice sequinned top, and lining fabric front and back that doesn't match in colour.  Be aware that goods will be made to order and sent by sea from China so will take a month to arrive! - this is not immediately apparent when you view the site, though they do make it clear when you pay.", "rating": 3}, {"title": "Delays in receiving the clothes", "text": "In the last two months I have experienced alot of disappointment with time it is taking to get the orders.  THe only reliable freight company that Rotita sometimes uses for NZ is DPS which has great tracking and delivery times.  NZ post and USPC has been very disappointing and taking up to 8 weeks to get the orders.  So until this is sorted and better time frame I am not ordering any more clothes.  THe clothes are great but just on the slow boat ex China.", "rating": 3}, {"title": "Watch the sizes", "text": "I have ordered several bathing suits. Which I love! They are good quality and sizing were true to size. The shirts that I ordered however are thin material and are sized small. I unfortunately cannot return them because they were on clearance. I doubt I would reorder clothing again. Shipping on them were very good", "rating": 3}, {"title": "My first order placed with Rotita was 3…", "text": "My first order placed with Rotita was 3 swimdresses.  The order came in 2 separate shipments.  The first order arrived in an adequate amount of time however the other shipment took much longer to arrive.  There was no notice or email communication informing me of why the shipment was running so late.  It would have appreciated some note as to what the issue was and an estimated time of arrival.  Hopefully with future orders, there will be better communication.", "rating": 3}, {"title": "In the beginning when I started…", "text": "In the beginning when I started purchasing ur tops I was excited to receive them but I ran into a problem with ur sizing chart which is much smaller than others so I made a request on how to return for a refund but it seem ur return policy is somehow too complicated for me. I have ordered a few more of ur tops and I hope they will fit but I have decided I will not use ur services to order again because returning ur items should not be difficult to do.", "rating": 3}, {"title": "Some of your clothes don't fit right so…", "text": "Some of your clothes don't fit right so then I have to order a big size. I had a a duplicate order that I already had bought before. And try to cancel  it before it came in mail. I wish you would send a refund label with your order. So you don't have to go threw a lot of tape. To get a hold of you people.", "rating": 3}, {"title": "Not getting orders delivered or status updates", "text": "Have only received a partial first order from weeks ago, still waiting on remainder of that order, and 2 other orders to ship. Was gonna order more stuff, but not until I start getting my orders delivered. So slow delivery is my feedback. I do realize there may be reason due to the outbreak, but if it is the case then do not state that items are due to be delivered within about 10 days when order is placed. Also provide proper feedback for status of orders placed.", "rating": 3}, {"title": "I ordered a rumper jumpsuit", "text": "I ordered a rumper jumpsuit, first it was out of stock, then 2 days later show up as in stock so I ordered it, the amount was taken out, then an additional $1.94 was taken out as well, which is no big deal, but had I known it was from China I wouldn't have ordered, I've ordered from there before and was very disappointed in what I received, hope this isn't the same experience of poor quality and disappointment....I'm not the one....", "rating": 3}, {"title": "Disappointed", "text": "I purchased a tankini which was lovely but far to big, went to the Post office today to return it (with the intention of getting it again in a smaller size) but was told it would cost £20 to be able to track and it only cost me £24 so will not be using them again", "rating": 3}, {"title": "Apology and refund", "text": "Be careful. Liked the product but customer service was disgraceful. I returned a purchase within time appropriate and was refused refund.   Take careI am happy to advise I have now been given an apology and refund from Rotita. I want to thank Trustpilot for the opportunity to voice my experience. I have updated my rating and hopefully Rotita have updated their business practices", "rating": 3}, {"title": "I ordered twice from this company", "text": "I ordered twice from this company. The shipping took forever. It seemed to me though, once I signed up for email alerts to track my packages, the process moved along a bit quicker. I will not be ordering from them again in the future. The shipping takes far too long, and I don't fully trust the site. As far as the bathing suits I ordered, I did like them.", "rating": 3}, {"title": "Rotita review", "text": "Their customer service is awful can’t get a hold of anyone and hours of operation are from 9pm to 6am?However I’ve ordered multiple dresses from Rotita and all were fantastic! They fit great, quality is good and can’t beat the price.  Yes shipping took forever, and for some reason my order was broken up into 2 different shipments but if you are willing to be patient and wait you will be pleasantly surprised.", "rating": 3}, {"title": "The sizes are too large!!…", "text": "I love the clothes I find on the Rotita website. My problem is that almost zero items are available in size small. You advertise continually, teasing me with great finds, and then when I go to order, they are only in Large and double or triple large. I can't find a single item that I want in my size. I am so disappointed!!", "rating": 3}, {"title": "Lovely styles but the fabric & cut are off", "text": "Lovely styles but the fabric may not be as described thus the clothing may not fall as advertised. Two of the three bathing suits were okay. I purchased three shirts with printed designs as in the photo online, but the fabric was not at all what was on the model on their website. The length of one shirt was shorter, and another was cut differently from that which they described. This is a hit-or-miss shopping experience. I likely won't purchase from them again.", "rating": 3}, {"title": "So I ordered two bathing suits around…", "text": "So I ordered two bathing suits around January 26 and it says it still processing on the website. But I called the number that one of the other reviewer’s indicated and it turns out that the area in which this is shipping from is plagued with the coronavirus. I called and the guy was helpful and worked w me to refund my money.", "rating": 3}, {"title": "Disappointed", "text": "I ordered a lace dress which thank god l ordered 2 sizes to big as it would not have fitted at all, the material is very skimpy and thin, not what l thought I was going to get, also it took 23 days to receive it,It does not hang properly and it would probably rip if l ever wear it,I do not think the quality is good at all, still what do you expect when it comes from China", "rating": 3}, {"title": "I was pleasantly surprised to find…", "text": "I was pleasantly surprised to find Rotita’s online store. Such a large variety of swimwear and the quality is good. The only thing I would say is, I wish the sizing was more accurate. A Large is a uk 12-14. Well I’m a size 12 so it is abit baggy, but if I got a smaller size it would be too small. They do cater for long bodies/tall people which is great.", "rating": 3}, {"title": "Great Items, Slow Delivery, Horrible Return", "text": "I have purchased about 16 items, and I have only had one item delivery that was not what was expected as far as workmanship is concern. I also had two items that were not the size stated and unwearable.The company return half of my money for the the problems. It cost you to return items and it takes 6 weeks or better to get your item in the beginning so return the item is more  aggravation then any one solos deserves.", "rating": 3}, {"title": "The tunic tops are stunning in the ads", "text": "The tunic tops are stunning in the ads. The colors are awesome but they must use special lighting because my top was a very dull, ashy color. Pay attention to their size chart, these run small. If you are an XL you will need a 2XL. I keep seeing the ads and love the colors and designs but am afraid to order again.", "rating": 3}, {"title": "Won't be ordering again.", "text": "I decided to order a cute tee even after reading the reviews. Did not get what was pictured. Did however get what looks like a knock off. It was still a nice looking tee, but not what I expected, the pretty lace looks heavy and ugly like the stuff you see on a table cloth. Plan on trying to remove the lace as the top is ok. Checked the overall garment and figured the stitching will hold for a few washes. Sizing was good. But don't expect to get what you see in the picture.", "rating": 3}, {"title": "Long wait for arrival, one of three items need repair", "text": "Order three shipments, so far received one. The shipment had three items.  I wore one item and washed it and is coming apart at one of the seams. The other two items so far so good.  The items descriptions are quite accurate, and I was extremely pleased. However, It is quite a long wait for shipment and I fear that the winter will be over before all my items arrive.", "rating": 3}, {"title": "Good Design and colours and arrived on…", "text": "Good Design and colours and arrived on time. Very disappointed with the material quality. Cheap nylon!order #W2110091821573348We also need to return one of the order of 6 as the design shown in the advert was different to the one received.", "rating": 3}, {"title": "Dress", "text": "I contacted customer service immediately after ordering 2 dresses by mistake. Customer service did not get back to for several days. I wanted to cancel one of the dresses but was told I couldn't cancel or return one of the dresses because the shipping was two expensive. So now I have 2 of the sands dresses! Very disappointing. I love the clothes but would have liked better customer service!", "rating": 3}, {"title": "I was very happy with the items I…", "text": "I was very happy with the items I purchased but had to return one for a larger size.  I was disappointed that I did not receive the larger size as promised.  It took way more then 3 days to process my order and in the end I cancelled it. As a couple weeks had past and my order was still not processed.", "rating": 3}, {"title": "The ordering process was easy", "text": "The ordering process was easy, web site easy to negotiate.  There should be a customer service phone number to call because submitting a ticket doesn't work well.I made a purchase on April 18, 2017.  It has been a month and it still hasn't arrived. That is not acceptable to me compared to other web sites that I order on line with.Cheryle Meyers", "rating": 3}, {"title": "Long wait and worry", "text": "If I had read the reviews I would never have ordered. Having said that, I did receive my two orders. It did take forever. It crossed my mind that I was being scammed. (I understand Zullily also takes a long time). My wife likes the items and had no complaints about sizing (M). She noted there are no \"Rotita\" labels anywhere on them. Not sure what that means. I would be hesitant to order again and if I did, I would make sure I ordered 6 weeks or so in advance of when I needed them.", "rating": 3}, {"title": "This company is rubbish I sent two tops…", "text": "This company is rubbish I sent two tops back because they are terrible material,I never got a refund,they said they never received them I sent them back to be signed for and somebody signed for them so I don't believe them so if you order any off them I am just warning you of what happened to me", "rating": 3}, {"title": "Mixed satisfaction", "text": "Ordered two nearly identical items.  One fit well and one fit poorly and is being returned. Quality seems fine on item I've kept. Didn't have to wait forever for items to arrive. Return process simple so far. We'll see how long it takes to get reimbursed.", "rating": 3}, {"title": "I was disappointed by the amount of…", "text": "I was disappointed by the amount of money I had to spend on shipment charges and clearance tax and/ customs duty, I am in the process of returning items I didn't like and am dreading the process because it it not as straightforward as the purchasing process", "rating": 3}, {"title": "Sizing seems accurate however the…", "text": "Sizing seems accurate however the fabric seems all over the map, some t-shirt, some polyester unbreathable like a beauty tech might wear yet all show same composiiton.  The cut of them varies as well.  So hard to buy clothing online and with this company, forget exchange/refund its simply too hard to do.", "rating": 3}, {"title": "\"Out of Stock\", is the stock response.", "text": "Purchases are often made for items that are no longer a part of the inventory. It's inconvenient and I often miss the opportunity to make another purchase because it is weeks before I find out the item I was waiting for anxiously is no longer available. Fix it and you will have earned four stars.", "rating": 3}, {"title": "Great Service...Lousy Product", "text": "The service was excellent! Unfortunately, the product was not. I ordered a pretty, delicate necklace...it broke the first time I wore it. No, I wasn't running around or even active. I was sitting quietly in church, glanced down, and saw the necklace on my lap. The chain was broken. I realize you get what you pay for...but I thought I would get at least more than one partial wearing!  The 3 stars represent the prompt service and ease of ordering. The product gets zero stars.", "rating": 3}, {"title": "Rotita Order", "text": "After ordering 3 items and the reading the bad reviews I didn't hold out much hope of receiving my order, I ordered 3 tops on 1st March, I was sent a Royal Mail tracking number and I received them on 11th March. The clothes are small but I bought larger, I ordered large 14-16 being a size 10-12 and they fit perfect so be warned they are not true to sizing as we know. They are off an ok quality not the best or worst. I have yet to wash them though so we will see.", "rating": 3}, {"title": "I ordered swimsuits", "text": "I ordered swimsuits.  2 did not fit and it took several days of emails to get the package label to ship them back.  ROTITA should include this in the original packaging to make returns less of a hassle.Otherwise, the one suit I kept is very nice and fits perfectly!", "rating": 3}, {"title": "Difficult refund/return process", "text": "I ordered twice and only 2 things fit. I asked for a return address and was asked to keep the clothes for a 50% refund. I still haven't heard anymore and have not received any refund. I think I qualify for a 100% refund by now. I would re-order some,of these items if I got my refund. I really like the 2 items that fit!", "rating": 3}, {"title": "Nothing wrong with y our product, your service is what I am having a problem with.  Pease read my review.", "text": "Nothing wrong with y our product.  I ordered a blouse and decided I don't like it.  I am finding it very hard to do the steps to return and get the refund.  It arrived here on June 23,.  Please advise on how to get through the steps to do this.  I have tried and you are not responding, as stated you will.Mary Porterfield", "rating": 3}, {"title": "Customer service on live chat with Sue…", "text": "Customer service on live chat with Sue was excellent! The item I ordered was delivered quickly and was of good quality, just unfortunately too big and needed to be returned. The whole returns service was needlessly complicated and frustrating however and will put me off ordering from this site again.", "rating": 3}, {"title": "I have really enjoyed the products and…", "text": "I have really enjoyed the products and service until recently when I had ordered a bathing suit and it was paid on Feb 23, 2018 and I still have had no response about what happened to this order.  I did let them know I had computer issues but they still should have notified me when I emailed them my complaint.", "rating": 3}, {"title": "Sizing", "text": "My latest order came in and the sizes were not right. I ordered a dress and the original was too small so I returned it and ordered the next size up and it was too big. This is the first time I have had problems. Usually everything fits the first time.", "rating": 3}, {"title": "XL LADIES BEWARE", "text": "XL LADIES - BEWAREThe dress I ordered came within a couple weeks from China (though it said it was coming from Nigeria). It's nice, not cheap as other reviews stated. Looks just like the picture. However, I ordered a 2XL (which is usually too big for me because I wear an XL).  But it would not go down over my chest at all, I could not get it on - and I'm not huge up top. The sizing system is very off. This dress MIGHT fit someone with a 38 inch chest - someone that wears a Large. And if you have larger arms, forget it.", "rating": 3}, {"title": "I love the merchandise!", "text": "Like  I said love the product but it take to long to ship I waited 2 weeks for my order to move from processing and now it is in China   on a airplane now have to wait for my order to China I wish I knew it was going to be shipped from China I would order something from USA If they have anything form USA...........?????", "rating": 3}, {"title": "I was pleased with 2 items and ordered …", "text": "I was pleased with 2 items and ordered the same size again in 2 other garments and found them cut to small ..so I was very disappointed with the feedback about sizing and returns system I have 2 garments no use to me ..I will send to charity ..otherwise lovely  clothes but sizes very debatable ..needs to improve.", "rating": 3}, {"title": "Satisfied with exceptions.", "text": "I ordered several items on April 12, 2018 and I received them on April 25, 2018. I paid for 5-6 day shipping but 13 days later was my delivery. Had no idea it was coming from China. The items are nice and I could wear them all. I will possibly order again but will increase a size up for more comfort.", "rating": 3}, {"title": "I actually ordered two tops before…", "text": "I actually ordered two tops before reading the reviews. I thought I had lost money, leaving on vacation made returning imposible. Sent two messages, with no response.  After waiting 2.5 wks package arrived.. I was then afraid to open parcel. I wear an XL and since it was coming from China  sized up to xxl.  Well the tops fit perfect, colors are nice too. I am not sure how to care for them since tags are not to clear. I think I will hand wash, hang dry. I will order from USA next time. The many bad reviews scare me, I feel I lucked out", "rating": 3}, {"title": "Did not fit", "text": "The blouse I ordered is very pretty.  Unfortunately, it was too small.  Usually I wear a XL.  That is what I ordered but I neglected to consult the sizing chart.  For my size I needed to order a 2XL.  I gave it to my daughter.  She liked.", "rating": 3}, {"title": "Rotita Asymmetric Hem 3/4 Sleeve Flower Print T Shirt I liked the quality of the shirt I…", "text": "I liked the quality of the shirt I ordered.  However, I needed 1size larger.  When I emailed them with what I needed, they were quick with sending a return label.  But I have yet, 5 days short of a month, received the right size.  I just chatted with a rep and he says it will be sent out soon with the info being sent to me via email.  We will see.  I didn’t have it for the wedding I attended ☹️.  I missed your last reply.  Because I didn’t see your reply in time, I can’t reply back.  So I’m sending my order number via this message.  Order number: W2105170525287626.                                       Please help me with this matter.", "rating": 3}, {"title": "I found a ph.# for Rotita", "text": "I found a ph.# for Rotita. It came from another review. Good luck to anyone who needs it.  (509) 588-7320. It's Bretton City, WA.  I tried it but it just rang but it's 8:30 pm where I live (CA).Theven above # called me back. It's a legit contact for this company.", "rating": 3}, {"title": "Excited when I saw the Clothes online but extremely disappointed upon receipt", "text": "Customer service was OK when I had a problem. Most of the agents seem to definitely want to be of service. I spent almost $400 for my purchase experience on the site, but I don't think the clothes I received were value for money. I was so excited when I saw the lovely designs online, thinking I had found the site to buy my clothes forever. But reality struck when I received the clothes - all dresses. The dresses were of low quality, see-through thin material and sizes L and above were not made with any care, just carelessly cut and sewn like a sack - no tapering or tailoring as if people size L or higher have no shape.", "rating": 3}, {"title": "Selection is ghetto.", "text": "Ordered two swimsuits and a blouse.  When they arrived, I immediately tried them on.  The swimsuits did not look as they did in the picture.  I ordered underwire for support, but there is absolutely no support.  They looked more like dresses than swim suits.  The blouse is cute, but not worth the price.  I sent the two swimsuits back by following their \"ticket\" procedure with no problems and my money was immediately refunded.  Their selections are very guady and flashy...not much for a laid back dresser like me.  I probably will not order from them again.", "rating": 3}, {"title": "I was very pleased with my recent …", "text": "I was very pleased with my recent purchase but disappointed to find a flaw in the bottom of my shirt that didn't show up until I washed it.  It is never a good thing to order an item online and then find that it has such a flaw.  Especially when you pay good money for the item.", "rating": 3}, {"title": "Am extremely disappointed by the…", "text": "Am extremely disappointed by the APPARENT delay in the delivery of this item, despite ordering almost a month ago I have still not recieved my order. Contacted live chat at Rotita and `DEMI` was very helpful, much more than whomever answered my previous two e-mails.", "rating": 3}, {"title": "Sizing runs a bit small", "text": "Sizing runs a bit small, material is thin and 2 of the tops are itchy. I ordered several swimsuits and the bottoms are on the big side, while the tops are on the small side. For the cost I will shop elsewhere. WW2105191029377228", "rating": 3}, {"title": "Product not so good.  Service great!", "text": "I was disappointed with the quality and sizing of the tops that arrived so had to send them back.  So my rating is based on this.  The way the returns process was promptly handled by Demi was very good, so I appreciate that this was made easy for me.", "rating": 3}, {"title": "Bought 3 suits", "text": "Bought 3 suits. One for my daughter & it fit perfectly. One of mine fit (according to size chart ordered XL) just fine. Other I ordered XXL according to your size chart. Bottoms fit but top was about two sizes too small. Liked the suits, just wish the one would have fit.", "rating": 3}, {"title": "First order I got within 3 days after…", "text": "First order I got within 3 days after they confirmed my address.  This second order I ordered last week I still don't have it. Have not gotten to wear all the clothes yet on the first order but the ones I have I have been pleased.", "rating": 3}, {"title": "Ordered a suit", "text": "Ordered a suit. It took forever to come and it was not the suit I ordered. Although it fits, I am not going to bother sending it back for the correct suit. Unfortunately first impressions last for me so I won't be purchasing another suit from them.", "rating": 3}, {"title": "Reliable service if a little slow", "text": "Reliable service if a little slow. I am size 12 Australian and ordered a large shirt. It fits well, but horrible, hot fabric. Would be impossible to wear in true summer despite being short sleeved. I would not purchase from this firm again.", "rating": 3}, {"title": "I was very surprised to find that all…", "text": "I was very surprised to find that all the tops did not run true to size. That was very disappointing for me. I have ordered the same size in all of the tops some run smaller than others. I don’t understand that at all", "rating": 3}, {"title": "Second order never received...", "text": "First time in 2019 I ordered a shirt, I received on time and I really liked it. Second time I ordered a swim suit on 20th April and still has not got it!! I wont dare to buy again, at least not before I receive that I ordered last time....", "rating": 3}, {"title": "Bought 3 tops", "text": "Bought 3 tops, medium,  but they were on the small side and not very good quality.  However customer service was great, no problem returning them, very easy and I received a full refund. So I would not hesitate to order from them again.", "rating": 3}, {"title": "Buy American Made", "text": "I received my item after 3 weeks, about expected but the quality is mediocre at best & sizing is quite small.  No contact means: about what you'd expect dealing direct with China.  Why do we Americans never learn: you get what you pay for?", "rating": 3}, {"title": "I received 2 dresses with buttons off…", "text": "I received 2 dresses with buttons off or torn. I love that it is true to size and am trying to decide if I will order again. I’m not happy with customer service. And I was supposed to have my full order by 26th of December and still waiting on 2 dresses and it’s now the 30th. Quality is ok. But when I had an issue customer service offered me 30% off for the dress that was missing the buttons and for the torn dress but I get 45% and 50% emails all the time. That makes no sense to me. Not sure if I will order again. Still deciding. The dresses that I did get with no issues I absolutely love!!! Fits great. Zippers are a little hard to lower but love them!", "rating": 3}, {"title": "The clothing is gorgeous.", "text": "The clothing is gorgeous.I ordered 4 tops in early December 2019.3 arrived in February 2020. The last one arrived in April 2020.The tops fit smaller than I would like. I normally wear an XL, ordered XXL, and they are still a bit too small.The material is a bit strange. Almost a sateen feel, but heavier. I’m a little concerned about breathability during the hot summer months.But the tops are gorgeous and I’m looking forward to wearing them.SURI has been helping me track my order since January. She has been incredibly supportive and professional. - Especially considering China was in the midst of the initial COVID-19 outbreak at the time my order was being processed.", "rating": 3}, {"title": "I ordered a dress from this company but…", "text": "I ordered a dress from this company but quickly cancelled my order after looking into the company more closely . The reviews on their website are amazing but their reviews on independent sites are awful . Looking at reviews on their own site , some are so pleased with their purchase they posted a picture , omg ! they look nothing like online at all . A dress that looked amazing someone posted a picture it was cheap , not well made with a creased skirt . It looked like a large little girls dressing up dress . So glad I realised in time . Don’t order from this company !!!!! I will say though customer service was very helpful and speedy in cancelling my order", "rating": 3}, {"title": "I want to thank Vicky for responding…", "text": "I want to thank Vicky for responding and also for helping me with my order. The item I have been trying to get is for my twin granddaughters 15th birthday party and it's a big celebration.", "rating": 3}, {"title": "Problem Solved by Rotita", "text": "Update:Rotita refunded all of my money, Thank you Rotita. In tears.. I purchased items for Christmas, paid EXTRA for RUSH. Once I paid, it gave me a message saying that even though I paid for 2 day delivery it would take several days to process. That was December 4th. I have checked the tracking number over and over but the item has not been shipped yet. I’m so upset especially since I paid extra for rush delivery and Christmas has passed. They keep writing back saying I need to be patient. I want a full refund including my rush delivery fee. I feel like a fool because I was skeptical seeing it was coming from China but trusted that it was advertised on Facebook. 😩", "rating": 3}, {"title": "Slow shipping", "text": "Love the swimsuits I ordered, but very disappointed in the shipping.  If I had known that my order of April 21st, 2020 was not going to be received until June 23rd, 2020 I would not have placed the order at all.", "rating": 3}, {"title": "Nice dress but poor quality", "text": "I purchased a layered dress and was dismayed to find the layer underneath was a different (unpleasant) colour though I saw that other people who had chosen another colour said the same thing. It is not to dow with the colour - all the dresses are made with 2 different coloured fabrics although they advertise and show a photo of the dress being all the one colour. More annoyingly, I have worn my dress twice and this morning I noticed that the centre back seam has become unstitched - about 15cm.  I bought a large size so the dress is very loose and there is no reason why the seam should be stressed. Cheap dress chap quality.  A shame because the dress style is lovely.", "rating": 3}, {"title": "Great prices", "text": "I got brave and ordered a swim suit with out trying on. The price was so good I figured even if only one of the two pieces fit I would be ok. Turns out they both fit and I love this suit. My experience went quite smoothly.", "rating": 3}, {"title": "Not like the picture on the website.", "text": "Pretty shirt. but material is very thin.  It was supposed to be a scooped bottom,  but it's straight.  The lower section of the shirt shows light blue on the website,  but mine is an odd light green color.", "rating": 3}, {"title": "Poor service and bad quality of clothes", "text": "I ordered 8 pair of clothes from rotita for $170.54. Order was placed on end of June. I was supposed to receive my order before 10th of July but I received it on 25th July. But none of the dresses fit me, they were too small for me. I returned all the dresses at their address and I was waiting for my refund. It has been over 10 days I didn't receive my refund. I emailed them for my refund but they did not responded and i didn't found their helpline number on their website. So, I searched all over internet and finally found their customer service number i.e.e 1/509/588/7320. I called their helpline number and one of their representative helped me with my refund, they took some time but I got my refund in 3 working days.", "rating": 3}, {"title": "Revised review", "text": "Although I was unhappy with the quality, fit, colors not matching and I brought the 3 blouses to Goodwill because I was so frustrated the company refunded 50% of the total cost in a very timely manner.", "rating": 3}, {"title": "Untrue", "text": "1, you say something is so much off and it isn't 2, it takes forever to get your order3. Sizes are not what you state them to be4, you say something is on sell and it's the same price or more.", "rating": 3}, {"title": "Return of clothing", "text": "Clothing purchased did not fit well but I had no problem with the refund. I found Suri in customer service very polite, most helpful and prompt in her replies. 5 stars for her assistance.", "rating": 3}, {"title": "Great products", "text": "Great products. Shipping seems to to need some help. Ordered one swimsuit one day and another the next day. Got the second one first and still waiting on the second.  Been three weeks.", "rating": 3}, {"title": "My recent purchase were small for size…", "text": "My recent purchase were small for size but this is the only time this has happened from the3 purchases from Rotita. The dresses were good but doesn't fit me this time around", "rating": 3}, {"title": "not again", "text": "Nachtrag: Ich habe, nachdem ich das Paket auf eigene Kosten zurückgesendet habe, das Geld zügig zurückerstattet bekommen. Man kann im Livechat auch auf Deutsch mit denen schreiben. Vielen Dank also für die Abwicklung. Ich würde trotzdem nichts mehr da bestellen, weil es mir alles in allem zu kompliziert ist und vom Zoll nun auch noch eine Zahlungsaufforderung gab.I have ordered things worth about 450 € and now have to return a lot of things that are too small or in a funny shape. And that at your own expense! Such a thing does not exist in a reputable online retailer! An order confirmation by mail, in which also the payment terms are in it, one does not even contain. Also no other messages about the shipment status. Only advertising mails are received daily. I will send the package with the items I am returning today and hope that I will get my money credited to my PayPal account! My order number WW2203062317087825", "rating": 3}, {"title": "The dress was not suitable so I asked…", "text": "The dress was not suitable so I asked to return it. I had a couple of issues but Rotita seem to have sorted everything out for me now.  Thank you", "rating": 3}, {"title": "I'm getting worried I'm unable to track …", "text": "I'm getting worried I'm unable to track my order can someone please give me the information on how to track your order when I went to the website and it's saying I have no order", "rating": 3}, {"title": "Be AWARE when ordering from Rotita.com", "text": "Be aware when ordering that you are ordering from China where clothing usually runs smaller and sometimes quality isn’t the best. However, I have placed several orders from Rotita.com and have received my items within a reasonable timeframe and most items have been wearable. I’d give them 3.5 stars overall.  I have had to do some removal and re-stitching of their stitching, repositioning of bows, etc. I know how to sew so this was not a big deal. I figure if I get a couple wears out of the items, I have gotten my money’s worth. That is happening and I get compliments on the items I have purchased from Rotita.com. One thing I do not like is that when I have posted honest reviews on their site including pictures of sloppy stitching, they remove them. Rotita is not transparent in that way which is disappointing.", "rating": 3}, {"title": "The delivery took a month and I had to…", "text": "The delivery took a month and I had to contact the company because I couldn't track it on their website.  Once I did (twice) it worked and the masks are worth the cost.", "rating": 3}, {"title": "It takes a long time for the order to…", "text": "It takes a long time for the order to arrive.  It's a guessing game about sizing.  But if you guess right, you will have several good additions to your wardrobe.", "rating": 3}, {"title": "Order is taking way to long to receive", "text": "Order is taking way to long to receive. Tracking information does not help at all. Tracking info does not give dates or facilities. Would never place an order here again.", "rating": 3}, {"title": "I think the clothes are real nice", "text": "I think the clothes are real nice. I just don't like how you have 30 days to return when some people don't try on things right away when they get them.", "rating": 3}, {"title": "Plus size that are not large", "text": "After ordering and paying for the product, you still need to follow the status of the order.Clothes are smaller than the size indicated in the table.", "rating": 3}, {"title": "I ordered three items", "text": "I ordered three items, all in the size small. One item fits and the other two are too big. All items are made well and look like the picture on line.", "rating": 3}, {"title": "i bout a swim suit that was pretty sure…", "text": "i bout a swim suit that was pretty sure to fit. nice 2 piece tankini type swim dress. would buy it again. still trying this dropshipping thing.", "rating": 3}, {"title": "still waiting", "text": "My honest expereience is that i am still waiting for my shipment , it has been over 10 days and i cannot track down even with the tracking number given.", "rating": 3}, {"title": "The price are great..", "text": "The price are great... but size are too big that is mark.... and take too long to arrive.... I'll still recommended some stuff they're great...", "rating": 3}, {"title": "fashion for all ages", "text": "I love your clothes. am anxious to receive the coat I ordered. the coat I ordered has now arrived and fits great. it's everything I was expecting.", "rating": 3}, {"title": "Demi was very helpful in clearing up my…", "text": "Demi was very helpful in clearing up my problem with not yet receiving one of my tops yet and giving me an address in which to return an item.", "rating": 3}, {"title": "I ordered a top in a 2X and it fits …", "text": "I ordered a top in a 2X and it fits like a Large, unhappy that I can't wear it but won't bother to send it back, will give it to goodwill", "rating": 3}, {"title": "I have not received my order yet!", "text": "I have not received my order yet. Shipping takes forever so I'm not sure how satisfied I will be with the quality of the clothes I ordered.", "rating": 3}, {"title": "CAN YOU SAY UNIQUE!!!", "text": "Rotita has the most unique sweaters/shirts I have seen in a long time!!! I can't wait to see the comments I get when wearing them, :-).", "rating": 3}, {"title": "I love Rotita's stylish clothing!!   but. . . .", "text": "I love Rotita's stylish clothing!!!   The styles and colors are fabulous.  The materials and the finishing touches need some TLC.", "rating": 3}, {"title": "Customer Relationship", "text": "I’ve been with Rotita for about 4 years and it was all good. Each item that I received fit very well because I went up a size in somethings and up two sizes in other things. Jean material I went up 2 sizes, church dresses I’m a 14 so I ordered XL no problems. Last year I didn’t get an order, PayPal gave me the refund, so PayPal is earning money of course and PayPal don’t care about us, and I’m getting rid of PayPal as well. Moving forward the clothing is being made once the order is place, and one of the reasons it takes so long to get an order, also it seems like Rotita doesn’t have a full running company, based on their lack of communication and their willingness to satisfy it’s customers, doesn’t seems like a company banking $. I understand it takes time, but over a month in my opinion is to long. I probably will not use them again, this is my last time. This is an China or wherever they are, maybe working out of a basement. Burn me once shame on you, burn me twice shame on me, there won’t be a third time. See ya", "rating": 3}, {"title": "I order a dress and my Lord it taking…", "text": "I order a dress and my Lord it taking me the longest to get it but I really,really love you all clothes. Just take me to long to get it.", "rating": 3}, {"title": "I am a little frustrated in the refund…", "text": "I am a little frustrated in the refund time. Tracking shows my return was received June 26 and I still have no refund.", "rating": 3}, {"title": "I have been incredibly frustrated at…", "text": "I have been incredibly frustrated at for the first time four outstanding orders stuck at Shanghai International airport since 26 March to last order 11 April.The order on the 26 March finally arrived in Auckland and is on track to come to me.  The estimated dates of ETA are out by at least 3 weeks.   I have looked back on my previous orders even with Convid and realised that these orders I chose the flat shipping rate ie zero so therefore these parcels are not prioritised so will arrive when ever.Todays order I chose express shipping which was an extra $24 so be interesting to see if that is why the other orders are on the very slow boat ex China.In saying that all the clothes I have received I have been very happy with.So outstanding orders are:W2004080746163700W2004290522511431W2004150822285499So in summary over a certain value flat shipping rate - ie zero.  YOu will wait 8 weeks for it to arrive.  Last week order paid express shipping $26 dollars already in Sydney so be aware its the shipping options for the extreme delays", "rating": 3}, {"title": "Check the sizing", "text": "The clothing is nice, but the sizing does not match regular US sizing.  Be sure to order at least one size bigger to get a good fit.", "rating": 3}, {"title": "I purchased 3 dresses and 2 pair of…", "text": "I purchased 3 dresses and 2 pair of shoes last month from their website worth of $112.68. I received my order almost after 20 days.Among the 3 dresses 2 of them was small in size and one of them was not of good quality and one of pair of shoe was good but the other one was too small. So I decided to keep one pair of shoe and return all the other items. I read the return policy and got my refund ticket but got no response from their side, so I emailed them still there were response from them. So I searched for their customer service number all over the internet and asking it from my friends and finally I got their number from one of friend. I called their CUSTOMER SERVICE NUMBER - 1/509/588/7320.One of their employee answered the call and said due to server they were unable to give the response back to any of their customer, but he said he surely help me with my refund. They took around an hour over the phone to process my refund and within 3 days I got my money...I GAVE THEM 3 STARS JUST BECAUSE THEY PROVIDED ME THE WHOLE REFUND..", "rating": 3}, {"title": "Waiting to get an exchange on the last…", "text": "Waiting to get an exchange on the last bathing suit that I sent back!!!! Then I will do a review.ThanksCindy Hardy", "rating": 3}, {"title": "Swimsuits were pretty decent, customer service not so much", "text": "I am not big on writing reviews because I normally don’t buy from these types of companies before reading reviews and doing some research. I usually buy a few items at a time to have more option, try them on at home and return what I don’t want, that is always how I shop online. I had seen their swimsuits and the reviews were quite good so I placed an order of about 6-7 swimsuits planning on keeping 1-2 and returning the rest. Because I knew I would be returning some of the items, I researched on the refund policy and their company location, and it was in the UK; hence not costing loads to send to the other side of the world. So I placed the order. I received the items quite quickly, and to be fair they were true to the pictures and fit was pretty good too: I decided to keep 2 and send rest back. I contacted the company and they gave me the returns address.... in the USA 😡 so I will probably have to pay the same amount as I paid for the actual swimsuits in postage to return them. So I won’t be ordering from here again. I gave an average because the swimsuits were quite nice.", "rating": 3}, {"title": "Meh- Not Impressed", "text": "I purchased two shirts, in different colors. The shirts fit, however, they are really short. The pictures look deceiving.", "rating": 3}, {"title": "Customer services", "text": "Emailed customer services with an issue and received a reply back straight away with a resolution.", "rating": 3}, {"title": "I received two of the same dresses in…", "text": "I received two of the same dresses in error and followed protocol for return, I await your response, thanx", "rating": 3}, {"title": "SIZING COMPLAINT.", "text": "I bought a lovely top, but your sizing is ridiculous l got an XL which  would have fitted  a size 10 verry disappointed", "rating": 3}, {"title": "I ordered the XL", "text": "I ordered the XL, but it is much too small. It's a pretty top but it does not fit at all, would fit a size small.", "rating": 3}, {"title": "Beware - Refunds are NOT provided by this company.", "text": "UPDATE - Rotita finally refunded my money after this complaint but I still find it unacceptable to have to go to these lengths to get my money back.  I'm glad to have resolved my issue but I will never shop with them again.  Live and learn!Original post:The order and receipt of goods was acceptable.  The goods themselves were decent for the price paid.  Where the issue came in was when I tried to return 2 items.  I shipped them back and they received them within 30 days of when they had shipped the original order.  I tracked my Return and I gave them over 20 days after they received my shipment to give me a refund.  They are now refusing to give me a refund, stating that it was over 30 days from the original shipment.  It was exactly 30 days so that is not appropriate.  Then I asked that the items be returned to me, since I had paid for them.  They just keep responding with the same '30 day refund policy' and won't provide any other reply.  I have filed a complaint on the econsumer.gov site and wanted to post something here too, since I try to look any new company up before I order from them.", "rating": 3}, {"title": "Quality is not as good as I had hoped", "text": "Quality is not as good as I had hoped, especially for that price. Seams pulling loose before I ever wore it", "rating": 3}, {"title": "Awaiting shipment", "text": "I ordered Christmas sweater dresses for me & my daughter for our piano recital ....hope they get here in time!", "rating": 3}, {"title": "I have problems with sizing", "text": "I have problems with sizing, especially  with bras and intimates. Other than that I Love shopping. Thanks Becky", "rating": 3}, {"title": "I needed a navy blue dress for My…", "text": "I needed a navy blue dress for My daughters wedding.  It fits really good.  I will be ordering from them again.", "rating": 3}, {"title": "I've been trying to return my purchase", "text": "I've been trying to return my purchase. No return address and they won't respond. No invoice included.", "rating": 3}, {"title": "Never received all of my clothes & the size I did received wasn't fit for me. Disappointed and want my money back.", "text": "Their clothes are made in CHINA, so my jeans didn't fit. Very disappointed, Will try to get my money back.", "rating": 3}, {"title": "receiving Order", "text": "Not thrilled when a company takes so long to ship their products. It look a month to receive my order.", "rating": 3}, {"title": "I paid extra for the 5-7 day shipment", "text": "I paid extra for the 5-7 day shipment. It has been almost a month now and still waiting for my shipment.", "rating": 3}, {"title": "I would Love to give a review but im …", "text": "I would Love to give a review but im still waiting on my bathing suit, it has been quite sometime.......", "rating": 3}, {"title": "It's good", "text": "It's good. My bow on dress was a Lil defective but overall OK.  Dresses r really true to size.", "rating": 3}, {"title": "the suit i ordered showed on the …", "text": "the suit i ordered showed on the website shorts as the bottom, what i received was bikini bottoms.", "rating": 3}, {"title": "Took a while to get shipment", "text": "Took a while to get shipment.  It was sized correctly and fit good.  Will order one more time", "rating": 3}, {"title": "Where's my order???", "text": "Have not received my order. Tried tracking order number but number invalid. WW1612210219412361.", "rating": 3}, {"title": "I loved the dress I got but the XL size …", "text": "I loved the dress I got but the XL size which was my size on the size chart did not fit me :(!", "rating": 3}, {"title": "Sowshi hoped me get a refund", "text": "Sowshi hoped me get a refund, i ordered the wrong item, had no troubles,  thank you!!", "rating": 3}, {"title": "I can never find small size and never…", "text": "I can never find small size and never know what the fabric is until I receive the product", "rating": 3}, {"title": "return some item to small from china", "text": "some item are to small from china  please check the size from china   thank you  Barbie Wert", "rating": 3}, {"title": "It’s a hit or miss", "text": "It’s a hit or miss, sometimes the clothes are gorgeous and sometimes they aren’t.", "rating": 3}, {"title": "Loved the bathing but must have wrote…", "text": "Loved the bathing but must have wrote wrong size need to return & have no address", "rating": 3}, {"title": "On Fleek", "text": "The apperal on the Rotita site are so unique Im so excited I cant wait to make my order", "rating": 3}, {"title": "My order came and it's not complete…", "text": "My order came and it's not complete still waiting for the rest of my order.", "rating": 3}, {"title": "Do not like the fact, of not knowing when your order will ship.", "text": "I'm curious to when my order will ship, there has not been any date to reference.", "rating": 3}, {"title": "Still waiting", "text": "Still waiting for my order so I don't know yet my opinion of the merchandise.", "rating": 3}, {"title": "I need to return a dress because it is…", "text": "I need to return a dress because it is too big. Where do I send it?", "rating": 3}, {"title": "Quick delivery of item but returned as …", "text": "Quick delivery of item but returned as poor quality. Still waiting for refund.", "rating": 3}, {"title": "Confused about delivery date", "text": "Put order in February 20th it is now March the 22nd have not heard a delivery", "rating": 3}, {"title": "clothes ran smaller then stated", "text": "clothes ran smaller then stated. The return website is very hard to navigate.", "rating": 3}, {"title": "Excellent products quality fabric great…", "text": "Excellent products quality fabric great price. What more could I say", "rating": 3}, {"title": "Delivery", "text": "Still have not received delivery and my pay pal account has been charged.", "rating": 3}, {"title": "I ordered 5 blouses", "text": "I ordered 5 blouses . I only received 4. Is my 5th one on its way to me.", "rating": 3}, {"title": "I ordered 3 items in Deceber 2017", "text": "I ordered 3 items in Deceber 2017. I have received 1Still waiting.", "rating": 3}, {"title": "I love the clothes and prices but it …", "text": "I love the clothes and prices but it takes so long to get orders.", "rating": 3}, {"title": "It is beutyful cloth but it take to…", "text": "It is beutyful cloth but it take to long tim to com to Iceland", "rating": 3}, {"title": "Need better shipment times takes too", "text": "Need better shipment times takes too long to get product!!!", "rating": 3}, {"title": "Tops I ordered were very pretty but…", "text": "Tops I ordered were very pretty but sizing was all wrong.", "rating": 3}, {"title": "Bought a blue summer maxi dress and…", "text": "Bought a blue summer maxi dress and everyone loves it.", "rating": 3}, {"title": "I like that this company offers many …", "text": "I like that this company offers many plus side items.", "rating": 3}, {"title": "Takes too long for shipment of my order", "text": "I placed a order and paid, but shipping is too long.", "rating": 3}, {"title": "Took way to long to get it", "text": "Took way to long to get it. Took almost 3 weeks.", "rating": 3}, {"title": "Shipping", "text": "Takes a very long time to get the product.", "rating": 3}, {"title": "It took a little longer than it should have.", "text": "Date of experience: May 24, 2017", "rating": 3}, {"title": "Some bathing suits don't have lineing", "text": "Date of experience: April 05, 2017", "rating": 3}, {"title": "Long process", "text": "Ordered and waiting long time to get item", "rating": 3}, {"title": "very slow on delivery of items purchased", "text": "Date of experience: June 08, 2017", "rating": 3}, {"title": "Style", "text": "Very reasonable prices on your items.", "rating": 3}, {"title": "beautiful items", "text": "beautiful items, at beautiful prices", "rating": 3}, {"title": "Takes along time to receive items", "text": "Date of experience: September 16, 2019", "rating": 3}, {"title": "sizing is not accurate on clothes.", "text": "Date of experience: June 07, 2017", "rating": 3}, {"title": "Didn’t fit it was too small.", "text": "Date of experience: March 23, 2021", "rating": 3}, {"title": "Great qualities", "text": "Exactly like it is on the site", "rating": 3}, {"title": "not bad", "text": "need more experience to talk..", "rating": 3}, {"title": "Nicely done", "text": "Nicely done. Interesting", "rating": 3}, {"title": "To long to get my order", "text": "Date of experience: December 06, 2017", "rating": 3}, {"title": "Style", "text": "Love style on dresses", "rating": 3}, {"title": "Clothes", "text": "Cute clothes n prices", "rating": 3}, {"title": "Very disappointed", "text": "Date of experience: February 02, 2020", "rating": 3}, {"title": "I placed an order with Rotita two weeks …", "text": "I placed an order with Rotita two weeks ago. Usually I read reviews if using a new site but this time I was swayed by the pictures of the clothes. Upon reading most of the reviews on Trustpilot I started to worry about my forthcoming order. They arrived today so I will share my experience. They arrived, as many have said, in a black plastic bag. Upon opening the bag, all three ordered items were in cellophane.  They all needed a good iron. I ordered the White high low turndown collar button closure dress, size XL at £21.91. It was a bit of a struggle getting it over my head, it just fitted, I could have done with the next size up. I shall not be returning it because of all the hassle I have read about on these pages. The material is 65% cotton &35% polyester.  I need to snip off threads.The next item was the long sleeve pocket design maxi dress, size XL for £29.33. 65% cotton, 35% polyester.  This is a very baggy dress so it fitted with room to spare. Again, I need to snip of threads but this item is ok. The pockets are higher than in the picture. The dress is a crossover which is not apparent in the picture, I am not keen on the crossover neckline but I can cover that with a scarf, unfortunate, but wearable.My third item was the turtle neck, long sleeve asymmetric hem, plaid straight dress for £18.12. again this is baggy so it fitted. This is the only item with a tag with instructions on caring for the garment. The material is thick but no tags to tell me what the material is. It looks like a cotton mix on the outside but it is lined with a thicker polyester/nylon type material.After reading the reviews on this site, I consider myself one of the lucky ones. I think this was due to the fact that two of my garments were very baggy. Beware if you order close fitting items, if you want to risk it, go bigger but having said that, it is best to take note of all the disappointed people who have taken time to write to Trustpilot about their experiences with Rotita. Like I say, I was one of the lucky ones, order at your own risk. The the black bag it arrived in, the return address given is:-Mr HU CNEUnit 3Skyport Trade ParkSkyport DriveHammondsworthMiddlesexUB7OLBMany have said on this site that you have to return stuff to China at a hefty cost as they will not accept returns to this address so again, beware. I have written the returns address down as if you are still considering ordering after all the bad reviews, it may be worth contacting the above address to see if you get a response to any queries you may have, but again beware, you may not get the truth. I am just going to wash the white dress I have ordered to see how it washes and irons. Any problems and I will be back online.", "rating": 3}, {"title": "Lovely material", "text": "Date of experience: November 29, 2017", "rating": 3}, {"title": "Sizing is off", "text": "Date of experience: January 25, 2018", "rating": 3}]