[{"title": "Nice products when they actually…", "text": "Nice products when they actually arrive. But the shipping process and delivery times are ridiculously slow. Order placed on 16/10 and still hasn’t been shipped. It’s now 6/11! Seems a little bit too slow in comparison to other online retailers! Disappointed once again as last order was even longer and thought it was lost but took so long!!! Hopefully worth the wait!! ", "rating": 3}, {"title": "I was so excited to buy the leggings BUT...", "text": "I was so excited to buy the leggings. I got the wrong size the first time but no returns so I ordered a bigger pair. All the videos and advertisements about the tummy control leggings state that they don't fall down but they do. I also bought the booty lifting ones and they are ok but created a roll under my butt that is not flattering. I am disappointed but now stuck with these because all sales are final so it is what it is and lesson learned. ", "rating": 3}, {"title": "Smell is unbearable but the pants themselves are amazing.", "text": "The shipping time is a little bit to long, the smell that come with the clothing is unbearable and I have yet to be able to remove it, through 4 washes, 2 days hanging out side and one vinegar soak they still real and I am unable to wear them. If I can ever get rid of the smell they will be my favorite pants and worth 10/5 stars, but if not they are a 0 since they can’t even be worn.", "rating": 3}, {"title": "The product was unexpectedly bad", "text": "The product was unexpectedly bad. With so many influencers pushing this product on social media I was expecting a quality product. The Breezeful Jumper was so cheap looking for $50 spent. The color and fabric of the top didn’t match the bottom. The fabric for the attached pant/bottom resembled and felt like a microfiber bedsheet fabric. Return policy not easy or convenient. I opted for the gift card/credit which leaves me with a jumpsuit I’ll never ever wear and a gift card to buy more product from your website. I’m not confident that I’ll be happy with another purchase. We will see. ", "rating": 3}, {"title": "Return process needs serious reconsideration!! ", "text": "Some of the pants do not have a petite, regular and tall option so if the length doesn’t work, they either require tailoring or a return. I wanted to return them as I didn’t care for the amount of flare on the bottom because it made the length disparity even more pronounced. I then discovered  customer service was non-existent and the return process is laborious and confusing. I was even more disappointed to learn that I have to pay for the return shipping. Needless to say, after ordering a handful of times and now feeling like I’m stuck with pants I’m not happy with, I’m not sure I will order again. ", "rating": 3}, {"title": "Did not fit,no exchange option and…", "text": "Did not fit,no exchange option and charge for returns. Using the sizing charts and reviews, I chose a M Regular and am literally swimming in the pants. They are a nice material and seem well constructed but simply do not fit. Return options are inconvenient.", "rating": 3}, {"title": "Super long shipping time", "text": "Super long shipping time, I don’t mind paying for shipping, I just wish I also had a choice to pick a faster shipping option even if I have to pay more, which I don’t mind since I have to pay anyway…Clothing fits okay but I don’t likeSome of the stitching across the thigh, it makes unnecessary rolls…", "rating": 3}, {"title": "Black pants don’t stretch", "text": "I had no issues whatsoever with shopping . The only issue I have is that the black pants I bought don’t stretch nearly as much as every other pair I have in different colors. They’re actually too tight to wear. Pity, I live all the colors I have and had hoped to have a black pair to wear as well.", "rating": 3}, {"title": "Bought the sochinched", "text": "Bought the sochinched. Not the best material. Not very stretchy. Waistband rolls. Not what I expected. The video made it look like the same material as the softlyzero but def less stretchy ", "rating": 3}, {"title": "The item I received was great but the…", "text": "The item I received was great but the experience and delayed shipping wasn't great.  The communication about the delays were timely but didn't give a timeline or any information other than it has been delayed.", "rating": 3}, {"title": "I couldn't believe how long it took for…", "text": "I couldn't believe how long it took for my order to be shipped.  At least a week after I placed the order it finally left the warehouse. The pants are okay, nothing spectacular.   ", "rating": 3}, {"title": "While they are quite comfortable it’s…", "text": "While they are quite comfortable it’s much more spandex like than I would have liked and I find the 7/8 for better than the full length but I have major pulling on one pair after just a couple hours of wear. ", "rating": 3}, {"title": "2 medium petite high waisted pants of same style but different fitting/ length", "text": "I ordered  the same style and of same petite medium size of high waisted pants but received different fittings/length. One is just right but the other is 1inch shorter and more tight around the waist. I can’t return it because I just realized that it was a final sale and can’t be return.I’ll remember next time not to buy a final sale item.The other one was just perfect, soft, good quality , comfy and fits well .I could have given it a 5 star if the other one is of the same size/ fitting.", "rating": 3}, {"title": "Shipping & return policies aren’t great…", "text": "Shipping & return policies aren’t great for a large company. New customers should get free returns for first order when finding what size fits. Plus it wasnt easy to tell when it would arrive (I dont want any more apps) & took a long time to ship.", "rating": 3}, {"title": "I am disappointed with the colour…", "text": "I am disappointed with the colour— the image looked like a darker blue and it was more bright than expected.The fit however is awesome and so comfortable. I would love to own more but nervous about ordering due to the colour not being what it looked like in the picture.I was also a bit disappointed to find that the day after I ordered them there was a 50% sale and it appears from Instagram that it is still going on. I found that disappointing.Otherwise happy with the comfort and fit and the option to not have a zipper and button jabbing into my stomach!", "rating": 3}, {"title": "Great material not sure how to exchange", "text": "The pants seem to fit, but they were big on my waist. I'd like to exchange but when I looked online I couldnt find information on how to exchange. I was given a coupon from the company, put 3 $50 jeans in my cart, and was told my coupon was not valid. No deal, ok, I purchased anyways. Material is great! Style or size isn't right for my pear shaped figure. ", "rating": 3}, {"title": "It was fine but unneccessarily…", "text": "It was fine but unneccessarily cumbersome. I had to write an email, wait for a reply, fill out a form (which included mandatory photos), and wait for a reply, then I got my return options to which I had to submit a response and wait yet again for (finally) a return label and packing slip. Took several days keeping an eye on my email. It felt like I was discouraged from making the return.", "rating": 3}, {"title": "Mildew smell on arrival", "text": "Love your products- however - Two of my three items arrived smelling strongly of mildew. When I contacted you, you did not make it easy. Complicated return instructions rather than apologizing and sending fresh ones. Not good…", "rating": 3}, {"title": "Pretty typical fast fashion retailer", "text": "Pretty typical fast fashion retailer. Quality is very hit-or-miss and the return process isn't as straightforward as they make it seem (first you have to submit a request to even get permission to make a return, then you get specific instructions that vary depending on...some criteria they don't make public). ", "rating": 3}, {"title": "Extremely slow shipping ", "text": "The pants are great! I really love the stretch and comfort but the shipping is entirely too slow. I really want another pair but it takes too long to receive them. I’ll pass because shipping is horrible.", "rating": 3}, {"title": "Some of the things I've ordered seem…", "text": "Some of the things I've ordered seem very high quality, however some other things I've ordered are made of cheap feeling material. If you want to return something you have to send pictures get your return accepted, and then pay to send it back, and then they will refund you. ", "rating": 3}, {"title": "Shopping from the app was easy", "text": "Shopping from the app was easy. However I am disappointed with one of the trousers as the quality is not as good. Seems are not properly done and the fabric is much thinner than it looks on the pictures.", "rating": 3}, {"title": "ordered 2 pair of pants in exact size…", "text": "ordered 2 pair of pants in exact size exact style - one pair fits and one is too small.  I requested a refund 3 days ago and am still waiting on a response. ", "rating": 3}, {"title": "Didn't care for the High Waisted Button…", "text": "Didn't care for the High Waisted Button Multiple Pockets Straight Leg Casual Pants. The fit is off. Don't like the lining on the inside. I am 45, 3 kids, 5'6 typically size 8/10 athletic build. However I do like the fit of Halara Flex High Waisted Multiple Pockets Wide Leg Washed Stretchy Knit. But the exchange for a second pair will be a pain.", "rating": 3}, {"title": "Love the pants as they are super…", "text": "Love the pants as they are super comfortable and true to size but their tracking information was not very helpful.  I need to reach out to their customer service to confirm if they even received my order. ", "rating": 3}, {"title": "The pants are great. — ", "text": "I really like the pants I ordered.  I think you should inform your customers if there will be a delay in shipping.  That is my only complaint.  I will order again and hopefully I will receive my order faster than my first order.  ", "rating": 3}, {"title": "VERY TIGHT", "text": "I ordered my true size. They definitely smooth everything, but they are so tight I had to take them off after about 30 minutes because they were so uncomfortable. They also roll down at the top ", "rating": 3}, {"title": "Returns could be more transparent ", "text": "I wish the return process was more clear and they let you know ahead of time where you need to ship things so you can calculate the cost of shipping. They did give me a gift card and let me keep the items, so I can't complain too much, but when you purchase something thinking you'll be able to return it and then the return process is way more complicated than you thought, it's just a little bit frustrating. ", "rating": 3}, {"title": "High waisted Flare Jeans Halara advertising is very good as it…", "text": "Halara advertising is very good as it lures you into buying.The high waisted flare trousers look very nice but the fail to mention it’s not   Stretchy jeans  fabric but a look alike stretchy jeans  fabric which is a cheaper quality and is been sold at expensive price.The stitching and fit is excellent.", "rating": 3}, {"title": "Only complaint was shipping", "text": "Only complaint was shipping. My package took more than 10 days to arrive once in the US. This was much longer than last time. Not sure what happened but I started to think it would never arrive!", "rating": 3}, {"title": "Comfortable but not as expected. ", "text": "These pants are well made and comfortable. The pockets are too small and too shallow, and since there are no back pockets I cannot put my phone in a pocket which is inconvenient. My tube of lip balm also falls out of my pocket all the time, which is really annoying. I was surprised that the fabric is 100% legging fabric, and there is an obnoxious reflective logo on the left leg which really screams “leggings” as opposed to “pants”. Did that logo really have to go there??? On the whole they are just OK. Not great. ", "rating": 3}, {"title": "I love the quality and fit", "text": "I love the quality and fit, actually a little too big, but that's okay, I'll order a size down next time. I just wish the shipping time wasn't so long.", "rating": 3}, {"title": "I like the material of the leggings but…", "text": "I like the material of the leggings but I do find that I have to keep pulling them up, which is a bit annoying ", "rating": 3}, {"title": "These run a bit large…", "text": "These run a bit large compared to other leggings. Hopefully a couple rounds of washing and drying will shrink them a bit, but the fit is not flattering when they're too big. ", "rating": 3}, {"title": "My emails were not read properly which…", "text": "My emails were not read properly which caused some back and forth before I was able to return my order.  I was way more complicated than it should have been.  The people were nice, though.", "rating": 3}, {"title": "I ordered 3 pairs of pants in a…", "text": "I ordered 3 pairs of pants in a straight leg style and all three came with wide legs. The return system is impossible to navigate. Customer service is slow.", "rating": 3}, {"title": "Way too many adverts and pop ups", "text": "Way too many adverts and pop ups. Returns complicated. Quality of clothing is good for price but getting there is just a faff", "rating": 3}, {"title": "Different fit from ones previously ordered", "text": "I ordered the high waisted button zipper multiple pockets solid skinny hiking cargo pants in forest nighy because I previously ordered them in black. Same size, completely different fit. The fabric for the forest night is not stretchy and I can’t get them buttoned. Black ones are perfect.", "rating": 3}, {"title": "I love Halara products, but…", "text": "I love Halara products. They’re comfortable, easy to move in, fit my active lifestyle and they arrive in good time. However, I was disappointed that I cannot delete or edit reviews, nor can staff delete or edit them for me. I find the lack of flexibility mind boggling in this day an age. ", "rating": 3}, {"title": "Nice product, will order again", "text": "I like the product but do not realize it wasn't made in Canada although it ships from Eastern Canada.  I do like that mass quantities are NOT produced.", "rating": 3}, {"title": "I’m trying to return some items because…", "text": "I’m trying to return some items because they don’t fit and they show that I don’t have an account even though I do with my email. ", "rating": 3}, {"title": "No easy exchanges.", "text": "Site experience was fine, but leggings were very ill fitting and I could not easily exchange. Very baggy.", "rating": 3}, {"title": "I love the pants but… quality ", "text": "I love the pants and how comfortable they are. Unfortunately, they smell awful. I washed them twice now and they just smell like an awful stink probably from cheap material or color die used. They didn’t send updated shipping notification. They just showed up in my mailbox and the next day I got a email saying order was on the way. ", "rating": 3}, {"title": "I guess as a heavier woman I ordered…", "text": "I guess as a heavier woman I ordered the size that I thought would slide right on me like this skinny woman in the ad. But that’s not the truth. When I put the pants on, they actually look like tight leggings or tight yoga pants.", "rating": 3}, {"title": "Ordered my size, but way to tight", "text": "Ordered my size, but they are extremely tight. I understand they are supposed to be, but breathing is important too. :)", "rating": 3}, {"title": "I wish I could have tracked my package", "text": "I wish I could have tracked my package! I am not going to download an app in order to track a package.You should have a link to yrack packages when you say it is shipped snd on its way!", "rating": 3}, {"title": "Love style/ fit- smell not so much", "text": "Love, love, love the pants!  They are exactly as advertised. However they have a horrible chimical smell.  After 2 washes with Oxiclean and baking soada it almost gone and I can wear the pants. ", "rating": 3}, {"title": "Cute style poor fit ", "text": "I liked the style of both the pants and the skirt, unfortunately they did not flatter my body shape. I felt they both emphasized my lower belly. ", "rating": 3}, {"title": "I love the pants however they were way…", "text": "I love the pants however they were way too long and because the way I bought them I couldn’t return them. Apparently I need a petite in lake not a regular.", "rating": 3}, {"title": "The pants are super comfortable &…", "text": "The pants are super comfortable & fashionable. I was extremely excited that they offered it “petite” sizes but they’re really long & still needed to get them hemmed. I’m 5’2” for reference ", "rating": 3}, {"title": "The outfit was too short", "text": "The outfit was too short, hit pretty high above the ankles. I had ordered them in tall. The pockets were too high. I was disappointed, because they are cute in the ads. ", "rating": 3}, {"title": "Metal buttons should be sewn on…", "text": "Metal buttons should be sewn on garment. Every time I wash them, there is a metal button in washing machine that has come off the pants.", "rating": 3}, {"title": "The reason for only 3 stars is the…", "text": "The reason for only 3 stars is the simple fact that they need more Petite sizes for the shorter ladies out here! ", "rating": 3}, {"title": "The pencil skirt in medium was absolutely perfect and so soft. The jeans also super soft but too big in the same size!", "text": "Love the skirt in medium for perfect. Pants in same size medium too big now I have to return for a smaller size cause I dont have the feee shipping with two items", "rating": 3}, {"title": "Mixed experience", "text": "The shopping experience was easy.  But the wide leg stretch jeans are much wider than the looked on the models.  I already cut tag off or would return. Very comfortable though so will wear just around the house.   ", "rating": 3}, {"title": "cute items ", "text": "The product in theory was cute I just didn’t like how it fit me. Super disappointed to find out you have to pay to return your items. ", "rating": 3}, {"title": "Size tall is for normal height people", "text": "It's a shame their tall sizes are actually better for normal height women. I'm 6ft, and a size tall in most other shops where it fits fine, but a size tall is so short at Halara. Gutted as their trousers look so nice ☹️", "rating": 3}, {"title": "I'm on the fence", "text": "At first I was very frustrated because the order had not arrived after 25 days and when I contacted customer service I got a very mechanical response with an explanation that didn't match the dates at all. I replied and got a second response much of the same. I replied one more time giving you a chance and you came through. I received a response that made it obvious someone actually looked at my order and actually gave me authentic information. I was frustrated enough to consider never doing business with your company again but I have to admit that I do like the pants.", "rating": 3}, {"title": "I had to repeatedly ask for the address…", "text": "I had to repeatedly ask for the address to mail return items and when I tried to call the customer number or use the customer support email they were unavailable. having never bought anything from you before it makes you question the quality of your company or whether you exist", "rating": 3}, {"title": "Halara Flex™ High Waisted Crossover…", "text": "Halara Flex™ High Waisted Crossover Pocket Cool Touch Washed Stretchy Knit Casual Super Flare JeansNettle Blue Denim/M(petite)I had ordered these in the past in a size small and was unhappy as the product was tighter than another version of the Crossover jeans.  This time I ordered two pair in the medium thinking I would be safe, but these are just as tight as the small.  So far, I have purchased quite a few of the crossover jeans and have truly only been happy with the fit of one style.  I just wish that particular style came in better colors.  I get a lot of positive comments and I love the look, just wish they had more stretch to them.", "rating": 3}, {"title": "Small fitting", "text": "The item received was beautiful and very good quality. Fitting is really small and didn’t fit and I got my size. Leggings but with very little stretch to them. Took almost 2 weeks to arrive and unsure how to return so just kept them. Expensive for leggings at £35 with delivery ", "rating": 3}, {"title": "Clothes low quality but good costumer support", "text": "I thought it was a German brand, but everything is actually made in China. The quality of the clothes is rather poor, but some are okay. Sizes are a bit random (for the tops, at least).The good point is that they refund you all the clothes you don't like, without you having to ship them back (yes you can keep them even if they reimbursed you, which is saying something about the cost of production...)", "rating": 3}, {"title": "Shipping was very slow", "text": "Shipping was very slow. Waited nearly a month after purchase and it took close to two weeks to arrive. Not sure if I'd order again. Item is ok, not worth the $ amount for the quality. ", "rating": 3}, {"title": "The item said straight leg and it's…", "text": "The item said straight leg and it's more of bellbottom pants. I was a little disappointed in that being misled.", "rating": 3}, {"title": "Decent quality for cost", "text": "Received 2 pairs of trousers. Quality as expected however the hem was machine stitched and about 2 inches deep which changed the aesthetics of the trousers. Smaller, neater hem would be better.I ordered the Tall trousers....32*. I'm 5'8* and they are a little short. A longer version. Would be better please.I also would have liked a dark brown pair, but this wasn't an option in the colour choice.", "rating": 3}, {"title": "Mixed reviews", "text": "I like the wide leg pants, very comfortable. However the micro-waffle wide leg do wrinkle slightly; they claim that they don't. Also, their return policy is somewhat inconvenient. ", "rating": 3}, {"title": "Material is heavier than I thought ", "text": "The material is heavier than I thought.  Fit is very high waisted as I have a short torso it didn’t fit as expected. I would have gotten a smaller size but then the waist may have been too tight. Over all very comfy and stylish. ", "rating": 3}, {"title": "The size on the jacket is way off, slow shipping", "text": "The size on the jacket is way off, a Large is equivalent to a 6-8.  Shipping took forever,  I earned 2 prizes, they were both card holders, not something I would use or wanted.", "rating": 3}, {"title": "Shipping time is way too long", "text": "Shipping time is way too long. I understand that most is made to order, but I feel like for the customer experience who is looking at receiving things quick, 20-25 days is way too long. Also, return policies, i read them and it looks sketchy", "rating": 3}, {"title": "Excellent clothes but long delivery…", "text": "Excellent clothes but long delivery times and difficult to get in contact. Discounts disappear when you try to use them. If it says 2for1, it’s usually not true, and the prize you pay is more than 2 for 1. ", "rating": 3}, {"title": "One item came in the wrong size", "text": "One item came in the wrong size! They fit isn't snug. Not butt lifting. Material is nice. We'll see how they last and wash. I wish they'd sent all large, why one an XL? Damn!!", "rating": 3}, {"title": "Returns process not easy", "text": "Returns process not easyI felt the returns process wasn’t easy . Trying to find the returns process on the website was difficult. I have sent a return request , which I thought was weird , awaiting a response. Did say it would take 24 hours for the returns request to be answered. Watch this space . It’s the first time I have used this company . The quality of some of the fabric isn’t great . The sizes are also not consistent. ", "rating": 3}, {"title": "I love the products, but", "text": "I love the products, but this order took too long. Didn’t know it was coming from China. Very disappointed.", "rating": 3}, {"title": "The pants did not fit the way I…", "text": "The pants did not fit the way I expected them too. They were a little uncomfortable and were not high waisted as I thought they would be. ", "rating": 3}, {"title": "Very nice pants. ", "text": "Great pants, lots of color choices, well constructed. Very comfortable. The inseam for a petite was supposed to be 26 inches, it is actually 25 inches. Very disappointing.", "rating": 3}, {"title": "Four pairs of amazing pants 😊 Great…", "text": "Four pairs of amazing pants 😊 Great material feel and fit !  One pair did not fit and the return process is not convenient!", "rating": 3}, {"title": "Sizing off-returns hard", "text": "Sizing off, trying to return for refund is very frustrating-I think halara does this on purpose so people just give up ", "rating": 3}, {"title": "Takes a while to receive clothing", "text": "Takes a while to receive clothing. Pricing is fair and not cheap. Only jeans with elastic tailie fit for me.", "rating": 3}, {"title": "Long Delivery Wait Times", "text": "I love the products, I will be purchasing again. But the delivery took 1+ months to arrive. That was a bit frustrating, but if you can improve then the service would be an overall 5 stars.", "rating": 3}, {"title": "I love the product but…", "text": "I love the product - but one of the pairs of medium pants fit larger in me than the second one. I wanted to exchange the larger M for a S but your chat it said there were no exchanges. That sucks. I’m having them altered, but now I hesitate to buy from you again. ", "rating": 3}, {"title": "Very long shipping times", "text": "I like the clothing but shipping time was way too long. I inquired twice about where my order was because tracking information was not updated. ", "rating": 3}, {"title": "Well it's really hard to get a…", "text": "Well it's really hard to get a reference number if you don't order on app, and hard to reach you guys on the app.  I had to look up halara canada to get my answers the app was hard to get my point across", "rating": 3}, {"title": "Slow shipping, material picks", "text": "I like the fit and look of the clothes, but the material picks really easily and the shipping was very long.", "rating": 3}, {"title": "I was very disappointed in the pants I…", "text": "I was very disappointed in the pants I purchased. They are just tights with pockets. The material is cheap, I will never buy them again !", "rating": 3}, {"title": "Return process could use some changes.", "text": "Product was just okay in my opinion. Items didn’t not fit. Shipping time was right at 2 weeks. I didn’t realize that they were being shipped from overseas, until after I’m placed the order. My fault for not doing more research. I had to return items. I had to email company to start the return process. I had to wait on the company to respond to the first email, after that I had to wait on the company to send me a second email. The whole return process is an inconvenience.  Seems like the process could be made a bit easier. I’m curious to see how long it will take to process my refund.", "rating": 3}, {"title": "The jeans themselves are very nice but…", "text": "The jeans themselves are very nice but the waist band is way too tight. They fit great in the butt and hips but I just couldn’t breathe", "rating": 3}, {"title": "Love the products but", "text": "Love the products. However, my refund credit expired before I could use it for my most recent purchase.", "rating": 3}, {"title": "Okay", "text": "Good material and fit but does not have tummy control  feature. This was sent from China, but advertised as its from USA.", "rating": 3}, {"title": "Product was great", "text": "Product was great. Delivery not so. No notification of when it would arrived then an email to say it had been delivered but not to where. Had to knock on doors till I found it. No customer care and no promised “free gift”", "rating": 3}, {"title": "I didn’t like the shipping", "text": "I didn’t like the shipping. It was confusing and hard to follow the tracking ", "rating": 3}, {"title": "I am trying to return 2 pair of the…", "text": "I am trying to return 2 pair of the leggings that I don’t like and ever time I try to return them it say error on page. I need to return 2 pair of legging ", "rating": 3}, {"title": "The pants advertised as straight leg", "text": "The pants advertised as straight leg, but were flared. The pants are super soft and nice, I just didn't like the flared leg.", "rating": 3}, {"title": "Buttons fall off and order took forever to come", "text": "The order took a long time to finally come. One pair of pants has a few buttons and 2 fell off back to back on me while I was at work. I had to run home to change. I’m not happy with how they were sewed on. One button the fell off is the one that holds my pants up. It discouraged me from wanting to buy from here again.", "rating": 3}, {"title": "One pair of the 2 leggings I received…", "text": "One pair of the 2 leggings I received had an unsewn area in the inseam. ", "rating": 3}, {"title": "Leggings are ok", "text": "Leggings are ok. Not exactly what I expected. You can see underwear through them so beware", "rating": 3}, {"title": "Super cute, but….", "text": "The pants are super cute and super comfortable.I can not get the strange smell out. It’s like a moth ball smell. Even after 3 washes.", "rating": 3}, {"title": "Pants", "text": "I absolutely love the jeans however, the pants are more baggy than I like and unfortunately the sale is final so I can't exchange them", "rating": 3}, {"title": "Shorter framed person...", "text": "Shorter framed person.... The style made my legs look frompy. But my tallest child cut off the buttons in the front and loves them as loungers around the house. Should have only bought 1 pair to try first...instead of exciting buying 3 pairs...live and learn.", "rating": 3}, {"title": "Did not receive correct product and was denied request of getting sent the correct product ", "text": "I ordered a pair of overalls TWICE and was disappointed both times. The first time o ordered a normal length one and it was too short. Then I ordered another pair in the tall length and it was still too short (it was the regular length). I tried working with service and asked if they would send me tall pair and they emailed back to ask for pictures of the length, which I did and then I received an email saying there is a variation of 1 to 3 inches on each pair of overalls which indicates inconsistency in the product. 1 to 3 inches can be a significant different in length hence my request for a tall pair and not receiving one that actually fit. After emailing back and forth with customer support and providing pictures as requested, they gave me the standard option of just returning the item or  receiving a store credit. If I would have known they weren’t going to solve my issue I would have just requested a return immediately instead of emailing back and forth with customer support for week. Based on the inconsistencies in their products and the lack of empathy in providing a feasible solution after not receiving the correct product, I would not recommend this company to anyone I know. ", "rating": 3}, {"title": "My size wasn't fit with your size of…", "text": "My size wasn't fit with your size of pants. Little bit thight. The pants smell a lot chimical stuff. ", "rating": 3}, {"title": "Small sizing", "text": "I ordered a medium as of size chart. It's a small medium. Not ordering again . Wasted 75 dollars. The tracking options wouldn't work", "rating": 3}, {"title": "Quick delivery but found the sports/gym…", "text": "Quick delivery but found the sports/gym leggings to be very thin material, more like a tight. ", "rating": 3}, {"title": "Order a size down ", "text": "I like them but the sizing runs big. I bought a lg and wish I would have bought a medium. I picked large because it was as for size 12-14. I wear a size 12. But they’re baggy and my butt looks as flat as a pancake. ", "rating": 3}, {"title": "I’ve ordered five pair of denim…", "text": "I’ve ordered five pair of denim leggings have only received two ", "rating": 3}, {"title": "Shipping ", "text": "The clothing is perfect couldn’t complain if I wanted to. But the time frame it takes to receive the clothing from the time you place the order is a bit ridiculous. ", "rating": 3}, {"title": "Sizes", "text": "I have a very hard time getting the sizing correct. My very first order - all the items were way to small so my second order I ordered up one size and now they are too big! Guess my body is not the right shape for Halara Clothing. Thank you,", "rating": 3}, {"title": "I loved the style of the jumpsuit but…the material is wrinkled and very hard to get the wrinkles out.  I have to steam each time they are washed, very annoying.", "text": "I loved the style of the jumpsuit but the material is wrinkled and very hard to get the wrinkles out.  I have to steam each time they are washed, very annoying.", "rating": 3}, {"title": "I expected more form fitting", "text": "I expected more form fitting. They are cute, but not what I expected! ", "rating": 3}, {"title": "Description misleading", "text": "The description was misleading as to the fabric and the return policy is multiple Steps. ", "rating": 3}, {"title": "It took several tries for the site to…", "text": "It took several tries for the site to allow me to add my credit card info. Almost gave up.", "rating": 3}, {"title": "Long shipping time", "text": "Long shipping time, it was free but took over a week to receive my items. one pair of pants was not quality for the price. Felt cheap like shein", "rating": 3}, {"title": "Although I ordered petite pants", "text": "Although I ordered petite pants, they were still too long. When I tried to return, I was offered a gift card or I could pay the return shipping. I took the gift card. Hoping my next purchase is true to size. ", "rating": 3}, {"title": "Clothing is fine", "text": "Clothing is fine. Shipping took way too long. I wouldn't order again because of this. ", "rating": 3}, {"title": "They are very stretchy and tend to not…", "text": "They are very stretchy and tend to not hold anything in. Maybe downsize would help.  My daughters have the pants too and love them.  Not me ☺️", "rating": 3}, {"title": "Pants not black it's greyish ", "text": "The color of the two pants is somehow like light grey not black. ", "rating": 3}, {"title": "I got sent the wrong product", "text": "I ordered pants but was sent the wrong style. It was a completely different one. ", "rating": 3}, {"title": "No quality control", "text": "I have 4 pair of the same pants and they are all different (lengths, waist band, material, etc.)", "rating": 3}, {"title": "Slow shipping", "text": "I like my purchases but it takes a really long time to receive them.", "rating": 3}, {"title": "I love the yoga pants but the jeans I'm…", "text": "I love the yoga pants but the jeans I'm not satisfied with.", "rating": 3}, {"title": "The order was wrong on 3 different…", "text": "The order was wrong on 3 different items Other than that is was okay", "rating": 3}, {"title": "Not being able to exchange for a…", "text": "Not being able to exchange for a different size.   I love the clothes, but that is a problem because the pants are to big. ", "rating": 3}, {"title": "I absolutely love the dress, late delivery ", "text": "I absolutely love the dress, but it took two weeks for me to get it, and my event already passed. ", "rating": 3}, {"title": "I give it 3 stars because my order took…", "text": "I give it 3 stars because my order took awhile to arrive. Is it made in the US or China?  ", "rating": 3}, {"title": "I wish the fabric was nicer", "text": "I wish the fabric was nicer. I live in a dry climate. It gets kind of static-y and sticks to my skin.", "rating": 3}, {"title": "Took over a month to get them", "text": "Took over a month to get them! But I do love the pants! Petites are a little shorter than i expected, I’m 5’3 and wouldn’t want them any shorter. ", "rating": 3}, {"title": "Much more stylish in photographs", "text": "Much more stylish in photographs, the pants don’t fit very well on me.", "rating": 3}, {"title": "Sizing was not accurate to sizing…", "text": "Sizing was not accurate to sizing guide. Pants were bigger than what sizing guide recommended", "rating": 3}, {"title": "Not as buttery as I expected", "text": "Not as buttery as I expected. Very thick material", "rating": 3}, {"title": "Slow shipping", "text": "The items were good, not great but good. I was thoroughly disappointed in the time it took to get my items. ", "rating": 3}, {"title": "I’m really love the pants ", "text": "I’m really love the pants , just I wait to much for the delivery ", "rating": 3}, {"title": "Shipping is entirely too long", "text": "Date of experience: November 05, 2024", "rating": 3}, {"title": "Love the product", "text": "Love the product. But had a long wait because shipment was twice delayed. Still worth it. ", "rating": 3}, {"title": "They are good quality but thought what…", "text": "They are good quality but thought what I ordered would be softer. ", "rating": 3}, {"title": "I still haven’t received my gift card…", "text": "I still haven’t received my gift card and it’s been 24 hours. ", "rating": 3}, {"title": "Shipping took a long time is the only…", "text": "Shipping took a long time is the only negative.", "rating": 3}, {"title": "Didn’t realize you can only exchange…", "text": "Didn’t realize you can only exchange outfits, no returns. Also the pants I got were very bulky. Didn’t look like the ads.", "rating": 3}, {"title": "Don't trust the size guide", "text": "I chose the clothing sizes strickly according to the size guide, but all my pants were too large.   ", "rating": 3}, {"title": "I love them except the zipper blew the…", "text": "I love them except the zipper blew the first time I put them on.  ", "rating": 3}, {"title": "I love the jumpsuits", "text": "I love the jumpsuits. Fits perfect. I'm 5'3\" @ 140 lb. MED petite was perfect! The leggings are too thin.", "rating": 3}, {"title": "Your return is too difficult", "text": "Your return is too difficult, so I now have 2 denim trousers which are little too big. That-s too bad.", "rating": 3}, {"title": "They  didn't tell me that the trousers…", "text": "They  didn't tell me that the trousers were so thin. They are sor summertime. Also, although I use an XL, this XL is too big for me.  And one of them had a small defect.", "rating": 3}, {"title": "I like the communication ", "text": "I like the communication I disliked the length of time it took to receive the product ", "rating": 3}, {"title": "Shipping took a long time and quality…", "text": "Shipping took a long time and quality is not as expected", "rating": 3}, {"title": "I receive the wrong size I Was ordered…", "text": "I receive the wrong size I Was ordered médium et receive large ", "rating": 3}, {"title": "It was just ok", "text": "It was just ok. The product comes from China which is not a problem however, it feels very cheap for the price point it is at. ", "rating": 3}, {"title": "Delivery and returns", "text": "I find it’s too long for delivery and returns are onerous. Love the products though.", "rating": 3}, {"title": "The jeans were not squat proof as…", "text": "The jeans were not squat proof as advertised. And the shirt was small for an XL", "rating": 3}, {"title": "Didn’t like the material or style…", "text": "Didn’t like the material or style particularly.  Not flattering BUT exceptionally comfortable! Maybe in a different style or and material?", "rating": 3}, {"title": "It took a long time to receive the…", "text": "It took a long time to receive the items. One of the items that I ordered was not true to size. The clothes also smelled funny. I will give the one that is too small to my daughter. I already washed the item.", "rating": 3}, {"title": "The delivery was very long", "text": "The delivery was very long. One pair of pants were short. Most of popular items dont", "rating": 3}, {"title": "They are OK", "text": "They are OK.  I ordered Tall but they aren't really that much longer, otherwise they are OK.  ", "rating": 3}, {"title": "Customer service was great", "text": "Customer service was great. However, sizing is off. ", "rating": 3}, {"title": "Too loose ", "text": "The item is always too bigSays XS but im a 10 and the pants are loose on me   You have no smaller size", "rating": 3}, {"title": "Quality of the outfits I purchased were great.  What you see you get", "text": "I dislike how long it took for me to recieve it.  I loved what I purchased.", "rating": 3}, {"title": "Trousers are lovely nice and easy to…", "text": "Trousers are lovely nice and easy to order, but takes way to to be delivered ", "rating": 3}, {"title": "I did a mistake with sizes but the…", "text": "I did a mistake with sizes but the support was perfect.", "rating": 3}, {"title": "I was so excited to try these pants", "text": "I was so excited to try these pants, but I am 5’10” and the talls were still too short for me. ", "rating": 3}, {"title": "Shipping takes too long and return…", "text": "Shipping takes too long and return policy sucks. Also, the sizing was way off. Too small. ", "rating": 3}, {"title": "Average", "text": "Easy shopping experience online, but the product is not entirely what I expected. ", "rating": 3}, {"title": "Took too long to get", "text": "Took too long to get, sizes were off and fabric wasn't that soft", "rating": 3}, {"title": "Pants are the best but it took a month…", "text": "Pants are the best but it took a month for them to be delivered ", "rating": 3}, {"title": "I love the way these jeans feel and…", "text": "I love the way these jeans feel and wear, but the first time I wore them, they snagged twice.", "rating": 3}, {"title": "Can’t return items that don’t fit…", "text": "Can’t return items that don’t fit properly ", "rating": 3}, {"title": "It too too long for my package to…", "text": "It too too long for my package to arrive. ", "rating": 3}, {"title": "Slow shipping", "text": "I love the pants but the shipping takes way to long.", "rating": 3}, {"title": "I need to do a return and I am not…", "text": "I need to do a return and I am not getting a response", "rating": 3}, {"title": "The fabric is very thin", "text": "The fabric is very thin. It does not look very expensive for the price. ", "rating": 3}, {"title": "Facile à commander on verra l'arrivé du…", "text": "Facile à commander on verra l'arrivé du colis ", "rating": 3}, {"title": "Pants are very short", "text": "Pants are very short. Buttons fell off one pair when trying on.", "rating": 3}, {"title": "I love the design and overall fit", "text": "I love the design and overall fit, but the length should be longer. ", "rating": 3}, {"title": "I love the pants!", "text": "I love the pants!! The wait was too long. Need improvement in shipping ", "rating": 3}, {"title": "Shipping took way too long.", "text": "Shipping took way too long.  ", "rating": 3}, {"title": "Average shopping experience", "text": "Average shopping experience, long shipping, product not exactly what i expected for the prices.  ", "rating": 3}, {"title": "Very happy with my purchase", "text": "Very happy with my purchase. Item just as described ", "rating": 3}, {"title": "Items ordered are good- Shipping is…", "text": "Items ordered are good- Shipping is VERY long", "rating": 3}, {"title": "They said they offered Tall and they…", "text": "They said they offered Tall and they were not available in plus sizes.", "rating": 3}, {"title": "Love the clothes bought my normal size…", "text": "Love the clothes bought my normal size but it was tooo big ", "rating": 3}, {"title": "Shipping takes forever", "text": "Date of experience: November 02, 2024", "rating": 3}, {"title": "I would like to return", "text": "Date of experience: November 04, 2024", "rating": 3}, {"title": "All of the items fit larger than the…", "text": "All of the items fit larger than the Size, And they have an odour ", "rating": 3}, {"title": "Hard to tract my order even through the…", "text": "Hard to tract my order even through the app. ", "rating": 3}, {"title": "Good service, quality not great for the money", "text": "Good service. The black trousers are nice, they grey not so. A lot of money for what they are", "rating": 3}, {"title": "Shipping takes way too long", "text": "Date of experience: November 02, 2024", "rating": 3}, {"title": "The product took a really long time to…", "text": "The product took a really long time to get to me.", "rating": 3}, {"title": "The product takes too long to arrive", "text": "Date of experience: November 01, 2024", "rating": 3}, {"title": "It does take a little longer for orders to arrive ", "text": "The products are amazing!!!", "rating": 3}, {"title": "The material was thinner than expected", "text": "Date of experience: October 28, 2024", "rating": 3}, {"title": "Not true to size and the smell is…", "text": "Not true to size and the smell is really bad. They smell like mildew. 🤢", "rating": 3}, {"title": "Some of the items didn’t look like the…", "text": "Some of the items didn’t look like the pictures.", "rating": 3}, {"title": "Gorgeous cords, small sizing", "text": "Items but found the sizing to be small.", "rating": 3}, {"title": "It took about a month to get my order,", "text": "It took about a month to get my order, ", "rating": 3}, {"title": "The returnprocess was really difficult.", "text": "Date of experience: October 26, 2024", "rating": 3}, {"title": "Not too happy with size guide", "text": "Date of experience: October 29, 2024", "rating": 3}, {"title": "Fabric", "text": "Might want to Size down", "rating": 3}, {"title": "Ran too small.", "text": "Ran too small. ", "rating": 3}, {"title": "Too too long to get", "text": "Too too long to get ", "rating": 3}, {"title": "Took way to long to get", "text": "Date of experience: October 29, 2024", "rating": 3}, {"title": "Look on til tok", "text": "Date of experience: October 30, 2024", "rating": 3}, {"title": "Pant was way too small", "text": "Pant was way too small ", "rating": 3}, {"title": "Bien regular ", "text": "Regular , productos regular calidad ", "rating": 3}, {"title": "Ordering went well", "text": "Ordering went well, could maybe have a search button so you don’t have to go through everything before you find what you actually want. The product itself is ok but I ordered long/ tall and they are still a tad too short.", "rating": 3}, {"title": "Poor return process.", "text": "Poor return process. ", "rating": 3}, {"title": "The sizing is so different on…", "text": "The sizing is so different on everything, and many of the clothes arrived with a terrible smell. Customer service was very helpful tho and I was able to return items. And the things that fit are wonderful!!!", "rating": 3}, {"title": "Long shipping wait", "text": "The whole process took a bit longer than expected.  The product was good, but I got an email that said that they only ship once the order is made?  Seems like a good practice to save money… but not as convenient for the shopper.  I would think you’d have a few extra pieces just in case another order is placed??? But what do I know?  What I do know is it took long to receive.", "rating": 3}, {"title": "Quality of the product is not up to the…", "text": "Quality of the product is not up to the standard.", "rating": 3}, {"title": "Your sizing is not appropriate for tall…", "text": "Your sizing is not appropriate for tall people even though some of your pants sizes do come in tall. The length is made barely long enough for someone even 5 foot 11 like I am. But the pants are not proportionately made longer in the rise so that from the waist to the bottom of the zipper they are too short", "rating": 3}, {"title": "Great product, ridiculous shipping", "text": "Clothes are amazing.  Soft, comfortable and a perfect fit.  However, the wait is ridiculous.  They sent a message stating shipping takes longer because they care about the environment and have a zero inventory model.  Then the package shipped from China - which is one of the worst offenders when it comes to “saving the planet”.  Because of this, I probably won’t shop again.  I don’t care that your product is made in China, but don’t hide behind “saving the planet” as the reason your shipping takes forever and a day.", "rating": 3}, {"title": "Delivery too forever !… I bought pants…", "text": "Delivery too forever !… I bought pants for work and they thinner material then the Ads I see. The size Large is a bit smaller fit. For me it’s too pricey for the Quality. Wouldn’t buy again. Oh! The scrunchies are really good, thought I was receiving it for free since I couldn’t remove it from my cart, it ended up costing me $11 . Not cool. Halara after all your Ads I gave in and the quality was meh ! ", "rating": 3}, {"title": "Very cheap quality", "text": "Date of experience: October 17, 2024", "rating": 3}, {"title": "I am a fabletics gal but I have yet to…", "text": "I am a fabletics gal but I have yet to find any leggings that don’t roll down! I just knew these were going to be it. So I love high waisted hike them Jesus compression that stays in place. Although these feel amazing and snatch you they don’t stay put! Every set I finish in the gym I’m doing the tuck and hike dance. I even have to do this dance with my fabletics so I guess I’ll never find what I’m looking for. It’s not all bad as far as the feel and the look I choose my halara’s over my fabletics ", "rating": 3}, {"title": "Overall the pants were okay", "text": "Overall the pants were okay! Fit my body type well, just unsure of the material. Honestly was hoping for a little thicker material. The waist band is a little high for me. I did like the length, and jogger style! ", "rating": 3}, {"title": "Exchanges are not possible", "text": "Exchanges are not possible. I have to return items and pay to ship back. The shorts I recently ordered are too small but I don’t want to return the since I’ll have to pay to ship them back. Will have to hope I lose enough weight to fit in them. ", "rating": 3}, {"title": "Jeans looked more wide leg than straight leg", "text": "I found that the jeans I received did not match the silhouette of the online image. I ordered straight-leg jeans and they are definitely wide-leg and do not work on me. I would prefer not to pay for return shipping but that is the policy. That being said, the quality is good. The clothes are very stretchy and comfortable. ", "rating": 3}, {"title": "Great pant just way to long.", "text": "Date of experience: October 19, 2024", "rating": 3}, {"title": "it took a very long time from when i…", "text": "it took a very long time from when i ordered until i received the package.", "rating": 3}, {"title": "THE CLOTHING IS CUTE", "text": "THE CLOTHING IS CUTE, SHIPPING IS NOT THE BEST AND THE CLOTHING EVEN WHEN I ORDER THE SAME SIZE EVEN THE SAME ITEMS I HAVE PURCHASED IN THE PAST DO NOT FIT. IT IS LIKE THE WRONG LABEL WAS PUT ON. ", "rating": 3}, {"title": "Wedding jumpsuit", "text": "I loved the product, but was surprised how long it took to arrive for the event.  I will order again in the future (just not last minute).", "rating": 3}, {"title": "The fit of the pant was a little…", "text": "The fit of the pant was a little strange. The large was too tight in the legs and too big in the waist. The other styles waist band hit in a weird spot. Also, no free returns. ", "rating": 3}, {"title": "super disappointed with my three…", "text": "super disappointed with my three dresses.  Fit is fine, but in the photo they appear to be the perfect winter staple.  The fabric is a thin knit, not at all what it looked like.  live and learn, I suppose.  If you live in a warm climate they might be ok, for the Northeast, way too thin.update:  Changing to three stars.  This company is amazing.  They reached out and made it right.  I need to change my review based upon their outstanding effort to make sure I was a satisfied customer.  Thank you Halara!", "rating": 3}, {"title": "a month to arrive", "text": "Hello, I liked the product but it took a month to arrive. It would be nice if the wait is going to be so long if they informed in advance.", "rating": 3}, {"title": "The leggings are just OK for shaping.", "text": "The leggings are just OK for shaping. ", "rating": 3}, {"title": "Was disappointed in time delivery took…", "text": "Was disappointed in time delivery took to arrive. No issues with product ", "rating": 3}, {"title": "Love the one outfit ie dungarees but…", "text": "Love the one outfit ie dungarees but the trousers were too on the waist so will give to my daughter for a gift. They took along time to arrive ", "rating": 3}, {"title": "I loved the jeans and have ordered…", "text": "I loved the jeans and have ordered another pair. However, it took so long to receive them. I just got a notice that the second pair of jeans I ordered would have another delay in shipping.", "rating": 3}, {"title": "I ordered the straight legged pants", "text": "I ordered the straight legged pants. Everything is okay except the legs are much wider than I like. The material is great. I will wear them at home but will not go out in public with them.", "rating": 3}, {"title": "Great shopping experience, not so great shipping experience", "text": "The shopping experience itself was very easy and user friendly! However, the shipping was the issue. My first package was lost in the mail and so I reached out to Halara and they gave me a store credit, but it was $5 short. I ended up reordering the item using the store credit, but still had to use $5 out of my own pocket. I understand that it's not Halara's fault that my first package was lost in the mail. But the second package took approx 3 weeks to be received.", "rating": 3}, {"title": "I have purchased medium petites before…", "text": "I have purchased medium petites before and they were a perfect fit. This time I had to take up a 1 inch hem. Please get this length right Halara! I did not shrink. ", "rating": 3}, {"title": "The trousers are very comfy but they…", "text": "The trousers are very comfy but they aren’t great quality. ", "rating": 3}, {"title": "Only ok", "text": "Took a long time to arrive. Decent fabric and definitely stretchy, but the seams are in weird places and there’s an extra horizontal seam above the knee which isn’t stretchy and cinches your leg when kneeling. It’s easily snapped if yanked on though. There are pockets but they’re not big enough to comfortably hold a phone without it falling out. I have similar trousers/leggings from other brands that have solved this and also don’t have the weird seams. Overall these are wearable but I won’t buy another pair", "rating": 3}, {"title": "Super Comfortable.", "text": "Athletic material is great and super comfortable.  However, the sizing doesn't line up with American sizes.  I am an 8-10 normally with any pants or dresses.  I am so glad I decided to size up to a 12-14.  Fits nice.  Just runs quite small.  ", "rating": 3}, {"title": "Absolutely adorable and ver comfy", "text": "Absolutely adorable and ver comfy, but they snag very easily. Not quite strong enough for bracelets. ", "rating": 3}, {"title": "Just didn’t fit my waist. ", "text": "The pants are a nice material and I loved the fit , except the waist , which was way too small. Now I know I’m not the only one with an after-menopause-body. Please make some beautiful pants for gals like me, too! Also, the garment took quite a while to be delivered. ", "rating": 3}, {"title": "They stretch out way too much", "text": "They stretch out way too much ", "rating": 3}, {"title": "Fragile lace!", "text": "They are nice looking but the lace is very fragile! Despite being extremely careful not to pull on the lace, the edges are too easy to snag or accidentally tug when putting them on. The fabric resembles spandex but isn't *too* noticeable when dressing them up (I got the black pair). I've had many lace detail leggings, and I believe the overall material may be more to blame than the actual lace (where the lace connects on the edges is the weakest spot/This may also be an off pair! Based on other reviews, others don't seem to have this issue, so I may have just received a pair that's a bit more flimsy where the lace connects). Overall, not an issue; it was a fair price for even a few uses! The top of the leggings is very flattering but also easily rolls. I’d recommend based on the overall look despite the expected short-term use of the pair I received)", "rating": 3}, {"title": "The designs are pretty", "text": "The designs are pretty, but the sizing is perhaps a bit off. I'm 5 ft 3 inches, and the bottoms ride up my ankles as I'm working out. They're just long enough to start and then get shorter. What I call \"scrunchy butt\" is cute and all, but it is not pleasant when working out. It's REALLY tight and up there. I think I'll wear them for lounging around the house, but that's not why I bought them.", "rating": 3}, {"title": "Half and half", "text": "Jeans perfect, skirt small and lacking pockets.", "rating": 3}, {"title": "lack of communication on shipping", "text": "One of the items I ordered was on back order. I knew it would take a while to get it. However, I did not know that all of my items would not be shipped until that item was available. When I got my order confirmation email I was told that it would be several weeks before any of my items shipped. I just wish I had known before. ", "rating": 3}, {"title": "Disappointed ", "text": "The trousers weren't as good as a quality that I would have liked. I also ordered the tall ones and they were not as long as other brands of a similar price range. I'm really disappointed, I had hoped that all the good reviews had been genuine. I was really looking forward to them arriving. ", "rating": 3}, {"title": "Shipping", "text": "Shipping was extremely slow", "rating": 3}, {"title": "Not happy with the size of the jeans", "text": "Not happy with the size of the jeans. They were a bit big and baggy on me even thoughI ordered my right size of 10. Also they took about 4 weeks to be delivered to me. Thought this was unnecessary!", "rating": 3}, {"title": "Long delivery dates and average quality", "text": "Long delivery dates. Quality is only ok. It is not denim. It looks like it for the colour and all but the texture is light and very elastic, which can be the advantage of the product. The fitting is pleasant and comfortable. ", "rating": 3}, {"title": "Products are hit or miss", "text": "Product are hit or miss. Love one pants on the quality. Dislike another cause it feels cheap.", "rating": 3}, {"title": "Shipping took a long time and pants I…", "text": "Shipping took a long time and pants I ordered do not fit.", "rating": 3}, {"title": "Too wide", "text": "Pant legs are a little too wide for me", "rating": 3}, {"title": "Style was cute but…", "text": "Style was cute. I do not like the material. It’s too thin and not comfortable. ", "rating": 3}, {"title": "The jeans fit perfectly in waist and…", "text": "The jeans fit perfectly in waist and length. Got petite size 8/10. Only complaint is the jeans are very baggy in thigh area and not really what I would call straight leg.", "rating": 3}, {"title": "Felt Cheap", "text": "Material used in this pair of overalls seemed cheap. Fits small compared to other items I’ve purchased.", "rating": 3}, {"title": "The quality is not great", "text": "The quality is not great. It’s very thin and runs small so it is tight on and I ordered a size up and it is still tight. The look of it is nice though . ", "rating": 3}, {"title": "I love the jeans!!", "text": "I love the jeans!!! But there was such a heavy odor of mothballs I had to wash them right away before I could wear them. I will be buying more though because the fit is great. ", "rating": 3}, {"title": "Sizing is definitely off.", "text": "Date of experience: October 15, 2024", "rating": 3}, {"title": "Shipping takes too long.", "text": "Shipping takes too long. ", "rating": 3}, {"title": "Quality is not as good as described", "text": "Quality is not as good as described. Even sale prices are quite high . ", "rating": 3}, {"title": "The pants are see through", "text": "The pants are see through ", "rating": 3}, {"title": "The pleats make me look pregnant.", "text": "The pleats make me look pregnant. ", "rating": 3}, {"title": "I like the clothes i have tried thus…", "text": "I like the clothes i have tried thus far (still 2 items to try). They are soft, mostly true to fit- the bra is a little tight and i am disappointed that it has those removable cup pads- even on first wear of the bra the pads were moving around. Paper tags are very itchy and annoying even after being cut out there is still bothersome stitching- tagless would be ideal.  Clothes are flattering overall everything just took awhile to receive so don’t be in a hurry if you need something! ", "rating": 3}, {"title": "The length in a petite medium was too long…I the three pair of pants…", "text": "I received the the three pair of pants from Halara. The fabric were wonderful! My disappointment lay within the length of the pants. I ordered a petite medium size. Halara says their petite inseam is 27”. I was very excited about this because my inseam is 28”. However, when I tried on the pants they dragged on the floor. I will have to have them hemmed before I can wear them!   ☹️☹️☹️", "rating": 3}, {"title": "Returns not easy ", "text": "I do like most of the items I have ordered but not happy about the return policy. Don’t like the fact that I had to pay to return my items. ", "rating": 3}, {"title": "Customer service isn’t very good ", "text": "One pair of jeans and one pair of yoga pants did not fit me and I have emailed you about returning them, but I haven’t received a response. I need to know how to return the items that did not fit! I would appreciate a response as soon as possible!Stephanie DeWeese", "rating": 3}, {"title": "Change in sizing!", "text": "I actually love Halara products, and the skirts I purchased are very good quality. HOWEVER, the sizing has changed and I wasn't notified until after I placed the order. When I finally got the skirts, they are just too small enough to be uncomfortable. Returning the skirts takes too long and costs too much, and I fear the next size up is too big, and-again-would take too long to get. They were perfect before, but now I'm disappointed ", "rating": 3}, {"title": "The pants are amazing delivery not so much ", "text": "The pants are amazing. I absolutely love them and would like to order more. Delivery was long and a bit confusing for me. After waiting for a few weeks, I was told my pants had been delivered. They were not actually delivered until the next day and were put into my mailbox.", "rating": 3}, {"title": "Fabric of the jeans smells really dirty…", "text": "Fabric of the jeans smells really dirty and looks cheap. Jeans is to short.Delivery takes long, return is difficult.Previous purcheses I was sattified. The trouser with the pockets in front are amazing.", "rating": 3}, {"title": "The material felt great But I have…", "text": "The material felt great But I have varicose veins & when I tried the pants on you can totally see the outline of my veins. Very unflattering & also can see my dimples on my butt. 😮‍💨 I'm sorry I just want to send my stuff back & it's not the easiest to do like other companies. I just want to know where I can ship this to & get my money back PLEASE ", "rating": 3}, {"title": "They were responsive", "text": "They were responsive. I returned everything. The material was not what I expected. ", "rating": 3}, {"title": "Size fit", "text": "I really like the quality of the pants I got. The update process is weak. Hard to figure out how to return an item . ", "rating": 3}, {"title": "Was not happy with paying for one item instead of getting two my loss but won’t be doing that again ", "text": "Was not stay with ", "rating": 3}, {"title": "Although purchasing the product was…", "text": "Although purchasing the product was fine, there was no way to track the order or contact any customer support services. When trying to track my order I was only given the option to track by downloading the app. After doing that there was nowhere in the app to actually track the order, and no way to contact anyone for assistance. Until the order arrived after a month of waiting, I believed I had been scammed. Not a great way to do business. As beautiful as the selection of products, due to this experience I will never shop this company again. ", "rating": 3}, {"title": "Long wait time", "text": "Long wait time, was not aware the items I purchased would have a long wait and difficult to see shipping progress. ", "rating": 3}, {"title": "Be careful with the sizing", "text": "Be careful with the sizing. Small is quite short. ", "rating": 3}, {"title": "They just were not for me. ", "text": "I wish your leggings worked out for me. I've tried the first two pairs I picked out and wasn't happy with the sizing or the material. Your company gladly replaced them with a few more picks and we'll, it's not you. It must be me. I'm so sorry. Maybe poor body image on my part. IDK.", "rating": 3}, {"title": "I don't regret it,  but....", "text": "I love my coveralls.Super comfortable but I just wish you guys had a tall section 😔 they're a little shorter then I imagined ", "rating": 3}, {"title": "Disappointed again!!", "text": "I got the money as a credit,  bought what I thought was going to be a good quality jean skirt.....not the case.    I had to wash it 4 times to get the musty smell out and the material is so thin and cheap for the cost ot was.    Disappointed again so probably my last order from Halara. ", "rating": 3}, {"title": "shipping took over 3 weeks ", "text": "shipping took over 3 weeks .  Returns are very difficult and confusing.", "rating": 3}, {"title": "I think the marketing dept does a great…", "text": "I think the marketing dept does a great job. The pants are lovely, the colors are perfect..I am not sure of the sizing but I ordered the size 8/10 but it wasn’t to be.. they fit  my cousin who is a size 6 so I gave them to her. She is happy, I am without! :( ", "rating": 3}, {"title": "I’m not sure what happened", "text": "I’m not sure what happened, but I’ve ordered two dresses & a skirt from Halara & was very pleased. I just ordered two leggings & a set of cuffed pants. The first pair of leggings have already gotten several snags & I haven’t tried the others, but the cuffed pants material is rather cheap feeling. I’m disappointed in this order. ", "rating": 3}, {"title": "Not true to size runs big", "text": "Not true to size runs big ", "rating": 3}, {"title": "The bib on the overall is to fitted…", "text": "The bib on the overall is to fitted should be a bit bigger for girls that have bigger chested and smaller frame, also it took almost a month for delivery it said 7 to 10 days", "rating": 3}, {"title": "I ordered four pairs of different …", "text": "I ordered four pairs of different  leggings 2 pairs are ok two pairs are very thin material and not so good", "rating": 3}, {"title": "Not many options for plus size and the…", "text": "Not many options for plus size and the ones Halara does have are not included in any of the sales. This was a second purchase, the first purchase one of 3 styles was perfect. I reordered 3 more of the same style, 2 in the same color. None of them fit the same, felt the same or looked the same. Not worth ordering again, but their website and customer service are good.", "rating": 3}, {"title": "Beautiful but quality isn't the best!", "text": "My first impression of these pants were WOW! So smooth and silky. I love the color and even the style. But the quality is lacking. After 2 wears and 1 wash the seams are coming undone. And loose strings all over. I even hung them to dry. If the quality was a little better I'd definitely give 10 stars! Love the color, first feel and style. But definitely quality is not there.", "rating": 3}, {"title": "The return for this company is just …", "text": "The return for this company is just  ,to complicated and costly, the jeans I wanted to return I just took to a consignment shop:(", "rating": 3}, {"title": "I did not like the quality or fit of…", "text": "I did not like the quality or fit of the High Waisted Plicated Side Pocket Wide Leg Flowy Solid Palazzo Casual Linen-Feel Pants - both the blue and black were both small in the waist and the material is very cheap.", "rating": 3}, {"title": "I like the business pants", "text": "I like the business pants. The joggers I don’t think are for me. One leg falls like pants and the other leg looks like the seams weren’t sewn correctly and it twists it’s up my leg as I move. I’m still going to wear them at home but I don’t think I’ll be purchasing from Halara again. ", "rating": 3}, {"title": "I like the softness but they were not…", "text": "I like the softness but they were not as starchy on the waist and too long also they were more like high rise than mid rise ", "rating": 3}, {"title": "Shipping took over a month", "text": "Shipping took over a month. It never said when I bought it that returns weren't an option. The pants aren't very high waisted and they are almost high waters. I'm 5'9\" with large thighs and butt. They're okay, just not what I expected or what was advertised. The shirt has big gaps on the sides by the armpits that will show your bra, and it's not very flattering. I need to just stop buying halara. The people they choose to advertise must be 5'2\" or something, I never get wjat I'm expecting from here, I just waste money and end up disappointed", "rating": 3}, {"title": "Bad scratchy material", "text": "The fitting of the dress was good... but the material is not the best. The whole ad about this particular brand was about the material being comfortable but I found the material being scratchy and itchy. Not a very good quality material if you ask me.", "rating": 3}, {"title": "The pants fit great by the material…", "text": "The pants fit great by the material it’s not that good. ", "rating": 3}, {"title": "The sizing is off", "text": "The sizing is off. The pants are way too big.  ", "rating": 3}, {"title": "Sizes didn't work for me", "text": "Sizes didn't work for me, and I had to pay $20 to return things. I liked something I got in the past but I still had to get it hemmed. I probably won't use halara again. ", "rating": 3}, {"title": "The quality low, return difficult and expensive", "text": "The quality is lower than how it looks. They ship them from China so the return is expensive and complicated.", "rating": 3}, {"title": "Good quality products BUT the sizes are…", "text": "Good quality products BUT the sizes are just odd depending on what kind of style: some are smaller and some are larger. ", "rating": 3}, {"title": "I love the quality of the pieces I…", "text": "I love the quality of the pieces I ordered. But the delivery took forever.", "rating": 3}, {"title": "The clothes are fantastic", "text": "The clothes are fantastic! I just didn't like waiting 14 days to receive it ", "rating": 3}, {"title": "The pants are not super stretchy as…", "text": "The pants are not super stretchy as advertised. I would have sized up had I of known. Also the shirt is short. ", "rating": 3}, {"title": "Design is good but…", "text": "Design is good but sizing is not consistent.  Some items have a weird mothball smell that does not go away after washing.", "rating": 3}, {"title": "After my first order through Halara", "text": "After my first order through Halara, answered a review and advised them that after washing the clothes 5 times, I still couldn’t get the unbelievable foul smell out of the clothes. Halara kindly offered me a gift equating to the same amount as my original purchase, to spend at Halara. So I picked out some items and received them quickly, but it was the same, one pair of pants are still hanging outside and it’s been two weeks and they still smell foul! I will never order from Halara again, I’m sooo turned off! But I appreciate the gift.", "rating": 3}, {"title": "Too big ", "text": "Usually the leggings run smaller so I purchase the large. So, I did the same with these and they are big. I should have ordered medium. Sad 😔 because I like the style", "rating": 3}, {"title": "Too wide on the bottom I should of…", "text": "Too wide on the bottom I should of ordered a straight leg ", "rating": 3}, {"title": "How can I return get bigger size", "text": "Date of experience: October 12, 2024", "rating": 3}, {"title": "My pants are good quality but too big I…", "text": "My pants are good quality but too big I needed a 1xl only your sizing is not good. I went by what I ordered before and now I have an expensive pair of pants I can’t wear 🥹", "rating": 3}, {"title": "I would have given a 5 star rating but…", "text": "I would have given a 5 star rating but I bought 2 pair of the pants for my daughter and the first day she wore the gray ones the button fell off.", "rating": 3}, {"title": "Jeans fab, trousers not!", "text": "I’ve ordered a few items now from Halara and the delivery is very long but the jeans are a lovely material and a fairly accurate size. Two pairs of trousers not so good. The work trousers have great stretch but feel like cheap nylon. Customer service were pretty good though", "rating": 3}, {"title": "I liked the fabric quality", "text": "I liked the fabric quality, good, soft and firm. I didn't like that they don't have a seam in front though.", "rating": 3}, {"title": "Impossible to return items", "text": "Date of experience: October 14, 2024", "rating": 3}, {"title": "The items I ordered were not sized…", "text": "The items I ordered were not sized correctly.  I ordered by your provided size chart and the items were HUGE - way too big!  ", "rating": 3}, {"title": "Love the products", "text": "Love the products. I don’t like that the delivery takes so long", "rating": 3}, {"title": "I bought the wide leg magic jeans", "text": "I bought the wide leg magic jeans. Although it says \"petite\" the inner leg is still too long. Maybe offer a cropped version for people around 4.11 - 5Feet...we do exist!! They are definitely very comfortable. I was disappointed at how long it took to get them. They sent me a £20 voucher which when I clicked on said it was no longer valid. ", "rating": 3}, {"title": "Missing Buttons on Pants", "text": "I love the pants that I ordered, however I was missing a button on one of the pants I ordered, and one fell off when I put them on.  ", "rating": 3}, {"title": "Nice products but feel like wearing swimming clothes", "text": "I really like the products, but I really (really) wish you would work more with natural fibers, instead of with artificial ones. Most of the products I loved but decided to give them back because they feel like wearing a plastic swimming piece. Natural fibers better and they are also better for our planet :)", "rating": 3}, {"title": "Trousers a bit short and tight I was…", "text": "Trousers a bit short and tight I was hoping they would be more comfortable ", "rating": 3}, {"title": "Loved my order", "text": "Loved my order! Little disappointed I didn’t receive my Scrunchies:(I’ll definitely be ordering more items!!!", "rating": 3}, {"title": "I enjoy the fit of the dress but it did…", "text": "I enjoy the fit of the dress but it did have a terrible smell when it came. ", "rating": 3}, {"title": "The materials used for the pants was…", "text": "The materials used for the pants was very poor, thought they would have been thicker so as to be useful in winter👎 but very thin!!", "rating": 3}, {"title": "I only liked and kept 2 of the 5 items. And I discovered in the process that the returns are a hassle. Waiting for return authorization?? Had to send pictures of the items with the request", "text": "I only liked and kept 2 of the ", "rating": 3}, {"title": "My return experience is not the best", "text": "My return experience is not the easiest. I do not want to send a picture and jump through hoops to make a return. ", "rating": 3}, {"title": "One of the pair of pants that I bought…", "text": "One of the pair of pants that I bought is way too small. I’ve made a previous purchase at the same size and the fit was great. Not worth the cost of shipping to return, so I guess I’ll give them away.  ", "rating": 3}, {"title": "Quality is not consistent", "text": "Quality is not consistent. Some suff has been amazing and some stuff is not", "rating": 3}, {"title": "Took longer than expected", "text": "Took longer than expected. The pants fit, except they are about 4 inches too long. So will have to pay to have them hemmed or send them back.", "rating": 3}, {"title": "Products are nice", "text": "Products are nice, but you need to offer the tea and all items not just some and you need to cover the cost of Products are nice, but you need to offer the tea and all items not just some and you need to cover the cost of returns. ", "rating": 3}, {"title": "The return process is too cumbersome", "text": "The return process is too cumbersome, requiring three separate emails. The quality of the product seemed very good and the fit was good, however, the style did not look good on me. I may order some straight leg jeans in future.", "rating": 3}, {"title": "Overall ok", "text": "For the amount spent, I expected the fast shipping.  I did not realize I had a preorder item. That should be made clear beforehand.  Also, the shorts ran a little small", "rating": 3}, {"title": "Need to allow free returns", "text": "I purchased two pair of pants- even though they're supposed to be petite sized, they're still a bit too long. One pair of pants was too tight and since you do not allow free returns I opted for a gift card. Now i have to figure out if you have a pair that will actually fit me well. If the size isn't correct or it doesn't feel right then Im stuck with another pair that I can't wear. The inability to return the product for free is problematic. ", "rating": 3}, {"title": "Loved most of my items", "text": "Loved most of my items, good quality, just the time it took for shipping was long. Some items were too small.", "rating": 3}, {"title": "Size came in too small", "text": "Size came in too small. I gave it to my daughter. She said it was comfortable. ", "rating": 3}, {"title": "Return process is difficult", "text": "Size of the leggings was correct, but the jeans were way too big and I ordered the same size.  The return process is cumbersome, why in the world do I need to send a picture of the jeans? I will likely not order again due to this.", "rating": 3}, {"title": "The buttons come off the stitching near…", "text": "The buttons come off the stitching near the crotch on 3pairs are all unstitched, the durability it isn’t the best and please not everyone wants cropped tops , just a long sleeve running top to actually match the colour of the leggings would be so good, your offering all these styles but no basic long sleeve to match it all in only very basic selective colours ", "rating": 3}, {"title": "Great quality fabric ", "text": "Great quality fabric , but petite are still long, I’m 5 foot and needed to cut and hem them to fit. ", "rating": 3}, {"title": "Extremely slow delivery", "text": "Extremely slow delivery - however the product is amazing ! ", "rating": 3}, {"title": "Red Flags?", "text": "I'm surprised there aren’t more mixed or negative reviews for Halara, as I've encountered some unusual issues with their return process. The return policy seems quite unclear, and based on what I've found on Reddit, many customers have had to go through a lot of effort just to get a return address.Regarding the product quality, the material feels quite thin, and one pair of jeans I received had a strong chemical odor that I haven’t been able to remove, even after washing them twice.I reached out to return a few items that didn’t fit or flatter me. Initially, they offered me store credit if I kept the items, but I declined since I wasn’t interested in keeping them. In the end, they gave me a refund and told me I could keep the items, which was unexpected but appreciated.While it worked out in my case, the whole process felt odd, and it seems like many others have had similar experiences. Overall, I feel there are some transparency issues with the company that raise a few concerns. With ONLY positive reviews here it's very odd with everything else I've seen about them online. ", "rating": 3}, {"title": "Product is just ok", "text": "Quick shipping, but the pants are definitely not worth all the social media hype! They are just ok. Not great. I'll keep them, but I cannot recommend and I won't be purchasing any more. Lesson learned.They do fit true to size though. ", "rating": 3}, {"title": "Great if you know what suits you", "text": "So the initial purchase went very well. When I needed to exchange some of the items, (I added some new ones), I was told I needed to resend the items and they’d return part of the amount, AND I needed to pay for shipping. I’m kind of disappointed- best wouldve been to allow a trade in.", "rating": 3}, {"title": "Shipping Glitch in how they write their addresses, may cause delay", "text": "The way your website is designed it puts the apt number in front of the address and so my delivery was sent back as undeliverable due to the address being incorrectly assigned. I had to wait an additional three days for my package to arrive.", "rating": 3}, {"title": "Love 3 of of the 5 items I ordered but bad return process", "text": "Love 3 of of the 5 items I ordered. The sizing is not consistent so that's an issue. The but the 3 stars are for the round about return process. I am really annoyed with the return process. For pants that run small!!! Not sure if I will shop with Halara again in the future. There are lots of online options and these kind of things make or break it for me with online shopping. ", "rating": 3}, {"title": "Sizing is off ", "text": "Ordered 5 pairs of pants- im a 30” waist and ordered mediums in everythingOnly 3 of the pairs were comfortable and not giving me a gut ", "rating": 3}, {"title": "The return policy is a bit skewed", "text": "The return policy is a bit skewed.  Although I appreciate getting a refund in the form of a credit and not return the product.  The only other alternative was to pay to return on my own expense.  Given this process I will purchase less than otherwise.Products feel great otherwise", "rating": 3}, {"title": "Nice but not what I thought. ", "text": "The advert I bought from on Facebook was not specific enough about the inside leg measurements, tall, medium and short doesn’t mean anything. Also there were no descriptions close enough to what I actually wanted. The trousers are nice but not as I expected. I’m hoping that the app is better and more accurate. ", "rating": 3}, {"title": "Very disappointed that discount for…", "text": "Very disappointed that discount for first purchase was not applied.  Restrictions to use of discount code were not easily noted. No comment on product yet as they were just ordered. ", "rating": 3}, {"title": "It took forever to get my credit back…", "text": "It took forever to get my credit back but hopefully it wont happen again.", "rating": 3}, {"title": "It wouldn't let me update the shipping…", "text": "It wouldn't let me update the shipping address anywhere.  Otherwise fine", "rating": 3}, {"title": "The process was cumbersome and it took…", "text": "The process was cumbersome and it took some time to be able to navigate. A lot of scrolling to locate information. Not as user friendly as I had hoped. This is my first order so I am not familiar with your site. I will be happy to update the review when I receive the product. ", "rating": 3}, {"title": "My orders seem to take about 4 week to…", "text": "My orders seem to take about 4 week to arrive so if you order make sure you don’t want to wear them for anything special ", "rating": 3}, {"title": "first time purchasing 5 items", "text": "Good to offer refund policy. the 5 clothes were delivered from Hong Kong to Hong Kong address. it will be even better if the 2 refund items could be returned to a Hong Kong or closer address. Anyway, good & lucky that the items arrive US address fast & safe. The blue skirt material is not ironing-free, many \"wrinkles\". ", "rating": 3}, {"title": "Quality feels cheap and all the pockets…", "text": "Quality feels cheap and all the pockets are really small. They don’t even fit a regular size phone, it will fall out easily.", "rating": 3}, {"title": "Did not gelied about free fiftt my free gift....", "text": "Did not get my free gift....", "rating": 3}, {"title": "The shopping was good on website", "text": "The shopping was good on website. Easy to use", "rating": 3}, {"title": "I love my purchases", "text": "I love my purchases, but my last order I was a little disappointed because you sent me the wrong size. I ordered a 2x and you sent me an XL. What can you do about this ", "rating": 3}, {"title": "Unhappy with return ", "text": "I love the material. I reached out due to them coming with no packaging information. They are too small when I tried to put the information in to return them to order a larger size they said I have to have the order # and can’t find it anywhere. I feel like some information should be in the package.", "rating": 3}, {"title": "I ordered the tall size", "text": "I ordered the tall size, and received them. They definitely were not meant for tall women. Then when I went to refund them, I realized it was a final sale.", "rating": 3}, {"title": "Took forever to receive these jeans", "text": "Took forever to receive these jeans. They’re ok. Comfy, look more or less like the videos you see on Facebook- somehow not quite as good. I’ll wear them - but don’t think they will be my “go-to’s”. Would not have paid this much if I had tried them in store. They are thinner than I hoped and the wash isn’t as nice as I was expecting. ", "rating": 3}, {"title": "Shipping takes a long time to canada.", "text": "Date of experience: October 12, 2024", "rating": 3}, {"title": "Not worth the money. ", "text": "The material was much thinner than I expected. I felt the price was too high given how light the material was. The material is stretchy which is nice. ", "rating": 3}, {"title": "Won't purchase again", "text": "The sizes seem a bit random.  One item in large fits well and another is too big.  The stiching on the yoga pants is off center making the back side look lapsieded. ", "rating": 3}, {"title": "Long time for delivery", "text": "Long time for delivery. Product is good.  ", "rating": 3}, {"title": "The sizes are run very small so if…", "text": "The sizes are run very small so if ordering one should probably order up a size. ", "rating": 3}, {"title": "not impressed", "text": "the returns page is glitchy and will not let me confirm and submit my return. the pants i ordered, even though they were petite, were the saggiest crotch jeans I jave ever tried on.", "rating": 3}, {"title": "The sizing is tricky if you’re in…", "text": "The sizing is tricky if you’re in between sizing brackets, I have learned for any future orders but I now have an item that’s too big. Also delivery takes a long time, almost 2 weeks in my case so order ahead to avoid disappointment. ", "rating": 3}, {"title": "I ordered pants in a petite and they…", "text": "I ordered pants in a petite and they are very long. ", "rating": 3}, {"title": "Your returns process is appalling", "text": "The returns process is appalling.It is unecessarily difficult to make you take a gift card/credit note", "rating": 3}, {"title": "I ordered a different color", "text": "I ordered a different color! The pants a very long. Quality of material is good.", "rating": 3}, {"title": "The sizing seems really inconsistent", "text": "The sizing seems really inconsistent. I have bought large jean leggings from you before and they fit perfectly but the last 2 orders i placed in the same size the pants are supposed to be form fitting and akwardly hang off me. I can't wear them which is upsetting because i love your products. ", "rating": 3}, {"title": "Flex denim is not consistent. ", "text": "The sizing and quality of the flex denim is not consistent. I have 5 pair, and only 2 fit comfortably 🙁", "rating": 3}, {"title": "Bad quality, great customer service ", "text": "The quality of the clothes is not great. The linen pants are see through and long. Other material was very stiff and uncomfortable. On a positive note, customer service was great to resolve these issues. You can either return the clothes or get a gift card to purchase new items. ", "rating": 3}, {"title": "it takes awhile to receive order.", "text": "it takes awhile to receive order.  ", "rating": 3}, {"title": "The trousers weren't as expected", "text": "The trousers weren't as expected. They don't enhance my body features as desired.", "rating": 3}, {"title": "They don’t flatter my shape", "text": "They don’t flatter my shapeGreat quality though just not for me. ", "rating": 3}, {"title": "Too big size", "text": "Too big size. Uskallusta L size is good for me but now too big. Love the quality tho", "rating": 3}, {"title": "I tried to return a pair of pants", "text": "I tried to return a pair of pants! Love their clothes, but returning a pair that I didn’t order internationally. Already had a pair🤷‍♀️They would not take back. Want me to use gift card. Took forever to get any response.Cheryl Coltharp PLEASE help me return duplicate item!!Thank you", "rating": 3}, {"title": "Stinky material, two orders in a row ", "text": "In my order, before this past order, I received a pair of jeans that smelled really bad. I washed them multiple times with different detergents. I couldn’t return them because I washed them too many times and I threw them in the garbage. I complained on a Halara post on social media, and after which I received a coupon for the same amount as the jeans cost. I was super grateful because I am a long time customer. I used the coupon that week on a new order. I couldn’t get the same jeans I had ordered last time but ordered others. Multiple pairs of different jeans and a new top. 2 of the 3 jeans I ordered this time had the same gross smell. Again, I have washed them and the smell will not go away. The 3rd pair are fine. And every other pair of dress pants I recently ordered are fine. Or any other type of pants I bought in the past from Halara were fine. The new top that came with the smelly jeans order did not smell. Such a mystery. But I won’t be wasting money ordering pants from them again. Two orders in a row is enough for me. Especially when they cost $70 each. ", "rating": 3}, {"title": "All the pants fit differently even…", "text": "All the pants fit differently even though they were the same size and style.", "rating": 3}, {"title": "Disappointed", "text": "I ordered two pairs and one had a hole in the seat of the pants. Thankfully, my daughter noticed and I was saved from embarrassment. The whole was in a portion of the seam that was not sewn together. Big disappointment. ", "rating": 3}, {"title": "Sizing varies between styles of pants", "text": "Sizing varies between styles of pants. It’s unfortunate that you can’t return from canada or exchange without paying for postage.", "rating": 3}, {"title": "Shipment took forever to receive", "text": "Shipment took forever to receive. The tunics look cheaply made. Why on earth would the seams be down inside out? It looks tacky. ", "rating": 3}, {"title": "Shipping", "text": "The only negative I can say is shipping is to long ", "rating": 3}, {"title": "I love the pants", "text": "I love the pants. Shipping took a very long time.", "rating": 3}, {"title": "The shipping took FOREVER!", "text": "The shipping took FOREVER!! And the tracking was not updated so it was a constant guessing game as to when the shipment would come. The pants are amazing! I think I could’ve sized down if I wanted them to fit more like leggings. They are definitely NOT for us tall girls. Their version of “tall” would be an average sized person in my opinion. I am leggy but I don’t think “tall” accurately describes these. I would buy from them again.", "rating": 3}, {"title": "My last experience, was slightly conflicting, so not what I was expecting, more clarity when it comes to ordering, more of a user friendly website ", "text": "More of a user friendly website ", "rating": 3}, {"title": "Overall fine", "text": "Overall fine, however I’m disappointed I need to pay for return shipping/exchanges are not allowed. I did know this prior to ordering, but it’s still disappointing", "rating": 3}, {"title": "Leggings amazing", "text": "Leggings amazing. Trousers lovely but unfortunately the button came off immediately. Such a shame as everything else about them is great. The fit, the material ", "rating": 3}, {"title": "Great looking pant but...", "text": "Great looking pant. Very comfortable. Fast shipping. However the formaldehyde was so strong I couldn't breathe. I had to wash in baking soda and vinegar multiple times, and hang to dry in the sun. Still a faint smell. Awful. ", "rating": 3}, {"title": "Not a fan of the rolling ", "text": "The leggings are great when I’m standing but as soon as I sit down they roll and once they roll there is no delicate way to pull them back up to the right spot when I stand up. ", "rating": 3}, {"title": "I like the colors and the cut", "text": "I like the colors and the cut. But the material started to get pilly after one day. I sat on my couch and the butt area started to get pilly", "rating": 3}, {"title": "I was really excited to order ", "text": "I was really excited to order some pants, however they didn’t fit the way I anticipated. The leg portion are really wide below the knees. The waist fit well and was comfortable. The order took a long time to arrive. I will need to return the items. ", "rating": 3}, {"title": "I love the jeans, but…", "text": "I love the jeans, but the shipping took almost a month. I would buy again, but I wouldn’t shop regularly because of the shipping. ", "rating": 3}, {"title": "Petite is too short", "text": "The small petite fits but I wish I had regular as they’re a bit too short. But that’s what they recommended based on my height and weight. Too expensive to return and buy regular ones unfit. ", "rating": 3}, {"title": "I love ur clothes and they are…", "text": "I love ur clothes and they are comfortable just wish the size thing was better I have a jumper which I got in large should have fit but don't to small and the jeans sane way", "rating": 3}, {"title": "It took a long time to arrive", "text": "It took a long time to arrive. The cut & style is cute. The fabric is very thin & low quality. ", "rating": 3}, {"title": "I had to return part of my purchase and…", "text": "I had to return part of my purchase and do not like the fact that I had to pay for shipping. If I had known ahead of time, i would not have ordered anything.", "rating": 3}, {"title": "Just ok ", "text": "I ordered two pairs of leggings and a sports bra. The leggings are much thinner than I expected them to be but they are not see through. One pair doesn't fit even though they are both large. I won't order again but the pair of leggings that fit me are ok. ", "rating": 3}, {"title": "Extremely slow shipping", "text": "Extremely slow shipping! I would order more if the shipping were faster.", "rating": 3}, {"title": "Colour", "text": "Colour, size, fit", "rating": 3}, {"title": "There were not many options for plus…", "text": "There were not many options for plus size, especially regarding sports bras. The sports bras I received did not have much support and ran small. I liked the overalls the best and will likely order another pair as they are very comfortable and cute on, however mine came with a button missing and because it took a MONTH to get, I did not want to deal with returning it. My only other complaint was that the overalls have a weird seam down the middle that makes the crotch look scrunched up, which bothers me a little bit and the leggings ran very small and were see through in the butt, as it was like shear materials in the buttocks, which was different than the other material, I assume to accentuate the butt, but did not look very attractive on me due to how small they came. ", "rating": 3}, {"title": "Love my product, dreadful postage times ", "text": "Love my product, the stretch wide leg jeans are amazing but I waited 6 weeks but paid for postage that said 8 working days. Excessive length of time to wait. ", "rating": 3}, {"title": "Shipping took FOREVER", "text": "Shipping took FOREVER! Also the size guide is way off! I normally wear an XS but opted to purchase a small as I like by joggers a little looser fitting. They are like leggings. I’m keeping because it took a 10000 years to get them. My amazon joggers are more comfortable and true to size ", "rating": 3}, {"title": "Pants are a little short", "text": "Two of the three pairs of pants are way too short on me (well above my ankles). I’m not super tall (5’8”). The “tall” jeans I ordered were fine. It would be nice if there was a “tall” option for all pants. Given that I’m only minimally above average, there should also be a true tall, for those girls 5’10” and 5’11”", "rating": 3}, {"title": "I feel that the clothing is pretty good…", "text": "I feel that the clothing is pretty good quality but having to pay for returns is very expensive.It would be great if returns were free so that you can order with more confidence that if something does not fit it’s not going to cost like having purchased another item.", "rating": 3}, {"title": "I don't like being negative ... and although I love the product ...", "text": "It takes so long to get the merchandise. I love the product, but 2 weeks is just too long. ", "rating": 3}, {"title": "long shipping and cheap fabric", "text": "shipping took FOREVERRRRR i thought the wait was on production time but they shipped it immediately after i ordered and then the shipping process was 2 weeks. ALSO the fabric says 100% polyester and wow it feels like 100% plastic. its a shame because it's a cute skirt (size small and im 5'5 120 lbs and it fit perfectly) but it feels sooooo plastic-y and cheap. they have other clothes thay feel better so im not sure why they missed the mark on this one.", "rating": 3}, {"title": "So I had no idea how long this parcel…", "text": "So I had no idea how long this parcel would take but it took a long time! I didn’t receive many tracking updates.The skirt I received was far too small for a size 16 uk and far too short. I kept the flared denim leggings. They are a good fit. Very flared mind. ", "rating": 3}, {"title": "I love the product", "text": "I love the product, but shipping time very slow.", "rating": 3}, {"title": "I’m trying to return 1 of 2 items I…", "text": "I’m trying to return 1 of 2 items I ordered. It shouldn’t be so difficult.", "rating": 3}, {"title": "Damaged item ", "text": "My leggings had a 2 inch tear in the inner thigh. When opening the package it was not visible but when i put it on that’s when i noticed the tear. It was a nice fit but, if only😢.  The other items were nice. I need to inspect my pants now", "rating": 3}, {"title": "Shipping too slow!", "text": "Shipping too slow!  ", "rating": 3}, {"title": "Took forever to receive the order an already holy.  But I like the style. ", "text": "Took forever to receive the order 1 1/2 months. I actually thought it wasn’t going to arrive. The items are gorgeous and the fabric is awesome, but not holding up as well as I hoped. The shirt already has a hole, as does the long dress. Both the pants a the skater dress are holding up better. ", "rating": 3}, {"title": "Clothes were decent but could be…", "text": "Clothes were decent but could be thicker quality ", "rating": 3}, {"title": "Super soft leggings", "text": "The Halara flex Crossover side pocket leggings fit really well and are really soft and true to size comfortable.   I was hoping that the color Washed Denim Bleached Blue would be closer to the picture kinda a nice medium colored faded.  Instead it was a dark medium very solid color.  The same with the other blue option this one was Unitary Blue Denim and the color was a darker brighter Blue.  There were no other faded medium options.  It's super hard to pick colors online and have them look the same in person  when you receive them.  All that said the leggings quality is great.  ", "rating": 3}, {"title": "Wrong item for percentage off.  Tricky. ", "text": "I hope I like the pants I ordered. But I think it very offputting to say if you give certain information you will get a percentage off. Then when you order it oops no percentage off for this item. It doesn’t leave a desire to continue shopping this site. ", "rating": 3}, {"title": "The pants material was gauzy as opposed…", "text": "The pants material was gauzy as opposed to a nice finish that could be dresses up if needed. I put in donate bag without wearing. Very disappointed in quality. I have ordered other styles and been pleased. This version very cheap and not wearable.", "rating": 3}, {"title": "Poor delivery timeline. While the material and quality are good…", "text": "While the material and quality are good enough, Halara took a month to get my order to me. They are not outstanding enough for me to reorder from them with that kind of service. ", "rating": 3}, {"title": "I was so hopeful as I was looking for a…", "text": "I was so hopeful as I was looking for a replacement as my go to leggings have been discontinued.The feel of these leggings is beautiful. I got the high wasted ones but found the band really did dig into the waste. I got the tummy control which honestly there was none and anti camel toe didn't work at all. I found after a short while the gusit part between my legs started a gap between my legs having me to pull them up the whole time so I did not get chip rub.Pity these had such potential.I wore them on a normal day, I'm a nurse so mainly walking, no gym work out", "rating": 3}, {"title": "As I love the pants I got ", "text": "As I love the pants I got . I do not like how they fit", "rating": 3}, {"title": "The order was received rather quickly", "text": "The order was received rather quickly. Although, one of the skirts, you cannot tell what is the front or the back. ", "rating": 3}, {"title": "The length of a pants 👖 was long ", "text": "The length of a pants 👖 was long", "rating": 3}, {"title": "I absolutely love the jeans", "text": "I absolutely love the jeans.  They are very comfortable.  The shipping was the problem for me.  It took to long.  ", "rating": 3}, {"title": "Black pants are not true black", "text": "Black pants are not true black, fabric not what I expected", "rating": 3}, {"title": "Just not my cup of tea for ordering online. ", "text": "I just didn't like how the leggings fit me. It's kind of a chore trying to get a refund processed and there is no number to talk to customer service. ", "rating": 3}, {"title": "I bought 2 pants that are too long for…", "text": "I bought 2 pants that are too long for me and you gave me the option to send them back or not send them back and also receive a gift card. I chose the latter and the email that you sent me was in such small print that it is useless to me. I cannot use the gift card. ", "rating": 3}, {"title": "The leggings are thin", "text": "Date of experience: October 08, 2024", "rating": 3}, {"title": "I like the merchandise but it took…", "text": "I like the merchandise but it took forever to get it. That was only my complaint. ", "rating": 3}, {"title": "Missing item, but everything else is okay", "text": "I have reached out multiple times because I'm missing a shirt that I ordered. I keep getting an automated reply and cannot get anyone to answer my question about the shirt that I paid for that was not included in my package. Other than that everything that I did receive fits perfect.", "rating": 3}, {"title": "Probably won't order again", "text": "Overall I like the clothes but I'm not sure I'd be inspired to buy again. The sizing is hard to understand and I found my leggings fit well but my wide leg pants in the same size were tight on top and unflattering. Being hit with the notice AFTER I hit buy that some clothing has logos on it now and some still doesn't so you'll get what you get without an idea of what the logo and placement would look like was an unpleasant experience. Each item should have a small insert product photo of what the logo looks like on the garment. If I'd received work pants with a logo I would have had to return them like so many people who can't wear other company logos to work. There was no way to unselect the \"gift\" which I did not need or want it's just wasteful. ", "rating": 3}, {"title": "Very late delivery", "text": "I love the two jumpsuits that I got. Howe ever, it took almost three weeks to receive the order even though it was supposed to be 8-10 days.  Customer service kept “thanking” me for my patience but didn’t attempt to help.  Having been I. Customer service for years, I find that unacceptable.  I will have to think hard before I order from Halara again.  ", "rating": 3}, {"title": "The items were ok", "text": "The items were correct. Not what I was looking for. The material on all the items was spandex not cotton. Not worth the hassle to return.", "rating": 3}, {"title": "Love my jeans!!’ Just takes too long to…", "text": "Love my jeans!!’ Just takes too long to be delivered!!3-4 weeks! ", "rating": 3}, {"title": "The product is not bad but...", "text": "The product is not bad, but the site was wrong and to return the pants, I have to pay 40$ !!! So return shipping is not pay and you have to pay to ship in USA and not Ontario !! Thats bad..", "rating": 3}, {"title": "I didn’t receive my whole order ", "text": "I didn’t receive my whole order I guess when you get two pairs for the price of one, you have to enter the second pair into your shopping cart when you order it it’s not clear how to do this so I’m sure most people only get one pair. I was very disappointed.", "rating": 3}, {"title": "Cut very slim. Too much. Buy 3 sizes up", "text": "The items in medium were sized extra small. I gave them away. I was disappointed in my selection ", "rating": 3}, {"title": "Disappointed in time it takes to…", "text": "Disappointed in time it takes to receive an order", "rating": 3}, {"title": "Long delivery ", "text": "I have only given 3 stars because the delivery took so long.  Was concerned that the trousers wouldn't actually arrive but they have now.Have only tried them on so far and they feel OK.", "rating": 3}, {"title": "Ehh.. ok", "text": "I am a legging snob. But after reading all the reviews I thought I would try them. For the price I  want to love them but I  don't they are ok.. My bigger issue is how long it takes to get them. Ugh..", "rating": 3}, {"title": "The trousers are okay and a nice fit…", "text": "The trousers are okay and a nice fit but the material is not the quality I had hoped it would be. ", "rating": 3}, {"title": "The pants I loved!", "text": "The pants I loved!! But the little icon tag was on my calf part of the jogger, both had them there, I emailed & was told it was an error on manufacturer part. Looks odd but oh well ", "rating": 3}, {"title": "Shipping & Delivery Times", "text": "Shipping time and delivery times are lengthy.  I wish I received my items quicker. ", "rating": 3}, {"title": "The pants I order went from the length…", "text": "The pants I order went from the length of the pants being long to capris because I had to order a plus size. Not happy about that.", "rating": 3}, {"title": "The pants are not full length, beware! ", "text": "The pants are great, however they don’t specify that they aren’t a full length pant (which is what I wanted). For reference I ordered tall (which is usually at least 34 inches for full length, and the pants I got are 30-31 inch length, so definitely a cropped pant style).  It should say it in the style name of the pants!! And after looking at other pants, all the ones I liked are also like this. Wish they made their pants full length. ", "rating": 3}, {"title": "Disappointed ", "text": "Not sure why all Halara orders take so long. Once I finally got my order I was disappointed. I got the viral work pants in a size medium long. I'm 5'10\" and they are too short. ", "rating": 3}, {"title": "I did purchase the leggings I came on…", "text": "I did purchase the leggings I came on to look for.  However, I would have purchased more pairs if you had in the plus sizes.  Missing out on an entire market.", "rating": 3}, {"title": "The pants are very comfortable", "text": "The pants are very comfortable. However, some have an overly chemical smell and the fibers snag far too easily. ", "rating": 3}, {"title": "unclear size chart", "text": "The product is good overall, but I had problems with the sizes; I have a curvy body with a narrow waist and large hips and by consulting the measurements on the table, I corresponded to more sizes and I took the wrong measurement; the pants are really too large.", "rating": 3}, {"title": "Meh Clothes and Returns", "text": "Clothing quality is decent; sizing is inconsistent so you have to buy multiple sizes of pants and return the ill-fitting ones. Return policy is a major deterrent from shopping again. Not only do we need to pay the return shipping, but we need to take pictures of each piece we are returning. I've never had to do this with any reputable company; the policy is usually send it back with the tags on and as long as it is in new condition, you get a refund. Halara's return policy is amateur. ", "rating": 3}, {"title": "Purchase ok -  Items not that much", "text": "All worked well with the site and the online purchase, sending was also fine. But the items were too big and the material not what I expected", "rating": 3}, {"title": "High waisted pants ", "text": "Not very happy I thought they were sweats unfortunately I dislike corduroy,so into the donation bag they went ", "rating": 3}, {"title": "I need a 10/12 size", "text": "I need a 10/12 size.  So 8/10 are too small and 12/14 are too big.  Unfortunately I’ve worn them or else I would have returned them.  I love the idea of the trousers but unfortunately not for me.  ", "rating": 3}, {"title": "Money back from return", "text": "I have ordered from Halara before. Their quality is okay, but not good. the fabrics are regularly of poor quality. I have also had two occasions where I did not automatically receive my money back after a return. I then emailed them and got the money back. But it's a shame that this happened twice, it damages my trust in halara", "rating": 3}, {"title": "No money back after return", "text": "I have ordered from Halara before. Their quality is okay, but not good. the fabrics are regularly of poor quality. I have also had two occasions where I did not automatically receive my money back after a return. I then emailed them and got the money back. But it's a shame that this happened twice, it damages my trust in halara", "rating": 3}, {"title": "The products are good", "text": "The products are good but I don’t like the return process. ", "rating": 3}, {"title": "Took forever to arrive.", "text": "Took forever to arrive. ", "rating": 3}, {"title": "I am a female who is 5’ 7” and 160 lbs", "text": "I am a female who is 5’ 7” and 160 lbs, the pants feel comfortable but lack in making the stomach look flattering. However, there are many color options to choose from! ", "rating": 3}, {"title": "My order took nearly 4 weeks to arrive", "text": "My order took nearly 4 weeks to arrive, both times. This long delay makes me hesitate to use Halara again.Otherwise the clothes are comfortable.", "rating": 3}, {"title": "Bought quiet a few items no problems…", "text": "Bought quiet a few items no problems with returns but lv not recieved a pair of trousers and there's been a huge mix up consequently lv paid fir goods that have not been received and l can't trace the tracking number.", "rating": 3}, {"title": "Fast fashion, slow shipping ", "text": "Love the product, don't get me wrong. I'm usually really hesitant to use fast fashion sites, but I was assured I'd be happy. I am about the product but understand that pre sale item, means that everything gets held up until the pre sale date, regardless of the shipping time you picked. Even if just 1 item is presale, the whole order gets held up. Pre sale seems like a convoluted way of saying they want to wait on enough orders before fulfilling your order. If thats the case, then say that. Lots of \"oh sorry you just misunderstood what you ordered\" with a side of \"oh well next time just tell us and we will split your shipments up\". No. Ya'll told me 8-10 business days and I had to wait 20 business days. Halara needs to do better in being upfront about shipping times. Don't fine print gaslight me either. ", "rating": 3}, {"title": "Love the products I ordered except one…", "text": "Love the products I ordered except one item that wasn't flattering on me. I have submitted a return and Im still waiting for a response so not happy about that but mostly satisfied, as long as my return is processed. ", "rating": 3}, {"title": "Most of the clothing I have been very…", "text": "Most of the clothing I have been very pleased with. Not so impressed with the occasional return. ", "rating": 3}, {"title": "Shipping took way to long", "text": "Shipping took way to long. I wanted this dress so bad for my Cruise vacation so I ordered it weeks in advance thinking it was enough time, but unfortunately not.", "rating": 3}, {"title": "Picture of products online didn’t…", "text": "Picture of products online didn’t accurately show actual product when I received", "rating": 3}, {"title": "My order took almost 30 days to arrive…", "text": "My order took almost 30 days to arrive from the order date.  The tracking didn't give an estimated day of delivery and not many updates on where my order was.", "rating": 3}, {"title": "Shopping takes way too long!", "text": "Shopping takes way too long! ", "rating": 3}, {"title": "Not as comfortable as some other…", "text": "Not as comfortable as some other leggings that I have. Top has already started to have a thread unravel. Just doesn’t fit right.", "rating": 3}, {"title": "Love the product, disappointed with the sizing ", "text": "When I received the product the one item did not look anything like the product online. The sizing for the other two pairs of pants were also not in alignment with the sizing chart, I will now need to return everything ( pay for the return price). I love the product…so it’s just disappointing is all!", "rating": 3}, {"title": "I ordered the strapless jumper…", "text": "I ordered the strapless jumper. The elastic at the top is so stretched that it does not form fit above the bust. It is looser than the actual material, so even though the top would normally fit, the elastic stretch makes it unwearable. I was really looking forward to wearing this. The rest of the jumper fits great, but because of the stretched out top it can’t be worn. Hoping for a refund. ", "rating": 3}, {"title": "Sizing is way off", "text": "Sizing is way off. Is it for teens.", "rating": 3}, {"title": "Items arrived very wrinkled.", "text": "Items arrived very wrinkled.", "rating": 3}, {"title": "I don’t like the fabric", "text": "I don’t like the fabric.  It’s very hard to tell on the website.  The waist seems disproportionate from the legs of the pants.  ", "rating": 3}, {"title": "I think the customer should be able to…", "text": "I think the customer should be able to ship items back without paying for the shipping.  ", "rating": 3}, {"title": "Sizing is off and the jumpers I bought…", "text": "Sizing is off and the jumpers I bought were paper thin. I could not return because I bought on sale: ", "rating": 3}, {"title": "I love your clothes when they fit but…", "text": "I love your clothes when they fit but your sizes vary a lot. I’ll order the same size pant or shirt and they will fit differently. It’s hit or miss. Hoping to exchange the black pants I just ordered for a smaller size. ", "rating": 3}, {"title": "Transit Delays… ", "text": "The item took ages to arrive… I didn’t appreciate where it was being dispatched from . The jeans fit well and the flexible waistband great the material however is much flimsier than I anticipated …. ", "rating": 3}, {"title": "Leggings are very thin shows every lump…", "text": "Leggings are very thin shows every lump wasn't what I was expecting.", "rating": 3}, {"title": "The jeans were very nice and soft but…", "text": "The jeans were very nice and soft but the length is not accurate. It says petite and by no means we’re they petite. I could never wear them they were exceptionally long to be petite. Therefore, I’m returning them. Otherwise they would have been great", "rating": 3}, {"title": "Items took nearly a month to arrive", "text": "Items took nearly a month to arrive, tracking info was not good and only recieved 1 of the items I ordered as the other sold out by the time the fulfilled my order. ", "rating": 3}, {"title": "The products are great but delivery…", "text": "The products are great but delivery takes way too long.", "rating": 3}, {"title": "I love the cargo pants", "text": "I love the cargo pants. I will have 7 pairs and wear them al.ost e try day.  I hate that your little logo is on the pant leg. It needs to be out of sight. I tell people about them but show them where the logo is and they won't  buy them.", "rating": 3}, {"title": "I ordered the same size in 6 items and…", "text": "I ordered the same size in 6 items and only half of them fit… and they arrived late  and I have been trying to return the items that didn’t fit and have not heard back ", "rating": 3}, {"title": "Not impressed. ", "text": "They don't fit as expected and the black pants are poorly constructed. ", "rating": 3}, {"title": "Denim is not too good quality", "text": "The longer delivery than it showing web site. Not too good quality for this price...", "rating": 3}, {"title": "The shipping took a while", "text": "The shipping took a while. One of my outfits was very cute, the other clothing was poorly made with strings loose. No free shipping back for items that don’t work, only store credit ", "rating": 3}, {"title": "Mixed feelings", "text": "Took a long time to arrive as coming from China. I have ordered from Halara a few times and this aspect aside am usually happy with my purchases but not this time. I was disappointed with the dungarees as they were made of different material to what I had expected looking at the pictures and do not like them at all as a result. The trousers were nice enough if not a bit short, no mention in the advert or shown in the pictures as models are wearing boots that they finish a few inches above the ankle. But quality fit and finish is nice. ", "rating": 3}, {"title": "My 2nd pair of trousers ", "text": "The Fit was good. The wide bottom was also perfect. I was a bit disappointed with the quality of the material. While I understand it was a complimentary gift, I think the material could be better. I did the alteration of the length myself, as it was just a little bit long. Thank you for the quick delivery. ", "rating": 3}, {"title": "The pants were shorter than in the…", "text": "The pants were shorter than in the pictures and also a lot thinner than I anticipated for a pair made of corduroy :( they're not stretchy as promised. It's not a bad product, just not what I anticipated.", "rating": 3}, {"title": "Nice but bad quality for price but a solid 10 for the customer services department ", "text": "I very nearly wrote a glowing review after wearing my ‘viral wide leg jeans the first time after I’d worn them. Absolutely loved the soft stretchy fabric, they’re so comfortable and flattering!Ive only left 3 stars as they’re not very durable. After the 3rd wear I’ve found lots of little pulls in the fabric and for the price I’ve paid is very disappointing. I had 2 other pairs in my basket which I’ve now removed as the cost doesn’t justify the quality. It’s a shame really as I love the jeans.Edit can I add that the customer services department is second to none. They dealt with my issue sympathetically and issued a full refund. Thank you!", "rating": 3}, {"title": "Quality going down? Is it just me?", "text": "I don’t know if this is me or I’ve just been unlucky recently with what I purchased. I have possibly between 12-15 Halara items and all the tops/tshirt but mostly sport bras I’ve been buying lately have all been very baggy. As soon as I put them on I hear the sewing stitches coming off. I’m a S/M and M is way too baggy…. But so it’s S. maybe I should just stick to their dresses? I feel like the quality went down a little. I put 3 stars cause I very much like the style they go for but they need to look more into longevity of the clothes they sell. Cause its starting to look like Shein bad.", "rating": 3}, {"title": "Long shipping times ", "text": "Love the products, however, shipping times are too long.  Makes me hesitate to order again.  Ordered twice and both took weeks to receive.  ", "rating": 3}, {"title": "I love the fit but didn't like the odor!", "text": "I love the fit of the pants and the material.  However, one of the pants had an odor that smelled like cat urine.  The pants are in tact.  I am washing the pants to see if the smell comes out.", "rating": 3}, {"title": "Make sure everything is perfect perfect…", "text": "Make sure everything is perfect perfect before you hit submit because it cost more to send it back then to just keep it they did make it right by letting me keep the item that doesn’t fit, but that doesn’t do much good", "rating": 3}, {"title": "The leggings are nice", "text": "The leggings are nice. The shipping time SUCKS. Almost makes me not wanna order again. I made two orders in an hour. One of them took 3 weeks, the other still isn’t here and it’s been a month. ", "rating": 3}, {"title": "It takes a long time to receive…", "text": "It takes a long time to receive purchases.", "rating": 3}, {"title": "Your shipping time takes way too long.", "text": "Your shipping time takes way too long.  ", "rating": 3}, {"title": "The items I ordered are fantastic but…", "text": "The items I ordered are fantastic but the shipping takes absolutely forever. ", "rating": 3}, {"title": "Great fit, unfortunate awful smell out of the bag", "text": "I purchased 2, black and Jean colors, the fit is wonderful and so comfortable.  The only complaint I have, is a big one, the smell of the jean color was horrendous.  I have washed multiple times. It is no longer super strong smelling but still has an unpleasant scent.  The black had no scent, which I thought to be odd. ", "rating": 3}, {"title": "Pants are an odd shape", "text": "Pants are an odd shape. Not a lot of give ", "rating": 3}, {"title": "Sizing is tough ", "text": "Size M was too small, size L is too big.  But good shopping and customer service experience.", "rating": 3}, {"title": "The quality of the clothing is good", "text": "The quality of the clothing is good.  It took too long to be delivered.", "rating": 3}, {"title": "I liked that it was delivered fast", "text": "I liked that it was delivered fast. The pants I picked were a little thin for my taste but I got to keep them and try n work with them. ", "rating": 3}, {"title": "The pants are great but it took forever…", "text": "The pants are great but it took forever to arrive. I started thinking I'd mever get them.", "rating": 3}, {"title": "This has been the worst return process…", "text": "This has been the worst return process of any company I've ever worked with.  You have to take pictures of all the items for return.  You have to go through like 4-5 steps to return.  It is as if they are trying to intentionally make it difficult so you give up.", "rating": 3}, {"title": "The leggings keep sliding down.", "text": "The leggings keep sliding down. ", "rating": 3}, {"title": "Think twice before buying it. ", "text": "Material is very soft of the tummy control legging. But in black colour every little spek of dust or anything sticks to it. Plus at the knee length at one side the material is dameged. I would probably think twice to reorder. ", "rating": 3}, {"title": "Pants too long", "text": "Pants too long. I wish we could choose length as well as size.", "rating": 3}, {"title": "Description did not match the item I…", "text": "Description did not match the item I received ", "rating": 3}, {"title": "it’s just don’t look good on me,it…", "text": "it’s just don’t look good on me,it meant for curvy people", "rating": 3}, {"title": "Waistband too wide, but jeans are cute.", "text": "Delivery took a while.  High-waisted pull-on jeans were great except the elastic band at the waist was up to my bra.  I wear them by folding the ban over.", "rating": 3}, {"title": "Love the pants, SLOW shipping", "text": "Love the pants, however shipping took 2 weeks! Slow. ", "rating": 3}]