[{"title": "I haven't used the insurance yet", "text": "I haven't used the insurance yet, so I can't rate it.", "rating": 3}, {"title": "Please do not post", "text": "The people I spoke with at AARDY were helpful,  I was confused by a number of  what I am guessing are automated emails that may have come from Truspilot since I was told they were not showing up in the records at AARDY.  ", "rating": 3}, {"title": "I didn’t like that I couldn’t customize…", "text": "I didn’t like that I couldn’t customize my coverage—I don’t need overseas medical, just medevac and cancellation/interruption insurance. My regular insurance pays for overseas coverage. ", "rating": 3}, {"title": "Questionable concierge service ", "text": "Confusing information regarding who to call when we had a question. We were initially given a concierge phone number and when we called, they gave us another number to call (the company that issued the policy). So much for concierge service. Disjointed and not overly helpful.", "rating": 3}, {"title": "I just bought the policy today and the primary is wrong", "text": "I just bought the policy today. I was not put on the policy as the primary person , even though I paid for the trip, paid for the policy, and said I was primary on the application.  This resulted in having to call the company and being told by a very lovely and polite employee that I would have to write an email to have this changed.  This all takes a lot of time and energy that I would rather spend on other things.", "rating": 3}, {"title": "Finding your company and actually…", "text": "Finding your company and actually buying a plan was super easy. However, when I want to read the details of my plan and print it out, I cannot even find it. It’s way too hard.", "rating": 3}, {"title": "Policy was purchased on 1/18/2023 and…Did not name me as a co-traveler and insured", "text": "Policy was purchased on 1/18/2023 and the requested information was given for myself and my wife (names, DOB) and credit card for billing. When the policy documents arrived by email, it showed my wife's name twice and not mine. I sent two emails inquiring about this, and did not get a response, so I called this evening and spoke to a live person who was going to forward my concern to the Trawick. I hope the issue gets resolved correctly.", "rating": 3}, {"title": "I had trouble using your software", "text": "I had trouble using your software.  I had to repeat my entries on your form several times. Also, I spent too much time attempting to get a copy of the travel insurance policy that I purchased.  I never experienced that when I purchased travel insurance from other insurance companies.", "rating": 3}, {"title": "Good and bad", "text": "It was a great experience. And fast.Unfortunately, you get three stars because someone misspelled my last name and I had to start all over again. It was fixed within two days. I will recommend you to my traveling friends as you do provide great insurance options", "rating": 3}, {"title": "East to book but too many links", "text": "East to book but too many links.  Other insurance companies just provide you with printed policy and ID cards, no complicated registration.  I booked on AArdy by mistake, do not usually book with this company.  The policy seems good.", "rating": 3}, {"title": "Very easy to understand difference in…", "text": "Very easy to understand difference in packages, quick and easy service.", "rating": 3}, {"title": "Asking for a rating before we travel? or even review the policy?…", "text": "Asking for a rating before we travel is self-defeating.  We have no idea if AARDY is a good company or not.  The cost of the policy is 8.3% of the cost of the air fare for the trip.  AARDY has not even sent us a policy to review yet.", "rating": 3}, {"title": "I have no idea about insurance", "text": "I have no idea about insurance but like seeing the options and explanations even though I still don't understand them as well as I'd like. So I just went with the recommended policy.  I might give them five stars if I have any problems and the policy works.  Or one star if it doesn't.", "rating": 3}, {"title": "It was difficult to figure out the…", "text": "It was difficult to figure out the difference between the different policies. Even within the same company, the only difference we could discern was price. We haven’t left for the trip yet, so can’t comment on claims.", "rating": 3}, {"title": "The system for quotes was great", "text": "The system for quotes was great.  Then I tried the button to buy the insurance and it didn't work.  So I clicked again.  Then i was afraid I bought it twice so I called.  They had to walk me thru buying it.  The process was a little confusing.  During the walk thru, the agent suggested I upgrade, which I did.  Is this why the Buy Now button doesn't work?", "rating": 3}, {"title": "Good provider representation. Price offering based on lower coverage seemed deceptive", "text": "Liked that several companies we're represented. Did not like discovering the quote was for a much lower overall travel cost than requested. Had to cancel the inadequate policy.  ", "rating": 3}, {"title": "Incorrect spelling of traveler name", "text": "My husbands first and last name were misspelled by the agent. So when I got the notification from Trawick, his name was incorrect. I called Aardy to request for correction. The agent made the request but the Trawick agent only corrected the first name. So I had to call Aardy again and request correction of his surname. Aardy agents were very helpful but all this back and forth was a waste of my time had the initial transaction been done correctly. I regretted doing the purchase with the Aardy agent. I should have just completed it myself online.", "rating": 3}, {"title": "Read carefully!", "text": "I’m used to these websites asking for cost PER TRAVELER, not TOTAL TRIP COST. I need to cancel and determine new quotes based on actual trip cost!", "rating": 3}, {"title": "I have not purchased trip insurance…", "text": "I have not purchased trip insurance before so have nothing to compare it to, but my question to customer service were quickly responded to and taken care of.", "rating": 3}, {"title": "I'm surprised that Kayla ( agent from…", "text": "I'm surprised that Kayla ( agent from AARDY) did not include our birthdate on policy ...??? doesn't make sense why this information was excluded ...noted N/A???", "rating": 3}, {"title": "Communication is Difficult with Revolving AARDY Representatives", "text": "I finally received the policy that I needed. The problem was that I was not able to work with the same representative each time. Having to correspond with a different AARDY representative made the communication difficult. I am surprised that this is an AARP subsidiary because AARP does not operate this way.", "rating": 3}, {"title": "Issues with birthday date entry.", "text": "Birthdate field for second traveler changed to first traveler's date multiple times while checking out. Several attempts later, I finally was able to change the second date back to the correct date and get an accurate quote.", "rating": 3}, {"title": "when I read the quote details", "text": "when I read the quote details, I thought it covered \"cancel for any reason\". But I received the the confirmation thru mail, it said it doesn't cover! So it is misleading & I am not satisfied with it!", "rating": 3}, {"title": "Wasn’t explained very well…", "text": "Wasn’t explained very well…. Spoke in “insurance talk”.  It is assumed I know of all the coverage and terms , I asked, the pogo very frustrated with me asking questions z", "rating": 3}, {"title": "Pros and cons", "text": "Reps were very helpful over the phone. I did not like that I had to do extra steps thru email to get my p policy/receipt etc. Your company should have sent those documents to me automatically as soon as I purchased a policy,.", "rating": 3}, {"title": "Agent purchased the wrong policy for…", "text": "Agent purchased the wrong policy for me. Had to cancel policy having to purchase a second policy. Not happy. First agent was better and spent time working the comparisons with me and recommending the best policy for my needs", "rating": 3}, {"title": "I booked online", "text": "I booked online. Their reply said I could download policy online after two hours. It didn’t work. The following day I called to have the policy available. The representative sent me the details", "rating": 3}, {"title": "I was told that I would receive all my…", "text": "I was told that I would receive all my paperwork and insurance information within two hours. It has been days and I have yet to receive it.", "rating": 3}, {"title": "The application and obtaining a policy…", "text": "The application and obtaining a policy was super smooth; what I don't know, and hope not to find out, is what your claims adjudication experience is all about.", "rating": 3}, {"title": "I need to receive the policy from the insurance company.", "text": "The experience was fine but I never received a response from the insurance company so I don’t feel like I’m covered for my 18 day Hawaii cruise.", "rating": 3}, {"title": "I was unable to access my Insurance…", "text": "Initially, I was unable to access my Insurance Document even though I had the correct Number.  I asked for help, this took several attempts before the matter was resolved to my satisfaction.", "rating": 3}, {"title": "Knowledgeable Customer Representatives and Great Serviceing that speaks English…", "text": "A live human being that speaks English and answered the phone promptly.  Both Amanda R and Scott were both extremely knowledgeable and very helpful.", "rating": 3}, {"title": "What am I really paying for?", "text": "This has nothing to do with the associate who helped me on the phone, but the whole concept of so called travel insurance is confusing and misleading.", "rating": 3}, {"title": "not cheap", "text": "I am glad for the coverage and the help given through the process.The cost was higher than expected", "rating": 3}, {"title": "Spoke with a two agents", "text": "Spoke with a two agents, Destiny and Don. Both were very pleasant and helpful It was a pleasure talking with them,", "rating": 3}, {"title": "I was told that I was too late to…", "text": "I was told that I was too late to qualify for a look back waiver. When I checked with the insurance company, they said  that I wasn’t!", "rating": 3}, {"title": "I'am not sure what to write because i…", "text": "I'am not sure what to write because i have only just received the  plan. When and if i file a clam i can better rate the plan. I must say the plan was easy to apply to. ", "rating": 3}, {"title": "Poor support when I called in for…", "text": "Poor support when I called in for details of policy already purchased", "rating": 3}, {"title": "Review of final order", "text": "There were several mistakes in the order and it took me several telephone calls to fix it", "rating": 3}, {"title": "Once you purchase plan make sure of dates, cannot change or add more days to policy.", "text": "Easy to purchase, but do not try to add more days to policy or purchase extra days.", "rating": 3}, {"title": "Great response to get the sale quickly", "text": "I liked that I talked to someone right away.I can't give a review until after I complete the trip.", "rating": 3}, {"title": "Not really much detail about how to…", "text": "Not really much detail about how to file a claim if needed.", "rating": 3}, {"title": "I should have called to get a better…", "text": "I should have called to get a better explanation of all benefits", "rating": 3}, {"title": "Never received copy of contract", "text": "Date of experience: June 27, 2024", "rating": 3}, {"title": "Too expensive", "text": "Too expensive - couldn't afford the level of insurance that I really wanted/needed", "rating": 3}, {"title": "I needed travel insurance for a trip to…", "text": "I needed travel insurance for a trip to Israel. Trying to find reliable sources for said insurance became a crap shoot since there were no verifiable recommendations on the internet. I had to go to a known source to see what was recommended. My own insurance company had recommended companies but the price was overwhelming. I chose Aardy because of its association with AARP.  I hope I made the right choice and also hope that I if something goes wrong during the trip, I will be compensated fairly.", "rating": 3}, {"title": "I have nothing yet to evaluate other…", "text": "I have nothing yet to evaluate other than price point and claimed coverage.", "rating": 3}, {"title": "Insurance Quote", "text": "I had to call 2 times to get my insurance.  the first gentleman kept asking questions that, according to my group leader who researched this, I shouldn't have needed to answer.  He made it very confusing and I chose not to continue.The second time, the lady was much better and knew what I was asking for.  There were no issues during this call.  However, I should not have had to call twice to complete this task.", "rating": 3}, {"title": "Unanswered question", "text": "The policy coverage and price seemed very good.I called Customer service to ask a specific question as did my co travelers.Since we both got different responses I then emailed to get the answer in writing.The response was vague so I sent it again.Second and third time still vague answers.So I still did not get a clear answer and gave up.That is not good Customer Service in my opinion.", "rating": 3}, {"title": "Good rates,", "text": "I had an excellent experience with the first agent I spoke with.  She clearly explained different options and said she would be sending out an email for me to review.  I didn't receive the email.  Upon calling back, the man I spoke with found my information, with the wrong email.  He then told me the options which i was told about one day prior where no longer available.  He gave me the options that were.  He was very abrupt.  Thankfully, the first person had explained things so I had an understanding and didn't need to depend on his very curt answers.  The rates are good and hopefully I chose the right plan", "rating": 3}, {"title": "Premature review", "text": "I am reluctant to provide a review right after the company has taken money from me. Perhaps I could provide a more thorough review AFTER I have a claim.Yep - the withdrawal process went smoothly for Aardy.", "rating": 3}, {"title": "Purchased Travel insurance with more…", "text": "Purchased Travel insurance with more coverage for less than half the cost of insurance offered at time of ticket purchase. But when policy arrived instead of a policy for my wife and myself there were two policies for me. Company was responsive by email the next morning with promise of error correction.", "rating": 3}, {"title": "Live chat was unavailable", "text": "Live chat was unavailable. Waited 15 minutes. No one available at your phone number. Wanted basic xcl ins. Do not need baggage, missed connection, etc. Just coverage if we are sick or dead and can't go to the rental house in Florida. Got tired of waiting, and took way more coverage than we wanted.", "rating": 3}, {"title": "I purchased a TRAVEL INSURANCE", "text": "I purchased a TRAVEL INSURANCE. Your agent was very good in explaining the process as well as the cost.I paid for the Insurance.Once received the Confirmation of Purchase, I was NOT able to print my POLICY!!!System gave me a message : INSURED not recognized!!!My Policy # TCSE282883975  Please advise.Joshua Berkovitz", "rating": 3}, {"title": "My application on Aug 27 was promptly…", "text": "My application on Aug 27 was promptly processed. I had to call on Sept 3 to request a copy of Trawick policy as I did not receive one. The agent forwarded it to me.", "rating": 3}, {"title": "Would have liked better explanations...", "text": "I think the service is very good on the whole. However, I would have appreciated more clear and accessible explanations of \"Time Sensitive Period\" (for both \"Extra Cancellation\" and \"Pre-Existing Condition\"), \"Waiver of Look Back\", and \"Time Sensitive Period: On or Before Final Payment\" (especially the last since I have already purchased my ticket and paid in full two days before purchasing the insurance).", "rating": 3}, {"title": "How Do I Know If Cruises are Covered?", "text": "This review is only about the web site: The site is easy to use, but while there are images of cruise ships and a page about insurance from cruise ships, no where do the quotes or the payment screen say I bought insurance that covers cruises. Did the policy I bought cover cruises?", "rating": 3}, {"title": "Getting good insurance and reasonable cost", "text": "I had to ask the agent to slow down her speech and she was quite willing to do so.  I was pleased with the cost for the coverage saving me considerable dollars.  I saw a mistake in my first name on the documents received and could not get through on the phone.  I was able to send an e/m, however.  It is too soon to know if it will receive a response.  Overall, I am pleased with this coverage and the cost.", "rating": 3}, {"title": "beware of the destination country changing when you select your residence", "text": "There is a software glitch that changes the destination country.  Now I have to sort out having insurance for the USA instead of my destination.  What a pain.  Aardvark get this fixed!!!!!UPDATE:  I was impressed with Aardvark for reaching out to me to fix this.  I am changing to 3 stars because it would be best for people to double check the glitch has been fixed.  Customer service was great but I wish it has not happened in the first place.", "rating": 3}, {"title": "I found the website helpful", "text": "I found the website helpful, the chat less so. I do not believe this was the fault of the agent, but the company. The agent clearly was chatting with other clients (overworked). And the \"conversation\" had waits after I messaged. Answers were stock and did not give me any better understanding of the policies than what I could garner from the website.", "rating": 3}, {"title": "Buy was an easy and quiet experience , but.", "text": "Buy was an easy and quiet experience, I bought the insurance policy today around 8 am, after I received an email informing me that in two hours I would receive an email with my insurance policy, now it's 4:19 pm and until now I did not receive any emails with my apolice.Maybe I bought a problem.I expect a position from the company before my trip.", "rating": 3}, {"title": "Disappointed", "text": "Unfortunately you did not have what I wanted. I made a deposit on a trip in May, 2017, a year ago. Due to visa problems which arose only recently for Russia, I needed a policy with cancel for any reason. Sadly, your policy restricts one to signing up within 21 days of initial booking and it covers only 75% of the costs incurred. I was hoping that you could tailor a special policy for me, for which I would be willing to pay extra.", "rating": 3}, {"title": "TOO MANY EMAILS", "text": "TOO MANY EMAILS! Even before I had purchased a plan - while I was still shopping around, I received over TEN emails from various people.  This is annoying.   We are smart enough consumers without all of that - i wound up purchasing my plan from you but that's because I could read the plan - not because of the annoying emails.", "rating": 3}, {"title": "Spoke with agent picked insurance but…", "text": "Spoke with agent picked insurance but she entered wrong one. She corrected it, no big deal. Called again about not booking my flight and tickets could vary in price. Was told I would have to pay for extra insurance. Called back and was told that there’s a range for total amount of coverage and I was okay.", "rating": 3}, {"title": "I rated average", "text": "I rated average, because web site had issues and could not process my request after all information was input including credit card numbers, names and addresses.  I had to return to sight the following day in order to complete transaction, by phone, and repeat all the information previously given.", "rating": 3}, {"title": "I bought an airline ticket", "text": "I bought an airline ticket, but the payment was slow to process. and the number on my card was missing. the proces continue for 3 days and my payment was cancelled because of affirm not giving the info.", "rating": 3}, {"title": "I was not aware of the FACT sheet that…that came after the purchase of my travel insurance.  The FACT documents tells you how your will be sharing my personal information.  That includes SS number,etc", "text": "I was not aware of the FACT sheet that came after the purchase of my travel insurance.  The FACT document tells you how they will be sharing your personal information.  That includes your Social Security Number, banking information and such.    Can I request you DO NOTshare my personal information?", "rating": 3}, {"title": "Using Aardvark was easy and they…", "text": "Using Aardvark was easy and they provided several insurance options. However, because I received two conflicting answers from two different Aardvark Representatives; I was forced to purchase a more expensive policy than I would have if I had been given correct information initially.", "rating": 3}, {"title": "I ordered this policy on 3/10/22", "text": "I ordered this policy on 3/10/22. the agent was Arron and i'd rate my dealings with him to be a 5 star rating.However,I just hung up when I CALLED TODAY-3/12/22 @1225pm,a recording notified that there would be a longer than usual wait and after a @22min wait on hold a recording was then played to say my call couldn't be taken at all and to leave a message. What my complaint is that, instead of just giving me that recording about leaving a message in the 1st place, it would have saved me the @22mins on hold and some aggrivation. Every inquiry and problem encountered in this day and age, is met w/a wait time,but they should have gone to \"leave your info etc\" message in the beginning of the call. TY for listening.", "rating": 3}, {"title": "Every time I signed in the prices were…", "text": "Every time I signed in the prices were different?? Very Frustrating!!!!     Finally was albe to reload original quote and bought it. Your site looks shady  when the prices change for no reason.", "rating": 3}, {"title": "The agent was polite answered my…", "text": "The agent was polite answered my questions but unfortunately, I did not get a warm feeling as we discussed different in policies and options.   My questions were answered but the CSR was direct... but I did not feel he was very empathic.", "rating": 3}, {"title": "Ana was wonderful on phone but…", "text": "Ana was wonderful on phone but everything dealing with computer including email was ugly.  From pages that would not come up to emails that were missing critical information such as Buy Now,", "rating": 3}, {"title": "Satisfactory but not building confidence in iTravel.", "text": "Our agent Lynne Peters sent the wrong followup quote of $400 which was 5x the discussed price, causing considerable concern about a policy for international travel.  Jonathan took over in the followup and assured us we’re getting the originally quoted $80 policy for our travel.  This is singularly dangerous for errors of this significance.  It was unfortunate so I am not able to give the best of ratings.    Altogether her telephone explanations were helpful and she did guide us through some understanding of a complex set of terms and conditions,  I do kindly appreciate her efforts.", "rating": 3}, {"title": "Easy process, wrong start and end dates. GRRRR!", "text": "The agent was very pleasant and the process was easy but the start date was wrong and the termination date was as well. I have written to the company and it may be that they will correct the problem rapidly.  But right now I am very, very annoyed.", "rating": 3}, {"title": "Vanilla only policy", "text": "Was  A difficult site  to navigate around . Also not  a way to see that they are paid from the few companies they represent.     Other sites have many more  company choices with various coverages. Aardvark was a simple vanilla type policy shown.", "rating": 3}, {"title": "I purchased travel insurance on line…", "text": "I purchased travel insurance on line but online purchase does not allow to add flight insurance for higher coverage. Thus on Monday July 13, I called Aardy.com and talked to someone and added 100K coverage to my travel insurance. At the time I was told that the $20 (for both of us) cost will be charged to my credit card on file and a confirmation of added insurance will be sent to me few days. Today already one week passed and I am yet to get confirmation. Kindly expedite to send. I would also suggest Aardy.com to consider modifying website so that customers can directly be able to add it on line at the time of initial purchase.Thanks", "rating": 3}, {"title": "easy to use but haven't traveled yet do…", "text": "easy to use but haven't traveled yet do don't know if they are easy if you need to collect. will let you know after i return homealso couldn't download because it wanted me to buy a new acrobat which i didn't want to do", "rating": 3}, {"title": "Happy with the initial quote, but..", "text": "Overall was happy with the initial quotes but, I went back to make a change in the personal information I had entered before checkout, the price quotes went up. I can't review based on the actual policy that we ended up getting just yet. However, for people on a budget and as a trusted site representing older individuals it was disappointing that you use the \"dynamic pricing\" gimmick to force people to pay higher pricing than initially quoted for something this important. Just like airlines do. I find that to be a really poor business practice. I don't know why websites are able to get away with it. I know insurance companies can be sketchy .. let's hope if I need to file a claim that they come through. Will review later if needed.", "rating": 3}, {"title": "options were not understandable", "text": "options were not understandable.  After printing out the 40 plus  pages of the insurance coverage that no one will read, I am sure there more exceptions than things covered and far too many rules to fallow!", "rating": 3}, {"title": "Price dropped on our policy 2 days…", "text": "Price dropped on our policy 2 days after purchase.  Told by Aardvaark that we would have to cancel and re-purchase.  Cancellation would need to be in writing, and take a great deal of time.  Not worth it.", "rating": 3}, {"title": "Your agent did an excellent job", "text": "Your agent did an excellent job, my problem is with the deceptive description of coverage! If I didn’t do real digging to find out what the trip cancellation clause covers I believe I would have lost all my money I paid for my trip! I think you need to post a disclaimer on your site that tells people that even though the coverage looks thorough and it should cover most ordinary issues it does not cover a number of things that could cause the trip to be cancelled even if not by you. Please do you customers a favor and put a disclaimer at the top of the page that states that trip cancellation in most if not all policies do not cover things like a viral outbreak that could cause airlines to shut down or the government to ban flights!", "rating": 3}, {"title": "Chris did a great job", "text": "Chris did a great job, he was patient. professional ind well informed. There was a communication issue with AIG that was resolved. Chris in my view earns all stars. Thanks gor an excellent job.", "rating": 3}, {"title": "I appreciated the comparison tool", "text": "I appreciated the comparison tool, but I'm not sure whether what I ended up buying was everything I needed. Never having bought travelers insurance before, I could have used some advice.", "rating": 3}, {"title": "some inaccuracies. Aardvark compares needs to provide accurate information", "text": "too many inaccuracies. Aardvarkcompares needs to provide accurate information and comparison.  ie those benefits as declared by insurance providers.  it seems to me the link that says CERTIFICATE does not pull up the latest or all the necessary information. for example, in attempting to select a cancel for any reason policy, three options were returned. Travel LX; Worldwide Trip Protector Plus ;Travel Max:and though your comparison page indicates cancellation any reason, this differs from what is contained in the CERTIFICATE PDF from the providers. it would have been helpful to see the covered limits or percentages.  Also several other benefit amounts listed in your comparison table differ from amounts found in the insurers table of scheduled benefits.", "rating": 3}, {"title": "Very confusing talking with different…", "text": "Very confusing talking with different reps on the plans. It turned out well but could have cost me getting the coverage I wanted especially if I wanted to go through another company", "rating": 3}, {"title": "I am supposed to receive my cards and…", "text": "I am supposed to receive my cards and information in the mail and so far have not received them. Very difficult to get a hold of.  Other people that answered the phone were very nice.", "rating": 3}, {"title": "Difficult to compare plans", "text": "Difficult to compare plans. AARP provided no discount. The plan prices were the same as 3 other sites.  I was surprised that I was dealing with AARDVARK and not AARP.", "rating": 3}, {"title": "Your software miscalculated my age by…", "text": "Your software miscalculated my age by one year, so charged me more than I was initially quoted. Not impressed.", "rating": 3}, {"title": "There is no tab to compare policies…", "text": "There is no tab to compare policies after the boxes have been checked. Also I would appreciate a plastic card in the mail with particulars of the policy and phone #s", "rating": 3}, {"title": "Incorrectly spelled name wasted time", "text": "Agent was pleasant and helpful but incorrectly spelled my daughter's name on official document. Had to then go through the process (aardy agent was helpful) to request correction. Would like to have avoided wasted time.", "rating": 3}, {"title": "they did everything I expected", "text": "they did everything I expected, but nothing extra.  I give 4-5 stars for going the extra mile.  But there was no need to go the extra mile for this simple quote.", "rating": 3}, {"title": "It was my first time purchasing travel…", "text": "It was my first time purchasing travel insurance. I will use this company again in the future when I decide to travel again.", "rating": 3}, {"title": "Policy was easy to purchase and…Hard to Cancel", "text": "Policy was easy to purchase and understand but difficult to cancel withing the 14 days. This is not really appropriate especially during these times", "rating": 3}, {"title": "Policy did not arrive in 2 hours.", "text": "Service from AARDY was great but the subsequent purchase policy did NOT arrive within 2 hours as expected.", "rating": 3}, {"title": "DID NOT OFFER RENTAL CAR COVERAGE…", "text": "DID NOT OFFER RENTAL CAR COVERAGE INSURANCE FOR SELECT DATES OF THE TRIP.  NOT RENTING A CAR WHOLE TRIP", "rating": 3}, {"title": "Chat function did not work well for me.", "text": "Chat function did not work well for me. I would have liked to see more detail of the insurance policy I bought.", "rating": 3}, {"title": "I've just bought the policy- I have NO…", "text": "I've just bought the policy- I have NO idea how of useful/valid it may be until I may have to use it.", "rating": 3}, {"title": "Can't see if medical ins is primary", "text": "Date of experience: January 05, 2023", "rating": 3}, {"title": "Everything was going ok", "text": "Everything was going ok, but it doesn't recognize my Certificate # to print my docs.", "rating": 3}, {"title": "Dealing with your agents was fine but I…", "text": "Dealing with your agents was fine but I haven't received the policy and it's almost 24 hours.", "rating": 3}, {"title": "I'm here to battle grade inflation", "text": "I'm here to battle grade inflation. I purchased a plan via Aardvarkcompare for Seven Corners Choice travel insurance. I have spoken to two Aardvark agents, and chatted with several more. All were informed about the policies and knew exactly how to help me (including helping me understand the coverage, and helping me change the coverage dates after I purchased). They communicated directly with Seven Corners on my behalf. All good things.  HOWEVER, I had to call Aardvark again because the dates of birth for the covered insureds were ALL wrong (for all four of us!) when I received the policy from Seven Corners. Additionally, the wallet ID receipt-of-purchase amount lists the incorrect total for our policies (not sure if it matters, but with insurance, I don't want to mess with anything being incorrect in the documentation). I would expect Aardvark to have communicated this information correctly to Seven Corners in the first place AND to check the policy to make sure it was written as requested. So far, I would not consider this 5 star service, from either Aardvark or Seven Corners. And of course, the true test of service would be assessed if I needed to use the policy.", "rating": 3}, {"title": "Beware of follow-up spam", "text": "Once you provided your email address, you'll be flooded with follow-up emails -- it's ridiculous.", "rating": 3}, {"title": "The bottom line is whether the…", "text": "The bottom line is whether the insurance coverage ACTUALLY works. I will not know until we have a claim.", "rating": 3}, {"title": "Quickly responded with quote", "text": "Quickly responded with quote. Failed to follow up on customer request.", "rating": 3}, {"title": "information shared was minor", "text": "information shared was minor, should have purchased insurance from original travel agent", "rating": 3}, {"title": "I chose Travel Guard", "text": "I chose Travel Guard.  When I called to get further explanation of the policy, the call was taken in a call room with many people in the background talking.  I really couldn't concentrate on my questions, and I couldn't hear the answers. When I was referred to the licensed sales agents for Travel Guard, I was on hold a long time and no one ever answered. I hung up and re-dialed the sales team and was on hold a long time again until I gave up and hung up.  No idea what to do next. Luckily I can cancel the policy if I never am able to get clarification on policy questions.Update:  No one has contacted me. Update: No one has contacted me. I have questions and am unable to get answers. This is a very stressful experience.Update: The AARDY agent called me and explained that I purchased the Travel Guard plan through their agency. I should have contacted AARDY instead of trying to call Travel Guard, which is what I had been doing. The agent indicated that Travel Guard has long wait times, but AARDY answers their phone right away. My issue was learning that 100% of the trip cost must be insured through Travel Guard within 21 days of the pre-book payment to maintain the pre-existing medical condition waiver. The trip costs include anything pre-booked (like hotels), even if you do not plan to file a claim for that booking. I raised my one-star rating to 3 stars since this survey is an evaluation of AARDY, not Travel Guard, and the AARDY agent was a real person who really tried to help. Nice to talk to a person instead of just online.", "rating": 3}, {"title": "it should be less money !having to have…", "text": "it should be less money !having to have this is insane", "rating": 3}, {"title": "It was really easy to move through it great ser", "text": "It was really easy to move through it . Great service", "rating": 3}, {"title": "Have not received the document promised…", "text": "Have not received the document promised in the payment window!!", "rating": 3}, {"title": "Easy to obtain policy", "text": "Date of experience: January 21, 2023", "rating": 3}, {"title": "Excellent buying experience, crummy email service", "text": "The buying experience was excellent.  All representatives were helpful and knowledgeable.  The process was good.However, I have had innumerable problems dealing with your website and email.My husband I share an email address and all communication comes to him and is forwarded to me.  I am the one who does all technical computer work for us.  I have never had a problem with anything like this before.  I received several emails from you, but not the Confirmation of Benefits.  I called today requesting it and they said they had sent it but would send it again.  It never came.  Then I went to my husband's computer and there it was.  So I forwarded it to me, but it never came.  And when I went back to my husband's computer, it had disappeared. !?!  Luckily, I found the first email you sent a week ago which he hadn't opened.  It had never come to me.  I saved the attachments as documents and tried sending them to me again.  They never came.  So I shut down my computer to see if there was a problems with it.  Turned it back on, but again, they never came.  So then I opened up the file once again on his computer and printed the documents out (all mega pages!) so I would at least have them in print.I sent another test email with just a short message from his computer to mine and boom! it came immediately.  What is up!?  Now that I've wasted two hours of my morning just trying to print out one simple sheet from you, I am not a happy camper.  Oh, and I also tried to create an account with the link on the attachment email so I could login to see if the docs were available there.  Nope.  Links took me around and around asking where I was going with the only box available to check was where to send your quote.  Tried it 4 times.  Could not create an account.I think I'll choose another company next time.", "rating": 3}, {"title": "THIS IS THE FIRST TIME I USED YOUR…", "text": "THIS IS THE FIRST TIME I USED YOUR SERVICES.", "rating": 3}, {"title": "Not yet ready to rate this service.", "text": "Date of experience: September 02, 2021", "rating": 3}, {"title": "better than the cruise line", "text": "Date of experience: April 23, 2022", "rating": 3}, {"title": "no option for cancel any reason", "text": "Date of experience: December 01, 2021", "rating": 3}, {"title": "Was fine", "text": "Was fineZzzzz", "rating": 3}, {"title": "Did what we wanted done!", "text": "You did what we wanted done.", "rating": 3}, {"title": "New Customer", "text": "Date of experience: May 13, 2022", "rating": 3}]