[{"title": "Went fine", "text": "Went fine. All online. I did all the work", "rating": 3}, {"title": "The process was great and easy.....BUT behind then times a bit", "text": "The process was great and easy, the agent was friendly and informative. But this company offers no way to digitally sign a document, it has even prohibited copying in system and signing with a touch screen or pen, making it very difficult to upload and send the bond without being near a printer and scanner. this i give a 3 and a very big disappointment in 2024. sorry folks", "rating": 3}, {"title": "Important unclear document signature line", "text": "Everything went smooth up until getting the bond notarized.The signature block, stated Title, not signature, which resulted in 2 phone calls, with me and the notary. Happy with everything else though.", "rating": 3}, {"title": "Disheartening ", "text": "I liked the fact it was quick and easy I did not like the fact that Ga. Only recognized it for 6 months after bought. Even though it was good for 4 years . That was even more money out of pocket for me when had all other expenses to get car going and paying that much only to be turned down cause the bond is only good for 6 months to GA. I am very disheartening.  Cause I thought there was communication between you and state that way when someone travels over 2 hours one way to get a title would not be turned down cause you and state can't cooperate in harmony.  ", "rating": 3}, {"title": "A bond is needed to apply for a…", "text": "A bond is needed to apply for a mortgage license in each state, if one is not approved for that state, your company does not cancel the bond and reimburse the client.  Even though I have other bonds with your company.  So I am bonded in a state for no reason.", "rating": 3}, {"title": "I was under the impression that this…", "text": "I was under the impression that this was liability insurance for my business, realized it wasn't after paying over $100 now I have to pay another $100 for what I need. Zack helped me alot but didn't e plain. What I was buying.", "rating": 3}, {"title": "I paid for overnight shipping", "text": "I paid for overnight shipping, here we are the next day and the item has not even shipped.I think the fix could be to show a cut-off time to determine if you want to pay for overnight shipping and not actually get overnight shipping.Even show when the item will be delivered according to your order.", "rating": 3}, {"title": "Whatever it’s fine", "text": "Whatever it’s fine. I could do without the “you will be sent to collections” emails two months before my renewal was due as I was waiting for a court decision on closing the estate for which I needed the bond. Super fun to get shaken down after the death of my mother. They also refused to ship the bond via any shipping service other than FedEx even after I expressed concern that FedEx routinely delivers to wrong businesses in my area. It was of course delivered to the wrong address and they wanted to charge me a second time to send it with FedEx. Just stop using FedEx they are expensive and unreliable. But anyway you to can do the whole process online which was good for me because I had to probate an estate in a state where I don’t reside and this saved me a trip. Get a bond from them or don’t it probably will not change your life in any meaningful way.", "rating": 3}, {"title": "The service leading to acquisition of…", "text": "The service leading to acquisition of the bond was efficient. However, once the bond was submitted to Florida Athletic Commission, it was rejected because the bond was submitted on an outdated form with former name of Florida State Boxing Commission. This created a bit of panic due to promoter’s license being under a temporary hold until situation was rectified with correct form that the commission forwarded to me. I then had to forward the updated form to SuretyBond.com to redo the bond.", "rating": 3}, {"title": "The process was easy and simple but the…", "text": "The process was easy and simple but the digital notary was not accepted by my requester and I had to request an original from Surety and had to pay an additional $20 to have it overnighted to me.", "rating": 3}, {"title": "I would have given 5 stars but the fact…", "text": "I would have given 5 stars but the fact that I can't get out of your rabbit hole without writing something is a time suck and it reduces my warmth towards your professionalism. ", "rating": 3}, {"title": "Needs to provide thorough instructions", "text": "I was recommended to use this service to get more coverage apart from what had from work. But I did not see a thorough break down of how to mail in the notary bond. It just says to mail it. My bond got rejected and they are telling me I have to “apply” all over again and provide another fee.", "rating": 3}, {"title": "If there’s an app", "text": "If there’s an app, that would benefit me. Trying to access my bond seems counterintuitive, and having easy access to it is imperative.", "rating": 3}, {"title": "It's fine but it is a 3 star because…", "text": "It's fine but it is a 3 star because there is nothing more annoying than receiving threatening emails that your policy is going to be canceled months in advance!", "rating": 3}, {"title": "I didn’t like how there was no login…", "text": "I didn’t like how there was no login page. It gave a feeling that it lacks security. And there was no way for me to go back in and review my documents after the purchase.", "rating": 3}, {"title": "Got the bond quickly just didn’t get…", "text": "Got the bond quickly just didn’t get vehicle history other than that experience was great", "rating": 3}, {"title": "If it was more explanatory It would get…", "text": "If it was more explanatory It would get 5 stars But I had to keep looking stuff up researching on what my next step should be because it doesn't actually say everything that I could understand anyway", "rating": 3}, {"title": "Did not receive bond after being paid for!", "text": "Paid for the bond, got two emails and didn’t receive the bond. Had to call customer service and Josh sent the bond right over. ", "rating": 3}, {"title": "cost of bond when doing continued…", "text": "cost of bond when doing continued business with same provider.", "rating": 3}, {"title": "Easy and fast service", "text": "Easy and fast service. Always sends me reminders of when I'm due to renew. They keep it simple and honest.", "rating": 3}, {"title": "Love the ease of renewal but was told I…", "text": "Love the ease of renewal but was told I would receive a copy of bond and have not yet received.", "rating": 3}, {"title": "Response time was good", "text": "Response time was good! Competitive price was the area of downfall.", "rating": 3}, {"title": "Efficiency, affordability and customer service", "text": "Fast response and no problem to apply for services", "rating": 3}, {"title": "How to process going", "text": "The process was easy but The thing I have a problem with Is I having hear about how the process is going and if y’all working on my title bun", "rating": 3}, {"title": "I havent gotten my actual bond yet", "text": "I havent gotten my actual bond yet? Am I supposed to be expecting a seperate e-mail?", "rating": 3}, {"title": "Fast, 1 day super service", "text": "Contacted them from their website.  Got a quick reply with a super good price. Had a few questions and they replied back very quickly. The transaction was smooth and easy and very quick. My existing bond was getting very expensive and they were 1/3 the cost for the same bond amount and coverage. Fast service and very nice folks to do business with. They are 5 star plus rating!", "rating": 3}, {"title": "I have been very satisfied with the…", "text": "I have been very satisfied with the service and pricing that I have received up until this point.  But when I renewed my bond this last time it had increased by almost 75% with no actual reason behind it.  I have been paying the same price for the past 4 years and this year, with this whole pandemic crap, lumber prices skyrocketing, my bond costs almost double. Thank you for that I guess. At least it’s not triple, right?", "rating": 3}, {"title": "Rude customer service", "text": "I ended up having to call the customer support line because I hadn't received my bond in the expected time frame. The customer service rep was condescending and rude.", "rating": 3}, {"title": "The incessant phone messages were very…", "text": "The incessant phone messages were very annoying , I know when my Bond is up Paying for it 2-3 months in advance is ridiculous", "rating": 3}, {"title": "The signatories on the very first page…", "text": "The signatories on the very first page was missing so it wasn’t a official document when I went to file my document had to call to have a signed document sent thank god the person doing my filing gave me his email and had the documents sent to him to retrieve", "rating": 3}, {"title": "Alright then,", "text": "Alright then,3 months before my bond was up for renewal I received an email which included a warning that if not paid it would be sent to collections?! As executor of a very complex estate in probate I'm very aware of the anniversary and that the bond must be renewed, I'm living it!The probate court system demands a paper trail.I'll mention that it was convenient being able to pay the bond renewal fee with a check, as many probate executors past and present could confirm", "rating": 3}, {"title": "Customer service issues", "text": "Where I appreciate the fact that they gave me a surety bond, I applied for too surety bonds in the same day. Unfortunately, they didn't notify me in any way shape or form that they could not fulfill the second surety bond until I called in asking about it. I waited for over 3 hours for a response from them, and I had to call in to get it! I think if there's a reason why you're not going to take and give the surety bond that you should take the initiative to get a hold of the customer and explain to them why you are not going to do it. Also, if you're not doing surety bonds for yourself, and multiples of them, make sure that every single one has a different person's name, email address, and phone number!", "rating": 3}, {"title": "We placed an order for my wife and my…", "text": "We placed an order for my wife and my bond on the same phone call. My bond came back with no errors, my wife's bond came back with an s at the end of our last name.We called and spoke to another reprecetative, who was able to correct my wifes spelling on our last name, and fixed our address. Somehow we missed the fact our address was wrong as the UPS driver knows my wife and I due to our business on the street.That is why I gave the company a 3 star rating.", "rating": 3}, {"title": "Calls too much- emails too", "text": "The renewal process is easy and prices are fair. This company will, however harass you for months prior to when your renewal is due. I asked them to stop and they didn’t. Now, after having left them a 3 star review they are calling me MORE. If this doesn’t annoy you then this company is fine. I have no other issues with their service", "rating": 3}, {"title": "I don't even know if 3 stars is too…", "text": "I don't even know if 3 stars is too much but the support team or whatever there doesn't do a good job of reading emails at all. Sadly, most companies suck at service and support so a 3 is about average I guess. When I went to renew I changed slightly my plan name and it said I had to wait for them to review it, then I emailed and after about 3 emails they finally went in and set it up so I could renew. The problem was clearly they didn't read my emails to them until the 3rd time. I'll probably move my insurances for a few plans to other providers moving forward.", "rating": 3}, {"title": "Overall our experience was fine", "text": "Overall our experience was fine. Unfortunately we were unable to secure the 3 year bond Advertised and preferred. We wanted the 3 year vs the 1 year which we were unable to achieve.", "rating": 3}, {"title": "It was easy to apply and their response…", "text": "It was easy to apply and their response was quick.  Very competitively priced. The only problem was my email didn't contain my name so they went with one of my partners emails. Unfortunately,  I got a call 2 days later from the Kansas Department of Revenue saying the bond I sent them was missing the seal. Surety Bonds was quick to fix this but it was an unnecessary delay and created more work for me. So I changed my rating from 5 stars to 3", "rating": 3}, {"title": "Pretend follow through", "text": "I requested a quote and received several inquiries asking me if I’d like to complete the purchase. The inquiries stated they had tried to contact me by calling me several times. They hadn’t called me. When I responded back to the emails asking for additional information, I never got a response back.When I did purchase my bond, they completed my address incorrectly, but did correct it in an acceptable time frame.", "rating": 3}, {"title": "Process was super simple, but no original document yet", "text": "Process was super simple. All I needed was to email my documents to Levi and then in the next couple of hours he had everything set up.One thing I didn't know is that they only provide you with a digital copy with a massive watermark on it. The only way to get your original document is to pay $10 for shipping. It's been about 3 weeks and I'm still waiting for my document.", "rating": 3}, {"title": "My honest experience", "text": "My honest experience. I went online to purchase a surety bond. Surety bond.com was easy and ready to go. Now I've received a survey to fill out but no bond or bond info to follow. Maybe hthere should be a survey after the bond has gone through. Not just after they've taken my money. Heres to hoping I actually receive a bond after this.", "rating": 3}, {"title": "My certificate did not come to my email…", "text": "My certificate did not come to my email until hours after I submitted the application. That delayed our class submitting our app to the State of Illinois for processing by more than a day. This should have been an immediate transaction!", "rating": 3}, {"title": "Too much baggage", "text": "Too much baggage! My renewal comes up in mid-December, and I started getting constant phone calls and emails as early as July to renew. The titles of the emails and the voicemails almost sounded threatening by the middle of November, sounding like my bond was on the verge of being canceled if I did not renew immediately. When I did renew, they had an outdated/ incorrect office suite number on one of the two places that my address was listed on the review form. When I corrected it, I had to go through a whole series of steps to justify why the situation was in review. Too much baggage for a service that I can get from thousands of other vendors.", "rating": 3}, {"title": "I was eager to renew my notary license …", "text": "I was eager to renew my notary license quickly. Another company I tried was taking too long. So I tried you and instead of days, I was able to renew my license in minutes!  I am relived and very happy!  My experience was great I do not know what changes may occur which   Could make some else's experience a bad one", "rating": 3}, {"title": "Was quick to find the bond issue the…", "text": "Was quick to find the bond issue the bond communication issue on picking the bond up after I pick the bond up from the issuer 2 hours later they sent an email that they were going to have it faxed out already had it in my possession so you have an issue between the sales people and the production people", "rating": 3}, {"title": "Surety Bond (multiple corp)", "text": "I have a current bond for a motor vehicle dealership that originated with this company. Although the imformation given to me was that my state DMV would be notified of my bonding number each time its renewed; it wasnt and resulted in an audit. I had to prove my bond information as well as other paperwork on file which risked fines. The process by which I obtained the bond with this company was simple and therefore, I applied for my broker bomd which, too, was easy, but I still do not trust that the bond is reported correctly.", "rating": 3}, {"title": "Not the best customer service!!!", "text": "My initial experience was good.  The Account Mgr I spoke with (Jared) answered my questions.  But whe I followed up with additional questions, he was unresponsive.  I called several times and there was no call back or even an apology for his inability to respond.  Even though I ended up purchasing the bond I don't know if I would recommend him to anybody else.  I literally had to call back 3 times to get someone to help me.\r Poor customer service is what kills businesses.  I hope you pass along my commentary.\r Thank you and have a wonderful day~\r Richard", "rating": 3}, {"title": "Latest call", "text": "I've called many times for bonds as we are a contractor and the service is fast and excellent. This time when I called I felt like the person was either new or did not know what to do.", "rating": 3}, {"title": "Make sure you have good phone numbers", "text": "The initial agent that was assigned to our case never told my husband and me that he was going on vacation in 2 days. After giving him all the information, we told him we need the bond asap because we were leaving on vacation in a week. He said, no problem. A couple days past. No word. My husband tried calling the number listed on the assigned agent’s page but would not connect. Another day went by. Our stress level rising. We needed the bond before we left on vacation for court. Finally, my husband found another number from your company. An agent told us that the agent assigned to our case went on vacation and won’t be back for a week. We explained our situation and he got the bond for us in 1 day.  Our stress could have been avoided if the initial agent would have passed our claim to another agent or not answered the phone!", "rating": 3}, {"title": "The only thing I struggled with was the…", "text": "The only thing I struggled with was the entire process.  I felt I was having a criminal background check done.  If the courts have issued an order for me to get a bond that means I have already gone through an extensive background check.  Issue the bond", "rating": 3}, {"title": "Failure to return my phone call", "text": "I called Mr. Mayer.  Stil waiting for the return call.I obtained a Beer Bond. I was trying the get an original of the bond to besend via regular mail.  Once you got your money customer is us", "rating": 3}, {"title": "Needs Work", "text": "You are closed on weekends and guarantee 1 day delivery with $20. So if someone orders over the weekend that doesn’t quite cut it. You should refund because you made a guarantee that you cannot follow through on", "rating": 3}, {"title": "no refunds", "text": "Everything is fine, with the exception that no refunds. I needed to change my bond 4 months after I paid for 2 years and was not able to get a refund for the unused time, even though I was buying a new bond.", "rating": 3}, {"title": "THE CREDIT REPORT PULLED IS VASTLY…", "text": "THE CREDIT REPORT PULLED IS VASTLY DIFFERENT THAN WHAT I PULL.  I WOULD LIKE TO KNOW WHY SO THAT I CAN UPDATE THE FILE TO ACCURATELY REFLECT MY CURRENT CREDIT RATING.", "rating": 3}, {"title": "Contacted back on 3 different occasions", "text": "Overall buying process was made fairly simple. I had to contact Suretybonds.com back on 3 different occasions to have them sign and complete in two sections that should have been from beginning.", "rating": 3}, {"title": "The process was easy, but couldn't review or edit; great customer service", "text": "The process was easy, but I decided to use a different email address than I had initially provided, and I could not find a way to go back to review or edit what I had already entered. Also, I was going to pay with a company credit card, but there was no option to give a different billing address. I couldn't figure out how to change what I had previously entered, so I had to abandon it and start over. For my state, I also needed to give the county where I will be notarizing documents. It is a different county than the one where I live. However, my resident county is what was printed on the bond. I contacted Customer Service via email, and I received a prompt response and a corrected bond, so I would rate the Customer Service part of the experience as Great.", "rating": 3}, {"title": "The only thing i dislike, is that every year my bond gets a month earlier than it started with. Hard to remember to have money ready for it. Thanks Jerry", "text": "The only thing i dislike ", "rating": 3}, {"title": "Straight forward online application BUT...", "text": "Straight forward online application but emailing the documents to you isn't an option.  All this high tech wizardry still results in a surcharge for snail mail!", "rating": 3}, {"title": "Just another renewal with unpleasant increase", "text": "Date of experience: December 01, 2022", "rating": 3}, {"title": "Third time was a charm", "text": "I ordered a Surety Bond from SuretyBonds.com in connection with the application for a Missouri sales tax license. The application process was very smooth; however, the first Bond I received in the mail had the city stated incorrectly for our business.  I brought this error to their attention and they resent the bond.  The second one I received has our Federal Tax ID number truncated, so I called them and asked for another bond.  Finally, the third time was charm and it was correct. I opted on the first order for a FedEx two-day delivery and based on all of this back and forth I believe they should have credited me for that fee.  They did not, however. The excuses I got for the issues were that the lady I was dealing with submitted the bond but was not responsible for reviewing it before it was sent out. I think they should change their process and add a QA function.", "rating": 3}, {"title": "Unsure how to contact you via phone", "text": "Unsure how to contact you via phone, attempted to do so, need the document that was purchased in case of needing to relay to customer", "rating": 3}, {"title": "I had told 3 different reps that I…", "text": "I had told 3 different reps that I would not be renewing a bond and they kept calling.  They need to keep better notes in the files.", "rating": 3}, {"title": "Quick service", "text": "I got connected with agent in no time and got a quick guidance on how to complete my application and also received the bond certificate.", "rating": 3}, {"title": "Typical online company", "text": "Typical online company, prices changes at checkout. In my case it was a 5% extra fee at the end of the process for shipping.", "rating": 3}, {"title": "I paid the extra money to have the bond…", "text": "I paid the extra money to have the bond overnighted and surety bonds sent the shipping company the wrong address.  I confirmed I gave them the right one with Bob Wolf but the shipping co Fedex received the wrong address!  Money wasted!!!!  My application was delayed. and I am sure I will never get that money back.  Very disappointing.  Everything else was fine. so I give a three star rating if the shipping could of been done right I would of given an excellent review. Surety bonds never even said we apologize of checked on anything for me, Bob simply sent a tracking number and then I was on my own.  I would not treat customers like that!I am surprised and pleasantly I might add.  Mr. Brad Bullerdieck read my review and took care of it.  Mr Bullerdieck sent me a check repaying me for the overnight that never happened, apologized and acted in a very professional manner.  This guy is aces! I an very happy and look forward to many more years of service.  I will be sharing this story with other contractor friend of mine.  Thanks Brad, the check arrived yesterday via Fedex.  All the best to you and yours.RespectfullyRichard L. Winget", "rating": 3}, {"title": "Why is there an attorney on it that has…", "text": "Why is there an attorney on it that has power of attorney there was no mention of that during the sign up", "rating": 3}, {"title": "Fast Service!!!", "text": "The experience would have been great, but even though I selected the $50 plan I was forced to get the $130 policy.", "rating": 3}, {"title": "Fast and easy service", "text": "Fast and easy service, but they don't return phone calls when u leave a message. I would use them again.", "rating": 3}, {"title": "I never got my bond", "text": "I never got my bond! Said it was mailed to me but never arrived. FedEx even said it was delivered", "rating": 3}, {"title": "Why the flurry of emails to pay with 90…", "text": "Why the flurry of emails to pay with 90 days to go before it is due to be renewed", "rating": 3}, {"title": "I paid for a bond and have not received…", "text": "I paid for a bond and have not received any thing showing I have it", "rating": 3}, {"title": "I haven’t got the bond yet", "text": "Date of experience: March 17, 2023", "rating": 3}, {"title": "Easy to work with", "text": "Easy to work with.  Thank you.", "rating": 3}, {"title": "Company needs better communication with …", "text": "Company needs better communication with their clients and answer the phone!", "rating": 3}, {"title": "Easy to work with", "text": "Easy to work with; but relentless until purchase is finished.", "rating": 3}, {"title": "I really need the bond updated today", "text": "Date of experience: August 13, 2021", "rating": 3}, {"title": "Very prompt with their services...", "text": "Date of experience: July 22, 2021", "rating": 3}, {"title": "Great responses when asking questions", "text": "Date of experience: July 24, 2018", "rating": 3}, {"title": "Good stuff.", "text": "Date of experience: November 20, 2023", "rating": 3}, {"title": "It was fast and easy to do.", "text": "Date of experience: February 22, 2020", "rating": 3}]