[{"title": "I wanted to get the 0 for 24 months…", "text": "I wanted to get the 0 for 24 months financing but was not able to because o am retired and had no monthly income. Even though I own my own house and have plenty money in the bank. Also, we were overcharged. My wife noticed it on the way home. Had to go back and get a credit of 102.00. A bit of an inconvenience. ", "rating": 3}, {"title": "Did not include the hardware for our…", "text": "Did not include the hardware for our couch so now we are having to wait another week to be able to put it together 😭", "rating": 3}, {"title": "The TV advertisements are misleading", "text": "The TV advertisements are misleading on choosing your own fabric for no extra cost. I went in thinking I would find a plethora of fabrics when there was only 20 colors to choose from. I thought I would find hundreds of selections such as Lazy Boy. ", "rating": 3}, {"title": "Good options and fast delivery but bad customer service", "text": "Store has good options for the beds and most of the beds are available within a week with flat $109 delivery. I visited Allen store and I found the associate working there are very inexperienced and don't know how to talk to customer. They are selling warranty but don't know where it's mentioned in the contract and not even clear about the terms and conditions and provided wrong info. After going over the contract I found out that if you don't use Warranty then that money will be refunded but you have something regular priced and greater than $299. Associate manager is not polite when I went to remove warranty from the purchased furniture. It can be done on phone but they unnecessarily called me to come to store and then said now we will do on phone and on top of that being rude. Bed I received has few drawers not closing properly but I am already done talking to store.Is there a way so that somebody can come at look at these drawers? I mentioned this issue when item was delivered and thought it will be fine after using but these drawers are very hard to open and looks to me some alignment issue. Let me know if somebody can come and help to see what's the problem.", "rating": 3}, {"title": "Too long for repairs", "text": "It has taken way too long to fix the motor on the couch. A new replacement couch should have been offered.", "rating": 3}, {"title": "The furniture was good but the service…", "text": "The furniture was good but the service was subpar. Drivers showed up on time for first appointment but some of the hardware and a piece of furniture was missing. The drivers went back to the local store and picked up missing pieces and returned to install. Once installed and now probably running late to other appointments they did not allow my wife to look over installation and make sure placement of furniture was okay. They rushed out the door without any post installation inspection. ", "rating": 3}, {"title": "Two dressers on my nightstand were…", "text": "Two dressers on my nightstand were broken, which was an inconvenience. The dresser is being replaced, but if I didn't check before the drivers left, it would have been even more disappointing.", "rating": 3}, {"title": "Quick assembly done but need more detailed work.", "text": "Quick assembly done. However, assembler left couple table legs somewhat loose and I had to tighten with my tools. ", "rating": 3}, {"title": "Love the furniture, but was told one thing and delivered something else", "text": "Love the furniture, but was told the full coich reclined only for it to arrive and only the ends recline.  We asked at least 4 times to confirm the middle seat reclined and was told it did by Maria. I guess the positive thing is we were charged less for non recline", "rating": 3}, {"title": "I enjoyed the prices and the quality of…", "text": "I enjoyed the prices and the quality of the products. The selection is really nice and the buyer has selected some great pieces. The application process for credit/financing needs to be fully understood by the staff. We were under the impression that the payment method was set with the store with a balance paid off over time. I have a hard pull now on my credit for something that appears to be structured more like a credit card than a line of credit with the vendor. It would have been nice to have a full understanding as I would have eventually just paid cash. ", "rating": 3}, {"title": "Home zone pick up of defective dresser", "text": "Home zone came out at the time scheduled, picked up my defective dresser to take back to the warehouse and work on fixing the top right drawer that doesn't open without pulling it a few times. They initially tried to fix it when I purchased it months ago and left it as it was stating that once things settled in it should open correctly. They sent someone out last week to try and fix it again but still having the same issue and to add to that b4 pick up I wiped it using pledge and a Microsoft towel and the paint began coming off. I called and asked if I needed a special cleaner and they Said no but resurfacing wasn't covered under my platinum warranty. Scratching My head right now wishing I could return the whole bedroom set and be done with them!!!!!!", "rating": 3}, {"title": "HOME ZONE—NO ZONE!!", "text": "My wife and I visited 2 Home Zone stores last weekend, looking for a leather sectional sofa. While HZ had a few choices, the lack of quality and design was evident. But that was secondary to the lack of service. I am aware that good help is hard to find, but this was bottom of the barrel. Absolutely no effort and a care-less attitude describes the HZ employees. I would be frightened to buy furniture from HZ. If the sales people are so incompetent, I can only imagine what their delivery people would be. It’s obvious that HZ needs managerial help. We eventually went to a quality furniture store and made our purchase.", "rating": 3}, {"title": "We paid $100 to have furniture…", "text": "We paid $100 to have furniture delivered only to have one of the chairs broken. Delivery guts were in a hurry and gave us no tkme to inspect. Had to drive to NRH to exchange to avoid taking off work again. No offer to refund delivery fees or a thing. A real inconvenience for us, but oh well. Thanks", "rating": 3}, {"title": "Backorder", "text": "I bought two couches in April, to be delivered June 20th.  I’ve checked several times on order always told it’s on track. Last commutation was June 10th, statedThat it could maybe come in early … the 15th at 5:40 , 5 days before delivery they call and now it will be July. After several calls , the regional manager found a solution .  He was very helpfulWaiting 2-3 months on furniture is too long in my opinion. But I’m ok with solution and I appreciate him stepping in and helping ", "rating": 3}, {"title": "I was expecting a direct follow-up via…", "text": "I was expecting a direct follow-up via phone call but got nothing except for this impersonal survey that goes nowhere. I also expected a manual, or handout explaining how to care for the furniture, move, etc. ", "rating": 3}, {"title": "Inconvenient process to get the item", "text": "The salesperson was very helpful. However, having to make a second trip into town (45 miles each way) to pick up the item at another store is very inconvenient and time consuming. We probably will not shop at Home Zone again.", "rating": 3}, {"title": "I understand no pressure sales  but…", "text": "I understand no pressure sales  but none of the sales people even attempted to help me after seeing me walk around for 20 minutes .. once I decided on my item, the young lady started processing my order but then her food order came in, she asked me to wait as she walked to get her food then disappeared for what felt like 10 minutes.. I decided not to purchase there and went to another furniture store to purchase the sectional I wanted ", "rating": 3}, {"title": "Our experience was disappointing ", "text": "Our experience was all awesome until they delivered the wrong product. My wife took two employees with her to purchase the dinning table she wanted. Somehow they still entered it wrong in the system as a coffee and that’s what was delivered. Also we purchased a couch set and two of the pieces were damaged. It’s not the store fault it’s damaged but hey. The coffee table is definitely their fault. ", "rating": 3}, {"title": "\"Quality Control is Not a Priority\"", "text": "1) One of the plug connectors at the back of the couch has the wrong \"secure tabs\" so it is constantly coming unplugged from the main wire to the wall. It would be nice if someone could mail me the correct tab.2) The slide out part of the end-table was installed upside down. I spent about 30 min fixing this.I found both these issues about 2 minutes after the delivery guys left. They should have been noticed.", "rating": 3}, {"title": "Make sure all staff have correct info", "text": "This is my second purchase with this store. I was a little disappointed that the sales person gave me incorrect information. When I returned to make purchase I was advised it was incorrect info and there wouldn't be anything that could be done. To avoid in the future ensure all employees have correct information.", "rating": 3}, {"title": "Customer service has been kind and…", "text": "Customer service has been kind and helpful but a few things have been a bit inconvenient. First delivery was over an hour late passed the 4 hour window I was given. Then the bed frame I ordered was not constructed properly and had issues that it had to be replaced. Second delivery for the replacement had similar issues so there has to be third visit for a tech to review the furniture piece.", "rating": 3}, {"title": "My sales person", "text": "My sales person.  She kept watching another couple and they interrupted us when I am trying to buy a table and chairs. Totally unprofessional.  ", "rating": 3}, {"title": "The customer service was excellent", "text": "The customer service was excellent. The quality of the furniture we bought was more than we expected. My only complaint is we have to wait on our dresser. You didn't have it in stock, and that I feel shouldn't happen when your sales pitch is you build locally. ", "rating": 3}, {"title": "The quality of furniture is…", "text": "The quality of furniture is superb....the customer service from my salesperson was also superb, HOWEVER, her knowledge of the 120 days same as cash leasing option was lacking. To explain further, when I inquired as to when my first payment would be due, I was informed one month from the date I receive my furniture. In actuality, my first payment is due less than 2 weeks from when I picked up my furniture. (Picked up on 9th...1st payment 22nd). When I notified customer service I was advised this could not be changed. For future use, the sales persons should be made aware of leasing practices/policies.", "rating": 3}, {"title": "In the last month I have bought a…", "text": "In the last month I have bought a dining room Table. chairs and sectional couch. Both times when I went to pick items up. They both were damaged in one way or another. I recieved a discount on both for this. The table did have to get a new base. Both times I had to return to the store.", "rating": 3}, {"title": "Good but not great", "text": "We have bought many of pieces of furniture from this location and staff is always friendly and helpful. With that being said we have never had an issue with anything until this experience. When we unboxed our furniture it made our entire home smell like marijuana. The smell lasted two days with windows open. I am unsure if was the employees there or from main warehouse but unacceptable.", "rating": 3}, {"title": "They sale Furniture. No quality control", "text": "Sales reps were nice friendly. Typical pushing you to buy the most expensive pieces in the store and not paying attention to who had what client as they were only out for the kill. Typical but pleasant. Furniture arrived quickly and deliver t was better good. Pleasant and set up wherever you chose.  Their are quality issues with the furniture as with stitching and unlabeled legs on the furniture. Unfortunate as it will require replacing.", "rating": 3}, {"title": "The service was great the first day", "text": "The service was great while we were there the first day getting our bedroom picked out and filling out paperwork. However, when we went to sign final paperwork and make our part of the payment we felt like we were being rushed through the process.  This was not the same person who helped us the first day. ", "rating": 3}, {"title": "Stereotype ", "text": "The level of service was not as expected. We were greeted by Alic and that was all. It wasn’t until we found peace that we wanted and was then followed until the end of the sale.  They should perhaps treat everyone as a buyer. Because where they focused their attention they didn’t purchase anything. Their spill is they aren’t commissioned but I can’t tell. ", "rating": 3}, {"title": "Bland customer service", "text": "Service was standard. Nothing was wrong. But it wasn’t superb like other times I’ve been to other home zones. At other home zone that I’ve visited, it always felt like family. The sales person was always eager to show me options. At this location it was the opposite.", "rating": 3}, {"title": "Pros and cons…", "text": "I liked the fact that I got updates throughout the day to know where the driver was. I did not like the fact that they complained about the positioning of the bed and then set it up where one could not even get out of the bed so we had to undo everything and move it. Also we had to direct them on how to get the piece down the hall as they were trying to ramrod it through a doorway. ", "rating": 3}, {"title": "Husband and I didn't get greeted or…", "text": "Husband and I didn't get greeted or asked if we needed help until we walked up and said e were ready to purchase. They process was quick and easy and the salesman was friendly once we got his attention. I've had better experiences at different locations.", "rating": 3}, {"title": "We have always liked Home Zone and have…", "text": "We have always liked Home Zone and have made many purchases over the years & still like the furniture.  We just purchased a Port Author recliner & loveseat which are both electronic for reclining purposes. We picked up our items to take home. But when the Mgr and loader both helped load our items they turned our loveseat completely flat on its side arm on the ground to stand it straight up& down which I totally disagree with b/c of the tracks & electronics on the furniture that can be bent off track. Now we have a problem with that side recliner & its track.  They need to move furniture correctly.", "rating": 3}, {"title": "I feel like the sale person wasn't…", "text": "I feel like the sale person wasn't correct on the sale He told us about and did not tell us the correct life span on the bed bass we bought. When we went back the manager and another worker were great and very knowledgble.", "rating": 3}, {"title": "I like that I was greeted as I walked…", "text": "I like that I was greeted as I walked in and given the chance to walk around and look, but after I said I had made my choice and I was ready, three other customers were placed before me making my time in the store last two and a half hours. I feel that as fast as I made my selection that I should have been out of the store within a hour. The other customers who walked up after me should have been given to someone else or asked to wait until they were finished with me.", "rating": 3}, {"title": "Did not like to idea of the cashier…", "text": "Did not like to idea of the cashier Jesse, asking for my credit card to manually enter.  Concerned I asked him why I could not enter the credit card into the card reader, his response\" I only have to enter four numbers\". I was not comfortable because he had access to my credit card number and the security code on back. Otherwise this could have been an amazing experience.", "rating": 3}, {"title": "Mixed Feelings", "text": "Update: Excellent customer service! I received a response and solution within the hour. Thank you Home Zone! ~~~~~~~~~~~~~~~~~~~~~~I liked the delivery process and their service. I did not like that the piece I originally wanted went on sale right after my purchase(2 days). I specifically asked about the chair and was told it wouldn’t be included in the upcoming sale so I purchased the sofa and loveseat which are really big in my home. I wanted sofa and chair. The associate should have contacted me since the delivery was scheduled days out.", "rating": 3}, {"title": "Customer service was great", "text": "Customer service was great. Although I bought a clearance item for half off bringing it to $2000. The store/sales person never told me that it was defective.Until I got the merchandise home I found out that the door was defective.  I would have never bought the product if I knew that it had a major defective piece. I felt there may have been some deceptive sale practice if sales person knew about it.", "rating": 3}, {"title": "Checkout was not good", "text": "Did not like that checkout took almost an hour! Salesman was nice and gave me water, soda and an ice cream. Upon transaction input it came up declined! I did not have a balance but the customer service representative said she needed to update my address. We did that 3 x’s. Finally after about an hour we finally got it DONE! Very frustrating that the salesman could not get quick help!!!", "rating": 3}, {"title": "Delivery was smooth and early", "text": "Delivery was smooth and early. I did not like the experience in the store as the sales rep left without saying anything and left me and my family sitting there. When asked to speak to manager another sales rep declined to allow me to do so. I was not explained prior that there was a $25 reschedule of delivery especially since I told the sales agent I reside in another state and have to make arrangements for someone to be there. Delivery schedules are a week or so out, expected sooner. I paid in cash and I asked if there was a cash fee discount versus finance fee and was told no.", "rating": 3}, {"title": "Better transparency about delivery", "text": "Sales experience was positive - appreciate that we were left alone to browse. However the delivery process was not what we were told. The delivery drivers shut the door behind them and were in the truck before we were able to sit on the new couch. Thus, we were not able to confirm it all worked appropriately before they were driving away. We had no chance to refuse the delivery as we were told we would.", "rating": 3}, {"title": "Wanted to purchase an item", "text": "Wanted to purchase an item. The Mgr. Said it was put of stock and I could order and pay in full for it but it may be in October or could be November or December for delivery and they couldn't guarantee that it might get discontinued then they'd refund my money. They also wouldn't let me purchase the floor model, they said it was reserved but I found out (from a other store) that there was no reserve on it in the computer.", "rating": 3}, {"title": "overall sales experience was good", "text": "overall sales experience was good, didn't like the fact that measurements aren't available for all products, that's kind of important when purchasing a full bedroom set, picked up later on a Saturday, got home, unloaded, and 2 of the 5 boxes were wrong, and 1 was heavily damaged, tried calling at 7:50pm and went straight yo voice-mail, so had to reassemble our old bed so we could sleep that night. Finally got to get the correct boxes at 1pm Sunday afternoon. Still haven't heard anything back on the damaged stuff arriving at the store", "rating": 3}, {"title": "some furniture is made cheap", "text": "The day I closed on my new home in March of 2020, I went to Home Zone at the recommendation of a coworker. I purchased my bedroom set, incl an adjustable mattress (which I absolutely LOVE!) dining room set, an extra dresser for another bedroom. The shopping experience was FUN for me!!! However, after a yr my dining room chairs started losing nails & falling apart. Cheap workmanship. On one of my nightstands, a part came loose & I cannot get to it without taking the backing off. The bottom drawer scrapes as I open or close it. I tried contacting customer service but no one called me back. I did not purchase a warranty now I realize I should have. I figured they stand behind their products. Still cannot get ahold of anyone. I guess Im screwed until the whole thing falls apart. I will not buy any more furniture from them. I give the experience a 5, but I give the quality a 3. Buy a warranty!!!", "rating": 3}, {"title": "Improve your furniture and stop getting…", "text": "Improve your furniture and stop getting over people knowing it's cheap and charging high prices I'm bringing what I purchased back", "rating": 3}, {"title": "All was good until actual in-home set…", "text": "All was good until actual in-home set up. The King frame is crooked  so the side drawers will not go in properly. The driver, Miguel, told me he was sending a request for a technician to come assess/fix the problem Have not heard anything yet. I believe the reason for this is the rush set up. Instead of the 2-man team completing the king assembly, they split and Miguel started the queen assembly, each working separately in separate rooms. Miguel was then unable to correct the problem. I am unable to use the drawers at this time. Please review and get this problem fixed ASAP so I can finish what I need to do. Thank you.", "rating": 3}, {"title": "Damaged Furniture = Should Be Rendered Used Furniture Prices", "text": "Furniture damaged in shipment.  I had traveled 2 hours to pick this up on time. They offered me a 10% discount. (Damage makes it look used, 10% was a slap in the face.) We all know the history on how high furniture is marked up.I had told the manager that “handled” this issue to understand that it has taken time off of my job, plus fuel.(I’m getting this later than I had planned, and they’re delivering late for free.) The manager was rude, and treated us like our purchase meant nothing.*I should have known something was off when the piece I ordered on the showroom floor had damage to the rear tip of the chair. The upholstery sewing or glue was coming undone.", "rating": 3}, {"title": "Wrong Item Delivered", "text": "The carpet that was delivered was not the carpet I picked out in the store and I do not have the ability to bring it back in exchange for the correct one.  Everything else was fine with the delivery", "rating": 3}, {"title": "When I was shopping for a dining set I…", "text": "When I was shopping for a dining set I asked about the counter height version of the set I ultimately purchased and was told that it was no longer is stock. Today when the table was delivered and the drivers were setting it up they asked if I wanted it to be counter or dining height. I would have probably purchased the counter height chairs versus the dining height. Not a huge deal but a bit disappointing. Otherwise the furniture is beautiful and I look forward to using it.", "rating": 3}, {"title": "Co. fine but can get better", "text": "Company fine but it's take to long for anyone to finally get my part and still haven't got but its paid for said they send it on next truck but also no keeps you posted or updated", "rating": 3}, {"title": "Delivery service", "text": "Delivery serviceI was told I would receive a call when the driver was in route to my location.  That did not happen they just showed up. I had to call the store so they could explain to the driver they had to wait because they had not called before arrival.  The person from the store acted like it was my fault that the driver didn't call or text before arrival.  The driver didn't speak English so I couldn't communicate with him at all. After I spoke with the store manager she sent a text that said the driver will be at my house in 15 minutes.  They were already outside my house no apology from the manager at all.  Bad customer service. ", "rating": 3}, {"title": "Customer service was amazing!", "text": "Our customer service and the friendliness of the staff was absolutely top notch. Sabion was awesome and helped me with all of my needs and engaged in friendly chit chat. The reason for the three stars is due to 2 of our items showing up damaged.", "rating": 3}, {"title": "The two locations have poor communication with each other …", "text": "I was told to go to Richardson location to pick up my order after some time with staff in Allen, too long.  Then I arrive at Richardson location and told it is out of stock.  They took care of me in Richardson by selling me a floor sample with a discount. ", "rating": 3}, {"title": "The experience would have been rated…", "text": "The experience would have been rated higher if they would have delivered any of the floor models if the storeroom was out of stock. This caused undue delay in enjoying the product at home sooner since I had to ask friend(s) in assisting to return to the store and help unload.", "rating": 3}, {"title": "Have a long history of purchasing alot…", "text": "Have a long history of purchasing alot of furniture with your company. We would buy and pay it off within a few months every time.we tried to purchase a new living room set over the weekend with the 36 month no itrest offer. At the time of submitting our purchase the  gentleman told us the credit card was inactive and my wife had to call to get it activated. My wife was on the phone with the finance people for over 30 minutes while at your store. The person could not find our account or would let my wife speak with a supervisor. We did not want to wait any longer so we just purchased the furniture with our cc.Really disappointed and frustrated after we have had so much history with you. Thank you.", "rating": 3}, {"title": "Cheap Price, but Poor Quality", "text": "Bought a nightstand. Drawers don’t line up and bottom wood (that no one can see) is cracked. Sad to see it is made in Vietnam. I bought this because it fit specific dimensions and Cheap Price, but Poor Quality.  No way I would pay regular price for this.", "rating": 3}, {"title": "Consistent chest of drawer issues", "text": "I used to always recommend Home Zone because they had good quality furniture for the price. My living room, kitchen, media room, bedroom and couch in our office all came from Homezone however, the last 2 orders have had issues. Our kitchen table chairs had missing screws and a seat base that was crooked. After attempting a repair they did replace it and did install the missing screws. But most recently we purchased the Florence bedroom set with the chest of drawers added. First off, one night stand was damaged, the footboard was damaged, and the chest of drawers were damaged. The footboard was replaced without issue, the nightstand was replaced but it had a crack in it that had to be glued together and the finish on one side looks like it was not properly done and someone just spray painted it. Decided to live with it and not risk another one with more issues. The replacement dresser however was delivered with rails falling down inside and warped drawer faces. It was replaced again and this third dresser has no visible damage but one drawer doesn’t close fully on one side but rather than risk a 4th one having more issues will probably just live with it. The second one had the similar issue with crooked drawers and the repair tech couldn’t resolve it. Also one of the rails inside that holds the slide was again falling down due to cheap staples being used but I put a wood screw in myself to fix it.  It’s a shame because it is nice looking furniture.", "rating": 3}, {"title": "The ALOMST got five stars until......", "text": "I really enjoyed that when i told that lady that i know what i want and didnt need help, she left me alone!  she did offer to help if needed still and that was appreciated. Everything was really nice. The only reason that I am giving this low of a rating is because after going over my contract, the delivery and set up was added with me even being asked. THANK GOD i read over it knew about it because I had completed an application before at this store. I brought it up and she apologized but said I would have to go pick it up in Richardson if I  didnt get it with them. That was my choice, but It wasnt offered as an option. She apologized again after i expressed my concern and we moved on (i went ahead and got it).", "rating": 3}, {"title": "Price change", "text": "Everyone was super nice from the moment we walked in. We ended up making a purchase for a love seat that was on sale ($799). After we did the paperwork, I saw that my receipt read ($999). I asked the salesman about the price and he said the color option would make it more. (He never mentioned any of that while we talked about the couch). We are scheduled to pick up the sofa tomorrow but we are not too convinced to get it afterall.", "rating": 3}, {"title": "Good customer service/ check product", "text": "We bought a sofa/bed last week. The customer service was perfect! However, when we brought the sofa home we noticed a back wooden piece of the couch was broken. Check product before taking home. ", "rating": 3}, {"title": "Devalued", "text": "A couple of weeks ago I visited the store, spoke to some lady regarding store credit for the unused insurance I had on my previous couch. I was told that I was shy from the three year, but they will still honor the store discount since I am only three months away from being eligible. I informed the associate I would think about it and get back with them because I could decide which couch I wanted. I came in to purchase a couch this week. When purchasing I mentioned the store credit, the associates didn’t believe me. So they called all the female associates to find out if I was telling the truth or not. I understand they needed to be sure but, as a client that made me feel like a liar and my word wasn’t valued. They did honor it eventually but I just felt like a criminal or something.", "rating": 3}, {"title": "Wrong colored chairs delivered", "text": "I wanted to buy chairs that matched the couch i had purchased here years before. You no longer carried the set I bought but  I let one of the associates choose a color that would match mine using my purchase history. When it was delivered, it was not even close. I need a darker set.", "rating": 3}, {"title": "Not worth the hassle", "text": "Salesclerk was very knowledgeable and helpful. Delivery guys were very courteous and efficient and set up our new bed and mattress quickly. What upsets me is this store policy that delivery guys can’t haul away old mattress, something that used to be standard for a fee, or even simply move it to another location in the house. I would have been happy to tip them generously to do that. But instead a company policy has put an end to that. I had to strong arm it myself out to our back porch, and I’m getting old enough it’s not so easy for me any more. And now I’m stuck with this eyesore of an old mattress out on my back porch, and I’m going to have to pay someone considerably more to haul it off.we’re in the market for a new living room set, but I think we’ll take our business elsewhere.", "rating": 3}, {"title": "Salesperson gave us the wrong chair-was…", "text": "Salesperson gave us the wrong chair-was to be solid blue and she rang up the pattern. Wife didn’t catch until it was unpackaged and put in the house.  Just kept it-too much of hassle to change out.", "rating": 3}, {"title": "Kinda good service ", "text": "On Friday I was told that they would be able to deliver then when I went in on Saturday the whole thing changed and they weren't able to deliver and it took me hours to find someone to do it. ", "rating": 3}, {"title": "Our sells person Daisy was amazing!!!", "text": "Our sells person Daisy was amazing!!!! She made the process very smooth and answered any questions we had. It is the delivery experience I have a problem with. There was property damage done to our front door frame.", "rating": 3}, {"title": "Customer service", "text": "Customer service is a big pointer in the sales industry and I just feel as though maybe some of the employees should work on their customer service. It could have went better.", "rating": 3}, {"title": "The mattress we bought were not the…", "text": "The mattress we bought were not the same ones what we got at the store. Not good business practice . You were not open on 4 july will try ag2ain  july 5 to get this resloved. Problem fixed thank you!😃", "rating": 3}, {"title": "Pick up location", "text": "I don’t like that. I had a lot going all the way to Richards in to pick up a package that you could’ve sent to any store and I could’ve picked it up closer to home. I never got to inspect the chairs because they were in a box, it states that they would unpack it look at it and then pack it back up.", "rating": 3}, {"title": "Destiny in store was great", "text": "Destiny in store was great.  Delivery went fine but was very impersonal and I had to move my table in place.  Also, all my updates were given via email and not text as I was told they would be.  I didn't get a text until the delivery men were in front of my house!!  Quite a surprise.", "rating": 3}, {"title": "We weren't really explain the financing…", "text": "We weren't really explain the financing options. I asked about a great seat/chair and was not given info nor asked if I wanted to purchase it until I said I want to buy it!", "rating": 3}, {"title": "The worker failed to cut the ties on…", "text": "The worker failed to cut the ties on one of the recliners,’so when I did so it flew into my face just missing my eye. Other people Han that they were very good and personable", "rating": 3}, {"title": "I went to the 3040 location to get a…", "text": "I went to the 3040 location to get a bedframe. It took her 45 minutes to call the other store just to find out if they had a king size bed frame. When I went to your Valley Ridge location I paid for a king size bed frame they sent me home with a full size bed frame.", "rating": 3}, {"title": "Service was excellent repairs not ", "text": "Service and delivery were excellent. The issues we had were not fixed though. The couch still creeks very loudly. It’s embarrassing when company is here. This is the second time it was sent to get it fixed.", "rating": 3}, {"title": "Mixed Review", "text": "The show room and sales staff in Lake Worth were good. Pick up of the furniture was horrible. They gave us the wrong parts and a part was broken. They corrected the problem same day, but this type of mix up is unacceptable.", "rating": 3}, {"title": "No way to save money at Home Zone", "text": "The customer service is great. I dislike having to pay the delivery fee on the last recliner I purchase. I ask if the recliner could be shipped to the Denton store and I would pickup and deliver to my Dad saving me $109.00. But was told no way , no how. I feel like I was robbed of the $109.00", "rating": 3}, {"title": "Your personnel at the Cedar Hill store…", "text": "Your personnel at the Cedar Hill store are AwesomeYour store really went out of his way to accommodate usMaria  Kubankin was helpful too.  But the young manager  was the bestyour store practices of posting an item on sale ANDnot being able to sell it... Sinks  is like bait and switchIf you have on the sales floor an item on sale and not willing to sell it...why have it on the sales floorwe purchase a complete living room set from you before approx  over $3,000.  and we spent $1,682.21  on June 29thBUT I don't believe we will be back any time soon.", "rating": 3}, {"title": "Process of delivery was too complicated…", "text": "Process of delivery was too complicated and expensive. Would rather have it delivered to the store and picked up. Return was to a place an hour away???", "rating": 3}, {"title": "Great team @ store. Failure in the delivery logistics", "text": "The team at the store was great. However, the delivery window was between 1:30pm - 5:30pm and I received a call at 2:24pm to let me know that it was going to be closer to 5:30pm, and MAYBE a few minutes after 5:30pm. As of 5:46pm, I have not received my purchase. I called and was told that it looks to be about 6:30pm now. I didn’t receive a call for that. It’s ridiculous to have given a window of 1:30 to 5:30 and have someone miss work and completely miss the 4-hr window. I can understand a delivery into the latter part of the window, but I was told on the phone that the delivery may be an hr and a half after the 5:30 mark. Ridiculous. AND! I expect compensation. I missed work for this time frame. I still can’t leave my home NOW.", "rating": 3}, {"title": "Great store but poor phone customer service. ", "text": "Let me start by saying the staff in the Burleson store are incredibly helpful and went above and beyond in moving things around to ensure all the colors matched. They also helped us with the best price we could get on the 2 couches and 3 tables and rug we purchased for our living room. Unfortunately the story only gets worse from there. The furniture arrived promptly when expected, however one of the couches was marked and messed up in multiple areas. It appeared it was either used or just poorly overlooked. The coffee table also had a board reversed on it showing the nail holes on just one board when it shouldn’t have been. There was also a gap in parts of the wood that we were told on the phone shouldn’t be there. After calling customer service and discussing it with them, they arranged for the defective pieces to be replaced. When the new couch arrived, it was in much better condition, and the table had all the boards the right direction this time. Unfortunately it still had the gap in the wood. We also noticed after comparing the new couch to the original couch that wasn’t replaced that the arms were a different shape. The new arms were straight, and the original couches arms slanted. The stitching on the original couch also had uneven stitching. I know that it can come across as not picking, however when you spend over 5k on something you tend to expect a certain level of quality and quality control. This entered us into about a week long game of phone tag with customer service in which ultimately they didn’t want to swap anything out any more, but also were initially going to charge us a 20% restocking fee. After discussing further with customer service they finally said that they couldn’t really process the return and refund, and we would have to go to the store. Luckily, Jesse, the manager on duty, was fantastic. When we came into the store I’m sure he could feel the frustration oozing off of us after the customer service run around. He helped us through the process and arranged for everything to get picked up and refunded. We were out the delivery fee, but that is far and beyond better than 20%. All said and done, is the main reason I’m going with 3 stars. 5 stars for the local store and the staff. 1 star for the phone customer service and the quality control on this new line of furniture. ", "rating": 3}, {"title": "Disappointed having an item on floor…", "text": "Disappointed having an item on floor which was not tagged and been sold.  Otherwise everything went well", "rating": 3}, {"title": "I liked about the selection and the… the customer service when you first walk in in the free drinks and ice cream that put a smile on my face", "text": "I liked about the selection and the customer service at the beginning but once you’re there they are so busy that they have to multitask so I think they need to get more help", "rating": 3}, {"title": "Damaged chair", "text": "I recently ordered from this store and was extremely disappointed with the delivery process. When my package arrived, it was obvious that it had been mishandled during shipping as it was severely damaged. The contents inside were also damaged, which was especially frustrating as I had purchased a gift for a friend.I contacted the store's customer service team to report the issue and request a replacement or refund. The team was helpful and apologetic, but it took an extra day for them to process my request and send out a new chair. In the end, I did receive a replacement, but the entire process was inconvenient and added extra stress to my already busy schedule.Overall, I was disappointed with the store's delivery process and the damage to my package. While the customer service team was helpful in resolving the issue, it was still a frustrating experience. I'm not sure if I will be shopping with this store again in the future.", "rating": 3}, {"title": "Not a good experience …", "text": "Not very good furniture have had alot of problems with homzone but they did restuff my cushions but has been a bad experience all the way around", "rating": 3}, {"title": "Because there were people wating store…", "text": "Because there were people wating store to open at 9 am because some consumers srivers said be open where not on till 10am not having enoff enventory at the store n had to wait for ship 7 to 10 later for what we bought not the frist time this happened love the furniture but the service need help made to many excuses", "rating": 3}, {"title": "This company is doing very well…", "text": "This company is doing very well continue to do what you doing", "rating": 3}, {"title": "Good delivery people, Defective dresser", "text": "I have recived a defective dresser. I am still awaiting the replacement and customer service on it. Will update review based on my next experience.", "rating": 3}, {"title": "I had to tell salesman  what I wanted…", "text": "I had to tell salesman  what I wanted to see. He just wasn't very helpful.  I told him I wanted 2 recliners. But I have to wait until Friday to get them.", "rating": 3}, {"title": "one section (Middle) furniture…", "text": "one section (Middle) furniture defective. does not connect to next section. Reported the problem to delivery people for replace that section.", "rating": 3}, {"title": "The person I worked with was friendly…", "text": "The person I worked with was friendly but was new tothe company. He apologized for the delay. I am hopingthat the item I ordered will be in stock sooner than later.", "rating": 3}, {"title": "Make sure all products have a price tag…", "text": "Make sure all products have a price tag on them. I was unable to make a payment on my furniture, due to synchrony bank holds my account.", "rating": 3}, {"title": "Poor sales", "text": "Marketing advertises discount to military veterans but it only applies to certain dollar amount and didn’t apply to clearance items. Very disappointed in the exclusions for veterans discount. Will probably not be back", "rating": 3}, {"title": "The service was horrible i would never…", "text": "The service was horrible i would never go back to this particular area again.The sales person doesnt know what they are selling gave me false information about a table then later said they didnt have it after i paid for it.Then i waited for 36mins for an update on change of address .The service was terrible with no apologies.I had rather drive to dallas or arlington.", "rating": 3}, {"title": "Quality", "text": "Do not tell people the furniture is made in Texas when it is made in Vietnam, not cool.", "rating": 3}, {"title": "People are very friendly and don’t push you to buy", "text": "This place is great, good prices, helpful and friendly staff!  Ash was a pleasure to work with.", "rating": 3}, {"title": "The tech was giving the wrong size to…", "text": "The tech was giving the wrong size to repair Cabinet now I have to wait longer to use my new cabinet", "rating": 3}, {"title": "Not as comfortable as display chair", "text": "Not as comfortable as display chair - cushion feels like sitting on rock", "rating": 3}, {"title": "The gentleman that came to the home…", "text": "The gentleman that came to the home were nice and respectful. The table was built efficiently.", "rating": 3}, {"title": "Delivery service not soon good", "text": "The day of the delivery it was 2 guys in charge, one of them really nice person and polite, but the other one he was rude and make my wife feel disappointed, the experience with the store and the customer service great as always but once again just like the last time, delivery not so well .", "rating": 3}, {"title": "They told us we could pick up our…", "text": "They told us we could pick up our furniture on Sunday drove 30 min only to be told no pickup on Sunday", "rating": 3}, {"title": "I paid for the merchandise but could…", "text": "I paid for the merchandise but could not take it home and I bought the display ", "rating": 3}, {"title": "Not the best experience", "text": "Paid for my furniture with a check and they ran it through twice. Took about 3 weeks to get  $1800.00+ back then drove 2hrs to pick up furniture and couch was wrong color. The next week they got the correct couch and delivered it and the upholstery was torn. Waiting on the couch still.", "rating": 3}, {"title": "\"Home Zone Furniture: A Three-Star Adventure\"", "text": "I recently visited Home Zone Furniture and had a mixed experience, resulting in a three-star rating. Initially, the salesperson was enthusiastic and friendly, but their attitude shifted during the order finalization when we opted for pick up instead of delivery. They seemed unhappy with our choice and insisted on delivery. Additionally, the warehouse staff opened the box to inspect the furniture we purchased, but unfortunately, one of them removed the instructions, causing confusion during installation. Despite these issues, the overall experience was satisfactory, warranting a three-star rating.", "rating": 3}, {"title": "repairs of piece of furniture", "text": "The back cushion was repaired along with mechanics but the bottom cushion was not touched.  Very disappointing.", "rating": 3}, {"title": "Movers were very quick in and out", "text": "Movers were very quick in and out. But didn’t care too much to see if anything was broken or wait to see that everything works.", "rating": 3}, {"title": "Company Warranties", "text": "Our shopping experience was very good. The people were nice and friendly. Our purchase included the twin xl home zone bed plus a head and footboard. Fairly large purchase money wise. Your bed had a 15 yr. Warranty and head board/footboard a 1 yr warranty. When we checked out, no warranty paperwork was presented to us for either item. When we asked, we were told our manager could get us a copy “the next day”. We inquired as to what was covered and never got a clear message as to the actual coverage. Well, from a buyer perspective, that is not good. It leaves to much guesswork as to what will be covered if a problem is encountered. We have purchased service agreements, high ticket items, with warranties, and always got a copy and the sales associate covered in detail what was covered and what was not. You buy a car and you leave the dealership with warranty in hand. You buy a service agreement and you have what is covered once you sign the agreement.I went to the BBB website. 34 complaints in 3years, 6 more within the past year. Way too many in a short period of time. Many of the complaints were lack of support of company warranties and way too much back and forth with customers about what will be repaired, fixed, or replaced. “If you offer warranties and are proud of your merchandise, put it in writing, put it in the customers hands, then explain it if necessary.”You have a nice store. It’s a shame to leave such a huge question ? in the customers mind. The only documentation we received that the bed had a warranty was one of the managers signed our receipt and wrote “15 yr warranty” on the receipt. What if he is no longer employed there in two years, then what? Who will support his signature and we have no paperwork to give the store. Then what happens???“The company needs to fix this or you will not be in business very long”. We returned to the store and requested a credit on the merchandise which we received. We did not discuss with the sales associate this was the reason for the return. We simply said we changed our mind and we had other obligations that made this an untimely purchase. Now you know the true reason.", "rating": 3}, {"title": "I don't  know if  the price increase is…", "text": "I don't  know if  the price increase is anything you can control.  I feel like the prices have gone up too  much.", "rating": 3}, {"title": "It was ok but am changing my mind about…", "text": "It was ok, I think the added warranty is iffy and not so up front but we shall see", "rating": 3}, {"title": "I was pleased with the customer service…", "text": "I was pleased with the customer service but it is very important that when a application is being processed that all of the applicatant information provided is accurate and complete for the furniture store and finance company. This didn't happen and I was told by my sales rep that I had to contact the finance company to get my apartment number added. This is unacceptable and was provided and written on the original sales receipt.", "rating": 3}, {"title": "I would give 3 1/2 stars", "text": "I would give 3 1/2 stars. As much my fault as salesman. I really appreciate that you took the loveseat back after the recliner was postponed longer. But I selected a recliner and loveseat from different design. We even looked at prices together. And we went over paperwork together. But I did not notice he had put down sofa instead of the loveseat. So I received sofa. And cost about extra hundred dollars. Like I said as much my fault as his.", "rating": 3}, {"title": "Not helpful or attendant when I…", "text": "Not helpful or attendant when I arrived. Purchased a discontinued item on the floor, and didn't offer delivery.", "rating": 3}, {"title": "The initial in store ordering was great! BUT….", "text": "The initial ordering was great.  The pick up process was  stupid.  At the time of purchase we were told theres no need to bring in your sales receipt.  They only needed the phone number. WRONG!  The was told to drive around back to pick up our purchase. There was No signage where to pick up. The reason was “ we dont want to advertise where the back door is. Really?!?!  The door could have been ready and open if the sales person would have told them to open the back door and be ready for the customer at the unlabeled area!", "rating": 3}, {"title": "The area rug purchased smelled of…", "text": "The area rug purchased smelled of cigarette smoke.", "rating": 3}, {"title": "Assistant manager Bob needs more…", "text": "Assistant manager Bob needs more training on customer service. Otherwise everything is good.", "rating": 3}, {"title": "Stocking/delivery issues", "text": "The staff in store were very helpful. Our frustration/problems came later with delivery issues/items not being in stock. We bought pieces MONTHS in advance and then the day before delivery were told things were out of stock or discontinued. Delivery personnel were not very nice. They marked things that weren’t delivered as having been delivered. We ended up having to wait weeks to get everything (and had to pick new items) and we bought it all 5 months early in order to avoid that. I will say that the manager at the store did a great job trying to make everything right.", "rating": 3}, {"title": "I like all services and good quality…", "text": "I like all services and good quality and kindness", "rating": 3}, {"title": "When I received my furniture it was…", "text": "When I received my furniture it was damaged.", "rating": 3}, {"title": "Love your store and product", "text": "Love your store and product. I have spent a lot of money and bought a lot of furniture from ya'll. The staff is very nice. The only complaint I  have is the follow through or the promises. Communication lacks and it frustrates the customer.", "rating": 3}, {"title": "Could have been better", "text": "The salesman was not knowledgeable of competition mattresses such as Nectar and how the beds compare. Last time I bought a mattress the salesman was very knowledgeable and explained details very well. As of today, one week later, I have not heard anything about the status of my order. I have to go to the delivery link every day to see if it is ready. I am actually going to call and see what the status is since I have to find a way to get rid of my current bed the night before my new bed arrives. Would really appreciate about 1 week notice if possible. Customer service is not as important as I would think it would be with such an expensive item. Almost considered canceling.", "rating": 3}, {"title": "Second times a charm", "text": "At first we went in and found what we wanted but they were to busy to help us purchase it. There were only 3 customers in the store. Afyer 35 minutes of waiting we had to walk away from the sale. We came back a few days later after checking a few other stores and found that this was what we wanted. Second time was better. Over all I give the product a 5. Customer service I give a two. On the second go there was no helping we just told them what we want and where to deliver. Delivery I give a 5", "rating": 3}, {"title": "Wished that the phone line service was more deaf friendly", "text": "Wished that the phone line service before purchasing furniture was more deaf friendly. Brought my mom along to help me with any difficulties and you weren’t allowing her to speak for me. Kept requesting for my permission when I CANNOT hear anything through the phone at all. Just plain disrespectful to both me and my mother.", "rating": 3}, {"title": "Beautiful furniture except didn’t get a…", "text": "Beautiful furniture except didn’t get a box springs. Waiting till Friday to get to sleep on my new bed. Delivery driver not to nice, drives crazy. So fast the back of the truck sways with curves.", "rating": 3}, {"title": "My husband picked a product I would…", "text": "My husband picked a product I would have never picked", "rating": 3}, {"title": "loading dock personnal - sales lady", "text": "the sales person Stephanie was awesome when I went to the loading dock to get my table the person just dropped it into the truck then jumped into my truck to pull it forward then when I came back on Tuesday October 11, 2022 the men still wanted to drop my couch onto the back of the truck and I said I would like for you to carry to put into my bed of the truck so I backed up a little closer and they still basicly dropped it into my truck and then when I asked if they would just hold the strap so I could secure they said they couldn't and just the by door on me. I then went into the front showroom to ask the manager to help and he did. I have a broken him with 3 pins in it and I was bymyself. the men in the back to load the merchandise into customer vehicles are rude. the manager I didn't get his name was very kind. Stephanie was awsome in helping me pick out my couch, I will come back to get the loveseat but I will not have those boys (men) load it in my truck.", "rating": 3}, {"title": "All went well until I realized it…", "text": "All went well until I realized it wasn’t the item I ordered!  Now I have a couch I didn’t order and have to wait until next delivery time to get the one I wanted!The salesman was very friendly and helpful but didn’t get the right order it was not the salesman whose name is on order it was other James", "rating": 3}, {"title": "My experience started out good", "text": "My experience started out good, then got very rocky, then regional manager Randy called me and got everything taken care, when I went back in to pay and get everything taken care the manager in training was still very rude and didn't even apologize for the miss communication. Randy was great, salespeople were great, but the manager in training wasn't!!", "rating": 3}, {"title": "Salesperson was great", "text": "Salesperson was great. They didn’t have the item we wanted in stock, even though it was guaranteed in stock. So we settled on something else. Manager agreed that if we bought the couch and ottoman we would get free shipping, since what we wanted was not in stock. We chose to get just the couch and since we did not get the ottoman, the MANAGER said we could not get free delivery.  So we had to pick it up, even though we didn’t get exactly what we wanted. We like what we got and the sales lady was great, but won’t go back because of the manager.", "rating": 3}, {"title": "The salesperson was not as...", "text": "The salesperson was not as knowledgeable as I would have liked.  I asked a simple question like, \"is the item available?\" the salesperson said \"yes\"; but come to find out the item was not in stock.  I would have to wait 7-10 days for the item I paid for.", "rating": 3}, {"title": "Customer Judgment respect everyone", "text": "Customer Judgment respect everyone. Racial profile I didn't like it", "rating": 3}, {"title": "Rescheduling is harder than it needs to be", "text": "Buying the bed frame was easy and the staff was very nice and helpful. Getting it rescheduled for delivery and the automated system is frustrating. I still received a text saying it was getting delivered when it was supposed to be rescheduled. It’s very confusing and frustrating.", "rating": 3}, {"title": "Sales good delivery in a hurry!", "text": "Sales people very good. Delivery was in a hurry!!!", "rating": 3}, {"title": "I wish I could give a 5 but", "text": "I wish I could give a 5 but my furniture which is paid for in full keep a getting pushed on delivery date. I understand labor and supply shortages but I would give a higher score if they worked call me with that info rather than me chasing them for update. They obviously have my email address and other contact info. 😑", "rating": 3}, {"title": "Manager really cold did not say much,First person we talk to Daniel was great", "text": "Manager really needed people skills maybe having a bad day, First says person was Great (Daniel)", "rating": 3}, {"title": "Delivery staff not respectful", "text": "My furniture was damaged and I did not see it until after the delivery crew left.  I'm not upset about the damaged furniture; stuff like that happens.  I kept my distance because they were not wearing masks.  They came into \"my\" home.  Your employees should respect customers.  They did not show any consideration that I may be sensitive to exposure, nor the fact that I may have been positive.  What is Home Zone's policy?They also tracked dirt onto my floor and I needed to mop the floor after they left.", "rating": 3}, {"title": "The crew that delivered was great, customer service line was terrible", "text": "The crew that delivered was great. The customer service people that I spoke with to schedule the appointment were horrible. total of 3 stars out of five for the bad customer service over the phone. I needed to reschedule due to an emergency, they told me they couldn't do that without charging a fee. When I said go ahead and cancel since the fee was the same.", "rating": 3}, {"title": "My furniture was delivered damaged", "text": "Date of experience: April 26, 2023", "rating": 3}, {"title": "It is very inconvenient to have to go…", "text": "It is very inconvenient to have to go into the store to order a table set and that being from out of town having even more inconvenient to have to drive an hour to go pick it up especially as expensive as gas is right now.", "rating": 3}, {"title": "Nice furniture..but…", "text": "Love the furniture selection there. Rated average because I don’t understand how EVERY pc of furniture you guys unbox, in my experience, has SOMETHING wrong with it. I’ve purchased furniture from other companies and this has not been my experience with them. 14in long scratches, veneer chipped off, a corner chipped off…just something. Not sure if it’s the packing process or what.", "rating": 3}, {"title": "Sectional was beautiful,purchased it…", "text": "Sectional was beautiful,purchased it and received half was told the other half would be in no later than 2 weeks. Now we find out it’s going to be more like a month...was not happy. Also the delivery guys were not helpful and although ours was just a drop off I figured they would have at least brought the furniture in instead of piling it all in the driveway. Thank goodness I was home.", "rating": 3}, {"title": "Overall was okay I guess", "text": "Overall was okay even though I was suppose to have a pick up Saturday and the item wasn’t on the truck has to wait till Tuesday and they said then that they would deliver it to me for the inconvenience Tuesday came and delivery men were pulling it off truck and scratched the leg to the dresser to the point were I had to wait till Friday for a technician to come and shaved some of it off the leg and glued it thankfully it’s not that noticeable but it was a huge run around.", "rating": 3}, {"title": "The product I received is as…", "text": "The product I received is as expected-good. The delivery was not as expected. I was warned not to sign the delivery receipt until all parts had been inspected. The delivery man had trouble plugging in the power cord and said he would have a serviceman contact me. He didn’t give me time to inspect the recliners and promptly rushed out the door, not requesting a signature. I successfully completed the power issue and never heard back from the store/service person.", "rating": 3}, {"title": "Great furniture…….Horrible customer service", "text": "The furniture I bought is absolutely perfect for living room. We really enjoy it. You had some real professional delivery men who made sure I was satisfied. I was not happy with the customer service in the store. When my wife and I entered store it took 40 minutes before we had a sales agent help us. They were all gathered around in groups by the computers talking. When I finally did get help I got switched to 3 different sales agents before the sale was over. I need to buy a bedroom set next if this is how I’m going to be treated I will leave.", "rating": 3}, {"title": "I was had some difficulty committing…", "text": "I fell in LOVE with the Houston love seat and sofa the moment I saw them. However, I was having some difficulty committing the first evening I went in to look at the Houston sofa and love seat. I needed a little more time. However, the customer service person who was helping me, Joe by name was rude to me when I did not commit in that very moment. I was attempting to speak to him and he kept his back turned to me. I told this to the manager who went ahead and give him credit for the sale. The real credit goes to Kale was the person who really sold me the set. Joe, was RUDE and PUSHY", "rating": 3}, {"title": "Poor quality for the price", "text": "Bought the Metro Gold Sofa. There was an issue where the screw coming off the leg in the middle of the sofa was too long and made a very loud noise as it scraped across one of the support springs. I cut it shorter with an angle grinder which fixed that problem, but I hope for greater quality when I pay a grand for something new.Then my wife and I have noticed that the buttons on the back (front of the back?) of the sofa are loosely connected, fragile, and pretty sharp on the back side. We haven't done anything crazy on the couch, just sitting and laying, but the buttons have very quickly gotten loose and can be pretty sharp if your arm rubs across them the wrong way. Again, I assumed for the price these would be tighter, more secure, and less sharp.", "rating": 3}, {"title": "Using a 3rd party delivery isn’t in the…", "text": "Using a 3rd party delivery isn’t in the best interest of home zone company. You should use your in house delivery guys they are much more experienced in customer service. On our re-delivery.", "rating": 3}, {"title": "The time window for delivery was like…", "text": "The time window for delivery was like 4hours first of all so there was no specific time of when my bed would arrive on delivery day.  Also there was two pillows that I expected that same day only to be told the following day that it would be another two weeks before I would receive them.", "rating": 3}, {"title": "Well first", "text": "Well first, some of the furniture That I was told that was included was not included. Second, the tall chest was broken, I had to return it back. I’m waiting for a new talk chest and according to the store, my nightstand won’t come in until May. I’m a little concerned about all this", "rating": 3}, {"title": "Out of stock item", "text": "We came in the store and ordered a couch, chair and ottoman. One of the reasons we choose that one was because the sign said it was in stock.  We came in and bought them so they wouldn’t sell out and scheduled a delivery date.  When I called in this week to change the delivery date I was told that the ottoman was out of stock and had been even before we ordered it.  It’s not a huge deal but it is frustrating that we’ll have to wait for that and it took the delivery warehouse to tell me that and not the sales rep.  Overall we’ve had a good experience so far and that was the only negative.", "rating": 3}, {"title": "I’ve noticed that whenever there’s a…", "text": "I’ve noticed that whenever there’s a sale on some of the furniture items, the price is still the same as before only with an “original” amount tag added. I’ve been waiting for a nightstand to go on sale and it’s still the same price despite President Day sales, etc.", "rating": 3}, {"title": "The delivery guys were great but I…", "text": "The delivery guys were great but I wished they could have disposed of my old mattress. It is difficult to dispose of an old mattress most other furniture outlets remove your old mattress. It fosters brand loyalty and future business. JS", "rating": 3}, {"title": "My night stands are in good condition", "text": "My night stands are in good condition, my dresser with the mirror has a scratch and spots on it that won’t come off.  My headboard is very wobbly. I really like the way my furniture looks, just disappointed that it’s not sturdy.", "rating": 3}, {"title": "2nd purchase.", "text": "2nd purchase.. 1st had issues with missing cushions and such. Not a big deal. 2nd purchase the delivery guys would not put couch in room stating it would not fit (although same size had come out) We had them place in garage and we got it in later.", "rating": 3}, {"title": "Good but could be better", "text": "I dated between 3 and 4 stars. The selection in the store changes. We liked a room set, but it was no longer available when we were ready to buy. What we did get is Good Solid wood pieces, but the paint/finish appears unfinished or rough in areas.", "rating": 3}, {"title": "Headrest", "text": "Haven’t been able to get back to store but not t sure this chair is the one I thought I chose. Thought the one I chose had a lower headrest  this one seems a little tall for me. Know there is nothing that can be done. I’ve been trying to adspt", "rating": 3}, {"title": "Best selling furniture 😀 but price has…", "text": "Best selling furniture 😀 but price has not cheap", "rating": 3}, {"title": "The reason I'm giving homezone a 3 star…", "text": "The reason I'm giving homezone a 3 star is because when I received the first William power recliner sofa it was torn I called customer service and they was great for replacing the sofa with no problem but when I received the second William power recliner sofa that was delivered it look as if it had been used with grass particle on it I mentioned it to the delivered driver I asked was the sofa wrapped up and one stated that he had unwrapped it inside the delivered truck but I'm not sure about that the delivered truck must have had grass in it because it was all over the sofa not happy about that with Covid-19 still going on just never know.", "rating": 3}, {"title": "Chairs were to be delivered within…", "text": "Chairs were to be delivered within 2weeks of purchase, a week later I receive message that they would not be ready until the middle of august a month of purchase date, there advertisements say they deliver in days not weeks", "rating": 3}, {"title": "I received my couch and one of the…", "text": "I received my couch and one of the pieces were broken.", "rating": 3}, {"title": "Poor response", "text": "The employee on the floor who assisted with our purchase was great, but when I got the product home and put it together, it was missing screws. I contacted Homezone about the screws, and was promised that they would be sent to me via fedex. I never received them. I reached out to homezone via a phone call, and they told me that it was shipped, even though the fedex tracking number said pending receiving package from homezone. Now, I have to wait through the weekend to speak to someone on Monday. Also, I can’t pick up the screws from the store. So, I have a price of furniture that’s been sitting for about a month that I cannot use till I get these screws.", "rating": 3}, {"title": "Furniture Deliver Fumble", "text": "So I place my order with the home store for my furniture goods. I pay for the premium set up so that I didn’t  have to set my items up or dispose of it afterwards. The guys coming home I never polite and on time. They put everything in place as needed and left. I went to inspect and saw the nightstand had the cellophane still around it. I tried to contact them but they drove off. I called the deliver hotline and the stated they were headed to their next location and I should wait to have them pickup the debris and remove the cellophane. They returned and picked up the debris and removed the cellophane from the nightstand. I thanked them then they left. My phone needed to be charged and I remember my nightstand could charge. The cords were still packed and not plugged in for me. I’m not picky but if you state “premium set up” the little things should be taken in account. I’m not truly happy with my experience and how I’m left feeling.", "rating": 3}, {"title": "I love my furniture but the night light…", "text": "I love my furniture but the night light on one of my nightstands will not turn off.  Now I have to go back to the store and mess with this more. I was hoping I would really be done and could just enjoy my new stuff.", "rating": 3}, {"title": "Service", "text": "Service e-mail was not received until a customer call seeing about concerns on ticket. Was notified part was ordered and once available will be notified to schedule replacement or repaired service. End of call.", "rating": 3}, {"title": "Service in the store was good", "text": "Service in the store was good!  Communication regarding pick up was poor.  I was told I would receive a phone call when ready for pickup, never did.  I initiated contact a week later.", "rating": 3}, {"title": "Overall all was OK", "text": "Overall all was OK. Helpers who delivered bed were fine. Was never really given a price or checked to find out what new price would be with getting new bed. Home zone is a nice place to shop.", "rating": 3}, {"title": "Still seems to be a communication…", "text": "Still seems to be a communication problem with in your team. We ordered another large order of furniture. the wrong set of couches were sent. Homezone took the couches back to correct the order which is great, but after we waited for the new couches to arrive so we can take the professional staged photography,  we finally received the \"corrected couch set\" and you guys still sent the wrong couches.  In fact the couches look the same as the first wrong delivery. We don't have the time to wait for a second correction on the same issue so were moving forward with what was sent. Please verify the orders are one all accounted for and two , the correct furniture is being delivered. We are happy with how the home turned out looking despite having the wrong couches.", "rating": 3}, {"title": "Paid for assembly but the delivery…", "text": "Paid for assembly but the delivery people just came in and dropped off. They was so in a hurry they left my product wrapped up in their blanket. Great furniture but horrible delivery.", "rating": 3}, {"title": "Service was great", "text": "Service was great! The delivery was great! They had vehicle issues and arrived at my house at 10pm. Made and effort to contact the store at 8:00pm. The phones were already transferred.", "rating": 3}, {"title": "We didn’t notice until our furniture…", "text": "We didn’t notice until our furniture was delivered and we got to sit down and enjoy it that all 4 recliners were missing the bar to support the foot rest.", "rating": 3}, {"title": "Very bad at delivering", "text": "Very bad at delivering. They said we have the product and we will deliver them in two weeks. I got my furnitures after 3 months", "rating": 3}, {"title": "We were unaware that Home Zone is a…", "text": "We were unaware that Home Zone is a display store only so we were disappointed that we would not be able to take our sofa home that day. It was delivered within a week to the store so we were pleased that we didn't have to wait any longer.  However, when I went in the store to arrange our pick-up the salesman said to just drive around the side and get it (even though we were told we would need a printout). He said he would call back. We had to pound on a door to get help and the first thing he said was \"where's your printout?\" He agreed to take care of it and when the man finally brought the couch, he told us we were at the wrong door; couldn't the two previous men have mentioned that??? So we drove around to the back and got it but my husband had to physically help the shipping guy get it in our trailer. Overall, not a pleasant experience!", "rating": 3}, {"title": "I had great service on 4/18/24", "text": "Date of experience: April 19, 2024", "rating": 3}, {"title": "The furniture (QUEEN BED is pretty but", "text": "Pretty furniture (QUEEN BED) but system is flawed.  The furniture looks like the one I bought in the store.  It is well constructed.  Delivery and setup was very good.  However, the buying experience in the store had some struggles.  I had a salesperson who was very nice; however, it was his second day and he made an error that was costly to me.  He insisted that I needed to either buy a bumky bosrd (which they do not sell) or have wood cut to fir the frame to support my hybrid mattnress. Under his directive, I had the wood cut at an expense of around $70.  When the installers came, they asked why I had the board, explaining that the set I bought came (as I discovered at installation) with connected slats that provided perfect support.  Now I am left with the $70 extra expense and wood I don't need.  The supervisor assisting my salesperson did not catch the error.", "rating": 3}, {"title": "Decent furniture", "text": "Decent furniture.  Both recliner ends of sofa squeak.  Went into store and they said they'd call me to arrange to fix it, but no one ever called.", "rating": 3}, {"title": "The guys who came to pick up my…", "text": "The guys who came to pick up my furniture did not wrap it as they normally do. It was about to rain and I was concerned how the did not handle with care.", "rating": 3}, {"title": "I really enjoyed the great selection of…", "text": "I really enjoyed the great selection of living room furniture. The sales person was so nice and very knowledgeable.I purchased several items and was so excited that they would deliver within a few daysThe reason I gave a 3 star was due to furniture arriving stained. It was reported immediately and the manager am resolved the issue.", "rating": 3}, {"title": "Upon delivery we noticed a spot on our…", "text": "Upon delivery we noticed a spot on our new sectional and driver took photo and said someone would call us about it and never did.", "rating": 3}, {"title": "Condition of item purchased", "text": "The chair I purchased had dirty streak on one side as well as the underside covering being torn. Ad chair went down in price by $50.00 right after we purchased ours.", "rating": 3}, {"title": "We were on the store about 10 mins", "text": "We were on the store about 10 mins, we were not greeted all the sales people were standing around talking. Once we got what I assumed was the manager's attention he was great and very knowledgeable about their products.", "rating": 3}, {"title": "I'm a little disappointed", "text": "I'm a little disappointed because I went in to purpose a queen mattress and a queen panel bed. The Tiffany panel bed that was sold as a door buster on black Friday. The guy told me I would need the box frame which was another $130. He said it was hiding in the bottom of the frame that's why you couldn't see it in the photograph. I got home, put it all together and now the bed is 4 feet tall. The box frame sticks up really high. I'm going to have to buy a bed skirt or something to hid it. Turns out he was wrong. I absolutely didn't need a box frame. $130 wasted. I'm really bummed because I could have used that money elsewhere.", "rating": 3}, {"title": "Home zone customer service has been…", "text": "Home zone customer service has been good but both products came damaged.One item has been replaced but the other they have come twice to repair", "rating": 3}, {"title": "Great customer service. Quality of furniture is not that great.", "text": "The customer service in the Waco store was great. Very friendly and never pushy salesman. Great prices. The downfall is the quality of the furniture. We bought a king size mattress in February of 2020 and had to have it replaced through their warranty in April due to it sagging where we sleep and leaving a hump in the middle. Neither of us are big people either.And now the 2nd mattress is doing the same thing. Now the adjustable bed frame makes clicking noises everytime we raise or lower the head of the bed up. We bought couches from here three weeks ago and are already having to get one if the couches repaired or replaced due to loud popping noise on one of the reclining sections. I will say that their customer service for all the repairs and replacements have been taking care of in a timely matter and they are very friendly. As for the mattress it's one replacement and done unless you pay a fee to extend the warranty for a third mattress.", "rating": 3}, {"title": "Our couch was out together and it…", "text": "Our couch was out together and it doesn’t line up with the other side. I’m not sure what happened because I wasn’t home when it arrived.", "rating": 3}, {"title": "Unsatisfied", "text": "We purchased our first couple pieces of furniture in August 2020. We started out excited and happy to have found great furniture with genuine customer service. A few weeks after receiving our new furniture, we began having issues. We noticed in certain areas of our new couch thread coming undone and even more bothersome was the knocking and creaking noises when we would sit or get up. We had several service calls to attempt to resolve the issues, but ultimately they still have not been resolved. After, missing work multiples times to fit their service schedules, not our availability, we had given up on trying to have the issues resolved. Each replacement piece came with a similar or new issue.  We asked about returning the couch since we'd had so many issues almost immediately but were told we'd lose 20% of the purchase and also be charged a delivery fee for their staff to pickup or we could drop it off over an hour away ourselves. We will have the couch, but the noises and defects seem to increase over time.", "rating": 3}, {"title": "Ordering online was great", "text": "Ordering online was great. But the delivery I received the wrong item. I ordered the loveseat recliners, but got the sofa.", "rating": 3}, {"title": "Can’t really rate until my damaged…", "text": "Can’t really rate until my damaged chair is exchanged in June. A little disappointed I have to wait until mid June!", "rating": 3}, {"title": "Lawton, OK Homezone review", "text": "I applied to Acima credit lease and was approved and bought my furniture and decorations using Acima. I was told that my lease purchase would reflect on my credit and show my payment history. I checked my credit 60 days after and it was not reporting. I then read the contract and it says it Acima doesnt report to credit, so therefore, I was mislead. The home zone employee did not go over the contract with me. He just told me where to initial and sign. I would have paid for the products upfront if I knew the actual truth. It took almost 3 months for my night stands to come in but was originally told it would take less than 4 weeks. Also a lot of decorations aren’t price tagged and I couldn’t buy a rolling liquor stand because “it wasn’t in the system yet” but it was displayed for sale. The manager told me to come check back next week. Was very disappointed. Some of employees seems uncomfortable with the computer system, it takes over 15-20 min to checkout and pay. The Lawton Homezone seems like there is a lack of communication and training within the crew. I hope to see improvements in the future.", "rating": 3}, {"title": "Need some info and no one can help me. Ordered this item and the description on the website didn't match what I gotItem\tSKU#\tQuantity JBHUP_L1-1M - ROMEO RECLINER", "text": "Need some info and no one can help me", "rating": 3}, {"title": "Haven’t received our furniture yet.", "text": "we haven’t received all of our furniture yet, but once received will upgrade the star rating.", "rating": 3}, {"title": "Salesperson was phenomenal delivery not so much", "text": "Salesperson was phenomenal, price was right. 2 items damaged when delivered, very disappointed", "rating": 3}, {"title": "Need to have more of a selection at the…", "text": "Need to have more of a selection at the stores!Your delivery drivers are great though.", "rating": 3}, {"title": "Just business!!!", "text": "Just business! No genuine friendliness or courteous for the customer! No biggie though!", "rating": 3}, {"title": "Getting different brand of couch than ordered", "text": "Had my couch for a few months always thinking something felt off. I finally realized they gave me 2 different furniture sets so they were slightly off. Color, height and cushions didn't align. I called and sent pictures and the customer service was good! The delivered an entire new couch. Got the couch and again I ordered the Bermuda and they delivered a Davenport set. Called again and was told oh well it's made by same manufacture they usually just swap tags in the warehouse. So to me that's like selling one product under \"name brand\" but using a diff name. They offered to refund my money and take the couch or 10% discount. I asked for a little more than 10% for all the trouble and taking off work, and was told that they graciously already delivered a new couch and paid for the delivery and paid for set up like they did me a favor. It wasn't my fault they sent me a half Bermuda\\Daventport sectional and the second time sent a Davenport sectional. Yes it might be \"same couch\" but sell it as the brand not swap tags. Needles to say they didn't budge on 10% Now it makes me very leery of ordering anything else from then never know what you might get. Went to HZ in Round Rock to get the 10% back and they were all wonderful there, great customer service. So 3 stars to Customer Service", "rating": 3}, {"title": "I would have given it 5 stars if they…", "text": "I would have given it 5 stars if they had delivered the right coffee table.", "rating": 3}, {"title": "Good people", "text": "Good people, good costumer service, but i didn't get what I bought", "rating": 3}, {"title": "Not mad", "text": "Not mad,  just broken furniture and having to wait for replacement.", "rating": 3}, {"title": "We give the store a 5", "text": "We give the store a 5! However, we dealt with Dawn at the North Lewisville Store for quite a while on Saturday. We also called her several times by phone for help. One of the 2 sofas we narrowed it down to was only on display at the South Lewisville store. Dawn asked that we tell them we were her customers so she got credit for the sale and she could order either sofa for delivery. On arrival we were met by Kimberly a very nice young lady. We told her immediately that we were Dawn’s customer and only wanted to look at the sofas. She said she understood and would show us the sofa. When we decided we wanted the Georgia sofa, we also decided we wanted the rug it was sitting on. We were going to leave for North Lewisville when Kimberly stated she could write up the sale and save us the drive. We again questioned if Dawn would get credit for the sale? She walked away and spoke with Mike the Store Manager. She returned and stated she could write up the sale and stated “I checked and Dawn will get credit for the sale”. We trusted that that meant that Dawn would get full credit and before completing the sale we added a pair of lamps and the protection plan that Dawn had discussed with us on Saturday.Today we called Dawn to thank her and to be sure she knew the full extent of our order. She said she appreciated our business and when I asked the second time if she got credit for the sale she only got 1/2 of the sale? She finally reluctantly stated she got only half - because we purchased at the other store.We are not happy about this because we asked a direct question at least twice before purchasing the items, and now we feel mislead! Both ladies were great but we can’t help but feel mislead at the South Lewisville location. Even if it is store policy we should have been told the entire truth. Had we known this we would have returned to Dawn to place our order. We are sorry Dawn!George & Marvis FurgusonFlower Mound", "rating": 3}, {"title": "No good esperience", "text": "No good esperience ", "rating": 3}, {"title": "The nightstand I bought light does not work. I am still waiting to get it fixed.", "text": "The nightstand I bought", "rating": 3}, {"title": "Quick professional service.", "text": "Happy with it.", "rating": 3}, {"title": "Damaged but replaced", "text": "Date of experience: February 18, 2021", "rating": 3}, {"title": "The couch is nice and delivery and…", "text": "The couch is nice and delivery and setup were great, but there are some hinges that are making noise when you sit down", "rating": 3}, {"title": "Drawers on dresser and Chester drawer…", "text": "Drawers on dresser and Chester drawer didn't close correctly or scratch as they close. Night stand had a nail in the electrical wire, that cause spark when we move the stand. Both dresser and Chester were returned, the night stand issue was later, but was replaced a week later, along with the dresser. The Chester drawer was refuse a second time for the same lower drawer not closing correctly and scratching the furniture. I believe the Chester drawer was the same one delivered the first time, doesn't make sense that the same issue could happen twice, assuming it indeed was a new dresser.", "rating": 3}, {"title": "Unsatisfied customer", "text": "I’m really not so satisfied with my purchase I was not told the chairs had screws on the legs of them and in order to have an even chair the screws had to be out and sometimes the screws fall out I’m not happy with my purchase", "rating": 3}, {"title": "Furniture has a very strong smell to…", "text": "Furniture has a very strong smell to it. Almost like a lacker smell. It's so strong I've had to keep our kitchen window open. The smell is not lessening.", "rating": 3}, {"title": "While the delivery window was timely", "text": "While the delivery window was timely, one of the  delivery guys dropped my furniture when delivering it.  However, that being said, it didn't appear to be damaged.", "rating": 3}, {"title": "Issue with King Size comforter order", "text": "I really like Homezone, they’re fast delivery service is by far one of the best there is when it comes for their furniture. The reason I gave them 3 Stars is because I have purchased 2 bed sets from them and a King Size Comforter set that cost me around $400 back in mid December 2020. We were told that our comforter would have to be ordered and picked up at the store in approximately 2 weeks, well here it is February 2021 and still no comforter. Every-time I call to check on the status they tell me that they will send an email to somebody to get the status and that I would get an email or call when they find something out. Like I said I do like Homezone’s quick furniture delivery, but I will think twice before ordering another bed comforter from them again.", "rating": 3}, {"title": "Non working piece", "text": "Salesperson great...one piece of the sectional doesn't work properly....and when delivery people set it up they didn't check each piece...my husband wasn't home so I just trusted them that everything was in new working order...", "rating": 3}, {"title": "Late Delivery", "text": "The delivery was two and half hours after our scheduled window.", "rating": 3}, {"title": "transparent answer", "text": "Hello, we like the price point and the quality of your products especially for staging the homes like we do weekly, Please verify that all products and parts are accounted for before shipping. when we are staging homes with thousands of dollars invested with your products we absolutely have to know when every thing is accounted for and will be delivered / assembled. it is an absolute necessity that when you guys tell us when delivery and set up is scheduled and that it happens exactly to plan, otherwise you will completely stop the process of a home being listed for sale just because someone dropped the ball and didn't include vital pieces of furniture. we cant list a home if you have tables sitting in the dinning rooms all in pieces and a half staged home, looks terrible for professional photography. we will continue to purchase from you guys just please work on this process better. thank you.Blake - franchise owner of Homevestors Of America!", "rating": 3}, {"title": "Susie was amazing in the store", "text": "Susie was amazing in the store. When we got the couch, it was missing a cord. They shipped a cord but it was the wrong one. So I had to call back and they are shipping another one. It's now been 2 weeks and I still am missing the cord.", "rating": 3}, {"title": "Ok, not great, kind of meh", "text": "I wasn't scheduled for delivery as I was told  I would be.  I was then rescheduled and delivered to with no problems.  After assembly the loveseat was defective.  The switch to operate the recliner was not working.  I called customer service and was told it would be a week before a technician could come out and look at it.  I subsequently authored a review announcing my dissatisfaction with your company. Your Round Rock store manager contacted me and said he would like to come out and check out the defective product.  He came on a Saturday morning,  but there was nothing he could do to remedy the situation.  He apologized and agreed the time for a technician to come out was not acceptable.  He said the technician was off Sunday and Monday and he would try to get him to come by Tuesday.  Tuesday came and went and there was no contact with your service department.  I received a text on Wednesday referring my scheduled window on Thursday.  Thursday morning the technician arrived approximately 45 minutes early and replaced the defective switch. The lights on all my switches are red, turning green when engaged.  The one he installed is green turning red when engaged.  So I have three red lights and one green. He said he didn't know why that was because he hardly ever had to replace those switches.  My experience has been ok, not great. I plan on buying more furniture in the near future,  but am unsure if we will purchase from The Home Zone again.", "rating": 3}, {"title": "Property damaged during delivery", "text": "Property damaged during delivery, missing hardware for mirror, confusion on delivery address, back order on night stand.", "rating": 3}, {"title": "Purchase of Bedroom Suitr", "text": "I purchased the Dallas bedroom suite that was supposed to be gray but it’s green. A little disappointing.", "rating": 3}, {"title": "The only problem I had was the time of…", "text": "The only problem I had was the time of delivery but everything else was great", "rating": 3}, {"title": "All the materials was not with my…", "text": "All the materials was not with my furniture when delivered had to call and get them to send me the brackets to put together my furniture and I had to call back because I didn’t receive the brackets and still waiting.", "rating": 3}, {"title": "We picked up sofa and loveseat", "text": "We picked up sofa and loveseat. Comforter set is taking a few weeks to come in. We are moving and I wanted to have  comforter set sent to a  store closer to the city we will be living. So far they can’t make that happen and they can’t just ship it to my house. They are looking into it, but I might need to cancel the order. I don’t want to drive 3 hours to pick up a comforter set.", "rating": 3}, {"title": "I should not have had to go through the…", "text": "I should not have had to go through the obstacles I did with this store and my purchases. I am just happy that it got taken care of. Thank you.", "rating": 3}, {"title": "They said second day delivery but it…", "text": "They said second day delivery but it wasn’t ready", "rating": 3}, {"title": "Nimbus couch with chaise", "text": "Received Nimbus couch with chaise as gift. Couch sags terribly. Had it for 3 days and center sits very low. Sides tilt to center. The best cushion is on top of chaise stool. Also making creaking noise when sitting in center. Terrible support! Gave 3,stars because delivery guys were great, otherwise 1 star.", "rating": 3}, {"title": "Average", "text": "1. Apparently VISA isn't everywhere I want to be or else Home Zone would've accepted my $500 VISA gift card, no doubt I'll remember that.2. Your delivery service isn't in any way related to Home Zone or at least didn't seem like it, they really didn't care about the furniture or giving me time to look over the furniture. They wanted a signature and they wanted to leave. I bet they didn't even know what furniture company they were delivery for. They just seemed like hired movers. No HZ uniforms no HZ truck.3. When I met the movers outside I noticed the furniture wasn't even wrapped or covered in the truck.4. Craftmanship was poor on one of my consoles, unlike the other console. The good news, it was a great experience with the exchange, at least on the phone, I'll be getting the exchange tomorrow, so we'll see if this one is better. Hopefully the delivery service doesn't throw it into my house and run away.These are not terribly BAD things, but things that made this experience average and nothing special, so if I could give it a 2.5 star I would. I ordered ice cream and Home Zone just chose not to put whip cream and a cherry on top, but I guess I didn't ask and just expected it, silly me. :)", "rating": 3}, {"title": "Great servic", "text": "Great servic, but no delivery under 500.00, kinda sucked. I had to drive 50 miles to get it.", "rating": 3}, {"title": "Adult full size bedroom \"matrix\"!", "text": "I really really love my new matrix adult full size bedroom due to down sizing from a queen size bedroom for space. What I was shocked about was it doesn't give any information concerning the amount of weight the bed holds and the slacks appears to be for a very light weight person. The good thing it's covered through the insurance that's offered. The dresser and night stand is to die for...so much room and I love it! Looking for the perfect mattress to fit and I can't wait to relax in my new matrix bedroom.", "rating": 3}, {"title": "The lights on the night stands worked…", "text": "The lights on the night stands worked once and have quit working.  Call in to service. The mattress we purchased does not work with adjustable base. We are going to visit the store tonight about an exchange. The delivery was outstanding.  Very pleased with the crew that delivered our furniture.", "rating": 3}, {"title": "did experience problem with…", "text": "did experience problem with purchase...was told unable to purchase item from display...my item was supposedly ordered from stock...when I arrived for pickup, I was given merchandise from the floor...I did receive an apology and compensation.  I will continue to shop with HomeZone because of their good customer service", "rating": 3}, {"title": "Delivery ok, Setup not great", "text": "The actually delivery service went smoothly and they communicated everything great with me. I was not able to be there while they set up the furniture, so when I got home from work I inspected everything. Unfortunately, one of the drawers of the dresser was not installed properly and it will not shut properly. That’s the only complaint I have.", "rating": 3}, {"title": "Horrible Salesman... Great Managers", "text": "My salesman was not very knowledgeable and he liked to me along with getting my purchase order incorrect. When I went back to the store after delivery to discuss the situation I was really upset and the manager looked into my situation and fixed the salesman's mistake without any cost to me and personally delivered the piece u was missing. He was very professional and understanding. And the Delivery team was really nice and professional, they were really careful when they came into my house and made sure I was happy with the way they set it up", "rating": 3}, {"title": "Delivery", "text": "The customer service in the store was excellent. However, the delivery portion was not as I expected. The driver left some of the packages in from of the garage instead of on the porch. They were not secured enough from being damaged. My sister came by to visit and call me to let me know they were lending and about to fall.", "rating": 3}, {"title": "Problem with comments delivery driver…", "text": "Problem with comments delivery driver made but the CS manager made it right.", "rating": 3}, {"title": "Furniture should have been put…", "text": "Furniture should have been put together. Was a pain to do three tables. Price was great but not worth hassle.", "rating": 3}, {"title": "The movers did not have shoe covers and…", "text": "The movers did not have shoe covers and told me that they would not take off there shoes. However I was told by customer service that they would have shoe coverings. I have a toddler so that was very important.  Also when I first had contact with one of the movers, he did not have on a mask. My couch cushions was also on the elevator floor with no plastic covering, I believe that was very gross!! I was displeased with all of the aforementioned. On the other hand they set the furniture up quickly.", "rating": 3}, {"title": "Still waiting on damage couch legs to be fixed.", "text": "Love the couch and delivery was good, however, the legs on my couch delivered were chipped and a screw on a leg is stripped. The delivery team took pictures and told me I would hear from a technician...2 weeks later, I am still waiting.Service starts and begins with who the company has representing them. The sales team was great, but disappointed that a damaged couch was delivered and still needing to be fixed.", "rating": 3}, {"title": "Very pleased with my purchase", "text": "Very pleased with my purchase. However, delivery person wasn’t very pleasant. I asked him to place the furniture in a certain area and he handed me the clip board to sign like he didn’t hear me. I was under the assumption set up came with the $99 delivery.", "rating": 3}, {"title": "Not too impressed with the Daniel Chest I ordered", "text": "Overall, things were ok. But when I unboxed the dresser that I bought, I found it to have some damage that I had to repair myself. I didn't have the time or energy to take it back and exchange it and everything. The dresser was also missing a knob for one of the drawers. I had to to take the knob down to the store and tell them that I was missing one and I needed a new one. They told me that that same dresser was going to be coming into the store the next week and they'd call me so that I could get the replacement knob. No one ever called me back though. I also found that as I was trying to fasten the knobs to the drawers, the bolts were too short and the threads stripped very easily, causing me to be unable to attach half of the knobs because the bolts were stripped. I am realizing that I may have to just find new knobs myself and attach them myself.", "rating": 3}, {"title": "I think that a little better…", "text": "I think that a little better explanation from the salesman of some of the features that some of your furniture offer would of been a little more helpful. For example, I did not know that my bedroom headboard lit up (white) a different color then the display I saw at your store (yellow), a hidden button on the side that lights up the nightstands and how easily the mirrored bed damages so I would of bought the insurance. I was also given a post card by the salesman that told me that I would get a $100 visa gift card since I made a big purchase, but when I went to my truck to read it, the details did not include the purchase I had just made. which I was kind of disappointed in. I was also not happy to give the salesman and woman that was helping me, my social security number out loud at least 7 times to help w/completing my order. Delivery guys were good, did not know the furniture would come fresh off the truck w/no bubble wrap, had I known that I would of bought the insurance. Overall, it was ok to shop w/Home Zone.", "rating": 3}, {"title": "Furniture selection ok", "text": "Furniture selection ok, customer service could be better.", "rating": 3}, {"title": "I found a really great deal on dining…", "text": "I found a really great deal on dining room chairs on Home Zone site, so I ordered 8 of them. The day before delivery I was called and told they did not have item in warehouse and they were now discontinued. I received a call a hour later stating they found 4 and did I want...I accepted. Called local store to complain was told the same thing, but they did have some display chairs in the store.  I went to buy the chairs in store and I could tell they had been used...a Light stain on 1 and the cushion on the other not as form or supportive. Decided to buy 2 of the display chairs but was charged the same price as the new chairs in the warehouse per manager. How is that possible!!", "rating": 3}, {"title": "The only thing that we didn’t like is…", "text": "The only thing that we didn’t like is when we got our furniture delivered the guys dropped it off and didn’t put it together properly, and didn’t do an inspection with us as discussed. They just said they’re trying to get back home to Dallas where they’re from and that we are their last stop.", "rating": 3}, {"title": "Customers satisfaction", "text": "Managers are not very helpful or friendly. We have a problem with the power packs for our sofa and loveseat not staying charged for only 4 or 5 days.", "rating": 3}, {"title": "Be careful", "text": "I originally bought a sectional that was too big and noticed when it was unloaded.  I asked the delivery men if they could take it back.  They said on the next delivery item, they would take it back and no delivery charge for the next delivery.  When I went to the store, I bought a different, smaller sectional and was told I would have to pay delivery again.  I told him what I was told and “I’m sorry” is what I got.  I paid the 99 plus tax again for delivery and should receive the new furniture 9/28.  Paying 2 delivery fees seemed like too much but I guess not", "rating": 3}, {"title": "The item I received was not the item…", "text": "The item I received was not the item described on the website and customer service refused to accept would not accept a return for it.", "rating": 3}, {"title": "Not installed,correctly", "text": "Not installed,correctly No warranty certificates", "rating": 3}, {"title": "Nice Sectional, Ours was Defective", "text": "The good - we like the couch color, style, and delivery was within a few days of ordering. I was a bit hesitant to buy a modular sectional because the pieces arent attached, but after over a week of use the pieces havent moved. We have the flexibility to rearrange the pieces and they function together well. The bad- one of the sectuons had stitching that was defective. Where the cusion should be stitched down on the seat and back was not done. I contacted the company through the website but havent received a response. So we have a couch we like, but one piece is defective and no way to fix it.", "rating": 3}, {"title": "Product quality good but part was…", "text": "Product quality good but part was damaged and hardware was missing. Crew took back damaged piece and it was replaced in a couple days. I am still waiting for my barn door hardware", "rating": 3}, {"title": "What I thought was a perfect experience took a nosedive.", "text": "Your store was very clean and the young man who helped me with my purchase was very friendly, knowledgeable, and professional.  I purchased a love seat, an ottoman, a comforter set, a rug, pillows, and other small decorative pieces.  He made sure I knew what things cost and the options for delivery and warranty. He was very helpful.The love seat and ottoman was purchased and scheduled to be delivered within a week from purchase. I thought that was great.  I was expecting a longer wait. They called to deliver the furniture within the window of time they had given me, they were right on time and called as they were getting close to my home; it was a near perfect experience to that point.  Couldn't have been better.   However, the two young men who delivered the furniture to my home did not wear masks.  They were quick and efficient but I considered this inconsiderate and dangerous behavior.  I am an at risk individual and did not appreciate this at all.  I am still waiting for my comforter to be delivered to the store where it was purchased.  As soon as I receive the call that it is in, I will pick it up there.  Thank you for your interest in my experience.", "rating": 3}, {"title": "Having to pay twice for delivery.", "text": "We ordered a bedroom set. We found that they only had the Bed, Side Table, and mirror available and the rest was on backorder. We paid for delivery of the items. We then found out that we would have to pay for the delivery of the additional items to our home unless we wanted them to do door step. It was not our fault that the product we ordered was not available when I paid cash for the product. I purchased a full bedroom set. I was told that we would be charged $99.00 for delivery, which is acceptable for delivery and set up. It was not until after I made the full payment that the rest of the furniture that was on back order would incur an additional charge for delivery and setup. Had all of the items that we had purchased been available at the time of purchase, we would have only had to pay the 99.00 for delivery and setup. Now we have to pay twice. I do not feel that this is appropriate for your customers, especially when the product was not available and was not the customers fault. I will certainly consider my options for shopping with this company once again.", "rating": 3}, {"title": "Customer service 10/10 furniture 6/10…", "text": "So almost a year ago we bought dinning table and bed set and I must say customer service was 100% they are well trained , sadly I am not happy with the furniture , it looks beautiful  but two of our chair already broke both in  the same area , I haven’t coMplain to store because I hate being a pest but we paid a good sum of money for  very bad material .cant find a place to post pictures other wise I would", "rating": 3}, {"title": "Was looking for a better deal…", "text": "Was looking for a better deal considering I’ve been nothing but faithful in purchasing my entire house hold with home zone just looking to get a better deal as a loyal cunstomer but guess not !", "rating": 3}, {"title": "happy to sell/ Lackluster delivery and follow up on damaged new furniture.", "text": "Not all of the furniture was delivered even though I confirmed the manifest the night before. Once the furniture that was delivered was placed in the house there was no hardware kit simple table eventually we had to assemble that ourselves. Also have not had torn fabric taken care of on the loveseat.", "rating": 3}, {"title": "good customer service but order and delivery issues", "text": "I chose a loveseat but the salesperson accidentally ordered the sofa.  Thankfully, i discovered this before delivery.  However, apparently HZ can only refund me the difference if I come into the store.  Not that big of a deal, but I live 30 minutes away.  The table I had delivered was already put together when the delivery guys brought it in.  It wasn't until after they left that I noticed that part of the table was put together upside down.  Other than that, customer service was good. Thatcher was very helpful in assisting me with finding the furniture that i needed for my small space.", "rating": 3}, {"title": "Still waiting on my order almost 2…", "text": "Still waiting on my order almost 2 months later. I realize with what's going on shipping is going to be all over the place;However when I ordered from the store I asked if that was a possibility I was told no. Still waiting.........", "rating": 3}, {"title": "No instructions or directions for…", "text": "No instructions or directions for operating the chair was given. No instructions were left.", "rating": 3}, {"title": "I was very happy with the young man…", "text": "I was very happy with the young man that helped me he was great. But a lil disappointed that u were out of stock til October with the bedroom suit i really wanted. But i am satisfied with my second choice.", "rating": 3}, {"title": "They never have items in stock", "text": "They never have items in stock. Item not what expected.", "rating": 3}, {"title": "The sales associate was great but their…", "text": "The sales associate was great but their were conflicting stories regarding delivery charges.  I asked the manager if I  can  take it off before leaving the store and was told that I couldn’t do store pick up. In talking with the delivery guys, they said that I could pick it up from the store. Furniture seems really good for now but I will not get any more furniture here because of conflicting stories that I was told on two occasions between more than  one employee before getting my product delivered.", "rating": 3}, {"title": "Win some, loose some", "text": "First of all, I searched for a long time for my furniture. I wanted something that would be well built and last a long time. I found my perfect bedroom set. Paid for premium delivery. The guys that brought the furniture were FANTASTIC! The furniture looks great in my room. Then, while putting clothes in the dresser, THE DRAWER FRONT FELL OFF! I called the store, was told to look on the web site and put in a service thing. I did that, but the dang thing would not work. I tried 15 times. I was so mad, my husband came in and Gorilla glued the wood back together. I waited for a call from company, they called after several days and only asked about delivery. Never returned my call after that.", "rating": 3}, {"title": "Everything was great up until my…", "text": "Everything was great up until my delivery and install. My bed frame wasn't installed properly and was missing parts and now I have to wait again just for it to be corrected.", "rating": 3}, {"title": "Manufacturing error on chair leg", "text": "Loved the store and the employees, however when I got home to put together my table one of the legs of the chairs was different than the others. The holes to screw the bolts into were bigger than all of the other legs so the bolts provided were too small. I had to go to Home Depot twice to find the right size bolts for it and wasn’t able to enjoy the 4th chair until days after I had finished putting the rest of it together. Was a little frustrating. But the table and chairs are beautiful and I do love the set!", "rating": 3}, {"title": "Not the best experience", "text": "Wrong pricing, furniture not in stock, wrong address not updated, 3 hours late delivery, missing furniture. Manager did deliver missing pieces himself.", "rating": 3}, {"title": "Delivery went well and a small issue", "text": "Delivery went well, but night stand drawers don’t close fully.", "rating": 3}, {"title": "I had bad experience with home zone", "text": "I had bad experience with home zone. First impression is last", "rating": 3}, {"title": "Delivery wasn’t the best", "text": "Delivery wasn’t the best. They chipped my wall paint. I had to call to see where my delivery was at come to find out it wasn’t gunna me it the day that was planned. Shitt happens but I shouldn’t have to call to find out a problem.", "rating": 3}, {"title": "Received a call that my purchase was…", "text": "Received a call that my purchase was ready and when u get there to pick it up it couldn't be found. Not inky did i wait and wait in the back for the item I had to return through the front entrance to see what's going on. They couldn't find my order. They said all they needed was a name and number. After a long while it was found. Get home and there's a small piece cracked from its corner. I can't even bother to take it back due to them probably messing that up as well. So frustrated and I won't be back.", "rating": 3}, {"title": "You Get What You Pay For", "text": "Some pieces of furniture were apart (screws came off wood where they were \"screwed\" in). Very loose. One chair literally fell apart in the movers hands... It was the wrong chair anyway. We were delivered 2 wrong chairs. The movers we very nice. The wood of some of the pieces feels extremely cheap, but overall everything is exactly what I expected for the price I paid.Still waiting for Home Zone to call me regarding my missing chairs... Delivery was Saturday, today it is Monday.", "rating": 3}, {"title": "Honestly not sure yet how I feel", "text": "Honestly not sure yet how I feel.  First set of living furniture didn't last 45 days, at first seemed very helpful but when came time to actually take care of it had to jump through a ton of hoops.  When new set arrived found it interesting that it had tags on it and was wrapped in plastic unlike the first set.  So the first time did we get a floor model? So far this set seems much better but time will tell.", "rating": 3}, {"title": "Everything went well during the first…", "text": "Everything went well during the first delivery on the second delivery however I was not communicated about the delay, I had to contact them to find out about my new delivery day, other than that it was okay.", "rating": 3}, {"title": "Great salesman, horrible experience with having to get a replacement.", "text": "We had a faulty mattress and it felt worse than a futon pad. We got the bed on Saturday. We called Sunday after opening and they told us if it didn't expand by Tuesday, to call them.  I called them Tuesday, they said if it doesn't expand by Thursday to call them. I called Thursday and they scheduled to come Friday to \"steam\" it.  The guy that came out steam it was really nice but he spent an hour on a 5\" by 5\" square and it didn't do anything, so it was definitely a faulty mattress. Then I was told that they had to take pictures of it, send it off to corporate, have corporate approve a replacement then we can get a replacement. I had wait 2 days for that. I had to call Sunday and got my original salesperson which in turn found out that it was approved and he brought out a new mattress right then and there. Our sales guy (Joshua) was an awesome guy.  I bought here before and never had problems, this was an issue with their corporate policy, it should not have to take a week to get a replacement bed after it being faulty. Corporate should trust their employees to make decisions like this, if anything the guy that tries to fix by steaming knows and send pics to manager for a back up approval.", "rating": 3}, {"title": "Never again will I buy anything from…", "text": "Never again will I buy anything from Home Zone! I went into the Cedar Hill location (3 miles from my home), paid for a bench for my bedroom.  I was surprised it was not in-stock in store so had to have it delivered; but, in order to get it delivered I had to wait 10+ days! To have it delivered and assembled it would cost an additional $100. Please note, this is a simple bench that in my opinion should have been stored and stocked at the store. The only assembly was screwing on the 4 legs of the bench - easy breezy. I opted to drive to N Richland Hills (45 minutes away from store location) to pickup the item because I did not want to wait, especially since Home Zone didn't have to wait for my $266.00 purchase payment that was not financed.Very disappointed about this inconvenience!  Had I not had to have picked up my item, i would give an additional star and the thought people have to pay for furniture assembly is absurd.  I suppose if i purchased a $2500 sofa it would cost an additional fee to have it delivered and installed, otherwise leave it at the front door!", "rating": 3}, {"title": "Purchase and salespeople were extremely…", "text": "Purchase and salespeople were extremely courteous and pleasant, but the delivery people were rude and belligerent, stood the couch on our step and said this is were we deliver, I asked if they could put it in my garage, which they had to walk past to get to the step, they said no and left. Plus after inspecting my couch I discovered it was damaged, now I am really upset.", "rating": 3}, {"title": "not Happy", "text": "Was not happy with the bed frame it had pieces & a tool missing & had to be put it together. It was not like new it was an old display & was not the actual frame the pamphlet said it was. the pamphlet did not have easy to follow directions. the frame & remote are very noisy.. was given a scratched  up remote..  the material on the frame is loose & hangs... also 1st mattress was soaking wet had to wait an additional week to get another mattress ..if indeed I received a different mattress..", "rating": 3}, {"title": "Receipt Commercial", "text": "I spent 2-3 mo. saving my restaurant receipts like the Owner Bree stated on commercial. I was cheated out of half receipts. The staff along with management were too busy planning their weekend to answer questions. This was my first purchase with Home Zone. I do not plan on making additional purchases.", "rating": 3}, {"title": "All of your staff were great", "text": "All of your staff were greatoverall my experience was goodBut availability of goods ready to deliver was very few on inventory as well as delivery time is way behind", "rating": 3}, {"title": "Helpful staff, but delivery and furniture problems", "text": "I ordered a bedset and coffee table from Home Zone at a fantastic price. Everyone in store was very professional and helpful, and I was looking forward to getting my furniture. That part was a disaster - it was delivered at midnight, they didn't even finish building the bed, and they chipped the dresser on the way in. When I spoke with the manager, Chris, he was extremely nice and helpful even though the situation was frustrating. He came out to try to fix the bed himself (but unfortunately didn't have the proper tools), so he was able to set up a full exchange that was executed fairly smoothly. He was also nice enough to let me switch out my coffee table. The coffee table side tables came with scratches and I am just tired of dealing with these furniture problems. Everyone in store was nice and helpful, but it was frustrating to have to deal with so many problems as I moved to a new city. Please check your furniture before it is shipped out.", "rating": 3}, {"title": "Legs from the ottoman were missing", "text": "Legs from the ottoman were missing.  Customer service was great though.Oh yeah, your team overcharged me.  However, the young man who delivered my furniture caught it and was able to credit my account back. Hope my shopping experience with you guys next time is better.", "rating": 3}, {"title": "I provided 3 stars because we were  not…", "text": "I provided 3 stars because we were  not told about the warranty of the mattress and box spring until I signed off on the paperwork, was not offered a mattress cover to protect the mattress. I also had to inquire about the various mattress available and the variation between the options provided. The sale person was friendly but appeared to be new as during check out questions asked was redirected to other employees", "rating": 3}, {"title": "Wanted to purchase a chair online", "text": "Wanted to purchase a chair online, it just would not work. I left message got a call from the online help and was told the chair was out of stock (even though it said available). I than got a call from local manager and was told chair was in stock. He worked with me and was great. I wish you would sell floor samples, the sofa I wanted was out of stock so I bought one at a different store. To not sell floor samples is really just losing business. Needless to say I did appreciate the manager at the store.", "rating": 3}, {"title": "Wear a Mask, please", "text": "Home Zone would have merited 5 stars from me if the staff had been wearing masks when interfacing with us. I noticed that, for the most part, staff were separated by the recommended social distancing space at their work stations, but the salesperson who serviced us wore no mask, was working very closely with another staff member and approached us too closely until I asked her to back away. Other than the-compliance with health recommendations, the service was quite good.", "rating": 3}, {"title": "I had to speak with the manager about…", "text": "I had to speak with the manager about the Box board price the sales associate tried to charge me more because your store was out of the correct box board. Dont try to go up on the price due to your mistake", "rating": 3}, {"title": "Repair/Warranty Process is Not Customer Friendly", "text": "Customer service can ONLY be requested by completing a form online..there is no way to request service by phone. I'm sure this makes it much easier for you, but this is not a customer friendly process at all.  I've submitted a request for service on behalf of my elderly parents that don't have a computer and were not able to complete the form using the phones they have. We ordered a bed frame and dresser and there are problems with both.  A reply from Home Zone is pending. I am hopeful my parents will have a successful resolution of these issues.", "rating": 3}, {"title": "Check whole piece if any damages are visible.", "text": "Our sales guy was awesome just let us look around and we were there looking a long time we told him what we were looking for which yall really carry then told him what were using it for and he showed us several pieces we could use. Went to go look at a few other stores and came back he was very helpful. We still took a minute to make sure this is what we wanted. We purchase item which had to ordered. We got our order there was visible  damaged could see through plastic. We could order another piece or  discounted 10% if we took piece we took piece and when we got it home unloaded and unwrapped there was more damage. If a piece has some damage that the whole piece should be unwrapped and looked at. Was upset couldnt wait for another piece because I needed it now for sure. Gave my old piece away since ours was in already. But I should've waited till my piece was in and good. I feel that extra step is needed because you cant see the whole package.", "rating": 3}, {"title": "Only because the couch I purchase was…", "text": "Only because the couch I purchase was short on the screws needed to fully install. But very happy with service and with the quality of the couch I paid for. Do reccomend.", "rating": 3}, {"title": "My salesperson  ignored me  when I …", "text": "My salesperson  ignored me  when I  repeatedly asked if he added my mattress set to my bedroom order.So,when my bed arrived I had no mattresses  now I'm sleeping on my couch until my mattresses  come in. I end up ordering from a total different  store. Because when I went to the store and showed him his oversight he never apologized or tried to make it right.I will just just say his first initial starts with a C.", "rating": 3}, {"title": "I had got a delivery and I though you o…", "text": "I had got a delivery and I thought they only do door step because of covid and I need full delivery and my couch was hard to get in and it was not fixed and I wanted to be fix and they came back out and fix it they did ok misunderstanding.", "rating": 3}, {"title": "Salesman left a little to be desired", "text": "Our salesperson wasn't very knowledgeable when it came to the finance questions. He didn't have answers to our questions and kept telling us that we could call Acima credit AFTER everything was done. Came across like he just wanted the sale and to move us along.", "rating": 3}, {"title": "Damaged legs on couch and loveseat", "text": "Lied toAll legs on couch and loveseat damaged upon arrivalThen they gave me the run aroundAnd it will take 12 weeks to get new ones ordered and brought to me.I was so excited for my expensive new furniture and its damaged when that could have easily been prevented.", "rating": 3}, {"title": "Got it on sale, worth the sale price", "text": "The furniture itself is not very sturdy and has already become to come apart at some seams. The rubber stoppers on the bottom peeled off immediately and stretching the fabric started pulling apart the arm of the chair", "rating": 3}, {"title": "I am a return customer and I paid $99…", "text": "I am a return customer and I paid $99 for inside delivery not outside delivery.  I expected my mattress set to be deliver inside and in my bedroom not laid against my bedroom wall. There were more than 6 feet of space away from the rwo delivery men as well as they were from me, therefore, we all were safe from the catching the covid19.  I am not understandig why they didn't lay the mattress set down for me in my bedroom.  I am in my 60's. If I could I wouldn't mine laying the mattress set down in my bedroom.", "rating": 3}, {"title": "i like this company", "text": "very fast delivery quality product based on price.i had placed 3 order recenlty,2 order was compeleted in time.thank you .last order is still process...i felt a slap on my face regarding my 2nd order (error i made)when i received answer from them.in this unprecedent time ,economic hardship not only come for small /big business also for the consumers.please take care one each others.", "rating": 3}, {"title": "Always love the furniture and prices", "text": "Always love the furniture and prices. This is the second time I’ve had issues with delivery but did get it fixed quick.  Other than that no complaints!", "rating": 3}, {"title": "Great service, okay furniture", "text": "The service provided to us in store by Charles was amazing . We were disappointed when the products arrived to our doorstep. We were missing several core pieces to the bed frame. Our dresser had a screw that had fallen out. My husband discovered it was from what appeared to be a “stripped” part of the dresser and he had to rig it to where it would work. The nightstands were the only thing in perfect shape.", "rating": 3}, {"title": "I gave 3 stars because I had missing…", "text": "I gave 3 stars because I had missing items with my sofa. They redelivered a new set 3 days later with everything that was missing.However, the sofa set is really nice.", "rating": 3}, {"title": "Ive already gave a review. But here it is again", "text": "Ive already gave me review but overall it was okay. When we arrived we were greeted and they seemed friendly. When i picked out my dresser and i went to the same guy that greeted me, he had a whole different attidue. He rushed my order and didnt describe to me what i was signing. He made me initial this part saying we had discussed the 3 year warranty which is not true! He never mention that to me and i would have got it. He also made a comment both me and my wife didnt like. He asked if I would like installation for this price, and i politely declined and he said \" I figured\" He made me feel cheap when i was buying a 500$ dresser. When it was deliveried it was all assembled. I didnt have to do anythhing other than turn the handles around so i didnt know what his deal was that day. The delivery guys were great and gentle with my stuff. He offered to put it in the house cause it was heavy and im glad he did.I went to the Mesquite location. Thanks!", "rating": 3}, {"title": "Not so good delivery", "text": "My experience at the store was good but delivery was not... I didn’t receive a 15 min window call to inform me that my purchase was on the way.... and yes this was a contactless delivery as I said with no call to inform me that they were 15min away. When I received a call from the store to ask how the order was is when I found out it was at my door. When my order arrived the packaging was partially torn off... I ordered a mattress set that had been dragged on the ground uncovered and torn from dragging it! I felt like that issue should have been fixed that day as I had already prepared my space to receive my new mattress set instead I was told they couldn’t locate the driver who dropped the order to my house to come back to pick it up and get me another undamaged set so in my opinion there was no real urgency to resolve the problem as a result I had to wait till the next day. Good customer service is very important to me especially when I’m spending money.", "rating": 3}, {"title": "One of my pieces is damaged", "text": "One of my pieces is damaged. Other than that it was good.", "rating": 3}, {"title": "The Easy, The Good, and The Flaw (not good)", "text": "the online process was easy.  the delivery was good, but i did not like the fact that the rug ordered was discontinued and no one reached out to tell me or email me.  the payment was made including the rug.  the delivery driver told me when they arrived that the rug was discontinued and said they should have or will reach out.  7 days later nothing.  No reach out, no email, no refund, no credit back to my credit card.  Called on the 7th day and the representative said they will research and call me back.  4 days later nothing.  I called again.  was put on hold and subsequently disconnected because i was on hold for so long. good thing i called back because i got a rep named Jackie who was helpful and explained there was a flaw in the system because it was not noted that the rug was not delivered but she could see that it was not and would make a request for a credit back to my card.  i hope this is the last call to resolve this.  and if it is, thanks Jackie.  if its not, shoot! here we go again.", "rating": 3}, {"title": "Disappointed in the way the exchange of…", "text": "Disappointed in the way the exchange of my mattress was handled. It was totally different than what I was told when I made the purchase.", "rating": 3}, {"title": "Prices were good", "text": "Prices were good, they were HOURS late on delivery and no one called. Even after we got the message saying they would be here in 30 mins, it took them another hour and 15 minutes to show up. I would suggest not trying having them deliver, especially if you’re having to take time off work to wait for them", "rating": 3}, {"title": "Customer Service is Key", "text": "I would have given 5 stars but the manager over charged me I had to go back to the store for a refund. That was a huge inconvenience. The sales rep was nice but she over talked me and ended up having to apologize. One thing I would say is LISTEN to what the customer is saying don’t assume you know what they’re going to say. As an Operational Manager that annoyed me to no end I almost went elsewhere but my partner wanted me to give her another shot.", "rating": 3}, {"title": "We had to return the table & chairs", "text": "We had to return the table & chairs. It appeared to be rotten wood and the quality was very poor.  The guys in the store were very kind.", "rating": 3}, {"title": "Nice people but given Damaged product.", "text": "People were very friendly and helpful but I came all the was from out of town to pickup furniture and when I got home a handle was not on like the rest were and it’s because the hole for the piece was not positioned correctly to fit and part of the piece is also missing. Someone just threw it in the box anyway and packed it up. Now I don’t know what I’m going to do and I’m very upset about it.", "rating": 3}, {"title": "Delivery guys were prompt and…", "text": "Delivery guys were prompt and courteous. The chairs to our table are poorly made. Very rough and inconsistent wood.", "rating": 3}, {"title": "three different people told us three…", "text": "three different people told us three different dates on delivery, I picked it up on 3/12/20 and half way home got a call my product was in , told the individual that called that. then discovered that wrong chairs loaded so will return to pick them up on 3/13/20 , if did not like your product would be more upset .", "rating": 3}, {"title": "Delivery promise was not kept", "text": "Delivery promise was not kept.   Promised a morning delivery ended up a evening delivery.   Coffee table glass didn't properly fit and replacement date had to be established.   Again requested a morning delivery but didn't get it.  New delivery men looked at table and didn't have to replace.   Glass just had to be switched from top to bottom.   Terrible.", "rating": 3}, {"title": "Happy but was unhappy", "text": "I didn't have a State issued ID but I did have my military ID. At first I was denied service and left alone by the salesperson. I continued to shop and spoke w/ someone else and showed my military ID and all went smooth from there. I felt like since I wasn't buying anything today due to my ID that I was left alone. But as soon as it was confirmed I had a valid ID the service went to where it should have been in the beginning. I advised I was going to purchase when I got my new TX ID but the sales person just went to someone else. So in the end she didn't sell me anything. I knew what I wanted and someone else provided the service to me.", "rating": 3}, {"title": "Wet Furniture and wrong clock", "text": "I purchased sofa,love seat, recliner and also a wall clock.  The sales person was good.  My problem is with the delivery.  On the delivery day it was raining very badly and when the delivery drivers came to my home the furniture was half covered and the recliner had absolutely no plastic on it and the driver while brining in the love seat LEFT the recliner sitting on the edge of the truck with a CLOTH moving cover on it which means water still got on the furniture due to heavy rain and it saturated it.  When I spoke to them about hey were nonchalant about it and asked me can they use MY expensive paper towels to wipe the furniture down.  I told both of them that I was going to call and complain, he told me that they were suppose to cover the furniture at the warehouse and I told him you could of told them the issue and made sure it was covered.  I called and spoke with a young lady at the home office and she said that she would note it and that was it.  Note please make sure that the furniture is secure when leaving the warehouse. I also purchased a wall clock and guess what the number 8 is before 7 which means my clocks goes 1,2,3,4,5,6,8,7,9,10,11,12!!!! I was going to return it but my wife said that it was funny and left it.", "rating": 3}, {"title": "The sales staff was friendly and…", "text": "The sales staff was friendly and helpful. we were waiting for word that the loveseat had arrived so we could pick it up, but had to call to find out it had arrived.", "rating": 3}, {"title": "Footboard screws misaligned", "text": "Customer service was great! However, the set screws on the footboard I purchased were misaligned. Therefore, the slanted bed rails led to a slanted bed. Currently in the process of getting it replaced.", "rating": 3}, {"title": "Measurements Necessary on Website", "text": "The tables I ordered weren't in my local store, which was not a problem except that the website failed to have the measurement for the length of the table. It only had the measurement for the height and width. I chatted with someone online who said that they weren't able to give me that information either. Then, I called the local store in Weatherford where they didn't answer the phone during business hours. Then I called the store in Fort Worth which tried to get the information, but was unsuccessful. Your website is lacking in vital information on numerous items.", "rating": 3}, {"title": "Had to take table and a couple of…", "text": "Had to take table and a couple of cushions from the chairs back. Table had damage to it and the cushions were dirty.", "rating": 3}, {"title": "The shopping experience was fantastic, the call for service lacking", "text": "The shopping experience was fantastic, the choices of good product, and on site staff is great. However, once the product is delivered, if there is a defect. I am finding a disconnect between the sales department and the service department. Plus, trying to contact the sales department is up to you, the customer. Not the store. And has proven an impossible task, as the automated service call center keeps hanging up without connecting my calls. So in that I am truly disappointed, and caution all to be aware.", "rating": 3}, {"title": "I made a purchase and got the wrong…", "text": "I made a purchase and got the wrong color deliver and I was told it was a lighting issue in the store.Did you do anything about it?Nooooo so be aware that you get what you want and not want is given to you!Dissatisfied customer", "rating": 3}, {"title": "The service at the store was great and…", "text": "The service at the store was great and I was very pleased with the employees that helped me find the furniture I wanted. The delivery was very disappointing. The delivery guys were rushing and making mistakes. One guy fell while bringing the couch in because he was moving to fast and not paying attention to where he was walking. They were dropping tools and dropped my table top. Thankfully it was protected with a cover. The most disappointing was they delivered my ottoman to the wrong house and lied to me and said they were going back to get it and will deliver it to me that same day. I never heard from them so I called the number for the delivery guy and it went straight to voice mail. So I called the customer service # provided to me and found out that my ottoman was waiting to be delivered as I had to schedule another delivery day and time. In the end I finally got all the pieces delivered and I do love my new furniture.", "rating": 3}, {"title": "Delivery gone wrong", "text": "The store experience was wonderful. I was greeted immediately, offered something to drink, and the sales person was not over bearing she would check in with us every few minutes or so.   Delivery didn’t go well.  The guys damaged my wall, promised to come back, never did and they didn’t notify the office of their damage.  I was later informed to take a picture and submit to the office.", "rating": 3}, {"title": "The customer service was awesome but…", "text": "The customer service was awesome but delivery was a bust. I asked for my furniture not to be taken out the boxes and they still did. I don’t think I will be ordering from them any time soon. But I do love the store and customer service.", "rating": 3}, {"title": "The 1st time i opened an account it was…", "text": "The 1st time i opened an account it was awesome. however the 2nd time not so great. Acima customer service was horrible.", "rating": 3}, {"title": "Not the best quality", "text": "The quality of the furniture is not as expected.  The footboard that was delivered to us was full of defects.  We couldn't believe it would even pass the basic inspection at the factory.  They had to re-order and redeliver another footboard.  The 2nd footboard still had defects, but minor and the technician came to our house to fix them.", "rating": 3}, {"title": "Forgot to send out mattress and Box…", "text": "Forgot to send out mattress and Box Springs with furniture, Call store to no satisfaction manager would not talk on the phone was told by clerk similar call me right back did not get a call back for 2 hours", "rating": 3}, {"title": "Service was fine but.....", "text": "Service was fine. But the chairs back still does not meet up with the armrest on the right side", "rating": 3}, {"title": "Delivery wait too long", "text": "We love the couch. They delivery guys were nice & polite when they arrived. The problem is the extra long wait. Home Zone needs to fix that. Waiting around for 6 hours is too long. If you can only give a 4 hour window, call a whole hour before so people can plan. Don’t keep changing it every hour and then an extra 2 hour wait.", "rating": 3}, {"title": "3 weeks into owning and the chair…", "text": "Okay, I can assume the cushion would start breaking in.What about the extreme tension on the foot rest?", "rating": 3}, {"title": "Sales people where great and we loved…", "text": "Sales people where great and we loved furniture. The followup left a lot to be desired, the bed slats that were supposed to be screwed in place fell out the day the bed was delivered. Requested to have the short screws replaced with longer ones - never heard back from Home Zone. Otherwise our overall rating would have been a 5.", "rating": 3}, {"title": "Carpet", "text": "The throw carpet that I wanted was out of stock but there were two on the showroom floor. I was finally able to talk them into selling me a display carpet like the manager did last year. I would think that there should have been a discount for it being off the showroom floor but that was not offered this time either like it was last year. The product itself is exactly what I needed, but the customer service was lacking.", "rating": 3}, {"title": "Although the guys that delivered the…", "text": "Although the guys that delivered the furniture were very rude with my daughter on the phone and when they came to deliver my furniture. I graciela was the one at home when the furniture was delivered and they were very rude they said they had been waiting that was a lie I was waiting for them all morning long. I waited at my daughter's apartment for them after working a night shift. Can't complain about the guy who sold us the furniture he was very nice.", "rating": 3}, {"title": "Not so good 😊 in the beginning.", "text": "Not so good 😊 in the beginning.However, I originally wanted my sofa setup in a location of the room. But the guy suggested something else, which I didn’t like. And to add it was a trip hazard with the electric cords and told me to use a tie wrap. Well, after a day of the ugly location, I moved the sofa myself with my original idea and its perfect.", "rating": 3}, {"title": "the wrong part", "text": "The warehouse people gave us the wrong parts to our couch and we had to drive an hour to and from to get the right one", "rating": 3}, {"title": "Honest", "text": "The staff was wonderful. The delivery was awful.", "rating": 3}, {"title": "The salesman was great but the delivery…", "text": "The salesman was great but the delivery sucked!! I couldn’t get my queen box spring because I was it would not fit upstairs. I went to Big Lots the same day got the same inch box spring and didn’t have any problem taking it upstairs.", "rating": 3}, {"title": "Delivery truck employees are not…", "text": "Delivery truck employees are not professional,damaged my furniture in 3 places while offloading it,called to do the repairs and showed up after 3days.If I wanted to buy a damaged piece I would buy a used furniture or the one at the showroom at a much cheaper price.", "rating": 3}, {"title": "Quality Assurance for Persons Assembling furniture!", "text": "Sales person Great.  Dinning chair bolt strippped causing wobbly leg.  Requested replacement and offered to return to store and pick up replacement   Paid for extra warranty but did not want 4 hour time window.  *****Was called by store and advised replacement was ready for pick up.  Upon arrival chair was still in box and not assembled. *****", "rating": 3}, {"title": "Replacement", "text": "I had an issue with my couch and Katie from Home Zone was VERY swift in reaching out to me and making things right. Even though I passed on the insurance initially Home Zone offered to replace the couch for free. I wished they would have delivered my replacement and picked up the broken couch but hey : )", "rating": 3}, {"title": "choose the pick up option instead of delivery", "text": "Our furniture is incredible and buying it online was super easy & convenient. Unfortunately I can’t say the same for the delivery aspect. Wish we would’ve picked up instead of PAYING for delivery we ended up not happy with at all. The men that delivered were nice bringing the furniture into our home but when it came time for me to sign for the furniture, they said they couldn’t get signal and that they had to leave because they had another delivery. I understand that they needed to make a delivery but when he asked if he could “just sign for me” I said no and I wanted to sign. I told him I didn’t want anything to come back negatively on me or them: He then said “it’s fine, the furniture is in your house” And walked away from me. So I never actually even signed for my furniture. I found that to be incredibly unprofessional. I had company over while they were delivering and even they said they weren’t comfortable with what just happened.", "rating": 3}, {"title": "I loved Home zone when I walked in…", "text": "I loved Home zone when I walked in because everything seemed like such great quality. I purchased my dining room table and six chairs a little over a month ago and my fabric is already coming loose on my one of my chairs and my table feels uneven. The designs are not I am just not sure how long my table set will last.", "rating": 3}, {"title": "Service Too slow", "text": "I thought it too way to get everything set up.", "rating": 3}, {"title": "One of the chairs is already broken", "text": "Date of experience: December 03, 2019", "rating": 3}, {"title": "We where very happy with Hope and the…", "text": "We where very happy with Hope and the rest of the sales team. We are not real happy with the product we received.", "rating": 3}, {"title": "I wasn't given all info on product but…", "text": "I wasn't given all info on product but I'm ok", "rating": 3}, {"title": "In Store Customer Service is less than…", "text": "In Store Customer Service is less than desirable, but pricing & promptness of delivery was as expected. The set-up guys were very respectful & professional.", "rating": 3}, {"title": "Everything was awesome except the…", "text": "Everything was awesome except the delivery experience.  I was very disappointed in this part of the process.  Salesman and every other aspect was great.", "rating": 3}, {"title": "The cupholder/charging board on the…", "text": "The cupholder/charging board on the sofa is dislodged. The delivery folks did not check it before departing.", "rating": 3}, {"title": "If it hadn't been for Joseph", "text": "If it hadn't been for Joseph, General Manager, I doubt that I would have found the nightstand I was looking for.  I'd purchased one a few months ago and was looking for another one like it and Joseph found one in Richardson, TX.  I had to ask my daughter to go pick it up for me but I wouldn't have known there was one there had Joseph not stepped in and checked for me.", "rating": 3}, {"title": "It was ok overpriced", "text": "Date of experience: November 01, 2019", "rating": 3}, {"title": "Not happy with quality of the bed", "text": "Date of experience: October 27, 2019", "rating": 3}, {"title": "I’ve already had to have the stitching…", "text": "I’ve already had to have the stitching fixed on the arm of my couch, so that is disappointing. I’ve only had it a few months.", "rating": 3}, {"title": "Not happy with process and service.", "text": "I am not happy with the fact that when my bedroom furniture was delivered I was not able to sleep in my bed due to parts being missing which resulted in another trip being made from Home Zone. The whole process of me getting down what was asked of is talking time out of my days having to set away waiting for delivery of furniture and repairs to be made as well as pick up service. This is my first time with Home Zone and hope to see this process improved or I will no longer be a customer.", "rating": 3}, {"title": "The customer services was not that much…", "text": "The customer services was not that much good", "rating": 3}, {"title": "I have to drop my initial experience…", "text": "I have to drop my initial experience from a 5-Star rating to a 3-Star due to the issues I experienced with the store selling me items that were no longer available on one day when I paid a deposit for the layaway, then when I showed up to select something else the items were all of a sudden available the very next day.  Then the store manager pretty much put us in a catch 22 situation that forced us to pay for that item due to it being the only one there. After that they mixed up the delivery days requiring me to have 2 fees for delivery.  Which absolutely didn't make sense.  Yes it was removed, but after all of the frustration they put us through, they should have wavied all of the delivery charges.  They offered no compensation or discounts for the confusion and errors they created.", "rating": 3}, {"title": "Great prices on most furniture", "text": "Great prices on most furniture.  Nicely redone showroom (Denton, TX location) .  Staff is not as professional as I would have expected.  Accessories like light fixtures or architectural pieces were VERY high priced for the price of the furniture you are selling. Sales information was confusing and somewhat misleading.", "rating": 3}, {"title": "Table is not the quality expected", "text": "Table is not the quality expected. Don't see it lasting very long.  For the price its dissapointing.", "rating": 3}, {"title": "Bad Delivery and Installation Service", "text": "Bad delivery service. Employees didn't finish installation of sofa recliner set and left all the trash in front of my house which I had to throw away. They left without telling me. I had to call to tell the company about the situation and to ask them to resolve my issues. I had to wait about a week to resolve my issues which I'm not happy about. I hope the company trains their employees to be more professionals.", "rating": 3}, {"title": "Good couch, terrible delivery", "text": "I am happy with the couch but unhappy with the service provided during the delivery. The delivery men were unable to make the couch fit through the doorway. They attempted to force the couch through and caused some damage to the frame. In the process, the couch was stuck and they proceeded to force the couch back out, bending one of the couch legs in the process. When I asked them to remove the legs to get the couch through the door frame, they claimed they were unable to and did not know how. They also did not have the equipment required to remove the legs, so they claimed. In short, the delivery resulted in damage to my door frame made by a crew that did not have the equipment or know how to remove the legs from a couch.", "rating": 3}, {"title": "Not impressed", "text": "I walked through the whole store before anyone noticed me or asked if I needed help. Finally, a young woman who had just arrived to work spotted me and asked if I would like a water. She was very nice and helpful. Unfortunately, I wasn’t overly impressed with the craftsmanship or quality of the bedroom set I came in to see. I will keep looking.", "rating": 3}, {"title": "Poor customer service but nice table and chairs", "text": "I love the Daisy dining set I bought from Lawton Homezone, however I ordered it online which led to the employees not having a clue when it would be delivered to their store so I could pick it up. I was told it would be “7-10 business days” by one employee, and “I don’t have a clue” when it would arrive by another employee. It ended up taking 17 days (12 business days) to get to the store. When I picked it up I asked two employees if we could open the boxes and inspect them before I took them home. The first guy told me the loader would go over it with me, then the loader said it’s wrapped up good in the boxes and if there’s anything wrong with it when I get home to let him know and he will fix the issue, pretty much letting me know he wasn’t going to open the boxes. He then told me to initial here and there, then sign here. Where I signed it said I was agreeing that I had inspected the furniture prior to leaving the store. Thankfully there was nothing wrong with it and it looks nice because I doubt they would’ve made it right since I signed that paper. I love the table and sage green chairs but not sure if I’d buy from them again due to the poor customer service.", "rating": 3}, {"title": "Our salesman was very nice and seemed…", "text": "Our salesman was very nice and seemed knowledgeable. The delivery guys were in a big hurry, not very personable or helpful. They did not even remove the plastic wrap from the bed. I had to remind them to leave the mattress cover we purchased which is an absolute joke! The mattress cover is the flimsiest, poorest mattress cover I have ever seen. We would not have purchased it had we seen it beforehand. We could have purchased a top of the line mattress cover for half what we were charged for the one Home Zone has you buy to fulfill part of the warranty on the bed. Had I known all of these things prior to purchasing, I probably would have bought elsewhere.", "rating": 3}, {"title": "Don't have an opinion ordering my…", "text": "Don't have an opinion ordering my furniture don't have it yet", "rating": 3}, {"title": "The price and customer service was good but....", "text": "The price and customer service was very good. Only problem is my dining room table arrived broken. Still waiting for them to comeback and fix it.", "rating": 3}, {"title": "Furniture is really nice", "text": "Furniture is really nice, they just had the wrong piece which made me have to wait for another delivery. Other than that all was well and would definitely shop there again.", "rating": 3}, {"title": "My recent purchase was a mistake", "text": "My recent purchase was a mistake, the bed I got is not comfortable, factory order came in much firmer than in the store,", "rating": 3}, {"title": "Buying experience was fine", "text": "Buying experience was fine, salesman was great and got everything done quickly and easily. Pickup was not enjoyable. I had to stand in the heat for over fifteen minutes not knowing that there was no one in the warehouse because the people at the front desk had not communicated with them. Then had to wait longer because the front desk had not given me a pick-up sheet, so the warehouse guy had to go up front and get one.", "rating": 3}, {"title": "Not very satisfied", "text": "salesman was very persuasive. We were surprised to learn delivery would take three weeks. It was partially delivered 4 weeks later after we called to check on it. The mattress was delivered & set up but head & footboards backordered - ought to be in late August. Not here yet.", "rating": 3}, {"title": "It was a nice experience", "text": "It was a nice experience. Salesperson was really helpful", "rating": 3}, {"title": "Didn’t get much help with picking out…", "text": "Didn’t get much help with picking out my actual pieces and they didn’t help me with my price range so I was my own sales associate. I did however enjoy the woman who checked me out in the end. She was good conversation but wish I had a sales associate to walk me through the process. Also, when my furniture was delivered one of the men delivering my furniture made me extremely uncomfortable and wasn’t in any sort of furniture zone attire. If it wasn’t for the other gentlemen in his t shirt and his social skills. I wouldn’t have let the other man even in my home how uncomfortable he made me feel. Lastly, they sent the wrong rug with my order and left it up to me to track down my 600$ rug. Then When I went to pick up said rug after already paying for delivery, my rug wasn't even in the store. So I had to make two separate trips to pickup the rug on my own.", "rating": 3}, {"title": "Friendly staff, lower quality furniture.", "text": "The salesmen are always very friendly and easy to deal with. The furniture isn’t high quality but, for what you’re paying, it’s what I would expect. I would only caution if you do purchase anything to inspect it prior to leaving. I had to return a painting that was extremely out of square and would not hang straight. Even though they did agree to accept it on return they charged a re-stocking fee...  Which I did not notice until I got back home and looked at my receipts. I also purchased an entry table, one of the top boards either wasn’t nailed in properly or wasn’t glued in properly. Either way, my husband has had to repair it so it looks right, thank goodness for handy husbands!Their accessories on the other hand, pillows, vases, planters, etc., they are all adorable and reasonably priced. I will continue to buy accessories there but I doubt I will ever buy any furniture from them again.", "rating": 3}, {"title": "Just ok", "text": "Just ok. I initially felt like we were getting a great deal but it turns out we got the quality to match the price. Not bad just not as nice as we originally believed", "rating": 3}, {"title": "The customer service was great and…", "text": "The customer service was great and everyone was more than helpful. My issue is with the service department. I called to question a piece of furniture and seems damaged. I have not gotten any type of response from them.", "rating": 3}, {"title": "A delivery service team that showed up…", "text": "A delivery service team that showed up without any tools to setup ? A setup of a bed that did not include all the screws to attached the platform board to the frame ?Looks and materials of the items bought looks and feels great, delivery and setup is the miss.", "rating": 3}, {"title": "Please inspect your furniture top to…", "text": "Please inspect your furniture top to bottom.  Maybe take pictures ... While my issues was resolved it took a fight for a week to resolve. Caution if your buying a last piece that's on floor and they discount it. Ask WHY!! Again inspect the furniture before you buy.", "rating": 3}, {"title": "The customer service is the bomb", "text": "The customer service is the bomb, loved the employees. I don't like the wait time to get my purchase. I bought a table and it is out of stock. I have to wait 3 weeks to get it. That's not cool. It don't like that at all.", "rating": 3}, {"title": "We ordered 2 pieces of furniture for a…", "text": "We ordered 2 pieces of furniture for a Monday pickup. (this sale was on a Fri) Our friends were there Monday morning to pickup and were told that the furniture had not come in yet. We were not aware that the pieces were not at the store when we bought them and nobody told us that they had to order them. This proved a difficulty to us as we did not have any way to pick them up. Finally, after going back and forth with the manager, he agreed to deliver them at no cost to us for which we are grateful. In the future, it might be a good idea to train your employees to tell buyers of the delay in delivering your products. Our last piece of furniture that we bought at your store in Weatherford went smoothly and that was the reason we bought again at the Waco store.", "rating": 3}, {"title": "Delivery issues", "text": "It was delivered on time and assembled quickly. Thank you for that. But sofa was opened and not boxed or covered in the truck. I can see dust and scratches on leather easily.", "rating": 3}, {"title": "My Dissatisfaction With Home Zone Furniture", "text": "The sales experience was good. I purchased bedroom furniture and expensive mattresses. I went back two weeks later to see about an exchange on the mattresses because I am experiencing back and hip pain.  I was told by a manager that I had to wait sixty days to give mattresses a chance to adjust/settle. If they are causing me pain, as the customer, I should be allowed to exchange them or receive a store credit. I paid for a product that I am not pleased with but the store has control of my satisfaction. Not a good experience.", "rating": 3}, {"title": "Service was great - small issues with product", "text": "Service was great, delivery guys were nice, fast, and helpful. There is a small crack in my headboard and the drawers underneath my bed are not level.", "rating": 3}, {"title": "Good but one small issue", "text": "Customer service was good but one piece of my furniture, a storage drawer in bed, is not functioning properly. It was not anything that could have been seen during inspection of Furniture.", "rating": 3}, {"title": "Sorry We can not assist you", "text": "In store service was Great..  the product on the other hand not so much so. we have had the table a little over 3 month now and the top is bubbling where the glue is not holding. When i called the store they said sorry we can not assist with any repairs because the extended warranty was not purchased.  I would think on a $1000.00 table the workmanship and quality would last more than 3 months.  But i guess not.  Guess we wont be sending one else to this store.", "rating": 3}, {"title": "Home zone experience", "text": "The associate was amazing. Shannon did an excellent job with customer service even contact during the purchase and after delivery. Pricing was above average for quality of merchandise.Few problems encountered were not being able to purchase items the same day. We were then ushered off to three different people while they juggled who would check us out. They pulled our associate who was doing an excellent job to assist another customer. Next problem was upon delivery sales team lost the pick up ticket. It took 3 sales members to correct it after I was accused of purchasing only another item which I did with a separate receipt. I showed both receipts and almost 30 mins later they corrected the issue. The original associate was off duty that day or I feel it would have been easier. Aside from shannon the associate and the pricing the experience was not the best.", "rating": 3}, {"title": "Store experience nice; delivery experience horrible.", "text": "Good experience with your non-commissioned salesperson, Jessie!  But, your weak point is your delivery services you contract with.  They dropped my leather sofa and literally broke it.  The matching loveseat had an unrepairable scratch in the leather.  Everything was sent back. I had to wait a few more days and coordinate again with another delivery crew to bring another sofa/loveseat set.  Now, when you sell $1000's of dollars of furniture, and then it is loaded into a delivery company's truck 10 to 12 feet high on top of each other with ZERO blankets or covering (we checked inside the truck), how can folks receive perfect, intact, and well-cared-for new furniture, I ask you?  But, Lexi, the assistant manager, took care of the second round of deliveries very nicely, as did one of their staff, who accompanied the same 2 dingbats who delivered the furniture the first time.  They dealt with this situation as best they could and they enabled my furniture to be delivered the 2nd time with no imperfections.", "rating": 3}, {"title": "Waco store and people are great my…", "text": "Waco store and people are great my problems is with the service department in Grand Prairie tx can't talk with someone live always get a voice mail even during normal working hours", "rating": 3}, {"title": "We didn't pay much but manager insisted…", "text": "We didn't pay much but manager insisted on 100 extra if we took a box spring that was with another mattress, but not matching, with our mattress, the only other mattress was on top of the only box spring. We went with the put together set because it had the boxspring. . We were told many many many times that our purchase was non refundable.  The box spring was packaged in plastic still so we didn't see the broken deep hole almost in the center of the box spring until we got it home and plastic was removed. We were even made to sign papers saying we understand no refund. Lol twice. ....  How is this right? The single mattress was already 100 more than the put together set. Which I completely understand,  it was better quality.", "rating": 3}, {"title": "Not very good at first but it better…", "text": "Not very good at first but it got better towards the end of the visit.", "rating": 3}, {"title": "furniture is NOT quality   cheap & wont…", "text": "furniture is NOT quality   cheap & wont last long  will   not hold up to kids..nice for display  but that's about it!", "rating": 3}, {"title": "I found some fabulous chairs and the…", "text": "I found some fabulous chairs and the sales associate was very helpful and the manager to locate some in San Angelo. Unfortunately troubles started there and the two weeks delivery extended in 2/3 weeks there's some confusion about where the chairs should go I'm not sure what happened. The chairs were in two boxes of two one of the boxes the chairs contained no screws Bolts Etc. We were able to get some bolts from the store but then discovered that one of the legs have been manufactured incorrectly and it did not have some parts on it. The manager worked really hard and located two more chairs for us we now have all four. The staff could not have been more helpful but it took over a month to complete and I am disappointed with that part but love the chairs", "rating": 3}, {"title": "Satisfied but slow down", "text": "My furniture is very nice. The salesperson (Miguel) was awesome. I have 3 stars because of delivery. Please stop booking the delivery guys to the max. When you all do this it makes it hard to really inspect and look over the purchased furniture to make sure everything is good. This is how you all get bad reviews. It puts us in an uncomfortable position because we're making sure all is well. Or at least trying to. My deliver guys were in such a rush that I had to go outside to get them to come back in and help me with my loveseat.", "rating": 3}, {"title": "The first sales person was perlite and…", "text": "The first sales person was perlite and great. Only problem was that the wrong chair was delivered to the house. We went back to pick it up from the store and another Sale person wanted to argue with me about the price that we need to pay for the difference of the chairs. Other than that, it’s a nice place to shop with good furniture.", "rating": 3}, {"title": "Ella in the Marble Falls store is…", "text": "Ella in the Marble Falls store is fabulous. The issues we had we're totally out of her control. We bought a sofa, recliner and occasional chair. Upon delivery of the furniture, the sofa had a tear and scuff marks. The chair had a hole on the side and the recliners reclining mechanism was faulty. It has all been reordered to be delivered next week and Ella was very accommodating but what a let down. We were very much looking forward to having our new furniture in for my Dad's birthday party this weekend. Again...no fault of the delivery drivers and Ella was wonderful. We will be back for our future needs.", "rating": 3}, {"title": "Love the furniture, but . . .", "text": "Love the furniture, but some how when the employee and I went through the inspection we did not notice a bag of screws to put a table together was not with it.  I dont know what comes with the piece so I would think the employee should so they can insure all is there.  Able to get what was needed at the hardware store, but a bit frustrating.", "rating": 3}, {"title": "We decided top buy a new bedroom suit…", "text": "We decided top buy a new bedroom suit and while in the store noticed a table we really like and decided to buy that also. So the deal was made financing was approved. Was told that all pieces will be in stock for a pick-up in a week. 1 item was to be transfered from another dealer we were told the chest of drawers. We were supposed to get a call when items were in for pick-up. No call after 12 days, so we called and my salesman was not at work, so I ask to ck. the status of my order. The woman told us the chest wouldn't be in until the 30th of May. Then I stop in the store 2 days later and found my salesman, he said May 22 or 25th. Get all you stories straight and be honest. None commission sales people. Ha! Ha! We live out of town so not happy about the whole deal. might have to make the first payment and not have all our stuff!!!!!", "rating": 3}, {"title": "My Personal Experience", "text": "Overall, the customer service was great. Immediately after receiving the furniture we have been having issues with it. The return policy wasn't disclosed with us when it should have been. I must say, their service department has been considerate and are trying to get the issues resolved.", "rating": 3}, {"title": "My set was nice", "text": "My set was nice. Any store in any other state always gives you some sort of gift for spending so much money. Home zone doesn’t, but they did scratch up my footboard upon set up though.", "rating": 3}, {"title": "I really like the product that I…", "text": "I really like the product that I purchased. The couch I bought had 2 consoles that were damaged during delivery. The customer service contacted me the next and told me it will be another week before they can deliver the consoles to my house because they only deliver to that area on Thursday. I paid a lot of money for the couch and it was damaged during delivery You would think they could deliver the damaged pieces ASAP. No I have to wait another week", "rating": 3}, {"title": "The staff was helpful in the showroom…", "text": "The staff was helpful in the showroom but forgot to call once furniture arrived for pick-up.", "rating": 3}, {"title": "Love my furniture, not great at follow up.", "text": "The purchase process went smoothly. The delivery went well although there was some communication issues. I contacted dispatch at the number the delivery guy gave me and I haven't gotten any response to a concern I had about my loveseat.", "rating": 3}, {"title": "Wish I was able to bring future home…", "text": "Wish I was able to bring furniture home like other furniture places rent to own...to only find out that your furniture might not be what you pick out the longer you take to get it out", "rating": 3}, {"title": "Wrong pieces...", "text": "I bought a large sectional and waited over an hour for them to bring it to the front on the day it was ready for pick up. It took two hours for us to get it in the house and unwrapped, only for us to find that they gave us the wrong pieces. I called the next day and they said they would have someone deliver the right piece and put it all together for us since we had such trouble in the first place. We waited at the house all day for them and they showed up around 5:30 pm, picked up the wrong piece, gave us the right one, and left. They didn’t help us put it together or anything like we were told they would. It would have been nice to get the right piece in the first place but then they could have at least put it together like they said they would.", "rating": 3}, {"title": "The initial sales experience was…", "text": "The initial sales experience was wonderful. The sales people at the store were great. They listened and helped us as much as possible. However, upon receipt of the furniture, things go a little left. Immediately after delivery, we experienced an issue with the couch. We haven't had the sofa a good week. Not to happy with the service after the sale thus far.", "rating": 3}, {"title": "Missing Screws", "text": "The delivery was on time and initially, I thought the delivery and set up was good, I had to get back to work right after the delivery. The next day however I went to open one of the drawers on the bed and it was missing 3 screws on one side and there were some scratches on the same draw. Other than that.", "rating": 3}, {"title": "Good/Bad", "text": "The buying experience was fantastic. The delivery was sub par. Staff was not friendly, there was a small knick in the corner of the bed. We also noticed a large bend in the adjustable metal base. However, we were not afforded the time to take a look at the furniture before the deliver crew had left.", "rating": 3}, {"title": "They have some good stuff here", "text": "They have some good stuff here, but like most furniture I find in chains, the quality is lacking when it comes to some areas. I bought a dining set, 7 PC. and it was on sale for $900. Very reasonable. The wood is all very good quality, but the padding and chair upholstery is quite cheap feeling and it will not stand the test of time. I fully expect to replace them within 3 years. And that's honestly fine for the $88-$100 they cost if sold separately. All in all it's comparable to Rooms To Go or something like. I looked there too and still came back to Home Zone. I highly recommend paying for assembly and delivery so you can see any flaws once it's assembled and have them return it for you.", "rating": 3}, {"title": "Nice store but the staff was a bit…", "text": "Nice store but the staff was a bit unprofessional and really didn’t know much about products. Either the manager or shift leader was very helpful though", "rating": 3}, {"title": "Particle board.", "text": "After all the talk about how this furniture is superior and made in america, we get our dining set delivered. Two chairs fell apart because the particle board was damaged. Particle board. Replacement was easy, received two more the following week however knowing that its cheaply made makes me leary of buying any other furniture from home zone.", "rating": 3}, {"title": "I am very please with my furniture…", "text": "I am very please with my furniture except when it was delivered all of the power cords were not plugged in so now our power outlet and phone charging ports do not work.  I called and left a message for the service department to call me so we could get them back out there to fix this.  I have not received a return call.  Mr. Burkham is a disabled veteran and 70 years old.  I am over 60 and we are not able to tip couch over to get the cord out from under the unit so it is pretty much useless to us at this point.  I am very disappointed with the service that we have received.", "rating": 3}, {"title": "Excellent In-store Experience", "text": "I would love to rate 5 stars because I had an amazing experience up until delivery day. The delivery guys were extremely careless; a brand new light fixture was broken and one of the delivery guys had the audacity to voice his displeasure with how HIS DAY was going instead of attempting to remedy my issue.I'm definitely going to shop again with Homezone - but I'll be picking up my items.", "rating": 3}, {"title": "Got two chairs with shorter legs out of…", "text": "Got two chairs with shorter legs out of the six that came with the table. Thought the delivery guys would have checked and advised us of the issue.", "rating": 3}, {"title": "I am a unhappy customer", "text": "The representatives at the actual store were amazing I had no issues until my furniture was delivered with dents, scratches and not enough support with the lower frame of the bed...When I pointed this out to the deliver men I was told to call customer service and that I could not refuse the delivery. I have taken pics and contact the customer support for assistance which did response only to schedule a service call which a tech person did come out a week later only to not be able to replace my damaged furniture which is unacceptable. I am not happy!!!! The delivery man were unprofessional and did not do a good job delivering my brand new furniture.", "rating": 3}, {"title": "Legs were a little difficult to put on…", "text": "Legs were a little difficult to put on but over all furniture is great", "rating": 3}, {"title": "Mixed review...but quality good.", "text": "We bought the top of their line they carried in king mattresses and box springs.  We really like the mattress, but when they were delivered the underlining of the one of the box springs was almost torn completely off.  The store sent a warehouse guy out within a couple of hours with a staple gun and reattached it.  It was sloppy work, but it is not dragging the floor and you don't see it unless you crawl under the bed.   Unllike the majority of places that sell mattresses, they charged $100 for delivery and will not take your old mattress.", "rating": 3}, {"title": "Need to teach employees about how…", "text": "Need to teach employees about how finance works and when first billing arrives.  Very disappointed", "rating": 3}, {"title": "I was seriously mislead by one of their…", "text": "I was seriously mislead by one of their sales people about financing, availability and delivery. When it was brought to the attention of the Manager, I received an apology. That's it. I told him my biggest issue was delivery. I was expecting free delivery and was informed it will cost $99. I should not have to pay for delivery because 1. I was lied to and 2. plenty of other furniture stores offer free delivery. Delivery is important to me since both my husband and myself have had back surgeries and cannot lift and maneuver large furniture by ourselves.I only live 1 mile from the store. After all the wrong information and hassle, the least they could do is delver the furniture to us.", "rating": 3}, {"title": "Store experience was good", "text": "Store experience was good. But when items were delivered recliners made popping noise when going up and down.  He said he emailed info but we have heard nothing. They didn't slip them together to stabilize them.", "rating": 3}, {"title": "A Different Finance option and delivery system will give this store a 5 out of 5 rating.", "text": "The Financing options may need to be improved. Too much personal banking information required to establish credit. If you are unable to personally pick your merchandise up from the store you will be charged over $90.00 delivery fee and then you have to select a delivery date and time based on a computerized schedule. If you select a time and have to reschedule, you will be charged a fee to reschedule and you still will not have the option to select when you want the delivery to arrive.  I missed an entire day from work (Non-Paid) waiting for my delivery which was schedule to arrive between 10:00am and 2:00pm which it actually arrived in the afternoon.  The delivery crew was  very professional had an excellent working knowledge of how to assemble the furniture and was very careful not to damage anything. This store have excellent furniture, prices and staff members working there.", "rating": 3}, {"title": "Happy to have a new furniture store in…a few observations", "text": "Happy to have a new furniture store in marble falls. A few observationWas told all sales are final. Wanted to try a certain piece in my house. Was told could not return if not quite right. Could have a “designer” bring things but not just one thing.  Not flexible enough for many I am sure. Also prices on pieces were different in different places in the store. Understand the store had just opened but sales staff was sitting around when I brought this to their attention.   Otherwise your furnishings seemed ok for the price", "rating": 3}, {"title": "Love my new bed", "text": "Love my new bed, but 2 drawers installed incorrectly, never responded to my request to fix.", "rating": 3}, {"title": "The furniture that I purchased…", "text": "The sales lady was great, the delivery guys were great, however the furniture I chose which is the Glam, the dressers scratches easily in less that 2 weeks.. it should have had more layers of paint on them.", "rating": 3}, {"title": "I still have problems with my…", "text": "I still have problems with my nightstand. I got a new one and its still not fixed.", "rating": 3}, {"title": "My experience was so so", "text": "My experience in the store was great but as far as the delivery went very disappointed we paid $99 to have our couch delivered and then upon delivery we received it incorrectly then had to wait another week for the wrong item to be picked up and the correct one to be delivered. We have two young children at home so to have to keep them off the couch for a whole week so that it wouldnt get damaged was very tough and we both work so to have to try and accommodate our work schedule to be there when the new delivery arrived was very frustrating. You guys weren’t very accommodating towards us as far as working with us to get the corrected item sooner.", "rating": 3}, {"title": "We shopped around all afternoon and…", "text": "We shopped around all afternoon and ended up back at Homezone to buy the sofa. And we had ice cream there!", "rating": 3}, {"title": "Customer service A+, furniture not so much.", "text": "Customer service was excellent, furniture not so much. Quality of the furniture delivered is less than that of the show rooms display. Delivery was subpar and stated that the back of the recliner is supposed to move loosely and make noise.", "rating": 3}, {"title": "$1999 package", "text": "When I was inside the store, I was told that the financing was for 12 months.  After receiving the furniture, I learned from Progressive Leasing that I really have 90 days to pay for the furniture.  If I wait the 12 months to pay off the furniture, then the price of the furniture doubles.", "rating": 3}, {"title": "Package", "text": "The queen size bed that is upgraded to was not what I was told it would be. Between the frame. Box springs and mattress I need a step stool to get in it. I specifically told the salesman I did not want a high bed because I can not get in it.", "rating": 3}, {"title": "Overly disappointed", "text": "For over 2,000 spent on one bed, a sofa set and a table with 4 chairs, I'm not too impressed. We were recommended by our military installation nearby. At first glance, I thought \"wow, such great prices\" but after our second and third visit, we realized just how low quality most of their stuff was. My $400 bed comes with only 4 \"wood\" springs, I purchased a mattress else were as their prices were extremely overpriced. Unfortunately, The bed frame is just super uncomfortable and actually, digs in due to the lack of support underneath it. I've purchased king size beds from IKEA with more support under the bed frame and for less than 200. You're better off looking elsewhere before finalizing anything with this store.", "rating": 3}, {"title": "Disappointed", "text": "My wife and I where totally surprised by sales in North Richland Hills store. Very helpful and wished to make our experience great. Problem is we had product defects and they can’t get there act together to fix our issues. We have been trying to have a defective nightstand fixed for at least a month  and half. Twice they have supposed to have had a technician out to fix it. Twice they have dropped the ball. They’re not returning phone calls and not making a effort to remedy the problem. They’re 110% satisfaction guarantee does not amount to much in my opinion. I would not purchase anything from this place in the future", "rating": 3}, {"title": "Left some trash but they were pleasant…", "text": "Left some trash but they were pleasant and very courtesy Think they may have made a tear in the bottom from removing from truck but wasn’t going to send back for small tear.", "rating": 3}, {"title": "Was told that the reclining sofa and…", "text": "Was told that the reclining sofa and love seat only had to be 41/2 inches from the wall to be fully reclined. They actually need to be 7 to 8 inches minimum. Since our living room is not very big this makes it where we will not be able to fully recline.", "rating": 3}, {"title": "Was not greeted when I walk in the…", "text": "Was not greeted when I walk in the store. No once ask if I need assistance. Had to wait 30 to process my check out.", "rating": 3}, {"title": "The delivery was scheduled for 230-630…,", "text": "The delivery was scheduled for 230-630 I had something else to do but I had to wait close to 730 if not I do love my purchase delivery was not on point", "rating": 3}, {"title": "Overall.. A decent place to shop", "text": "Prices are better but shipping is costly... Customer service was okay (not great) but ok. I'd go back.", "rating": 3}, {"title": "The purchase was great, the product not so great", "text": "The purchase was great, however, when we got our dining set home and started to build it, we found a chip in the table and there were missing parts for the chairs. We contacted Home Zone, it's only been 24 hrs but waiting to hear how they plan on replacing the table and providing the missing parts. They said they would get back to us right away. Should we receive a response within 2 days, I will increase my review from 3 stars.", "rating": 3}, {"title": "It would be nice if you can lower the…", "text": "It would be nice if you can lower the monthly payments and extend the agreement for the low-income people. I am on Social Security but that does not mean that I want stuff that is garbage from garage sales. So I go out of my way to buy new. Please consider this if you could lower my payments.", "rating": 3}, {"title": "This is my first time shopping with…", "text": "This is my first time shopping with y'all and my salesmen was awesome and very polite and considerate. In the store I had a great experience it wasn't until my products were delivered that I had issues. First off the wrong box springs we're sent and they had to be taken back and they were not delivered until the next day. On top of that the delivery man busted the light in the ceiling in my kids room and I ended up having to dig glass out of my son's foot that night. I do love you all furniture and I will be back I just hope my next experience is not like this one", "rating": 3}, {"title": "Check Stock before you buy.", "text": "We ordered the 19 peices for 1999.00 and ordered more on top of it. We waited 12 days for our delivery. When the delivery guys showed up, we were told our dining room set was on back order until January.  We didnt get a call or warning. We had to get another table instead. Poor communication from sales and management. The table we got was cheaper and received no money back. The manager said it was a wash. If i wanted a more expensive table, i would have to pay for it.", "rating": 3}, {"title": "Excellent products and fair prices", "text": "Excellent products and fair prices, but there are internal issues in which sales can not offer the best delivery service. I received scratched furniture and had to wait over a week and a half to have everything sorted out. It's not until you lose your cool that they begin to take you serious. Sales 4 stars Delivery  1 star", "rating": 3}, {"title": "All about the sale", "text": "The experience while at the store was very pleasant however after making our purchase we were less than important. Seems all they want is the sale and then you're on your own. The customer service and satisfaction is out the door. Very disappointed.", "rating": 3}, {"title": "I was told that I would receive a call…", "text": "I was told that I would receive a call or text when my couch was in at the location I bought it from. I never received anything. I finally called almost 3 weeks after I ordered it and they told me my couch had been delivered to the store 4 days prior to me calling. I finally received a text the day we got our couch put in our house. We were not very happy.", "rating": 3}, {"title": "The sales person was great", "text": "The sales person was great, knowledgeable. We made our purchase on Saturday and it was to be delivered the following Saturday. Meanwhile we saw advertising for free delivery for Veterans. We called and asked if we could take advantage of that and were told no, that promo started on Monday. We cancelled the order and got our money back. You lost a $1,400 Sale because you were too cheap to honor your advertising. We could have waited tilMonday to place the order had we known. Also, why only delivery on Saturday??", "rating": 3}, {"title": "I was greeted as soon as I entered the…", "text": "I was greeted as soon as I entered the store and informed they did not work on commission, so just let them know if i needed any help.  While being promptly greeted was nice, I felt like nothing extra was provided like coordinating area rugs, coffee tables, end tables, or lamps. I didn't realize my purchase was not complete until I left the store. Maybe if they worked on commission they would be inclined to furnish a whole room.", "rating": 3}, {"title": "The financing loans are a charge card…", "text": "The financing loans are a charge card which was failed to be disclosed to me.", "rating": 3}, {"title": "I am a veteran", "text": "I am a veteran.  I ordered a sofa, love seat, and recliner believing all three would be delivered for free.  It's not my fault the recliner is back ordered.  All three pieces should be delivered for free, even if it takes two deliveries.  I am not happy that you refuse to deliver the back ordered recliner for free when it finally gets to your store.David Pendleton", "rating": 3}, {"title": "Customer service", "text": "The sales personnel gave me a quote for the furniture that changed. The salesperson was rushing through the purchase process and a mistakes made to the final purchase.  They waited until the furniture was delivered to tell me about their mistake. I was promised by the sales man that once the bill came they would have the amount corrected. Needless to say they did not honor their word! Very disappointing!  The deliver personnel was awesome!  Furniture quality!", "rating": 3}, {"title": "The store is very organized and the…", "text": "The store is very organized and the people were friendly when we walked in. The only thing was if you’re trying to sell someone furniture or anything in general you should try to do everything in your power to accomadate the customer and get everything they need but not at this location. We went into the clearance section and they did not have the shoes or nail for the chaise sofa we wanted so we were forced to go out and buy the nails ourselves from Home Depot and take it back to the store for them to put it on the sofa. The guy who helped us was nice but could have done a little more to make the experience a little better.", "rating": 3}, {"title": "Salesman was very helpful but not…", "text": "Salesman was very helpful but not pushy. Love my furniture!! Recliner wouldn’t recline when delivered but they scheduled a repairman to come out- but not for 2 weeks.", "rating": 3}, {"title": "Chairs are too deep", "text": "Chairs are too deep. Feet will not touch the floor. Great for tall person. I am 5’4”. Husband 5’10” his barley touch. I have to sit on the edge of chair. Not comfortable. Style is great. Really regret the purchase", "rating": 3}, {"title": "This was our second purchase and wasn’t…", "text": "This was our second purchase and wasn’t very good. The bed wasn’t put together right and within an hour I called and it took a while for them to get back and the for them to come fix it was on their time not when it was good for me. I requested different time twice and was ignored. So overall not very happy with this purchase.", "rating": 3}, {"title": "I liked buying from home zone but…", "text": "I liked buying from home zone but didn’t appreciate my credit ran twice without my knowledge", "rating": 3}, {"title": "Great customer service but terrible assembly due to imprecise alignment", "text": "Great customer service and beautiful sofa table. Machine work where holes for screws should have aligned for table legs was HORRIBLE.  What should have taken 15-20 minutes took well over two hours due to having to work around imprecise work.", "rating": 3}, {"title": "The overall experience has been…", "text": "The overall experience has been pleasant so far.  My bedroom hasn't been delivered as of yet. The only disappointment has been the $100.00 delivery charge. Not sure why it is necessary to charge such an exhorbant delivery fee for new furniture.", "rating": 3}, {"title": "not happy", "text": "store associates were great, but once i got the product i was not happy. chairs were unbalanced and can't get anyone to fix them until 2 weeks later. great inconvenience", "rating": 3}, {"title": "The store was very clean and friendly", "text": "The store was very clean and the workers were very friendly. The furniture was nothing really different from Ashley’s or Room to Go. One bedroom set was almost $453 cheaper than the one I chose at Ashley’s, but by the time tax and delivery were added, I would only save $112.", "rating": 3}, {"title": "I had several issues with delivery", "text": "I had several issues with delivery.  1st delivery, I had 2 out of 5 pieces damaged and they delivered past the delivery window.   2nd delivery, one of the 2 pieces redelivered was damaged again and it actually wasn’t the product I ordered.  It was an older version.  3rd time, they finally gave me the right product and undamaged.  Other than the delivery issue, we love the furniture.", "rating": 3}, {"title": "No rush to go buy again from them", "text": "Buying was great and super easy. Pick up was sub par. The normal loading guys weren’t there and it was obvious. Instead it was a manager and a sales guy. The sales guy was complaining and got mouthy when we pulled up that he wasn’t doing it by himself. My husband went around inside to help load. The ENTIRE time this guy was complaining. I wish the store manager would have told him to be quiet and I hope there was a conversation that followed after we left about the guys negative behavior in front of customers. We didn’t get to look through any of our boxes to check the condition like we were told we were going to do. I didn’t even want to ask because of the guys attitude. Of course once I got it home a handle was missing from one of the drawers and they were super quick to fix it and get me a new one. When I went to pick up the chest of drawers that had to be ordered, the normal loading guys were there. They were fantastic! Got to look over it and it was good to go. They loaded up with a smile and nice small talk. However originally we were going to just have it dollied our the front door and load it into the SUV we brought, but a lady told us that nothing goes out the front door. Well when we were there shopping for the bedroom set there was a couple loading their stuff from the front door, hard to say one thing and do another. That definitely set the tone for whether we will be back there to purchase anything else and at this point.", "rating": 3}, {"title": "Missing end table leg peg at time of…", "text": "Missing end table leg peg at time of delivery. Delivery driver stated that someone was going to get in touch with me.  I had to go back to the store to get a resolution 10 days later.", "rating": 3}, {"title": "Love the furniture set", "text": "Love the furniture set - modern looking and good price.  Set-up was just okay, though.  Many screws were missing and they didn't clean up very well when they were finished.  Considering the price for delivery and set-up I would expect more.", "rating": 3}, {"title": "Friendly staff but lack organization", "text": "Friendly staff but lack organization. Info that should be told to customers had to be learned after several phone calls.Scheduling delivery was not coordinated very well. Will say warehouse employees more organized and very helpful.", "rating": 3}, {"title": "The shopping experience was great", "text": "The shopping experience was great! Was dissatisfied after they delivered and the couch didn’t work properly! But the local store tried to make it right , and there is a short in the couch, so they r sending a repair guy", "rating": 3}, {"title": "They were very nice and kind", "text": "They were very nice and kind. At the last moment I saw something that I like and I purchased it. When I received it there are a variety of flaws in the way it's made in the fabric. It also appeared to be a completely different color at home than it did in the store. So I decided to return it and I called immediately and went to the store. They had no problem allowing me to return it. The charge me a restocking fee and I had to pay for somebody to come and get it and take it back to the store. I have the warranty on the furniture so in my opinion the sheer fact that they were going to have to come get it to fix the flaws in the first place I don't think I should be charged that fee to have it picked up to return. And for that same reason I don't think I should be charged a restocking fee. The couch was flawed. And although they've been nice about it and I'm getting almost all of my money back and they probably all do it I don't think it's fair. Just to return it with no reason other than I didn't like the color okay I can understand that. But that was only half the problem it was the flaws and I think if they should have just come and picked it up and gave me a full refund. But like I said they were very nice about it and expedient to answer my questions.", "rating": 3}, {"title": "Sales great. Delivery charge ridiculous.", "text": "Sales personell were awesome. Like my chair I purchased. I rated 3 stars because in town delivery was $100. This is outrageous. If they would have delivered for $50 I would have rated 5 stars.", "rating": 3}, {"title": "Picked out a love seat ended up with a…", "text": "Picked out a love seat ended up with a couch. Should have checked the receipt when I paid just trusted the salesperson would of put the correct item on it.", "rating": 3}, {"title": "Given an expired rebate form", "text": "Everything with the sales process and delivery was great, I was promised a $100.00 rebate and given a sheet for the rebate. I purchased on a Saturday and the coupon was supposed to be postmarked the next day (Sunday) to be valid. I didn't figure that out till the next day. I feel like I should still be given my rebate I was promised.", "rating": 3}, {"title": "Great sale rep", "text": "Great sale rep. Very attentive, 5 stars for staff. Only disappointing part is I have to wait 2 weeks to get my sofas. And still waiting.  My delivery date is not unitl 09/08.", "rating": 3}, {"title": "New Bedroom Furniture", "text": "My wife and I recently purchased bedroom furniture as well as an Onyx mattress.  The furniture was great.  However with a traditional foundation the bed was ridiculously hight.  Our initial experience with staff was pretty pleasant.  However when I went back later in the week to raise the concerns about how high the bed was, the \"manager\" was not helpful at all. First, there was no explanation on initial purchase of a low profile foundation. Second, the manager that was assisting me charged me for foundations as well as made me return the foundations or pay a $100 pick up/delivery fee.  Lastly, when I picked up the foundations and got them home, the stitching from one of them was coming undone.  Not sure if we will be back to make other purchases in the future.", "rating": 3}, {"title": "gave second number to call for…", "text": "gave second number to call for delivery;  kept contacting original number for delivery", "rating": 3}, {"title": "Good quality at a great price", "text": "Good quality at a great price. I got a nice dining set for a good value. The delivery was fast and as promised. The only difficulty I encountered was in the showroom when I purchased. I had to explain basic math to a salesman, more than once, and he still didn't understand the correct price. Ultimately he had to ask another employee to come in and complete the transaction.", "rating": 3}, {"title": "The reason they got only 3 stars was do…", "text": "The reason they got only 3 stars was do to us having to drive to Round Rock instead of picking up our recliner at the place of purchase Waco. The young man that sold it to us was very nice but the chair did not come in on the truck when we were told it would. The young man did not follow through with the problem. Never heard from him after the sale. The same chair we ordered just happened to be in the store in Round Rock so it looks like it was delivered to wrong Store. A follow up call to apologize would have been in order. I don’t believe we would be able to recommend your store", "rating": 3}, {"title": "The purchase and initial delivery went…", "text": "The purchase and initial delivery went very smoothly.  We like the bedroom furniture.  The nightstands have built in touch-sensitive nightlights.  We had the furniture for about 5 days, when mine started flashing, and I couldn't turn it on or off.  I had to unplug it.  I responded to one of the delivery emails explaining the situation, and received a call within 10 minutes.  A new nightstand was to be brought the next Tuesday, and they would call on Monday to give us the time.  Monday came no call, and Tuesday, no delivery.  I emailed the delivery person's email that Monday asking if the delivery was still on for the next day.  I did not get a response.  A few days later, I responded again to one of the initial delivery emails, and got a call within a few minutes.  The person said that they saw that a delivery had been scheduled, but wasn't sure why it didn't occur.  They said they would check and get back to me.  I gave it a few days, but never heard back.  I emailed the delivery person again, and this time got a response that said the furniture was on back order.  No time frame given.  I guess we'll see how long it takes, and if there's any problem with the delivery.", "rating": 3}, {"title": "sent pictures of damaged furniture in…", "text": "sent pictures of damaged furniture in days ago and have heard not one thing not happy.", "rating": 3}, {"title": "The shopping experience was great, installation not so much.", "text": "The shopping experience was great. The installation not so much. The installers didn't tighten any of the screws (some were sticking out half an inch!) and were quick to show me the furniture and sign off on it. I contacted corporate and they were very gracious in handling my complaint.Needless to say, I wouldn't mind shopping there again, but I will skip the installation cost and handle that myself.", "rating": 3}, {"title": "Friendly staff and delivery guys", "text": "Friendly staff and delivery guys. Couch broke 2nd day", "rating": 3}, {"title": "It started off great, but went downhill fast.....", "text": "The buying experience was outstanding. The woman who greeted us allowed us to wander the store without feeling like we were be watched or stalked. She filled out all the paperwork quickly, and explained everything to us. Now, moving on to the delivery. We were scheduled for the 4:30-8:30PM slot. Well got a call around 4pm telling us the delivery crew was behind and if we had things to do, or wanted to go eat dinner to go ahead and do it. Then at 7:30PM get call from delivery crew to tell us they are leaving Bronte, TX heading to the store in San Angelo to load up our and the last stops furniture. Then at 9:30PM get another call from the delivery crew telling us they are getting ready to leave the store. After arriving and unloading our sofa, loveseat, and dining room table with 6 chairs, we identify a stain in the loveseat and point it out to one of the crew. Finally after everything is set up, they ask for me to sign and when we question about the stain, they give us a line about when they have the next one come in, they will switch it out. They lied to us. Now all of this was on a Thursday night. Come Saturday night I begin to recline in the loveseat and hear what sounds like a gunshot from under my chair. I get out of the chair and look underneath my chair to find a shiny spring and broken pin laying on the carpet. The next day I go onto the website and see the guarantee and where I can fill out a claim. So I do. I then receive approval to bring my item back to the store to be sent away for 2-3 weeks, at least. And then come pick it back up. Really after having it 2 days, it breaks, and I have to bring it to the store. Am not happy with Home Zone right now. Not good business.", "rating": 3}, {"title": "Nice people but just ok quality", "text": "Sales staff and warehouse personnel was very friendly. I received a call that my table and chairs arrived and was ready for pickup. When I arrived 2 of the  chairs could not be located. They quickly reordered the chairs and they were in about a week later. After I got everything home I assembled the table in which we found on of the leveling feet was missing. I contacted the store and they pulled one off the floor model. Afterwards I discovered that the screws for the bench seat were too short and didn't hold. I did not bother contacting the store a second time but instead picked up some longer screws from Home Depot and finish the assembly. All in all the furniture looks very nice but found that the quality is just ok.", "rating": 3}, {"title": "Doesn’t seem like I got a good deal", "text": "Doesn’t seem like I got a good deal. Salesmen was not knowledgeable on delivery dates and gave misleading information. Once I got that sorted out the couch arrives and it has damage on a corner, now I’m wasting more time to get it replaced. Couch doesn’t seem very sturdy and creaks a lot.", "rating": 3}, {"title": "Too long", "text": "Salesman and delivery drivers were great. However, a back order item takes over a month longer then originally promised.", "rating": 3}, {"title": "It was minor discprencey  with the bed…", "text": "It was minor discrepancey  with the bed railing but manage to care of the situation.", "rating": 3}, {"title": "Ordered my dining table and chairs in…", "text": "Ordered my dining table and chairs in May 2018. Went to pick up the day I was told to. The chairs were there but I am still waiting on my table and it is now July 2018. It's not due in until August.  I never saw any disclaimer stating it was on back order when ordering. Not real happy right now. We bought living roomfurniture I love but the dining table is discouraging.", "rating": 3}, {"title": "Poor workmanship, good prices and furniture", "text": "We recently bought a dining table set with four chairs. The store was warm and inviting and the furniture on display looked good. The prices seemed fair and our buying experience was certainly hassle-free. My main issue with our furniture purchase was the low quality workmanship of the table: wood pieces were not properly flushed together prior to gluing/screwing at the factory. This made setup quite difficult and left unsightly gaps when it was finally put together. Quality control in their Vietnamese factory was low and it really showed in how poorly the pieces fit together.", "rating": 3}, {"title": "The sales people where knowledgeable…", "text": "The sales people where knowledgeable and helpful.  No problems until delivery.  I was scheduled for pickup at the store and told I would get a phone call when my purchased arrived the next day.  I called at noon and it had not arrived and was told I would be called when the truck came in.  I showed up at 5:30 and found out the truck had arrived at 3:30 and my purchased had been there all that time.  The people in the back where not very friendly but the loading dock staff was very nice.  I would hesitate to buy something else from the store because of the lack of communication on the back end.", "rating": 3}, {"title": "A typical Oklahoma shopping experience.", "text": "A lot of great pricing on seemingly great products, though I'll never know for sure. I cancelled my order, which thankfully was very quick and easy to do, because they refused to ship the 7 pieces of furniture I had ordered on any other day but a Tuesday. I just can't get off from work on a Tuesday at this point in my life.", "rating": 3}, {"title": "Great quality, need associates to pay attention to detail", "text": "We had to show the prices were not adding up several times before the associate corrected it. The associate almost severely over charged us. We also were not given any details about the contract or final price or tax amount or anything when we asked. We didnt know even our payment amount until we got the email.", "rating": 3}, {"title": "The furniture selection was great", "text": "The furniture selection was great. Found an awesome oversized chair, 2 end tables and a coffee table for our home. The only issue I had was that the coffee table was too big for our living room. I was not aware returns are not accepted, even though I called the day it was delivered to ask them about it. They said if we didn't want something, we should have sent it back with the delivery truck. However they took the coffee table back as long as we exchanged it. Luckily my wife said I needed a new recliner anyway. I will be back to get a new couch next. Also I wish they sold decor as well.", "rating": 3}, {"title": "The Show room service and sales manager…", "text": "The Show room service and sales manager were outstanding. We purchased with no problems with the floor manager. At pick up we circled back of the building and meet the warehouse employees. They started pulling the sofa set one of the loaders was a Hispanic guy the other was Afri. American. The Hispanic worker was rude and didn't even greet when we arrived, no eye contact as if he was upset we were there. He was really rough with the furniture and started shoving the sofas on the concrete floor over the loading dock into my truck not caring the loading dock iron sharp edge was rubbing against the thin plastic causing it to ripple and almost tare through into the new sofas. I asked him to hold on so I could pick them up to avoid tearing . He ignored me and continued I then addressed him in Spanish to stop he still ignored me until i raised my voice and my hand against him to stop almost yelling at him. That made him more upset and when it came to the bed set we asked to check the furniture which came in a closed box, he then started throwing it down flat to open it so we could inspect the furniture. All this time the other loader was trying to do damage control by helping me tape back what was torn and helping tape back the boxes that we inspected. and helping us load into the truck . He was very polite and friendly. At one point the floor manager came out to check on something and that is when he started handling the furniture carefully and was trying to help tape and load . As soon as the floor manager went back in the store he just stood and watched me and the other loader do the work. this man Never said thank you or spoke a word was not at all friendly or polite. My wife and I were excited to pick up our new furniture and left the loading dock in shock and feeling very upset. If this person is still working in the store when we are looking to buy next time we will just go to another furniture store. This man reflects badly in the chain of customer service your business provides and he has to go. Sorry I took so long to reply in this survey but am really busy in our real estate business, but today as I was cleaning out my email decided to complete this survey. Hope this helps make your business Great and not just Good.All the best, Joe LaraEXP Realty", "rating": 3}, {"title": "The store employees were very nice and…", "text": "The store employees were very nice and furniture is ok quality. However, the delivery was a nightmare!! The two delivery guys didn't speak a word of English, dropped an end table and acted like it didn't happen. I turned around and one of the boneheads had a brown marker trying to cover up the scuff marks. The furniture came in no packaging other than the lamps. The furniture was dirty from the delivery peoples greasy, filthy hands, you would think it would have plastic over the coffee table, end tables and sofa/love seat. Then, after they leave I notice a rolled up rug in the corner, I was like what in the world. The buffoons brought a large rolled up rug,  that was someone else's,  up 14-floors and left it. I had to wait on them to return later that day to retrieve it, after an English speaking person called and asked if they could come get it.......They owe me $99.00 for having to clean the new furniture and wait on their return to pick up the rug.", "rating": 3}, {"title": "I paid to have my bed delivered and set…", "text": "I paid to have my bed delivered and set up. I received a call saying I would have to go to my point of purchase and pick up my own bed frame. When the bed was delivered the home zone employees  continually spoke a  foreign language. They told  me they were not supposed to set up the bed.  After a brief phone call that was straightened out and they assembled my bed I add not very professionally but they did assemble the bed. If I pay for a delivery I shouldn’t have to pick up parts or argue with the delivery people as to their job", "rating": 3}, {"title": "You get what you pay for", "text": "Quality of couch is average-there is an odd seem across the chase cushion-have to strategically hide it with pillows. Makes the couch look cheap. Did not notice it on the couch at the store. Quick delivery but the men scuffed my newly painted walls. Really no excuse for it--sheer carelessness.  Enjoyed the actual shopping experience-sales clerks were more than helpful but not pushy!", "rating": 3}, {"title": "They did not have the mirror to the…", "text": "They did not have the mirror to the dresser on the delivery truck , come to find out it was sent in damaged, i was not notified, I asked to have it delivered during the week when I got home from work at 3 ish I was told I t had to be the following SAT so now I get to sit home for a 2nd sat for 4 hours waiting for delivery , NOT HAPPY", "rating": 3}, {"title": "Seth and Randy did great job of selling…", "text": "Seth and Randy did great job of selling us furniture.  It was delivered a week later.  We noticed a decorative tack was missing right after the truck left. We ran back to store to let them know and were told truck had left town and store could not help us.  They gave us KY number to call. We called and were told they would send us extra tacks. Waited a week and stopped by store to see if they had come in.  Was told truck coming next day and store would call us. Needless to say we are still waiting.", "rating": 3}, {"title": "The attention was good", "text": "The attention was good, but I wasn't approved for the credit and I think my credit wasn't bad", "rating": 3}, {"title": "Customer service was awesome but..disappointed", "text": "Customer service was awesome but...couch not so awesome.. Disappionted in the firmness of cushions. Really soft on both ends as if it had been in a show room.  I’m not a very large person, 109 lbs, but when I sit down , I really sink. Not comfortable at all.  Even the color of the couch and recliner do not seem like the color that I saw in the showroom.  Don’t think this will last very many years.", "rating": 3}, {"title": "Customer service", "text": "New. Store so we had a couple of problems. But I was the one who had to make sure it got done. Sale man and manager said they would do something and didn't.  I was told to check everything before the dlivery gus left. LOL!!The couch came shink wrapped.The deliver guys bought the ouch in and left.  The didn't want for me to check anything. Much less offer to unwrap it. Customer service will not be found here.", "rating": 3}, {"title": "They didnot hookup all the iten", "text": "Date of experience: June 09, 2018", "rating": 3}, {"title": "Mixed bag...", "text": "My in store experience was wonderful! The sales team was polite, helpful, and didn't badger me like they do at many other furniture stores. However, once it came time for delivery, things were not so great. The first attempted delivery had to be refused, because of a rip to the fabric of the couch. When I was called, the computer was down, so I couldn't reschedule a delivery then. One was scheduled for me on a day I couldn't accommodate. Every time I tried to call to reschedule, the lines were busy or the computers were down again, or the voicemail box was full. Even though I never confirmed the delivery, it was attempted, so I had to continue calling to try and reschedule. Once I finally got through to someone, I was able to get my delivery 3.5 WEEKS after I purchased the furniture... Not impressed.", "rating": 3}, {"title": "I ordered a couch and 3 chairs for…", "text": "I ordered a couch and 3 chairs for company that was coming to stay . I was assured a date of delivery. Then when one piece came in was told the salesperson misinformed me and the couch was unavailable for a month. Meanwhile, as Inwait I continue to pay for a couch me or nor my guests will be able to sit on. I was rudely told Incouls but two of the chairs off the floor and was offered no discount for used chairs off the showroom floor.Not good! Still waiting on couch.Love the chairs.", "rating": 3}, {"title": "Gives you the run around after the sale!", "text": "Once you buy it, it's yours! We had issues with our bedroom set, told the delivery team about the issues and I was told not to sign it, they said they noted on our sale and someone would call me I'm signing just saying they left it here. I called the store no one answered during normal business hours. I finally got through to the customer service told them what happened the lady said oh not my department let me transfer you! Sent me to deliveryon hold for so Long I hung up and called back. That lady said she took care of my issues and someone would be out here in a few days to replace it! LIES! no note in the system no one coming out! So I emailed the main office to a follow up email and finally got my issues taken care of. However they wanted me to wait 2 weeks with a damaged nightstand to come out and see if it could be fixed. Asked for them to send a new one the next day because they were already coming to replace the damaged bed!  IF YOU HAVE ISSUES DO NOT CALL EMAIL SO YOU HAVE A PAPER TRAIL! And DO NOT SIGN NO MATTER WHAT THE DELIVERY TEAM SAYS!", "rating": 3}, {"title": "Experience", "text": "My dining table came damage the leg short on one chair.One cabinets damage.The in store service was nice.", "rating": 3}, {"title": "The purchased furniture was not set up…", "text": "The purchased furniture was not set up correctly when it was delivered.", "rating": 3}, {"title": "I was in the store for over 30 minutes…", "text": "I was in the store for over 30 minutes before I was if I needed help.  I did not buy anything either.  I got a sales quote for the furniture I was interested in.", "rating": 3}, {"title": "Don’t depend on delivery", "text": "Living room furniture is a great value for the money.  Delivery dates were changed twice before we left the store.  We received a call later in the day stating delivery would not be possible by the date we requested.  That info would have been better received while we were still in the store.  You can’t depend on the website information either.  The furniture we chose was “in stock” on the website.  We quickly learned that meant in stock in their DC, not the store.  7-10 day waiting period applied.  The sales associate was very helpful and found acceptable and comparable pieces that were available that day.", "rating": 3}, {"title": "Subpar craftsmanship but superior…", "text": "Subpar craftsmanship but superior customer experience.", "rating": 3}, {"title": "It seemed to me that based on my jeans", "text": "It seemed to me that based on my jeans, tee shirt, and no makeup that the sales person did not think I could buy. However, I paid cash for purchase. I hope your sales people do not work commission as I would have not bought from him.  He never even said thank you or have a nice day.  Worst furniture experience I have ever had.", "rating": 3}, {"title": "It doesnt make any since that i came in…", "text": "It doesnt make any since that i came in to purchase queen size bed rails an i was told that the only way that i could do that was to purchase a queen size bed or other wise i would have to order an it took two days for store delivery we where redoing my daughters room an her headboard an dressers had just came in an w3 where excited to get the room finished only to find out that we where going to to wait  2 extra days for the mattresses to be off of the floor such  a disappointment", "rating": 3}, {"title": "just got my entertainment center…", "text": "just got my entertainment center furniture and found many issues with it; the door glasses were almost lost since many of the little pins holding them were broken; one of the rails holding the big sliding doors was bent and with the screw missing; one of the support where the bridge rests on was not secure and with screws missing and almost useless. for the money I paid I am very disappointed. thanks", "rating": 3}, {"title": "Bree,", "text": "Bree,Had thought of writing a review, but was hesitant to share. However, it was a known fact that you have a fixed prices for the furniture on the showroom floor. Having said and agreed to purchase the living room sofa set salesperson did not have the complete set available to be delivered. I paid for the delivery charge, however, when you don't have in stock a given piece of furniture off of the set why would I have to pay for the left over piece when it comes in? My request to the sales manager was to deliver the piece when you get it. He insisted that when it comes in Home Zone will deliver sll pieces at one time with the one time delivery charge. That may take 6 weeks or more until then I will have to put up without the furniture or pay again to deliver. Seems absurd when you don't have in stock, but having paid in advance for the missing piece, I will be charged again for delivery. If my order was not in one package, I can under stand the extra charge to be paid. Hope you check this out and make some changes in how this issue will be handled in future. Its a matter of Home Zone's reputation and convenience to the customers. the reason given was we don't have a truck to deliver. Sure it doesn't sound right. A furniture store does not have a truck? Get real.Kiran  Wichita Falls, TX 76309", "rating": 3}, {"title": "Bed side table was damaged on delivery", "text": "Bed side table was damaged on delivery. Bedroom suite has a strong order.", "rating": 3}, {"title": "3 tries", "text": "They tried 3 times to deliver an entertainment center and all 3 times it was damaged or wouldn't line up correctly to be installed properly.  Very disappointed since it was what i wanted and a good price.", "rating": 3}, {"title": "I love the furniture", "text": "I love the furniture, but I had to drive 3 1/2 hours to pick it up, I paid cash for it and I should have been able to get it shipped.", "rating": 3}, {"title": "Good product but horrible delivery…", "text": "Good product but horrible delivery communication. The tracking on the website doesn’t work at all. Calling 15 mins ahead is not enough time for someone to get home either.", "rating": 3}]