[{"title": "When you check the small print they…", "text": "When you check the small print they delivered as contracted. Maybe not to the headline offer so read fully before proceeding", "rating": 3}, {"title": "Read carefully", "text": "I found the site very misleading and ended up paying for something I didn't need!  I would advise anyone to read the entire text, before making an option. Also, be aware that you're making an annual contract with this company, when you pay. I will say that they have answered all my questions and queries, promptly.On reflection, perhaps my limited tech skills were the biggest problem.", "rating": 3}, {"title": "Long turn around time", "text": "Took a long time to complete my request with a lot of backwards and forwards. I am grateful that the conversation was in English and we were able to easily communicate.", "rating": 3}, {"title": "Took way longer than expected", "text": "The Spanish NIE took 4 months to arrive… after going back and forth on Whatsapp and e-mails I did get a full refund. So if you need it ‘quick’ (within 3-4 weeks) you’d best look elsewhere.", "rating": 3}, {"title": "I paid my NIF 11 days ago", "text": "I paid my NIF 11 days ago, I would like to know when the document will arrive, since on the website it says that there are 10 days to wait.", "rating": 3}, {"title": "Their customer service wasn't great at first, but they did make amends afterwards", "text": "I initially contacted E-Residence via their WhatsApp line to find out if they would be able to help me get a bank account as my circumstances were complicated. I received an answer saying that they couldn’t give me a guarantee, which is fair enough. As I wasn’t looking for a guarantee but simply trying to check that my specific case wouldn’t automatically exclude me, I followed up again. The response to this was an arrow pointing me back to the initial response.Despite this rudeness, I decided to try to apply anyway, so I registered and paid. However, when I subsequently sent them further queries about the application process, I received no response at all, even though I followed up twice via email. I then requested to cancel my application and get a refund. I have had no response to that either, a few months later. I understand that they can’t give a guarantee. And if they couldn’t help, or suspected that my particular case might be a problem, and they simply said so, I would also completely understand. However, the absolute lack of response to queries from a paying customer is rude, unprofessional and unethical, and I would like my money back.Update on 5 January 2023: I have now received a constructive and helpful response, along with an apology and a refund, plus an offer to take my case forward at no cost. Thank you for that, E-Residence, I appreciate it.", "rating": 3}, {"title": "NIE Spain - more like 2 months instead of 3 weeks", "text": "This was my first time using e-residence. While everything worked out and I received my Spanish NIE number, there are still plenty of gaps to be filled. First of all, the service is not cheap, and while it is stated that turnaround time is around three weeks, it is also stated that it can take a little longer.I requested my NIE on Feb 12th only to receive it on Apr 17th. That is 2 months! A lot of things (nearly all) are depended on the NIE so I faced quite so trouble moving things forward. Right after payment you just get a confirmation of payment and that's it, no further updates about next steps or anything which is kind of confusing. I had to reach out to the e-residence team 7 times to get status updates. From a professional company you would expect that they keep their customers in the loop instead of us needing to follow up. The service was always friendly though so that is a plus. However, regular updates about the status would have been preferred. Additionally, it was (this has changed now) stated on their website that you can login to track the progress. I was informed that this was not yet implemented. At least they changed that part on the website, but even there it is stated that the e-residence team \"will notify you about any updates or additional information requests\". That didn't happen to me. As the service is not cheap after all, the additional cost of horrendous 50 euro to receive the physical NIE letter is something else. On top of that, to send a letter within the EU (Portugal to Spain) it took the e-residence team over 3 weeks! This is unacceptable. In general, everything worked out but the customer service in regards to updates could be improved as well as timing and first interactions. It would be great that once you made the first payment, someone from e-residence would reach out and informs you about what is happening. Only 3 stars from my end.", "rating": 3}, {"title": "Feedback", "text": "Did not find communication of the personnel as professional and kind, something I would expect from service provider to the customer. Would even consider it rude, in fact", "rating": 3}, {"title": "Expensive", "text": "Great service, but feel it's excessively expensive, especially for expedited services", "rating": 3}]