[{"title": "Product is from China!", "text": "Order was acknowledged at 8:06 am Sept 26th and product arrived around noon on Oct 1st.  I now question the efficacy of the product as the ice pack and the product was room temperature upon opening.  Further, this product was Made in China.  I don't remember seeing this in the website otherwise I would not have ordered.", "rating": 3}, {"title": "Shipping Options Suck!", "text": "I love the product but the DHL shipping was expensive and they did not reach out to me to tell me there was duties owed and I had to pay them $20 for them to pay $3.00 GST on my behalf. 1 - 3 day delivery turned into over 2 weeks and over $60 CAD shipping - I do not like the new shipping option. I has motivated me to shop else where.", "rating": 3}, {"title": "Discontinued sales of Phenibut", "text": "If you were planning on discontinuing Phenibut, it would be more helpful for you to sell something greater than 40g for a short time. Also, maybe a banner on the page stating your intentions.  You've almost always been very generous with your variety and quantity. So many people are dependant on this product who need something more than 40g to safely discontinue their use.", "rating": 3}, {"title": "I'm used to the OLD site and didn't…", "text": "I'm used to the OLD site and didn't realize you had to confirm the order TWICE. I had to wait an extra two days essentially for my phenibut and I have bad tremors and anxiety. Would have been helpful if the money came out the FIRST time I clicked in the affirmative. That, or TELL PEOPLE IN BOLD FONT LARGE TYPE THAT THEIR ORDER HAS NOT BEEN COMPLETED YET. It's slightly confusing when I click confirm and it's not confirmed. That's not confirmation. That's some fakakta pre-confirmation, a term that probably has George Carlin doing cartwheels in his grave. Your explanations of the delivery systems and their timings are also not entirely correct. I hope I'm not coming off as rude. I'm LEGITIMATELY hoping to help you.", "rating": 3}, {"title": "Several issues", "text": "I had to call LiftMode to place an order because the website wasn’t letting me do it. Customer service was very nice and generous in helping me place the order.I do object to $16.95 being the cheapest shipping option. Another less expensive option is needed.An ongoing issue is that I can’t print an invoice from their website, which I need for tax purposes. There is no print option from the order history page.This last order showed up as a charge by Synaptent LLC. All previous orders showed up as LiftMode.  LiftMode should state on their order confirmation what name is going to show up on the charge. With all the identity theft and credit card fraud there is in our world that courtesy would be appreciated. LiftMode you sell some good products but some fine tuning is needed.", "rating": 3}, {"title": "Shipping disaster", "text": "I bought product for about 300 dollars or more. Like usual I order internationally. However this time my order got canceled (liftmode themselves made a mistake) and then they didnt reship. They made me pay for shipping (for their mistake) and refunded the order cost. So i paid for some interns training for that day but got nothing.Dont order internationally they might just screw you.Ups emails prove they did not specify the cost. Which is why it was held by US customs.Edit: liftmode corrected the error swiftly. Their service is really good i just wish mishaps this simple can be avoided in the future. Their products are really good", "rating": 3}, {"title": "Kanna purchase", "text": "LiftMode is my go to for Nootropics and cbd related products. The prices are great, shipping is great and quality of product excellent. Never disappointed. The only reason I'm giving it 3 stars is because my last kanna order powder was hard and even kinda gummy. Usually arrives more powder form and easy to break up into powder. It could've been the heat from shipping Idk. No matter what they are still my go to.", "rating": 3}, {"title": "I like liftmode especially the speed of…", "text": "I like LiftMode especially the speed of delivery but the prices have just gotten out of control. Everytime I go to purchase the same product it has increased, to the point where it’s almost $100 now, that’ll probably be next week.", "rating": 3}, {"title": "Use a different shipping company", "text": "Use a different shipping company. UPS has delayed order 3 times. Customer service has not gotten back to me. ", "rating": 3}, {"title": "I can't judge the products in the new…", "text": "I can't judge the products in the new order yet as I still haven't received them. My previous experience with the company has been positive though.", "rating": 3}, {"title": "Took 30 minutes to place my order", "text": "Took 30 minutes to place my order. You have to create an account to order and cannot check out as a gust.  I had to switch from my phone to my computer. There was some type of glitch at checkout.  Not an easy check out process if you are buying this as a gift. It made me nervous and I had to verify this was a legitimate website. I do most of my shopping online and this was not a great experience. Would not use this vendor again.", "rating": 3}, {"title": "The products are great and always have…", "text": "The products are great and always have been! The shipping was terrible. It took almost a week and a half to get my order even though I paid extra on top of the free shipping.", "rating": 3}, {"title": "I still haven't received the item", "text": "I still haven't received the item. It said it was out for delivery now it says awaiting scan for delivery. I ordered $75 worth on August 23rd & still haven't received package.", "rating": 3}, {"title": "Fantastic, Bad Transport", "text": "I'd say good, but shipping is slow :( Otherwise fantastic! The amount of positivity in the support team as well is amazing!", "rating": 3}, {"title": "Everything got here timely", "text": "Everything got here timely. However, compared to others the phenibut seemed a weak. No I don’t use regularly or have a tolerance.", "rating": 3}, {"title": "The product is not what it used to be…", "text": "The product is not what it used to be after over a year of not able to find it. Shipping was great but for what product I paid for wasn't the same", "rating": 3}, {"title": "You guys did good but…", "text": "You guys did good, but I paid extra for priority usps to NH. I normally get first class and get it in 3 days. For some reason my priority order will take 4-5 days. That’s it.", "rating": 3}, {"title": "An issue, but made right.", "text": "I didn't like that part of my order was missed. I did like that it was sent out as soon as discovered. I didn't like that I was not notified of this. I do like that when I asked I was told what happened. ", "rating": 3}, {"title": "Product out of stock", "text": "Product out of stock. Sleep formula has been out of stock for a while. Bought individual ingredient from the sleep formula.", "rating": 3}, {"title": "Well I just received it today however", "text": "Well I just received it today however, I did notice the container is only half full!  I’ll chime in once taken for a couple of weeks.Dee", "rating": 3}, {"title": "Great product but avoid UPS", "text": "Just a warning that UPS customs brokerage charges can be scammy. UPS could include it in the shipping cost showed on your website. Instead, they appear as the least expensive one, but we receive an email while the package is in transit that we have to pay the driver an extra fee to get our package. Yes, part of it is VAT tax going to the government, but brokerage charges are going to UPS pocket.", "rating": 3}, {"title": "Great quality, but…", "text": "Great quality, but some of the capsules crack open in the bottles of phenibut faa capsules. Hope they fix it", "rating": 3}, {"title": "Tried to order my monthly supplies", "text": "Tried to order my monthly supplies, and the webstore wouldn't work.....for days. Glad you got it fixed.", "rating": 3}, {"title": "Deducted 2 stars for promo code not…", "text": "Deducted 2 stars for promo code not working", "rating": 3}, {"title": "I paid $50 for overnight shipping", "text": "I paid $50 for overnight shipping on Monday and didn't get it until Friday. They told me they \"upgraded\" my shipping to overnight and I could get a coupon for next purchase. The quality is good though. Always consistent. If there are going to be shipping delays, don't allow the overnight option.", "rating": 3}, {"title": "Found an unfilled capsule in my order", "text": "Date of experience: February 26, 2023", "rating": 3}, {"title": "Usually they are amazing", "text": "Usually they are amazing, but because of a new “fulfillment system” my order which I ordered on Thursday and paid for overnight delivery won’t be coming until Monday. Other than that the customer service is great. Very helpful and responsive.", "rating": 3}, {"title": "Still in transit after 10 days", "text": "I am going with neutral rating. I have ordered about 8 or 9 days ago and my package seems to be still in sorting centre. I don't have any new informations. I will not blame liftmode, as it is not their fault - i choosed first class shipping, which was the cheapest option btw (about 25€ to europe).I will made another review when my package come.", "rating": 3}, {"title": "NACET disappointment, good customer service", "text": "I had ordered NACET and due to some shipping and quality concerns it was dropped and I was refunded. 3 stars because of the disappointment I felt but the customer service explained the situation and that took the sting out. I would possibly buy stuff again, lets see how the CDP choline is when it arrives", "rating": 3}, {"title": "Chunky big pieces in container not fine powder like before what happened", "text": "I'm not sure why but this batch of phenibut is extremely chunky and extremely hard to measure out because there are huge pieces in there that are hard not cool was very disappointed when I seen that especially with the price increase I added another silica gel moisture absorbent thing to it and shook the heck out of it and it seems to have broke it up some", "rating": 3}, {"title": "I'm giving you 3* for jacking up the…", "text": "I'm giving you 3* for jacking up the price of your phenibut. Some people on fixed incomes rely on this medicinally. For me an extra 20 dollars might as well be an extra 2m dollars because I simply don't have it.", "rating": 3}, {"title": "Order didn’t come", "text": "Order didn’t come. Said it was delivered, but it was not in my box.", "rating": 3}, {"title": "I've had bad luck with some batches", "text": "Not sure what happened but I've bought a lot of Phenibut from Liftmode and 2 of the batches I bought a few months ago did nothing for me. I know it's not tolerance, because I still have some left of older batches from them that work fine. I'm hoping it was a brief hiccup. I bought a smaller 100 gram container this time to try and here's hoping that the quality's back.  Liftmode has always been a great company to deal with and I want to continue buying from them.", "rating": 3}, {"title": "New website not as user-friendly", "text": "I've been ordering from liftmode for years. The new site is a little frustrating and seems to be missing most of my recent orders. I tend to revert back to the old site to complete my orders now. I like change, it's inevitable, but something's missing from the new one. The products are always consistent and great quality. The availability was lacking for a while there, but that seems to have been fixed.", "rating": 3}, {"title": "A little disappointed", "text": "Prices are good, shipping speeds are great but.... I honestly feel like the quality of the product I received is sub-par when compared to experiences I've had with other brands. I was torn between 3 and 4 stars because I seriously don't want to talk down on a good business however I was just kind of disappointed.", "rating": 3}, {"title": "I first purchased Phenibut 3-4 years…", "text": "I first purchased Phenibut 3-4 years ago from Biotics Research.   I divided one capsule into 8 portions and took one portion to relax, not to get high, in lieu of lorazepam at night and not every night. Your product is not as effective.  I divide one capsule into fours and it is less effective.  Thank you.", "rating": 3}, {"title": "Free shipping used to be 2 day…", "text": "Free shipping used to be 2 day shipping. Now it's USPS 1st class. In my area they are always late. Never shows in 2-5 days as they say, and there's no insurance on this shipping. ** Edit** Why bother than offering \"free shipping\" when it's 2-5$ shipping. Non insured aswell so when my package gets lost like USPS does often I won't get my money back. Maybe offer insurance on your packages themselves, that's the only way I see things being better. Y'all were my go to company to order from but now I'm not sure exactly. Kind of upset how this \"change\" happened over a couple months with no notification via email or letter.", "rating": 3}, {"title": "I now have the product", "text": "I now have the product, but I'm really not sure how much to use.  Since I got it, I use on scoop, on an empty stomach mixed in a glass of orange juice.  I do this once a day and I'm not sure if that is enough for now.  So, I'm a little confused because I don't want to use too much. I'm thinking if I start small then work up, would be the best.", "rating": 3}, {"title": "Been a liftmode customer for years and…", "text": "Been a liftmode customer for years and have always had great experiences. I love the customer service and the fast shipping and the top notch quality products. My complaint is with the new website, it doesn’t navigate well and does not display information correctly such as past orders, I just made an order and it doesn’t even show that on the site. Some of the other products are hard to find or say unavailable on the search section but if you browse will pop up eventually. Last time I had to call to check the tracking info (few months ago) that wouldn’t show on the site I informed the rep that the new site has issues but it still has the same issues.", "rating": 3}, {"title": "False advertising with CoA", "text": "They could be more open about their COAs. I ordered some Kanna. The last COA available to view was from 11/2020. The COA that came with my Kanna is much newer and has a lower amount of alkaloids so it kinda seems like they purposely only show the results with higher alkaloids. Customer service stated it was simply that they haven't had time to post more up-to-date ones. Really? You haven't had time between November of last year to June of this year?", "rating": 3}, {"title": "Agmatine and NAC possible placebo", "text": "I’ve always been very satisfied with the quality and timeliness of my orders from LiftMode. However twice now I’ve been dissatisfied with the effects from their bulk 100g agmatine and recently their NAC 100g. The product looks like Grade A quality, and the price was great for the amount. Yet I don’t get any effects from either. Sadly a scenario where quantity may take away from quality.", "rating": 3}, {"title": "I love the product but was shocked by…", "text": "I love the product but was shocked by the price increase! It was nearly doubled.", "rating": 3}, {"title": "A little inconsistent but still very effective.", "text": "The supplement dosage seems to fluctuate but that can be for a variety of reasons. I take other supplements to make sure im not deficient in anything and to forego headaches and other issues. As a rule the dosage shouldn't exceed a certain point or diminished returns are to be expected. I have ordered a different form that seems to be more stable but doesn't offer the productivity and lower dosage and faster onset of this one.", "rating": 3}, {"title": "The product is great", "text": "The product is great! But the delay in the delivery system is a huge problem.  Especially if you or should I say me! Order near a holiday or on a weekend.  The information about speedy delivery is misleading and costly.  That is disappointing and something to consider.  I've been shopping with liftmode for a long while and this is not the first time this over payment of delivery fee without appropriate response occurred.  Too bad.", "rating": 3}, {"title": "Great customer service", "text": "Great customer service, the particular product I tried was okay didn't produce a notable effect as a mood enhancer I also had to pay a 100% import tax which liftmode isn't responsible for but it was a surprise and only added to the overall cost, delivery was fast particularly with the current logistics issues , I ordered from a European vendor a similar product a month ago which has only arrived today , My order with liftmode arrived within 4 days to Ireland", "rating": 3}, {"title": "I ordered the Kanna Extract", "text": "I ordered the Kanna Extract. This is a very high quality extract I enjoyed it very much.The only issue is the price. I used 150mg per dose and only received 1 gram for 35.00 dollars. So do the math this is a extremely expensive supplement. So I ordered some normal Fermented Kanna on EBay which has similar effects for $20.00 for one Ounce. If there could be a way to lessen the cost of the extract I would be purchasing this stuff all the time.", "rating": 3}, {"title": "Make it right", "text": "Ive ordered from your company many times, not once have i had Any issues until recently. I placed an order about 3 months ago that was never delivered. Not sure exactly what happened i was charged 90 dollars and never even got an order confirmation or tracking , thsg was the last time going through Liftmode. i have yet since ordered from you .", "rating": 3}, {"title": "Good but Frequently Increases Price", "text": "Quick delivery. Good products. Quick response via chat and email, except when asked about prices. Frequent price increases without explanation when asked is frustrating and a big turn off. In 2018 a product I often orderer increased gradually in price, by year's end it had increased by a total of $20, if not a little ore.. Similarly, another product jumped about $15.", "rating": 3}, {"title": "Hopefully it's a better shipment next time", "text": "The product I ordered was just fine lives up to the hype of the other phenibuts I've tried but as far as the shipping the box was really beat up when it arrived and the product inside had small dents because I dont believe it was packed well and it took about a week for it to get here from illinois which it usually only takes 3 days. Good product bad shipping and not good packaging.", "rating": 3}, {"title": "Well at first I took a dose in the…", "text": "Well at first I took a dose in the morning, and wanted to see if I can play video games. It was well. But really I bought this to perhaps maybe it might help with my general and social anxiety which I take medication for.I had to take a Xanax later in the day and I was very fatigued and tired and just out of it. I read online that if you mix the two it’ll make the opposite effects of concentration and alertness etc. So I don’t know what other product to buy because I can’t use this if I’m prescribed Xanax. Other than that it was ok I suppose.", "rating": 3}, {"title": "Be careful what you order...", "text": "Be careful what you order.... they do not accept returns..... and sometimes they introduce new items in a way that is misleading …. I made the mistake of ordering the \"CISTANCHE\" and it almost put me into the Hospital. (I only took the recommend amount)", "rating": 3}, {"title": "I had to ask a friend to use his bank card to pay for me!", "text": "4/5 is better than Average!  I would give LiftMode 100% or 5/5 Stars if I had not encountered a huge problem during my purchase: My bank card, accepted everywhere else, was somehow not recognized/accepted by the bank they work with!  Most other people in my position would probably not have been able to comment as they would never have had the chance to complete their purchase, so my review probably speaks for many others!!!I had to ask a friend to use his bank card to pay for me!Customer service did an excellent job trying to help me, but without success.LiftMode could also add some other shipping options internationally.Product is 100% nevertheless and highly recommended!", "rating": 3}, {"title": "They have quality products", "text": "They have quality products some of the best I have used actually. The only problem is the process time on an order and shipping options. I have ordered, paid, and selected two day shipping on a Wednesday night and my product both times has not shown up until Monday or Tuesday next week. There needs to be better shipping options and I would definitely change this to a five star review.", "rating": 3}, {"title": "First time user of Phenibut HCL", "text": "First time user of Phenibut HCL.  I have to say I don't know if I really felt anything at all. I went up to a 2 gram dosage.  I do not know why I didnt feel anything.  I have no complaints about the service LiftMode provided. I was hoping for a more exciting experience but have nothing to report.", "rating": 3}, {"title": "On 2nd attemp at dosing...", "text": "On 2nd attemp at dosing.... used 2 leveled scoops and eventually did get anxiolytic effect but it once again affected my stomach negatively. With everything surrounding this supplement, meaning the addiction warnings and WD effects, I wont say it didnt work, but I wasnt impressed either. I dont have anything negative to say or report other than the gastrointestinal disturbances. Not much for positive either. Waves of anxiety still present.", "rating": 3}, {"title": "Late, but at least it came", "text": "So the only bad thing about this order was that it came in 3 days late, which is not so bad. While I was tracking the package it got sent to Puerto Rico for some reason, which must have been an error of some kind. This was my first time ordering from LiftMode so I do not know if that is something that normally happens or what, but I am happy the package made it to me in the end.", "rating": 3}, {"title": "I’m sure it’s good quality", "text": "I’m sure it’s good quality. But after trying it I threw it Down the toilet cause I felt dizzy and super sluggishly tired. This is a refelection if me not liking phenibut though. Not a reflection on lift mode. Lift modes service, packaging and delivery was excellent. I also learnt that this substance is highly addictive and has hellish withdrawal symptoms if you use it for more thatn a few days. I’d recommend using any other substance from lift mode except this.", "rating": 3}, {"title": "Paid $15.98 for 2-day shipping but carrier is not delivering within two days", "text": "I ordered a product from Liftmode and paid $15.98 for 2-day shipping , which was more than the product price itself and yet, according to the carrier, will not be delivered until tomorrow which is FIVE days after the order...I could have gotten free shipping and received it just as quickly as it is coming from N.Y. and I live in Massachusetts...What a scam!!!...Peter", "rating": 3}, {"title": "phenibut f.a.a.", "text": "it had great reviews and maybe i did not take enough but did not get alot of results- i just ordered the trial size- i like the fact it had no sweetener and it tasted alright to me- i have another product which unfortunately has a bit too much stevia for me but works so will stick with that- i like the fact you are more into an honest report than just positive feedback-", "rating": 3}, {"title": "Slide over to Liftmode if you can place an order", "text": "Customer service A+\rProducts AA+\rPackaging AA+\rShipping AA+\rWEBSITE .. FF+\rIf I order Liftmode products from amazon all is great but if I order from the main site I experience:\rSite outage\rCan't check out (happen several times in the past 4 weeks)\rShipping and billing addresses always mess up.\rForget using the amazon checkout option. It only has worked once for me and I had to call customer service to get the order fixed", "rating": 3}, {"title": "L-tryptophan: Excelent price and effective, does not dissolve in water, bitter taste", "text": "The product ordered (L-tryptophan) was at an excellent price. But the powder does not mix or dissolve well in water and has a bitter taste. I trust the product because it is working as well as the more expensive product I was using.I will continue to take and see how it works - may consider reordering when my supply runs out.", "rating": 3}, {"title": "Great product, so-so cs experience", "text": "My order was promptly acknowledged, payment processed, then, for a week, nothing. When I called cs to find out what the deal was, cs was clearly irritated that I was unhappy with the status & acted as though I, the customer, was somehow in the wrong. When I explicitly asked him to confirm that my order would should be taken care of that day, he was defensive & snapped, \"I said I would!\" A customer is not the bad guy when the company drops the ball.", "rating": 3}, {"title": "Upon receiving my Magnolia and Phenibut …", "text": "Upon receiving my Magnolia and Phenibut order I noticed that several of the Phenibut capsules were broken open.  They had too many capsules in a small container so they broke open.  Powder was in the bottom of the screw top container.  I also noticed that the date listed on the Magnolia was almost a year old.  The Phenibut was 8 months old.  I am not sure if this effects the potency but I was a little concerned.  I am about to write LiftMode and inform them about this issue.", "rating": 3}, {"title": "They failed to ship the order for a week, then immediately sent it with upgraded shipping after I asked for it", "text": "I placed my order on 4/21, on 4/28 it had still not shipped according to the UPS tracker, so I contacted LiftMode and told them they could either ship my order immediately with 2-day shipping or cancel and refund my order. I got my package in the mail 2 days later, it seems they just made an honest mistake and they're not just a disreputable vendor", "rating": 3}, {"title": "Phenibut is garbage", "text": "I have tried numerous nootropics before and read all the reviews about phenibut and was quite excited. What a let down.\r The stuff makes me nauseous, tired, kills any motivation and makes me just lay in bed not wanting to talk to anyone. I have gone for an ok mood to a bad mood every time and just cant wait for the stuff to wear off. \r I have tried it several different times, very low doses and it is the same result. I do not recommend using this product", "rating": 3}, {"title": "Icariin review!", "text": "I purchased some Icariin 1g 98% pure to be precise hoping to get the same “Viagra effect.”...Unfortunately, that hasn’t happened & I have had this product for about a week...I’m thinking I might need a higher dosage. I’m not sure..Anyways, not what I had hoped for.", "rating": 3}, {"title": "This is kind of a difficult review…", "text": "This is kind of a difficult review because while liftmode provides excellent quality phenibut and fast shipping, I'm quite upset that the product had a extremely sharp price increase within just a couple months. My usual order went from a reasonable $22 to $44 for the exact same product.", "rating": 3}, {"title": "It took a couple times of trying", "text": "It took a couple times of trying, but overall it is a good product. I may have a slow metabolism or something but in my best experience the full effect of the FAA form took several hours to kick in but I enjoyed it, especially when listening to music. I took it early in the morning and didn't really feel the full rush till about 12 hours later maybe the HCI version will work better I will try that later sometime. Not a bad product though I just have to find the best way to take it.", "rating": 3}, {"title": "The phenibut experience", "text": "I give it three Stars the onset was very very slow and I got the free amino acid version so I kept about two grams under my tongue for about twenty minutes and nothing I thought it was supposed to be sublingually absorbed in that version. It took wayy too long to kick in and when I woke up I had all the drowsy effects I wanted to Begin with. Also no euphoria and I heard there was some euphoria. Any recommendations on a nootropic that causes some euphoria and maybe anxiety reduction?", "rating": 3}, {"title": "Didn’t know the delivery required a signature", "text": "Didn’t know the delivery required a signature so the package was sent to a convenience store a mile away (not very convenient). It was such a hassle to get it from the store, demanding my ID which has my permanent address not my living address, also there was a sticker covering the barcode so it took forever to get it off in order to scan and release the package. The product is great and always has been. Love the packaging etc. but I’m not sure why this package required a signature when i ordered one recently that didn’t.", "rating": 3}, {"title": "Ingestion difficulty", "text": "I ordered Oleamide powder to use in combination with other products to assist in sleep enhancement. Thus far, I have not used it long enough to see any desired results, but Oleamide powder is very difficult to ingest since it will not dissolve in water. I will continue to try ways to make its use easier.", "rating": 3}, {"title": "Glitchy website", "text": "I struggled to place an order. The website tossed back three attempts to use my credit card. The service kept resetting the page. Each time I had to reenter all the same information. Had the third time not worked I would have quit trying. Very exasperating.  Hope I like the product, otherwise I won't be back.", "rating": 3}, {"title": "Liftmode", "text": "Fast great shipping products on the other hand do nothing. Bought three products and none of them perform or work as they are sold to do sorry was looking forward to using your company again due to the great shipping and customer service but will not be returning because the products aren't yotk par.", "rating": 3}, {"title": "Did not help with my insomnia.", "text": "The product was delivered in a timely manor. The phenibute did make me calm but not enough to put me to sleep. Additionally, After taking it for several nights I had the rebound effect of making my insomnia worse for several days. I have not slept more than a few hours for past 10 years.", "rating": 3}, {"title": "My rating is mostly based on…", "text": "My rating is mostly based on satisfaction with my most recent experience. I could not rate higher since the product I wanted was out of stock in all different amounts and types.", "rating": 3}, {"title": "Prices have almost doubled in 3months", "text": "Still the best source for Phenibut however the prices for the product have skyrocketed to nearly double from just 3 months ago. Why is Liftmode doing this??? My friends and I order this product together in a single 200 gram tub for all of us but we recently found another supplement manufacturer that has a lab certificate of analysis of over 99% pure that offers 200 grams for $50 or so as opposed to $80 dollars. Really like the large crystal form because it's easy to weigh out but this is getting ridiculously expensive for all of us to chip in on for a mood enhancer.", "rating": 3}, {"title": "Service is lacking recently", "text": "Initially, Liftmode always provided high quality service in general. Quick shipping, great support, and top quality products. They were highly reliable and, in my opinion, the best company to order supplements and nootropics from by far. If they supply something I need, I get it from them exclusively.However, I have had issues with both of my recent orders which makes me think this is now the norm. They were out of stock on nearly all types and quantities of the supplement I needed on my first order for a while. I waited a few days for any to be in stock but had to compromise on my preference in product as I didn't want to wait longer.Things got worse with my most recent order. I didn't receive one of the items I purchased because it became out of stock after I ordered. I contacted support and was told it was on backorder and I would receive it as soon as it was available. That was on October 13. More than two weeks later I have yet to receive the item I paid for, nor have I been contacted with an update or any related information on this issue.Because of my previous positive experiences with Liftmode I trusted all would be resolved after I contacted support so I've waited without contacting support about this again.Overall I still think Liftmode is the best company to get your supplements/nootropics from and I'll continue get my things from here exclusively. A few shortlived problems with orders is far too little reason for me to change my opinion.", "rating": 3}, {"title": "Questionable Phenibut, Packaging or Product?", "text": "I have been buying phenibut from liftmode for several years now, and have been quite satisfied with the quality of service and with the product. Recently I bought some phenibut on sale. When it arrived, the bottom of the plastic bottles were pushed out, so that the bottles would not stand upright without rocking. I also could not find an expiration date. I tried to contact Liftmode by phone, but was only able to leave a message. The staff tried to contact me repeatedly, and we played phone tag, until I e-mailed the company. I have yet to receive a reply", "rating": 3}, {"title": "Good product when you finally get it!", "text": "I have purchased a product called phenibut for my son and it helps him with nerve pain and other things, like sleep and muscle aches.  The product seems to work when it comes on time.\r The problem is this if you place an order it would be nice to know that when you pay the extra bucks to get the product in a short amount of time --you should get it. The sure post is not the way to go. We have been waiting now for over a week for our order and feel this has been a waste of money. Just go with the regular mail. You might get it faster.", "rating": 3}, {"title": "Phenibut order", "text": "For the first time your service was just \"average\" lol! Normally I have great service from you! The phenibut I originally wanted was on back order which is understandable. However for shipping usually I get it through USPS in a couple days free of charge from you guys, but this time it was UPS and it took a bit longer, there was some bad weather which is out of your control and understandable but I ordered it on the 4th and it should be arriving today on the 10th. Not sure why USPS wasn't a free option on this purchase??", "rating": 3}, {"title": "Satisfied customer hence product Ineffective", "text": "Purchased phenibut hcl crystals. Tried 1 gram on an empty stomach the first night. No reaction whatsoever. Took 3 grams on an empty stomach the next day. Still nothing. Oxiracetam is not the supplement for me but appears to work well for many others.\rCustomer service on the other hand is fantastic. I recieved an email and full refund for my product based purely on my review posted regarding its ineffectiveness. I did not contact liftmode, nor request a refund but they went ahead and did it preemptively. Very satisfied with the customer support!", "rating": 3}, {"title": "No issues with ordering and delivery…", "text": "No issues with ordering and delivery was speedy. The directions provided with the melatonin advised there should be a double sided scoop, one for 3mg and one for 6mg. Only one scoop provided so without a scale I’m not sure how much I’m getting with each scoop.", "rating": 3}, {"title": "Shipping hassle", "text": "Had many good experiences with liftmode but the last order I placed has taken almost 3 weeks so far and I still have not received a package. Although the customer service was very quick and responsive the service itself needs some work. Product is great in past experiences", "rating": 3}, {"title": "Made us hella sleepy at bedtime", "text": "Made us hella sleepy at bedtime. Weds together nicely with dabs of high quality tHc. I like the capsule method of consumption. The taste is completely horrible without. Takes awhile to ship. Because I chose the cheapest method of delivery.", "rating": 3}, {"title": "20% price inflation", "text": "With the recent change of the Crypto payment provider the 20% crypto discount is gone. Now it is 0% discount compared to CC. That is one heck of a price increase.", "rating": 3}, {"title": "Weak batch", "text": "I tried a few different dosages and noticed slight effects but it seemed pretty weak and could've been the coffee I took with it. Also tried every ROA and still didn't get any noticeable effects. Will try out different dosages and let you know.", "rating": 3}, {"title": "Order is being sorted - hopefully", "text": "December - I did not receive my order. I emailed to let Liftmode know and have not heard anything from Customer Care. UPDATED Jan 4 - my order should have arrived before Christmas. I did hear from Liftmode today to say somehow my email was only received now - understandable I think during holiday season - and that something appears to have happened with my package tracking number, making it, evidently, untrackable. Today they said they will resend me the order at no extra cost, which I appreciate. Changing from 1/5to 3/5 star review for that, and my satisfaction with past orders and products which have been great and truly 5/5.", "rating": 3}, {"title": "Solid product", "text": "Solid product, but it took 6 days to get here. The free ups shipping I realize is going to be slower, but all other options are over priced. I ship and know how much it is, looks like your making money off shipping. Could be wrong, but 6 days is just slow.", "rating": 3}, {"title": "Phenibut FAA", "text": "Honestly I think it should be clarified that FAA is profoundly different than HCL. I feel like I wasted 20 on the faa which is much less effective. It's all good though I just wasn't aware it would be so different. No worries yall are still good.", "rating": 3}, {"title": "too soon to tell", "text": "I just purchased liftmode for my son who suffers from severe anxiety and depression. Has only been on it for 2 weeks.  I can say to my knowledge that he has not had an attack since he has been taking it.  A better review will be maybe 2 months from now.", "rating": 3}, {"title": "No Scoop", "text": "Everything about my experience was good...except the fact that Liftmode failed to include the scoop.  This stuff is expensive and needs to be dispensed in small quantities, and for this the scoop is vital. Oh well, you can't win 'em all.", "rating": 3}, {"title": "They offered to take the product back, No way, some is better than none", "text": "I was very disappointed in the $15.00 shipping fee ( fast service NOT!) because I would have got it faster through mail, and I know this because I ordered exact same time for different product with different company, and got it 3 days earlier than yours! I will say to be totally fair; Your product would drop from a 5 star to a 3 star because after taking about 10-12 capsules I noticed the capsules are barely half full- I was going to say 5 stars because without poor shipping your product seems good, but now with caps not filled properly, and shipping issues I honestly think I am being fair. Sad because you could really be a 5 STAR PRODUCT!!!  I was hoping to be a monthly customer...", "rating": 3}, {"title": "In all honesty first day I felt the…", "text": "In all honesty first day I felt the affects I'm currently 266 pounds I'm thinking for me to really feel the full affects I would have to take two at the time with certain things for people with size to feel gotta have more of whatever.", "rating": 3}, {"title": "Ok so far so good", "text": "Ok so far so good, but I would like to address what is THE SLOWEST SHIPPING IN THE ONLINE SALES INDUSTRY, I don't know what is wrong with you people, but I think sitting on the order for a week really hurt your score.", "rating": 3}, {"title": "I don't know what the hold up I", "text": "I don't know what the hold up I. Getting items shipped out is", "rating": 3}, {"title": "Payment issue with International Purchase", "text": "The product I bought seems OK. It came with a Certificate of Purity or something similar. But I twice had frustrating problems at the checkout. A pop-up window appeared to enter credit card details into but immediately closed at the first key stroke. This happened on 3 different browsers. So I tried using my iPad and got past that point only to have my card declined without a reason. After complaining to the very patient and friendly Bob & Team on Facebook I tried again a few days later and the system seemed to have been improved as there was no pop-up window. The details could be easily entered and the order went through.", "rating": 3}, {"title": "Liftmode provides excellent customer service, but prices are soaring...", "text": "Liftmode provides excellent customer service, which is the one reason I still shop with them.  However, their prices continue to rise.  For example, the supplement Phenibut used to come in a huge tub and cost a reasonable amount of money.  Now it comes in a very tiny (by comparison) tub, about one-third the size previously available, and it costs two or three times more than it did in the significantly larger tub.  If these price rises keep coming, I'll have to find other sources, or other products altogether.  But overall my experience with the company has been excellent until they started making the containers smaller and the prices higher.", "rating": 3}, {"title": "MY NAME IS NOT LONI MITCHELL", "text": "GET IT TOGETHER!!", "rating": 3}, {"title": "Wheres my order?", "text": "This is my third time ordering phenibut. The product is great and the first two times delivery was very quick. This time however, my order was estimated to arrive july 14 but it is now july 20 and it hasnt shown up! What gives??", "rating": 3}, {"title": "Shipping tim", "text": "Everything was fine. Just wondering while paying for faster shipping 2-3 day last Wednesday my package in not scheduled for delivery for Tuesday. Almost a full week and 5 business.", "rating": 3}, {"title": "Didn't feel it much", "text": "There was no hassle but I never got much effects off the phenibut, maybe I was doing it wrong? But anyway I thought shipping was a little expensive too . But it's cool I guess phen is not for everyone. Much love--Ozekat", "rating": 3}, {"title": "I really don't know if it's me or not …", "text": "I really don't know if it's me or not but I am not feeling any effects from phenibut nothing noticeable. I have been taking 1.2g-1.5g and feel nothing am I doing it wrong I'm taking it in an empty stomachs as well", "rating": 3}, {"title": "Everything is good except my order was …", "text": "Everything is good except my order was kept on hold for using a different name on my billing address, instead of just telling me come check out. Also, shipping options are horrible, cheapest was $10 and 10 days on a $20 order", "rating": 3}, {"title": "LiftMode is well known to sell…", "text": "LiftMode is well known to sell legitimate products, but I haven't noticed anything from their Phenibut capsules. It could be my own physiology, but I've taken up to the maximum suggested dose on an empty stomach.", "rating": 3}, {"title": "Clumpy powder.", "text": "Normally the powder phenibut HCL is nice and powdery as it should be but my most recent order was clumpy. The price had also gone up. Could be worse but this isn't what I had grown to expect from liftmode.com.", "rating": 3}, {"title": "Didn’t notice a difference", "text": "Shipping was really quick, but supplement doesn’t seem to work—can’t fault the company for that since I’m not sure if it is just me, or what. Maybe it works for other people, but I don’t think I’d buy it again.", "rating": 3}, {"title": "I've used liftmode for a while", "text": "I've used liftmode for a while, love their products and the prices of the products themselves are reasonable. A couple things that really bug me:1. You can't order with a different name on the shipping vs billing forms! Lived with my girlfriend for a month while we both waited for the end of her lease. Couldn't get the system to allow her name on the shipping address and mine on the billing. We had to use her card to get the order. 2. Shipping price is crazy! If you want any form of tracking it feels like way too much for such a small single item. I'll still use liftmode in the future and definitely recommend their products, but these couple things made for a pretty annoying experience", "rating": 3}, {"title": "Nothing", "text": "This was sample purchase, and good thing, because I didn't get anything out of it.  I didn't feel anything,  What that means is unclear, but needless to say I won't be buying anymore Have a nice day.", "rating": 3}, {"title": "I bought the item with 2nd day air mail…", "text": "I bought the item with 2nd day air mail delivery I received the item 9 days later.The item was of good quality but the shipping was disappointing so I gave it 3 out of 5 stars.", "rating": 3}, {"title": "variable results", "text": "The product arrived promptly although I did not experience the benefits I expected to have. This was something that appeared to be universally helpful, but apparently does not actually work well for everyone.", "rating": 3}, {"title": "5 stars for ease of website use and …", "text": "5 stars for ease of website use and quick shipping. However, the batch of phenibut I received is very weak. I know that some batches are stronger than others, but this is the weakest I've ever tried.", "rating": 3}, {"title": "Fine product--OUTRAGEOUS shipping prices", "text": "Product is fine, works as advertised. The shipping cost was OUTRAGEOUS and took MUCH longer than it should have for the price I paid. Would rate a 4.5/5 but the shipping issue is a huge negative for me.", "rating": 3}, {"title": "My overall experience with getting my…", "text": "My overall experience with getting my package sooner than expected was great. if only the product worked the way everyone is talking about it working..", "rating": 3}, {"title": "Wish I’d done more research on ADA before purchasing, turns out the product is mostly useless.", "text": "Liftmode is a really reliable company. Great service, reliable quality.Wish I’d done more research on ADA before purchasing, turns out the product is mostly useless.", "rating": 3}, {"title": "I like the tongkat ali just wish it was…", "text": "I like the tongkat ali just wish it was dosed in a capsule... the libido lift does barely nothing for the namesake. Overall a good product just not feeling desired results", "rating": 3}, {"title": "old satisfied customer but this…questions ?", "text": "old satisfied customer but this shipment of magnolia bark extract not like previous. previous orders would numb your tongue on spot where put. latest shipment not so. what is the difference.", "rating": 3}, {"title": "It’s taken awhile for my item to ship", "text": "It’s taken awhile for my item to ship. Quicker shipping would be great. Can’t review the product yet because I’m still waiting for it to arrive. Looks like the label was created today.", "rating": 3}, {"title": "Best site for nootropics with only one downside", "text": "This is an excellent with topnotch products. They offer fast shipping for free and provides certificate of analysis. However the only thing I would criticize is the consistency of their phenibut. One month it might have the consistency of salt and will provide the most over the top euphoria but then the next month it will be the consistency of flour and provides less than desirable effects. Furthermore they fail to issue a disclaimer about both the fine crystals and the large crystals as well as the FFA. All three that I just mentioned are completely useless in my opinion. They all produce dizziness and headache as well as a list of undesirable effects but what makes them useless is not so much the negative effects they produce. It's the effects that they don't produce the most important one being Euphoria. In fact they actually produce the exact opposite and that is dysphoria but overall this is still the best website for nootropics and I am their most loyal customer.", "rating": 3}, {"title": "Good quality but they just hiked the…", "text": "Good quality but they just hiked the price of the phenibut by 150%. Not too pleased. Were they not the only source of phenibut FAA I would go elsewhere until the prices come down.", "rating": 3}, {"title": "I first ordered the Magnolia bark…", "text": "I first ordered the Magnolia bark extract a year ago and was blown away by the results. Second time ordering this year the product seems different in color , taste and strength.", "rating": 3}, {"title": "Good product, bad company, bad containers.", "text": "(1)I respect the fact that their product comes with the lab sheet info. (2) I do not like the fact that they did not respond to my email. (3) I find their needy demand for a 5* rating irritating especially when my product hasn't arrived yet.(4) Last order there was a problem with the container.  Small flaw that irritated the living **** out of me.  A disc shaped paper that is located inside the lid was not the right size and product always got under it.  When opening the container 1-2 grams would spill due to product inside the space between lid and paper pouring on the ground.  Eventually I just removed the paper but the product became weaker with time and oxidation.(5) You wanted your damn review now you got it.  Product is good, the company is bad and your containers could use a lift there LiftMode, wink.", "rating": 3}, {"title": "I didn't get my shipment for phenibut…", "text": "I didn't get my shipment for phenibut faa yetUpdatedThey said there are replacing it for free so we will see. Also I got a 20$ coupon for rating them.", "rating": 3}, {"title": "not bad", "text": "Baicalein. Some axiolic effect but very minimal. Supposed tohave anti-oxidant properties too so thats good. Maybe you'llhave a better experience.", "rating": 3}, {"title": "The product was more than expected…", "text": "The product was more than expected however it was supposed to be 2 day delivery however it took almost a week to get to me. I was very unhappy with that.", "rating": 3}, {"title": "Disappointed with my results with Sleep…", "text": "Disappointed with my results with Sleep tablets and Oleamide. Phenibut has been good, but limited use. Hoped to find an alternative to phenibut for sleep", "rating": 3}, {"title": "Just didn't enjoy the customs charge", "text": "Seems to get to uk fast , however stuck in sorting office with £17 customs charge , I'm doubtful of savings .... can't assess quality at this time", "rating": 3}, {"title": "I am not psyched the price was raised…", "text": "I am not psyched the price was raised of phenibut substantially because I have been a loyal customer for years and now it cost me a good 200 more a year.", "rating": 3}, {"title": "Response time needs to improve.", "text": "I had to follow up to get responses, it took too long to gather the needed info and invoice and then took too long to get the items shipped.", "rating": 3}, {"title": "The phenibut I bought is some of the …", "text": "The phenibut I bought is some of the weakest I've tried but it does work might just be a bad batch. The price and speed of shipping was second to none", "rating": 3}, {"title": "The product has yesterday to show any …", "text": "The product has yesterday to show any difference what so ever. Although I am still titrating it.The taste is rancid but deticipates realatively quickly.", "rating": 3}, {"title": "Fast shipping. Hard to check out.", "text": "Shipping is fast and product is great but the website checkout is horrible.  Almost bought another brand because I couldn't check out on mobile device.", "rating": 3}, {"title": "Moderate", "text": "Liftmode phenibut is moderate at best. The best part of the product is the price. The Primaforce phenibut is much more effective but A bit more expensive.", "rating": 3}, {"title": "PHENIBUT DIDN'T WORK", "text": "SERVICE WAS GREAT, EVERYTHING ARRIVED ON TIME. TRIED THE PRODUCT AS STATED ON THE LABEL DIDNT WORK FOR ME. UPPED THE DOSAGE AND STILL DIDNT WORK.....", "rating": 3}, {"title": "The order came quickly but...", "text": "The order came quickly but I didn’t like the quality of the product (Phenibut). I had this product from another vendor and it felt much better.", "rating": 3}, {"title": "This bra fit terribly", "text": "In my experience taking this phenibut, it isn’t as potent as others I have taken. No bad side effects, just didn’t feel it as much", "rating": 3}, {"title": "Holidays delay", "text": "Because of the holidays my package is being delivered outside of window of time I paid for. I'm sure the product is great.", "rating": 3}, {"title": "Okay Process", "text": "Fine process with ordering and shipping, but repeatedly receiving emails asking for a review was beginning to 'start friction'.", "rating": 3}, {"title": "Site was buggy and slow", "text": "Site was buggy and slow. I had to refresh the page several times before my order would go through.", "rating": 3}, {"title": "Great products", "text": "Great products, however quite expensive and after paying shipping costs I was then hit by customs tax due to the packaging", "rating": 3}, {"title": "I was so looking forward to trying the…", "text": "I was so looking forward to trying the Energy Caps, but nausea set in on the two days I took them & then I stopped.", "rating": 3}, {"title": "not enough readable info about using…", "text": "not enough readable info about using the product , saw a video about it and it was the worst thing i have ever seen .", "rating": 3}, {"title": "Good except for the fact they reduced…", "text": "Good except for the fact they reduced their inventory and reduced the product sizes of the inventory they still offer.", "rating": 3}, {"title": "Great service evenover the phone - but I shouldn't have had to use it!", "text": "For some reason, when I use the Liftmode website my order comes up as costing almost twice what the price should be, and it doesn't even show a reason why; there is no massive number in the tax field or the item cost field, it just happens on my PC.  It happened twice, and each time when I called Liftmode to talk to staff they were friendly and helpful, helping me make my order with ease.  Each time after I explained my problem they asked me \"Are you using a mobile device?\"  Maybe people using mobile devices have this problem as well.  I have since used my laptop to order, and the same thing happened but Paypal caught it and I was brought to a screen hosted by Paypal saying the total cost didn't reflect the price of the purchase.  I don't remember exactly what screen I was on before this, but I remember I hadn't actually tried to order yet, but had seen the price discrepancy.\r In short, the staff on the phones were helpful...but I shouldn't have had to find that out!  The ease of online ordering is part of the reason I use Liftmode!", "rating": 3}, {"title": "Very high quality and trustworthy", "text": "Very high quality and trustworthy; however, prices are starting to climb and the rewards program could be better.", "rating": 3}, {"title": "My biggest problem is twofold", "text": "My biggest problem is twofold. One, when you place an order it takes days for the order to be filled and shipped. I can see no reason that it should take more than 24 hours and it usually takes contacting customer service to get the order moving. My last order four days went buy with no email saying it had been shipped. I contacted customer service and an hour later the label was created & order shipped. proof that orders can be moved much faster.My second problem is that I ordered standard USPS shipping to my mail box. The order was shipped ups 2nd day air which doesn't deliver to po boxes so I spent several phone calls to ups to get the shipment to my home address. I even put in delivery notes which address to use for each shipping method which was ignored. I know customer service expedited the shipping because of the length of inaction on my order which would've been appreciated had they observed my instructions on which address to use. I won't continue to order if I have to make 4-5 calls to the shipper to correct the shipping instructions to get my product. USPS offers the same shipping options as ups and FedEx without the hassles.", "rating": 3}, {"title": "Meh kinda works", "text": "It kinda works I guess, but I will stick with not natural treatments as kratom or blue lotus work waaay better.", "rating": 3}, {"title": "I increased scoops and no effect", "text": "I increased scoops and no effect. However satisfied no adverse effects so far.", "rating": 3}, {"title": "Not nothing", "text": "It did something but not enough to warrant the price.", "rating": 3}, {"title": "not that great", "text": "I find its not nearly as strong as some of the other brands such as the vitamin shop. I'm a little disappointed.", "rating": 3}, {"title": "No tracking number", "text": "I was never a email with my tracking information I'm not happy about that i have know idea when its coming", "rating": 3}, {"title": "Shipping with UPS", "text": "Perhaps 3 stars isn’t indicative of the service I received from Liftmode but since my package arrived in Bangkok the UPS personnel there have either been extremely incompetent or the plan all along has been to frustrate me enough to just let them have the products I ordered. Every day since the package arrived in here has been a different request for information or passport before they will send it to me.  I took a taxi 30 minutes each way to the customs office then waited over an hour only to find out that UPS didn’t email me the proper document to go with my passport. I’ve received several packages of supplements from other companies that don’t use UPS as a carrier and the package has been delivered to my door without any problem or required documents, passport, etc.I would like to add that the products I ordered didn’t pass the Thai fda inspection which is absurd. these were benign products such as sleep aids legal in the US and msm also legal in the US. I was totally convinced the UPS people were pulling a scam when the person I’ve been corresponding with offered me the service of an import broker that could get my packages through the fda for about $400 US. The total value of the products was about $240.", "rating": 3}, {"title": "Wrong product delivered.  No response from Liftmode.", "text": "In the past Liftmode has always been great.  I'm not sure if something has changed or what, but I ordered 200 Grams of Phenibut HCL recently.  The delivery showed up quickly, but instead of the Phenibut, it contained 200 Grams of Phenylethylamine HCL (about 1/3rd the cost of Phenibut).  I immediately sent an email to explain what happened, along with pictures of what was delivered and it's identifying information.  That was over a week ago and I have since sent several emails from different email accounts to two different Liftmode email addresses and I also sent a couple messages to their Facebook account.  But I have received no responses at all.  Nothing.  I've never had any problems in the past with Liftmode so I'm not sure what is going on.UPDATE: 5 days later, I've tried several more times but still no response from Liftmode.UPDATE: After two weeks I finally heard from Liftmode on Facebook, and they are sending the Phenibut right away.  I'll up this to 3 stars because it really shouldn't take that long to get back to customers.  3 stars as a compromise based on my impression of them in the past and assuming for now this is an outlier.", "rating": 3}, {"title": "not very intuitive or easy to figure…", "text": "not very intuitive or easy to figure out how to use, but finally did. It'll be easier next time.", "rating": 3}, {"title": "My only concern at his moment", "text": "My only concern at his moment, is that I paid for 2nd day UPS and did not receive my order for 5 days.", "rating": 3}, {"title": "Good customer service but the product I…", "text": "Good customer service but the product I ordered doesn’t work as advertised. Gave me less clarity.", "rating": 3}, {"title": "Doesnt seem 2 have much of an effect…", "text": "Doesnt seem 2 have much of an effect tried different doses and didnt feel much different 😕", "rating": 3}, {"title": "The price is right the product comes in…", "text": "The price is right the product comes in the mail pretty fast and the product is pretty good", "rating": 3}, {"title": "Shipping info is inaccurate", "text": "Shipping time info is inaccurate, but great products and in stock.", "rating": 3}, {"title": "ordering and delivery were great", "text": "ordering and delivery were great. Phone interactions regarding supplements were not.", "rating": 3}, {"title": "Product seems to be sound", "text": "Product seems to be sound, shipping took 3 times as long as expected", "rating": 3}, {"title": "I ordered the Phenibut HCL.", "text": "I ordered the Phenibut HCL.I’m not satisfied. I feel like it is not effective.", "rating": 3}, {"title": "The product I purchased was not as…", "text": "The product I purchased was not as effective as advertised", "rating": 3}, {"title": "Still waiting for it to be delivered", "text": "Still waiting for it to be delivered. Was supposed to be here last Friday", "rating": 3}, {"title": "Quality supplements", "text": "Quality supplements! Discounts and offered coupons are confusing.", "rating": 3}, {"title": "Takes a while for shipping", "text": "Takes a while for shipping; however, it's a great product.", "rating": 3}, {"title": "Phenbut is great", "text": "Phenbut is great, useful a lot, but its price is very high", "rating": 3}, {"title": "Prices are getting pretty high so I cut…", "text": "Prices are getting pretty high so I cut my orders drastically", "rating": 3}, {"title": "I think they sent it by boat, all the way around south america", "text": "Should be here next year and then I can review it.", "rating": 3}, {"title": "Average service", "text": "My shipping took forever but the product was good.", "rating": 3}, {"title": "Had to go to UPS to get delivery", "text": "Date of experience: April 22, 2022", "rating": 3}, {"title": "Good product but expensive", "text": "Date of experience: June 02, 2022", "rating": 3}, {"title": "after my purchase several places hacked my credit card", "text": "never read out your credit card info.", "rating": 3}, {"title": "Never received my package.", "text": "Date of experience: August 23, 2020", "rating": 3}, {"title": "Quick delivery", "text": "Quick delivery well done", "rating": 3}]