[{"title": "Need better customer service.", "text": "A lot of the clothes is size wrong so it’s hard to buy without being able to try on. None of the rainbow stores that I’ve gone to have fitting rooms so you can’t try on clothes but yet they give you a hard time when you’re trying to return closed it did not fit. Cashiers need to inform customers about their return policy and what’s returnable and what’s not so customers can make the decision whether they want to purchase the item or not. Not get a big surprise when they come back to return it if it doesn’t fit and they can’t. I’ve an issue twice already I’m done. Wasting my gas back-and-forth. I’ll be shopping elsewhere. ", "rating": 2}, {"title": "Rainbow has affordable clothing…", "text": "Rainbow has affordable clothing unfortunately after trying to exchange a pair of jeans with a receipt, I was told without the price tag on the pants they couldn’t be exchange. This is poor customer service. Especially since there isn’t a changing room available to try items on before buying. ", "rating": 2}, {"title": "I like you clothing but It appears that…", "text": "I like you clothing but It appears that you are always out of stock for the things that I go to your site for. I wear a Large and can never find the size in normal regular solid color shirts or tank tops with the shelf bra. Even hard to find when I go the Rainbow Shops store for them. Please stock more of the popular sizes as this has been happening for years across all seasons. I originally wanted long sleeve shirts but had to settle for short because it was available.", "rating": 2}, {"title": "Fabric description was incorrect.", "text": "I received my products but I am not pleased, you have got to do a better job at updating your product description. I was looking for leggings based off the fabric description I had from some I had already bought from you guys in-store, and since I haven't been able to find them whenever I go to your stores I decided to look for them in your website and out of all of your options I choose the ones matching that description, but as it turns out the leggings I received don't look or fit the same and the tag describes a different fabric as well.***Reply to Rainbow review***Luckily I was able to return them for a full refund at a store nearby, with no issues. But to answer your question, the fabric on the tag said they were 95% cotton and 5% spandex. Which I have already tried but they ripped pretty easily unlike the ones I was looking for.", "rating": 2}, {"title": "Make Sure They're Not Sending U Used Items…", "text": "I purchased a pair of used cream colored boots with permanent light pink markings on them back in February. Me knowing that Rainbow online will send you used merchandise, I should've been more vigilant but I was in the process of getting a new place and just glanced over a boot and put it back in the box. Everything was fine until March when I actually took them from the box and got into my new place and saw all of the markings on the boots. All over both boots. The heels in different spots. I was so hurt, not surprised though. I called Rainbow to let them know. They responded about their 30 day policy. I sent in an email and got the same response. I reported them to the BBB because they have a problem taking back their used defective items over 30 days old but they don't have a problem sending customers used items or with HEPA violations.", "rating": 2}, {"title": "Strength and longevity needs attention.", "text": "The delivery time and updates were awesome. The shoe sizes were accurate and the comfort level for the shoes were as expected. However, on wearing the strappy toe loop sandals for the first time, it burst. I received several compliments on each shoe including the one highlighted, but to be with a damaged new shoe on first wear makes me extremely cautious to wear the others in my order.", "rating": 2}, {"title": "I wanted to order 6 pairs of boots but…", "text": "I wanted to order 6 pairs of boots but every address I gave in Los Angeles said the order could not be sent to that address. When I reduce my order to two pairs of boots, the order was complete. Now I have to make separate orders and pay more for shipping", "rating": 2}, {"title": "My total purchase was way to high", "text": "My total purchase was way to high. And when I realized l can cancel my order it was too late. From $43 to $53It was my own mistake for not noticing sooner. There’s a Rainbow department store less than 10 min from my home. I could of just driven there", "rating": 2}, {"title": "Disappointed with customer service ", "text": "I made a large purchase and I wanted to add additional items before items were sent out to avoid shipping fee. I was told they couldn't add to my last order placed or adjusted shipping fee for me, THEY WOULDN'T NOT THAT THEY COULDN'T...", "rating": 2}, {"title": "i mad they  unfollow me on Instagram…", "text": "i mad they  unfollow me on Instagram and express shipping is too much for some cheap ass clothes so I hope my stuff comes on time because I paid $27 for one day shipping", "rating": 2}, {"title": "Charged wrong card after selecting another card, CSR was no help!!!", "text": "I selected ZIP pay for my order, added the card information and submitted. Rainbow pulled my VISA card on file and charged my regular visa card. I tried to cancel my order and called, and was told that once I hit submit button it is nothing they can do. I just placed the order a few minutes and they can't do anything???!! So disappointed because I am sure they can correct this matter since I called them immediately after the submit button and seeing that it used my VISA card. They must do better!!! The Customer service Rep. Rebecca didn't even ask for my order #. You'll definitely lose business like this, I was going to change the payment method by phone but was told it couldn't be done. Well, I'll return my order and get a refund.", "rating": 2}, {"title": "Mmeeh 🫤", "text": "Their prices are reasonable but feel like they should have more promotions/discounts where they have free shipping on certain days, lower the amount in order to get free shipping, or even sending coupons by email. Returning policy should change. My first order(about 4 months ago) I went to the store to do a return and couldn’t get my money back because I did not pay with a CC. I then had to pay for shipping to get my refund . They should do free returns and anything additional to that same order should be charged on the return.", "rating": 2}, {"title": "If I have to pay for shipping then I…", "text": "If I have to pay for shipping then I expect a timely shipping date especially since it is not the Christmas season. My shipping date keeps changing. I needed this before my trip. It should not take this long. You need to look into your shipping it makes you look unreliable. If this is happening now why would I  order for Christmas.", "rating": 2}, {"title": "Poor customer service", "text": "Customer service was bad no acknowledgment in store at all. Online price was different and wouldn't honor it. Not a good selection of items in junior sizes. Over crowded with racks not shopping friendly", "rating": 2}, {"title": "My goddaughter bought me a dress the…", "text": "My goddaughter bought me a dress the week before Mother's Day. I wasn't able to try on. It's too big. She doesn't have the receipt only a receipt on her phone. I was told that not applicable. That sucks...", "rating": 2}, {"title": "When checking out", "text": "When checking out, page kept sticking and after adding the respective billing and shipping address information, the incorrect billing address showed after order was placed, which was made through PayPal. I hope I get my order.", "rating": 2}, {"title": "15 minute cancellation window is a SCAM", "text": "I was trying to check the shipping before purchasing an item and accidentally bought it. Cancellation window is 15 minutes. I didn't even get the email until 20 minutes later to be able to cancel! What a scam.", "rating": 2}, {"title": "Difficult checkout process", "text": "I wasn’t able to create an account so I had to shop all my clothes for a second time bc I was using Klarna… once I got to the end, shop pay was giving me problems saying that the Klarna card wasn’t accepted, then I had to refresh the page , screenshot my Klarna card, then manually type it in twice for the order to go through. I was 🤏🏽 close to saying forget the whole order Fr fr.", "rating": 2}, {"title": "I ordered 3 pair of sandals", "text": "I ordered 3 pair of sandals. My email receipt showed 2 of the pair with size and color ordered which is correct the third pair I ordered which are the studded braided band slide sandals and I ordered them in white but the receipt didn’t specify a color so I’m worried I won’t get the right color", "rating": 2}, {"title": "Website is well put together and easy…", "text": "Website is well put together and easy to navigate. 10% discount code text to me would not work. Spoke to customer support who emailed a code and that did not work either. Otherwise experience was fine.", "rating": 2}, {"title": "I was disappointed making my purchase…", "text": "I was disappointed making my purchase today. I been a loyal customer for many years and when I try signing on to my account to make my purchase, I could not get in. I had to create a new account since I couldn't get into my account. After creating a new account, I still couldn't make my purchase under my account I had to make my purchase under guest status, this is ridiculous and upsetting.", "rating": 2}, {"title": "I was truly looking forward to…", "text": "I was truly looking forward to receiving my package, but my order was incorrect. The bag was marked as the size I ordered but unfortunately the item inside the bag was the wrong size according to the tag. Such an inconvenience.", "rating": 2}, {"title": "The sale price was great, return policy was not.", "text": "The sale price was great. The online ordering process was seamless and smooth. I did not like the fact that if items purchased online using PayPal were returned to the store, you can only receive store credit. Also, if items were returned via mail, there is a $7.99 fee deducted from the return. I think this needs to be changed. I give 5 stars for the price and 2 stars for the return policy that I had to search for to locate.", "rating": 2}, {"title": "I was given an option to spin a wheel…", "text": "I was given an option to spin a wheel for 10% off and was given a prompt that said you all would allow me to use 10% towards my purchase. I did not see an email from you all nor a text extending the offer to me.", "rating": 2}, {"title": "Won’t ship to my state?", "text": "For whatever reason two items in my cast had to be removed because they can’t ship to California. It didn’t explain why or an alternate option.", "rating": 2}, {"title": "So I spinned the wheel and it stopped…", "text": "So I spinned the wheel and it stopped on 10%, I did not get the 10% off my purchase. Now I will get all the text messages regarding whatever from Rainbow but no discount. Please discontinue that spin the wheel thing; if the customer will not get the 10%. I would have signed up for text messages anyways.", "rating": 2}, {"title": "Unexpected Tax Charge tacked on after shipping", "text": "Shipping cost I expect. Added taxes at end-- I did not expect. Other  online companies  do not tack on taxes at end. Taxes usually revealed before shipping!", "rating": 2}, {"title": "The missing shoes", "text": "You have some shoes in my local store (Desoto TX) and there is only two pair and 2 sizes that I can’t wear. I have talked to the store manager and she tried to assist. She was very kind, I have called customer service and was told the shoes are not on the site it can’t be ordered, I searched the site several times hoping they would become available, I’ve went to different stores in hopes to find this shoe. I like rainbow but, I’m very disappointed that I can’t find the natural plaid heel in a size 9. Style Zenon-01 SKU number 03-135-5506. This show is what drove me to the site and prompted this order. Why would you make this color and style and only have a small selection available?Thanks for listening…", "rating": 2}, {"title": "I wondered why I was charged twice for…", "text": "I wondered why I was charged twice for one item on my credit card but the rep could not give me a valid answer except to tell me to wait 4 business days and then call back.", "rating": 2}, {"title": "Correct item but wrong color and this…", "text": "Correct item but wrong color and this is the second time this happened. Back to back orders incorrect. Also, I am unable to return this items is very inconvenient.", "rating": 2}, {"title": "The website would not allow me to use…", "text": "The website would not allow me to use apple pay. I am very uncomfortable putting my card number in online. ", "rating": 2}, {"title": "Shipping cost too high and delivery takes too long.", "text": "I am not happy with having to pay $7.99 for shipping....especially when my order only contained 2 crop tops....that probably don't even weigh a pound. Then on top of that it still takes a week or more for me to get my delivery. I've ordered from other online stores and they usually offer free shipping....and a comparable delivery time even though they're shipping from a further location. Rainbow needs to do better.So I received a response back from Rainbow and there shipping cost and long delivery times. The message was that I need to spend a minimum of $75 to avoid the $7.99 shipping cost.....this is beyond ridiculous. I'll just shop at Shein which offers....more variety, about the same shipping time as Rainbow and free shipping. Thanks Rainbow....but no thanks.", "rating": 2}, {"title": "The size variety for some clothes is…", "text": "The size variety for some clothes is not as big and makes it upsetting when u add the utrm to cart but checkout the item is sold out without a back order option", "rating": 2}, {"title": "Ridiculous taxes for 2 items!!!", "text": "I didn't like the fact that they charged me so much tax for 2 pairs of sandals of $7 each and then I won't be getting my order until 10 to 14 days?  Like I said, this is the last time that I'm shopping at Rainbow!!!", "rating": 2}, {"title": "Shipping it too high and the sales…", "text": "Shipping it too high and the sales aren't as good as they use to be a yr or two ago Rainbow is starting to be expensive but yes shipping is too high", "rating": 2}, {"title": "WERE IS MY ORDER FROM 3/20/24 ", "text": "I placed my online order 3/20/24 (11 days ago)and still today (4/1/24) I have not received my order. My credit card account was charged on 3/23/24! What's going on? ", "rating": 2}, {"title": "It took me 4 tries to get this order…", "text": "It took me 4 tries to get this order placed. I was about to shop somewhere else because the amount kept changing and the payment would go through but then give me a message about the order changing. the my order was canceled. i decided to try it one more time.", "rating": 2}, {"title": "I like rainbow", "text": "I like rainbow, however every time I order from them online they send me the wrong sizes. Causing me to return 95% of the order. It's frustration.", "rating": 2}, {"title": "My order was cancelled and…", "text": "My order was cancelled and voided...called back to resubmit it....never got any mail back....no delivery yet??", "rating": 2}, {"title": "My order wasn't delivered although I…", "text": "My order wasn't delivered although I used the same address as always. Now I have to troubleshoot with FedEx.", "rating": 2}, {"title": "Only purchase shoes and jewelry due to…", "text": "Only purchase shoes and jewelry due to most of the clothes items that I have purchased from you has been damaged with the first wash are wear.", "rating": 2}, {"title": "Hi I read that purchases $35.00 or more…", "text": "Hi I read that purchases $35.00 or more were shipped for free instead am paying $47.plus 👀😯 including shipping.", "rating": 2}, {"title": "Customer Service Sucks", "text": "I placed an order and realized a few minutes later that I forgot to remove two items that I purchased via another site. I attempted about 8 times over the course of an hour to cancel the order and couldn't. I then emailed the company about an hour after I placed the order asking them to either remove the 2 items or cancel the entire order. They refused. They claimed the order was being processed and couldn't be cancelled. The email did say I could bring the items to the store, but that won't work. This is the 3rd time I ordered something from Rainbow, but the second time, I had two items that needed to be returned. I took the items to the store and was supposed to have received a store credit, but when I then went back to purchase something for my daughter, there was no money on the card. They had to uniform items and my man's money! Fool me once, shame on me, but I'd be dang if I'll let you fool me again. Although the mistake was my fault, there is no way in heck they began processing my order four minutes after I placed the order. Amazon doesn't work that fast! Shoppers beware.", "rating": 2}, {"title": "Rainbow Shops on Pyramid Village in Greensboro NC", "text": "At Rainbow Shops on Pyramid Village in Greensboro, NC. A worker name Nayear Idk if it’s the correct way to spell it. I was standing in front of the register where there’s 3 woman supposedly working but just talking, when I said to them I have a return one worker says she’ll do it rt here. The other ladies showed no interest in helping me. They left and went to the floor except Nadyear. I’m standing there in front of Nadyear and she says to me very very rudely, You’re gonna have to wait. I’m helping someone else. Mind you I’m the 1st and the only one in line at this time. I said that was rude and asked her name. Sadly the other 2 ladies didn’t look like they were there to work either. They’re trying to put all of the work on Nadyear. She seems to be bothered by it and the customers are getting the blunt of it. I don’t appreciate it at all. I spend to much money here to be handled so rudely by an employee. Also, when will the dressing rooms become available again. Employees says you just not to do so. It’ll probably cut down alot of returns.", "rating": 2}, {"title": "The active sets are too expensive the…", "text": "The active sets are too expensive the sales really weren’t sales no red bras wireless on sale", "rating": 2}, {"title": "They asked if I want it in sonnee and I…", "text": "They asked if I want it in sonnee and I payed for $8.99 for faster delivery and I still don't have my order yet and I ordered it on the 1 of December", "rating": 2}, {"title": "No Consistency in Shoe sizes", "text": "I ordered a size 10....because I'm a 9 1/2 ,I have ordered 10 before from Rainbow because the shoes would run small, well?? This 10 next to the 10's I've purchased prior are about a size too small, so these shoes would fit a person who is a size 7 or 8. And who has time to send something back? I'm MAD BUSY that's why I ordered it online, so?? I have to look for someone who would like them :(", "rating": 2}, {"title": "I wanted items shipped to a famils…", "text": "I wanted items shipped to a familys address, not a business.I was not given other options at checkout ?", "rating": 2}, {"title": "It didn’t let me use my discount or…", "text": "It didn’t let me use my discount or pick a delivery option, like how days do I have to get my clothes. I wanted to select 2 to 3 days shipping.", "rating": 2}, {"title": "I recently bought a chalkboard and it…", "text": "I recently bought a chalkboard and it arrived in a damaged condition, the board has a big crack from top to bottom I fwd an email & the response I received was in relation to a different purchase.  No one has replied to original email, poor customer service & i will not deal with this company again", "rating": 2}, {"title": "Don't order tights", "text": "I tried to order some tights, but when I checkout, amessage said some items couldn't be shipped to my address. I took the tights out and the order processed.  What's that about?", "rating": 2}, {"title": "Not quite what I expected", "text": "The bike shorts were comfortable but not made out of spandex and they were see-through. Not sure what I can wear underneath it so they wouldn’t be see-through. They were delivered quickly.", "rating": 2}, {"title": "I had to reorder several times before…", "text": "I had to reorder several times before my transaction could complete. To this moment I cannot access the tracking information. So I just know that my order has been shipped nothing else", "rating": 2}, {"title": "There were so many more items I wanted…", "text": "There were so many more items I wanted to purchase, but they don't ship to California. ", "rating": 2}, {"title": "Gift card not accepted", "text": "It took me 5 times before it accepted my gift card I received for Christmas", "rating": 2}, {"title": "You need more \"Plus Size\" Options!", "text": "You need more \"Plus Size\" Options!! We all come in different sizes 4x, 5x, 6x. You have that size listed but only one thing to  choose from. Be more diverse!", "rating": 2}, {"title": "My problem is with checking out it said…", "text": "My problem is with checking out it said Fred shipping over $35 with I had over that an when I check out it kept jumping no shipping to the amount with shipping added so when I click pay I did pay for shipping when I wasn’t supposed to I’m very disappointed.", "rating": 2}, {"title": "Difficult  when making a payment", "text": "Difficult  when making a payment  , I wanted  to pay with PayPal  or Klarna.  It went to Shop", "rating": 2}, {"title": "Free shipping to stores", "text": "All stores ship free to there store.We understand charges for a shipping to your home. And the amount DOESN'T MATTER..always free to store.", "rating": 2}, {"title": "I wish I could have had the option to…", "text": "I wish I could have had the option to pick up my item in the store. Shipping fees were expensive for 7 days service and I live next to 3 Rainbow Stores. Not pleased. Thank you  😕", "rating": 2}, {"title": "The shipping cost is way too high", "text": "The shipping cost is way too high. Especially if you need to return an item( as in this case I am returning item)", "rating": 2}, {"title": "I was promised free shipping on an…", "text": "I was promised free shipping on an order of 35.00 or more, my order is 91.01, order number is 4153255", "rating": 2}, {"title": "i haven’t got a tracking number or…", "text": "i haven’t got a tracking number or anything purchased about 2 days ago", "rating": 2}, {"title": "All was good until I added the tee for…", "text": "All was good until I added the tee for 5.98My jump suit popped off the order and never came back to check ouI still want my jumpsuit floral print", "rating": 2}, {"title": "The dress was not what I expected it to…", "text": "The dress was not what I expected it to be.  I purposely did not order a ribbed dress.  The material was also sub par.", "rating": 2}, {"title": "It's just didn't go as smooth as fast…", "text": "It's just didn't go as smooth as fast as I remember account was t remember and luckily I had shop app that went thru fine", "rating": 2}, {"title": "VERY LOW INVENTORY TO CHOOSE FROM", "text": "VERY LOW INVENTORY TO CHOOSE FROM. ALMOST OUT OF STOCK IN EVERYTHING MY SIZE AND I ORDERED ON THE VERY FIRST DAY I RECIEVED THE TEXT.", "rating": 2}, {"title": "I was offered a 20% off coupon if I…", "text": "I was offered a 20% off coupon if I signed up for emails/texts ( I think it was emails) and upon check out it wasn't honored.", "rating": 2}, {"title": "This website is never working properly", "text": "This website is never working properly. I have to struggle to search and final payment. Hate it.", "rating": 2}, {"title": "Review", "text": "Please look into offering more discounts or coupon codes for different purchases. There is not a lot of variety as far as offering appropriate clothing for women to wear at work or just even out to wear without feeling naked. Most of the clothing attire listed are mainly for teenagers or young women. Please also try to have more clothes that young boys and teenagers can wear. There just isn't a lot of variety.", "rating": 2}, {"title": "Online ordering difficulties & return time frame issues good jogger sets available tho", "text": "Online had to start over with my order multiple times. One scrolling on the site and pressing on the clothes to check the size as I was sent to the top which delayed me purchasing items before they sold out me filling up my car to make selections at the end was hard as site blocked me for adding multiple items in my cart not sure why. X6 items jogging suits are cute wish they were offered in bigger kids sizes. More options for two piece jogging suits. Colors & designs are needed lots of the same colors. Coat zippers easy to break discount should be had if can prove broken. 30 day return & store credit if tags are gone should be offered I don’t shop here over other places or spend as much anymore because returns are difficult & unreliable especially to loyal shoppers. No rewards program. When customers are spending a certain amount returns should be longer & or store credits given for items new no visible damage. Return policy is to strict & complicated (online shipping takes time too cutting into the time frame for return etc) more time is needed for return window ppl have busy lives working more hours to survive & have money to spend more time is needed as well for ppl gifting & or separated parents (example: my kids, father bought some clothes and brought it to her during her birthday but he bought it ahead of schedule by the time she got it and tried it on he did not fit he paid on his card. I tried to return it, but there was no option to use card payment history I believe he did not take a receipt, and or he missed placed it I then could not return the items that is when I stopped shopping with this store. That was a waste of $200-$300 dollars I ended up having to buy her more stuff & stuck with clothes I couldn’t use) I also bought expensive keychain & Jewelry that broke or didn’t work well smh I definitely have had quality issues but the stores are always organized but too full which is great but gets overwhelming at times but options good. Need 1x sizing I’m XL-1x active wear sets for kids & adults would be great. Overall I like the different designs on the jeans. I love when you are used to sell sets for kids that came with a jacket, a belt, jeans, and a shirt. This was a great thing for birthdays and events kinda of a one and done thing. Changing room availability is an issue to use in cities we are subjected to wrong size shopping change in isles is embarrassing because we can’t use the changing rooms this stop ppl from shopping. I appreciate the fact that the prices at a time can be affordable, especially with the economy change. I hope all this information was helpful staff as usually very friendly. Please add more items to online as MOA has more selections than city high traffic areas as I would like to purchase more items, but can’t access it that far out.", "rating": 2}, {"title": "Shipping too high for one item that…", "text": "Shipping too high for one item that can’t weight more than 2ozs! Disappointed!", "rating": 2}, {"title": "I wanted to get a discount code because…", "text": "I wanted to get a discount code because the shipping is so expensive $7.99 is way too much", "rating": 2}, {"title": "Having to register just to check out…", "text": "Having to register just to check out was annoying there just should be a continue to check out as a guest option", "rating": 2}, {"title": "So many missing items on my first…", "text": "So many missing items on my first purchase.  Highly disappointed.", "rating": 2}, {"title": "I got an XL Brooklyn jersey instead of…", "text": "I got an XL Brooklyn jersey instead of the 4X I ordered. :(", "rating": 2}, {"title": "I tried to set up an account and it…", "text": "I tried to set up an account and it doesn't even let u do it", "rating": 2}, {"title": "They didn't tell me the quality was low…", "text": "They didn't tell me the quality was low until it sold out!!!", "rating": 2}, {"title": "Shipping cost too high", "text": "Products and delivery are fine, so are prices,  BUT $8.00 FOR SHIPPING??? That's nuts.", "rating": 2}, {"title": "Annoyed", "text": "I dislike that you can't use Rainbow gift cards on the website only in the store.", "rating": 2}, {"title": "Need more clothes variety in the store", "text": "Need more clothes variety in the store I can see in other store that have more varietyThe store is Store Number 1848 E 167th StBronx, NY 10452", "rating": 2}, {"title": "The filters do not work correctly", "text": "The filters do not work correctly. For example, I put in 34C for bras- I was still presented with a bunch of bras without that size availability.", "rating": 2}, {"title": "Not what I expected", "text": "Not what I expected. I called customer service and the rep was very rude.", "rating": 2}, {"title": "My cart disappeared …", "text": "I put 2 pair if boots in my cart yesterday ...Today I went to purchase them and my cart was empty. I went online to place order and boots were sold out", "rating": 2}, {"title": "One of the tops you sent wasn't what I…", "text": "One of the tops you sent wasn't what I ordered.  I ordered 3 polo type shirts with the collar. You sent 2 of them. The other one was with the back out. Nothing I ordered. Thank you Joanne Douglas.", "rating": 2}, {"title": "Shipping time and fees are ridiculous", "text": "Shipping time and fees are ridiculous. $75 for free shipping us a rip-off", "rating": 2}, {"title": "Everything is always gone...", "text": "No point looking unless you wear a small.  Folks must live on here to get the wearable sizes.", "rating": 2}, {"title": "I put in my address the right one and…", "text": "I put in my address the right one and it came to 606 Yonkers Ave my address is 220 Yonkers Ave 16b", "rating": 2}, {"title": "None of my discount codes worked…", "text": "None of my discount codes worked anytime I order from you all.", "rating": 2}, {"title": "You can't try clothes on in the store", "text": "You can't try clothes on in the store, very inconvenient.", "rating": 2}, {"title": "stores good and everything but the…", "text": "stores good and everything but the cashier was rude and had an attitude.", "rating": 2}, {"title": "I just didn't fine my sizes on sale…", "text": "I just didn't fine my sizes on sale items. I hope that the shoes I  order will fit. Order 2 sizes larger.", "rating": 2}, {"title": "Your sizes r not true to size", "text": "Your sizes r not true to size. And processing took longer than expected.", "rating": 2}, {"title": "Charging for shipping", "text": "Said free shipping over 35.00 but charging me 7.99 for shipping", "rating": 2}, {"title": "So much money for shipping", "text": "So much money for shipping! And big company like you guys should have free shipping", "rating": 2}, {"title": "It stated it had free shiping with a…", "text": "It stated it had free shiping with a $35.00 order, but it charged me shipping.", "rating": 2}, {"title": "I ordered a jacket but was not…", "text": "I ordered a jacket but was not satisfied with the size guide. They have a section that says women tops but the information is not sufficient. Also there need to be a review section under the items personal are interested in", "rating": 2}, {"title": "Poor Quality Fabric", "text": "I ordered 53 items, so a very large order. Some of the items are ok quality but most of the fabrics are cheap and look like a kid cut them right out and it will disintegrate when I wash them. Making the most of it but very disappointed as I shopped Rainbow for many years and was shocked at how poor quality these items are.", "rating": 2}, {"title": "Shipping is high!", "text": "Shipping is high!! The shipping is almost as high as the item purchased", "rating": 2}, {"title": "Customer service does not try to work…", "text": "Customer service does not try to work with you.", "rating": 2}, {"title": "Alot Of The Items Is Online Only And…", "text": "Alot Of The Items Is Online Only And Should Be In Stores Especially Plus Size Items As A Plus Size Purchaser Its Inconvenient For Me Too Shop Online", "rating": 2}, {"title": "This new site is hard to shop.", "text": "I don't know WHAT happened to this site or when it changed but the user experience was AWFUL. It used to be perfect with a great shopping experience. The navigation has made it so much harder to find specific types of clothing you're looking for and there are no helpful filters when you do a search to specify the category/sizing/women & age group. I was shopping all last year without any issues and this experience was just disappointing.", "rating": 2}, {"title": "I have been a customer for a very long…", "text": "I have been a customer for a very long time and I never ever receive a discount 😪🥲", "rating": 2}, {"title": "Took forever to load..", "text": "Took forever to load... had to reset my password 4 times.... then my bag was empty and I had to re enter my items.", "rating": 2}, {"title": "The good thing is I like the…product", "text": "The good thing is I like the merchandise, but the zipper were damaged. If I would have return it I would have lost my shipping cost and to reorder I would had to pay another shipping cost. That will make me pay more than what the product is worth.", "rating": 2}, {"title": "Your shipping rates and no discounts sucks", "text": "Your shipping rates and discounts sucks….You have high buying just to get free shipping for your cheap low quality clothes. Your catch is this I went to two stores in my area, and couldn’t find not one of the items that I ordered…so a potential customer has to shop online and pay your high shipping or pay over a $100.00 dollars. I will not shop online anymore….and probably not my local stores….because of my immune system, plus the clothes in the stores looks dirty and low quality and not like items online.", "rating": 2}, {"title": "Please try to modify return policy for shoes I’m honestly so confused about this…", "text": "I’m honestly so confused about this policy of not being able to return a pair of shoes if you do not have the box. The manager just makes it your problem now that you have something you can not use and clearly don’t want. In my opinion that called money hungry, some type of accommodation should be made because of this mishap to satisfy the customer.", "rating": 2}, {"title": "No dressing rooms bring it home try it on too late", "text": "Rainbow clothing stores have no dressing rooms so you have to purchase the stuff go home try it on if it doesn't fit you have to make another trip back to return it but you only have 7 days to return the item you or own it that's pretty much making it a real inconvenience for people not many people can get out twice in one week to do shopping for themselves along with everything else they need to do housework food shopping children jobs but they choose not to have a dressing room cuz they want you to purchase the items and not have the time to get back there to return them more money in their pocket less money in our pocket regardless of how inexpensive their items are", "rating": 2}, {"title": "First time purchaser discount code…", "text": "First time purchaser discount code wasn’t provided to me for my purchase.", "rating": 2}, {"title": "Worst customer service ever", "text": "I used to order at least one a month from rainbow but their customer service is horrible they don’t help at all delivery is terrible I usually order for vacation or a night out i use to get delivery with 4 days now it’s a week if not more and I am located in Massachusetts where there is several rainbow stores I never get free shipping unless I spend an insane amount of money I never receive a thank you for shopping here is 20% off and I am over it", "rating": 2}, {"title": "They didn't let me use the 10% off but…", "text": "They didn't let me use the 10% off but I still order", "rating": 2}, {"title": "I made an order on May 30th I just…", "text": "I made an order on May 30th I just received it today June 11th. It was for my nieces birthday that was on June 8th. The clothes were okay. Multi-flex clip on RGB light + phone holder. The box was torn, buldging and sealing tape was covering the ripped parts. When she opened it the phone attachment was missing. I'm very disappointed. How can we fix this? Without it taking 10 days.", "rating": 2}, {"title": "I actually like Rainbow, but…..", "text": "I actually like Rainbow. I’ve been a faithful for customer for many years. The problem that I currently have is that they’re making customers pay for shipping now. They’ve gotten rid of the free standard shipping offer. Noooooo", "rating": 2}, {"title": "Had problems logging into my account", "text": "Had problems logging into my account ", "rating": 2}, {"title": "So i ordered a ton of clothes on line", "text": "So i ordered a ton of clothes on line. FedEx lost my package. I called rainbow who returned the money but told me that if a package is lost again by FedEx, it will be on me to deal with FedEx. So they hire a delivery company who lost your package, they have your money but they want you to fight with FedEx, they will not do a thing to help you. So I stopped ordering online. Very disappointed", "rating": 2}, {"title": "You charged my credit card but did not…", "text": "You charged my credit card but did not process my order. PayPal stated that the shopping cart was empty. I called customer service but they had no record of the purchase, so I had to re-order yet my credit card still has a pending charge. Also, my free shipping disappeared AND an item I had in my cart ran out of stock, most likely due to all these problems!!!!", "rating": 2}, {"title": "The app wouldn’t let me log in", "text": "The app wouldn’t let me log in! It wouldn’t let me reset my password!", "rating": 2}, {"title": "It took numerous times trying to check…", "text": "It took numerous times trying to check out for it to work. I had way more stuff originally in my cart. Everytime I tried to check out it wouldn't calculate the shipping for my address. I tried two different addresses. I was about to give up and it ended up working with just 2 items and my original address. Very disappointed.", "rating": 2}, {"title": "It kept giving me problems while trying…", "text": "It kept giving me problems while trying to pay for my items. It also kept saying enter a valid phone number even after I entered it multiple times. It took multiple tries and then I had to start the process over because it kept declining my payment and that also took several attempts before it went through.", "rating": 2}, {"title": "Considering my package was supposed to…", "text": "Considering my package was supposed to be delivered yesterday and it still has not arrived yeah not so good I want my package or I want my money back", "rating": 2}, {"title": "Refunded", "text": "One package was delivered with no issues. The second package was returned.Its been several weeks and the tracker tracked it back to their store.They refuse to refund my money.Update: Rainbow has returned my money.", "rating": 2}, {"title": "Clothes are cheaply made and sheer", "text": "Clothes are cheaply made and sheerOrdered 2 of the same item same size but different colors.. and they dont match up in size length. One is way shorter in front .Same exact shirt.   First and last time I will order from your company.", "rating": 2}, {"title": "Spin and Win (JK)", "text": "When I created my new account, I was offered a Spin and Win 10% discount that I couldn't even use. I kept getting error codes when I tried to use it. If the company doesn't want to give it away, it shouldn't be offered.", "rating": 2}, {"title": "App was frustrating", "text": "I was frustrated with the app because I wanted to remove one xl cami (last one on bottom) but could not because of the payment option at the bottom of page. It would not let me bring it up and update item. Finally I had to remove one of the size 3x black cami’s.", "rating": 2}, {"title": "Why on earth can I not use a gift card…", "text": "Why on earth can I not use a gift card to your store on your own website but then you don’t have the items on the site in the store? That’s ridiculous! You end up picking out things you like and then having to use my own money even though I have a perfectly good gift card. Not to mention your poor call center reps that are probably getting an earful day in and day out because they have to tell customers they have no way to resolve their issue and they’ve been dealing with this since JULY. Not good not good at all. You are extremely lucky I was so set on getting those sandals otherwise you would NOT have made a sale with me at all.", "rating": 2}, {"title": "I was not able to place order online", "text": "I was not able to place order online. I had to call customer service twice to get order placed.", "rating": 2}, {"title": "I could not connect to Klarna..", "text": "I could not connect to Klarna... using this app.", "rating": 2}, {"title": "I am trying to find my order", "text": "Date of experience: April 30, 2023", "rating": 2}, {"title": "I paid for 2 day expedited shipping…", "text": "I paid for 2 day expedited shipping only for it to take an entire 7 days to receive my package!", "rating": 2}, {"title": "The actual brick and morter RainBow", "text": "The actual brick and morter RainBow shop personnel were GREAT, it was the on line shopping and the klarma because I was charged double or tripple the price for the same item in the store without the tax and s&h", "rating": 2}, {"title": "Need to offer coupons", "text": "Date of experience: November 21, 2022", "rating": 2}, {"title": "Give more discount codes", "text": "Date of experience: April 24, 2024", "rating": 2}, {"title": "Never received my order", "text": "Never received my orderCan not find any communication from Rainbow Shops after they said they were looking into it and getting information from the shipping/delivery service,", "rating": 2}, {"title": "NO search bar on the website", "text": "NO search bar on the website. Had to hunt for what I wanted.", "rating": 2}, {"title": "Disappointed", "text": "As a long time customer gift certificate/vouchers would be nice", "rating": 2}, {"title": "Not please", "text": "It took me three days to sign in. I lost most of the things that had in my cart.", "rating": 2}, {"title": "Shipping wasn't free", "text": "Shipping wasn't free. N it should be. Or at least $25 n up is free shipping. Disappointing.", "rating": 2}, {"title": "I couldn’t order a sweater because the…", "text": "I couldn’t order a sweater because the site refused to let me put down a size.", "rating": 2}, {"title": "Not able to use my gift card when I…", "text": "Not able to use my gift card when I make purchases online. If it wasn't for that I would of gave 5 stars", "rating": 2}, {"title": "The shoes are huge", "text": "The shoes are huge. I could have gone a whole size smaller. Was disappointed I had to return them. Are they men's or women's sizes?thank youCathy Houseman", "rating": 2}, {"title": "I signed up for a 10% discount and it…", "text": "I signed up for a 10% discount and it didn't give it to me.  VETY disappointed", "rating": 2}, {"title": "My cart kept erasing and it would not…", "text": "My cart kept erasing itself and it would not let me use my 10% off anniversary coupon code at checkout. 😒", "rating": 2}, {"title": "The items that I selected disappeared…", "text": "The items that I selected disappeared so I didn’t get everything I wanted and I’m dissatisfied that shipping is $8.00", "rating": 2}, {"title": "Cheap", "text": "Your clothes are cheaply made. After a couple of washes no good", "rating": 2}, {"title": "Shipping sucks… paid for 2 day shipping…", "text": "Shipping sucks… paid for 2 day shipping express on Tuesday today is Friday and estimated delivery is  Sunday which is too late for my event.", "rating": 2}, {"title": "I love rainbow,  Checkout frustrating", "text": "I love rainbow, but website acting up. Doesn’t allow you to view entire cart. Had to purchase something I didn’t want because I couldn’t delete it.", "rating": 2}, {"title": "Clothes are great but you have to spend…", "text": "Clothes are great but you have to spend way too much to get free shipping that's ridiculous everyone does free shipping now", "rating": 2}, {"title": "Order delayed", "text": "Date of experience: November 18, 2022", "rating": 2}, {"title": "I had standard postage marked and it…", "text": "I had standard postage marked and it just added the express shipping by itself to my order today so I paid more than I planned to.", "rating": 2}, {"title": "I have an account", "text": "I have an account, but had trouble logging in! Kept getting error messages. I hope the order comes correct. Or I will be returning.", "rating": 2}, {"title": "Website was redirecting me for no reason", "text": "Date of experience: February 10, 2023", "rating": 2}, {"title": "One of the items did not arrive", "text": "Date of experience: January 24, 2023", "rating": 2}, {"title": "My gift card would not work.", "text": "Date of experience: December 02, 2022", "rating": 2}, {"title": "My package did not deliver", "text": "My package did not delivered", "rating": 2}, {"title": "The Rainbow App", "text": "The Rainbow app is slow. It takes forever to use the cart. It didn't use to be like that in IDK🤷", "rating": 2}, {"title": "Spinng the wheel", "text": "I spinned your wheel & got 10% off. When checking out the 10% wasn't deducted from my order.", "rating": 2}, {"title": "I didn’t get my 10% discount", "text": "Date of experience: October 05, 2023", "rating": 2}, {"title": "sizes are fitting smaller", "text": "Leggings fit were of women's when I ordered plus..Returning items ASAP", "rating": 2}, {"title": "You don’t accept your own store credit…company credit not acceptable onlibe", "text": "You don’t accept your own store credit but was told in the store it’s acceptable online. That’s fraud!!!!", "rating": 2}, {"title": "The navigation was not easy I removed…", "text": "The navigation was not easy I removed one order and it deleted the whole order and I had to start all over.", "rating": 2}, {"title": "No customer service the cashier was…", "text": "No customer service the cashier was more interested in what she was doing in the night than assisting me.", "rating": 2}, {"title": "Lets Like Y'all Forcing Us To Spend…", "text": "Lets Like Y'all Forcing Us To Spend More Then We Want. I Feel Like $60 Should Get You Free Shipping!", "rating": 2}, {"title": "The price requirement for free shipping…", "text": "The price requirement for free shipping is too high.", "rating": 2}, {"title": "Honestly im very dissatisfied …", "text": "Honestly im very dissatisfied and disappointed the dresses,skirt, and overrall/romper  I bought for my daughter looked super cute and they were having a sale so i figured why not buy them ive never bought from this site but ive been trying out new websites and being they have to wear uniforms three out of the four days at school I bought her a lot of denim dresses that she could wear instead of the uniform and idk if she's going to be able to wear them or if they'll even last because they're so POORLY made. I bought nine items and EVERY SINGLE ITEM is freying one of the belt loops is broke on two of the items one of the belt loops is missing altogether on one of the items they're all freying super bad one of the buttons is barely hanging on a few of the dresses are coming apart at the seam etc these clothes are cheaply made the only one out of all of them that seems like it might last is the skirt the fabric is a thicker denim then the dresses and it was only freying a little but all the dresses are super thin and very cheap. Im so upset about this because I wanted to love them my daughter helped pick them items out and she was super excited about getting them today! If it was one possibly two items then i would be a little more understanding but for EVERY SINGLE item to have a defect bad freying/quality its just simply unacceptable. I have pictures and videos of the items I purchased and the state in which I received them in.", "rating": 2}, {"title": "Not enough online really nice cloth for…", "text": "Not enough online really nice cloth for plus size women for sweatsuits & club dresses.", "rating": 2}, {"title": "It would not allow me to use coupon…", "text": "It would not allow me to use coupon from Rainbow to get 10% off. Would not accept code.", "rating": 2}, {"title": "Items look very small for size ordered", "text": "Date of experience: August 18, 2023", "rating": 2}, {"title": "Shipping cost as much as the item", "text": "Date of experience: December 14, 2022", "rating": 2}, {"title": "I have not received my order", "text": "I have not received my order. Said it was to be delivered 3/25/22. Where is my order.", "rating": 2}, {"title": "See above!", "text": "I didnt get the shipping discount at all and I DID BUY OVER $75 worth of stuff!", "rating": 2}, {"title": "Disappointing", "text": "The checkout and password change was terrible. They need a better system.", "rating": 2}, {"title": "Never ordering from rainbow again!!!!!!!!", "text": "My order was canceled with no given reason and customer service SUCKS!!!!!!!", "rating": 2}, {"title": "No coupons was given to me online store", "text": "Date of experience: October 05, 2022", "rating": 2}, {"title": "I didn’t get the 10% discount I was promised. I put in the code. This is my first order", "text": "I didn’t get the 10% discount and I entered the code", "rating": 2}, {"title": "Everything I needed was out of…", "text": "Everything I needed was out of stock🥲🥲🥲🥲", "rating": 2}, {"title": "I was trying to use Apple Pay and it…", "text": "I was trying to use Apple Pay and it choose the shipping method for me smh", "rating": 2}, {"title": "Pd for overnight shipping where's my…", "text": "Pd for overnight shipping where's my order..no tracking available", "rating": 2}, {"title": "Too expensive shipping and the rest you…", "text": "Too expensive shipping and the rest you charge", "rating": 2}, {"title": "Didn’t let me use the coupon", "text": "Date of experience: June 16, 2023", "rating": 2}, {"title": "I couldn’t get the promo code", "text": "Date of experience: August 09, 2023", "rating": 2}, {"title": "It's really hard to get klanar with…", "text": "It's really hard to get klanar with your payment options.", "rating": 2}, {"title": "You offer a 10% discount not allowed to…", "text": "You offer a 10% discount not allowed to use on my first order.", "rating": 2}, {"title": "Website is malfunctioning specifically…", "text": "Website is malfunctioning specifically in the cart updates.", "rating": 2}, {"title": "Unable to get full order because sold…", "text": "Unable to get full order because sold out before purchase", "rating": 2}, {"title": "Did not have Navy shoe and size 😞", "text": "Date of experience: July 24, 2022", "rating": 2}, {"title": "Spent as much on shipping as I did the…", "text": "Spent as much on shipping as I did the clothes", "rating": 2}, {"title": "DID NOT HAVE AN ITEM IN STOCK AFTER I…", "text": "DID NOT HAVE AN ITEM IN STOCK AFTER I ORDERED IT.", "rating": 2}, {"title": "More sandals in size 12 would be great.", "text": "Date of experience: May 08, 2022", "rating": 2}, {"title": "I could not enter discount coupon", "text": "Date of experience: July 10, 2022", "rating": 2}, {"title": "The return process is TOO DIFFICULT…", "text": "The return process is TOO DIFFICULT especially for online orders. They should tell people that not all Rainbow stores returns are accepted. I couldn’t return Children’s clothes at one store because they do not sell Children’s clothes. Please advise that in the return policy to let shoppers/costumers know. Then I drove another 10 minutes to return it to a mall that couldn’t do returns because the mall was going under renovation by the following week. The lady seen my distress and seen that I drove two towns over so she went ahead and returned the items. Thank goodness for her. I had 9 other items I had purchased but 3 of the items ran way too small so needed to be returned.At the second store the people were friendly at the mall (Lafayette Square) but the staff was rude in (Speedway) they also need to have signs on the door that say WE DO NOT ACCEPT CHILDREN’S RETURNS!!! Also to return by shipping is $7.95 which deducts from your refund or you can pay at FedEx upon arrival. Which that is another inconvenience because not everyone is close to a FedEx. I guess it was a better option then being compared to the gas I used driving over from Nowheresville to the city then making two additional stops. Rainbow on return policies please do better. The shipping was “incredibly fast” and there is a lot of variety on their website and in stores. If it wasn’t for the horrible return experience and unreasonable staff (Speedway) I would of rated higher. It Seems to me the company wants to keep your money and make all sales final. I question if overall it’s a demographics issue because I clearly seen who mostly shops at these stores. Which that itself seems discriminatory within itself that these companies treat you based on the overall demographics of the shoppers which is morally wrong. They didn’t do this at Target, Abercrombie or Kohls when I returned things the previous day. Worse case scenario I would of disputed the items on my American Express Card. Hint* another reason why the lady went ahead and did the return. AMEX doesn’t play around with companies/stores not honoring store return policies. Seems like Rainbow does this at a discretion. So I can no longer shop at these stores due to the hassle of returning and the un-politeness of the staff.", "rating": 2}, {"title": "Could be easier", "text": "This app is hard to navigate and search", "rating": 2}, {"title": "SHIPPING IS RIDICULOUS", "text": "Date of experience: June 24, 2023", "rating": 2}, {"title": "Do some", "text": "Do some nice glitter and dress", "rating": 2}, {"title": "Stuff was missing", "text": "Date of experience: August 16, 2022", "rating": 2}, {"title": "Shipping fee", "text": "Shipping fee is TOO high!!!!", "rating": 2}, {"title": "Damage Sandals", "text": "Date of experience: August 24, 2022", "rating": 2}, {"title": "Shipping costs too much", "text": "Date of experience: April 06, 2022", "rating": 2}, {"title": "Delivery is too long.", "text": "Date of experience: April 21, 2022", "rating": 2}, {"title": "Where are my order", "text": "Where is my order", "rating": 2}, {"title": "I love this store", "text": "Date of experience: March 21, 2022", "rating": 2}, {"title": "You should have reviews on the website.", "text": "I purchased 2 tanks based on the material I usually get 1X they are so tight. No reviews on the website and returning is not easy. I ended up just giving them away. I have to rethink every purchase now.", "rating": 2}, {"title": "Disappointed that there are no…", "text": "Disappointed that there are no notifications when something is low in stock, or sold out.", "rating": 2}, {"title": "awful shopping experience", "text": "The site is awful for redirection after selecting an item for purchase. Having to keep resetting the filters, then trying to scroll back to where you were is very frustrating. I just quit shopping.", "rating": 2}, {"title": "Shoes are exactly like picture very…", "text": "Shoes are exactly like picture very cute they seem to be comfortable so far shipping was bad took forever for it to be delivered but other than that price was good", "rating": 2}, {"title": "You sent me a text to call and I called…", "text": "You sent me a text to call and I called and the woman was very rude that was on the phone", "rating": 2}, {"title": "The web site kept crashing and or…", "text": "The web site kept crashing and or repeating itself I tried on different devices took to long to shop good thing I had insomnia", "rating": 2}, {"title": "I wasn’t able to delete an item out of…", "text": "I wasn’t able to delete an item out of my cart because the Klarna add was covering the last item in my cart causing me having to purchase it when I wanted to take it out of my cart. The black slippers were the last item in the cart and I rotated my phone went to desktop view and still was unable to press the X button because the placement off the ad was on top of it.", "rating": 2}, {"title": "Where is my order I’m going to an…", "text": "Where is my order I’m going to an important event tomorrow out of town and my order has not been delivered !", "rating": 2}, {"title": "I have been shopping it rainbow for…", "text": "I have been shopping it rainbow for some years now. It's like the material is not what it seem to be on the website. Lso you have hardly anything in stock for my size. Might as well take the picture of the item down. Most designs of the clothes don't fit average real plus size women. I try to find things to ntinue to support but I get disappointed almost every time. Plus update plus size wear give us some clothes the camflauges the mid section and still looks sexy.", "rating": 2}, {"title": "Late delivery", "text": "Kinda upset was expecting my delivery a few days ago. I hate waiting on packages scheduled for delivery but doesn’t show up until whenever it does (if) it does because it’s no longer giving me any updates just pending and my patients is thin. I expected the delivery information to be accurate. I could have went in the store and bought the s*** by now delivery is taking  toooooo long", "rating": 2}, {"title": "Tracking my delivery!", "text": "To begin with online clothing was Limited, after submitting a small order I selected my delivery options but there was no choice to leave a note or further directions on delivery! I am not receiving updates on my delivery. The last one I received was yesterday stating I would receive it that evening and it never arrived. If I do not receive my order by tomorrow I will be contacting rainbow and submitting a grievance/complaint!", "rating": 2}, {"title": "System Changed shipping address to billing address", "text": "The online system kept changing the shipping address to the billing address. After several attempts I finally got it corrected. When I received my order confirmation both the shipping and billing address was the same. I immediately notified customer service. I was told, too late already shipped. REALLY Rainbow, so I paid shipping twice 😡", "rating": 2}, {"title": "Well i just placed an order 5 minutes…", "text": "Well i just placed an order 5 minutes ago so we shall see.", "rating": 2}, {"title": "Website kept crusing", "text": "Date of experience: February 01, 2022", "rating": 2}, {"title": "I wanted to pay with rainbow estimated…", "text": "I wanted to pay with rainbow estimated payments. It was not on there webpage and it charged me the entire amount instead", "rating": 2}, {"title": "Multiple issues with last few…", "text": "Multiple issues with last few purchases. Missing items. Phone customer service representative not willing to help. Multiple reps disconnected phone call. Promo code not applied.", "rating": 2}, {"title": "Two different prices for everything.", "text": "Date of experience: January 22, 2022", "rating": 2}, {"title": "Had a very hard time Login", "text": "Had a very hard time Login.  It took too long", "rating": 2}, {"title": "Luv my purchases but delayed shipment", "text": "I love the items I purchase, it just take entirely too long before your order is filled, it take a long time before they send out the items you’ve purchased and it takes a long time before you can receive what you’ve purchased.", "rating": 2}, {"title": "Shipping to Expensive", "text": "Shipping…you never give a discount or give free shipping every once in a while like other stores. Start doing it. Free shipping on $75 orders is not a deal or perk, please", "rating": 2}, {"title": "Coolbeans", "text": "The website is awful it is really wacky rainbow really needs help in providing better service when applying for an account when exiting from your purchases really bad experience with the website", "rating": 2}, {"title": "Never received my package in the time…", "text": "Never received my package in the time frame I was given It was suppose to arrive 2 days after placing my order yet I'm still waiting for it and it's been 4 days since I placed my order. I hope it still arrives as the things I ordered were all needed for a photoshoot :( rainbow should consider reward programs for loyal customers and exclusive promo codes for those that spend a certain amount.", "rating": 2}, {"title": "I was suppose to get 18% off of my…", "text": "I was suppose to get 18% off of my order and I did not!!! My first time ever getting anything from Rainbow", "rating": 2}, {"title": "I never got the 10% off my order of $85…", "text": "I never got the 10% off my order of $85 as advertised!  When I called, I was told to wait 24-48hours and would possible receive it in my email or junk mail.  In the meantime, I missed out on 2 items that were no longer available bc of this utter delay.  Much to my chagrin, I had to select from items that had to suffice but was totally disappointed at such a seemingly delay that should’ve been given at the time of my purchase!", "rating": 2}, {"title": "My navy blue joggers came damaged there…", "text": "My navy blue joggers came damaged there was like a bleached out huge spot on a leg", "rating": 2}, {"title": "Website needs to be overhauled", "text": "Website needs to be overhauled. Looks very outdated and pages freeze and load with no visible products regularly. Cart shows as empty, then when you refresh products appear.", "rating": 2}, {"title": "Unable to get into my account after…", "text": "Unable to get into my account after registering again n again. I don't think I'll be ordering again until this situation is rectified", "rating": 2}, {"title": "My order said delivered but I have yet…", "text": "My order said delivered but I have yet to receive my order . Have contacted customer service through email several times and have yet to receive a response. This type of behavior is unacceptable. I’ve order from you guys on several occasions and never had an issue but this time I just don’t understand your customer service when it comes to issues and I’m very disappointed in you all as a company . You may have lost a loyal customer after this incident.", "rating": 2}, {"title": "Shipping is to high", "text": "Date of experience: December 15, 2021", "rating": 2}, {"title": "I don't like the new app the…", "text": "I don't like the new app the configuration of the app and the online store are not even compatible/and or connected to one another. Both the app and the online store should be on one Accord", "rating": 2}, {"title": "I can’t add the apt number", "text": "I can’t add the apt number. It asked me to input it. But I was not able to", "rating": 2}, {"title": "It wouldn't take my coupon code it gave…", "text": "It wouldn't take my coupon code it gave me for an additional 10% off for being a first time customer", "rating": 2}, {"title": "Didn’t get discount", "text": "I was supposed to get 10% off and I didn’t which sucked.", "rating": 2}, {"title": "They didn’t have a lot of sizes", "text": "They didn’t have a lot of sizes to choose from .", "rating": 2}, {"title": "Bring back $50 free shipping!!!", "text": "Bring back $50 free shipping!!! I have been a rainbow shops in-store and online shopper for 10+ years, I know its a pandemic, but you should have kept it at free shipping over $50.  Your store is gaining many new customers daily I'm sure, please make the shipping free at 50 or 25 or more, you will get more customers.", "rating": 2}, {"title": "I had purchased a pair of pajamas and …", "text": "I had purchased a pair of pajamas and  took them back to the store the next day. I was told that they could not be exchanged. I called your customer service number and spoke to a representative who called the store manager and advised her to let me exchange the PJ's.Thiswas a great inconvenience.There was No apologize or anything offered by Rainbow Customer Service Representative.", "rating": 2}, {"title": "Delivery days are not reliable", "text": "Delivery days are not reliable.  I placed my first order on November 27, 2021 and to date, (December 7, 2021) there is no expected delivery date from FedEx.   Just two days ago the tracking information showed my order an hour and a half away from my shipping address and yet it still has no delivery date.  Very disappointing.", "rating": 2}, {"title": "Rainbow accepts Zip payments.", "text": "I originally gave a better review but afterwards I received from Rainbows saying one of my items had been \"refunded.\" No explanation why. My guess is that they sold out of the color or size but there was no option to replace the item. This is very annoying. Now I have one item coming. I think. Also, not sure how this might effect the initial Zip installment.My purchase was straight forward and easy. I did it through the ZIP app which was a tiny bit confusing but I figured it out. Can't wait to get my items. My only complaint is that since you offer Zip I would love if Afterpay and Klarna were also options. They are easier to navigate.", "rating": 2}, {"title": "I Need exchange one  my  items for  a…", "text": "I Need exchange one  my  items for  a bigger size .", "rating": 2}, {"title": "First and last time!", "text": "Hard to find size and when they said it was available it was removed from the cart. Lost out big!!!!", "rating": 2}, {"title": "The jogger stretches to two size up as…", "text": "The jogger stretches to three sizes up as you wear it...thumps down!", "rating": 2}, {"title": "You should add free shipping", "text": "Date of experience: November 27, 2021", "rating": 2}, {"title": "Rainbow is a hit or miss company…", "text": "The prices for items at rainbow are great. Low and reasonable prices for all items which is a plus. However the reason I give it two stars is because the items are cheaply and unevenly made. Pants legs longer then the other, holes in shirts after one wash, tread hanging from every item, and weird sizing on clothing. Rainbow is really a hit or miss. Sometimes you’ll get something made perfectly and other times you’ll get crap.", "rating": 2}, {"title": "I shop with Rainbiw frequently...my…", "text": "I shop with Rainbiw frequently...my issue is with delivery its been 5 days and No update  on where my package is it has said the same thing for 5 days. Use a different delivery service!!!", "rating": 2}, {"title": "Shipping takes too long!", "text": "Date of experience: November 16, 2021", "rating": 2}, {"title": "It was difficult to find my size…", "text": "It was difficult to find my size online. I used the filter to find my size and it still showed all sizes which made shopping online longer and more annoying. Please fix that for me. And please stay in stock on bottoms size 13. Its funny how that size is always gone!", "rating": 2}, {"title": "I had to reopen rainbowshops on-line…", "text": "I had to reopen rainbowshops on-line account. For some reason accounts opened before August of 2021 had to go through the whole re applying... what gives??? And this was after I kept getting an \"invalid password\" message over and over again. I think a heads up message would have been nice.", "rating": 2}, {"title": "Sent the wrong size sweater", "text": "Sent the wrong size sweater for one of the items and I really wanted that sweater more than any of the other 2 sweaters I ordered. Also you said you would send me 20% coupon for the issue and I have not received the coupon yet!", "rating": 2}, {"title": "Disappointed", "text": "The item was way to small. They should notify customers that they run small not true to size.", "rating": 2}, {"title": "Do not have my teenage daughter size in…", "text": "Do not have my teenage daughter size in jeans", "rating": 2}, {"title": "Not a friendly customer representative", "text": "The Representative wasn't friendly like the  other ones I'm use to just dry speaking, but it's okay cause it won't stop me from ordering from rainbow again, cause I love rainbow, maybe she was just having a bad day.", "rating": 2}, {"title": "Shipping is crap", "text": "This shipping process if a bunch of crap.  All along my delivery date was 11/6/2021.  Today is 11/8/2021 and it says delivery date is pending.  What the heck...why is it late.", "rating": 2}, {"title": "Go deals but, no longer ships to California :-(", "text": "No longer ships to California and other places. I had to send out of town, then have them send to me. Sort of a headache... SMH...", "rating": 2}, {"title": "Ordered 7 pairs of sneakers", "text": "Ordered 7 pairs of sneakers, size 11 for me, and 1 pair of 9s for my granddaughter. None fit me, the 11s fit her. I usually wear a10 1/2-to 11. She wears 8 1/2- 9. So disappointed.", "rating": 2}, {"title": "Discounts do not work", "text": "Discount code doesn’t work thumbs down", "rating": 2}, {"title": "Put the wrong address on my order", "text": "Date of experience: November 04, 2021", "rating": 2}, {"title": "Left arm was bigger than the right…", "text": "Left arm was bigger than the right arm…under arm ripped during outing.", "rating": 2}, {"title": "Shipping way  too expensive $14.99 omg.", "text": "Date of experience: October 31, 2021", "rating": 2}, {"title": "I paid for two day shipping for an item…", "text": "I paid for two day shipping for an item I needed on Friday. Site policy states orders placed by 12PM est will arrive two days from that date. I placed my order Wednesday at 6am est (for Friday delivery). It did not ship until Thursday around 3pm est (for reference, other expedited orders I placed from other vendors that day shipped by noon the day of my order). The order arrived Saturday evening, though the company did refund my expedited shipping fee. This did not help my situation, but it was very much appreciated. I would say they are not reliable if you need expedited service, though they do have quick, good, customer service.", "rating": 2}, {"title": "The main reason is y’all do not check…", "text": "The main reason is y’all do not check y’all  sizes before y’all send the items out happen too many times get it together now", "rating": 2}, {"title": "My 1st order went smooth i havent even…", "text": "My 1st order went smooth i havent even receive my 2nd set of items as yet far less havent receive no notification on the 3rd set i order either and then to top it off i notice after these 3 orders i have to now order item $75 and over to receive free shipping when it was $50 this is ridiculous on sooo many levels", "rating": 2}, {"title": "Help your loyal customers please", "text": "Some of my items were already out of stock. Also, it would be nice for discounts to be offered for customers who spend over a certain amount. This order was over $160 and my previous orders are sometimes over $200 and it would be nice to at least get a discount. Please consider", "rating": 2}, {"title": "Still haven’t received my package…", "text": "Still haven’t received my package passed up my home went to another town and could have been dropped off but package continued across the water to Norfolk all that way was unnecessary. The package was supposed to be scheduled 2 days ago today is 10/25/2021 2 days off from when it was supposed to be delivered", "rating": 2}, {"title": "You changed your free shipping to $75", "text": "You changed your free shipping to $75.  That is way too high for me.", "rating": 2}, {"title": "There are hardly any promotions going…", "text": "There are hardly any promotions going on as far as offering a discount on your order. There isn't a lot of variety when it comes to the kind of clothes being sold. Most of the clothing isn't age appropriate for anybody over 25 to wear and the amount you have to purchase to qualify for free shipping is outrageous.", "rating": 2}, {"title": "I spent a lot of time shopping and…", "text": "I spent a lot of time shopping and adding things to my cart, but at checkout it kept saying they couldn't deliver to my address. A few days later I get an email saying I left some things in my cart, so I try again and it goes through just fine, but now most of the items were sold out.", "rating": 2}, {"title": "It took to long for the add to cart and…", "text": "It took to long for the add to cart and checkout process.  I was not charged the advertised price (not happy about that at all)", "rating": 2}, {"title": "the free shipping rate of $50 or more…", "text": "the free shipping rate of $50 or more shouldve never changed to $75.", "rating": 2}, {"title": "I didn’t get any of the buy to or more…", "text": "I didn’t get any of the buy to or more discounts on my $700+ order", "rating": 2}, {"title": "I was unable to create a new account", "text": "I was unable to create a new account.  The website gave me a very hard time so I had to checkout as a guest.  I tried several times but was unsuccessful each time.  I called in but the representative was unsuccessful in helping me well.", "rating": 2}, {"title": "Shipping & Tracking", "text": "My order shipped out the very next day, GOOD! but once it came time for delivery.. it just stopped. I was no longer able to track it 1 week later. It didn't come when it said it would. I contacted Fed Ex & Rainbow customer service support.. both was not very helpful. I placed my order on 10/10 & today is 10/19 and I still haven't received my package or tracking info besides that it's still in Houston & have been since 10/16.  NOT A GREAT EXPERIENCE!!", "rating": 2}, {"title": "I was refused a size change & cancellation request", "text": "I asked to change a size in one sandal the same day I placed the order and they refused.They were unable to cancel the order either. The preferred if I returned the entire package to reorder *pathetic*I expressed how dissatisfied I was with their customer service team and they have yet to acknowledge me so here I am informing others of the treatment I received from Rainbowshops. Please be careful and be sure to place your order correctly", "rating": 2}, {"title": "I love rainbow I like how quick you…", "text": "I love rainbow I like how quick you sends out the items I order I love the clothes and prices. I can't wait to start ordering my Fall sweathers but some of there clothes and shoes run really small I always have to go up a size but I still love Rainbow!!!!!", "rating": 2}, {"title": "I order 4 items  size 7 when the order…", "text": "I order 4 items  size 7 when the order came they put in a size small which is too small they are not good", "rating": 2}, {"title": "THIS COMPANY DOES NOT HAVE COUPONS AND…", "text": "THIS COMPANY DOES NOT HAVE COUPONS AND DISCOUNTS AS THE OTHER SITES OFFER. I KNOW YOU FEEL LIKE YOUR PRICES ARE ALREADY LOW BUT U CAN ONLY SEE THAT UNLESS U SHOP IN THE STORES AND WITH THE DRESSING ROOMS CLOSED ITS A MESS.I WISH YOU OFFERED MORE WORKING CODES FOR MORE DISCOUNTS AND OIR ALLOW THE IN STORE COUPONS TP WORK ONLINE AS WELL", "rating": 2}, {"title": "Ordered all those items then to be told…", "text": "Ordered all those items then to be told that I had to redo my account.  Could not sign in after redoing my account and then had to order as a guest.", "rating": 2}, {"title": "Where is the sign out or logout…", "text": "Where is the sign out or logout located? Please clarify this in the settings or signing up area.", "rating": 2}, {"title": "sizing is all over the place", "text": "the shopping experience was not bad. I received my order very quickly. however, many of the item's sizes were WAYYYY off. I ordered most items in the same size - either 3 or 4x. I usually wear a 2 or 3. 2 of the 4s I could swim in and another I could barely move.. this makes it incredibly difficult to shop. it would be great if the website would allow reviews so people could know to either size up or down or stick with their usual size. very disappointing. about 1/2 of the order will be going back", "rating": 2}, {"title": "I was looking for clothes I can wear to…", "text": "I was looking for clothes I can wear to work. Your selection of clothes is very unatttactive. Nothing professional.", "rating": 2}, {"title": "Care about your consumers purchases.", "text": "I went to your store located at 1532 Southlake Pkwy Suite 5A to do a return, while in the store I located a pair of shoes that I wanted the money from the return to be applied toward.  The shoes that I was buying had a markdown, but the manager refused to give me the markdown price although I told her that there was another pair of the exact shoe with the same markdown price she totally refused to give me the markdown price and listen to what I was saying.  I have to say that the cashier checking me out explained that she was new to that particular store and that she was a manager at another store therefore she would give me the markdown price because it showed on the other pair of shoes also.  Ms. Brown said that she would do it although she may get in trouble she would let another manager that worked at that store know.  Ms. Brown stated that an employee neglected to change the price she wanted to please the consumer because it was not their falk. I appreciate what she did because she valued the consumer purchase in spite of the mistake made by one of their employees.  I was grateful for her valuing me as a customer therefore I thanked her and bought another pair of shoes as well.  I expressed to the cashier ( Latasha Brown) let me have her name and that I appreciated her for offering great customer service also. The other manager showed no interest in what I was saying and satisfying her consumer. I definitely wanted Ms. Brown to be recognized for her great customer service skills and I will be returning.", "rating": 2}, {"title": "2 of the eight joggers I ordered had…", "text": "2 of the eight joggers I ordered had holes in them", "rating": 2}, {"title": "Iam very  disappointed in my order", "text": "Iam very  disappointed in my order, I was not given yo me for free,I paid good money,I didn't appreciate it being stuffed in a bag totally  wrinkled.plus the quality was not as advertised, I've  purchased merchandise from Rainbow,and been quite  pleased, that is why this is such a huge disappointment 😞", "rating": 2}, {"title": "I canceled order still waiting for my…", "text": "I canceled order still waiting for my money to get put back on my card canceled it within 15 mins", "rating": 2}, {"title": "There is not selection of professional…", "text": "There is not selection of professional attire. To much crop. Not enough selection for people 50 and over", "rating": 2}, {"title": "I can't sign in to my account 😕", "text": "Date of experience: October 03, 2021", "rating": 2}, {"title": "Disappointed on Changes made to app", "text": "I am not a fan of the way you changed the Rainbow App. I used to faithfully order every week or every other week but now I don't because I don't like the fact that you can see the size chart like you used to. It would also tell you the size the model was wearing so you can get an idea on how it will fit you.", "rating": 2}, {"title": "cheap material", "text": "cheap material , and leggings were tried on then thrown into the bag inside out awful", "rating": 2}, {"title": "Nice selection HORRIFIC SERVICE", "text": "Nice selection, no mirrors, paired along with horrific customer service, specifically from the store manager, and if it’s bad there it’s not much else to say for this brand, store or the team. My experience was SO bad that I contacted their customer care team while standing there at the register, and filed a complaint against the store manager, in his presence! for the service that he chose to provide. This two star review is a for the variety of selection. ZERO stars for management and team.", "rating": 2}, {"title": "Keep on messing up my order", "text": "Keep on messing up my order. But other than that it was helpful and have a very blessed happy day!!!!          ~Mrs.Hooper", "rating": 2}, {"title": "The website is horrible", "text": "The website is horrible. I actually have an account, but everytime I sign in, I'm prompted to sign in. 😓You all have way better items in store.", "rating": 2}, {"title": "The app and mobile website are…", "text": "The app and mobile website are extremely buggy. I had to create a new account on the app since I couldn't log in or request a new password with my email address on either. After I placed my order on the app, the app closed. When I opened the app again, it does not show that an order was placed. My credit card was charged, so I know it went through, but doesn't look like I'll be able to track it.", "rating": 2}, {"title": "Website updates are horrible", "text": "Removed arrow to go back to top of the page. Unable to log into account and no option to see order history anymore", "rating": 2}, {"title": "Bad delivery service", "text": "i Just purchased clothes on September 21 it’s October 2nd and I have not received it I have no clue what’s happening and I can’t get them on hold", "rating": 2}, {"title": "It was ok a lot of size was not…", "text": "It was ok a lot of size was not available Sorry", "rating": 2}, {"title": "I do not like your new system", "text": "I do not like your new system. The website does not save my bag because I can’t sign in from there. The app is not much better. At this rate, you will loose a lot of my business.", "rating": 2}, {"title": "Difficultly placing order", "text": "Extremely difficult to make an order in app since the new update. Had to call customer service to complete my transaction.", "rating": 2}, {"title": "Defective sandal", "text": "I ordered three shoes but one was in complete ruin. The buckle band slide was completely defective. The strap was not secured to the sole of the shoe and the two segments of the sole were not sealed together properly. I live in the Caribbean, so to have it shipped back would not have made financial sense. I was very disappointed because I was looking forward to wearing it and even though the shoes are affordable, I'm thinking that the quality should not lend itself to such a deplorable state. I have since made another order with undeniable apprehension at the quality I will be receiving. I'm hopeful that the experience received was a one time event and that all my shoes in this order will be wearable.", "rating": 2}, {"title": "Shipping costs", "text": "The shipping was more than 1 item- you should get free shipping after $20", "rating": 2}, {"title": "Mostly everything that was in my chart…", "text": "Mostly everything that was in my chart had sold out. Rainbow needs to keep a size 12 shoes in stock.", "rating": 2}, {"title": "I still have not received my order n no…", "text": "I still have not received my order n no updates.so what's going on?", "rating": 2}, {"title": "Prices for plus size isn’t good like…", "text": "Prices for plus size isn’t good like for the other sizes", "rating": 2}, {"title": "U got my address wrong and i can't find…", "text": "U got my address wrong and i can't find a way to change it i hope my iteans dont get lost", "rating": 2}, {"title": "I order some slider and they didn't put…", "text": "I order some slider and they didn't put it on my order out was the leopard sliders with  red  and green  😑", "rating": 2}, {"title": "Can never find the items in the stores…", "text": "Can never find the items in the stores that are online so if you decide to purchase online you have to pay shipping if you place an order under the free shipping amount and the website is hard to navigate at times, especially the mobile site.", "rating": 2}, {"title": "Rainbow is my favorite store I always…", "text": "Rainbow is my favorite store I always shop with you guys. The only things is that on your active leggings you don’t always carry x-small size on the active wear pants, but other then that you are my favorite store to shop. Your prices are always low too! ✌🏼❤️", "rating": 2}, {"title": "I wish the shipping wasn't so high", "text": "Date of experience: August 30, 2021", "rating": 2}, {"title": "your shipping rates are ridiculous", "text": "your shipping rates are ridiculous. A $5.99 pair of shorts becomes $12.94, kinda hard to believe", "rating": 2}, {"title": "Damaged", "text": "One of the item had a hole in it and now I have to ship it back be", "rating": 2}, {"title": "Do Better", "text": "Well, the reason for the low rating Is 1) you don't offer in store pickup to assist with S&H.2) after pay isn't an option for payment. 3) The treashold for free shipping is $50...", "rating": 2}, {"title": "Web site and app not user friendly.", "text": "You guys changed ur website and the app is no better. I order online with you a lot. Use to be able to use filters to narrow down size and such. Nope, not no more! I don't have time to scroll through 900 black shirts. Also, There's no actual sign in now. No personal info in menu. What happened? Not a fan of the website now. Finding it to time consuming to find things and when I do it's sold out or size I need is out. Please put filters back. In the app too. I'm a big fan of Rainbow stores and I really love that the clothes have really improved. Please make online shopping easier. Thank you! My rating is solely based on online and app shopping. I give 5 stars for customer service and clothing.", "rating": 2}, {"title": "I love your clothes but your app is…", "text": "I love your clothes but your app is janky. I had to Uninstall and reinstall in a few times just so I could order.  It seems like if I close the app out I can't open back up. I have to uninstall it. Other than that it's all love", "rating": 2}, {"title": "Shipping price too expensive.", "text": "Date of experience: August 22, 2021", "rating": 2}, {"title": "Your asking for a code and you didn't given no code not good enough", "text": "No code is not good enough", "rating": 2}, {"title": "I wasn’t able to pay using my American…", "text": "I wasn’t able to pay using my American Express gift card I didn’t see the option available at all", "rating": 2}, {"title": "Shipping has taken forever", "text": "Shipping has taken forever. Still have not received my package after three weeks and no tracking updates. No one can answer for them", "rating": 2}, {"title": "Clothes aren't true to size.but I love…", "text": "Clothes aren't true to size.but I love rainbow.", "rating": 2}, {"title": "Took way to long to load payment page", "text": "Took way to long to load payment page. Whole process is very long.", "rating": 2}, {"title": "I am missing 2 items and this is not…", "text": "I am missing 2 items and this is not the first time this has happened.", "rating": 2}, {"title": "I never got my first package and now i…", "text": "I never got my first package and now i am watching to see if i get this package.", "rating": 2}, {"title": "I have not received my order as of yet", "text": "I have not received my order as of yet. I can not give a proper rating.", "rating": 2}, {"title": "The clothes run either to small or too…", "text": "The clothes run either to small or too big", "rating": 2}, {"title": "Untrustworthy....", "text": "I would have gave five stars but I was tricked into signing up with my email and I would have got a 10% discount code. The code was Invalid 🤷🏽‍♀️!", "rating": 2}, {"title": "I spent time searching this site…", "text": "I spent time searching this site yesterday for clothing at checkout everything I ordered disappeared 🙃.  I went into the store near the house and things were priced differently.  Today I did Place an order but it would have been to much trouble to start the full search again.  I was 😡upset.", "rating": 2}, {"title": "My shipment order number 26191423 was…", "text": "My shipment order number 26191423 was not shipped with the items I ordered. I just picked up my package from the address I shipped it to and 3 items were not in package. Round Toe Flats size 8 blue, girls rainbow checkered slip on sneakers size 2 and tie dye French Terry shirts blue large was not shipped.", "rating": 2}, {"title": "I ordered my items a while back and…", "text": "I ordered my items a while back and still have not received them not only have I not received them but there is no estimated delivery time. I ordered everything hoping it would be here before the 17th and NOTHING! This will be my last time ordering from them.", "rating": 2}, {"title": "I purchased  two  items  from your company", "text": "I purchased  two  items  from your company a pair of pants and a pair of slippers and I am very happy with my purchases. They both came on time and they were as pictured.", "rating": 2}, {"title": "Ordered my clothes for my upcoming trip…", "text": "Ordered my clothes for my upcoming trip They won’t arrive until after I am gone. I’m sorely disappointed. I don’t have time to go into the store because of my work hours.  They were supposed to arrive in 3-7 days and they won’t. It didn’t gong me the option of expediting my order for faster delivery. I was pleased with the selection and prices though.", "rating": 2}, {"title": "Excellent store", "text": "Date of experience: July 07, 2021", "rating": 2}, {"title": "I had a pair of black wax jeans that…", "text": "I had a pair of black wax jeans that was on clearance in my cart & before I could checkout it was gone. I was very disappointed as this was my first shopping experience with rainbow shops", "rating": 2}, {"title": "No reviews?", "text": "I hate the fact that there are no reviews. It's really like rolling the dice hoping these clothes fit well or are of decent quality. Probably my last time ordering if the clothes don't work out.", "rating": 2}, {"title": "I used to love the fit of the plus size…", "text": "I used to love the fit of the plus size jeans and pants. I spend lots of money with this store,but,my pass couple of orders have been a nightmare. Items fit like a junior size instead of plus size. I have recently found a new plus size store to shop at. I will miss shopping on the site,but, don't have time for the wait or hassle, perhaps the sizes will be better again in the future. Very disappointing.", "rating": 2}, {"title": "I keep seeing the same thing  over and…", "text": "I keep seeing the same thing  over and over.  were are the new designs..    long summer dresses,  flare short and long dress ,    summer sun hats..  to many bodycons.", "rating": 2}, {"title": "Took pages a long time to load", "text": "Date of experience: July 03, 2021", "rating": 2}, {"title": "I’m disappointed.org .", "text": "I’m disappointed.org .. bc I had a basket  full of dress and was trying to pay for it n it would it go threw. I lost all my dresses don’t remember what I had ..so had to do it like 4 times .. annoyed 😠", "rating": 2}, {"title": "I don't appreciate the high shipping…", "text": "I don't appreciate the high shipping prices 😡 and I don't appreciate the no availability of clothing sizes.. please restock more ofte.. are u guys going out of business or something", "rating": 2}, {"title": "Need more cute plus size options", "text": "Date of experience: June 26, 2021", "rating": 2}, {"title": "I have been waiting for a long time to…", "text": "I have been waiting for a long time to receive my merchandise very slow no one contact me to tell me situation on it or nothing", "rating": 2}, {"title": "Shipping cost", "text": "Date of experience: June 25, 2021", "rating": 2}, {"title": "Shipping was long", "text": "Shipping was long , even after adding extra items so it can arrive sooner it was still delayed. Size runs small also.", "rating": 2}, {"title": "Black pants ordered were horrible…", "text": "Black pants ordered were horrible quality seams between legs had holes in them now I will have to go to seamstress to try and fix pants extra money out of my pocket😡😡😡😡", "rating": 2}, {"title": "Frustrated customer", "text": "There are so many items the company broadcast on social media, but when you go to the Rainbow site it's out of stock. It would be nice if the company would discontinue circulating items that have been sold out for months without plans of a restock", "rating": 2}, {"title": "Where are the filters?", "text": "The website is fast and easy to navigate, however I did not find a way to filter the results of my searches. For example, I don't want to look through your entire wardrobe of dresses, one by one, and hope you have my size. I want to filter my size and have those results appear. There are too many clothing options on your site to not have filters.", "rating": 2}, {"title": "This site keep telling me that my order…", "text": "This site keep telling me that my order is incomplete because my email address is incorrect. But you send me a email. So is my order being process because my card information was entered.", "rating": 2}, {"title": "Will never order again", "text": "Date of experience: June 18, 2021", "rating": 2}, {"title": "Your website isn't user friendly.", "text": "Date of experience: June 17, 2021", "rating": 2}, {"title": "I didn't get an email receipt", "text": "I didn't get an email receipt.  And 5 days later, still no order confirmation or shipping notice.", "rating": 2}, {"title": "Wish there was more variety of options…", "text": "Wish there was more variety of options instead of the same ribbed shirt in 15 different colors", "rating": 2}, {"title": "The majority of items for sale were…", "text": "The majority of items for sale were sold out.", "rating": 2}, {"title": "Need updated options for plus size", "text": "Need updated options for plus size. Company shows no loyalty to loyal customers. We should be offered a substantial discount on our repeated purchases of their outdated plus sized clothes.", "rating": 2}, {"title": "Misleading website", "text": "The website needs to be frequently updated. The site displays clothing items and once you click the particular item(s) it’s sold out. Personally, I feel once an item or size has been completely sold out it should be taken down of the site. That’s very misleading.", "rating": 2}, {"title": "i give you this rate because most of…", "text": "i give you this rate because most of you items is outstock when you wanted to order need to updates your website more often", "rating": 2}, {"title": "Slow shipping", "text": "horrible shipping. I hate ordering online because the shipping always takes forever", "rating": 2}, {"title": "The website is poorly made/maintained…", "text": "The website is poorly made/maintained you have to log in every time even if you click \"remember me\". The website also buffers and takes a  long time for things to load.", "rating": 2}, {"title": "Was hard to navigate", "text": "Was hard to navigate. Pages are not numbered so i cant see how many pages i have to flip through.", "rating": 2}, {"title": "CCute clothes but that smells of mildew", "text": "The dress is really pretty and so is my Jean jacket I also got the red pants were beautiful however I must say that all of my clothes smell like they were in the basement they had a strong smell of mildew. I would not buy from rainbow.com again because of that", "rating": 2}, {"title": "I am not a fan of your check out…", "text": "I am not a fan of your check out process, it always tends to get hung up in the process.", "rating": 2}, {"title": "No one can tell me my delivery date", "text": "Date of experience: May 23, 2021", "rating": 2}, {"title": "My package was damaged and one of the…", "text": "My package was damaged and one of the clothes was damaged", "rating": 2}, {"title": "Everything is Sold Out!", "text": "Date of experience: May 21, 2021", "rating": 2}, {"title": "The clothing is beautiful but the Plus…", "text": "The clothing is beautiful but the Plus size clothing runs small and I dont get this I wear a 20 in women's clothing but a 3x is too tight fitting on me and even the jackets are tight on my arms at 3x", "rating": 2}, {"title": "Yet to receive delivery.", "text": "Date of experience: May 18, 2021", "rating": 2}, {"title": "Once you sign up you get a 10% discount…", "text": "Once you sign up you get a 10% discount and then never again. I've been a customer for over five years and never get any promos.The shoes I ordered, I had to order  online because each store was out of my size.  To boot, they are only $14.99 in the store but online they are $19.99.  That is ridiculous.", "rating": 2}, {"title": "Paid for items to arrive two days and…", "text": "Paid for items to arrive two days and now carrier put holiday and stop shipment,", "rating": 2}, {"title": "AWFUL. NEEDS WORK!!!!!", "text": "You’re app isn’t awful at all. Just wanted to grab your attention. I like the app itself and that you all give a description of what the models are wearing. It’s just a little difficult shopping online trying to figure out what will be see through or what will fit true to size. I suggest a review section where we could all post photos and give honest feedback on the clothing. Have a rating on the clothes and let the public let you know what’s higher quality then the next product. Customer satisfaction will rise as well as productivity.", "rating": 2}, {"title": "I paid for next day delivery and my…", "text": "I paid for next day delivery and my package 4 days later!", "rating": 2}, {"title": "They said the cost of the product would…", "text": "They said the cost of the product would be $7 if more them one is brought. I bought 5 and the pride was still $7.99. Maybe I got the discount i saw something in blue maybe that was my discount, It wasn't display good to me. I love your products, and I will buy again thank you.", "rating": 2}, {"title": "I wish we could order and pick up in…", "text": "I wish we could order and pick up in store", "rating": 2}, {"title": "That delivery dates and updates suck!", "text": "The delivery dates and updates suck!It take longer to receive my items.", "rating": 2}, {"title": "Would not allow me to sign in to my…", "text": "Would not allow me to sign in to my account or reset password", "rating": 2}, {"title": "Damaged item", "text": "My item of clothing I ordered arrived In plastic with stain on it. Was easily seen through plastic packaging but was shipped to me anyway.", "rating": 2}, {"title": "I used to love ordering from your…", "text": "I used to love ordering from your website but lately my orders are coming late and tracking is difficult and even one of your customer service reps missed up my tracking information and gave me a refund on something that was the wrong item.  She said it was my fault but I knew there was something wrong when I went to the website and seen the order was for $128 and she refunded $61. I called back to find out she refunded the wrong order. I tried to tell her to reverse the refund and fix the situation but she says she can't.  I don't want to take anything I don't serve.  I got that order but I didn't get another order number and she put an investigation on the tracking. The last 4 orders have been slow coming.", "rating": 2}, {"title": "Website is horrible", "text": "Website is horrible  it is extremely slow had to keep logging out and logging in . It took 39 minutes just to place an order .the website needs a upgrade", "rating": 2}, {"title": "I had thing in cart for me to purchase", "text": "I had thing in cart for me to purchase, when return they was gone.", "rating": 2}, {"title": "They give you a Promo code", "text": "They give you a Promo code, then when you try to apply it to your order, it doesn't work.", "rating": 2}, {"title": "Sizing were very irregular", "text": "Sizing were very irregular. Material on blouse and cover up very very thin.", "rating": 2}, {"title": "To whom it may concern", "text": "I love shopping for the dresses online. But honey the cost for the shipping is way to high. It’s almost the price as the original dress. I wouldn’t mind spending more money if the shipping was worth it.", "rating": 2}, {"title": "I applied a promo code and it did not…", "text": "I applied a promo code and it did not take the amount off of my order.", "rating": 2}, {"title": "I ordered 3 things all the same size…", "text": "I ordered 3 things all the same size and only 1 of them fit me. Your plus size clothes do not fit true to size. The only reason I didn't send them back was because I hate returning things and they fit my daughters who are quite a bit smaller than I am.", "rating": 2}, {"title": "Not enough to choose from in the colors…", "text": "Not enough to choose from in the colors I was looking for. Not enough variety in larger sizes.", "rating": 2}, {"title": "I use to love shopping at Rainbows I…", "text": "I use to love shopping at Rainbows I was truly excited about them having an online store but now y’all are such a disappointment. The clothes aren’t trendy anymore and the cost don’t match the quality of the clothes. Do better rainbows  !", "rating": 2}, {"title": "Not impressed", "text": "After placing my order I have received an insane amount of spam emails but no updates on my order. It has been two days past the latest date that my order was supposed to arrive and still nothing. Not impressed.", "rating": 2}, {"title": "Customer of 3 Yrs.", "text": "I was Overcharged on the Sales Tax; Our Sales Tax GA (Dekalb County) is 8% NOT 8.9% (Fulton County).  Also, the Customer Service Rep., Anastasia, claimed Customer issues can Not be \"Transferred\" to Management / Supervisors which was questionable.  I have since spoken w/ one of the Managers who is Super Professional & Courteous and I know she will diligently Solve my Sales Tax issue.", "rating": 2}, {"title": "I will never shop here again you guys…", "text": "I will never shop here again you guys told me my package found be here today and when I called fedex they told me it's still in arizona it's bine several weeks tell you the truth I just want my money back I will never shop here again and I will tell everybody about this  store", "rating": 2}, {"title": "One of the items I ordered was missing…", "text": "One of the items I ordered was missing and your customer service phone rep basically accused my of lying.  She also said she would give me a coupon for free shipping so I could order a replacement and she never did so I have to pay and additional $7 to order a $10 item that was missing from the original order and as far as I know, there will be no refund for the missing item.", "rating": 2}, {"title": "I'm still waiting for my order", "text": "I'm still waiting for my order, the delivery date, has been changed!😞", "rating": 2}, {"title": "Not enough color options", "text": "Date of experience: April 20, 2021", "rating": 2}, {"title": "I never received my 10% off for signing…", "text": "I never received my 10% off for signing  up online and shopping online.", "rating": 2}, {"title": "Takes forever to replenish stock", "text": "Takes forever to replenish stock, I log in everyday to check on basic Tops like camis and they are still sold out for 2 plus months in size so I wait and I check everyday. That sucks but other wise some items are a great fit and a joy to wear 2 stars because of stock", "rating": 2}, {"title": "Love All The Clothes At Rainbow❤️🌈", "text": "Date of experience: April 15, 2021", "rating": 2}, {"title": "Was trying to send stuff to my child an…", "text": "Was trying to send stuff to my child an it wouldn't let me send it to her address", "rating": 2}, {"title": "There is a cute dress I love but when I…", "text": "There is a cute dress I love but when I went to purchase it, it was Removed from my cart because you wouldn't ship it to my address. I have giving the site ALOT of business.", "rating": 2}, {"title": "Ordered fine they posted a delivery…", "text": "Ordered fine they posted a delivery date then when the day got here suddenly there was no delivery date I'm not impressed", "rating": 2}, {"title": "Too frequently this website showed that…", "text": "Too frequently this website showed that you were out of the things I wanted in my size.", "rating": 2}, {"title": "Terrible shoe sizing", "text": "I ordered two pairs of sneakers from rainbow I have big feet so I was happy I saw size 10 and 11 shoes I just wanted cheap shoes to ride my bike with and these shoes run so small they are so tight they aren't really a size 11. Now I wasted money on two pairs of shoes I can't even wear.", "rating": 2}, {"title": "To difficult in trying to manage my…", "text": "To difficult in trying to manage my information! Use a similar system! Getting ready to check was not easy either! All in all I give you 3 ⭐️ ⭐️⭐️", "rating": 2}, {"title": "Website was super slow", "text": "Website was super slow. Slow shipping is expensive as well", "rating": 2}, {"title": "I am always satisfied", "text": "Date of experience: April 04, 2021", "rating": 2}, {"title": "Didn't get my free shipping even after…", "text": "Didn't get my free shipping even after spending over $150.", "rating": 2}, {"title": "Due to website issue I was not able to…", "text": "Due to website issue I was not able to place a order under my account. I had to checkout as a guest.", "rating": 2}, {"title": "You keep talking about free shipping…", "text": "You keep talking about free shipping and handling but you want my card number for what", "rating": 2}, {"title": "I don't appreciate how Rainbow sends…", "text": "I don't appreciate how Rainbow sends you emails and if you don't want them ,we have to pay.", "rating": 2}, {"title": "I did not receive a order summary order…", "text": "I did not receive a order summary order number confirmation number nothing", "rating": 2}, {"title": "Every year yeah have the same styles…", "text": "Every year they have the same styles in clothes and shoes. I feel like y'all need to upgrade your merchandise, also some of the clothing is not true to size", "rating": 2}, {"title": "I brought all those clothes and your…still charged me shipping  never agsin", "text": "I brought all those clothes and your still charged me", "rating": 2}, {"title": "Poor product quality", "text": "Date of experience: March 22, 2021", "rating": 2}, {"title": "Shipping and handling is too much…", "text": "Shipping and handling is too much especially when you buy only a few items", "rating": 2}, {"title": "There were a couple of pairs of shorts…", "text": "There were a couple of pairs of shorts that I wanted but there was no $X of size 28.", "rating": 2}, {"title": "The web site with the password wasn't…", "text": "The web site with the password wasn't performing the directions would not work  had to contact customer service twice the second time they got me into account and all my cart was gone when I tried to recreate the cart very time consuming procedure most items were then out of stock couldn't find half of order ended up ordering not sure of and sad purchases may be returned to you Gloria Surls 3550 SE Hwy 54 Collins MO 64738 14173099207", "rating": 2}, {"title": "it takes to long for order to be…", "text": "it takes to long for order to be processed and shipped and when you need to do a return or exchange there's too much to go thru it shouldn't be like that your store computer system also needs to be updated to make returns and in store exchanges your store here in Milwaukee WI are way to messy and unorganized they need to be seriously be updated", "rating": 2}, {"title": "Cheap low quality cloth", "text": "got 5 items:- Boots are different, one boot is wider than the other. Like visibly wider.- Leather jacket. Smells like a dead fish. Fugly. Will be returning- Wind breaker. Weird fit, but ok.- Blue bomber. I actually like it- underpants. okOverall very poor quality cloth. I am happy I got most of the things on sale, otherwise would not worth it. Boots are the biggest disappointment because they are actually cute, but my right foot is seriously uncomfy :-( Wish they were even.", "rating": 2}, {"title": "Mehh", "text": "Your website could be so much better. The selections are redundant.", "rating": 2}, {"title": "Y'all should start back giving free…", "text": "Y'all should start back giving free things to people who order a lot", "rating": 2}, {"title": "Website difficult to navigate..", "text": "Website difficult to navigate... too many categories..too much going on just like in store", "rating": 2}, {"title": "I’m not comfortable about storing my…", "text": "I’m not comfortable about storing my credit card.  I use to order and give my card number, I was interrupted the last order and I’m surprised it went through.  I shouldn’t be forced to store my card to order your merchandise.  Very unhappy", "rating": 2}, {"title": "I wasn’t able to place my order online…", "text": "I wasn’t able to place my order online until I added my address, I called customer service and they weren’t able to help me with the order so I had to figure it out myself", "rating": 2}, {"title": "The clothing is not true to size…", "text": "The clothing is not true to size however the colors n the detailing of the clothing is what keeps me coming back n I have to add that the material is extremely thin.", "rating": 2}, {"title": "You took items out of my shopping bag…", "text": "You took items out of my shopping bag that I wanted to buy and now you don't have it any more I am a good customer and this is how I get treated.", "rating": 2}, {"title": "Need more variety in XL sizes", "text": "Date of experience: March 15, 2021", "rating": 2}, {"title": "not a great selection", "text": "Date of experience: March 14, 2021", "rating": 2}, {"title": "Very good job", "text": "Date of experience: March 13, 2021", "rating": 2}, {"title": "The leggings I ordered in my usual…", "text": "The leggings I ordered in my usual size, 3x, were so small that I couldn’t even get them on. These run way too small. Wasted my time by ordering through mail", "rating": 2}, {"title": "I love the clothes it’s just that they…", "text": "I love the clothes it’s just that they say 3x and I was mad cause it must run small and now I dnt know how to return it and I’m going on vacation wanted to wear the item on my vacation", "rating": 2}, {"title": "Not enough of a selection.", "text": "Date of experience: March 08, 2021", "rating": 2}, {"title": "When I processed my order", "text": "When I processed my order, I was given a different amount then what was charged to my card. After I completed my order, the amount was $4.35 more.", "rating": 2}, {"title": "The clothes are cut extremely small", "text": "The clothes are cut extremely small. I ordered large in everything but they feel like a small. Before ordering I looked up the sizes to each piece to ensure I was ordering the correct size. I wear a 9/10.", "rating": 2}, {"title": "Like the cloths picked out", "text": "Like the cloths picked out . Order the size for me but cloths dont fit me but my 11 year old daughter.", "rating": 2}, {"title": "I am extremely disappointed in your…", "text": "I am extremely disappointed in your company, because you do not carry nine in the house I have seen so many wedges tennis shoes sandals that I would love to purchase but because you don’t carry 91/2,I can’t purchase them the 10s are too big,Very unsatisfied customer.", "rating": 2}, {"title": "I love Rainbow and my family love…", "text": "I love Rainbow and my family love everything about them love able people Customer service is lovely respectable and every day we love our rainbow the nice prizes they have the pretty clothes they have for kids and adults Thank y’all  Sincerely Mrs. Rosechell Branch and Family 😍😍😍😇🙏", "rating": 2}, {"title": "Fit to small", "text": "The close say therefore expert really there not there to smalle It's 4XS should be  Bata for access more like  A1X Its forex it should fit", "rating": 2}, {"title": "SKEPTICAL", "text": "I HAVE ORDER FROM HERE BEFORE  AND I NEVER GOT MY PURCHASE. I HAD TO GET A REFUND FROM MY BANK. IM JUST PRAYING I GET MY ORDER THIS TIME AROUND. RAINBOW DID NOTHING TO HELP TRACK OR FIND MY ORDER EVERYONE AT RAINBOW HAD A NONCHALANT OH WELL ITS NOT OUR PROBLEM ATTITUDE.", "rating": 2}, {"title": "Disappointed", "text": "I called customer service twice about an item that was too small.  I returned it and have not seen a refund yet!   It’s been since January!  Now what really beats the cake is I purchased more items after and one of them has a huge stain on it!   No tag came with item!  I’m giving a bad review and most likely will not order in more items from Rainbow.  Very disappointed.  I don’t do, but one chance with a company anymore.  I just get over it and move on!", "rating": 2}, {"title": "They have been two weeks and I still…", "text": "They have been two weeks and I still have not received my item", "rating": 2}, {"title": "This is my 4th time ordering from here…", "text": "This is my 4th time ordering from here and never had an issue till tonight. I do not like that Robot check box it took me 10 minutes to place my order and my card information was asked 1st.  Something needs to be done or changed on that option", "rating": 2}, {"title": "i got my packages today and got the a…", "text": "i got my packages today and got the a box for a size 11 but the shoe was a size 10 that came instead of an 11.", "rating": 2}, {"title": "I never had no problem with rainbows I…", "text": "I never had no problem with rainbows I love ❤️ their clothes and I will always shop at rainbow 🌈", "rating": 2}, {"title": "You have nothing to choose from", "text": "You have nothing to choose from. Everything I want is gone. Not alone talking about the clothes you have on fb and when you hit. Order its sold out. Please remove them its very disappointing to want something then it's not available.", "rating": 2}, {"title": "I think that you guys owe plus size…", "text": "I think that you guys owe plus size women a HUGE APOLOGY for the way you guys categorize women’s clothes and plus size clothes! We are plus size women and that’s the way you should address this category! Thanks so much....De", "rating": 2}, {"title": "I purchased a fringed jean jacket it…", "text": "I purchased a fringed jean jacket it was poorly made. They didn’t take the time to shred the Jean properly  to make the fringes look neat I had to clean it up myself.  I was very disappointed with this item only", "rating": 2}, {"title": "Purchased a robe in a size 3X", "text": "Purchased a robe in a size 3X, Really enjoyed it went back purchased 2 more in two different colours they sent me sizes 1x with 3X tags in the neck.Very disappointed. 😞 Wish I could post the picture I laid the robes on top of one another you can see about a 6\" difference in size.", "rating": 2}, {"title": "Never gives coupons", "text": "Date of experience: February 14, 2021", "rating": 2}, {"title": "I keep having the same issues with…", "text": "I keep having the same issues with Rainbow... No invoices. I have to keep requesting them. Between the first two weeks in February  I order 4 packages and I had to request them, I only received 3 invoices with one being sent twice. I reached out to customer service to let them know and they haven't offered a response. I live in a different country and I CANT receive my packages from the shipping company without an invoice. Yesterday I ordered 2 more packages and I will have to request the invoices as soon as it has been shipped. Rainbows have good clothes, hence why I still support them but it sucks not getting help from them..  This is not how you deal with customers! Customer serve sucks!!!!", "rating": 2}, {"title": "The site was not very cooperative in…", "text": "The site was not very cooperative in letting me place my order. I had to try 3 different devices. I did not get an email confirmation of my order. The best thing was the price of the items.", "rating": 2}, {"title": "SHIPPING", "text": "I think that you should offer free shipping to regular customers like myself, without having to spend 50$ or m[ore.", "rating": 2}, {"title": "One day expedited shipping more like two days", "text": "I paid for one day expedited shipping but I think it’s taking a little too long", "rating": 2}, {"title": "A lot of things 3x are not a 3x I’m so…", "text": "A lot of things 3x are not a 3x I’m so disgusted I’m always taking things back to the store and I’m disabled", "rating": 2}, {"title": "My order was never received", "text": "My order was never received . I was given a bad tracking number . After I complained I was given a different number that said my order was delivered , and it never was . I’m still waiting on the investigation to conclude .", "rating": 2}, {"title": "Slow shipping", "text": "I recently started shopping online with Rainbows and the delivery turnaround time is insane. It takes forever for items to come and when they finally arrive i forgot I ordered it. Other retail stores I order from, their service is PROMPT! I love the deals from Rainbows but the FedEx shipping is ridiculous!", "rating": 2}, {"title": "The online services is okay but if you…", "text": "The online services are okay but if you want to take something back to the store and it didn’t state online only the managers give you a hard time or don’t take the items back at store.", "rating": 2}, {"title": "Disappointed", "text": "I was tryin to pay and it didn’t let me pay full price I had to pay in installment even doe all the money was on the card", "rating": 2}, {"title": "Got some I did not order and the…", "text": "Got some I did not order and the quality is quite different from the pictures.I'm disappointed", "rating": 2}, {"title": "It was fast to order price was good", "text": "Date of experience: January 30, 2021", "rating": 2}, {"title": "The sizing isn't true to it's size and…", "text": "The sizing isn't true to it's size and after wash some clothes it falls apart", "rating": 2}, {"title": "Technical difficulties", "text": "For 3 days, I have been trying to process my order. There is obviously something wrong with the website. The technical difficulties is frustrating. I finally called and spoke to a customer service representative named Esther. She was very kind and helpful. She took my order over the phone. You need to fix the website ASAP.", "rating": 2}, {"title": "You never have enough sizes 4x thru 5…", "text": "You never have enough sizes 4x thru 5 x.Other than that it is okay.I prefer to shop online instead of in store.", "rating": 2}, {"title": "Button was off the arm of my 👔 not…", "text": "Button was off the arm of my 👔 not cool with strings hanging off the garment", "rating": 2}, {"title": "Ordered over a week ago...still have…", "text": "Ordered over a week ago...still have not received my clothes that's coming Fedex??? Will not order online again!!! Thought only postal service took weeks to get your stuff...ugh!!!", "rating": 2}, {"title": "Okay", "text": "Easy searching sit for nice clothes. But my goodies shirts were to small ordered a 3x when I normally wear 2x or 3x depending on material but these are not comfortable at all. I've only ordered shoes from them not clothing too much never again will stick with shoes", "rating": 2}, {"title": "Handbag with bad stitching", "text": "The small handbag was a beautiful color, but the stitching around the bag is very poor quality. So very disappointed! I will be returning it to the local store.", "rating": 2}, {"title": "I love y’all excellent service and…", "text": "I love y’all excellent service and customer", "rating": 2}, {"title": "The website had glitches made it…", "text": "The website had glitches made it difficult to purchase Item", "rating": 2}, {"title": "Certain brand names don’t fit plus size", "text": "When I order shirts from Rainbow there is a certain brand name that doesn’t fit perfect at all. I do not think I can put the names of the tops that I do and do not like on the review. I know now to check the description about the tops that I buy and make sure it’s the perfect fit brand.I hate buying things and not able to wear them a waste of time. Disappointed", "rating": 2}, {"title": "I ordered my stuff December  28th and…", "text": "I ordered my stuff December  28th and it’s January 11 and I still never got my package", "rating": 2}, {"title": "I would give 5 if you offered free…", "text": "I would give 5 if you offered free shipping for returns.  I dont have a store in my state to return to.", "rating": 2}, {"title": "Disappointed", "text": "I attempted to use a visa gift card on your site but it keep refusing the payment. I called your customer service and they stated that if they cannot reach someone to verify the amount the site will not accept it. What????", "rating": 2}, {"title": "I still haven't received my package", "text": "I still haven't received my package.  It won't be delivered until the 11th. They were shipped on the 28th. Still waiting", "rating": 2}, {"title": "The tennis shoes that I wanted they…", "text": "The tennis shoes that I wanted they never had my size", "rating": 2}, {"title": "It would not let me purchase a purse…", "text": "It would not let me purchase a purse online", "rating": 2}, {"title": "Easy and user friendly", "text": "Date of experience: January 05, 2021", "rating": 2}, {"title": "Too many pop ups", "text": "Date of experience: January 05, 2021", "rating": 2}, {"title": "I’m very disappointed", "text": "I’m very disappointed I got 3 outfits 2 of them were all good but the one had stands on the pants n it looks like ink on the top of the hoodie n on each side very upset", "rating": 2}, {"title": "I still don't have my order..", "text": "Date of experience: January 04, 2021", "rating": 2}, {"title": "I was sent the wrong items and the…", "text": "I was sent the wrong items and the wrong size", "rating": 2}, {"title": "There can be more fancy clothes for…", "text": "There can be more fancy clothes for plus size clothes", "rating": 2}, {"title": "I order different color shirts and they…", "text": "I order different color shirts and they send me most all the same color if they didn't have the colors they should have not send me any colors I order a purple lavender which I hope I received the same color I paid for other than that they're good .Milán", "rating": 2}, {"title": "I cld not back out & go back and find…", "text": "I cld not back out & go back and find the things I had just clicked on like most sites! PISSED.", "rating": 2}, {"title": "Not much in my size", "text": "You need more selection of women's shoes in size 12.  Limiting us to black shows only with the best ones in smaller sizes only is body shaming.  I would love to have so much of what you have but you want me to be smaller.", "rating": 2}, {"title": "The layout of your website is weird", "text": "The layout of your website is weird. When trying to checkout your cart appears as a \"bar\" on the side of the screen making it difficult to navigate through checkout", "rating": 2}, {"title": "They were out of my size in almost…", "text": "They were out of my size in almost every pair of jeans. I also did care for the fact that a majority of them had rips in them. I love a good pair of ripped jeans, but I'd like a good choice of normal ones over ripped.", "rating": 2}, {"title": "I like the application but I can't make…", "text": "I like the application but I can't make the purchase, it keeps circling and I keep waiting ...", "rating": 2}, {"title": "Very good quality cloths", "text": "Date of experience: December 26, 2020", "rating": 2}, {"title": "You guys have nice stuff", "text": "You guys have nice stuff, but the sizes aren’t catering to each and every customer as I had hoped. Plus something I seen you guys had before was no longer available to be found which sucks.", "rating": 2}, {"title": "I made an order and was to wait for the…", "text": "I made an order and was to wait for the coupon code to apply that was going to be coming by email and did not come so I lost the 10% off.", "rating": 2}, {"title": "I had so many issues trying to make my…", "text": "I had so many issues trying to make my online purchase. The site kept freezing up and would not connect to my PayPal. The site wouldn't accept my credit card, so I had to use another credit card. I tried to check out last night and couldn't but this morning the site finally allowed me to check out. It was a pleasant experience. Thank you.", "rating": 2}, {"title": "20 days no package", "text": "Date of experience: December 23, 2020", "rating": 2}, {"title": "I'll leave a better review once my…", "text": "I'll leave a better review once my items have shipped.", "rating": 2}, {"title": "wrong colors…", "text": "I received wrong colors I bought green pants got black. Bought a black jacket got green. 😡 first time ordering. How do u mix coat with pants?", "rating": 2}, {"title": "You need a better size selection", "text": "You need a better size selection. You lost out on about 200 bucks from me", "rating": 2}, {"title": "No coupons no free shipping", "text": "No coupons. No free shipping. I’m regular customer.", "rating": 2}, {"title": "You should  have free shipping!!!", "text": "Date of experience: December 15, 2020", "rating": 2}, {"title": "I love Rainbow …", "text": "I love Rainbow been shopping with them since I started shopping on my own as a teenager and now for my daughter it's always something at rainbow for you always", "rating": 2}, {"title": "Good quality clothing at a reasonable…", "text": "Good quality clothing at a reasonable price.I highly recommend this site.", "rating": 2}, {"title": "never offer free shipping", "text": "Date of experience: December 12, 2020", "rating": 2}, {"title": "I'm a frequent customer and I think…", "text": "I'm a frequent customer and I think your company should have a reward points program for customers like me.", "rating": 2}, {"title": "When you check out and pay with Pay pal…", "text": "When you check out and pay with Pay pal it should be noted there that you cannot return to the store That was a BIG Inconvenience", "rating": 2}, {"title": "Stock low", "text": "Too much full priced off season stovk", "rating": 2}, {"title": "I give them two stars only because…", "text": "I give them two stars only because without any explanation they removed certain items that I loved about my purchase at the time of paying, I looked everywhere on their page for an explanation and I did not find any answer ... what a bad plan so I do not know if I would return  to buy even though they have excellent articles.", "rating": 2}, {"title": "Very glitchy and slow every time I'm in…", "text": "Very glitchy and slow every time I'm in the site.", "rating": 2}, {"title": "Was estimated to use the 4 payment…", "text": "Was estimated to use the 4 payment options and ut didn't let me not happy but it", "rating": 2}, {"title": "Coupons not valid", "text": "I'm good with the clothing and shoes but I've attempted several times(4 purchases completed with no discount applied) to get and use the coupon offering a percentage off after signing up for text and email without avail. Of course I started receiving the emails and text coupon would not work, It would be nice to get a percentage off after I've made several purchases. Not satisfied!", "rating": 2}, {"title": "Not that many good items", "text": "Date of experience: December 02, 2020", "rating": 2}, {"title": "Awesome", "text": "Had what I was looking for", "rating": 2}, {"title": "Because it would be nice if the option…", "text": "Because it would be nice if the option to ship to a store was added but you'll rather not do that after all this time.", "rating": 2}, {"title": "Sucks free shipping has to be over $50.", "text": "Sucks free shipping has to be over $50.Cant do store pick up or ship to store for free prices are becoming more high not how it was before", "rating": 2}, {"title": "The site has no incentives like gifts…", "text": "The site has no incentives like gifts for loyal customers.", "rating": 2}, {"title": "My order took too long to be shipped…", "text": "My order took too long to be shipped now i cant get it from the agency because i need a proper invoice", "rating": 2}, {"title": "I am trying to find L-XL white pants…", "text": "I am trying to find L-XL white pants for work but all you’ve have it 0-13 and I’m a 12 petite.", "rating": 2}, {"title": "most categories didn't come up with a…", "text": "most categories didn't come up with a list of items. i had to find tricks to get my wanted items in a search.", "rating": 2}, {"title": "The ordering process was easy", "text": "The ordering process was easy, but the shipping charge was way too high. It was as much as the items I ordered. Unless the items are legendary, I will probably order from somewhere that offers free shipping next time.", "rating": 2}, {"title": "It took several times to make the…", "text": "It took several times to make the purchase. I tried 5 times and received a null message, I tried the next day was successful. I also was under the impression that items were 10 percent off. I’m hoping the items I bought are not apart of a massive sale on Black Friday. Typically, I like ordering from Rainbow, this just happened to bea frustrating experience.", "rating": 2}, {"title": "I rate it a 2 because some items were…", "text": "I rate it a 2 because some items were ripped and I didn't want to return it and send it back because the shipping will cost more than the item I bought.", "rating": 2}, {"title": "I think it should be coupons and…", "text": "I think it should be coupons and promotion codes for people that’s always shopping especially due to the Pandemic that’s going on and people barely have money.", "rating": 2}, {"title": "I WASN'T ALLOWED TO SHIP TO THE US…", "text": "I WASN'T ALLOWED TO SHIP TO THE US VIRGIN ISLANDS SO THAT'S A BIG THUMBS DOWN FOR ME.", "rating": 2}, {"title": "alot of items were not in stock not…", "text": "alot of items were not in stock not alot of items to choose from", "rating": 2}, {"title": "Frustrated", "text": "Frustrated. Ordered and used PayPal. When I was checking out with PayPal, I noticed the city listed for my address was incorrect. PayPal had a note that wouldn’t let me change it and the note said to change it when it sent me back to Rainbow to complete my checkout. That wouldn’t let me either!!  Now I have an email into customer service because they are not open at 8:34 on a Saturday night!!  How do you not have 24 hour customer service?", "rating": 2}, {"title": "Did not like the fit.", "text": "Date of experience: November 21, 2020", "rating": 2}, {"title": "Don't trust the usage of any coupons", "text": "I made several attempts to log on using my correct email address in order to make use of any coupons available to me. I was unable to do so. I ended up paying in full for my items then received an email with offers. Please please fix your website.", "rating": 2}, {"title": "The site was a bit glitchy and I don't…", "text": "The site was a bit glitchy and I don't know if it was because it was from Facebook or what. But it made me feel a little shaky about putting  in my card info.", "rating": 2}, {"title": "Hi am Lourdez Herrera daughter My…", "text": "Hi am Lourdez Herrera daughter My mother (Lourdez Herrera) doesn’t speak English and she wanted to see her tracking order and she accidentally pressed “cancel order” and then we got upset because we couldn’t fix it please we beg this beautiful store rainbow shop to un cancel our order and track my order please thanks in advance. And my mom is worried please track her order thanksSincerely, Lourdez Herrera daughter", "rating": 2}, {"title": "I ordered some shirts and pajama sets", "text": "I ordered some shirts and pajama sets. I am an adult. The navy blue set liked like it was going to have white polka dots. Instead, it came with white dinosaurs! The other pink set looks nothing like the picture and looks like it's for old women. Highly disappointed.", "rating": 2}, {"title": "i place new order today because place…", "text": "i place new order today because place order nov 4 and yesterday customer service answer not processand not ship. in the past receive my order without problem.  PKEASE NOT DUPLICATE.", "rating": 2}, {"title": "Bad never helped me", "text": "Date of experience: November 13, 2020", "rating": 2}, {"title": "I give you guys the two I think that…", "text": "I give you guys the two I think that you should offer promo codes to take off some of your prices have a big order that’s just my thoughts", "rating": 2}, {"title": "I'm very unhappy with this experience…", "text": "I'm very unhappy with this experience my package was stolen. I never received none of the items this is very unprofessional and very unacceptable and very unnecessary I am a disabled person that is legally blind and delivery person did not even leave a door tag or notify me to let me know that my package was here my package was stolen the same day I had to call the police and filed for his work has do a whole investigation has to get a refund to get my money back or either get the merchandise to be sent they need to be more professional and use a courier service that is reliable is that a just dropping a package off and not notifying the person very unacceptable I am very happy with this experience you guys really need to improve your customer service the customer is always right make it right with the customer cuz if you don't use customer that way my stairs with this rainbow shop online has been very bad and very unhappy only way I'll be 6 hours 5 is there a Rainbow shops make it right by resending and merchandise for me or either refunding my money and they are something of that nature because this is unacceptable chain will I order from them again I don't know right now cuz I've had an experience happened I'm not happy with it right now and I should not have to wait to get a refund to just repay for the item that was stolen from me and I'll pay for it twice again that is ridiculous so I'm like I said I'm saying happy with the standings right now very unprofessional very unacceptable very poor professionalism close app button connection it rape option.", "rating": 2}, {"title": "The shipping stops me from ordering…", "text": "The shipping stops me from ordering regularly.", "rating": 2}, {"title": "The perfume and cologne boxes were…", "text": "The perfume and cologne boxes were mashed. It probably needs more cushion or to be packaged differently", "rating": 2}, {"title": "My parcel was not delivered within the…", "text": "My parcel was not delivered within the time that it was supposed to.", "rating": 2}, {"title": "Dirty clothing", "text": "I received my package on a timely manner but the clothes were dirty like foot prints this is not acceptable. Wish I could send pics .... smh was my 1st time buying from rainbow for my daughter.  Not pleased ...", "rating": 2}, {"title": "Check out was giving me a hard time", "text": "Check out was giving me a hard time. I checked out with klarna", "rating": 2}, {"title": "The rep was very dry in communicating…", "text": "The rep was very dry in communicating the information", "rating": 2}, {"title": "off season?", "text": "it was very difficult to navigate the site, i kept on getting messages about items being off season and not displaying the item page.", "rating": 2}, {"title": "There clothing isnt true to size when…", "text": "There clothing isnt true to size when it to to plus size!!! Ain't NO WAY A 4X SHOULD FIT LIKE AN XL I'M FREAKING DISAPPOINTED!!!", "rating": 2}, {"title": "the clothes were to small irregualr", "text": "Date of experience: October 19, 2020", "rating": 2}, {"title": "I placed an order but got the wrong…", "text": "I placed an order but got the wrong size . I tried to call bk after I placed the order to change the size but the wait was too long. I then wrote an email asking for the size to be changed before the package ship, but I got a response back in the morning saying that its not possible. I am highly upset about this.", "rating": 2}, {"title": "Broke on the 1st day.", "text": "I bought some boots from here and the first day I received them they broke the same day and my earrings that came in the packaging were broken when I received them had to deal with customer service to try to work on an agreement for return and money back thought the quality of the clothes that I bought from here would be way better. Disappointed.", "rating": 2}, {"title": "I ordered a matching outfit (top and…", "text": "I ordered a matching outfit (top and bottom) it came different top and now no more tops to match the bottom out of stock", "rating": 2}, {"title": "Shipping/Delivery Time", "text": "Prices are great but shipping cost and delivery time keeps me from purchasing more than 1 item", "rating": 2}, {"title": "Things were out of stock and they could", "text": "Things were out of stock and they could not ship accessories", "rating": 2}, {"title": "Delivered??? To WHO? WHERE??", "text": "I just hope this package actually gets to me. In may of 2020 I ordered almost a hundred dollars worth of shorts, bras, and panties. I never received them, and when I contacted rainbow for info, I never got a response. The tracking info said delivered to post office, when I went they said they didn't have it, rainbow never responded and the pandemic made it almost impossible to be able to talk to the right people. So as I said, I hope it actually gets to me.", "rating": 2}, {"title": "There was not alot of options to choose…", "text": "There was not alot of options to choose from. In the past I could also find accessories and other things. Since the covid there are many things to purchase.", "rating": 2}, {"title": "The shipping is slow", "text": "The shipping is slow. And the clothes dont fit well. The size you normaly wear in clothes everywhere else is ill fitting in their clothes. I bought a white top that buttoned at the neck and the one thread hoop that held it closed broke immediately, literally as I was trying it on. The clothing is very badly made and dont fit well. I've gotten better clothes at Walmart.  And their stuff is pretty crappy.", "rating": 2}, {"title": "Not many options", "text": "Not many size or color options. Was looking for a blue dress but L and XL were sold out.", "rating": 2}, {"title": "Shipping was not free", "text": "Shipping was not free . Will be returning item. Shipping should be free for orders $25 or more instead of $50", "rating": 2}, {"title": "Always great when ordering online from…", "text": "Always great when ordering online from here and they ship fast.", "rating": 2}, {"title": "I have not received a response yet for…", "text": "I have not received a response yet for my order", "rating": 2}, {"title": "I love this store but they are almost…", "text": "I love this store but they are almost always sold out of everything. They don’t keep the site updated as much as they should and they really should have promo codes for folks like myself who spend money with them.", "rating": 2}, {"title": "I just think shipping shouldn't be more…", "text": "I just think shipping shouldn't be more than assured it was very expensive", "rating": 2}, {"title": "Everytime I go to shop on here they…", "text": "Everytime I go to shop on here they never have my size in what I want (2x).  So disappointed", "rating": 2}, {"title": "No matter how much money I spend I…", "text": "No matter how much money I spend I never receive any coupons from Rainbow.", "rating": 2}, {"title": "Received an email Rainbows was having a…", "text": "Received an email Rainbows was having a sale on jeans starting at $14.99.  Logged on to the website.  Was lucky to find one pair of jeans.  Everything else in my size was sold out. I just don't understand how there is nothing left less than 5 minutes later.", "rating": 2}, {"title": "Deception", "text": "You need more of a selection with your clearance items. Instead, of buying into the belief that no one is interested in shopping because Covid 19, I would restock as necessary.", "rating": 2}, {"title": "The sizing isn't always correct and the…", "text": "The sizing isn't always correct and the varieties are always update in the plus size section. Id much rather go into the store versus shopping on the app", "rating": 2}, {"title": "You don't have much clothes i like…", "text": "You don't have much clothes i like anymore. I use to be able to get a lot of nice styles. No longer do u have much I am interested in.", "rating": 2}, {"title": "My express shipping is anything but", "text": "My express shipping is anything but. My order was supposed to be delivered in 2-3 days. Its been a full week now. I spent more money purposely to get quicker shipping. Very disappointed as I needed an item from this order today and now have to go out to a store to make yet another purchase because my items did not arrive in the timely manner as stated.", "rating": 2}, {"title": "Just saying much as I shop at rainbow…", "text": "Just saying much as I shop at rainbow clothing store I have never received the 500 dollar card and people that first signs up gets it that never shop there damn what about your loyal customers like me", "rating": 2}, {"title": "Customer service was helpful.", "text": "Customer service was helpful. So i give the two stars but putting the invoice in the package costed me a fck load of money from customs. Sorry but wont order again or recommend any of my friends to do so for international purchases... If the invoice was not in the package i would of been a happy camper but instead im broke and annoyed. For 5 shirts THANKS!", "rating": 2}, {"title": "basically the clerks were very very…", "text": "basically the clerks were very very rude. me and my sister were in a stall, there was no sign to signify that only one person per stall. they yelled from outside the stall \" only one person per stall.\" i would've appreciated if they knocked and told us outside the door but they did not. the 2 women at the cash register were also really rude, they told us that they needed a smaller bill, we gave them a 100 bill and they would not accept it because they \"did not have enough cash\" then they accepted it and magically pulled out money, they didnt go anywhere they just opened the cash register.", "rating": 2}, {"title": "After i made the purchase the web…", "text": "After i made the purchase the web refreshed yourself and it won’t let me view my recent purchase he said it was no purchase active but I did view it through my email.", "rating": 2}, {"title": "As soon as I placed my order the app…", "text": "As soon as I placed my order the app stopped working. I don't understand.", "rating": 2}, {"title": "I sent u an email explaining my…", "text": "I sent u an email explaining my problems placing an order today", "rating": 2}, {"title": "Wouldn’t ship items", "text": "Items were removed from my cart because they wouldn’t be delivered to California.", "rating": 2}, {"title": "Items not what they were \"supposed\" to be 🙄", "text": "I ordered a pair of \"birkenstock esque\" sandals, they were super cute and my other sandals broke so I was like hey, these look great. One of the shoes was broken in an irreparable way, which is incredibly annoying as they seem comfortable and cute. Otherwise, totally fine, though I ordered two shorts, and the plus size bike shorts with the pocket are MUCH more see through than they looked. I've contacted customer service and haven't heard back just yet, but it hasn't been an extensive wait either, I'm asking for a refund + replacement", "rating": 2}, {"title": "I would have given 5 stars to the store…", "text": "I would have given 5 stars to the store in Eddystone, PA because of efficient service. But because the male cashier was not wearing his mask properly -hanging near his nose and sometimes not even even wearing it at all. The other lady who  was teaching the male cashier was not also wearing the mask properly. Why can't they wear their mask properly covering their nose and mouth? With the Covid19 pandemic, they should be compliant to protect the shoppers.", "rating": 2}, {"title": "Why am I being charged a tax fee.", "text": "Why am I being charged a tax fee.? Thats the only complaint I have..", "rating": 2}, {"title": "I'm a new customer", "text": "I'm a new customer. I signed up for email and text alerts and I did not receive 10% off as promised. I can't even see my purchase history for the items that I just ordered. Good thing I took screen shots.", "rating": 2}, {"title": "Very sad", "text": "Shipping was great ease of website was also great! When the items arrived here I opened the package all of the items were either not as described or poor fitting, very disappointed!", "rating": 2}, {"title": "Offered coupon for email sign up- tedious", "text": "Offered coupon for email sign up - didn’t work ! Took long to process and screen delays almost made me forget the order", "rating": 2}, {"title": "I love the shop but I created an…", "text": "I love the shop but I created an account to make future purchases.  When I tried to sign in, it says there is no record even though I got an email confirming an account.", "rating": 2}, {"title": "Both pieces were off sized", "text": "Both pieces were off sized. Very small Large shirt & very Large large skirt. I gave both items away!!", "rating": 2}, {"title": "I placed and order and spent a lot of…", "text": "I placed and order and spent a lot of extra money for one day delivery and it took 3 days. I sent an e-mail to your customer service about getting my shipping charge refunded and, got no answer back.", "rating": 2}, {"title": "Size is way off says a size 3 or 4 x…", "text": "Size is way off says a size 3 or 4 x but was more like a 1 x", "rating": 2}, {"title": "Code does not work", "text": "I must mention first that I have received gifts from this site. And have been please with the quality of the product. However this is my first time purchasing items myself. I have not received my items as yet. But I was offered a discount code for my creating an account. Needless to say the code did not work. After trying multiple time I could not get the code to work. For this I am truly not please.", "rating": 2}, {"title": "Never received the 10 percent…", "text": "I signed up to receive the 10 percent off coupon and I never received it. I waited and waited and waited and never received it. I like the items and hope they fit. That will give this a star up for the inconvenience. UPDATE: I lowered my stars because the items do not match the size it claimed to be. I purchased two pairs of jeans shorts. The shorts do not fit unfortunately. I'll give them to my sister. I wear a 3X. These fit as if they were meant for an XL. Everything else fit perfectly and that maybe because they are made of stretchy/polyester material. If you need Jean shorts, its probably best to shop elsewhere because you can't size up but so much.", "rating": 2}, {"title": "Clothing was nothing like the photos on…", "text": "Clothing was nothing like the photos on website", "rating": 2}, {"title": "When I tried to sign in I forgot my…", "text": "When I tried to sign in I forgot my password, so when asked by you to put in my email I got a message that you do not recognize my email address... I'm not sure how that's possible when you send me emails every day.  So I had to place my order as a guest.", "rating": 2}, {"title": "toke very long in processing my payment", "text": "Date of experience: July 21, 2020", "rating": 2}, {"title": "I was satisfied with how quickly my…", "text": "I was satisfied with how quickly my order came, although when I went to try on the items I purchased only 2 outfits fit. I ordered all large items which should've fit me perfectly. I was very disappointed. If you order from here, make sure you order a size or two bigger!", "rating": 2}, {"title": "I had the bra for 2 days and the wire…", "text": "I had the bra for 2 days and the wire already coming out.I spend this much money on this really.I like the design and color but thin material.wire poking out so early.i wondering can i have a refund", "rating": 2}, {"title": "Ugggghhh, the trouble", "text": "The site was difficult to navigate and kept kicking me around to different parts on the page. Have me a headache just trying to register", "rating": 2}, {"title": "Shipping cost more than item", "text": "Shipping cost more than item. I bought because I really needed it, but never again.", "rating": 2}, {"title": "payment was difficult", "text": "payment was difficult and i'm still not sure if it even went through.. also make sure to check the cost of shipping!", "rating": 2}, {"title": "It take me a while two hour to get my…", "text": "It take me a while two hour to get my order to get Process", "rating": 2}, {"title": "I was Thruway plaza store location on…", "text": "I was Thruway plaza store location on Walden Ave in Cheektowage NY around 5:45pm where i purchased 2 t shirts. Went to the counter to cash out where i waited for at least 10 mins as middle age employee cash out another employee.  2 other employees at the counter as well. One look to be organizing new merchandise and the other hanging merchandise to my left near the counter.  No employee  Did not acknowledge my presents nor say that they would be with me in a moment. After the middle age woman ( African American woman) finish cashing out the other employee she just reached her hand out for my items never to communicate anything. The next words where the payment cost.  I began putting in my card and ask  For additional help with the check out process because I was using my card. Your system was unfamiliar to me and I asked her which one should I pick and she replied\" what ever you would like\" The staff could use a in service on  Customer service skills being more customer friendly.", "rating": 2}, {"title": "Your website said 10% off no coupon…", "text": "Your website said 10% off no coupon required but I didn’t received it as I was expecting to see it at checkout", "rating": 2}, {"title": "Lack of clothing selection", "text": "Date of experience: July 03, 2020", "rating": 2}, {"title": "I tried to use a Visa Credit Card/ Gift…", "text": "I tried to use a Visa Credit Card/ Gift Card and kept telling me it was wrong!", "rating": 2}, {"title": "Both pair of shorts are to big", "text": "Both pair of shorts are to big. The material was not what was expected on the overall jumper and the hooded dress was way longer than the picture. Just quite a bit disappointed as this was my birthday present. The shirts and the jeans were good.", "rating": 2}, {"title": "I couldn’t use my 10% off Coupon", "text": "Date of experience: July 01, 2020", "rating": 2}, {"title": "Confirmation of order emails should be…", "text": "Confirmation of order emails should be sent.", "rating": 2}, {"title": "I sent a return slip because of the…", "text": "I sent a return slip because of the wrong size in the slip i asked for a size 7 in both pair on the slip instead of sending the size 7 back Rainbow Shop refunded the money when all the slip read was to exchange for a size 7 in both pair", "rating": 2}, {"title": "st Charles Rock road location", "text": "Each experience has been pleasant up until today. A short heavy set lady accused me of have worn some items I wanted to exchange. The pants were long and the shirt was too small.  Only time it was worn was when I put the set on thinking I was going to wear it out to a function then realizing it didn’t fit how I thought. I didn’t cause a scene but the lady really offended me. My mother didn’t raise a liar  ! If the fact that the tags weren’t on clothing prevented them from allowing me to exchange it ok I understand but to accuse me of wearing it really disgusted me . Totally out of line. I won’t return to this rock road location. I think it’s wrong to try to execute someone character ! I’ll pray for that lady some people are just prone to ignorance .", "rating": 2}, {"title": "i tried to sign up for the email list…", "text": "i tried to sign up for the email list and get 10% off but it didn’t work or send me an email or anything confirming it. Also none of the promo codes work.", "rating": 2}, {"title": "I paid for 2-7 days of delivery and…", "text": "I paid for 2-7 days of delivery and it’s taking the delivery more then 7 days which considered free shipping if more then 7 days but I paid the $9.95 expecting the delivery to be here sooner I’m spending almost $200 and their charging me ten more dollars for a delivery that’s past 7 days", "rating": 2}, {"title": "I'm giving rainbow a two star because I…", "text": "I'm giving rainbow a two star because I feel they won't post my review otherwise. In actuality they only deserve 1 star. My order was placed on 6/6/20 and I still have not received my package. The delivery date has changed four times.When I finally able to get through to customer service after several phone calls and being hung up on. The answer I got was it's in transit, that's not acceptable. This is my first and last time ordering online from rainbow. However, I will continue to go into the store to shop.", "rating": 2}, {"title": "This was my first online order", "text": "This was my first online order with Rianbow and I must say I was disappointed. I kept hearing that the store carries plus sizes and the clothes are reasonably priced. That part is true but the sizes are not true to size. I wear a size 22 and everything I ordered felt like it was 2-3 sizes smaller. I would really have to think about ordering online again. I will be returning everything to the store.", "rating": 2}, {"title": "The sizes for plus sizes are completely…", "text": "The sizes for plus sizes are completely wrong I ordered a 3xl size shirt in 4 different kind of blouses and shirts and they run very small. Coming from a plus size shop or section you expect the sizes to be accurate they are not", "rating": 2}, {"title": "My coupon code was not accepted.", "text": "Date of experience: June 18, 2020", "rating": 2}, {"title": "My experience has been awful", "text": "My experience has been awful. I ordered and The sizes are so small. I wore my shoes once, and i already need to throw them away. I wore a pair of shorts once and the seems ripped. Tried to return all the items that didn't fit and they are making it impossible to return. Never ordering from here again. I only like 2/15 items.", "rating": 2}, {"title": "You guys gave me a coupon code to sign…", "text": "You guys gave me a coupon code to sign up and I couldn’t apply it to my order. Very disappointing", "rating": 2}, {"title": "The clothes came fast and looked as…", "text": "The clothes came fast and looked as they did online however the clothes SMELLED really BAD!!!!!!!", "rating": 2}, {"title": "Not to many options for plus size queens...", "text": "I love shopping with Rainbow got good prices and good quality but there are not a lot of choices to chose from at all... and when I find a item that I like as soon as I click on it everything is sold out it would be great if you would update your website more often and remove all sold out items... or add a notification when back in stock... also have more options for plus size like petite", "rating": 2}, {"title": "I got the same pants in the same size…", "text": "I got the same pants in the same size just in different colors and they all fit different. One was slight loose one was a little snug and another tight as hell that I ripped them when I bent over", "rating": 2}, {"title": "Didn't get my order confirmed via…", "text": "Didn't get my order confirmed via email. Money taken already no order details", "rating": 2}, {"title": "No promo codes", "text": "Date of experience: June 07, 2020", "rating": 2}, {"title": "quality can be cheap and may run small", "text": "Out of all the good stuff in my size online.", "rating": 2}, {"title": "Not enough merchandise for plus size", "text": "Date of experience: June 05, 2020", "rating": 2}, {"title": "The selection was poor and out dated", "text": "The selection was poor and out dated. I'm assuming this may be due to the pandemic. I would have spent more but there wasn't much to choose from.", "rating": 2}, {"title": "Every time I place a item in my cart", "text": "Every time I place a item in my cart, it disappears. I am so frustrated that I can't shop in peace because the items that I want aren't there when I get ready to check out. It was 7 items that disappeared from my cart and I couldn't find them anymore afterwards.", "rating": 2}, {"title": "Put it my email and did not get my 10%…", "text": "Put it my email and did not get my 10% off", "rating": 2}, {"title": "I got a confirmation email for this…", "text": "I got a confirmation email for this order but not my first order, disappointed.", "rating": 2}, {"title": "Did not receive a confirmation email for my first order!", "text": "I purchased items earlier and did not receive a confirmation email with an order number. I made a second purchase the next day and did receive a confirmation email with an order number.", "rating": 2}, {"title": "Size down", "text": "The shoes are nice.... However they're too big. I suggest a size down for the flats", "rating": 2}, {"title": "I spent 50 dollars and could have…", "text": "I spent 50 dollars and could have gotten more items I didn’t see the 50 with free shipping until I finished paying!!! On top of this I never got my items which I really needed for work!! Although I received a refund I would have preferred my items!!!", "rating": 2}, {"title": "I wasn’t given my discount", "text": "I wasn’t given my discount After I applied the promo code that was sent to me", "rating": 2}, {"title": "Everything was awesome until I realized…", "text": "Everything was awesome until I realized that I was missing a while tye she set I ordered. Calling and been on hold for a hour so far.", "rating": 2}, {"title": "The prices are to high", "text": "Date of experience: June 01, 2020", "rating": 2}, {"title": "the page froze when I tried to pay", "text": "Date of experience: May 31, 2020", "rating": 2}, {"title": "not that good as i expected", "text": "Date of experience: May 30, 2020", "rating": 2}, {"title": "No free shiping🙄😡", "text": "Date of experience: May 29, 2020", "rating": 2}, {"title": "Could have been quicker with the…", "text": "Could have been quicker with the response time and a lot more lenient with my payment type. 🙄", "rating": 2}, {"title": "One item I received was 2 sizes to…", "text": "One item I received was 2 sizes to small. They literally stuck a sticker with the size I wanted over the actual size. Maybe next time make sure the sticker can't come off", "rating": 2}, {"title": "I was supposed to get 10% off my entire…", "text": "I was supposed to get 10% off my entire order and your company sent me two promo codes one by email and one by text msg and I was unable to use either it said it didn’t recognize the codes. It said to call customer service which I will be doing to see if they can give me my discount because I noticed the prices changed", "rating": 2}, {"title": "Great", "text": "Your Service is great", "rating": 2}, {"title": "My daughter loves your clothes,her go…", "text": "My daughter loves your clothes,her go to spot for back to school.", "rating": 2}, {"title": "App doesn’t work at the end", "text": "Date of experience: May 22, 2020", "rating": 2}, {"title": "Delayed Shipping, Charged For Returns, and Not Being Able To Access The Article Of Clothing I Bought Again", "text": "I received what I ordered, although the shipping kept delaying more and more each day, and I ended up getting the package about a week after the original date I was given. The quality of the clothing was accurate for the price but the down side is the return policy. The clothing at Rainbow Shops is relatively cheap, but the return charges $6.95 which is a big deduction of what most would pay for. Because of this, the item is not really worth returning. I also headed to the website again and searched what I purchased but nothing showed up. I could not find the piece I ordered, even when searching the exact title of what I purchased. Overall, I got what I paid for, but the shipping was delayed, there isn't much of a benefit in returning the product, and I could not find the same item I purchased again, which is why I gave the rating of two stars.", "rating": 2}, {"title": "The order did not process on the mobile…", "text": "The order did not process on the mobile website", "rating": 2}, {"title": "Not enough options", "text": "Date of experience: May 18, 2020", "rating": 2}, {"title": "Went to use promo cold n didn’t let me…", "text": "Went to use promo code  n didn’t let me use it at all", "rating": 2}, {"title": "I wanted to edit my order shortly after…", "text": "I wanted to edit my order shortly after it was placed, and I was told I couldn’t ☹️", "rating": 2}, {"title": "Everything was too small", "text": "Everything was too small, I did the sizing chart, I have to return EVERYTHING!", "rating": 2}, {"title": "Overall the website was really easy to…", "text": "Overall the website was really easy to use, and I found many Items in my size. However, I spent over $85.00, but was still charged for shipping when it stated that it was No Code needed if over $50.00 spent. That's why I gave 2 stars during this transition.", "rating": 2}, {"title": "No options for sizes above 20", "text": "I couldn't find any jeans because you guys don't have sizes 22 and 24. It seems you guys sizes stop at size 20. So I was forced to order joggers. Not alot of choices in bottoms once you go pass size 20.", "rating": 2}, {"title": "I wear size 10 in shoes and it was very…", "text": "I wear size 10 in shoes and it was very limited to what was available.  Please do better with having stock.", "rating": 2}, {"title": "Not sure if things are just sold out…", "text": "Not sure if things are just sold out but there aren't many things to choose from, items are pretty scarce.", "rating": 2}, {"title": "The 10% off code didn't work!", "text": "Date of experience: May 09, 2020", "rating": 2}, {"title": "i feel like if it’s gonna take this…", "text": "i feel like if it’s gonna take this long you could at least allow it to be tracked.", "rating": 2}, {"title": "I gave y’all a five starI gave y’all a five star", "text": "I gave y’all a five star", "rating": 2}, {"title": "It doesn't tell you about your shipments", "text": "Date of experience: May 04, 2020", "rating": 2}, {"title": "Horrible customer service", "text": "It was a two week delay between placing an order and the item actually being shipped out. Recieved an email confirming my order and nothing other than that no explanation as to the delay or an email letting me know there would be a delay. Then once item was sent they gave me a day to expect them and nothing was delivered on that day. When calling customer service to ask any questions wait time was unreasonably long just to be hung up on by a machine.", "rating": 2}, {"title": "Why don't you have boys clothes", "text": "Date of experience: May 01, 2020", "rating": 2}, {"title": "No shipment updates on my order", "text": "I placed an order on April 26. It is now April 30 and my card was charged but I have not received any updates on shipment status. I can only assume it hasn’t left the warehouse yet, and it’s supposed to arrive to me within 8 business days and has already been 4.", "rating": 2}, {"title": "tracking…", "text": "still haven't got my tracking information.", "rating": 2}, {"title": "Shipping took a VERY long time", "text": "Date of experience: April 29, 2020", "rating": 2}, {"title": "Service and delivery is Slow", "text": "Date of experience: April 29, 2020", "rating": 2}, {"title": "Last time I ordered my clothes were too…", "text": "Last time I ordered my clothes were too big. The chart say 3x is 22-24. I could've used a 1x.", "rating": 2}, {"title": "Too many items sold out", "text": "Too many items sold out. They should be removed if not available.", "rating": 2}, {"title": "Nothing in stock", "text": "Date of experience: April 26, 2020", "rating": 2}, {"title": "Only one thing fit and the 3x clothes…", "text": "Only one thing fit and the 3x clothes fit my 13 year old sister.. I'll be sending everything i bought back", "rating": 2}, {"title": "Sold out on all xl tops", "text": "Sold out on all xl tops! None, zero, how?", "rating": 2}, {"title": "Online Photos and Description were deceiving...", "text": "2 pairs of the shoes were a different color. The one that said and looked white in the picture was actually more of a grey color, and the yellow sandals that looked yellow in the picture were more of a mustard-brown color....all sandals were size 9 and the two that were the same color as picture, were too tight at the toes. Disappointed but keeping them or going to give to someone else.", "rating": 2}, {"title": "Love  the producta", "text": "Date of experience: April 23, 2020", "rating": 2}, {"title": "My order was canceled without…", "text": "My order was canceled without explanation or a re order....", "rating": 2}, {"title": "We should be able to track our package…", "text": "We should be able to track our package . Or a number to call or something it is finna be two weeks since I ordered my stuff and it is still not here", "rating": 2}, {"title": "Ive never ordered from your store this…", "text": "Ive never ordered from your store this is my 1st time im hoping to recieve it in 2 to 7 days as i pd for", "rating": 2}, {"title": "Its been a few days", "text": "Its been a few days, I haven't even received a confirmation email. The money has left my account, but I have no way to check on my order. I log in and it shows no information. Highly sketched out as I spent over $100.", "rating": 2}, {"title": "didn't understand the 15 waiting time…", "text": "didn't understand the 15 waiting time to cancel my order.", "rating": 2}, {"title": "They can do better with the plus size…", "text": "They can do better with the plus size clothing", "rating": 2}, {"title": "Need more stuff for plus size.online", "text": "Date of experience: April 18, 2020", "rating": 2}, {"title": "i got everything ordered but no…", "text": "i got everything ordered but no shipping code was offered", "rating": 2}, {"title": "Barely had my size in anything!!!", "text": "Date of experience: April 15, 2020", "rating": 2}, {"title": "Before i could get a confirmation…", "text": "Before i could get a confirmation number to tract my purchase it booted me out then i created an account and it cant find my purchase although it took tge money. Im hust waiting now fir my things altho i cant track it", "rating": 2}, {"title": "I never received a confirmation email…", "text": "I never received a confirmation email with my order number", "rating": 2}, {"title": "You did not email me confirming my…", "text": "You did not email me confirming my recent order after purchase.", "rating": 2}, {"title": "Haven’t yet received order confirmation", "text": "Date of experience: April 13, 2020", "rating": 2}, {"title": "Website has inaccurate product…", "text": "Website has inaccurate product availability information", "rating": 2}, {"title": "I couldn’t get my discount code let…", "text": "I couldn’t get my discount code let alone use it.", "rating": 2}, {"title": "Unhappy customer service rep", "text": "I was not able to use my gift card on the website it said it had a zero balance. I tried to get the balance on your website and it didn’t even work. Then finally the young lady that I had that took my order seem like she didn’t want to be at work or something. I know things are rough out there in the world but you need to not sound like you were miserable. And then she had the nerves  to tell me that I must enter the numbers in wrong with an attitude, I don’t know what is her deal but maybe she needs to find another job", "rating": 2}, {"title": "Because I was given a discount code but…", "text": "Because I was given a discount code but there was no place for me to inter that", "rating": 2}, {"title": "Honestly I LOVE rainbow stores but…", "text": "Honestly I LOVE rainbow stores but online isn’t great.... I was given a coupon for signing up for emails but it didn’t work so when I asked for help with the coupon I was messaged back and told I can’t use it right now and to hold onto it.....", "rating": 2}, {"title": "Love it all 🥰🥰", "text": "Date of experience: April 06, 2020", "rating": 2}, {"title": "It doesn't say what day my package will…", "text": "It doesn't say what day my package will arrive.", "rating": 2}, {"title": "I used to love rainbow but lately…", "text": "I used to love rainbow but lately rainbow styles and fashion is not been good it's been looking cheap. There's not too many pretty styles.", "rating": 2}, {"title": "I still have not received my order", "text": "I still have not received my order. At first, the tracking said it would be delivered yesterday. Now, the delivery date is pending. What is going on?  Yes, we are experiencing difficult times, but deliveries are still being made.", "rating": 2}, {"title": "Looking for 10% off my purchasing never…", "text": "Looking for 10% off my purchasing never got one....", "rating": 2}, {"title": "It wouldn’t let me sign up to receive…", "text": "It wouldn’t let me sign up to receive the 10% off", "rating": 2}, {"title": "No Receipts", "text": "The shopping was an easy experience. But I never received a order number or any confirmation via email. That’s nerve wracking because I placed an order, gave you all money and have no record of the order.", "rating": 2}, {"title": "I have not been impressed the last…", "text": "I have not been impressed the last three orders I have made... The clothing patterns are ugly in person and the size is now running small!  I usually order $50 or more at least once a month so I'm a pretty regular shopper and have been for years... I keep thinking my last two orders were flukes and it would get better next time.  Well, it hasn't.  They just don't do rainbow clothing the way they did two years ago.  Beyond disappointed!  Will more than likely find a new place for my plus size clothing.  The style,size,  color and look has roughly declined with rainbow!", "rating": 2}, {"title": "na yall kno during this time yall…", "text": "na yall kno during this time yall souldve had A discount code", "rating": 2}, {"title": "There no boys clothes which was…", "text": "There no boys clothes which was unexpected... But everything else is awesome", "rating": 2}, {"title": "Upset", "text": "The first time I put stuff in my cart, all of it was taken out and I had to go find them again. This happened multiple times. The clothes are cute but this really upset me.", "rating": 2}, {"title": "Love it work there and shop here before…", "text": "Love it work there and shop here before I receive the job. Be can't wait to see new things", "rating": 2}, {"title": "Because I made a order from your…", "text": "Because I made a order from your account and now I can’t find it so I don’t know if it’s coming or not", "rating": 2}, {"title": "Items still haven’t been shipped yet…", "text": "Items still haven’t been shipped yet and I checked out as a guest and didn’t receive a tracking number or order number in my email.", "rating": 2}, {"title": "The clothing is not a good quality", "text": "The clothing is not a good quality. I brought a pair of sandals that I liked just needed another size and I was told I would have to make a whole new order and pay a shipping and handling fee plus a fee to return the too big shoes. The company seems to not work with customers I don’t think I will ever order online again.", "rating": 2}, {"title": "No follow up", "text": "I have not received  a confirmation email nor a tracking email from your company.", "rating": 2}, {"title": "Shipping price is horrible", "text": "Shipping price is horrible. Only purchashed 1 item and shipping was more than the item.", "rating": 2}, {"title": "I ended up paying for shipping when in…", "text": "I ended up paying for shipping when in the shipping details said it was free. Misleading!", "rating": 2}, {"title": "As soon as I maDe my order it booted me…", "text": "As soon as I maDe my order it booted me no confirmation or nothing", "rating": 2}, {"title": "It was meh but you get what you pay for", "text": "Date of experience: March 22, 2020", "rating": 2}, {"title": "Pants were terrible and sent back", "text": "Pants were terrible and sent back.  The waffle duster was very thin but I kept it.  The quality of the cloth you use is not of my standard.  I won't be placing any further orders.", "rating": 2}, {"title": "Cute products, bad shipping", "text": "Very cute products. I always love shopping at Rainbow. HOWEVER, I shouldn’t be paying more money for shipping than the product itself. You’re advertising massive sales, yet the shipping prices are MORE than the “sale item.”", "rating": 2}, {"title": "Never received tracking number for my…", "text": "Never received tracking number for my package", "rating": 2}, {"title": "I was unable to get my discount", "text": "I was unable to get my discount. The site freezes a d glitch a lot.", "rating": 2}, {"title": "Undecided", "text": "The ordering process was good and the site is easy to navigate. Can not rate the clothing yet due to just ordered yesterday and will wait to receive them to comment. The reason for the 2 star rating is because I can not log into my account, when questioned about it the reply was no such user. But when  I try to make an account it says user name already exists which is My E-mail???????? Tell me again how no such user exists. Therefore is the only reason so far for a poor rating.", "rating": 2}, {"title": "I ordered some sneakers for my daughter…", "text": "I ordered some sneakers for my daughter here. The check out was fast and simple. The sneakers were pretty affordable and on top of that I received 10% off for Signing up. Now I hope the sneaker are of decent quality.  Edit: I changed my review to a one star (didn’t let me go that low in rating) because I did not get a confirmation email for my order and it is not showing in my account as if I did not order anything. Yet they still charged my card.", "rating": 2}, {"title": "I payed for 1 to 2 day shipping with my…", "text": "I payed for 1 to 2 day shipping with my first order the second order regular shipping tell me why they are being delivered the same day I  would like a refund due to thefact I payed extra to get it quicker", "rating": 2}, {"title": "The online ordering is difficult to…", "text": "The online ordering is difficult to navigate when it looks simple", "rating": 2}, {"title": "Coupon codes didn't send", "text": "The coupon codes didn't send even though signed up for email", "rating": 2}, {"title": "Still haven't received my boots", "text": "Date of experience: March 06, 2020", "rating": 2}, {"title": "I had to keep starting my search over…", "text": "I had to keep starting my search over after every item I clicked on.", "rating": 2}, {"title": "Outdated Website", "text": "The website is outdated and needs to be updated. When trying to search for things it was difficult, and also kept sending me back to the top of the page.", "rating": 2}, {"title": "The outfits i saw that i wanted you…", "text": "The outfits i saw that i wanted you didn't have I'm a plus size 3x and i didn't see the outfits i wanted in my size...and the selection looks very old and boring not much fashion to choose from", "rating": 2}, {"title": "Poor service", "text": "My package took forever to come. The one shirt was damaged. The shirt was white but had a big black stained spot on the neck. I'd never have been able to wear it. I ended up having to return it to a store because I didn't want to have to pay return shipping. And there were none available in store. And online didn't have my size. Not happy", "rating": 2}, {"title": "I had a coupon & a gift card", "text": "I had a coupon & a gift card. My coupon went through fine, but my gift card would not go through on line. The website was reading my balance correctly, but at checkout it wouldn’t work. I had to call customer service, wait on hold & do my order with her all over again. She was great, but your website needs work!", "rating": 2}, {"title": "I had 4 items in my cart for the free…", "text": "I had 4 items in my cart for the free shipping, and when I submitted my order, it only confirmed two and applied the shipping fee. It did not confirm the two pair of boots I wanted to purchase. I’m not sure what happened.", "rating": 2}, {"title": "Would not allow me to ship order to my…", "text": "Would not allow me to ship order to my home address.", "rating": 2}, {"title": "Coupon Code wouldn't go through", "text": "I signed up for texts , was given a coupon code, that the website wouldn't accept, so I never got my 10% discount", "rating": 2}, {"title": "Rude staff", "text": "Product was well made, comfortable and nicely priced. The only thing was a little concerning was the sales associate told me that she needed to hold my bags (clothing i purchased from another store) while i tried on my clothes. Then proceeded to stand there to make sure i didn’t go in with MY bags. I have never been to a store where i wasn’t allowed to take in my already purchased items from another store. Like why would i want you to hold my $200 worth of clothing so i can try on your $5 shirt. Oh and not to mention the woman working was rude and nasty with her coworkers.", "rating": 2}, {"title": "I thought I was getting a discount on…", "text": "I thought I was getting a discount on my order but did not why", "rating": 2}, {"title": "I did not receive my order it said it…", "text": "I did not receive my order it said it delivered to me I don't have them but I did make a report on this", "rating": 2}, {"title": "You need to give an estimated time for…", "text": "You need to give an estimated time for when the package will arrive", "rating": 2}, {"title": "Can’t get discount and free shipping?", "text": "Hello I received 10% off of a $54 order today. It said there was a 5.50 discount. Then i look at my total owed and now it’s $56. I had free shipping which would be 6.95 then lost it once I added the promo code. I’m Usually willing to get more items in order to get free shipping. So my choice was to either keep the promo code and ultimately pay more for my items or remove the promo code and receive free shipping. So i took $40 worth of stuff out of my cart and only purchased the rain boots I wanted, instead of the couple outfits I was going to get my daughter. Just wanted to let you know that I would’ve spent $50 at this site but ultimately spent $16 because of an error. It’s sad that I wasn’t able to get those few outfits for my daughter, those little jogger outfits are pretty cute. I hope you get that situated for other customers", "rating": 2}, {"title": "Reason for my rate is cause I have…", "text": "Reason for my rate is cause I have spent a hour trying to log in an by me for getting my password. A push the button to change it 7 times an got no email sent to me so I can recover are change my password after trying that many times .I gave up an just shopped as a guest. But", "rating": 2}, {"title": "Not true to size in plus sizes...too…", "text": "Not true to size in plus sizes...too small...waste of money!! Received quickly, but doesn't matter if it doesn't fit.", "rating": 2}, {"title": "Free Shipping?", "text": "Decent sales but never any free shipping offers. I don’t always want to order $50 worth of merchandise", "rating": 2}, {"title": "Not enough of plus size jeans or pants", "text": "Not enough of plus size jeans or pants. Too many joggers but all in all it was okay.", "rating": 2}, {"title": "I returned items purchased online to a…", "text": "I returned items purchased online to a local store with receipt and tags in place and received some refund transaction receipt but no refund. There's no record of any credit or transaction from Rainbow shops according to my banking records aside from the original purchase. Why do I have a record of a refund I haven't received? I want my money.", "rating": 2}, {"title": "Customer service is the worst if the…", "text": "Customer service is the worst if the reps aren’t hanging up the phone they just give u the same info over and over no Superviser to talk to always call back smh I won’t be shopping here any more so disappointed need better customer service", "rating": 2}, {"title": "Ordered size 7/8 for girls", "text": "Ordered size 7/8 for girls, they look the size of 3 toddler", "rating": 2}, {"title": "This jacket has 2 broken buttons,", "text": "This jacket has 2 broken buttons,. I am not impressed", "rating": 2}, {"title": "I placed an order consisting of four…", "text": "I placed an order consisting of four items. Once the items were submitted I copied the order number and total which was $74 and change. Hours later I received an email that said my order had been shipped, upon viewing the items I noticed one of my items had been removed. So I went back on the web to reorder it and it was unavailable. Now I have to search other stores to find this item again.", "rating": 2}, {"title": "Love this app so much", "text": "Date of experience: January 08, 2020", "rating": 2}, {"title": "My shipping was pulled back 2 days…", "text": "My shipping was pulled back 2 days short notice", "rating": 2}, {"title": "I'm very disappointed that two of the…", "text": "I'm very disappointed that two of the items I thought were on my order were not available and they didn't give me an option of replacing and I was charged for shipping when I could have just purchased another item instead of having to pay for shipping. This was my first time ordering and  I don't know if I will order again versus going into store.", "rating": 2}, {"title": "Some items are too small and did not…", "text": "Some items are too small and did not come with tags so I can’t return them. Very disappointing!!!", "rating": 2}, {"title": "Disappointed!", "text": "Only 30% of my items came correctly! I sent them back a week ago and I still haven’t heard from them.", "rating": 2}, {"title": "Web site said feee shipping for orders…", "text": "Web site said feee shipping for orders over 12.99... charged 7.00 for shipping???", "rating": 2}, {"title": "I’m only giving 2 stars because of my…", "text": "I’m only giving 2 stars because of my checkout experience.  I received multiple $50 visa gift cards for Christmas. My cart had almost $100 worth of merchandise in it. However the website would only let me use 1 card. Frustrated, I called Rainbow’s customer service number and was told they couldn’t help me use multiple visa gift cards on my purchase either!  There should be a way to use multiple payment types. I Ended up only purchasing about 1/2 the stuff I had planned to buy.  U lost quite a bit of $ Rainbow!  Other than that, the website is great.", "rating": 2}, {"title": "Was out of alot of sizes in the stuff I…", "text": "Was out of alot of sizes in the stuff I wanted.", "rating": 2}, {"title": "No shipping to Los Angeles SUCKS", "text": "I live in Los Angeles, CA and was not able to get my ordered delivered to me personally. I had to ship to a friend who lives in New Orleans, LA. Very frustrating that I cannot personally receive the item I ordered and will have pay another company to ship the shoes to me.", "rating": 2}, {"title": "I rated two stars because my discount…", "text": "I rated two stars because my discount promo code came late in my email. When I finally located iit it was in my spam mail. When I went back to my cart the boots that were placed in my cart were sold.", "rating": 2}, {"title": "I did not receive my order.", "text": "I did not receive my order.My package was to be delivered on 12/11. I got an email stating delivered but I did not receive the package.", "rating": 2}, {"title": "Rainbow should Use UPS instead of FedEx", "text": "Pkg left Rainbow fast but the FedEx tracking is horrible. My pkg was in PA, IN, then WI, then Chgo, then back to WI for days & the trail goes cold, then it left WI after 5 days and is currently somewhere. I'm in Midwest, it passed right thru my city. It's like it's circling around & around. I have no idea when I'll receive it. I've had better success with stores that use UPS.  UPS is fast and reliable, even when shipping is going to a PO BOX at the main PO in Chgo which happens to be a major shipping hub. Not happy with the Rainbow shipping vendor. FedEx cust service wasn't much help either. So, I won't know if I like my merchandise until late next wk, which puts shipping time at 10+ days or more, depending when I actually get notice that it's in my PO BOX. Was hoping the pkg came this wk to give a gift to a friend who's only here until Saturday. Probably won't order online fr Rainbow again unless they switch to UPS.", "rating": 2}, {"title": "Restocking items takes too long.", "text": "Date of experience: December 02, 2019", "rating": 2}, {"title": "I have not yet received my order as…", "text": "I have not yet received my order as yet..it has not yet has been sent to nassau to my shipping company", "rating": 2}, {"title": "I did not receive free shipping or 10…", "text": "I did not receive free shipping or 10 percent discount  on my purchase", "rating": 2}, {"title": "You need more variety of longer", "text": "You need more variety of longer, a line skirts & dresses. Everyone does not desire to dress in the clingy, too short styles so often featured. Your price points could be lower as well. Your accessories are subpar and I can never find shoes I like in my size.", "rating": 2}, {"title": "Did not allow me to use my 10% off code.", "text": "Date of experience: November 15, 2019", "rating": 2}, {"title": "I purchased a pair of women's white…", "text": "I purchased a pair of women's white workboots size 6.5. The order arrived within a few days however when I opened the box, the shoe box showed size 6.5 but the boot was a size 6. That mistake could happen with any order however one boot looked as if it was used or worn and the other boot looked brand new....that's why I gave a low rating.I'm working on getting the order straighten out --hopefully this won't be a major problem.", "rating": 2}, {"title": "Could'nt cancel my order right away.", "text": "Date of experience: November 14, 2019", "rating": 2}, {"title": "Too long to get order", "text": "Date of experience: November 13, 2019", "rating": 2}, {"title": "This was my first time ordering…", "text": "This was my first time ordering something,  I accidentally chose the wrong color and cancelled the order quickly. Then I made another order with the correct color, as I always do,  check my bank to see if everything was on task. You all had sent a confirmation and said that you discontinued and cancel. The first one which you said cancel,  you took two payments out of my account at this time. I am not pleased with that, and I called, I have waited on the phone. A good while, not to talk to anybody. In time and nobody had responded, and I had to hang up. It was easy to remove money and not replace it, this was back to back, once I realize I hit the wrong color. I will continue and see why my funds have not been replace from the 1st order. I am waiting to hear from someone concerning the matter. Sincerely, Tarrant", "rating": 2}, {"title": "I didn't get to apply my code until…", "text": "I didn't get to apply my code until after my shopping and payment don't know why I wasn't offered beforehand ridiculous", "rating": 2}, {"title": "Love to buy", "text": "Love to buy From this store", "rating": 2}, {"title": "I would like a receipt", "text": "I would like a receipt? Nothing sent to my email all I have is the order history on the website. I have yet to comment on your delivery time or the quality of the merchandise until I receive my purchase.", "rating": 2}, {"title": "Was supposed to get  free shipping and…", "text": "Was supposed to get  free shipping and because of 10% discount and $1 had to pay shipping", "rating": 2}, {"title": "Website use is not user friendly or…", "text": "Website use is not user friendly or smooth", "rating": 2}, {"title": "There were no boy outfits", "text": "Date of experience: November 03, 2019", "rating": 2}, {"title": "I didn't known the blank circles at…", "text": "I didn't known the blank circles at bottom were the color choice it took me 3 days to figures that out", "rating": 2}, {"title": "Just to get 10%off you have to do so…", "text": "Just to get 10%off you have to do so many things. Such bad advertising", "rating": 2}, {"title": "The associated discount was not applied…", "text": "The associated discount was not applied to my order.", "rating": 2}, {"title": "Signed up for email for 10% off", "text": "Signed up for email for 10% off, however couldn’t use. Called the company and voice mail on and unable to leave a message!", "rating": 2}, {"title": "I needed to see my orders and maybe be…", "text": "I needed to see my orders and maybe be observing to see when it was going to be shipped.", "rating": 2}, {"title": "It took forever to place my order", "text": "It took forever to place my order. And it should not take forever to receive my items especially when I have to pay extra ugh.", "rating": 2}, {"title": "I ordered 3 things and only 1 of those…", "text": "I ordered 3 things and only 1 of those fit.", "rating": 2}, {"title": "The poor rating is due to the wait", "text": "The poor rating is due to the wait.  I needed my items for a trip I am taking at the end of the month.  Scheduled delivery states I will receive it next month???!!! Grrr...I will not be ordering from Rainbow Shops again & I shop a lot.  Sorry.", "rating": 2}, {"title": "I was so excited to be able to order…", "text": "I was so excited to be able to order from this store. Even more excited that I would get 10% off my order. Only to find out AFTER I placed the order it DID NOT give me my discount. VERY DISAPPOINTED", "rating": 2}, {"title": "need more shoes in women size 11", "text": "Date of experience: October 06, 2019", "rating": 2}, {"title": "My order arrived in great time but the…", "text": "My order arrived in great time but the bag was open, it was  dirty and the package slip was missing. I was disappointed in the items material.", "rating": 2}, {"title": "Love what Rainbow shop have to offer…", "text": "Love what Rainbow shop have to offer ALWAYS find what you looking", "rating": 2}, {"title": "There are too many stipulations to use…", "text": "There are too many stipulations to use discounts. Orders over $50. You really dont get any discount. SMH", "rating": 2}, {"title": "Customer Service", "text": "I wasn't being allowed to place an order online, so I tried contacting customer services (that's what the error message said to do). Customer  service wouldn't pick up most of my calls after being on the phone 30 minutes to an 1 hour. So I than tried to email Customer service and they didn't respond back to neither emails I did until a week later. So before I got the response I than messaged them on Instagram and received no reply.", "rating": 2}, {"title": "Sizing (not true to size)", "text": "The ordering and delivery were great.  I have not ordered from Rainbow online but for me the sizing is not accurate.  when I go into the store, the sizing Is write or maybe one size off, but on line it appears to be different or maybe it's the item I selected I wear a 1X I sometimes order up because somethings run smaller because of the quality but never should I have to order 2 sizes up and I did and it still did not fit. Even the shoe size was off. I wear a 12M, the boots I ordered I cannot even get them on.  But I ordered similar boots from Massey's and they fit with a little wiggle room.  I have to return both online purchases :(", "rating": 2}, {"title": "First and last time", "text": "I recently ordered $52 worth of items from rainbows online. I waited to review my purchase until they arrived. The shipping time was regular,  however I'm highly disappointed with my items. One of the sweaters I ordered has fabric falling off of it all over the place. Not to mention the smell of all of the clothing items was horrible. They smell like burnt plastic. I didn't even want to try them on because I was afraid that whatever is on the clothes might irritate my skin. I had to wash the items twice just to get them to smell like nothing. I won't be ordering from rainbows again.", "rating": 2}, {"title": "Ordered my items recieved confirmation…", "text": "Ordered my items recieved confirmation email. Items marked as delivered never recieved my package", "rating": 2}, {"title": "I wasn't able to use my sign up code…", "text": "I wasn't able to use my sign up code when checking out.", "rating": 2}, {"title": "I entered my email to 10 10% off and I…", "text": "I entered my email to 10% off and I didn’t get any discount.they send me an email on the coupon code after I placed my orders", "rating": 2}, {"title": "Shipping sucks", "text": "Prices are great, clothes look great, but free shipping at $50 doesn’t apply to Alaska or Hawaii despite being part of the US... cost of shipping kind of takes away from the good pricing on clothes. Hopefully, the clothes are worth it.", "rating": 2}, {"title": "Could not use the discount code!!", "text": "Date of experience: September 03, 2019", "rating": 2}, {"title": "Damaged goods", "text": "Expected better with my items from Online. The items I received were damaged goods. I ordered two suffiano fanny packs in red and mustard  and both items were delivered to me with ink blotches all over them. I thought I could simply wipe them off however they are ingrained into the faux leather. I’ve called several rainbows within my area to see if they still carry the fanny pack and my search was unsuccessful. I also ordered a pair of mustard high top sneakers. The sneakers were delivered to me damaged as well. The sneakers have red spots all over them too. It makes absolutely zero sense to send out damage merchandise to customers. A location I called near me also stated that a fanny pack that they have (I thought was the same one) has ink blotches all over it too.  It is absolutely time to get a new manufacturer or better employees that can check items before shipping them off to paying customers.", "rating": 2}, {"title": "I like rainbow clothing an accessories…", "text": "I like rainbow clothing an accessories I mostly shop in the store. I've recently purchased online an the web is ok the prices of the product is ok. But when it comes to shipping is way too high an the taxes added is crazy once everything totaled up. It makes me realize how much better it is to make in store purchases. The shipping an taxes added with the online shopping is a rip off. What sense do it makes buying from online sales, when you'll still be paying extra when taxes from the item an cost of shipping plus taxes added to that adds up there's no sale that part needs to be fixed or I can't buy any online items. An also I want to add shopping online cut the inconvenience of searching in crowded stores long lines an etc...which would probably make ppl buy more when it's a better shopping experience online ppl love cutting the headache of the other problems with in store shopping.", "rating": 2}, {"title": "they’ll get you at the end.", "text": "The online offer was free shipping over $50. After I checked out and got my order confirmation they added a $6.95 shipping charge. It seems the online service is as poor as the in store experience.", "rating": 2}, {"title": "I won't use the site again.", "text": "Even though I used the sizing chart, the items were huge and of no use to me.   I gave them away to a friend that they happened to fit.", "rating": 2}, {"title": "It's been almost 40 mins since I bought…", "text": "It's been almost 40 mins since I bought online & have yet to receive an email receipt for my order !! Other online purchases I make send it to my email address within 5 mins !! What's going on ? Pam A.", "rating": 2}, {"title": "One shirt came with a hole another…", "text": "One shirt came with a hole another outfit I bought that was red and white the red bled into the white. Buttons have already fallen off and one shirt the tank top strap looks like it’s about to rip.", "rating": 2}, {"title": "Package never came had to call looking…", "text": "Package never came had to call looking around for it was told I’d get a refund by customer care who wasn’t pleasant to speak to , Said refund would come still have no confirmation of refund being sent.", "rating": 2}, {"title": "My 10% discount wasn’t applied", "text": "Date of experience: August 12, 2019", "rating": 2}, {"title": "i had a bad experience trying to return…", "text": "i had a bad experience trying to return some items back to the store .. the cashier was cussing due to the fact some item numbers were missing and she could not refund my money 😠 the cashier asked that i never purchases anything elese online and return it to her store 😠 it was a awful experience ... I will not purchases anything elese from rainbow online or the store i tried to return some items that didn't fit well 😞 very unprofessional #!!!!", "rating": 2}, {"title": "I did not get all my items that I…", "text": "I did not get all my items that I ordered in my package missing 3 items nor did I get my invoice in the package .When I contacted customer service I was told I would get the invoice sent email and never received that either . Very disappointed as I was informed it take 3 days to investigate about the items I did not receive I ordered these items for vacation now it looks like I won't get them in time or at all .", "rating": 2}, {"title": "Need to be able to fix order without having to cancel", "text": "I ordered some pants, clicked on the color black, and when I looked over order history it says white.  (White wasn't even a color option, only black, and pink).  I called and she claims it's nothing she can do, I can return them once I get them instead of fixing it before it's processed and shipped.  If I cancel the order the funds won't be returned immediately to reorder correctly.", "rating": 2}, {"title": "Delivered on time a day early", "text": "I give you guys a 2 star even though your clothes run small I wear a 3X and that’s what I ordered and all my clothes don’t fit all four shots that I ordered even the underwear I  purchased doesn’t fit won’t order from u guys again but you guys where at least order wise on time", "rating": 2}, {"title": "hopeful buyer, but clothes were way too small", "text": "sizes were all wrong. Too small 2x felt like a medium.  Nothing fit.", "rating": 2}, {"title": "Placed my order at 10:25am", "text": "Placed my order at 10:25am. Immediately tried to cancel it had me on hold for 20 minutes. Just to tell me I can't cancel my order. because it's been past 15 minutes. Even though I was waiting to speak with someone!", "rating": 2}, {"title": "One item ran the first time it was worn", "text": "Date of experience: July 29, 2019", "rating": 2}, {"title": "Shipping is a little expensive and the…", "text": "Shipping is a little expensive and the site never has free shipping days", "rating": 2}, {"title": "Need more kids clothes", "text": "Date of experience: July 26, 2019", "rating": 2}, {"title": "Clothes are inexpensive however you…", "text": "Clothes are inexpensive however you never have coupons to r give extra incentives", "rating": 2}, {"title": "Looking for more 4x in stores and…", "text": "Looking for more 4x in stores and online or I’d be there every week", "rating": 2}, {"title": "Once u ad an item is hard to get back…", "text": "Once u ad an item is hard to get back to where you left off at what you were purchasing so instead you have to begin all over and go from the top of the page to the bottom or whatever page you were on other than that they have nice prices I'm not sure about the clothes I'm still waiting for those to arrive we shall see", "rating": 2}, {"title": "I got to broken pallets the rest where…", "text": "I got to broken pallets the rest where good", "rating": 2}, {"title": "Customer Service Never Picked Up Phone", "text": "Customer Service Never Picked Up Phone on Hold More than 7 min!!!!! Had to Call the Store Instead. If Experiencing High Call Volume, Need to State within Your Automated System Instead of Wasting the Customers Time!", "rating": 2}, {"title": "Nothing fit me right", "text": "Nothing fit me right. I tried to return the items at the local Rainbow and it was a whole fiasco. I didn't know you couldn't return body suites either. I would have never purchased them if I knew that.", "rating": 2}, {"title": "I was on hold for 28 mins I had to call…", "text": "I was on hold for 28 mins I had to call back three times and got hung up on. I really wanted this product so that's why I didn't give up. I also was having a hard time with getting my 10% off discount the representative didn't even try to help at all. I love shopping at rainbow especially on line but this time I was highly upset", "rating": 2}, {"title": "Some of the items were ok but some of…", "text": "Some of the items were ok but some of the others were inferior, fabric extremely thin.", "rating": 2}, {"title": "The clothes are cut small for the size…", "text": "The clothes are cut small for the size (3x) and I was very disappointed.  The crotch and buttocks of the pants were too tight and the rest of the garment was fine.  This makes no sense! The shirt was cut small as well. a 3x should have been way more roomy. The pants look nice but the fit was terrible and then I don't appreciate $6.95 being taken from my refund after I've already paid shipping to get it here in the first place ! Returns should be free especially for these poorly made garments.", "rating": 2}, {"title": "I ordered and paid for a shirt and…", "text": "I ordered and paid for a shirt and never received my item.", "rating": 2}, {"title": "Lingerie fitting at Rainbow", "text": "Went to the store's many times. The clothes are great and they let you try it on in dressing rooms for perfect fitting.Though it's different with lingerie. Specially the bra's. Some fit and some do of the same size. The cup size is good though waist for around the body is so so.So here's a question. How's it an image for the store if the customer had a huge cup size but really tiny waist?It's not realistic.Only 1 out of all the pairs I bought was just right. Other than that I can't get a refund anywhere.I heard many of the same things from some family members and friends with the same problem.", "rating": 2}, {"title": "I guess you get what you pay for but I…", "text": "I guess you get what you pay for but I ordered about 7 items and 4 of them I have to return. Accessories falling off of the shirt as soon as I opened the package.", "rating": 2}, {"title": "I still have not received my email…", "text": "I still have not received my email confirmation for my order but my money have been taken from my card", "rating": 2}, {"title": "As i was buying my order shoe was taken…", "text": "As i was buying my order shoe was taken out of my cart because of availability", "rating": 2}, {"title": "I paid for 1 day shipping.", "text": "I paid for 1 day shipping.. my order came but 7 of my items wasn't received.", "rating": 2}, {"title": "I had a very disappointing service at…", "text": "I had a very disappointing service at your Foothill Rainbow  I located an item with no tag.  When I brought the item to the cash register to purchase the associate explained to me she could not sell even though I had the same exact item but in another color.  I asked if she could locate a price and another associate said she would try.  I made several phone calls and visits back to the store to see if a price was located.  But I could never reconnected with the associate and no one knew where the item was.  I called your customer service to see if they could assist me after almost a month and the associate provided me with a sku number.  When I returned to the store they could not pull up the  picture because the system was down.  I just felt that me as a customer should not have to go through all the steps to purchase a item.   I tried one more time and was told the associate was on vacation and they could not locate the item.", "rating": 2}, {"title": "Rainbow online shopping", "text": "The clothes weren’t true to size.  I ordered gym shoes in size 7 and you sent my gold pair of gym shoes in size 8 lucky for me I have a family member who can fit them.", "rating": 2}, {"title": "Terrible Sizing and customer service", "text": "The sizing of the clothes are almost never correct. Customer service has yet to respond back to me about sending out a dress that had a big hole in it. I knew not to order online but I went against my better judgment and did it anyway.", "rating": 2}, {"title": "Not always true to size", "text": "Date of experience: June 27, 2019", "rating": 2}, {"title": "It’s too hot in here!", "text": "The staff are amazing and helpful! Let me make that clear, my only complaint is that it’s soooo hot in the store! I usually don’t complain about temperatures in stores because it’s too cold. But this store was so hot and stuffy, and I have asthma,  so i feel like I’m struggling to breathe that lets you know it’s oppressively hot! If you want to keep buyers away on 80 degree days, then keep the temperature to hot and watch how they walk out right back out the door as soon as they walk in! LOL", "rating": 2}, {"title": "Return", "text": "Return. I ordered a fairly big order and there was one item that did not fit right so I called to get the return process and glad I did as I was informed that if i used the return label sent with my order I would have $6.95 deducted from my credit. Are you kidding me? I do not live near a rainbow shop and could not believe to return a product that I was going to reorder would charge me to send it back. I am definitely going to rethink shopping at Rainbow in the future and will be letting ALL my friends and family know of my experience as well.", "rating": 2}, {"title": "Not what I ordered", "text": "One of the items I ordered out of 3 was not at all what I purchased or even matched the description and picture on the website. Very disappointing. I had to go to the store to exchange.", "rating": 2}, {"title": "Poor", "text": "Very poor needs fixing", "rating": 2}, {"title": "very hard to order", "text": "Date of experience: June 24, 2019", "rating": 2}, {"title": "Clothes are good but they could get a…", "text": "Clothes are good but they could get a bigger size than 4x maybe 5x that would be great this would be the best clothing company chain in the world but as far as the clothing I love it", "rating": 2}, {"title": "Bad customer service", "text": "Prices are low, so hard to avoid continuing to shop with Rainbow. Clothes are ok quality for what you're paying, but if you ever have to deal with customer service - horrible experience! Horrible! Five different telephone operators immensely rude and aggressive. ATTN RAINBOW CO., TRAIN YOUR CUSTOMER SERVICE REPS ON HOW TO EFFECTIVELY AND POSITIVELY HANDLE CUSTOMERS' CALLS AND CONCERNS. AND RESOLVE THE ISSUE! IF YOU LOSE A CUSTOMER'S PACKAGE OR OWE THEM MONEY, DON'T TALK TO ME CRAZY! PERIOD.", "rating": 2}, {"title": "incomplete Order", "text": "My order is incomplete and did not receive an email with explanation.", "rating": 2}, {"title": "Poor selection,", "text": "Date of experience: June 20, 2019", "rating": 2}, {"title": "Anything over 40 dollars  should have…", "text": "Anything over 40 dollars  should have free shipping", "rating": 2}, {"title": "I like rainbow but it's really hard to…", "text": "I like rainbow but it's really hard to find things at Rainbow that fit my body type and style. There are almost little to no shirts or blouses that that come below the waist, losely hug the sides for the thicker plus size girl that is still shaped like the number eight. Also there are way too many tops with prints on them that don't fit right.", "rating": 2}, {"title": "They take too long to ship my stuff", "text": "They take too long to ship my stuff. Now I have to go buy other clothes for my trip because it won't be here until the day after I leave. Absolutely ridiculous 😡", "rating": 2}, {"title": "The site misleads you using product…", "text": "The site misleads you using product false inventory countdowns to influence your purchase.", "rating": 2}, {"title": "New shoppers", "text": "Wasn't what I expected.", "rating": 2}, {"title": "Wasn't able to use my 10% off coupon", "text": "Wasn't able to use my 10% off coupon. It stated that code wasn't valid", "rating": 2}, {"title": "Online order cancelled by Rainbow", "text": "Place an online order Saturday afternoon. Sunday morning I received an email from Rainbow saying my order was cancelled, and my card would not be charged. First time happening after online shopping. Very disappointed; this was my first (and last) time ordering from there online store.", "rating": 2}, {"title": "Did not receive my 10% discount", "text": "Date of experience: June 09, 2019", "rating": 2}, {"title": "Cheap clothes that didnt fit.", "text": "Date of experience: June 09, 2019", "rating": 2}, {"title": "Great prices", "text": "Date of experience: June 06, 2019", "rating": 2}, {"title": "I wish they had the same clothes they…", "text": "I wish they had the same clothes they had online in the shops. Kinda irritated.", "rating": 2}, {"title": "The clothing that you guys have online…", "text": "The clothing that you guys have online aren’t in the shops which I’m very disappointed. I wasted my time.", "rating": 2}, {"title": "This cost of shipping is too hight", "text": "Date of experience: June 04, 2019", "rating": 2}, {"title": "Customer service was bad", "text": "Customer service was bad, the lady was rude and after I waited at the counter for someone to help me for over 20 min. Will not return to this location again!!!", "rating": 2}, {"title": "I paid just under 30 dollars for next…", "text": "I paid just under 30 dollars for next day shipping and it took almost 4 days to get here and they went respond to my emails. Very unhappy.", "rating": 2}, {"title": "Pay extra to get the clothes here for…", "text": "Pay extra to get the clothes here for special event and they will not arrive until after my event which is only once a year!!!  So what was the money for?  Delivery day is same as free shipping!  Not a good way for a new costumer to be treated!", "rating": 2}, {"title": "Order a dress and paid for two day…", "text": "Ordered a dress and paid for two day shipping and still have not received my dress", "rating": 2}, {"title": "I returned all items nothing fit and…", "text": "I returned all items nothing fit and haven’t received refund I returned at post office weeks ago", "rating": 2}, {"title": "Shipping fees", "text": "I Love the clothing and prices of some of them. I also love the billing selections. The main problem that I have is that you charge your customers too much money for shipping. It's not fair that the standard shipping price is enough to go towards another piece of clothing out of the stores", "rating": 2}, {"title": "I get 10% for signing up start my cart…", "text": "I get 10% for signing up start my cart and put code in tells me it's already been used ,", "rating": 2}, {"title": "With you guys clothes you never know…", "text": "With you guys clothes you never know how they going to fit. I'm a plus size woman and I always have to get 2 sizes bigger then what I am. You guys have wonderful clothes don't get me wrong. But when you have to get sizes bigger make some woman fill bad about themselves.", "rating": 2}, {"title": "Clothing delivered was not as pictured", "text": "Clothing delivered was not as pictured. Bought 5 dresses that were pictured with cap sleeves or 3/4 sleeves, all came as tank top dresses. Bought several other dresses in 2 different sizes for me & sister. Even though they were labeled as different sizes they were not. Same width measurements on dresses several sizes apart.", "rating": 2}, {"title": "I didn't get my 10 percent off", "text": "Date of experience: May 19, 2019", "rating": 2}, {"title": "Cheaply made", "text": "Cheaply made. Should have figured it was too good to be true. Lost this customer.", "rating": 2}, {"title": "Well I think you need better clothes…", "text": "Well I think you need better clothes for women especially the plus-size. Your store is not what it used to be they used to carry nice clothes now y'all just carry anything like something throwing up in there. And you don't carry nothing worth buying online. It seem like y'all have changed. It seemed like the nice clothes go to the smaller women's and y'all just give all  ugly clothes to the big plus size women. I feel like y'all don't value the plus size women.", "rating": 2}, {"title": "Rainbow shop is awesome", "text": "Great website. Everything was easy to find", "rating": 2}, {"title": "Was little disappointed pants came with…", "text": "Was little disappointed pants came with broke zipper and alot of strings on dress", "rating": 2}, {"title": "No Concern for Customer Safety or Comfort", "text": "Both times I was in Rainbow, I felt out of place and uncomfortable. While at the Woodbridge store on my first visit, I was challenged to go outside to fight by a  young father who was allowing his very young daughter (about 2 years old) to run throughout the store shrieking at ear piercing levels as he chased her causing me to react disapprovingly. Store personnel did seem unconcerned about my safety or comfort, allowing the young father to continue ranting and challenging me and allowing the child to run amok. As I completed  my purchase I apologized to staff for any disruption, concern or discomfort caused by the exchange. Store staff said  this was not outside of \"normal\". I will not return to the store again.", "rating": 2}, {"title": "Was given several dates when package…", "text": "Was given several dates when package would arrive purchased for mother's day still haven't received", "rating": 2}, {"title": "Paypal function did not work,called…", "text": "Paypal function did not work,called cust. Serv. They were not helpful.", "rating": 2}, {"title": "It sucks that everytime that I go…", "text": "It sucks that everytime that I go online to shop they never have my size and I never see them stock up on the size I need for months now they are always out stock.", "rating": 2}, {"title": "I wanted the top in black", "text": "I wanted the top in black. I was finally able to make that selection but it was difficult. The first 5 minutes I was on the site I didn't know black was an option. The sliding bar for different colors is horrendous! If the top is nice I will change my review to 3 stars.", "rating": 2}, {"title": "I got something that was not at all…", "text": "I got something that was not at all what i ordered and the clothing quality is not as good as the actual store", "rating": 2}, {"title": "It was my first time ordering online…", "text": "It was my first time ordering online from Rainow. I order a shirt and immediately notice I have order the wrong size. I called customer service and they stated that they can not change the order even if I just place it 5 minutes within the transaction. So if I wanted a different size, I had to cancel my order instead. I can't get my order change but you can withdraw my money in less than a minute. This is something I think you need to address. A customer should be able to make a changes in their order as long as it in 10 minutes of being placed.", "rating": 2}, {"title": "Shipping costs are too high", "text": "Date of experience: May 02, 2019", "rating": 2}, {"title": "Don't remove the tags?!", "text": "First of all I will say I love the store and I love the clothes, which is why I'm really disappointed about their policy. I bought a pair of pants that I absolutely loved. I went to wash them for the first time and they ripped, a lot! I took the pants back to the store to see if I could just EXCHANGE them. When the girl asked about the tags I said I forgot it, but I will go back and get it if I need to. Her co-worker said once the tag is removed that they can't do anything. She also blamed my washer, but maybe it was poorly made clothing? I'm not sure how many people wear clothes straight from the rack, but I prefer to wash them first. Well, if you go online and look at their RETURN policy it says it must be in its original condition and tags must be attached? Again, all I wanted to do was EXCHANGE them. NOwhere could I find anything that said it had to be in the original condition and tags attached....just to EXCHANGE??? I only saw a section about online exchanges? Huge disappointment!!", "rating": 2}, {"title": "10% bombshell", "text": "I had a code for 10% off at the end of my transaction when I went to put the code in it said the code was no good so I wind up paying for my purchase without the code. Even though my purchases came up to  A little over the  of me being able to get free shipping  I should have still been able to use the code", "rating": 2}, {"title": "u keep saying my email isn't right.", "text": "Date of experience: April 29, 2019", "rating": 2}, {"title": "They have great self to choose from.", "text": "Date of experience: April 27, 2019", "rating": 2}, {"title": "Jeans fit small", "text": "Jeans fit small. Some shirts were lose or tight for same size. I needed it for vacation so I couldn't return it till I get back. So it was an inconvenience", "rating": 2}, {"title": "PayPal Issue", "text": "I’ve been trying to order several items for the last few days but PayPal through your website has not been working until today", "rating": 2}, {"title": "Love there clothes but last few months…", "text": "Love there clothes but last few months the location in Fall River, MA 02721  at 51 Mariano Bishop Blvd you can not try on the clothes there is no more dressing rooms we are told by manager an innocent happend and it was the manager decision to close all dressing rooms at that location for good i like to try on my clothes there for they will not get another dime from me", "rating": 2}, {"title": "It says free shipping orders over $50…", "text": "It says free shipping orders over $50 but still wouldn’t let me get free shipping. After I applied the 10% I saw that it took it below the $50 that’s why I went and ordered a necklace set to make it $50 something and it kept saying I need $16 more", "rating": 2}, {"title": "RAINBOW SHOPS.COM NEEDS WORK", "text": "The site is ARDUOUS at best. It's DIFFICULT to CONTINUE shopping after adding to your cart. It takes too long to load among other things.Additionally, a purchaser for a tax exempt organization is NOT ABLE TO UTILIZE THAT SERVICE!I'M NOT A HAPPY CUSTOMER RIGHT NOW AND FEEL LIKE I SHOULD HAVE CANCELED THIS ORDER DUE TO THE LACK OF ACCOMMODATIONS. IN ADDITION TO DEALING WITH THE ARDUOUS SITE,  THEN I CALL CUSTOMER SERVICE AND RECEIVE NO ASSISTANCE!!! POOR SERVICE FOR THE AMOUNT OF MONEY THAT WE SPEND WITH THIS COMPANY!!!", "rating": 2}, {"title": "Disappointed", "text": "One of the pants I bought has a run in the middle of the butt. [Do they check/inspect the merchandise before shipping them out?] Three of the other items (two pants and a jacket) are too small even though I bought my actual size for the pants and a size up for the jacket. I'm disappointed but I will try to reorder two of the pants in a different size.", "rating": 2}, {"title": "Pros and cons mostly cons", "text": "There should Be better photo quality , and an option for 360 view . Close up on the clothes . And more details about it. If you had more details people wouldn’t spend hours looking at one top thinking of the ups and downs. People don’t leave reviews so how is the public supposed to know the size is true and etc...  your stores don’t have changing rooms , big issue.", "rating": 2}, {"title": "Haven’t got no information on my…", "text": "Haven’t got no information on my package on where and when I will be receiving it", "rating": 2}, {"title": "Your web site is unstable. Regina Gilliard", "text": "Your web site is unstable", "rating": 2}, {"title": "I can’t see my tracking", "text": "Date of experience: April 01, 2019", "rating": 2}, {"title": "More options", "text": "More options would be great", "rating": 2}, {"title": "The total price was expensive for one…", "text": "The total price was expensive for one thing", "rating": 2}, {"title": "I just ordered some items I have not…", "text": "I just ordered some items I have not gotten it yet to rate it ask me again when I get then we will see.", "rating": 2}, {"title": "The shipping price could be less…", "text": "The shipping price could be less ..thanks!", "rating": 2}, {"title": "put the wrong billing name and address", "text": "Date of experience: March 27, 2019", "rating": 2}, {"title": "The shorts are not a 2x", "text": "The shorts are not a 2x. More like a XL", "rating": 2}, {"title": "The products were received promptly", "text": "The products were received promptly, but the quality of the items were terrible, upon removing a Shirt out of the sealed packaging I noticed a tear in a shirt,the sizing of the other items were true to fit, only the pants fitted", "rating": 2}, {"title": "Order again, hmmm", "text": "Took longer than it should've! The zipper on the jumpsuit I ordered was sewn in wrong, which caused a pleat and indention at the base of the zipper which was down the back (so imagine how that looked)! I love the in store experience but online not so much!", "rating": 2}, {"title": "The shipping is too expensive", "text": "The shipping is too expensive. Would recommend just going to the store and buying it.", "rating": 2}, {"title": "Once i clicked on a picture i had to…", "text": "Once i clicked on a picture i had to start all the way over from the top instead of going back where I left off", "rating": 2}, {"title": "When I was checking out there were two…", "text": "When I was checking out there were two different prices shown on the screen; a price they were going to charge my car and the actual price of all the items including taxes & free shipping but, once I refreshed the page it went back to the correct amount.", "rating": 2}, {"title": "Don’t come out on time didn’t wear my…", "text": "Don’t come out on time didn’t wear my outfit because of it being late", "rating": 2}, {"title": "I didn't know they will not return…", "text": "I didn't know they will not return shoes back on the card if i dont hav return receipt but  i showed proof of purchase email ..the sales man said...it s not worth it.he said all i can do is giv you a store credit", "rating": 2}, {"title": "tried to buy sandals and bracelets and…", "text": "tried to buy sandals and bracelets and said they have 2 or 4 left in stock but it wont let me purchase.", "rating": 2}, {"title": "Because on your website it said any…", "text": "Because on your website it said any orders over $50 free shipping and I did not receive free shipping.", "rating": 2}, {"title": "coupon do not work!!", "text": "Date of experience: March 03, 2019", "rating": 2}, {"title": "Jean's are not made for tall girls", "text": "Jean's are not made for tall girls. I'm 5'8 and there Jean's goes above my ankle.", "rating": 2}, {"title": "Cheaply made!", "text": "Date of experience: February 19, 2019", "rating": 2}, {"title": "Clothes online not available in stores", "text": "Clothes online not available in stores. Shipping is expensive and takes forever. Also the free shipping option would not apply to my order", "rating": 2}, {"title": "It was very hard to understand your…", "text": "It was very hard to understand your system. Normally woman's is plus size but I figured it out in the end. Thanks for sending me these emails I was just going to spam you.The", "rating": 2}, {"title": "It's a great store but I ordered online…", "text": "It's a great store but I ordered online and only one of the four items fit me and they were all the same size was very disappointed I wont be ordering from their online shop again better luck in store", "rating": 2}, {"title": "Shipping is too long", "text": "Shipping is too long 4 to 9 days that's crazy. Love the 10 percent coupon though", "rating": 2}, {"title": "I ordered some clothes and they were…", "text": "I ordered some clothes and they were delivered to my door by FedEx but the driver gave it to the wrong person. I'm very upset I asked if I order can I pick it up at there store they don't do it like that. So I don't trust or put my trust in nobody .cause  the company didn't contact me Friday on this matter why would they use FedEx. I spent money on this store they weren't much help.", "rating": 2}, {"title": "Always have NICE  clothes love rainbow", "text": "Date of experience: February 05, 2019", "rating": 2}, {"title": "Shipping should be free for standard…", "text": "Shipping should be free for standard then everything else should cost.", "rating": 2}, {"title": "I ordered i faux leather mini and got a…", "text": "I ordered i faux leather mini and got a leather pencil skirt", "rating": 2}, {"title": "website", "text": "The prices are mostly GREAT. Thank you so much for that. I have to buy everything on Ebay in order to spend under $10 when possible. The website however was frustrating. It is very slow. The main reason I rated two stars is bc my items were being purchased from me while I was shopping for my daughter and!! Twice I had and viewed an item and it was gone when I went to purchase it. URG! I spent hours. Sincerely,E", "rating": 2}, {"title": "Free shipping shouldnt be for items…", "text": "Free shipping shouldnt be for items over 50.00 the free shipping to me should be lower or have a coupon for some days with free shipping for one time no matter the amount. Other than that great site. it has more selections to me than the store. I love the clothes and shopping. not the shipping costs.", "rating": 2}, {"title": "Need to optimize checkout functionality", "text": "I had a hard time checking out.  I signed it as I’ve placed previous orders. My address was already saved however when I selected the radio button and pressed save it would not load the address. I tried several times the finally just added it again. Very annoying.", "rating": 2}, {"title": "In sending the coupon code!!!!", "text": "Date of experience: January 17, 2019", "rating": 2}, {"title": "the site needs work", "text": "the site needs work, not pleasing to the eye, needs better photos.", "rating": 2}, {"title": "We loved the dresses that my daughter…", "text": "We loved the dresses that my daughter received but the sequence words came right off the dress.", "rating": 2}, {"title": "Shipping is to high", "text": "Would love to order,the price is great,but shipping is almost has high as the item,and you have to order over $50 to get free shipping,not happy with that", "rating": 2}, {"title": "I love the online store I find more…", "text": "I love the online store I find more items online than in actual store", "rating": 2}, {"title": "Order takes a whole month at least.", "text": "It takes a whole month to receive your order. Very slow. I am disappointed by how the shipping is.", "rating": 2}, {"title": "Shipping fee is too high for one item.", "text": "Date of experience: December 15, 2018", "rating": 2}, {"title": "suggestion", "text": "Will suggest a free shipping next time. The amount charged for shipping is too much. Thank you", "rating": 2}, {"title": "Shipping is too high", "text": "Date of experience: December 08, 2018", "rating": 2}, {"title": "Clothes are ok.", "text": "Clothes are ok., Only if they could ship it a lil faster., It take forever to receive your order.", "rating": 2}, {"title": "no coupons", "text": "no coupons, less discounts", "rating": 2}, {"title": "Upset", "text": "First Of All Every Single Item I Ordered Online Did Not Fit, It’s Cut Small & I Am Very Angry About That.....So Much For a Black Friday Deal. I’ve Never Had a Problem I Don’t Know What’s Going On With Whoever Is Making These Clothes but They Need To Fix It Never Ordering Online Again", "rating": 2}, {"title": "sizing is funny..not big on…", "text": "sizing is funny..not big on selcetion..wish you had more stylist clothes for plus size", "rating": 2}, {"title": "Shipping is too expensive", "text": "Shipping is too expensive. You should have store pick up for free.", "rating": 2}, {"title": "I experienced a lot of cart emptying…", "text": "I experienced a lot of cart emptying issues which swayed my desire to buy from rainbow then the high dollar amount requirements just to get free shipping was not worth it. I had to pay high shipping rate for 2 articles of clothing that I am not sure is going to even be as good as it looked online. I have ordered from rainbow in the past and have loved the prices and availability of the kids uniforms and clothing when I needed it. Their underwear and accessories prices are good but I don't care for the online experience at all.", "rating": 2}, {"title": "I always get offered 10% and I put in…", "text": "I always get offered 10% and I put in my number or email (As it asks too) & I never receive the coupon!", "rating": 2}, {"title": "The 'search' did not work.", "text": "The 'search' did not work.Twice intents to do the checkout.", "rating": 2}, {"title": "I did not receive the correct shoes…", "text": "I did not receive the correct shoes that I ordered. They gave me some other random color. Other than that it was okay I guess. Took awhile to receive my items.", "rating": 2}, {"title": "I like everything I picked out I also…", "text": "I like everything I picked out I also added a few things in my cart. I got sidetracked with a few phone calls. Went back to my cart some of my items were gone there should be a 24hr period for holding items for us.", "rating": 2}, {"title": "High shipping cost", "text": "The shopping experience was easy going, but The shipping rates are to high and don't give an option of free delivery to store.", "rating": 2}, {"title": "Took forever to place the order", "text": "Took forever to place the order. Was afraid things would sell out by the time it went through. Smh. Had to keep entering my email kept getting redirected had to log back in couldn't  use the coupon code that they'd just sent to my email. Terrible 😤", "rating": 2}, {"title": "Make it easy", "text": "It was kind of hard at first but it turned out ok.", "rating": 2}, {"title": "My clothes did not fit!!!", "text": "Date of experience: November 16, 2018", "rating": 2}, {"title": "They add additional charges once you…", "text": "They add additional charges once you pay! Not a trust worthy sight", "rating": 2}, {"title": "I place a couple thing in my cart that…", "text": "I place a couple thing in my cart that was on sale and once I was ready to checkout the items that was on sale appeared in my cart as regular price. Not happy. Other than that every thing was ok.", "rating": 2}, {"title": "Poor Communication", "text": "The products on the site are nice, however upob placing my order, I have yet to receive a tracking number. My order has been in processing mide for 2 days. I called customee service, they assured me that my ordering would be shipped the present day. I haven't received any current order status yet via email or otherwise. I don't think, I'll be ordering from tjis company again", "rating": 2}, {"title": "Plus sizing was way off", "text": "Plus sizing was way off. Bottoms fit fine,top didn't fit at all and they were the same size. I'm beyond disappointed.", "rating": 2}, {"title": "Tereible experience i order an item…", "text": "Tereible experience i order an item which was no longer available an authorization hold was on my account for the total amount of the items i purchased just to recieve an email that the item is out of stock. Terrible", "rating": 2}, {"title": "I gave two stars because the site is…", "text": "I gave two stars because the site is difficult to order from. I had to reorder two shirts from a previous order, then once I paid , my previous order popped up. That's me getting ripped off, not getting the tops I wanted and a nasty taste im my mouth about shopping on this site.", "rating": 2}, {"title": "You all don’t replace items that are…", "text": "You all don’t replace items that are low on stock you can’t reorder them", "rating": 2}, {"title": "This is not a quality product", "text": "This is not a quality product, folks.", "rating": 2}, {"title": "Very hard to locate particular items.", "text": "Date of experience: October 27, 2018", "rating": 2}, {"title": "Checkout keep glitching", "text": "Date of experience: October 23, 2018", "rating": 2}, {"title": "THE FABRICS ARE VERY CHEAP TYPE…", "text": "THE FABRICS ARE VERY CHEAP TYPE MATERIAL.  LARGE IS FOR YOUTH SIZE.  SORRY I SHOPPED ONLINE.  WILL BE RETURNING THEM ALL BACK TO LAKEWOOD STORE THE CLOSES TO JACKSON, NJSORRY", "rating": 2}, {"title": "The sizing is smaller than normal", "text": "Date of experience: October 14, 2018", "rating": 2}, {"title": "No other styles in jeans besides…", "text": "No other styles in jeans besides skinny, leggings, and jeggings. All models have no gut or real plus sized features.", "rating": 2}, {"title": "They don't stand behind their defective clothing", "text": "Company does not stand behind it's products.  I hand-washed a brand new shirt, NEVER WORN, and it ripped and shrunk.  When I called customer service, they were rude and told me that it's not their fault the shirt ripped and shrunk and they wouldn't take it back.  I had ordered the same shirt in other colors and it did not shrink or rip, so obviously that shirt was defective but they wouldn't let me send it back for a refund or store credit.I also tried to return a body suit, new with tags and they wouldn't accept it because \"it goes between the leg.\"  So do leggings, yet those can be returned.  Staff is somewhat rude.And lastly, I signed up for text messaging and was supposed to get 10% off and the cashier assured me that she gave it to me, but when I got home and looked at the receipt it had not been given.  My purchase was more than $100 and my first time in the store.  When I called the store and corporate, neither one of them helped me.  They said I had to give the code at check out.  When I explained that I did and have the time stamp of the receipt and the text message they sent me with the coupon code, you could see that they should have given me the discount but didn't.  They said they couldn't help me.  Horrible customer service both in the store an through corporate.You might think you're getting a good deal on cheap clothing, however, you can get FAR BETTER quality and prices off the clearance racks of Dillard's, Macy's, Stein Mart, Nordstrom Rack, etc.", "rating": 2}, {"title": "DISAPPOINTED WITH MY PURCHASE", "text": "I tried on a pair of Rainbow shoes for size in my local stockist before I ordered a pair from the company. The size 6 fitted like a glove.  I went ahead and got them dyed to match my mother-of-the-bride outfit.  When the shoes returned they were a great match but unfortunately they are a bit too tight.  I have been trying to wear them for my daughter's wedding on 8th December but not making much difference.  Such a shame as they match my dress perfectly.  I got these shoes in April and it says you can't return after they have been dyed so I am stuck with them and they are not particularly cheap.", "rating": 2}, {"title": "This may be due to insufficient stock…", "text": "This may be due to insufficient stock but Rainbow is quickly cleaned out of plus sizes. In order to guarantee that you can get what you are looking for you must check back periodically and buy everything you need as soon as it is available. This is inconvenient as I do not always have the funds to buy everything in one purchase.", "rating": 2}, {"title": "Add Coupons!", "text": "Other stores always have various coupons available, but the only thing you offer is 10% off your first order. I've been ordering for some time now, so that really doesn't benefit me! In store coupons would be great also!", "rating": 2}, {"title": "The website didn't accept my PayPal", "text": "The website didn't accept my PayPal, however, it did accept my gift card and credit card.  In addition, I received my order today and one item is incorrect!  This item will be returned in the mail.  I'm highly unsatisfied with the whole Rainbow buying experience.", "rating": 2}, {"title": "Shoe Imperfection", "text": "I order some cute booties in black, cognac, and mocha they arrived a day a head of schedule which was cool. Until I started to inspect the shoes which obviously the person who packed them didn't. There were a few imperfections on these shoes and they were sent out anyway.  The bottom of the cognac shoes had a slight damage and the mocha shoes inside said it was a 7 1/2 but the bottom said size 8.  The suede on the right mocha shoe appeared to be  slightly damage and the around the edge of the  shoe in the back the suede appears to show through the black rim.  Last but not least it ship through fed ex but the post office delivered it and on the sticker it states carrier leave if no response. I never authorize for any package to be just left on my door step, this really bothered me because if no one was present anyone could have taken the package.", "rating": 2}, {"title": "It’s annoying when an item in my cart…", "text": "It’s annoying when an item in my cart is gone! I’m checking out and the items I wants are removed that’s just annoying.", "rating": 2}, {"title": "Clothes run too small just recently in…", "text": "Clothes run too small just recently in past six months.  Torrid.com has higher prices but better quality and correct sizes/ size charts!!!! Not impressed with Raindow in this past year", "rating": 2}, {"title": "Difficult to navigate and sort options", "text": "The website and app are both difficult to navigate.", "rating": 2}, {"title": "Why does it cost so much to ship", "text": "Date of experience: September 18, 2018", "rating": 2}, {"title": "The website was kind of complicated…", "text": "The website was kind of complicated when I go Aero back it would not it would start all the way up from the same page also when ordering a size I noticed that you had the right size and the top part of the lingerie but not the bottom part such as panties", "rating": 2}, {"title": "Didn't receive everything order and got…", "text": "Didn't receive everything order and got charge full price. No partial refund for the missing items.", "rating": 2}, {"title": "Delivery takes too long", "text": "Delivery takes too long. Won’t be ordering online anymore. Still haven’t receive package in 2 weeks", "rating": 2}, {"title": "Clothes are poorly made.", "text": "Date of experience: September 10, 2018", "rating": 2}, {"title": "When placing order it did say order…", "text": "When placing order it did say order requires confirmation via email. So I ordered the same item twice. It went to a DOS response.", "rating": 2}, {"title": "My complaint is regarding my previously…", "text": "My complaint is regarding my previously order. One item I ordered was dirty. It was packaged nicely, however, when I took it out of the package it was stained. I'm hoping there is no issues with my daughter order.", "rating": 2}, {"title": "I will never order online from Rainbow…", "text": "I will never order online from Rainbow again.  I ordered Saturday & it says the estimated shipping date is Next Tuesday- the 11th. I’ve never had to wait this long on my order from anybody I’ve ever ordered online through.", "rating": 2}, {"title": "Bad first time experience", "text": "Bad first time experience As I was making my order it showed below I can save 10% off my order and when I clicked on the blue 10% off logo it didn’t do anything, I put my email in and I still didn’t get the 10% off, I downloaded the app and was in process of doing an order on there as well and I still couldn’t get the 10% off discount. I have to say it was very  frustrating  when I was trying to save 10% off. So I just completed my order on the website. I wanted to buy more but without a discount I couldn’t. Not sure if I would be buying again since the website was falsifying  savings. Bad first time experience....", "rating": 2}, {"title": "I would like items to stay in my cart…", "text": "I would like items to stay in my cart until they are sold out. Also cc info process was awful had to try several different cards before ordering. Which meant each time I had fill my cart again. 😡", "rating": 2}, {"title": "I DONT LIKE THE FACT THAT THERE IS 15…", "text": "I DONT LIKE THE FACT THAT THERE IS 15 MINUTE WINDOW TO CANCEL YOUR ORDER. YOU SHOULD BE ABLE TO CANCEL UNTIL THE ORDER HAS SHIPPED.", "rating": 2}, {"title": "I ordered and then later I received an…", "text": "I ordered and then later I received an email that they weren’t shipping the full order... I’m assuming items were out of stock but the company should keep up with inventory", "rating": 2}, {"title": "I've always been  happy  with…", "text": "I've always been  happy  with everything  I've ordered and sizes are very accurate. The most I have waited for my items are a week", "rating": 2}, {"title": "Horribly frustrating", "text": "Horribly frustrating! Had to try about a dozen times before order would process my card an coupon code crazy!", "rating": 2}, {"title": "Very quick shopping experience and easy…", "text": "Very quick shopping experience and easy checkout.", "rating": 2}, {"title": "Lawrence store 👎🏽", "text": "I love rainbows...... but the one in Lawrence ma is the rudest I went there n they tell me why I don’t go shop in the Lowell one if I’m from Lowell like does it matter .... the girls were talking about each other a diffunctional management", "rating": 2}, {"title": "You only have 15 minutes to cancel your…", "text": "You only have 15 minutes to cancel your order.", "rating": 2}, {"title": "Their underwear suck", "text": "I ordered like five pair of underwear and they all were of poor quality. In one pair, the crock area part came apart and panties were never worn. The other pairs got destroyed in the washer machine. Each and every pair after the first wash.", "rating": 2}, {"title": "Unfair", "text": "You dont warn people when you remove items from their carts.", "rating": 2}, {"title": "I didn’t like the continual pop up for…", "text": "I didn’t like the continual pop up for 10% off if you sign up for text messages... I declined but it kept coming back. I have not used this site before so I don’t have any other opinion.  Unless and until my order arrives I won’t be able to say more. Was given the site info after admiring the dress I ordered", "rating": 2}, {"title": "It states that free shipping over 50$…", "text": "It states that free shipping over 50$ purchase.. My order was 60$ and I had to pay 7$ for shipping.. besides that it was nice. Had all the right sizes for my daughter (who is plus).. reasonable prices.. Need more white plus size BLOUSES in stock.. size 18 or 20, 20.5.. :)", "rating": 2}, {"title": "None of the clothes I bought online fit…", "text": "None of the clothes I bought online fit me. It was a big diappointment. I let a friend have one of the tops I bought. She is an xlarge and this shirt is a 1x. She said the shirt looks like a large and is too small. The sizing is not right. I plan to keep the clothes so maybe at some point I can lose weight with motivation. The clothes are not the right size though for an xlarge lady to say the 1x top fits her like a large is too small that is not good.", "rating": 2}, {"title": "I recently made a purchase and the…", "text": "I recently made a purchase and the packet was not delivered in the time that it was supposed to.Also, when it did arrive, one of the items, a top was badly made, with one side , the right side bigger than the left also there was a HOLE at the bottom of the top( peplum)I called to make a complaint but was told that they would record it. Isn’t there someone ito inspect the clothing before they are sent out?", "rating": 2}, {"title": "I just received my order that I ordered…", "text": "I just received my order that I ordered online.  I opened it up and they sent me the incorrect size in one of the shirts that I ordered.  I called to advise and they told me that they will not reship me the correct shirt that I will have to go back online and order the correct size.  This would mean that I will have to pay for shipping again.  They advised that they will mail me a coupon but this does not work when you need your items by next week.  The item is not available in the store for me to return and get the correct size either.  That is very bad customer service and not sure how they do not help their customers out with THEIR own mistake when my order clearly states the correct size.", "rating": 2}, {"title": "Do NOT order online. Shop in store.", "text": "They sell items to you knowing they are out of stock although it does not say so on the website and wait until you contact them just to lie and tell you they sent it. Carrier confirms they have not received a package from them. They will just give you a refund and claim they sent it. You wait for a package that does not exist just to get your money back. Customer service just talks over you and basically blames you for not having your package. I loved shopping here for cheap items but only in store. Never shopping online again!", "rating": 2}, {"title": "I've been purchasing my clothes from…", "text": "I've been purchasing my clothes from rainbow for many years from in stores and online.rainbow is my number one clotheing store .you get qaulity and always can find what you looking for.when any plus size ladies in the Bahamas ask me where do I find my nice plus size clothes I gladly says rainbow baby .simply the best.only thing I'd like to see is your jeans size goes up to like 26/28.", "rating": 2}, {"title": "Shipping price was too high", "text": "Date of experience: July 19, 2018", "rating": 2}, {"title": "Was charged for unavailable item", "text": "Date of experience: July 18, 2018", "rating": 2}, {"title": "Don't buy shoes", "text": "Every time I  buy a shoe, it break. Doesn't have enough glue or something because this is the 2 time I buy a shoe and it break. I'm going to return it tomorrow.", "rating": 2}, {"title": "Prices are low but shipping is high", "text": "Date of experience: July 13, 2018", "rating": 2}, {"title": "The code did not work.", "text": "Date of experience: July 11, 2018", "rating": 2}, {"title": "Hmmmm", "text": "I be on plus sixe and it jump to woman regular sizes.. I'm plus so can't do anything with regular.. Hoping i receive actual clothing i picked also", "rating": 2}, {"title": "My order is taking forever to…", "text": "My order is taking forever to process...I made a purchase on July 1st.", "rating": 2}, {"title": "better sorting options", "text": "No problem with customer service but it was hard to shop. Having better filtering options and functions would make it a lot easier and more enjoyable.", "rating": 2}, {"title": "I am giving this 2 stars for now…", "text": "I am giving this 2 stars for now because i don't know if they would fix my issue. I ordered items and when i went to track the order i noticed it was cancelled. I never cancelled anything. They charged my card, therefore i am confused because they didn't even explain why or let me know they cancelled it. If this is handled properly, i will be more than happy to follow up with a better review, but for now, I am highly frustrated. I would love to get my items, but if its not possible, I NEED ALL my money back! Its my first time ordering. I always shop at the stores. I was so glad to realize they had an online store but this is so far unacceptable and unfair to customers like myself, who don't have much! :( Lets see what happens.....", "rating": 2}, {"title": "The shorts were much smaller than a…", "text": "The shorts were much smaller than a normal size 14.", "rating": 2}, {"title": "Everything was accurate up to placing…", "text": "Everything was accurate up to placing my order. After putting in the 10% discount code, it never gave me an update balance. SO I just assumed it would allow me to \"REVIEW\" my order before actually PLACING the order and charging my account. Well come to find out AFTER receiving the email, that the 10% discount was applied however I was charged for SHIPPING! This was not accurately stated to me PRIOR to me submitting my order. It stated on the website that I would get free shipping if my order total was over $50, which it was. However, if I was taken to a \"REVIEW\" page prior to my payment being submitted (or even if the main order page updated correctly I could have see it there), I could have removed the 10% discount to still get free shipping. I ended up paying about $3 more. Seems a bit unfair to me.", "rating": 2}, {"title": "Purchased a wrong size", "text": "Purchased a wrong size, immediately called customer service to exchange to the correct size because it's a swimsuit I knew I wouldn't be able to refund/exchange once it delivered. I was told there is nothing that can be done to an order once its placed. So upsetting", "rating": 2}, {"title": "I loved the panties I ordered", "text": "I loved the panties I ordered. However I never received my two tank tops. :(", "rating": 2}, {"title": "My order came and wasn’t my size but…", "text": "My order came and wasn’t my size but couldn’t return it cause it had no tag.", "rating": 2}, {"title": "Rainbows staff are in support of Racism and they don't care!", "text": "I want to give a one star. However, I absolutely love your clothes. Always fit, always stylish. That is what I went for, so why not a 5 star?   Its the staff and the constant flow of disrespectful customers that warranted a low review. Today I was verbally and racial assaulted in your store #00244 in Holyoke, MA. Than I physically assaulted.   I ignored the woman and finished my transaction. The operator: 8071YF that was assisting me, asked me in Spanish, if I understood Spanish. I replied, in Spanish that I did and presided to walk to the exit. When I turned around the woman that was being belligerent took one step to her left, than proceeded to shoulder bump me. Than sarcastically said, \"Oh sorry\" as she continued to walk by. I immediately stopped, looked around to see who was around. Their was no one but the store manager and employee behind the counter. Watching with their jaws dropped. Than I turned to the belligerent racist woman. I said, in a calm voice, \"You know what you did\".  She again was rude.As a woman in my thirties I did not engage and I turned and walked out. She continued to laugh with staff and talk in Spanish about the \"Perra blanca\".   I got to my car than I ended up walking back. To make a formal complaint. The Manager on duty stated she didn't see anything and she isn't in control of her customers and I was asked to leave. I refused and demanded to speak to someone who is above her. The manger on duty did make a call and I spoke to a woman on the phone. She stated that her DM was out but I believe she said she was regional. I could be mistaken about that detail. Very helpful woman and she did sound concerned. I am happy that someone within the company doesn't condone this activity. Now, is this a big deal? Maybe not. Their are horrible ppl everywhere. However, I always seem to have a higher amount of these encounters when I walk through Rainbows. Which ever store I go to in my region, it does't matter. For that, I have to say goodbye. I mean, am I supposed to go to a \"White\" Rainbows? I am married to a Hispanic and was raised with immigrants from an island in the Mediterranean. I believe in equality and what civil rights stand for. I would like Rainbows to stand with me and the many of us from all different nations that just want to wear something nice without fear of discrimination! I only wanted to get a pretty dress for my daughters 4th grade graduation. I didn't think I would be entering a war zone to shop. The sad thing is, this is not the first time, this exact same thing happened in the same exact store just a year before.", "rating": 2}, {"title": "Received my first order from them and…", "text": "Received my first order from them and they sent me the wrong size jeans. They are no are no longer available so it was just a complete waist of time ordering from them. I rarely try out new sites for buying clothes and should have stuck to that. Because of this experience I will not be shopping here again.", "rating": 2}, {"title": "Not the way it was", "text": "They don't have much and not good quality", "rating": 2}, {"title": "Inconsistent Sizing", "text": "Even though I ordered on line, the sizing of the clothing from this store is very inconsistent.  I ordered 184.00 worth of merchandise to keep only three items from the shipment. I will be sticking to my normal stores Torrid and Lane Bryant.", "rating": 2}, {"title": "Not a fan of the website and how it…", "text": "Not a fan of the website and how it operates. Its decent though so I dont totally hate it. Some clothes are extremely overpriced for no apparent reason and it sucks.", "rating": 2}, {"title": "Its good but too many sections", "text": "Take to long to recieve a date for your order.", "rating": 2}, {"title": "Working in the hole", "text": "I think that the Item was beautiful. However, When I walked into my job, I had the embarrassment of coworkers telling me that there were holes in the back. I could not go home and was lent a jacket to cover the holes on my butt and down the back of my leg. The fit was perfect but the unaccounted holes were unacceptable. It was a gift from my sister, and I had to tell her that she paid for a defective item. I still like rainbow but this might be a first and last purchase. Love your company. I just don't like being embarrassed. Size L(True to Size)", "rating": 2}, {"title": "First time shopping from rainbow online do not purchase 1 day shipping", "text": "First time shopping from rainbow online purchased one day shipping for $26 on May 31st expecting to receive it June 1st or latest June 2nd finally got tracking information June 1st around 6:30 with an estimation of getting the package June 4th", "rating": 2}, {"title": "I paid for next day shipping", "text": "I paid for next day shipping. The order said there was 15 minutes to cancel because it would be shipped so fast. It didn’t ship until the next day. It was ordered on Thursday morning updated that it shipped Friday evening and paid extra for next day service that will be delivered next week. Not happy.", "rating": 2}, {"title": "It wouldn't allow me to use my debit…", "text": "It wouldn't allow me to use my debit card. So now I have to use my PayPal account and pay that off. What's the big deal? I had enough money and the correct information. Other than that, the website was great.", "rating": 2}, {"title": "I didn’t get my 10% discount for…", "text": "I didn’t get my 10% discount for putting my email in. -.-", "rating": 2}, {"title": "i am disappointed that they charge do…", "text": "i am disappointed that they charge do much for shipping. i bought 2 dresses at 7.00 each and had to pay $24 total. The shipping rayes need to be changed because its very discouraging that my total was $14 but i had to pay $10 to ship because as ALWAYS the stores didn't have what i was looking for.", "rating": 2}, {"title": "Styles are not my style", "text": "Styles are not my style. Too flashy and showy. Nothing I could wear to work, which is what I need.", "rating": 2}, {"title": "Disappointed", "text": "I received a dress with the majority of the buttons are missing...It shouldn't have been sent to my door this way.I will think twice before I will purchase again.", "rating": 2}, {"title": "I had an item in my bag and ready for…", "text": "I had an item in my bag and ready for checkout and it never would go to my bag. Disappointed I couldn’t get it. Other than that it was good!!!", "rating": 2}, {"title": "To many items sold out online", "text": "Date of experience: May 25, 2018", "rating": 2}, {"title": "I paid $30 to have my order shipped…", "text": "I paid $30 to have my order shipped overnight to make sure I had my items before leaving town. It didn't show up the next day, so I gave it another day. Still didn't show up. When I called, I was informed my order was canceled because my billing adress did not match my shipping address. Nobody contacted me to tell me. So I'm out the money I paid for overnight shipping, I still don't have my order and I'm leaving town without the items. Hopefully they show up by the time I get back.", "rating": 2}, {"title": "Mangers and staff needs to be …knowledgeable", "text": "Mangers and staff needs to be  knowledagable of their own policies. I ordered online my items and they did not send items with tags but I needed to return one item. The manger sent me away I called customer service and I was told that is false information, you can return anything with your receipt. I made 2 unnecessary trips to Rainbow. The manger was impressionable and I won't shop her nor will my friends and family.", "rating": 2}, {"title": "The app def", "text": "The app def. Needs work. The filter option is not acvurate and missing sizes and app is not user friendly.", "rating": 2}, {"title": "both dresses are beautiful but are…", "text": "both dresses are beautiful but are sized wrong. I wear xl. I ordered a 2x and it fits like large.Way too tight for my belly.", "rating": 2}, {"title": "Never have my size xl", "text": "Date of experience: May 14, 2018", "rating": 2}, {"title": "Your website keeps freezing up and most…", "text": "Your website keeps freezing up and most companies offer free shipping and handling", "rating": 2}, {"title": "I ordered online", "text": "I ordered online, they for got some of items so I contacted customer service kind of expecting the problem to resolved. Instead I got several emails back just saying how sorry they were and how they're refunding me for the items they missed... Except I still wanted those things.I never asked for a refund but one was given anyway without asking what I wanted. Now if I still wanted the item, my only option would be to re-purchase it and I'd have to pay for shipping...again. I'm so dissapointed with my experience and I will not be buying anything else from them. Really too bad because I was looking forward to being a very frequent customer", "rating": 2}, {"title": "erratic sizing makes it too hard to buy online", "text": "Impossible to order online from Rainbow because every item has different sizing. you order 2 tops in size Large, one is so small you can't get over your head and the other is swimming. Also, BEWARE OF PAYING THEM WITH PAYPAL- they won't refund you in the store via Paypal like department stores do, unless you MAIL it back.", "rating": 2}, {"title": "Not enough plus size choices.", "text": "Date of experience: May 04, 2018", "rating": 2}, {"title": "Shipping Sucks", "text": "This shop has the ability to be a great deal with great quality clothes. But its all ruined when you go to place your order and the shipping is more than the clothes.", "rating": 2}, {"title": "Cute clothes!", "text": "Clothes are cute but not hardly true to size, I'll be returning all but 2 items. I wear a 16 had to get 19/20 thankfully they fit 2xl tops are more like larges. 😓😓", "rating": 2}, {"title": "My order took to long to update and I…", "text": "My order took to long to update and I don't know when it's go8ng to shipout", "rating": 2}, {"title": "Shipping takes forever !", "text": "Date of experience: May 01, 2018", "rating": 2}, {"title": "Unimpressed", "text": "I ordered several items. I get an email saying my order has been cancelled because they couldn’t verify my billing information.  I emailed them to find out what happened...like did I enter my address wrong or enter my card number wrong? No response.  I’m honestly very unimpressed with the customer service.  This was my first time TRYING to order something off of Rainbow and I’m pretty sure it will be my last.", "rating": 2}, {"title": "I dont know waht happened but i think i…", "text": "I dont know waht happened but i think i have multiple transactions", "rating": 2}, {"title": "Poor return policy", "text": "I’m used to shopping at stores with 30 days return policy. I had to get a gift card so I ordered to use the card. I will never shop with Rainbow again!", "rating": 2}, {"title": "Horrible 1st time online experience", "text": "I have no problems with the stores themselves, but my first online experience was horrible. My mother in law placed an order and had it ship to me. Within 2 hrs my order had been canceled due to assumed \"fraudulent activity\". However, no one attempted to verify any info prior to cancelation.  My order was for next day which screwed everything up due to it being the last day we could order and it arrive on time before we left to go out of town.  In addition now there is a funds hold on the account pending for the next 3-5 business days. Customer service was very matter of fact and borderline rude with me and my mother in law which got them a quick dialtone rather than profanity because at this point now i have to worry about clothes for me and my daughter for our trip. Never again.", "rating": 2}, {"title": "FedEx is the problem", "text": "FedEx is the problem. I most likely will not be shopping through rainbow shops again because they use fedex. They have lost many of my packages before and are always late or changing the delivery date. I have had too many issues with them in the past.", "rating": 2}, {"title": "I was told I would get 10% off", "text": "I was told I would get 10% off.  I got the email but no code.", "rating": 2}, {"title": "I can't track my order", "text": "Date of experience: April 17, 2018", "rating": 2}, {"title": "shipping is very expensive", "text": "shipping is very expensive. other places charge $4 for shipping like forever 21, fashion nova, charlotte russe", "rating": 2}, {"title": "I'm not able to purchase from you…", "text": "I'm not able to purchase from you because you have an issue with my card. So I've decided to use the same card to shop elsewhere.", "rating": 2}, {"title": "NOT HAPPY!!!", "text": "Not true to size I ordered a dress in a size 4X this thing must be a size 2. Not going to order from RAinbow Shops ever again they have messed up to much for me !!!", "rating": 2}, {"title": "Too much on shipping", "text": "Date of experience: April 10, 2018", "rating": 2}, {"title": "DONT USE PAYPAL", "text": "These CHEAP clothes are overpriced. Spend 50 for free shipping but when you pay with PayPal you must send it back Then they charge you . WHO DOES THAT... ANYTHING TO MAKE A DOLLAR OFF YOUR MONEY..GARBAGE STORE.", "rating": 2}, {"title": "Mailing time sucks", "text": "Date of experience: April 04, 2018", "rating": 2}, {"title": "I love your choices", "text": "I love your choices.  However, this is my first order and the 10% off didn't apply as you said.  And I was signed in.  Customer service kept hanging up on me.", "rating": 2}, {"title": "Not happy with quality of products.", "text": "Not happy with quality of products.And overcharged me on my credit card.", "rating": 2}, {"title": "there needs to be promo code offered so…", "text": "there needs to be promo code offered so u can receive discounts", "rating": 2}, {"title": "Three of my item stitching  was coming…", "text": "Three of my item stitching  was coming apart.  Also took some time to arrive", "rating": 2}, {"title": "My first Online purchases needed to be…", "text": "My first Online purchases needed to be returned so I went to a Rainbow store near me and was advised that because I used PayPal to make my purchase I could ONLY receive an in store credit. I attempted to contact the company but I was kept on hold for so long that I eventually hungup.  My first order was NOT a good experience. Return poiicy sucks I mean really really sucks.....never again! I’m so done! Telling everyone that will give ear to hear me! Don’t buy cause their stuff don’t fit right.", "rating": 2}, {"title": "My first order didn't receive my 10%…", "text": "My first order didn't receive my 10% 22132562", "rating": 2}, {"title": "I,have ordered jewelry accessories from…", "text": "I,have ordered jewelry accessories from rainbow and I received the jewelry accessories items via US mail broken, I, started to stop ordering any thing from rainbow 's.", "rating": 2}, {"title": "They sent me wrong size", "text": "They sent me wrong size, even though it was listed on my shopping receipt. When talking to customer  service they acted like they didn't know what to do. Very unsatisfied.  I returned item and waiting on my  refund.", "rating": 2}, {"title": "Make you spend to much to get free…", "text": "Make you spend to much to get free shipping Other than that it's great but if different I would shop more", "rating": 2}, {"title": "I'm so mad,y'all took my item out my…", "text": "I'm so mad,y'all took my item out my kart it wasn't even in there long,now y'all don't have anymore.. Y'all should have a customer loyalty program or something.. UGH!!!!!!", "rating": 2}, {"title": "I have not received my package as yet…", "text": "I have not received my package as yet and it been a month usually ain't don't take this long for me to get something from you guys", "rating": 2}, {"title": "disappointed customer", "text": "Some stores in Philadelphia  have  workers that are very unprofessional  and rude. Also I’m a plus woman and 75 %of ur tops are sleeveless big girls don’t always wanna show skin especially arm fat", "rating": 2}, {"title": "The first time I called customer…", "text": "The first time I called customer service the representative, was not friendly, I called because, out of all of this time of ordering on line I never got my 10 present, on my order so I called in this morning to get it, so nice I made my order, and the coupon didn't work, so I placed the order, anyway, and then I called back and got the same lady, and I told her what happened, and I asked her could she apply the 10 percent and she said no she couldn't, and again when you give your email address and it say's you get a percentage off it should be sent right away and last year when I tried over and over to get it it was never sent so I am frustrated with Rainbow on line ordering", "rating": 2}, {"title": "online inaccuracy", "text": "I usually have to do a lot of returns or exchanges when I buy online. However, there are no stores near. my college campus. Hopefully, the accuracy of the clothing details can improve.", "rating": 2}, {"title": "Material is nice but clothes are NOT…", "text": "Material is nice but clothes are NOT true to size and I can’t even wear them. The clothes I’m wearing are smaller than these according to the tag. These must be the sizes overseas and not USA sizes. I’m disappointed and was looking forward to these new pieces. Won’t recommend.", "rating": 2}, {"title": "Find item in store", "text": "It would be convenient and in-line with other stores I shop, to shop your online store and find the item available by store location to avoid shipping fees.", "rating": 2}, {"title": "no matching color with new arrival", "text": "how you not going have color tops to match the bottom shorts", "rating": 2}, {"title": "I had to call customer service  and the…", "text": "I had to call customer service  and the lady on the phone was very rude.", "rating": 2}, {"title": "To whom it may concern I really like…", "text": "To whom it may concern I really like rainbows clothing I think that you guys have a really nice Style but you do not have enough plus size clothing I can never find it in my size I think you need more 4X things available some of the smaller women clothes our way better I just feel that you should have more big sizes other than that was fine I feel like if you guys have more bigger sizes and more of a variety you will have way better business", "rating": 2}, {"title": "No Variety", "text": "There's not much variety for the children. Not as many name brands as in the past. This is ultimately the reason I stopped buying and I wish that I would have saved my money. That and customer service in-store is really bad. Also, there no longer is fashion for boys which is really inconvenient because now I have to go to more than one store to shop...", "rating": 2}, {"title": "Im highly upset because when i tried to…", "text": "Im highly upset because when i tried to return in store it wouldnt show the cashier the REAL date i received my items it showed the day i ordered it. So i was forced to get store credit", "rating": 2}, {"title": "I couldnot find shoes size list", "text": "I couldnot find shoes size list . they are not lised", "rating": 2}, {"title": "Bad customer service", "text": "There is a glitch on there web site ,i ordered 2 jeans blk and white but the receipt shows 2 blk i emailed customer service so they would fix right away and i was told no  that i could just return it :(  it was not my mistake why do i have to go out of my way to return. I will not buy from someone i cant trust or feel comfortable with...bad customer service.", "rating": 2}, {"title": "shipping too high", "text": "Date of experience: March 07, 2018", "rating": 2}, {"title": "I bought a jacket that started falling…", "text": "I bought a jacket that started falling apart the moment I got it. The buttons came out of the holes and the fur lining came off completely. I would not recommend this store to anyone and I overall regret my purchase.", "rating": 2}, {"title": "Disappointed", "text": "Was trying to process an order for two todays but the site would not accept my card. I called multiple times and even emailed. Was told it was a system error and to wait and try again. Finally at about 5:30 pm on today, customer service enter my information from their end and the payment went through. Unfortunately some of the item were now sold out and I had to pay 19.95 for two day shipping to make sure I get the order in time. We are leaving this weekend for Spring Break and my daughter picked these out herself. If not for that reason, I would have gave it up instead of constantly trying to purchase them. No courtesy was offered or giving for the mishap.", "rating": 2}, {"title": "Long shipping time", "text": "Long shipping time. No exchanges-very inconvenient. Long wait for returns to be processed. Had to wait for my account to be credited and then purchase another size.", "rating": 2}, {"title": "I am really dissatisfied about my order…", "text": "I am really dissatisfied about my order i placed on mar 2,2018. I recieved a email stating you guys canceled my order. The reason y ALL stated was c ouldnt verify my billing address. I just checked on order to make sure my address was correct. I don't think it's fair that rainbow cancels my order and now I can't get this order. How can y ALL resend order", "rating": 2}, {"title": "Not enough choices to choose from all…", "text": "Not enough choices to choose from all the clothes on the same design almost and everything look dressy,not too many larger sizes", "rating": 2}, {"title": "Would not let me use my 10% discount …", "text": "Would not let me use my 10% discount  when I signed up", "rating": 2}, {"title": "all sizes 11 are out", "text": "Date of experience: February 26, 2018", "rating": 2}, {"title": "My original items that were in my…", "text": "My original items that were in my shopping cart or no longer there and I'm still trying to figure out how I spend $119 on for catsuits a pair of pants and Jewelry", "rating": 2}, {"title": "Stain and nose ring found in my 1st order...", "text": "There was a stain on one of my shirts I ordered a year ago. I found someone's nose ring in my order as well. Very unsanitary and flat out gross. I debated at the time to ever ordering from Rainbow Shops again.", "rating": 2}, {"title": "Charge twice for my order", "text": "Date of experience: February 23, 2018", "rating": 2}, {"title": "I placed an order only to find out the…", "text": "I placed an order only to find out the selection was out of stock.The only way I got that information was calling after my complete order arrived,but was still showing.available on your site", "rating": 2}, {"title": "Placed order on the 15th paid to have…", "text": "Placed order on the 15th paid to have it shipped in 2 days and still have not received my package ..tracked it states it suppose to arrived by Tuesday I am disappointed because I paid extra to have it shipped early and still getting it 5 days later..i feel I should get my deposit back for early shipment", "rating": 2}, {"title": "Well i couldn't use 10%disount because…", "text": "Well i couldn't use 10%disount because my code wouldnt take and i couldbt ever seem to get through by calling...poor sevice and poor on ability to usr my first time user 10 percent", "rating": 2}, {"title": "Well because after I paid for it the…", "text": "Well because after I paid for it the prices changed for some of the things and there's something on there that I did not order and the dresses that I ordered did not have sleeves now I'm looking at the pictures now they have sleeves so I'm hoping that's a mistake with a picture when I get my delivery", "rating": 2}, {"title": "Don't like the fact I get 10% off…", "text": "Don't like the fact I get 10% off future order and free shipping amount is too high", "rating": 2}, {"title": "I'm giving you a 2 star rate because I…", "text": "I'm giving you a 2 star rate because I thought the jacket would be made of stronger quality I love my bag tho!!!", "rating": 2}, {"title": "I like the  prices", "text": "Date of experience: February 13, 2018", "rating": 2}, {"title": "Let me place a full order then sent an …", "text": "Let me place a full order then sent an email saying they didn't have over half of it very let down not sure if the site is trust worthy", "rating": 2}, {"title": "It took forever to get my order in.", "text": "Date of experience: February 07, 2018", "rating": 2}, {"title": "Crashing during checkout", "text": "The website kept crashing while I was trying to checkout which made it very difficult to make my purchase.", "rating": 2}, {"title": "I love rainbow shops I really do I shop …", "text": "I love rainbow shops I really do I shop instore online but online there is a problem with paying with card than with PayPal they always overcharge when paying with card so I pay with PayPal but the bad thing with that is if I return I store I only get store credit", "rating": 2}, {"title": "Not a big share", "text": "Not big giving reviews. Will have more to say after my items arrive", "rating": 2}, {"title": "Slow shipping", "text": "Haven't received order", "rating": 2}, {"title": "On-line Order  Unimpressive", "text": "I ordered 6 items. Received an email my order had shipped. expecting all 6 items. Only received 2 items.  I then go to My Orders on the site and note 4 items has -0- shipped.  Had to call to discover they were out of stock at the time of shipment. First, it would have been nice to receive an email stating that, I could have shopped locally for what I wanted.  Secondly why is their inventory system inadequate to sell products as available and then not be available at shipment.  Unimpressive experience", "rating": 2}, {"title": "Still waiting fir shipment", "text": "Date of experience: January 24, 2018", "rating": 2}, {"title": "I got sent a top instead of leggings i …", "text": "I got sent a top instead of leggings i asked for and the shirt I ordered had a bigger hole than what it seemed like on the website.", "rating": 2}, {"title": "I am still waiting on my package", "text": "I am still waiting on my package.  I can’t review the items I don’t have.  The date of delivery was yesterday and then it was changed to today.  We will see if they arrive today.", "rating": 2}, {"title": "I wish that the free shipping wouldn't …", "text": "I wish that the free shipping wouldn't take up to 9 bus days and I wish that there was an option to have items shipped to a store for pick up. But on a lighter note there were many items that I found online that weren't in the stores.", "rating": 2}, {"title": "Delivery time is poor", "text": "I couldnt really rate since I still havent gotten my order. Poor on shipment timing. Delivery day kept changing.", "rating": 2}, {"title": "I was very dissapointed with my …", "text": "I was very dissapointed with my experience. I ordered really cute pair of boots.  Really excited.  Received my confirmation only to be informed days later that they could not fill my order.  My money was refunded to my card but that should have never happened.", "rating": 2}, {"title": "I just love the items that was …", "text": "I just love the items that was purchased from you.", "rating": 2}, {"title": "I really think you should start selling …", "text": "I really think you should start selling cheap makeup.other than that your doing well.", "rating": 2}, {"title": "I gave u 2stars because u offer some …", "text": "I gave u 2stars because u offer some great outfit at an affordable price n awesome quality.  However ur cstomer service is atrocious..  Thanks to Mike and Kiesha they've save the day.  Your customer service  team both instore n over the phone NEEDS TRAINING IMMEDIATELY!!!  Especially over the phone, I seriously think Arlene and another one cant remember her name HATE their job.  THEY KNOW ABSOLUTELY NTN ABT CS.", "rating": 2}, {"title": "items keep deleting out my cart", "text": "items keep deleting out my cart . horrible .  I was about to go to forever21.  I had to keep looking for the items I added in my cart my purchase  would have been larger but I couldn't remember  the items  name and I got tired  looking though  the pages for everything that kept getting removed out my cart. im so disappointed  I hope I get everything  I order  cause that didn't  make no sense  to me. makes me not want to shop with rainbow online.", "rating": 2}, {"title": "I had issues with payment", "text": "Date of experience: January 16, 2018", "rating": 2}, {"title": "Not happy with their site's click bait", "text": "Not happy with their site's click bait, my first time on the site I was prompted to sign up for email alerts and get a 10% discount off of my purchase. It's almost a week since I placed my order (which I still have not received an update on) and still have not received the discount email😣 not a good look I probably wouldn't order from this site again. FYI DON'T SIGN UP FOR EMAIL ALERTS THEY'LL FOREVER SPAM YOU!", "rating": 2}, {"title": "I was having trouble to place my order …", "text": "I was having trouble to place my order it kept failing then I didn't get a conformation until I saw it on my email. I used to see it soon as I placed the order. This was really frustrating.", "rating": 2}, {"title": "Package came on time tired to return at …", "text": "Package came on time tired to return at the store and I had a horrible experience the lady didn't give me the price that for the shirt she gave me a different price she couldn't find the shirt that I purchase and said she probably couldn't take it back I had to sit in the store for 30 minutes for her to tell me she's not going to give me my money back in full on 31st Prospect Kansas City Missouri", "rating": 2}, {"title": "It’s ok just wish you guys offered some …", "text": "It’s ok just wish you guys offered some promotions for your valued customers .", "rating": 2}]