[{"title": "I felt the agent didn't give me enough…", "text": "I felt the agent didn't give me enough information to understand the process. I shared with him this was my first time purchasing a  bond. There could have been more details.", "rating": 2}, {"title": "Not being able to see what i am…", "text": "Not being able to see what i am purchasing is a big issue.  We get spam all the time so having a renew  email just come in without any reference to a policy number is a big red flag.  You need to allow the ability to log in to your policy and renew that way instead of an email that could be a spearfishing email from what it looks like.", "rating": 2}, {"title": "I have paid you received my payment but…", "text": "I made the mistake putting the principle name down as the person I bought the motorcycle from. So I would just suggest the instructions on completing the application is to make it clearer. But other than that the customer service and reply time have been awesome. Thank you so much!! It has been a pleasure", "rating": 2}, {"title": "It should be clear that whatever you…", "text": "It should be clear that whatever you type into the questions will be directly transplanted on to the VTR-130-SB and any corrections made after will be questioned.", "rating": 2}, {"title": "I don’t need 3 different people calling…", "text": "I don’t need 3 different people calling me the same week to remind me of my BOND. A email would have been sufficient. And when I called back after a message was left someone answered the phone “So what do you want” “  Why are you calling?”that was rude.", "rating": 2}, {"title": "Know the laws of your state", "text": "I wasn't familiar with this process and wanted to ensure that this was not a waste of money. I did try asking questions about the process to the customer service representative. Unfortunately, it was because I could not use a title bond. The dealership I bought the car from is still in operation. I wished someone had told me this option was only for those whose dealership was out of business.", "rating": 2}, {"title": "I appreciated the easy access to the…", "text": "I appreciated the easy access to the bond/documents. I recent the lack of customer service support, there is none. I have called couple of times to resolve my issues with no response.", "rating": 2}, {"title": "I received the bond overnight and…", "text": "I received the bond overnight and brought to the Courthouse and the court rejected the bond due to Travelers did not put their name and address on the front page of the bond. So I called the company and they had to reissue the bond and shipped overnight. I was not compensated an any way for having to get a notary signed again and for my 3 hours drive and 1 hour wait at the court house. Very Long Day!  And to do this process 2 times was very disappointing!", "rating": 2}, {"title": "Slow order fulfillment, wrong laws!", "text": "Held up our orders almost a month due to laws unrelated to our state.  Argued with us about our laws but finally looked up and found out we were correct.", "rating": 2}, {"title": "The county was reluctant to accept my…", "text": "The county was reluctant to accept my bond because it was unclear if the signature was actually ink because it looked printed but must be hand signed in ink.", "rating": 2}, {"title": "They messed up my bond", "text": "They were friendly, then they assigned a bond to wrong state. And are making  it alot harder then it needs to be for a simple indemnity bond. Just write a bond for colorado. Thank you dragging this out . When you knew this was on a deadline for me. ChadChad b..", "rating": 2}, {"title": "Received incorrect information about…", "text": "Received incorrect information about the probate file number on the form that is required by the court.", "rating": 2}, {"title": "Your vehicle bond isn't worth the paper…", "text": "Your vehicle bond isn't worth the paper it's written on in the state of Arkansas. Hope y'all enjoy my 100.00 I spent for nothing !", "rating": 2}, {"title": "Issued one bond with incorrect penal…", "text": "Issued one bond with incorrect penal designation (RESIDENTIAL instead of COMMERCIAL, despite the associated license classification being COMMERCIAL).  48-72 Hours for them to correct errors.  They're nice enough, but perhaps slightly incompetent.", "rating": 2}, {"title": "Title bond was filled out incorrectly.", "text": "Title bond was filled out incorrectly. ", "rating": 2}, {"title": "Took too long to get and very expensive", "text": "Date of experience: January 03, 2024", "rating": 2}, {"title": "Spam after purchase", "text": "Good in terms of getting a quick, cheap bond to satisfy licensing requirements, however now I keep gettin spam emails from this company, such as constant emails reminding me to review them. I get it, send a review request, but to keep filling my inbox with requests is a bit ridiculous.", "rating": 2}, {"title": "The emails you send to your customers…", "text": "The emails you send to your customers around renewal time are threatening.  We've been with you over 10 years and honestly we should look elsewhere.", "rating": 2}, {"title": "This Title Bond was not usable at…", "text": "This Title Bond was not usable at Arizona DMV. THEY require a wet bond in AZ. So I had to cancel this purchase and go to a local insurer", "rating": 2}, {"title": "Poor attention to detail and unwilling to accept fault", "text": "The first time I ordered a bond from them, no problems. When I renewed my bond, they put the completely wrong date on the bond, and I nearly lost my license. If I had not had it done so far in advance, I would have lost it. This time, they sent the bond and nothing ever showed up. When I asked about it, they told me I had to pay to have a copy sent. Neither I nor my office will never use this company again.", "rating": 2}, {"title": "The customer support is obnoxiously…", "text": "The customer support is obnoxiously vacuous. I've been going back and forth via email and I cannot break it down any more simple on the changes I need. Looks like there is only one guy in the position I am dealing with, so I can't even get transferred to another representative. This is delaying my application with the state, and I paid extra for it to be expedited.", "rating": 2}, {"title": "They won't give me a refund, for something I feel was their fault.", "text": "Im disappointed they did not disclose to me specifics about the surety bond and had me thinking that I would be able to use the surety bonds to get my brothers car, but they did not tell me that I would have to go to court in order to get it. They didn't fully make me fully aware of if I was eligible for a surety bond. Then when I asked for a refund they said it was impossible to give me. Now im out of 100 dollars.", "rating": 2}, {"title": "You renewal communication is way to…", "text": "You renewal communication is way to persistent. You start sending emails and calling several times a week two months before renewal date and then send a threatening cancellation email one month before renewal date. It is irritating.", "rating": 2}, {"title": "When will this be processed ?", "text": "Still waiting to get an email that this has been processed. Unsure the extensive hold up considering this is all onlineNote:Email received the day of this review. Thank you for the fast action !", "rating": 2}, {"title": "Too many hassles in my opinion", "text": "I always have to email the rep to ask for a copy of my bond and he acts like it's so much work to get it to me.  Also, just recently I asked if we got a bulk discount if we purchased bonds 4 or 5 more states (while asking for quotes for these bonds) and he responded with some obnoxious response that no they don't offer bulk discounts, don't I know how business works.  Well I know enough about it to know they will probably lose my business.  I don't know if I got a bad rep or what, but there are plenty of businesses out there willing to offer bonds and I don't need to deal with idiots like that.", "rating": 2}, {"title": "Robbed me blind on the price for a bond…", "text": "Robbed me blind on the price for a bond I was court-ordered, but did not choose to purchase.  They had nothing to say when I complained of the price and the process.  One person told me the bond would be sent straight to the court, one said it would be sent to me.  Postage/delivery costs were extra, plus the additional cost of sending it where it actually needed to go.Their disconnected \"We don't care as long as we are getting paid\" attitude was sad. They never told me they were a broker.  I could have gotten the bond without the additional broker fees had I known that the insurance company they purchased from sold the bonds.  This essentially makes their service completely unnecessary.  Now, I know this if I am ever ordered to do this again.", "rating": 2}, {"title": "RUDE..DISMISSIVE..", "text": "Spoke to a Representative that was very short, rude and dismissive..I don't care what your service is like, but if you are this way with potential customers, then no thanks.", "rating": 2}, {"title": "I guess they assumed I had ever bought…", "text": "I guess they assumed I had bought a bond before. My rep sounded annyoed by my questions I felt alittle helpless had to figure some stuff out alone and some info was not given correctly.", "rating": 2}, {"title": "I got my bond with wrong practice name", "text": "I got my bond with wrong practice name, had to pay another shipping cost to get another one with the correct name. Received the 2nd one and it's missing PTAN#, frustrating!", "rating": 2}, {"title": "Not very pleasant experience", "text": "Bond rate increase is completely unwarranted. Most likely last time we will use suretybonds.com", "rating": 2}, {"title": "buy and not resaved anything from…", "text": "buy and not resaved anything from 10/6/2022 still wetting .", "rating": 2}, {"title": "YOU WERE A DAY LATE", "text": "YOU WERE A DAY LATE, WITH NO STATEMENT WHY, IT OVER NOW & MY BOND IS MAIL TO STATE. THANKS ANY WAY. ---- C B LEWIS", "rating": 2}, {"title": "I paid for Two day shipping and have…", "text": "I paid for Two day shipping and have not received it yet and this is going on day number four. This is unacceptable", "rating": 2}, {"title": "I'm not doing business as OK EMS TA", "text": "Date of experience: January 03, 2023", "rating": 2}, {"title": "The staff was very helpful and…", "text": "The staff was very helpful and friendly...But gave me false information on laws. Wasted $130 for nothing.", "rating": 2}, {"title": "Outstanding customer service", "text": "Outstanding customer service. Call back after I initially inquired was terrific", "rating": 2}, {"title": "My agent seemed pushy and cold", "text": "Date of experience: April 18, 2023", "rating": 2}, {"title": "i need a copy of the  bond to  send  to…", "text": "i need a copy of the  bond to  send  to  the TDLR.. PLEASE HURRY", "rating": 2}, {"title": "Free travel", "text": "Free travel ", "rating": 2}]