[{"title": "UNPROFESSIONAL", "text": "Requested hard copy of insurance and it took multiple requests to get one!!!!!!!Not very professional !!!!!!", "rating": 2}, {"title": "AARDY IS SHADY!", "text": "The AARDY agent (via chat was extremely helpful).  I bought the IMG insurance THEN looked at all of the HORRIBLE reviews.  AARDY has to be aware but is still marketing and selling this vendor's product.  That's definitely not putting the customer first, but putting dollars over people.  How shady can you get!  It's just pathetic!!  I cancelled the insurance within 20 minutes of buying it and went with a completely different company, no middle man and paid wayyy more, but I have peace!  ", "rating": 2}, {"title": "experience is very good", "text": "experience is very good. That employee is very kind and humble", "rating": 2}, {"title": "Trying to sign in", "text": "Trying to sign in.  put email address in.  States sign in complete..\"  Sign in with previous tab.Where/what is previous tab?  Can't find previous tab\"", "rating": 2}, {"title": "Our representative was terrific", "text": "Our representative was terrific! She spent the time to go over all available options, “drilling deep” on the pros and cons of each policy. She found us the most affordable option that best met our needs. She was extremely professional, knowledgeable and patient. She made a complex decision making process easy, understandable and stress free. Thank you for this wonderful service!", "rating": 2}, {"title": "I'm a first-time user of getting travel…", "text": "I'm a first-time user of getting travel insurance and Maranda was great at answering all my questions.  If she wasn't sure, she didn't guess, she looked it up in the policy and read what was there for me.  I had a lot of questions and she was patient even when I had to look something up on my computer to make sure we had all the correct information.  Getting insurance give me peace of mind traveling to this expensive country.  Thank you.", "rating": 2}, {"title": "I had written a great review of the…", "text": "I had written a great review of the person who helped me on April 8 with AARDY, but after review, I was given misinformation and had to call to change my policy. I should have checked out what she told me before I proceeded. ", "rating": 2}, {"title": "Coverage for two means two different people", "text": "I signed up for insurance for an upcoming trip, entering my name and age, and my wife's name and age as part of the early setup. I selected a recommended policy and paid for it. When I received the confirmation email, I went to double-check the policy and found that my name was listed as both the primary and secondary insured person. Not sure where the web processing messed that up, but certainly the checks for issuing a policy should ensure that the same person isn't listed multiple times. So then I had to call in to get the change made, wait on hold several times, receive instructions for how to modify the policy, and then find out it may take longer for that change to take effect than the time we'll be away on the trip! The person on the phone tried to be helpful, but this experience makes me doubt I'll use this site again, even though we've been consistent users for many years.", "rating": 2}, {"title": "I purchased an IMG Travel LX which I…", "text": "I purchased an IMG Travel LX which I was told had a preexisting medical conditions waiver. I was showed the language in the contract by an Aardy agent who was very professional. When I called the benefits department at IMG (2 separate times) I was told my policy had no such waiver. They said it should be on the front page, to call back and talk to their sales person. When I did the sales agent and customer service said it does have the benefit. When the sales people say yes and the person who implements the benefits says no that is very concerning. If you have to make a claim it's the benefits person who has the say. I'm thinking of canceling the policy. Plus it looks like IMG does not have a good BBB record.", "rating": 2}, {"title": "I have been trying to get a declaration…", "text": "I have been trying to get a declaration page for this policy and cannot get through to your email.  I hope we will not need to try and turn in a claim if I can't even get a copy of the policy declaration for policy #BAT208632 for Gabriella Chavez!  Please advise", "rating": 2}, {"title": "It was hard to input information", "text": "It was hard to input information. You charged twice my account before the I formation was correct. It cost me that my card was invalid and had to get a new one forSecurity purposes!", "rating": 2}, {"title": "My ID cards for the insurance company…", "text": "My ID cards for the insurance company was aardvark insurance and my date of birth incorrect. I had to spend additional time with the insurance company to get it straightened out.", "rating": 2}, {"title": "Never got link to review policy or even…", "text": "Never got link to review policy or even be sure one was issued.  So it os anyone's guess whether it exists andvif so how to use it were it to be needed.", "rating": 2}, {"title": "Our birthdates were completely…", "text": "Our birthdates were completely different than what I entered so I now have to modify the policy and hope it can be done before we leave for our trip", "rating": 2}, {"title": "Seemed rather abrupt just sated the…", "text": "Seemed rather abrupt just sated the facts but not in a kind  way.Because the price was right I  booked but not because of my chat experience.", "rating": 2}, {"title": "The names on the policy were wrong", "text": "The names on the policy were wrong.  They put my name twice - which gave me two coverages for my self.  I entered the correct names and whether it was Aardy or Trawick, I don't know; but it's taking work to get it fixed.", "rating": 2}, {"title": "Would not use Nationwide again for anything!", "text": "We selected Nationwide as our insurance carrier for our cruise in late May. Because of an illness a week before the trip we had to cancel.I notified Nationwide and was told it would take some time to process our claim. We waited five (5) months before receiving our check. We had to call them multiple times and finally got someone who finally got the claim processed. Our 3K check arrived November 28th five months after the trip date.", "rating": 2}, {"title": "I was confused that each time I checked…", "text": "I was confused that each time I checked AIG's Essential travel insurance, a different price came up on the screen.  I have 15 days to review/cancel this policy, so if the price drops again, I will cancel and purchase a new policy with AIG.", "rating": 2}, {"title": "Policy hasn't arrived", "text": "When I purchased the policy I was told that the policy would arrive in a few days. It's now 8 days and no policy.", "rating": 2}, {"title": "I haven’t received my policy and will…", "text": "I haven’t received my policy and will have to make a phone call. Which means waiting on the phone.", "rating": 2}, {"title": "Buying the policy was very easy and…", "text": "Buying the policy was very easy and everyone was helpful.  Unfortunately when calling back for some help I have not been able to get that help and have been on hold for ages.  I want to know how to print the emergency card larger than the PFD format it comes in and my iPhone. One suggestion was to use a Chrome book. Not helpful.", "rating": 2}, {"title": "Thank you Aardy I found the travel policy... i give the company 5 stars for the help.", "text": "I bought the Travel Policy over a week ago and although I keep getting messages of busy they are and so forth ...  Always with a travel policy they send you the brochure and information... i am very disappointed and wonder if I have madre a mistake in buying from them..", "rating": 2}, {"title": "Tried to reach customer service", "text": "Tried to reach customer service. On hold for 30+ minutes. Eventually gave up and never got my question answered (if COVID is a covered illness and we cannot travel).Seems like this should have been a FAQ that could have easily been answered online. Hopefully it is a non-issue.", "rating": 2}, {"title": "I SHOULD get access to my docs w/out…", "text": "I SHOULD get access to my docs w/out having to jump thru hoops.", "rating": 2}, {"title": "Your program to print what I needed", "text": "Your program to print what I needed, was the most confusing thingI have ever tried to use. You recommended printing printing the insuranceinformation, it was almost 50 pages, how about 5 pages. I thought theID page would have my name on it, but it was just a sheet of paper, Imay have missed something?", "rating": 2}, {"title": "Wasn't happy with price increase (hidden fact)", "text": "Wasn't happy that the policy price increased in the 4 days that we took to think over our decision.  I suggest Aardvark put some details in their quote system that states up front that pricing likely will increase with each passing day.  I understand why it increased....just not happy that it wasn't stated up front.  Doesn't leave a good taste in one's mouth.  People usually prefer to have total transparency regarding pricing.", "rating": 2}, {"title": "difficulty in changing policy", "text": "Within minutes of booking the policy on line I determined that I needed to change the dates.  You made it so hard that I am considering cancelling the policy and going back to AIG, whom I have used in the past, even though your policy appears better.", "rating": 2}, {"title": "difficult website", "text": "difficult website, or maybe the product that i want is not available?i want medical insurance (not travel insurance) for 9 days on a caribbean island and the policy must cover covid.", "rating": 2}, {"title": "I had already research different travel…", "text": "I had already research different travel insurance policies, and knew what I wanted to purchase. The agent was very helpful and polite.She was also quick is writing the policy.", "rating": 2}, {"title": "A customer", "text": "A customer, or Aardy should be able to ask a couple of simple questions of the travel insurance company recommended by Aardy, in a reasonable time frame.  There should be some level of creditability with the insurance company regarding lack of service via communicating by Chat of phone.  When calling the insurance company for something as simple as the \"insured ID\" or \"Certificate #\", a customer or Aardy should not have to wait 15+ minutes to get a Chat response or 45+ minutes to get a phone call response.  That is  very poor service.  If I am in a flight transfer location in a foreign country, and my luggage does not come through, and the next leg of my trip for the cruise leaves in 30 minutes, I cannot wait 45 minutes to get through on the phone to an insurance person on how to deal with the issue.Lack of communication service via both Chat and phone by an insurance company recommended by Aardy is a very poor reflection on Aardy, as well as the insurance company.", "rating": 2}, {"title": "Excellent", "text": "From start to finish, everyone was friendly and informative!  I would highly recommend Aardy.com to everyone I know! Merrianne Kaubris", "rating": 2}, {"title": "Big problems with iTravelinsured", "text": "I had trip insurance with iTravelinsured thru aardvark. I have been fighting iTravel for >6 month to pay for trip interruption insurance while we were in India due to the quarantine restrictions imposed on our trip. USFIC the underlying insurance includes that as covered reasons. I find iTravel has been incompetent with numerous failures to follow their internal policies and refuses to honor the policy and we are still waiting to hear from the underwriter since iTravel has not been able to follow policies. Sorry we used iTravel thru aardvark. Seven Corners has an excellent reputation and honors their policies. Aardvark has not helped us with iTravel but did with Seven Corners,and aardvark still has iTravel as recommended. I recommend to stay AWAY from iTravel as I believe they are unethical and incompetent. I do not believe they should be allowed to do business.", "rating": 2}, {"title": "You Pay for What You Get", "text": "During the COVID19 pandemic my wife and I decided to leave Florida a couple of days early and return to New York since sheltering-in-place had been announced statewide.  Further, we were unsure what the situation with airlines was going to be though we did make arrangement to get back through Delta at a slightly higher costs than our original purchase. Having bought trip insurance through the Aardvark site, we tried reaching them to learn if anything could be recovered for the days of rental cancellation and incremental travel costs. No one at the company has yet to respond to our calls and messaging.  Fortunately, we had a Plan B that has helped us recoup the extra costs. Aardavark is great at packaging its insurance alternatives but not so hot with service.  Our advice: check out your options and be clear about what your expectations are before buying insurance from anyone.", "rating": 2}, {"title": "I am waiting 5 hours for a copy of my…", "text": "I am waiting 5 hours for a copy of my insurance policy  Was supposed to get it in two hours Spending to much time writing reviews", "rating": 2}, {"title": "Very difficult to understanding would purchase again", "text": "Very difficult to understand;  since we really need this coverage seems like you could ,are it easier to understand what your buying.", "rating": 2}, {"title": "They promised that I would receive my…", "text": "They promised that I would receive my policy in 2 hours. I have not received a confirmation of benefits.", "rating": 2}, {"title": "Received quote", "text": "Received quote. Called back to book. Price increased by $50. Agent said quote was mistake. Not pleased with changing numbers.", "rating": 2}, {"title": "Failure to verify customer information", "text": "I asked for a quote online and got an automated one.  My husband called the next day to ask questions of the person, Melanie, who had sent the automated quote of $1038, roughly, and she answered the questions and reiterated the quote amount on the phone.  My husband called back a day later and talked to Jamie, who told him the quote was now a bit less than the one Melanie had given.  My husband checked with me, and we decided to buy.  When my husband called back that same day, he was told that I had made a mistake on the final payment date on the auto quote form, that I had entered 2020 instead of 2022 on the form; therefore the old quotes were invalid.  A supervisor Aaron told him the new quote was in the mid $1600s.. I called Aaron to try to understand how all this had happened and how 3 different conversations had failed to uncover this error and to ask how we could now be sure the current quote would be honored and result in a valid policy.  The failure 3 times of employees to verify customer information and therefore failure to issue a correct quote 3 different times does not inspire confidence in your company and its employees.  Aaron apparently caught the error and was able to explain how it all transpired, but really your other employees need training, or a working brain with which to do a credible job.", "rating": 2}, {"title": "I requested some form of ID to show…", "text": "I requested some form of ID to show while I'm traveling by ship.  This was never sent to me.", "rating": 2}, {"title": "On line", "text": "On line, there is no opportunity to confirm application information before policy is issued", "rating": 2}, {"title": "not enough information on coverage", "text": "Date of experience: March 20, 2023", "rating": 2}, {"title": "Too many meaninglessness  \"follow-up\" …", "text": "Too many meaninglessness  \"follow-up\"  e-mails.", "rating": 2}, {"title": "LOve Aardy but not to much today", "text": "LOve Aardy but not to much today. Boo", "rating": 2}]