[{"title": "WILD pricing, shirts OK", "text": "The shirts came out are ok, VERY bunched embroidery. The pricing on this website makes no sense at all. It seems to change every day and it's incredibly frustrating. Their marketing team needs to take a chill pill and stop sending 100 emails per week. For us it's just not worth it to \"shop small\" anymore, our orders from custom ink have been faster and higher quality.", "rating": 2}, {"title": "Way to many issues of you getting my…", "text": "Way to many issues of you getting my logo right - you were supplied with a professional logo and you chose to change the colors?  Don’t ever do that. Then production time was long. Not as long as my other order that I’m still waiting for but long.", "rating": 2}, {"title": "Waiting almost one month after order…", "text": "Waiting almost one month after order placed, company keeps changing delivery date.Very slow production, always another excuse, concerned if we will even get order, finally cancelled", "rating": 2}, {"title": "THESE WERE THE lowest quality caps that…", "text": "THESE WERE THE lowest quality caps that I have encountered.  They are made in China.  The cap will not sustain a single washing. Better quality caps could be found in Dollar Tree, as I had embroidered years ago.  I ordered these caps as samples.  These caps were not the quality for samples to retailers.  I give these embroidered caps (1) star.  The remaining items ordered have been left in the box for nearly a year in March.", "rating": 2}, {"title": "A very poor company policy.  This company offers nice products for a…", "text": "This company offers nice products for a reasonable price, however they have adopted a policy whereas one cannot make a direct phone call and place an order.  This has put me in the terrible position of possibly not receiving my shirts in time for an upcoming show.  I will explain:  I placed my original order on Monday.  It is now Friday and my order is still not confirmed, and I will not know it it gets confirmed unless I sit here in front of my computer and wait hoping I will get a response.  The original problem occurred when I forgot to add my son's shirt size.  Each day, before I leave I read their email and respond before I leave to go to my knife making shop.  I do not have a computer there, so I can't receive emails until I return home.  I have repeatedly asked the rep to please call my cell phone to straighten out any issues.  I have yet to receive a phone call.  Each day that passes, which is now five days, makes it more unlikely I will receive my shirts in time for my show.  This is an extremely poor way to run a business.  If one of my customers wishes to speak with me, I am there for them no matter what time of the day.  I will answer my phone!", "rating": 2}, {"title": "Product delivery is too slow", "text": "The evaluation of the product can only be generally not as good as imagined, the most important thing is to improve the delivery speed of the product is really very slow", "rating": 2}, {"title": "Not great service", "text": "Not great service, maybe it was this rep but not a great experience", "rating": 2}, {"title": "Maybe for someone else, not for me..", "text": "Overall the product for someone else might be pretty decent, quality is good and embroidery is nice. The hat I originally ordered apparently discontinued mid order / was no longer available and that's where my issues start. My order was placed September 29th, and was expected to ship October 11th, on the 17th of October I emailed them because the order still had not shipped. They gave me a $15 credit for the inconvenience, and the hat didn't end up shipping until the 19th. When it arrived on the 21st, I was a bit disappointed in the fit of the hat, I assume its a one size fit all, but I'm not certain as I don't really know which product I ended up with due to the discontinued item thing. Either way, it's borderline unwearable as it's WAYYY too deep, essentially siting down to my eyebrows. It's also TIGHT, even with the clasp loosened it's still too tight - maybe I have a weird head but all of my normal hats fit fine. Overall I expect that had I received a different hat my review would have been closer to 5 stars, but the discontinued product, order delay, and fitment were a real disappointment for my first experience with this company.", "rating": 2}, {"title": "It’s ok", "text": "While the pricing and quality of the hat is OK,  my first impression was that the stitching was overdone the logo size proportion seems wrong and it just looks a little hokey. I was expecting it to look more subtle and like my actual design. The hat itself seems OK it does a little low. Not sure I would really come back to this place.", "rating": 2}, {"title": "Got It Right the Second Time", "text": "Got it right the second time, yet received the same email both times saying the shipment may be late.  The first had embroidery done in colors that didn’t match the graphic I sent.  The second time they sent a proof.   Wasted my time and my shirts didn’t arrive in time for the event I had planned to use them for.   Order well ahead of time if you are counting on receiving your order for a specific event.", "rating": 2}, {"title": "Can't call direct", "text": "Can't call direct. no # because of COVID? Get over it. Get phones and computers to work at home.Put REORDER on basket and looked good. 50 shirts, decent order. Go to check out and order almost doubles. Don't have time to play games. Waiting for CS call back. Do you want to be my shirt provider?", "rating": 2}, {"title": "It took 3 times to get my order right", "text": "It took 3 shipments to get my Order made correctly, and the last two shipments that you sent out were late by your own timeline. Beginning production or being shipped on the guaranteed delivery date. While your customer service team was fantastic, this is an issue that I feel should never have happened as the design clearly was black but twice you sent silver.", "rating": 2}, {"title": "Well", "text": "Well,  The overall experience it's really quite disappointing. I thought that I explained myself very clearly anout what i wanted on three different occasions to get my order correct. There was no proof to even verify, But I had to go through three times to get it correct. However the people that I were talking to were very nice", "rating": 2}, {"title": "I've ordered from Queensboro may times …", "text": "I've ordered from Queensboro may times before and I've never had a problem, until this time.  The order itself was perfect, all the items ordered were there and the embroidery was correct.  It was the lack of communication and the delay of the order.  It took almost 4 weeks for me to get an email, advising the order was going to be delayed, then it was shipped the following week. That email should've gone out 2 weeks earlier, in my opinion.", "rating": 2}, {"title": "lost new customer with bait and switch prices", "text": "Bait and switch pricing.   Every time I tried to place new order the cart didn't reflect the advertised prices. Slow to respond to emails if you get a reply.  Wasn't impressed with the fabric.  Expensive for the better quality  shirts. The embroidery was okay for the pricing.  Looking for a better company to deal with.", "rating": 2}, {"title": "Disappointed", "text": "I ordered 2 grab bags for the first time. I asked for the light colors because my logo doesn't show up on dark colors. The hats were a charcoal gray and the sweatshirts were a dark pink and orange. I wonder who is deciding that those are light colors. Fortunately the company refunded my money. The items are worthless to me. I would have been happy with any of the light colors. \rThe only reason I gav any stars was that they gave me my money back.", "rating": 2}, {"title": "What has happened to the Women's…", "text": "What has happened to the Women's shirts....Why are they all sized so small.  I have never encountered this issue when ordering with Queensboro. My most recent order I ordered 1 size larger than what I would normally wear; and every shirt I received is too small.  They are sized as though they are from some cheap china website; where they advise you to order 3-4 sizes larger than what you would normally wear.  I have never had this issue when ordering from you.  I will definitely think twice before placing another order.", "rating": 2}, {"title": "Everything I ordered came on time…", "text": "Everything I ordered came on time expect the shirts. They told me that the shirts were going to be printed a month and a week after I ordered them, that is ridiculous. I ordered back in early Oct, wont get shirts til after Thanksgiving.  Will not order from them again.", "rating": 2}, {"title": "You guys really lagged and didn't reach…", "text": "You guys really lagged and didn't reach out to let me know what the delay was. For such a small order i didn't expect a long wait like that but, they still came out good an i appreciate it.", "rating": 2}, {"title": "Orders Lost in Space.", "text": "Almost a year ago we ordered embroidered hats here. The Pandemic was blamed for a lost order and it was reinitiated. The order then came through nicely done, but weeks later than initially promised. They issued a credit to apologize. The credit was used for sweatshirts which came through flawlessly. Then they gave me a thank you credit. I used it to order 5 items - 2 hats, one knit hat, one polo shirt and one face mask. The 2 hats arrived a day late, but okay. When I checked on the rest, I got an apology and again the order was reinitiated. A week later, the knit hat arrived, but nothing else. Now, I am trying to find out was happened to the other items I paid for. There seems to be a problem with order fulfillment here.", "rating": 2}, {"title": "Shirts were too tight", "text": "The ordering process was a breeze, but when the shirts arrived they were stated as large and usually a large for me is just about right or a little big, these were very tight and more like a medium that had shrunk.\r Very disappointed.", "rating": 2}, {"title": "Backordered......", "text": "Not sure why it is that any company will sell items they do not have in stock? I always wondered about this practice = love the products, just don't like waiting 8 weeks for ball caps", "rating": 2}, {"title": "I was not very impressed.", "text": "I was not very impressed with the quality of the embroidery. It took three tries to get the order correct and acceptable. I was impressed with the efforts of customer service personnel in their efforts to correct the issue.", "rating": 2}, {"title": "It took so long to get the order…", "text": "It took so long to get the order correct.", "rating": 2}, {"title": "had to order 2 times since the color of…", "text": "had to order 2 times since the color of the thread looked washed ot on the first order. Has not been a good experience with this company so I will look elsewhere when I order shirts next time", "rating": 2}, {"title": "Company did not have it together, as concerns my order", "text": "It took a very long time to get my first order (30 days) , which when it came, it had a shirt that was wrong in it. I received the replacement shirt fairly quickly, and I appreciate that, but the overall time it took to get the shirts was not consistent with the communication I was getting from your end. I was told that there had been a wrong thread color used on my shirts and they had to be redone and that was the delay, but I ended up getting one of those wrong shirts anyways, which was replaced. It was not a bad experience, but frustrating enough to find another supplier here local. Overall it was about 5 weeks to get my total order completed. I understand mistakes can be made, but its a pain to deal with an out of state company, so I will just keep it local.", "rating": 2}, {"title": "I got my caps yesterday and rather…", "text": "I got my caps yesterday and rather disappointed in the quality of the stitching. Very thin stitching looks poor when I compare to other work I've had done at other companies.", "rating": 2}, {"title": "LONG WAIT TIME", "text": "Items are good and the customer service is responsive but just takes WAY for items to process and ship. Have had this happen a couple of times.", "rating": 2}, {"title": "Great company", "text": "Great company. I’ve used them for several years for many items. Their embroidery is great. After 15 years it still looks like new!", "rating": 2}, {"title": "No to happy", "text": "I don't want to go through it again I spoke to some one already and I did not like the out come.\r Thank you\rJonathan C Jablons President\r Coinwash Corp. / Coinwash.com", "rating": 2}, {"title": "I am very disappointed with our wait time and incomplete deliveries.", "text": "I am very disappointed with our experience with Queensboro. First, it took a very long time to get our initial order and it was not correct. I contacted the company and they said that a separate shipment had been made and that was probably the remainder of our produce. I waited about 4 more days for the additional produce and only received one more thing, not the three we were missing. I contacted the company again and they said they would make it right, also crediting our account to make up for it. I then had to wait 2 more weeks for the items. After two weeks only one more item came. When I check our account online it said that another package had been shipped out which came a week later. I don't understand why a company would would like that. You are making your customers wait a ridiculously long time for their product AND you are paying way more in shipping than if you would have just shipped it all together. I'm leery to even use the amount we were credited for fear of having issues again. I guess that's what I get for taking Facebook recommendations.", "rating": 2}, {"title": "Can't follow simple instructions", "text": "With clear instructions, the first shipment was wrong.  To their credit, they did work with me and get it right.", "rating": 2}, {"title": "Delivery delayed", "text": "Delivery delayed, Queensboro did not communicate about the delay until I contacted them.", "rating": 2}, {"title": "Good merchandise, long wait", "text": "You know we use your products mostly for work, so it can take so much time to arrive", "rating": 2}, {"title": "Takes Forever + Poor Quality", "text": "Frustrating that it takes so long, and the quality doesn't seem to be there.", "rating": 2}, {"title": "bhaiya mujhe kuchh kam De Do Na Mujhe…", "text": "bhaiya mujhe kuchh kam De Do Na Mujhe Kam Nahin Hai", "rating": 2}, {"title": "I got exactly what I asked for again", "text": "I got exactly what I asked for again! I love how easy it is order!", "rating": 2}, {"title": "Love the shirts", "text": "Love the shirts. Will definitely order more down the road", "rating": 2}, {"title": "Delivery was delayed", "text": "Delivery was delayed.  Jacket looks like a tarp sewn together.", "rating": 2}, {"title": "It took way too long to receive my order", "text": "Date of experience: June 16, 2022", "rating": 2}, {"title": "The order took almost 8 weeks...not…", "text": "The order took almost 8 weeks...not acceptable", "rating": 2}, {"title": "Takes way to long to receive the items.", "text": "Date of experience: October 16, 2019", "rating": 2}]