[{"title": "Still haven’t received my full order", "text": "Date of experience: October 23, 2023", "rating": 2}, {"title": "I did not appreciate the quality", "text": "The jewellery I received looked like the picture which I appreciated. But the quality was disappointing considering the price of the products on the website. The necklace I received broke after one wear, it wasn't pulled or dropped, it just broke out of no where. Overall the products feel a little cheap.", "rating": 2}, {"title": "I have bought a few of your pieces", "text": "I have bought a few of your pieces.  Most are awesome, but some have disappointed. A few bracelets gave come apart and one rings stone has fallen off, a lot actually", "rating": 2}, {"title": "I don’t get any answer", "text": "I paid shipping costs and I didn’t receive the jewels… I have written several times through instagram but I do not receive any response...I want to think that it is August and they are on vacation and they have not been able to answer me…", "rating": 2}, {"title": "I never received my package", "text": "I never received my package. I am so upset because the first order I placed I loved the jewelry.  The second time around I never received my package and there was no solution for getting another one in.   I am disappointed because I do love the jewelry.", "rating": 2}, {"title": "Looks fake, maybe scam", "text": "Well, it looks disappointing, I have ordered twice, but the quality of jewelry I received according to test results in an offline jewelry shop is not the same as stated at their website and on the marks (stated 17-18 k, the test has shown much less, around 1,7 in average for 4 items). After second order I did not get any tracking number and when I asked for it I was ignored twice. At the jewelry shop where I checked the items I was told that such items cost around $ 5 each which means they make money on the shipping cost you cover if you join as an ambassador because you just overpay the real cost twice. I have requested chargeback, because I think it's not a British company, their items are fake even when look good and in general it looks like another scam scheme.", "rating": 2}, {"title": "Is Vanessa Flair a legit company?", "text": "In July Vanessa Flair has been approached me by social media for asking me to become their ambassador. I accepted to try the products and I made my order which was charged for about 30£ when their site claims for free shipment. It wasn't free. This is the 1st red flag. They shouldn't ask the ambassadors to pay shipment when they make over 90£ order.The 2nd red flag is when I have discovered that the same products are being selling in another platforms for ridiculous low prices. This fact made me think that this company maybe is a scam.I also checked that the address in London they provide seems to be valid as many companies are housed there, but Vanessa Flair isn't registered in the official list of all of them. This is the 3rd red flag.A month passed away without receiving my order. Although the company has sent me an email that they have been informed that I have already received the package, I replied them that is not true and that they should fix this. Eventually they did.The jewelry I received are indeed gold plated but seems poorly made and faux that they don't justify the high price. I give 2 stars because I received my order at least.", "rating": 2}, {"title": "The webshop is selling products from…", "text": "The webshop is selling products from other companies, and the prices are really high for products that are originally between the 1-5 euro", "rating": 2}, {"title": "Necklace got discolored", "text": "I purchased a pair of earrings ,bracelet and a necklace..pair of earrings were okay. Necklace got discolored after 1st use.not worth for money", "rating": 2}, {"title": "Too long for delivery and a stone fell…", "text": "Too long for delivery and a stone fell off of a ring in less than a month from wearing it.", "rating": 2}, {"title": "I never received the jewelry", "text": "Date of experience: July 05, 2022", "rating": 2}, {"title": "Pretty pieces but most definitely not…", "text": "Pretty pieces but most definitely not worth $99 + it’s pretty much stuff you can get at a regular store for $20 .", "rating": 2}, {"title": "The jewelry is expensive and it…", "text": "The jewelry is expensive and it tarnished. Plus the shipping is too much!", "rating": 2}]