[{"title": "Delays", "text": "Instead of couple of days, which is mentioned at website - I was waiting my docs more than 1.5 weeks. And no apologies, no letter about the delay - nothing at all, till I start to write an email with a Reqvest of the status of my docs.", "rating": 2}, {"title": "Lacking Post-Purchase", "text": "I hired this service on about a week ago and payed 2 times for 2 differente (expensive) services. I was well received by their staff but after sending the documents they requested, I was told I have to wait 4 weeks to know if the documents are correct.Makes no sense to me - however, their website is cool", "rating": 2}, {"title": "banking account", "text": "I've ordered receiving 2 NIF, for my wife and me, and opening a banking account (BANK_ACCOUNT22020302) at Novobanko. The NIF were issued fast and without any problems, but with opening a banking account was a problem. My account wasn't opened, so I asked my bank manager about it. He asked me about some documents, but when I sent these documents, he said that they don't accept it. Also, he didn't say what document they required. I asked my manager at the e-residence about what document I needed to send, but they didn't help. In the end, the E-residents manager said that the bank doesn't open accounts for people from Russia. E-residents didn't do a refund, and I'm without a bank account...If you didn't do a job I think you need to do a refund, but it is not about e-residence.com", "rating": 2}, {"title": "NIF - yes, bank account - no", "text": "You can safely apply for a NIF, but don't even think about opening a bank account there. Firstly, if you want to open a family account, they will try to divorce you into two separate accounts to get more money. Secondly, after providing the documents you will have to make enquiries to the bank yourself to find out the status of your application, as even after requesting E-residence will not contact the bank and will just tell you to wait for a mythical answer from the bank, despite paying for their services.", "rating": 2}, {"title": "two months waiting", "text": "Unresponsive for two months Waiting for two months for the NIE I had to cancel in the end because it was taking too longBut at least they gave me a refound", "rating": 2}, {"title": "They are fast-Updated", "text": "*Please scroll to bottom for final update and reason I changed my rating.They are fast. I appreciate thatI am going blind and the document was barely legible and I asked for clarificationFrom Mark: \"What do you mean not readable? This is not enough clear for you?\"He sent a PDF with an arrow pointing to NIF number. Would like to know how to cancel renewal at client's discretion. Can't find that info on website.Overall, this was a fast and easy process and if you need a NIF right away, this is a surprisingly speedy experience and the team members respond to emails quicklyRe: response below: never got info on cancellation.Update:29, December 2022 I was sent email stating that I would have to have a current residency in Portugal and remove e-residency as my representative by uploading all forms to them.\"To cancel our representation please provide us your updated NIF with portuguese address or new representative.\" I am asking them to remove themselves as my representative.I just needed my NIF, which I paid for and received.I do not need this company charging me yearly for services I am not getting/requiring.We have no idea when we will have a permanent address in Portugal since our business in the US is far from completed.I have requested they terminate what they call, representation, and do not charge my credit card againI get nothing out of it.I am downgrading my rating. This is beyond frustrating and will have to take steps with the credit card company to avoid recurring charges.If your situation in your home country delays your relocation, please be aware that cancelling recurring charges and removing them as your representative is going to be challenging.Your credit card company may have to get involved.I recommended them for fast service. Not so much on the recurring charges that do not provide any additional services to you.", "rating": 2}, {"title": "Took 2 months to receive all documents", "text": "I got my NIF in 7 days, but had to urge support many times to get my password for the finance portal account. Even then, it took 2 months. The paper mail came to my foreign address and not to the tax representative's address like I was lead to believe. You need the password to be able start business activity in Portugal so this was very unpleasant. I recommend a different service.", "rating": 2}, {"title": "Payment is fast", "text": "Payment is fast, and the provision of services is very slow, you can write for months to achieve a final decision on the paid service.  In fact, only half of the service was completed and you have been trying to finish it for a month.  They don’t answer emails at all, in messengers they answer once a day, and then at best (", "rating": 2}]