[{"title": "Poor Experience", "text": "The insurance agent tried to influence which Medicare Advantage Plan I chose a couple of times, even though I told her that I had already done my own research and decided which plan I wanted to sign up for.Also, I still haven’t received a confirmation by email or regular mail confirming that I am actually signed up for the plan I wanted.The Agent’s computer kept crashing, and she had to call me back multiple times.", "rating": 2}, {"title": "The word to describe the beginning of…", "text": "The word to describe the beginning of the call is bait cause they say $145 of extra available cash, food, or cards to spend . I take the bait cause I'm needing help but the end of it they sneak in two words in a sentence and actually have permission to charge u more out of pocket and I'm already paying out of SSI check . Can't opt out till 1 year but maybe 6 months idk . I hope the $145 is available cause I already have full coverage and it sounded like less coverage on phone cause they can be really tricky with words", "rating": 2}, {"title": "I’m new and all is good", "text": "Date of experience: October 23, 2023", "rating": 2}, {"title": "I haven't received anything yet .Also I…", "text": "I haven't received anything yet .Also I can't  use your insurance until August 1st Betty Casada", "rating": 2}, {"title": "She didn't take all my medications and…", "text": "She didn't take all my medications and didn't compare any other insurance. She was more excited to get me signed on for her bonus.", "rating": 2}, {"title": "wasted to much time listening to…", "text": "wasted to much time listening to someone drone on.  You should send an email and let us read it and agree or not that way.", "rating": 2}, {"title": "Tell me who exactly who I am dealing with. I thought l had called boomer benefits.", "text": "I thought I was dealing with boomer benefits. Imagine my surprise. When I started getting calls from ensurem.", "rating": 2}, {"title": "I was called initially by a female…", "text": "I was called initially by a female representative who reassured me and was very aggressive(pushy) in insisting that I speak with a agent to recieve added benefits that I was possibly not aware of even after I informed her that I was pleased with the plan I already have as it met all of my needs. As I reconsider my decision to join Ensurem moving forward I'd like to return back to my initial state insured, please and thank you.Robin Davidson", "rating": 2}, {"title": "I have nothing to say about my review", "text": "Date of experience: March 15, 2023", "rating": 2}, {"title": "Not sure what went wrong with the rep", "text": "Not sure what went wrong with the rep. I communicated with.She dropped the ball.Was to have Aetna coverage effective 3/1/22. Did  not receive a card or paperwork, so I called Aetna+ was connected with another rep. who reported that I was not in the system.Signed up with this rep.Did receive card+ paperwork but then discovered this was the wrong plan for me.After speaking with rep.#3, I believe I now have the correct plan to meet my needs.I do have serious health issues+ started this process @ the beginning of 2/22.Thank God for an excellent rep+ God who helped clear up this mess.Coverage began on 4/1/22.", "rating": 2}, {"title": "Nothing has been done all I get is…", "text": "Nothing has been done all I get is endless calls or mail about nothing that's important or matters", "rating": 2}, {"title": "They sent me to a Medicare Advantage…", "text": "They sent me to a Medicare Advantage plan that I'm not familiar with when I tried to call Edna they wasn't familiar with that company either", "rating": 2}, {"title": "I was told of benefits that are not available", "text": "Was told of benefits  that are not available", "rating": 2}, {"title": "No follow up", "text": "No follow up. I had to pursue the insurance companies myself to finally get ID cards and confirmation. Not impressed.", "rating": 2}, {"title": "It took too long on the phone.", "text": "Date of experience: December 05, 2022", "rating": 2}, {"title": "Nithing to say bad or good", "text": "Date of experience: September 29, 2022", "rating": 2}, {"title": "Have not received any documentation…", "text": "Have not received any documentation about my policy yet.", "rating": 2}, {"title": "Did not get a call back as promised.", "text": "Date of experience: March 30, 2022", "rating": 2}, {"title": "False information", "text": "Date of experience: July 14, 2022", "rating": 2}]