[{"title": "Customer Support unhelpful", "text": "I ordered a brand new Rado watch with warranty from a seller in the USA. The watch arrived timely and brand new as promised, however the warranty card wasnt filled in or stamped so when I went to my local Rado shop they told me the 5 year international warranty is null and void unless signed/stamped by the seller. I have been in contact with Chrono24 ever since to try and get this rectified but no luck so far - other than being told to contact the seller directly. What is the point of using a broker like Chrono24 when they then ask me to fix it without them being part of the process?", "rating": 2}, {"title": "There are very visible spots on the dial and the seller says this is normal.", "text": "There are defects on the watch screen and the seller does not want to acknowledge it.", "rating": 2}, {"title": "Awsome site but unable to use", "text": "Awsome site and experience but unable to use.Tested functionality and had several sales as a Private Seller (max 10 listings). Was gathering all the information to register a dealer. It looked as a great opportunity as there are not many USA dealers . .  . and SURPRISE! A requirement mentions the need to have 50 watches worth $2,000.- each. I have around 2,000 watches but price ranges $200 to $1,000. I see a lot of listings in that range but the restriction mentioned above just killed my plan.", "rating": 2}, {"title": "Ways to improve Chrono 24", "text": "chrono 24 is pretty intrusive in the dialogue between buyers and sellers.  Dont like the emails from Chrono 24 asking if a request to buyer led to a sale.  Dont like Chono24 charging sales tax simply for making an introduction.  happy for you to earn your cut, but tax is not necessary for a sale between parties in different states so long as you keep it between seller and buyer and position Chrono as a broker or introducer.  ", "rating": 2}, {"title": "Seller wasn't very communicative", "text": "Seller wasn't very communicative.  Purchased and paid for watch on May 1, seller didn't respond or ship until May 13.  I reached out multiple times to confirm it was shipping or to cancel the order. I didn't get any replies until about 2 weeks later when suddenly it was shipped.  At least once it shipped the watch was in good-condition, well packed, and as advertised. ", "rating": 2}, {"title": "They are nice when you are buying…", "text": "They are nice when you are buying something, but beware: if there are any issues later they will not be so helpful.If you complain about them on trustpilot they will suddenly show an interest when they had brushed off the matter before and offered NO HELP AT ALL.", "rating": 2}, {"title": "DHL are great Tax collectors too.", "text": "This is the last time I will be using Chrono24 because every time DHL gets a chance to collect extra revenue they certainly will.The Tax should have been $104 but instead I was forced to pay $238 for their troubles.On eBay you know exactly what it's going to cost you BEFORE you pull the trigger and no greedy freight company has a chance to take a slice as well.The other reason why I find Chrono24 useless is 98% of the sellers are asking outrageous prices even for commonly available new stock. eBay has the same problem but at least there's no reserve sales and no DHL to gouge you.Sorry, I'm not using this platform again.", "rating": 2}, {"title": "Poor customer experience. ", "text": "My purchase was delayed by days because  Chrono decided to authenticate my identity. While security is important - if you feel the need to take extra precaution it shouldn’t be in the middle of a transaction. I had bought two watches days before without having to take these steps. Your process is broken. It created a poor customer experience that could have reflected poorly on your seller as well. Be better. ", "rating": 2}, {"title": "So and so ", "text": "Overall they were quite responsive. However, when I express a concern they were unable to help me. In particular, they quoted that a specific term was written in the general terms and conditions and when I told them to send me where exactly it was stated they failed to do so since it was not stated anywhere.", "rating": 2}, {"title": "Purchased a watch two weeks ago and the…", "text": "Purchased a watch two weeks ago and the seller told my they would send me an appraisal so I can get the watch insured. Still haven’t gotten it and they keep telling me their system is down. Now I’m taking the watch to get authentic because now this seems fishy. I might be returning this watch after today. ", "rating": 2}, {"title": "I needed your attention for a quick…", "text": "I needed your attention for a quick payment - didn't get any response in the upcoming 24 hours after sending the payment. Then I didn't get a refund for over 7 days.", "rating": 2}, {"title": "Beware of hidden commissions", "text": "Beware of hidden commissions. If you agree to purchase a watch in a foreign currency, Chrono will bill you in your local currency, but what they don't tell you is that they take a 2.5% commission on the exchange rate, in my case this added over $800 to the purchase price. Nowhere does Chrono24 make this clear, it's a hidden commission that the seller has to pay.", "rating": 2}, {"title": "EBISU SA is a scam dealer on Chrono 24 --…", "text": "EBISU SA is a dealer on Chrono 24 -- stay away!  The worst.  Holds company out as Switzerland based but sells/ships watches out of Hong Kong.  Claims Box/Papers original, but these are shipped separately from a Switzerland address.  These guys are scammers.  Stay away!  Chrono does nothing to stop or police their deceptive business practices.", "rating": 2}, {"title": "Many nonsense offers, shipping is a hastle", "text": "-Got many nonsense offers.- It's too much trouble to get accurate shipping quotes in advance. Chrono24 could offer a shipment service (with transparent prices). I've lost quite some money on the shipment in the end.- Received money by Paypal, which cheated me out of >5% for transaction costs, and kept my money locked for 21 days!", "rating": 2}, {"title": "Customer service is non existent", "text": "Customer service is non existent. The seller whom was wonderful but in Italy, and I had major customs issues with Fedex which took over a month to solve. Assistance from Chrono was non existent. The seller and myself contacted Chrono customer service and the only response was a  generic message via email. I spent over $5000 USD on a watch and zero help. This site is basically eBay focused on watches. Do not expect any help if there is a problem.", "rating": 2}, {"title": "Dealer Great - Chrono24 Not So Much", "text": "Dealer great, but Chrono24 was a challenge.  For example I forgot my password and had to reset it.  Two minutes tops elsewhere, but Chrono24 it took hours.  In fact I ended up just registering as a new user with a different email address.  Then while I paid immediately my credit card Chrono24 sent me an invoice.  Very unnerving when you have just authorized a several thousand dollar purchase on your credit card.  Handy for getting pricing but Ebay is better.", "rating": 2}, {"title": "Awful", "text": "Awful. I was insulted by a rude and fraudulent seller after I refused to pay using a sketchy external wire transfer that they requested. Then I was threatened by customer service that they would suspend my account. No need. I’ll gladly just stop using the platform, myself. ", "rating": 2}, {"title": "Unfortunately the don’t except military…", "text": "Unfortunately the don’t except military id witch the government has give and you can travel in EUROPE. They let you buy a watch but not sell 🙄", "rating": 2}, {"title": "It took nearly a month to receive the…", "text": "It took nearly a month to receive the watch. It was held up in customs and required duty and taxes, which were not explained to me at all to help me through the process. Upfront communication from your company would have greatly assisted. I finally had to file a claim with UPS Before it was released from the warehouse in Philadelphia after a week and a half of just sitting there.", "rating": 2}, {"title": "Won't be buying from Sea Wave Diamonds again", "text": "Received Rolex with a significant dent to case, it would need laser welding vs simple polishing.  The images on Chrono24 obscured and seemingly blurred that area of the damage. After Sea Wave Diamonds acknowledged the damage, they offered a free repair if I flew on my own dime from Austin to New York.", "rating": 2}, {"title": "Too risky purchasing an expensive watch thru Chrono24", "text": "Chrono24 provides no added value beside listing resellers. The watch I got has a problem with its power reserve and I was told to figure this issue out with the vendor directly, who asked me to ship it back. That would make my purchasing experience pretty bad.", "rating": 2}, {"title": "The purchase using Chrono24’s escrow…", "text": "The purchase using Chrono24’s escrow service was awful. If you’ve never used an escrow service before (which I hadn’t) they cost money, which isn’t advertised beforehand. I sent my payment and it arrived in their escrow account a week later, minus $470. I spent days going back and forth with them providing evidence from my bank that I had sent the exact amount requested, and they argued that I had either sent the incorrect amount, or sent it in the incorrect currency (neither true, both shown by my bank to be done correctly) trying to contact them by phone was fruitless, they never answered. Emails would be responded to though. Finally they resolved the issue, while still maintaining this was my fault somehow. I will not use Chrono24 again. Much prefer to go straight to the dealer.", "rating": 2}, {"title": "Wiring was missing, with no answer or solution", "text": "My wire was missing for a solid week, passed the 2-3 business days Chrono24’s website claims it takes to process. My bank was able to confirm the wire was received by Chrono24s bank within 1 business day. I provided the wire’s transaction ID, along with the confirmation code received back from Barclays Bank once they received the wire. Customer Service was responsive by phone when I’d call, but could never provide me with an answer. Customer Service kept claiming to escalate the issue. But day after day, nobody had an answer, solution or even a timeframe of when I can expect a resolution. Being that this was my first purchase it was a very unsettling experience.", "rating": 2}, {"title": "Once is enough.", "text": "I bought a watch from Chrono24 which was misrepresented as being in the US but was not. Worked out okay since the watch was fine.  But trying to sell on their site was disappointing to say the least. Bottom feeder offers abound and what Chrono24 describes as “ghost” buyers are even worse. They negotiate, accept a counteroffer, then disappear. Several emails to Chrono24 were ignored.  Finally I called and got a rep who admitted the ghosts were a problem but had no solution other than “we are working on it.”  Also it appears that Chrono has no system like eBay has of rating buyers and sellers. Finally, in spite of my wanting to immediately remove my watch from their site, I was told that I had to wait until the listing expired. Never again!", "rating": 2}, {"title": "I'm not too happy with this purchase", "text": "I'm not too happy with this purchase. She is smaller than I expected. The blue wristband transfers its color to clothing. I suspect if I send them back, I will not be able to recover the customs fees paid. Quid?", "rating": 2}, {"title": "Import rules", "text": "Extremely disappointed that the band was not included. There was a warning but I checked online and it seemed to be alright. I can, and did for another $330, buy an alligator band in California but you won't ship it?!?I should be reimbursed $330 or that amount should have been subtracted from the original price.", "rating": 2}, {"title": "Paid for a $10K aud Rolex via credit…", "text": "Paid for a $10K aud Rolex via credit card - CBA account debited $10K immediately.  Email back from Chrono24 saying for security reasons they will return my $10K in 3 to 5 days.  So Chrono24 have my $10K for 3 to 5 days - thats how they make money, not brokering watches", "rating": 2}, {"title": "Lost my sale because Chrono24 was…", "text": "Lost my sale because Chrono24 was unable to answer buyer's basics questions and so quiet when asking them advices to close the deal.Otherwise Chrono24 still spaming you by email everytime you chat with a seller for no reason.", "rating": 2}, {"title": "Expensive and no IT improvements", "text": "Very expensive for the service they provide to sellers. The filters could be improved to auto select based on a buyers preference, especially the auto-filter to remove unavailable watches. The response from IT support took slightly longer than expected and resolution was not satisfactory. I reported a listing as incorrect and it was declined 😕. I gave some suggestions on pricing for lower and upper end market but no change was implemented. Overall, Chrono24 has garnered a large audience of dealers and buyers but there are other options and Chrono24 has ways to go as a cost effective digital marketplace for watches. ", "rating": 2}, {"title": "Where is my agreed 2nd part-refund????", "text": "Where is my agreed 2nd part-refund????How long does it take you & your system to respond?Seller has contacted you twice & assured me that the 85 Euro refund is being processed.Meanwhile, nothing, nada, zip.", "rating": 2}, {"title": "I have yet to receive my refund", "text": "I have yet to receive my refund for a watch I returned in the exact same condition it was received and well within the alloted time. I received acknowledgment from the seller that he received the item back from me and he stated \"Chrono24 will automatically refund you within the next couple of days\". That was on 22 December and it is now 2 January. Even with Christmas and New Year's holiday it does not take this long to electronically refund a credit card.", "rating": 2}, {"title": "My order went very well ,tracking the…", "text": "My order went very well ,tracking the item was great ,contact company at ant time was very good , The one thing I was not happy about was I could not pay by credit card , I am not a computer person I am from a different generation . Kind regards Jim Cunningham", "rating": 2}, {"title": "Lot of paperwork, when you least expect ", "text": "In the past few months I bought three watches and sold one through Chrono24 and everything was normal, no muss no fuss.Recently I sold a second watch and then the problems start: four days in a row they ask for documents and/or mail to check my address and bank accounts. Firstly photos weren't good enough, then they needed something else, day after day, always some kind of problem (I have every email). They say they need to do that kind of scrutiny because of money laundering laws and theirs payment service provider, same firm as in my first transaction few months earlier, that went without problems.Ok, first, did you have to wait for the actual transaction to request documents for verification? Second, selling a 300-euro watch is indeed some serious criminal, money laundering activity...Finally, regardless of the laws and the fact that they do not send me the money paid for the watch that was immediately sent and reached the customer, they promptly collected their commission while the correspondence was going on...Basically, be careful with them, I'm not their user anymore.", "rating": 2}, {"title": "Delayed verification", "text": "Delayed verification. Unfortunately, had a bad experience with this transaction. Purchased a piece for $5k, and the verification process took 9 days to be completed. I had followed up with Chrono24 several times, but there was no explanation beyond increased volumes of transactions that needed to be processed. Which is understandable, however, my seller mentioned that subsequent deals after mine had went through. My grading is based on the transparency of communication from Chrono24, and not feeling reassured as my passport information was in limbo for over a week. The transaction eventually went through. Seller was great.", "rating": 2}, {"title": "The watch (Casio Duro Batman) was…", "text": "The watch (Casio Duro Batman) was delivered intact and in time. No issues there. However, After recieving the watch I found out that Amazon.com was selling the exact same watch at nearly half the price compared to the one I got from Chrono 24. So disappointed. Maybe I should have researched a bit more on my part before buying from Chrono 24. Please do your research before buying from them. You might get the same thing at a lot less.", "rating": 2}, {"title": "Breitling Chronomat 41 Airborn", "text": "When I opened the shipment with my watch, the Breitling Chronomat Airborn, it was a positive experience. The watch is neat and without scratches and scuffs. After I had set the date and time, I had to screw the crown back towards the watch case, and here I was very disappointed. The thread in the crown and crown tube is defective. I have shown the watch to a licensed Breitling watchmaker and was told that both crown and crown tube need to be replaced. It will cost me 2000 DKK (approx. 270 EUR) if there is nothing else wrong with the watch. On the advertisement for the watch it said that it-is in very good condition and it-is wrong.", "rating": 2}, {"title": "Without realizing chrono required 60…", "text": "Without realizing chrono required 60 minutes to complete payment transfer i had to pass on this purchase.   I think 24 hours is reasonable, not 60 minutes.", "rating": 2}, {"title": "Seller did not fill out duty forms…", "text": "Seller did not fill out duty forms correctly and would not resolve issue. duty fee for purchase should be approx $50usd, it was charged at $340.  Seller needed to contact DHL but would not. After marking 4 calls to DHL I had reduced to $89.  No way through Chrono24 to dispute and possibly be refunded the $39 overage.", "rating": 2}, {"title": "The seller said the watch was unworn…", "text": "The seller said the watch was unworn and it was worn, it came with a different strap and the tool to set the moon, didnt come in the box.", "rating": 2}, {"title": "I was charged a 60 dollar foreign…", "text": "I was charged a 60 dollar foreign currency transaction by my credit card company for this order. I'm particularly upset because there was no indication this was going to happen before I placed my order. I've used the internet to to business with companies all over the world, but somehow Chrono24 is different, even tough I was buying from an American dealer. I contacted Both Chrono24 and the credit card company, and neither was helpful. Both are very eager to say they value me as a customer, but they won't do anything to actually show it. Bottom line seems to be that they both have me over a barrel, and they're going to stick me with this 60 dollar fee. The other bottom line is neither one is the only act in town. I've already stopped using the credit card, and I think I'm going to make my next watch purchase elsewhere as well. I am a member of the NAWCC, and I plan on letting my fellow club members know as well.", "rating": 2}, {"title": "Delivery protocols not communicated…", "text": "Delivery protocols not communicated clearly to courier, who just left the package and left. Given the vaue of the item, there should be a verification process before package is deemed delivered and accepted. This needs a lot more work!", "rating": 2}, {"title": "Chronos is 2 geared towards the seller…", "text": "Chronos is 2 geared towards the seller . The seller cancelled the order when I had paid the escrow snd put the watch for sale at higher price then told me I did not pay on time .which was untrue . I hv bought extensive watch’s on eBay once a deal is done it is done .", "rating": 2}, {"title": "Overall good", "text": "Overall, I had a good experience, but it should be clear what we have to pay for tax and the courier company. In my case, it was 20% of the tax amount which were tax was small, but the courier company was double the tax. And the watch band size should be mentioned. My watch band was too small, but thankfully it fit my wrist", "rating": 2}, {"title": "Escrow Service left a lot to be desired", "text": "Once again the escrow service provided was poor. I had to make six international calls to get a response from chrino24", "rating": 2}, {"title": "My wire transfer was rejected on your…", "text": "My wire transfer was rejected on your side, caused a delay and forced me to change payments. Seller was understanding and in the end got me an awesome watch.", "rating": 2}, {"title": "Watch was sent to my billing address", "text": "Watch was sent to my billing address, not my delivery address. Vendor was not given the delivery address by Chrono 24, despite purchasing 2 other watches in the last 3 years that were directed to the delivery address.", "rating": 2}, {"title": "The watch I ordered is not functional", "text": "The watch I ordered is not functional. It unwinds every 3-5 hours. I raised this with Chrono24, all they did is send a note to seller. The seller sent me a one-liner, and no further response, neither from seller, nor chrono24. I was always skeptic about chrono24 and this was my first purchase. I am glad I learnt my lesson with a ~200 cheap watch, never going to, nor would I ever suggest buying good timepieces from chrono24.", "rating": 2}, {"title": "i am happy with the watch but...", "text": "i am happy with the watch, however the dealer had posted pictures of the watch, one of which was the back case which pictured writing on it that said \"cartier international service\". When i questioned this after receiving the watch he said yes, thats why it came with the service report. i said it didnt come with any service records. he said he would check and sure enough, he then indicated he was wrong, it wasnt serviced by them. i tried to be nice and suggested since the tag indicated cartier service it would justify a higher price for the watch and since that was not the case, perhaps some adjustment in price was warranted. i even told him i will keep the watch either way, but he could do what he feels is fair. His only comment was that since he didnt advertise the cartier service it was not false advertising and no credit would be given. i of course disagreed as the sticker, however it got there, was obviously advertising the service. when i received the purchase report from chrono 24, it indicated i overpaid by 17% . if i recall over $500. a pity because i and my wife love the watch.", "rating": 2}, {"title": "The watch was for sale directly from…", "text": "The watch was for sale directly from Chrono24.  It was advertised as unused/new and without signs of use.  However, there were scratches on the back of the watch.  When I look through the advertised pictures, they can also be seen, now that you know they are there.  It could also look like dirt in the picture, but unfortunately it's scratches 🙁 Not ok for a watch in that price range!Besides this, the communication, the shipment and the packaging was a very good experience.", "rating": 2}, {"title": "2023 January unsuccessful purchase of a big deal", "text": "The staffs who answer my query by phone and email are very helpful and polite. They have tried to find alternative solutions to problem arises .The response time is reasonable.The information provided by the seller was not thoroughly checked by Chrono24. There is a marked discrepancy between the description and the actual watch in turns of the condition of the watch.The refund payment of the cancelled purchase is too long.The status of the refund is not known by any staff in Chrono24 .They explained that the refund is being taken care by an independent financial company. Therefore Chrono24 staff is not able to do anything to help.It’s already 3 weeks counted from the date of watch return and 2 weeks counted from the said refund initiated.I am still waiting for the refund. It seems that there is no one who follow up on the status and progress of refund.", "rating": 2}, {"title": "I was disappointed in the shade of…", "text": "I was disappointed in the shade of blue. So much darker than what was shown. I am not sure if the serial number was entered wrong.The good news is I have learned to like the watch.I did need to take the watch to a jewelry shop first thing to set the date and time. The crown was out and spring loaded so An expert needed to correct.", "rating": 2}, {"title": "I want to sell my watch there", "text": "I want to sell my watch there. They ask me to upload a photo of my id card. I uploaded my residence permit, my id card and everything is rejected. now they ask for my passport. Are they just collecting all kinds of people's ids?", "rating": 2}, {"title": "Process for selling is convoluted.", "text": "Trying to sell a watch on here is like platting fog. No guidance provided on steps needed and terrible communications.", "rating": 2}, {"title": "How come Chrono24 let vendor sells…", "text": "How come Chrono24 let vendor sells non-working watch without describing or noting it in the descriptions or state of condition? There should be a category stating “Working or non-working”. It is so deceiving and disappointing to receive a non-working condition.", "rating": 2}, {"title": "Hello", "text": "Hello, the product was delivered but the invoice wasn't.  Also the product wasn't as you posted on the site, I mean the product was fabricated in 2022 and you posted that it is fabricated in 2023.Thank you!", "rating": 2}, {"title": "Great portal, but hidden fees if 2,5% at check-out", "text": "Portal is fine and check etc is smooth.Also like how app and web seamlessly merge.However, Chrono24 is really using some dirty tricks to boost their revenue.My watch was listed in Euro, the price was negotiated in Euro, yet as the last point in the check-out, Chrono24 converts the Euro amount into local currency, effectively invoking a 2,5% price increase, which is not described anywhere.Nowhere in the Chrono24 Terms and Conditions (T/Cs) is this practice described, nor mentioned that this needs to be accepted.Further, under EU legislation - Payements Service Directive, the merchant must present the end user, the consumer, with an option of which currency to use, in case the merchant is using “DCC” - Dynamic Currency Conversion.I have had many interactions with Chrono24 on the matter, but they keep blowing me off with the same answer.When calling their customer service, they acknowledge the practice and the frustration it causes - but also revert to a memorized sentence from management: “you are free to abort your purchase”.This is as mentioned the last step in the check-out, and at that point your are as the buyer totally committed.To me the above is an example of an awful business practice, and one I think will eventually be back to bite them in the a***.Adding to this, that EU Legislation is not respected, I doubt I will be using Chrono24 for my next watch purchase…", "rating": 2}, {"title": "I was charged tax in Dubai which was…", "text": "I was charged tax in Dubai which was total surprise hence very disappointed ", "rating": 2}, {"title": "Two stars for the watch being as…", "text": "Two stars for the watch being as advertised but I agreed to the price of $699.00 based on getting the watch in an actual watch box and an extra link. The seller charged $48.00 for shipping and spent $10.20 for stamps on a recycled box with the watch in a plastic bag inside. He didn't even insure the watch for the purchase price. The seller was a cheapskate and I expected better service as promised by him. Since the watch is a gift for my Husband, I don't mention this to him, I want him to love the watch. I had to spend extra money to buy a watch box for presentation. Thank goodness the shipping gods got the watch here in one piece because it was not this seller that made that happen. In the long run, I told Chrono24 about my issue and they had nothing to say, they just weren't able to address it with a solution. I was lucky to get a nice watch and I will make sure my Husband has a nice gift but no thanks to this seller or the website.", "rating": 2}, {"title": "Useless employees", "text": "I left several messages for them to call me. I emailed them several times as well. They only emailed me back on the 13th day of my trial period, useless... the seller was good.", "rating": 2}, {"title": "Can't make a payment without a phone number issue", "text": "Had an issue with the transaction, it wouldn't take my payment and I had to call 3 times to figure out the problem. Apparently a payment can't be made unless a phone number is in the system, which wasn't apparent when payment was submitted over 10 times. it made for a very uncomfortable experience as I was in person with the vendor trying to make the purchase, and had to come back a day later to complete it. This should be fixed in their payment processing system or at least messaged when a payment doesn't go through. Embarrasing!1/6 - Thanks for your feedback below, I was not referring to the process of doing a phone verification on purchase which we all agree with. The issue is that your system doesn't communicate this as a requirement and just stops the process of purchasing.  You need to add a step that if the purchaser doesn't have a phone number entered, asking them to add it so the purchase can go through. It's a system problem.", "rating": 2}, {"title": "Item was not as described in the…", "text": "Item was not as described in the listing.  There was a gouge in the bezel that was not indicated in the description", "rating": 2}, {"title": "I bought a watch from you and I did not…", "text": "I bought a watch from you and I did not like it, but I bought it from this site at the cheapest price and very good quality mrmarkit.com", "rating": 2}, {"title": "Cuban chevy from 50's has more genuine…", "text": "Cuban chevy from 50's has more genuine parts than a watch that I purchased.", "rating": 2}, {"title": "Protect the seller first", "text": "Purchased a Rolex for my wife as a birthday gift and it did not work when i received it. Contacted Chrono and the seller and was advised i could return the watch for a refund or repair. I cancelled the sale and returned the watch with the understanding I would re-purchase if the watch was found to be easily repairable-I wanted to give the seller a chance to make things right. The seller advised it was a simple repair and i purchased again. Shortly after giving the watch to my wife it stopped working. The seller suggested she wasnt wearing the watch enough so we increased the use and the watch seemed to function a bit better-stopping less frequently. We bought an auto winder as well.  I own a 1984 Pepsi GMT so I am familiar with the perpetual movements and gave the seller the benefit of the doubt that the watch was completely serviced and would improve with use. This did not happen and i let the seller know. Fast forward and since I am 6 months out of warranty the seller TNS Diamonds wont even return my emails and Chrono said Too Bad-you are out of our warranty period so nothing we can do. Oh -and you cant leave a review since those are only allowed to be posted within a 14 day period of the sale-what?? I would imagine almost ALL reviews within the 14 day period would be great if the product is shipped and looks anything like expected. Most reviews containing negative feedback would be generated AFTER such a small window and I am guessing Chrono knows this-this the VERY merchant protective policy. I understand I am not in warranty and nothing legally can be done BUT, I warn future customers to really consider what recourse you have when you decide to try and work with the seller and resolve the problems. My advice is RUN away as quickly as you can if the item you purchase has a problem. If you have the EXACT ISSUE that was promised to have been resolved outside of your warranty YOU will be left paying for the repair.", "rating": 2}, {"title": "Checkout on the platform was a complete pain in the bazooka!", "text": "Checkout on the platform was a complete pain and difficult due to credit card blocks and this being an international, non US based company. My order was cancelled due to lack of availability on Chrono24 side. I replaced the order after hours of customer service calls and they did something on the back end to help. The seller (My Watch LLC) was the most unprofessional, disgusting individual EVER!! I cannot believe that someone would be so snappy, short, and disgraceful to a customer, yet alone someone spending over 20k sight unseen online. Seriously?? I ask questions and I should have the right too, but DO NOT COME AT ME when I do!!  I have every right to ask questions before, during, and after the transaction.  Would you smack a child when they took their first steps because they asked questions?? The seller probably does, but this is not the place to berate a client.For example, the watch was advertised as full box box and papers, new, unworn. I expect that to be exactly like it would coming out of a Rolex store. NOPE! Not the case here. It was sized down to a very small wrist when I got it. It did not have the plastic bezel cover on it either. Nor did it have the clear envelope that houses the warranty card/manual. When asked My Watch LLC about it he stated that it was not in the pictures and he didn't have it. It was advertised new, unworn, full box and papers so why should I be the one to police these details?!! I trusted this to be reputable, but BUYER BE WARNED!! Better ask every single question AHEAD OF TIME!!!I believe the platform needs work. If you are an international company then someone should be available 24/7 to cover all time zones for assistance when needed. It took me several days to reach someone.  The \"professional\" sellers should be screened better, and removed from the platform when they talk to customers the way that My Watch LLC talked to me. NEVER AGAIN!", "rating": 2}, {"title": "Transaction is not completed yet.", "text": "Transaction is not completed yet.Still waiting for the sellers reaction.", "rating": 2}, {"title": "f**king email spam", "text": "f**king email spam - any interaction results in 5 emails", "rating": 2}, {"title": "Shipping took longer than expected", "text": "2+ weeks after my purchase, I still hadn't received a shipping tracking number and had to reach out to the seller to ensure that my item was actually shipped.  Once I reminded the seller to ship my item, it was shipped and arrived in good condition.", "rating": 2}, {"title": "Watch does not work", "text": "Watch does not work.  Also, who sends me a formal receipt, so I can send in for repair", "rating": 2}, {"title": "the seller claimed GS handtag need to…", "text": "the seller claimed GS handtag need to be recycled, so they did not ship that to me. I ask for official GS annoucement for checking, but the seller cannot provide up to this moment", "rating": 2}, {"title": "Very difficult to get feedback from…", "text": "Very difficult to get feedback from multiple people.", "rating": 2}, {"title": "As usual Chrono24 is useless.", "text": "As usual, Chrono24 does absolutely nothing to help whenever there's a problem. Watch went $700 worth of bad after 2 weeks and they won't let me change my review, so that others will be warned against the seller, who so far has done nothing to recompensate me and likely won't. (Update 3-6-23: They were willing to refund $375).So, an irresponsible seller gets away with it and will continue to do so all because you won't let me warn others against him OR extract the money he owes me for the repairs. Chrono24 doesn't take PayPal, so buying internationally is an absolute effing nightmare with my credit card company.As a result of the above and from now on, Chrono24 is where I shop ... but only to find what I want and the name of its seller. Then, if I can't buy from them directly, I find it elsewhere, as Chrono24 has done nothing to deserve my business. Suck on that.................3-6-23RE: Chrono24's reply.It happened after 14 days. Understand? The watch was so gummed up that my watchmaker, a retired Omega employee, had to scrape & clean the casing and clean every single part, change the seal, reassemble it, oil it, adjust it, timegraph and pressure test it.My watchmaker said the seller's watchmaker probably just added oil to existing oil to get it to run. It was not properly serviced 2 years ago, as advertised (which I blame on the watchmaker, NOT the seller) and my watchmaker said he would not be surprised if sat around unwound and not running for 2 years.It cost $700 to overhaul. The seller felt this extremely exorbitant. Tough. That is beside the point. That's what it cost and I'm sure as hell not paying $200+ to ship it back to Italy for his bogus watchmaker to \"fix\" it.So, I settled for the $375 they were willing to give me, because it's all in their hands and I have to settle for what the seller is willing to give me. However I don't feel good about being out an additional $325 in repairs mere weeks after its initial $3,500 purchase.See, receiving what I didn't pay for isn't right. My having to pay $325 ($700 if the seller said go kick rocks) to have something fixed only weeks after I purchased it is not right. The seller did what they we're willing to do and I settled for it with no other choice. So, things are all fine and good between me and the seller.However, what's right is still not right. It seems to me Chrono24 needs to pick up the $325 slack through some sort of insurance or fund that they hold for such matters. My approach to Chrono24 will remain as stated above. They are a mere catalog, a source for me to purchase elsewhere. No more. No less.", "rating": 2}, {"title": "You make a deal then there is fees you…", "text": "You make a deal then there is fees you don't expect or are aware of. Like customs fees.", "rating": 2}, {"title": "Escrow to the rescue ?", "text": "Sadly, my most recent watch purchase has turned out not to have not been an authentic piece & I'm having to return it. I've yet to experience whether the Escrow system works for me in having my funds returned. I live in hope.It also seems that I'm responsible for the return express freight costs totaling over $155 for a no fault return. Not very happy about that.", "rating": 2}, {"title": "The watchband is so small -it would…", "text": "The watchband is so small -it would only fit a child's wrist", "rating": 2}, {"title": "Be aware of forex changes that will cost you...", "text": "It's a fairly easy platform to buy from, although be aware that if the forex changes between you placing an order to the seller accepting the order, you pay the difference. Funny how this only happens when it costs you more, not when the forex changes in your favour. Chrono24 also has very poor customer service. They do not answer you emails, and on the phone they are like robots, not willing to help.", "rating": 2}, {"title": "the watch arrived out of adjustment", "text": "the watch arrived out of adjustment. the seller referenced a service order that stated it worked fine. the service order was from more than 6 months prior. due to the import fees nearly 300 dollars and return shipping an adjustment was made. I have yet to see any  price or credit adjustment from the seller. the 250 retrun was minimal. most likely the last time i buy a watch from an out of the USA dealer. Maybe chrono24. i am still disappoined as it will be some time before i can get the watch serviced.", "rating": 2}, {"title": "Beware of addition bank fees", "text": "I was very pleased with the seller in Japan who worked closely with me on shipping and customs issues. I am disappointed with Chrono24 because it was not clear to me that the company is located in Germany. Because of this my bank added a $270 service fee for a foreign bank. Had I known that a European bank was the recipient I would have used my Capital One card that does not impose foreign transaction fees.", "rating": 2}, {"title": "Bezel is misaligned", "text": "Bezel is misaligned, had I seen it in person before buying I would have chosen a different watch.Why do I have to be the one to send it back? It should have been sent back to Seiko immediately when received, they need better quality control. Now its not worth my money doing the whole return process.Last time I'm using chrono24.", "rating": 2}, {"title": "just opened the \"new\" watch Christmas…", "text": "just opened the \"new\" watch Christmas morning and we have our doubts", "rating": 2}, {"title": "The watch band was not on the watch", "text": "The watch band was not on the watch.  The pin fell out. There was zero quality check on the brand new item.", "rating": 2}, {"title": "Dealer excellent service gets my 5stars…", "text": "Dealer excellent service gets my 5stars vote But Chrono24 messages confusing and their insistence payment in buyers local currency only is absurd in this day and age. This affords Chrono24 unreasonable foreign exchange profits as buyers not allowed to pay sellers price in sellers’ quoted currency.", "rating": 2}, {"title": "Sneaky Fee at checkout", "text": "Good company.  Sneaky introduction of “sales tax” even on items coming from abroad at checkout.  This should be labeled as an intermediary fee and not as a sales tax since foreign companies are not required to charge local sales tax when shipping to the U.S.   The buyer ia responsible for Federal customs duty tax but that ia a separate thing.  That Chrono tries to slip their 7% fee under this guise is shameful.", "rating": 2}, {"title": "The process to checkout is fast and…", "text": "The process to checkout is fast and efficient. They have a wide variety of watches from around the world. It is misleading however they say they charge no additional fees. Once you checkout you will see a final total and you will be added an additional transaction fee charged since they use an international escrow account. They said this is in the fine print somewhere, in my case I was charged an additional $153 for this escrow charge. If you do not mind that extra fee then you should have no trouble.", "rating": 2}, {"title": "Disappointed on the payment gateway and almost lost my chance", "text": "I had purchased few time pieces from Chron24 before and this was the worst experience so far. I had paid the seller by Credit Card and the platform has charged me TWICE without hold my item at all. I contact the CS and lucky I had Alison who helped me out, and she was helpful to resolve my concern. But I was disappointed on the payment gateway at that moment. Thx", "rating": 2}, {"title": "I ordered a brand new Longines Heritage…", "text": "I ordered a brand new Longines Heritage watch. The entire purchasing process was a bliss until I received my watch. It has never worked since the day I received it. I wore it for a 5 days hoping that it may just need to be worn and it will wventually start working, but it never did. I’m hoping that it just need a battery replacement. Even then, It worries me that I might not be able to find a good reliable Longines watch repair shop. I was really looking forward to use them as I have been searching for this particular watch for a while.", "rating": 2}, {"title": "It took almost sıx month to receıve the…", "text": "It took almost sıx month to receıve the watchI bought it in April and got it six month later.  I wanted to buy another watch but it seems difficult to deal with you.  I had a good experience several years ago but not this time.The delay was not for Christmas, and it was impossible that either the seller or you provided me with information.", "rating": 2}, {"title": "Watch described as \"very good\"", "text": "Watch described as \"very good\". Received damaged and potentially repaired with ungenuine parts. It is currently being assessed by an authorised dealer for repair (4-5 month expected assessment).", "rating": 2}, {"title": "I have just bought from you a watch…", "text": "I have just bought from you a watch Chopard Happy Sport (TC - 5407378) which has been delivered in Varna on 11th of August 2022. Two things you should be aware of as a reputable watch seller:1. The battery was totally exhausted and the watch did not start 2. The watch could not pass pressure test performed after changing the battery. (see photo attached)The thoughts crossed my mind after seeing this were - the watch hasn't been checked before shipment, it has been stored for quite long in your stock and it hasn't been manufactured in 2022 as announced. Service man strongly recommended full inspection of the watch.I bought this watch for a present of my wife for our wedding anniversary and felt really embarrassed when all this has been revealed  in front of herKind Regards,Valentin Makarov", "rating": 2}, {"title": "To be honest", "text": "To be honest, I am not satisfied with this experience.  After receiving the watch, it was found that there was a problem with the movement.  I sent it to a Hong Kong agent for repair, but many parts had to be replaced.  The price is not cheap.  When I add it, I can purchase more options.  , Insufficient after-sales service", "rating": 2}, {"title": "Bought a NATO watchstrap by Omega from…", "text": "Bought a NATO watchstrap by Omega from a dealer in Bologna.The price was half that of rivals, maybe because the strap was a facsimile of an Omega product.Packaging was minimal but it did arrive within a few weeks and it does look similar to a NATO strap, just lacks the quality and finesse for an Omega. Cheaper and cheerful. You do get what you pay for so decide for yourself.", "rating": 2}, {"title": "Watch was well received but…", "text": "Watch was well received but unfortunately the screws in the band are worn and I cannot get it sized. I've been to the NYC Tag Heuer store and they were unable to remove links.", "rating": 2}, {"title": "Not great if you have a problem", "text": "If you have a problem,  it's very hard to resolve.my watch cost $124 for delivery through Chrono24, and here I am, 10 days later, with no tracking information and conflicting information. Who knows when or if the watch will arrive,  but one thing is for certain,  Chrono24 isn't helping. Happy to charge high fees though...", "rating": 2}, {"title": "Exchange Rate", "text": "What happens when you buy a watch from a foreign country, Chrono24 checkout determines the exchange rate from your home country (USD) to a foreign country (GBP).   In my case, this included an unfavorable exchange rate that resulted in $500+ in extra cost versus the exchanges rates offered by major banks and broadly available to everyone.  Otherwise, great transaction but they are definitely clipping a service charge in the exchange rate and conversion.  Unfortunately, you have to pay in your home currency and are not given the option to pay in the foreign currency.", "rating": 2}, {"title": "The watch was sent to a friend in Osaka…", "text": "The watch was sent to a friend in Osaka because the seller would not ship out of Japan. It is now at Tokyo Cartier to ascertain if indeed it is “new” as described in listing. They also will be removing the crocodile band and my friend will send both the watch and band separately. I pray all is as described and promised, or there will be hell to pay!", "rating": 2}, {"title": "Bombarded by messages about purchases not made", "text": "4 of the dealers I approached in November did not have the watch in stock and could not source it before Christmas. Nevertheless I was then bombarded by Chrono24 asking if I had purchased from each of them, the messages still keep coming despite repeatedly replying to confirm that I had not made the purchases. The fifth dealer supplied the watch, 10 days after the latest he stated he would. For 3 days someone remained at home waiting for a UPS next day delivery that did not come. It is a shame as my previous experience with Chrino24 was very good.", "rating": 2}, {"title": "Dragging their feet.", "text": "Having purchased the watch, which was dispatched by the seller it was clear that it had been lost in the \"system\". My poor score is due to the lack of updated information coming from the seller and Chrono24 view that it was not unusual for items to take up to 4 months to come from the US.I deal with companies all across the US on a regular basis and it is my view that they were dragging their feet. Which from a customer service view was very very disappointing as it was left to me, the customer, to chase them for information.", "rating": 2}, {"title": "I have asked for help regarding DHL Custom problem in Romania", "text": "I have asked for help regarding a problem with DHL. \"Free delivery\" is not accepted by DHL in Romania. No solution from Chrono24 received.No support from Chrono24 and no Romanian language as stated in site description.I had to solve the problem myself, spending a lot of time. Many phone calls with DHL, a lot of messages with the seller, had to go to DHL offices in Bucharest to find a solution ... again, too much trouble for a watch ...", "rating": 2}, {"title": "Authenticity Papers Not Provided and No Response", "text": "Messaged the provider of the watch and Chrono24 and received no feedback on why there were \"papers\" of authenticity provided with my purchase of a Panerai that were promised.  Unclear on whether I am ever going to get those which are critical.", "rating": 2}, {"title": "I bought a watch using Chrono24", "text": "I bought a watch using Chrono24, which was advertised as being in the US.  It was not.   I received the watch from the Dutch West Indies with a shaky customs form.  The watch appears to be authentic, but Chrono24 needs to monitor and enforce its policies more efficiently.  I will be reluctant to use Chrono24 in the future.", "rating": 2}, {"title": "Paid extra money (over 24000) to get a…", "text": "Paid extra grands to get a brand new rolex submariner hulk because it was my first watch (had to pay 24000 + tax ) When I received the item, I could instantly tell It was definitely a used watch. Stickers almost off, plastic covers missing. It’s condition was like a new, but it was obvious that the condition is different from the ones that are fresh out of dealer shop.  Never pay extra grands to buy “brand new, never worn” watch. Never trust the word “brand new,”just buy a mint condition.", "rating": 2}, {"title": "Great website for viewing and shopping…", "text": "Great website for viewing and shopping around . The experience of selling a watch has not been straight forward. There is little to no guidance from website, which is fine, but there is little to no understanding of the numerous steps involved to completing a transaction. I think Ebay, or another website is obviously more straight forward. I would appreciate more interaction from the site, especially with help for an international sale r purchase.", "rating": 2}, {"title": "Need to Fix Visa Verify Issues", "text": "Good, professional, and trusted I t err national watch marketplace overall.  However, recently, payment through Chrono24’s  app from the US has become a real issue.  They are using Visa’s verify service (which is understandable), but it is not working properly.  I have been forced to have my bank force authorize two recent transactions, which has been a pain.  Chrono24 needs to get this fixed.    Thx!", "rating": 2}, {"title": "Very disappointed with dealer❗", "text": "In this trade the sale picture is different from the actual product received. The sale picture has a beautification effect, which makes the buyer make the wrong choice. After the negotiation, the dealer can only get back the polish fee for one fifth and the other one fifth is provided by Chrono24. If need see the true pictures and sale pictures, please contact me I can show you.", "rating": 2}, {"title": "Lack of buyer protections", "text": "After a seller renegged on our deal by selling the watch I had \"bought\" I contacted you. 3 weeks later no response. Not great customer service and it has eroded my trust in the platform.", "rating": 2}, {"title": "Chrono24 has problems with  processing …", "text": "Chrono24 has problems with  processing  Credit cards. I had to get a bank draft wire order to make a purchase. My bank could not understand what the problem was. The Chrono24 help line was no help at all!!! This is the reason I wouldn’t buy out of the country again and would be hesitant to use Chrono24 service. The dealer was great about the whole thing. Dr John Coe", "rating": 2}, {"title": "Their inventory is extensive and the…", "text": "Their inventory is extensive and the sellers are legitimate but their customer service is very questionable. I tried to have a simple task performed that was of non expense and would have taken 30 seconds on their side to fulfill and as of this posting 7 days later still nothing done despite numerous calls and emails. I suggest you do due diligence in picking your seller and hope to never rely on Chrono support. The excuses will fall like raindrops.", "rating": 2}, {"title": "They adjudicated a disagreement with…", "text": "They adjudicated a disagreement with little input from me. They were slow with follow-up. They only offered to consider paying for part of the return shipping costs (I requested they pay for at least half of it because there were conflicting dimension measurements between what was posted and what the watch actually was) only after I returned the watch--that is, I had to return the watch first before they would commit to paying for half of the return shipping costs or not.", "rating": 2}, {"title": "Bought a watch in the US incurred international fees", "text": "Bought a watch in the US, from a US vendor, paid in US$ but what Chrono doesn’t tell you is that they are based in Europe and the money transit view Germany. This resulted in additional international transaction fee. Very misleading from their part.", "rating": 2}, {"title": "Beware", "text": "The watch I purchased was advertised as being in the United States.  I paid via credit card and was charged a foreign transaction fee that my bank would not reverse because Chrono24 uses a German Bank.  Had this been disclosed, I would have wired the funds.  From my prospective, this is false advertising or at minimum failure to properly disclose pertinent information.  I have also filed an complaint with our Federal oversight agency in hopes greater regulation is enacted to ensure full disclosure.The entire process except for above was easy.", "rating": 2}, {"title": "Double charge", "text": "The price of my watch was deducted twice due to a technical problem with Trusted Chekout.I was very uncomfortably affected when I saw this on my credit card account.This was not indicated by the Chrono24 staff, they only responded after my request!I thought I had been the victim of a fraud, and I could believe that for three days because of the weekend.Fortunately, although all the problems were solved and I got my money back, they still took a lot of my pleasure...I hope no one else has to go through the same!", "rating": 2}, {"title": "I needed a fair amount of assistance…", "text": "I needed a fair amount of assistance with one particular problematic purchase which was eventually cancelled - the team at Chrono24 were slow to respond and the replies  I did finally receive were useless - very disappointing introduction/start for me using the Chrono24 platform - A McCarthy :(", "rating": 2}, {"title": "Enquired about the availability of an…Waste of Time!", "text": "Enquired about the availability of an Omega Speedmaster Dark side of the Moon of which the seller had two new for sale albeit at different but very competitive prices.Response time was fine, approx 36 hrs.The watches however were not even available as they were “ probably discontinued “ was Chrono24 response.My local boutique jeweller however is still happy to order one on my behalf, so presumably they have not been discontinued!To compound my frustration these adverts on Chrono24 are still live as I write!Honesty and Transparency is all I expect. A futile waste of my time has been my experience of this service.", "rating": 2}, {"title": "Unless Chrono24 finds away to protect…", "text": "Unless Chrono24 finds away to protect the buyers even if they pay through direct payment because we are using it’s application to buy no matter what the way is and as we are not allowed to use the escrow payment yet , I find it very disappointing 👎🏻👎🏻", "rating": 2}, {"title": "Flawed payment system declined one credit card, not not another", "text": "I like the concept, and the escrow system seems to work, however, the website would not accept the credit card I use for all international transactions. When I contacted them and asked why I was told that I should just do bank transfer, no explanation as to why they rejected that card. They also didn’t read my email and answer a couple of other questions. I am particularly annoyed as I then used my second credit card, but that cost me an international transaction fee. They are both mastercards, so I have no idea why they wouldn’t accept the first, but the second was fine.", "rating": 2}, {"title": "Not enough payment options", "text": "Great selection of watches but they take their margin and if you are buying from overseas you have to use their unfavorable conversion rates. There should be an option to pay seller in own currency but there's not.", "rating": 2}, {"title": "watchband was terribly small", "text": "watchband was terribly small.  i had no idea that it would have a band that would never fit.  the band is the size for a child.  very disappointing and will cost me substantial money", "rating": 2}, {"title": "Waste Of Time", "text": "I can't log in, can't reset my password, can't get assistance. Both app. and desktop versions are not able to function properly from the start. Customer service agent rude and unhelpful. Complete waste of time.", "rating": 2}, {"title": "Tried to return a misdescribed watch…", "text": "Tried to return a misdescribed watch without success. Staff were helpful initially but could not persuade dealer to receive the return item at the end. Mediation attempts at compensation were minimal at best.Order number was TC-3403793", "rating": 2}, {"title": "Repeatedly delayed and still", "text": "Repeatedly delayed and still. Not Delivered. Problems with FedEx Customs.", "rating": 2}, {"title": "Glorified Ebay", "text": "Chrono24 is glorified Ebay.  They have great watches to look at. But when you purchase beside the escrow, Chrono24 doesn't care about the buyer -seller relationship.  The description was that the watch would ship in 3-5 days.  As soon as I purchased it was an email from the seller that it would be a month. It was a bit less than the month.  BUT in the interim the seller still had a posting on Chrono24 stating 3-5 day until shipping, which is obviously not true.  I thought that this was a classic bait and switch selling tactic.  I complained to Chrono24, essentially they didn't care.  Glorified Ebay!", "rating": 2}, {"title": "Firstly I’d been on the site for some…", "text": "Firstly I’d been on the site for some months knowing the watch I wantEd and when I was finally ready I purchased I brought only to be told they had no stock , I complained to Chrono24 to deaf ears, very annoying. I finally went with a great guy in Australia and he was awesome.", "rating": 2}, {"title": "Very difficult to communicate with…", "text": "Very difficult to communicate with Chrono and at times, they were very unprofessional. Additionally, they miscommunicated a resolution that the seller was offering. Fortunately, the seller was communicating with me and let me know.", "rating": 2}, {"title": "I purchased a watch from a trusted…", "text": "I purchased a watch from a trusted dealer (IPPUUKISHI INC.). It arrived damaged (a loose screw), and not running. I returned the watch to the dealer, they repaired it, and sent it back to me. Meanwhile, it had been nearly a month since I purchased the watch, well past the milestone I wanted to commemorate. Less than a week after receiving the watch for a 2nd time, it stopped working again.IPPUUKISHI INC. refused to reimburse me to have it repaired at a local watch dealer. Poor QC from the dealer, and a very, very disappointing experience overrall. I will not recommend IPPUUKISHI INC. or Chrono24 to anyone for a watch purchase.", "rating": 2}, {"title": "i have bought the watch from distributor from Rome.", "text": "i have bought the watch from PROFFESIONAL SELLER!!!you should take responibility over the distributors who you recomend.the watch i paid for was described as very good, mint condition. at the first sight it did look like that. but when i gave it for service! it turned out that the product is in verry!!!!!! poor condition. inside it is damaged, some parts are missing, it must be sent to Augemars lab for very serious repairs which will cost me minimum 5k Euro!!!!!!!!! disaster! i will never again buy a watch thtough your recomended sellers. i cannot believe in your good work. you should really take care about the cheeters existing in your society!", "rating": 2}, {"title": "Foreign Transaction Fees", "text": "If you live in the US and the card you plan on using has foreign transaction fees, you will be charged (even if the seller is in the US). This should be displayed somewhere on your website, as it can make a material difference when the item is thousands.", "rating": 2}, {"title": "Must have additional buyer protection", "text": "Must have additional buyer protection. My first purchase was very disappointing and dissatisfying. C24 should have default no. of days to refund the payment because the seller did not comply on shipment. I purchased a watch and the courrier did not deliver it and even contact me. I don't have any idea where the watch is now and as per seller, the courrier cannot retrieve it as well. When asked C24 for refund they said they cannot refund my payment if the watch is still not received by seller. My payment is kept in escrow for more than a month now because the seller did not receive the watch yet. Not really fair for Buyers.", "rating": 2}, {"title": "Chrono24 removed their fixed fee for…", "text": "Chrono24 removed their fixed fee for high end watches with private sellers. Now the commission is so high it makes little sense to sell via Chrono24 and not a grey dealer. You need to create a fixed fee again, or will lose a serious amount of business.", "rating": 2}, {"title": "I have had no luck getting any help…", "text": "I have had no luck getting any help from the chrono team to pay the sales fee. And also not having the escrow system work for my country really takes out the safety element from the process and makes it very tough to sell.", "rating": 2}, {"title": "I truly don't understand why y'all use…", "text": "I truly don't understand why y'all use a payment processor you KNOW has problems as the default. The platform, product and escrow system all worked great but it was two days of headaches and false positive calls to both my bank and my credit card provider to try and figure out why my good payment methods kept getting declined only to find out it was your payment processor, not my financial institutions of choice. When I finally got one of your support agents on the phone they were able to get me sorted and take my money, but that you're using humans as a workaround for a known processor issue is pretty poor UX especially for a platform selling multi-thousand dollar luxury goods.", "rating": 2}, {"title": "The inability to perform international…", "text": "The inability to perform international bank transactions means potential sales are lost ", "rating": 2}, {"title": "The watch was advertised and sold with…", "text": "The watch was advertised and sold with box and papers.  When the watch arrived, the box and papers were in extremely poor / distressed condition - this should have been disclosed in the condition report.  Also, the watch was shipped without any wrapping around the box; so the box was open, and the watch was laying open inside the shipping box when it arrived.They did extend the warranty period to compensate for this, but it was disappointing to receive the watch is such a distressed condition.  It makes me question how the pieces are care for prior to shipping.  I had hoped they would send a new box / certificate to compensate for the broken / mangled box I received.", "rating": 2}, {"title": "C24 Services Are Non Value Added", "text": "C24 is fine to use if you have no issues that require mediation. If you do have an issue, good luck, it’s fairly useless. On one occasion, they released my escrow funds to the seller after I confirmed there was an issue with a watch. Then, I tried to leave negative feedback for the seller because he falsely represented the watch and C24 refused to publish it. They would only allow neutral or positive feedback.On another occasion, I requested mediation and it took them days to respond and when they did, they did a cut/paste of the rules listed on their website.Overall, it’s only good for having so many watch sellers in one place but their services suck", "rating": 2}, {"title": "The lack of secured payment options", "text": "The lack of secured payment options in this part of the world hugely limits the Benefits of the platform and forces me to significantly lower my asking price in order to attract interest from a private seller.", "rating": 2}, {"title": "No responsibility from Chrono24", "text": "The watch was defective and after I payed for costumes fees the seller wants me to pay shipping and a$60 return fee for returning the watch. No warranty for Chrono24 . I am stuck with a very expensive and defective watch", "rating": 2}, {"title": "Chrono24 charged me twice", "text": "Chrono24 charged me twice.  This error was eventually rectified, but meant that my card spending limit stopped my spending for the duration. I appreciate that mistakes happen, but this was no consolation at the time.", "rating": 2}, {"title": "Unrealistic valuations. 'Support' unresponsive.", "text": "1. The valuations of watches displayed on the website are multiple times higher that the prices that can actually be realised between private buyers and sellers. My Cartier watch was advertised for one year and after reducing the price it was eventually sold for a small fraction of your valuation price. 2. You collect an advance commission based on the unrealistic evaluation.  My two requests via 'support' for the balance of the deposit to be refunded based on the actual sale price have been ignored. I have sent a third request today. 3. The costs and restrictions of shipping watches between countries by courier is prohibitive for watches at realistic market prices.", "rating": 2}, {"title": "I was interested in a particular watch", "text": "I was interested in a particular watch. I ordered it. Chrono21 wrote back telling me they would contact the supplier and the supplier would contact me in the next 48 hours. Why?? Why not like Amazon or every other internet order company, can we not choose, order, pay and receive? When I didn't hear back from the first organisation wishing 24 hours, I looked at it as they weren't interested enough and I ordered from a second supplier. Chrono24 received, passed the details and money and complete t transaction. But Chrono24 still kept trying to get me to buy from the first supplier even though they knew I bought the exact same item from a second supplier. Solution? Improve and update information and supplier confirmations.", "rating": 2}, {"title": "Between a Rock and Hard Place", "text": "My recent purchase from a trusted seller from Japan was not a very good experience.  The watch did arrive as described, however the vendor represented that the watch received a full service in Oct/Nov 2021 and the watch has a defect in the winding mechanism.  Rather than me spend upwards of $300 in return shipment, I decided to use that money towards a repair that will likely cost me over $1,000.00.  The problem with Chrono24 is although it does have a fair mechanism of payment into an escrow account pending inspection for condition or authenticity, there really is no way that a seller warrants the operation or condition of the watch, so the buyer is forced to either return the watch at his/her expense or keep the watch and eat the repair costs.  I probably will not buy a watch from overseas again through Chrono24.", "rating": 2}, {"title": "Dealing with a Japanese seller was…", "text": "Dealing with a Japanese seller was extremely difficult and cumbersome. Communication was confusing.", "rating": 2}, {"title": "Just glad I was not paying for this service...", "text": "While I was able to find the watch that I had been looking for on Chrono24, I really have nothing particularly nice to say about them. I was having trouble communicating with the actual seller in Japan, requested help from Chrono24 and was actually able to complete the purchase directly with the seller by the time Chrono24 answered by request four days later. However, their response was that the watch had been sold to another individual and was no longer available...I had even paid for the watch through Chrono24's system!If I were the seller, I would seriously question the value of Chrono24's fees and involvement.They did not assist in the sale, their customer service was awful and their response was untimely and uninformed.", "rating": 2}, {"title": "I need help getting ahold of the…", "text": "I need help getting ahold of the seller. I’m out 40k I’ve tried calling chrono with no response . I have purchased another watch and that went fine. Just need help", "rating": 2}, {"title": "Disappointed transaction on Chrono24", "text": "Not my first time selling on Chrono24, everything is smooth and easy, but this time the payment received is less than what it should be, still under support team’s review.", "rating": 2}, {"title": "Great Vendors, but leery about Chrono24.com hidden Transaction Fees", "text": "Initially I was very excited about this website, but I became very skeptical and disappointed once I wasn't able to contact a Representative via telephone. I left numerous messages requesting a callback or a contact number; and never received a response. I contacted them because I purchased a great watch from an awesome American vendor and I live in the U.S. as well, but wasn't expecting a fee charge that was billed to my bank account directly. I carefully screened and read their disclaimers and didn't see anything about transaction fees prior to my purchase. The vendor that I did business with was excellent, but Chrono24.com should be more forthcoming about transaction fees, because I didn't see that one coming.", "rating": 2}, {"title": "1) Your fees to seller are too high", "text": "1) Your fees to seller are too high. This reflects in price I must pay for watch. 2) Your search options are limited and need to be improved. Study eBay and learn from the experts.3) Your survey to ask me if I purchased a watch I viewed is a bad idea and is irritating. Then to ask if I would recommend the seller is even worse idea. How can I recommend a seller I have not had a transaction with? 4) Some of item details lack proper information and are not descriptive enough. Require more important information on each watch. Like Box, papers, price, new or used, shipping time and cost, if watch can be shipped to USA! 5)  When listing opens, move your Chrono24 Buyer Protection information to the bottom. Do not have it right in body of main page listing.", "rating": 2}, {"title": "Offering a Buyer Protection Service is Not Enough", "text": "My first time using Chrono24, and I did so because of their Buyer Protection service. However, I had significant issues clearing the product through Customs, which I believe resulted from the lack of proper documentation on the part of the seller. Chrono24 should take a more active lead with sellers than they do. Chrono24 appears to offer the possibility of prepaying custom duties and taxes, but this was not the case. The entire process should be seamless; it was not. I spent many hours with the courier company trying to sort things out. Although Chrono24 responded to my requests for help in a timely and friendly manner, they were ineffectual in assisting me. I shudder to think what would have ensued if I had to return the product.", "rating": 2}, {"title": "Exchange rate vs", "text": "Exchange rate vs. USD is far out of the prevailing market rates when the seller is listing in his/her local currency. Ending up paying extra money than what we see in the AD", "rating": 2}, {"title": "Unfortunately", "text": "Unfortunately, Chrono24 does not protect its buyers, no use of any complaints we do , reaction to my complaints was very slow , then no action was taken with the sellers 👎🏻", "rating": 2}, {"title": "Watch package missing manuals, strap defective and not getting any help from the vendor: HarveyStore DE", "text": "Since I bought my watch in 29 jul. 2020 I am trying to contact the vendor many times. Now is April 2021. The watch lacks the user manuals and the strap is defective and falling apart since the first day. I have many unanswered communications in my inbox from the dealer HarveyStore DE and even I contacted the Brand of the watches directly and told me that even I got a guarantee card, the vendor does not cover it (only from their selected dealers).My watch package is uncomplete and defective and I am not getting any help from the vendor. Chrono24 just sent a reminder follow up message to the vendor and I dont see any meaningful actions. I would like to receive the missing user manuals and replace the strap for a correct one. Please be very careful!! In particular my issue was with HarveyStore DE.", "rating": 2}, {"title": "Chrono do not do enough to resolve…", "text": "Chrono do not do enough to resolve issues, and do not allow 'honest' reviews, Chrono favour the seller when issues arise and do not give adequate feedback to buyers.", "rating": 2}, {"title": "Purchasing difficult from the start", "text": "Purchasing difficult from the start. Payment options were limited and not smooth. Item was never delivered but was stated as delivered. All in all an experience I will not be repeating.", "rating": 2}, {"title": "Too Safe", "text": "There is risk in any transaction.  If you attempt to eliminate risk, then you eliminate the transaction.  It took me 3 times to complete the sale.Don't go cheap on insurance.", "rating": 2}, {"title": "I've made 20-30 deals deals on chrono…", "text": "I've made 20-30 deals deals on chrono as a buyer from trusted chrono pro sellers, and 75% of them has been trouble free. The last 25% has been troublesome. E.g. one time a trusted chrono dealer send me a wrong reference (the dealer was clearly not very competent) and didn't know what he was selling (i received a ladies watch and not the 'large' version of the watch). Buyers protection wasn't worth much as they trusted their incompetent seller, and I was more that velcome to send the watch back to the untrustworthy chrono seller.I did and ones again the seller offered the watch with the wrong reference.I've tried receiving wrong references a few times.   Altså received watches with hidden faults.I really appreciate the chrono platform, however don't expect much from the buyers protection. It isn't worth anything.", "rating": 2}, {"title": "Buyer beware", "text": "I was recommended this site. Guarantees in place that if a sale takes place that you are protected from fraud. Not the case. I will never use this platform again.", "rating": 2}, {"title": "With taxes and fees it’s not worth the purchase", "text": "I had to pay extra $3000 for purchasing a watch because of state tax, duty and chrono24 transaction fee. Purchase was not worth it.", "rating": 2}, {"title": "No the best way to buy used watches...", "text": "Watch came in under the size advertised and was in rougher shape than the pictures showed.  Buying online probably isnt the best way to get used watches.", "rating": 2}, {"title": "Poor to non-existent customer service.", "text": "I attempted to purchase a watch on Chrono24 and kept receiving a \"unable to process this transaction\" message as I tried to complete the purchase. I called customer service and kept getting the message \"voice mailbox full\". I emailed customer service and only received an auto response that they had received my email. I contacted my credit card company to see if there was a problem and was advised that Chrono24 did not attempt to put the purchase through. I advised the seller of the issues with Chrono24 and asked them to try to contact them to address this issue finally getting a response and being able to complete the purchase. It took 3 days to complete a transaction that should have taken less than a minute. I have purchased a lot of watches on line and this was the worst buying experience I ever had. This is their business, they need to do better.", "rating": 2}, {"title": "Returned item on May 29", "text": "Returned item on May 29, 2020. Seller signed for receipt on June 10, 2020 and I submitted proof. Still have not gotten refund! Had to file credit card claim.", "rating": 2}, {"title": "Do your homework first", "text": "Lot of jewelers with watches that are pre-owned and selling as “brand new.” Chrono24 not willing to make change as they care for their money as well. So, customers please be careful before purchasing. Avoid out of country purchase to be not being a victim of fraud. Overall Chrono24 is acting as middle person to hold your money and releasing to seller when your watch received by you. They are not willing to throw out those merchants who are falsely advertising.Chrono24, I appreciate your reply and confirmation of what I have written above regarding your work. I have no issues with Chrono24 but the rating is low as Chrono24 is not willing to remove the false advertisement that sellers are posting. I have tried to report them to you a few times, but no steps are taken. Hence, I am giving a fair advise to customers so they are more vigilant and are doing their homework before the purchase.", "rating": 2}, {"title": "keep getting emails to validate watch…", "text": "keep getting emails to validate watch authenticity protection when I never made a purchase. the system should know which watch ends up being purchased or not.", "rating": 2}, {"title": "Chronos should be more selective with its sellers.", "text": "Two transactions with chrono24 and both didnt go well. Bad experience. Chroni24 is not to be blamed for unereliable sellers, but it is for accepting those sellers in the platform and keeping them in the platform even after they have failed the customers. First was a French seller that although advertising the watch would be shipped with the original box and original manufacturers guarantee card, it didn't.  Anf it turns out he didn't even have the original guarantee. The second seller took 5 days to ship the item after it received payment and because of that the watch did not arrive in time for Christmas,  ....the hours i spent dealing with customer care trying to sort the issues that were created by the sellers I will never be compensated for those. If chronos had a more assertive mechanism to deal with breaching sellers, it would not be getting this type of review and suffer indirectly reputational damages.", "rating": 2}, {"title": "Delivery a month late.", "text": "You stated that it would be delivered between 14-18th of December and arrived a month later. When I wrote to you you said so I am patient.", "rating": 2}, {"title": "Issues with warranty and lack of…", "text": "Issues with warranty and lack of response", "rating": 2}, {"title": "So many spam emails", "text": "No issues with the purchase but I get a constant stream of emails that you cannot opt out of. I’m about ready to close my account.", "rating": 2}, {"title": "felt cheated", "text": "I felt cheated when I paid $330 for the watch i purchased but received the bill for $200. This is something which was highly disliked.", "rating": 2}, {"title": "For the mediation services of buying CITIZEN EW0650-51L and Citizen AW1540-53L.", "text": "For the mediation services of buying a watch (CITIZEN EW0650-51L) I put an excellent five stars. For the mediation services of the purchase of another watch (Citizen AW1540-53L) I give a low rating. In particular I chose to buy a watch through your mediation even though I could buy it from another online store. I ordered and paid for this watch immediately. I was informed, not immediately after payment, that this watch does not exist. My money was returned after 4-5 days. In the meantime I did not have the money and I could not buy it from the other store. When my money was returned, this particular watch did not even exist in the other online store. So with the lack of updating the site with the availability of products I lost for now the opportunity to buy this watch (Citizen AW1540-53L). Next time I will not trust the listed availability of the site. I will probably ask first and then I will order. Of course, this is not safe either, since in the meantime the product can be sold !!!!!!", "rating": 2}, {"title": "Omega Seamaster", "text": "I inquired about the watch on July 28 to see if the watch was in stock and available for delivery by July 8, 2022. I received a message stating that they have the watch in stock and it would ship within 7 days. I requested upgraded shipping to next-day air (at my cost) because this was a gift for my wife's 50th birthday. I paid for the watch on July 29, 2022, the payment cleared Chrono24 in a few hours, and I was sent an email stating the watch can be shipped from the seller. Now on July 5, 2022, I received an email stating the watch still has to be received from a fulfillment center and would not receive the watch by July 8, 2022. To be fair to the seller, they did ask at this point how I wanted to proceed with the order. I chose to continue with the order. In the follow-up email I receive on July 5, 2022, I was informed the watch will ship within 6-10 business days. Now fast forward to July 11, 2022, I received a message telling me the watch was about to ship but after inspection of the watch, they noticed it was inoperable and they need to order a new one and THEY will receive it in 4-9 business days. To be fair again they did offer me a $200 credit and reimburse me for the $164 upgrade shipping I paid. I finally received the watch on July 19, 2022. Overall this was a horrible experience.", "rating": 2}, {"title": "The postage fees are very high", "text": "The postage fees are very high, As they use Fedex & there are high import taxes with that shipping company.Won't use again.", "rating": 2}, {"title": "I contacted customer few times for…", "text": "I contacted customer few times for questions via emails only got one response without any follow up. Please improve customer service.", "rating": 2}, {"title": "Good looking site, not geared towards modern international purchase needs", "text": "Pros: The site looks good and is intuitive to navigate, has a good selection of watches at a variety of price points. Cons: Based on a recent purchase experience with Chrono24, they are not geared for international purchases very well. It is not possible, for example, to update your delivery address or payment card once you've offered on a watch. This really matters, as if you are able to deliver a watch within a country that is different to your home location, on the knowledge you will pick it up there later, this can save shipping and import tax fees, which are substantial.A further con is that the site displays prices in one currency, but ultimately charge you in Euros. This means your bank can charge you significant additional FX fees, depending on your arrangement. Chrono24 showed me a price in USD from a US watch dealer, and I thought I was paying in USD, so used my USD bank account. Actually, they charged my bank in Euros, and my bank charged me a fee. If I had known this in advance, I would have paid Chrono24 in Euros and avoided the FX fees. Not good, Chrono24!", "rating": 2}, {"title": "I won’t Purchase from here again", "text": "I won’t Purchase from here again. Disorganized better off with personalized service when spending this kind of money.", "rating": 2}, {"title": "Payment was a hassle, communication was poor.", "text": "Payment was a hassle, communication was poor. As best as we can tell the Chrono24 system is setup for EU credit card payments and although they took the money from our AUD debit card account, they later rejected the cleared funds and sent it all back and insisted on an international bank transfer. This just wasted our time, delayed the completion of the purchase and then incurred extra bank fees. Chrono24 have still not confirmed the exact details of why the EU payment processing system they use did this, but what I will say is that the communication from Chrono24 was NOT helpful and as a first time trader my wife and I felt very uncomfortable with how the money was handled during the whole process. We were lucky to be dealing with an excellent seller who had seen this before and he was able to give us the information that frankly should have come from Chrono24 and enabled us to have the confidence to complete the trade.Unfortunately, it was NOT a comfortable experience trading through Chrono24 and as we were testing their system to see if we'd be happy to sell through them as well it was a disappointing experience.", "rating": 2}, {"title": "A sad experience with orologeria massaro...", "text": "I bought a tag heuer watch from orologeria massaro, however I became worried when the seller notified me that it's been delivered when I havent received anything yet. I tried to follow it up with Mr. Julius Chan, who in fairness has been quite accommodating and helpful. The seller didnt reply to all our follow ups and inquires esp by Julius, which leads me to suspect that I might have been a victim of a scam. But thankfully I got the watch, but not without stress and sleepless nights. I even tried to contact my bank to cancel transaction but it would require a lot of paper works...anyways, when I finally got the watch, I noticed that the seller didnt it have courtesy to put it in a box, although it was indicated that it does not have the original box. Guess what, the seller wrap it in several layers of newspaper and plastic, although with some bubble wraps for protection, but then, come to think of it, it's a 1500USD watch and just newspapers and plastic?? HmmAnyways, because of this, I'm a bit traumatized and would not even entertain the though of purchasing from this site again.For whatever it's worth, I'm just thankful that i got the watch.", "rating": 2}, {"title": "I am still waiting for my refund…", "text": "I am still waiting for my refund altough the seller comfirmed they got the watch back a week ago.", "rating": 2}, {"title": "As far as the selection of watches and…", "text": "As far as the selection of watches and platform utilization and functionality, I would rate them 5/5. But their Customer Service is extremely ARROGANT and not helpful. I am in the process of receiving a watch which I have fully paid for, but the delivery company is having issues with the delivery. The Seller has been amazingly patient and helpful, but I made the mistake to contact the Chrono24 Customer Serivce and was pretty much told that it was NOT their problem. They have received the funds and they hold them in Escrow ( this for a 6.5% cut ), and for the rest, I need to sort it out with the Seller. I found this reply totally out of line .  But whatever...it is what it is. I suppose that 6.5% is not enough for them to even attempt to resolve an issue....In reply to your reply.... That is exactly what you should be doing. I, a paying customer, called YOUR customer service, and was not only treated like a total fool, but was refused nor offered any sort of explanation, UNTIL I told  YOUR customer service, that if she did not feel like 'supporting nor listening to a customer who called customer service, maybe she should reconsider her profession! And that I would be more than glad to hang up the phone! Only at that moment did she take the time to say something like what you just wrote...which of course, was of NO help at all !  Your Customer Service is a Disclaimer Service and does not feel like they should take the time to listen to your customers! So why do you offer one ?", "rating": 2}, {"title": "Leather strap received", "text": "Leather strap received, however there's no place to put the buckle on.......seemed useless", "rating": 2}, {"title": "your fees make it difficult to…", "text": "your fees make it difficult to negotiate a fair price for watches. I have found another source.", "rating": 2}, {"title": "Sometimes the little things add up to big things", "text": "I recently made my first purchase with Chrono24.  Very exciting and got a GREAT watch, an Oris Big Crown Date Pointer.  After the purchase I noticed I had been charged $41.50 for a \"foreign fee\".  I called and was informed that since Chrono24's bank was in London they charged the additional fee.  I was then told to call my bank who might drop the charge.  I called and the my bank did not.  The fee was not mentioned anywhere that I could see on the website.  I was also puzzled in that my purchase was with a watch dealer in California.  It's a small thing I admit.  It is however, the one thing I find myself going back to when I think of my Chrono24 experience.  All my \"watch friends\" and I talk about our buying experiences and I found myself always going to \"that foreign fee\".  If I had known about it or been informed by Chrono24 BEFORE my purchase then I could have made my decision with nothing to say.  BUT.... Again, it's a little thing.  A little thing like a small piece of saw dust in my eye.  It's irritating and a constant reminder that I don't want to do that again.  I will still look at Chrono24 when buying a watch but I will lean more towards the places I purchased from before such as Watchfinder.com, Bob's Watches and Ebay.", "rating": 2}, {"title": "No option to pay in local currency to…", "text": "No option to pay in local currency to avoid high exchange rate margins.", "rating": 2}, {"title": "The watch is beautiful but does not…", "text": "The watch is beautiful but does not keep time.", "rating": 2}, {"title": "The platform is ok but there is no…", "text": "The platform is ok but there is no security for sellers in countries like Mexico.", "rating": 2}, {"title": "Very complicated payment system and not…", "text": "Very complicated payment system and not able to get help for quite a while...", "rating": 2}, {"title": "I really put my trust in Chrono24", "text": "I really put my trust in Chrono24.  It’s the best way to buy high-end watches.", "rating": 2}, {"title": "Not helpful when the transaction goes…", "text": "Not helpful when the transaction goes bad. Their buyers protection is a scam.", "rating": 2}, {"title": "All good just i don't get answer to my…", "text": "All good just i don't get answer to my email  from Chrono support.", "rating": 2}, {"title": "Security Assured.We were very pleased for the security…", "text": "We were very pleased for the security aspect suggested by Adrian.", "rating": 2}, {"title": "Watch was defective", "text": "Watch was defective. Frustrating.", "rating": 2}, {"title": "Emailed via questions tab", "text": "Emailed via questions tab. re exchange rates. No response.", "rating": 2}, {"title": "The delivery was delayed for lack of…", "text": "The delivery was delayed for lack of proper paperwork.", "rating": 2}, {"title": "I have some disappointing", "text": "1234567890q", "rating": 2}, {"title": "Great experience up until the post purchase experience (disappointing)", "text": "My first time using the platform and perhaps my last. I found a watch I liked and purchased it. And mind you it was not expensive, sub 7k (compared to the other brands crazy hype lately) I went through the purchase process, paid via CC and when I clicked on the purchase button on the Chrono24 site after entering my CC info I was then redirected to my CC's page (CapitalOne). Akin to 2 Factor Authentication, which is awesome. Received my pin on my phone, typed it in and everything validated thus approving the purchase/transaction. A few days later I received an email from Chrono24 asking to upload a copy of my passport and utility bill because their payment processor needed it, for fraud prevention. I emailed customer service and asking why and I explained I went through this with my CC already. I never got a clear response, other than it was needed. I also gave them the option for me to return the purchase and reverse the charges as the experience was very insulting and embarrassing. Honestly a few things, and I know Chrono24 will hide behind their payment processors excuse or \"legal\" requirements which they will claim. This felt like they were profiling (My Arab name, which is publicly visible as of this review) as I have NEVER been asked for such info before on any online purchase. This should have been explained at the start if such info was needed (If it's posted somewhere it's not obvious). You were happy to take my money but not provide that info upfront about requirements and it was not a huge purchase IMO. Basically my escrow account is now disabled because I would not provide the info and I won't out of principle. I'm a big watch collector but I won't use this site again, luckily we are all fortunate to have other sites to purchase from. 2 stars for the lack of transaction transparency, definite profiling and lack of closure from customer service. If I'm asked on other forums about my experience here I will def. provide my side.", "rating": 2}, {"title": "Way too many emails.", "text": "Date of experience: March 21, 2023", "rating": 2}, {"title": "Product did not match photos.", "text": "Date of experience: July 12, 2022", "rating": 2}, {"title": "Chrono24 turned down two of my…", "text": "Chrono24 turned down two of my Mastercards.", "rating": 2}, {"title": "Unable to process payment for Thailand.", "text": "Date of experience: September 15, 2021", "rating": 2}, {"title": "Be very careful - dealers are more protected than buyers", "text": "Chrono24 has quite a few big claims, but fails in many. If you're in for the luxury watch purchase, you do not have too much choice, so you should be warned and prepared.1. If you do not have a physical watch dealer of particular brand at hand who has certified watchmaker and can fully test your watch right away - do not even think about buying the brand through Chrono24. They will not protect you against anything other than obvious things like visibly broken watch or wrong piece. Given the spread of super accurate fakes I would not risk buying many of the watches (like Rolex) from Chrono24 at all, especially from private sellers.2. For whatever reason Chrono will bombard you with emails trying to make you admit you've bought something you did not. Not only it is annoying as hell, but if you contact more than one seller with same/similar item, Chrono24 will try to make sure you've bought all of the items, even if they are still with the respective sellers. Be very careful. For example, even if you press \"I did not buy this item\" link in your email, you'd be led to a big green button confirming that you've bought the item. Not sure why they do that and what does it say about their business model. I once did something like that and soon I was bombarded with calls from some bad mannered lady who ignored the fact that she just interrupted a meeting and after I pointed that she could have scheduled a call she became pretty rude and pushy. 3. Chrono24 does care about sellers much more than about buyers. For example, if the seller is rude or does not reply or lies to you about the watch - you can't do anything about it. The seller will still be there, \"working\" without problems. What if the seller gave you wrong information, forged papers or anything? It's your problem - but the seller will remain there untouched and you will be spending money on any of possible complications further down the road. 4. Until you really have nowhere else to go - be VERY careful about vintage watches. Some sellers do not hesitate to lie with a smile. If anything feels just a bit sketchy - do not proceed with the purchase. Chrono24 will not do anything against seller retrospectively even if the seller did something bad: if you where unable to spot the problem immediately - you're done.I wouldn't believe I would recommend eBay for buying watches (and I do not like it still), but their initiatives to protect watch buyers seem to be much better then  Chrono24 at the moment. Which is pretty sad, given that Chrono24 started so well and had some great potential. I mention this not to promote eBay, which I'm far from being a fan, but just to illustrate how some develop and innovate while others just relax. Also, if not for eBay checking on every watch now I would possibly put at least three stars for Chrono24.I must underline that I do not suggest that Chrono24 is all about scum sellers or fake watches. There are a lot of great dealers and a huge selection of watches, but buyer protection actually covers the delivery for the most part, so one has to be very careful and remember that to a huge degree and in many scenarios buying the watch on Chrono comes close to buying watch on the forum or social networks. Chrono24 does relay money so the watch has to be delivered and has to look like a real deal, so most obvious scum is avoided (thanks!). But anybody who would want to play dirty with faulty parts or long term defects - Chrono24 is a platform to fool the buyer and then some.PS: some math for perspective.  Out of 24 watches bought on Chono24, 4 where faulty in some form with sellers often plain lying about little or big things. Out of these 4 cases only 1 was resolved with Chrono's help. PSS: the latest vintage watch with a problem, which I'll have to bring to the dealer for a full service and pay by myself, magically appeared again from the same dealer. I thought I was lucky to find almost NOS piece, but I suspect the dealer has access to parts and from the manufacture or does something else pretty shady. Not sure I will be able to anything about it, 'report suspicious listing' is my inly option but even then I't be hard to even explain what makes it suspicious. So the dealer will continue to operate until next guy will buy the piece and again dealer will remain operational while buyer will most likely fall victim. Because Chrono24 is protecting dealers, not buyers.", "rating": 2}, {"title": "Very very good", "text": "Very very good. Thank you!", "rating": 2}, {"title": "Item is not authentic.", "text": "Date of experience: December 24, 2021", "rating": 2}, {"title": "China shop is quickly", "text": "Date of experience: December 02, 2021", "rating": 2}, {"title": "good", "text": "good but not very safe", "rating": 2}, {"title": "I had problems with a seller and…", "text": "I had problems with a seller and Chrono24 was not following up. I needed to keep sending them emails.In reply to Chrono24 reply. I reached out to the vendor directly after multiple followups with Chrono24 did not produce any replies.", "rating": 2}, {"title": "Can't transfer my my money from PayPal…", "text": "Can't transfer my my money from PayPal to my account.", "rating": 2}, {"title": "Not a great experience", "text": "Not a great experience. VERY hard to reach the seller, not easy to reach Chrono24 either, and the C24 person I finally spoke with was condescending and snarky. The delivery was miserable- misleading emails, delays, everything that could go wrong went wrong. Fortunately I'm not a watch collector so I don't have to deal with you guys much if at all. I feel sorry for anyone that does. Your escrow system seems to work okay as far as I can tell.", "rating": 2}, {"title": "Very disappointed", "text": "Very disappointed with the product and description of the product. I have not purchased from Chrono24 before and don’t plan to again. I feel like the damage to the watch that was purchased should have been describe in detail. I assumed that when the watch stated the condition it wouldn’t have this much damage. Every photo is a stock photo which I understand but description should state the amount of damage.", "rating": 2}, {"title": "was going to buy a watch and checkout…", "text": "was going to buy a watch and checkout could not determine sales tax.  said it might be added to sale.  i couldn't get answer and watch sold.  so the murky sales tax rule lost a sale.  i will not complete a checkout process without firm price to my card.", "rating": 2}, {"title": "Unhappy with foreign transaction fee.", "text": "They have charged me 3% of the foreign transaction fee. When I called C24 customer service in the US, a representative told me there would not be charged any foreign transaction fees. Totally false information.", "rating": 2}, {"title": "Not fraud - but close to", "text": "Allow sellers to insert adds with watches not in stock. Once you order and transfer the agreed amount you are told that the watch is not in stock but that other models are available - and they knew all along was not in stock. 2 weeks later the same model is for sale again - again its not in stock, they just want you to transfer money which crono24 can sit on and the seller again can try to lure you to buy another watch.", "rating": 2}, {"title": "Chrono24 is an easy for use platform", "text": "Chrono24 is an easy for use platform, it's gather many very good dealers and good offers in it but also gather very bad dealers and fake watches sellers which given under their name (Trusted seller) by chrono24! Chrono24 still needs to be improved to be more strict in thier terms, and in the relation between sellers and buyers, and need to act more serious and faster when disputes/complaints reported to them. Wish all the best.", "rating": 2}, {"title": "It's just OK", "text": "It's just OK, but it's need a more improve, and take the customer care more seriously than this, I had a complaint against a crazy seller (Silver Wing,Italy)who annoyed me by sending offers then he go mad when I refused his offers and insulted me by a rude way talking! And there no Block function to use, I didnt see a serious action from Chrono24 against him!! He still selling on there site!!...", "rating": 2}, {"title": "Escrow's great, but both ads and dealers must be policed better", "text": "The escrow system is a significant protection, and works well. The selection available is great. But to earn their money and good reviews, and in 2020 it's really way past time that Chrono did more. What I want to see is improved gatekeeping, so that what buyers see is always what they get, no surprises, no disappointments, no arguments. Chrono need to police every sale ad better, to stamp out the cunningly selective photography, the half-true statements, the absurd claims. They also need to get a lot smarter about which dealers they accredit - some of their \"trusted sellers\" have terrible reputations with those who are knowledgeable. Yes, buyer beware, and if it seems too good it probably is, etc, but it is just not practical to expect buyers to enforce their legal rights with ease after the event. The \"we're just a platform\" stuff might work for Facebook, but Chrono need to take more responsibility, please.", "rating": 2}, {"title": "Misrepresentation", "text": "Your site makes a great deal about your escrow program, your \"trusted partner\" slogans, and how \"if you see a green check mark on a listing, it's eligible for our trusted partner program\".So - I see a listing, it's got the green check mark, I think, \"great, this will be easy, as wiring money to a stranger in hopes he'll deliver  is really risky and dangerous - glad Chrono24 has my back!\" And frankly, that promise of protection via a chrono24 escrow program was what incentivized me to click the \"purchase\" button.But then, no! Wait! The site has the green check mark, sure, but I'm told AFTER THE FACT that, \"Oh, no, that program's not eligible in Taiwan, where the seller is.\"So WHY DOES IT HAVE THE CHECK MARK??I felt let down, lied to, abandoned, and on my own.And indeed, I was required to wire money directly, sight unseen. You tell me - how did chrono24 benefit me?Luckily, the seller was very reputable, honest, and delivered exactly what they said they would. But I felt alone, and I felt that chrono24 was * NOT* there for me, as they promised and, indeed, make a very big deal about.", "rating": 2}, {"title": "Buyer beware", "text": "Escrow service is fine.  Chrono24 does not hold sellers to a high standard.  Buyer beware.", "rating": 2}, {"title": "answer slowly", "text": "Date of experience: November 04, 2019", "rating": 2}, {"title": "I didn’t sell it on Chrono", "text": "Date of experience: November 02, 2019", "rating": 2}, {"title": "Never did I read anywhere that the…", "text": "Never did I read anywhere that the numbers on the date were worn off. From what I can see the watch works just not very happy with it.", "rating": 2}, {"title": "Vulcain golden voice square", "text": "Good evening, i set Poor for the following reasons: - a lot of step are done too quickly for me. When i add my product into the basket, i receive a lot of emails which warn me about the elapsed time before the end of promo. It is painfull due to the number of email. Those actions are done without checking the possible discussions between the seller and the buyer.- sending of package: whatever the company used, i dont receive any call to schedule the delivery. I receive only a warning in my mail box. And i need to schedule a new delivery after a professionnal trip => this point needs to be improved- positiv topic: a lot of watch in your website", "rating": 2}, {"title": "It is not good enough for individual…", "text": "It is not good enough for individual seller. No buyer review section, no sales record shown.", "rating": 2}, {"title": "Chrono24 is simply an escrow payment…", "text": "Chrono24 is simply an escrow payment site.  Do not expect assistance with poor sellers or product issues.", "rating": 2}, {"title": "Slow to process payment", "text": "Slow to process payment, the dealer and I where waiting for ages.", "rating": 2}, {"title": "Dear Chrono24 Team,", "text": "Dear Chrono24 Team,It took a while for me to decide whether to review you or not, but finally I have decided to do it.I have recently purchased a watch which had arrived in a different state than described. The differences were small, but still a difference which neither the seller, nor you wanted to recognize, while the watch wasn't cheap at all. I have approved the transaction and also reviewed the seller because I wanted the watch.  My intention is to understand if I can trust your website for future transactions or not.Although, I have provided you with clear photos and explanations, and you could have also checked the product's description from the sellers announcement or simply verified directly with the watch producer what can or cannot be a normal state of the product delivered, you have simply decided to not give attention to the facts and just forward an explanation already exchanged between me and the seller.I have to admit that comparing to your slogan, I am deeply disappointed by your reply and actions. You just disregarded simple facts and common sense supportive documents that should accompany an original watch. Thus, considering your first argument that a hand made product should have defects, totally disregarding the definition of a hand made product and the quality it is supposed to have ... it would mean that if I buy a Patek Phillipe Turbillon watch which is a hand made product or a hand made suit or a hand made assembled car, one should expect malfunctions and defects ... because it is hand made?!? The \"hand made\" tag means everywhere in this world, the perfection and most precise attention to details, thus, exactly the opposite of your understanding and reply below and to the reply that a professional and official seller of watches delivered as argument and excuse to receiving a different quality product than the one presented in his announcement. Another remark in your reply was related to the handbook of the product. Have you conducted even a minor check on this?!? Do you really believe a top product can be sold without its proper handling instructions and that a renowned manufacturer can provide only a general handbook to a specialized product without explaining its functions!?! I have sent you pictures pictures presenting the handbook of the Pontos S Diver watch, showing that this watch has its own dedicated manual and not a general one, as the seller said and as you seemed to support the seller's affirmation! On the same topic, your other recommendation below was to have a look on the watch's warranty card ... if you have read the dialogue between me and the seller you would have noticed the seller said the watch doesn't come with a warranty card, while it should have had to, being an original product accompanied by its original documents (as shown in its description). I have other Maurice Lacroix watches and all came with warranty cards, all being bought from Christ dealer in Germany during different years. Another aspect mistreated from your part.Concluding, the facts are that we have a description for a new, original without defects watch, accompanied by its original box and original papers, that in reality came with a threaded bracelet, without its original handbook and without its warranty card, On all these differences you concluded they do not exist or if they do they are normal and there is no case to debate upon or issue to a claim. Considering all the above reflections and supported arguments, I just cannot understand how or if you really screen the sellers and even more, how you handle the complaints ? Do you even have the minimum knowledge and information to deal a complaint related to your main activity ... watches? How can one trust future transactions for top rated watches on your website when you do not pay attention to simple facts considering the presented incident?I really look forward to your reply and explanations.Regards,", "rating": 2}, {"title": "Disappointing", "text": "Disappointing!  I thought I was negotiating an all-in price for a watch.  As it turns out, I was sent an additional charge for customs.I will not use your service again after buying a few watches from you.  I can't tell what my FINAL price will be.", "rating": 2}, {"title": "CHRONO24.COM CHARGED ME TWICE FOR THE AGREED COMMISION", "text": "I decided to sell my watch through this site . The commision  would be 6.5 % and would be subtracted from the money the buyer deposited in their account . Now here is my problem . The site sent me an e-mail asking to be paid the commision in advance via skrill payment system . I paid the commision asked , using my credit card , and no one seemed to take that into consideration . They said they wiil subtract the commision amount from the money I am about to receive from the buyer of my watch . I contacted the headquarters in Germany and was informed that they will refund me for the commision  I paid through skrill  BUT IT IS A BIT COMPLICATED ,they state . I lost all good faith in this site .", "rating": 2}, {"title": "Good marketplace, escrow is key, but don't expect them to cuddle you.", "text": "You could argue this was a case of the Chrono 24 escrow system working well. On the other hand, when I reached out for reassurance and assistance at a time when I was becoming concerned about the bona fides of an inexperienced seller, a) it took them quite a while to respond b) first response was just formulaic, c) second response was basically a shrug of the shoulders. Fortunately, all ended well, but after a very long wait and a lot of nail-biting. Moral - do NOT EVER bypass the escrow system, and DON'T release any payments until YOU are totally satisfied on absolutely all counts. I'm sure glad that I didn't!", "rating": 2}, {"title": "My seller was amazing but....", "text": "My seller was amazing. Chrono24 was a complete pain to deal with though. They take forever to respond to anything. Also, for some reason there is no way to purchase anything with a separate billing and shipping address. My card was constantly declined, and they finally had to change the addresses, then change them back to the shipping addresses which all took over 5 days. I would definitely not recommend the site. My seller was super responsive and great to deal with though. I’m thankful they put up with Chrono24 as well.", "rating": 2}, {"title": "Comission price must cut from real sell…", "text": "Comission price must cut from real sell price. Not for the first seller price. I will not use this app again.", "rating": 2}, {"title": "Unable to use AFFIRM", "text": "Date of experience: August 13, 2019", "rating": 2}, {"title": "Chrono 24 didn’t do anything but…", "text": "Chrono 24 didn’t do anything but collect the money 💰 No one checked with me on the transaction or communicated with me before or after Absolutely zero communication", "rating": 2}, {"title": "Delivery addr not same as Buyer addr badly handled", "text": "Their Website cannot properly handle purchase if the delivery address is different from the buyer address. Verifying the delivery addr is one thing. Destroying the profile(billing) address with the delivery address is just wrong. Also the credit card was declined as a result of this. Many calls to support by buyer and vendor were required to resolve issue. A herculean effort was required. There is NO excuse for this. I sent in screen shots of other site's proper handling of this type of order.", "rating": 2}, {"title": "Not terribly responsive and portal was…", "text": "Not terribly responsive and portal was difficult to use.", "rating": 2}, {"title": "My Transaction ID TC-1473656", "text": "My Transaction ID TC-1473656, Bought a watch for 20500, agreed with the seller, but chrono24 took 20705 usd, I called them and instead of finding a solution they were making excuses.... Just be careful when you buy from this web sight, they say complete transparency, but you pay one thing and they charge you some thing else, and than , best of luck to get your money back", "rating": 2}, {"title": "Do not trust \"trusted checkout\"", "text": "I ordered a watch in february using trusted checkout. It has not arrived. It is july now still have not recieved a refund. They claim they cannot do anything until the sellers package deliverer (Italian Post) is investigating. They have benne \"investigating\" for more than 2 months. Seller does not respont to any messages by me or Chrono24. Still I am not getting my money back.You should not trust \"trusted checkout\", it will not protect you.Update: After ~2 weeks of threatening them with EU authorities, and writing reviews on every site that counts, they actually transfered my money back. That at least deserves one more star, but since I had to go agressive, and because of their lack of regular updating me on the case, I still would not buy again through Chrono24. A pity. I hope they will act on this, and get better.", "rating": 2}, {"title": "Better vendor diligence is required", "text": "Better vendor diligence is required.  You sellers should not be allowed to advertise items they do not have in stock.   This is on you.  I never have this issue on other high end watch online platforms..So I look at chrono 24 only last, and not always.", "rating": 2}, {"title": "I already sent you emails and I…", "text": "I already sent you emails and I informed Michelle about my discontent.", "rating": 2}, {"title": "There is a reason why many dealers…", "text": "There is a reason why many dealers don't want to sell watches via trusted checkout anymore. The fees are too high, which results in that you get a better price if you contact the dealer directly.", "rating": 2}, {"title": "If there's an issue with your watch, prepare to wait", "text": "The ability to purchase a watch with Chrono24 was quick and easy.However, when a defect was found with a new watch I purchased from a vendor, Chrono24 took over a month to issue a refund to me after I returned the watch.  The vendor had instructed Chrono24 to issue a refund (as all payments go through Chrono24 as a middle man), however Chrono24 never did.I had to contact the vendor outside of the Chrono24 website, as I received only one response out of 6 follow up emails to Chrono24 about the status of return/refund.  Luckily, the vendor was prompt and on my side, and after several weeks was able to re-facilitate a return from Chrono24.Had it not been for an exceptional vendor, I doubt I would have received my refund from Chrono24's escrow services.  Over a month post return with no watch, no responses to follow up emails, and no refund of money from Chrono24 left a very sinking feeling in my stomach and a decidedly Poor experience with the site.", "rating": 2}, {"title": "I could not find a valid serial number…", "text": "I could not find a valid serial number on this watch, otherwise I would have given 5 Stars. I haven't taken it to an appraisor yet, but sure hope it is legit.", "rating": 2}, {"title": "My email was answered late.Otgerwise…", "text": "My email was answered late.Otgerwise the site seems fine", "rating": 2}, {"title": "I wrote to you that the clock does not…", "text": "I wrote to you that the clock does not work. No answer. I do not know what to do. The clock does not go.", "rating": 2}, {"title": "Very slow service and not a strong customer service", "text": "Not impressed with the little issues we went through with one of the sellers. And have not received much help from Chrono24, even though i've purchased three watches in one month. Very disappointed of the non communication and help honestly.", "rating": 2}, {"title": "I was overcharged for the purchase of a…", "text": "I was overcharged for the purchase of a watch. The charge did originate from MasterCard rather than Chrono24 but the Chrono24 staff were quite unhelpful and did not respond appropriately to my queries regarding this matter. I have never ever been charged more than the amount displayed on any website, so I suspect that there is an issue with the way the Chrono24 merchant account is classified. In addition, the FX rates applied to local prices are too far away from the market. They advised it is never more than 1.5% but this is clearly a nice business for them as they can pocket the difference. I would much prefer to choose to pay in foreign currency as my bank has tighter FX spreads.Beware of buying from Chrono24 unless you want to pay a quite substantial premium and then have to deal with poor service when you enquire about this.Shame!", "rating": 2}, {"title": "Very poor communication", "text": "Very poor communication.  I tried to call multiple time and sent multiple message, I didn't not get any answers/was very frustrating.  I got the watch but unfortunately it is not working, not sure if it is the battery but still I should have gotten the working watch.  Thank you for following up. Amal Bertrand", "rating": 2}, {"title": "The process started off fine", "text": "The process started off fine.  I ordered a watch as a Christmas present for my wife in early December.  The web site said delivery by 12/13.  I tracked the progress through the DHL website.  According to them, my package traveled from Barcelona to Madrid to Miami (where it was held up for some unexplained reason) to Cincinnati to Miami (where it was held up again).  I called Chrono and DHL multiple times to find out why.  I was finally told I owed duty on the item  It would have been nice if I had been told this in the first place.  I paid the duty.  Several days later the package was at Washington National Airport and held up again.  I made several more calls and was told it was out for delivery on New Years Eve.  I waited all day at my office and it never arrived.  The following day, I found the package sitting in the rain on the front porch of my house.Not sure who is to blame but my experience was less than stellar.", "rating": 2}, {"title": "I was missinformed about percent of the…", "text": "I was missinformed about percent of the price which has to be paid . For ex for start price I was suggested to pay for the qute of regular value standars. When I saw the selling was not working I drop the price and the initial percent remained the same. After making some offers for a few watches many many mails came after asking if I am still buying something with a not user friendly soft", "rating": 2}, {"title": "I had a bad experience with a seller", "text": "I had a bad experience with a seller, I turned to Chrono24 support for help, and you did not react. I consider this to be inappropriate.", "rating": 2}, {"title": "I have messaged chrono24 regarding a…", "text": "I have messaged chrono24 regarding a watch i want to purchase and have still no response not very good service . And not much confidence.I have now spoke to chrono24 and aslong as my purchase arrives safely which i will be paying for on monday i will re edit my review.", "rating": 2}, {"title": "I reached out to Chrono24", "text": "I reached out to Chrono24 - with no response at all.I had an experience with a watch dealer who did not honor his side of the trade - by sending me a different watch than displayed.I involved Chrono24, but never heard back from them.", "rating": 2}, {"title": "Not as user friendly as it could be", "text": "There are too many annoying pop-ups and prompts, and a lot of problems submitting price suggestions.", "rating": 2}, {"title": "Chrono24 send a huge amount of spam…", "text": "Chrono24 send a huge amount of spam email. Also disguises the costs of using trusted checkout, actual cost is 1.8% by forcing you to exchange money with them and not at the bank card rate.", "rating": 2}, {"title": "bought a watch from a seller", "text": "bought a watch from a seller - didn't get the watch for 4 weeks and then finally he messages me that there was a family issue - i cancelled the purchase - the one good thing about chron24 is money was held in escrow so no money was lost. The second time i tried to buy a watch through a private seller who was a complete liar and scam artist - kept on having different excuses when i was ready to pay - and then magically the watch was stolen from his car(Give me a break). The third time a send numerous messages to a private seller asking him questions about his watch - never bothered to replyI'm done - would rather use EBAY", "rating": 2}, {"title": "The site is good but the repeated…", "text": "The site is good but the repeated rejection of credit card (processing then refunding) is ridiculous. Have tried with several transactions and no adequate explanation or transparency on why credit card which works fine for everything else online and offline is rejected. Just 'security reasons' This requires additional fees and effort to arrange bank transfer.", "rating": 2}, {"title": "Very disappointed", "text": "Very disappointed . The watch is too tight . Secondly he claimed to have the watch in mint condition but glass has scratches and very annoying to wear and see the scratches . Wish he had done something to change the glass before shipping.", "rating": 2}, {"title": "poor customer service dishonest company", "text": "No response to customer service emails about transaction. Also you guys block me from contacting merchants - I call customer service and I’m told block should be removed in a few hours. Week later I’m still blocked. I’m a paying customer - ie you’re making money off me. Least you could do is be honest.", "rating": 2}, {"title": "Took away the pleasure", "text": "Not enough information given to complete bank transfer and when I called Chrono24 they gave me the wrong bank information.  After several calls and emails I gave up and used my credit card for which I had to change my credit amount. Totally took the pleasure out of buying my first Rolex. Zero points Chrono24 although the dealer was very good and helpful.", "rating": 2}, {"title": "No feedback all generic answers", "text": "Date of experience: July 16, 2018", "rating": 2}, {"title": "I wanted to give you more stars but…", "text": "I wanted to give you more stars but after 3 purchases you do not even bother to call back or send back a simple email reply. Very disappointed by your service.", "rating": 2}, {"title": "Dissatisfied", "text": "I wired the agreed amount for the watch, according to the seller. Chrono24 required me to pay $150 extra, but could not explain why. After approximately 2 weeks of communication over email, the only responses were that I needed to send more money. I sent various receipts from my bank, as requested, yet still got nowhere.  There must have been a problem with wire fees, but I do not feel this should have been my responsibility, particularly since Chrono24 could offer no explanation other than I needed to send more money. I will not do business with Chrono24 again. The seller, however, was wonderful.", "rating": 2}, {"title": "Health Warning", "text": "Health Warning - Please note that the price posted by the Chronos24 may not be the \"all-in\" cost to you.   When purchasing from Europe to the US, you will be required to pay Import Taxes.   Normally not a big deal if this was part of the quoted price (along with shipping, fees, etc.), but they DID NOT DISCLOSE.   As such, you're paying a few hundred more.   This could impact your decision between buying on Chronos24 vs. your local US Dealer.>>>>>>>As a follow up, this company does not seem to get it - they respond by saying that they include a disclaimer on their webpage - this is not the point.   A seller should provide full transparency on the cost - I bought a Nomos watch on this website since the Cost + Shipping was less than the cost to buy from a local dealer in NJ.   However, they failed to disclose the additional Import Taxes.  As well, you can't unwind the deal since they charge an egregious return / restock fee.", "rating": 2}, {"title": "A lot ads no responses", "text": "A lot ads no responsesI submitted questions to ads, some no responses, some the item was already sold, most didn't ship to australia.Back to Ebay I guess. Hopefully this platform will be ready one day.", "rating": 2}, {"title": "It was some problems I had from the…", "text": "It was some problems I had from the beginning when I first used my smartphone for  process of  my purchase it wasn't  so smooth as I thought it would be honestly I was stuck mad from the checkout I attempted many times it didn't let me I thought  it was the problem of my visa card I so contacted my bank to find out whether any problem of my visa account replied of everything normal. I finally called in the customer service line of Chrono24 HK realized that the webpage of company does not support mobile payment I was directed to do the payment process on the LAN computer then it finished. It would be nice that ChronoHK would soon have everything ready makes purchase of customers happy and easy.", "rating": 2}, {"title": "BEWARE WATCHES OF BOND STREET!!!", "text": "Personally, I had a very poor experience with Chrono24. I ordered a Gold Rolex Daytona from Watches & Jewelry of Bond Street London, tried it on, didn't like it, returned it.HOWEVER, I made the vital, uninformed mistake of removing the sticker on the back of the watch!! This reduced the value by almost 50%. BE AWARE!! for the uninitiated!!!. The seller also tried a wear & team scam to reduce it further so personally I would avoid Watches & Jewelry of Bond Street. You just need one call with their team to know that they are questionable. Calling Chrono24 for any type of intervention, support explanation is also a worthless exercise. They are - like so many these days - just intermediaries with a  nice website, living off of  a commission on the sale.     OVERALL: BEWARE OF THESE TWO OUTFITS!!", "rating": 2}, {"title": "The customer service team in HK were…", "text": "The customer service team in HK were not so supportive. I did not realize that I called them on a public holiday, however I left a message but they did not contact me back. I had to call the office again to get to talk to an agent. Also, Chrono24 should also have options for customers to pay in the currency they want. In my case I wanted to pay in USD, the originally advertised currency on the product's page, but the agent told me that I could only pay in EUR which is the currency of Germany where I wanted the watch delivered. If so, why was this rule not written in the Terms & Conditions? This made me unnecessarily have to pay more to the Thai bank who issued my credit card eventually in Thai Baht by over 10000 Baht, about the same as a new graduate's monthly salary which should not be considered trivial here. If the payment had been processed in USD, I would not have had to pay this extra sum.", "rating": 2}, {"title": "Feedback to myparticular inquiry was…", "text": "Feedback to myparticular inquiry was unacceptable. In addition and regardless of my particular inquiry experience, feedback should be within 24 hours as a default, please reconsider policy.", "rating": 2}, {"title": "No answer to my email so far and the…", "text": "No answer to my email so far and the watch did not arrive yet. AND the automatic filing on the website to report this does not work!", "rating": 2}, {"title": "problem with another seller", "text": "I have problems with another buy but very late response and chrono24 said the buying is not covered even I do all the processes through chrono24.", "rating": 2}, {"title": "Raw service", "text": "1) wrong delivery time are stated (it is not deliverytime, but time to send the parcel, which misleads the buyer)2) there is no intermediary for payment - the payment is directly to the seller and is not protected against dishonest buyers", "rating": 2}, {"title": "Expensive items, cheap customer service", "text": "No reply to simple communications to the Customer Services.  Lots of automated emails which suggest no one is listening.  I have used the site twice to buy expensive pieces but this quality of service is unacceptable and I will not use it again.", "rating": 2}, {"title": "No answer to some mail requests", "text": "No answer to some mail requests. I can't understand that they are so busy to respond a mail. Bad customer care", "rating": 2}, {"title": "Support center does not work …", "text": "Support center does not work effectively. After a week, still no reply to my complaint. They reply only by their judgment.", "rating": 2}, {"title": "Trusted checkout is a mess", "text": "Generally, I like the Chrono24 website and like the idea behind their trusted checkout as well.I found a watch that I liked and decided to see how the trusted checkout worked for myself and that was a big mistake. I ended up paying €70 because of the “free” checkout for nothing. The trusted checkout is a mess in the technical sense. When I contacted them, the customer service didn’t make any sense either and weren’t serious about helping.After this experience, I will not use trusted checkout again and I wouldn’t recommend anyone else to use it either. It would be much better, in my opinion, to contact the seller and deal with them directly.Robert", "rating": 2}, {"title": "Bad experience with Chrono24", "text": "I tried to buy an Omega watch recently using the site and ended up having to ask for 5 or 6 offers from dealers. 1 dealer tried to sell me a completely different watch, claiming the watch was no longer available. This same dealer had had 2 adverts on the site. Other dealers gave offers back but with the delivery time 4 times as long! And a couple said that the watch could not be shipped to my destination... which was Monaco and one dealer was next door in Italy and the other in Germany... and one of these replied over 3 weeks after the offer was requested.In the meantime Chrono24 kept sending me automated emails asking my feedback about how the negotiations where going. I replied about what was going on and half expected a call or a reply. But since then nothing form them. Yet they kept sending me emails asking feedback....I finally went with one of the dealers who said the delivery time would be 2-3 weeks (ilo initial advert 3-6 days), as on calling him he confirmed a supplier had the watch in stock.That was 3 weeks ago and still no watch. The Christmas period hasn't help and an excuse that the supplier's delivery company never picked up the watch. But I was promised it would then be sent directly to me. Arrived home today new years eve and no watch...I called Chrono24 before Christmas, the first time there was an automated voicemail to say they could not take any calls for the day...Reached them the next day and explained the whole situation and they did nothing more than say they \"understood my frustration\" but there was nothing they could do. The one good thing, I complained about the endless feedback requests and seems they stopped these...Have sent emails to Chrono24 today and received an automated response that as their \"marketplace becomes more and more popular\" they wont reply until 7 days....Despite all the nice watches they have advertised I wont be recommending Chrono24 to anyone based on my experience... Especially as there is no guarantee how many of the adverts are fake...", "rating": 2}, {"title": "I ordered a watch and the buyer …", "text": "I ordered a watch and the buyer declined the order, worse it took them like 10 days to do so...", "rating": 2}, {"title": "You need to accept American Express.", "text": "Date of experience: December 18, 2017", "rating": 2}, {"title": "I didn't receive a response for almost …", "text": "I didn't receive a response for almost a week. And when I got a response they didn't change the address to my work address per our call. Instead it was sent to the opposite end of NY where I had to go to a branch that was not accessible by public transportation.When I was there I almost could not pick up the watch because the FedEx demanded that my ID address matched the address of the shipment which doesn't make sense.If I'd received a response early on they could've easily changed the shipping address to my work address and this all could've been avoided", "rating": 2}, {"title": "Shipment took long time", "text": "Great brands, great deals, wonderful dealers, but the only thing that i didn’t like the shipment took long to receive, 2 weeks or more.", "rating": 2}, {"title": "Be careful and beware - good site, bad customer service if you have dealer issue!", "text": "Great reference site, so long as you do not have issues with a dealer. Having used the site before I gave a great review... however my second experience was the opposite. The following review is not to be interpreted as malicious/sour grapes. From a professional standpoint the dealers involved in this experience shall not be named... so here goes...Firstly, if you use Chrono24 do your due diligence on the seller - as Chrono24 do not appear to vet them whatsoever.My story goes like this... I purchased a watch from a seller in Germany, and asked prior to purchase if there were scatches/defects. I was told no, and the watch itself was advertised on Chrono24 as '1/mint' and 'unworn'. When I received the watch, it was sent from Latvia. It then turns out the dealer was based in Russia (so I actually purchased from an affiliate who had never seen the watch). I checked the watch, and the movement was ok. However the deployment did not work and there was a scratch/chip on the lug.When the affiliate was slow to respond to my issues, I contacted Chrono24 who told me they would generally intervene and come up with a fair solution before the money was released to the dealer. I felt this was fair, and said that I wanted to keep the watch as I had ordered a new deployment. I had photos and confirmations from the actual watch manufacturer and their UK distributor confirming there was an issue with the deployment. After this I was only ever told to return the watch (which I would have to pay for myself, and it would only be refunded once the dealer received the watch in good order). My level of trust was gone. I suggested a fair solution would be for a contribution toward the deployment and compensation for the scratch/chip - my suggestion was what it would cost the dealer for the watch return to Latvia (c£80) and for Chrono24 to offset their sales commission for allowing a dealer to misrepresent a product on their site. Still a lot less than the cost of a new deployment, however this outcome would share accountability, and would be a reasonable and equitable solution.It was not to be... I was again told to return the watch at my initial expense, to be refunded once the dealer confirmed everything was ok.The bottom line:- Be careful- Chrono 24 are very dealer centric, and do not seem to have a duty of care to their customers/purchasers.- A commission is more important than a satisfied customer- They do not vet dealers- They allow misrepresented adverts- There is no recourse or penalty for dealers that sell items that are not honestly described.- Customer service/experience has infinity to go before it reaches the level of Amazon or Ebay.Good luck with Chrono24, and don't forget to cross your fingers (and toes!)", "rating": 2}, {"title": "Everything was good except for payment verification time frame.", "text": "Everything was good except for my payment. I paid early in the day and my credit card was billed. It did not get verified with Chrono24 until the next day. So, this delayed shipment a day. Verification should have been accepted the moment it said approved during the payment process. I highly suggest Paypal if possible. Fees are less as well. I definitely won't be paying through Chrono24 in the future.", "rating": 2}, {"title": "Leave plenty of time for transaction", "text": "Very slow to respond to queries Went through their trusted checkout for added comfort Did bank transfer for exact amount only to be told days later that a significant amount was still owing which was incorrect eventually rectified but delays almost resulted in issues with delivery as I was traveling around during purchase", "rating": 2}, {"title": "May work well for dealer sellers, not so well for individual sellers", "text": "Chrono24 now charges individual sellers at the time of listing, based upon the listing price, unlike other online services that charge at the time of sale, based upon the sales price.  While Chrono24's business model provides for a full refund if the watch is not sold within 6 months, two months following listing I received an email stating that unless notified otherwise by me within 48 hours, they would assume the watch had sold and remove the listing.  This strikes me as an unfair practice that in my view nullifies the 6-month refund guarantee.", "rating": 2}, {"title": "Only troubles, no value add...", "text": "I bought a corum watch from a so called \"trusted reseller\". First it was shipped losely in a box with some scratches. I asked for a partial refund - forget it. Then i realized the certificate wasn't included - the reseller managed to send it to the wrong costumer somehow. The reseller than offered me 100$ deposit until i get the certificate but it took several months and dozens of mails until finally something happened and in between chrono24 took less responsibility with every day passing. The didn't support at all and at some point even asked me to contact the guy who wrongly got my papers myself! After receiving the certificate (for which i had to send the 100$ back first of course...) it was for a different model with a sticker on it showing my model-nr...just terrible and i didn't feel like \"trusted checkout\" gave me any value, all i received were consolations and appeasements.", "rating": 2}, {"title": "Misleading availability", "text": "I can't really fault Chrono24 but the service I received from their Trusted Seller (since 2008) Bößl & Schmidt was appalling. \r I contacted that dealer to check whether if I ordered a Tag Heuer watch, advertised with 2-3 week availability, would arrive in time for my wife's 50th birthday. I was told it should arrive in time (Dec 1 for Dec 7) and duly placed an order (Nov 16).  As Dec 1 passed I became concerned that it would not arrive in time. \r I contacted them again to be told that they now couldn't give me a delivery date.  Infuriatingly and misleadingly their advert on Chrono24 now showed a 6-8 day availability, down from 2-3 weeks. \r My wife's birthday came and went, Christmas came and went. (Fortunately my wife is understanding).  Still no feedback on availability. \r My enquiries in the New Year remain unanswered so I cancelled requesting a refund. Fortunately I used Trusted Checkout and Chrono 24 refunded promptly. \r I've since ordered elsewhere and will never use this service again.", "rating": 2}]