[{"title": "hi there I asked for a refund due to…", "text": "hi there I asked for a refund due to your money back guarantee and have not heard a response thank you", "rating": 2}, {"title": "they do not respond to emails or calls", "text": "Date of experience: September 25, 2024", "rating": 2}, {"title": "Didn’t honor discount code.", "text": "I was given a discount code from liftmode to use 3 times. I only used it once. Customer service did not help. I looked for the product elsewhere and found it a lot cheaper. The exact same description and strength. I have spent $1000s at liftmode and they lost a customer over an 8% discount.", "rating": 2}, {"title": "How LM is Ripping Off Customers: $102 for Shipping to Switzerland vs. iHerb's $14 (DHL Express). Uncovering Shocking Shipping Costs.", "text": "Online shoppers beware! LM is overcharging for shipping, with rates up to $102 for the same product/weight that iHerb ships for just $14. iHerb also offers free shipping for orders over $40, while LM's cheapest shipping option costs $37. Import taxes are included in iHerb's prices for just $2.16, but with LM, you might end up having to pay some $30+ fees & taxes (for orders over $60). Furthermore, LM's web app is painfully slow, causing frustration at every step, while iHerb's web app is lightning-fast and effortless to use. Spread the word and let's hold these companies accountable for their deceitful shipping practices.", "rating": 2}, {"title": "The Penibut is ineffective", "text": "Phone service and shipping was fine but I am a first time user of phenibut (so no tolerance) took a gram last night (recommended maximum dose) absolutely nothing.. took 2.5 gs tonight 3 hours in still feel nothing..this stuff is supposed to be pretty powerful from what I read. Keep in mind I’m a relatively small guy (150, 5’6) so it wasn’t a case of underdosing for my size. Just throwing it out there for future buyers, I don’t know where else you can get phenibut but I recommend trying another place.", "rating": 2}, {"title": "Challenging overall experience ", "text": "The website is, and has always been, extremely buggy. Multiple emails to customer service or responding to promo email bounce back. It took me 10 days to successfully order my most recent product. Not sure why I'm still ordering from you -- other than I like the formulas. ", "rating": 2}, {"title": "Order not delivered after two months", "text": "I have ordered products from Liftmode twice with no issues, but two months ago, I had ordered some Phenibut and 5-HTP and I have still yet to receive it. I have contacted UPS and gotten confirmation it couldn't be found. I have emailed their support several times, asking for refund or reshipment, hoping for a response, but with no answer.I don't feel it's right, that I have to write a review, just to get their attention.", "rating": 2}, {"title": "Lower potency on COA than claimed", "text": "COA batch testing results were from 2/2022 with eurycomanone strength under the claimed >= 10%, coming in at an actual 9.66%. It appears that at one time the eurycomanone content maybe could’ve been 10% or above, but in two years the potency has obviously degraded, if the potency claim was ever actually true. I normally would have given the product 3 stars and not higher  because I used to get the same product from Liftmode at 14+% eurycomanone for the same price. However, even at the sale price, the price is so high that I expected it to be exactly as claimed.", "rating": 2}, {"title": "5/5 quality; 0.5/5 cost, locality rewards", "text": "Quality is 5 stars for Magnolol, honokiol, baicalein, rhodiola, THH, silymarin, and kava (both 25% & 60% versions). I can confirm the purity of the kava extract (60% kavalactones), magnolol & honokiol, as they are all fully soluble in DMSO & USP grade ethanol (99%). But for cost I can only give 0.5 stars- i am a platinum member across a few of my accounts & have spent thousands of dollars over 2 years. But now suddenly active coupon codes will not work on my accounts. Yet they appear to work for everyone else. This is extremely frustrating given the recent price jumps on many of the products I rely on for my herbalism upstart business.", "rating": 2}, {"title": "could be my fault?", "text": "This is probably the fault of ups, but I was charged 50$ duty on a 100$ package coming to Windsor, Ontario, Canada. That's insane. The products themselves were packaged good and looked good. I tried several doses now and got to admit I have not felt much of anything. I tried double the dose as well with same results unfortunately. Maybe it's me, I'm not sure. Company is great and professional, just not sure if I will end up ordering anything again..", "rating": 2}, {"title": "No mood enhancing! ", "text": "Very good ordering, just not excited about what I received?!?!I’m not understanding what or if you are supposed to be in a better mood after taking this….same mood I had before taking them. Waste of money for me. ", "rating": 2}, {"title": "Tough to order if using a credit card", "text": "The credit card processing seems like it is all messed up. I asked around on Reddit for help(as other people were having the same problem), with no luck. I had to mess around with imputting my info for days, eventually not knowing how I got it through, but using a private browsing tab helped.I feel like they should just take credit card orders over the phone and not offer it online if this is going to be a long term issue. I know they must be loosing some business when people just give up after the first or fifth try.", "rating": 2}, {"title": "Your guys website is really bad, ", "text": "Your guys website is really bad, at least on Android it's extremely hard to navigate.   Haven't tried any of your products, so I don't have any opinions on those just yet.    This is just a review for the website itself. Seems ancient. Maybe on my PC it wouldn't be so bad, but I had to try like three times to place an order on my android.", "rating": 2}, {"title": "Mixed Emotions", "text": "I appreciate the fast shipping as well as the free samples of Baicalm, however none of this stuff works. Not the kanna, not the baicalm, and not the mood lift. Phenibut seems to have been the best thing going for this company and they got rid of it, very unfortunate.", "rating": 2}, {"title": "Recently bought phenibut and the…", "text": "Recently bought phenibut and the quality of it was very poor. The powder is very flaky and almost brittle. On top of that the benefits that i usually feel from this are absent. I believe i got a bad batch.", "rating": 2}, {"title": "Never received product and after…", "text": "Never received product and after talking to customer service she told me I have to wait 15 days to see if they will send out another one. I've ordered a lot and always had good experiences in the past", "rating": 2}, {"title": "The first person I called", "text": "The first person I called, couldn’t help me and said he would call back. I waited over 20 minutes and called back. The second person apparently had no record of the first person interaction with me. They could not charge my saved cards to my purchase. It was a difficult and awkward process to get something ordered. Thank you.", "rating": 2}, {"title": "The ordering was fine, but did it ship??", "text": "The ordering was fine, but I don't believe my order has shipped even after 6 days. Or at least doesn't show that it's shipped, nor does the tracking # work. Unacceptable", "rating": 2}, {"title": "Haven’t received any tracking number…", "text": "Haven’t received any tracking number still and got no reply after days of contacting the “support team” by email", "rating": 2}, {"title": "Package didn’t arrive and i got charged…", "text": "Package didn’t arrive and i got charged for shipping when it was more than the actual package", "rating": 2}, {"title": "Liftmode did well as a company", "text": "Liftmode did well as a company! Fast shipment, informed all along the way, etc.... But phenibut is not recommended. Dismal hangover the next day, with a barely noticeable effect while the chemical \"came on\" the prior day. Phenibut is just not ideal imo.... There is a reason the FDA/DEA doesn't care about this chemical-- it just sucks lol", "rating": 2}, {"title": "Your Inventory In-Stock vs Automated Notification Email system is broken & tech support seems clueless", "text": "got email saying something I wanted was back in stock. immediately went to website using link in email, web page showed it in stock, tried to put in cart but web page refused to allow, saying it was not in stock. started chat session, support said was not in stock. I reiterated I'd gotten an email saying it was and asked them to check. they checked, said it was in stock & there was a glitch & that sysadmin would fix it in a few min.  left chat open, in a few min got notice the glitch was fixed. purchased and asked support to combine the order with prev order made the day before that was still shown as being \"in processing\". he said they would \"try\". so an hour or so later I get an email saying my first order had shipped, then a few min after that, got a follow up email from support saying the item in my second order (oblasts) really wasnt available after all and did I want to wait a couple weeks for it to be shipped as soon as back in stock or did I want a refund. I said I would wait, but they should give me free shipping because of all the extra hassles.  got no response. a couple hours after that, got another automated email saying the supposedly out of stock oblasts had shipped (separately from day before's order they were supposed to have been combined with), and no indication of waived shipping fees.  The first order the day before also had in-stock/out of stock issues. Got email saying item I wanted was now in stock (90 ct NeuroLiftBalance), so I went to the website to order. Web page said not in stock. Initiated chat. went back & forth with support about why was I getting emails that items were in stock when web page would not allow order.  Same deal, had to get sysadmin to fix glitch before I could purchase. Y'all need to get your act together. This is ridiculous.", "rating": 2}, {"title": "You were out of the product size I have…", "text": "You were out of the product size I have ordered in the past. Please notify me when you get Phenibut 300 mg in the 800 count jar again. This works perfectly with the program I'm on.", "rating": 2}, {"title": "Address was flagged as \"invalid\"", "text": "My long-term ship-to address was flagged as \"invalid\" requiring further contact and causing delay in receipt.", "rating": 2}, {"title": "I paid $40 for next day air service and…", "text": "I paid $40 for next day air service and I still have not received my package", "rating": 2}, {"title": "Paid $30 for 2 day air and received…", "text": "Paid $30 for 2 day air and received package 9 days later. Overall product 100% though.", "rating": 2}, {"title": "Never Received my Package", "text": "Never Received my Package USPS says my package was delivered but it never showed up. I tried to contact liftmode customer service, but there was no one to answer my call.", "rating": 2}, {"title": "Service is good but the last batch of…", "text": "Service is good but the last batch of product was inferior and did nothing.", "rating": 2}, {"title": "Well thanks for the discount I even…", "text": "Well thanks for the discount I'm re editing this because I was in a rush last time but my account was locked I tried to change my password like 4 times so then I went to my laptop no deal then I had luck but I needed that free 2nd day air but no luck so I call in and make the order i even tried to remove the discount and add a item to try and get the amount up to 150/200 and the guy told me there was never any free second day air witch is what I'm upset about I have receipt s saying so I knocked my order down  to 100.00 and paid (still waiting after 8 days) I use to could get free second day air and now I have to pay for second day air  mean you refuse to sell phenibut people in Alabama even though it's not illegal there just banned from retail sale in Alabama so I'm having to order it to my wife and her forwarded to and now it's more of a hassle and takes way longer", "rating": 2}, {"title": "I had to pay duty fees that I didn’t…", "text": "I had to pay duty fees that I didn’t have with the same products with another company", "rating": 2}, {"title": "customer service is good/not the product this time", "text": "customer service is good. the only reason i gave them 2 stars was for the quality of the 200g of phenibut. earlier in march i had purchased a 100g of phenibut and it was pretty good, so i decided to turn around and stock up, so i purchased the 200g and it turned out to be subpar. it is clear that it was either from another maker or just a bad batch. i am usually pretty satisfied with the pruduct from liftmode, but not this time. a bad purchase for 70 dollars", "rating": 2}, {"title": "I love Lift Mode and it is hard for me…", "text": "I love Lift Mode and it is hard for me to put a low star. I ordered a 5g order of Resveratrol to see if it was what I was looking for. You have to make sure it is white per Dr. David Sinclair or it is no good. The first order was perfect. So I ordered a larger order and my powder was brown when I opened it. I am by no means an expert but it is a totally different color than my first order. Now I have a lot of bad Resveratrol.", "rating": 2}, {"title": "Uncoordinated UPS Benchmarks", "text": "I paid 200 dollars for UPS Worldwide Express, which was over 3x the price than usual, but I ordered anyway as I usually re-fill twice a year. This usually takes 4 days (as it has for the last 4 years) but it has been 8 days and the package is still in Chicago, hasn’t even been “packed” ie not even with UPS. I guess I was naive to assume the spike in shipping/delivery prices would at least equate if not compete with delivery times I’ve experienced prior. The vast inconsistency and paying 3x for no support and still no product is the reason I’m scoring a 2. They have been reliable before and I hope they are able to improve.", "rating": 2}, {"title": "Delayed delivery", "text": "It's always been good with lift mode. But with this purchase, I was expecting the package Friday afternoon like was promised. Now it says it will come tomorrow on Monday. But every day so far expectations weren't met so I don't know if it will arrive.", "rating": 2}, {"title": "I paid for priority shipping and n the…", "text": "I paid for priority shipping and n the morning on Tuesday and should have arrived today (Friday) at the latest. Item is still somewhere in Illinois. Priority does not take that long, I wonder if the item was even shipped via priority or if they are just trying to save money. Either way the item is not here", "rating": 2}, {"title": "Liftmode could have handled this better", "text": "Well... The free shipping went from $39.00 to $49.00 even though it's still advertised as 39.00... Also to get the 2 day shipping you have to spend 59.00... which is all well and good... I've been ordering from liftmode for over a year now... It would have been nice to find out about this change without having to make it to the checkout", "rating": 2}, {"title": "I paid for 3 day shipping ordered it on…", "text": "I paid for 3 day shipping ordered it on the 20th and got it on the 25th.  By my calculations that is not 3 days.  Will not pay extra to get it sooner and might find somewhere else to purchase my supplements.  Very disappointed.", "rating": 2}, {"title": "I got to try Kanna Elixir one of the…", "text": "I got to try Kanna Elixir one of the supplements they were advertising on there site everywhere. Since I liked there other products I decided to try this new product there were offering. I have taken it but it was leaking so about 10 Ml or so leaked when I got the package. It was a good supplement but I wish it did not leak in my order I got. The rating is for the service Mainly.", "rating": 2}, {"title": "Not trusting this product anymore", "text": "I ordered Phenibut from this company in the past and it always had this distinct kind of bitter taste to it, it also dissolved very quickly in water. Over the last 6 months I have ordered again and now the taste is completely gone and the powder does not dissolve in water. I am wondering what happened because it seems like it's not the same product anymore? Will order from different vendor in the future.", "rating": 2}, {"title": "Different experience", "text": "Recently purchased some phenibut through next day air ups and it had snowed at one of the ups locations in route so it had sat there for 4 days on the freezing conditions and by the time i received it i guess the freezing temperature compromised the effects and texture of the phenibutI always use the same amount when i take it. The effects were minimum and diluted as opposed to when get it the next day", "rating": 2}, {"title": "Not effective.", "text": "Wasn't really effective.", "rating": 2}, {"title": "Had to pay shipping cost twice because…", "text": "Had to pay shipping cost twice because liftmode just pockets the money you already paid for shippingedit 1/15/21: in response to the reply the products are great and are of quality, but still just show on the site what you actually have to pay, i understand if you want extra fees for your service but atleast show it as such, ive added another star since atleast you care enough to reply", "rating": 2}, {"title": "Cool site but delivery sucks..", "text": "I was excited to learn about the website and a specific item you stocked. I placed my order which was an easy process but i still havent received my order which is going over a week past the expected delivery date. It seems you have a known issues and bad experiences using USPS as your delivery people. You may want to look elsewhere..EDIT:I appreciate your response..will edit after i receive the product.", "rating": 2}, {"title": "Quick delivery but product doesn’t work for w", "text": "This company delivered my order promptly.  I have 2 stars for the good delivery time.  I ordered a product to ease anxiety and I don’t know why, but I feel absolutely nothing at all when I take it.  Either it’s just inactive grains of some sort or I’m just an oddball, I have no way of knowing.  I’ve tried it 3 times and felt no difference at any time.", "rating": 2}, {"title": "Price Gougers", "text": "Didn't really enjoy being gouged for double the price on mask filters, but what the hell, you've got me bent over a barrel and I had to pay it. Just trying to keep myself as healthy as possible while I work as a firefighter/paramedic. PPE is hard to come by and it's only going to get worse. But hey, you made a few extra bucks👍🏻", "rating": 2}, {"title": "Didn’t work for any of us.", "text": "Didn’t work for me OR my brother OR my husband. They said they felt nothing. I gave it more time than the rest of them. I had a severe anxiety episode the last day took it and gave up on it at that point. I had three great days prior to that which I attributed to the supplement but then that last day made me question it. The packaging was nice and it shipped VERY fast. So I do appreciate that and would maybe consider trying another nootropic product from lift mode but just not sure what.", "rating": 2}, {"title": "Good product but paid for priority…", "text": "Good product but paid for priority shipping and they did not ship until 4 or 5 days later. I received my package a week after ordering.", "rating": 2}, {"title": "Get ready to crap your pants", "text": "The shipping was fast and the site was easy to navigate. The product was sub-par at best. You need much larger amounts to reach the effects we have gotten with other manufacturers and I believe the product has too much added filler to increase the weight. Each of us experienced strong diarrhea Everytime we took it. Likely cut with baby laxative or the like.", "rating": 2}, {"title": "I have nothing against LiftMode", "text": "I have nothing against LiftMode; I think it's a great company; however, I DO regret on spending such a large amount of money on such a small amount of product (1 gr Icariin).  Once I saw the amount of product in the small jar, I then realized that this really was an exorbitant amount I paid . . . especially in view of the fact that this product is readily available from China through Alibaba for a FRACTION of the cost.  \"Live and learn.\"", "rating": 2}, {"title": "Angry with delivery", "text": "Angry with deliveryI have ordered my package June 25th and it seems UPS won't give me an update as to when I shall receive it or why it's taking so long. I am told over and over it was received by the international carrier facility in Canada over and over. Is it going in circles? This is much longer than the expected delivery expected for this package. I wish you didn't use UPS or USPS to ship. This is always an issue", "rating": 2}, {"title": "I have been getting 5-6 hours of sleep…", "text": "I have been getting 5-6 hours of sleep a night for several weeks now. My naturopath recommended Lift Mode and I was hopeful it would work. The first two times I followed the directions and took 1, each a couple of days apart. Still got 5-6 hours of sleep those night. The third time I tried 2 pills, with the same results. So I am quite disappointed", "rating": 2}, {"title": "Great service. Bad phenibut", "text": "The shopping experience with liftmode is a solid five. These guys ship fast, their customer service is excellent. But their product has gotten bad lately. I have been ordering their phenibut for a long time..but the quality has gotten worst the last few months. I want to rate them a five. I really do. But with product this weak I can't.", "rating": 2}, {"title": "Never Again", "text": "The products themselves, I enjoy very much.  Unfortunately, there was A HUGE issue with my order which I emailed them about days ago and haven't heard anything back on yet.  Ironic that I would get the email asking me to review them before a reply about my issue.  Bottom line, when these products are available through so many vendors, I have a hard time imagining going back to this one, between my issue itself and the total lack of response to it.", "rating": 2}, {"title": "I thought this order was going to be Cash on Delivery as the website said.", "text": "I thought this order was going to be sent \"Cash on Delivery\" as it says on the website and on my order, but it was actually \"Check on Delivery\" and UPS refused to accept the cash I had ready for them, so they had to come back another day. Liftmode should have told me I would need a cashiers check or money order instead of saying \"Cash on Delivery\" as they said on the website and in my order.", "rating": 2}, {"title": "I got the phenibut crystals", "text": "I got the phenibut crystals. I've tried from other suppliers and had a great experience. After trying these, I got a very bad headache followed by nausea and dizziness. Which has not happened with other products.I definitely would love to try out some of their other products.", "rating": 2}, {"title": "The product that I received does not feel as if it is the actual product itself when taken.…", "text": "The product that I received does not seem to work like it should.  I don’t think it is Phenibut at all and I am thinking about having it tested myself.  It may have a piece of paper in it guaranteeing the purity but that does not mea n it is actually Phenibut in the container.Ive tried them both and they make me feel weird, definitely not in a good way either.  I don’t want to even use the product anymore.  Customer service has been great though.", "rating": 2}, {"title": "Identifying the packet", "text": "HiI am from Colombia, and the Place were they left the order was a suite to send it to my country. However identifying the packet was difficult because they said from Liftmode there was no identification of the customer which is me in order to order the packet easily. It would be good if they put a label to identify the packet with the customer", "rating": 2}, {"title": "Good product, abhorrent delivery.", "text": "The product was exactly what was marketed. Thank you. However, even through I paid for 2nd day air delivery,  I did not receive my product until a week after conclusion of sale. Until this company can meet all contractually agreed and paid for terms of sale concluded on Google/Amazon.com, I will invest my monies in a more predictable and delivery forecastable company.", "rating": 2}, {"title": "No effects from phenibut.", "text": "I tried different dosages of the product. Followed the label correctly. I tried abstaining from eating before and after taking the product for absorption. BUT I NEVER EVEN FELT THE PHENIBUT. The scoop says aprroximately 500mg. And I’ve taken up to 4 1/2 scoops at a time. And still I’ve not felt one effect. I have no cross tolerances to the gaba drug. I’m so confused. I wish liftmood would resend a more potent phenibut? Or at least help me understand.", "rating": 2}, {"title": "We have been ordering from u guys for …", "text": "We have been ordering from u guys for years. We also have family that orders as well will Evans Christina kettenring just to name a few. Well the last 6orders it seems that the order was on its way then all of a sudden the package has been detoured to California and it is on a rat race to even find its way to our home. It's been frustrating!", "rating": 2}, {"title": "Phenibut", "text": "I've purchased phenibut in the past from multiple different places so I'm familiar with the effects this product should have.  Liftmode phenibut seems to just make me feel tired and it does not help with anxiety like I have experienced in the past with other brands.  I also paid extra to get the larger sized crystals and the crystals I received were very small the size of grains of sand.  Overall I was not that impressed with this product.", "rating": 2}, {"title": "Decent product, but", "text": "I received 20 grams of hordenine hcl in the mail with a sheet of paper with loads of information on the chemical. The paper mentioned that the shelf life of this product was two years and the batch was made on December 04, 2013. That would mean the product expires less than a month after I received it which is unacceptable due to the fact I could not safely consume all 20 grams of the chemical in less than a month.", "rating": 2}, {"title": "Product 1-star customer service 5 stars. So 2 stars.", "text": "You should have a different review set up because I need to give two separate reviews. Speaking specifically about the product I received being Phenibut FAA I would give 1 star. I was unhappy with the quality. But I was satisfied with the customer service I received.", "rating": 2}, {"title": "2 failed checkouts, 2 successful orders", "text": "The only reason it's not one star was because I actually did place the order (I think).I have multiple screenshots of the issues if you are interested.First attempt went to an error page, no email confirmation.Second attempt wouldn't let me use my email address because it was recorded on the previous attempt. STILL got a DIFFERENT error page. This time I got a successful order email).A few minutes later I received 2 UPS tracking emails.", "rating": 2}, {"title": "Not Satisfied", "text": "I was very happy to receive my first supply of phenibut in months because  I have not been able to find it pure.  However, after using the phenibut powder, I noticed a little euphoria, calmness and later I was very sleepy.  I was not impressed.  I would like to try the granules to see if there is any difference.  I will make another review again.", "rating": 2}, {"title": "Always bought phenibut from liftmode…", "text": "Always bought phenibut from liftmode until nootropics carried at a much more  reasonable price.2 × Phenibut HCL PowderSize:250 GramsSubtotal:$155.98Tax:$6.63Grand Total:$162.61Order DetailsOrder status:ShippedOrder date:11th Apr 2021", "rating": 2}, {"title": "No effect.", "text": "I have no problem with Liftmode's shipping, prices, or customer service. However, I tried the product as per the instructions that were included with the product, and experienced no effect. I'm sure it works great for some, just didn't for me. I would purchase other products from this company in the future.", "rating": 2}, {"title": "I wanted to try the Kanna Extract…", "text": "I wanted to try the Kanna Extract (capsules) so purchased the smallest bottle.  I tried it for 3 days, but honestly it didn't help with my insomnia and only made me feel spaced out - not relaxed at all.  So I discontinued it.  It may work for others, but for me, no luck.", "rating": 2}, {"title": "I’ve been getting your products for…", "text": "I’ve been getting your products for years and have always been happy with what you offered. Until a couple months ago your prices jumped dramatically and the reason given was that your prices have gone up from suppliers. Of course right of course. The product I was buying went from 32$ to 41$! You don’t have to be a math genius to figure out this is an absolute crazy markup! The argument that your suppliers increased price on you is bogus for that kind of increase. I haven’t but ordered your product once since then and am looking to do business elsewhere.", "rating": 2}, {"title": "It's alright I guess", "text": "It's alright I guess. Tried the Phenibut, regular and FAA, and wasn't too impressed. Tried it all possible through all possible routes at varying dosages up to 2gs at once and 4gs total in a couple of hours. Honestly, never really sure I ever felt it.", "rating": 2}, {"title": "I never got my product", "text": "I never got my product. UPS says it was delivered but it never showed up at my house. I emailed liftmode friday and still haven't heard anything. Will not use this company again unless this situation were rectified. Plenty of other online sources sell equal product at an equal value.", "rating": 2}, {"title": "The ordering process and everything was …", "text": "The ordering process and everything was nice, the product arrived quickly. But honestly, I got the phenibut and never felt a thing and with the warnings on the jar I'm afraid to take too much.  Pretty disappointing after reading all the reviews of people saying it was helpful.", "rating": 2}, {"title": "Ordered 2 products", "text": "Ordered 2 products. 1 showed up in 2 days. The other was sent after I notified them it hadn't  arrived and that took 4 day.  1 product I ordered had a year old expiration date. 1 product I took recommended dose and I did not feel any different. I tried it 4 times!! Nothing.", "rating": 2}, {"title": "Website pricing:  Website did not show method to opt out…", "text": "Website did not show method to opt out of extra products.  Website did not show final price before placing order.", "rating": 2}, {"title": "I didn't get much effect from what i…", "text": "I didn't get much effect from what i purchased i kept upping the dose but quit because of all the warnings. What i got was decent but I've been a psychonaut for a while and experienced a variety of different concoctions so maybe I'll get something else with it. I don't drink or smoke but I've ingested a lot of strange things. So I'll be back i like the professionalism you guys have and the test results were good to have. I just stumbled across your product on erowid and figured I'd give it shot. I will be back I'll try to work my way through all your products93", "rating": 2}, {"title": "Good service, terrible experience with the product.", "text": "I was referred to this company by a friend. He regularly orders The crystalline version but  told me I should order the powder version.  I've never tried this product but it tastes like nothing, except a little bit of aspirin taste. And I tried several amounts for dosage. Up to double what is  recommended and I still felt absolutely nothing.  I will be trying it from other companies, or maybe try the crystalline version but at this moment I feel like I got powdered aspirin.  If I have a positive experience with that, I will come back and change this review.", "rating": 2}, {"title": "1st time with Liftmode was not great.", "text": "I don't know if it was a genuine mistake or if the service at Liftmode is just low quality. I was expecting to get a small measuring scoop for my product. I was expecting to get that and maybe a small pamphlet with some more information or something. I had to \"guesstimate\" my servings because I didn't have the scoop. To be honest, that made me really nervous because dosage amounts are VERY important. I would like to order again from you because the product itself was good quality. I am only apprehensive because I can't \"guesstimate\" my doses. It's just not safe.", "rating": 2}, {"title": "The customer service isn't good", "text": "They don't give you coupons for reviews like they promise.  They violate the terms of the Americans with Disabilities Act by not providing reasonable accommodations for disabled individuals to get the same coupons as non-disabled individuals.  They really don't care.", "rating": 2}, {"title": "The shipping was quick, but the phenibut did nothing.", "text": "The shipping was quick, but the product did nothing, taking the lowest and highest dose recommended on the bottle, 4 days apart.  I've never used phenibut so perhaps it's just me (not this specific product), but it didn't work.", "rating": 2}, {"title": "Not a good first impression", "text": "I ordered 2 sample yohimbine HCL, only one came in the package.  I called the company and the line was answered by an answering service.  I was eventually connected to someone at the company and I was assured my order would be corrected immediately.  It has been over 1 week since I talked to someone at the company and I have not received my corrected order and I have not been contacted by email to let me know it has been sent.  I am still waiting and I hope it comes.  I hope that orders will be double checked to ensure customers do not have to follow up on orders.", "rating": 2}, {"title": "Phenibut quality has gone down…", "text": "Phenibut quality has gone down drastically. They used to ship a high quality product. It may be completely out of their control, but they should stop selling whatever it is they sent me.", "rating": 2}, {"title": "Great product, shipping takes way too long.", "text": "Loved the product, very high quality, but other sites offer competitive prices with much, much faster free shipping and provide tracking numbers. Not sure if I'll purchase from LiftMode again considering the ridiculous amount of time it took to get to my house.", "rating": 2}, {"title": "I have been a loyal customer of…", "text": "I have been a loyal customer of liftmode for a long period of time on and off and then the last several months regularly. I enjoy the product Phenibut FAA, and have considered experiencing some other natural energy boosters. Unfortunately my last purchase was very costly due to a misleading shipping prices and info. At least I felt that I paid $ 17.00 for a 2 day delivery. But the product came in 5 days. When I complained to Leo, at liftmode.com, he couldn't return the shipping few but gave me 8% discount on the next 3 purchases. I'm really not sure when I'll order from liftmode again. Thank you for your time.", "rating": 2}, {"title": "I have yet to receive my package after 2 and a half weeks of waiting.", "text": "I have always liked LiftMode. They have great products at low prices and always deliver to me in a timely manner. I ordered a package 2 and a half weeks ago and still have not received my package. I even paid for priority mail with the post office.", "rating": 2}, {"title": "The product was not worth the money it…", "text": "The product was not worth the money it cost, in fact I didn't really notice any effect at all. The shipping was great and liftmode is a trustworthy website, however, this product was not worth it too me.", "rating": 2}, {"title": "Good product but", "text": "Good product but, the price is simply outrageous", "rating": 2}, {"title": "This new 99% phenibut is garbage/ I had…", "text": "This new 99% phenibut is garbage/ I had to flush down the toilet, all it made you is tired, brain fog, no motivation, cons- sleep was good. Bring back the 95%.", "rating": 2}, {"title": "Poor customer service", "text": "I made an order for a sample of on of their products for $4.88.  I received the product but when I got my credit card bill I was charged twice.  I called Liftmode to try and correct this and I got a disbelieving, difficult man who just kept saying \"you were only charged once\".  I had to file a claim with my credit card carrier to get this fixed.  After all that trouble when I called back again to explain that my credit card company has in fact been charged twice.   The same man only offered me an 8% discount on a future order.  It was only for $4.88 and I even said to just send another sample and they would not even do that.  Great product, terrible customer service.  I will not purchase again.", "rating": 2}, {"title": "Made an order, Never received my Shipment and no response from them for 2 days now", "text": "I ordered two products through the website. They are currently held at the customs who asked for Safety datasheets and Product description. I asked liftmode through their support option for them, a ticket was opened with my request, then closed with no one getting back to me.Opened a second ticket, it was closed after a while with no resolutionTried the chat option, the person was very rude, and promised he would get back to me after an hour, then opened a ticket. No response till the next day which is now. Where the ticket is closed and an automated email is sent to me asking what do you think of our service.I have tried their products and they are good, only problem is their third world's customer service", "rating": 2}, {"title": "I only like phenibut capsules", "text": "I only like phenibut capsules.  Liftmode does not have them a lot of the time.  Also the search engine pulls up other things besides phenibut capsule which caused me to order the wrong thing one time.", "rating": 2}, {"title": "Slow shipping", "text": "Slow shipping. Seems to be policy for support to mislead customers. It is not clear if they are out of a product. They do not communicate delays until type ask or complain... the McDonalds of powder.", "rating": 2}, {"title": "Eh, do better.", "text": "The product was good and came undamaged, however I paid $10.00 for two day express shipping and it came in 6 days. I’m fairly annoyed by this. In the future I wish there was a little more transparency.", "rating": 2}, {"title": "Order has not arrived on time", "text": "I cannot give a favorable review at this time because I still have not received my order although it should have arrived last week. In fairness it may not be LiftMode who is at fault.", "rating": 2}, {"title": "depends what your looking for.......", "text": "if you're looking for a mood and mind altering experience, this is the stuff. I've tried Phenibut before from other companies with a more mild effect. But with this stuff, it was different. lift mode, Phenibut is  very pure and really came on strong, in fact, too strong, a full day later and I was still really feeling it to the point where I couldn't work. Be extremely careful if you take this.as far as supplements go, I suppose, if you're using this for what it is meant for, then its an extremely good product, but I took it for the experience,  as I did, then  again its just way too strong. even if you've used it before, I would suggest take half the dose you think you're going to take, sit back.", "rating": 2}, {"title": "I’ve used phenibut from you all before…", "text": "I’ve used phenibut from you all before and it’s always been great but this batch honestly doesn’t do anything to me. I don’t know if it was just a bad batch or what but I am a bit disappointed.", "rating": 2}, {"title": "I really dont feel any benefit from the…", "text": "I really dont feel any benefit from the product. I've tried it several times and all it seems to do is make me sleep longer than I need to. I think I'm going to return it:,(", "rating": 2}, {"title": "I can't really give a good review", "text": "I can't really give a good review. I've tried the phenibut twice and haven't really noticed any effects. Idk if I'm using it wrong but I'm somewhat disappointed", "rating": 2}, {"title": "Shipping with UPS to Canada is…", "text": "Shipping with UPS to Canada is ridiculous. Great product, I just wish they didn't take so long to ship, or get lost along the way.", "rating": 2}, {"title": "customer service and web access horrible", "text": "Last few months liftmodes previous spot-on customer service and web site access have gone bad.  First they cancelled my order wrongly, then did not respond to multiple emails and phone calls I made to them.  I took a few months off, and now I find it just as awful.  I can no longer access the website from my Chrome browser computer.  An item was missing from my last order and I got no response from my first days of contacting them concerning it.  They now waste my time at every turn in that not only are there continuing problems, but unless I spend time every day over multiple days to beg liftmodes response to their own mistakes, apparently liftmode does not give a care and will not fix their own errors unless I invest mounting time asking them to respond to what are always their own screw-ups!", "rating": 2}, {"title": "Shipping was a little slow", "text": "Shipping was a little slow. This was the first time I ever used phenibut hcl and i got zero effects and went and did 2 1/2 gs and didn’t feel anything", "rating": 2}, {"title": "I have tried your products before and I …", "text": "I have tried your products before and I was very impressed, but my most recent purchase were duds. I would like a refund or at least an exchange.Thank you for your time,", "rating": 2}, {"title": "I've had a lot of problems with the…", "text": "I've had a lot of problems with the website and then there was the issue of getting a discount that I met the requirements as I understood them at the time and then was told the discount doesn't apply in that situation. but mostly the website is troublesome.", "rating": 2}, {"title": "The products are worth it and very…", "text": "The products are worth it and very decent quality the only issue is shipping. USPS takes forever and even when you splurge and pay the extra $15 for ups shipping still takes 5-7days. Tracking is always off or not there at all. Idk about anyone else but I also can’t use the site unless I am connected to Wi-Fi", "rating": 2}, {"title": "Good Product--Unacceptable Cybersecurity Incompetence", "text": "Since this review is intended to establish trust, I have to be brutally honest. The product showed up as advertised and includes test results with each container (Awesome!). HOWEVER, after my purchase, LiftMode emailed me my account password in plaintext (as in \"human-readable\"). This is super insecure and entirely unacceptable for any online vendor in 2018. The fact that they even know my password in plaintext (it should be hashed and encrypted) is completely unacceptable. If they are emailing the password in plaintext, they must therefore also be storing it in an insecure way. The fact that they EMAILED it to me (and to anyone who hacks my email address) is the cherry on top of their sundae of cybersecurity incompetence. PLEASE STOP DOING THIS IMMEDIATELY. Also, fair reader, do yourself a favor and use a password manager to limit your exposure to this type of insecure nonsense.", "rating": 2}, {"title": "Misleading", "text": "Shipping was fast and packaging was good. However, advertising for the product I purchased (Hordinine and PEA) was very misleading; would not purchase again.", "rating": 2}, {"title": "I'm sorry to give bad feedback", "text": "I'm sorry to give bad feedback. But both my purchases have been awful. Shipping takes FOREVER and the prices are outrageous. I will not order again :(", "rating": 2}, {"title": "Was pleased now trying to order more…", "text": "Was pleased now trying to order more and the same card I used last week says this card type is not acceptable? Very frustrating", "rating": 2}, {"title": "I haven’t gotten my order yet and it’s…", "text": "I haven’t gotten my order yet and it’s been almost 2 weeks and it still hasn’t shown up, I just want to know when I’ll be getting it", "rating": 2}, {"title": "Customer Service BAD!!  Product Great.", "text": "Ordered from lift mode many times going way back thru the Amazon days. This is the 1st time I delivered using first class mail. I received a Norton guarantee for the product and delivery and I also received a tracking number. 8 days later the USPS website showed it was out for delivery to destination in Columbia, SC, but I live in Oregon. When I emailed lift mode, they just responded with \"sorry, you used basic delivery and it can take up to 15 days\", pretty much they said I should use the paid tracking methods or don't bother us. USPS finally emailed me back, saying \"the mail was missorted and mislabeled in Chicago\" then told me where it was and that it would be expedited to me by the next day. It wasn't Lift Modes fault, but they didn't take 2 seconds to even try to help even tho I gave them the tracking number. I really expected more from them. Up until now, I would have gave them 5 out of 5.", "rating": 2}, {"title": "The phenibut did absolutely nothing and…", "text": "The phenibut did absolutely nothing and was the worst phenibut Ive had.  Complete waste of money and will not be ordering again fom LiftMode!!!", "rating": 2}, {"title": "Shipping seems to be taking forever", "text": "Shipping seems to be taking forever, no ETA. Can't review the product yet as its not here but, you asked for a review.", "rating": 2}, {"title": "I ordered Baicalein", "text": "I ordered Baicalein . It came unsealed and was only about 1/3 full. Did you send a used jar that someone had returned? It looked this way.", "rating": 2}, {"title": "Good service, product not good for me", "text": "I bought some Phenibut to try for help with anxiety issues. Since these substances affect everyone differently, I'll just speak of my own. I tried it twice and both times was initially thrilled, as it really helped relax me and get me to sleep. Until it wore off. I tried a higher, then lower dose, neither of which were near a maximum dose. The same thing happened. I woke up in the middle of the night after it wore off tossing and turning with crippling anxiety - sweating, unable to swallow comfortably, etc. Mercifully those effects were gone by morning, but this stuff is not for me.I'm sure it does not affect everyone the same and is helpful to some, and I have no issue with the promptness with which my order was processed and delivered. I would suggest that people do research on Phenibut before trying it, as the directions that came with the product don't do enough to emphasize dependence and withdrawal issues that I read about elsewhere.", "rating": 2}, {"title": "My package did not arrive the day you…", "text": "My package did not arrive the day you said it would very disappointing.", "rating": 2}, {"title": "Not sure if products actually do anything", "text": "The products received did nothing for me and seemed more like a placebo than what was promised. Fast delivery made this a 2 star", "rating": 2}, {"title": "I ordered phenibut FAA and it’s been 10…", "text": "I ordered phenibut FAA and it’s been 10 days and counting. I still haven’t received my order and I paid the $9.99 in shipping.", "rating": 2}, {"title": "Unfortunately got a migraine", "text": "Unfortunately, I got a serious migraine a half hour after I took it. So unfortunately I can’t take the risk of continuing.", "rating": 2}, {"title": "Does not work", "text": "Mixing with milk tasted like spoiled milk Mixed with orange juice makes it sourI still wake up in the middle of the night", "rating": 2}, {"title": "Product Review", "text": "What happened to the one night capsules? The only available one night is powder or crystal which is inconvenient to take.", "rating": 2}, {"title": "You should provide more data and as…", "text": "You should provide more data and as much long term research as you can on some of these potentially dangerous substances", "rating": 2}, {"title": "Usps lost package", "text": "Used product before. Works great but usps seems to have lost my package. Hoping to get help through this review", "rating": 2}, {"title": "The phenibut seemed to be waaay weaker…", "text": "The phenibut seemed to be waaay weaker than usual. Kinda disappointing", "rating": 2}, {"title": "Bad experience this time", "text": "Order did not ship for 2-3 days after I placed the order, no notification was given to me from LiftMode about a delay in the order (something about my card? supposedly it was an \"address mismatch\" between the billing info I inputted and what my card had on file - which isn't true, as none of my info has changed in years). I emailed customer service twice (two seperate days) and did not get a reply to either. Finally went to LiftMode's website and used their \"live chat,\" and got my issue resolved after 30 minutes. The person assisting me (\"Leo\" according to the chat) was helpful and informative. I got an 8% off coupon for my next order. And I understand that these strange random errors can and do happen..but some sort of notification from LiftMode would have been helpful, or at least a response to the emails that I sent to customer service - I shouldn't have to reach out multiple times to see what is going on on the company's end.Overall, a frustrating and annoying experience this time. However, I have ordered from LiftMode multiple times in the past and recommended them to friends who have used them (without issue) as well.", "rating": 2}, {"title": "Good service; poor product", "text": "The product shipped quickly and the customer service was great, but the product was very low quality.", "rating": 2}, {"title": "Ordered different version of product", "text": "Ordered different version of product. It worked out I guess but i didn’t get what Id paid for.", "rating": 2}, {"title": "I ordered a one day delivery Monday and…", "text": "I ordered a one day delivery Monday and it’s supposedly not coming until Friday…", "rating": 2}, {"title": "The site worked badly", "text": "The site worked badly. Customer service was very kind and tried to help. She couldn't so her boss called to figure it out. He was rude as hell. But my order was successful. The failed order is still holding my money days later and when i asked for the charge to be cancled the same rude manager or supervisor. Talked right down to me about policy and how it can take a week cause he wont do a damn thing about it double charging me is fine cause we only locked your money up temporarily. She was super nice. I got my product her boss shouldn't be in customer service. At all. Fire him. Okay based on your reply i will say your call rudness. Was very blatent. It was hasty you seemed annoyed at the whole thing and frusterated when i kept saying phenibut you just kept asking what i wanted. You charged me more than the site as you can see based on the order you still have my money held on. You didnt give me the discounts or codes she promies and over enail you gave me loads of bs about how its your policy and i should know better like anyone reada them ever. And you system sucking so much that i cant place an order or get my money released may not be your fault but acting like it was on me is nonsense. And swearing i said i want my Fing money i didnt curse you out or call you names after several emails and calls and days passed i over paid and you still have another complete failed orders woth of my money if i could attach your email or had the call recording my end pointing it out would be easier", "rating": 2}, {"title": "Phenibut faa", "text": "The Shipping Was Good And On Time. The Product Just Wasn't of the potency that i expected.", "rating": 2}, {"title": "I think my order was prohibited in…", "text": "I think my order was prohibited in Australia, being held in customs. That's disappointing.", "rating": 2}, {"title": "Good service good product", "text": "I recieved excellent phone support after having an issue with shipping.", "rating": 2}, {"title": "I purchased the 40 gram and 5 gram…", "text": "I purchased the 40 gram and 5 gram sampler of Phenibut F.A.A. after reading great reviews about it on internet forums. It doesn’t specifically state which brand, but I went for liftmode because it’s the first thing that popped up on my search engine. The first time it arrived, I immediately tried 2 orange scoop of the 5g sampler. After an hour and a half, I started to feel something, but then decided to add up another scoop after waiting for a total of 4 hours. It felt great, but I would not call it amazing, just great. I was thinking why would I need 3 tight scoop of phenibut F.A.A. for my first dose to feel good. It’s essentially taking in range of 800mg-1200mg in total, for my first time — with no tolerance. Then, I decided to wait for another 5 days to do another dose. After five days, I dosed 2 heaping scoops of phenibut F.A.A., and the funny thing is I. did. not. feel. anything. Decided to wait for another 5-7 days to do another dose, thinking maybe I ate something that made me did not feel any of the phenibut, dosed 2.5 scoops of the phenibut, did not feel anything again. Tried this on and on until my 5g phenibut faa sampler is finished. Made me confused whether I should open and try my 40gram Phenibut FAA because I concluded that the product is kinda bunk....", "rating": 2}, {"title": "Didn't do it for me", "text": "Didn't do it for me. Tried a high dose (2g), had no effect, but everyone is different.", "rating": 2}, {"title": "Chose overnight shipping and haven’t…", "text": "Chose overnight shipping and haven’t received a call or email in 4 days", "rating": 2}, {"title": "I'll have to throw it away", "text": "The company, Liftmode, is fine, but the product tasted horrible and I noticed no effect.", "rating": 2}, {"title": "Bad quality", "text": "I got this product from other sellers and I can tell the difference. This one is bad.", "rating": 2}, {"title": "No effects", "text": "No effects even after taking over 2000mg", "rating": 2}, {"title": "Just lack of tracking information has…", "text": "Just lack of tracking information has me very nervous for my purchase", "rating": 2}, {"title": "Phenibut waste of money", "text": "Product strength seems off compared to other brands didn’t work for me.", "rating": 2}, {"title": "The stuff dont do much of anything", "text": "The stuff dont do much of anything. 2 grams....nothing. Very unimpressed.", "rating": 2}, {"title": "A lot of the capsules were only half…", "text": "A lot of the capsules were only half full. Hard to get dosage correct.", "rating": 2}, {"title": "Wish you would have phenibut available…", "text": "Wish you would have phenibut available on a regular basis.", "rating": 2}, {"title": "Quick service, ineffective medication", "text": "Phenibut hcl did absolutely nothing for me, even at 4 times the dose", "rating": 2}, {"title": "I felt nothing from this product .", "text": "I felt nothing from this product .. very disappointing", "rating": 2}, {"title": "I didn't get any effect from it.", "text": "Date of experience: April 25, 2022", "rating": 2}, {"title": "Product is lower in quality", "text": "Date of experience: July 05, 2022", "rating": 2}, {"title": "10 days later still haven't received it.", "text": "Date of experience: July 30, 2019", "rating": 2}, {"title": "been 2 weeks and it aint even in canada…", "text": "been 2 weeks and it aint even in canada yet", "rating": 2}, {"title": "Good product, frustrating delivery", "text": "I've ordered from Liftmode's website twice and both times the shipping address has been messed up. Their website creates duplicate street addresses. When the pop-up menu asks if you want to choose your \"verified address\" or leave it as entered, for god's sakes leave it as entered. Otherwise you'll have your shipping address duplicated and have terrible experiences with delivery like I've had. If you enter your address as 1234 Copper Dr, a pop-up menu will ask if you want to use the verified address of 1234 COPPER DR. If you choose to use the verified address your order will go through and you'll have your product shipped using the street address of:\r 1234 Copper Dr\r1234 COPPER DR\r I DON'T WANT TO USE BOTH. I WANT ONE STREET ADDRESS OR THE OTHER. Lol I thought it was a fluke the first time I ordered through them. It was delivered to my hometown but got sent to the wrong address. I knew it was delivered to the wrong address because I was tracking the delivery and it said that it was already dropped off. I called the post office and told them about my shipment and they were actually able to get ahold of the mailman (who was still out on deliveries) to take it back to my house. That was the story behind my first order.\r Don't get me wrong phenibut is a great product, I've just had shipping issues with Liftmode's website. I thought the duplicate shipping address was a fluke during my first order so I ordered through them again. Of course, the same thing happened when I checked my email notifying me that they had shipped to a duplicate address. I ordered my product using first class USPS shipping (they offer that for free) on April 24th and it was expected to be here May 1st. It's May 3rd now and tracking shows that the package is still in Iowa (I live in California). I have little doubt that the duplicated shipping address created by a fluke in Liftmode's website is to blame for that.", "rating": 2}, {"title": "Overpriced", "text": "Stated buying elsewhere, overpriced.", "rating": 2}]