[{"title": "Don't trust offers of discount codes…", "text": "Look to purchase on their website and you get bombarded with offers of discount codes (e.g. sign up for 15% off your purchase, we've kept your basket, get 10% off) only to find you have to spend an additional £10/£15/£20 etc to qualify for the discount. Very misleading and underhand marketing ", "rating": 2}, {"title": "Poor customer support", "text": "I ordered clothes 20 days ago and am still waiting to receive them.  Customer support was an AI chatbot despite my reaching out to talk to an actual representative.  The tracking link needs to be more accurate/working than I was provided, and I was also told that when my package arrives, it will not contain my entire order.  I cannot speak to the quality because my shipment was not received.  ", "rating": 2}, {"title": "Love the bathing suit but took way to…", "text": "Love the bathing suit but took way to long t receive.  thought the summer would be over.  Then when only ordering two suits, i was billed for severa, finally received what i did not order and not happy that i need need to go through the inconvenience of returning them to get a refund.", "rating": 2}, {"title": "Inaccurate size guide - costly return", "text": "I ordered 2 bathing suits, one L and one XL because I wasn’t sure about the fit.  I used the size guide and should have ordered both in XL (which I have never worn) but decided to order 1 of each instead.  The L is a great fit but the XL is way too big which means that the size guide is far from accurate.  Although the return/exchange process is easy, it cost me $24.41 CDN to return the item which is half the price of the bathing suit.  I am very disappointed with this aspect and will probably not order again since it is impossible to know if the item will fit properly or not.  Most online clothing shops send an RMA which includes free return shipping but Rotita does not so if the item doesn’t fit, you have to be aware that it will cost you a pretty penny to send it back for an exchange or refund.  This is unfortunate because the product seems to be of a decent quality.", "rating": 2}, {"title": "Initially when I viewed all your cute…", "text": "Initially when I viewed all your cute tops and reasonable prices, I was happy.  However, I was concerned about what fabric was used for these items.  I couldn't find a description but decided to take a chance.  I was very disappointed in the quality of the fabric.  Also, on 2 separate occasions, I had confirmation the 3 items I purchased and returned... but my credit was not for full amount. Not happy with the time I have had to rectify this matter.", "rating": 2}, {"title": "Horrible customer service", "text": "I have ordered several bathing suits from Rotita and was satisfied until the most recent purchase. I needed to return this one (the first time ever for a return) as it did not fit properly. I have been trying for the past 2 months to get a refund and was at first dealing directly with Rotita. I returned the package which tracking showed they received. I have sent several emails and they just keep asking for the same information over and over which I have provided several times. I have now had to file a dispute with Paypal to get the refund issued. I will never buy from Rotita again.", "rating": 2}, {"title": "Poor quality item…", "text": "The sweatshirt jacket was very thin and material was of poor quality.  The zipper barely worked.  It looked so nice in the picture and the actual product was very shoddy looking and now I have to pay ten dollars to return it.", "rating": 2}, {"title": "I returned a couple of items and was massively out of pocket", "text": "I returned a couple of items and paid the £18 return postage. They said the package was .7 days outside their return period. Not when I posted it it wasn't. Now they have my £56 worth of returned goods plus the cost of return postage and what do I have? Zilch zero nada nothing - I call that very sharp practice so beware when you return anything - it may leave you in plenty of time but when it reaches them, who can tell? Heads they win, tails you lose - brilliant business model", "rating": 2}, {"title": "Expensive returns", "text": "Items arrive in good time and a good price, however if you live in the UK and need to return it is very expensive, also some items can  not be return so watch out for the small print, I was caught out with 2 of my items that didn't fit and was unable to return due to being in the sale. Will not be ordering again as too expensive to return if don't fit.", "rating": 2}, {"title": "Don't bother with this Comany, it's not worth the trouble", "text": "The first order I placed I purchased 3 plus size women's sweatshirts.  (buy 2 get one free).  I ordered my normal size 2X, and two of the tops fit but the 3rd one was way too small.  I returned it for exchange, but have yet to get the item in the larger size (It has been a week and a half)I placed an order for a couple more sweatshirts, paid for expedited shipping, but the order has been stuck somewhere in Los Angeles, Ca. for 5 days now and it is not looking up.  I have contacted them numerous times and just keep getting the same old run around.  When I look at my on line account, the items say I have already reviewed them, but I haven't reviewed anything I received from them.  I thought it was odd that every item on their website has the same great rating of 4 1/2 stars....  If I get the second order, it will be the last I ever place with this company.  Their shipping is unpredictable, and  their customer service is lousy.  I will go back to ordering my tops from a company that is located in the US.  It is faster and cheaper.", "rating": 2}, {"title": "Ordered 3 dresses a long time ago and…", "text": "Ordered 3 dresses a long time ago and only 1 has been processed. They say they expedited order and I need them for my wedding! Very slow delivery", "rating": 2}, {"title": "NO SHOW!!!!!!", "text": "Ordered --no show---6 weeks later only 1 out of 3 came....Very Very cheap made...The pants were so long 13 inches needed to be cut off and I'm 5'5\"....Wedding was last week!! Charged my card the day of order....Customer service was very nice and helpful....", "rating": 2}, {"title": "I have just brought 2 swimsuits and I…", "text": "I have just brought 2 swimsuits and I was very disappointed with them so wanted to send them back but found it a really difficult process. When I eventually found out how to send them back I took them to the post office and they gave me the price if 24.00 to return them on reflection it was cheaper to keep hold of them.", "rating": 2}, {"title": "Rotita deducts money from your bank by…", "text": "Rotita deducts money from your bank by the next day after ordering.  However, this is day 17 since ordering, and no sign of the delivery.  After two chats with a rep, I received a note that there will be an additional 7 day wait...if then.  That is 24 days for a delivery, and 1 day to take the money from my account.  This is the first and last time I order anything from these people.", "rating": 2}, {"title": "Disappointment", "text": "Isha was so helpful in resolving my problem. THAT is the ONLY reason I gave even 2 stars. Isha deserves 5 stars but the company deserves 1 star. I DO have an issue with Rotita. You don't make make it easy to return, as NO order # was on any correspondence and can't return without it (as another customer noted). I won't be ordering from your company again and the dress was so cheap looking, Not elegant, poor quality and nothing like the reviews stated. Makes me question the validity of the reviews on this dress!", "rating": 2}, {"title": "Very disappointed- delay in refund and I did not get a full amount!", "text": "I canceled my order right after I realized I would not get it in time for my event/trip. The product was sent out anyway. I filed for a return/refund right away and sent the product back promptly after receiving it in July. It is now September, and I had to email asking for my refund! Although I received my refund within days of my email, it was not in the full amount!!! Very disappointed!", "rating": 2}, {"title": "Parcel returned price!!!!!!", "text": "I ordered a tankini, but the top was too big and the bottom was too small, so I ordered a size smaller.  when I returned my item at the post office I was shocked to find I had to pay nearly as much as the tankini.  The item was £23.00 and the returned price was £16.00!!!!  disgusting.  I know its overseas, but for a small item!", "rating": 2}, {"title": "NOT THE SAME SHIRT", "text": "I finally put this shirt on today to actually see that it is definitely NOT like the one on line.  Something didn't look right when I got it but didn't put it together until I had it on and compared it to the picture on my email which is the one online )( its NOT \"gorgeous\" like the one online ) ....mind must be a knockoff because it is NOT THE SAME ) unfortunately because of this I wont be ordering any more clothes.", "rating": 2}, {"title": "Swimming  items are beautiful  colors and true to fit.", "text": "The swimming  items I got all are great the size is perfect  , the colors are really  the same as on the site. Now the shirt I love the design  and the fit was small , but the part of shipping during that  the shirt was sliced about 3 inches  and again 1 inch  (package too)  I can't  wear it ! I tried to get to customer service  but no help !", "rating": 2}, {"title": "Happy with one, not the other", "text": "Very happy with the blue tankini. I've now bought at least 7 bathing suits from you over the last few years and unfortunately I was very disappointed in the quality of the striped long sleeve suit. The fabric is coming apart all over the top after just one wear in the pool. Never even been washed yet. Can you please replace? I included photos on my other review you requested.", "rating": 2}, {"title": "I placed an order for 3 tops on May 23", "text": "I placed an order for 3 tops on May 23, 2020. It is July 8, 2020 and I still don't have my order. I tried tracking it but don't get any specific location where package may be nor any idea when it could be delivered. I have received 2 previous orders prior to this one and had no problems.I really like Rotitas merchandise, however the wait and overall hassle has been a bit much.", "rating": 2}, {"title": "Not so great customer service!", "text": "Update***** The exchange that I was promised still has not occurre (20 days later).  I contacted Rotita again today and they promised a refund will be given in 7-10 days.  I don't have high hopes that it will actually occur....Losliya was fantastic at taking care of my exchange concerns!", "rating": 2}, {"title": "I just received my first order of…", "text": "I just received my first order of Rotita.com.  I purchased about 6 outfits.  I WAS TOTALLY DISAPPOINTED AT THE QUALITY OF THE FABRICS.  THESE ARE CHEAP CLOTHES THAT SHOULD SELL FOR NO MORE THAN $10 at a side treet market.  The clothes are so poor in quality, they are not worthy of being worn to any occasion.  Rotita really needs to invest in better quality fabrics.  The styles would stand out more if better fabrics are used.", "rating": 2}, {"title": "I bought a dress for a Christmas party…", "text": "I bought a dress for a Christmas party it looked good on line when I received dress it wasn't what I seen the only thing I can say for this dress is my grandmother would of loved it, it's too  long and the bottom material  looks like it's been bleached . The material is horrible for a party dress  it out in for a return and now I have too buy another dress  (thumbs down .)", "rating": 2}, {"title": "When I Received my dress,it was not…", "text": "When I Received my dress,it was not what I expected. The stitching was not fully done,it was not Cleared/CLEANED of THE Stitching.  I feel like they Threaded some piece of Gold lining to make it look good but Its Cheap, Very thin and you might get one time TO wear it.. Do not buy Trash folks.. Spend A LITTLE more money and get BETTER QUALITY.  I'M VERY DISAPPOINTED", "rating": 2}, {"title": "The shipping time for me was good…", "text": "The shipping time for me was good seeing that it came from China but the quality of clothing I am truly disappointed in.  The dress I ordered looks nothing like what I bought, the bathing suits I ordered were cut with no hem so it looks cheap.  For the $$$ spent, I was expecting something better.  Won't be buying from Rotita again and I wouldn't recommend anyone else to.", "rating": 2}, {"title": "My husband purchased a top for me and…", "text": "My husband purchased a top for me and it was not true to size nor true to the colors in the picture. The picture on the website was not the same as I received.  I am currently looking for a mother of the groom dress and my girlfriend said not to order any clothing from China. I am so glad it was just a top and not clothing for an important occasion. I will not order from this company again.", "rating": 2}, {"title": "Very slow service for issuing store…", "text": "Very slow service for issuing store credit for returns. I am wanting to buy much more and will like miss all the good clearance prices. After I use store credit will likely not buy from again. And I spend A LOT of money on clothes. I contacted customer service and they did not help by online help.", "rating": 2}, {"title": "I bought your black and white off the…", "text": "I bought your black and white off the shoulder top and upon receiving you guys must have sent me a used one..make up and dirt all around the white part around the top. I had to wash twice to get the stains out.. I love the look of the shirt and it already took entirely too long to receive so i didn’t want to send it back and wait to get another one.. Need to inspect your clothes thoroughly before sending them...Tracee S.", "rating": 2}, {"title": "Fabric is shiny and stretchy like that of an inexpensive bathing suit", "text": "Be careful about buying from this company. I returned three item, the rest I couldn’t as they were on clearance. Though the pictures are pretty, the fabric is like that you would get in a cheap bathing suit.  Stretchy shiny fabric.  All three items were the same fabric.  And to return items they give you a first class postage return label so from an 80 dollar cost, they returned 55 and I still have two items that went to the trash. Worst experience yet from buying online.", "rating": 2}, {"title": "I bought 3 items on here the quality…", "text": "I bought 3 items on here the quality was pretty good I loved the blouse but the 2 dresses I ordered were too big. Rotita customer service is terrible to non existent can’t get a hold of anybody, refund process sends you in a big loop, just trying to get a refund or even exchange that’s all I really want because they do have some pretty beautiful clothes. If they stepped that up I’d be ordering more from them then amazon forsure", "rating": 2}, {"title": "It took over a month to arrive and aftger returning them, the refund still hasn't ;come over three weeks later.", "text": "It took over a month to arrive, so the occasion, a wedding, was past.  Have had trouble getting them to respond for a return although they say return is easyAnother month later, I did receive the form needed to return the dresses.  I just didn't understand they were  being mailed to me from Chinamid Feb.  After some time, I was sent the information on how to return the dresses.  They were sent back about three weeks plus ago.  I still have not received the refund.", "rating": 2}, {"title": "I ordered a swimsuit and selected my…", "text": "I ordered a swimsuit and selected my size. When it came it was too small so I processed a request to return and replace with a larger size. I mailed the too small suit back and it is sitting at the post office for over a week waiting to be picked up. I have \"submitted a ticket\" three times and no response. You cannot contact them by email and the chat is offline more than online. I won't order from this company again.", "rating": 2}, {"title": "Think twice before using this company.", "text": "I bought a top for £25. It arrived with a stain on the front. I tried to contact Rotita but was unable to get on the web site.  Eventually I did manage to contact them but they would not refund or replace the item. Instead they kept making me offers of partial reimbursement. In the end I had to contact Paypal complaints (who were brilliant). They acted on my behalf and I got a full refund. In future I will be buying UK products.", "rating": 2}, {"title": "Sad ~ that you disappoint so many people.", "text": "Got my order today after waiting over a month . What a waste of money that I've work hard for .Absolutely nothing like the photos, and the material is cheap and nasty,for hot summer weather , which you think they would know about .The workmanship ~ Nil ! Looks like its been made by someone at sewing class at school , and Yes , sadly I read the reviews after, that will teach me a lesson , hope they learn one too with the bad reviews.", "rating": 2}, {"title": "Disappointed - poor quality material", "text": "I ordered three tops, two were received a week ago the other turned up today.  The tops were ordered and paid for on 18 July - I received the first 2 a week ago, the other today - so mail delivery times were slow.  I paid $AUD134.62 for these tops and the quality of the material is poor.  I will wear them, but they were certainly not as appealing as they appeared on the website and I don't feel I got value for money. I won't shop at Rotita again, very disappointed.", "rating": 2}, {"title": "Poor sizing", "text": "I just received my order. I ordered a woman's Large and it is about two sizes too small! It isn't even close to a Large. I honestly do not even think its a Medium because I can wear some Mediums....anyway, you get the point! Too bad, as I really liked the material and print. For those of you trying to get a label to send your item back, I got pretty fast service using the Live Chat and I was sent a return label immediately on-line. I am not going to gamble on reordering though.", "rating": 2}, {"title": "Very poor quality.", "text": "The items of clothing in the images are very deceptive. The Christmas  top I ordered was made of very inferior fabric and the fit was very bad.The item took a long time to be delivered as it was from the USA thus when I decided to return it the postage costs were too expensive. My grandchildren may use it for dressing up!", "rating": 2}, {"title": "poor quality - wouldn't refund shipping when returned defective bathing suit", "text": "Ordered bathing suit.   I would have been happy with it for the price paid.  HOWEVER - poor customer service and manufacturing control.  The bathing suit had strap attached backwards to the back, so it twisted going over the shoulder.  It was stitched that way.  Had to send back and replacement would not have been sent in time for vacation.  They refunded the product price but not the shipping.  Buyer beware - very little quality control and it will be on your $$ to find out.", "rating": 2}, {"title": "YIKES", "text": "The bathing suit was nothing except color and pattern of what I ordered. I ordered a high waisted two piece bathing suit. High waisted went 2 inched below my belly bottom and the top was way to large. I wish you allowed photos because I would put one here. It was horrible. I got a RMA number...now lets see if I get my refund....", "rating": 2}, {"title": "Unfortunately", "text": "Unfortunately, I have not had any positive experience. I ordered a swim suit for a holiday with my family, the item was supposed to be shipped within 2 days. It was not. I am now in the 3 week of waiting to hear shipment confirmation. When I try to get a hold of customer service, it is impossible to talk to anyone. No replies...  In short, I would not recommend this company, nor will I buy here again.VERY DISAPPOINTED", "rating": 2}, {"title": "BE WARNED", "text": "I bought 3 tops for Christmas and they look lovely online but when they came I was so disappointed with the fabric.  It was very cheap looking, a bit 'shiny & slippy'.  Sent back all of them and it cost £30 in postage.  Will not buy anything on FaceBook adverts again.", "rating": 2}, {"title": "I ordered 2 swimsuits over a month ago …", "text": "I ordered 2 swimsuits over a month ago and I never received them nor was I charged charged for them. I then again reordered them about 5 or 6 days ago and I still haven't received an order receipt.  I have several friends that have made purchases from you and so far are satisfied,  so I thought this would be a good place to find out what is happening to my orders.", "rating": 2}, {"title": "Disappointing and disingenuous return policy", "text": "Item was ok but different colour and detailing to that in the photos. When I contacted them I was offered only a 60% refund for returning the item to China, with them essentially trying to strongarm me into not doing so by saying 'As you know, if you return it, it will cost you much for the shipping fee'. The only alternative was a 15% discount code towards a future order, which is really poor. I wouldn't trust this company enough to purchase again.", "rating": 2}, {"title": "HURRY UP AND WAIT", "text": "I HAVE BEEN BUYING DRESSES FROM ROTITA FOR ALMOST 2 YEARS.  THEIR DRESSES ARE GOOD QUALITY AND CUTE AS HELL! BUT THE DELIVERY TIME IS A PROBLEM.  IT TAKES 30 DAYS OR MORE TO RECIEVE YOUR ITEMS.  I MADE MY LAST PURCHASE YESTERDAY (9/26/19) AND THE DELIVERY DATE IS 10/30/19.  NOT OK.  THIS WILL BE MY LAST PURCHASE.", "rating": 2}, {"title": "Not happy with the resolution.", "text": "The shipper delivered my package to the wrong address. And to resolve the issue you gave me a credit of what I had ordered. However what I had previously ordered was no longer that price along with one of the items I ordered was no longer available. So with the credit and the price change I was only able to order 3 of the items that I had previously ordered.", "rating": 2}, {"title": "Sizing is way off", "text": "I ordered a faux fur vest from them, but I didn't do my research ahead of time and was worried about what I would actually receive. I did get the vest within 2-3 weeks and it was as pictured and good quality,  but the 3x I ordered was more sized to be a women's large. It was just  $17 and I ended up giving it to a smaller friend. I wish I could have kept it and won't order from them again.", "rating": 2}, {"title": "It's been a week since they took my …", "text": "It's been a week since they took my money and I've not had any correspondence from them and no notices of shipment. The website says that I've paid and that the product is \"Unshipped\". I'll update my review once I see action from this company. Personally, no notification after acceptance of payment is unacceptable.", "rating": 2}, {"title": "I ordered 4 tops in early March and…", "text": "I ordered 4 tops in early March and still have only received 2 of them. I have contacted them thru their sight and got a response with tracking information that would not allow me access, so I still do not know what is going on with the rest of my order. I do like the 2 tops I have received.", "rating": 2}, {"title": "No size Small!", "text": "I ordered a top from the site last year. I ordered a small and it fit nicely. The stuff is generally made of cheap polyester, but if you don't mind that they look just fine. It's nice that they don't wrinkle. Unfortunately, they rarely offer size Small anymore, so I guess they've lost me as a customer.", "rating": 2}, {"title": "Don't go here", "text": "Don't go here. Returns are a nightmare and it costs you to send back to USA. They will only offer u 50% if u don't return it . If u do it costs!! E.g... dress 32.00 return cost 8.00.. 24.00 return but u have to copy for postage tracking nos  and how it's going.  Never worth it! Plus material not good quality  ...", "rating": 2}, {"title": "Disappointed Purchaser", "text": "I recently received an order for two dresses that were cheaply made and NOTHING like the picture. The quality of the material was horrible! The items resembled a fake imitation of what should have been two good quality items. I’m livid because this is the second time I’ve had issues with the quality of items from this site. Because I’ve received a few good items in the past, I decided to give them another chance; however, I’m sorry I did!! I’m convinced this company is a scam! Please don’t waste your time or money!!", "rating": 2}, {"title": "I was very disappointed when my order …", "text": "I was very disappointed when my order arrived. It was a 2XL swimsuit that actually fit a size 10 person and the underwire in the bra was poking out of the fabric on both sides. I put in a ticket only to be told I had to pay full to send back to China for a refund which cost more than the item. I would be happy to try a different item but I was not given the choice and as it stands, I am very disappointed in Rotita and doubt I'll do an more business with them.", "rating": 2}, {"title": "Only my second purchase on this site", "text": "Only my second purchase on this site.  First purchase took quite a battle to get a refund.  The quality of the item was absolutely terrible.  I thought I'd give them one more shot and purchased some clothing items.  The material in the Button Front Flower Print Plus Size Blouse, much like my first experience, felt like recycled plastic.  I will say the return and refund was much easier this time.  No hassle and a return label was provided with no cost for shipping deducted from the return as happened last time.", "rating": 2}, {"title": "Ordered 4 items and I'm returning 3 of…", "text": "Ordered 4 items and I'm returning 3 of them. I looked at the sizing information, but only one item fit correctly. I would love an exchange on the cold shoulder top, but not sure it's still in stock. I was happy with the returning process/shipping label, etc.", "rating": 2}, {"title": "I bought 3 separate swimdresses and…", "text": "I bought 3 separate swimdresses and only care for one of them. Want to return or exchange the other two, but I bought them on sale, and from what I read, sale items cannot be returned, exchanged, or refunded. Very disappointed because I spent over $90 dollars for all of them with expedited shipping.", "rating": 2}, {"title": "Customer Service", "text": "I haven't received the items I've ordered yet, however, the correspondence is making me nervous. The email I received seemed to be written in poor English. Not sure if the company out sources their customer service to other countries?  I will return to write another review once I get the items I ordered.", "rating": 2}, {"title": "Cute bathing suit.", "text": "I contacted customer service to return the bathing suit I ordered (too small).  They sent me the return label quickly.  I returned the item, but have not heard anything from the company as far as getting my money back.  It's been almost a month.", "rating": 2}, {"title": "Not acceptable", "text": "Placed my order after seeing my order would ship in 1-2 business days. That was a month ago. After contacting them, I got an answer that it could be due to holidays, etc. I'm sure Valentine's Day is the only holiday since I ordered. They \"expedited\" my order. It's still not here. Will never order again.", "rating": 2}, {"title": "Disappointing", "text": "Disappointing. Internet display does not portray accurate quality of product.Received product in an acceptable time frame.Clothing did not look like what was portrayed on the website.Poor quality. Cheap looking clothing.Would never buy product again, regardless of \"great sale prices\".", "rating": 2}, {"title": "Bathing Suits", "text": "I ordered 2 bathing suits. Bathing suits received in a timely fashion and were well packaged. Both bathing suits were very similar in style, however the one bathing suit does not include bottoms which doesn't make sense. When I asked  if I could purchase bottoms I was told bottoms were available but they don't match suit I purchased....why would bottoms not be provided. Sizing is not what it should be....should have ordered size up. Like suits but don't fit like they should.", "rating": 2}, {"title": "Serious PROBLEM with clothing sizes -- But good selection and easy-to-use website", "text": "Good selection and easy-to-use website, but all the clothes are mis-marked for size.  Apparently they are also all within the \"petite\" (small in stature as well as volume) size range.   I placed two separate orders, waited 2 weeks for them to arrive, only to find the size was WAY off (wrong).  Worse -- I was unable to return the items in order to get the correct size I need.  I'm stuck with two items that I can't possibly ever wear.  Left with a very bad feeling for this company.", "rating": 2}, {"title": "Ordered almost a month ago and still have received my order.", "text": "I ordered a coat before Thanksgiving,  I still havent received my order. I submitted a ticket,  all they say is \" please give us more time.\" Well I think I might be out of Time.  If I dont receive my item soon, I will be filing a claim with BBB, and getting my money back. I am so unhappy with my service.", "rating": 2}, {"title": "Never got the order", "text": "I would give this site full marks for customer service but unfortunately I never got my top, was constantly reassured it was in my country and I would get it in a few days, but that went on for 7 weeks so in the end I had to ask for a refund, which I got promptly.  Just disappointed I never got the top, but think that the postal service they use is not up to scratch in that they go through Belgium and this is not the best postal service by any manner or means.   Disappointed I cannot order again as a lot of the garments look very nice but couldn't risk the hassle and disappointment again, all too much.", "rating": 2}, {"title": "Poor", "text": "I wish I had read the reviews first. I ordered items on a 24 hour shipping but it's still isn't shipped 5 days later. I've cancelled my order but they are still trying to convince me to let them ship. & you have to pay a $3 handling fee per item? I can't quota on the quality of the items though.", "rating": 2}, {"title": "Clothes are small", "text": "Clothes are too small for what is listed.  I ordered an XXL which looked like a medium.  When you write to them or should I say \"write a ticket\" to return they really don't want their clothes back.  It is like they are not speaking english as their first language the way they write back to you.  I believe they have canned responses as well.  When you say you still want to return an item they offer 80% refund and you keep the item.  Never again.  They are bad like Zulilly but that is another review entirely. ;)", "rating": 2}, {"title": "Poor company to deal with", "text": "Ordered a loose top in a size larger than I normally buy (just to be safe) but, even then, it was on the small size. So, beware of their sizing chart - are their products made for the European market?After several back and forth emails with their 'customer services' who just seemed to be employing delaying tactics and hoping I would go away, it transpired that they would only refund 60% of the cost - and I had to pay the cost to send the item to China!There are better companies to deal with.", "rating": 2}, {"title": "Sizing is way off and their website will not take my order # to return", "text": "I ordered a dress and actually like the dress, but the sizing based on their website is \"way off\".  I tried to submit a ticket (through their website) but it will not take the ORDER # provided in my email.  I copied the # right from my email.  I tried several times.  Then I tried to call the phone number on their site and it says my call cannot be completed as dialed.  I have no way to return this item at this point.  This is not good customer service and I will not order from this site again.", "rating": 2}, {"title": "regardingT8528589903  ticket# this was …", "text": "regardingT8528589903  ticket# this was sent to 2911 w lapham st Milwaukee wi 53215  should be  2811 w lapham st I contacted USPS 3 times.  this is already paid for.  every time I try to get into your site the page says \"Forbidden Access\".Am I getting this dress or not?Josephine Muraszewski", "rating": 2}, {"title": "cost of returning goods …", "text": "I find the cost of returning goods ridiculously expensive when the cost of return postage comes to almost more than the cost of the goods ordered and paid for.The exchange of goods (ie replacement order) is far too slow taking so far up to 3 months (?)I look forward to resolution to this order soon", "rating": 2}, {"title": "I don't recommend this company", "text": "I don't recommend this company.  I ordered an item back in March and still haven't received it.  When I tried contacting them you can only email them and they do not respond in a timely manner.  Definitely not worth spending the money.  Buy American made products.  You can't go wrong there.", "rating": 2}, {"title": "Good only if you get the right size", "text": "The first bathers I ordered were the correct size. The second bathers used a different size chart and so I had to order a size up - BUT they were TOO BIG. So I requested for exchange but they were exchanging for less money (about $5 less) and I HAD TO PAY POSTAGE.Be careful", "rating": 2}, {"title": "I not to happy about the service you…", "text": "I not to happy about the service you provide, the product you show sell out very quickly. Then you take money from my instuttion and dont put it back right away. And want's we receive items each package should have return instruction just in case we want to return something inside the packages. When speaking with online chats they never told me to put RS# on the out-side of the package for return. As well as it takes to long to receive a items. One time I had avent that was coming up and wanted to wear one of your outfits and had to buy it at a retail store.", "rating": 2}, {"title": "I bought three dresses long floaty …", "text": "I bought three dresses long floaty ones, they were cheaply made with nasty thin manmade fabric, they did not hang right due to the cheapness of making and the colours were not as advertised. I will never buy a product from these people again.I will say that they buying experience was ok though", "rating": 2}, {"title": "First it takes a long time to get the…", "text": "First it takes a long time to get the clothes.  I think they don't actually make them until they get an order.  Figure a minimum of 3 weeks.  To be fair, they do give you a date but its pretty far away.  I was SO disappointed with the fabric.  It was not the same shown in the picture.  The picture depicts a more fluid fabric.  The actual product felt like polyester double knit!  I thought that died with the 70's!   It doesn't breath.  The colors were right on but I would not order or recommend this place to anyone unless you like cheap polyester knit.", "rating": 2}, {"title": "Swimsuit is going in the trash", "text": "Just received a swimsuit I ordered six weeks ago. They do not tell you how long shippping will take until after the order is made. The swimsuit resembles the picture as far as color and style but the fabric is subpar. I will throw it in the trash. Be warned you get what you pay for.", "rating": 2}, {"title": "I needed a bathing suit for my trip in…", "text": "I needed a bathing suit for my trip in one week. Payed 11.55 for the 3 to 5 business day shipping. After I placed the order, they said 2 to 5 processing  days, and then 3 to 5 business days, so that could be a total of 10 business days. Thanks for telling me after the fact.", "rating": 2}, {"title": "Great looking shirt, sized way wrong, totally useless", "text": "This is actually a great looking shirt, well made of superior material. It is simply sized so ridiculously wrong it's almost laughable, except that it is totally useless. My wife wears an L to XL,  we ordered an XL to be sure of sizing. It might fit someone who wears a medium but certainly not a large nor extra large. In fact, she could barely get it over her head. She really likes everything about it except size, of course. Guess she'll donate it or pass it to a smaller person. Would give it only one star but she really likes the product.", "rating": 2}, {"title": "People don't by stuff from Rotita", "text": "People don't by stuff from Rotita. It looks cheap.It looks like it was made at home. And color and size definitely doesn't match. On their pictures every looks nice.But reality is different. AlsoI was waiting one month for delivery .Unhappy customer...", "rating": 2}, {"title": "Quality below average", "text": "I bought a dress from Rotita to give to someone as present and paid more for fast delivery. The dress arrived in 7 days  (it's the fastest that they can do from China). The dress was small on the shoulders for the size that was requested and logger that what the picture shown, also the quality of the fabric and making was below average.After reading the reviews and the trouble that people go through to receive a refund, I decided not to send the dress back and bought another dress from Next UK that arrived the following day, good quality and fitted well, also cheaper than Rotita.", "rating": 2}, {"title": "Disgraceful", "text": "Received my order after  about  3 weeks ,and wanting to return some items but cannot  find any customer services to ask details bout returning goods,and my goodness I've tried ,so definately won't be buying from ROTITA'S  again    POOR AFTER SALES   Thank you AG.", "rating": 2}, {"title": "False advertising", "text": "I purchased two dresses. when ordering the size chart was for american sizings so chose accordingly.When the products arrived and they are meant to be dresses. They dont even cover my but and they are XL.Most dissapointingWill not be purchasing from this company again", "rating": 2}, {"title": "Item ordered was nothing like picture…", "text": "Item ordered was nothing like picture shown on website and trying to return an item is a nightmare. Had to return item from Britain to American at a cost of £10 and had to chase for refund. Been put off by buying anything from this company again", "rating": 2}, {"title": "SCAM ON THE INTERNET", "text": "I ordered two bathing suits & two tops.  The tops are longer than dresses!  Let me re-direct,..”The top,” as I’ve only received one since placing the order two months ago!  The other top...super, super long!!  Picture was very deceiving.  Bathing suits..kinda what you expect for $26.  The frustrating point... If you go On-online & follow directions to request “Return Aporoval” ...totally BOGUS!!  Nothing happens!  This is a fraudulent company that has ripped me off for over $150!!  I will continue to pursue; but don’t you let them rip you off!  DON’T ORDER FROM ROTITA!!!!", "rating": 2}, {"title": "I ordered 2 dresses for my sons wedding…", "text": "I ordered 2 dresses for my sons wedding in August 2019. One I loved the other just didn’t look good on me but a very cute dress that I am returning. The one I’m keeping however I noticed had a spot right at the chest!!! Have no fine od returning it for another one. Sent it to the dry cleaners hoping it comes back clean and spot free! BTW the spot showed up in a pic I took before I took it to the dry cleaners! My thinking is someone wore this dress and then returned it! I’m slightly upset this company let this slip by them! I will provide them with a pic of the dress on me with the spot very noticeable!", "rating": 2}, {"title": "Not a pleasant shopping experience", "text": "Be careful of this site. A waste of time and money using this site. Clothes ordered were too small and one top was supposed to be orange but turned out to be brown . Items not like in photo not as long as in the photos. Material seemed to be ok. Communication was good and after much encouragement they gave me 80% of my money back and they said I could keep the items. ( don't fit so I don't know what to do with them )  Overall lost 20% and postage fees. Postage took 4 weeks. Paid extra to expedite postage but didn't make it any sooner. Not a pleasant shopping experience.", "rating": 2}, {"title": "Sizes just crazy - and a very difficult company to get hold of to return goods which are far too small!", "text": "Sizes just crazy -I ordered several tops after having spoken to the Customer Services about sizes and then ordered XXXL and they have now arrived sone 4 + weeks later and they are all far too small -I want to return them and after numerous attempts to sign into my account with the correct email and password I am getting g absolutely nowhere -not a good pre or post shopping exoeruence.I would truly like someone to be available to be able to let me know how on earth can I get in touch with this Company and how do  I return the good back to them.Thank youPatricia (Soundy)", "rating": 2}, {"title": "Beautiful dresses but horrible quality…", "text": "Beautiful dresses but horrible quality fabric, and the returns procedure is more complicated than it needs to be. Plus return shipping to America cost almost as much as the dresses 😱 thank goodness for PayPal return shipping refunds!", "rating": 2}, {"title": "Sent wrong size", "text": "Sent an extra large when I ordered a large.  No information to return.  Waited so long for the product I now have no time  to re-order a bathing suit that would fit.  Product us nice and good quality.  Would be happy if it was the correct size.", "rating": 2}, {"title": "Not very happy…", "text": "Sick of you taking my money then not bothering to tell me that something is out of stock. There is nothing on your website to be able to speak to someone or even send you an email.I appreciate that things go out of stock but you have no right to not tell me and then keep my money. I have twice now had to get Paypal to get me the refund. If the product is 'out of stock' take it off the site before you take the money!! I am satisfied with the products I have received but you really need to revamp your site and make it easier for customers to get in touch when there is a problem/issue.", "rating": 2}, {"title": "Blouse not as pictured", "text": "Just received a blouse that the picture clearly shows has sleeves at the elbow. The blouse clearly does not, just basic short sleeves. All of the reviews are five stars on the Rotita website, I doubt my critical review of two stars will make it.", "rating": 2}, {"title": "Customs Taxes & Duties", "text": "My 18 year old daughter bought a dress for a wedding. It arrived and was OK not as nice as the picture but nice enough. Then 2 weeks later we get a bill from TNT International and are billed £27.08 for a dress that cost less than £20. No where on the website did it mention that we were liable for the taxes on imports from China. which is about right as no where on their website does it say that the dresses are being sent from China cos we wold have not bothered ordering. So now we have had a dress that we paid express shipping on and now paid double what we thought. STEER CLEAR!!!!!", "rating": 2}, {"title": "Swimsuit bra inserts were tiny in…", "text": "Swimsuit bra inserts were tiny in comparison with those of the previous costume I purchased. Had to pay £10 to return it...request for refund of postage given that product is faulty met with no response. Will not order from them again.", "rating": 2}, {"title": "Beware do not buy from this site", "text": "I have given up trying to return a bathing suit as the bottom was fine but the top was too big.There is no return address, they have a 'ticketing' system which means that you e mail on their website and await a response. Nowhere can you find a return address and each response is with things like did you order the correct size and can you measure the top and send to us and we only give 60% back anyway and so on. They have given me a fraction back as compensation so I have lost £20 on this item.What a pity as some of the products look good and I may have bought again if the service had been decent.", "rating": 2}, {"title": "I ordered 2 bathing suits and on April …", "text": "I ordered 2 bathing suits and on April 6th and still havent recieved them yet I am very disappointed dont know if i will recieve my things or not the payment  has already went through so everything is paid for but still no product ugggg very upset", "rating": 2}, {"title": "ROTITA ORDER VIA FACEBOOK", "text": "I placed an order with Rotita via Facebook.   Just as I was beginning to think it wouldn't arrive it actually did, but there was no paperwork inside the parcel of anywhere to return the parcel to if you wanted to.   The sizing is extremely poor and the quality is less then adequate.  I have been trying via their website to make contact but surprise surprise you can't do that and a telephone number 0203 389 5035 that was on the parcel label rings but is never answered.  Basically Rotita are scam merchants who take your money and have no customer service at all.  DO NOT TOUCH THEM WITH A BARGE POLE - YOU HAVE BEEN WARNED.", "rating": 2}, {"title": "I was very disappointed in the swimsuit …", "text": "I was very disappointed in the swimsuit I purchased and am returning it.  It is supposed to be a size 20 which should fit, according to your size charts, a size DD.  It is WAY too small in the bust, although the rest of it fit perfectly.", "rating": 2}, {"title": "Clothes are sometimes several sizes too small. Their return policy is impossible.", "text": "The quality of the clothes is not bad. I ordered two swimsuits and they were both well-made and attractive. The problem was that one was true to size while the other was at least two sizes if not 3 sizes too small.  Rotita makes it very difficult to return items.  They won’t take any returns unless you have their permission. In order to get their permission you had need to have a conversation with them over the phone.  Since I didn’t have time to do that during my workday, I had to eat the cost of the second suit.   That is really too bad, because I had a shopping cart with about $250 worth of merchandise. I was too scared to check out and lose more money.", "rating": 2}, {"title": "No refund, No record of order", "text": "I made an order and to do so you have to register for username and pswd on their site or you can sign in directly with Google but they want access to everything on your phone including all contacts while YOUR DEVICE IS POWERED OFF. I made an order by registering and not signing in with Google and received shipping and payment confirmation but when I went to sign in and check the status of my order, it said THERE WAS NO RECORD OF MY ORDER. They surely charged me for it. It arrived in a couple weeks, didn't fit, I submitted return ticket but again they say they have no record of my order or the return tickets I submitted along with pictures of the item.", "rating": 2}, {"title": "very poor quality", "text": "very poor quality. looks terrible. cheap and nasty. Material so thin completely see through. took ages to arrive. put straight in charity shop bag. won't buy again from here. Save your time and money for somewhere better.", "rating": 2}, {"title": "Poor quality merchandise", "text": "Poor quality merchandise. Ordering is a disaster. Sizes are tiny. Never will order from them again. Least my stuff did ship as promised. Won't even bother trying to return. Threw it all in trash. Lesson learned. Stay away!", "rating": 2}, {"title": "I'm still waiting for my order", "text": "I'm still waiting for my order.  It was supposed to arrive on 12/23 and then on 12/26 and it still isn't here on January 2.  Still waiting................ I suppose it won't be here for Christmas.  Maybe next year.", "rating": 2}, {"title": "I ordered a nice dress", "text": "I ordered a nice dress, but it didn't fit very well. So I contacted you for sending back the parcel and have a refund. There was no answer , also after 3 times writing, so the service is very poor. I won't order again!!!", "rating": 2}, {"title": "They have a great selection of the kind…", "text": "They have a great selection of the kind of clothes I like. Unfortunately they are not at all consistent with their sizing even when using their size chart and be prepared to wait a long time for product delivery.", "rating": 2}, {"title": "Sizes are rediculously small", "text": "Sizes are rediculously small.  Returns expensive and nigh unto impossible.  Goodwill is getting some pretty nice brand new clothes this week.  Some little person out there is going to feel mighty proud wearing a size Large", "rating": 2}, {"title": "Will not be ordering from Rotita again", "text": "Shipping takes forever and the quality is not great. Still waiting on the rest of my order close to a month now since they broke up my 3 items in 2 shipments. Ordered a black dress with a red belt, the red lines on the dress are orange and no red belt. Ordered a grey and polka dot dress, turns out it's a skirt and top and it looks terrible, the waist ended up being a little to tight and the top is so poofy it makes you look disproportional. Will donate it to good will since I can get no use out of it. Still waiting on my royal blue dress, I'm excited for that one and hope it's great and actually royal blue, but thus far, will not be shopping on this site again.", "rating": 2}, {"title": "Have not receive order", "text": "It's going on three weeks, have not talk to anyone. I hope my dress come in soon. It is paid for so, now I wait. Don't know what to do? I Love all their clothes. Have not found a number to call, so you just wait!!!", "rating": 2}, {"title": "I’ve still waiting.......", "text": "I’ve been waiting now for almost 1.5 months & still nothing. Will change my review once item is received and IF it deserves a higher rating! Fingers crossed 🤞🏻🤞🏻🤞🏻", "rating": 2}, {"title": "Awful product", "text": "The on line pictures looked amazing and I bought a top..however so disappointed with the look and quality I won't wear it..looked nothing like the picture..the material and design are cheap and tacky..", "rating": 2}, {"title": "When I try to register to review…", "text": "When I try to register to review merchandise, they're site says my email is already in use and will not let me register.  Poor quality merchandise looking nothing like the item on line. Very disappointed.", "rating": 2}, {"title": "I have received a wrong order  and 3 weeks later they are still looking into it", "text": "I have received a wrong order on the 9th of May and they are still not providing an address  for me to send the wrong order back and I haven't received my correct order but they still have my money. cheryl", "rating": 2}, {"title": "Review of Company", "text": "I placed an order on March 12, 2020 for two swimsuits and no one connected me regarding a delay in my order.  I had several online chats and kept getting the run around.  No one could tell me where my package was \"in transit\". I was told I would get an email in 48 hours for a transit update, no email ever came from my communication through the chat feature.  I was even told my order was canceled by one rep in the chat. The chat feature sucks when it comes to customer service. The only time I got any real information was from sending an email. I wish I would have known that in the begining. Why have the chat feature if there is no real follow-up from it?  My order finally arrived on May 4, 2020 and you can check out the reviews from tkb821.", "rating": 2}, {"title": "Very poor customer service", "text": "I've just had to pay £12 customs fees to get my items that I ordered in September. When I've emailed the company they just keep sending the same email back telling me when the items were shipped", "rating": 2}, {"title": "I have already told you that I am very…", "text": "I have already told you that I am very unhappy about receiving garments of supposedly the same size (2XX and XXL) but I can't wear one of them because it is very small, more like a L. You asked me to pay for my own shipping to return it to you when I consider that you have sold me a faulty product! See below:Dear Elizabeth,Please return to our site and submit the return tracking number or the photo of receipt by live chat or ticket. We will issue a refund for returned items (not include the return shipping fee) after we receive the return package, please make sure all items unused and in good condition. Return Address: 371 Little Falls Rd #4, Cedar Grove, NJ, 07009, USAConsignee:HABIT PARCELRMA number:W102313201, please write RMA outside the package.", "rating": 2}, {"title": "I have not ordered but I came to this…", "text": "I have not ordered but I came to this site after looking at tops that were selling full price at about $28...so I go to their sale tops also $28 original prices in the 50 dollar amount. Please.", "rating": 2}, {"title": "Poor Quality Clothing", "text": "My wife purchased 5 items from this site and all looked really good on the website. When they finally arrived after some time I realised that they had been shipped from China. My wife was not happy with the quality of the items and were was really very poor and fitting was not good. When you wish to return the items there is no return info on the website so I contacted their customer service and they said that it would not be worth sending back as too expensive and I would have to pay the shipping. Sure enough it was £18.50 to return the items but my wife had spent £60 so I decided to cut my losses and pay the return cost.I know it will take a while but I have still to be refunded, Watch this space. Steer clear of this site.", "rating": 2}, {"title": "upset BJ DEVEAUX", "text": "my name is BJ Deveaux and I ordered something from this company and it is april I ordered in January 2017 I have been emailing  them trying to get my items or my refund asap they always emailed me back promptly they offer 40% at first I stay on them then they offered me 50% refund this is all good for them but I don't have my items at all and it is not my fault that the items got lost or never came to me I paid and I should have been refunded all my money so be careful with this company they are not loyal to their customers ok why should I received only 50% back I did not pay them 50% I paid a 100% that should have been my refund so I am not happy and will not order from them ever again so guys you have been warned  no no no don't trust it", "rating": 2}, {"title": "Delivery date after payment ! Give it a miss", "text": "You won’t get the delivery date until you have paid, so if you want it for Xmas 20 don’t bother ! Swore I would never but anything from China but fell into the trap! Don’t", "rating": 2}, {"title": "Not happy", "text": "Unfortunately I purchased a dress from your company returned it the same day as it wasn't the dress I ordered, or didn't look like the dress ordered but am still awaiting refund", "rating": 2}, {"title": "What a Nightmare", "text": "What a nightmare.  I ordered online.  It took almost 30 days to get to me and everything had to be returned because nothing fit.  FYI, their sizes run small.  I went through their steps for returns and sent them the tracking number per their instructions.  30 days later, no refund.  I talked to them...\"don't worry!! I'll take care of you.  You'll get and email within 24 hours confirming your return.\"  A week later, nothing.  I reached out to them 3 additional time.  \"don't worry!!! I'll take care of you.\"  Nothing. This went on for almost 2 months.  Finally, I saw a refund from them on my Pay Pal account (BTW, I never got the promised email) but it wasn't for the full amount.  It was short by $32 and I paid for the return postage. They have cute clothes but NEVER AGAIN!!!", "rating": 2}, {"title": "Complaint", "text": "It takes too long for delivery process. I have requested to canceled my order twice and asked for a refund credited to my card. However, I am still waiting to get this issue resolved.", "rating": 2}, {"title": "still waiting and worried", "text": "ordered a mustard colour jumper that was over 2 weeks ago money taken right away from pay pal but no item i keep \" urging shipment \" but they have a generic message that says thank you we are looking into it or something like that and if you want to contact them it's a whole palava when i pressed pay now on my pay pal i did feel a bit sick and thought oh oh maybe i shouldn't have done that before checking thoroughly online the reviews etc i found a f/b page that is full of people that have been scammed from rosita as they don't get items or it's not same as picture or it's terrible quality i will be opening a dispute with paypal to recoup my money , my hard earned money through working my fingers to the bone!!! why are these people allowed to trade?", "rating": 2}, {"title": "The Crap Material Company", "text": "I ordered 8 items, 2 jumpsuits, 2 dresses, 3 swim skirts and a anklet. They look gorgeous in the pictures, sadly when they came all of them were cheap looking, stretchy nylon, The items that the models wear are not the same material and also the the dresses that they send look nothing like whats in the pictures. I hadn't even received one but told them not to bother. It cost me £32.00 tracked and signed for returns parcel as its from New Jersey USA, basically the cost of one of those garments, the anklet looked like my 6 year niece had made it in one of those make your own jewellery set. I told them if you actually made your clothes in better material like the ones the models wear and that would fit real women they you would have less returns, less complaints and  bigger profit for your business. I won't be ordering off this site again, its just one bit waste of money. X", "rating": 2}, {"title": "very deceitful the beauty of there add …", "text": "very deceitful the beauty of there add is co comparison to what you receive. The material is very cheap . And now I ask myself how much is their return policy worth,     Connie", "rating": 2}, {"title": "Poor quality", "text": "The tops purchased had long arms and were cheaply constructed. They were cute in the pictures but poor quality. Out of 4 purchased, only 2 tops are wearable for me.", "rating": 2}, {"title": "Two items received was of poor quality", "text": "Two items received was of poor quality. One dress arm hole was double the size and when I type my details in alot of other fake emails is poping up. The site is fake.", "rating": 2}, {"title": "I Don't feel the customer should be…", "text": "I Don't feel the customer should be responsible for shipping charges on exchanged items! As a result probably no further business will be done with your company.", "rating": 2}, {"title": "Low quality materials", "text": "I bought 3 dresses from them,it's of low quality.i wear the navy blue  maxi gown once,it brought out wool rashes all over.The polyester fabric is a bad one.", "rating": 2}, {"title": "I ordered two swimsuits on 4/27/2018…", "text": "I ordered two swimsuits on 4/27/2018 and paid extra for expedited shipping as we'll be traveling overseas to Europe in late May. I haven't been able to open my order on laptop because I ordered the items by phone as a guest and didn't set up an acct #. Now (5/15) I tried to create an account on my laptop. No matter what I try, I'm blocked. (If I try to log in using my email address, and indicate I forgot my password, it insists I enter a valid email. If I choose the remaining option, to create a new acct., I enter the same email and get a message that it already exists. I returned to my phone and learned the items have not yet been shipped! I will NEVER ORDER CLOTHING FROM CHINA EVER AGAIN! (I should have listened to my gut-- once before, from a different company, in Shanghai. Every item was too small. The expense of return shipping was so high I just donated them to Good will.", "rating": 2}, {"title": "Very slow delivery been waiting weeks…", "text": "Very slow delivery been waiting weeks but payment went thru immediately. Hope I don't need a return, should have read the reviews before I ordered.", "rating": 2}, {"title": "Poor service and cheaply made clothing", "text": "Trying to return a product and keep getting an error message and no response from company. Very low quality clothing for the high prices paid.", "rating": 2}, {"title": "I am still awaiting answer to W1705160108099311.", "text": "I am still awaiting answer to merchandise paid for and not received.  So far no answer.  No notes or communication from Rotita.  I like many of their products, just  not treated with the trust  and respect given. I Paid for items not received.   Received Rotita email offering gift to put a disgusting $3 dollars in my account  For  Order # W1705160108099311, Regarding  items:1- One Shoulder Top and Belted High Waist Skirt in  BLACK   L   $29.242- Doutlet Slit Asymmetric Hem High Waist  BLACK   XL  $31.88ALSO REQUESTED GREEN XL LARGE GREEN LACE PANEL LONG SLEEVE BLOUSE SENT TO ME IN   SMALL. (s) NOW WHO IS TRYING HARD TO THINK FOLKS ARE STUPID.    ROTITA NEEDS TO SEND MY ITEMS OR PAY ME BACK A TOTAL OF = $ 61.12 + TAX . WE ARE GROWN FOLKS WITH COLLEGE DEGREES NOT IDIOTS  OR IN KINDERGARTEN.   THIS SAY A LOT OF DISHONESTY ABOUT THE ROTITA ORGANIZATION OR WHATEVER THEY'RE TRYING TO PORTRAY. VERY SAD.....HAVE THEM GET ME MY MERCHANDISE.", "rating": 2}, {"title": "All their clothes run at least 4 sizes…", "text": "All their clothes run at least 4 sizes to small.  I normally take a size XL and with their clothes I have to take a 5X so it will fit.", "rating": 2}, {"title": "I ordered cyan colored swim dress and…", "text": "I ordered cyan colored swim dress and recieved ugly plain blue and don't want to send it back cause to late in the swim season", "rating": 2}, {"title": "I did not receive my most recent order", "text": "I did not receive my most recent order.  I received an email that it was on its way on September 8th and still have not received it.", "rating": 2}, {"title": "horrible dress", "text": "Does not look like on the screen at all, looks like it is made out of a bed sheet. Not whit either more like off white yellowish.", "rating": 2}, {"title": "Double billed double shipped", "text": "I want to return both orders. Items are nice but run smaller than even the reviews suggested.  Do I need a return authorization?", "rating": 2}, {"title": "Lovely product just too big", "text": "Lovely product just too big, the return procedure is very hard to understand, and navigate too on the website.", "rating": 2}, {"title": "Need the address", "text": "LOVE the dress but need a bigger size can't seem to get a reply from the company also I don't have a returns address", "rating": 2}, {"title": "wasnt satified", "text": "I ordered a top a wee and a half ago and it just arrived yesterday, don't think I will be ordering from Rotita anymore", "rating": 2}, {"title": "I ordered my tops Dec 6 and I still don't have them.", "text": "I ordered my tops Dec 6 and I still don't have them. what is the problem.Today is the 3 JAN 2018.I Vivian Strickland", "rating": 2}, {"title": "Never got clothes", "text": "Ordered clothes and never got them. Paid when I ordered them.They will not contact when I leave a email or message.", "rating": 2}, {"title": "Loylisa big help but having to wait…", "text": "Loylisa big help but having to wait long time for package. Costumer service a 5. But delivery not good.", "rating": 2}, {"title": "cannot get into account.. passwoed wont allow", "text": "Would buy from your company but I cant find a way into my  account...I order alot of merchandise online by the way", "rating": 2}, {"title": "Clothing", "text": "Wish I had read reviews before I ordered.  Placed an order on 2-1-17. Have yet to receive it.  Disappointed", "rating": 2}, {"title": "It shows you get a discount but doesn't…", "text": "It shows you get a discount but doesn't subtract one at checkout. So didn't place my order!!", "rating": 2}, {"title": "Rubish", "text": "Clothes are not what you expect sizes are a laugh will not be using them again customer service crap", "rating": 2}, {"title": "Been trying to return a few items for…No Return Address", "text": "Been trying to return a few items for awhile now and can’t locate “ A Return Address", "rating": 2}, {"title": "I ordered 2 bathing dresses at 40% off…", "text": "I ordered 2 bathing dresses at 40% off and only got one and it wasn't even at 40% off", "rating": 2}, {"title": "Sizes are way off- I ordered 2 sizes …", "text": "Sizes are way off- I ordered 2 sizes bigger than I normally wear and it is way to small!'", "rating": 2}, {"title": "I have been waiting since Friday for a …", "text": "I have been waiting since Friday for a shipment address to return goods. Not a good service", "rating": 2}, {"title": "I still have not received my order …", "text": "I still have not received my order which I placed before the holidays.  Today is Jan. 10.", "rating": 2}, {"title": "I ordered clothing from Rotita", "text": "I ordered clothing from Rotita. Com and were delivered just on time. I love the dresses", "rating": 2}, {"title": "Timeline and Pricing Not What You Think", "text": "Let me preface what I'm about to write with the fact I have not yet received the product, so I cannot speak to the quality.I can, however, share the deceptive way their website presents itself.In Checkout, \"Free Shipping\" suddenly had a close to $8 non-optional insurance charge added to it.And only after you place the order do you get the message, \"How long will it take to receive your order?\"  It will be way longer than you thought.  \"Total Delivery Time = Processing time + Shipping time\"  From my order screen:We will give priority to items marked” Priority Dispatch”, but in orders with more than one item, the processing time will be based on the item with the longest processing time.Processing Time - 6-10 business daysShipping Time - 9-12 business daysTotal Delivery Time - 15-22 business days\t\tThat's Business Days, so it's possible I won't see what I ordered for over 2 months, at which point the summery things I ordered will be nearly out of season.This brings a whole new resonance to the phrase, \"Slow boat to (from) China.\"  I wish I'd researched the company here first.Update: Rotita Customer Service has been proactive and three days later the problem is resolved. Initially they gave me a store credit, but I wrote back to say I wanted a refund instead and have had my money returned.", "rating": 2}, {"title": "The quality of the clothing is really…", "text": "The quality of the clothing is really badIt is not as it looks on their website.", "rating": 2}, {"title": "The material feels cheap (Very light…", "text": "The material feels cheap (Very light material and doesn't feel right)", "rating": 2}, {"title": "size to small for usa", "text": "it took to long to get here.  very very small for american size. xl like small", "rating": 2}, {"title": "Product", "text": "Haven't received my very first order yet so can't really give a review", "rating": 2}, {"title": "AVOID or proceed with caution  - see update", "text": "AVOID AVOID AVOIDThis is a terrible company I wish I had never dealt with. In a moment of weakness on a lonely night in I was seduced by Rotitas advert on Facebook, not something I’ve ever done before or will again. I ordered 3 tops for Xmas, without reading any reviews ( big mistake). They took weeks to arrive ( coming from China), only just arrived in time for the Xmas do. Cheap tacky material, nothing like what they look like in the photos. They don’t make you feel good- know what I mean?Having waited so long & by then I’d read the reviews I decided to not lose everything, & returned just 1 top. What a con their returns service is. So complicated and as with other reviewers I did not know about needing a tracking number so without this you CANNOT complete the return form. ( no doubt paying to track the parcel would have cost me even more than the cheap tacky thing was worth,)SO IT COST ME £6 TO POST BACK TO USA , A TOP COSTING £22, AND I AM NOW OUT OF POCKET FOR £28 .Please DON’T give this terrible company your custom or your MONEY.  They are con artists , you can buy better quality with a superior service elsewhere. AVOID AT ALL COSTS FOR YOUR HAPPINESS AND SANITY.An update to this review - following these comments, I did receive a refund of £28, which I was surprised yet relieved to receive,  so have changed my rating. However, Rotita need to take a hard look at their systems and quality. Will I use them again or recommend to a friend? Definitely Not.", "rating": 2}, {"title": "Poor quality clothing", "text": "Well the ongoing saga .....We are sorry that your item does not meet your expectation, and we will do better. How about you keep your item and I help apply a 15% compensation to your user center? You can use the store credit for your next purchase. As for the item you got, you can gift it or donate it or sell it online at a great price. As you know, if you return it, it will cost you much for the shipping fee. And we issue a 60% refund for returned orders. The shipping fee and handling fee we spent on your order when shipping the order out, this part cannot be refundable. If you still want to return your items, we will send you the return address. This is the reply I got on the Rotita complaints procedure, and this is the reply I get on here. As you can see two different answers!!!Thanks for your feedback. We have been devoting to offer good products with low price, but it maybe up to your expectation. So you could return anything you want, under the condition it's in original condition. Postal service is a good way to return, and I suppose it’s not much expensive. After we get the return package, 100% refund will be issued.Our customer service will send the return address to you, please submit a ticket ASAP and we are expecting for an earlier reply. Please mention that you are from trustpilot.Best Regards,Don't order from this company - they deliberately send you poor quality clothing knowing you want to send it back and then make it difficult and not worth your while sending it back.", "rating": 2}, {"title": "I have only received 2 items of the 3 I …", "text": "I have only received 2 items of the 3 I have ordered and paid for.", "rating": 2}, {"title": "Items take too long to be delivered and …", "text": "Items take too long to be delivered and the tracking doesn’t work", "rating": 2}, {"title": "I have not received anything yet", "text": "I have not received anything yet. So I can't rate u yet", "rating": 2}, {"title": "Still waiting on my purchase that I …", "text": "Still waiting on my purchase that I made on October 21st!!!", "rating": 2}, {"title": "LO296314817CN", "text": "LO296314817CNI haven't been able to track this item", "rating": 2}, {"title": "There is no way anyome want to wait 3…", "text": "There is no way anyome want to wait 3 weeks for a dress", "rating": 2}, {"title": "I still haven’t received my item that …", "text": "I still haven’t received my item that was ordered 9/29!!!", "rating": 2}, {"title": "Disappointed in shipping process love…", "text": "Disappointed in shipping process love the clothes.", "rating": 2}, {"title": "Scammy, poor customer service, and paying customers to review them well on this site", "text": "I was excited to get the items I ordered because I thought there were some really cute things, but I got very very sketched out when I got an email asking me to submit a picture of my driver's license and credit card for their verification. I have never received that kind of request from a legitimate company. I got very concerned that my data privacy was being violated by this company.It took a lot of work to find the place on their website to submit a Help ticket, and they keep trying to make it difficult by giving an \"Did this FAQ solve your problem?\" response instead of opening a ticket.I got the same (poorly written) auto response multiple times, and then they tried to ask if I wanted store credit instead of a refund.  I think I was able to get the full refund, but only because I cancelled within 24 hours, otherwise they were going to make me pay $3 per item for restocking (and many of the items were under $5).Today I got the following email:Hi, dears,Sorry to interrupt you! But I can't wait to tell you this great news! From now on, you just need to spend 3 minutes to make a positive comment, and then you will get $3 from Rotita.com!Take the following steps:1. Just click the link <--this was a link to trustpilot2. Make a positive comment on our site. 3. Make a screenshot of your comment, then submit a ticket attaching with this screenshot on our site.4. After checking your ticket, $3 will be put in your account balance. You can use it at checkout page when you buy any items on Rotita.com.What are you waiting for? Hurry to catch the chance! Any more questions, please submit a support ticket contact our customer service!Best wishes!Rotita.comSo, I would be wary of positive reviews on this site-- since they are basically paying customers to bring up their average.", "rating": 2}, {"title": "Love dress very pretty 😍", "text": "Date of experience: March 12, 2022", "rating": 2}, {"title": "Saved From the Runaround", "text": "I was about to order a really awesome jacket from Rotita, but something stopped me from putting in my credit card information (and that something is my love of research). So, I went to Google, looked up \"Rotita Reviews\" and voila, here I am...GLAD I DIDN'T COMPLETE THE ORDER.In reviewing many of your reviews, I started thinking back to an order I made through a different company that was advertising on Facebook. I saw a dress in the advert that I absolutely loved, and wanted to order it for a Phi Theta Kappa Induction Ceremony that I was to participate in. Well, let's just say that I never got that dress, and I was out $40.00. Rotita's website smacked of a similar scam, and now I see that my intuition was spot on. One thing that really gripped my attention was the deep discounts offered for otherwise pricey clothing. I also noted the size charts, and they seemed to match up to my measurements (in inches, not centimeters). So, when I read Rotita's own responses to your complaints about sizing, here on TrustPilot, I noted that they had the nerve to say, 'Our sizes are Asian Sizing, so check the size chart.' Well, if their sizing are Asian Sizing, then a XXXL isn't going to accommodate a 44in. waist by any stretch of the imagination. Seriously, I get that these people want to provide fashionable clothing to  at a deep discount, but global shipping is an art that you must master before attempting to try it. It sounds to me as though Rotita either hasn't mastered it, or doesn't care if they master it or not.I will not trust my debit card information to a company that is not only this shady, but has stabbed countless customers in the back. A company cannot succeed without its patrons, and Rotita would be wise to keep this in mind. Good customer relations means a successful business. If you're incapable of providing international sizing, then it is best you do business within your own country. Period the end.", "rating": 2}, {"title": "Too long to get a order from you guys", "text": "Date of experience: November 15, 2017", "rating": 2}, {"title": "Don't use this site.", "text": "Date of experience: June 10, 2018", "rating": 2}, {"title": "I am very wary of this company", "text": "I am very wary of this company. I will try to keep my long story as short as possible, but a lot happened. I ordered a shirt on August 2 and it was supposed to have shipped August 5. I constantly checked the tracking to see its progress as I was very excited to get the shirt. For a week it did not move from China, nothing was updated, I didn't know what was going on. On August 11, I called customer service and asked about it. The guy I got stuck with said it was out of stock and they had no idea when it was going to be in stock again. The page didn't say anything like that when I ordered and the checkout process went perfectly fine. So I asked if we could cancel the order and get a refund. He said yes and he told me I had to install a program in order for him to get the refund going. It looked like some kind of remote access and I asked him if he was going to control my computer. I don't know if it was because he was foreign and confused or he outright lied to me, but he said no, it was nothing like that. Turns out, he did remotely access my computer. No refund process needs to remotely access a computer. At that point, I was really nervous about it. We got to a page that I had to fill out for the refund form and one part of it required the last four of my social. I asked about it and he said it was just part of the process. I didn't want to, but I filled it out anyway. After that was done, he cleared my browser history of the pages we had been on. He said he would call back later to continue the process. This first call was about 24 minutes. You should be able to get a refund going  in less time than that, and just with a phone call. None of the sketchy stuff he was doing.He requested that I leave my computer screens up after we hung up. I told him I would not do that. After remotely controlling my computer, I wasn't going to trust him to leave anything on it alone. After that, I uninstalled the remote access program, although I figured I'd probably have to reinstall it for our next phone call. I also shut my computer down, trying to take the most safe approach as possible after that. When he called back, no surprise, I had to install the remote access again. After he was on my computer, he installed something else that made my screen go black. I couldn't bring my screen back with clicks or pushing buttons on the keyboard. I couldn't see what he was doing, but I knew he was doing something. If he wasn't doing anything on it, there would be no reason to block me off of my computer. Also, my computer made the occasional ding noise. This conversation lasted about 1 hour and 8 minutes. I'd say at least an hour of this time my screen was black. He didn't talk too much during this. He asked me a few questions, like verifying my birth date and my address. I don't know why he needed a birthday. He also had five verification codes texted to my phone that I had to repeat back to him. He claimed they were part of the verification process. Three were from PayPal, one was from another company, and the last was from a third company. On the occasions I asked him questions about some things, he was very vague in his answers. When he finally let me have my computer back he said the return would show up in 24 hours and he would have to call back another time the next day for one more verification code.After that, I uninstalled the remote access program and went about my business, checking various websites I have accounts on, like my bank's website, email, Facebook, etc. My email came up with a message that my emails were being automatically forwarded to someone. I changed that immediately. Later I noticed all of my spam and trash had been deleted. I think he was on my Facebook account. I proceeded to change my passwords to everything I could think of - bank accounts, Facebook, email, Ebay, PayPal, etc. I am getting a new debit card because I don't trust him to not do something with my card number. I haven't seen anything funny on my bank account yet, but I'm not taking that risk. A while later I looked at my browser history to see if he maybe left anything from that day on it. But sure enough, whatever he'd been on had been cleared. I looked at the tracking on the shirt again and it had progressed to Illinois. Now I really didn't know what was going on. Was the shirt really on its way or was that part of a scamming process?The next day, I looked for my refund. It wasn't there. He called multiple times that afternoon and evening, but I didn't answer. I was not going to deal with him again. Who knew what else he was going to do? He was very persistent the next 3 days, calling a few times each day. I didn't answer any of them.August 14, I got an email for a refund on PayPal for a website I didn't make a purchase from. I looked at my PayPal history and there were about five transactions that took place on August 11. Some of the company's names matched the names in the verification code texts. I didn't make any of those purchases. However, what I couldn't figure out is where the money came from that he used. It wasn't my PayPal money - I didn't have any in my account - and it wasn't out of my bank account. Later I contacted PayPal and they worked on clearing that up for me. It seems he opened a PayPal credit account on my profile.August 15 my shirt arrives. It looks nice and fits. The material faded from white to blue to black in the picture but the shirt was mainly just white to blue. That's about the only difference I saw. I washed it once in cool water and hung it to dry and it seems to have made it through alright. There were no washing instructions with it.I don't think he call on August 15, but the day after he may have tried one more time.I really like some of the other shirts they have on this website, but after this, and reading a bunch of other reviews, I'm not sure about buying from them anymore. I don't know if I want to take that risk that something doesn't work for me and have to try and get a refund again. I'm sure there are other customer service employees other than him, but what if they're all up to the same shady stuff? I don't know if I'll be shopping here again.", "rating": 2}]