[{"title": "In order to close this RE-FI I had a…", "text": "In order to close this RE-FI I had a number of Accounts that had to be paid from the RE-FI. There was an overpayment by more than $2000 to 4 accounts. 3 checks were made out to CBNA no acct. # s or information who was CBNA.I complained about the closing cost & was told I probably could get a credit to lower the cost. Then was told it was denied and I would have to accept the loan as is, or not close. Griffin Bell was very pleasant & tried to help, but it took me the better part of 2 days & about 7 hours to resolve the items I listed ! Not HAPPY & I am now waiting for over $2000 and for payments to be received by the accounts mentioned above.Thank you a unhappy VET, Jerome Strzelecki", "rating": 2}, {"title": "I want to say I am not satisfied", "text": "I want to say I am not satisfied, after all the paperwork has been signed, you sent me checks to pay creditors, one check, have no idea where it goes, I don't have account with that name, tried to call Mr.Ladele for three days no respond, hoping I have not made a mistake", "rating": 2}, {"title": "Too much confusion concerning the loan", "text": "Too much confusion concerning the loan. Borrowed $50,000. on a home valued at $525,000. Didn’t believe the back and forth concerning this. Colby Richardson was my “agent”? and he was professional, courteous and accessible. My criticism is not with him but, with the process he had to abide by. In the future I will deal with a local institution and recommend to family and friends the same. Advertising swayed me so that’s on me. Older folks, veterans with a good credit history shouldn’t have to experience what my wife and I did. Again, Colby Richardson was a gentleman. “Just following orders”, I guess. I intend to pay this back well before the life of this loan.", "rating": 2}, {"title": "The way my credit card pay offs were…", "text": "The way my credit card pay offs were done. I lost alot of money I was enrolled in freedom debt relief program. Two of the credit cards were under a settlement. So after closing the program they reverted to the original amount loosing what I paid for the programs fees.", "rating": 2}, {"title": "It was excellent service until I…", "text": "It was excellent service until I closed.  Once I closed, the agent I dealt with would not answer my calls, emails, or texts.  I just want to know what to do next but nobody from this organization can't (and won't) answer any of my questions ever since I closed on my loan a week ago.  My advice to the company is to walk a person through until they are done after the closing.", "rating": 2}, {"title": "Read the reviews they are true especially the bad ones", "text": "Missed steps in the process I have written emails and correspondence concerning my terrible experience. Training needs to be held with the Title company or use another one that is more organize. I’m a disabled veteran and this was done like a soup sandwich.", "rating": 2}, {"title": "Trevor did not answer our phone calls…", "text": "Trevor did not answer our phone calls or texts. We started our application on October 6 and we didn’t close until December 14. This was entirely too long.", "rating": 2}, {"title": "New Day mortgage is ok", "text": "New Day mortgage is ok. They will speak sweet nothing in your ear until they get your business. After a time, they will sell your mortgage to a less reputable company. I had never been late one time, money was on auto pay. I did turn down their wanting me to take an equity loan. I suppose in return they sold my mortgage. Thx New Day. Taking care of all us Veterans.", "rating": 2}, {"title": "LESSONS LEARNED, NOT HAPPY", "text": "lots of discrepencies in the issued checks, wrong amounts, accounts not paid, I was misled to believe all credit cards were paid, NOT THE CASE. I would like to speak to someone about this. 228-282-5683", "rating": 2}, {"title": "Compare VA funding fees!", "text": "2 years ago I was looking to refi. I usually use NASB, but saw the ads for NewDay and it sounded good. Look around and compare folks!! The VA funding fee at NewDay was over $5000. Checked with NASB and theirs was $1150. BEWARE", "rating": 2}, {"title": "Not full and open honesty during the…", "text": "Not full and open honesty during the process. There was a lot of issues along the way. Loan officers need to be forthcoming during the process to leave no surprises coming close to closing time.", "rating": 2}, {"title": "nitpicking", "text": "There is too much nitpicking over little things, once an agreement is honored it should be kept. I was locked in for a certain interest rate; then NewDay kept dragging their feet and the interest rate went up 2 points. Had to have another inspection that wasn't necessary. We were pushed to take out more financing than we requested.", "rating": 2}, {"title": "Have been working on this since August", "text": "Date of experience: August 29, 2022", "rating": 2}, {"title": "The new day team refused to pay the…", "text": "The new day team refused to pay the debt relief people on my USAA account which in turn cost me $4000 on. I was unable to talk to anyone at New day USA other than the agent I’ll originally dealt with. Justin Robinson seem like a nice young man but he didn’t have a clue what he was doing and I was unable to speak to anyone else. I will not recommend New day USA to anyone", "rating": 2}, {"title": "Our refinance was delayed due to a…", "text": "Our refinance was delayed due to a water inspection we used the reffered inspector who did not complete the water inspection correctly and delayed the closing which caused and increase in the percentage rate. We could have gotten the water inspection completed earlier had we known the requirement.  We began the process in November and weren’t told the inspection requirement until the week before Christmas.", "rating": 2}, {"title": "Was fine at first but then they…", "text": "Was fine at first but then they switched service companies and has been a headache trying to find a payment that the old servicer supposedly returned but never has showed up in my bank account and trying to get through to anyone is like pulling teeth, should have stayed with Loandepot and might end up switching back over this!!!!!", "rating": 2}, {"title": "I contacted New Day to refi", "text": "I contacted New Day to refi. The employee assigned to walk me through the process was pushy and deceitful.  I would not recommend New Day.  There is no app for this company, come on, get with the times.  I only continued the process due to the lowest rate I could find on any market, would not use them otherwise.", "rating": 2}, {"title": "The representative that supposed to help is not good!", "text": "The representative that supposed to help us didnt help at all instead he gave us a hard time...the money that we borrowed is suppose to direct deposit to our account because thats what we signed for but instead he sent us a bunch of credit card checks that we dont know to whom we will send it..we have to look & find out ourselves...we called him & sent txt or msg but he ignore us...I guess he got us already & so he ignored us...what a company to deal with! Never that we will deal with Newday anymore!", "rating": 2}, {"title": "Everything started well at first", "text": "Everything started well at first. Then came the underwriters. New day asked for information that no other VA underwriter required, the cash out amount was lower than agrees and the process was frustrating. I will not do business with New day again nor will I recommend to any of my fellow veterans.", "rating": 2}, {"title": "Things went well as usual to start when…", "text": "Things went well as usual to start when it came to signing noticed names incorrect other unknown information representative said just sign it. He could not get more info on the situation or didn't know very frustrating. Suddenly very little contact with initial representative 2nd representative contacted us seem to know less about our situation. Needless  to say have to change names on our title which is bigger pain than thought. We will be switching companies as soon as the VA will allow!!", "rating": 2}, {"title": "Reginald Tankark was a terrible broker", "text": "Reginald Tankark was a terrible broker. He did not answer questions which should have been very simple to a broker who knew anything. He lied about fees, sent us a notary who didn't know what papers to sign not to mention he was an obnoxious jerk. We had to contact a different broker just to get this loan finished. I could go on and on however I would not have enough room. Tankard should not be in your team!!!!!!!!!", "rating": 2}, {"title": "The Loan officer (Mr.Jackson) is lazy and a LIAR", "text": "The Loan officer (Mr.Jackson) is lazy and a LIAR. We refused to settle becausehe did NOT correct the mistakes made in the forms sent us via e-mail.This after us pointing out the mistakes and him assuring us that they would be corrected on the paper work we were to sign,We were able to complete the loan after your settlement dept. became involved.We almost did NOT sign the papers when I saw Mr.Jackson listed as the loan officer.", "rating": 2}, {"title": "We were told that our loan would close…", "text": "We were told that our loan would close by the end of November. We have that in an email from Mr. Priester. As we neared the end of November, he went silent. We heard nothing from him, and he didn't return calls or emails. Long story short, we finally signed closing docs on 12/30 and the loan was dispersed 1/5. The poor communication and promises not kept is unacceptable to us.", "rating": 2}, {"title": "I have no idea what is going on I have…", "text": "I have no idea what is going on I have not heard anything from Kirt Thomas in several days .  I do not know if you need anything more from me.  The last I heard was the request for my late wife  a certified copy of her death certification.  This was sent with in an hour of the request. this was several day ago.  I have requested  a call back from Kirt Thomas and hopefully he will return my call and update me.", "rating": 2}, {"title": "Agent or Salesman?", "text": "I contacted New Day USA for a cash out loan and my agent, Bradley Whittaker was \"on it\" right from the beginning.  Brad got me the numbers I needed, but when the market went up and my rate increased from 3.25% to 3.49% I said I would need to stop the process - that was too much money, to high of a rate.  Brad then said I was indecisive and should consider moving forward with the loan because of the equity I would have in my home.  At that point my agent became a salesman and didn't have my best interest in mind - just the bottom line of his company.  Very offended and disappointed.", "rating": 2}, {"title": "The end result was achieved", "text": "The end result was achieved, so this was a success. However, do not plan on being able to communicate with your advisor. It was impossible for me to communicate with my advisor. Sometimes  it took 6 or more days to hear from him. So if you can be patient and can handle never being able to reach your loan advisor you will eventually make it to the finish line.", "rating": 2}, {"title": "I started this process back in August…", "text": "I started this process back in August and closed Dec 13. I was sure of the house that I wanted. The Home Owner and Myself will not deal with New Day again. The Owner was about to pull out of the deal because of the we need this now we want that instead of giving a list of what was needed from the owner and myself maybe it was the first time that this particular person was the in charge but it took way to long", "rating": 2}, {"title": "ALEX WAS GREAT UP UNTIL I NEEDED TO…", "text": "ALEX WAS GREAT UP UNTIL I NEEDED TO HAVE AN AUTO WITHDRAWAL FROM MY BANK. Contacted New Day. New Day said contact Alex who handled the loan process. Contacted Alex, he said wait for the paperwork to arrive in two weeks.  This started in late October, closing date.  Now some one at new day does not have a clue as to what the process is or what is expected.  Payment due date is Dec 1. It is now Nov 3. The process has been going on for at least 3 months. The finish line is the first auto payment", "rating": 2}, {"title": "This process was much more difficult…", "text": "This process was much more difficult than I expected.  I was given a March 5 closing date.  Didn’t happen.  I was given a March 12 closing date.  Didn’t happen.  When I called and was discussing it, I kept hearing words like “should” and “probably” as in “it will probably close next week”, etc.", "rating": 2}, {"title": "I’ll keep it short.", "text": "I’ll keep it short. I have 3.75 interest rate now. I called, they said I would have to pay two points for 2.99 percent. Okay, then over time they call back and say we can’t do 2.99. 3.1 with only buying one point. Okay, THEN they call back and said we can only get 3.25 approved. Blamed all on the VA. I contacted my lender, Rocket Mortage and they have me at 2.99 with no points and much less closing cost. I thought NewDay would be better because of being a Vet. Not so.", "rating": 2}, {"title": "Need answers", "text": "Thank you for the chance to ask a question. It  was my understanding that points had to be paid for a person that his or her credit was not good. Here I am paying for points for the loan at my expense. I don't understand how I am benefiting from this loan. It seems that I am paying the loan officer's salary and increasing my loan account unneccessaryly. Other offers are lower interest rates and no closing. So, in the interest of my understanding what is this scheme that yiu are trying to get over on veterans that you say are helping. EXPLAIN", "rating": 2}, {"title": "Faith has been shaken", "text": "As of today, I'm very displeased with what I have experienced with New Day.I was told we would close on the 15 of July and it has been put off another day and everyday there seem to be a new piece of information that is needed. Unless I call them I get no calls except when new information is needed .I'm a disabled Viet Nam vet and have put all my trust and faith in New Day and now I'm starting to wonder if my loan will ever close.", "rating": 2}, {"title": "Run AWAY!!!!", "text": "Took seven weeks for them to get ready for closing. Waited until the afternoon before the scheduled date to postpone the first scheduled closing. Let us sitting for twh hours at closing waiting for them to release the funds, come to find out, they had the wrong file. Piecemeal asking for required documents, seemed like it was something else every week. Waited until three days before closing to ask for 2 years of W-2s. Just totally unorganized and unprofessional all the way around. Run away...Run AWAY!!!!!!", "rating": 2}, {"title": "Still no $ and we were funded Friday…", "text": "Still no $ and we were funded Friday July 8th no checks came like Matt told me and that the closing attorney told me yup they will be to you by Fri....but now Monday and no checks", "rating": 2}, {"title": "Denial letter AFTER being told approved", "text": "Just received a denial letter in the mail today after being told by my loan processor last week by email, Chelise McGhee, that there was nothing further needed before going to settlement once it can be determined if a local credit union had a legitimate lien against my property, which they don't. This letter was dated the day before her email! Communication throughout this process has been slow and tedious. I cannot and will not recommend this company to other veterans. Bad experience.", "rating": 2}, {"title": "Extremely time consuming, frustrating, and expensive.", "text": "The entire process was time consuming and frustrating. I received two \"tentative\" closing dates. Neither of which were accurate. The process took close to two months to complete. They expect complete trust from you and don't reciprocate. If you are thinking about going through New Day USA ensure that you inquire about the closing costs before you get too far into it. They are extremely high. I would NOT recommend this company to anyone.", "rating": 2}, {"title": "The appraiser that was used was beyond…", "text": "The appraiser that was used was beyond reasonable and was completely inept. I still don't understand the closing costs and letting the borrower have his/her money to pay off their debts would be a much appreciated step. Nevertheless, I am grateful that NewDayUSA did reach out to us after we thought we weren't going to get the loan and it finally was accomplished.", "rating": 2}, {"title": "Very Disappointed", "text": "I received a letter in the mail today about a refi.  Called the number and started with our application.  Everything seemed good until our guy started explaining things to my wife.  She asked questions and he got very pushy and wouldn't listen to her concerns.  He used this phrase a few times, \"the reality of the situation is.\" It felt very condescending, like he was making our situation into something that we needed him to fix or there was just no other option than what he presented.  For this, we decided to withdraw our application and just move along.  In the end it was very disheartening.", "rating": 2}, {"title": "Review update", "text": "On are first refi and cash out was excellent and very professional.On the VA Rate reductiuon was not up to the standards of NEW DAY USA(MS. PETZOLD ) I feel she did drop the ball. !!!!!! Ms Petzod, lack of attention to detail on our refi cost us .50% over 30 yearswhich would have been a big saving over the course of the loan for are family.  this update is about Ms Petzod", "rating": 2}, {"title": "You all advertise as being veteran…", "text": "You all advertise as being veteran friendly you are not and this BS about no out of pocket cost another bunch of crap,after doing a little research i saw more than a couple that had to get the BBB involved to rectify an issue with your business practice  All ans all your company SUCKS", "rating": 2}, {"title": "I was supposed to close on my new home…", "text": "I was supposed to close on my new home on Feb. 9th and was told a week before the closing date, I was told newday was closed for a party.  Very unprofessional to stop all operations when people are trying to move into a new house. Closing got moved to the 12th.  Had to move into grandma's house for the weekend because of a PARTY. Then newday took 2 1/2 hours to release funds after all paperwork was signed. Unprofessional.", "rating": 2}, {"title": "Too much paper work sent", "text": "Too much paper work sent , I receiver 8 copies of the same thing , Daniel , my account rept did not know of this extra paper work and what to do with it. Daniel was very knowledgeable in his work, when we closed out we had two more copies of the same paper work that I had on file . Total pages I had on file was about 600 and now they are in the trash . Took a total of over 90 days to close .", "rating": 2}, {"title": "I'm a senior citizen", "text": "I'm a senior citizen, the agent that was handling my deal was Samantha DiPomno. Samantha would always say, \"if you have any questions please call me\". I called Samantha five times and she never returned my call or respond to my question. I got the impression she was either new at this job or just did not care. Samantha is not very professional.", "rating": 2}, {"title": "While our loan Rep was good to work …", "text": "While our loan Rep was good to work with, underwriting was a nightmare and caused us to seriously consider cancelling our application on more than one occasion. As a real estate agent with 44 years of experience I would not recommend your company to anyone.  The same criteria was requested and received multiple times. Sincerely hoping our future experience with this loan improve.", "rating": 2}, {"title": "The whole process was a mess", "text": "The whole process was a mess, the loan officer Scott was good but the people that kept having him come back for things that we had already given was ridiculous.  The continued needing this and that even after the loan was approved. I am sorry but if I had to do it all over again,  l would not. In the end we did come out how we wanted.", "rating": 2}, {"title": "Started in August of 2019 to refinance…", "text": "Started in August of 2019 to refinance and closed transaction January 2020. Very frustrating experience on trying to close a loan. It was the worst experience in doing business with a company. Loan officer was very helpful. Closing terrible.Should have been accomplished in no more then ninety (90) days.", "rating": 2}, {"title": "I was expected to get a cash pay out…", "text": "I was expected to get a cash pay out directly deposit into my account on friday but come Monday my bank retuned it because newdsy,usa made it out to my bank instead of myself so its been a terrible headache and still not fixed as of now,  Monday evening 😢", "rating": 2}, {"title": "Very High Fees", "text": "Our experience was good in regards to obtaining the mortgage, but the fees were ridiculously high, especially considering that this is supposed to be a service for veterans, like myself. All the things you have heard about the VA not taking care of vets becomes true by not serving those that have served and New Day just perpetuates that! Shame on the VA and New Day!", "rating": 2}, {"title": "One of th worst closings", "text": "I was a realtor for 12 years and never had such a bad experience.  The only thing good about it was I think the loan officer Courtland who was very professional and nice.  Closings in Arizona take 3 to 4 weeks!  Some I have had push through in 2 weeks this thing took forever! Would not recommend to anyone.Very sorry but I am happy it is over now", "rating": 2}, {"title": "My experience startetd last winter", "text": "My loan experience started in early March of last winter and finally concluded just a few days ago in late July. Although I kind of accomplished what I set out to do, the many steps to get through this refinance was one of the most frustrating experiences I've encountered - similar to chemo when you have no other choices. Thank you anyhow!!!", "rating": 2}, {"title": "some of your ads are misleading", "text": "some of your ads are misleading. I had out of pocket costs.  much more complicated than a previous closing.  once I review and compare I may or may not do business or  share positive recommendations. If you are grabbing first timers, ;how do they compare. they do not know if they are getting the best deal or not.  I should have had  2.25 interest  but you want points for that.  I thought you were just handling vets too.   come to find out that's not the case.  every company has its agenda. step up and be honest.  hope you post this.  John L. Allen", "rating": 2}, {"title": "Feel like a bait and switch victim", "text": "When I started the process with NewDay USA I was told I could get cash back for home improvements.  Then when it came time to close, I was told that if I got cash back it would be at a higher interest rate and I would have to pay points.  I ask about this from the beginning and was told it would be not problem to get cash back.  I was never told about the interest rate increase or the points I would have to pay.  I feel like I was a victim of the bait and switch.", "rating": 2}, {"title": "I was not told complete information…", "text": "I was not told complete information about details about closing cost and other important things that would have changed my opinion, I felt I was led in the wrong way and I am still dealing with problems right now as we speak about the termite inspection! The termite inspection was supposed to be paid or going to the new day balance but I still received a bill for $175 which was supposed to be taken care of! I am mix on my satisfaction with new day and I will never ever refinance my home again their new day! Looking back I wish I would have just left it all alone oh, because I think in the long run I'm not going to be able to afford my mortgage!! And I'm very uncomfortable with my decision.", "rating": 2}, {"title": "I would like to thank Teddy O\"Raily for…", "text": "I would like to thank Teddy O\"Raily for his professionalism and keeping me in the loop with every detail. Teddy worked with me and was able to get a lower interest rate after the fed's lowered the rate. Thanks again for taking interest in my needs and concerns during this process.", "rating": 2}, {"title": "It started out great", "text": "It started out great. My mortgage refinance went through quickly and easily. After making many payments, they decided to sell my mortgage to another company. I am very annoyed that they did that. It wouldn't have been so bad if it had been a smooth transaction. ND was supposed to take the final payment on the first. They didn't. So far, the new company has none of my information. I don't like being left hanging especially when it comes to my home. I have been told that I have to wait until next week, which is past my due date before they will know anything.", "rating": 2}, {"title": "a lot of repeated request for the same …", "text": "a lot of repeated request for the same informationslow response to information sentno notification of final approval or package sent to lawyer for closing found out from agentrequest for information expected immediately on concern for applicants timeHowever thank you for the loan", "rating": 2}, {"title": "I was very disappointed with Andrew…", "text": "I was very disappointed with Andrew Berry left me in limbo several times   Did not look back over what was done with the prior agent who was very helpful. Andrew Berry had me go to closing after the first one was put off when he took over only to have the closing where the person came to my home to do it all over again. I had to ask for his supervisor Jessie who apologized and said he would have the whole team work on this to get me closed. It was an awful experience when I even had to spend $300 dollars for a CPA which I believe was unnecessary. He did not reach out to me prior to closing per the closing person but she said no worry she went over the numbers. Thank you for this platform Lorraine Carter9013877890", "rating": 2}, {"title": "You over promised and under delivered", "text": "You over promised and under delivered. I was told you were paying off certain debts but did not. Instead you paid other things. I was told I was getting a specific amount of money after those debts were paid when in fact that was not true either. I had to use part of that money to pay the one debt I actually called your company about paying off. Extremely disappointed. When I called the person I worked with on this loan he tried to tell me “we had agreed this was how it would be done”. No hell we did not agree and he finally admitted we did not.  Not sure if it’s your personal or what but extremely disappointed especially when I am disabled and was relying on your company who claimed to help veterans.", "rating": 2}, {"title": "We had a closing date and time(2pm to…", "text": "We had a closing date and time(2pm to 4pm) noone showeed or no phone calls. Finally contact New Day Agent that we had been working with. He stated there was a problem getting a Notary. Again given a new closing date, a week later and said they would let us know what time. Heard nothing from anyone. Called the agent we had been working with. He stated that they were having trouble with the Company that they use for  closing. He told me he would get a new closing date and call me back the next day. So far haven't heard a thing. I'm very close to calling the whole thing off. New Day is not a very trustworthy Company to deal with.", "rating": 2}, {"title": "Process was terrible", "text": "Rate was great. Account executive was professional and knowledgeable. The process was miserable. From having to provide additional information multiple times. Every time being told this is what we need to only hear back days later that there was more than underwriting required. After producing an insane amount of information we then had to close twice due to errors with the closing agency. We then closed a second time and still had additional paperwork required after closing to fund the loan. Now my homeowner insurance is stating they have not received payment after two request to new day. If the rates weren't so low I would have said screw this.", "rating": 2}, {"title": "I closed on a loan with Newday on Feb", "text": "I closed on a loan with Newday on Feb. 11. Funding was supposed to happen on Feb. 18. It is now Mar. 4 and I have not received anything at this time. I contacted my agent March 1 and he was going to look n to it and get back to me.", "rating": 2}, {"title": "Slow and Incompetent", "text": "I applied for this loan and 3 months later it was finally closed. The process was very slow, and I felt victimized again as a Veteran, very similar to the VA. I was misquoted out of pocket closing costs twice, the processor asked for the same documents more than 3 times, and it cost us much more than was quoted. If you want to close quickly, you may want to consider another company. I asked the loan processor twice to refer me to a supervisor, and he did not. When I finally did get in touch with a supervisor, he did not appear to care at all, and offered nothing to make it right.", "rating": 2}, {"title": "I believe many roadblocks were created …", "text": "I believe many roadblocks were created by New Day. This was a very stressful and unacceptable experience. If I could do it again  I would use a local lender and I will Not recommend New Day, Paris Elliot did a good job but seemed to be controlled by higher ups.", "rating": 2}, {"title": "NewDay Puts Themselves Ahead of Their Clients", "text": "My VA streamline refi was supposed to close by 1/11 and I would get to skip the January and February payment. Out of the blue I got a call on 12/21 telling me that I needed to sign closing docs on 12/24 or 12/26. I was traveling for Christmas so I reluctantly agreed to meet with a mobile notary in FL (I live in TX). At great inconvenience to myself I wasted almost an hour at a relatives house reading through loan docs that would have made my first payment in February. I declined to sign them. Newday put their interests ahead of mine and tried to rush another loan across the finish line before year end at my expense. I would not recommend a company that does that.", "rating": 2}, {"title": "Extremely disappointed", "text": "I consider myself a professional, I processed loans for a large company 6 years.  I trained and managed a team of 5 processor's.  I also had the duties of personal assistant for the president of the company.  With that being said, I have never had such poor customer service.  Lack of knowledge, unsatisfactory response to phone calls.  The length of time that it took from start to finish was extremely unacceptable!  I will be moving this loan to another company as soon as possible.  I gave 2stars only because the first loan officer we had was great!  Joseph Hall, unfortunately for us he was promoted half way through the process.  Every one else gets 1 star.", "rating": 2}, {"title": "Complaint", "text": "My experience on this refinancing of my house in Las Vegas, Nevada.The contract went to new day USA, all approved by your good office, signed by me and my wife and we already have an agreement with your sales executive, Matt arman, that he will send a notary public on 3 January 2019, nobody showed up to notarized the document. I stayed in my house Las Vegas until 8 Jan. 2019. In about a week there was a modification of the original value of my house from $400,000 to $335,000. Now all my loan and my disability, pension are in jeopardy. Now I have an experience for this matter. Anyway I will thank you all. D. Baladad", "rating": 2}, {"title": "We have had alot of delays with our…", "text": "We have had alot of delays with our closing. When we would call we would be told that we didn't need anymore information to close only days later to be told after we called in again to find out the closing date that we needed to send in more documentation about the road in front our townhouse was state maintain. It is in a subdivision we have an hoa. There were alot of wasted time because we were not kept informed of what was neededto move forward. We are still waiting on why the pest control company was not paid as promised. On the whole the experience was very stressful and lacking in communication would not recommend to family and friends.", "rating": 2}, {"title": "The process is not easy if your…", "text": "The process is not easy if your protecting your home in a trust. You have to remove it and go through a bunch hoop to get there. Now the cash out check has been returned. Now I'm waiting for my call back to clean up this mess.Disabled Veteran.", "rating": 2}, {"title": "Reward", "text": "Very easy to work with and to get ahold of my loan officer John Thornton. He was knowledgeable and very polite and explained everything as we went through the process of refinancing our home. I feel Newday was a reward for my military service.", "rating": 2}, {"title": "I tried to refinance from a…", "text": "I tried to refinance from a conventional loan to a VA loan through New Day. They took all my background and then put me off saying they could not refinance us because they can not have a home inspection at this time. Spent a couple hours for nothing. Said I could try again in several weeks. The interest rate will more than likely go up again taking away a chance for us to save. We are in our 80s and live on SS. I served in the Marine Corps for 2 years in the 50s then 6 years reserve. Had a VA loan in the 60s and at that time a person could only use a VA loan once. That has changed. I probably will never be able to use the loan again because of this delay.", "rating": 2}, {"title": "Always needing additional documents on…", "text": "Always needing additional documents on a daily basis up to including the day before closing. Nothing like a last minute scramble to the finish line. In the future, should I purchase another home, it will not be financed with New Day.", "rating": 2}, {"title": "You asked!", "text": "You have sent me 5 copies of my appraisal, Why? I continue to receive solicitations from you even though we are doing business. Your agent made numerous calls for information that he should have requested initially.", "rating": 2}, {"title": "Dear Mr Uhrig", "text": "Dear Mr UhrigYou are very persistent somewhat borderline harassing and it is very troublesome. I understand that you are trying to get this closed and get your commission but your timeline is not my timeline. I am a flight attendant as previously discussed and I work a various of hours.  So that we can get this accomplished I have made myself available tomorrow after 12noon. If that cannot be accomplished then the original date and place I gave still holds true. This is getting extremely frustrating and I'm on the verge of cancelling the entire thing. I am only saving a whopping $200 a month and for the stress of consistent emails ,voicemails and texts that I receive is it really worth the trouble?", "rating": 2}, {"title": "Disappointed Vet", "text": "The only reason I would give a star is for the agent who helped me as she was very helpful but for the company yes I rate it low as this is suppose to be to help veterans but they make it extremely difficult to get approved , lady explains that since I had a couple of late car payments back in January I can't qualify !! Really a couple late payments in January !! She says one of the qualifications is to have no late payments for 2 years !! really 2 years !! I can't name you one person that does not have 1 late payment in their history in 2 years , last time I called it was my credit was a little low so I worked on it to bring it up and now it's a late payment in January !! Ridiculous !!", "rating": 2}, {"title": "Theodore Charles Priester", "text": "Theodore Charles Priester, manager, was the one that helped me with my loan. High-pressure, he assured me if I paid just a little bit more each month I could get a $242,000 loan paid off in 15 years. But if you think of it, $242,000, would take a huge per month, to pay off this fast. They're not going to cut me a break, if I only pay part of it, so how does that figure? Very high pressure, not a very enjoyable experience. And now I sit here, watching TV, different cities, different states, New Day talks about how New Day, is going down to this incredibly low interest rate and how I can save $2,000 a year. Truth be told, I'm paying them $2,000 more than I should per year.", "rating": 2}, {"title": "The New Day USA is not what it professes to be…", "text": "The New Day USA commercials would lead you to believe that it is a lending institution for veterans run by veterans.  Nothing could be further from the truth.  It is a commercial enterprise that is not even rated among the top 7 VA lenders.  Sorry admiral but your phony emption does not get it.  It's not a \"labor of love\".  My easy refi process claimed to not require income verification.  I did not carre if it did but the fact that it did was one among a number of lies in the process.  This \"easy\" process also took almost 2 months to close the deal.  I should have quit while I was ahead but I was so far into the process that I did not want to start over.  I will never recommend New Day to any veteran.", "rating": 2}, {"title": "Started out great...", "text": "All was good up till the loan went through. There are good things about using NewDay USA, but at the moment I can only focus on the fact that I have not been paid $9789 of what I am owed from my cash out option. I understand that things happen and their are hiccups, but prior to my loan going through NewDay fixed any problem that came up immediately. It seems now that it is too late for me to back out the drive to ensure problems are fixed has lessened. I have not been able to pay off my debt that caused me to do a cash out refinance with NewDay because of the $9789 that I have not been paid. This could possibly cause me to lose my job. If not for this issue I would have rated NewDay USA a 5.", "rating": 2}, {"title": "As soon as the mortgage closed my…", "text": "As soon as the mortgage closed my mortgage was sold to another mortgage company called Freedom Mortgage. The ReFi was VA and l thought l would be doing business with New Day instead l got bait and switch.", "rating": 2}, {"title": "I started the process in June and it…", "text": "I started the process in June and it was not over until Oct. my Rep. worked for me, but the paper work set in some sections desk waiting for action for a long time. I do not understand why itd took so long.", "rating": 2}, {"title": "Be very careful", "text": "Be very careful.  I personally don't trust them.  I just went through the quoting process and my Loan Originator (I'll leave his name out) won't explain to me the costs involved.  They want me to pay almost $500 more than my annual escrow requires UP FRONT and they won't explain why. They won't explain what happens to my current escrow.  There are also over $7000 in \"closing costs\".  Bottom line, they want me to increase my total mortgage by $13,000 for a monthly savings of $100.  If the agent had been willing to discuss this with me further I wouldn't be so angrily typing this but I'm very disgusted.  As a Navy Retiree I find it shameful that the face of this organization is a Retired Admiral.", "rating": 2}, {"title": "We were asked to provide the same …", "text": "We were asked to provide the same information several times.  It appeared that different departments were not communicating.  We were updated and phoned constantly over the small items but not so much on some of the important items which was frustrating.  We are experienced in mortgage financing and found it annoying to be spoon fed on less important items while we had to press for updates and responses to more important ones.  Overall, it seemed that the folks in the office we dealt with were inexperienced and did not communicate well with each other.  While they were able to complete our re-finance prior to our deadline for which we are appreciative, the overall experience was less than pleasant.", "rating": 2}, {"title": "I am Anurady Sims", "text": "I am Anurady Sims. This is my email  not Johnny\"s. When we signed document, you needed my signature as well. Please kindly add spouse\"s to all mail or how ever is on the deed, not just the veterans.", "rating": 2}, {"title": "Months of delays", "text": "Months of delays, out of pocket expenses that were also charged in the loan, late and short responses if any, plus the highest loan fees allowed by law. All increase to cost of my loan by thousands.", "rating": 2}, {"title": "IF you don't have a perfect payment history forget this company", "text": "Went through this long application process to refinance my home; I understand that most lending institutions require 12 months of on time payments. I get that but they require 24 months, if your late more than 60 days they require 36  months and if you were more than 120 days its 60 months.  Needless to say I didn't qualify they probably couldn't beat my existing interest my 3.75 FHA rate anyway.  They need to ask all these questions before they pull your credit up front so they don't waste peoples time.  By the way a HARP loan, I may be wrong on this.  But recall having to  be 3 months behind in order to use the HARP benefit.  I will only deal with my local bank from now on.  Unless you got perfect payment history I would even talk to these people.", "rating": 2}, {"title": "Timeline not adhered to", "text": "Timeline not adhered to. We were told we would not touch the payoff checks. In the end we were asked to deliver them on days not discussed.  Appraisal completed not including entire property.", "rating": 2}, {"title": "The process of completing this loan …", "text": "The process of completing this loan from beginning to end has been a nightmare. I have never run into so many roadblocks to completion in my life. Starting with a low ball appraisal resulting in time consuming and questionable tasks to be completed. Inspections and reinspections. Then there was a change of representative which resulted in confusion and misunderstandings all the way to the end. I felt like pulling the plug over and over again as the frustration grew. I could go on and on regarding the events that kept adding to our disappointment. Let me just say that I'm glad it's finally over. We did not accomplish our goal and we are dissappointed we chose New Day USA . The television ad featuring Rear Admiral Tom Lynch led to an experience we will not soon forget.", "rating": 2}, {"title": "Not a good experience", "text": "Not a good experience. Trusted experience to new day because of the Adm. I to retired for the Dept of Navy. Guys going fast to complete or close sell. They didn't hear me as a person.", "rating": 2}, {"title": "IT WAS MUST HARDEST TRANSITION TO GET…", "text": "IT WAS MUST HARDEST TRANSITION TO GET THROUGH THIS MY THIRD HOME AND THE HARDEST I KNOW IF IT IS YOUR METHOD OF HOW YOU GO ABOUT BUSINESS OR WHAT THE EXPERIENCE WAS NOT JOYFUL ONE.", "rating": 2}, {"title": "Not sure if I got used and abused", "text": "Not sure if I got used and abused. Not real happy about percentage rate.  All though I did want to cash out and pay my creditors.  Thanks Greg", "rating": 2}, {"title": "Took forever to get answers to…", "text": "Took forever to get answers to questions ,still not sure about everything is done. My loan is finally done but I don't know that I would do it again. RMCM (SS) Retired", "rating": 2}, {"title": "I am not happy with how long the whole …", "text": "I am not happy with how long the whole process took, a number of times I was unable to make contact with my advisor. Due to the recommendation of my advisor I have multiple late fees which I now have to pay out of pocket since the amounts for my account payoffs were taken when the process started. Do not think your company charged a fair price, I think I was charged twice what I could have gotten the service for elsewhere. I spoke to my advisor a couple times about cancelling the whole thing after the first 45 days had passed. I wish I had read reviews before contacting New Day USA. I feel I was taken advantage of financially. Unless I get a partial refund for the services I will not be recommending your services. I will not outright bash it on social media but if asked I will tell how I feel.", "rating": 2}, {"title": "From start to finish", "text": "From start to finish, always pressure to get information and paperwork to you, then when I gave them the items and information, your agent treated me like I was trying to cheap the mortgage company and I was lying about what I had and had sent and what I wanted to do with the loan...I should have stayed with my credit union here in California.........Another part your agent didn't know crap about how mortgages companies are controlled out here in California....We have very strong consumer protection laws that have to be followed.....Lastly, I didn't like being treat like I was lying all the time...As a Senior NCO with the US Army, my words met what I said.......You need more folks that are or at least have been VETs like myself....I must say I will not tell others of your company...Gilbert", "rating": 2}, {"title": "Very disgusted experience", "text": "I have applied for this loan since June,2016 & it takes six month to fund the loan. When they finally fiund the loan I have problem again with the funding department. They don't know how to read instructions on the payoff demand. They sent me payoff checks to creditors whom I am not suppose to receive. It should be directly mailed to the Co. whom I owe but instead they mail it to me for me to mail to my creditor. I called the account executive who was handling my loan twice but still it didn't resolve the problem. I've been refinancing my house for so many times but this is the worst experience I've encountered since I started refinancing my house. I wish you employ people who know how to read instructions so your other clients won't experience what I went through.", "rating": 2}, {"title": "Disappointed", "text": "They say they are here to help you but ONLY, if you fit their requirements.  They are not there to help if you REALLY need help only if you fit their expectations. VERY DISAPPOINTED", "rating": 2}, {"title": "Refinance", "text": "Very courteous and professional.  I had a very difficult loan due to my circumstances, the process was drawn out over a long period of time thus causing us to miss NewDays deadlines multiple times which required me to essentially go through the process and retrieve information multiple times which was extremely aggravating.  NewDay did a good job but were non-efficient and drew the loan process out way too long, if they cant finish a application quick enough they should extend their own deadlines. A customer shouldn't have to repeat processes, buy multiple termite inspections and pull credit multiple times because NewDay couldn't process the application in a reasonable amount of time.  The tiered management process they use becomes inefficient thus dragging the process out over many months.", "rating": 2}, {"title": "I am not happy at this time.", "text": "I am not happy at this time. We just wrapped up the refi with New Day and now I am finding out that one of my loans didn't get paid off like I was told would happen. What I agreed to in conversations and what took place is two different things. I feel that I was misled into signing. I know the guy I have talked with during this time is now checking into it, but my trust is starting to fall. Still can't get any answers to how they will fix it. Here we are a few days later and no one will call me back. I guess this is how they treat the veterans. As of 8/17/17, someone has stepped up and started correcting the wrong that was done to me. If this all goes as he said it will, everything will be as it should have been the first time. I have learned that I will never sign anything without reading it again.", "rating": 2}, {"title": "Worst refi I ever experienced", "text": "Basically, a big deal was made about paying off creditors before I could get the loan, then after 2 months of headaches I finally closed on the loan and was told the creditors would receive their checks overnight, instead a UPS envelope was placed at my doorstep (could have been stolen), and when I opened the envelope, there were checks to the different creditors for me to mail out to them. there were time limits on some of the payments and you could have just funded all the money to me and I would have sent post-dated personal checks to avoid more problems. I am going to actively seek to end my mortgage with this company as soon as I can. not only was the closing fee excessive (2 points), but the actual rate is higher than the previous mortgage. I only accepted because I needed the funds. So this is how you look after vets?", "rating": 2}, {"title": "The process was like the Chinese water …", "text": "The process was like the Chinese water torture.  You need one sheet of paper with everything you will need on it.  The process of drip, drip, drip was very frustrating.", "rating": 2}, {"title": "Still trying to straighten out the pay…", "text": "Still trying to straighten out the pay off check. I received it with a vendor name on it. I had already paid him off. Now I have a useless check in my pocket", "rating": 2}, {"title": "Run Around", "text": "All this company has done is give us the run around.  We finally just withdrew our packet and are looking elsewhere.  I would not recommend them.", "rating": 2}, {"title": "I am a 28-year Air Force Veteran and my …", "text": "I am a 28-year Air Force Veteran and my credit score is 799.  My experience with NewDay seems to be much different than that of others.  I called to refinance my current mortgage in order to pull cash out.  Although Trevor was very helpful in completing the first part of my application, he failed to understand the importance of my monthly payment.  After I had provided all the necessary information (to include a credit report), Trevor rambled through the numbers very quickly.  The estimated monthly payment was almost $500 more than I had requested and the interest rate was a full 3/4% more than other mortgage institutions were offering.  When I questioned the interest rate of 4.25%, his response was...that's what we're offering and if you can get a better rate somewhere else, feel free.  I feel like I wasted a lot of time and was forced to provide more personal information than I was comfortable with.  Good luck!", "rating": 2}, {"title": "Started process of refinance in…", "text": "Started process of refinance in December of 2021. Representative Trent seemed aloof and not into doing a timely refinance ! Did not have all that was needed for loan applications and kept asking for more info from sources that he did not know was required ! Trent would not call me back to inform me of loan status. When he did call was asking for more info and dragged the process into January and then February of this year ! Finally a manager took over my case and expedited it to completion !Admiral Lynch, I am a combat wounded Army veteran of the Vietnam war and used New Day one time before with no issues and the loan completed in a timely manner .  However on this occasion to apply for refinance, the time and way I was treated has been horrible !!Hope this is not the normal treatment of veterans in future loan applications !     Signed :  Tilden C. Willett                     US 52685260                     U S Army                       Light Weapons Infantryman                      Purple Heart , Air Medal                      Republic of Vietnam                    October 1966 to October 1967", "rating": 2}, {"title": "Our representative is a Extremely hard…", "text": "Our representative is a Extremely hard worker, work many late evening. However, the whole  process was extremely slow at completing any task/closing it out. They continue to ask for the same information, over and over after being sent the requested documentation. Due to it taking well over 4 months to finish, they had to re-ask for several updated copies of the same document from the month prior. The delay of this process was not due to us in any way. We have out standing credit and long standing employment records. Did we get a good deal...? Debatable, yes I had a few offers 100-300 cheaper. We decided to stay with them because we were 3 months already in the process of completing the refinancing and starting the process over is a huge hassle.  Also  at the very end after signing of the paperwork, I was once again asked for another updated pay stub. They made it out like they needed the information  immediately, on a Sunday?  Poor time management isn't an emergency for others to stop what they are doing, to provide the exact same thing for 8th time.  Even with this rating, I would use them well before Rocket.", "rating": 2}, {"title": "Thank you for being there for me as a …", "text": "Thank you for being there for me as a veteran who believe that it takes people who really cares. Thanks to you and New day organization", "rating": 2}, {"title": "To begin", "text": "To begin, my loan representative was a true professional, and a big help all along the process. My problem was during the process, a previously unknown problem arose. I started out sixty points above the minimum threshold for approval credit wise. When a previously unknown problem was uncovered, then added to my credit report, it lowered my credit to where I was three points below approval minimum. The commercials that drew me to this company stated that they \"looked at more than just your credit score\". Not so, in my opinion. My loan officer told me that due to circumstances, when he asked for an exception, I should have been fine. It did not turn out that way. So, for me personally, I feel like after all the work I put in, investing thousands of dollars to fix my situation, and to still get declined for three credit points, it was devastating. I served with the Admiral in the eighties. I would think he would not have approved of the outcome for me in this particular situation.", "rating": 2}, {"title": "Began the loan process in February and …", "text": "Began the loan process in February and closed end of August...way too much time and repeated updates for information as a result.  In the end the home was finished end of July.  But an outside paver patio project (cement bricks) was included in the loan request, but weather was consistently poor through the month of August so the project was consistently delayed.  Yet the house was complete to move in and live in but they would not let us close. Because of the poor weather, I asked to leave the project out of our OTP, offered to pay for it myself or even escrow it but was told New Day had to wait until the project was finished.  Meantime, we and the builder were left carrying a sizeable expense for almost 30 days waiting to close just because of some bricks.  Our previous home was already sold and we moved out end of July so we had to put our house goods in storage while staying in hotels or with friends for almost a month.  Bottom line---it didn't seem reasonable and created undue harm so to speak.", "rating": 2}, {"title": "VA ripoff🤑", "text": "I was given the highest interest rate 4.25 and high closing costs! Quickens loan gave me the best offer on refinancing my mortgage.", "rating": 2}, {"title": "Not as advertised by Rear Admiral Lynch", "text": "I talked with an agent on 3/20, expecting to be able to begin a debt consolidation loan to get out from under the pressure of some high interest rate cards as well as a debt reduction company. I took Rear Admiral Lynch's word that NewDay would tailor a solution to my situation and not just my credit report. I found his word not to be true. The agent I spoke with only considered information in my credit report to make a his decision not to proceed with the process.I have plenty of equity in my home as well as the ability to pay, if I can eliminate payments to both the card companies and the debt reduction company. The agent admitted as much, but sought no solution other than to wait a couple of months for a couple of cards in the reduction company''s account, which I wish to pay off, to close. This leaves me in a catch 22.I am very disappointed to find the company to be like so many others, dependent solely upon the credit report for a solution, contrary to what the Rear Admiral stated on television.", "rating": 2}, {"title": "Honest and to the point:", "text": "Honest and to the point:Lied to about interest rate lock. This will cost us tens of thousands in interest.Dealt with 6 different people! ALL who required us to submit the same documentation repeatedly. As each person replaced the previous, No one could tell us where our prior documents submitted had disappeared to.Denied the write to information in order to communicate our nightmare to the Cooperate office specialty the Admiral as his chain of command continually failed us as customers.Treated with contempt and disrespect by 3 of the 6 aforementioned.I have recently reached out to Fox TV and my Congressional Representatives to share my horror story dealing with New Day USA. I want to share directly our story with the Admiral. Therefore; I respectfully request an audience with the gentleman.I gave a 2 out of 5 star rating only due to the efforts of William, Benjamin and Alec who made efforts to remedy this disaster of a transaction.We feel betrayed, disrespected and feel as if we have been completely taken advantage of.Thank you for your valuable time and Richard Hendrix", "rating": 2}, {"title": "Worst refi experience we’ve ever had", "text": "Worst refi experience we’ve ever had.  When Brian was handling our account everything ran smoothly. I had a feeling when he moved to a different position within your company that it wasn’t going to go well. I was correct. Originally we were lost in the shuffle of the change. We had to contact Trevor or would never have known what what stage of closing we were in. E-docs had to be signed more than once due to the lag. Our homeowners insurance was changed to New Day on 9/1/20 but the refi barely took place by the end of September.  Two weeks after we were told it would. Thank God we had no catastrophe with our home. Who would have collected from our insurance- you or the other lender. Also because of the lack in closing we received Dunning notices from our lender. We have NEVER had a Dunning letter!  We were told not to make a payment September or November and then because of how the process lagged, suddenly it was advised we could “make September’s payment if you want to”.  Our refi didn’t complete until 9/29/20!New Day USA will not be receiving any referrals from us.", "rating": 2}, {"title": "Promises, Promises?", "text": "Kept asking for the same information from the same creditor over and over. Promised $20,000 cash out ended up getting only $23", "rating": 2}, {"title": "We started the loan process the end of…", "text": "We started the loan process the end of Oct., 2020 thinking there would be enough time for a closing so we could payoff a couple of loans we had with a credit card for no interest for two years. All was going fine and we were told that the loan should close by Dec.11, 2020. Getting close to the date I get a call saying they failed to find out that our house was in trust and had to be taken out of trust before we could proceed. That meant a brand new loan process ! We finally closed on Jan. 7, 2021 which was beyond the dates our credit card loans were due. This cost us extra interest and late fees. They also requested 4 payoffs from our existing mtg. company which cost an extra $120.00-$30. each request!  That sounded unnecessary to me!  Also they kept more and more debts to be put into the loan that we did not want to payoff. Even one bill that was completely paid off to Kohl’s so now we have a check that they won’t accept because we don’t owe anything to them. Only way is to buy stuff we really don’t need from Kohl’s then send them check to pay that off!  We will NEVER use or recommend your company to anyone.", "rating": 2}, {"title": "I am only rating this 2 stars to…", "text": "I am only rating this 2 stars to hopefully draw some attention to my concern. I have been very pleased with New Day for multiple mortgages except for the end of this past one. Marina was a great Account person. Very informative and responsive until the end. I did not receive a response to my request for a call until literally in the middle of closing. I was then advised that Marina had stepped away from the Company. I was concerned for her as she was very pleasant and I enjoyed the process until that point. During closing a Trevor called and I was able to ask my questions. Now I do understand the answer to those question made sense but my issue is/was that was NOT the way it was explained to me. If I had been informed differently than the way it ended I may have decided differently, But felt it was still in my best interest at the time and moved forward and completed the closing. I reached out to Trevor after closing with more questions and again got answers that were different than i was initially advised. At that time Trevor responded (via Text) that he would reach out to me shortly and we can get on the same page. This was on April 6, 2022 and I am still waiting for him to reach out...Probably will be my last interaction with New Day USA with my Mortgage needs.", "rating": 2}, {"title": "I was not told a lot of information", "text": "I was not told a lot of information and lost about $10000 because of it. My acct manager was as helpful as he could be.", "rating": 2}, {"title": "NewDay  asked for my wife’s 2019 taxes…", "text": "NewDay  asked for my wife’s 2019 taxes 12 hours before closing.  Was not hasty with this company. Not organized", "rating": 2}, {"title": "Issues", "text": "IssuesYou promised 2 months free of payments, didn't happen.-Our processors Supervisors response when asked why the paperwork stated 1 month and not 2 months free of payments answered it happens, to be polite here that is lame-That would be a lie for an incentive not much company integrity there AdmiralYou stated that a Notary would come wherever we were, did not happen or take 10 or 20 minutes to sign paperwork -I'm going to assumed the company would not pay for the Notary to come to us which put our processor in a bad position to ask us to come back or miss a deadline-It took about 2 hours to read and sign paperwork not 10 or 20 minutes-It required us to pay for a Ferry from/to the Island during our vacation to come back taking 4 hours of our time waiting and travelingWe have refinanced in South Carolina before this was painful the others were streamlined and done via the mail by FED EX.The bright star in this was our processor he was very professional, and helpful. He did a professional job you should pay him more for all he does. Thanks to him we got a reduction in monthly payments and through this process.", "rating": 2}, {"title": "Negative Experience", "text": "The initial checklist sent to me was not complete. Many times throughout the process we were called to collect and provide additional information. It seemed to us that they really did not know what was necessary to complete the application and process. I am a 1099 self employed commissioned insurance agent. It appeared to me like they really did not know how to deal with that type of income. They called my HOA asking for my personal information, which is totally against the HIPPA laws. Our agent was polite, but acted like he was new to the job.When the time came to schedule the closing, we were not told we would need a third party to witness or signatures. This created a real issue at closing because we were not prepared for it. Our agent was always polite, but acted like he was new at the job, being unsure many times what to do or say. When ask how long he had worked there he replied one and a half years.I was so frustrated I nearly backed out of the process and went elsewhere. I could not in good conscience recommend NewDay USA to anyone. You can find similar comments on line if you look.", "rating": 2}, {"title": "Called to get a loan to help fix credit …", "text": "Called to get a loan to help fix credit and was told couldnt till credit was fixed. So much for helping veterans", "rating": 2}, {"title": "Worst idea", "text": "I went with New Day to streamline my VA loan.   I was told by the loan officer I would receive so much from my escrow with my existing mortgage so not to worry about the cash.   Well he filed all my paperwork late and my prior company paid the taxes and I did not receive the money,   The bad part was he continued to lie to me stating my old company did not pay my taxes and NewDay did and maybe I should call the old mortgage company.   I did and I also checked with the tax office they told me whom paid and it was not NEwDay.   He still decided to lie and say NEwDay would reimburse me the money wrl they did not.   His 3rd email which I have all saved stated oh we lowered the loan amount that’s why we cannot reimburse that money.   Do not go with this company.   I have all my emails saved where the loan officer continually lied to me.   To this day I have no idea where that money is.   I signed the papers 15 days before the previous mortgage company paid my taxes so I was told on that loan amount I would be financing such amount and my taxes were included so my old company would send it back to me.   This company lies to make money off you.", "rating": 2}, {"title": "The experience was very unprofessional", "text": "The experience was very unprofessional. Sean Waller had all paperwork over a month before submitting it to underwriting. to the point I received a letter from underwriting about closing our loan because the did not have the paperwork. I would talk to Sean, and he would tell me something was being done. Then when I called back to follow up it would not have happened. I feel that he was working against us from the beginning. I was sent paperwork to sign that was incorrect 2 different times. Sean would not listen to me when I asked questions. and when we sent things he requested, he would ask for them again because he did not bother to look at what he was sent. Until I called to check up on something. The Friday Before a Monday morning closing in a different state, at 4:30 the requested more paperwork. and it was 5:30 before I was given a amount for the closing cost that I needed a check for.  At closing they did not have all the paperwork needed for the loan. Which meant I had to travel 45 minutes out of my way to get the paper work printed and signed and sent back to them. Then two days later I get a call about another paper that has to be signed. This entire processes was a nightmare.", "rating": 2}, {"title": "We are still waiting for are checks", "text": "We are still waiting for are checks. Every thang has been last minute. We arenot happy.", "rating": 2}, {"title": "Poor Funding Experience and Post-closing Service", "text": "The approval process was slowed by a change in loan originators part of the way through the process, but that is sometimes unavoidable. The appraiser contracted for my loan was prompt, but miss-measured the house. That affected my loan amount. The underwriters did not appear to know how to account for business income and expenses, but that did not affect loan approval. The part of the process that I found objectionable was the method used to pay-off of my credit card debt. Instead of using ACH transactions or wire transfers, New Day mailed me checks made out to the credit card companies. That cost me over $300 in additional interest. New Day probably made about $50 by keeping the money until the checks cleared. If they really cared about veterans, they would pay off credit cards debt the same way they paid off mortgages. After closing, I tried to set up an account to manage my mortgage on line. Their system wanted an account number two digits longer than my loan number. I called my originator and asked for help. He said he would check on it and get back to me, but that was a week ago. I guess he only gets paid for getting loans approved and closed, not for anything after closing.", "rating": 2}, {"title": "Very Disaapointing", "text": "As a veteran I chose to work with NewDay USA based on their advertisements and the fact that they have a retired Admiral as their top executive, I assumed they would be highly organized, competent and professional, none of which turned out to be the case. I had high expectations due to my superior credit rating, extremely low debt and quality income. I also had the choice of a VA loan or conventional. I chose to go the conventional route for several reasons. I was also confident due to the fact that my home had appreciated approximately 50% in two years. This was my 7th mortgage experience and knew what to expect...or so I thought. It was far and away the worst business transaction I have ever experienced. Virtually nothing that was presented upfront came to reality, including the interest rate, loan amount, monthly payment etc. I submitted some documentation 2 and 3 times. Communication and follow up was virtually non-existent. I literally am not sure if it was gross incompetence, mis-information and or deception. No professional organization could possibly be this bad and stay in business. I am leaving out a lot of incredibly bad things for the sake of time and space but suffice it say, just be aware of what you are getting into. I can back up everything I contend and a lot more. Three months of stress, disappointment and frustration.", "rating": 2}, {"title": "Not what I expected", "text": "My experience with NewDay was below avg. It seemed fitting for a vet to go with a company that built its name on serving military families. My first agent quit, but my initial treatment was not personalized. I was provided boiler plate and often unnecessary forms--in duplicate; the \"streamline\" application required additional documentation; and I didn't hear from another agent (Cody) for a week, and all that had been done felt like a do over. I didn't have a customer-friendly relationship with Cody; he seemed harried with me and often took more time to return calls and text messages. I stayed the course only to be disappointed again. On Oct 29, 2020, I texted Cody to ask for his help in getting the final closing mortgage amount and monthly payment info to the new servicer (Freedom Mortgage); amounts that were lower than the initial closing. I had already tried to fix this through Freedom. A month later in a phone call, Cody denied ever getting my text and suggested that if the addendum from NewDay that I sent to Freedom (stating the correct amounts) didn't resolve the issue, that I should call him back. So, a NewDay error that I am fixing without my agent's help. That just doesn't seem like caring for the people who NewDay has asked to trust them. And I will look elsewhere when I re-fi in the future.", "rating": 2}, {"title": "Wonderful", "text": "Wonderful. So fast and easy. Chris was great and always answered questions very timely", "rating": 2}, {"title": "the agent who worked for me was not …Young in experienced agent was frustrating", "text": "the agent who worked for me was not very experienced. It seemed like everyday he asked for something else. I normal like to not escrow my insurance and taxes because it ends up causing me more down payment money . I have not escrowed on my last three mortgages. I had 40% equity and he insisted that the VA requires that. HE Asked for another form to be signed after we had closed. IN the course of the phone conversation nthat he was threatening me with delayed payments if I did not get a form signed especially one that was completely redundant to what I had signed the night before at the closing.When I said are you threatening me to not fund the loan and he said no and then in the same breath threatened me. check out the tape.YOur process needs to outline upfront everything that is needed or might be requested later in the process.It can serve as a guide. for example after I had submitted the packets of documents I was asked to provide a letter from my company verifying mThat I am entitled to the pension for the rest of my life. I gave adequate proof that I was getting a pension .already.If you think it might be needed then make it part of the documentation request.he also told me that the closing agent would bring the witnesses eps. as It turned out I had to jump thru hoops to line up neighbors to do this with 3 hours of lead time.", "rating": 2}, {"title": "Double the trouble in our case", "text": "We started our process in the late part of the first week of March. Our first NewDayUSA loan rep claimed we could close as early as 19-Mar or at the latest the first week of April. We produced every requested document and tax records. For a company targeting retired military to have so much trouble understanding and comprehending “military contractor” as a long term occupation was extremely disappointing. Our Wells Fargo rep had no issues either time we used them for initial home loans. Also I had to produce documents for my VA benefits to be “reinstated” yet we refinanced a “VA Loan” which I never had to do for that loan. That was after NewDay told me the wrong house I needed to find documents for. At least our replacement NewDayUSA rep got the job done, eventually. But only after everything we produced and answered with the first guy was repeated. The first rep was taking extended leave but I hope that’s fancy talk for being fired. He was condescending and his tone noticeably change after he knew it was us on the phone. Guess our house wasn’t going to earn him enough of a commission. Overall, I truly wish we would have went elsewhere. My wife wants me to at least say that by our closing in the last week of April it was “ok”. Even though the money we were supposed to get at “closing” really meant direct deposit 3-4 days later and as well as the payoff checks for our cash out portion.", "rating": 2}, {"title": "Not to Standard - Not Happy", "text": "NewDay USA serviced my loan which actually means they facilitated the paperwork. Before I even paid my first mortgage payment on the new loan, they transferred it to another company which is their right. But I chose them because they were “veteran owned” and they sold my loan to another company with a questionable BBB rating. I do research before I select a company. I am sorry that NewDay USA passes their customers off without even a month passing to a non veteran owned business with questionable standards. The questionable standards I now associate with NewDay USA. Separately, most of the time the people processing my loan paperwork were pleasant, when I asked questions they 1) didn’t respond until they needed something from me 2) didn’t answer my question when I returned their call until I told them I would t sign any more paperwork until my questions were answered and 3) actually told me that I should trust that they do business and calculate numbers correctly and I didn’t understand how the numbers needed to be calculated. Additionally, once you fill out the paperwork online, save the file to your own files because you can’t access it again once you sign. I asked if they could send me a copy of my estimate, and they said no, they said I already signed and didn’t need a copy. When I pressed them for it, they said they no longer have access to the files and couldn’t provide it to me. I got a loan, but I am not happy how this all turned out.", "rating": 2}, {"title": "REPEATED Employment Verification", "text": "Our rep, Matt was great - he is very smart and dedicated. No problem with him. I would say he is one of the better sales reps you have. Please give him FIVE STARS.  The TWO STARS are for you, in upper management.Your firm asked me for verification of employment SIX TIMES over a two month period and three times in a two week period.  The form demanded was one I could not get from home, so I had to go into work to a secure computer to get it. I told your finance people this - no reaction.Our building was CLOSED due to the Covid pandemic so every time you demanded this, it was a major inconvenience to me and others, and put people at unnecessary risk of getting sick. Once, I had to go get it on Veteran's Day, 11 Nov, a day off for me.The information on all SIX forms was exactly the same, only the date was different. You just wanted a more current date because it looked better for you.This demand for the SAME EXACT employment verification over and over again simply indicates you DO NOT TRUST your customers. (former military seeking VA loans)For a \"military friendly\" firm I did not feel like your firm trusted me beyond 24 hours.I could have gotten this loan anywhere, but went to YOU because of your \"military friendly\" pitch.  I am not convinced anymore.RECOMMENDATION: Cease doing this - ask for the verification ONE TIME and trust your customers. FOLLOW UP:  None required from me - I am just glad this is over.  Mike Marra", "rating": 2}, {"title": "Green 8", "text": "Great ending phase and outcome but initial months brutal yield", "rating": 2}, {"title": "Very professional staffVery professional staff. Very helpful throughout the process.", "text": "Very professional staff. Very helpful throughout the process.", "rating": 2}, {"title": "Admiral Lynch Sir", "text": "Sir:  The closing personnel said they mailed me paperwork needed to close??When Andrew Nelson called me to check on it I told him I HAD NEVER RECEIVED IT, and I check the mail each day as my wife had a stroke. He then told me he would get with them on it?? In the mean time due to a timely closing Andrew had told me NOT to PAY my DEC 2020 Mortgage payment due to closing and final figures. I did so, then the Closing Department apparently could not figure what to due next and I was kept on hold. My Dec 5 date had passed, but by that time I was late on the help up payment to TMS and was LATE I am never late with AUTOMATIC WITHDRAWLS I know you don't believe this but after a few weeks I was finally sent elctronic paperwork for me to sign, and they insisted my wife had to sign, though her name was not on my original financed VA Loan or on the Deed to the home. I finally closed the 2nd week of January 2021. I was reported late on 2 payments and have now had my Credit Scoresjeopardized s if I am some DEADBEAT. I have all my E Mails to Andrew concerning my NIGHTMARE, as I am sure he has his copies. I do not blame Andrew who handled my first financing flawlessly, but not this one due to the closing personnels' FAILURES. They cab give you all  the excuses to cover themselves, and if they do it will be lies. Why in Gods' namee would I sabotagemyself, my credit, my ulcer and all??? No they MESSED up you can be assured of that SIR, and I NOW PAY THE PRICE IN MANY WAYS!!!!!Thank You , and by the way TMS said they were short $925.25 from the transactions and I believe I and them awaait the finalization.  I apologize for my negativity, but it is what it is, and my total savings now is about $20 a month!!Ronald Puhr", "rating": 2}, {"title": "Disappointed with account manager", "text": "When I originally contacted New Day Financial, I was extremely impressed with the original account manager, Zach Enswiler, who was assigned to my mortgage. He returned phone calls and emails promptly, and answered all of my questions very professionally. However, suddenly he was no longer available. Fortunately for me, after numerous phone attempts, I was able to reach Colby Richardson who informed me that Zach was no longer with New Day Financial. I received an email from Seth McFall, who informed me he was my new account manager. That was the end of all good customer service from New Day Financial. I was unable to receive a response from Mr.McFall both by phone and by email. If fact I had to contact Colby Richardson who informed me  he would contact Mr. McFall's immediate supervisor, Jay Cohen, as well as his supervisor, to try and have someone contact me. I never heard from Mr. Cohen, but after numerous calls for help, I would then hear from Mr. McFall. Honestly after several conversations with Mr. McFall, I no longer believed anything he told me about future contact. My original closing date was scheduled for March and the final closing date was May 22. In dealing with Mr.McFall, I informed him that I was extremely dissatisfied with his customer service, and I would be informing others of my disappointment. He stated the Covid 19 situation was to blame, and I informed him that unless he was sick at home with the virus, I didn't understand why he couldn't return an email within a couple of days. The  bright spots in my dealings with New Day Financial were Zach Enswiler, Colby Richardson, and the independent signing agent who came to my residence to complete my loan. Her name is Dinah Chambers, and she was extremely knowledgeable and professional.", "rating": 2}, {"title": "Waited for closing day", "text": "Waited for closing day, no one showed or called", "rating": 2}, {"title": "Slow to respond and waste of time and…", "text": "Slow to respond and waste of time and effort", "rating": 2}, {"title": "I would not use your company again.", "text": "Date of experience: July 15, 2020", "rating": 2}, {"title": "Condescending", "text": "What should have closed in 45 days took almost two and a half months of jumping hurdles and through hoops.  We had to make our own arrangements for termite inspections and the paperwork we received said this would be at no cost to us.  It wound up having to be paid for by us.  When I asked about this we were told \"Oh, we send out a generic form.\"  Because I refuse to conduct my financial business via the internet and/or sign anything electronically, I requested anything that required our signatures be sent via the Post Office or Fedex and for which I was willing to pay for.  Well, she did this but one would think that time sensitive paperwork would be sent overnight mail.  NOT!  Our final paperwork took SEVEN days to receive...via snail mail.  Then we had to wait another four days for the closing agent after that.The final insult was when I attempted to contact my representative at her behest.  Her phone would ring once and then I'd receive a busy signal.  I finally had to contact the company through another number and asked them to contact her and have her contact me.  This happened on three separate occasions. The first time she said she'd have their IT guy check it out. The third time, she told me \"no one else has this problem contacting me\", which to me means that she's calling me a liar. If it hadn't been for the low interest rate I would have cancelled then and there. I do sincerely hope that someone listens to those RECORDED conversations I was always informed of when she called.  Finally,  when the closing agent/Notary retained by them came to the house for the final signing there were several forms in their packet that were blank and upon which they wanted our signatures.  I had to contact the Escrow Company to find out what should be in the blank spaces.  We were told \"don't worry, they're just generic forms.  Sign them and we'll fill them in.\"I'm sorry folks, homey don't sign nuthin' that ain't filled out completely and to my satisfaction.  They quickly found out which part of the horse this old Non Com can be.So Admiral, what do YOU believe I think of your company?", "rating": 2}, {"title": "Not the response I wanted", "text": "Date of experience: September 20, 2018", "rating": 2}, {"title": "Dear Sir", "text": "Dear Loan started 04/22/2021•Appraisal done 05/06/2021•Scheduled closing per email sent to us on 05/19/2021 from Tyler was 06/10/2021•No phone call communication unless we emailed a question•06/18/2021 I asked if we were being “jerked around “ was informed I was being rude for asking that by Tyler•06/11/2021 Informed by Insurance Agent we did not need flood Insurance we were in zone x•06/11/2021 was informed by Tyler do to FEMA we would need to purchase flood insurance •06/18/2021 Flood Insurance purchased•Approximately 06/19/2021 was called and informed by Tyler the FEMA document we signed had a 10 business day waiting period, (signed document must sit on a desk )never mind the fact we purchased the flood insurance. Tyler said “according to the law” •06/18/2021 received email from Tyler stating he was waiting for underwriter to do final review Nothing for 3 weeks until we reach out to Tyler06/23/2021 sent email to Tyler requesting a final closing date 0708/2021 Tyler requested Declaration forms from Insurance showing NewDay as the financier 07/15/2021 Email sent to Tyler requesting an update07l15/2021 Tyler responds waiting on county tax updateWhen pulling up the loan documents we originally signed they have been removed we cannot even locate them. No accessWas informed by Tyler they are removed from server after so many days. Another signature form completed. •Tyler wanted us to contact our insurance agent and have zoning changed•Colby our insurance agent reaches out to Tyler to explain zoning can not be changed •Colby our insurance agent informs us his underwriters do not feel we need this insurance as our property is insured for $274,000 well above what we are asking for in our loan. •Tyler informs us he is going back to his underwriters •We are well into August at this point Tyler is still wanting us to purchase an additional $3,000 in flood insurance.•At this point we have already canceled the loan process, Tyler calls and speaks to Lee on the phone asked him to continue with the loan process because we were almost done never mentioned the flood insurance again, did not mention the zoning again. •08/2021 Tyler calls and wants another authorization to access our credit information stating the one they had expired in 3 days. At that point he was informed no-he had 3 days to close or cancel we were done. •Next he calls and scheduled the Notary to come to our home Friday evening after the close of all business. Didn’t think anything of it. •We got to page 2 of documents it shows our flood insurance, that leads us to believe everything is good to go. Then we see in the zoning it is marked A/E we bring it up to the Notary and they say “we don’t know anything about it, but Tyler said “If they mention getting an attorney to look at it, let them know they don’t need one” we accepted that answer thinking we have flood insurance this must be the way they have to put it for our flood insurance to be on page 2. We moved forward with signing. •Closing done Disbursement of funds was completed three days later•Less than one week after closing before the ink was dry or before we even got our first payment due, we receive a letter stating we are going to be in default because of flood insurance. Because we have to purchase the high risk flood insurance. We sent the letter to our insurance agent, he replied once again we are not high risk flooding, we are covered for the entire amount of the loan. Now we receive a 2nd letter of default on our loanWe call New Day Underwriters spoke to a very nice lady she can not help us, ask for manager he says “on my way to meeting” she informs him as I can hear her speak the run down of the issue. He says to her “tell them to go to FEMA and fill out a Loma request. We started the process but couldn’t understand everything they requested.Because of all this we had to hire an attorney. My husband is 90% disabled Veteran •", "rating": 2}, {"title": "Would NOT choose them again", "text": "Could not share full experience due to arbitrary character limitation- here is what I could fit:The underwriters were atrocious with New Day, & made what a simple procedure an utter disaster. The mortgage agent contacted us an exorbitant amount of times to confirm information that had been previously communicated. Agent assured this was the “last piece, or final hurdle to get to the finish line” that was needed. But we would soon be contacted again for more info. Delays were due to incompetence & not my wife and I’s financial standing.Some of the main heartburn I associate with New Day occurred as we inched closer to Closing. Brief setup- I was moving across country from 1 state to another. We moved at separate times (me first, & family to follow later). Had to do a split closing (wife in one state, and I in another). This was discussed with processing officer well in advance (3-4 weeks ahead of time). When I discussed issues surrounding our situation, I proposed several solutions ranging from power of attorney (to sign for wife), having her & I sign two different copies, faxing the papers, etc. Processor advised we had to proceed by wife signing papers a day ahead of time (at title company 6 states away), & then overnight docs to title company where the property was to be purchased. This was confirmed with processing officer on handful of occasions leading up to closing date of April 3, & also with both title companies, realtors, etc—everyone was on board; or so I thought.Midmorning on April 1, after I had already long left my home state, I was pulling a 4,000 LB. trailer going 65-70mph on an unfamiliar road, I received a disappointing phone call from our processing officer at New Day. She informed me despite the plans, New Day was now requiring me to sign the documents first & then my wife. She advised this was bc I was the veteran and they needed it to be done in that fashion. I protested, explaining to her that I would not be in the state of my destination until April 3rd (day of closing). I also advised if we were to proceed down this potential route, I would not be able to get into the home on that date (which was a Friday) & would have to not only spend a minimum of three nights in a hotel (possibly longer), but I would have to return U-Haul before closing on house & would therefore have to unload all of my items from my trailer & pay for a storage unit or something to put them all in. After stressing the same points, I had expressed to her weeks before, and after checking with her superiors, she advised we could now proceed with the POA & that I could sign for my wife. Reminder: I had proposed this idea a month prior, only to have it shot down quickly. This is an oversimplification of what occurred. Changing the plan 36 hours prior to closing caused each respective title company & Realtors to also point out additional issues they themselves had with new plan. I continued to drive on, pulling my trailer, coordinating between these various agents & stakeholders, and containing my seething anger and indignation for the incompetence displayed at New Day USA. I have spoken with several people at New Day regarding my experience, & overall dissatisfaction & displeasure with their company. I want it to be known that I do not harbor any ill will toward them, do not have a hidden agenda, & don’t seek to tarnish their reputation—I want to warn any other potential Veterans of my true experience. Someone dropped the ball on our loan to cause this cluster- big time. I am of the opinion that a supervisor or someone who was charged with reviewing these plan & had them sitting on their desk & chose not to review the packages until last minute. This person’s ineptitude, laziness, & lack of attention to detail, almost caused even more financial hardship to my family during this time of moving, floating 2 mortgages for short time, & dealing with the COVID pandemic. Please consider my true anecdotal account before you sign with New Day", "rating": 2}]