[{"title": "Absolutely harasses you sending dozens…", "text": "Absolutely harasses you sending dozens of texts and calls from agents just looking to list your home. Any offers they give at at 75% or below the homes value. ", "rating": 1}, {"title": "I would never recommend Clever", "text": "Going with Clever actually cost me more than if I had used a regular commissioned realtor. The realtor Clever directed me to did minimal to sell my home and never even had an open house. Lazy and unprofessional. I took a loss on my sale and was disgusted with the entire experience.i would never recommend Clever.", "rating": 1}, {"title": "Not impressed with Clever", "text": "I interviewed two realtors.  The first realtor wanted to set the asking price significantly below the market value.  I hired the second realtor as he appeared to understand the market and had some good ideas on how to market my house. In the end, I don't believe that he had my best interests in mind and did not represent me well in the negotiation process with the buyers realtor. He set the intial asking price too low and during the negotiation process with the buyers realtor he encouraged me to continue to accept a lower offer and to give additonal credits to the buyer. I believe his primary object was to just get the house sold as soon as possible regardless of how much it costs me in a lower price. In the end I believe I sold my house at below market value. Also, during the initial open house he showed up only minutes before when there were potential buyers waiting in their cars. He also convinced us that the 4th quarter of the year was a good time to list a house and that was not our experience as we did not have but one offer. Also, through out the process he would say one thing and then later say exactly the opposite and we concluded that we could not rely on him to provide us with accurate information. I would highly recommend that you use a different company other than Clever as I believe that the lower commission fee resulted in a lower quality realtor.", "rating": 1}, {"title": "They treat their referral agents very…", "text": "They treat their referral agents very badly, realtors beware :( you can easily find a local agent who will offer you the same rate clever does. The owner harassed and threatened me in 2020, the morning I was going into surgery over a $900 check I had sent them twice already that they had lost or misfiled. Their response to this review is pretty typical, trying to shift blame back to the agents they're basically exploiting. It's also not just a 1% fee for the seller, they will ask you to pay buyers agent fee, so deceptive marketing practices as well. Google the owners of clever,stop giving middle man cuts to trust fund mega bros. Best of luck!", "rating": 1}, {"title": "Aggressive and unprofessional agents", "text": "Awful and aggressive agents who lack professionalism and basic understanding of conveyancing. Lied to me about a property they marketed - which came without a registered terrace and parking, as promised. AVOID.", "rating": 1}, {"title": "This Clever is a total joke, if not a scam.", "text": "This Clever was a total joke.  Stay away, as far away as possible.  They are only convenient when they are drawing you in, but when problems pop up, they are no where to be found. The whole thing appears to be a scam, where agents that you don't even get to know, can bring anyone in to scope out your place.  I think you should think twice on this.  I never have had such a terrible experience, as this. Don't say I didn't WARN you..", "rating": 1}, {"title": "Selling below market value is more likely to occur if you sign up with Clever.", "text": "The real estate agent sent me was probably the worst one I could get. Clever’s business model does not support sellers getting top bids. The chief aim is to sell your house way below market value. It’s best to stick with traditional agents who get 6% they are more eager to sell at high price point. I regret using Clever especially when the market was doing so well.", "rating": 1}, {"title": "No Response. Using traditional Broker", "text": "I called Clever Real Estate to use the Service. Submitted preliminary info. Someone called the next day, informed them I was working to call back at 4:30pm. NEVER heard back from them again. Called and left countless messages. No return call.Finally I called back today and a young lady answered. She says she doesn't know what happened. Using a traditional Real Estate broker. Service SUCKS!!", "rating": 1}, {"title": "False advertisement", "text": "Clever says all Clever Partner Agents have agreed to provide 100% full service and support for a flat $3000 listing fee or just 1% for homes over $350,000. This is not true, the agent recommended to me by Clever from the Woodlands, Tx told me I would have to pay $150 for photos and $350 for transaction coordinator.", "rating": 1}, {"title": "After contacting Clever they referred…Samantha", "text": "After contacting Clever they referred Samantha, whom I thought would get our home sold.  They listed it at $59,900 and it went down from there.  The final price was listed at $48,500.  The agent only showed the house once her self the rest of the time it was other agents from other companies.  I offered advice on listing with Facebook and was told she had it under control.  Our house did not sell and I feel the agent really did not try hard enough as our home wouldn't have given her a high enough commission. Recommend Clever? Never!", "rating": 1}, {"title": "You get what you pay for.", "text": "You get what you pay for.Our realtor used his phone camera to take pictures. He did the same for the video and never attached to the site. He put it on YouTube. We thought all our new renovations would sell the place when people saw it.  We lost 4 months in the hottest market.", "rating": 1}, {"title": "Don’t waste your time", "text": "Don’t waste your time. The cost will add up to the same as if you used a legitimate real estate company. $3000 to Clever and about 3% (that’s being very conservative) to “your”real estate agent. The buyers agent gets his/her percentage and that’s a separate percentage. Obviously,negotiable but your looking at 2.5 to another 3%. After we talked to “our” agent it turned out WE would be doing the showings! I told her I might as well sell it myself. Total sham. Don’t waste your money!", "rating": 1}, {"title": "Will not be using again...", "text": "The realtor could’ve given me a better deal than he did, given that he wasn’t bound by Clever’s pricing... Thanks for the connection but I won’t be using Clever again. Steve Junker (the realtor) is the best!", "rating": 1}, {"title": "I would not use this service again", "text": "I would not use this service again. Dont waste your time sell it yourself or get a reputable realtor. Did not listen to what we told him we wanted and didn't work That hard to sell it.", "rating": 1}, {"title": "terrible experience with keller Williams", "text": "terrible experience. Brianna was my realtor with keller Williams and she never informed me that I had to pay closing costs. 4200 I was 100% unaware of. Complete bs.", "rating": 1}, {"title": "My experience was not so good", "text": "My experience was not so good!  I emailed them about selling my house and responded someone would get back with me soon. The next day I get email giving me an agent to contact.  I emailed back and said this agent phone contact was in another state.  I am in Texas.  I then received another email giving me another agent contact.  We made contact made an appointment for the next day to meet.  The agent called me back and said she just signed up with Clever and didn't read all the paperwork.  She then asked if I was buying another house.  I told her no only listing my house.  She was very nice but did not want to take my listing because she did not want to do it.   She said she would consider doing it if I was listing and buying a home.  My experince was not good.  I get the feeling they don't have any agents in my area.  So Clever was not for me.", "rating": 1}, {"title": "Clever called once then never again", "text": "Clever called once then never again! They suck. They strongarmed my realtor to steal money from them. The realtor I used was a friends cousin so they are all crooks!!!", "rating": 1}, {"title": "Horrific", "text": "Horrific!  Sent me a agent who withheld offers, charged my 3.5% when promised and told 1%.  I am in a mess.  Never again!!!", "rating": 1}, {"title": "Horrible Experience", "text": "I was teamed up with Michael Brown through Clever. This was the absolute worst experience I have had with a realtor. I current own 6 properties and do a fair amount of buying-flipping, etc.,  so I am somewhat familiar with the real estate world.  This realtor was rude and unprofessional from day one. He immediately wanted to lower the price of my house, even though it was priced very competitively with the other properties currently listed in our neighborhood. He has had our listing since January and only shown it twice in 6 months. He also refused to let me out of the contract even after repeated requests from me stating that I did not want to sell it at this time and that I was extremely unpleased with his service. The only thing he would agree to do is remove it from the MLS but informed me the contract would remain in full force. I have never asked any realtor to end a contract and never encountered a realtor who was not in contact with you. Mr. Brown never contacted me with any updates unless I reached out to him and then it was several days and sometimes took me reading out a second time to him to get any response. I tried Clever hoping to save money, now I have wasted 6 months,mortgage payments and no results. I will gladly pay the full real estate commission moving forward. I would give no stars for this realtor if it were possible. Lesson learned, you definitely get what you pay for!", "rating": 1}, {"title": "bad experience", "text": "Our realtor was Chris Doss with Clever.  It was clear from the start that he wanted to devote the minimum amount of time to our listing. We rewrote the MLS paragraph ourselves after reading Chris’ effortless write-up. He put a lot of pressure on us to list below what we knew our house was worth. Initially, $15,000 lower, and then as much as $35,000 lower at times when showings were slow. He told us repeatedly that our house wasn’t worth what we wanted, and even if we got an offer for that amount, it would never appraise for that amount. (We did get exactly that amount because we stubbornly held out for it, and it did appraise for that amount. We were under contract in 30 days.) Chris was extremely pushy and direct about us taking the first offer that came in when we weren’t comfortable with it. He also never emailed us offers until we specifically asked him to do so so that we could look them over. He always made us feel as if this was asking a lot on our part. Some offers we never even saw, only heard of through him over the phone. We would later find out that offers conveyed to us over the phone left out many important details, hence the reason we started asking him to email us all offers for us to look at for ourselves. The first weekend our house was on the market it was a holiday weekend, and unbeknownst to us Chris took the weekend off after we got 4 offers on our house. He ignored our texts and phone calls that weekend. We weren’t able to address them until Monday morning when Chris checked back in, and at that point the offers were expiring that evening. About 99% of the time Chris made us feel like we were highly inconveniencing him, and that he didn’t want to devote anymore time to us than he had to. Chris’ guidance though the process of selling our home was nil. Educating us about the process — nil. Communication, a negative nil. He does get an A+ for selling himself very well for our initial phone call and interview—beware, he is a very smooth talker and salesman. Chris is the 6th realtor that we’ve worked with over decades of house sales and purchases. Fortunately, we had the privilege of working with a very professional realtor for our last house sale and purchase, and we are embarrassed to say that we took that level of professionalism and skill for granted. Selling your home is a stressful process and the wrong realtor can ratchet up that stress by 100x. Get a realtor that makes you feel like a valued client and that they have your best interests at heart.", "rating": 1}, {"title": "Terrible agent.", "text": "Date of experience: July 01, 2021", "rating": 1}]