[{"title": "You must be very cautious", "text": "You must be very cautious, I make my funeral arrangements last fall, on a 5 year term. I was told the financing was provided by an insurance company.I was also told that I could put lump sum payments on it to bring the total down faster. Being a senior, my money can be tight, so this fall I wanted to put $1,000 on the balance. I had to call the company, my choice was to cancel or pay the whole amount which I was unable to  do so I cancelled losing that money leaving me with no funeral arrangements. I assumed I was paying on my funeral but no so, the lady I talked to said it was insurance? so if you pay insurance and don't have an accident you don't get any funds back. So $17,000 gone. In reality I was told by another funeral company that I could have transferred that amount and made arrangements with their company for half the price I was going to pay for a very basic funeral. So be very careful as insurance company do, they take your money and rum. a great big scam. On the funeral homes part and theirs", "rating": 1}, {"title": "not paying claim of life insurance", "text": "My housemate and I both signed up for life insurance, listing each other as beneficiaries. It was an easy, quick application. I thought we were all set. Unfortunately he died unexpectedly and the company has been dragging out the claim for 6 months. They want medical records from all facilities in a 15 mile radius. Since we are not related and not married, the hospital will not provide me with any records. They make it impossible to conform to their requests. Beware of these easy, quick policies, you might never collect anything. Ongoing experience", "rating": 1}, {"title": "TruStage is not TRUST WORTHY, not tru to there WORD, ", "text": "Most of these postive post are people buying I am very sure when the time comes and its time for this company to make a payment lets see what they say. Mom surrender a small policy she had for 22 years. She was grieving and not paying attention but the amount is wrong.Called baxk later when I found her policy and we ask how did you caculate and come to that amount customer service replied we have software on computer that does it, so i cant exllain it.Then we ask for them to look at policy they replied its canceled because of surrender it I understand but you mudst be able to review it and see mistake, no we no longer have access to any paperwork. Also the check doesnt have polucy number or intrest rate, when the policy was purchased. The letters and numbers are not uniformed and looks altered. Way to gi TruStage funny the furst three lettets TRU but this company is not True the cusromer service guy was rude and speaking to a 85 year old widow like he did. Maybe thats why they changed there name from cuna to trusage. Thanks for the call back. If it sounds too good to be true like some of these reviews then it most likely is.", "rating": 1}, {"title": "I applied for life insurance and…", "text": "I applied for life insurance and provided billing info, only to be declined. I found out later they had been billing my account for a total of $350. I tried to dispute the claim showing them that they sent me an email declining me. They claimed I was accepted but I never received anything telling me that nor a policy. They refuse to pay me back  the amount they billed. STAY AWAY FROM THIS COMPANY. Use a company that has been around for several years", "rating": 1}, {"title": "Don’t trust trustag they are trufraud truscam ", "text": "I don’t want to even want to give them a star. They are fraud and scam and if you come to see this contact me on here and I will send you to better companies that’s will works n fight for family like me. Trustage and Cuna left me and my kids homeless and almost living in the shelter during winter. Lucky I had a friend to let me and my 7 kids stay in one of her 2 bd room apartment until I can get back on my feet and finish figuring out to paid the rest of my dad funeral expenses and arrangement. There slogan says  “Get an instant decision and get you're approved, buy completely online with TruStag”They approve and didn’t even pay out sent bills and packages to u as you got approve and when it was time to pay out… they came with excuses and left you unheard and unseen. BAD business model. ", "rating": 1}, {"title": "Can't Pay Insurance Premiums Online", "text": "My wife has Long Term Care insurance through TruStage. She originally had it through CMFG Life Insurance Co. which was acquired by TruStage. TruStage claims it is highly rated by different agencies, Trust Pilot, etc. This company does not accept premium payments online! Paper Checks have to be sent through the US Mail. How can a company in the 21st century do business like this. If I wasn't \"locked in\" to TruStage for my wife's LTC insurance, we would have changed to another, more progressive company.TruStage asked me to contact them to discuss alternate payment options. I discussed this with them months ago. The only options are to send a check or have them automatically debit my account (which I won't do). They are not a progressive company", "rating": 1}, {"title": "Don’t believe and go else where ", "text": "Cuna mutual and Trustage made me and my kids homeless. We got evicted because they didn’t pay my dad policy out. They are evil people and I wouldn’t recommend anyone. Please go else where for protection insurance. This company is where the richer get richer and the poor fall for their fake guarantee and get homeless and scrap of the barrel. ", "rating": 1}, {"title": "Denied a vet help using contract stipulation", "text": "They used a 90-day stipulation on me. I'm a hardworking navy vet and I'm always trying to prepare for the worst. I recently got laid off due to downsizing. I had my auto loan for 2 and half months, then lost my job. TruStage immediately denied it. That 90-day stipulation is unethical and arbitrary. Nobody can see 3 months into the future to know there job stability. Also, Trustpilot reviews of this company is completely different than BBB, which is sketchy. After reaching out to TruStage, it was told to me nothing can be done. ", "rating": 1}, {"title": "This is by far the worst life insurance…", "text": "This is by far the worst life insurance company I have ever seen. They are preying on older people and when submitting surrender request with their paperwork the refuse to surrender and send the value back. We have been working for 4 months to cancel the policy and all they will do is keep stealing money and sending you bills.", "rating": 1}, {"title": "Biggest waist of time. ", "text": "I have sent the information they asked for 4 different times each time asking for something different.  I call to ask for an update and keep getting told the claim is under review or the adjust has not seen it yet.  This has been ongoing for over 4 months now.  This is ridiculous.  I wouldn’t recommend this company for anything they are scams and just taking your money and not helping anyone out. ", "rating": 1}, {"title": "Took more money than contract outlined", "text": "Completed final monthly payment for my pre-paid funeral last month. When I did the math and found the 36 payments equaled $262 MORE than the signed contractual agreement and enquired to such, I was given some lame explanation of some inflationary \"fee.\" When I asked to speak to someone and to receive a detailed outline of what those fees were and why they were NOT outlined in my contract, I was sent some generic copy of my contract which had no such explanation, and no one contacted me back.  Have filed a BBB complaint.", "rating": 1}, {"title": "Unprofessional", "text": "First & foremost let Begin by saying these people have no manners they lacking professionalism and they are rude extremely rude. Just because I informed the agent female agent that I had no savings or check account she said quote \"can't help you bye\" & hung up on I have worked in customer service and must say this was the most rudest ignorant person to work for a company or to work any place for that matter. I tried to make a complaint and they hung up on me. I am amazed at this point how this company has managed to stay in business for so long.", "rating": 1}, {"title": "They are just a rip off company who…", "text": "They are just a rip off company who offers nothing for life insurance. The rates are too low on the coverage for people 63 or older who has a few medical problems. They’re not willing to give enough money out to cover all your expenses after death so the company is useless to anybody over 62.", "rating": 1}, {"title": "Trustage agents are unhelpful", "text": "Trustage agents are unhelpful. I was in a car accident and had to use my disability insurance to make a car payment. The trustage agents are misleading and don’t provide me with a claim number until I asked. They did not give me my claims adjusters name until I asked. They provided no email documentation until I asked. They also hang up on calls. Horrible run!! ", "rating": 1}, {"title": "On loyal and on professional!", "text": "I had a really bad experience with trust stage insurance when they used to take my payment every month they will take more money than my regular payment. I had to call my bank and block you guys because you guys took two payments extra without my concern after I block, you guys still took those two extra payments. I was told by your agency a staff trustage insurance whenever I cancel my account. Supposedly, I was gonna receive money back until this date. I haven’t received anything, and if people will ask me, about your insurance. I will not recommend them at all.", "rating": 1}, {"title": "My friend Dad had this life insurance…", "text": "My friend Dad had this life insurance for 1 year he recently passed away and they said because he didn't have the insurance for 2 years or more they wouldn't payout double check with these life insurance companies on that. No one can determine when it's your time. Total bs!!!", "rating": 1}, {"title": "All I tried to do was move my payment…", "text": "All I tried to do was move my payment date to the 3rd of the month, I'm on Social Security, I was hung up on,phone left on hold,and they can't even give a simple yes or no to your question. I can only imagine the grief this company would give if you filed a claim. And I was trying to give them money. Absolutely insane business model they have. One star review is the lowest I can give.", "rating": 1}, {"title": "I filled out a form requesting a quote…", "text": "I filled out a form requesting a quote for Life insurance. I received a letter in the mail stating that coverage was denied. Then they started deducting 113 a month from my account.  Unfortunately I missed this deduction for quite some time. Pay attention to what you request, I thought I was just requesting a quote, they deducted almost 3000 and only refunded 298.  I accept some responsibility for not paying closer attention to my savings account. ", "rating": 1}, {"title": "I would give them zero if I could", "text": "I would give them zero if I could. My husband died from cardiac arrest, had a pitifully small policy with them. His doctor even went on to write a letter that it was caused by a heart attack and they still denied my claim after months of back and forth. So I am left without anything as a 30-something widowed mom of three kids under 5. I guess I was supposed to have him unburied and autopsied to “prove” his cause of death despite a death certificate and a letter from the physician. This company is disgusting and a waste of time and money, do not even bother.", "rating": 1}, {"title": "Never talked to a live human", "text": "Never talked to a live human. Customer service?  Not any. I will be canceling policy for this major achievement you pulled off. I really prefer to talk to humans. Could have been a customer, not just a number for you. Should have contacted me personally. Good day.", "rating": 1}, {"title": "I called a number to be removed from…", "text": "I called a number to be removed from receiving offers from TruStage the exact phrase is “to stop receiving offers from TruStage, please call 1-866-862-1819.” They insisted they need my DOB and last 4 of SSN.  they claimed my husband has AD&d with them so that information is needed.  No it is not needed to be removed from an offers mailing list. This reeks of scam. Just for the record, automated answering doesn’t have an option to remove nor does it understand remove.", "rating": 1}, {"title": "Unreliable coverage.", "text": "My husband was injured on a job site resulting in a partial foot amputation. We filed our claim and it was denied because his whole foot was not amputated. So I paid for a year of this coverage and received none. My husband had no health insurance and is unable to work. I should have a life insurance for us as well. Very disappointed and want my policy canceled. Also, the denial letter I received included personal and confidential information for somebody else (who is getting paid). Highly unethical.", "rating": 1}, {"title": "Your system never asked what kind of…", "text": "Your system never asked what kind of cancer I have, which is a mild form of basal cell carcinoma that has not returned after its removal in 2017. Instead, I was lumped in with much more serious and fatal diseases.", "rating": 1}, {"title": "Limited Options", "text": "I have an annuity through TruStage. The only option to change withholding as of 2023 is by fax or USPS. No email option or any other secure solution is offered. I have not had a landline since 2010. Most all fax machines require a landline. This means I'm either potentially compromising my social security number on the form either in the mail or by using a fax at something like a library or UPS store or a phone fax app.To be clear, I have no security concerns as sender or at the recipient. My security concern is with the intermediary handling. This is 2023 - not 1990. C'mon TruStage. Its time to ramp up security and options to send/recieve documents.Edit 9/25/23: TruStage replied today. The reply was meaningless. Was not offered any additional options to conveniently and safely send in changes. Ironically their reply was sent using SECURE email - which likely could be used to conveniently send updated withholding requests. Unfortunately no such luck.Review remains unchanged.", "rating": 1}, {"title": "Trustage is False!", "text": "This company is inept, incompetent or deliberately dishonest. I signed with them and paid money. A week later I canceled and the next week was told I would receive a 100%refund. After over 3 months of calls and broken promises I am still trying to recover my money. I would rate them 0 if possible.", "rating": 1}, {"title": "Bad Quote and No Customer Service Available", "text": "I called in and the agent said she saw that I already had a policy with progressive. She told me the quote she gave me was for the exact same coverage I had. Once I signed the new insurance docs with progressive the new policy was not the same. Progressive told me to make the policy the same as my old one I would need to pay an additional 330 dollars. Trustage has no customer service to assist. They only try to transfer you over to the real insurance company. I will definitely never use them again!", "rating": 1}, {"title": "This company has crap adware that…", "text": "This company has crap adware that constantly pops up and I cannot close.  I would never support a company that stoops to this level of advertising.  The company wanted more information but the popup provided was useless.  I tried emailing a response and it bounced.  Here is a screenshot of the advertisement.  It pops up in the middle of my scrabble games on the Lexulous site and I am unable to close it without rebooting.  Screenshot 2023-06-26 at 8.20.13 AM.png", "rating": 1}, {"title": "Please read the small print", "text": "Please read the small print. When you reach 70 yrs. oldyour benefit is cut by 50% but your premium stays thesame. You are not notified and it is up to you to changeor cancel your policy. A very deceiving business practice, taking advantage of seniors on a fixed income.", "rating": 1}, {"title": "This company is DEI and could care about you. It out sourced to the Philippines, when you call you get a strange voice looking at your data on their screen. I will not do business with this company!!!", "text": "This company is DEII wonder out of the 37 million people they say they insure, know that are contributing to a very woke company . Don't even try to cancel your policy they make it so difficult you give up !!!read their answer, full of bull and they dont deny they are woke .", "rating": 1}, {"title": "BEWARE!!", "text": "BEWARE!!! Do your research and read the reviews submitted by those who were not \"Invited\" by TruStage to comment here.  You will notice a SIGNIFICANT difference in ratings.  Now, the reason why I rated them one star (would be zero if that was an option).  It is March 25th and we're still awaiting my mother's FEBRUARY long-term healthcare claim check. Her March payment is also now late. TruStage has ONE JOB and only one job to do...make timely payments of qualified insurance claims and they've been woefully inept and unsuccessful at doing that for my family. What I have received thus far are excuses and broken promises. Equally frustrating is their policy to NOT pay claims electronically to your bank account. They will, however, conveniently take your premiums electronically from your bank account. No one has been willing or able to explain to me why that is the case. Please do your research including complaints posted on the Better Business Bureau's website to get a more complete picture (not just what TruStage wants you to see on their website).  If trust and reliability in time of need are important to you, that's certainly not been my family's experience thus far. Good luck.     ", "rating": 1}, {"title": "POOR REPRESENTATION", "text": "I called to speak to a representative regarding my policy and got a foreigner that didn't speak English well enough for me to understand and was so unprofessional. They had chickens and dogs in the background and couldn't even answer my questions due to the noise pollution in the background. If you're going to spend money to run a company, hire people that are going to value your customers. If you want to go with a company that values your business and treats you with the upmost respect, go somewhere else, because this company can't even hire English speaking representatives. Do NOT recommend this company!", "rating": 1}, {"title": "Reviews mean quite alot", "text": "After reading all the reviews I decided not to apply for insurance. The negative reviews won me over and I truly feel bad for some of those people. I do hope someone helps these people but I thank them for their stories.", "rating": 1}, {"title": "Bad customer service", "text": "My mom called their customer service requesting loan application forms. I spoke to 3 agents they have promised that they will fax the application form. I waited for the whole day, but they never fax the forms that we need. Therefore, I have to call them back the next day and this agent says that they could not fax the forms because of security reasons, Then I said what security reason the forms is fill in the blanks and we are the ones who will put the information for the application. We are asking them to expedite the process by faxing the forms but they are horrible to talk with they do not have consideration for their client of 10 years. I demanded to speak to a supervisor and the agent said the supervisor is in the meeting.  The agent took my phone number for a call back. I waited and waited, the day passed but there is no call back that receive.", "rating": 1}, {"title": "Crooks ", "text": "People beware!  Yes it may be easy to fill out the application but they are not the friendliest when it comes to cancelling the policy.  I called and canceled the policy. The one rep said ok, I will process the paperwork.   two months later, I'm still being billed.   I called again, and the lay I got was rude. She tells me she sees no mention of a phone call.   now I have to record the conversation.   So now I have to fill out these documents and send them back only to get my money back.    Don't trust this company. ", "rating": 1}, {"title": "I went from paying 69 a month to over…", "text": "I went from paying 69 a month to over 350. They said they mailed something informing me but I never received anything. They never tried to call or email either. When I call to cancel, they say that they have to send something in the mail. That took 2 weeks and made my surrender amount drop by 200, Im sure it was planned. By the time they get back what I have to mail them, my surrender will be zero. Stay away guys, they dont communicate policy changes.", "rating": 1}, {"title": "BEWARE OF THIS COMPANY-", "text": "BEWARE OF THIS COMPANY-My Mother Passed September 4-TimeLine9/16-Claim Process Started10/4-Claim sent 10/27-Resent Claim again1/6-Authorzation form to release medical records- file sent1/31-Resent Medcial file again-Phone Call Contacts-11/30-Claim Status check- being Reviewed12/2-Claim Status check- being Reviewed12/8-Called again to make sure I didnt need anything else.  Now they are requesting her Medical Records-3months Later - They said they will handle I didnt trust  them. I called the hosptial and the Medical Records dept stated NO REQUEST HAS BEEN SUBMITTED. This bery same day I submitted the records myself and Trustage did as well.12/28-Trustage says Grady denied request because of No Authorization form from Next of Kin.12/30-I made 3 calls to Trustage- Trustage sent me another FORM.Jan 11,16,17,23,26,27 Jan 6, and 31 -I submitted My copy of requested Medical to Trustage. I got a reply email.Feb-27th- I called and i got the SAME SPEECH WE REACHED OUT TO THE HOSPITAL AND  WE WERE DENIED. 2 Have 2 Copies of the MEDICAL RECORDS- i REQUEST A SUPERVISOR NO ONE WAS AVAIABLE.", "rating": 1}, {"title": "Very poor insurance company", "text": "Customer service and company protocols are very poor. Customer service is not able to explain company protocols, and when the protocols don't make sense in a particular situation the company refuses to make any modifications to meet customer needs.  When this was pointed out to them, they hung up the phone. If you are looking for an insurance company that is interested in their clients, look somewhere else, this is not the one for you.", "rating": 1}, {"title": "DO NOT USE THIS COMPANY!!!", "text": "DO NOT USE THIS COMPANY!!!! THEY WILL FIND A WAY TO SCREW YOU OVER! THE WAY The way they pay claims is ridiculous, stupid and ALWAYS LATE!  Nor do they pay the full amount of the claim. Maybe make a partial payment one month, skip a month or 2, then pay a bulk payment to cover. Because they do this bullcrap, guess whose credit takes a hit? I had an insurance policy on my car loan with Cuna ( which later became Trustage) to cover my payments while I was out of work, recovering from a broken leg. I had no problem when it was Cuna, but once it became TruStage, I started having issues. I was constantly being called by the bank my car loan was through asking when trustage was going to make the payment because it was late sometimes by 2 months, then I would have to call trustage to figure out why they were so late or why they hadn't paid yet. It was a NIGHTMARE! Especially since I was already going through hell with having multiple surgeries, multiple blood and Iron infusions, 4 1/2 months between 2 hospitals and a nursing home/medical rehab, dealing with agonizing pain, and countless hours of therapy learning  how to walk again. I was dealing with enough, I didn't need to deal with this companies crap too. How they dealt with my claim, they should be ashamed of themselves. I hope people will learn from my mistake and don't use or trust this company.", "rating": 1}, {"title": "TruStage sold my 80+ year old mother 2…", "text": "TruStage sold my 80+ year old mother 2 policies of the same, lame whole life insurance.   She was confused when she bought the second one.   But really, $50/month for $4,000 insurance?   a complete waste of money.  My mother canceled these and took the surrender value.  what a relief.", "rating": 1}, {"title": "Real poor business", "text": "First off I want to know how your rating is with the BBB? I'm really glad I canceled  my plan. Especially  after waiting to get my money back. Good thing I found out about your way of doing business.  Before I stuck my friend with my funeral  cost. I see you don't like paying out. Than after I canceled  my policy  you sent me a bill. I hope that if one person reads my review  and decides  to buy elsewhere  I'll have saved them money.", "rating": 1}, {"title": "Worst insurance company, false advertisin n scams", "text": "Jan. 7. 2020 …I had two policy on my dad and they didn’t pay me out because of two years thing but they have never stated that when I bought it or else I wouldn’t have bought it. They r all false advertising and I wouldn’t recommend them to anyone or anybody. It’s so frustrating appealing with them and I wouldn’t even offer them to my worst enemy to buy. That’s how much Cuna and Trusatge I don’t trust and support. Six month later they wrote and said the needed medical records when they already had in the beginning when asking for health records and to approve the contract or application and than denied when it was time to pay out. They had never told me or my dad it was a two year contract first and than get benefits after that and my dad passed away 11 month to the policy and they said no. Had to use and borrow money to do my dad funeral. Until this day 4 years  later,  I am still in debt and my 7 kids and I are suffering and struggling from financial difficulties and almost homeless. My dad should have save all those monthly payment .. maybe it would have got money save or at least went to another better insurance company that is more trustworthy and more reliable and have integrity in their words.", "rating": 1}, {"title": "I have reached out to then and asked…", "text": "I have reached out to then and asked them to reset my account , I asked them to send out paperwork for my policy; haven't received anything u asked for, my payment comes out direct deposit on timeYet I have yet received an updated policy or any paperwork, I might have to clothes this policy, it appear as if it's a scam and will not payout , or that they will come up with excuses not cover the monies in the insurance policy", "rating": 1}, {"title": "I believe in standing behind your…", "text": "I believe in standing behind your product and truth advertising. To date I haven’t had that experience.", "rating": 1}, {"title": "I just had the worst terrible…", "text": "I just had the worst terrible experience with an agent from CUNA....affiliate of Trustage...Trustage connects you with third party dependind on your zip code..if some manager get a chance to look in to this review, PLEASE check for an agent just spoke with me today jan. 13th .friday around 8:10am...eastern standard time...FLORIDA STATE...this agent was nasty...not professional..he would not let me explain what i want...almost yelling at me...at the time he answered my call i could hear him yelling at others...with me was super nasty...asking me questions ...i had to tell him...I dont not what are you talking about...I dont know about the specifications ???..on what he was asking me to answer...he should explain to me fisrt the meaning of the policies ??...I think that I should be glad that happened because I will not have trouble to decide which life insurance company to choose from...a different one...for sure..", "rating": 1}, {"title": "Been paying into LT Healthcare…", "text": "Been paying into LT Healthcare insurance policy for 20+ years.  Finally had to draw on the policy, waited  90 days for the elimination period to end, and all of a sudden there has been an \"outage with their payment vendor\".  11 days and payment has still not been released.  Company makes it easy to take the premium from your bank account but \"does not have the technology\" to pay claims into the same bank account. Excuse after excuse.   Update 3/8/24 - Still no check.  Was told last week that it would be sent this week.  Now being told MAYBE by the end of next week, but can't promise it. Do your research and seriously consider whether to put your faith and hard earned dollars into a company that can't figure out how to mail checks to their clients (the one thing that they are being paid to do!!!) and refuses to send the money, instead, electronically to the SAME bank where the premium payments came from (like most every other financial services company offers). Still no explanation why that is not an option. With this company you will find frictionless premium payments (very easy to send them $ directly from your bank) but so far only roadblocks when it comes time for them to pay. Perhaps, consider a company that operates in the 21st century and can be trusted when you need them. In my experience thus far, this is certainly not one of them. I continue to welcome a call from someone at this company with the authority to properly address this issue rather than continuing to kick the can down the road. It's difficult to imagine a worse client experience.      ", "rating": 1}, {"title": "This insurance is to high I'm…", "text": "This insurance is to high I'm considering canceling this policy I'm not working at this time I let will let know.", "rating": 1}, {"title": "My mom just passed away three days ago…", "text": "**update TrueStage you can contact me with information found in policy number 2021174054. I have tried to contact you numerous times and have left message but nobody has called me back. You indicated below that you would like a chance to make this right, please do so and email me for more contact information.My mom just passed away three days ago and TruStage Life of Canada is holding back $1200.00 for a final document service that we do not need (the funeral home is providing all services) and this company will not refund for the services that are not rendered. Furthermore, my mom called TruStage Life of Canada in May to ensure that we her family would have enough money to cover her funeral. She was quoted an amount that this company now refuses to pay. I also called this company one week before my mom passed away to verify the amount as I was working with the funeral to prepare for my mom’s passing (she was in a coma) and TruStage would not discuss the financial amount of the policy with me until my mom passed away. Now that I am calling to have the full amount of the insurance policy in order to bury my mom they will not payout the amount that was quoted to my mom before she passed away. TruStage Life of Canada is saying that my mom has to call them to verify that we do not require final document services. My mom cannot call as she is deceased and now we are short money to have my mother buried. Beware of this company. Do not take a policy out with TruStage Life of Canada scams elderly people and then steals from an already grieving family at the worst time of our life.", "rating": 1}, {"title": "This company is a scam", "text": "This company is a scam. They will tell you that they will email you an application for a policy and the link won’t work and the next thing you know when you call them the next day is that they raise the rate on you. Do not purchase policies through them. It’s a scam.", "rating": 1}, {"title": "Raised premiums without any notice!", "text": "Raised premiums without any notice!No previous claims Told premiums would never change???", "rating": 1}, {"title": "Do not buy a policy!", "text": "Just beginning, this is a summary only. This will be submitted to my fathers Elder Law Attorney, Eglin FCU, and through the state of Florida regarding Exploitation of the Elderly. My father is currently 95, in a nursing home, good health but memory issues. I recently (only this month!) had to take over his affairs (POA) and in reviewing his bank accts. found an automatic monthly deduction for $203 EVERY month since 4/2013 (he was 85 years old). Found 1 paper only showing a Whole Life Insurance (not Term) policy for $10k, not to expire till he is 121. I called the company to ask about this and to request policy documents etc. I was told the policy gained no cash value, no dividends or %, would payout NO MORE than $10k ever, and cash surrender value is $4k today. So, he has paid $24k over the 10 years (and continues to pay) for a policy never worth more than $10k. He was 85 when he purchased this, in great health, and no way would he have knowingly purchased something like this that would not have increased in value. NOTE: after calling company for INFO only, I went online to set the account up and view any documents. I saw payments were set to MAIL instead of AUTO deduct (as it has been for 10years). Called back, was told they don’t know why or how it was changed. He does not get mail (memory care), so I asked what would have happened if they sent a statement and payment was not made…was told policy would have been cancelled and NO VALUE, EVEN CASH SURRENDER! Scam…somebody at the company was trying to get this policy to lapse even though they have received over $24k! Currently turned over yesterday to Elder Law atty, and contacted CU to also hold them liable for recommending this policy. Thankfully, my father can afford the fees to litigate this….I’m sorry so many other people on here absolutely depend on this company to protect them financially.", "rating": 1}, {"title": "Promises not held", "text": "Our privacy guidelines prohibit us from communicating specific policy details through unsecured channels like email. Please call us or log into your online account to chat with us at your earliest convenience, so we can assist you with your requested information. The above statement you make.is absurdYou are NOT communicating any specifics. This LETTER has been PROMISED me for over a month. You are violating my rights to the application of my payment and the  details of the suppose  loan and it's payoff.FROM B.H. saidI have requested the premium received on 06/14/2023 be applied to your loan balance. A letter will be mailed to you once this has been processed J.P. SAIDWhen a loan is paid off, a letter is automatically mailed to the address on file confirming – we’re sorry to hear this was not the case when the loan was paid off. A letter has been requested to be mailed to you confirming the loan payoff – please allow 7 to 10 business days to receive. This is from K.L. LAST MONTHWhen a loan is paid off, a letter is automatically mailed to the address on file confirming – we’re sorry to hear this was not the case when the loan was paid off. A letter has been requested to be mailed to you confirming the loan payoff – please allow 7 to 10 business days to receive. Here is ANOTHER email:Since those letters are not sent out automatically,  we apologize.  But you will receive the letter in 7-10 days. This is J.P. SAID We have applied the premium to the loan balance.  You will receive a letter in 7-10 days for your confirmation.I have requested the premium received on 06/14/2023 be applied to your loan balance. A letter will be mailed to you once this has been processed.  SINCE JUNE 14. I WANT THE LETTER AS PROMISED TO ME MANY MANY TIMES. IT IS MY LEGAL RIGHT,Talk to :Brittani Herget  Jessica Perez,  Katie Liddle", "rating": 1}, {"title": "SCAM...SCAM...SCAM...Stay away from…", "text": "SCAM...SCAM...SCAM...Stay away from these Scammers. They will sign you up and Steal money from your account then refuse to refund. SCAM SCAM SCAM ", "rating": 1}, {"title": "Just got yet another run around with…", "text": "Just got yet another run around with this place. I canceled  on August  2nd. It is August 17th. But yet I never received  my money they took out of my bank account on August  3rd and August  4th. When I call I get a run around. Wait another week. Bullsnot. Save your money. Your loved ones will never see the money you invest with this company. Your body will turn to dust before your family will ever see a penny. Oh ya. I also got a bill from them. These Theives will take your cash in 24hr. But will never pay. Sorry. Please seek out a better company. One that will actually  help your loved ones out. Or your loved ones will be stuck with the cost and these thieves  will be running with your hard earned  cash. No wonder they don't want to know your beneficiaries  address. They weren't going to pay them. Please if you care enough to cover your final expenses.  Go some where else. Trustage only takes your money like thieves in the night. And when your gone. Nobody will be there to fight to get it. You maybe put in potters field. Because this company only takes your money. Please please please DO NOT USE TRUSTAGE. Unless you like giving your money to bandits.", "rating": 1}, {"title": "my husband fell and hurt his back took…", "text": "my husband fell and hurt his back took him to the hospital they did a xray found a mast on his spin did surgery on the mast and found it was cancer and 15 days later he died  we didn't know that he had cancer before the fall I got screwed out of money because of the cancer ad&d insurance is a rip off", "rating": 1}, {"title": "My Dad made a Bad Coice", "text": "First, a few facts, I filed upon my father's death in Jan. He died 2 month before his policy matured. I do understand the problem there. It was unexpected because he was set to be released from the hospital. But at the same time expected because he was so old. The cause of death is clear on his death certificate, heart and kidney issues. It's only a $10,000 policy. They sent me the form that he filled out and he checked off that he suffered from everything due to his inability to normally think clearly but they still accepted him.The process;They send forms in the mail that take 14 business days to get to you. No option for emailing them and they are not located on their website. The forms are for investigation purposes. My dad clearly died from heart failure, I was by his side to see it! He was 80 years old and would have made it to 81 this March. I uploaded his death certificate as soon as I got it so they know what he died from. I received the forms and ended up spilled something on them while filling them out. I called and requested replacements. Another 14 business days go by and I dont receive the forms. I instead receive a letter from them letting me know I have not sent the forms in. Then a week later I received the forms. I fill them out and uploaded them. A while after that, I get another notice telling me that they still don't have the documents. It is 3 months later his medical bills are coming in hard and fast with no relief. I had to bury him using his life savings because this insurance company was not in my corner. I'm stressed, broke, and I will have to call again today to attempt to clear this up. This company seems to do everything in its power to prolong this process and make it as painful as possible. Why kick a beneficiary during their lowest moment, just why?I've read some of the other comments. I don't need condolences. I need them to do their ******* job and stop water boarding me through an unnecessarily lengthy process in which there probably will be no payout. This is a terrible experience!!!", "rating": 1}, {"title": "they will reject you for health issues don't bother", "text": "i would not suggest them its just a scam, they advertise as this TruStage™ Life Insurance - No rejections due to health, that the biggest joke, they most certainly will reject you if you have any health issues, they want to collect you cash tell you 80 on term life, so if your not expected to live tell then , you are rejected, so no piece of mind with these guys, they just take your money!", "rating": 1}, {"title": "My parents had two policies with this…", "text": "My parents had two policies with this company. The company sent a letter stating the policies had been paid in full. Since both my parents were being paid together they figured everything was fine. Then recently my father wanted to cash in both policies. He finds out that my mom's has been cancelled and a letter had been sent to an address in Los Angeles. They NEVER lived in Los Angeles. I spoke to several different people, Melanie, Tim, a name I did not write down , and Jennie. Tim researched the issue and stated ify parents paid $176.00 they could reinstate the policy and it would be paid in full, since the letter was never sent to them. Tim then said Melanie would call on Monday to tell me where to sent the check etc. Which seemed like the correct and professional way to handle. Well, on Tuesday Jennie called and said it was my father's responsibility to know that the policy needed to be paid. I again explained to her about the letter being sent to incorrect address and policies being together.  She just said she was sorry and and that another letter was sent to the correct address, 20 years later, and nothing was done. I explained to her, the letter did not get to my parents and my father keeps extremely good records. She just ignored this and any responsibility. The policy was only $1600 pay out. I told her it was so unprofessional and karma was a b**\"\". I am reporting them to the BBB and any insurance complaint agency.   My parents are in their 90s and took this policy out in the 1970s. I cannot believe this company would not honor Mom's even though I explained exactly how they made a mistake.  Disgusting.Update: The reply from TruStage were for show. Someone phoned me. She started saying she could not find the account. I explained how the previous individuals found it and how Tim spoke to customer support and they decided it was their mistake, so my parents just had to pay the amount to reinstate the policy. She continued to say she would have to find it and look into it then call me back.  A big run around. That phone call was last week, I have yet received any phone calls. Horrible company service and very bad business. Just another day for them.", "rating": 1}, {"title": "My father passed  away of natural…", "text": "My father passed  away of natural causes April 24. The funeral  home sent all the necessary paperwork  to them approximately April 26th. On May 12th they took their regular  payment out of my fathers account. When I contacted them they said his policy  was still active like he was still alive,that they had no information regarding  his death. I contacted  the funeral  home,they had been paid so the information  obviously  had been sent. The funeral home sent me copies of the paperwork  and I emailed it to trustage. The following  day May 14 I get a call in regards to his paperwork death benefits etc. I explain  all this had been done at the funeral  home and I had mailed it out to service Canada on the 1st of May. I have heard nothing since, it is the 24th of May and I received  nothing. There is money after his funeral  costs. I have emailed  them and I'm ignored. I've been off work (paralyzed)due to my grief and now I have to worry about bills has well. This should  not be taking so long. My father did this to make it easier  for me and it's been a heartbreaking  nightmare.Today is the 27th just spent an hour on the phone with customer service(half hour on hold) got nowhere. I would like to also add I called the funeral  home paperwork  was sent on the 29th of April  and apparently they have not been paid either. Someone  else had led me to believe  they had been paid. They are not impressed  either. Way to go guys!!!Wed June 26Still waiting!! Check was mailed apparently May 29th. Still not here. Got some attention  for my review but not results. Last week I spoke to someone who offered  to void the check which would take approximately 24-48 hours to do then they would deposit it into my account.  This was last Wed in the am so a week later still no deposit. I have sent emails once again  with no response except on Monday which was a automated reply that she was not in the office that day. The check has not shown up either beginning  to think it's just sitting on someone's desk. Still waiting for response on emails sent yesterday.I would also like to add another  issue in regards to their final documentation  service. I did not use this service  my father paid for. I was advised of a refund for that. Sent them the required information on June 5th. Called them the following  Fri to check on status of it. I was told they have received the info and someone was looking into that this very day.Called today to find out what was going on (10 days later) and the person I spoke to said she needed  to verify the information had been received. I told her the last person I talked to had already verified this. She just repeated  herself cause nothing I said mattered. So obviously nothing has been done about this either.Cheryl😠💩For some reason the calender will not go to June but the Date is April24-June 26", "rating": 1}, {"title": "I Do Not Recommend TruStage Financial…", "text": "I Do Not Recommend TruStage Financial Group!! They took my money and Never refunded me back after I cancelled within the 30 day period, they ROBBED me!! Also had very bad experience with customer service people as they were very RUDE & not polite at all...at first they Sweet talk to new customers to get their money, but after they give them BS and don't return the money they took from them. This is the WORST LIFE INSURANCE COMPANY EVER!! I Definitely Do Not Recommend it, becareful with them.", "rating": 1}, {"title": "They will not give u a cancelation…", "text": "They will not give u a cancelation policy, not when u sign up and not after u cancel a policy...however after 2 yrs of putting 1300 dollars into a funeral policy...I cancel it....guess what tru stage kept 800!! Thieves!! Criminals", "rating": 1}, {"title": "It is disgusting that I came on the…", "text": "It is disgusting that I came on the website, & made my payment via a different card, (simply because I DID NOT want the payment to be taken out from a debit card that did not have the funds available) and trustage STILL sent the auto pay through to that debit card 4 days AFTER I had already made the payment on the website, and caused the bank to hit me with a $30 non-sufficient funds fee", "rating": 1}, {"title": "After 10 days so far so bad", "text": "After 10 days so far so bad, canceling, overpriced & lack of customer service if you have shortage on people than allow to do more online not for online issue having you to call when no one is available on the phone at all after 20 minutes wait play with someone else's time and patient surprised you have good reviews that's why I went with you but after personal experience overpriced and under staffed customer service I really checking out if this much nonsense at the beginning how much will be there if when you will have to actually stand up and pay a claim in the future can't imagine don't even want to know after such a hard start, sorry plus you forward applicant's info to an out of state licensed agent who might be real or not without my consent ridiculous the least to jeopardize me I wrote this comment after the third try to call in because could not set up create an online account due to the 2 step identification code which I type in says sorry error call customer service & writing this review exactly after 30 min could have been an hour if i did not hang up waiting for anyone to say a word but total silence when you insist on me calling you instead of pointing out what is the error when all is correct online what's does not match if you get overwhelmed by calls that you can't take, help yourself while helping customer too     ", "rating": 1}, {"title": "Extremely poor service upon canceling", "text": "Extremely poor service upon canceling. Transferred to multiple people, each trying to get us to stay rather than understanding our decision to cancel. Two weeks later and still no refunds. More calls and only excuses why some cancel form has yet to be sent. If no refund in one more week, legal action will be initiated.You asked that we (2of us) log in to contact your dis-service dept. Your website won’t allow our policy type to log in and instead provides a phone to call. VERY poor customer service.", "rating": 1}, {"title": "Essentially a scam", "text": "Essentially a scam that preys on the elderly. These people will delay to the point of torment. Then reject the claim hoping the money isn't worth the fight to you.This company should be shut down. Their executive staff should be charged.", "rating": 1}, {"title": "Opt-Out of Sharing info is a JOKE", "text": "Today I got a mailed letter to me from TruStage that it intentionally sent to make it difficult to opt-out of it sharing MY information with its affiliates and partners. I could fill it out to send it by mail, but of course, they don't include a stamp.  Further, I had to type in the website in order to opt-out, but it CONVENIENTLY left my account numbers off of the paper, so I had to search for each one.  This was done because TruStage wants customers to jump through hoops to opt out.  The joke is on them, now, I am going CANCEL all my policies since this is how they do business.  SHAME ON THEM!", "rating": 1}, {"title": "I'm broke Right now I don't have no income for…", "text": "Right now I don't have no income for life insurance. So there for I can not get it if I don't have any money to pay for it. So I don't need it", "rating": 1}, {"title": "Stop displacing me!", "text": "I do not appreciate messages to my clients indicating they should provide their own service for beneficiaries, explanations of insurance types etc.", "rating": 1}, {"title": "False promises.....", "text": "Arrived at this site from a 'senior's get $250k of life insurance for $15/mo' email! This a part of an email listing benefits for seniors. What a hook. And a lie!$5k will cost about $50/mo. How much do you think $250k will cost!  Please don't call me. I am hard of hearing and only conduct business in writing. There doesn't seem to be a way to email you, so I am sending my message here.", "rating": 1}, {"title": "My grandmother had a policy since 2014", "text": "My grandmother had a policy since 2014. She passed away in February they canceled the policy in January due to her turning 75 in December. They said she would have needed to sign more paperwork but on her birthday and after she was not capable of leaving the house. So whatever she paid to them was just taken from us. They also called me to call them to close out the claim only to tell me I wouldn't get anything. It's already been hard enough dealing with her death to get a slap in the face like that.", "rating": 1}, {"title": "Would give -10", "text": "Would give -10. Misleading add, high price for very low payout.  Rip off.  Stay clearDon't even attempt  to call and harrass me to purchase anything  from you. Your falsely advertising something  you can not back up. DÒ NOT CALL. You've  been warned and informed. If called willbe charged $2500 per call or messaged text or email. Due and payable on request  and payable immediately.", "rating": 1}, {"title": "Garbage service", "text": "Garbage service. Trying to cancel is a pain and they tell me the link to my email to cancel works but it doesn’t. I have been trying to cancel for a month. Either I get disconnected while waiting on a call or the email link to cancel isn’t working. Feels like such a scam for trying to cancel. What a joke on customer service. I pray the paper is mailed so I can get rid of them forever", "rating": 1}, {"title": "Is this a scam", "text": "Is this a scam?  I have never signed an insurance policy with a company called trustage nor do I make any payments to the same. Remove me from your list and cancel the policy you claim to have in my name because I will not be paying for it but I will be reporting you to the BBB.", "rating": 1}, {"title": "Scam", "text": "Scam, charging quarterly premiums for Accidental Death and Dismemberment for two policies for a 98 year old.  She's been trying to cancel these for years with no success.  BS credit union that signed her up does nothing.  Just a major PITA.   Benefit is halved for those over 70, too.  This is just a rip off.", "rating": 1}, {"title": "Algorithm for Funds transfer", "text": "What is the need to send additional INFORMATION TO AN AUTOMATED email sent by TRUSTAGEClearly another FACT is they don't provide care for their customersTruStage is an entity that has shown me it is THE WORST from many others.As a NEW customer, they are to handle everything with care. They failed at it when I found two charges to my bank in one month.Their electronic algorithms for AUTOMATIC PAYMENTS is designed to double dip (REMOVE) funds from the account that has been set up twice.Make sure for those who attempt to use them BE EXTREMELY CAUTIOUS.", "rating": 1}, {"title": "False, Misleading, Predatory advertising !!!", "text": "I got an email reminding me I had bought a policy 1 year ago and it was time review and update.  I have no idea who TruStage is and am certain I never bought a policy from them!!!!", "rating": 1}, {"title": "I'm trying to get out of this but y'all…", "text": "I'm trying to get out of this but y'all keep trying to force me to do something and I want to be left alone I don't need life insurance so I appreciate if y'all just leave me alone I ain't liking this too much all I want to do is leave the site but y'all seeing that you won't let me because I got to be buried when I die just pestering me on me and let me go I don't need to be buried s*** it's the way I feel not feeling too good for this thank you all have a blessed day", "rating": 1}, {"title": "Long time customers shouldn't be treated as so!", "text": "Unfortunately over a decade of on time payments, this is the worst experience i have ever had with a business.  Also, their accessibility for the disabled community is a complete joke, especially legally blind veterans. This was the most insulted experience that i have ever come across.  To the visually impaired and the legally blind community we go through enough on a daily basis and its not right that we have to endure such treatment after being a outstanding customer for so so many years.  Thank you have productive day.", "rating": 1}, {"title": "I cancelled my contract for prepaying…", "text": "I cancelled my contract for prepaying my funeral after 5 days. This was on Feb 5th 2022. I was informed my reimbursement for 1st months payment would be mailed to me in 3/4 weeks. It is now 26 May and I still have not received it. DO NOT deal with this company. They are not interested in customer service, just customer money.I am still pursuing them by emailing them every day for my payment. I am given all kind of excuses, but still no cheque. I have been told it will now be deposited into my bank account by the end of LAST week. I am not giving up. Again.......do NOT DEAL with this company.", "rating": 1}, {"title": "Customer is the worst", "text": "Customer service is the worst", "rating": 1}, {"title": "Save Yourself the Aggravation", "text": "Received numerous calls asking me to set up an appointment. After the first call, we had an appointment and decided that the services were not reasonably priced. Advised the individual we were not interested, yet we continued to receive calls from \"agents\" for 3-4 months. I had to contact my credit union to ask them to ensure I received no more calls. Still received unwanted calls, and threatened to involve my legal council if it did not cease. The amount of frustration this company caused my wife and I was completely unacceptable. Will never conduct business with these unprofessional asshats.", "rating": 1}, {"title": "Horrible criminal Ins company", "text": "Horrible criminal Ins company. Canceled 20 year old life Ins policy. Said they lost payment.  Sent cancellation notice a month after canceling policy. Customer service worst I have ever experienced. The worst customer service reps I have ever dealt with in 50 years. I will review these criminals on any and every site I possibly can. Every week from now on. STAY AWAY.  Kevin Andoe", "rating": 1}, {"title": "Are they out of business?", "text": "I called every number listed for TruStage.  All are disconnected.  Did they go out of business?", "rating": 1}, {"title": "I spoke with a TruStage agent", "text": "I spoke with a TruStage agent, which I found out is not a company but the name of a special division within Liberty Mutual Insurance. They specifically work with Credit Union Members. Speaking with the agent, who told me he was with the company for 18 years, provided me a quote, comparing line by line with my exact coverage through Geico, it would cost me $55 more per month, or $664 per year. This is definitely not the savings of $581 less per year they advertise on their letter from my credit union. I wish you all the best if you go through them and hopefully they can get you a discount they profess or advertise, but they definitely could not help me.", "rating": 1}, {"title": "I wanted to set up a log in account but…", "text": "I wanted to set up a log in account but I don't trust a company that asks for your full social Security number.  Especially when they ask for your certificate number as well. I feel I'm exposing myself with my full social.  If the website is legit, it would ask for my certificate number and just the last 4 digits of my social.  After all, I'm already a policy holder and my social is already on file.", "rating": 1}, {"title": "Every month I have had this policy I…", "text": "Every month I have had this policy I have had to change my password to log in to make a payment. I was going to set up automatic payments, but don't feel I can trust the hosts with a monthly authorization. I honestly would like a refund of all the money I have paid over the past few months.  As a company I have little confidence that you are legitimate, and it is lessening to none as each month goes by and I again have to change my password.", "rating": 1}, {"title": "Tru-Stage advertising is misrepresentative and deceptive in practices", "text": "Tru-Stage advertising is deceiving and misrepresenting. I was quoted $13 monthly payment on advertising which sneakily became $103.00 for $25,000 policy. Completely unacceptable and they will not get a penny in payment after they trickily auto-deducted the first payment.", "rating": 1}, {"title": "My aunt just died", "text": "My aunt just died, she had a life insurance policy through them. They do not want to pay anything. This is terrible. They are trying to contest her death. The policy is only 10,000, we just need some money to Bury her. This is unbelievable. Everyone crying and hurting and they want nothing to do with us to help us. Please do not trust this company.", "rating": 1}, {"title": "took out life insurance on my husband", "text": "took out life insurance on my husband. My husband passed away on May 25 i called them and they told me i will not get any money from them cause it's only accidental coverage they did not tell us that when he sign the paper. they are a joke. left me paying for his funeral. So people don't sign from insurance from them.", "rating": 1}, {"title": "Paid my AD&D they also took out $40.00…", "text": "Paid my AD&D they also took out $40.00 for a life insurance policy that I do not have and have been fighting with them for a month trying to get my money back. My bank even sent them a copy of the withdrawal.... and still can't get my money. Way to treat your customers.", "rating": 1}, {"title": "I ended up canceling my policy due to…", "text": "I ended up canceling my policy due to rates . I originally had a term life policy which I’ve only had for less than a month . I decided to change to whole life because of the future rate increases. The quotes changed drastically just in the few days I’d originally obtained my policy .Update, the number under this reply is not a working number!", "rating": 1}, {"title": "Back in December 2021 received a form…", "text": "Back in December 2021 received a form with the offer of $27.00/month Single person life insurance Coverage amount $300,00. Then they want to charge you $81.00 for 3 months. When the Agreement was $27.00 dollars a months. Not $81.00Be careful !", "rating": 1}, {"title": "Grieving family disrespected", "text": "I called on January13,2022 asked about my mothers policy and was told the amount and I explained my mother was coming home on hospice, my mother passed away January 15,2022, I called back on January 18,2022 and the man said her policy expired in 2020, just how convenient is that so you don’t have to pay out. I am sick to my stomach my heart is broken enough losing my mother and then your company does this to my family. How disrespectful to a family who is grieving.it was a 5000.00 policy only so we were not able to have services for my mom, had her cremated and that was 2500 out of pocket. So very sad", "rating": 1}, {"title": "Complete nonsense", "text": "Complete nonsense. Ad says $250,000 for $15/mo. It’s a SCAM. They guarantee coverage, the cost is as much as $75/mon for $5.000 coverage. Trying to sell while life insurance. Junk. Buy term life if over 45.", "rating": 1}, {"title": "Understand what your getting.", "text": "I made the mistake of cancelling my whole life policy for this insurance thinking my Credit union was bringing me buying power in the market. I was wrong.This is only accidental insurance. So I called and got a quote for whole life. Laughable that it was 4 times what I was paying with another company. Look at the cause of death, accidental is not at the top of any list.This company is misleading in the advertising of what they provide.", "rating": 1}, {"title": "I'm very happy with the service and was…", "text": "I'm very happy with the service and was explained about the whole process. Everyone I have talked to was very helpful they all were professional, and they were very open about the process. Thank you for your great service I'm very glad to work with your company !", "rating": 1}, {"title": "Over priced coverage", "text": "In looking at the pricing, this coverage is WAY over priced. According to Trustage quote, a $100,000 policy for a male my age is $114.50 per month. That premium will GO UP when I hit 55, again at 60, again at 65 and so on. On the open market I can obtain $100,000 where the premium stays level for 20 years for just $46.33 per month. There are many companies that offer life insurance without an insurance exam. Why would I pay 3x the premium with Trustage?", "rating": 1}, {"title": "Having a accident and breaking my leg…", "text": "Having a accident and breaking my leg which ended in a below the knee amputation all I have gotten from TruStage is your claim is in review for months, in the mean time they continue to take policy payments the 3rd of each month they are very timely on this even as only one claim is allowed on the policy so the payments are for nothing! I do not know if this is a real company or a scam so far the only thing real is money out of my bank account.", "rating": 1}, {"title": "If I could have given Zero stars", "text": "If I could have given Zero stars, I would have.  I have both emailed and called TruStage Insurance several times to ask them to correct my mailing/residential address.  Each time I have been told that the address had been corrected....it is still incorrect.  Customer Service is not doing its job.", "rating": 1}, {"title": "I don't trust this company", "text": "I don't trust this company. I had started a Whole Life Ins. Policy in 2019 but called a month ago to request a less expensive policy. I felt confident that the agent I spoke with would take care of this. However, I see on my online banking statement today that TruStage withdrew the same amount that had been in effect with my previous policy. First of all, it should not take an entire month to change my policy. BUT, if it was going to take a month AND I was going to be charged the same amount this month, I should have been told that by the agent I had spoken with.", "rating": 1}, {"title": "this company is a true RIP-OFF!", "text": "this company is a true RIP-OFF!! i had a whole life insurance policy with them, paid on it over a year and was told when i went to surrender it was told i had not cash value.  I was told that once i had the account for two years that i would be able to surrender the cash value of what was put in after two years.  Also,they went up on my monthly payment without notice to me. KEEP YOUR MONEY IN YOUR POCKET AND DO NOT DEAL WITH THESE RIP OFF ARTIST!!!", "rating": 1}, {"title": "Cannot view my policy for a…", "text": "Cannot view my policy on line for a month and I've called several times and emailed to no avail. If tech support could resolve this issue I'd consider revising my review. My funds are not growing much but economy is down right now.", "rating": 1}, {"title": "I hate the insurance company", "text": "I hate the insurance company . During the pandemic this company does not listen to what I said one bit . They did automatic deductions when I said no . Now they are telling me what they are going to do with money accumulated in my policy . I am done with them !", "rating": 1}, {"title": "It is impossible to cancel a TruStage…", "text": "It is impossible to cancel a TruStage AD&D policy.  They blame \"technical issues\" but if you call the number to get a quote, there are no technical issues.  I have been disconnected 6 times.", "rating": 1}, {"title": "My finance was killed in car wreck…", "text": "My finance was killed in car wreck march 2019They are still fighting me on paying his benefit.  Not pleased with them.I cancelled my own policy with them after the run around with my finance policy .I'm sure he's rolling over in his grave about it all.", "rating": 1}, {"title": "My experience with TruStage was very…", "text": "My experience with TruStage was very pleasant. I received the information in the mail. The application explains in details the process for enrollment. My application was processed in a short period of time. I appreciate the service from TruStage.Mrs.Walters", "rating": 1}, {"title": "Absolute Rip-Off", "text": "Absolute Rip-Off.  My \"Offer\" for a 25K policy which would increase in premium every 5 yrs for a 60yr Old Healthy male was $819 a year.  I did a simple check with one of the largest mutually owned life insurance companies and although they couldn't help me with a 25K policy, however for a 100K 25yr Level Premium Term, the cost was $1300 a year.  For about 37% premium cost increase, I my beneficiary would receive 4x the death benefit.  Do your research, I am more than upset my Credit Union would allow this to be sent out to their customers.  Will be moving my banking services now.", "rating": 1}, {"title": "Trustage I rate 6stars provide excellent service I was able to understand", "text": "Helped me make decision I've been delaying too long when I'm gone. Now I've have trustage I know I won't be leaving my children's with burdens of my debts nor cost laying me to rest according to my wishes for now I've join Trustage. Thank You", "rating": 1}, {"title": "Disappointed no member discount higher rates", "text": "I received a letter in the mail from my credit union for Trustage and could possibly save $500 on auto insurance.  So I got a quote and it was $70 a month higher than my current policy and has a higher deductible. Was very disappointed", "rating": 1}, {"title": "Refund taking 14 days too received them", "text": "I don't understand why it takes 14 days for me  to receive my refund when they get their money for payments ASAP the cost is too high for me on a fixed income, because of the covid pandemic price of everything has gone up I wasn't even able to buy groceries this month update they accelerated the refund , it's been 14 days  no refund what gotta wait 7 more? As long as that money is attached  to you you getting the interest? An if you do that to 1 million people  that a lot of interest , I don't believe your company  has felt the full impact of being Disabled  on a fixed income   paying  $4 gallon gas to drive 100 miles round trip to buy food no not all of us have felt the hardships some are still feeling", "rating": 1}, {"title": "This life insurance is not for me I…", "text": "This life insurance is not for me I mostly don't trust any of these companies", "rating": 1}, {"title": "My dad had an insurance policy he…", "text": "My dad had an insurance policy he believed was a life insurance policy to the point he cancelled all other policies he had. He signed up for this policy at the age of 54. My dad passed away and we found out the policy he was sold and led to believe was a life insurance policy was actually an ad&d policy. Therefore they won't pay anything. Now why would a 54 year old buy an ad&d policy when he was on disability. The need for such policy is ridiculous and even more so that he was led to believe it was an actual life insurance policy. Trying to get a hold of someone to discuss any problems with this company is a joke. You can't speak to any supervisor or manager.", "rating": 1}, {"title": "My experience over all has been awful…dump", "text": "My experience over all has been awful and I’m so glad I’m not with this company all they do lie. They strictly stereotype you while and answer question I’m so sick of people like this and completely disappointed", "rating": 1}, {"title": "Baited me into polices", "text": "Baited me into insurance policy. Was denied any additional , other insurance coverage I was asking for. No reason was given over the phone. I'm out of luck.  Not happy with credit union giving out this information and lead .", "rating": 1}, {"title": "They never reply.", "text": "Date of experience: April 01, 2024", "rating": 1}, {"title": "everything went wonderful", "text": "Date of experience: October 30, 2023", "rating": 1}, {"title": "Face value of policy vs premiums", "text": "Almost 6 years ago my Credit Union offered a trustage policy of various amounts to basically cover end of life expenses.  Since I already had a life insurance policy for many years, I opted to buy a small policy to cover small end of life expenses. $2000 policy.  As of now I have paid in slightly over the $2000 face value. From now on all of the premiums that I pay are just lost to me. They gain no insurance benefits at all.  Now it is probably my fault for not realizing that I would pay off the face value and lose the forthcoming paid premiums.  I strongly suggest that you along with someone else review the policy to determine if it is the right one and what would happen once you reach the face value of the policy. I have called trustage and they confirm what I am saying here. The cash surrender value is basically 20% of the premiums already paid.", "rating": 1}, {"title": "I don't have anything negative to say…", "text": "I don't have anything negative to say about TruStage. I have not been a member long enough to say negative about this company", "rating": 1}, {"title": "I do not recognize this company!!!!", "text": "Date of experience: December 01, 2022", "rating": 1}, {"title": "Excellent", "text": "The customer service Representative was very understanding, patient, had the ability to break things down and explain the policy to the best of her ability.", "rating": 1}, {"title": "THIS STORY BEGINS OCTOBER 16TH 2016", "text": "THIS STORY BEGINS OCTOBER 16TH 2016, WHEN AN AGENT FROM TRU-STAGE CONTACTED ME AND ASKED ME TO SWITCH TO A WHOLE LIFE POLICY. TELLING ME THAT POLICY BUILDS CASH VALUE. SO I SWITCHED. HERE IT IS 6 YEARS LATER I CALL THE COMPANY AND ASKED HOW MUCH IS IN THE CASH VALUE. SO I SAID GO AHEAD AND SEND ME MY MONEY. THEY TOLD ME IT WAS A LOAN THAT I WOULD HAVE TO PAY IT BACK AT 8%.. I SAID TO THE WOMAN HAVE YOU LOST YOUR MINE . I WAS TOLD THAT THE CASH VALUE MONEY WAS MINE AT ANYTIME. SO ALL OF YOUR CASH VALUE MONEY WILL BE KEEP BY TRU-STAGE AFTER YOU DIE. YOUR POLICY IS ONLY WORTH WHAT ITS WORTH PERIOD !!!!!!!!!!!!!!! THEY ARE STEALING MONEY FROM \"ALL THEIR CUSTOMERS\"...I WILL REPORT THEM TO THE \"BBB\" I HOPE  YOU UNDERSTAND PEOPLE HOW THIS WORKS YOU PAY ALL THESE PAYMENTS OVER ALL THESE YEARS AND YOUR POLICY IS JUST LIKE A TERM POLICY ...CASH VALUE \"THEY ARE F  CKING LIERS AND THEAVES !!!!!!!!!!!!!!!!!! GOOD LUCK CUSTOMERS", "rating": 1}, {"title": "Nothing but unwanted mail spam from…", "text": "Nothing but unwanted mail spam from these people.Go away predators! You want me to opt out of something I never opted into, you have it backwards.", "rating": 1}, {"title": "I asked to be billed and TruStage went…", "text": "I asked to be billed and TruStage went into my account and deducted my payment.  NOT a good Idea. Why ask choice of billing if you will take it anyway?????", "rating": 1}, {"title": "Get live people to answer calls", "text": "Date of experience: June 12, 2023", "rating": 1}, {"title": "The reps are not very knowledgeable in…", "text": "The reps are not very knowledgeable in their job description and will make you go unemployed if you have a job. No common sense and very discourteous", "rating": 1}, {"title": "I have been looking for whole life…", "text": "I have been looking for whole life insurance at my age all but trustage were very expensive and had limits that were not customer friendly.", "rating": 1}, {"title": "Never knew my policy was cancelled…", "text": "Never knew my policy was cancelled after 4 months it was on autopay and they NEVER contacted me to let me know of ANYTHING!!!!", "rating": 1}, {"title": "Worst customer service ever", "text": "Date of experience: May 31, 2023", "rating": 1}, {"title": "Life insurance", "text": "Funny how they create fake reviews to hide the negative reviews of trying to cancel a policy with them", "rating": 1}, {"title": "Poor for experience too many questions about my health made me nervous I wanted out of the survey and could not get out of it no part of it", "text": "I was not impressed too many health questions personal information given out I do not appreciate this", "rating": 1}, {"title": "Mystery", "text": "Got an e-mail out of the blue from them with no information what it is about, why I got it.", "rating": 1}, {"title": "So glad.......", "text": "So glad my credit union sold my info to this company. Just pulled all my accounts and went to wells fargo.", "rating": 1}, {"title": "Everything was great the coverage…", "text": "Everything was great the coverage amount is very good and I like the option to pay monthly or quarterly", "rating": 1}, {"title": "Trustage means everything to me at my…", "text": "Trustage means everything to me at my age there's nothing like being cover for life. Thank you", "rating": 1}, {"title": "Not what I thought", "text": "The rep I spoke with was very lovely, smypathic to my situation and needs.  However, things began to speed up and I became confused.  I now feel I was taken advantage of and am regretting my decision.  Had I not been fooled into purchasing, what I thought was the final expense coverage, then forced to purchase another funeral coverage policy (that is insufficient and because of my health and answers to your questions has me paying way too much than I wanted too), has put me into this panicky must find new solution and get outta the Trustage policy fast as I can before the funds in my account are drained mode. Although the rep was pleasant, her procedure to verify my current coverage and then go into the pressure tactic style sales mode, I feel, has me regretting trying to find coverage for my final expense.  I believed I had found a decent company, who is partnered with my bank (who I've been with over 30yrs), put me at ease with leaving my beneficiary with nothing to worry about when in reality not only if something were to happen to me today, I wouldn't be covered, the money I've already put into it is gone, my beneficiary would be lost and on the hook for everything.  And you'd be getting hassled with calls from my beneficiary trying to get answers about this coverage.  😕", "rating": 1}, {"title": "Not recommended.", "text": "I have been a policy holder for 7 1/2 years. I have asked on 4 occasions for a copy of my policy as the only one I have is from 2013. They send me copies of bills...  they send me partial copies of my policy.  But I have not been successful in getting a complete copy of my policy. I pay my premium and have for 7 1/2 years but they cant send me 1 complete copy of my policy? Calls, waiting on hold for hours over the last year and still they cant manage one very simple request. A copy of my policy that I own, I pay for and that I am entitled to receive on request. Which I have repeatedly done. After calling again, that was call number 5 last week (8/25/2020) they sent me an application to get a policy, NOT a copy of my existing policy. I have to wonder if it's a total lack of competency or if they are intentionally withholding it so I cant give a copy to my attorney in case I pass. I do know that after too many calls and 2 emails I have not been given a copy of my policy. I would not recommend them to do anything but take your money. Shame on Connections credit union for supporting an unscrupulous company that just takes its members money without giving policy info to its holder. Shame on trulife for taking my money and my husbands money for years and refusing (by action or lack of) to send a complete copy of a policy. You are complete turds.", "rating": 1}, {"title": "No thanks", "text": "No thanksDon't know if I should go with the new one", "rating": 1}, {"title": "Hard to deal or talk with", "text": "Date of experience: February 05, 2024", "rating": 1}, {"title": "run to another company this one SUCKS  …", "text": "run to another company this one SUCKS   the percentages are way off!!!!", "rating": 1}, {"title": "Would give a zero..", "text": "Would give a zero..Keeps telling me that my zip code doesn’t exist.", "rating": 1}, {"title": "Read what I wrote today that was sent…", "text": "Read what I wrote today that was sent in the mail today!", "rating": 1}, {"title": "policy drops dramatically after so many…", "text": "policy drops dramatically after so many years. Terrible policy!", "rating": 1}, {"title": "I like the 20.000.00 life policy better", "text": "I like the whole life policy better not that expense.", "rating": 1}, {"title": "Great prices", "text": "Great prices, great coverage and everything was easy to understand.", "rating": 1}, {"title": "It’s a scam they give you a fake price…", "text": "It’s a scam they give you a fake price to get your info", "rating": 1}, {"title": "I will call you when I can to talk to you about the insurance when I can get some …", "text": "I will call you when I canto talk to you about it", "rating": 1}, {"title": "DO NOT TRUST THIS COMPANY,SCAM", "text": "Date of experience: August 31, 2022", "rating": 1}, {"title": "I was very satisfied with the rep that…", "text": "I was very satisfied with the rep that took my application.", "rating": 1}, {"title": "Done deal with what ever we doing", "text": "Date of experience: August 01, 2022", "rating": 1}, {"title": "Finished the questionnaire what's up", "text": "Date of experience: May 02, 2022", "rating": 1}, {"title": "Premium increased 56%", "text": "I already called and there was no option offered!", "rating": 1}, {"title": "Did not effectively meet clearly communicated needs. Poor customer service", "text": "Poor customer service. Would never recommend", "rating": 1}, {"title": "I did not receive a quote as promised", "text": "Date of experience: August 26, 2021", "rating": 1}, {"title": "Wish I knew what this is?", "text": "Date of experience: October 01, 2021", "rating": 1}, {"title": "It's ok for me right now.", "text": "Date of experience: August 16, 2019", "rating": 1}, {"title": "We’re is my money", "text": "Date of experience: April 14, 2022", "rating": 1}]