[{"title": "Terrible!", "text": "Terrible!! I applied for a Heloc and was asked to provide proof of my homeowners insurance. I then purchased Homeowners insurance. It was accepted. A few months later I noticed my paymen increased with no explanation. I called multiple times, no one could give me an answer. Finally after demanding to speak with a supervisor I was told I was being charged for lenders insurance because I did not show proof of homeowners insurance. I forwarded the emails to them, which acknowledged receipt and approval of my homeowners insurance. My payment still dud not go down. I called again and again. The 5th time a rep told me that apparently my homeowners insurance was not sufficient and that I needed to show proof of my HOA insurance. ( I had Never received any form of communication from Figure about this). I then provided proof of my HOA insurance. I sent it in twice just to cover myself. My payment has still not gone down. I have filed a complaint  with the BBB and Figure has not responded. In my opinion, this company will be going out of business. TERRIBLE- Terrible- No communication..horrible customer service and shady!! Huge regrets!", "rating": 1}, {"title": "Your automated system Sucks1", "text": "I applied in August but my income verification took too long and I was rejected.  The Feds dropped interest rates twice and I applied again.  I was approved but my rate went up.  When I called to ask why the rep said she didn't know it's all automated.  What the system says...is!  Every time I call I get a new person that has to re-learn my case and some are good and some aren't. Your automated system sucks.  I also said I wanted to join your CU and have autopay for 0.5% reduction and didn't get it...", "rating": 1}, {"title": "NEVER IN MY LIFE!", "text": "I spent time submitting an online application for a home equity loan on a home with no mortgage that I've owned since 2001. All the data was inputted correctly and accepted.I received an email notice that my application was paused because the property address couldn't be located and to call their support number which I did.I was told that their system didn't recognize the property address (even though it auto-filled in the dropdown menu on the application screen) and that they would be unable to proceed with the application. Not believing this could possibly be true, I asked to have someone higher up call me. Only to have them call me to tell me the same thing that their system operates with a third-party software service and it couldn't locate the address and therefore I cannot apply for a loan with them.I am so incredulous that this home that I own free and clear, that I am the original and only owner of is ineligible because of a software glitch in their system, and that they are so robotic and inhuman to not be able to have the address accepted.I currently own four homes and have successfully bought and refinanced many properties over the past 30 years.NEVER IN MY LIFE have I been treated as horribly as I was by Figure.", "rating": 1}, {"title": "SCAM", "text": "This company is typing it's own reviews!!!!  DO NOT use this company.  They did a hard inquiry.  All of the paperwork.  We were ONLY waiting to sign documents via the e-notary.  Then, we receive an email stating that there is a typo on the Social Security number.  IMPOSSIBLE.  They pulled credit reports, pulled the equity report, deed, etc using the SAME social security number.  Two weeks since this process started and today I get - your application has been cancelled due to a typo on the social security number.  They can't even tell me WHO made the typo or when it was made.  Oh,  while this process is happening, you will deal with multiple reps, send emails over and over because the reps do not communicate with each other nor do they update info that you send.  Sent photos of my husbands social secuirty card TWICE only to still get there is a typo.  Nothing but a complete waste of time the last two weeks.  ", "rating": 1}, {"title": "So very Slow!", "text": "Applied and got approved very quickly – then was notified by email loan was waiting on title review.  It has now been 24 days and still waiting on title review.   When I asked for an update was initially told that Texas had a 12-day cooling off period that was the delay.   After the 12 days cooling off period expired, I was told waiting on the title review which would take 5 days.  Obviously, it has been past 5 days, yet the same the answer I get every time on an expected ETA is “title typically takes 5 days”.    No one will give me an ETA or tell me if there is a problem, I feel like I should apply for the HELOC someplace else but am hesitant to start the process all over again.  Feels like the HELOC with Figure is a not go.", "rating": 1}, {"title": "Garbage", "text": "Garbage. They hit all the tech company buzzwords like \"blockchain\", but somehow come out with a neutered system that still takes forever. It can't recognize simple things, like drivers licenses, and somehow they don't notify you that something's wrong for 4+ business days. Not sure if they'll get us approved or not, it's been about a month at this point, but I know I'll never use them again even if they do approve. ", "rating": 1}, {"title": "Very stressful experience considering having multiple options", "text": "I had already received my disbursement and then the agent calls me 3 days later to tell me there was an issue with my drivers license. I sent them multiple passport pictures and they kept telling me the software could not ready my picture. If wasn't until I asked for a manager was my issues resolved. The entire process was extremely stressful for me, considering i turned down multiple lenders to go with figure. I was almost at the point of returning the disbursement and going with another lender. Considering my credit history and financial security, I had so many options to be put through the amount of stress I went through. Based on this experience I don't think I will consider using Figure in the future.", "rating": 1}, {"title": "If you live in the state of Texas and…", "text": "If you live in the state of Texas and have a mortgage, you may want to skip this bank.  My application was put on hold because I was told I had a \"vendor lien\" on my home, which was a big surprise.  I called Figure several times about what details they could tell me about the vendor lien.  The first several people that I talked to there acted like I was asking for top secret information and would only give me the basics, it was a vendor lien, something regarding a warranty and something else vague.  I researched this on my county website and even called the county clerk and they didn't know of any vendor lien on the house.  I finally got frustrated and contacted a title attorney and she looked it up.  Apparently my current mortgage showed up as a vendor lien and was something that was normal in the State of Texas.  She sent me a copy of it and you could clearly see that it was for my mortgage.  Armed with this information, I went back to Figure and because no one had any sense there, they said the only way they can process the application further is if I pay off my mortgage.  Say what?  I even escalated and the escalation person read from a script and would not budge, even after clearly explaining this is for my current mortgage.  I hung up pissed.  The blessing in disguise is that I had to go elsewhere and got a much better rate with much lower up front costs.  I hated that I wasted an entire morning with a wild goose chase, but it worked out in the end.  For me.  Figure, keep your money, losers", "rating": 1}, {"title": "I got the loan and the company provided…", "text": "I got the loan and the company provided wrong information about the disbursement of the loan and ended up paying other loan with similar fees and interest rate. They need to work more with the information they provide from the beginning. ", "rating": 1}, {"title": "Very Misleading...", "text": "Very Misleading. Having been pre-approved for their offer, we started the process. However, their automated system doesn't allow for multiple paycheck stubs from different income sources and cannot handle more than one bank account verification (so if you automatically put $$ into a savings and checking account, it can't process both realities). So because they couldn't verify $11k, they offered a loan that was 47% less. What a waste of time.", "rating": 1}, {"title": "WORST LENDER, DONT FALL IN A TRAP", "text": "Worst Option to go for any loan or any service from figure. Their customer service reps don't have NMLS ID and will make you fall in a trap of High Interest Rates and you will end up with High Income Debt Ratio. When you will call them their customer service reps will just say one thing that they can not modify anything,  everything is done by automated system which is built with technical issues and is crap.", "rating": 1}, {"title": "They double charged my monthly payment…", "text": "They double charged my monthly payment of almost $1200 and told me theres nothing they can do to return my money. When you live pay check to pay check and being the only income earner in the house hold to support a family with small children something like means not being able to buy groceries and basic necessities to stay afloat. This has been the worst customer service in my personal opinion. Stay away if you can.", "rating": 1}, {"title": "Borderline Fraud", "text": "Avoid their equity services like the plague. Have worked with numerous platforms and investment banks but none have overtly lied while cutting 20% of their staff during the listing process.Read the Bloomberg article \"Mike Cagney’s Figure Lays Off 20% of Staff Amid IPO Plans\" to see why.", "rating": 1}, {"title": "Company will cheat you", "text": "I asked not to have the loan deposited by email as required by the contract within the specified period. I wanted to know if I qualified, but haven’t found the right home. They deposited anyway 3 days later, charging a daily interest fee plus 2% origination fee, and when I tried to wire it back, I received a notice that I couldn’t return it because my account wasn’t set up.Can you spell con job?", "rating": 1}, {"title": "These guys are a joke!!", "text": "These guys are a joke!!! I applied, and they denied my application because they valued my house based on what I bought nearly two years ago in palm beach, Florida. Think about that for a second, and they’re stating my house didn’t increase even a single dollar in value since I bought it during a time when inflation is rampant??!!! Their marketing is pure manipulative!! I got my HELOC with another lender that got me prime plus one, and they were trying to charge me nearly 8%!! Someone with top-tier credit, and income. Go Figure!!!!!!", "rating": 1}, {"title": "Don't Engage with Them", "text": "I couldn't tell you anything about this company, other than that in order to be shown a quote, they want my entire contact information so that they can then begin the process of bothering me for ages. Don't waste the 15 minutes that I did, don't engage. Even the review started more engagement. Again, run do not walk away from doing business with them.", "rating": 1}, {"title": "Don't waste your 5 minutes - impossible to qualify even with 779 clean credit", "text": "I agree with people who say these guys are just gathering our personal info to share with their affiliates. I put in my app. They said I didn’t qualify... reason?Experian credit score and delinquent accounts??? I'm looking at my Experian report on Experian right now. My score is 779, no delinquent accounts. On a side note I'm only using 8% of my available credit.So if you have a credit score of 779 and no delinquent accounts you WON'T qualify for a Figure HELOC. It's unclear what you need to qualify. 850 score with zero revolving credit debt? Or maybe low score so you'd accept a lousy interest rate? Anyway, don't waste your time.", "rating": 1}, {"title": "Where do I being jumped thru hoops to…", "text": "Where do I being jumped thru hoops to get my income verified link bank account didn’t work link irs didn’t work finally I was told pay stubs are ok. Uploaded pay stubs income verified Moved to next stage, figure called me to verify it was me that requested the loan and I was verified. I got message my loan was approved log into you account sign some paperwork choose your bank for the deposit. Great thought everything went successfully Hour later got email that I was declined because can’t verify my identity, figure can’t do anything about it or tell you what’s the issue Called Experian to see if there are any discrepancies nothing. Figure can’t help or assist while they are the lender. Very disappointed", "rating": 1}, {"title": "On the reply to my loan app", "text": "On the estimate for my loan app, which I didn't know constituted an official app, Figure.com loans returned a report on my status that made false statements about my credit. Predatory lender in rough time should get zero stars.", "rating": 1}, {"title": "Caveat emptor - Borrower beware", "text": "Seems bogus.They tease with great rates and a loan up to 400K, then hit you with the bait & switch (higher rates, lower loan amount plus origination fee).I am an A+ borrower and won't do business with them. There are many other solid HELOC lenders out there (like Chartway, Bethpage, Pen Fed, First Citizens, Flagstar, etc.).", "rating": 1}, {"title": "If u need money this place will give it…", "text": "If u need money this place will give it to you at the cost of an arm or a leg? I got an outstanding 20% interest which unfortunately I had to accept as my credit isn’t the best, due to school loans, falling behind on payments and just  surviving as a human on this planet designed to hold us back! I hope to pay this loan of asap because they are charging me almost 10k dollars interest on a 20k dollar loan I used for a vehicle", "rating": 1}, {"title": "The funding continues to be delayed…", "text": "The funding continues to be delayed despite my being told it had funded and the problem was with my bank. Chat function closes out. Phone calls didn’t produce answers. Emails contracted each other as did customer service representatives. Process and timing was not as promised", "rating": 1}, {"title": "Figure failure ", "text": "I was approved for a HELOC by The Loan Store who sold the loan to Figure. After the mandatory 3-day waiting period, payment to my cash management account was initiated on August 13th. The next day they called me to say it had failed and they needed a voided check and a statement emailed to them. I sent these over immediately. That was 8 days ago. It took them 48 hours to re-initiate the deposit. On the 19th they told me it would take 1-3 days. On the 21st they told me it would take 2-4 days. On the 22nd they told me it would take 3-5 days. I'm sick of them moving the goalposts. It took 24 hours for them to say it failed. What's the holdup? They should have wired the funds instead of using ACH. Now I have to wait until next Monday to get the next excuse. Zero stars. Do not recommend.", "rating": 1}, {"title": "Almost impossible to Qualify", "text": "They will reject you if you basically have any debt (the whole purpose of why I was applying to this loan) EVEN if you have an impeccable credit score (and I have over a million dollars in equity in my home). They keep saying my income is too burdened by debt. First of call my DTI ratio should qualify for this, and the debt I DO have would immediately be taken care of by this loan. I am not sure who ever qualifies for these loans other than people who really don't need them. Very scammy and misleading!", "rating": 1}, {"title": "Feels like a scam, getting jerked around. Have impeccable credit.", "text": "They don’t have a traditional application to fill out. Have to wait days and days for them to get back to you to ask for the next piece of information. They want your login to verify tax records. You’re forced into taking 100% of a HELOC upfront which defeats the purpose of a HELOC, except I was just planning to pay it back and then borrow as needed. They have no flexibility to do anything, everything is “automated system”", "rating": 1}, {"title": "Totally automated, So sorry", "text": "We applied and were told that our property was ineligible. This has to do with my profession and how it is listed through the county. So according to Bill at customer service. Their system is entirely automated and the there is nothing they could do to help us. Not because there was an issue with our credit or income.  Bill confirmed  that this had occurred before and was a known issue, yet they were unwilling to try to find a solution.", "rating": 1}, {"title": "HORRIBLE online process", "text": "HORRIBLE online process, issues verifying ID, want you to \"link\" your financial institutions & IRS accounts to verify income. Too much like an online SCAMMER to be a true lender. They used very old out dated information from Experian on a closed loan over 10 years old. CoreLogic is a horrible valuation company. Their data is so outdated it's unreal. 3 different people have been on the \"chat\" feature. Which makes it feel even more like a SCAM. The inability to manually upload documentation is another red flag. I won't use this company and I advise others to be very careful with their information.", "rating": 1}, {"title": "This company has horrible customer…", "text": "This company has horrible customer service! I've had nothing but problems every time I call or email.  I tried updating my payment account information with them and I had multiple issues.  It was such a simple task and they turned it into a huge hassle.", "rating": 1}, {"title": "This company was mediocre at best but…", "text": "This company was mediocre at best but then I had a house fire and had to give them control of four times the amount of money I owed them. Long story short I paid them off and I am still having issues getting my insurance claim money that they have had for more than a year! They are greedy petty and unprofessional ", "rating": 1}, {"title": "Don't know what went wrong", "text": "Don't know what went wrong, but after filling out the information online, the reply was sorry not able to help you. Basically that was the message. I was only trying to get a rate. As was prompted from the beginning that I just fill out my information and get my rate. But nothing. ", "rating": 1}, {"title": "After applying for a HELOC", "text": "After applying for a HELOC, being denied with a 812 credit score, being told later there was a \"glitche\", to apply again, 6 requests to have my personal data purged from their databases and any source that stores information, was denied. This company is a data collector and unless you live in CA you have no recourse. Other states need to adopt the CCPA. Awful experience! 😡", "rating": 1}, {"title": "They do not have a clear cut way to…", "text": "They do not have a clear cut way to repayment, any extra payment they take in fees and interest! The payment that my sister pays is interest only with no way to make any payments to principle!", "rating": 1}, {"title": "The HELOC Will Lower Your Credit Score", "text": "They report your HELOC to the Credit Bureaus like it's a revolving, unsecured credit card, so your credit usage will be 100% of a large amount of money when you take out the HELOC. Get ready to watch your credit score plunge. It's not unsecured, it's backed by the equity in your home. They will never give you anything but a canned answer when you contact them. I made a mistake choosing this company. It will not happen again.EDIT: Notice the completely \"canned\" premade answer they gave below. This is absolutely typical of this company and you will never receive an answer that is any different from this.", "rating": 1}, {"title": "Absolutely a scam", "text": "Absolutely a scam - approved me and then told me I needed to resubmit my application to correct the disbursement account. This seemed like a waste of everyone's time and resources, but I did it. I spoke with the agent about cancelling and then resubmitted ALL WITHIN TEN MINUTES and they then denied me. I am pretty sure they just stole all my personal information and then had me cancel my application so they did not have to fund. DO NOT WORK WITH THESE PEOPLE!!! They also do not have dedicated agents so you are just talking to some random customer service person each time.", "rating": 1}, {"title": "Horrible security", "text": "I recently applied, but as I'm in the computer security business, I took a critical look at their security. It's bad, and I suspect based on 1990 threat actors.We I called them about this, the lady said that they have to comply with HIPPA regulations and the company is based in Nevada. HIPPA applies to medical information and the companyh is in South Carolina.Go Figure!I withdrew my application.", "rating": 1}, {"title": "Figure has ridiculous internal payment…", "text": "Figure has ridiculous internal payment \"policies\"I have never had so much trouble with a company setting up Autopay.  I would avoid them at all costs.  If they're going to fight about getting paid, what else is going to go wrong over the course of a decade?EDIT:  I have NEVER had an account rejected when I signed up for Autopay from any lender, ever.   They do a $0 debit \"test\" and then approve it.    Clearly, this \"FinTech\" can't handle basic account verification without getting all my account numbers and balances, birth dates, etc of my BROKERAGE accounts.I think this *might* be a restraint of trade.  I will be discussing this with someone familiar with such issues in the near future.", "rating": 1}, {"title": "I'm A Realtor for 30 years", "text": "I'm A Realtor for 30 years, and got loans with Figure already 2 times with no problems, and recommended them to friends and family. I have been trying to apply with them again for a 3rd time and its been a complete nightmare from the very beginning, even with a credit score of 800 and No debts its been a month a half, and I still haven't been able to get qualify. Most of the Customer associates you talk to sounded like they Couldn't Care Less. Never experience anything like this in my entire life.  I just can't believe this is happening.", "rating": 1}, {"title": "I had to apply multiple times and guess…", "text": "I had to apply multiple times and guess what address that their automated system would accept. It could never locate my property and customer service said there was no way to override it. What a waste of time to deal with this joke of a company. Another company will get my business.", "rating": 1}, {"title": "Horrible, Deceptive and Predatory Bank. Teachers should be ashamed!", "text": "Horrible bank and very deceptive! The only positive is speed. Borderline Predatory in how they rush things along at closing.Getting a replacement loan right now. They said one thing and then changed it in the paperwork. They do remote closing soThey don’t know the paperwork. Deceptive Deceptive… DO NOT USE!!!Update to Figure Response:The reply from the company proves my point. Yes, once you sign it you’re screwed and locked in. The remote closing though rushes you along and if you have questions they threaten to cancel the signing. The paperwork is not straightforward. Again Deceptive and Predatory please for the love of God don’t use these people!!!!Anybody would be better than these people!", "rating": 1}, {"title": "Impossible online website access after you’re hooked!  Run away!!", "text": "This is the worst company if you need to get in touch with a human!  They only sign you up in auto pay then you can’t access your account to track what you owe or pay the loan off Walt.  Do not wast your time and energy on an application!!  It’s impossible to access a viable website to review your account and loan online.  They make it as hard as possible for you to pay your loan off early so they can generate fees and interest!", "rating": 1}, {"title": "These jerks pulled my HELOC loan right…", "text": "These jerks pulled my HELOC loan right after I was approved because the Hurricane Ian. To make matters worse, they included everyone whose loan application was affected on the email traffic compromising our personal data. Never again….", "rating": 1}, {"title": "My Fico score is 835", "text": "My Fico score is 835.  I am 79, .... been there and done that with real estate loans.  I was shopping and checking for an equity loan with Figure Lending LLC's Pre- approved marketing.  (Bankrate and Renofi are co-operators.)  I found (Loan-To-Value) is low, and APR high.  While I was non-committal to get such a loan, the agent threatened to report an Adverse Action as Unqualified, if I do not proceed with the loan. Within a week such a notice was posted on-line.  Is this high pressure, lending by intimidation under duress, elderly abuse, age discriminating, or something else unscrupulous? My Congressional representative has resulted in an inquiry by Consumer Financial Protection Bureau (CFPB.)  Despite the denial, as a minimum, corporate goals need to be set to train staff to avoid consumers feeling high pressure and threats.  Be careful if you are just shopping. Ignore the marketing finesse. In my experience, I can testify they don't like to take a No for an answer.  Try it and beware.", "rating": 1}, {"title": "Be careful using this company", "text": "The whole experience with this company has been awful.  From the initial application, the funding, their website, making payments, to making additional draws.  They say your funds will process in 3 to 5 business days.  I requested a funds transfer on June 1 and on June 7 I got an email saying it’s in process and will take 2 to 3 business days.  That’s after I called them on June 7th.  They try to be automated but none of the automation works.  I recommend you follow up with every single request with this company.  Everything seems to fall through the cracks.  Not a single transaction has gone through as expected, you have to stay on top of them.", "rating": 1}, {"title": "cannot log into figure 4 account", "text": "changed number now cannot log into account sent emails, called etc not helpful will likely deal with a local lender next time dont get a loan from these people", "rating": 1}, {"title": "STAY AWAY!", "text": "This company is a fraud!  I have all the info and yet at the last second, their 3rd party they use to get assets are NOT connected to TD Ameritrade as it says it is.  I was denied because TD Ameritrade dumped this 3rd party and thus could not submit my assets!  Horrible experience at the last moment!!  BEWARE!!!I still can’t believe how they do business with a 3rd party not connected to major investment companies?  And now I get the short end because Figure can’t do it.  Not my fault. Now they have all my info.PS:  their reply is not customer oriented. Be sure your financial institution is linked to them before going after a loan.  No way around their limited list of financial institutions.", "rating": 1}, {"title": "Does not follow through", "text": "I expected more since CreditKarma recommended Figure but they promised a $200 Amazon gift card for signing up but it's been over a month and no gift card, and their excuse is the web site is down and we're working on it. So either they have the worst IT development team or this was all BS and they hope I forget.", "rating": 1}, {"title": "I have been shopping for a HELOC with…", "text": "I have been shopping for a HELOC with several lenders who have all extended offers to me.  This one was a total waste of time.  Called first to get terms and required credit score.  The information I was given was completely inaccurate.  Claimed I have adverse info on my credit report, but never could provide what that adverse information was.  The rep said it would be uploaded to my dash board and it never was.  I pulled the credit report myself prior to applying and nothing adverse is on it.  This company uses \"Bait and Switch\" practices as well as providing misleading information.  They do not use accurate property values either.  Glad I found out before doing business with this company.", "rating": 1}, {"title": "If bonus is a part of your income, you CAN’T use it", "text": "Fast processing which means the company is messing up their reputation and ruining the customer service. I submitted a paystub and got approved within 24 hours, then I received a second email next day, saying they had issues with my “old” application and asking me to apply a new one without explanation. So I called, the representative told me they cannot approve with any bonuses income. What a joke? They discriminate people making bonuses? I’ve never heard anything like that before with my 10+ years lending experience, and YES, I am a lending officer as well.", "rating": 1}, {"title": "They claim they make the process quick", "text": "They claim they make the process quick, but they did it by getting everything wrong. They had the wrong mortgage company, missed the bathroom remodel and the solar panels and valued my house $50,000 less than my current appraisal.", "rating": 1}, {"title": "Denied w/ credit score of 844 and $600K equity…", "text": "I have a credit score of 844 and $600K equity in my house. Yet, I got denied by Figure. So, I guess if your data is lower than that, don't bother? Shrug. They said I didn't have enough equity and they had used my credit score to determine this decision. According to both my lender Freddie Mac, my county tax appraiser, who I talked to at length while trying unsuccessfully to get the value of my house lowered for tax purposes. Zillow, Redfin, and every other estimation service under the sun also give my house a value that comes out to me having ~$600k equity. Figure has  a wonky algo and no human underwriters. Well, their customer service was fast to send me a polite canned response. But what a waste of having my credit score pull!! I give this experience an F.", "rating": 1}, {"title": "I am previous customer who returned to…", "text": "I am previous customer who returned to Figure for a HELOC loan. They had approved the loan on Thursday and scheduled a notary signoff for today (3rd Jan 2023 @ 845 pm). While I was out of a trip they canceled the approval without providing any information. When called their manager - Daniel who i spoke with was VERY UNHELPFUL. The only message, Danie, kept repeating like a broken record was he does not have a way to find out what was causing the error and he does not have a way to speak with anyone in the backend to even understand the issue. Knowing what figure used to be because my first HELOC was with them and what they are now, I would not recommend them. Their customer service is absolutely the WORST.", "rating": 1}, {"title": "Is a SCAM!!!", "text": "Is a SCAM!!!Pre-approval came through, nothing at all has literally change since the \"pre-approval\" and was still denied.  Really getting tired of companies like this wasting peoples time, just to get information from you to sell to other companies or bombard you with other services you were not looking for.", "rating": 1}, {"title": "links to verify income did not work and…", "text": "links to verify income did not work and kept giving the run around on verifying pay...several back and forth with them lying several times.  I'd stay away from this company, complete frauds.", "rating": 1}, {"title": "Denied yet does not have accurate info about my income", "text": "I was denied just in their one minute auto pre qualify even though I have never been rejected for a loan before. It had to do with them doing some AI or auto check with Experien and then saying I have too much strain on my income, which I assume is the debt that I am seeking a heloc to GET RID OF...I didn't even get a chance to upload my paystubs which show my income. And I have an excellent credit score. Therefore, if you are seeking this loan to pay off debt it is a WASTE OF TIME since they consider that debt and not your current income. Experien has no knowledge of my current income. This is when auto stuff becomes an issue. Very misleading advertising.", "rating": 1}, {"title": "Account should be on auto debit", "text": "Account should be on auto debit! Never received document by email to sign! Will not 'log in' to retrieve document! EMAIL ME E-DOCUMENT TO SIGN FOR AUTO DEBIT!Shouldn't be such a hastle! Ridiculous!", "rating": 1}, {"title": "Internet Underwriter Trash!", "text": "I applied online with Figure.com for an equity line of credit. There is NO live human being reviewing or underwriting the application, it's all done by computer. When I first applied, I was offered 60,000. Then when I linked my bank account to furnish my funds and income, the loan amount dropped to $28,000. Then I accidently linked the same bank account to my application but the Loan amount dropped again to $15,000. I then had to reapply because the name on my ID was different from my name which is on vesting on my property. So they canceled my application so I could reapply again, but now... I am completely denied!!!! I was NOT approved for anything at the end of the day, and day was wasted! The old-fashioned way is much better, a live person will review your documents and determine the outcome, not an automated online underwriter. I do NOT recommend!!!", "rating": 1}, {"title": "Worst lender I have ever dealt with", "text": "They don’t calculate wages correctly, they take to long to answer emails,  sometimes they don’t answer you or answer something different at what you asked, they ask to submit certificate translation when a certificate is already in English means they don’t even analyze correctly. The worst lender I ever deal with. If you try with them you are going to get burnt before you get approved minimizing your chances to get approved by a better lender. Worst experience ever. With credit score of 850 they closed my application before answering me about summiting additional income.", "rating": 1}, {"title": "Deceitful advertising", "text": "The approval process was easy and great. The process said that I would receive funding in 5 days and yet it’s been over 5 days and my loan is still not funded. I talked with a rep today and they said they have no ETA on when I will receive funding. This is not very professional or acceptable.  Clearly if I’m applying for a loan I need access to the money asap and to go through this process and not know when I will receive funding is extremely frustrating.", "rating": 1}, {"title": "Total scam", "text": "I have a loan with this pathetic company. They illegally took money from my account and refuse to pay it back unless I prove something to them that is obvious. Total scam!!! Do not borrow money from this awful company.", "rating": 1}, {"title": "Do not do business with this company I…", "text": "Do not do business with this company I regretted not asking how much will charge me for the process..Run from this company When they send the person to sing document they didn't include the amount they will charge for using them. RUN RUN RUN FIN THIS COMPANY", "rating": 1}, {"title": "🚨SCAMMERS🚨", "text": "SCAMMERS. Do yourself a solid and don’t use this banking card. They refused to let me get my money off that just got deposited leaving me and my family broke. I don’t owe them any money whatsoever either. This company has multiple bad reviews on other sites I found out after the fact. SCAMMERS.Update: I was lied to after this I was told that I would recieve a tracking number and  that my check would be ups to me. I called today to find out they haven’t even sent my check yet and now it’s after 6pm and still nothing. Which leads me to believe I’m being jerked around so I still stand by my original post.", "rating": 1}, {"title": "Horrible experience", "text": "Dislike how many hoops you have to jump through just get a loan. I understand proving that you are married, because you last name is different on your home when purchased, than the loan you are applying for. I provided more than enough, and the exact same information that my marriage license provided, and was STILL required to provide my marriage license. I mean do you need to know blood type and want my first born? You would absolutely give him back, he won't take y'alls crap either.  I didnt need to go through this much BS when I purchased my home. I shouldn't have to go through this much for a loan. I absolutely appreciate the attorney that was provided for the closing. He rectified the problem with my name. I would like the overdraft fees y'all caused me to accrue as a result of you all taking YOUR  precious time credited to my loan, bet I'll never see that. I'm glad this wasn't a life or death need. I will absolutely not recommend Figure to anyone. Edited after reply from Figure:I seriously doubt anyone gives a poop (can' use sentence enhancing words I guess, so I have to use a childish word) that I am not only frustrated. But I am pissed to say the least. I like your basically generic ass response. AGAIN, I provided ample proof. Please do not tell someone to do something I'm sure you clearly can see on your end, that I have obviously done. I will not be contacting a soul AGAIN. I should have told y'all where to stick your loan, but I needed this loan. ", "rating": 1}, {"title": "I was told to expect funding in 5-6…", "text": "I was told to expect funding in 5-6 days. today is day 7. Now you congratulate me with funding and write to me saying I can expect to see the loan in my account in 2-3 more days!I made promises based on the projected date which was yesterday! I am very unhappy with your performance. Six is not the same as nine!", "rating": 1}, {"title": "Total garbage", "text": "Total garbage.  Go to a real bank that might actually help you.  I thought in todays world i could do a HELOC from my computer, and they make it sound that easy, then kick you to the curb if they don't think you'll make them rich enough.  Hey, I'll give my money to someone who wants it.  Total garbage.Then to ice the cake, they jump on the opportunity to handle a negative review so nobody sees it, rather than deal with the impersonal heartless business practices.  I guess protecting their reputation is more pertinent than building a good one.  Confusing!No I don't need to to read to me what a Robot decided for you.  I know where you left me, that's all that matters.  If you would like me to explain the choices of a human vs the computation of a Robot, please let me know.  I would gladly take time out of my day to explain concepts like humanity, compassion, caring, community, empowerment, FRIENDS, and choice.", "rating": 1}, {"title": "Horrible Outfit", "text": "The “fully funded” message appeared for many days, and nothing happened (no money in my bank account). My wife’s ID is a US “Green Card.” That was the only US ID she had. Figure said the photo was not good enough. I sent new cooies of the photo along with copies of her Costa Rica Passport and Health Card to support the US green card. Still not good enough. Ugh! Delay, delay, delay. I telephoned at least 4 times, and nothing happened. Each time I called or received an email, it was with a different person--I didn’t feel like I had an advocate at Figure.I will never recommend this outfit. Excessive “processing” time. Sloppy organization.", "rating": 1}, {"title": "They lie", "text": "Their flyer says \"you're pre approved\". That's a lie. You are not. Plus they don't ask how much you want to borrow. Plus their valuation of property is wrong. Mine was 200K low....provable by an appraisal. ", "rating": 1}, {"title": "Dupped me into a high interest equity…", "text": "Dupped me into a high interest equity loan with no chance of negotiating anything. High pressure  Didn’t even have a chance to think about it.", "rating": 1}, {"title": "scam just to sell your information.", "text": "scam just to sell your information.I input all my information after credit karma recommended it for a loan. I have 762 score, after they run credit report I got notification to upload driver lenience and and proof of income including w-2, load driver license and while i was looking for the rest, about 1 hours later got email saying my application was close.", "rating": 1}, {"title": "This company is not equipped to process…", "text": "This company is not equipped to process a loan if you have a Trust. Even after the attorney who wrote the Trust verified that the paperwork I submitted was the correct paperwork, Figure, who seems to have no understanding of Trusts, would not accept it, and I wasted a credit inquiry. It was frustrating to not be able to speak to those individuals who were disputing my trust paperwork, and I am skeptical of their knowledge of trusts. A VERY frustrating experience and a waste of time!", "rating": 1}, {"title": "They bait you with a prequalified offer…", "text": "They bait you with a prequalified offer then turn you down.  With business practices like this I cannot give anything but one star.", "rating": 1}, {"title": "I have been defrauded by heloc by…", "text": "I have been defrauded by FIGURE LENDING thru heloc by overly inflating my property value and paid expensive origination fee then 3 months later suspended my heloc citing my property was significantly had declined in value.When I applied for a heloc loan on my residential property last May 2024 it was overly inflated up to $ 420,000 for a townhouse and was able to take a $200,000 line of credit causing me to pay an origination fee of $5,700 after they had deposited $193,000 to my bank account. I paid them the amount of $172,000 only keeping $21,000 as my loan for the purpose of paying my personal loan and credit cards balance. Three months later which is August of 2024 when  I requested for another draw of $17,000 they  suspended my heloc for the reason that the property value had significantly declined to $ 276 210. I felt devastated and distraught thinking that I had been scammed.  They made a misrepresentation on the application for their gains.I'm not very knowledgeable regarding heloc and was not properly  told/explained that once approved the whole amount will goes to your bank. I was not asking for a $ 200,000 loan. When I applied for Heloc at Figure lending took me 5 minutes processing including checking my bank account,they did their appraisal thru artificial intelligence and got the property value of $420,000 that's why they give me a loan of $ 200,000 to access. I checked their property appraisal recently and found out that they did the wrong address and made me felt like it's all fraud.The issue and my complaint was- there is no significant decline of property value. The correct value of my property should be on the upper $ 200,000 like to 270,000- 280,000 I owed 197,000 was expecting for a heloc of $ 20,000 or 25,000 at least.I know for a fact that my property was never appraised to more than $300,000 In conclusion if they have appraised it properly there should  be no decline of property value and I should not be paying a HIGH ORIGINATION FEE of $5,700.Need help on what to do. I need to get some of my money back.Please BEWARE!!!", "rating": 1}, {"title": "What a joke, another fly-by-night mortgage company", "text": "What a joke, no different from scam calls, or robot calls, they send the pre-approved offer just so they can get your information, and probably send you a bunch more garbage or refer me to other companies, so they can hound me, they are most likely selling my information as I'm leaving this review. What do they mean, I'm not creditworthy, I have excellent credit, in fact, my FICO score is as high as an 829, yet I'm not good enough for Figure.com to loan money to, I don't know, maybe it's an Age thing, I am 72 years old, perhaps they don't loan money to old people? That's okay though, I really didn't need to borrow money for my home at this time anyway, since I intend to sell it within the next 3 months, and I have like $250,000 to $300,000 in equity, but I thought I'd check this company out for when I buy another home, but after wasting my time like they did, and then turn me down to add insult to injury, I can guarantee them, I won't be using FIGURE.com for my next mortgage and or Line of Credit, that's for sure.", "rating": 1}, {"title": "Literally one of the worst companies to…", "text": "Literally one of the worst companies to ever work with. Their promise of getting a loan fast is a bold faced lie - and their excuses are ridiculous. They are a constant pain in my rear when my password never works even though I just updated it, they refuse to add a bank account for auto pay w/o a bank statement (just run the stupid payment. If it's not a legit account, it won't work), and they force me to provide flood insurance policy docs when they already got that with my original app. They have no way to securely upload docs. They TELL YOU to just go ahead and email it. Go ahead and send your personal info with balances, account #'s, your SS# through unsecured email. Who advises someone to do this! You can upload docs via chat...and hope the other person actually does so and is a legit person. You just have to sit around and wait to see what happens with that doc, if at all. You can't see any status at all online. You can only see the option to make a payment. When interest rates go down, I'm refinancing my main mortgage with a cash out option to pay this loan off. I cannot wait to never use them again. Backwards company, behind the times, inadequate employees. (Their responses to these complaints are ridiculous. TAKE OWNERSHIP. \"If you're not comfortable emailing documents...\"  Tell us, WHO is comfortable emailing their account #'s and personal info unsecured? NO ONE.)", "rating": 1}, {"title": "Not a Fiduciary Institution", "text": "I did not have terms explained to me in a way I understood. I did not know the term \"initial draw\" meant once Figure DUMPED the full amount of the loan in my account, meant \"initial draw\". The dumping of the full amount into my account immediately was not my choice but mandatory. When I paid back the money in full the next day, is when I understood I had to pay $2000 over the Line of Credit  amount with a 9.4 interest when used. When I asked the Figure overseer about it, she shrugged me off saying \"it's in your HELOC\". I was told by the person who administered the loan about it, he showed me a page of options which I had NEVER seen before saying I would be charged 4.99% of the whole amount on the \"initial draw\". The whole thing was slap dash and hurried. So I closed the line of credit completely when I got notices from financial institutes saying my credit score had gone down because of the line of credit, even though I owed nothing on it. I got Nothing out of this line of credit and paid over $2300 for a line of credit of $40,000 I never used it because I did not trust Figure as a fiduciary institution. Quite the opposite, they were not forthright or at all concerned about me, the borrower.", "rating": 1}, {"title": "Sorry, but....... not a good response", "text": "Sorry, but..... seems to be their go to when they don't have a fair answer to a question. You need to update your automated system to address some of the issues people are having. I realize your automated process is what allows you to fund so quickly, but a personal touch is also helpful for some situations. Not everyone fits into a certain mold. My situation was that I applied with the traditional mold items and it came down to that did not fit my situation because of the state that I live in. I was approved with everything that I put into their system and was later told that the loans are not joint and that I could not count my spouses income in my state. Stupid. Your loans should be joint as most households are joint and their income is just that. I do have one other complaint and that is whatever you use for appraisal of properties is not a good one. Your system valued my house 40% lower than what is the average for my area and my house is just that average. Maybe with some improvements you can get some of the negatives to positives. I realize you have more positives, but there are more people out there that you could help.", "rating": 1}, {"title": "Beware predatory lending!!", "text": "Only use them if you really want to waste thousands upon thousands of dollars. When we signed up for this we thought we were getting a great deal however once we started making payments and looking at statements and realize that out of a $492 payment they were only putting $43 towards the principal is when we realized we were being screwed. During the signing process and details it does not tell you that they’re only going to put such a small amount towards the principal otherwise we would’ve never signed up, this is a prime example of predatory lending and I pray to God that we can get out of this sooner than the 30 years we signed up for.", "rating": 1}, {"title": "I signed up for automatic payments", "text": "I signed up for automatic payments.  I was assured that they would take the money from my account on the first - not before.  This month they took the payment on the 29th.  THAT IS NOT THE FIRST OF THE MONTH.  Why assure and vow that the payment would not be taken before the first, and then do the opposite.", "rating": 1}, {"title": "Slow payment transfer", "text": "Slow payment transfer. I just paid on Friday and it’s still not gone threw and it’s Thursday.  High interest, terrible website. They make it to the point you can’t pay unless you log in,  get  a PIN number from your email and then you can log in.", "rating": 1}, {"title": "Detrimentally bad info from their third party vendor", "text": "I applied for a HELOC yesterday online. Their simple application is on a fully automated system that automatically declined my application within seconds, due to some kind of information combination. When I called them today to find out what the issue was, the young lady couldn't even give me the values that were used to get a rating. After being placed on hold several times she then states that my home and land is listed as public use. What!?! I've been in this home for 10 years and I've had a heloc before. When I asked to speak to a supervisor to explain better, she stated the same and that the false information came from their 3rd party vendor. She stated that I need to contact my county and get proof that my home is a single family residence, then forward the correct information to Figure. So mind you, I have my mortgage, deed, and county documents that are legal and notarized, but she can not use them. Not only that, she also stated that once they receive the proof from the county, Figure will then forward it to the 3rd party vendor that gave the bad info, but there is no guarantee when they will update the system. Therefore, Figure can not move forward until that is corrected because the system is fully automated and they can not change it. Wow!!! Thank you for your horrible system service and goodbye.", "rating": 1}, {"title": "This is the worst lending company by…", "text": "This is the worst lending company by far. The scammed money from my account and refuse to return it. Customer service is a joke. Do not do business with them!", "rating": 1}, {"title": "I believe this company is using Ai to…", "text": "I believe this company is using Ai to do biometric redlining by zipcodes.  Then, they are using Experian as an excuse to deny me a Heloc!  My credit, like myself is not perfect.  But, it's important to note that there are no recent delinquencies!  The last three years I have had many medical issues. I even caught Covid, with Pneumonia!  But, I still made my payments within thirty days! My application credit score was 688 on the figure dashboard for 1/30/23. Figure states that your score have to be 640! I have a verifiable gross income over $110k. After Figure change the value of my home; I still have at least $80k in equity.  But, Figure still has closed the door shut in my face for a home equity loan!  I will not apply again.  But. I do intend to turn this matter over to the government!  I have paid federal taxes too long to be subjected to this kind of treatment from an American company!  Yes!  I am mad as hell!!   Three application with scores of 648, 642 and now 688; and that's not good enough!  I have been in this home since 2006!  Figure or no one else will ever take it from me!  It's a shame that I cannot use my  home to consolidate some loans and do home repairs!  It's definitely a reason why I cannot; and it doesn't have a damn thing to do with credit!", "rating": 1}, {"title": "It’s been weeks and it still has not…", "text": "It’s been weeks and it still has not funded. I see no phone number to contact anyone. Now I’m wondering if I have been scammed. Would love someone to contact me.", "rating": 1}, {"title": "The automatic adverse action stinks", "text": "I have good credit (above the 640 threshold), perfect payment history, 8 years in my home with about $100k of equity, good income at a government agency that I’ve worked for 12 years, but the (I assume) AI underwriter immediately declined my application because I had a bankruptcy 6 years ago due to a small business I had. It would be nice to actually have my application reviewed instead of an automatic denial.", "rating": 1}, {"title": "They send me a link a pre approval…", "text": "They send me a link a pre approval ready and denied the loan after fill everything, just to mark and ruin my credit", "rating": 1}, {"title": "Beware do not use this company", "text": "I took out a HELOC Loan in March of 2023 paid my payments every month fast forward to January 2024 I receive a email saying after a account review they found they had been over charging me an credited my account an adjusted my monthly payment. You don’t receive any statements from them it’s all online so I login to my account to pay February bill an it automatically puts in what’s due when you select make a payment so I make my payment March comes around I receive a email saying my account in 44 days past due an they also reported it on my credit I reach out to them to find out how an they say I only made half my payment for February that my new monthly payment didn’t start until March I explained to them I paid what it said was due an all I get was sorry for the confusion. I have emailed multiple times called multiple times horrible customer service told me I have to fill out a dispute form a send it back I did now they tell me I gotta wait 30 days. This was not my fault I have all transactions showing where I made the payments.  I’m paying for it cause they have messed my credit up", "rating": 1}, {"title": "This company is a joke", "text": "This company is a joke. If I could give 0 stars I would. We got qualified to finance through them. My husband and I have perfect credit. We were using this money to put down on a business that we were buying. We gave them the details of when we would need the money and they said it was totally fine. Weeks go by and we have to keep reaching out to them to see what is taking so long to get the money. We then finally get a call back saying that they have ran out of money and we wouldn't be able to have the money until September or October. Mind you this was last year around June. What a joke. How do you have no money when you are approving people for money? Don't waste your time with them. Go with someone else!", "rating": 1}, {"title": "If I could give them negative stars I would!!!", "text": "If I could give them negative stars, I would!  STAY AWAY from this company!!! They are the most grossly incompetent company I've ever worked with!  \"Figure Lending\", \"Figure Mortgage\", \"Figure Technologies\".. whatever they want to call themselves, they're terrible!  Customer Service doesn't listen at all and do a terrible job of documenting requests and adjustments!  I have a mortgage with ONLY me and my dad on it.  My parents have their own home and neither of them live at my home.  However, Figure insisted on included my wife and my mother on the HELOC application as well.  This was actually my SECOND application.  My FIRST application was denied because of a lien on a property for someone that is NOT related nor has anything to do with me or my family!!!  First red flag, I guess.  I submitted another application anyway.  My parents live about 45 minutes away from the notary office.  We had to go to THREE separate notary sessions!  The first time, my documents weren't ready in time, and we wasted a trip to the notary office without any indication of when the documents would be ready.  The second time, they never corrected my mom's name on the application after I asked them to so they couldn't accept those signed documents.  They told us we would have to schedule a 3rd notary appointment.  I also asked them to update some email addresses, which they never did either.  We finally met the 3rd time and finished our documents with the corrected info.  Then I got an email 2 days ago asking to reschedule YET AGAIN for some corrections!!  I called them and they said it was an error and was assured all seemed well and the application was still in progress.  Only for them to call me the DAY BEFORE my HELOC was supposed to fund to tell me that in Texas, everyone on the application needs to live at the house!!  Like nobody could have reviewed and determined this from the beginning??  Not even the lawyers that delayed my documents in the first place??  Their official communication lists \"Adverse Action\" and \"We were unable to verify property ownership\"!  What does that even mean?!?  I assure you I've lived at this residence for 4 years now.  No requests for further information.  No response for further clarification or response to my inquiry about filing a Quit Claim Deed form to remove my dad from the title.  I feel I've been jerked around by this company back and forth from beginning to end!  What a complete waste of time!", "rating": 1}, {"title": "We started our Figure loan process on…", "text": "We started our Figure loan process on May 18, 2023 and just recieved our funding on the 8th of June. We filled out our initial paperwork and heard nothing. We contacted Figure three business days later to see if we needed to do anything else. Additional paperwork was sent to us as a result of that phone call, which we filled out immediately. We were approved for our loan on May 24th. We called on the 25th to make sure everything was received and to see if there were additional steps to take since we were on a tight time-line. We were sent a link to set up a notary, there was a 24 hour wait period for the appointment. On the 26th we had our appointment with the notary and the paperwork was sent in. I recieved text confirmation that day of our 3-day recession period starting with a \"May 31st end date, you should see money in your account in about 5 business days\". On the 1st of June I received an email stating \"we are in the process of funding your loan, you should see funds in your bank account in 3-5 business days\". Since then we have contacted Figure multiple times. On the 6th we were told by Figure to contact our personal bank, which we did, to check on the ACH. We contacted Figure after talking with the bank and asked for tracking information and were told there was no tracking information for the ACH. Yesterday the 7th, I recieved another email saying we should see funds in 2-3 business days. During this process we spoke to a number of friendly people, but this loan was not funded in the time they initially said it would be. This cost us an additional $5,500 in fees for the loan we were paying off with these funds. Now we have 2 loan payments we are going to have to make every month. We feel as though the ball was dropped multiple times during our loan process. There was a federal holiday in this time period, but that was ONLY 1 business day. The funding shouldn't have taken this long according to what Figure advertises as having funds in 5 days.", "rating": 1}, {"title": "NO LIVE AGENTS", "text": "I would give them a \"0\" if I could...there is no one to speak to! You have to email of which it was difficult to understand the recording. Terrible...", "rating": 1}, {"title": "The rate offered was not given", "text": "The rate offered was 4 points less than the rate I ended with. I applied online and kept trying to click the loan with a 4% rate but it wouldn’t go through", "rating": 1}, {"title": "They suck want to play games my time is…", "text": "They suck want to play games my time is more important than that go f,,,,    your self", "rating": 1}, {"title": "Just poor ethics or just a effing scam", "text": "Just get all your info and then tell you they are not available in your area. Poor ethics or just a effing scam", "rating": 1}, {"title": "Skynet Meets Lending Meets Lazy", "text": "I went against my gut instinct and decided to apply for a HELOC with Figure.  This was a colossal mistake.While I concede that Figure has a lot of positive reviews, I find it VERY difficult to believe that many of them are legitimate.  I highly recommend that you pay very close attention to the negative reviews. My Simple Story:I was trying to use the equity in my home to consolidate an unhealthy amount of revolving debt, most of which had been accumulated due to medical expenses (Hooray USA!).  Like many others, I didn’t want to do a cash-out refi and sacrifice a low finance rate on an existing mortgage.  This is why so many of us are turning to products like the HELOC.After clawing my way through Figure’s online application process, I was ultimately offered a loan of only $20,000.  And… Well... That was actually perfect in my case.  I had no intention of borrowing more than $20,000, regardless.Some notes about Figure’s online application:  It is entirely bot-based—that is, unless you run into a snag and have to “chat” with an agent.  If that happens to you, be prepared to read this a lot: “Sorry, we cannot do X-chore manually.”  The agent is no help at all and really just directs you down avenues that you’ve likely already traveled.  In other words, unless everything in your application can be researched or confirmed via their bots, you’re just out of luck.  Although my application finally made it to the finish line, something as simple as a 1099 could not be accepted or considered by Figure.  So the full complexion of my income was not recorded.In plain English, there is ZERO personal touch with Figure.  While I know some folks will like this, it will without doubt negatively impact a lot of potential borrowers who need a HUMAN to genuinely oversee the process.And then... 24 hours after being told I was approved for $20,000, I received a denial email.  Again, read the negative reviews and you will see this happening to a lot of people.  Many folks who are approved later receive a denial notice the next day.  Even wealthy, well-to-do folks with 800+ credit scores, excellent equity and good salaries are being denied for ridiculous reasons.  Figure’s “can’t do manual” nonsense is likely the principal reason for all of these late stage denials.  With all of this in mind, the reasons provided to me in Figure’s “adverse action notice” (their afterthought denial) were nonsensical and clearly not sensitive to the true purpose and complexion of my application.Also worth noting:  Within MINUTES—not weeks, not days, not hours—my phone was getting blown up by other lenders offering other loan products.  My information was sold by Figure before I had even finished the application.  I’m not being hyperbolic here.  This genuinely happened.  About 25 minutes after I entered my contact and financial information, I received three back-to-back calls from multiple lenders.  Spamtastic.Figure welcomes anybody and everybody to apply.  Why?  Because anybody and everybody has data to sell.  Figure will make money off you, whether or not you secure a loan with them.  Consider that before biting into the apple.  Should Figure choose to respond to this review, I’d recommend that you ignore the response.  I say this because they will likely either be vague with their excuses or will mischaracterize components of my application in an attempt to gloss over their own poor processing practices and/or to smear my character in an effort to soil my review.  Make no mistake: It’s all protective corporate BS, top to bottom.  I deeply regret reaching out to Figure.  Their marketing campaign does not match their product availability or service execution.  Full stop.Be smarter than me.  And look elsewhere for your HELOC.THERE ARE MUCH BETTER ALTERNATIVES.", "rating": 1}, {"title": "All automated, not human", "text": "All automated, high interest, basically personal loans. Go anywhere else.", "rating": 1}, {"title": "This company has a BAD BBB rating of F", "text": "This company has a BBB rating of F. .  they offer ZERO methodes to verify income if you do not have a pay stub or file taxes. . .and if your situation does not fit RIGGID set standars. . .they offer nothing but SORRY we have no way to help you!!!  Plus you MUST surrender your online banking info. Giving them access to your accounts!!!Steer clear of this company!!!", "rating": 1}, {"title": "I tried to apply for a modest home…", "text": "I tried to apply for a modest home equity loan with excellent credit, but was rejected because Figure couldn't verify my identity.  What do you do with that when you are who you say you are, and your credentials (driver's license) are valid?  I chatted with someone in customer service who told me that, since the system is automated, there is nothing she can do.  Really, Figure?", "rating": 1}, {"title": "terrible service", "text": "terrible service.  I have tried, unsuccessfully, to access my account.  I used to be able to using the 'magic link' but for some reason that's the only email I don't receive.  I have asked MULTIPLE times to remove the 2 factor verification so I can access my account and it still has not been done.  I would not recommend your service again and I certainly will never use it again once I've finished paying it off.", "rating": 1}, {"title": ". I hope the government   or someone  else looks into   your business. wish we never      got this loan trough.  this company you guys are bad for peope who really need help bad bad don’t get a loan", "text": "Don’t get a loan with this company they lie there no good", "rating": 1}, {"title": "Since I got the loan from Figure…", "text": "Since I got the loan from Figure Lending my score went down and I had been paying on time but they keep changing their minimal credit score so I can't get another emergency loan for $15000. I wouldn't recommend anyone to borrow loans from them. It's a scam, they want to keep you paying them. It's a trap.", "rating": 1}, {"title": "The process seemed legit and easy HOWEVER....", "text": "Shady actions...  The process seemed legit and easy.  However, it required that I link-connect bank account (to deposit funds) to continue processing.  This is common for my credit union loans.  Once linked my application automatically disappeared and returned my to the Dashboard, and now requested that I reapply???  I have excellent credit so this did not make sense.  Please", "rating": 1}, {"title": "Why pay interest on closing costs?", "text": "Well I guess you can do a low rate when you stuff all the closing costs into the loan. Kind of runs your APR up. I'd rather not pay interest on closing costs and fees.It wasn't until now that you even brought up the subject of prepaying principal to offset financing all of the closing cost. Don't you think that's something you might want to mention at the other end. Like at the beginning?", "rating": 1}, {"title": "Just fishing for information?", "text": "The first odd thing was they asked for my PIN to unlock my credit freeze.  I did it myself.  Then they took all my info, including my S.S. and ran my credit report.  At that point, they told me my house was too new to be in their database.  It was built in 2005.  Something feels very off about them.", "rating": 1}, {"title": "My application has been in Review", "text": "My application has been in this \"review\" status for over a week. I've been reading all the other reviews on how they got funded fast. I wonder why my application is taking so long. What's going on figure!??Update They canceled my application just for posting this review! Figure is a terrible loan place and very unprofessional", "rating": 1}, {"title": "I attempted to get a line of credit", "text": "I attempted to get a line of credit. I meet all criteria. They can’t find my address in their system!  I own a condo, the building comes up, other units come up, but mine doesn’t. They blame the third party system they work with, but don’t know the name of that system so I can’t contact them. So I’m just out of luck. No help at all. Don’t believe their advertising!", "rating": 1}, {"title": "Not so satisfied", "text": "It started off really promising however after several attempts to get the loan funded and wanting to make my first payment it was a nightmare. Their app was down and they would not take a payment over the phone all I wanted to do was make a payment and it was like an act of Congress to get it done. At this point I would not recommend.", "rating": 1}, {"title": "This company does bait and switch", "text": "This company follows bait and switch. They sent a mail saying I have a lot of equity and asked me to apply for a HELOC with a special reservation code. When I applied, they pulled a credit report and denied because there is no equity, but offered a personal loan at a much higher rate than the advertised HELOC rate. Don't trust the mail that comes from these guys.", "rating": 1}, {"title": "i applied for a heloc ..was…", "text": "i applied for a heloc ..was prequalified then was approved and was told i was waiting for final docs and notary..only to get denied because of identity verification!! i gave them everything they asked gave my accounts to plaid sent in a copy of id and bank statement ...how is it possible i cant be verified my credit score is 801 fico 9 and i own a 900,000 property out right with no morg!!!! smh i actually turned down offers based on them telling me i was good!! then jillian the supervisor gets a attitude with me for just trying to get a resolve. my level of frustration is thru the roof!!! i was really excited to work with them only to disrespected and denied.", "rating": 1}, {"title": "Rip Off", "text": "I still can't  imagine how this company is operating as a serious financial institution in the US.8 months ago I got a loan of $100K, received only $96K (minus fees etc).My monthly payment was about $760 or $6,000 in 8 months.Today I paid off the loan. Guess how much??$99,300.Hence, I received $96K and paid back $105K after 8 months... looks like rip off in my opinion", "rating": 1}, {"title": "I own two houses on opposite ends of…", "text": "I own two houses on opposite ends of the state. Because your computer cannot communicate with the county tax assessors in Oregon I get denied because you cannot determine property value. Unfortunate that I will not be able to take advantage of your 2.49% interest rate after you've bombarded my mailbox with these fantastic offers that beat even my credit union.", "rating": 1}, {"title": "Not ready for prime time - save your sanity go elsewhere", "text": "Please do not work with this lender - they are the worst refinance experience I have ever had.  People, process and technology are not ready for prime time.  Hours upon hours of wasted time both pre and post close due to Figure Lending mistakes.UPDATE: The vendor response to this review is symbolic of the problems - no really offer to talk or help.  Just empty platitudes.", "rating": 1}, {"title": "I started my application on 11/19 I…", "text": "I started my application on 11/19 I noted I am retired… on 11/30 after countless emails, Ten documented phone conversations, one with a Manager I canceled my request,,, I listed my income and was 2,634 short I explained I have a 1099 for an additional $4,156 they said to send over when it was verified they would honor their original offer,,, then the manager called back they couldn’t accept a 1099 because I was retired?? They blamed it on their “System”.  They sent me another offer not close to the original offer.. it felt like a bait and switch,, very deceiving,,,", "rating": 1}, {"title": "HELOC does not seem to be HELOC, poor service", "text": "I went online for a rate quote on a HELOC. Was given an initial draw amount + loan terms and rates to choose between. I called the company's help number to ask if my initial draw could be 0--like with every other HELOC I have ever had--and how I would access the line and how what I was being offered was different than a standard home equity loan.  Person who answered seemed not to know what a HELOC is and put me on hold, presumably to get an answer.  Was kept on hold for a while and then line disconnected.  Very odd interaction overall. I will avoid this firm in the future.", "rating": 1}, {"title": "FIGURE is worse lending I ever deal…", "text": "FIGURE is worse lending I ever deal with. They are good since they lock your rate and collect all information. After they check your credit history and make you an inquiry, they're asking again for provision to do again. Theirs customer services are discussing and ridiculous. Since they waste over 30 days of your time, they are asking for $17,000 assets, and if you don't have that, they will cancel your application. They SCAM me, they will scam you for sure. Be careful.", "rating": 1}, {"title": "The app appeared to be broken as it…", "text": "The app appeared to be broken as it would not let me proceed to the next step.2 calls to their support team and they still could not resolve the issue.No follow up from them either.It turned out to be a big waste of time and unnecessary credit inquiry.", "rating": 1}, {"title": "Beware! Payments never go down!", "text": "Yes, this is the fastest processing you’ve ever seen. But beware. This is not like any HELOC we have ever had. If you draw an amount you want as a line of credit and pay back -say- 80%, your payment never goes down. You can prepay 120k and they will still take their monthly draw. It is fully amortized like a 1st mortgage. Any additional draws, on now available credit, only make your monthly payment go up. Don’t get this! They want to seize you home when you can’t make a monthly payment and owe almost nothing.", "rating": 1}, {"title": "Check if your bank is on their fund dispersal list before applying", "text": "Went through the entire process just to find out they have a list of banks they approve for loan fund dispersal.  I only found out after supplying all of my personal documentation that I would have to open another account.  Very aggravating and a waste of time since I do not wish to open another account just to receive dispersed funds.  Routing numbers and bank accounts are not good enough for Figure", "rating": 1}, {"title": "That was not a good experince for me", "text": "That was not a good experince for me. I spent countless hours on a phone tyring to solve a legal paperwork verbiage issue... and all to no availability. If you are in a standard situation (single, married and etc) then it is fine, but I solely own the property and they insist that my husband (who has zero interest and ownership) would sign the deed that states that this is his primary residence. He never signed a deed for the first morgage, never mentioned on house title, this is not his primary residence, and he does not live here.. and there is no an attorney to look into the actual paperwork. They do charge a lot in fees for no service. Kinda sad.", "rating": 1}, {"title": "Do not let them waste your time", "text": "Do not let them waste your time. They definitely do not know what they’re doing when it comes to home loans!! Clueless is being nice! I waited almost two months and I paid for the appraisal and then they decided that they can’t do the loan because of owning a company.  what a joke. I talked to a supervisor that never returns my call I always had to follow up with him. Not real sure my personal information is safe with them and I give them a lot of personal information", "rating": 1}, {"title": "FIGURE lock my rate", "text": "FIGURE lock my rate, everything was okay before they get all info. After that they just start to changing the numbers. In my opinion this is worse financing company. Who need inquiries on their credit report, just go with FIGURE, they will do everything to destroy you. I can show a proof what they do to me.", "rating": 1}, {"title": "Got approved for a home equity loan", "text": "Got approved for a home equity loan. Spent hours filling out the application. I had to open a new checking account because BMO Harris wasn't on their list to transfer money to. I got to the end of the application process and was told the person I'm divorcing had to co-sign for the loan even though that person's name isn't on the house. Thanks for wasting my time, Figure.", "rating": 1}, {"title": "Forever processing, always 'in a meeting'", "text": "My mortgage application has been processing for over 90 days and every time I contact them, I get 'Sorry the processor is in a meeting they will get back to you soon' only to never be contacted. This has been the response for the last 2 months. If you want a refinance to happen sometime in the next 3 months. Go somewhere else.", "rating": 1}, {"title": "Received \"Pre-approved letter\" applied online and application rejected!", "text": "Received pre-approval letter including my property value and estimated equity amount and a reservation code. Applied online but application rejected with following reason: Property value or type of collateral not sufficient ! Figure.com has already obtained my credit report (good score) as well as my property value ($$ above average) BEFORE sending pre-approval letter !", "rating": 1}, {"title": "Watch out for the bait and switch", "text": "Watch out for the bait and switch.  I paid 3 points for a low rate.  All negotiations were through email.  The process only took a few days.  I ended up with a higher rate and didn't notice it until I got my first bill.  The reply to my review from Figure is a lie.", "rating": 1}, {"title": "Waste of time, unless you like bots", "text": "they do an automated underwriting, and somehow it said our property doesnt qualify... which is nuts because its a super nice house in the historic district of a nice town. Totally remodeled and beautiful. I asked them to take another look at the property, they said they cant do anything manually. Its fine, they arent the only place to get a loan obviously.... but it seems like a bummer service when they cant do anything manually.", "rating": 1}, {"title": "This really isn’t a bad review for…", "text": "This really isn’t a bad review for Figure but more for the company they have doing their soft credit check. I was denied a equity loan and the reason was “involuntary lien” on my home. Which I knew was a mistake. Figure said a company called DataTree gave them the info. I contacted DataTree who refused to speak to me since I wasn’t a customer of theirs. I took days off work to go to courthouse to be told there is no lien. It’s just been a terrible experience.", "rating": 1}, {"title": "Dumbfounded how this outfit can be so…", "text": "Dumbfounded how this outfit can be so highly rated.  Their advertising is incredibly misleading.  They advertise a 2.49% home equity rate, but if you read the fine print, that is only if you pay an outrageous 4.99% origination fee up front.  You can do much better at your local credit union, people!", "rating": 1}, {"title": "Subpar risk algorithm and UX design", "text": "Figure mortgage's risk algorithm is poorly designed. I was denied application because I had an employment gap in the last two years, despite a >800 credit score and consistent >$250K annual income in the last five years. The website design was clunky. I had to call the reps and waited a long time on the line before understanding why the website kept showing the error message \"2 years' of employment history is required\" when I had entered >5 years' of employment history.", "rating": 1}, {"title": "You all screwed me over by putting the…", "text": "You all screwed me over by putting the wrong land on the loan but I just found out you all put my land that has nothing to do with my house as collateral and put my house and land on it as well. That's sorry as hell and very unacceptable. Caused me to have to pay the loan off instead of getting my money for my property. Don't ask me to tell anyone about you all cause you damn sure won't like what I tell people. Yes I'm freaking pissed off and your sorry people lie like no other. 2 people was supposed to call me back but evidently they decided not too that's sorry as hell also.", "rating": 1}, {"title": "Twice now these incompetents cannot…", "text": "Twice now these incompetents cannot verify my income by linking to either my paycheck stub nor my checking account. And then they won't take that information from me via mail not electronic means. How ludicrous.Im having to move along to one of the other lenders who actually can get it done. Thanks but no thanks", "rating": 1}, {"title": "Notary process", "text": "We went through the whole notary process and now we have been told we have to do it over. She told us at the conclusion of the notary process that we were done. We have had 2 calls and/or emails since we were assured all was ok. I don't think we should have to repeat a process that your employee made errors with.", "rating": 1}, {"title": "They do not use FICO Scores.", "text": "They do not use FICO Scores.They use non fico credit scores which is generally much lower than FICO Based Credit Scores and in my case is 56 points lower.All other college loan companies to my knowledge use FICO, Earnest, College Ave, SOFI, Common Bond etc....So you will be at a credit disadvantage by Using Figure.", "rating": 1}, {"title": "I don't know what everyone is ranting…", "text": "I don't know what everyone is ranting about. I applied for a home equity loan and all the numbers were completely off from their automated robotic systems. I called in and they said they'll have someone call me. Waited a day, called back, said \"yea, you should be 3rd in line so look for a call hopefully today. \" Nothing. Total waste of time just happy it was a soft pull. Lot of hype, no results.UPDATE (weeks later): customer service finally admitted the algorithm was way off but they have no control over it and cannot override or fix anything. Blatant negligence and those \"loan officers\" working there have no control over anything. said I should reapply - that's all they had. lol. Sad.", "rating": 1}, {"title": "Okay, they screwed us..", "text": "Okay, we thought they were stupendous...until, they sent us an offer, WAY better than what we recently signed for. (Keep in mind, no money has hit our account.) We have excellent credit and our offer was 4.99%...after we signed loan docs of 6.25%. (I questioned our rate, but was told we needed more income to qualify for the 4.99.) Ummmm, we have 400.000 equity in our home. So, shop around...look into figure, but wait for their plea. Otherwise, you will pay too much, like us, suckers.", "rating": 1}, {"title": "Go elsewhere if possible!!!!!", "text": "Go elsewhere if possible! This company states they are here to help...no way! I apply for a home equity line of credit to consolidate high interest credit cards and agree to use my home to secure the loan, they reject my application because my debt is too high. Really?! Why do you think I wanted to do a debt consolidation loan with the equity in my home.  Did not even ask what the value of my house is to see how much equity I have! What a ridiculous company.  I will go back to a reputable company to get the help I need. What a joke!", "rating": 1}, {"title": "Does not allow you to upload tax…", "text": "Does not allow you to upload tax returns, only through login to the IRS, which never works. You guys need to be more flexible and innovative and not reply on other company websites. I'll stick with the traditional way of securing a home renovation loan.", "rating": 1}, {"title": "Don’t trust this company.", "text": "This company has hidden costs! You will pay way too much for this, this is a modern day loanshark masked as a trusted financial company! I am getting rid of this loan. They also sold my loan to another bank I have never heard of.", "rating": 1}, {"title": "Just got off the phone talking to two…", "text": "Just got off the phone talking to two of the reps. I explained that I waz looking to refi ONLY to the first one. He transfers me to the second one. Had to re explain it again. After several minutes on hold, she come back to say they DON'T DO REFI. They only do cash out and helocs.", "rating": 1}, {"title": "Does anyone have a physical address for…", "text": "Does anyone have a physical address for this company? The loan I applied for had the wrong address. The loan officer said he was going to cancel my application (which was fine with me as I got a personal loan through my bank) But I open my bank account 2 days ago and FIGURE deposited $47795 into my account! They want me to pay $1050 a month for the next 5 years! I can't afford this. I don't recall signing anything or agreeing to this loan. They even charged me $1600 in 'closing cost'. I want to send this money back (minus the $1600 bogus charge taken out of a $49,000+ loan)! They have not responded to my numerous emails. Any help would be appreciated.", "rating": 1}, {"title": "30 days of waiting and my app was…", "text": "30 days of waiting and my app was voided. Need to re apply and wait another 30 days. Yeah not gonna happen. Waste of time and energy.Update - By the way your rates were nearly triple what I found elsewhere. Hope this saves others the headache", "rating": 1}, {"title": "The issue is Figure YOU dont need last…", "text": "The issue is Figure YOU dont need last years tax returns to verify income! What if I quit my job, how does last years tax return gonna help you? Use the income statement I gave you, not that hard! Again, these guys are clueless NO need to call, too many excuses!", "rating": 1}, {"title": "Do not trust them", "text": "Do not trust them! Horrible customer service and they do not care that you are a person calling in for help. Misinformation, impossible to get a hold of them, and changing of rules depending on who you are talking to. Go elsewhere!", "rating": 1}, {"title": "\"You're Pre-APPROVED\"", "text": "UPDATE* They called me & assured me that they only pulled a soft credit inquiry. DON'T fall for their \"You're PRE-APPROVED\" CRAP! I was actually looking at getting a HELOC & then I got their offer in the mail, did the reviews online & thought, \"OK\" this company sound legit. Applied & was declined, even tho I was \"Pre-APPROVED\" When I told the rep that that was false advertising, he apologized & said that things could have changed in the few days/weeks that the offer took to get to me. Now I have a hit on my credit score, Thanks FIGURE!", "rating": 1}, {"title": "What an absolute horrible platform", "text": "What an absolute horrible platform. They state they figure income off 1 checking account, so if you're married and have separate accounts you're screwed there. Here's the worst part though....after you get past their identity screen there's no button to move you forward.  None, so you're stuck.  Also, I asked if I could email in our retirement savings.  Nope, you can't do that either. I tried speaking with customer service and here's what they said \"In order to build a fully automated system we require levels of security that does not work with anybody\".  Their platform was built by monkees.", "rating": 1}, {"title": "A nightmare!", "text": "Wow. What a nightmare.  All communications are online which means the process is incredibly slow. If you have questions it takes several days to get answers. They outsource their employment verification and their subcontractor took five weeks (!) to contact my employer, then took another two and a half weeks for Figure to tell me that they had more questions about the job i have been working at for almost ten years. I have over 800 on credit score and joint family income over $175k with no debt other than my mortgage, but have been waiting nearly ten weeks just for loan approval. Really sorry I applied with them.", "rating": 1}, {"title": "I had a HELOC with this company and…", "text": "I had a HELOC with this company and after the loan was paid in full they did not close the account. Apparently there was a fee that needed to be paid to the county to close the account, however they never informed me. Totally unacceptable.", "rating": 1}, {"title": "All transactions were completed in a…", "text": "All transactions were completed in a timely manner and as described. I am pleasantly surprised at how easy it is to access and pay on my account.  Recommend it to everyone that wants an honest provider", "rating": 1}, {"title": "they would not even consider us for a…", "text": "they would not even consider us for a loan because our property is coded wrong by the county we live in what a bunch of crap does not meet expectations for their advertising we meet credit score and all but wrong code on property what kind of crap is that?", "rating": 1}, {"title": "Simply Horrible", "text": "Simply Horrible!  I was approved for a loan, however it was under my maiden name.  I offered to simply reapply and was instructed NOT to.  I was told they were resolving and would contact me.  They did not.  I then received an email saying my funds were on the way.  Later the same day I called to follow up and was told again there was an issue with my last name but it was working to be resolved.  I was told I'd be called back.  I was not.  Then I called the next morning to follow up.  Apparently over night they no longer offer personal loans and now would no longer be able to complete my reapplication because I followed their instruction and did not re-apply.  Simply HORRIBLE!!  They simply say sorry about that as if my business was not depending on the funds I had been told were literally on the way!!", "rating": 1}, {"title": "Keep getting run around", "text": "Keep getting run around. Set up autopayment but am not receiving discount, also they only accept ACH payment and have not provided my employer with their ACH info to take advantage of a tuition benefit offered by my employer. Very frustrated.", "rating": 1}, {"title": "Lousy Customer Service/ DO NOT USE", "text": "I am returning customer to Figure Lending! Apply for a home improvement loan for approx 20k. During the entire process I have rec'd numerous emails from Figure Lending about income verification! No problem, I submitted my income and added my wife's income too as a joint loan, in which I did not have too.  Figure said they can ONLY use One paystub not Two, but needed our Tax returns to verify income???? What? Figure was given Two our our most recent paystubs, use that to figure out income.  Not sure why last year's tax returns are needed to figure out income for a 20k loan..  Waste of time people, just use your credit card, these guys are clueless !", "rating": 1}, {"title": "So I have asked Figure to remove my…", "text": "So I have asked Figure to remove my name and email address from their marketing list.  Still getting BS emails from their marketing dept about home loans! These guys SUCK, thats why I don't recommend Figure!  Go Figure?", "rating": 1}, {"title": "Extremely volatile, no logic behind their lending", "text": "I applied around Christmas, my wife and I are excited to do some major renovations to our home. We received the exact amount and a pretty reasonable interest rate (about 1% higher than the average HELOC). A week later I went to sign it and they claim it expired, however I could apply again and it would be fine. The new amount was half of what we wanted at an outrageous interest rate. I really wanted to be a FIGURE customer but they don't seem to have any logic behind their lending and claim it is all automated so they can't help. I don't imagine they'll survive against lower interest traditional HELOCs with no rhyme or reason to what they are offering.", "rating": 1}, {"title": "Undervalued Newer Home, Won't work with you on an accurate appraisal", "text": "They appeared to have the best rates around, so I had hoped to use them. I have excellent credit and loan to value was not an issue for the amount I wanted to apply for based on an appraisal that was 3 months old that I had done during a refinancing loan. I was denied because Figure underestimated my home value by 25%. I purchased land and had a house built on it 3 years earlier. I had put a significant amount of money down on the land and to the general contractor, so when I refinanced after the house was built a few years ago, it was not for the full amount of the property and home value. Seems Figure based their estimate on that value. They have no means for a true appraisal and refused to work with me further.", "rating": 1}, {"title": "FIGURE is TOTAL BS", "text": "This is TOTAL BS. I received a pre-approved notice in the mail and decided to check it out. Despite the pre-approval, I got a tap dance and never had my questions adequately answered. Stay away from these sharks.", "rating": 1}, {"title": "Insufficient collateral", "text": "My application was declined b/c of insufficient collateral.  My collateral was my home, valued at $580K, completely paid off.  I just could not believe this.  Now Figure has all my information (including my SSN) and I feel I've been duped.  Then I went to Rocket Mortgage and got a loan right away.  Thank goodness there are alternatives.UPDATE: They are asking me now for more personal information and are also asking to speak with me.  I'm intimidated by how much information I shared with them and that went into the ether--particularly given that they're an ultra-aggressive startup with super shady pratices.  Please stay away from them--go with more credible and established players.  Who knows what will happen to this sketch startup.", "rating": 1}, {"title": "Horrible customer service", "text": "Horrible customer service.  I paid my account in large bulk amounts and was way ahead and they refused to help me redo my loan for a smaller payment.", "rating": 1}, {"title": "Poorly Managed Company; Plaid Technology Worthless", "text": "Figure is more than happy to pre-approve your loan then ask for endless amounts of documentation to give them an out to not process.  Impossible to get someone on the phone.  Both times I've been on hold for over 30 minutes, then it hangs up on me.  Also, I did NOT apply for a home line of credit, but Figure decided to try to pre-qualify me for one and search for liens and other things related to my house without my consent.  The Plaid technology they use to verify income is also inaccurate.  After linking a bank account, it showed my entire year income was only $9k more than what I had made in the past 6 months, while my annual compensation is over $100k.  Avoid this company and go through someone like Credible or Credit Karma instead if you are looking for a general personal loan.", "rating": 1}, {"title": "Rebecca was very personable and…", "text": "Rebecca was very personable and professional - overall a joy to work with. She took time to explain everything to me, her communication was clear and easy nto understand. Thank you for a great experience!", "rating": 1}, {"title": "Got this lender in the search result…", "text": "Got this lender in the search result for investment property for refi on mortgage new daily site where they promise you rate in for 'Minimum credit score of 640'. Then the link takes you to their site where they force you to enter info personal info - name, address, date of birth and income and creating an account. Then they ran credit score check without explicitly and clearly mentioning it (maybe it is in fine print) and despite excellent credit was rejected with the message they dont offer lending for this type. If that is the case why do you come up in search result and force people to register account and share personal info - the only reason I can think of is they want to collect and sell your info. Bad business practice!!!", "rating": 1}, {"title": "At first it is great", "text": "At first it is great! As advertised, the fastest and easiest loan one could get. However, service after the sale , not so great. In addition to issues with customer service previously, the most recent issue is an \"error\" that resulted in a duplicate payment being taken out, with \"we assure you\" that you will be refunded today, which did not happen. Apologies and \"we understand your frustration\" does nothing to make my funds that I need available. This at a time when the nation is under panic due to a virus, losing funds due to loss  of business at work is an extra source of stress. I have no confidence with the company processing my payments and fear this could just randomly keep happening. I regret my decision to obtain a HELOC with this company.", "rating": 1}, {"title": "I would be very careful with using this…", "text": "I would be very careful with using this company. After disclosing bank account info and tax records (Which requires you to give them your bank account #‘s and passwords ) to their automated system they could not verify our correct income. Even though tax records clearly show gross income, if you have any type of pension income it won’t be counted. The answer for that is “ our automated system doesn’t recognize those incomes.” Another problem is if you have a hometown bank. They cannot automatically pull what their computers need to compute the loan process through them. We did have required income, credit score and equity but my experience was frustrating and unsuccessful with Figure. I would not recommend them for the mere fact that they cannot do what advertisements state.", "rating": 1}, {"title": "Approved, but wait - we’re canceling due to no fault of your own", "text": "I was Approved for a home equity loan the Friday before Memorial Day. Passed all the steps just waiting on funding. I call a little more than a week after signing all the documents to check the status of funding knowing that holidays delay financial transactions - I’m told the loan is funded they’re just are having trouble getting the funds transferred  to our particular bank. Nothing I can do to help the process.A week later - after hours on a Saturday, I get an email from Mike W apologizing for the delay. They’re having trouble getting a 3rd party vendor to verify the condition of the home. They are working on it and as a thank you for my patience, be on the lookout for a link to receive a $50 Amazon Gift Card.24 hours later, no email with an Amazon Gift Card. No, my loan is canceled due to inactivity for more than 2 weeks!", "rating": 1}, {"title": "Take grandpas word for it", "text": "Received a letter from Figure after several inquiries about a refinancing loan. As many stated before,  the process seemed too good to be true. Comparing their advertised process to traditional closing procedures, it would seem so. 30+ days vs their 5! The letter stated I was pre-approved with them and exact “figures” would be determined upon application. After finishing the application, I was denied. Great credit/fico scores, debt/wealth ratio is ideal and have plenty of equity for any loan. All things considered, including a “pre-approved” letter...you’d think it would be exactly what they said, seemless, quick and easy process. Well, I guess they delivered. Quick app, even quicker denial. lol Save your time. Like my grandpa said, If it’s great, it won’t be easy...if it’s easy, it won’t be great.", "rating": 1}, {"title": "Deceptive and borderline predatory", "text": "It's difficult to see Figure as anything more than a bait and switch operation. The competitive \"personalized\" and \"reserved\" rates that were marketed to me were complete fabrications that in no way aligned with the rates that were offered once I reached the site. This place seems like a class-action suit waiting to happen.UPDATE based on their reply: Their response is nonsense. I have excellent credit and their offers were simply far worse than what the rest of the market offered - the switched rates weren't a reflection of any financial data other than their desired profit margin. Just about every major bank or financial institution will offer you better rates. If you go with Figure, you'll be paying a premium for the up-front ease of use of their website -- it will definitely cost you above reasonable market rates in the long-run.", "rating": 1}, {"title": "Misleading marketing materials", "text": "Was sent marketing materials in the mail about advertised APRs that were not even close to what I was ultimately marketed. Terrible experience", "rating": 1}, {"title": "I wish to cancel my original 5 star…", "text": "I wish to cancel my original 5 star review and warn others, that if they want a true heloc that you can draw money, pay back, and repeat don't get one here. I paid a big amt back the month after closing, I didn't need it all then. No change in rate or payment, that was okay. Then I ask to draw from the line, the amount eligible works, but FIGURE wants to raise my rate and payment for what they call \"an additional draw\". The amount is within my original heloc amount approved of $ 50,000, it is not a new loan like they are treating it. I am in mortgage and familar with the way heloc's work, Figure is unique in a bad way. Might even be a fair lending violation which I will be checking into. Good thing is that there is no prepayment penalty, as I will be getting a true heloc to pay this useless one off.", "rating": 1}, {"title": "This where I tell you that service for…", "text": "This where I tell you that service for connection to get a balance of payments and actual payoff remaining SUCKS!!!!!!", "rating": 1}, {"title": "Thieves!", "text": "**Update June 1, 2021**As per Figure the payment was sent to Home Point and was applied to my loan 1 month and 2 days after the loan was transferred. Jerrod, Figure Supervisor, advised that they have no control over how Home Point applies payments and I would have to contact Home Point directly to resolve the posted payment date. Figure has taken no accountability for the mishandling and misappropriation of funds. I highly encourage anyone who is looking to refinance to stay clear of Figure! Figure accepted payment for my loan on April 2, 2021 then sold my Loan to Home Point and never sent the money to Home Point, and refuses to refund me the money directly. Was told on May 4, 2021 the funds would be sent to Home Point. To date, this has not happened. Figure Lending is withholding funds while I am accruing more interest than I should be with Home Point. Beware before you move forward with refinancing with Figure!", "rating": 1}, {"title": "No reliable", "text": "Crap and BS, was telling me 3 weeks than I am approved and then declined and couldn't even explain the reason. Don't waste your time.", "rating": 1}, {"title": "Unsolicited Junk Mail", "text": "Figure.com is sending me unsolicited junk mail and they do not offer a direct way to opt-out from their list. To opt-out they require you to go through a third-party!", "rating": 1}, {"title": "Total waste of time", "text": "Total waste of time. I received a \"pre approved\" offer, own my home free and clear and was rejected in less than 5 seconds. Dont waste your time", "rating": 1}, {"title": "Completely useless product", "text": "Completely useless product. I applied and got nowhere, then two weeks later, they said my application was closed as it had timed out due to being incomplete. They never asked me for anything. So I got on the live help chat, and the agent told me that the third-party valuation site was unable to pull up my property address. They weren't allowed to use my deed, the Zillow listing, the city tax bill, a recent appraisal, or anything else to verify that the property exists and what the value is. (I am not even looking to borrow high LTV; a vacant lot in my metro area would have enough value to secure the HELOC I am looking for.) They said there was no way I could apply since their valuation service doesn't pull up my property. Oh, and they refuse to tell me what service they use so I could get help from my local real estate contacts who are more familiar with local addressing and might know what the issue is.", "rating": 1}, {"title": "The Better Business Bureau's F RATING is fitting", "text": "Absolutely the worst lending experience to date. After receiving their \"PRE APPROVAL NOTICE\", with my existing loan amount remaining listed  AND the value of homes in the area also listed, and as I am waiting 6-8 weeks for my  traditional HELOC to go through, I thought 5 days seems so much easier so why not.....well I can tell you why not  After meeting they're criteria credit score and owing $160k on a house valued at $230k ( In they're algorithm valuation . ) I live in a 3 bedroom ranch/ 2 bath on a private court whos the last appraisal was 230k a year 1/2 ago, and the market since has heated up significantly. The zip code of my house is 48044 and I challenge anyone to find a similar home for 230k on my court. The last sale for a similar house was $269k in March. So Figure just tell the truth, you're looking for no brainer loans that don't involve thought or a little any research. The Better Business Bureau F RATING is fitting Avoid this company", "rating": 1}, {"title": "Concept is fantastic… poor execution", "text": "Concept is fantastic: computer model …. Etc …..Sadly too many gaps or intentionally setup to undervalue properties!!!! Figure uses 3rd party Valuation and deed updates.Very simple example…. In NJ market is on fire. Valuation I was presented was based on comps of roughly 2 years old. Operationally support member use words very loosely. For example number of times I was told “you have to own your property for 90 days.” In the real world ownership begins from the day you close and you are handed over the keys. In Figures language that actually means….The town/county has to have your paper work for deed updated over 90 days ago. So for example if town/county is delayed due to covid figures will have till county/town has info updated for 90 days. But wait!!! It gets worse!!!! Even if it’s been 90 days, it won’t matter because as mentioned in the beginning, Figures uses third party at unknown frequency to get updates for ownership of properties.Very unfortunate that logistically it’s setup for failure. Fantastic concept need better execution!!!! T", "rating": 1}, {"title": "This is very bad.", "text": "This is very bad.Do not even try just bad ", "rating": 1}, {"title": "DECLINED FOR CREDIT TWICE", "text": "this is a lender that after sending me a pre-approval code for credit few times and applying for credit twice, I have been declined twice, my credit score is excellent with no missed payments in as long as eight straight years if I could give them 0 stars that's what they will get from me. Also in order to get the low interest rate they offer in the pre-approval code customer has to pay 4.99% closing cost fees wich should be illegal, bc it's a HELOC not a refinance, local banks offer HELOC's for $300.00 clossing costs, absolutely RIDICULOUS on figure.com side.  PS 2 days later figure.com not happy with my review called me to make treats on myself. What kind of company is this? Do they really believe they are the only financing company in the USA..wrong, they are #90 out of 170 financing institutions, they get hurt for a bad rating we the consumers get hurt by hard pull on credit reports also. And they got 2 on me in 45 days, this figure.com team sucks. My credit line vs income? I'm using 8% of my credit CLTV? I was applying for 70% of my home value including your high closing costs of 4.99%. ass%*-+/.Sergio O Cervantes", "rating": 1}, {"title": "Ridiculous", "text": "Ridiculous, you have me fill all info, and then tell me you don't lend on condos...Congratulations !", "rating": 1}, {"title": "Figure seems dishonest from the start", "text": "Simply requesting their \"boilerplate\" disclosures docs is a no go. Instead, they first want to drain your identity info into their marketing database and run a credit inquiry. I imagine they sell your info out the backdoor, whether you qualify or not.Info requests are instead pushed to customer service cogs, allowing responses to be disjointed and blurring accountability. How convenient. They quickly become dismissive and rude if you insist on things. I would approach them with all the trust of poker sharks inviting you to a \"friendly\" game. I suggest looking deep in the reviews here, I found some gems. Also be sure to check out their Glassdoor reviews, there's rust under the hood, \"Leadership is unengaged, HR unable to support employees in a meaningful way, does not staff appropriately to volume, 'if you don't like it then leave' mentality, employee feedback dismissed, leadership in operations dismissive. Terminations are not communicated to the supervisors of the teams\" — gee how did I not have to guess this! Ok, I can't be all negative, so I will add that their glossy website interface is useful when negotiating with their competitors.", "rating": 1}, {"title": "I agree that the process they perform…", "text": "I agree that the process they perform is very good.  I was put into a very bad financial position. it was basically my fault. I didnt pay attention to everything that was listed for the terms. Please read everything before you sign. They are good people to deal with. I just wish they could of help us. Because of the way things were worded, I thought I had a good deal. For me disaster. Even my lawyer could not help .  I need the help i have asked for. Meaning that the monthly payment as indicated not doubled. I am 78 years old and need the payment and rate reduced. No one at Figure has offered any help at all. Once you deal is done, thats it. NO HELP. The response from Figure was not true. They have never tried to help. On a personal note Figure did not try to help in any way. They changed the rules . they turned me down, and hen put the money into my account without telling us. The rate was about 81/2%.I could not afford that payment. I hired a lawyer to sue They returned the fee charge of $3000.00. However when I asked about the rate, they said thats what i deserve. They have sold the loan to a company that collects late accounts. In my personal opine they didnt care what i did.. I am looking at filing bankruptcy,", "rating": 1}, {"title": "In accurate home appraisals no one to help :(", "text": "I was so excited to get a HELOC with figure and love the blockchain idea! Sadly when we applied we were quickly denied despite having fantastic income and a great amount of equity in our home. When I reviewed their documents about why we were denied it said that our home wasn’t valued enough. I then referenced the home valuation report they used to access our home and the information was complexity WRONG. We gave a 3 bed 2 bath two story home that is 1300 square feet and the report obviously referenced the house before it was flipped. It recorded us as a 2 bedroom, 1 bath single story at 900 square feet. The report even gave a confidence rating of the data explaining that most homes received a 60-80 meaning they had a high level of accuracy in their report. Our listed rating was 0!! A completely useless report and no one from figure even reached out to explain or try to figure out an actual appraisal of our property to gain our business. Sadly we are about to embark are a massive reno and I don’t think we’ll decide to go with Figure because of the lack of finesse in their appraisals. I would recommend Renofi as they hire an appraiser to go to your home and investigate comps in your area and they offer loans based on post reno values! Can anyone at Figure help me figure this out?", "rating": 1}, {"title": "Rate advertised isn’t what is applied", "text": "Rate advertised isn’t what is applied. I was not able to withdraw entire  amount. Closing account.", "rating": 1}, {"title": "A 3% loan origination fee for someone…", "text": "A 3% loan origination fee for someone with a credit score around 700 is ridiculous. This is a scam.", "rating": 1}, {"title": "Waste of time", "text": "There very first thing I did when starting my refinance with figure was link my IRS.gov account so they had access to all my tax returns and could see how much money I make.Two or three weeks in and I got a phone call from the man working my refi and he said he was just now doing employment verification, and was confused because I only make $5 an hour. I said I work in the service industry, that’s a tipped employee wage, I make tips as shown on my tax returns. But regardless that is not my main source of income, I run a business and most of my income is 1099. This was all new to him, like he had never heard such a thing. I sent over my 1099.Another couple weeks go by and I’m asked for a few more documents and such, things that I didn’t see were relevant at all, but got them over immediately when asked. Another 10 days went by I didn’t hear anything from them until I woke up with an email that said my refinance had been cancelled with no explanation.After making several calls phone calls to them I was finally told it was because they don’t accept 1099 income, and I didn’t have enough income from my side job alone. Thanks for wasting a month and a half out of my life Figure, that could have been told to me the first hour of this process. Now I have to start the process over and rates seem to have started going back up", "rating": 1}, {"title": "I am an existing Figure customer and…", "text": "I am an existing Figure customer and I'm shocked at how poorly I'm being treated trying to respond to one of their many offers to re-finance with special emphasis on Figure \"helping small business\" but honestly this company does not like self employed people! In the past I was denied even the oppertunity to apply for the SOLE REASON that I was self employed! Then once again for having \"more than two loans\" on my property! One of the liens was Figure, so go Figure!Anyway logging onto the website is a PITA, always having to wait a long time for an email confirmation that never comes promptly. What makes matters worse is the site is always hanging up in some part of the application process requiring you to contact Figure directly! I am a current customer of Figure with a HELOC, I have NEVER missed a payment or been late. I had the same issues as mentioned above when trying to apply for my HELOC as I am having with my re-finance right now, but it just feels like they make this big deal out of helping the Self Employed Small Business Owners re-finance but honestly it does not feel that way. I have almost 700 credit score, have 13+ years of flawless payment history and detailed tax records of my income, so really it shouldnt have to be this hard to get credit from a company that claims they specialize in financing small business owners.I guess you could say I'm a little disappointed.", "rating": 1}, {"title": "Closing cost are grossly overstated and outlandish.", "text": "When given an estimate of closing costs the amount they wanted to include for property taxes and HO insurance were, to say the least, ludicrous!  My ANNUAL HO premium which was paid through 10/20 was $2,020 and they wanted to include $4,200 in the prepaids and initial escrow deposit....OVER DOUBLE WHAT MY ACTUAL ANNUAL BILL IS!  On the property tax side, my ANNUAL property tax bill is $4,840 (including what I anticipate will be the increase next year) and they included $10,140 (again over double) !!   They did not even ask for my HO bill and/or property tax bill which could be used for ACCURATE amounts to include in the closing costs.  To top things off, these overinflated amounts are rolled into the loan balance, so if you elect to \"buy down\" the loan rate by paying points, YOU END UP PAYING SAID POINTS ON GROSSLY OVERINFLATED CLOSING COSTS.  Finally the rate quote I got on 7/16/20 was a \"buy down rate of 2.375%.  When I was completing the paperwork, THE NEXT DAY, they said the rate was 2.50% because my credit rating was 794 when every place I have checked it is well over 800.  Funny how on 7/16 my credit rating was good enough for the 2.375% rate and the very next day it wasn't.  Also note that the Favorable ratings posted are \"one-liners\" while those of us that have had bad experiences are much more complete!  I would very much be wary of this company.", "rating": 1}, {"title": "Stay away , worst than hard money lender", "text": "the worst place to deal with. deceiving practice and bad customer services", "rating": 1}, {"title": "Avoid for Mortgage refinance", "text": "They are great for HELOCs, but horrible for a mortgage refinance. I applied for a cash-out refinance on July the 7th, and due to a \"glitch\" in their system, it wasn't until July 23rd that they were able to process my application and make an offer. That was the first sign of the process being dragged out. I decided to continue with them because I had had such an easy experience with their home equity process, so I could forgive a little hiccup. Boy was I wrong. It took a month and a half of waiting for whoever does their title paperwork to get things straight, a job which my wife straightened out after going onto the county clerk's website to get the proper documents (it took her less than 10 minutes). Then they told me we would finally be able to close on October the 2nd. However, the week of, they inform me that there is another glitch with the system creating my closing paperwork, and the issue has been \"escalated\". It was escalated on the 25th of September (so I'm told), and that is where it currently sits. No updates on the \"escalated ticket\" and constant, \"I will get with my supervisor\" explanations. There are a handful of people that I can count on 2 fingers that actually call you when they say they will. So if you find that you are running into \"glitches\" in the beginning, run the other way. I will come back to update when/if this is ever resolved.", "rating": 1}, {"title": "Poor experience and extremely poor customer service", "text": "First, I have absolutely nothing good to say about this company.  I have an 800 credit score with over 25 accounts and an average age of 10 years with no missed or late payments and no negative marks EVER on my report.  I started a prequalification with Figure and to my surprise, I get a credit denial letter which states, \"we cannot help you because you have had too many inquiries in the last 12 months\".  Really?  I have had 8 inquiries in the last 12 months primarily dealing with my home refinancing which involved a lot of lenders checking my credit in order to come up with their offer.  As far as I know, such credit hits are supposed to count as 1 hit on my credit score.  I wrote Figure an email asking them to explain the issue to which they responded, \"our system flags your account as fraud or high risk\".  Forgive my profanity but F off Figure.  If consumers with 800 scores are credit risks then I think I would have serious doubts about Figure's artificial intelligence routines and what Figure's true motivations are.In response to the response: NO THANK YOU.  I got an outstanding rate and loan from US Bank - you are NOT following credit policy which is to make sure ALL inquiries of the SAME type are counted as 1 inquiry within a short period of time.  Fix your process for others as I will not use your service and thank goodness - I do not need to either.", "rating": 1}, {"title": "Bad Faith during Pandemic", "text": "I was an unfortunate victim of COVID. In a matter of weeks, the company I founded and grew 10 years ago was put out of Business. Until conditions improve, I cannot start back up (Nightclubs). I have a home equity loan with Figure. I have loans with several other banks on other properties. I placed all RE related mortgages under temp forbearance. I am not looking for a handout. These loans will all be paid with interest added to the back end of the loan.Recently, new legislation has been introduced requiring Federal Banks to extend Forbearance programs to 18 months for people who are still having hardship. EVERY OTHER LENDER I CONTACTED EXTENDED MY FORBEARANCE EXCEPT FIGURE. I have has several discussions with them and they have flat out said they are a private lender so the rules don't apply to them and their \"investors\". They have suggested that I not pay the mortgage and after 60 days they will contact me about other options for satisfying the loan. Of course by then my credit will be ruined. And this is a relatively small loan -under $75,000. I always pay my bills and I am not looking for any special help. Other lenders have gladly extended repayment terms due to the ongoing pandemic and I am only asking for an additional 3-6months Tops!Why they they wish to ruin my credit before talking with me seems arbitrary and somewhat mean-spirited. I am disappointed in what has happened in my industry but even more disappointed in this leanders attitude towards working with their clients", "rating": 1}, {"title": "The process was Quick and easyQuick and easy. Still waiting for my $200 Amazon card.", "text": "The process was Quick and easy. Still waiting for my $200 Amazon card.", "rating": 1}, {"title": "Is this a joke? Are these reviews even real?", "text": "I literally only tried Figure due to all the great reviews/ ratings here. Well, within 45 seconds of using their website, and “after careful consideration” (those exact words), my application was declined due to “insufficient collateral” because, according to their phone agent, “the system couldn’t find the address” of my home. Therefore, a mortgage-free entirely paid-off $340K condo is “insufficient collateral.” And there is absolutely no way around this system; there is no way to manually apply with ample available documentation that the home does indeed exist.So now Figure has my name, SS#, address, phone number, and date of birth, and they did exactly ZERO for me except waste my time and energy reading all these blatantly (fake?) BS reviews in the first place.This is a scam. BEWARE.**Edited to respond to company’s reply:I did call Figure, as my review states. So now you want me to call back to give you more confidential information, in order to receive the same “details” about how this so-called “revolutionary” automated system cannot be manually bypassed?From your reply, I gather situations like mine happen often enough to “cause frustration,” so why are you collecting so much sensitive information in the first place when all you need initially is an address? Particularly since the automated system is so blatantly faulty, if not downright fraudulent/ predatory.I have since searched the history of Figure and have found enough information to warrant plenty of concern about Figure harvesting such data, and my warning stands.", "rating": 1}, {"title": "Complete was of time.  Last minute rate hike", "text": "I selected Figure to do a refinance after reviewing some information online that said they were a top10 company.  The process seemed easy enough being mostly digital.  However, other than the initial information request the rest of the process was awful.  Every time I would get to the end where I would be able to lock my rate, it would come back that underwriting needed to review.  Send in more information and wait.  And then again more information and wait.  Every couple of days the interest rate would move by up to half a percent.  I spent a little time on the phone and found they wanted a copy of a document that required me to request in writing to get or give them permission to obtain, so I gave them permission to obtain it to expedite the process.  Then underwriting comes back wanting more paperwork......the same thing I have already submitted.  Even the person I spoke to was befuddled as to why they would ask for the same thing again.  After a month of dragging their feet, they claim they had to increase my rate as they didn't run my credit until the last minute and that the soft score and hard score (using two different calculatory methods) weren't good enough to warrant the numbers they provided me.  But if I was willing to pay an additional $4000+ in points I could get that rate.  An utter and complete waste of time.  And when I sent an unhappy email, the reply was sorry we'll forward this to the complaint department......as if I didn't know that was the trash can.  I'd leave negative stars if possible.", "rating": 1}, {"title": "Bad customer service", "text": "Bad customer service, and unknowledgeable associates.", "rating": 1}, {"title": "Expensive and poor customer services", "text": "Date of experience: September 30, 2022", "rating": 1}, {"title": "Figure is a great idea but poorly executed and inaccurate..", "text": "Figure is a great idea but so poorly executed it's laughable. I applied for a HELOC and was approved for $148,000, but when I hit save and continue to lock in my offer the page would not advance because of a bug. After trying repeatedly it then locked in an offer I did not choose. In order to fix it, the customer service rep suggested I cancel the offer, which she then did. But at no point did anyone explain to me that because this is on the blockchain every action creates a record that then affects any future rate or approval. So because of their buggy website and poorly informed/trained customer service rep on my fourth, fifth, who knows try to lock in the offer my offer dropped $120K and my rate increased 2%. I assume because the algorithm thought I was either a bot or a desperate shopper. The only recourse after spending three hours on customer service chat trying to resolve this, and finally having their customer service support line manager call me was a $150 Amazon gift card, a long story about how there is nothing they can do because you know...blockchain, and no HELOC. If this is what it looks like when the AI robots take over we are doomed. I really can't think of any scarier words than, \"we have to trust the algorithm,\" which their customer support lead kept repeating in a weird trance-like tone. Not good.Also, after waiting, they didn't even send the dumb Amazon gift certificate. If I were an investor in this company, I would run.Thank you for the reply Figure, but that is not true. This application attempt and re-attempt was in the space of a few hours and neither my property value nor credit score changed during this time. Your response here is fundamentally inaccurate and wrong, as your customer service representative lead that spoke with me could easily attest to.", "rating": 1}, {"title": "Delayed (by over a week!) Poor customer…", "text": "Delayed (by over a week!) Poor customer service.", "rating": 1}, {"title": "Don't get suckered by good reviews.", "text": "Don't get suckered by good reviews.We have a very standard situation with excellent credit and a small house that we wanted to refinance for a better rate and some remodel projects.  Figure had great reviews and a three week turn around promise. Firstly, it took over 6 weeks to get the refinance done and another week to get the payments.  Secondly, their \"dashboard\" never did work correctly as it would tell you there was new information on the dash and then there would not be.  But mainly it was the completely enept customer service reps.  We finally got to a point where we were only speaking to managers and even then about half of what they would tell us was not correct. aIt was only after we threatened to post an honest review and go to regulating agencies that we got any quick movement.  They were even a full day late in the disbursement process.   Figure asked us to document our experiences and we were told they \"forwarded them to their compliance team\" but haven't heard anything as to how they would be fixing their issues or even why we had so many issues.  They did send us a t shirt in the mail saying welcome to the team.  We got a second one since apparently they can't track their free advertising merch any better than their mortgages.Now as we are setting up our information with the new mortgage company (because Figure sold the mortgage right away)  Figure  closed out our escrow account and didn't get the new company the correct home insurance declaration... are we suprised?  Not at all. Bottom line is... if you want to hand-hold a company and follow their process this is the company for you.  Otherwise find another company.Edit:. The \"we'd love to discuss with you\" has already happened.  Nothing was done.  I've submitted pages ans pages of documtation Ana talked with managers.  Nothing has come of it at this point.  So \"we'd love to talk about this\" is pretty empty.", "rating": 1}, {"title": "Do Not Click Too Quickly!!", "text": "The user interface is clean and fast - perhaps enticing users like me to click through too quickly.  I never saw a disclosure that I was going to get a hard inquiry on my credit report.  If this disclosure was present during the quote process, it needs to be displayed with much greater emphasis.  This is especially true because you don't get to know all of the loan offer details until the end, after the hard pull has already occurred.  That was a real shame.Further to that point, I wanted to adjust my requested loan amount after learning about the add-on to my payment for insurance and tax escrowing.  Look, at the beginning of the loan quote process (the \"Payment estimator stage\") PLEASE include the insurance and tax escrow estimate in the payment!!! I didn't know about the escrow add-on until the end!  When I learned how much higher my payment would be, I asked my originator to let me adjust the loan request downward to compensate for this factor.  He told me I HAD TO PAY TO RATELOCK before he could make any adjustments to the requested loan amount!  Otherwise, I'd have to start all over and incur ANOTHER HARD INQUIRY in the process!!  For Pete's sake, I was just trying to ask for LESS MONEY like any responsible borrower should!In summary:- Know that the advertised, estimated payment at the beginning of the process is low-balled.  It will probably increase by at least 30-40% from an insurance and tax monthly escrow perspective, depending on your situation.  Just know that before going in.- Because, once you start, you can't stop or make any adjustments!!  Somewhere along the way, they do a hard pull on your credit report, and if you DO want to tweak your requested loan amount, it will cost you $$$ in the form of \"having\" to go ahead and \"lock the rate\".It's just too slick of a UX, with too few or poorly emphasized disclosures.And just an FYI, my current 1st mortgage does not require me to pay monthly escrow payments for insurance or taxes.  So while that apparently is a \"hard guideline\" for Figure Finance, there are lenders out there who waive that requirement.  They do not.  But you don't know they don't, until then end of the process and only then if you ask them.  Just saying.", "rating": 1}, {"title": "We bought 2 homes with Cash in 2019", "text": "We bought 2 homes with Cash in 2019, one in April across from a nice lake, and one later in November right on a Different lake that is only 2 miles from my office.  Both properties need some remodeling, and I received a prescreened solicitation in the mail for a quick 5 minute online approval with a reservation code.  The mailer was sent to my current address but was an offering for the smaller home I purchased in April and when I entered the reservation code into their website it populated the address automatically & wouldn't allow me to change it so I began a chat box with them asking how I could change the address to the home I purchased in November instead.  The employee who text chatted back instructed me to go back to the FIGURE home page and click \"find my rate\" to start a new application using the Address of the Home I wanted to get the HELOC on.  I did that, completed the new application, and submitted it.  Within a couple of minutes I was able to check the dashboard and was denied due to them being UNable to verify that I owned the property which I had purchased back in November 2019.  So I called in to them to talk to a human.  The first representative Brandon was professional but unable to offer any help other than the explanation that their entire approval system is digital and has no human overrides so he could do nothing.  When I expressed my desire to have my home location verified for funding he asked if I would like to talk to a supervisor to which I said yes.  The Supervisor came on in a few minutes and confirmed that the approval system is all digital and they have no way of inputting, title searching, verifying. correcting, nor verifying any home data it will happen whenever it happens automatically.  I shared with him that is unfortunate, even though this decision was based on a soft pull to verify my 763 credit score, it was still a waste of my time when I had planned on using my local bank anyways, BUT for once opened a piece of \"junk solicitation\" mail from FIGURE and then went online thinking this might be faster and easier... NOPE ...  Go with your own bank first whenever you haven't owned your home for a FULL year because their digital computerized system needs many upgrades before it will be able to recognize and verify the correct Title/Deed information to qualify anyone for a loan.  This is especially true when you are a CASH buyer and there is NO Mortgage on the property.", "rating": 1}, {"title": "Low rates but miserable loan application processing", "text": "Figure had rock-bottom rates and that's the end of my list of \"pros\". Seriously, the only bank to match my Rate Lock was Quicken Loans (biggest mortgage originator in the country) and that was because they were on the hook for a $250 gift card if they couldn't match. The rest is a long laundry list of \"cons\". Their website masquerades as a modern interface, but behind the pretty purple design is a clunky, buggy UX which functions terribly. I haven't even closed, but I'm so fired up I need to record this somewhere.#1: They require sign-on verification of income and assets, which theoretically sounds good until it doesn't actually work. I was literally signed into my paystub portal and bank accounts in the same browser window, but couldn't log in through their Plaid-module with the exact same credentials. When I contacted customer service, she told me I was out of luck. The sign on verification was required and they wouldn't accept old fashioned uploaded documentation. HOWEVER, once I successfully signed into the IRS portal to verify income, that unlocked their ability to--what do you know!--upload W2s/bank statements manually.#2: In my Loan Estimate, they didn't require nearly enough prepaids for Property Taxes (they required 6 months but my annual bill was due within 2 months!) When I called, the CS rep told me that the servicing company would cover any shortage when it came time to pay annual property taxes. When I pressed her and asked why they would pay more than $1k of property taxes when they could just require it upfront, she said that they are motivated to keep a loan in \"good standing\". She wasn't going to change her answer, so I chatted online with another CS rep to get that statement in writing. After a long delay they finally told me that once they ordered title work, they would adjust the prepaid amounts to be accurate. **WOW** it's a good thing I can put 2+2 together and not rely on some under-trained--but confident--CS rep to provide accurate info. #3: THREE weeks pass from my appraisal's completion to the time I follow-up to see when I'll receive notice that they approved my application. Two days later I finally hear back from servicing indicating that I still have documents to sign, documents to provide, and \"proof of other loan application that was opened.\" What?? I double-checked both mine and my wife's dashboards. NO DOCS are available to sign. I also had already provided the docs she requested over 3 weeks before. And why do they need proof I applied to other banks as I was rate-shopping? That has no bearing on my creditworthiness. Just do your job and get my loan to closing. TLDR: They claim a fast closing process. It's a lie. If you want to go through this headache in order to obtain a low rate, go right ahead. But you've been warned.**Bonus tip: I work for a bank and they are in violation of the Equal Credit Opportunity Act, aka Regulation B, which requires the rendering of a credit decision within 30 days of a completed application. I provided them with complete information within hours and we're now within 7 days of that Reg B clock going off. If they don't get their act together quickly, you can bet I'll file a complaint on the CFPB's website.", "rating": 1}, {"title": "Shady as hell", "text": "Really, these shady people need to solicit their \"business\" to people who are not DEAD. Received their shifty solicitation addressed to my father, who is DEAD and has been for almost eleven years. Let me repeat that: ALMOST ELEVEN YEARS. I contacted them, deeply upset and angry, and the person I spoke with only made it worse with the claims of \"partnership\" with the credit bureaus. I'm sorry? Nope. That's even shadier than the solicitation. I know the bureaus are crap, but they know my father is dead. I have received NOTHING financial addressed to him in oh... eight or nine years? You people are crap, your solicitation was shifty as hell, and I expect you're ripping people off and paying for your fake reviews.And yes, getting a solicitation for loans for my long-dead father UPSET ME VERY MUCH.", "rating": 1}]