[{"title": "Necklace came broken", "text": "Necklace came broken and without the pendant. After many attempts of communication, I never received a answer.", "rating": 1}, {"title": "Order never been delivered ", "text": "I ordered almost 50 days ago, and I didn’t receive anything, you were delaying the order then you put on the system that it’s delivered.I emailed you and no one answered.", "rating": 1}, {"title": "The worst customer service ever", "text": "The worst customer service ever. Tried to contact them multiple times throughout the month with my issue with no response except for “we’ve taken your inquiry” response. I understand it might take some time, I don’t care if it’ll take a couple of months to resolve my issue, but at least keep me in the loop. Jewelry comes in a very cheap packaging. There is 1 pouch, which doesn’t make sense, I bought 3 pieces for my friends, how am I gonna present them with no brand pouch? Very disappointed.", "rating": 1}, {"title": "Never received package", "text": "Never received package. Opened a ticket and never heard back from them even after following up.First emailed you on Jan 16 and just now got a response on Feb 11 because of the bad review. Just to say to check with the post office. Like I mentioned on Jan 16 I contacted the delivery service and they declared it lost. I attached their certificate declaring it lost.", "rating": 1}, {"title": "Didn't receive package", "text": "I didn't even receive both of my packages. It says it has been delivered but I didn't even receive the package and there's no way of knowing where the package even ended up. I am really disappointed. I was so excited to wear the jewelry I bought as well. Now the Vanessa flair team doesn't even reply to me after telling me to check with the neighbours if its was delivered. I checked and they said they haven't seen the package as well.", "rating": 1}, {"title": "My order was delayed 2 weeks even…", "text": "My order was delayed 2 weeks even though it already took 3-4 weeks to ship internationally. When i received my package it was missing 4 out of 7 items ordered. I didn’t get a refund or have any customer service information to possibly receive compensation. The package was not delivered to my home i had plenty of delivery issues . I had to get the what was left of my destroyed package from USPS after being lied to by USPS about where my package was located. They said they didn’t have my package for 2 days and then suddenly they found it and i was missing the important pieces of my package and never received the rest of them. I am very unhappy.", "rating": 1}, {"title": "Criminals", "text": "Criminals! Vanessa Flair sent me a different ring than I ordered, a cheap looking one, not even depicted on their webpage. I returned it, they received it, but never refunded my $64. So now I have no ring, and Vanessa Flair has simply stolen my money, and stopped all communication. Vanessa Flair is fake, located in Zhejiang in China, and should be reported to the police.", "rating": 1}, {"title": "Vanessa Flair Ambassors Recruitment Bad Experience", "text": "Vanessa Flair Ambassors recruitment is not reliable,  its not real!! Happend to me. Ive choosed the  \"free jewelry\" and they made me pay $ 30 for shipping but your order never arrived. I asked for refund but had no success. I don't recommend . I really didn't like the experience. Now they just dont reply to my emails. Its sad.", "rating": 1}, {"title": "This unfortunately is a scam", "text": "This unfortunately is a scam. They contact content creators/influencers etcetera offering them a collab. After being accepted (everyone gets accepted) they will send you free jewelry, however you do have to pay 30 USD shipping costs. The jewelry itself is however just cheap Aliexpress jewelry worth maybe 4 or 5 bucks. Don't fall for it! Also, protect your children from companies like these. They're specifically targeting children that have set up some youtube or Instagram channel. I myself am the manager of such an account and they thought they were dealing with the two minors that are shown in the content, not knowing they were in fact dealing with me as their manager.  So this is the worst kind of scam imaginable... Do not buy from them and most certainly don't accept the free items as they're not free at all!", "rating": 1}, {"title": "I never received my package", "text": "I never received my package. I was invited to become an ambassador, and I paid $30 for shipping last April. It’s been almost 3 months and I haven’t received my package.I contacted their support several times and they are of no use.The tracking number they sent me shows the package is still in China!I’m very disappointed.", "rating": 1}, {"title": "Received only part of order", "text": "Received only part of order, Never refunded.customer service very poor. Using copy and paste answers. Scams on promotional purchases and high shipping costs.I personally was scammed by this company", "rating": 1}, {"title": "Very shady", "text": "I got the same exact DMs word for word, even the exact same 30 minute time between me answering question to my “application being approved”, even though I never filled out an application, as another Instagram account and website called christianlawson.com and both websites look identical. Seems VERY shady", "rating": 1}, {"title": "POOR CUSTOMER SERVICE", "text": "POOR CUSTOMER SERVICEI received three lovely jewels from Vanessa Flair, which all promptly broke within 24 hours of wear. I reached out to the contact email I had sharing my concern and asking for a shipping refund. I sent in images of the broken jewels and never heard from them again. I reached out a second time, where I had to send NEW photos of the broken product. This was in APRIL 2022. I still haven't received a refund or follow up.", "rating": 1}, {"title": "Jewelry Scam- Beware!", "text": "Jewelry Scam- Be ware!I was smart enough to google reviews about VanessaFllair before \"choosing free jewelry\" on their ambassador recruitment plan. The \"free\" means you have to pay 30$ for shipping.Why I suspected them?1. I replied twice to their recruitment email AND the IG msg asking if their jewelry is nickel free as i'm very allergic. They didn't reply. Then i saw all their jewelry says \"nickel free\"- shouldn't their agents know this?2. It's flattering to be contacted on IG but stop and think why would they contact small accounts? and send you \"hundred of dollars\" worth of jewelry for free?3. Their IG account seems fake- over 200k followers and barely following anyone. The number of followers increases by tens of thousands each day. suspicious.4. Last but not least- I FOUND THEIR JEWLERY ON ALIEXPRESS FOR FRACTION OF THE PRICE! you can download the free \"find on AliExpress\" lens tool, i manages to find every pair of earrings (ranging 60$ a pair on VanessaFlair website) for about 3-6$ on AliExpress.Please be ware people.... check before you commit to giving them your credit card. even things that appear free may not be, and come in bad quality (18k gold plated? PLEASE)", "rating": 1}, {"title": "It's quite obviously a scam.", "text": "It's quite obviously a scam.Dont bother buying from them and absolutely dont become an abasdador. Its cheap quality rubbish not worth the shipping - scam.", "rating": 1}, {"title": "I really had high hopes for this…", "text": "I really had high hopes for this jewelry. It looked beautiful on the site. Upon delivery the jewelry looked cheaply made and overpriced for the quality. The stone fell out of my ring the first time wearing. So disappointed🥺", "rating": 1}, {"title": "I have so many bad comments to say that…", "text": "I have so many bad comments to say that I’ll keep it simple! Do not buy! I am an ambassador and I quit! They do not listen to a word you say, you talk to robots , because they don’t listen I got added 3 times and more as an ambassador. I have receipts for proof as they do not listen at all!!! Worst company ever , beware !!!!!", "rating": 1}, {"title": "Never received promised items", "text": "Never received promised items. Getting 2 of 3 what was ordered. Never again order from that scam shop. Highly not recommended!", "rating": 1}, {"title": "Horrible quality!", "text": "Every piece of jewelry either tarnished in one single day or broke. Literally. The first pair of earrings and necklace I put on broke, on the first WEAR! The only ring I purchased tarnished in a few days, without washing!!", "rating": 1}, {"title": "Never received my order", "text": "Never received my order, the tracking number sent to me by customer service is not a valid tracking number. Waste of money, never buying from you again and will never recommend it to anyone. ", "rating": 1}, {"title": "Return process an absolute nightmare", "text": "Products are fine but the return process is an absolute nightmare. Please do not buy from here if you’re not 100% sure about liking the product", "rating": 1}, {"title": "They tried to get me as an ambassador…", "text": "They tried to get me as an ambassador via Instagram. That's just a scam. Their products come from Aliexpress and cost only a few euros. Be careful it's a scam. Do not get involved in any case.", "rating": 1}, {"title": "I’m still waiting for my order.", "text": "I’m still waiting for my order.I try to contact the customer service and nothing.I do not recommend using the product.", "rating": 1}, {"title": "I was there as an ambassador", "text": "I was there as an ambassador, they make you promises and unfortunately don't keep anything, please be careful, the jewelry is beautiful, but the alleged service is very bad, you should keep your promise if you're already advertising them. be careful as an ambassador you are said to be offered 500 dollars only to get a rip off you do nothing except that you order and pay", "rating": 1}, {"title": "They message you asking to be a “brand…", "text": "They message you asking to be a “brand ambassador”, say you will get 3 pieces free, then when you go to order them they charge you $30 for shipping. Total scam. Stay away", "rating": 1}, {"title": "Interesting way to sell products", "text": "Interesting way to sell products, but I think they are breaching the code of conduct. You need to pay £30 shipping in order to get free products.", "rating": 1}, {"title": "I have never received the jewels I had…", "text": "I have never received the jewels I had paid for. I mentioned it to the customer service and a bot plainly ignored my complaint. A REAL RIP-OFF !!! Stay away from this company !", "rating": 1}, {"title": "It's been some time since my first…", "text": "It's been some time since my first order. I just did not receive it! Then I wrote to Vanessa Flair to check what had happened to my order. They told me first it was on the way, later they said id had returned to the company. I checked my mail for many weeks and nothing. Your service is the worst I have seen. I asked information about my order to track it and I was totally ignored.", "rating": 1}, {"title": "Not complete invoice with discount", "text": "Not complete invoice with discount. Lot of products missingLow quality productsExpensive shipping costs", "rating": 1}, {"title": "Free Product Does Not Mean $30 Shipping - SCAM", "text": "You guys are the worst company. Product is crap, customer service is crap, hand ambassador program is crap. Absolute scam", "rating": 1}, {"title": "Baaad quality products", "text": "Baaad quality products, i have now bought more than 10 pices og jewlery, and not one of them is “good” quality", "rating": 1}, {"title": "Hello!!!", "text": "Hello!!!!  I received nothing!!!  Your managers do not answer me (((We have a war in our country, and you dare to deceive people! Give me back my money or I will complain about you", "rating": 1}, {"title": "Scam Dumpster", "text": "ScamTry to sell their cheaper productcheck youtube & find dumb people had itIf you really want this items, buy it from aliexpress(worldride) or taobaoThis is china website own by chinese people", "rating": 1}, {"title": "One of the pieces I ordered arrived…", "text": "One of the pieces I ordered arrived damaged. When I reached out to support, they wanted me to mail it back to China at my own expense to replace it. Not worth it.", "rating": 1}, {"title": "All 3 of the jewelry pieces I got broke…", "text": "All 3 of the jewelry pieces I got broke super fast & looked super cheap. Very disappointing.", "rating": 1}, {"title": "I cant return my items!", "text": "I want to refund my items but the are not responding to my request to return them. I dont know what to do anymore. It's a 180 euro, I find it so rude.", "rating": 1}, {"title": "I never received my order from this…", "text": "I never received my order from this company. Please they are scam, don’t order from them", "rating": 1}, {"title": "Wanted to return the item but no…", "text": "Wanted to return the item but no response from the team. It was a complete waste of my money", "rating": 1}, {"title": "Isn’t it interesting how all of the…", "text": "Isn’t it interesting how all of the good reviews on this are all on the same day? Or one day after the next?", "rating": 1}, {"title": "I only received 8 of the 11 items I…", "text": "I only received 8 of the 11 items I ordered and the is the second time this has happened. Also, it took a month for my jewelry to arrive!", "rating": 1}, {"title": "3 times was trying to contact support", "text": "3 times was trying to contact support, no one answering me", "rating": 1}, {"title": "My product", "text": "I haven't gotten my products from September and I have text and sent an email but to no avail", "rating": 1}, {"title": "Scam", "text": "Scam. Not recieved all in order. Company Not event try fix that problem", "rating": 1}, {"title": "They tried to get my money by making me…", "text": "They tried to get my money by making me a ambassador.😂", "rating": 1}, {"title": "I bought i necklace after 2 times using…discoloration", "text": "I bought i necklace after 2 times using it got discolored 😞", "rating": 1}, {"title": "I paid shipping fee but never  received…", "text": "I paid shipping fee but never  received my order", "rating": 1}, {"title": "First order not deliver yet,from April", "text": "Date of experience: July 02, 2022", "rating": 1}, {"title": "I haven’t received my shipping", "text": "Everything is written in the title. I haven’t received my shipping.", "rating": 1}, {"title": "Worst ever do not buy Jewlery is cheap…", "text": "Worst ever do not buy Jewlery is cheap and customer service is terrible they never got back to me on a return never processed credit just took my money what a scam do not buy stay away To their response: I have emailed you numerous of times and no one emails me back this is the worst start up business I have ever been apart of and typically I am smart enough when to know better so stay away far away!", "rating": 1}, {"title": "I too was contacted to be a \"brand…", "text": "I too was contacted to be a \"brand ambassador\" on FB. I am always skeptical as I don't have enough followers to make an impact. Thanks to the person who did the review and said they make you pay an outrageous amount for shipping your \"free \" items! No physical address on the website, which makes me extra skeptical, along w/ an emotional backstory.", "rating": 1}, {"title": "products quality are very cheap and…", "text": "products quality are very cheap and prices are very high . They send you a messages to become an ambassador and will send you for free items , but you still need to pay for a delivery . My delivery cost me 30£ for this money I can buy good quality bracelet or charm from Pandora . I think all products they selling came from Aliexpress", "rating": 1}, {"title": "Very bad experience", "text": "Very bad experience. Getting \"3 Free items\" to be \"ambassador of product\" But have to pay for postage, which was more expensive than received 2 of 3 items. Paid 30euro , items worth about 3euro. Never received 3th item. Before paying, really nice and easy contact, after paying, almost impossible get positive answer. Scammers.", "rating": 1}, {"title": "Please refund the money I paid for shipping.", "text": "I ordered jewelry and paid for shipping.  After a certain time, the site said that the package had been delivered, but I did not receive it.  For several days I looked for it in post offices, then I wrote to technical support, they promised that I would receive them in a week.  A week later, nothing has changed.  After a few more correspondence with technical support, it turned out that my package did not reach me and returned back.  Then I asked for my money back.  I wrote to support several times, they only promised to return, but in fact nothing has changed.  If anyone is reading this please take action to resolve this situation!", "rating": 1}, {"title": "Scam. Avoid at all cost.", "text": "As many others have stated, this is an \"ambassador\" scam where they offer you 3 items for free to promote.The items are cheap and poor quality. The cost of postage is more than the items are actually worth.This is without doubt a scam as they contact people with very little online footprint.", "rating": 1}, {"title": "Poor service and quality of product. Paid delivery you pay for scrap", "text": "Getting offer to be ambassador. Soo order \"Free\" 3 items. delivery cost very dear. Received just 2 items. One item (finger ring)very poor quality Worth not more than 3€. Before ordering very nice and fast communication with them. Now, almost zero contact. No one cares. Definitely not recommended this website.", "rating": 1}, {"title": "Its a scam", "text": "Its a scam, They will contact you in Instagram for the ambassador program and ask you to select 3 jewelry for free.but here is the catch. they will ask to pay the shipping chargers. the product value is less than the shipping cost and here is how they make money", "rating": 1}, {"title": "Chinese company and poor quality.", "text": "Date of experience: July 04, 2022", "rating": 1}, {"title": "Spam and robot answers", "text": "Spam, no real answers. Robots. A lot of mails. Just a little mess..", "rating": 1}, {"title": "They didn’t deliver what I ordered", "text": "Date of experience: October 05, 2022", "rating": 1}, {"title": "The 29 international fee is what…", "text": "The 29 international fee is what stopped me in my tracks. They messaged me on Instagram about being an ambassador and that I could receive 3 items for FREE. When I searched their site they was over priced, jewelry looked cheap. One picture I could see scratches on earrings. This is a SCAM people beware", "rating": 1}, {"title": "didn’t receive my order", "text": "Date of experience: March 21, 2023", "rating": 1}, {"title": "Fake fake fake", "text": "Its a scam. Watch out! They are hiring you as an ambassador on instagram. They are selling overpriced jewellery with zero valuation on their website. They are trying to pay you 29$ shipping fee. This is how they are trying to make money.", "rating": 1}, {"title": "I never received any items.", "text": "Date of experience: July 01, 2022", "rating": 1}, {"title": "Vanessa Flair = dropshipping", "text": "Beware, Vanessa Flair is a scam. The jewelry sold for about $80 all cost $2 to $4 on Aliexpress. I was able to check with the Google Lens app (by scanning their photos). This is dropshipping, and it's illegal! They are looking for ambassadors to look like a real brand created by a woman, when it's a man behind this scam. Do not become an ambassador for them, you will gain absolutely nothing.ps : I already have an objective opinion, the quality is the same.", "rating": 1}, {"title": "The ambassador scam", "text": "They contacted me to be an ambassador for the brand even though I am not an influencer and I just have 600+ followers. I said twice that I wasn't interested but still they pressure me by sending me a discount code for 3 pieces of jewelry. I checked Trustpilot straight away and I saw this is what they do, they are trying to get you to pay the shipping fee for jewelry that looks like it's not the best quality. ( I can not say much about the quality I just can see what people have expressed here)I definitely think it's a scam because no one will give 300 dollars worth of jewelry for 30 dollars to a person who it's not present on social media.", "rating": 1}, {"title": "Scam", "text": "Be careful everyone it’s a scam Company. They offered 3 pieces jewellery for ambassador program but you have to pay $29 shipping fee to receive the jewellery. The jewellery is $6 on Chinese website. They are scamming you with this. I wish I have read some of the comments here earlier. I tried to cancel the order right after I realised this within the 24 hours. Never get a reply from the email. (I sent 4 email in 10 day from the first hour) It almost felt embarrassed I fallen for this stupid scam. I’m glad I recall this now before I share to my 10k followers…I hope this helps.", "rating": 1}, {"title": "I want everyone to read this carefully.", "text": "I want everyone to read this carefully.This company is a deceitful scam using cheap Chinese jewellery sold at high prices. Their glowing customer reviews and ratings stem from the fact that they either hack social media or employ someone to do it for them. My instagram account was hacked and used to dm 100&apos;s of strangers who have used hashtags in their post to indiciate they have enough common interestes to buy internet jewelery. My Instagram account is not the only account that has been used against the owners wishes to do so.Stay away from this garbage dump at all costs.", "rating": 1}, {"title": "I want everyone to read this carefully.", "text": "I want everyone to read this carefully.This company is a deceitful scam using cheap Chinese jewellery sold at high prices. Their glowing customer reviews and ratings stem from the fact that they either hack social media or employ someone to do it for them. My instagram account was hacked and used to dm 100's of strangers who have used hashtags in their post to indiciate they have enough common interestes to buy internet jewelery. My Instagram account is not the only account that has been used against the owners wishes to do so.Stay away from this garbage dump at all costs.", "rating": 1}, {"title": "SCAM  I should have read the reviews…", "text": "SCAM  I should have read the reviews before buying any jewelry from them.  I bought it and after a month I still haven't received anything.  I tried emailing them to cancel my order with no response.  Beware of this “company”", "rating": 1}, {"title": "I didnt recieve my order", "text": "Date of experience: August 22, 2023", "rating": 1}, {"title": "Haven't even gotten my order...", "text": "Haven't gotten my order after literally 6 months, and I'm supposed to be an ambassador.... You'd think that they would ensure their own ambassadors would receive the goods.", "rating": 1}, {"title": "They are con artists", "text": "They are con artists. They say that the jewelry is free and thy want people to promote them but in reality they are duping people. Charging 30 dollars for terrible fake jewelry that is worth 50 cents.", "rating": 1}, {"title": "Vanessa Flair sent me the wrong…", "text": "Vanessa Flair sent me the wrong product. (A cheap fake ugly ring, not even presented on their webpage). After returning it to them, they have not refunded me my $63. Stay away from this company.", "rating": 1}, {"title": "Just scam ", "text": "Order never received. No answer from customer service. ", "rating": 1}, {"title": "Read their reviews", "text": "Read their reviews, it is a bit fishy that each review starts exactly the same way. They offered me free products but never click on their link it is fraud.", "rating": 1}, {"title": "terrible", "text": "terrible. never received my products. terrible customer support", "rating": 1}, {"title": "Its a scam", "text": "As the other one start reviews said, they will contact you to be their ambasador, ask you to choose 3 jewelry etc etc.", "rating": 1}, {"title": "Don't let them to scam you!", "text": "Don't let them to scam you, they promise you'll recieve products for free as their Ambassador but in the end they will make you pay 30$ for shipping. Which is against their own policy because ATTENTION - as they say in their FAQ - \"For orders over $60, shipping is free.\" Oh, really? But if I choose 3 products from your website the value will be certainly much more than 60$ so why you want me to pay shipping fee during all this ambassador talk?This company wrote to me on Instagram, they asked if I want to be an Ambassador of their products. Ambassador my foot! They said all I need to do is to pick 3 products from their website and I'll receive them FOR FREE. My work is to make Instastory or post with photo of their products mentioning their company name every month. Before I choose the products I decided to check reviews on TrustPilot. After I learnt the company is a scam I confronted them asking if it's true they want Ambassadors to pay 30$ for the shipping, I was just curious what they'll say. Guess what, after I asked them, they stopped answering me. No more words needed, this is pure scam.", "rating": 1}, {"title": "Vanessa Flair is a scam!!!", "text": "Vanessa Flair jewelry is a scam! They ask to join their ambassador program and claim to send 3 pieces of free jewelry every month. However, their jewelry is not authentic and is very overpriced on their website. The jewelry is indeed sent for free, but you end up paying $30 for shipping. Their jewelry is worth about $2-$4 per piece, so they end up making money from every ambassador that orders their jewelry. If you ever worked with brands, you know that its all about sales. And if you don't drive sales the brand won't gain anything from working with you. Then why would a brand like Vanessa Flair send their ambassadors 3 pieces of jewelry EACH MONTH that costs $75-$80 on average??? BECAUSE THEIR JEWELRY COSTS $2-$4 AND THEY MAKE THEIR MONEY FROM THE SHIPPING COSTS EVERY AMBASSADOR IS PAYING THEM + anyone who does end up purchasing from the ambassadors. Anyone who has ever owned real gold jewelry can detect theirs is not authentic 18k gold plated as they claim. Please be careful who you work with as an ambassador!", "rating": 1}, {"title": "do not buy anything", "text": "do not buy anything, the brand is a scamThey will ask you to be an ambassador to withdraw money from youEverything is false", "rating": 1}, {"title": "Liars", "text": "You are liars", "rating": 1}, {"title": "Scandalous", "text": "Scandalousthe so called jewlery is no more than basic steel and looks as cheap as it is.DO NOT BUY", "rating": 1}, {"title": "Horrible customer service", "text": "2 out of the 3 Items came broken! When emailed regarding it there was nothing done about them", "rating": 1}, {"title": "SCAM WATCH OUT", "text": "The regular old scam where they try to sell you $1 jewelry from AliExpress for $80", "rating": 1}, {"title": "No refund", "text": "I didn’t received any refund for a broken bracelet received. Very bad experience", "rating": 1}, {"title": "I signed up as an ambassador but I was…", "text": "I signed up as an ambassador but I was not happy with the service that I got.", "rating": 1}, {"title": "This is a scam and I bet all the good…", "text": "This is a scam and I bet all the good reviews here are fake. Sad people lol", "rating": 1}, {"title": "Looks like an Instagram scam", "text": "Looks like an Instagram scam. Reviews have a fake fake look.", "rating": 1}, {"title": "I have never received the articles.", "text": "Date of experience: June 24, 2022", "rating": 1}, {"title": "Hi there,", "text": "Hi there,I’ve chosen to provide your company with a detailed review of the 3 products I chose from the website. While I would much rather wear the jewelry and post to instagram to promote the company, I don’t feel comfortable doing so considering the quality of the products I received. The CLAIRE earrings were definitely the best of the 3, they are heavy and seem well made and sturdy. The SYNIM necklace I wasn’t so impressed with. I honestly looked at this piece and thought “I could have made this myself”. The gold circle is just a large jump ring, which is open. The two sides don’t even touch- this looks incredibly cheap. The circle of pearls is actually just a circle of plastic beads. Lastly, I’m not sure what you mean by waterproof- because if I were to wear this in the shower I’m sure the plated stainless steel would not be a gold colour for very long. Lastly was the Monroe ring. If I’m honest I bought a ring so that if I loved the products, I would be able to wear one of each piece for a photo to post. But looking to choose online I was really turned off by all of the ring choices due to the fact that none of them were actually closed. I understand this is cheaper for the company as you don’t have to stock multiple sizes, but it looks incredibly cheap and there is no need for that considering it cost $70 on the site. I’d also like to add that one of the stones in my ring came cracked or scuffed or something which made it matte and not sparkle like the rest which really stands out. I tried to get it in the photos. I’d also like to point out how cheap and scrappy the packaging was. Perhaps my expectations were just too high but for jewelry, I was expecting at least a box. The cheap plastic envelopes and baggies were not a welcome surprise. If I’m honest, my initial reaction after opening the bubble mailer was “I’ve been scammed”. Other than the plastic, the stapled piece of paper with the bow on it attached to the necklace really screams ‘made in china’. While I appreciate not having to pay the $220 you would have charged for the three pieces, I did have to pay $30 in shipping which is odd and outrageous because the mailer said it had only been sent from Ontario. Overall, I am not satisfied with the quality of the products I’ve received and I believe they are extremely overpriced on your website.", "rating": 1}, {"title": "Quality is Sooo bad", "text": "Date of experience: June 24, 2022", "rating": 1}, {"title": "true thief and liar", "text": "Date of experience: June 24, 2022", "rating": 1}, {"title": "Never received my order.", "text": "Date of experience: March 04, 2022", "rating": 1}]