[{"title": "I don't know what is suddenly happening…", "text": "I don't know what is suddenly happening with WU. Only had one historic bad experience but now two payments have gone missing in three days! The customer service and lack of correspondence is shocking. You have been warned!UPDATEAfter numerous emails etc I have had my money refunded. I then received further emails telling me they needed more time to find my transactions, followed by further emails asking me to finalise payments. Absolutely shambolic! And your standard reply to these reviews is nonsense. There is no option to physically talk to anyone! Shame on you!", "rating": 1}, {"title": "FYI ‼️‼️worst possible way to send your…", "text": "FYI ‼️‼️worst possible way to send your money is trough this WESTERN APPLICATION! your expecting maximum 24hrs for your money to be sent in your account yet this western union will hold your money. imagine i sent the money 24hrs ago yet when i tried to follow up my money, the costumer service said that my money will be sent on NOVEMBER 18?! like really Western Union ?! how convenient for you to hold costumer’s money for that long time ? they have the worst costumer service and you cant rely on them specially when that money you sent was for emergency purposes. AFTER THIS NEVER AGAIN WESTERN 👎🏻❌🙅‍♂️", "rating": 1}, {"title": "My money was not transferred in full amount. . …", "text": "I sent money to my friend in Turkey couple times but she is receiving less than what she is supposed to.She was supposed to receive the amount in Turkish lira but Western Union agent said they do not have enough so they gave her the amount in US dollars which is ok. The problem is that they gave her the amount $20 less than what she is supposed to receive.  I checked the amount in Lira, dollar and Euro before i transferred..This is not the first time they do this ..I reported the case but no one called back.  I reported it a second time.. hope someone can assist", "rating": 1}, {"title": "VERY UNRELIABLE SERVICE", "text": "VERY UNRELIABLE SERVICE. If you need money transferred in minutes DO NOT USE Western Union. I sent money for transfer at around 7.00am on 28/10/2024 to Nigeria as i write it hasn't been received! Customer service do not seem to have the resource to deal with it. They are trained to flob you off. I tried another money transfer company to the same receiver it went instantly! I have literally begging western union to transfer my money or refund my money! Please i am begging western union to please transfer the money. I have no business or contract with the receiver bank. Please please please transfer my money. ", "rating": 1}, {"title": "Make sure you keep all stubs and receipts if they are lost", "text": "Don't lose your money orders bc you'll be waiting until Christ comes to get refunded. ", "rating": 1}, {"title": "Cannot delete profile and chat is a blank page", "text": "I need to delete my profile. Support page says to contact the customer service, but the page at the link is a blank page with only this text \"Chat is available 24 hours / 7-days a week\" - which sounds like a joke. Tried it in multiple browsers.", "rating": 1}, {"title": "I Western Union will not fulfil their duty of care!", "text": "I was scammed through western union, I deposited €1500 at my local post office for what I believe to be a transaction with the receiver. The idea was I give the receiver the.MTCN after we have completed transaction of the product (a car ) but before I even provided the MTCN  to the receiver the had already collected the money. I was lead to believe my money was safe with western union until the MTCN was provided and this was not true. Western union have been terrible sorting this problem and have just been sending me from one department to the next. One day I’m told I will get a refund and the next day I’m told I will not. ", "rating": 1}, {"title": "transfer takes too long! ", "text": "the service has been a huge disappointment. If you’re counting on timely transfers, look elsewhere—your money might take days to arrive. I’ve reached out to their support team several times, but all I got were generic, pre-written responses that didn’t help at all. It’s clear that customer satisfaction isn’t a priority for them. The whole process feels unreliable, and if time matters to you, I wouldn’t recommend using this service.EDIT: I provided this identification number of the transfer in my review. where should I send it to so you can take a look? ", "rating": 1}, {"title": "I have 8 transactions that WU promised…", "text": "02.11. Response regarding your message dear WU. I have sent 5 mails to you without your answers. I have called you, but no call back as your system has been down in all those times when I have called. So please stop that kind of lying and act. You can see my messages for sure. I have 8 transactions that WU promised to return to my account. They have not done it within the time limit promised. I have over 10000 Dkr hanging in their account and they do not even bother to answer to my mails, call me back etc... This is WU Denmark customer service. Absolutely unacceptable. ", "rating": 1}, {"title": "Just to send 100$ from UAE to bank…", "text": "Just to send 100$ UAE to bank account in Egypt...it take 15th days....Is too much time all this hard proses after sending money with online services...is too bad transfer service..This last time to use This company..It's easy to go Egypt to handling by my self ", "rating": 1}, {"title": "I open my app the sending rate is 39.56…", "text": "I open my app the sending rate is 39.56 I log on its 39.56. I put in amount to be transfered then the sending rate is 37.31. Regardless of pickup or bank account. Disingenuous advertising fix it western thats close to fraud.", "rating": 1}, {"title": "I transfer $50 using Australia post’…", "text": "I transfer $50 using Australia post’ paying cash physically, providing all the information and bank details of the receiver, more than 24 hours, money transfer is on hold. When called 1800, they want me to provide date of birth of the receiver whose bank details already provided. Common sense prevail. My money is on hold, if ask for refund will take 45 days. Looks that I have to lodge official complaint to the govt authorities ", "rating": 1}, {"title": "Worst customer experience", "text": "Worst customer experience! I tried to send some money to my family in N.Z. and it was a disaster from start to finish. Three times I had to ring up and ask why the money had not been sent, only to be fobbed off with excuses and false promises. I was told I had not replied to an email they had sent (they hadn't), would claim they never received my email when that issue was sorted and they would then process my request within 30 minutes (4 hours later, it was still pending). On the final call, when I proved I had more than sufficient funds to cover the transfer, they wouldn't accept it as I had to provide additional documentation regarding proof of income and amount of assets! As if anyone would provide financial details to a call centre in a third world country! Out of sheer frustration, I cancelled the transaction and now refuse to use this company again. I cannot believe a company can be so inefficient and indifferent to customer service and they should be ashamed of themselves.", "rating": 1}, {"title": "Unreliable service ", "text": "Unreliable service, don't expect your money to reach in time, if time is important to you use another service  . Money transfer by them takes days if not weeks. Support don't have any satisfactory answer. I tried contacting support multiple times but received an answer in a pred defined template format.They don't care about the customer satisfaction at all.", "rating": 1}, {"title": "Had to send a PHOTO of my card for…", "text": "Had to send a PHOTO of my card for verification. This was after having to send a photo of my passport and after having to authenticate/approve the payment with my bank - which both in itself would be plenty secure enough. To take a photo of my card, I have to still have my card. If I had my card, I would not need to send myself money to Western Union, would I.", "rating": 1}, {"title": "Money didn’t deposited in receivers account ", "text": "I transferred money to India on October 20th, but as of today, October 23rd (11:30 pm), the funds still haven’t been deposited into the Indian account. Their customer support is terrible—it’s impossible to get any meaningful help. All they say is to wait 72 hours, with no proper assistance or resolution.", "rating": 1}, {"title": "I send money on Saturday but they…", "text": "I send money on Saturday but they process my money on Tuesday. That money we need ungetly. Because we are using that money for travel abroad one of my family supposedly her flight tuesday evening. But need to cancel because the money that I send last Saturday they process on Tuesday. I asked them whats the reason why they delayed the money that I send they said because I send it on weekends but on that they I send to different bank accounts the other one just only few minutes then they received the money already. I spend more money for expenses because my family waiting in other country, need to stay in the hotel while waiting the money to credited to her bank accounts. There sorry and apologize can't help it's causing stress to much when they delayed your money specially the money that you send is in need urgently.", "rating": 1}, {"title": "different exchange rate  ", "text": "Hi guys, I'm sorry, yes, I have to leave you a negative review, but today, after 4 years of using the application monthly, I was very disappointed to discover that my friend, to whom I recommended the application, had a much higher exchange rate than I had oh me, although I refuse to believe that I was so gullible, but today was the last time I used the application and I'm not just talking like that, I have proof of the receipt from you, the same city, the same country, and the exchange rate is different. I greet you with disappointment  ", "rating": 1}, {"title": "Even after uploading source of fund…", "text": "Even after uploading source of fund every time I sent money, they still ask the source of fund and it is pain in the ass.", "rating": 1}, {"title": "Behind the times with WU", "text": "Such a old fashioned company. They're like being in the stone age when it comes to transfers. I use Wise Payway and MoneyGram. All great online transfers. If you have family and friends overseas and they have difficulties none of these companies Will make you go into an actual shop after your third transaction. In my humble opinion this is just my review.", "rating": 1}, {"title": "As an international company", "text": "As an international company, try to use terms that might be common to different countries and cultures.... as for example a PIN code and a ZIP code ??? Very different meaning depending where in the world you are. Thanks", "rating": 1}, {"title": "Every Second their Rate Change", "text": "Every Second their Rate Change, just Open Website will High Rate As Soon you Log On to your Account the Rate Drop by 10% and Never will be the Same.Go to their Agent they will you Totally Different Rate.Tried it more than 10 times a day will Never get the Rate Soon before Log ON. As for Rate they will ask 100 of Question and than they Give you Rate, why don't you give me Rate First, If I am happy than I will Proceed, No answer their 100 Question FirstWish could give them Less than 1 Star.", "rating": 1}, {"title": "£11.00 fees for £200 transfer", "text": "£11.00 fees for £200 transfer, plus 10% loss on exchange rates.Outrageous. Used WU only because was an emergency, otherwise would never ever us it, nor will I use it again in the future. For context, £1 = 22.78MDL today, but WU decided that 20.80DML for £1.00 is good enough. Stay away. Use any other, just no WU.Thanks", "rating": 1}, {"title": "I experienced a fraudulent situation…", "text": "I experienced a fraudulent situation through the Western Union (WU) mobile app. After sending money, I was offered a $20 cash back deal through a third-party site called free-shipment.com (also known as free-delivery.com). The process required me to submit personal information, including my bank details. Initially, $1 was deducted, but a few days later, I noticed an additional $19 charge. When I contacted the company, they explained that the charge was for a membership, which was surprising. After several calls, they agreed to cancel the membership and process a refund.The most frustrating part was trying to report this issue to WU for the safety of their customers. The wait time to reach customer service was extremely long, and when I finally connected, the representatives couldn’t provide any real help. It felt like a waste of time, and overall, the experience was very disappointing.", "rating": 1}, {"title": "Account was hacked. $1000 missing and Western Union could care less. ", "text": "I had a terrible experience with Western Union. My account was hacked, and $1000 was transferred from my bank to a stranger without my permission. When I reached out to their customer service for help, they told me there was nothing they could do! This is completely unacceptable. As a customer, I expect a company like Western Union to take responsibility for security breaches and provide support to resolve issues like this. Instead, I was left frustrated and with no assistance. I will not be using Western Union again, and I strongly advise others to be cautious with their services.", "rating": 1}, {"title": "NEVER USE WESTERN UNION", "text": "901-366-0884. NEVER USE WESTERN UNION.Since 9 October, my transferred fund was rejected. Been calling their customer services, they told me by 7 business day. they funds will be CONFIRMED refunds to how I am transferred to them. On 17 October, no refund. On 19 October, I called their customer services, they told me to wait and they will checked. On 21 October, they ask me to show them prove that I have transferred them the money and did not received. I have emailed to them. On 23 October, they said it is not cleared. I resend sender and receiver bank statement. 25 October, told me to wait for their accounting reply. Till now since 9 October, you can see their process from one department, push to another one then another one. They did not practice what they have been saying within 7 business day. I have been following up but my response to them to delay and delay. Excuses and excuses that their customer services (which I think someone later will reply to this review to tell me to contact or email to them) cannot do anything but to forward my request. Please see it for yourself how this company works and how inefficient is this company. Please do not transfer any money more than US$500 if not your money will be struck or might be gone. I really wondering are they scammer company, tested the small money can go through but when come to big money. it will be gone? Today is 1 Nov, case no solved. Their answer is still WAIT. ", "rating": 1}, {"title": "Their rewards program is a farce", "text": "Their rewards program is a farce - it never works (bait and switch), and when you need the funds to be transferred immediately they don't- when you don't they do! Customer service, while nice, never can do anything to help.", "rating": 1}, {"title": "You are giving them a loan when you send moneyb", "text": "After send money for three years to the same person they decided to put 7 day plus holds on the transfer. They blame it on the bank which is nonsense. That money left my account 4 days ago and they are playing the float. So they lie to you, too", "rating": 1}, {"title": "Card refused and impossible to send my order", "text": "You have refused my card i have sent x times money with how can you refuse now? My account is provided in money for this ,,its unbearable", "rating": 1}, {"title": "It's simple ,it's a love hate…", "text": "It's simple ,it's a love hate relationship,I used to love WU but now I have to take so long to transfer money from WU to bank back to WU then wait to see if it got trough ? Too long too stressful so I'm looking elswherwe..elsewhere", "rating": 1}, {"title": "Walmart Employee Theft ", "text": "My son and daughter went to Lloydminister Alberta to visit their grandfather who is 84 so I sent them each  $150 for a meal or gift to buy him. My son went to the Walmart to pick up cash, since he had a USA drivers license and I used a postal code from Saskatchewan which I never told him they said no cash payment could be made and would have to go on a debit card. So he never received his cash and funds disappeared. I rang the Walmart and a lady asked for a description of the person working. The lady on the phone was Philippine which ironically when I rang my son back he said the lady was Philippine. Do not use Western Union for Cash pickup only use if the recipient has the App and can redirect the funds into their account. U.K. toll free is in India and said phone breaking up and would talk on phone. A Complete Fraud Corrupt Service! ", "rating": 1}, {"title": "VERY POOR CUSTOMER SERVICE RESPONSE", "text": "Your contractor for customer service gave me an incorrect MTCN and the receiver made a dead run to WU to retrieve their funds to no avail. Without a MTCN your contractor said he could not search and find the transaction that was in question. Very pathetic customer service which is not their fault but the tools WU provides them. I spent a lot of time on this problem and was kept going around and around with no resultion. No very happy with WU!!!", "rating": 1}, {"title": "It is unacceptable what they are doing", "text": "It is unacceptable what they are doing. They are putting my money on hold although it was taken from my account for 3 days and still going. I need the money transfered I wrote them to either release the funds or return them back to my account I cant wait 5 days for them to get their stuff together there are too many other providers that I can use, I regret using their s**t service. Aside from that you cant contact them directly automated responses everywhere. Just trash", "rating": 1}, {"title": "Software is complicated and bad", "text": "Software is complicated and the worst from banks. Totally user-unfriendly. I hate it using WU.The worst software-developpers ever and not good tested.App and also PC - it is both the same bad quality.Only problems.You promised me a voucher in June 2023 - now it dissapeared.also today: I had 153 points and could pay my transaction with points. Then they disapeared after changing the default payment (there should be NO default) from Google pay (not often used in Europe) to Credit Card.Really bad sowftware and my points earned are gone. Why do I collect points when you steal them and this bad software deletes them?Really bad software and not tested and the business it testing all cases. Backward and foward.Software written from beginners.", "rating": 1}, {"title": "Never allows me to pay via online", "text": "Never allows me to pay via online. Customer service is no help, just advise to pay instore. Not only paying online saves me time and money its very convenient because im disable and dont move about well. If i could give 0 stars i would.", "rating": 1}, {"title": "Unable to verify identification", "text": "Unable to verify identification due to technical issues within the UK. So 'money in minutes' has so far been 24hrs and still unable to send urgent funds! Response from WU...keep trying or we can refund! Not a happy customer 😒. ", "rating": 1}, {"title": "Wrong receiver name issue", "text": "I sent a 1500P yesterday and I had to change the debit card info, when I sent it the amount was sent to the wrong person that was on the list. I attempted to change/edit the name, it said it was sending a verification code to my cell number, resent it the second time, never received it. Then the system locked up... I need help with a refund, I have already sent again to the right person, now I need to reverse the prior send to a Anna Fe Chan of 1500P back to my debit card", "rating": 1}, {"title": "I am sick to the back teeth with…", "text": "I am sick to the back teeth with western union, I send money regular to family in Africa, and the regularly block payment and ask me to provide the same evidence again and again, surely someone there knows what they are doing and not totally inept.Hmmmm....maybe not!", "rating": 1}, {"title": "Cannot send money via the website", "text": "Cannot send money via the website.  Keeps asking for a different payment option.  When I call customer support it tells me that I have exceeded my monthly limit and I have to go to the store to pay to release the block.  There is no where on WU's website that shows monthly limits.  I've gone to the store and sent payments six times now and still cannot send on-line.", "rating": 1}, {"title": "You are not accepting my Bank account…", "text": "You are not accepting my Bank account information, and sending me the code: C7773.I validated my third part transactions with Bank of America and it worked, for one transaction, then on the second transition I received the C7773 code again.The bank verified you as a payee, but on your end it is not allowing me to continue with the payment???I had to eventually use my debit card, which I don't want to expose.", "rating": 1}, {"title": "We could not process your transfer (C1974)", "text": "After 3successful  transfers the fourth Could not be processed (C1974)  I received a message CHANGE payment method Visit a Western Union office.I tried few times to fill out and make the transfer with the same miserable result.Ihavd up and is stuck and unseccessful and wonder why? May be too many transfers,I dont know. I really hopeby tomorrow I appreciate an answere why and (meaning of the error code) and guide me through be successful,thank you.RegardsSvein Wiktor Kinander", "rating": 1}, {"title": "You can not use promo codes even when…", "text": "You can not use promo codes even when excepted,  spent 47 minutes on hold with 3 different people and no one could help and then when I tried to do it with a representative it was a disconnected line.  Your web site is slow and does not function properly.  I wasted over 2 hours and the only way I could get my transfer to go through was to delete the promo code.  Its just a game for you guys.", "rating": 1}, {"title": "Website Freezes after log in ", "text": "your website does not function using GOOGLE, FIREFOX, or Duck Duck Go. It has been extremely difficult to use Western Union for the past few months542. Is this a common problem? are there any fixes for this problem? Is there a search engine that operates well with WU? Please advice. ", "rating": 1}, {"title": "Stupid site", "text": "Stupid site, stupid creators. Many times they blocked the account and the translation without explanation, when all the documents are in order. \"Wait 30 minutes\" while they check the translation. Waited for several hours.", "rating": 1}, {"title": "Artificial nonsense as an excuse?", "text": "My two past transfers failed.Western Union's processes didn't work. After about a month I received a long email, the little content contradicting itself, may be machine generated...I doubt that this new transfer will work.", "rating": 1}, {"title": "Duration for transfers is random", "text": "Duration for transfers is random? Between the same two accounts, have been transferring money between these accounts for more than a year, some transfers are instant, others are up to 5 days. Why?", "rating": 1}, {"title": "Higher fees than usual", "text": "After reporting a single incident of Fraud, Western Union has increased my fees. I have been a faithful client for years and see no reason why now I must be punished for trying to do the right thing. Can someone give me an answer that is not a corporate platitude about serving customers or some other nonsense. Like everyone in the corporate class, your leaders want bigger yachts where they can have cocaine parties and pretend that they have a semblance of morality or shame.", "rating": 1}, {"title": "EVERY TIME I try to log in I have to…", "text": "EVERY TIME I try to log in I have to change myy password      I am getting tired of this.    See thaty it does not happen again      I could NOT recomened your service to anyone if it keeps happening", "rating": 1}, {"title": "Extremely bad experience", "text": "Very bad experience,  payment delivered after 1 week not good service. Staff even dont know how to deal customers. They asking copy of senders ID also. Like im sending money after given my all details ho van reciever have my id copy. Very disappointed 😡", "rating": 1}, {"title": "Later delivery of money ", "text": "When submitting transfer it said money would be delivered same day.  I sent one transfer on Sept 27th and it is still not there.  I just send another and again it said it would be delivered real time then a notice popped up saying that it would be delayed.  The late delivery notices where after transfers were submitted.  If I cancelled then it takes along time to get money back", "rating": 1}, {"title": "\"Issue with Exceeding Limit on Cash Pickup for Western Union Transfer\"", "text": "A friend from the USA sent me money using the cash pickup method, but when I went to the bank in Nigeria to collect it, I was told that I had exceeded my limit.This is confusing because the sender only sent me money twice this month (September), and the total amount is just $200. How could I have exceeded my limit?Can the sender try again next month in October? Or is it against Western Union’s policy to send money more than twice in a month? I urgently need clarification and a solution to this issue.", "rating": 1}, {"title": "Rubbish platform", "text": "Expensive  and inconvenient system. Other platforms are much more better than this.It gives too much headache while transferring money. I have used it three four times since 2020 and every time I faced problems and had to go to the agents at the shop again and again for troubleshooting. Yesterday I sent money to Afghanistan through post office, but received text message today that it was not proceed. I called the customer service they told me to go to any agent and receive the money back. I asked him to send me the locations, he sent me the link for nearby locations, although on Google map the shops were shown open,  but when I went thereThey were closed. I went to two locations. First one was 36 High st, lye Stourbridge DY9 8LB, but the agent was very rude and impolite, first he did not want to talk just shakinghis head, when I asked questions, he was telling me that it is Sunday very rudely. Then I went to the next location No 25 same street and it was closed. Finally I came to another location 5 Halesowen, the agent told me that I should go to same location which I went yesterday. I told her that she needs to talk to a manager as there should be a way. She was kind listening to my request abd inally after two hours I managed to resend the money but it cost us to pay £25 more than yesterday. The actual amount was £240What a rubbish system. I will never use western union again. ", "rating": 1}, {"title": "First name letter error", "text": "I tried to send myself money from the US account and it kept saying that my receiver first name (who just happens to be myself) had a character that was not a letter, and my name doesn't have any strange characters at all. I had to transfer from my US account to my BE account, losing money on that transfer, and then lost some more money on the WU transfer.", "rating": 1}, {"title": "It says 1 to 2 days for international…", "text": "It says 1 to 2 days for international transfers. I sent it on the Thursday and my receiver won't get it until the following Tuesday. That seems like more than two business days to me. Why do you lie on your website and say it will be 1 to 2 days and then send me an email saying it will be a week? I'm going to find a new way to transfer money and stop using you. It used to be instantaneous and now it takes all this time. Don't tell me it's the bank I'm transferring it to because I have already talked to them and you're holding my money. You're making interest off my money. It almost seems like a criminal act to me and I'm going to report you to the better Business bureau. You're straight up lying on your website.", "rating": 1}, {"title": "Refund never issued. Dishonnest and contradictory customer service agents (calls and live chats)", "text": "Since August 12th, Western Union has lied to me about a transaction that never went through. When I call their agents, they all have different versions, never consistent, and always contradicting themselves. Last time I called them, they said they issued a refund on September 13rd, but one I never got an email, two there was never a refund. Today is 42 days after that transfer and they still have not issued any official statement, and absolutely no refund.", "rating": 1}, {"title": "This is my personnel account----not a…", "text": "This is my personnel account----not a scam like you claim on my CC. Get people who understand English. The Dates were Oct 8th. When this happens. Not happy Western union sucks ", "rating": 1}, {"title": "I don’t understand what is going on…", "text": "I don’t understand what is going on with this company. They have a very bad process with transfers internationally. If they are unable to send the transaction in a timely manner, their solution for you is just to wait. Even if you need the money urgently, the only solution is to wait. Their customer service team have different answers and are not honest with what is really happening. They just say they cannot give any other information than to wait.", "rating": 1}, {"title": "I can't to send my money yet.", "text": "I can't to send my money yet.I'm doing all regular process and this isn't enough. I hope that Western Union resolve my case as soon as possible.I should to clear that is the first time that I have inconveniences with Western Union in 3 years. However I'm keep trusting of them.", "rating": 1}, {"title": "ON HOLD Every time", "text": "Every time I send money it shows on hold and it’s just a big issue. I’m actually in the process of looking for a different way to send money since this happens every single time!!", "rating": 1}, {"title": "Very slow ,I sent money from UK to…", "text": "Very slow ,I sent money from UK to Zimbabwean mobile wallet it only took all day and going into the second without it delivered to the recipient.....very slow ,not good for urgent issues and emergencies ", "rating": 1}, {"title": "I tried multiple times to send money 2…", "text": "I tried multiple times to send money 2 days in a row. I even changed computers and all the time, it kept saying transaction could not be completed despite me confirming the transaction on my banking app.Secondly, I find it annoying the fact that I have to verify myself every time I do a transaction. ", "rating": 1}, {"title": "Money on hold for sometimes days ...", "text": "Started off ok but be warned if you have an emergency as my wife has recently then you could be in for your money being placed on hold for sometimes days at a time, the staff are not helpful and actually come across as rude.My wife's son is in n hospital (Philippines) and needs money transferred quickly to cover the costs.Despite going through all the procedures with identity and confirming relationships to receivers (we even sent a hospital bill as evidence of the nature of our transfer)....and still our transfers are routinely going on hold now, the reason is give as we need to make a few checks and \"if it's been more than 48 hours you can send us a message\" well thanks very much WU.I think we are done here.", "rating": 1}, {"title": "Refund money order", "text": "On July 31, I opened case to get a refund for money order. They told me it would take approximately 30 days and I waited. When I saw that I had no response, on September 9, I chatted and they told me it was processed, and on September 13, they told me it was already in delivery. Today, still without a response, I chatted with Mayuri V again and she told me that the case was not processed and that she would reopen it. Nobody gives me an answer, on the contrary, they even lie to me saying that it is already in delivery (you can verify in the chat). I don't think it's fair that after two months it hasn't even been processed and she just tells me that they can't tell me how much longer I have to keep waiting.", "rating": 1}, {"title": "The \"verification process\" is horrible…", "text": "The \"verification process\" is horrible and much too complicated.I am quite furious of the time spent for this, and I am still not aure id everything is OK.I use WU regularly, but TODAY the system decided to act up and be difficult,  and for a quite SMALL amount of money.This is simply not good enough!!", "rating": 1}, {"title": "WHEN CUSTOMERS HAVE ISSUES THEY ARE…", "text": "WHEN CUSTOMERS HAVE ISSUES THEY ARE COMPOUNDED BY WU STAFF RESPONDING USING THE SAME SCRIPT ....VERBATIM...ADVISING THAT THEY WILL FORWARD THE ISSUE TO \"A HIGHER CONCERNED TEAM\"????....NOT A MANAGER OR SUPERVISOR THEN !!!....I'VE EXPERIENCED THIS MULTIPLE TIMES.", "rating": 1}, {"title": "Reviewing Transfer", "text": "First, I am unable to send money with the credit card I have used many times.  Now, you are reviewing my transfer and that is taking far too long.   The website said I could cancel that and start a new transfer, so I tried that.  Nope, reviewing again.  We need to send money to family in Thailand who are dealing with massive flooding.", "rating": 1}, {"title": "Stop asking for ratings", "text": "Stop asking for ratings! Every time I make a transaction, I have to close the ratings box before I can see the confirmation details. Very annoying. Give me an option to \"Never ask again\"", "rating": 1}, {"title": "Imposible to make a transfer on the website", "text": "I encountered multiple issues attempting to complete a transfer, which was repeatedly declined. The representative indicated that the bank was declining the transaction; however, I tried using three different cards from three different banking institutions, each with the same result. This experience raises concerns for me, as it appears to direct customers to make in-person cash transactions instead. It feels unusual for all banks to flag these transactions as suspicious. more than 1 hour to get help over the phone.", "rating": 1}, {"title": "This site sucks", "text": "What went wrong??  Let me count the ways.  Your miserable F'ed up site made what should be a simple procedure take nearly an hour!!  It asked me the cellular number of the recipient, which was not accessible, it kept defaulting to send $100 and wouldn't let me change it, then it defaulted to the wrong recipient.  When I tried to type in the credit card number, it wouldn't let me do that either.  It makes me jump through hoops to claim a \"reward\" and I still cannot do it.  I have two words for western union:  F YOU!!", "rating": 1}, {"title": "ripp off exchange rate…", "text": "the amount of local currency indicated to be received differs when sending in reality by 6% less!The exchange rate by western union is purely ripp off.No reward when sending money frequently.", "rating": 1}, {"title": "My transaction didn't go through and it…", "text": "My transaction didn't go through and it takes 4days before they confirm that it was unsuccessful. The worst thing is the bank charge me for a fee because I used my credit card which is I am not aware that there is a charge when using credit card. The money that suppose to be my mum's medicine in the Philippines was delayed and charging me a big amount. ", "rating": 1}, {"title": "Western I ask to stop giving other…", "text": "Western I ask to stop giving other deals and or offers from other business to shop for products and to join a service and start the new points/discount plan you promised since January 2024.", "rating": 1}, {"title": "Very bad experience from last 3 months…", "text": "Very bad experience from last 3 months money stuck payment for 72 hours. And customer service is way hell bad. Please every one leave this platform. Join so.e other app way better. I recomend not to usethis app. They are utterley useless.", "rating": 1}, {"title": "My sister and I use to buy money orders…", "text": "My sister and I use to buy money orders from Western Union. When someone stole our money orders we were told(by a detective who handled our case) to report it to Western Union forgery department to get our money refunded. We did and Western Union told us they didn't have to refund us our money even thou they were stolen. This is disheartening. In my opinion Western Union is the worse money order place to get money orders from.  I advice anyone not to use Western Union due to their lack of heart and compassion. ", "rating": 1}, {"title": "Sending money to myself, not easy (I am in the Philippines right now)", "text": "Sending money to myself is an absolute nightmare. To your support, the Norwegian Bank ID system is also horrible, like turning back the time when we were using steam engines.", "rating": 1}, {"title": "The page does not fully upload", "text": "The page does not fully upload. I am not sure if I am sending the money two times or not. I need to click on the 'send' button several times before it is sent. When dealing with money I expect a more clear delivery system.", "rating": 1}, {"title": "Already 5 payments didn't come to the…", "text": "Already 5 payments didn't come to the receiver. I'm the sender. One payment are done on 22/06/2024 and still NOT at the receiver!!!! I have make each time complains, but no result even now on 3/10/2024!!!My name is Willem H. from Belgium. With My WU # 466.594.054Pls contact me in WhatsApp +32..endid 513 or in my E-mail address you have.", "rating": 1}, {"title": "The money isn't delivered.", "text": "Reference number 28573874Tracking Number (MTCN) 2138891210Western Union website shows the transfer transaction is complete. However, the money isn't delivered as it should be received on September 22, 2024. The money has never showed up at the receiver bank. Contact Us section at WesternUnion.com is a dummy chat which isn't actually talk it's just give options. The option to complaint is to contact Customer Care.Customer Care gave me Transfer Code and asked to go to the receiver bank. The receiver bank mentioned the Transfer Code isn't exist. Western Union sent me a letter saying that the money has been picked up. Logically, the receiver bank stated they don't have the transfer code, how the money has been picked up? Please ...Contacted Customer Care again and they admitted there was system update and some transactions were affected. They said will give me update but never heard anything and they haven't delivered the money. Please send the money as my family need it.I will update this review when the money is actually delivered and note the actual date of delivery.", "rating": 1}, {"title": "They rejected my money transfer 3 times…", "text": "They rejected my money transfer 3 times at different dates without telling me the reason. I called them but all they say is they do not know . I ask them who can I call but they said wait till voicemail comes in hangup the phone. Terrible customer service. ", "rating": 1}, {"title": "Bad experience since 2 months", "text": "I have been a loyal customer with Western Union for more than a year now. Until September this year, all the transfers has been going through well. In September, when I did a transfer from Thailand to India, the delivery date was mentioned as 2 weeks later where this used to be within minutes normally. I escalated this on the call center and I dont know what they did, the money got credited next day. But now I had an emergency and scheduled another transaction which had the same issue, delivery date after 2 weeks!!! Even wire transfers are faster than this. When I contacted the customer care, they said there is nothing they can escalate!!!! And I need to wait!!!! When I was in staying in Europe, I used Wise for all transactions and never once in 8 years I had such issues. Western Union needs to take responsibility and work on issues if they still need to keep the customers or else better companies can surely take advantage with better service", "rating": 1}, {"title": "you offer a discount but naturally when…", "text": "you offer a discount but naturally when I try to redeem it...Glitch...Why not just offer me nothing instead of stupid flashy BS that don't work.", "rating": 1}, {"title": "Payment Cancellations", "text": "My transfer was cancelled. I received the 'ready to pick up' message so the recipient was told they could collect the money......but then they were told that the payment had been cancelled.... by WU. If WU are going to cancel a payment they should have said so before issuing the 'ready for pick-up' message.", "rating": 1}, {"title": "Everything!!!!!!!!!!!!?", "text": "Everything!!!!!!!!!!!!?Website never works. Constantly having to change password, sometimes 2-3 times trying to make a simple transfer. Big Suck ", "rating": 1}, {"title": "Transfer  blocked by Western Union with no reason given with no reason given ", "text": "Wuen displaying my WU MTCN the WU shows the transfer as arrived at my bank. Case 287034992Mtcn 8286531801After fidling with the WU helpbot for hours I finaly get access to a human who tells me afrer a long wait that there is a issue with \"the\" bank, since the remittend paid cash I assume it is my bank. Checking with my bank they cannot locate the transfer...I finaly get a help phone number from wu help bot, but iy is a 1 800 number that does not work from europe...I contact again and finaly get a case number287034992Now it is 1st if Oct and I am still waiting for the money transfer on my accountOct 16th , still no update on why the money as not been sent to my account. WU totaly clueless.", "rating": 1}, {"title": "Western Union is playing unfair … ", "text": "Sending money to my loved ones in Venezuela is a nightmare. I have been using Western Union for a long time and every time I send money, the receiving office in Venezuela, whichever it is, gives the recipient a small part in US dollars and the rest in local currency according to the official rate; the official rate is much lower than the one on the street!, which makes the recipient lose more money and Western Union earn more money from the transaction in addition to the commission they charge for giving you your money! This is an abuse in the handling of other people's money and it is unfair!————Enviar dinero a mis seres queridos en Venezuela es una pesadilla. Llevo mucho tiempo usando Western Union y cada vez que envío dinero, la oficina receptora en Venezuela, sea cual sea, le entrega al destinatario una pequeña parte en dólares estadounidenses y el resto en moneda local según la tasa oficial; ¡la tasa oficial es mucho más baja que la de la calle!, lo que hace que el destinatario pierda más dinero y Western Union gane más dinero de la transacción además de la comisión que cobran por entregarte tu dinero! ¡Esto es un abuso en el manejo del dinero ajeno y es injusto!", "rating": 1}, {"title": "NO FAIR!!!!", "text": "I have been waiting on a replacement money order for the last 3 months. The one replacement check came in but was already canceled and I couldn't cash it. Now they keep giving me the run around. This isn't fair and it's wasnt right. Now me and my wife are homeless because we couldnt get replacement money orders ro pay one month's rent 3 months ago.can someone please tell me what to do?", "rating": 1}, {"title": "I MAKE THIS TRANSFER EVERY MONTH AND…", "text": "I MAKE THIS TRANSFER EVERY MONTH AND SOMETIMES THEY TURN ME DOWN FOR FRAUD. I LIVE IN THE PHILIPPINES AND TRANSFER MY SS AFROM MY AMERICAN BANK TO MY WIFES BANK IN THE PHILIIPINES .IAM MARRIED TO HER AND WE LIVE TOGEATHER AND I DONT KNOW HOW YOU CAN GET FRAUD OUT OF THIS. CALL ME IN THE PHILIPPINES AT 63-912-468-0337. I WILL BAD MOUTH YOU ON YU TUBSE A NOT A RELIABLE PLACE T ODEAL WITH. JOHN FOSTER", "rating": 1}, {"title": "Long customer service wait time, and long transaction processing times", "text": "My experience has been extremely terrible. Not only were there significant delays with my transactions, but the wait times were unacceptable. I won’t be recommending this service to anyone. I’ll be using MoneyGram next time.", "rating": 1}, {"title": "having to wait for a transfer", "text": "having to wait for a transfer, after not ever having to wait is stupid...and unprofessional.  My gawd, this is so annoying.... clear the transaactions and let's move along. ", "rating": 1}, {"title": "in the past 2 weeks sending money ha…", "text": "in the past 2 weeks sending money has required multiple calls to my bank and western union. I have been making these transitions for a couple years, WHY is this now a problem?????", "rating": 1}, {"title": "Irriresponsible & Non reliable", "text": "Hello,I have been a customer of Western Union since 2012; my parents are also customers.My brother-in-law was recently diagnosed with Leukemia, and I sent $480 to him in India to help him pay the hospital bills. I have several transitions to prove that he has been receiving money. Only on 10/03/2024 did I send the money to him using the saved receivers in the Western Union Account, and my brother-in-law didn't receive the money. We waited one more day to see if it was a transaction delay. On the 4th, the money was delivered, but my brother never received the money. So I returned and found that the account and phone numbers were changed in the saved receiver. I thought someone had hacked the account, so I called Western Union. They responded poorly by saying the transaction was complete. So I had to call them three times to start an investigation finally. Minus the wait time and transfers! They told me I would get an email from them after the inquiry. On 10/06/2024, I got an email saying that the transfer was complete. It is as if I need an investigation to find out the status of a transfer; shame on the people who made this system and shame on people like me who believe in it.I am on a call with them today, 10/11/2024. I hope I can find some answers.Sincerely,Mridhul George", "rating": 1}, {"title": "So frustrated…", "text": "I've been using WU for a long time and never had an issue, until very recently. When sending money a little bigger than I usually do, the WU system asked me to provide additional information like DL, my kind of job, my position, etc. which I provided as I understand I am sending a bit bigger than usual. Then updated my address since I changed address. After all those details have been provided, the system is giving me an error message: \"This address cannot be a PO box.\" I was like...what??? My address is NOT even a P.O. Box! I checked multiple times if I entered my address correctly and yes it's been entered correctly. How come it's giving me that error message! Then I called customer service and I was asked to provide A copy of my ID via email which I did. The customer service said it will take 24 hrs to fix the issue and I will receive email confirmation. After more than 24 hrs I am not receiving email. I went in again in WU website, using the App, still giving me the same error. then switched to my desktop, and then laptop. again, the same error. What is going on? Until now I am not receiving any email confirmation. My brother needs the money already. I called customer service to follow up but only told to wait for the confirmation and can no longer do anything since I already provided my ID. WU is no longer reliable. I am so frustrated.", "rating": 1}, {"title": "Your site kept showing me as living in…", "text": "Your site kept showing me as living in the foreign country that I'm sending the money to.  I live in the USA but your site says that I live in Uzbekistan and I try unsuccessfully to change it.", "rating": 1}, {"title": "My account was suspended ", "text": "My account was suspended because of verification issues.I did send in my passport for verification but no reply.", "rating": 1}, {"title": "Even tho I talk to a agent every time I…", "text": "Even tho I talk to a agent every time I send my mom money they still freeze the transaction first. When she need the money we have to wait hours on it because the pre scan it Everytime.", "rating": 1}, {"title": "My transfer was never sent…", "text": "My transfer was never sent and nobody cared to send me an email explaining the delay.When I called to ask about it, I was never given a reason.I wasted weeks waiting for a reply and long time waiting for a cancellation.", "rating": 1}, {"title": "your system needs up dating", "text": "your system needs up dating, I have not been able to see my transactions on your web site since 7/21/2024", "rating": 1}, {"title": "YOU KEEP SAYING REWARDS ARE ON HOLD SO…", "text": " YOU KEEP SAYING REWARDS ARE ON HOLD SO HOW LONG IS THIS GOING TO BE ???? I HAVE 20 POINTS AND HAVE NOT BEEN ABLE TO USE THEM AND WHY IS IT THAT IT IS CHEAPER WHEN I GO TO A STORE AND SEND MONEY???? BECAUSE IT IS ALWAYS HIGHER WHEN I SEND FROM MY COMPUTER. WHEN ARE YOU GOING TO FIX THIS???", "rating": 1}, {"title": "Rewards program is a joke", "text": "I've been sending money for 15 years, and have NEVER once been able to use my rewards points to cover the fees from their portal. For 15 years there has always been an \"issue\" with the website. They change the issue from time to time to cover their scam. When you call, they say, \"Oh yes, we're having a problem with the website right now.\" Disgusting business practice. UPDATE: They responded below by saying they're implementing a new program for rewards points. I've been told that for years. Never happens. And they say, \"You may visit MyWU.com to redeem your points.\" Either they're lying to everyone who reads my complaint or they didn't even read it themselves. You cannot redeem points from the website. You have to process the transaction with an agent on the phone and that takes forever. It's set up intentionally to discourage you from redeeming your points. WU: try again, you can do better. 2nd update: I discovered you can use your points ONLY on NEW transactions. If you do a Quick Resend, you get a dialog showing NO REWARDS POINTS. Please fix this as I use this method for 99.9% of my transactions. ", "rating": 1}, {"title": "My transfers keep getting blocked", "text": "My transfers keep getting blocked. I am trying to send money to my daughter for medical reasons. No one would help me resolve the issues. If there was a Zero rating, I would have picked that.", "rating": 1}, {"title": "WU sucks", "text": "Western Union is such a pain in the ass. I have to go through all of these security questions and then they still want to review the transfer. I have had more trouble with western union than they are worth. Too bad there is no real competition. That's why they suck", "rating": 1}, {"title": "Western I ask to stop giving other…", "text": "Western I ask to stop giving other deals and or offers from other business to shop for products and to join a service and start the new points/discount plan you promised since January 2024.", "rating": 1}, {"title": "The page does not let you know when an…", "text": "The page does not let you know when an entry is accepted. After each entry, the page stays the same for a few seconds, leaving the user wondering if it was entered correctly. This is a design flaw. Feedback is not given. ", "rating": 1}, {"title": "You suck!!!!!!", "text": "My wife is standing in an office in Santo Domingo because you cock suckers want to review a $50 transaction. F you and your bs ass system", "rating": 1}, {"title": "Always some problem.", "text": "Always some problem.Transfer cancelled for whatever reason.And when it finally works it takes way too long.This has been going on for years.", "rating": 1}, {"title": "Always it shows review your transaction…", "text": "Always it shows review your transaction ,later it get declained, web page is very slow.", "rating": 1}, {"title": "Slowwwww", "text": "Used Western Union to send money from Australia to bank  account in Thailand.First time took a few minutes.Second time took 12 days!Same sender & same receiver in the same month.", "rating": 1}, {"title": "Takes 24 hours to confirm my bank…", "text": "Takes 24 hours to confirm my bank payments - no \"money in minutes.\"", "rating": 1}, {"title": "Western I ask to stop giving other…", "text": "Western I ask to stop giving other deals and or offers from other business to shop for products and to join a service and start the new points/discount plan you promised since January 2024.", "rating": 1}, {"title": "Hold your money they keep transfer fee", "text": "They're always holding my money refusing to send it before you call them them place you on hold for over an hour 😡", "rating": 1}, {"title": "The worst experience", "text": "The worst experience. The website performance was poor and keeps on hanging. Tried multiple refreshes still same. ", "rating": 1}, {"title": "not one transaction could be processed…", "text": "not one transaction could be processed normally, it etheir goes on review or gets cancled.. HORRIBLE!", "rating": 1}, {"title": "Longest money transfer is western…", "text": "Longest money transfer is western union.They say , they can’t expedite it.This sucksMTCN 1340440570", "rating": 1}, {"title": "Western I ask to stop giving other…", "text": "Western I ask to stop giving other deals and or offers from other business to shop for products and to join a service and start the new points/discount plan you promised since January 2024.", "rating": 1}, {"title": "Incorrect first name spelling", "text": "I spent  a great amount of time on the phone to get my first name corrected. I was informed that they would close this account and I would have to reregister with the correct spelling. NOTHING was done. So today I tried to delete the account. I could not delete my account and reregister with the correct spelling of my first name. Please provide me with an answer in writing.", "rating": 1}, {"title": "The app freezes regularly ", "text": "The app freezes or doesn’t allow me to finish transactions online without specifying the reason. Frustrating to deal with.", "rating": 1}, {"title": "This is my 2nd complaint", "text": "This is my 2nd complaint. I was told that I would get my replacement money order delivered to me over night. I haven't seen anything yet and it's been 2 days now. My wife and I are homeless due to damaged money orders that we needed replaced. It shouldn't take 3-4 months to replace a piece of paper when they know I'm telling them the truth. We needed that money for a new place but now can't get it because the deadline has passed because we're waiting on Western Union. She's disabled and I'm unemployed. Now we have to live out of our truck. So what can we do? Who do we reach out to because I've tried everything. I'm starting to feel like they are trying to strong arm us and keep our money. That's $2,000 that belongs to us and can't get it because they can't get right. Or should I say they don't want to do right. I'm about to call corporate and see what happens now. If that doesn't work, then I'll go further. ", "rating": 1}, {"title": "Your Customer Service is the worst I…", "text": "Your Customer Service is the worst I have ever dealt with.   No one knows anything.   No Supervisors are available.   They can't tell you why transactions are denied, They can't tell you limits (are they daily, per person, per month).   They can't send or receive email.  I spent 1:20 on a call today only to get hung up on twice.   YOU GUYS SUCK.   FOLLOW-UP:   A guy claiming to be from Trustpilot contacted me, but he was in the backyard with dogs barking and pots clanging.   He was going to change WU to resolve my problems.   WHAT A JOKE.   Some guy in his backyard in South Asia will change WU's policies.     OK.1.  Tell the sender why a transaction has been declined and what they need to fix. Is the amount too high? Is there a monthly limit for sending to a country? Is there a maximum amount you can send to an individual? You guys don't know. Your website is contradictory, and your customer service \"CAN'T\" answer anything. 2.   Have the ability to escalate a question to a supervisor.  The person at the base level doesn't have the authority to explain the issue.   One month, I can send a person $500.   Next month, I will only be able to send $250.   WHY?   If the base-level WU partner doesn't know, transfer me to a supervisor who can look into the question and get back to me. 3.  Money transfer is essential in some situations to fund transactions, feed families, and allow construction/travel.   You are hurting people if you can't tell me what's wrong with a transfer.   Maybe the zipcode is incorrect.  Maybe the bank that is receiving the money has an issue but when no information is pro.   The Customer Service folks don’t know anything.4.  The language used by the agents is poorly chosen.  “Sir, I’d like to help you with an answer but I am not allowed to tell you what is wrong”   “Our policy is to not tell people why their transactions failed”   AGAIN,  is this a joke.", "rating": 1}, {"title": "Transfer failed several times.", "text": "Transfer failed several times.Your program kept changing the name I was sending to.", "rating": 1}, {"title": "No help when needed...", "text": "The last payment I sent was due to arrive at the receiver's bank on 9/12. It has been in progress for more than two weeks. I have called twice and can get no help. I'm only told I cannot cancel and get my funds back. I have to wait. Well, I'm still waiting, and so is the receiver.", "rating": 1}, {"title": "I have spent 50 minutes trying to send…", "text": "I have spent 50 minutes trying to send money to my inmate son. I tried the new inmate thing.  I would not go beyond  chasing inmate. I tried over and over.  Then I added the app.. it wasted 20 minutes of time.  Finally came back to basic.  Signed in.  Wanted to resend. Tried adding new card. It took 4 or 5 times to get it to work. What is going on with your site and app??? ", "rating": 1}, {"title": "Every time I try to use a promo code my…", "text": "Every time I try to use a promo code my transfer won’t go through. The minute I delete the promotion code, my transfer goes through.", "rating": 1}, {"title": "The truth is that I'm very upset…", "text": "The truth is that I'm very upset because they are canceling my deposits that I make to my country", "rating": 1}, {"title": "A great headache", "text": "Just not wearing well. Three refunds for one try. Not acceptable", "rating": 1}, {"title": "I lost all my reward points called the…", "text": "I lost all my reward points called the customer services very bad she hanged up on me... very bad servcies..money gram much better", "rating": 1}, {"title": "The website glitches ALL THE TIME", "text": "The website glitches ALL THE TIME. You’d think with all the money they take from customers they could build a better and more reliable website. ", "rating": 1}, {"title": "Horrible customer Service…", "text": "I had an outstandingly embarrassing situation with this company as  Moneygramm had a cyber security issue earlier this month, my parents decided to fund my studies and send some money through Western Union, soon as I filled out their form with my details I was told to hat my name and surname does not match, I have shown them my UK driving licence, the next day I brought my passport and still was told that they don’t understand which is my first name which is my family name??? So after a brief explanation that am Hungarian and we have our family name first then our given name still had no luck with this issue, I dragged my parents twice to go back to the post office and change my name details but they were told that everything is fine and that she has done the right thing! My parents called me several times to let me know that is not their fault, is this poor company Western Union who doors not accept your family name if it is written the other way around! After 2 days I have called their customer service, guess what Robot Service, after awaiting 5 minutes on the line I was going into detail again, but the customer service assistant could not resolve this issue! Please, I do beg everyone, go for REVOLUT online card as Western Union is a joke and waste of time! Uptill nowadays did not receive my money, I will fill out a dispute towards them, it is what it is, not worth this money grabbing company, because you will only have headache! Shame on You!", "rating": 1}, {"title": "WU er totalt forandret til ubrugelig hed!", "text": "I have been in the WU shop today and they were completely hopeless. I must go again tomorrow to make them call the company...I have talked for hours 4 times with personal they could not help even their damn company doesn't transfer my money. I sent pics of my passport and paycard and today they claimed, that my passport pictures were copies and no good. WU is a also a bad company....the staff are not well educated at all and speak poor Danish....They ask for pics of passport even I sent them 2 days ago and after I sent they asked for pics of my bank card with all infos. I sent money on the 30 September but next day all the pink inquisition started. I have spend hours talking there with Hassan and Michelle on their very poor Danish.I just want to help starving people and WU doesn't help at all.They make it totally impossible to send any money. It is my money but they act if I cheat them. They don't fulfill their job at all What a bad company!Today I was suggested to send an email with my infos, but WU did not accept this email. All is going wrong in that company!The MTCN number I refer to is from 30-09-2024 when WU was working without problems....", "rating": 1}, {"title": "Lots of agents but none open or doing their job", "text": "What is the point of having dozens of agents listed as points to collect cash if they are rarely open or cannot issue more than $300 in cash?  I wasted hours, first going to a Safeway and then finding out that even though their website assured me that Western Union was open, the ONE PERSON who could do it, was not there and it was the fault of \"corporate headquarters\" at WU and Safeway that the information was wrong.  Then having been directed to another agent, I was told that I was $10 over the $300 maximum, so could not collect, then having to call and call multiple agents and being told that either they were not open (this is during business hours, not late at night) even though their website said they were, or they could not pay out because I was $10 over the maximum. Called another Safeway to confirm the details and it was like pulling teeth, trying to get --again-- the ONE qualified employee to tell me whether she would be there.  \"I'll try to be there,\" she said and would not commit to doing her job!  Try to be there?  Is this a business or some kind of \"I'll do it when I feel like it but actually you the client are not that important\" kind of operation?  What a major pain in the behind.  What would have been a 30 second operation if the payer had done an online transfer to me turned into hours and then days of trying to get MY money.  Never again.  I will never, ever allow someone to pay me a debt via Western Union.  Why anyone in the 21st century uses this incompetent and cumbersome un-service when it is so simple to send money via bank transfer or paypal or any number of online services, I don't know.", "rating": 1}, {"title": "I made I transfer of 578,86euro to…", "text": "I made I transfer of 578,86euro to $Argentine Pesos.I dont like to be requested a picture of my bank card. ", "rating": 1}, {"title": " Left up in the air by western union Thailand ", "text": "My money has not arrived in my son's account in Trat Thailand it was due to be picked up on the 16th of September it is now the 21sts his Bank can't do anything I have had to send more money with a different company to see him through", "rating": 1}, {"title": "I can’t log in to send money!!!", "text": "Date of experience: November 06, 2024", "rating": 1}, {"title": "I tried sending money over a dozen…", "text": "I tried sending money over a dozen times the web page is not responding correctly", "rating": 1}, {"title": "NOT ALWAYS GET THE RECIEVER THE MONEY!!!", "text": "Already 5 payment was not at the receiver, I'm the sender and put already a complain months ago!!Still no solution !!??", "rating": 1}, {"title": "It comes up every time whenever I try…", "text": "It comes up every time whenever I try to screenshot it. And it is frustrating every time. Can I do it as option instead of forcing me to close it. ", "rating": 1}, {"title": "My ID and transaction information were…", "text": "My ID and transaction information were abused in an illegal private investigation. The customer service agent in London provided the information of my legitimate receiver in violation of the Swiss constitution's Article of Data Privacy. This information was later presented to the Regensdorf cantonal police illegally. It's in the hands of the Muslim communities in the Zurich area.", "rating": 1}, {"title": "This is the most difficult ridiculous…", "text": "This is the most difficult ridiculous company I've ever seen or heard of.", "rating": 1}, {"title": "I contacted western union but problems was nit sorted", "text": "I am unable to send money yo my regular contacts, getting messages that their ID is incorrect ", "rating": 1}, {"title": "I am VERY TIRED of being asked for a…", "text": "I am VERY TIRED of being asked for a rating ON EVERY TRANSACTION, Make it stop!!", "rating": 1}, {"title": "I reached out to you guys inquiring…", "text": "I reached out to you guys inquiring about me being charged a service fee or transaction fee as I believe that I am being over charged and whomever responded to my inquiry danced around the question without answering it k", "rating": 1}, {"title": "The website takes for everything to…", "text": "The website takes for everything to launch.  Selecting a recipient was the worse.  I had to do it like 4 time and I still gor it wrong.  I sent the $$ to the wrong person.  ", "rating": 1}, {"title": "TODAY'S EXCHANGE RATE FOR US$50 ..", "text": "TODAY'S EXCHANGE RATE FOR US$50 ... IS KES 6450.  THIS MEANS I'M SHORT-CHANGED 751 SHILLINGS (US$5.84)", "rating": 1}, {"title": "Customer Service is no help", "text": "Been having issues sending a transfer which the receiver needs urgently and customer service has not been able to help with verification", "rating": 1}, {"title": "Very poor money transfer service", "text": "Unable to proceed with the transfer it all the time verifying for a half day...Sep 25, 2024", "rating": 1}, {"title": "Why do you keep a hold on my transfer", "text": "Why do you keep a hold on my transfer? I've been using Moneygram for years without an issue.", "rating": 1}, {"title": "Last month I sent money but taking a…", "text": "Last month I sent money but taking a longer time.totally different last year it was good ", "rating": 1}, {"title": "Not a friendly use system", "text": "Not a friendly use system, always has an error message.", "rating": 1}, {"title": "I had to beg for my money for 10 days…", "text": "I had to beg for my money for 10 days to refund. I am never going send money through you. Because of you guys I lost 10000 rupees. Thanks for everything you have done.", "rating": 1}, {"title": "The page gets frozen and very hard to…", "text": "The page gets frozen and very hard to enter the requested information.", "rating": 1}, {"title": "app desent show the details its cut off…", "text": "app desent show the details its cut off when sending the money ", "rating": 1}, {"title": "absurd experience on mobile", "text": "absurd experience on mobile. You will be the next blockbuste", "rating": 1}, {"title": "Took forever not even if the transfer…", "text": "Took forever not even if the transfer was complete each page kept freezing ", "rating": 1}, {"title": "S h i t y  identification process", "text": "S h i t y  identification process I don’t mid to make identification but the way is done is blusher  ", "rating": 1}, {"title": "Unprofessional stuff", "text": "Unprofessional stuff, slow response and longer processing times ", "rating": 1}, {"title": "terrible screen not loading and no…", "text": "terrible screen not loading and no rewards", "rating": 1}, {"title": "Western has paid out to a fraudster…", "text": "Western has paid out to a fraudster with a I’d where the name does not match!", "rating": 1}, {"title": "Incompetent", "text": "Incompetent. Call center employees are Incompetent. Your system is Incompetent. Get it together. Thanks!K.clar,", "rating": 1}, {"title": "Money not available on proper time.", "text": "Date of experience: October 08, 2024", "rating": 1}, {"title": "Stop asking me this question every time…", "text": "Stop asking me this question every time I send money.", "rating": 1}, {"title": "scam", "text": "The transfer fee of over 20 percent is a disgrace ", "rating": 1}, {"title": "wont let me send money when using an…", "text": "wont let me send money when using an active promo code", "rating": 1}, {"title": "Service hit the bottom", "text": "Date of experience: September 30, 2024", "rating": 1}, {"title": "I can not see the full screen when I am…", "text": "I can not see the full screen when I am making my transfer. ", "rating": 1}, {"title": "my rewards points are lost or stolen or…", "text": "my rewards points are lost or stolen or can't use them", "rating": 1}, {"title": "Every transaction is on hold.", "text": "That service is horrible ", "rating": 1}, {"title": "I don't understand why on hold", "text": "I don't understand why on hold ", "rating": 1}, {"title": "payments on hold you guys are the worst and suck", "text": "payments on hold you guys are the worst and suck.  never trust them EVER!", "rating": 1}, {"title": "Enable Cameroon cards to working on…", "text": "Enable Cameroon cards to working on side please ", "rating": 1}, {"title": "Didn´t give me the rewards points…", "text": "Didn´t give me the rewards points anymore", "rating": 1}, {"title": "Why aren't previous transactions saved…", "text": "Why aren't previous transactions saved in history?", "rating": 1}, {"title": "Crap Website", "text": "Your site is crap!!! Took 20 minutes for one transaction!", "rating": 1}, {"title": "its taken 4 hours to do a simple…", "text": "its taken 4 hours to do a simple transfer.. and its still not done. ", "rating": 1}, {"title": "I never saw my rewards", "text": "Date of experience: September 30, 2024", "rating": 1}, {"title": "I haven't received my refund 3 weeks ago", "text": "I haven't received my refund 3 weeks ago ", "rating": 1}, {"title": "Last time i can’t send the money.I wait…", "text": "Last time i can’t send the money.I wait for 5 day but not finish.that suck.'',,", "rating": 1}, {"title": "increased fee no rewards", "text": "increased fee, no rewards program..", "rating": 1}, {"title": "You chid on me for a 500€ that's way I…", "text": "You chid on me for a 500€ that's way I I don't use You anymore.", "rating": 1}, {"title": "Money took longer to get to receiver", "text": "Money took longer to get to receiver ", "rating": 1}, {"title": "Very long connecting.", "text": "Date of experience: October 11, 2024", "rating": 1}, {"title": "slow / payment from bank acct screen…", "text": "slow / payment from bank acct screen too slow....does not work", "rating": 1}, {"title": "I had a problem and they didn’t give it…", "text": "I had a problem and they didn’t give it back my money n", "rating": 1}, {"title": "It took a too long of a time to upload…", "text": "It took a too long of a time to upload I.D. and ATM card to the system", "rating": 1}, {"title": "U canceled points", "text": "Date of experience: October 09, 2024", "rating": 1}, {"title": "Zero", "text": "Why the fees are so high, and My points are in hold. ", "rating": 1}, {"title": "My recipient has not received the…", "text": "My recipient has not received the transfer", "rating": 1}, {"title": "Too high commission", "text": "Date of experience: October 02, 2024", "rating": 1}, {"title": "Demanding phone number was a annoyance", "text": "Date of experience: October 08, 2024", "rating": 1}, {"title": "Transfers funktionieren nie", "text": "Transfers funktionieren nie. Support extrem frech und inkompetent.", "rating": 1}, {"title": "Worst expirence with Western Union, I been a customer for over 10 years and never had issue till today. Why dose western Union require the person I am senfing to mobile phone number? I do not need Wes", "text": "Worst Customer Service Every!", "rating": 1}, {"title": "I havent recieved my money", "text": "I havent recieved my money ", "rating": 1}, {"title": "Very bad and slow service", "text": "Date of experience: September 20, 2024", "rating": 1}, {"title": "This site is really hincty and slow.", "text": "Date of experience: October 03, 2024", "rating": 1}, {"title": "Petersd", "text": "Am peter sd from Uganda ", "rating": 1}, {"title": "too much confudion", "text": "Date of experience: October 11, 2024", "rating": 1}, {"title": "No points at all", "text": "Date of experience: October 03, 2024", "rating": 1}, {"title": "Continually cancelling my transfers.", "text": "Continually cancelling my transfers. ", "rating": 1}, {"title": "Super unreliable site!!", "text": "Date of experience: October 02, 2024", "rating": 1}, {"title": "no response required why ask", "text": "Annoying steps", "rating": 1}, {"title": "very high rate", "text": "Date of experience: September 19, 2024", "rating": 1}, {"title": "Acces", "text": "Acces Delivery", "rating": 1}, {"title": "It sucked", "text": "It sucked! And I'm going to tell anybody that hears!", "rating": 1}, {"title": "Money should be going instantly but it…", "text": "Money should be going instantly but it reached in my Account after 6 days. ", "rating": 1}, {"title": "Transaction wasn't successful ", "text": "When I tried to send money at the store, they took my passport and couldn't enter my Ukrainian ID to the program because there were only 2 residential options: USA or Canada.  My passport issued in Ukraine.  So they couldn't provide this transaction. Lost time and delayed money for my family(((", "rating": 1}, {"title": "I cannot send money on line", "text": "I cannot send money on line. They say there is no problem. But I have to go to Post Office to send money. First few months. No get so far. Then please complete this in one of our offices sonv before june . niot sure when. PAIN", "rating": 1}, {"title": "You let me down very badly ", "text": "You let me down very badly Your service was a disaster My niece was in hospital and needed money urgently Your service failed us ", "rating": 1}, {"title": "Very poor I made a transaction on the…", "text": "Very poor I made a transaction on the 6th and today is 18th the transaction hasn’t been made on my Acc", "rating": 1}, {"title": "Too little money can be sent ", "text": "Too little money can be sent and you block us for little moneys you have to remember people have kids and loans to send ", "rating": 1}, {"title": "Very poor I had to wait for 2 days for…", "text": "Very poor I had to wait for 2 days for the recipient transaction to complete 😢 ", "rating": 1}, {"title": "My cancelled money transfer was not…", "text": "My cancelled money transfer was not refunded and also cancelled the transaction code so I didn’t get a chance to speak to them and ask a resolution bacause they scammed me and took my 79 pound for no reason ", "rating": 1}, {"title": "always use Western Union to send…", "text": "I always use Western Union to send money for my families and you give me points, but lately you never give me any point and I have disappointed 😥 to pay your charges, not even getting the 50 discount. How is it you said improving. I am very disappointed with your service. I hope you can rectify my account so that I can accumulate so point like before. Thank you 🙏 ", "rating": 1}, {"title": "You're rates if exchange are terrible", "text": "You're rates of exchange are terrible , ", "rating": 1}, {"title": "No good well not let me send money…", "text": "No good well not let me send money online I take my driving licence in shop and I have send pictures online still don't let me send online very bad ", "rating": 1}, {"title": "Service provided is discussed", "text": "Service provided is discussed ", "rating": 1}, {"title": "I Went to Western Union Agent on…", "text": "I Went to Western Union Agent on 22/09/24 Trascation no 9395117082 amount 13.21 Fee 2.90 Total £16.11 1 paid on Western Union PDQ Machine and i have Been Chated £3.00 For Cash Advance Fee Explain Why When i Have Paid 2.90 transaction fee on Top £3.00 I need it to be Refunded Not acceptable ", "rating": 1}, {"title": "I am upset my money was taken from my…", "text": "I am upset my money was taken from my bank account and my transaction was void after the money left my account at the post office, I did not get my transaction reference number yet still my money is gone . I want a refund. No money was sent to the recipient. ", "rating": 1}, {"title": "I could not make a transfer", "text": "I could not make a transfer, page went funny and page did not move. I could not see what I was looking for.", "rating": 1}, {"title": "Flemish communication please!", "text": "Date of experience: September 19, 2024", "rating": 1}, {"title": "pas bon!", "text": "pas bon!pas recomendee ", "rating": 1}, {"title": "To many security checks", "text": "Date of experience: September 14, 2024", "rating": 1}, {"title": "Very bad", "text": " Very bad, my money has gone missing over 7days still not delivered z", "rating": 1}, {"title": "my last transaction took 7 days .i was…very disappointed with this transaction ", "text": "my last transaction took 7 days .i was told on the first day it would take 72 hours! after this i was told it would definitely be there the next day then next day then the next.Then when i asked for the money to go back into my bank it was paid into my bank in Spain.I don’t normally have any problems but this caused me lots of problems. And i am considering changing to another currency exchange company ", "rating": 1}, {"title": "Worst service ever ", "text": "Nothing went right. Worst service ever. My transaction was refunded to me almost a week after. Thou I sent an earlier successful transaction to the same account a few days earlier. I will NEVER use WU again. Will also tell friends and family not to use WU. Now I cannot use the money as I planned. Never again.", "rating": 1}, {"title": "I cannot use my points to low the fee", "text": "Date of experience: September 18, 2024", "rating": 1}, {"title": "The most difficult and frustrating…", "text": "The most difficult and frustrating experience ever.  What is posted on the app and Web site is inaccurate, there are no warnings about cash transfers not being able to be processed over a certain amount, and the customer service was a joke! I am still sitting on a $2100 money order that I can not do ANYTHING with! Never again will I use Western Union", "rating": 1}, {"title": "I did one transaction last month…", "text": "I did one transaction last month 20/08/2024 still receiver did not receive that money. And then I ask them to refund my money back but they didn’t. This is MTCN. 906-365-4825", "rating": 1}, {"title": "I sent money", "text": "I sent money, your services was buffering but I was debited and after a while it showed THIS SERVICE IS NOT AVAILABLE and no record was shown in the western union transfer history. It’s like the money just disappeared to thin air. Very disappointing service. Because the money was meant for hospital bills. ", "rating": 1}, {"title": "I tried to send 500bpounds to manilla…", "text": "I tried to send 500bpounds to manilla on 23rd of August, it wouldn't process ,but the post office took it from my bank account ,I then sent 500 via Sainsbury's  in Rugby which was delivered but I am now 500 pounds out of pocket.", "rating": 1}, {"title": "the transaction takes longer", "text": "Date of experience: September 18, 2024", "rating": 1}, {"title": "Des milliner de gent on des problemme d envoi de l argent", "text": "Because with Mr. Cute people have time to die before they get any money.", "rating": 1}, {"title": "I sent my money on Saturday", "text": "I sent my money on Saturday, I didn’t receive it until today ", "rating": 1}, {"title": "Too expensive to send money and why…", "text": "Too expensive to send money and why can’t you redeem your points automatically when sending money from the app, instead of going to google and waste time trying to redeem it with sometimes it doesn’t work.", "rating": 1}, {"title": "Impossible de faire un transfert ", "text": "Date of experience: September 17, 2024", "rating": 1}, {"title": "Have used them before for money…", "text": "Have used them before for money transfer to Mobile Wallet and service used to be fast. Last transaction however, nothing happened in 24 hours, they refuse to refund, transfer still pending. STAY AWAY, use another provider instead!! ", "rating": 1}, {"title": "I don’t understand what is going on…", "text": "I don’t understand what is going on with this company. They have a very bad process with transfers internationally. If they are unable to send the transaction in a timely manner, their solution for you is just to wait. Even if you need the money urgently, the only solution is to wait. Their customer service team have different answers and are not honest with what is really happening. They just say they cannot give any other information than to wait.", "rating": 1}, {"title": "Western I ask to stop giving other…", "text": "Western I ask to stop giving other deals and or offers from other business to shop for products and to join a service and start the new points/discount plan you promised since January 2024.", "rating": 1}, {"title": "Crappy review request experience", "text": "The request for a review keeps covering the information I'm trying to share to my receivers", "rating": 1}, {"title": "IE   przekaz ", "text": "no possibility to send from my phone.  complicated application.  difficult to send money from my phone.", "rating": 1}, {"title": "Too high rate comparing to other money…", "text": "Too high rate comparing to other money transfer agents", "rating": 1}, {"title": "Great 👍 very happy with the service ", "text": "Great 👍 Very happy ", "rating": 1}, {"title": "I am not happy because I sent thousands…", "text": "I am not happy because I sent thousands of pounds and never get bonus or reduced pay ", "rating": 1}, {"title": "I'm sending money to the Philippines", "text": "I'm sending money to the Philippines. I can never know in advance if my transfer will get there or not. There are a huge number of scammers there that will steal your money if it sits there more than a minute or two. Often it is the store worker that sees the transfer and takes the money.When you complain to Western Union, they promise to investigate but all they really do is wait a while and say \"someone with the proper ID claimed the money.\" They have no proof and will not share \"investigation findings.This time I sent a 100 peso \"test\" which went smoothly. The real transfer, 12000 pesos, was quickly marked for \"review\" and has not arrived.Western Union's response is to go through the same BS process I have been through with them many times! If your money is stolen by scammers, or store employees, Western Union will not help you! They will simply say your transfer was received by someone with the appropriate identification. They add lies to cover their lies!Gcash in the Philippines is being investigated because transfers to that mobile wallet fail to arrive at their destination. Western Union has told me my transfer was picked up when this has happened to me.Western Union are thieves! Don't trust them.", "rating": 1}, {"title": "I tried to send 1300 dollars", "text": "I tried to send 1300 dollars, and your site wanted my driver's license number from Florida but would not accept the number.", "rating": 1}, {"title": "Limit to small", "text": "Date of experience: September 02, 2024", "rating": 1}, {"title": "exceded limit error", "text": "exceded limit error ", "rating": 1}, {"title": "I can’t send mine on my phone", "text": "I can’t send mine on my phone. I have to go to a shop. It never accepts my driving license as a valid ID. ", "rating": 1}, {"title": "They impose a restriction on the number…", "text": "They impose a restriction on the number of transactions that can be made each month WITHOUT disclosing it on their website, disturbing is the fact that with two telephone contacts with their advice operatives they cannot or will not say why these restrictions come about, the last contact said three transactions when I had already completed 9 transaction.  I think they are doing as they are told or instructed by the Central Bank(s).  I consider this persecution and dishonest.16", "rating": 1}, {"title": "Transfer fees too expensive £3.99", "text": "Transfer fees too expensive £3.99. Last time was cheaper.", "rating": 1}, {"title": "You decided my transfer was fraudulent", "text": "You decided my transfer was fraudulent, I agree that it was unusual but was genuine.I respect your right not to accept transfers that you deem to be fraudulent but you are not always right. I won't be needing your services again", "rating": 1}, {"title": "If I can't use other cards for payment", "text": "If I can't use other cards for payment, if my account they accept only my debit card , I can't use my wife my friend card , every time money on hold next they verify and start process, new account they good rates and no fee, but for old customer they charge service fee", "rating": 1}, {"title": "When i send money to Egypt people at…", "text": "When i send money to Egypt people at the brunch in Egypt so so so bad really. ", "rating": 1}, {"title": "Western union price is very very low…", "text": "Western union price is very very low I'm not happy with Western Union ", "rating": 1}, {"title": "It’s been a month  I try to send to…", "text": "It’s been a month  I try to send to send money abroad and the application tell me that It can’t go through ", "rating": 1}, {"title": "payments not going through", "text": "In the last few months, my payments to my sister get refunded with no explanation, no troubleshooting option. Every time I have to initiate a new transfer and there are multiple days of delays. ", "rating": 1}, {"title": "They are safe but They take too much…", "text": "They are safe but They take too much commission that’s really bad ", "rating": 1}, {"title": "I tried Chrome", "text": "I tried Chrome, then Safari and finally Firefox. I went through 3 cards to make this transaction. I had trouble redeeming my discount of $15 but on the last try finally got it to work.", "rating": 1}, {"title": "Last time I send money to turkey", "text": "Last time I send money to turkey, one of your agent stolen some of the money I was send ", "rating": 1}, {"title": "Because am block for no reason and am…", "text": "Because am block for no reason and am not happy", "rating": 1}, {"title": "The western union app doesn't sync with…", "text": "The western union app doesn't sync with the system in merchant kiosk or the website. ", "rating": 1}, {"title": "I REALIZED IS MUCH BETTER TO GO TO ONE…", "text": "I REALIZED IS MUCH BETTER TO GO TO ONE OF YOUR AGENTS. THE EXCHANGE RATE AND THE COMMISSION PAID ON LINE ARE NOT COMPETITIVE AT ALL. I WILL NOT USE THE ONLINE SERVICE ANY MORE EXCEPT FOR EMERGENCY ", "rating": 1}, {"title": "All payments made from my account at…", "text": "All payments made from my account at Nat West on 5th September (two of £780.00 and two of £783.99) were taken by fraudsters.  Two have been refunded (one of £780.00 and the other £783.99)  the others have not.  I would give you 5 stars if they were!", "rating": 1}, {"title": "Western union now is asking for…", "text": "Western union now is asking for identity copy of recipient- how do I get an ID from an elderly who csnt sent his ID electronically- this sounds silly. I have since stopped using western union and now uses world remit. How do I get an email of someone without and has no wifi no internet nothing.  You are too ambitious askjng for too much from poor people ", "rating": 1}, {"title": "They won't answer email!", "text": "They won't answer email!My transaction has not received in destination account since Sep 8.The support team answers my questions with pre-prepared responses.The money has not been deposited for me yet, and they are not giving me a proper response.", "rating": 1}, {"title": "Horrendous!", "text": "Horrendous!! Money was stuck and communication was awful! Kept asking for ID via link but wouldn’t work!Terrible service! ", "rating": 1}, {"title": "The transfer was cancelled by WU and…", "text": "The transfer was cancelled by WU and then when I tried again the option to use mobile money was not available", "rating": 1}, {"title": "Language", "text": "There is no video verification in Russian, the operator speaks only English and German, and does not allow using Google Translate((", "rating": 1}, {"title": "My transaction was cancelled without an…", "text": "My transaction was cancelled without an explanation,am now awaiting refund", "rating": 1}, {"title": "Delayed delivery", "text": "Delayed delivery ", "rating": 1}, {"title": "Still can't send money through the app…", "text": "Still can't send money through the app a waste ov time ", "rating": 1}, {"title": "The transaction was cancelled", "text": "The transaction was cancelled, and I have been unable to find out why, it was only when the receiver went to collect the remit was I aware of it,my call to customer service wasn’t very useful, due to the operators lack of English.", "rating": 1}, {"title": "THEY ARE FRAUD", "text": "THEY ARE FRAUD. I SEND MONEY ON 06/09/24 AND DIDN'T RECEIVE TILL TODAY 17/09/24. EVERYDAY I AM CALLING THEY PUT ME ON HOLD FOR 40-50 MINUTES AND THEN SAY WAIT 24 HOURS WE HAVE ESCALATED THE ISSUE. THEY RAE USING MY MONEY MAKING PROFIT AND MONEY NOT RECEIVED BY THE PERSON STILL", "rating": 1}, {"title": "On peux plus utiliser l application…", "text": "On peux plus utiliser l application mobile carte la carte bancaire n’est plus accepter dommage ", "rating": 1}, {"title": "Would not transfer money", "text": "Would not transfer money. Spent over 2 hours trying to have the app work. Finally gave up", "rating": 1}, {"title": "Very expensive", "text": "Very expensive ", "rating": 1}, {"title": "I had to cancel and start a new…", "text": "I had to cancel and start a new transfer, you said you are revieing transfer and it may take some time. It took way longer than initially communicated. ", "rating": 1}, {"title": "The website is completely…", "text": "The website is completely dysfunctional. What is the point of this conversation. No one reads or does anything about this. It has been going on for 2 years. I have written complaints many times.  ", "rating": 1}, {"title": "Secound time i wait 7 days for money to…", "text": "Secound time i wait 7 days for money to be send ", "rating": 1}, {"title": "Very poor", "text": "I've been trying to send money for almost 5 weeks and it's not going through. My host bank blame WU, and WU message says bank doesn't accept. This saga of game really disappointed me badly and I'm considering changing the platform from WU to others.", "rating": 1}, {"title": "I am extremely dissatisfied with the…", "text": "I am extremely dissatisfied with the service at the Western Union branch (Insta Cheques, 4834 Taschereau Blvd, Greenfield, Quebec J4V 2J2). I encountered incredibly rude behavior not only from the regular staff but also from the branch manager. Instead of simply providing my transfer, they started collecting personal information that I am not required to give. When I refused to provide unnecessary details, they responded with rudeness and an unacceptable tone. This is completely unprofessional! Such treatment towards customers severely damages trust in the company and makes me seriously reconsider using their services in the future.", "rating": 1}, {"title": "Worst service. Terrible rates ", "text": "Points disappear ", "rating": 1}, {"title": "Terrible online service: Waste of time!", "text": "I experienced several issues with this website. First, it swapped the receiver's first and second last name, then they didn´t want to give her the money.Later we managed to send & receive an small amount test wire, but after that, the second wire it gave me an error and it has us \"on hold\" for 2 hours son far!This online option has make us waste a lot of time!", "rating": 1}, {"title": "You have very high feed", "text": "Date of experience: September 16, 2024", "rating": 1}, {"title": "because WU points do not accrue for…", "text": "because WU points do not accrue for more than a year.", "rating": 1}, {"title": "No good no transfer", "text": "No good no transfer ", "rating": 1}, {"title": "The receiver's bank never received the…", "text": "The receiver's bank never received the funds. After two weeks waiting and an hour on the phone with a non-English-speaking representative, WU finally cancelled the transaction. It took a week after that to get a refund. I tried sending to the same receiver via a different account. Same result and no help! If there is a problem sending to a certain country, or in a certain amount, WU should let senders know this before going through weeks of frustration. ", "rating": 1}, {"title": "website won't let me use rewards", "text": "website won't let me use rewardswebsite is slowwebsite isn't remembering info", "rating": 1}, {"title": "Everything is delayed response", "text": "Everything is delayed response ", "rating": 1}, {"title": "My last four transactions were delayed…", "text": "My last four transactions were delayed without any communication. Two of them still pending since August 30th and September 2nd respectively. Been a customer of Western Union since 2007, never experienced a service like this before,", "rating": 1}, {"title": "You are repeatedly cancelling my…", "text": "You are repeatedly cancelling my transfers with no information whatsoever on why they are being cancelled. I'm a regular user of Western Union, but if this keeps up, I will be using another service...any other service. Customer service is terrible.", "rating": 1}, {"title": "why I can not use my points or have…", "text": "why I can not use my points or have more? !!!!", "rating": 1}, {"title": "horrible  worst experience ever", "text": "horrible  worst experience ever. i have been using WU for more than a decade. but now you website is slow, there is error messages constantly and money takes longer to reach internationally.  they used to receive it right away in minutes. im considering switching to another option.", "rating": 1}, {"title": "INACCURATE FOREIGN CONVERSION RATES", "text": "Western Union's foreign exchange rates are outdated and inaccurate, meaning recipients don't receive the full value of the sender's hard-earned money. In essence, both the sender and recipient are shortchanged. (This has been my experience ongoing ... 2021 to date).", "rating": 1}, {"title": "many issues ", "text": "many issues cant see the website and what you sendslow site and poor application ", "rating": 1}, {"title": "Your site is very slow", "text": "Your site is very slow. Logging is hard. Could not log in today. Horrible.", "rating": 1}, {"title": "I get tired of having to call every…", "text": "I get tired of having to call every time (each month) I send money to the same person who is my daughter's mother.", "rating": 1}, {"title": "Terrible service.", "text": "Terrible service. ", "rating": 1}, {"title": "It's really difficult to send money at…", "text": "It's really difficult to send money at home. The services become poor. Un able to access and send it directly to my own bank", "rating": 1}, {"title": "GIVE US OUR FREE TRANSFER BACK, WHY CHARGE SUCH AN EXHORBITANT TRANSFER FEE WHEN IT CAN BE FREE LIKE BEFORE", "text": "How can you expect me to give a good rating as when I started to trasfer money, it was free of cost and now it increased to $5? Shame on you, for using our hard earned salary even after you have your big cut from Google rate as you earn by giving lower rate to us plus now charging us a transfer fee which was free of cost just a year back..", "rating": 1}, {"title": "Completely fraudulent ", "text": "Well it's been almost a year getting the run around they do not want to reimburse me my money orders and gave me a fake email I have faxed everything and notarized it and still nothing and no one knows anything same thing from everyone you speak to ", "rating": 1}, {"title": "Your website indicate zero fee", "text": "Your website indicated zero fee, but it turned out to be bait and switch as I ended up being charged a sending fee of $7.99. This deceptive practice needs to stop.", "rating": 1}, {"title": "rewards program", "text": "you still have not launched a new rewards program when you make transfers.", "rating": 1}, {"title": "I cannot send money as I have in the…", "text": "I cannot send money as I have in the past, limitations placed", "rating": 1}, {"title": "App is slow and always stops with adds…", "text": "App is slow and always stops with adds . Seriously annoying ", "rating": 1}, {"title": "Good service", "text": "Good service ", "rating": 1}, {"title": "This process of verification is arcane…", "text": "This process of verification is arcane and unnecessary. I have validate several times and your system seems not to be aware of the fact. ", "rating": 1}, {"title": "NEVER AGAIN!!", "text": "The currency exchange rates are criminally high and NOT inline with current bank rates. I sent $2k abroad and it cost 4X the fee so I lost almost $400 including the fee. The clerk failed to disclose this at the time of the transaction. ", "rating": 1}, {"title": "My transfer is still on hold after 3…", "text": "My transfer is still on hold after 3 weeks. If you guys can't process it since you said you're missing some. Info, you should just auto cancel and refund it to the sender instead of holding it for 3 weeks and counting! ", "rating": 1}, {"title": "The website is extremely slow", "text": "The website is extremely slow, it took me 25 minutes to complete a single transfer.", "rating": 1}, {"title": "You guys are heartless my sister is in…", "text": "You guys are heartless my sister is in Ghana along with my nephew and my sister almost die because you guys refused to allow my transfer to go through I send my id I did selfie, I went through 1 hour plus interrogation, but yet your heartless agent refuse me which I was using your platform for the first time. You guys are the worse and not even a dog I wouldn’t refer you guys to, my sister could have lost her life I had to beg a friend send it through another app. You guys allow scammers to take over your platform but innocent hard working abiding citizens you guys harass them. You guys are horrible. ", "rating": 1}, {"title": "I always have problems with sending the…", "text": "I always have problems with sending the money and it gets returned ", "rating": 1}, {"title": "The dollar exchange was low that the…", "text": "The dollar exchange was low that the actual current market", "rating": 1}, {"title": "Poor customer service", "text": "Poor customer service. Didn't not help and answer my questions he pur.me back to the queue! Very rude!", "rating": 1}, {"title": "Why increase for send money and why not…", "text": "Why increase for send money and why not given any rewards, puntation any more", "rating": 1}, {"title": "cannot use on phone had to delete", "text": "Date of experience: July 10, 2024", "rating": 1}, {"title": "why I can not use rewards !!", "text": "why I can not use rewards !!! ??????", "rating": 1}, {"title": "Fist transfer is did went smoothly and…", "text": "Fist transfer is did went smoothly and fast The second time I made a transfer they put in reviewing and tell to contact after that send to make another contact ande after 12 hours cancelled and told me to try send again So it’s went a very complicated the processing My suggestion just let more easy Since all the requirements is filled right don’t need to make such a thing reviewing Thanks ", "rating": 1}, {"title": "Very bad service tried long time after…", "text": "Very bad service tried long time after they verified ", "rating": 1}, {"title": "The verifikasjon prosess is hopeless", "text": "The verifikasjon prosess is hopeless.  Too complicated and quite annoying. If this persiske, I will use other merhods for transfer. I need the money transferred NOW!!!!! Not after some \"review\"", "rating": 1}, {"title": "Western I ask to stop giving other…", "text": "Western I ask to stop giving other deals and or offers from other business to shop for products and to join a service and start the new points/discount plan you promised since January 2024.", "rating": 1}, {"title": "Why is my money transfer of $125 that I…", "text": "Why is my money transfer of $125 that I have been making bi-weekly from the same account for 10 plus yearsto the same ccount  suddenly \"under review\" ?", "rating": 1}, {"title": "nosy a$$holes. Inefficient. waste of time", "text": "you all took 4 hours to review my transaction, called me to discuss it, I then gave you all the information you requested, waited 5 more hours then you canceled it. I had to resend it and call again. What a bs service. You cancelled saying you needed more information, but you wont tell me what information. ", "rating": 1}, {"title": "ONLINE TRANSFER NOT WORKING - In the last 6 weeks called multiple time and case number was created. The issue is I am not able to finish the transaction and stops on the screen toward the last step.  ", "text": "ONLINE TRANSFER NOT WORKING - In the last 6 weeks called multiple time and case number was created. The issue is I am not able to finish the transaction and stops at the screen toward the last step.  ", "rating": 1}, {"title": "U have a policy that this company…", "text": "U have a policy that this company supposed to go by but it doesn't work I canceled a transaction money supposed to go back in my account in 7 days I never received my money u need to fix ur damn program and stand on ur policy", "rating": 1}, {"title": "Terrible over a month trying to make a…", "text": "Terrible over a month trying to make a transfer and still WAITNG for my money back cuz something was wrong and they got no idea what was the problem. Used Wise and few minutes my transfer was done. Sorry you guys need to training your employees ", "rating": 1}, {"title": "I have been hacked", "text": "I have been hacked. I have no account. I have not renewed a password.", "rating": 1}, {"title": "I sent money to my lawyer across seas 2…", "text": "I sent money to my lawyer across seas 2 weeks ago and they allowed me to make my payment as per my written legal contract with the individual I hired for legal services. Yesterday I tried to send my second payment but they wouldn't  allow it this time saying I am a victim to fraud and they can't allow the payment to process despite me confirming who I am and the individual I have retained for legal services. Now I am being told I can not send money through western union to this individual as it will be labeled fraud.Now I am struggling to get this over due payment to my lawyers office, thanks western union for screwing with people's legal affairs and obligations. I will NEVER try using them again and I am spreading this story to all my friends and friends in Mexico who use this unprofessional platform for sending money and vise versa", "rating": 1}, {"title": "TheftWhat went wrong is that", "text": "What went wrong is that? I have never opened a Western Union account. I have never used Western Union in my life. This is a bocus charge from someone who tried to steal for me. The bank has been contacted and if you don't stop this, my lawyer will be contacted. This is not a valid charge.  And I.Will not be responsible and not pay it.", "rating": 1}, {"title": "LIFE OR DEATH", "text": "I have had nothing but problems trying to send money to my brother in Nigeria whom is currently facing a life or death situation medically....if I can't get this money to him and something happens... WU has blood on their hands.... ", "rating": 1}, {"title": "Horrible I canceled a transfer a month…", "text": "Horrible I canceled a transfer a month ago and I still haven’t gotten my refund and they refuse to give it back it was 80 dollars I never received back I wouldn’t recommend western union ", "rating": 1}, {"title": "Western Union is unable to complete my…", "text": "Western Union is unable to complete my transfer, even though my bank says nothing is wrong on their end. Every time I call WU, they direct me to an in-person location, which is just every local pharmacy near me, where the machine simply don't work, just like the website. There is no explanation for this on anyone's end, so WU just lost my business. After hours of headaches, it's just not worth it. Wise is another transfer service, use that one instead!", "rating": 1}, {"title": "Customer care service not good ", "text": "Not good customer care service ", "rating": 1}, {"title": "This was case of fraud using my bank…", "text": "This was case of fraud using my bank card # unauthorized by me.  Now I have list $430 which is devastating to me", "rating": 1}, {"title": "That very bad service!!", "text": "That very bad service!!! I have cancelled transaction . In 16 last month.. and till now I haven’t got my money back!!! And when I contacted the costumer support .. first they said sorry we have something wrong in our system and it’s going to take 3 days after that they sent my mail that it’s the money has sent to my account!!!! And that it’s not true!!!! I don’t know how come a company like that still the people money!!!! ", "rating": 1}, {"title": "Horrible service", "text": "Horrible service. My money has been blocked for over a month, and none of you do help", "rating": 1}, {"title": "Lost all my bank cards in Thailand", "text": "Lost all my bank cards in Thailand. I tried multiple times online to send money to myself. Tried to verify for days. Went to multiple western unions around Phuket with no help at all besides saying they need a wire number when I’m trying to tell them it’s not working. No help, no service. Had to get visa to send me emergency money through the mail to my air bnb. ", "rating": 1}, {"title": "Correct me if I am wrong!", "text": "1.  Transfer fees are too high. 2.  There is no option to transfer to mobile money, like \"GCASH\". ", "rating": 1}, {"title": "money transfer is very slow", "text": "money transfer is very slow, even money has been deducted from here and still didn't received in Pakistan.i'll never ever use this platform again to transfer money.", "rating": 1}, {"title": "I need a refund or something", "text": "I need a refund or something ", "rating": 1}, {"title": "My reward points are still on hold ", "text": "My reward points are still on hold , its been months.", "rating": 1}, {"title": "I could not transfer funds inspite of ticket issued ", "text": "I could not transfer funds inspite of raising a ticket to resolve. ", "rating": 1}, {"title": "Liberia transfer denied", "text": "Recipient in Liberia could not receive wire funds because Western Union agent required a middle name.", "rating": 1}, {"title": "Three times my transaction amount went…", "text": "Three times my transaction amount went wrong and I have to pay fees.", "rating": 1}, {"title": "Terrible Service – Completely Unreliable! Inefficient team. Absolute horrible experience. ", "text": "Western Union claims quick transfers for mobile wallet takes just minutes, but my experience a nightmare. A \"minutes\" transfer took over 12 hours and still isn't completed, now they are telling me to wait another 24 hours. I dont know whats going to happen. After hours on the phone, I was given wrong instructions and codes regarding uploading receivers ID. I uploaded but nothing happened because they provided me with wrong address to upload and passcode to use. They don’t care about their customers. I already talked about 5 times with customer care and compliance team, almost half an hour each, have uploaded and email the same information so that they can complete the transaction but they are horribly inefficient. They don’t know what they are doing. They ask for information that has already been provided. Horribly inefficient. They don’t care about you. A minutes service is already 14 hours and they are saying another 24 hours. In the end they blame on govt regulations but actually they are slow and inefficient. This service is incredibly frustrating. I’ll never I highly recommend avoid using Western Union service. ", "rating": 1}, {"title": "Denied transfer", "text": "Denied transfer, paypal much faster and easier to use.", "rating": 1}, {"title": "You guys still my money", "text": "You guys still my money, and it was for my family member that was an emergency. I was answer some questions but you guys didn’t send me the email or may money. Was your system. I was called and said my family member was took the money at 9pm East time when I was send him at between 2:30 or 3pm pacific time. He didn’t took the money. Was more than $80 dls 😡😡😡😡😡", "rating": 1}, {"title": "I had sent multiple transactions this…", "text": "I had sent multiple transactions this year and my points never increase. It remains 15 points since last year", "rating": 1}, {"title": "Since one year ago I have never been…", "text": "Since one year ago I have never been received any reward from you, although I send money every month to different people in my country. ", "rating": 1}, {"title": "Terrible regards program", "text": "Date of experience: September 04, 2024", "rating": 1}, {"title": "EVERY TIME you hold the funds for 30…", "text": "EVERY TIME you hold the funds for 30 minutes. STUPID TRICK", "rating": 1}, {"title": "Receiver of cash I sent was refused payment", "text": "I sent money to my friend in the Philippines and she was told she could no longer receive money from me by one of your agents.   ", "rating": 1}, {"title": "Uneven service", "text": "I sent two transfers about 2 weeks ago that were delivered in minutes.  4 days ago, I tried two ore transfers from the same source to the same recipient and neither has been completed yet.  I don't understand why the latet trnsfers are tking so long.", "rating": 1}, {"title": "It gives me that the two last transfers…", "text": "It gives me that the two last transfers are delivered 2 weeks ago, but they actually are NOT.", "rating": 1}, {"title": "Not knowledgeable about the problem ", "text": "Not knowledgeable about the problem and bad customer service ", "rating": 1}, {"title": "Clerk at the western union kept giving…", "text": "Clerk at the western union kept giving my sister a hard time said she needed to download a app and that she needed to supply more I for they weren't trained she had to travel 30 miles to another store", "rating": 1}, {"title": "stop asking what my money is for", "text": "stop asking what my money is for ", "rating": 1}, {"title": "I have had my money refunded 7 or 8…", "text": "I have had my money refunded 7 or 8 times for no reason that I can find. I feel like I've been black listed. I have been using WU for many months with no problems and now I cannot get money to my sister. It is very, very frustrating.  My last transactions were made on line and said the money was ready for pick up. Today I find out the money has been refunded to me.  I am fed up!", "rating": 1}, {"title": "Agent was a little bit hostile", "text": "Date of experience: September 06, 2024", "rating": 1}, {"title": "I contacted customer service multiple…", "text": "I contacted customer service multiple times and never got a resolution. They have the worst system in place.", "rating": 1}, {"title": "Most arrogant indian customer service…", "text": "Most arrogant indian customer service team who always gave misleading information every time I called to know the status of my money transfer. When I ask them specifically the status they give arrogant answers and disconnected my call.", "rating": 1}, {"title": "Someone stole my identity and my money…", "text": "Someone stole my identity and my money and western union didn’t stop the transaction making it obvious that you guys knows who the identity thief was or probably working with them.", "rating": 1}, {"title": "Youre slow as crap", "text": "Youre slow as crap.", "rating": 1}, {"title": "I wasn’t able to send money", "text": "I wasn’t able to send money, spent lot of time but stuck in review page ", "rating": 1}, {"title": "Transfer was cancelled by Western Union…", "text": "Transfer was cancelled by Western Union for the receiver. WU on receivers end was asked that I the sender call  WU. I did and was on the call for over 25 minutes. I was transferred to two different departments who couldn't answer why the transfer was cancelled. I was told I was going to be transferred again to a third department. This was after 25mins being on the phone. I declined to be transferred and ended the call. It appeared that each person that I spoke with only could give a patter response and could not tell my transaction was cancelled nor if I eventually get an answer to why, if there would be a solution so the receiver could receive the transaction. I asked if I could be emailed or texted and again each representative of WU could not answer. ", "rating": 1}, {"title": "I've been using Western Union for over…a year", "text": "I've been using Western Union for over a year. Now every other transaction I get an error not allowing me to make a transfer. I called the help desk and they could not fix the issue. They said I can use another service...", "rating": 1}, {"title": "Elimination of Promos", "text": "I no longer get points nor am I able to use my points. ", "rating": 1}, {"title": "been trying a few times to make a money…", "text": "been trying a few times to make a money transfer for my family and a loan payment urgently having to paid off and my bank says money has been realized by them but western union is not approving the money transfer", "rating": 1}, {"title": "Horrible customer service ", "text": "Horrible customer service , they provided incorrect date when the funds were available . I’ve been sending money thru western union for last 10 years but I can assure this will be the last one. Get you pick up date corrected !! ", "rating": 1}, {"title": "I was unable to enter a new Receiver…", "text": "I was unable to enter a new Receiver and send money Bank to bank.  The entry process for the receivers was absolutely/ridiculously slow and once I finished that it hungup on the bank information.  I could send to an existing receiver with no problem.", "rating": 1}, {"title": "Too much charge for transfers", "text": "Date of experience: September 10, 2024", "rating": 1}, {"title": "I can’t use my points it’s been fixing…", "text": "I can’t use my points it’s been fixing for months ", "rating": 1}, {"title": "My daughter who i sent the transfer…", "text": "My daughter who i sent the transfer din’t receive yet i talked with a person that i haf to wait so can you help ? ", "rating": 1}, {"title": "hard to contact overseas esp in canada", "text": "hard to contact overseas esp in canada, cant process remitnce needed by my family", "rating": 1}, {"title": "My account has been locked and I have…", "text": "My account has been locked and I have made several calls and followed their instructions but when I last checked it was still locked.August 29th is roughly when I last tried to unlock it, I cannot remember the exact date.", "rating": 1}, {"title": "Your exchange rate is terrible", "text": "Your exchange rate is terrible. It is not even close to the average exchange rate. Because of your usurious exchange rate, I lose over $200 per month sending my pension from my American bank to myself in Colombia.", "rating": 1}, {"title": "IT IS TAKING TOO LONG FOR THE MONEY TO…", "text": "IT IS TAKING TOO LONG FOR THE MONEY TO ARRIVE, ALMOST A WEEK. THERE ARE OTHERS THAT TAKE 24-48 HOUS MAX", "rating": 1}, {"title": "At the end of the transaction", "text": "At the end of the transaction, I will see the receipt, then some ads of your third company come, those who do not understand a little, those who are a little less educated, they mistakenly give their information and deduct money without giving any lane. Western Union is such a big company, if the camera can enter the app and take your information, why should I use this app a second time?", "rating": 1}, {"title": "Ukraine money transfers", "text": "I think it is criminal that you advertise free money transfer to Ukraine. I send money to Ukraine every month! You charge the maximum for them. ", "rating": 1}, {"title": "There's always an issue", "text": "There's always an issue. The site randomly glitches and not let me go past a certain point (without an error code) or it takes forever. Contact customer service, they can't answer why, they just escalate it so another team can look into it. I'm not even sending a large amount of money. ", "rating": 1}, {"title": "I have been a customer for over 6 years…", "text": "I have been a customer for over 6 years now and recently i have sent 2 transactions which required extra verification.  I understand for security purposes but if i am providing you with all requisite why adding extra waste of time by me calling to find out whatnis the hold up.  Simple transactions from my account to someone else account.  No cash involved.", "rating": 1}, {"title": "Site didn’t work", "text": "Site didn’t work. Didn’t accept credit card. Accepted my bank account for two orders the stopped accepting. ", "rating": 1}, {"title": "Please go back…", "text": "Please go back to no fees and make your profit on the exchange rates. I do not like the indefinite fees that change each time I transfer funds. What happened to the reward program . Your business is. Going down the tubes as far as taking care of your faithful customers. ", "rating": 1}, {"title": "For 2 consecutive months you have…", "text": "For 2 consecutive months you have delayed my transfer on bias grounds.Only you know why.I think fairness should be to deliver upon satisfaction if payment and not 5 days later.", "rating": 1}, {"title": "They did not pay the exchange rate at the moment ", "text": "They did not pay the exchange rate at the moment. They kept like $60MoneyGram will pay you the current exchange at lower rate without hidden fees.", "rating": 1}, {"title": "Doesn't work most of the time.", "text": "Date of experience: September 11, 2024", "rating": 1}, {"title": "The system wasn't working and did not…", "text": "The system wasn't working and did not allow me to send money. ", "rating": 1}, {"title": "C1974", "text": "C1974. Bank says it cleared, but still can’t go thru with Western Union.  Bank says my address is wrong, but it’s same address I’ve used before.  It’s my address.  Money went through on Money to same address, same debit card account, same everything but now I can’t send money again!", "rating": 1}, {"title": "It was a nightmare collecting my cash", "text": "It was a nightmare collecting my cash.  Couldn't  use  the app and had  to drive to next  town", "rating": 1}, {"title": "Worst company they treat u the worst ", "text": "I sent few wires the two went fine the rest of them I was not able to do anymore transfers. My account was lock they ask for id and still no solutions. I was told I news to go I  person to an office and provide id. I did as requested still same issue. I open another account I was planing to sent 18 dollars and it took for ever. I won't used you anymore ", "rating": 1}, {"title": "When my money transfer to India didn’t…", "text": "When my money transfer to India didn’t go through for multiple days so I cancelled it and it showed cancelled in my account. When I checked my bank account today I found that money was withdrawn from my chase bank account. No monies was delivered to my brother in India. This is unacceptable and cheating.", "rating": 1}, {"title": "The recent transactions I made do not…", "text": "The recent transactions I made do not show in my transfer history in the app and this is so confusing. I deleted the app and installed it again and still have the same issue", "rating": 1}, {"title": "Terrible ", "text": "Terrible ! You have kept $300 on your end and when my receiver was going to pick it up, you told him I needed to call the bank. So I sent another transfer which my receiver picked up yet two days later y’all transferred $300. Now these $300 are in cyber space and no one has responded . ", "rating": 1}, {"title": "The system rejects a number of my…", "text": "The system rejects a number of my credit cardsat the point where I enter my 3 digit number", "rating": 1}, {"title": "Rewards ", "text": "You stop giving rewards to cut down on fee", "rating": 1}, {"title": "Terrible ", "text": "Terrible rewards program has been taking out you get no  rewards it's been a year and they say there still working on it 😕 it used to great sending money thru WU", "rating": 1}, {"title": "At the beginning there was reward and…", "text": "At the beginning there was reward and over a year there is no reward no more. Why? I send at money one or twice a week . So sad ", "rating": 1}, {"title": "Not great", "text": "Not great! Trying to send money to daughter online. I was not able to.  And apparently western union is trying to protect me from fraud. I have sent my daughter money in person in the past. They should have her information and name in their records. I shouldn’t have an issue with sending it online. ", "rating": 1}, {"title": "A transfer that I recently made was rejected ", "text": "A transfer that I recently made and have made several times in the past to the same person was rejected and refunded.  I called customer service to ask why and I was told that I needed to fill out some form which questioned my integrity, where my money was coming from and the identity of the person I was sending it to.  None of which should be of concern to your company.  If I could rate you zero stars I would.", "rating": 1}, {"title": "Could you please explain why I’m not…", "text": "Could you please explain why I’m not getting any rewards, is I have been getting them frequently in the past? I wait your response, very upset about that!!!", "rating": 1}, {"title": "Not able to send at all and I have been…", "text": "Not able to send at all and I have been using Western Union for a long time.Disappointing!!", "rating": 1}, {"title": "I was charged 3 different transactions…", "text": "I was charged 3 different transactions that weren't authorized. ", "rating": 1}, {"title": "The last person I sent funds to never…", "text": "The last person I sent funds to never received the money.", "rating": 1}, {"title": "Worse issue resolution ", "text": "Can’t send or cancel the transaction. ", "rating": 1}, {"title": "Cash pickup fee is crazy high", "text": "I will most of the time send money via bank account to Nepal and very rarely cash pickup. Why in the world cash pickup fee is $7.99?? Even if I send $30 or $40 or $100 the fee is $7.99. This cash pickup fee is insane. Always had moneygram account but recently though of using western union and tried once where first transfer was free but today when I tried second transfer, it showed cash pickup $7.99. Immediately turned back to moneygram.", "rating": 1}, {"title": "Took 30+50$ fees for 400$, never again", "text": "Friend sent 400$, payed the 30$ Fee, and despite current exchange rate of 0.91 i received only 323€ instead of 365, which is an Exchange rate of 0.8. meaning they deducted another 50$. calling the customer \"service\" guy i was told \"they also gotta earn .oney\". Never again Western Union.", "rating": 1}, {"title": "y the heck you need I'd now after 6…", "text": "y the heck you need I'd now after 6 freaking years of transaction for every single momth", "rating": 1}, {"title": "NO PROMO!!!@!#!@%", "text": "Date of experience: September 11, 2024", "rating": 1}, {"title": "Good luck! They will freeze your money!", "text": "Good luck! They will put your money on hold \"for your own safety\" for 7 days or more until they \"verify\" your identity. Even if you use your computer or the app, they will still need \"to see\" your ID. But, how can they see it if the transactions are online? Well, you will have to take a picture of your ID/passport and send it via email or upload it to a website. Another option they give you is to reply with your personal information (ID, place of bith, address, phone number, etc.) to an email they'll send you. Not safe. However, they will tell you that it is for your own safety and they will \"safekeep\" your money until you do so. If the person you are sending this money to is in urgent need of it, try another company. I did one transaction with my computer, they put my money on hold, I did a second one with the app, thinking they could send me a text to verify it was me, same. They put it on hold too for 7 working days! Since the issue \"according to them\" was that they needed to \"verify my identity\" to protect me from fraud, and my cousin was in urgent need of money, I ended up going to the bank to withdraw cash and do the transactions in person at a Western Union location with my ID to avoid delays and they could verify it was me (while I waited for them to free up the money from my other two transactions). After I did the transaction in person I received an email stating that my transaction was \"under review\". 24 hrs. later, it was still under review. So, I called them to see what happened, and their answer was that they needed to \"verify\" my identity! I don't have extra money to send. They still have the money of the three transactions. I've spent hrs. on the phone, and my cousin still doesn’t have the money he needs! I've been a Western Union customer for many years. However, this company is not longer reliable. For how long my money will be frozen I don't know. Western Union, never again. To top it off, if you call, no one will transfer you with a supervisor, you will get a representative that has been trained to say \"I am really sorry that this happemed to you, I understand...\" and will tell you to send your ID digitally or wait 24 hrs. After 24 hrs. of silence, you will call again and then, they will tell you that they will send an email to escalate your case to the next office and that they will take 7 working days or so to review your case and come up with the resolution. And, if they didn't respond, you could call again to see the status. Horrible!", "rating": 1}, {"title": "useless reward points", "text": "useless reward points, always waste of them, they'll be gone if I refresh my page.", "rating": 1}, {"title": "I can never use my points", "text": "I can never use my points. RIDICULOUS SYSTEM OF REDEMTION", "rating": 1}, {"title": "I was charged a$15.00 processing fee…", "text": "I was charged a$15.00 processing fee for returning a money order for refund. It took a long time on the phone to get a human to help, the computer system does not easily transfer you. The representative was less than helpful, and when I asked to speak with a supervisor I was told he was on a break! This is not fair, I had to wait a month and then get ripped off for $15.00. Poor service, outlandish fees, I will NEVER use Western Union for anything again. ", "rating": 1}, {"title": "it was an unauthorized transaction from…", "text": "it was an unauthorized transaction from one of my accounts.", "rating": 1}, {"title": "I can't transfer", "text": "Date of experience: September 10, 2024", "rating": 1}, {"title": "Every time I use Western Union", "text": "Every time I use Western Union, I have to cycle through different browsers as there is a continual conflict in not receiving my redeemed rewards, or in completing the transaction. They really need to upgrade their platform and enter the modern world.", "rating": 1}, {"title": "Now my money everytime go in holding", "text": "Now my money everytime go in holding ", "rating": 1}, {"title": "My wire transfer to a regular receiver was rejected by Western Union", "text": "My wire transfer 942 713 5601 to a regular receiver was automatically refunded. This is a regular transfer that has been done previously, so there is no reason to reject the transfer. This is not acceptable.", "rating": 1}, {"title": "Bad service", "text": "Date of experience: September 10, 2024", "rating": 1}, {"title": "Very complicated for no reason at all", "text": "Very complicated for no reason at all. Credit Card number, CVV-code,  BankID three times, email-adress with password, Social security number but still make it more complicated by asking for some stupid proof of funds. If there is other solutions, don't use western union. Really bad company", "rating": 1}, {"title": "NO REWARDS FOR REPEAT TRANSFERS!!!!!…", "text": "NO REWARDS FOR REPEAT TRANSFERS.I SENT 20,025 PHP TO THE PHILLIPINES.THE EXCHANGE RATE WAS BAD.THEY CHARGED ME $6.99 USD FOR FEE AND THEY NEVER GIVE OUT REWARDS POINTS FOR SENDING MONEY WESTERN UNION. I HAVE SENT THOUSANDS OF DOLLARS VIA W.U. AND THEY ARE SO GREEDY THAT THEY STOP GIVING REWARDS TO CUSTOMERS , IN THIS ECONOMY THAT SUCKS.SHAME ON YOU WESTERN UNION!!!", "rating": 1}, {"title": "Poor Customer Service", "text": "I have been trying now for 21 months to get a transfer to me completed. Customer Service are unable to understand my complaint and refuse to investigate staff for whom I have given details at their request. They ask me for the details then say they can't look into the matter. An utter disgrace. Case numbers available.", "rating": 1}, {"title": "Just tired of you making it had to help…", "text": "Just tired of you making it had to help people and always wanting me to say how good you are.  Just let me send the funds I want.  I will let you know if I am not happy.  And by the way I am not happy with Western Union and looking at how to send funds other way.  So I hope you lesson and just let me do what I want and need to do.  If not you did not want my business any way.", "rating": 1}, {"title": "Why are some transfers delayed?", "text": "I performed two transfers about a week ago that were delivered in minutes.  I attempted two more transfers this weekend to the same recipient and they are both delayed by days.  I don't understand the problem.", "rating": 1}, {"title": "Clarna payment works just occasionally", "text": "Clarna payment works just occasionally. Very bad service", "rating": 1}, {"title": "Lying about the time of the transfer", "text": "I am pretty shocked about the positive reviews here. Is that real or fake? I transfered money with a method which should take only minutes. Next day I want to pick it up and waited 1 hour in the Q. Then I was told the transfer did not go through. After talking to the customer support they said it will take 1-3 days. I was asking why they claim it only takes minutes when it takes several days they just said it takes 3 days and ended the chat lol. Why you hate your customers so much? I mean its ok if it takes 3 days but why telling customers it takes 5 minutes then? I don't get it. I think I gonna at least TRY if Moneygramm is more customer friendly. Honestly, what shocked me the most was the customer service. In all honesty, that was beyond bad.", "rating": 1}, {"title": "The web site sucks it always freezes…", "text": "The web site sucks it always freezes and only give part of the information. I have to wait until I get an email to even read the confirmation number.", "rating": 1}, {"title": "The site freezes all the time", "text": "The site freezes all the time. I sent money to someone I did not want because of the delay in response to your site. I dont know another method to send otherwise I wouldn use WUIS at all.", "rating": 1}, {"title": "Too many formalities", "text": "Too many formalities, was trying to send money back home but keep asking upload passport photo and I uploaded but still transfer not done yet, it’s frustrating ", "rating": 1}, {"title": "Can't make transfer using WU", "text": "I'm try to make two transfers of similair ammounts and your systems refuses to process because they are like transactions.  Really!And I don't even see my WU Number under the profile option. otherwise I would have left it with this review.", "rating": 1}, {"title": "False and misleading about how much you will receive ", "text": "I made my purchase with WU after comparing to other services. Their site and app state the exact words “receiver gets” which also appears on my record with them. This  was a false misleading statement which I based my purchase with Western Union on. After asking WU why the WU office I collected from took some money from this sum they replied it is tax in the country. That they deduce tax in the country is no secret (if this is correct) and so why give false information to your customer since you know exactly how much a person would REALLY receive. Furthermore WU response to my complaint did not answer this, just ignored it and only said “ our team has sent us an update in regards to the transfer 7180962346 which was collected successfully. Our team mentioned that the money transfer has been deducted with 0.4% tax applicable when receiving funds according to the local laws of the country.” ref:!00D150F40r.!5006O02PlS0J:ref ", "rating": 1}, {"title": "Cost too much and the receiver had…", "text": "Cost too much and the receiver had problems getting the money ", "rating": 1}, {"title": "Horrible customer care service", "text": "After sending transactions and paying their fees for a years they simply decided to restrict my transaction with error message that i exceeded my limit. Their customer service agent did not cares at all for my request to remove restriction. I am so dissapointed how they cares about customers", "rating": 1}, {"title": "The Trans ending in 0097 was never…", "text": "The Trans ending in 0097 was never guven to my recipient.  Said system was down.  Yet you sent email saying she got it.  Please resolve.  Thank you.", "rating": 1}, {"title": "It's not allowing me to use my redeem…", "text": "It's not allowing me to use my redeem points to have a discount in my transfer fee. ", "rating": 1}, {"title": "Where are my reward points", "text": "Where are my reward points? You stopped years ago and tell me that you are working on it. You owe me hundreds and hundreds of points. I want them now!!!", "rating": 1}, {"title": "SLOW - I never use WU and never will", "text": "I never use WU - I was sent money and it hasn't arrived. The Customer Service Phone line tries to sell Medical Devices. I use WISE and I am never going to use Western Union. I am registered with Trust Pilot. ", "rating": 1}, {"title": "Western Union -The Worst Money Transfer Firm", "text": "I recently attempted to send money to India via Western Union for my father’s surgery. They initially promised the transfer would take 0-4 days, but after 5 days, the funds still hadn’t arrived. When I followed up, they informed me it would take another 3 days. Their customer service team claimed there were issues on the receiving end, but after checking with the bank, I confirmed there were no problems with the account. It became clear that they were not being truthful.When I contacted them again, they said they needed another 72 hours—another 3 days—to complete the transfer. This has been the worst money transfer experience I’ve ever had. Don’t be fooled by their offers; there are much better options out there.To make matters worse, the customer service manager, named Jamy or something similar, was incredibly rude and dismissive. I’m genuinely shocked that this company remains in business with such poor service. This was, without a doubt, the worst service I’ve ever encountered.", "rating": 1}, {"title": "Just want to send cash to a friend and…", "text": "Just want to send cash to a friend and you make it so hard to do it.", "rating": 1}, {"title": "This program DOES NOT work", "text": "This program DOES NOT work.  I try to send to someone and I enter the amount.  Then it changes to some random receiver and not the person I selected.  When I edit the person again, it changes the amount.  The conversion is done incorrectly and shows a bogus conversion.  You can edit this for 1/2 hour and various random things happen, but never what is supposed to.  This has been this way for a few weeks.  It is completely unusable.  I eventually, by chance, was able to get the transaction I wanted.  The phone app works great.  This issue was for the website.  Thanks.", "rating": 1}, {"title": "This web site is extremely slow", "text": "This web site is extremely slow. stuck while I input data.", "rating": 1}, {"title": "Very bad service can't transfer money ", "text": "Very bad service, can send money. Called call center 3 times, put chit. Can't.resovle the problem . Tried the website. Call my band they say all good from their end. Called western union they say money not released by western union. ", "rating": 1}, {"title": "prize of transaction", "text": "You did not give me the possibility to use my point to low the cost of transaction. It seemed but eventually it was impossible", "rating": 1}, {"title": "Sucks to hard to use not good needs up…", "text": "Sucks to hard to use not good needs up dating to a simpler usage ", "rating": 1}, {"title": "Bad System - holding my money and wasting my time", "text": "Western Union suddenly hold the money that I sent. According to the receiver, I need to verify myself first and give Western Union a call. Waited almost an hour to talk to their compliance department, after that I was advised that the receiver should call to verify himself. So he called and came back to WU after receiving a text message that he can claim the money. But was told again that I should be calling them to verify myself. This is BS. I have to call again and explain all over again. Very bad service, wasted so much of our time and did not get any compensation at all. I am not even sending a million, only small amount and yet WU has to hold it?! So disappointing. Never again! ", "rating": 1}, {"title": "You won't accept promos on your site…", "text": "You won't accept promos on your site and jack me around like a buong", "rating": 1}, {"title": "Can never transfer on line forced to pay extra fees at WU location", "text": "Can never transfer on line so forced to go to a location and pay extra fees.  What a waste of time the website is.", "rating": 1}, {"title": "your rates??", "text": "Date of experience: September 05, 2024", "rating": 1}, {"title": "slow", "text": "It is always so slow, and I have to try up to 10 times sometimes more before it works. Otherwise ok. I spend hours, sometimes days before the money is sent.", "rating": 1}, {"title": "Raise in fees, Points DONT work", "text": "The transfer fees to India has been raised to $1.99 AND the points I have dont seem to work. I get an error each time I've tried to use them", "rating": 1}, {"title": "Thw same thing as every time I try to…", "text": "Thw same thing as every time I try to send money.     first you want a copde, which does not work, Then I have to reset my password.    I have been using your service for a long time.   no all of a sudden I have problems. Please fix this, orI will find another service", "rating": 1}, {"title": "3 days and my money is lost", "text": "48 hours ago I made a payment for a holiday I am going on. Instead of the promised 2 minutes,  3 days later they are telling me 'the transfer is approved but there is a system problem'. They have said that or 3 days straight. No explanation, just repetition of 'try again in 24 hours'. This company has literally one job and they fail spectacularly. I cant even get my money back for 7 business days. I have overwhelming hatred for something that is supposed to be so simple", "rating": 1}, {"title": "extremely slow web site", "text": "Date of experience: September 05, 2024", "rating": 1}, {"title": "I was a Western Union customer since…", "text": "I was a Western Union customer since 2018. They blocked me, and they asked me that I need to send specific information for validation of my information. I submitted my paystubs, bank statements, and my driver license. After I submitted all my personal documents, they blocked me anyway. They required to comply with industry legal and regulatory standards in the countries they do business, and they allege that I am not complying. I asked them what the reasons to blocked me; they answered that they couldn’t be disclosed since it is a private policy of them. They never give me a real reason for what I did wrong.", "rating": 1}, {"title": "System is so bad", "text": "System is so bad ", "rating": 1}, {"title": "Too much technical problems you have", "text": "Too much technical problems you have. Takes too long to send money. Wait and wait for you to begin transfer.\"Sorry, try again later\". Not just one experience.I use Western Union very much.", "rating": 1}, {"title": "No bonus points", "text": "Date of experience: September 04, 2024", "rating": 1}, {"title": "Just burn your online system or go and learn from xoom ", "text": "By letting the transfer get completed if we have to go and visit ur branches for every transfer than what's the use of online just burn up this online system of yours!!!!!On every transaction it says sorry use another payment method or card and I've tried all of those methods and all of my cards but it kept on saying sorry contact your bank it's all just wastage of time just go and first learn from xoom how it's done!!!!", "rating": 1}, {"title": "You are scammers", "text": "You are scammers - tried to make me pay $21+ in fees online and when I decided to do it in store $8 you made me go through my id verification and wasted my time .. I am disgusted!", "rating": 1}, {"title": "If i could give less than a star", "text": "If i could give less than a star, I would. I did my money transfer on the 21st August. It’s 4th september and I havent receive my money yet. After lots of calls and chats with them, they always give me the same answers: i am scalating your case and you need to wait for the team to contact you. No team has contacted me during this 3 weeks. I am done with this awful service, and worst of all, I am still WAITING for my money.", "rating": 1}, {"title": "Now always decline not easy like before…", "text": "Now always decline not easy like before . More than 5 times decline after review.! even i have been complete the data and id picture", "rating": 1}, {"title": "Western I ask to stop giving other…", "text": "Western I ask to stop giving other deals and or offers from other business to shop for products and to join a service and start the new points/discount plan you promised since January 2024.", "rating": 1}, {"title": "RIDICULOUS HIGH RATES", "text": "RIDICULOUS HIGH RATES. CHARGED ME 70 DOLLARS TO SEND 700. When did western union become this high to send money? Will not be using Anymore ", "rating": 1}, {"title": "scam!!!! Be aware", "text": "Got the funds transfered. Then went 3 first locations where they say you can pick up. Didnt get the money, asked chat a location where i can pick up money and they cant give me one that for certainly will give me the money 😅.This site ladies and gentleman is a scam !", "rating": 1}, {"title": "They don't care about the receiver…", "text": "They don't care that a cash for you store won't give me my money pick up. They only care about the senders and the stores in Burlington just say they don't have the money to pay. I called WU and they don't care. Let me find you another location. Screw you!", "rating": 1}, {"title": "Disappointed ", "text": "I am very disappointed and frustrated about the service I received. I made a transaction to send money. They took the money and then they ask to verify the account. I send them the details but they are not happy with it. They are now making use of my money and I am not getting the money transferred. ", "rating": 1}, {"title": "They're got horrible service on their…", "text": "They're got horrible service on their app. I'm trying to send money to the Philippines to my wife. Who is in desperate need of it? And they have my money on hold Waiting on my approval now I'm waiting on them to call me back and it's been 3 hours. My wife needs that money. They have no food. I will use moneygram from now on", "rating": 1}, {"title": "Online transfers ", "text": "I am still not able to complete transactions online. Error code c2002", "rating": 1}, {"title": "poor customer service - too many transfers fail", "text": "From the transfer I initated on Sunday Western Union made two transfers, thus doubled the sum.Neither of them was effected, neither charged to my account.Calling customer service I only heard many times \"sorry\", but the young lady 'Minna' was not helping me at all, obviously had no tools, no knowledge, no power.", "rating": 1}, {"title": "Shout out to western union Germany!!", "text": "Shout out to western union Germany!!! What a stupid rules you have. I am supposed to withdraw a money coming America. The problem is they are don’t want to release it because they are still require me to provide an ofc Identification of the sender though I already provided them my government ID. I tried to contact the sender but she is not cooperating anymore😭 I am really pis* of rn because that’s my money, Its a refund for me, for a  cancellation of application. I don’t know what to do anymore.", "rating": 1}, {"title": "Western Union service is going from bad to worse. Every time I deal with WU it is almost like a nightmare. The CSR Neil was very help but logging in to western union is scary and unreal adventure.", "text": "I have been a very loyal and dedicated WU customer for almost 14 years. I use their service every month for atleast 4 or 5 transactions. My WU number is 199516338.The last two years I have had a roller coaster ride with WU and tge challenges I have had are too numerous to write about in this space. I will start evaluating my alternatives and options tomorrow and hopefully as soon I find it i will be delighted to take my business elsewhere. These are the signs when businessess start going down the slippery slope in to oblivion! 1-845-505-4360 Adil M. Ameer", "rating": 1}, {"title": "site or an application does not work ..", "text": "Date of experience: September 02, 2024", "rating": 1}, {"title": "Pop-ups continue interfere with…", "text": "Pop-ups continue interfere with transfers.", "rating": 1}, {"title": "app is not responding", "text": "took about 1 hour to do a transaction app keep stopping on me", "rating": 1}, {"title": "Why am I not able to use reward points", "text": "Why am I not able to use reward points, every time not available. I need to find another source to do this money transfer. Not acceptable", "rating": 1}, {"title": "Muslim name …", "text": "If you are sender or receiver named Ahmad /or MohammadDon't ever use wu ...Waste of time ..always block money need ids ...only if name is mohammad or ahmad else itvworks perfect..they should stop this nonsense..wanted to send 38 dollars to nephew and they blocked not 1st time ...what kan man buy with 38dollar to harm some 1 ..Use remitly instead ", "rating": 1}, {"title": "I tried for over an hour to send it…", "text": "I tried for over an hour to send it earlier today and as it has done many times before it acted confused. today I was denied the transfer many times. your app took me through procedures that it shouldn’t have had me go through. It sent me a code to put down on a form. Is substituted other recipients name names. I’ve been your customer for many years and certain times of the day here in the Philippines. It’s almost impossible to make a connection a transfer.Tonight I tried it again and it was very swift and and good", "rating": 1}, {"title": "Sent same damn transaction over and…", "text": "Sent same damn transaction over and over and you just want to mess with me.  ", "rating": 1}, {"title": "Website lagging", "text": "Website lagging, app not working for Switzerland. Asks me again and again for Credit card pictures. ", "rating": 1}, {"title": "Had trouble logging in", "text": "Had trouble logging in. Finally after 20 minutes I was able to send money.", "rating": 1}, {"title": "no  rewards, high fees, system too slow,SWITCH TO WISE", "text": "no rewards. system too slow. high feesI have made several transfers over a period of months and you keep saying you are updating your system and you dont give me points.. I will be looking to find another service, maybe WISE.", "rating": 1}, {"title": "Your system was down for almost a week", "text": "Your system was down for almost a week. I made several phone calls to no satisfaction. My card was hacked on line and the first charge was WU$0.00 followed by several Other sites charges of $1.25. Only card I I had left to use was a credit card. Went to 2 physical locations only to find they did not accept credit cards. One of your staff members gave me a code for a discount to try to appease me for 50% off. I am not appeased. I had to go to the store again on 8/29 with a new debit card as your system was still down. I wasted over 8 hours on this.", "rating": 1}, {"title": "your web site its sooooo slow too many…", "text": "your web site its sooooo slow too many clicks and time to set up the sending money", "rating": 1}, {"title": "Rahaa minuuteissa palvelu 1000€ siirto…", "text": "Rahaa minuuteissa palvelu 1000€ siirto itselle Yhdysvaltoihin maksu kyllä kelpasi heti. Rahoja ei siirretty.  In english as well. They advertise money in minutes, send online from me to me(on a holiday and my physical bank card broke down). So required from tranferring if you are a finn is a hard bank identification. So i do that and on the receiving end i ofc. Have to show passport. So just sending money to me from me still this site blockes my transfer so now im without the money but my bank account was hard charged for 1000€.", "rating": 1}, {"title": "I’m a costumer since 10 years", "text": "I’m a costumer since 10 years, I have been using your service while living in Belgium , than in London and is already 5 years now I use western union from UAE . I usually never leave reviews but I’m so frustrated on how bad the service is getting. The last 2 years I had so many bad experiences that I can’t count them anymore. Starting from the fact that now is not possible to pay through gateway online but you have to do a bank transfer to Al Fardan exchange and insert the reference number. I can deal with that fine, but than they tell you 1 to 3 days will send your money and it takes more like 1 to 2 weeks even though you send email complaining and receipt of payment they keep telling you we are prioritizing your transfer whatever. Time pass and than this last time they even lie to me , telling me that my bank didn’t release the money, when I check with my back they mention we haven released it the day after the initiation. But this is not all , you need to pray that there is no glitch in the system like happen to me or that you don’t make any mistakes otherwise you’ll see your money returned to you after a month or so , this is the time they take , unreasonable and ridiculous if you ask me. At this point many will ask me why I don’t simply stop using their services, well I was reluctant because I was a loyal consumer, but enough is enough.If you have a different way to send money I suggest you to use it . ", "rating": 1}, {"title": "They suck never in life will by western union ", "text": "Gave me the runarounds to cash there money order knowing damn well that I couldn’t cash it except the place of purchase, even told me to go to Wells Fargo lol y’all sorry suck and want to charge people to get their money back. Bunch of thieves Rude will lie as the day is long y’all is aExtraordinary sorry business ", "rating": 1}, {"title": "Why do I have to enter recipient’s cell…", "text": "Why do I have to enter recipient’s cell phone? What about someone who does not have a phone? ", "rating": 1}, {"title": "Western Union lies!", "text": "Western Union lies!The company tells they will transfer money in minutes.But it takes hours and hours and now I did not get any infos so it might be days and then how will I act?", "rating": 1}, {"title": "Terrible", "text": "Terrible, just terrible.  Every time I try to send money from my laptop, I have to try a dozen times and each one is incomplete.   You take the money out of my bank account and then deposit it back in.    I have to call your customer service and they have me do all kinds of things like removing my payment card and then reentering my payment card, but it still doesn't work.  Very frustrating and not worth the trouble.  Give me a reason to stay with your company....", "rating": 1}, {"title": "Hello I have been using WU for the last…", "text": "Hello I have been using WU for the last 25 years but everytime the service gets worst!!  To send moany now, I have been in your system for over an hour, it freezes and it put my name as receiver!!  At least refund the fee that you are charging!!Thank you.", "rating": 1}, {"title": "Half of the screen is blank", "text": "Half of the screen is blank, no receipt", "rating": 1}, {"title": "I am not sure if i have sent or not…", "text": "I am not sure if i have sent or not sent money to Mosab Yahya.  i can not find tracking number.  It all went very fast.  I suspect there is something wrong. It can very well be my fault.  Now I dont know what to do. I have sent to Mosab severel times, and never had a problem.  Please tell me if I have ent something, or not. I have missed the tracking number.", "rating": 1}, {"title": "I had forgotten the slip with the…", "text": "I had forgotten the slip with the reference number and it costs me a lot of money ring overseas to locate the number. It was almost two days process. The people on the phone was useless and was not willing t help. The last attempt to resolve the problem, a male clerk asked for my passport number and that was the information required. Your staff was not up to date. It was disgusting the way the handled the situation.", "rating": 1}, {"title": "Excellent and am happy to have you!!!", "text": "Date of experience: August 30, 2024", "rating": 1}, {"title": "This company has gone downhill", "text": "This company has gone downhill! I had an online account in good standing for years. I'd made numerous transfers without problems. I just tried to make a transfer and was stymied and obligated to fill out a questionnaire. I uploaded several documents ID, Bank statements, Schedule C and a letter from my bank tying my debit card to my checking account. Without explanation their compliance department rejected reinstating my account. I spoke to their customer service department and they had no answers as to why. Of course for a much higher commission I can go to a store and make all the transfers I want. If you're offering online services set a minimum or charge higher fees but don't waste my time playing games. It's absurd! I used money gram and without a hitch the transfer went smoothly and for lesser fees and a better exchange rate!", "rating": 1}, {"title": "Clunky site, not very friendly", "text": "Once a month, I send the same amount of money to the same prisoner. Every month, I have to re-store my debit car info (same card, every month),Lately, you're holding my transfer for some kind of further review. How many months do I have to do the same transfer before you figure out it's permissible?", "rating": 1}, {"title": "every time I try to send money,I have…", "text": "every time I try to send money,I have to reset my password.    I am getting tired of this.    Either fix this, or I WILL find another way to send the money", "rating": 1}, {"title": "I am forced to enter a code sent to my…", "text": "I am forced to enter a code sent to my email account that I had trouble logging into to obtain. All of this to send money to an account I have been depositing to for 8 plus years.  Plus as an added hassle I have to stop to find a Philippine phone number so I can deposit money to a bank account.  My god how much verification do you need for an existing account this is ridiculous.", "rating": 1}, {"title": "inefficient web system", "text": "I can’t believe how inefficient your web system is. I’ve been using you online, many times it works and many other it doesn’t. It keeps canceling my transactions. Please look into that problem please ", "rating": 1}, {"title": "Of course can improve.", "text": "Of course can improve.They have a obsolete system which they never update or review.A total disaster.When you want to send money to a NEW RECEIVER and fill.out the form on line doesn't go to next step.Return to the same page to send to a new receiver. 20 times , doesn't go no next step.Waiting my time for one hour , a disaster. ", "rating": 1}, {"title": "This app is trash", "text": "Date of experience: August 29, 2024", "rating": 1}, {"title": "For more than 3 days trying to send money butEvery time my transaction under review never answered", "text": "For more than 3 days trying to send money and every time I get your transaction under review and never resolved I am disappointed because I have been your customer for more than 20 years", "rating": 1}, {"title": "The money transfer does not work, WU does not care", "text": "The money transfer does not work. The recipient has been to 3 different agents including official Western Union office. Everyone says the money has been withdrawn already or that the MTCN does not work and is refusing to help. When I call the support they say there are no problems the recipient can collect. I try to keep explaining they are saying the money transfer doesn't work and requesting an investigation. At least this cannot be allowed to happen again. They don't care and do nothing and only offer a refund that takes 5 days. So this issue is still present and can happen to any other customer at any time. The money is for medical bills that needs to be paid today! We have been trying every day for 3 days!I highly advise to only use Western Union as a last resort and always look at different option first.I thought you could trust a company that is this big and works with money more. They can simply not be trusted in handling your money.", "rating": 1}, {"title": "app is not working well in the last…", "text": "app is not working well in the last week aug28th 2024…..you cant see it", "rating": 1}]