[{"title": "I cancelled the Dental Insurance…", "text": "I cancelled the Dental Insurance because I wasn't given the opportunity to choose paper billing it was automatically chosen for me. And to change to paper billing would've been an extra 6.00 that's not the way to do business. Will I recommend you all No", "rating": 1}, {"title": "The agent had not called back", "text": "The agent had not called back. Parents are signed up -- money is taken but no final signature done.   I was told will be getting email for elctronic signature and have not reveived it yet. Have called office.", "rating": 1}, {"title": "When  I called to find out about  how…", "text": "When  I called to find out about  how this plan d was going to help me let did not  tell me it would cost me. About 40.oo dollars amount I was calling about how you were  going not cost me more called letty Saad 3 times she never called me back had to call another  her name wasjesica she was very helpful in letting me know how to cancel when some one misleads l loose all trust in that company letty never called  me back", "rating": 1}, {"title": "Not happy", "text": "I was told that I would get an monthly allowance of 75 dollars for over the counter expenses. But instead I've learned that I only get the 75 dollars once every three months So I was basically lied to, or maybe I misheard Mr. Labrado anyway I am most dissatisfied with this decision to go with Humana and this plan I will consider changing if possible.", "rating": 1}, {"title": "I get at least two Robo calls every day…", "text": "I get at least two Robo calls every day never leaving a message just a hang-up since Oct 2022.  I had even asked Danielle Branch to not allow these calls because I don't answer them.   I also emailed her back telling her I was getting the calls and did not hear back from her.", "rating": 1}, {"title": "The lady never called me back about my…", "text": "The lady never called me back about my card information", "rating": 1}, {"title": "Aetna is the worse medical insurance ever!!", "text": "We have been setting appointments for my husband for the past 2 weeks and they get canceled the day of we are very frustrated. Aetna is the worse medical insurance ever!!", "rating": 1}, {"title": "I have not received  the info I…", "text": "I have not received  the info I requested, just resently this morning I called and left another message and also sent her an e mail for the same for the sales rep. ( she mentioned to contact her  with any questions) and I did I would like some response Thank you", "rating": 1}, {"title": "This company now (Liz) gave us a wrong…", "text": "This company now (Liz) gave us a wrong quote on this insurance!!!!   She said my Ozempic wud be $47 a month until I fell in the “hole”.    Ozempic is very hard to find now but the CVS found me a box.  Suckered me into $197!!!!! Says there is a $150 on first prescription. Including the $47!!    NO ONE ——- ever gave that quote    Liz said the insurance company was wrong.  Said we shud call her and she wud call them with us on the phone      Well three calls to her now since Friday we keep leaving messages and we get no call backs.   Was this an easy sell for UHC      We are in a fixed income and can’t afford this as is is let alone surprises from anyone.   Now on the phone waiting for UHC to get someone to talk to —- about half an hour already.   Not a good way to start with a new insurance company!!!!!", "rating": 1}, {"title": "i though I signed up to have the…", "text": "i though I signed up to have the ability to be able to pay my utilitiesItis now the end of the month and I willnot be able to do so as I have not recieved anything.othing that would allow the chance  to pay anything. Also I  have not even recieved an ID card.", "rating": 1}, {"title": "I agreed to listen and consider…", "text": "I agreed to listen and consider switching my health insurance but wasn't ready just yet. Your company switched my insurance anyway. NOT HAPPY!!", "rating": 1}, {"title": "I inadvertently initiated contact with…", "text": "I inadvertently initiated contact with this company while trying to compare Medicare Advantage plans.  Despite the fact that I have repeatedly requested that they remove me from their calling, since November 15, 2022   they have continued to call my home 2-3 times a day, hang up abruptly when I ask them not to call again, and immediately call right back.  This is deliberate harassment and the company management should monitor their employees more closely to ensure this does not continue.  I am on the Missouri No-call list and I have filed a formal complaint.  Hopefully, this will end the harassing  phone calls from this company", "rating": 1}, {"title": "These bags start calling at 8 a.m.", "text": "These bags start calling at 8 a.m., never leave a message and just continue to harass. Wouldn't do business with based on the nuisance.", "rating": 1}, {"title": "I haven’t got any of the promised…", "text": "I haven’t got any of the promised information about my new Humana plan. No cards…nothing!!!", "rating": 1}, {"title": "I have to find a doctor or I have to…", "text": "I have to find a doctor or I have to find a specialist I have to locate and And uh none of cope is too much", "rating": 1}, {"title": "What are you", "text": "What are you? Did I pick you? For what exactly?I can't say what service I am supposed be grateful for precisely?", "rating": 1}, {"title": "To be honest up front", "text": "To be honest up front.  I did not choose your company. I am with United Healthcare. And am staying with them. I have and agent.", "rating": 1}, {"title": "Train your customer service reps", "text": "Tried to tell your rep Shirley had passed…but your rep gave me lip so I hung up…bad customer service", "rating": 1}, {"title": "I have nothing to do with Ensurem", "text": "I have nothing to do with Ensurem. I know nothing about the product, either.", "rating": 1}, {"title": "Remove agents that do not know what…", "text": "Remove agents that do not know what they are doing I spoke with an agent that gave me false information and removed me from my previous insurance company put me with another insurance company that my doctors were not in their network never again this has been a nightmare trying to fix", "rating": 1}, {"title": "Misleading agent.", "text": "All this PROVIDING Ms. McLain has been truthful with me....this review is dependent on Ms. McLain's truthfulness going forward. I do not want Humana HMO.   I don't want what Ms. McLain is selling me.  The plan she wants to sell me is not in my best interest.", "rating": 1}, {"title": "Agent didn't infirm me what day the…", "text": "Agent didn't infirm me what day the policy would be taken out . This costvme iver draft fees Also, waited two days for a call back from agent and was only called back when told them to cancel if she couldn't call me back.", "rating": 1}, {"title": "Found a better company", "text": "No further comment. i left a voicemail with agent i spoke with, and she has yet to return my call. please acncel my enrollment with the AArp Medicare Advantage Plan offed by United Healthcare immmediately", "rating": 1}, {"title": "Th insurance in Texas is no goode reason I gave you are one star is…", "text": "The reason I gave you are one star is because every time I call to speak to a supervisor nobody gets me to that point every damn representative tries to help me because they want to get paid you know what if I have money I would get regular insurance instead of being on Medicaid Medicare in the state of Texas and by the way Medicare and Medicaid in the state of Texas doesn't even cover anything for you but if you were in Phoenix Arizona hell yeah I'll cover everything 100% everything it is so sad that the people of Texas have to go through what they're going through after all these years that they have worked and put into the system it's a crying shame", "rating": 1}, {"title": "I have been trying to reach an agent…", "text": "I have been trying to reach an agent for over one week with questions.  I have left 3 voice messages that have not been returned.  It seems that once you got me to sign on I was no longer important to you.", "rating": 1}, {"title": "Lance was real easy to understand and…", "text": "Lance was real easy to understand and thoroughly explained coverage in detail.", "rating": 1}, {"title": "Repeated phone solicitation attempts", "text": "I only have experience with Ensurem in the context of their calling REPEATEDLY without ever leaving a voicemail. I am on the NDNCL and when I politely informed them of that, the CSR was rather rude and hung up on me. We shall see if the calls stop.", "rating": 1}, {"title": "Didn't received proper forms to sign", "text": "Never received proper forms to sign. Agent sent me a empty form that didn't give me the option to sign. So I guess I don't have a policy. Supposed to be from Mutual of Omaha.", "rating": 1}, {"title": "Complaint", "text": "Did not follow what I asked for and has create a mess in my medical care.  I have been trying multiple times to fix the issue to no avail.", "rating": 1}, {"title": "Why did I switch?", "text": "I had a plan and was happy, then I got a call and said that if I didn't have a Medicare plan with prescription drug coverage, I would be in violation of the Medicare law.  I changed plans, now I have to pay thirty some odd dollars a month for this recommended plan.  I said I didn't like that idea, and was told that I should go back to the plan I used to have, so I don't have to pay the penalty, I am more confused than ever.", "rating": 1}, {"title": "Reprehensive set up plan and the agent…", "text": "Reprehensive set up plan and the agent never called to close.  Called back several times.   at one point a manager said she would step in and never did.  Please review your notes it was a fiasco, and I'm still don't have that coverage.  A review of your practices may be in order.  Thank you for asking.  However  I do believe this will go into the land of the abyss .  Thank you for asking.", "rating": 1}, {"title": "Your constant messages and phonecalls…", "text": "Your constant messages and phonecalls asking \"how you are doing\" are annoying as hell when all I have gotten so far is a couple if letters saying \"thanks, you have insurance, we will mail you more soon\". I don't have an UD card yet, I have not had a need to use the insurance yet.OH MY GOD! In the middle if writing this you just CALLED me, too!!! I went off on the poor lady calling me.Why ask for a review of my own message if you are NOT going to respond?", "rating": 1}, {"title": "I changed my insurance over with you", "text": "I changed my insurance over with you, staying with UnitedHealthcare but only changing from an HMO to a p p o. No they are not paying my prescription cost. A prescription I was getting for $0, is now $53 with insurance only paying 10 of that. I'm not sure who messed up but I need my prescription benefits back.", "rating": 1}, {"title": "all of your links are broken", "text": "Date of experience: January 01, 2024", "rating": 1}, {"title": "I pay for insurance so when I have an…", "text": "I pay for insurance so when I have an accident my phone can be replaced with the equal valueI.  Not what it is so out of date that it won't take my programs it's so by phones", "rating": 1}, {"title": "Spent a hour on the phone to end up…", "text": "Spent a hour on the phone to end up with the wrong plan.", "rating": 1}, {"title": "Fake advertising about gift cards", "text": "Fake advertising about gift cards. To many hoops for nothing and one survey after another other only to get 0. FakeDenise lynch", "rating": 1}, {"title": "Never heard of Ensurem you probably…", "text": "Never heard of Ensurem you probably been showing me offers about Medicare and such I never responded so now you want to know what I think of you?? Well you are a real PAIN", "rating": 1}, {"title": "Insurance coverage", "text": "Nothing bad with the experience", "rating": 1}, {"title": "They just won't stop calling", "text": "They just won't stop calling. I've had insurance through my employer for several years now and have not even browsed for insurance options I could elect to pay for myself. I get at least 2, (but up to 4), calls from Ensurem every single day. This has been happening for about 2 months now.", "rating": 1}, {"title": "After signing up for the program never heard from her again", "text": "After signing up for the program, can’t never get to customer service. Definitely cannot get in touch with agent that signed you up", "rating": 1}, {"title": "Not read so much stuff", "text": "Date of experience: November 30, 2022", "rating": 1}, {"title": "Nothing and they we're good help", "text": "Date of experience: March 24, 2023", "rating": 1}, {"title": "I switched because the previous…Duped and Stuck", "text": "I switched because the previous insurance company didn’t not provide what was needed for my mother. I was told that the current insurance company would provide 35 hours of home care for companionship. That was an exaggeration at best. They don’t provide anything, nothing! They would if it was Medicaid. Now, my mom is in a situation with no home care, there was no reason to change. This is everything I didn’t want. I asked several times and told the rep how happy I was. I am so beyond unhappy. I changed insurance companies specifically for this reason. I needed these needs to be met. And nothing. I found out when the nurse came to do the assessment. She said that because  my mother is able to bathe herself and feed herself and basically care for herself, that she doesn’t need assistance. This is exactly why I switched to you, so this wouldn’t happen, it happened before.I’m just done and over this entire ordeal. Switching disrupts everything, with the pharmacy, co pays, learning about this company, etc and for what? The only thing that changed is the insurance company. Duped and stuck!", "rating": 1}, {"title": "Very Very Unhappy with the service I received", "text": "I needed to move my 87 year old mother from Louisiana to California where I could take care of her. I asked the agent, Yvonne Henderson, for only 2 things.1. I need an affordable plan that will cover my mother in California2. I need a plan that is contracted with Loma Linda University Health in network so that all her care needs can be well coordinatedThat is all I asked!!!!! After many hours on the phone and getting transferred over and over, Yvonne Henderson assured me that the AARP Medicare Advantage Freedom Plus HMO-POS would cover California and Loma Linda University Health faculty physicians and surgeons was in-network as well a Loma Linda University Medical Center Hospital. I moved my mother to California feeling less than confident to find out my insecurities about the choice was well founded. This was all incorrect! LLUH doctors and hospital are not in network and they do not accept this plan. Now my sick mother is stuck in this plan and is assigned to some unknown PCP that we never asked for unless Myron A. Dace can escalate this to a point where she can be changed to the correct plan right away.The vital care that my mother needs is being delayed as we try to urgently enroll her in a plan that fits the description that I asked for in the first place.", "rating": 1}, {"title": "Please remove my name from your mailing…", "text": "Please remove my name from your mailing list. I have never requested for you to send me emails", "rating": 1}, {"title": "I still have not got my aetna mail!", "text": "I still have not got my aetna mail!! I have asked 3 times and still nothing!!!!!!!!", "rating": 1}, {"title": "Don’t understand what this is or what…", "text": "Don’t understand what this is or what is for?", "rating": 1}, {"title": "I spent quite a bit of time with an…", "text": "I spent quite a bit of time with an agent, told her I needed some time to make a decision. She said she'd keep all the information until I make a decision. I called today, she seemed quite agitated or irritated, saying that we spent over an hour on the phone going over everything approximately a week or so ago. She assumed I had picked United healthcare in fact I told her I did not make a decision and that is why I was calling back today. I needed more information about several other plans to get all of my doctors under the same Medicare advantage plan. She seemed in a hurry and told me she would call me back. I told her okay it can wait until Monday. Then I realized she did not understand at all what I was trying to do because she several times reminded me that we went over this in our first call. I specifically told her I did not make a decision that day. And I was calling today hoping to make a decision on which plan I wanted to take depending on whether my doctors were in those plans Network. She seemed in a hurry to get off the phone and so we hung up. I decided to go with a different insurance company because I felt she misunderstood our first conversation and I really didn't want to go over everything, I just wanted to find out about two other possibilities. Then I would make a decision. So I did not get a permanent answer and not satisfied. I called back and a different person answered started to explain to her why I am choosing another company. And to let the previous agent know not to call me back. Then all of a sudden I was hung up on. I thought maybe it was a mistake and she would call me back but did not. I tried again and called this time the agent that I was working with answered the phone. Apparently she was not too busy after all. I am very disappointed in feeling rushed and that they expected me to make an a decision without going through my questions. She did not remember our conversation prior to today's correctly. Very disappointed and cannot believe I was hung up on without trying to make the situation better it was made worse by being disrespectful. Letty you had time to answer the phone but you had no time to work with me. Try putting yourself in my situation and others maybe you will have patience for the elderly or disabled. I cannot recommend this insurance company. Not willing to give the required time that it takes to reassure a customer.", "rating": 1}, {"title": "Didn,t resolve issues", "text": "Date of experience: October 20, 2022", "rating": 1}, {"title": "Special person to talk to THANK YOU…", "text": "Special person to talk to THANK YOU Cloe…..", "rating": 1}, {"title": "Yes but we have not received any cards in the mail", "text": "Yes we feel good but we have not received any Mail", "rating": 1}, {"title": "I didn't get approved so of course I'm…", "text": "I didn't get approved so of course I'm not happy", "rating": 1}, {"title": "I did not get a feedback", "text": "I did not get a feedback. I still do not have insurance.", "rating": 1}, {"title": "was misinformed about prescription…", "text": "was misinformed about prescription co-pays.", "rating": 1}, {"title": "Not very hepfu", "text": "Date of experience: August 08, 2023", "rating": 1}, {"title": "You tell LIES!", "text": "Date of experience: May 25, 2023", "rating": 1}]