[{"title": "I used to order from Queensboro Shirt…", "text": " I used to order from Queensboro Shirt company and for several years have had no problems.  I think I've been ordering since before 2017. Today I went to the site - I had just recieved a jacket I like and I wanted to order more when I noticed that said jacket is on sale for 50% off. I contact customer service chat and ask for a half refund. He says no. I ask for a return label. he says no. This is from their website NO RETURNS NECESSARY GUARANTEE: \"Mistakes get made. Everyone understands that. You ordered a wrong size, we used a wrong thread color. You gave us the wrong date, we sent it to the wrong address. And then there are issues that aren't mistakes but just problems. A button falls off, UPS dropped your box in a puddle, you just don't like the shirts you picked out.\" I JUST DON'T LIKE JACKET AT THAT PRICE! I threatened to take my business elsewhere, mind you the difference is around $35, and he essentially said 'cya.'", "rating": 1}, {"title": "It’s good ", "text": "Wath is this Queen boro ", "rating": 1}, {"title": "Pushing the trash woke agenda over…", "text": "Pushing the trash woke agenda over there at Queensboro. Trash company! ", "rating": 1}, {"title": "Total lack of professionalism and…", "text": "Total lack of professionalism and customer service, I placed an order for shirts to be used in an event that we were going to attend and only today, on the day that we should be receiving our products (already paid for), we were informed that most of our order was made since 07/17/23 it would not be attended to. hurting us a lot. if we had known of your lack of ability to meet our request, we would have sought a company to meet us. I only found out because I got in touch with the company. if not, I would wait for my order for the rest of my life. the company has my phone number, my email and my address, but even so, it has not made any kind of contact.", "rating": 1}, {"title": "These people are so stupid cant…", "text": "These people are so stupid they cant even get your billing info correct, I need my shirts and they were suppose to be here on May, 10th they acually shipped it thru USPS instead of Ups, they lied and I do not recommend this company for anything. ", "rating": 1}, {"title": "Customer cannot get through a live…", "text": "Customer cannot get through a live person to discus with a messed up order. Every time I put an order, someone change it at their end and send wrong shirts.  They send a reorder but that was also wrong. They saying chat is only 15 seconds away, but i had to wait several minutes to get someone online to chat. I scheduled a call and I was one minute late.  I called back the same number after a minute and went to the main line.  Really frustrating.", "rating": 1}, {"title": "I notice how your prompt says...\"what…", "text": "I notice how your prompt says...\"what went wrong this time\"...nice.  Horrible quality of the embroidery.  Logo is illegible.  2nd time around with these issue.  Dropped everything off at Goodwill this morning.  Hope someone will enjoy it.", "rating": 1}, {"title": "Not sure what’s going on but the…", "text": "Not sure what’s going on but the quality of the embroidery has really gone down. After two horrible orders. I will not be returning!", "rating": 1}, {"title": "Customer friendly atmosphere and…", "text": "Customer friendly atmosphere and response is like a speed of light . Wow , am over excited for I have value for my money .", "rating": 1}, {"title": "Hi, I will like you to know about this, it's amazing.", "text": "Hi, this great, I never thought about this,I find their services very cool and moderate, I really like their clothes.", "rating": 1}, {"title": "felt confused by the process and was…", "text": "felt confused by the process and was not sure if i needed a physical copy and what is the duration of the visa.", "rating": 1}, {"title": "Cheap quality, poor service", "text": "The order deliver was poor quality, didn't match the colors from the approved design and the shirts felt cheap and had a horrible fit despite taking careful measurements beforehand. Their team placed an order which they later cancelled because they wanted an additional 30 shirts to be printed in order to get that particular design which they recommended and ordered themselves. What's worse is every time I contacted their support team I was met with a runaround, porr advice and ultimately dismissive and unprofessional responses with a cheeky attitude completely uncalled for, particularly from Allen Coffman.", "rating": 1}, {"title": "Queensboro went to the dark side", "text": "A long time ago, in a galaxy far, far away......Queensboro used to be a very good business to go for imprinted materials...I must have spent tens of thousands of dollars on t-shirts, hats, and jackets...But even before the pandemic customer service and assistance deteriorated.   My last 2 orders for $1K each took foreverrrr.  This last one, after a month and a number of emails postponing shipping dates I just had it.  It hurts to see a good business loose its compass and not even care about us little clients.", "rating": 1}, {"title": "Not doing business with these guys after four years.", "text": "Terribly long lead times and they still cannot deliver on time. No notification if their is a problem.  You tell them something was wrong and they don't care about making it right.  Everything is estimated (even after waiting almost four weeks) and they still cannot deliver on time and will not do anything to help you but a meager credit.  They tell everyone their lead time is 14 days.  It still was not in production after 21 days.  I would avoid using these guys if anything is time sensitive because you will be disappointed.", "rating": 1}, {"title": "I have had a very bad experience with… the production time (Delay)", "text": "I have had a very bad experience with my last order, the truth is I do not know what is happening, In the first place the order has taken longer than it should, there were two errors from the staff because the logo had letters that were not in the original design .and that delayed the process even more.after that now they say they do not know the reason for the tradanza. which puzzles me and leaves me nothing satisfied so I will have to look for other providers.", "rating": 1}, {"title": "TERRIBLE service", "text": "TERRIBLE service! They changed the color, font and position of my logo elements without even asking. I am so glad I requested the PROOF or I would be stuck with crap that could not be worn. Why should I trust you EVER with my needs?I wish I could post the screenshot of what they call a \"proof\".Google reviews were spot on with this company. FAIL, 100%", "rating": 1}, {"title": "So far I'm not impressed", "text": "So far I'm not impressed!  I received a better price immediately after clicking place order, and have been unable to contact Queensboro in any way whatsoever.  There is no phone number listed (which is my preference), there are no employees answering chats, and my request for a response has so far gone unanswered.  This was a small test order to see if I like the company, their products, and their service before I commit to a larger order for end of year goodies for my customers.", "rating": 1}, {"title": "Placed and Order on 11/2/20", "text": "Placed and Order on 11/2/20. Had it approved 11/5/20 Still no communication from them on where order is or if delayed. I reached out today and they said they had items missing and waiting on them. So if I don't email to see where order is I am left with no answers still. Just terrible communication.", "rating": 1}, {"title": "Shipping fees are ridiculously expensive!!!", "text": "Shipping is $78 for 10 Fleece jackets??? That's more expensive then a 1 way southwest plane ticket that includes 2 checked bags. Also Queensboro ships slowest and cheapest way possible!!! The weight of the package should be around 15-16lb I checked fedex website it shows shipping costs $21, and I am sure they are receiving wholesale discount on shipping. Stop milking your customers on shipping fees.", "rating": 1}, {"title": "Avoid this company...i placed a order", "text": "Avoid this company...i placed a order, the hat is very small, poor materials from Bangladesh.the decals had already scraped off some, they ship in a plastic bag, not a box, it was all bent up,not worth it all, i wrote about my experience on their facebook page and they deleted it and blocked me, now i will file a dispute with my credit card company. avoid them.", "rating": 1}, {"title": "No one will call when I leave messages", "text": "No one will call when I leave messages, no one answers emails.I paid the $150 and asked for a phone call to setup up the web sitbecause of the lack of responce from Queensboro, that was on 11/4/2019.  I started my order in September 4, 2019.I wonder about the service my employees will receive when theaccount  is set up.", "rating": 1}, {"title": "Not a reliable company to work with!", "text": "I placed an order three weeks ago. They charged the amount and gave us approval with the shipping estimate, and when we're waiting for our shipment this week, guess what happened, they called & said they are waiting for a logo approval from our side. That is a big lie! Not a reliable company to work with!", "rating": 1}, {"title": "Very disappointed with Queensboro customer service and product.", "text": "As a long time customer and one that has always referred colleagues to Queensboro. I was very surprised when advising chat about a quality issue with a couple polo's. The chat person requested pictures and advised it looked like a quality issue within Queensbury and they would be happy to replace. After spending 20 minutes discussing this issue, I then was told Queensboro would not replace them because they were ordered past the return window ago, even through I never wore them and was told it was a Queensboro issue. The old Queensboro would always follow \"the golden rule of the customer is always right\".Unfortunately it is Time to look elsewhere for a customer friendly logo company. Really shocked about this happening,", "rating": 1}, {"title": "Took a month to tell me shirts I ordered were not in stock.", "text": "Queensboro took my online order, took forever to generate a usable logo that I had already designed and used on other embroidery (I'm a graphic designer), and then called weeks later to tell me the shirts were not in stock, nor would they be for 2 months.  They didn't hesitate to charge me for the order though.  So, shirts we needed ASAP never materialized, and it was too late to order them from another more competent embroidery company.  I would NEVER order from Queensboro again.", "rating": 1}, {"title": "This company does what it wants", "text": "This company does what it wants. The will change your logo withour permission. Then they send you a proof with the logo canged and never tell you. Then the only way to coomuicate is by email, chat or schedule a call back. I decided to sechedule a call back and advised them that my logo was in correct and ear marked for embroidered on the sleeve not the chest. At that time i was told they would correct the placement, size and logo as ordered. Today I get another proof same as the first but in the correct location on the left chest.Now I am informed that can not recreate the logo as ordered. Terrible TERRIBLE communication.Needless to say I canceled the order. What good is a great price if your not getting what you want. Now let see how fast I get my credit.Too bad I was optimistic about his company. I order 30 doxen at a time.", "rating": 1}, {"title": "Horrible customer support", "text": "Horrible customer support! Not only does it take them 4 weeks for an order to ship, but they don't even get the order right. Missing Logos, missing sleeve prints, wrong sizes, and at times the wrong order all together!Caution Do not use them!!", "rating": 1}, {"title": "This is the worst company ever- Deceiving Advertisment", "text": "This is the worst company ever. Please do not fall for their deceiving advertisement or quick production and shipping.  Even when a product in their inventory indicates \"available\" they will not ship your order on time.  I placed an order on January 28th, 2022 and choose items \"in stock\" per their website.  During the wait, I never got ONE email updating me of my order status, website still shows estimate shipping date of Febraury 11.  It took for me to contact them twice to learn they had delays and could not fill the order.  I ask for a refund, and decided to cancel the order.  They were willing to do that (which is good) but do not care if I had to wait all this time for nothing.  Or even if this is going to cause me to loose sales in my business.", "rating": 1}, {"title": "Nice bait and switch", "text": "Nice bait and switch.  They lure you with a cheap intro product and then hit you with a big minimum purchase to get it.  Thanks, but I'll go back to Vistaprint.  At least they are honest about what they do.", "rating": 1}, {"title": "Poor Customer Service", "text": "After reading Queensboro's reply they simple refuse to acknowledge why they could not simply answer a customer's request for a specific delivery date and instead blame their lack of customer service on Corvid-19 and Hurricane Isaias. After three attempts to get a specific answer from customer service on when my order would ship and asking for a yes it will be shipped on the date specified or no it will not ship on the date specified.....I received \"most likely\", \"we will try our best\", \"we will try to expedite your order\".....Not exactly the yes or no I specifically asked for.....  Decided to get a full refund and give my business to some other company with better customer service.Terrible shopping experience.", "rating": 1}, {"title": "The Worst Customer Service I ever!!!!", "text": "The Worst Customer Service I ever!!!!I placed a order on 12/15/2020 and approved the art work on the 12/15/2020 early in the morning. The order just stayed with no progress. I contacted them on multiple occasions and no reply or answers to the order. Finally on the 5th I finally got someone who couldn't find anything with my order so they canceled the order and refunded my money. The next day said they got the order down and will be sending it to me free of charge....however that was a lie they sent a box to my address to give me a ups address HOWEVER they changed the address back to the factory so I was lied to again! yes I got my money back BUT I wasted almost a month trying to get a product I need which now I don't have and have to start over looking to for a real business to deal with!", "rating": 1}, {"title": "Company was unable to embroider my…", "text": "Company was unable to embroider my companies logo. Didn't find out until a week later where they sent me a sample that was very bad and would have been embarrassing to wear.", "rating": 1}, {"title": "USPO Failed miserably!!", "text": "Post office left package on front porch in pouring rain. Did not ring bell or knock. Shirts I ordered, although perfect, were soaking wet inside the saturated cardboard box!", "rating": 1}, {"title": "Lost order", "text": "Lost order, over 70 days to receive two shirts, received an email asking if the order was perfect prior to items arriving.  Last order I will make.James Grace", "rating": 1}, {"title": "Queensboro really dropped the ball", "text": "Queensboro really dropped the ball. I’m am disappointed with their complete lack of follow-through and service. Having been a long-time customer, I would have expected much better service. We had a critical event we needed our hats made for and they completely left us hanging. We made our order over a month ago and I explained how critical it was to receive our order by mid October. I then get an email saying my order should have been received. However there was never any tracking information provided, their team claims that ups lost the package (after we had to call several times to find out what’s going on), and they aren't willing to do what it takes to get us hats in time for our November event. At this point I’m not even certain they even made our hats to begin with. Since the best they could offer is a 3-10 day refund we had no choice but to take that option.", "rating": 1}, {"title": "terrible service", "text": "terrible serviceI month and no received nothingI try to contact to customer service and only say apologize  for delayomghard time whit this company", "rating": 1}, {"title": "I have follow their instructions at the…", "text": "I have follow their instructions at the bottom of their emails many times to unsubscribe from receiving emails, yet they continue to send me spam.", "rating": 1}, {"title": "Couldn't be more disappointed", "text": "Couldn't be more disappointed.   I ordered a couple of dozen shirts after seeing their ad on one of the social media platforms.  A few weeks later they called and then emailed me a proof of the logo I uploaded when I placed the order!  That is something you do within 24 to 48 hours from the time you receive an order.  I had expected the order to be here by now, only to find out that they are just getting to it.  I guess if business is good and you are not busy you don't need my business.  But if you need the business that you are spending money advertising to get the business  and you are understaffed, you have a different kind of problem.  Having the email address missing a letter, whether you typed .om or I typed it instead of .com should not cause this much delay.  Glad I did not take the chance with your company.  I went ahead and cancelled and just waiting on a refund now.", "rating": 1}, {"title": "Too slow", "text": "This last order was my last with Queensboro. The order was needed for a tradeshow and wasn't delivered until 4 days after the event.", "rating": 1}, {"title": "My name is Patrick,I have aspergus…", "text": "My name is Patrick,I have aspergus autism syndrome.and dieing slowly.i love shopping and seeing my dad.ireallyvlike wish.", "rating": 1}, {"title": "Bad experience", "text": "The company is falling  apart. It used to be really professional, but now its all over the place.  Wrong orders, low inventory, damage invemtory.", "rating": 1}, {"title": "Horrible company", "text": "Horrible company. Horrible service. Slowest production team. DON'T WASTE YOUR TIME HERE!", "rating": 1}, {"title": "It is very beatuful", "text": "Date of experience: April 30, 2023", "rating": 1}, {"title": "I didn’t receive my trial mask", "text": "I didn’t receive my trial mask. We looking to purchase mask but was looking to get a sample to present to the company.", "rating": 1}, {"title": "Customer Service", "text": "I had a slight problem with a product and it was corrected very quickly. Thanks for the great service and products!!!", "rating": 1}, {"title": "Queensboro is the best", "text": "Queensboro is the best. Perfect customer service, unlike some other \"logo\" companies.", "rating": 1}, {"title": "Not reliable service", "text": "It has been over a month now; I still have not received my orders, not even tracking numbers.", "rating": 1}, {"title": "Thank you for a wonderful product", "text": "Thank you for a wonderful product. The logo looks great. Once again thanks!!!", "rating": 1}, {"title": "Initial order over a year ago want not…", "text": "Initial order over a year ago want not bad. Quality of polos was not what we expected but for the price, we got what we paid for.  Every order after that the quality and products were getting worse and worse.  Placed order for Christmas, somehow order was \"shipped to wrong customer\" but they had no idea who it was. Customer who received it was honest enough to call Queensboro and we received the order  and this one was good.  Placed a few more orders but the last two were not acceptable.  Our logo is usually 4\" tall, products received were 2\" tall.  Queensboro claimed it was the logo file that was sent and we approved it.  Well not sure how to tell what size the logo is on the computer if they do not disclose it.  In the end Queensboro \"terminated our business with them, on their end\"  and it was not the owner or a management person who decided it, it was the \"head person in charge of ????\"  So this person makes decisions for the company.  Asked multiple times for \"Fred, the owner\" to contact me and was always told that \"Fred doesnt make calls to anyone\" ..... really?  Fred doesnt care about customers that are not satisfied ?  Interesting concept.  All this after Queensboro agreed to remake the last order with the correct size of logo AND we already had another order going into production and that was cancelled also.  Our money was refunded in full but just proves they dont deliver on their words to make things right.", "rating": 1}, {"title": "I placed an order with Queensboro on…", "text": "I placed an order with Queensboro on April 26 for items we needed for our May 15th Grand Opening. There were many parts to the order: masks, pens, bags, embordered shirts, printed shirts, cups etc. For the most part our orders trickled in. It started getting close to the Grnd Opening date and I chatted in on line and expressed concern that our order would not be complete. They told me they would press-hard and get it done - in the nick of time I was told the order was done! And would be overnited to me! God Bless Them. The wheels fell off of Queensboro when a label was generated but no tracking information. I called and UPS claimed they never recieved the package. Where did i hear this before (eBay Sellers), I called Queensboro and they said they put it on the UPS truck themselves, which to me is hard to believe because you can't put anything on a UPS truck without it being scanned. Today I stand with \"NO Bags or Shirts for my Grand Opening and Queensboro saying how great they were to complete the order and UPS saying they never recieved the Over Night Box. Worse is no one can find it. I am sure it will turn up next week when Queensboro actually finishes the order in their own good time and sends it out regular mail.So if you have Six months to wait for an order then go ahead and do business with Queensboro. But dont expect a rush and if they do, and dont plan anything important like a party, corporate event, wedding or anything else around Queensboro.Hopefully the wheels won't fall off with your order as they did with mine. Way to go Queensboro.", "rating": 1}, {"title": "Ordered 2 shirts. Never Received the product or shipping information.", "text": "Ordered 2 shirts. Never received shipment advice nor the product.", "rating": 1}, {"title": "I TRY MY EMAIL Address  it was correct…", "text": "I TRY MY EMAIL Address  it was correct but i didn work", "rating": 1}, {"title": "Outstanding products, absolutely worst online order interface I have ever encountered!", "text": "I absolutely love your finished product.  It is the ONLY reason I continue to do business with your company.  My most recent encounter.  You sent me an email with $45.00 off with $90.00 order.  I ordered 2 Callaway golf shirts which were over the $90.00 requirement, BUT I needed to order 4 items to not get the minimum order charge of $20.00 extra.  I ordered 2 hats to match the shirts with the same IDENTICAL logo for all items.  Somehow, although the logo's were identical, they had different numbers (exactly 1 number difference) so I did still did not meet the minimum order requirement because I was ordering two different logo numbers (which were the identical logo).  I could have ordered 2 more hats (which I did not need or want) but it was going to cost me the extra $20.00 either way.  Guess what, I just deleted the entire order.  This is not the first time I have taken my time creating an order just to cancel it due to frustrations with your site.  I have a BIG man who is a member of my BBQ team, size 6 XL.  I challenge whoever created your order sheet to order a 6 XL.  When you get to the BIG (over 4XL) order sheet, you cannot display past 3 XL when trying to order.  \rFor some reason, when you go to put a quantity in the box, the boxes shift to the right losing ALL the boxes past 3 XL.   IF you are tremendously quick, very occasionally, I am able to insert the order quantity before the boxes disappear, but frankly it isn't worth the effort.\rTo say your website is unusable for my requirement would be accurate, but not nearly indicate the level of frustration it creates for me.", "rating": 1}, {"title": "Bad customer services", "text": "Bad customer services ", "rating": 1}, {"title": "Ramvliash kumar", "text": "Tgggggggfyyhhh55666", "rating": 1}, {"title": "SUPER :-)", "text": "As usual, my items arrived on time and in budget!", "rating": 1}, {"title": "Everything was Great Very Happy with My…", "text": "Everything was Great Very Happy with My Experian!", "rating": 1}, {"title": "Received timely and exactly what we…", "text": "Received timely and exactly what we ordered", "rating": 1}, {"title": "Consistently Bad", "text": "I decided to place an order for a single item to check product and workmanship quality.  I was also curious about the level of customer service offered.  I had received an offer to make my first order with \"no minimum purchase required\".  I quickly found out that there was actually a minimum.  After several days and several emails to several different email addresses I received a code to bypass the minimum.  I made my order.  When I received the email to approve the workmanship it was, to be blunt, shoddy.  The edges were far from crisp and the lettering varied in size and alignment.  I rejected the proof.  That was one week ago and I have had no correspondence since.  I tried today to use the \"CHAT\" option on my account page and got an automated response which did not even address the issue I had.  Workmanship......1 of 10Providing service as advertised ..... 5 of 10Customer service.....0 of 10At least I am only out the cost of the one item.  This is the reason I made such a small order to begin with.  Now I am left with a situation where I have not received the refund I requested and can not even get anyone at the company to respond to my queries.  It is my recommendation that you refrain from attempting to do business with this company.  My experience has been consistently bad.I received a response almost immediately by posting a negative review.  perhaps if they were as interested in direct communication with the customer as they are in protecting their reputation I might have received satisfactory customer service in the first place.  I will update this review with an examination of the final product quality upon delivery.  After some discussion with Queensboro customer service I let them complete and ship the one Item I had ordered as a test.  When it arrived there was a 1/8 inch difference in the distance over the pocket from one end of the logo to the other.  That is 1/8 inch in 4 inches.  a 6.25% slope.  This on an order that was already problematic and which one would suppose they were wanting to nail.  I will not be purchasing any more product from this company.", "rating": 1}, {"title": "RISKY BUSINESS WITH QUEENSBORO", "text": "READ THIS VERY CAREFULLY.  It's very risky to order from Queensboro and you could easily get into a HUGE mess with your business plans by investing your trust in this company. In short, they failed to deliver, sold something that is out of stock, and refused to do the right thing.  Here's the important details:\r First, the order didn't arrive on time because apparently the company was out of stock on ONE PARTICULAR item in the order, which could have been fine and a fixable situation if I knew about the problem in a reasonable time, however, nobody called me to tell me that the order wasn't being delivered.  I had several different items ordered, and they held the entire order back because of their own internal stocking issue, which is strange because their website tells whether something is in stock or not BEFORE you can purchase it, because it's an inventory software, so really I don't know if that \"out of stock\" excuse was legit anyway...\r So, it's a week past the worse case delivery date I was given, and I have a promotion schedule for the upcoming week and naturally I need my promo gear that I ordered 3 weeks ago, so i call them.  They tell me this reason for non-delivery (one item out of stock) and after I tell them my situation, they still won't rush out the rest of my order to me so I can have all the other items.  Instead, they ask ME what they want ME to do about it, as if I'M running their business and customer service department.\r I ask them to ship the rest asap.  They say No, it will all be shipped to you on July 6th (which would be 34 days from the day I ordered it all, which is also 20 days past their promised shipping date, AND which is over a week past MY SCHEDULED PROMO event that requires uniform (logo'd) gear to work it).\r UNBELIEVABLE, right?  Well believe it, because it gets worse.  \r So, I email the founder, Fred Meyers.  He gets all the emails on his cell phone.  Yeah, how do i know that?  His staff told me.  The same staff that basically told me \"tough cookies\" on my entire order.  So, I know Fred got my email(s).  Fred doesn't respond to me though, he has his assistant EMAIL ME telling me that they are refunding my money but they still won't ship me my other items i need, and they ask me to give them a chance to make up for it better in the future!  Ha, seriously?  In the future?  They could make up for it right now! \r I end up having to miss the entire weeks scheduled promo because I don't have the logo'd clothing, and i look like a total unprofessional flake to the venues and staff.  Because I actually care about people and my reputation (unlike Fred Meyers and Queensboro obviously), I will end up paying staff for their troubles of missed day, and I'll have to order a lot more swag to give away and make it a big blowout event so I redeem my reputation as someone who delivers like they say they will.  This will cost me a lot of money to make up for Queensboro's neglectful business standards by not letting me know that they decided to hold hostage my entire order because one piece need to be restocked, which shouldn't even have that problem since they have inventory control in their software!!!   \r So when I get the email from the assistant telling me they are refunding my money, I tell them that the money is not the issue!  The huge nightmare that their neglectful business practice has caused me is the problem.  And I ask them to help me redeem my situation as it has caused a huge snowball nightmare for multiple people and left me in a bad reputation situation.  And what answer did I get from this request to do what's right??  I GET TOTALLY IGNORED.  \r I emailed the assistant twice and I even emailed Fred Meyers directly again.  NO RESPONSE.  But the very next two days in a row I get emails from Fred promoting sales he is having.  \r You can imagine the frustration here.   Save yourself the hassle.  There's not a dollar amount you could pay me to go through that again.  My reputation is crushed and Queensboro deserves to pay restitution on that.  Which sounds like a good next step actually.", "rating": 1}]