[{"title": "Unfortunately", "text": "Unfortunately, I cannot wear the pants, they are too tight on my calves, I wear compression socks and they show the imprint of the sock on my legs. I was not thinking and on one of the two pair I ordered, I took the tag off before trying on, now I cannot return the item. They literally were on just long enough to try on and find the issue. ", "rating": 1}, {"title": "Horrible return policy", "text": "Horrible return policy.  You request a return and instead of just being able to just return items that do not fit, or you do not like, you have to take a picture of each item, submit a request and wait for a response on if your return request is approved.  If you value your time and money do not buy from this site.  Online purchasing is supposed to be easy not a hassle.  Also I am not one to usually complain or submit a bad review, so this says a lot.  Will not buy from this company again simply because of the return policy.  ", "rating": 1}, {"title": "Mediums are not mediums", "text": "I normally wear a medium and the shirt I ordered in medium was huge and the leggings I ordered in medium are extremely small. In order to return items you need to submit pictures of their items which is a pain. I would not order from this company again just due to the hassle of returning items. ", "rating": 1}, {"title": "Poor customer service", "text": "I returned an item and got store credit.  With the credit i bought a new item and needed to pay over the credit amount.  When it arrived it was not a good fit - the item did not match the size or description online.  I tried to initiate another return and was only offered store credit again, which would not be enough to cover the cost of a new item and shipping.  After explaining the situation multiple times and how a full refund to my original payment method would be better for me to ensure I come back to the site in the future, I still received the same copy/paste message from support.  I will not be ordering with Halara again.", "rating": 1}, {"title": "Cst svc issue ", "text": "The shopping was great. The customer service was awful after the fact. It wasn’t even policy etc. it was the simple fact that the agent was acting as if I was be an inconvenience to him asking my questions. Then he was very unprofessional and condescending. ", "rating": 1}, {"title": "This item was not as described the…", "text": "This item was not as described the fabric was subpar the tummy control wasn’t great. Got fooled by influencers. And then the package took forever to arrive and had a china sticker under the second sticker so I know it just came from a site like Temu or something. I will be sending back. ", "rating": 1}, {"title": "BUYER BEWARE!", "text": "BUYER BEWARE!! I bought two pairs of pants that were too small in the waist so I wanted to return them. The company did not get back to me in a timely matter. It's now been three days since I initiated the return and they still haven't processed a return label. I was going to order in exchange for a larger size and now I just want my money back!!", "rating": 1}, {"title": "No Way!!!!", "text": "The jeans I ordered stated in the advertizement  that the inseam in a regular was 28 inches. When I took them out of the bag my words were \" No way\". I measured the inseam and it is 30 inches!!! Does not look good with the extra material dragging behind me!!!", "rating": 1}, {"title": "First off the smell from the pants was…", "text": "First off the smell from the pants was absolutely horrific!  They also didn’t fit and since it said all sales final I am now stuck with pants that don’t fit and even after two washes, they still smell awful. ", "rating": 1}, {"title": "The clothing is great but the delivery…", "text": "The clothing is great but the delivery estimate was 10 days and it took a month! Didn’t arrive by the date I had an event planned to wear the clothes. The free gifts are completely cheap rubbish and it would be better to protect the planet not to produce or send them. ", "rating": 1}, {"title": "I am not happy with the quality and I…", "text": "I am not happy with the quality and I checked the site prior to buying these leggings and they said I had 30 days to return. Now they want photos and in depth explanations as to why I want to return them. 30 day returns is 30 day returns. If they don’t give me back my money I’m contacting the bank. ", "rating": 1}, {"title": "The quality and craftsmanship are poor", "text": "The quality and craftsmanship are poor. I ordered TALL. I'm 5' 8\" and these don't even cover my ankles! I want to return them. After I received them and went to the website, I see that they are not returnable because somehow, this purchase was a \"final sale\". I feel I've been taken advantage of. I don't want to be forced to purchase items I can't use. ", "rating": 1}, {"title": "I have been trying to return items that…", "text": "I have been trying to return items that don’t fit since October 29th. I would never order again as a result of costumer service and the inability to return an item that doesn’t fit. After sending the requested information (transaction #, reasons, product #, name and address) I’ve yet to receive a shipping address to return. I think having to take pictures, and pay for the return is also unacceptable. I would never shop online with Halara again nor recommend to a friend. ", "rating": 1}, {"title": "Nothing fit me and I’m trying to return…", "text": "Nothing fit me and I’m trying to return and  purchase in another size. They want me to download photos of items. I am unable to do that. I’ve been emailing support but not receiving help. ", "rating": 1}, {"title": "I want a refund but there seems to be…", "text": "I want a refund but there seems to be no way I can get the process started. I’ve followed instructions but haven’t received any single email so that I can proceed.", "rating": 1}, {"title": "The reversal is unnecessarily…", "text": "The reversal is unnecessarily complicated. Without a photo and reason, a reversal is not possible. According to several critics, the money will not be refunded, so only the gift card option remains. So I got clothes that I don't want. Everything takes time and is anything but user-friendly. ", "rating": 1}, {"title": "These jeans smell like chemicals", "text": "These jeans smell like chemicals.  I have them hanging outside to see if they air out, if not they should be disposed of in a hazardous waste landfill.", "rating": 1}, {"title": "Return process is complex", "text": "Return process is way too complex with specific criteria for returning. I had to submit a ticket wait for approval to return items. Then received a long email with options.   The optional ups qr code did not work. Now trying the usps next. I hope it works! ", "rating": 1}, {"title": "They are too short and I’m not tall", "text": "They are too short and I’m not tall. Material is not too comfortable as I’ve purchased other’s from a different site and they are much better! Beware as you can’t get a return refund without paying more and jumping through hoops! They will give you a gift card but it’s for their company! Not happy at all!!!", "rating": 1}, {"title": "Would NOT purchase from again!", "text": "Halara doesnt purchase shipping insurance so if your package comes up missing, the USPS will not reimburse you. I never received my items, and the USPS mistakenly scanned them as delivered (it was a substitute carrier and during the investigation they said they left the package in the cluster box but they cannot leave packages in those boxes because they do not have the keys for them) and neither Halara or the USPS will reimburse me because Halara didnt purchase shipping insurance so the USPS says there is nothing they can do. $96 package gone. I wouldnt of purchased through them if I had known they do not use insurance.", "rating": 1}, {"title": "Not impressed with this company nor their products", "text": "Not impressed with the wait time for delivery and the return process just is a hassle with so many steps.  One of the products feels like it was completely misrepresented too--I thought I was getting a nice comfy cozy sweatshirt kind of shirt and it's more like a slinky fabric undershirt.", "rating": 1}, {"title": "Horrible return policy and process ", "text": "The fact that I had to take pictures of everything I wanted to return is ridiculous….thanks for making me try things on again that didn’t fit or look great on me, not a fun experience. And I have to pay for shipping for returns….another big red flag for me. I was so excited for my purchases, and now am so disappointed with this experience. Will never shop here again, and will advise all friends and family not too either. ", "rating": 1}, {"title": "Bad return or exchange policy ", "text": "The cut and colours are not same as pictured but most importantly is your customer service that push ppl to keep whatever they bought by bad rules of exchange or return. I kept mine but im sure i would never come back to you and tell anyone ask me ", "rating": 1}, {"title": "I ordered 3 pairs of the cargo leggings…", "text": "I ordered 3 pairs of the cargo leggings and am very disappointed with the quality. The stitching on the pockets on the legs and butt are all coming off. They’re also not the same fabric as the first two pairs I ordered previously and doesn't feel as buttery or as thick. This order makes me not want to order from Halara or recommend to friends anymore. ", "rating": 1}, {"title": "I ordered a pair of leggings but what I received didn't have any Halara tags", "text": "I ordered a pair of leggings but the leggings that I received did not have any tags on them. They did not have any tags sewn on the inside or attached to the leggings. They didn't have anything on them to show they were Halara so I don't believe what I received was Halara. They were packaged in a bag that said Halara but that was it.", "rating": 1}, {"title": "First off shipping took long and second…", "text": "First off shipping took long and second of all I hated that the leggings rolled down from the waist and just for reference I’m a size 4 and a small in stretchy clothes and I have a flat belly so there was no reason for that issue ", "rating": 1}, {"title": "I never got my order", "text": "I never got my order. I’ve ordered numerous amount of times in the past and never had an issue. They showed my package and where my order was sent to but it was the wrong address despite my correct address being written on the order form. I sent them pictures and even went to the incorrect address to get my order. I wish I could speak to someone but there’s only emails. I’m so disappointed I lost my money and all I wanted was my order. I will never order from them again. ", "rating": 1}, {"title": "Impossible to return", "text": "Impossible to return. They do not provide a shipping address or a shipping method for returns. Costumer suport simply said that I need to figure it out on my own. Fit of clothes is weird. Even though I ordered petite pants the inseam is way too long to fit on a shorter person.", "rating": 1}, {"title": "It said delivered but I never received…", "text": "It said delivered but I never received my package. If your company could contact me I’d appreciate it. 386-585-0148", "rating": 1}, {"title": "The wrong items were sent", "text": "The wrong items were sent. It's not what I ordered. Pretty standard for cheap shit sent from overseas. No way to contact or rectify reliably. Fighting it with my credit card. I'll never order again.", "rating": 1}, {"title": "The pants were nothing like they were…", "text": "The pants were nothing like they were supposed to be, but you guys don’t allow returns and refund so now I’m stuck with them so it was just a waste of money. I will never order from you guys again.", "rating": 1}, {"title": "Beware of fake reviews", "text": "Beware of fake reviews. Ordered 6th October and still not arrived 2nd November! Tracking not provided, some nonsense about pre order and every day when I check, date that parcel has gone through customs keeps changing to the current day!", "rating": 1}, {"title": "Refused 2nd pair on BOGOF deal", "text": "Halara advertised a buy one get one free offer on their leggings.  As a regular buyer of leggings I had seen the adverts several times and was excited to be buying my first pair.  A week later only one pair arrived.  I messaged Halara and they explained that to receive their BOGOF offer then 2 pairs needed to be added to the basket.  I saw on their reviews this had happened multiple times to other customers.  Whilst this wasn't clear on their website I would have been happy if they then sent out the second pair and apologised.  But no, three messages later (via email and then facebook) and they're still refusing to send out a second pair.  Terrible customer service and now making me quite angry.  Something that could have been easily rectified but felt like they were trying it on, especially seeing this has happened to multiple customers.  ", "rating": 1}, {"title": "Strong chemical odour", "text": "The jeans themselves are great. But they smell so badly like mothballs / chemicals that it is impossible to wear them. Really disappointing.", "rating": 1}, {"title": "This is an awful company", "text": "This is an awful company. DO NOT WASTE YOUR MONEY, THESE PEOPLE ARE SCAMMERS! I placed an order at 2:01 pm. It said on my email that it takes 8-10 business days to ship. After reading the awful reviews stating how cheap and bad the clothing material is, I sent an email at 2:26pm... So literally 25 minutes later stating that I wanted to cancel my order and be refunded. They purposely shipped my order out THE NEXT MORNING (even though the confirmation email said that the items would take 8-10 business days to ship) and then sent an email DIRECTLY AFTER THE SHIPPING NOTIFICATION that they had already shipped my order and it was too late to be refunded. I HAVE NEVER BEEN SCAMMED MORE IN MY LIFE. NEVER SPEND MONEY WITH THIS COMPANY. THEY HAVE NO INTEGRITY AND ARE SNAKES. I DONT WANT THE AWFUL CLOTHING THATS WHY I CANCELED 25 MINUTES AFTER MAKING THE ORDER AND YOU DARE TELL ME ITS TOO LATE FOR A REFUND. DOOO NOOOT BUUY FRROOOM HHEEERREEE.", "rating": 1}, {"title": " Weird fit", "text": "The sizes may be about right, but the git just doesn’t work - I’ve never met a person with a back long enough for these trousers. Me (169cm) and my daughter (173cm)  oth tried these on, and the waistline of all 5 different pants went 6-10 cm above waistline, and the bra band 10cm below the normal place. Returning every single thing.And it would also be nice to be able to opt out the gifts - the planet needs no more crap.", "rating": 1}, {"title": "Very difficult to do returns", "text": "Very difficult to do returns.  This is the second time this has happened to me.  You need to email Halara, then they send you a link to a return form and label.  Neither one would download, finally the label did.  All being done thru email.  Very frustrating.  I like their clothes but dread a return.  ", "rating": 1}, {"title": "Size guide provided is inaccurate. ", "text": "I ordered the jeans using my measurements with the size guide provided online. They are a full size too big around the waist and down past my feet. Went to look up the return policy online and all sales are final. Buyer beware. ", "rating": 1}, {"title": "Random and incorrect sizes.", "text": "I ordered 4 pairs of trousers in the same size.The products were ok, but 2 of them are massively smaller than the others and quite clearly not true to size by some distance.Now I am in a battle to try and send them back which is becoming very stressful.I really wish I had not wasted my money and so will try and claim through PayPal.I would say unless you know your exact size I wouldn't touch these,  but them again, the sizing varies so much that you are not guaranteed to get the correctly sized items anyway!!!", "rating": 1}, {"title": "It took so long to arrive and they…", "text": "It took so long to arrive and they would not give me a refund. I am returning them because the material is not as described. ", "rating": 1}, {"title": "Your company refused to accept a return…", "text": "Your company refused to accept a return that still had the tags on and I didn't even try on because I knew it was too big. That is so ridiculous. I will never buy from your company", "rating": 1}, {"title": "Poor quality ", "text": "Stitching on front faux zipper seam was noticeably off. Sizing is very erratic. My first order was too big. Pant bottoms are much wider than they appear on model. Would love to exchange or return but did not have the option. ", "rating": 1}, {"title": "Return form does not work!  Hoping this is not a scam!!", "text": "The style of the dress was weird on me.  I tried to return it and on the return form, the \"confirm\" button did not work.  I uploaded photos and filled out the form 5 times!  If customer service winds up helping me, I will gladly erase this review, but for now, I am very displeased with this process.", "rating": 1}, {"title": "Terrible customer service and Return Policy", "text": "I have placed an order for a pair of trousers with this company. As soon as I payed, I realised that I have ordered a wrong fit. I immediately emailed the contact address as well as messaged live chat to request amended to my order and change the fit type. Within 2 hours, I received numerous emails from the company from different people with different information. One of the emails however has suggested that amendment has been made. Upon arrival, I received an initially ordered incorrect fit type and was extremely disappointed. I cannot understand how in such short period of time they did not managed to amend my order, even though they said they did. I contacted customer service again to notify that I received not amended order and was told that they weren’t unable to amend it (?). Even though they said they will as soon as I emailed them first time. Now, to receive a correct fit I need to return these trousers, however, buyer pays for postage. This postage will cost me almost as much as trousers did. Trousers are actually nice quality on feel but customer service and return policy is terrible. Won’t buy again. ", "rating": 1}, {"title": "Never received package, even said it’s been delivered ", "text": "Received email package was delivered I was home and no one came. Checked tracking number, package was delivered somewhere else. No idea where as no on the photo door number and whoever ( looks like man ) holding my package I can’t recognise ( no face on the photo). Checked all neighbourhood doors that like that and no one received anything. ", "rating": 1}, {"title": "These are the worst leggings I’ve ever…", "text": "These are the worst leggings I’ve ever tried. I am a very small person (23 inch waist) and purchased a size small. They were so difficult to put on and extremely uncomfortable. Not flattering at all, and I am a very fit person. Made me look fat and I am a 00. I purchased 3 pairs, super disappointed. ", "rating": 1}, {"title": "Not all they’re cracked up to be ", "text": "The jeans felt good initially when I put them on, but as I wore them throughout the day they stretched out a ton and continued to fall down at the waist, leaving me constantly pulling them up. The waistband also rolls down onto itself when I sit. Wanted to love them but will not wear these pants ever again. ", "rating": 1}, {"title": "The material is cheap", "text": "The material is cheap, thin and uncomfortable. Not nearly worth the money. Also the \"flare\" is almost a boot cut straight leg. Would not buy from this company again.", "rating": 1}, {"title": "No customer service ", "text": "I received pants that did not have the stretch shown in the advertisement. They did not fit properly and were uncomfortable. I submitted a return request and never heard anything back. Unfortunately, I won’t be purchasing from Halara again. ", "rating": 1}, {"title": "I hate the clothes and the return…", "text": "I hate the clothes and the return process is not fluid or easy. It’s 2024, returning packages can be very easy but not with Halara ", "rating": 1}, {"title": "What I ordered was massively oversized…", "text": "What I ordered was massively oversized and so far your process for returns is making it impossible to return the items for refund. It feels like a scam  I've been asked to go through pages of questions as to what is wrong but provided with no returns address", "rating": 1}, {"title": "Unethical practices - impossible returns.", "text": "Their return system is designed to be difficult if you want a refund. Terrible customer service journey.Unsubscribing to their mailing list is also damn near impossible. Avoid this sweat shop using company.", "rating": 1}, {"title": "Ordering easy", "text": "Ordering easy. Fit guide in accurate. Sizing way off. Will not bother returning as your return policy is far to complicated and cost me almost as much as the item. ", "rating": 1}, {"title": "I never received the order", "text": "I never received the order. It was shipped to the wrong address . I contacted the company few times and they said they will contact the carrier but I have heard nothing back in three days. I would like my money back since the carrier made a mistake and dropped the order at the wrong address ", "rating": 1}, {"title": "false advertising. Non-elastic fabrict I bought", "text": "The pants that I bought, and that they advertise as elastic fabric, are not at all what they say on their website or in the advertisements. I am very dissatisfied", "rating": 1}, {"title": "Ordered some halara flex for my…", "text": "Ordered some halara flex for my girls,using paypal. Delivery not received ka jembreN traced payment and it was a fake account I was given. You guys should monitor payment.  This is not my first time, just shocked payment was diverted.", "rating": 1}, {"title": "The leggings that I received is not…", "text": "The leggings that I received is not what I expected ,the leggings are deceiving and very cheap material ...very very disappointed...I will never order again ,unless I get the leggings I expected and better quality ...so so so disappointed 😞 ", "rating": 1}, {"title": "Impossible to Unsubscribe", "text": "Hi. I signed up to receive updates and have been PESTERED 4-6 times per day. Simple fix would be to unsubscribe-right? I have unsuccessfully \"unsubscribed\" 6 times in the last 13 days. Sent in the live chat to unsubscribe plus emailed in customer service. I had to assign their emails as JUNK but should not have had to through this trouble. DO  NOT sign up to their mailing list unless you wish to receive multiple emails daily and no ability to simply unsubcribe. So sorry that I ever did for this company.", "rating": 1}, {"title": "I need to make a size change", "text": "I need to make a size change, a return and I need the labol to make the change and they don't help me and there is no one in Spanish", "rating": 1}, {"title": "DON’T SHOP HERE!!", "text": "The jeans stained my dryer and kept bleeding color. They also had a very strong chemical smell. The other pans didn’t fit right and the return policy is TERRIBLE. I also got a shady email requesting to pay for tax. ", "rating": 1}, {"title": "I was not informed that on sale items…", "text": "I was not informed that on sale items are “final sale” aka non-returnable. As an online store this seems kind of ridiculous, as I cannot try the clothes on. My order arrived and none of it fit, and I cannot return them.", "rating": 1}, {"title": "U sent me 2 pair of jeans 5 min apart", "text": "U sent me 2 pair of jeans 5 min apart. I did not order 2 pair. And they were size l I always by med. they won’t even stay up if they’re zipped they fall right down.There were $61. A piece! And u expect me to pay $80.!!! To send them back! I have spent thousands of $s over the last year buying through u.%1 time 2 shirts didn’t fit and they wanted $120.! To ship back. So just had to donate them.I will not spend more$ shipping back than what there worth.No other company I’ve spent this much $ has ever expected me to do that.I’ve always given great reviews even to people afraid to buy because of length I assured them if they were even an inch taller than me they fit.So I expect u to send me a shipping label. I’ve sent all the info n with pictures twice!If not I surely will never buy again@ u can see how much I buy.And will let people know the outcome@recommend Stylewe instead where they do take care of these problems because of the amount I order and the reviews I happily put up.Betty Hart", "rating": 1}, {"title": "The fit of the pants are awful", "text": "The fit of the pants are awful. I was so excited but thoroughly disappointed when I got them. For the seam not to fall to my knees they need to be up way past my waist, but the rear pockets are then sitting at the small of my back. ", "rating": 1}, {"title": "Lack of customer service on returns ", "text": "I’m giving you a poor review because I want to return three pairs that I have not worn because they’re too small and all I wanna do is get extra large. And everyone I’ve talked to just runs me around in a circle because I don’t have the order number because I clean up my emails every day, please give me a phone number or I could call and talk to someone about this or the reviews will stay in place as being poor thank you ", "rating": 1}, {"title": "The leggings have this HUDGE seam right…", "text": "The leggings have this HUDGE seam right in the middle of your butt that looks ABSOLUTELY RIDICULOUS! WOULD NOT RECOMMEND? Mine DO NOT even have the H symbol on the back????", "rating": 1}, {"title": "The clothes look beautiful in the pics…", "text": "The clothes look beautiful in the pics but the quality of the fabrics are so bad . Only 1 of the three kinda reach my expectations. The other two no happy ", "rating": 1}, {"title": "Misrepresentation...", "text": "I was charged $19.90 for shipping to have my order delivered within 3 to 5 days as this 2nd order was a birthday gift to my wife...I had already just spent $135.46 purchasing 3 items from you (1st order) and had now spent $175.02 purchasing 6 items from you (2nd order) ...but my 2nd order wasn't even shipped until 16 days AFTER I had placed the order...apparently one item placed this entire order on hold...had I been informed by you of the unavailability of that item I would have structured my purchase accordingly...and no one has apologized...you've responded with boiler plate replies intimating as though I am at fault here...how unfortunate for you...my wife is extremely satisfied with your products...all of them...as am I, but because of this misrepresentation and nonchalant attitude I've received from you in regard to this matter I am likely never to conduct business with your company again.Respectfully, Joseph David Brackett ", "rating": 1}, {"title": "Skirt did not fit and unable to return…", "text": "Skirt did not fit and unable to return the item.Waste of money and poor communication.Will not order form this company again,", "rating": 1}, {"title": "Returning items is a nightmare.After…", "text": "Returning items is a nightmare.After submitting a return on the website it said I would receive an email within 24 hours on how to ship.Now 3 days have passed and still nothing.", "rating": 1}, {"title": "A product smelled like a strong…", "text": "A product smelled like a strong chemical that would not wash out. Customer service failed to help me so I had to throw it away and then I needed to return another item but the app wouldn’t allow me to submit my request. I won’t order from here again.", "rating": 1}, {"title": "I didn't receive my order and Halara…", "text": "I didn't receive my order and Halara won't do anything about replacement They said basically it wasn't there problem after it ships.", "rating": 1}, {"title": "Your return process is TERRIBLE!!!", "text": "Your return process is TERRIBLE!!!!  I won’t ever shop with you again because of it.  There is no need for returns to be so drawn out.  ", "rating": 1}, {"title": "Ordered 3 pair of the same trousers", "text": "Ordered 3 pair of the same trousers. Same size just different colours. When they arrived they were all different lenghts and waistbands different sizes and different levels of stretch. ", "rating": 1}, {"title": "Inflexible system", "text": "Sadly I’m left unhappy with this company due to their inability to help. I ordered on their buy 1 get 1 free offer but thought I only needed to put 1 item in the basket to pay for. I was therefore only sent one item. Realising my mistake they accept the error, however they refuse to send me the missing item even if I pay postage,  and instead insist that in-order to get the missing item I must post back the item I already have (and pay postage to do this) and then pay postage to have the two items sent back together to me! As well as the unnecessary expense and a lot of saying how returns seem to get lost,  the carbon footprint involved in this is also unnecessary. A ridiculous way to deal with the situation that has only resulted in a bad review and a lost customer. I was unable to speak to anyone in management when I asked for this to be escalated in the hopes someone with some common sense might step in. Feels like this was deliberately made difficult in the hopes I won’t bother. ", "rating": 1}, {"title": "Poor refund policy- long process", "text": "I am trying to return a pair of pants with all tags attached and never worn, yet it has to go through a committee to generate an actual refund slip.  Still waiting...", "rating": 1}, {"title": "poor return experience", "text": "I tried to return a purchase.  The return shipping was expensive.  It has been lost in transit.  So Ive probably lost well over $150.", "rating": 1}, {"title": "You sent me crap nothing I ordered came…", "text": "You sent me crap nothing I ordered came I feel you violated me by taking my money and not sending me the items I ordered you have three days before I call my credit card for a 100 refund where do I return your crap ", "rating": 1}, {"title": "Return policy is complex and annoying", "text": "your return policy is AWFUL. The jeans I got were simply too long. I reordered the same ones but you have truly soured me from your brand with the refund process. I had to submit a photo (of what? they're just too long!) then had to wait for approval of the return and then it was very evasive when I wanted a refund and not a gift card. Now I see it will take up to 30 days to get the refund to my credit card. Shame on you for making it so hard to return.", "rating": 1}, {"title": "I never received my order i have yet to…", "text": "I never received my order i have yet to get confirmation of the replacement order and it’s going to be 1 month and 2 weeks. I tried contacting the customer service chat and they assured I would get an email of the replacement order due to them sending it to the wrong address and order that was 207 dollars ", "rating": 1}, {"title": "Not recommended", "text": "Bad fabric quality, slow shipping, and I had to pay $10 to return my order. Will not order again!", "rating": 1}, {"title": "Pants don’t resemble denim", "text": "The pants were described as looking like denim. They look like polyester and I can’t return them because they were on sale.", "rating": 1}, {"title": "Very thin material ", "text": "The material is very thin almost feels like swim material and the top band rolls down everytime I bend over or sit down.", "rating": 1}, {"title": "I never received my package after…", "text": "I never received my package after waiting 2 weeks. Customer service rep told me to contact USPS. USPS told me to contact Halara. I paid for a product that I never received.", "rating": 1}, {"title": "Company taking too long to process a…", "text": "Company taking too long to process a return. Once a customer requests a refund, a postage label should be sent to customer immediately, to get the product shipped back to the company. ", "rating": 1}, {"title": "Returning items is an absolute…", "text": "Returning items is an absolute nightmare. A complete rigmarole of a process that takes days and days - it's attritional, and I suspect deliberately so.", "rating": 1}, {"title": "Did not fit and the return process is…", "text": "Did not fit and the return process is ridiculous. Never buying again. ", "rating": 1}, {"title": "Poor Stiching", "text": "Very comfortable and great shape trousers, unfortunately after only a couple of days use the stitching is coming apart under the zip.", "rating": 1}, {"title": "Wrong items sent", "text": "Wrong items sent. Wrong size in items sent. Pretty sure I got someone else’s items.  Supposedly I’m getting the original items I ordered sent to me.  Once they actually arrive I’ll be able to share my experience.", "rating": 1}, {"title": "Delivery", "text": "Product quality, fit & comfort is awesome. Delivery timeline is my biggest concern. It takes forever to get my order. ", "rating": 1}, {"title": "Rude and unhelpful ", "text": "I found the customer service to be awful, I couldn't get a answer to my question and I felt the reply to be rude.", "rating": 1}, {"title": "Horrible Company", "text": "Horrible Company. Cancelled order 1 hour after placing it. They shipped it anyway. Told me I have to pay for returns. To top it all off I still have not received my refund.  Don't order from this company", "rating": 1}, {"title": "Broken Zipper, shipping took forever!", "text": "I ordered 2 pairs of pants. The order took forever to arrive, and when it did, the brown pair I had ordered had a malfunctioning zipper. I need these replaced! ", "rating": 1}, {"title": "Wrong order", "text": "I emailed right away to cancel an order, as I ordered twice. All I received was 2 pairs of pants, same colour. No refund given. Very unhappy with this issue. ", "rating": 1}, {"title": "Read the return policy carefully", "text": "Read the return policy carefully. This ain’t Amazon. It’s going to cost me $33 to return a $67 purchase. So basically I paid money for garbage. ", "rating": 1}, {"title": "Return policy not good because you have…", "text": "Return policy not good because you have to take a picture when you select reason for return. Have 2 pairs of pants that I can’t wear. Wasted my money. ", "rating": 1}, {"title": "do not buy", "text": "the quality of the items is horrible and looks nothing like the photos. immediate return, will never order again ", "rating": 1}, {"title": "I ordered 3 pairs of pants all the same…", "text": "I ordered 3 pairs of pants all the same size and none of them are the same size. I pair is too big, 1 pair fits and the other pair doesn’t fit at all. ", "rating": 1}, {"title": "The quality is not that great and it is…", "text": "The quality is not that great and it is a hassle to return as they ask you to pay for the shipping.", "rating": 1}, {"title": "Took ages for delivery", "text": "Took ages for delivery. Love the clothes but was gutted that I didn’t receive it in time for my holiday.", "rating": 1}, {"title": "Order never arrived ", "text": "Order never arrived . Got delivered to wrong address . Customer service has an attitude . DO NOT BUY", "rating": 1}, {"title": "Frustrated!", "text": "You have not solved my problems after several days.  I don’t get it.  Just let me send back my totally inferior product back.  So thin and cheap.  Just help me please.", "rating": 1}, {"title": "I was sent the wrong legging and the…", "text": "I was sent the wrong legging and the wait for customer service was outrageous ", "rating": 1}, {"title": "They have the worst customer service…", "text": "They have the worst customer service ever, and I had to wait a long time for my order to arrive also- when it finally came the products were not what I expected and most of all they did not fit correct they are too big and too long!!", "rating": 1}, {"title": "Great leggings service not so good", "text": "Great leggings. However bogof is a take on.  There's no option or it online or anything telling you how to do it. I emailed after i said ordered and basically got an email to say tough. ", "rating": 1}, {"title": "The time between ordering and…", "text": "The time between ordering and delivering is way too long", "rating": 1}, {"title": "Bottoms are not true to size I want a…", "text": "Bottoms are not true to size I want a refund but have to pay to return them", "rating": 1}, {"title": "I never received my $93.00!order and…", "text": "I never received my $93.00!order and apparently it's ok for your Company. It was left in the lobby of my Bronx building. Not at my door or in the lockers in my lobby. And to make it worst you have a policy. Unbelievable ", "rating": 1}, {"title": "The same petite medium in different…", "text": "The same petite medium in different style get even shorter and they don’t resolve issues ", "rating": 1}, {"title": "The size was not true to the…", "text": "The size was not true to the description and the package took a month to deliver. ", "rating": 1}, {"title": "My jeans smell like swamp!", "text": "I ordered stretchy jeans and they arrived with a horrible smell to them! They straight up smell like swamp!! I've washed them twice and can't get the smell out?...", "rating": 1}, {"title": "Inconsistent sizing/lengths", "text": "Inconsistent sizing/lengths, have to pay to return and things arrive smelling like chemicals.", "rating": 1}, {"title": "I NEVER RECIBE THE PACKAGE AND THE…", "text": "I NEVER RECIBE THE PACKAGE AND THE COMPANY DIDNT CARE ", "rating": 1}, {"title": "Nightmare with returns", "text": "God forbid you have to return something… what an absolute nightmare. ", "rating": 1}, {"title": "This was my first order", "text": "This was my first order, I just received a bag.  Until now I haven't received any order merchandise. ", "rating": 1}, {"title": "I still haven't received my return gift…", "text": "I still haven't received my return gift voucher and the bot isn't very helpful when asking questions! ", "rating": 1}, {"title": "Sizing is WAY off and I cannot get a…", "text": "Sizing is WAY off and I cannot get a response from customer service! ", "rating": 1}, {"title": "The package took a while to arrive and…", "text": "The package took a while to arrive and then nothing fit. The return process is too long.  Won't shop with you again, ", "rating": 1}, {"title": "I just needed a refund not a…", "text": "I just needed a refund not a credit..why would I buy stuff I can't return? You make it impossible I get to keep stuff I don't want? No I want my money back on you.. you pay for the shipping! A credit for what I wanted to keep shopping but now I know it's impossible ", "rating": 1}, {"title": "sewing issues…", "text": "2 pairs of the pants had sewing issues and in process of returning them. I’ll see how fast they are able send out new pairs.", "rating": 1}, {"title": "Cheap materials for the price and…", "text": "Cheap materials for the price and returns are very complicated. Will not order again", "rating": 1}, {"title": "Influencers are wrong ", "text": "Colors are awful, sizing wrong, takes forever to ship. Not a fan don’t do it! ", "rating": 1}, {"title": "I am trying to make a return/exchange…", "text": "I am trying to make a return/exchange for a bigger size.  I  send the email ,waiting for instructions. still waitng.", "rating": 1}, {"title": "The shipping was insane", "text": "The shipping was insane. You say it us delivered but dhl is doing crazy shit.", "rating": 1}, {"title": "My package never arrived", "text": "My package never arrived, but you say it did", "rating": 1}, {"title": "It is not what I expected", "text": "It is not what I expected. The material and color did not match what it was on the Website.", "rating": 1}, {"title": "I’m still waiting for the completion of…", "text": "I’m still waiting for the completion of my order. I ordered 3 pairs of pants and received 2. ", "rating": 1}, {"title": "Not how I expected ", "text": "Not how I expected it to be, rolls down after one wash. ", "rating": 1}, {"title": "Sizing very wrong", "text": "Sizing very wrong - no choice to take gift card as you have to pay returns postage", "rating": 1}, {"title": "I need to return for a different size…", "text": "I need to return for a different size and no one is helping me do this. ", "rating": 1}, {"title": "Not impressed at all with the cord…", "text": "Not impressed at all with the cord trousers. Very slow to arrive. Size was too big and no returns.", "rating": 1}, {"title": "No returns allowed!", "text": "Didn’t allow me to return the item even though it didn’t fit me well!", "rating": 1}, {"title": "The fabric is very plasticy feeling", "text": "The fabric is very plasticy feeling. Appears cheap", "rating": 1}, {"title": "I want to return it and you havenot…", "text": "I want to return it and you havenot sent instructions yet. Been waiting", "rating": 1}, {"title": "The clothing is not quality and does…", "text": "The clothing is not quality and does not fit well at all.  The cut on the blouses are not good.  There is no return option either.  ", "rating": 1}, {"title": "Terrible ", "text": "Terrible service when trying to return because they are to small", "rating": 1}, {"title": "You should offer a free return for…", "text": "You should offer a free return for first time buyer ", "rating": 1}, {"title": "Trying to return items has been a…", "text": "Trying to return items has been a nightmare. ", "rating": 1}, {"title": "Not free returns….what a hassle", "text": "Not free returns….what a hassle. I will never buys from this company again. Sent in pics of what all the pants ordered were too big and too long and that didn’t seem th mayte.", "rating": 1}, {"title": "I need a return label for both pieces…", "text": "I need a return label for both pieces please ", "rating": 1}, {"title": "Return process is a joke", "text": "Return process is a joke. Don't buy from this company. ", "rating": 1}, {"title": "The wrong size was sent and I can't…", "text": "The wrong size was sent and I can't seem to get any response on how to return!!! They sent an XL and I had ordered a medium.", "rating": 1}, {"title": "I am unable to reach your site to…", "text": "I am unable to reach your site to return item", "rating": 1}, {"title": "got size     XL  and they are too small need a L any way i can't get the return label with my computer because my computer can't send pictures. i have contacted you more than once and no return label ", "text": "contacted several time just need a return label on my email", "rating": 1}, {"title": "Leggings even with extra space ripped…", "text": "Leggings even with extra space ripped off the first workout ", "rating": 1}, {"title": "There is a strange smell that will not…", "text": "There is a strange smell that will not come out even after washing the jeans. ", "rating": 1}, {"title": "I am still waiting to k ow how to…", "text": "I am still waiting to k ow how to return the trousers which are not suitable ", "rating": 1}, {"title": "Nothing fit", "text": "Nothing fit. Hard to return things. Horrible non existence customer service ", "rating": 1}, {"title": "I need to return my jeans", "text": "I need to return my jeans. They do not fit. But have not received a return approval ", "rating": 1}, {"title": "Did not match description at all", "text": "Date of experience: November 05, 2024", "rating": 1}, {"title": "Its too bulky didnt expect so much bulky", "text": "Its too bulky didnt expect so much bulky ", "rating": 1}, {"title": "Free returns on all orders for a start", "text": "Date of experience: November 04, 2024", "rating": 1}, {"title": "Still waiting for my order", "text": "Still waiting for my order ", "rating": 1}, {"title": "No response on my return", "text": "No response on my return ", "rating": 1}, {"title": "Not as advertised ", "text": "Way too long to ship. Product not as advertised ", "rating": 1}, {"title": "Been trying since Monday to get return…", "text": "Been trying since Monday to get return details,keep sending ingredients me irrelevant emails", "rating": 1}, {"title": "Having to upload pictures for a return…", "text": "Having to upload pictures for a return is strange.", "rating": 1}, {"title": "Worst customer service I've ever…", "text": "Worst customer service I've ever encountered. No resolution and baffling emails ", "rating": 1}, {"title": "It took over a month to receive my item…", "text": "It took over a month to receive my item despite the preorder.", "rating": 1}, {"title": "If you wnat to return then it is awful!", "text": "If you wnat to return then it is awful! ", "rating": 1}, {"title": "They smell horrible and after 3 washes…", "text": "They smell horrible and after 3 washes still gross. I had to get rid of them!", "rating": 1}, {"title": "Struggling to return my items", "text": "Struggling to return my items ", "rating": 1}, {"title": "Isn’t very disappointed in the quality of the dress I received.  ", "text": "Isn’t very disappointed in the quality of ", "rating": 1}, {"title": "Damaged product", "text": "Damaged product ", "rating": 1}, {"title": "Worse products and high cost i will…", "text": "Worse products and high cost i will never buy again ", "rating": 1}, {"title": "The pants snagged very easily and were…", "text": "The pants snagged very easily and were ruined by a seatbelt :(", "rating": 1}, {"title": "Nothing fit like I expected.", "text": "Nothing fit like I expected. ", "rating": 1}, {"title": "Strong odour ", "text": "The jeans I got have a super strong smell that I can’t get out. ", "rating": 1}, {"title": "I did not receive my purchase", "text": "Date of experience: October 31, 2024", "rating": 1}, {"title": "Nobody knows where my order was…", "text": "Nobody knows where my order was delivered. It didn’t get to me.", "rating": 1}, {"title": "Sizing is all wrong", "text": "Sizing is all wrong. Clothing was too long & too small in bust, waist & hips.", "rating": 1}, {"title": "It doesn't fit and I can't return it", "text": "It doesn't fit and I can't return it.  Made for a short person", "rating": 1}, {"title": "They need to make the returns far…", "text": "They need to make the returns far simpler.", "rating": 1}, {"title": "Sorry but products just look and feel…", "text": "Sorry but products just look and feel very cheap", "rating": 1}, {"title": "Still haven’t received 4 of my items…", "text": "Still haven’t received 4 of my items and got billed for them", "rating": 1}, {"title": "It said it was delivered but it wasn’t.", "text": "It said it was delivered but it wasn’t. ", "rating": 1}, {"title": "Moms beware…", "text": "These really accentuate your mommy pooch. Not recommended", "rating": 1}, {"title": "Products are of bad quality", "text": "Products are of bad quality ", "rating": 1}, {"title": "Return process could be easier", "text": "Date of experience: October 22, 2024", "rating": 1}, {"title": "The pants I bought stink of moth balls…", "text": "The pants I bought stink of moth balls even though I washed them twice ", "rating": 1}, {"title": "Is a whole process", "text": "Is a whole process, slow.. ", "rating": 1}, {"title": "RETURNS", "text": "WHAT A PAIN TO TRY & RETURN!!", "rating": 1}, {"title": "no returns allowed", "text": "Date of experience: November 01, 2024", "rating": 1}, {"title": "I never got the product.", "text": "I never got the product. ", "rating": 1}, {"title": "the pants are great, shipping long", "text": "the pants are great.  shipping was just over 6 weeks.  that is just crazy.", "rating": 1}, {"title": "The pants arrived with a rip in the…", "text": "The pants arrived with a rip in the seams", "rating": 1}, {"title": "Wrong size and cant return items.", "text": "Date of experience: October 31, 2024", "rating": 1}, {"title": "Inconsistent sizing and a terrible…", "text": "Inconsistent sizing and a terrible return policy.", "rating": 1}, {"title": "Don't like the quality", "text": "Don't like the quality ", "rating": 1}, {"title": "Very low product quality", "text": "Very low product quality ", "rating": 1}, {"title": "Wrong order", "text": "Wrong order. Wrong size. Wrong pants totally ", "rating": 1}, {"title": "Verry wel moto buono", "text": "Date of experience: November 04, 2024", "rating": 1}, {"title": "Size too small", "text": "Size too small ", "rating": 1}, {"title": "tiny waist !!!!!!!!!!", "text": "Date of experience: October 29, 2024", "rating": 1}, {"title": "The package never arrived", "text": "The package never arrived. So disappointed", "rating": 1}, {"title": "Returns are ridiculous", "text": "Returns are ridiculous ", "rating": 1}, {"title": "Funny smell", "text": "Date of experience: November 05, 2024", "rating": 1}, {"title": "Sizing was extremely inaccurate", "text": "Date of experience: October 31, 2024", "rating": 1}, {"title": "Lousy customer service.", "text": "Lousy customer service. ", "rating": 1}, {"title": "Difficult return", "text": "Difficult return ", "rating": 1}, {"title": "UNRELIABLE!!", "text": "Date of experience: October 31, 2024", "rating": 1}, {"title": "Should not take more than 2 weeks", "text": "Should not take more than 2 weeks ", "rating": 1}, {"title": "Low quality fabric", "text": "Low quality fabric, very see through. Very tight in the waist. I’m going to donate them since I can’t sent them back", "rating": 1}, {"title": "Quality of your pants is too low and…", "text": "Quality of your pants is too low and doesn’t match from the pictures I’m very disappointed and the petite size is still too long can I return the the three pants ? I cannot wear it too loose and long ", "rating": 1}, {"title": "The clothes leak dye when washed", "text": "The clothes leak dye when washed. It will stain your other laundry. Just take a damp cloth and start rubbing the pants and it's crazy how much color comes out. That's why they advertise with 'wash with like colors'. ", "rating": 1}, {"title": "I cannot return ", "text": "I’m trying to return some thing because I don’t like the way that it fits and my return app won’t let me upload the photos that I took so it won’t let it go through and I’ve emailed and no one’s responding. ", "rating": 1}, {"title": "Never got my package", "text": "Date of experience: October 23, 2024", "rating": 1}, {"title": "Jeans didn't work", "text": "Jeans are way too short and material is scratchy. Not pleasant.", "rating": 1}, {"title": "I thought returns were free", "text": "I thought returns were free. Donated pants. Declined gift certificate. Won’t be purchasing again.", "rating": 1}, {"title": "A terrible experience trying to return…", "text": "A terrible experience trying to return the items. The website wouldn't allow me to click Submit in the  final stages of the return process despite attempting it on different search engines. My correspondence with the customer service agents was abysmal as each email asked for the same things over and over again, and nothing was resolved. ", "rating": 1}, {"title": "I need to know the address for a…", "text": "I need to know the address for a return!  How hard is this? Why don’t you send a return label like other companies do?", "rating": 1}, {"title": "Coupons don’t work on anything I like", "text": "Coupons don’t work on anything I like ", "rating": 1}, {"title": "Can’t get return instructions  way to…", "text": "Can’t get return instructions  way to big", "rating": 1}, {"title": "The sizes are way off", "text": "The sizes are way off, and the quality of the clothes are complete garbage. They don't look anything like the pictures, really cheap and tacky.  returning them is not a simple process.", "rating": 1}, {"title": "Never received my order!", "text": "Date of experience: October 22, 2024", "rating": 1}, {"title": "I received a notification that my…", "text": "I received a notification that my package had arrive, but it had not.I went through the steps on the app. I provided my tracking and confirmation numbers.  The automated system responded that there were no such numbers. My credit card was charged. I am very unhappy. I needed the  item purchased for a work trip. i enjoy your products but feel I can no longer order from you with such poor customer service ", "rating": 1}, {"title": "Took a really long time to receive item…", "text": "Took a really long time to receive item and sizing was off from that stated. ", "rating": 1}, {"title": "Your return process is very difficult", "text": "Your return process is very difficult. I just hope I get my money back!!", "rating": 1}, {"title": "Material and sizes not as described", "text": "Material and sizes not as described. It looks like Shein cheap material and when you request refund they ask for pic even when you mention the size is small? They want a pic that it does fit? Or small? What a humiliation seriously ", "rating": 1}, {"title": "Horrible!", "text": "Horrible!! I was so excited to order my 2 outfits but I never received them. I was given an order email saying package was delivered but no one has seen my package. It was not delivered at my house. I’ve emailed trying to contact someone but so far no help.", "rating": 1}, {"title": "Package not delivered correctly", "text": "My package was not delivered in a secure location. It was left at the entrance of the building where anyone could have taken it. ", "rating": 1}, {"title": "size problem and exchange request", "text": "I ordered the trouser according to the size chart but it is too big.  i would like to exchange it for a smaller size.  so i wrote and asked for the proceedure.  i am told that the information will be sent.  i am still waiting", "rating": 1}, {"title": "Products did not arrive before we moved…", "text": "Products did not arrive before we moved back east, in spite of a ten day order lead time and express shipping. They claimed that they nit have any inventory and every product was made from scratch after orders were received. The products are hopefully being forwarded by the USPS, but who knows if we will ever see them. Then, today I received an email swing, oh, so sorry, we forgot to charge you sales tax, so go to this link to pay it. What BS! Am telling them to go fly a kite.", "rating": 1}, {"title": "Slow communication ", "text": "Slow communication I am still waiting for the instructions to return items even after I sent pictures of the items. It’s been longer than the promised 24 hours. ", "rating": 1}, {"title": "I was notified", "text": "I was notified, long after receiving my shipment, that Halara mistakenly failed to charge me sales tax. They sent email notification of such, and a link to provide payment, but indicated that I would be responsible for providing proof of payment if requested. It felt suspicious and even a little fraudulent, and led to my poor rating.", "rating": 1}, {"title": "the leggings are see-through and thin", "text": "the leggings are see-through and thin. I have a big round butt and i went a size up from L to XL. big on the waist but see through on the butt area.", "rating": 1}, {"title": "Long,long wait for delivery", "text": "Long,long wait for delivery ", "rating": 1}, {"title": "I was supposed to get 2 pairs it was only 1 and they ate to small", "text": "I was supposed to get 2 pairs it was Bulone get one free! I did not get it I got one pair and they d", "rating": 1}, {"title": "I was sent the wrong item and then was…", "text": "I was sent the wrong item and then was supposed to receive a gift card instead of returning it but the gift card number doesn’t work.  This has been going on for two weeks. I am very disappointed ", "rating": 1}, {"title": "The tracker said you delivered my…", "text": "The tracker said you delivered my package but I haven't received it", "rating": 1}, {"title": "I emailed twice about returns and no…", "text": "I emailed twice about returns and no response. I need to return some items that didn’t fit. Will never use your company again if this is the way you do business ", "rating": 1}, {"title": "Absolutely horrible returns experience…", "text": "Absolutely horrible returns experience - DO NOT ORDER FROM THEM IF YOU WANT YOUR MONEY BACK! I returned my HALARA order through Evri (self-paid, of course) which was delivered a week ago. The customer service have asked for Evri tracking number which I have given to them but they claim it doesn’t work. I then sent a screenshot by screenshot response showing that it works and it has been delivered but they are responding with automated emails. I have literally sent them proof of delivery and they still would not refund me my money. Asked for a chargeback from my credit card - thank God this option exists.", "rating": 1}, {"title": "Returns are very difficult ", "text": "Returns are very difficult . There is not phone number to contact you.", "rating": 1}, {"title": "It took extremely long to receive my…", "text": "It took extremely long to receive my item.", "rating": 1}, {"title": "Shipping too long!", "text": "Date of experience: September 18, 2024", "rating": 1}, {"title": "LONG WAIT AND POOR QUALITY", "text": "Date of experience: October 23, 2024", "rating": 1}, {"title": "Not all women have long legs", "text": "Just as men have various inseam measurements so do women. Not all women have long legs.", "rating": 1}, {"title": "Don’t Do It", "text": "Cheap quality items. Express shipping is misleading. Returns are made intentionally difficult and Halara pushes all those costs onto you. ", "rating": 1}, {"title": "Impossible to return or exchange if you order the wrong size", "text": "I ordered the wrong size and I have been trying to return it or exchange it without success.I bought a second pair in the right size but I still have not been told how to return the wrong size or how to exchange it for the right size.", "rating": 1}, {"title": "STAINED product. Poor Customer Service.", "text": "The pants I recieved were STAINED. The first rep told me to try to wash them. Once he issued the replacement I did not receive a confirmation email. When I contacted Halara for a second time I was told I would recieve an email soon. Days later I contacted them for a THIRD time for a confirmation email and they still could not send me a confirmation email. TERRIBLE customer service. This was my first order at Halara and my last.", "rating": 1}, {"title": "Never received my package and can’t get…", "text": "Never received my package and can’t get help", "rating": 1}, {"title": "I don’t like that I spent $73 on your…", "text": "I don’t like that I spent $73 on your product and can’t get a proper refund. ", "rating": 1}, {"title": "Extremely bad service ", "text": "If the product does not arrive, you do not have a refund", "rating": 1}, {"title": "Sizes of pant length ", "text": "This was my first order and unfortunately they were all too long. One pair of denim and two yoga pants. I ordered petite, and the were several inches to long.", "rating": 1}, {"title": "Bad smell ", "text": "I love the cut and the style of the jeans - colour is point on But get rid of the chemical smell - your product smells like moth balls !!!", "rating": 1}, {"title": "My order is missing and there’s no way…", "text": "My order is missing and there’s no way to get help from HalaraThe company that supposedly deliver my package has a phone number that is not working which means that I just lost my money or I have bien robed ", "rating": 1}, {"title": "I’ve returned the leggings waiting for…", "text": "I’ve returned the leggings waiting for money to be returned to me 😡", "rating": 1}, {"title": "I bought the black one", "text": "I bought the black one. The material is nice but  the sleeves are so different from the picture! Doesn’t have a good style!", "rating": 1}, {"title": "All the bras were poor support and not…", "text": "All the bras were poor support and not the best quality for how expensive they were. Disappointing. ", "rating": 1}, {"title": "Items not described ", "text": "Poor quality ", "rating": 1}, {"title": "Terrible customer service", "text": "Terrible customer service.  I received a 25% off welcome code that was not applied to my order then when I asked for it to be applied they told me it couldn't be used on my order. After several emails I was told my order processed abd could not be canceled.  They gave me a 12% off discount for a future order. ", "rating": 1}, {"title": "Dreadful returns service", "text": "Dreadful returns service. One has to get the return approved, then awsit a decision and then await a returns address. I am still waiting after nearly two weeks and still haven't received the address despite emailing.also the customer service link in the returns info doesn't work. Awful and stressful ", "rating": 1}, {"title": "returns are so unnecessarily difficult…", "text": "returns are so unnecessarily difficult - and we have to pay shipping? will not be ordering again.", "rating": 1}, {"title": "Shipping takes way too long", "text": "Shipping takes way too long! It's not worth waiting for! I don't even like half of the items!", "rating": 1}, {"title": "Very poor quality bad experience no…", "text": "Very poor quality bad experience no more buying with you sorry", "rating": 1}, {"title": "Fabric was very cheap looking and thin", "text": "Fabric was very cheap looking and thin. Color and fit were off.  Terrible customer service regarding returns having to fill out an application.  Still waiting for my refund ", "rating": 1}, {"title": "Fake use of my email address", "text": "Someone is using my email address to buy stuff from this company. I have emailed them explaining but they do nothing.", "rating": 1}, {"title": "Horrible I never received my package…", "text": "Horrible I never received my package and no one was able or better want to help me. Very disappointed. Probably for you guys almost $100 is nothing but for me is a lot of money and I lost it ", "rating": 1}, {"title": "I want to return 2 pair of pants and…", "text": "I want to return 2 pair of pants and photos are required which is too cumbersome for a legitimate return. I can't get a phone number for customer service. ", "rating": 1}, {"title": "Unsatisfactory customer service", "text": "My order was stolen. I filed a police report and have video footage. Halara refused to replace the items. From a company that let's you keep the items and receive a credit, instead of returning items, this is strange and disappointing. ", "rating": 1}, {"title": "I was told I could donate the extra…", "text": "I was told I could donate the extra small rather than return the item. I was also told I would get a gift card to get another size but never received it. I ended up paying twice. ", "rating": 1}, {"title": "Return policy is hilarious!", "text": "Date of experience: October 28, 2024", "rating": 1}, {"title": "Sizing ", "text": "I always order a M (8-10). I am 5’7” and around 175 lbs. Not a single thing fit me and I even ordered the right sizes. With saying things have a lot of stretch.. I would have to highly disagree. I will be sending everything back. ", "rating": 1}, {"title": "The return process is unnecessarily difficult", "text": "The return process is unnecessarily difficult. I was unable to locate it and had to contact support for help. Then it required pictures of the items being returned, which makes no sense. I have ordered from this site twice and the sizing is inconsistent between their own items. I have larges that fit, ones that are way too big, and ones that are way too small. I will not order from here again. Too much of a headache.", "rating": 1}, {"title": "I can't believe I paid that much for…", "text": "I can't believe I paid that much for what I got. Not worth the money at all. The fabric is so thin.", "rating": 1}, {"title": "To much time to deliver", "text": "Date of experience: October 28, 2024", "rating": 1}, {"title": "My pants ripped the same day I wore…", "text": "My pants ripped the same day I wore them. So disappointed 😞", "rating": 1}, {"title": "Not true to size", "text": "Not true to size and expensive ", "rating": 1}, {"title": "My jeans are to long and big.", "text": "My jeans are to long and big.I am trying to return them now and cannot get any instructions from your customer service.", "rating": 1}, {"title": "Unflattering", "text": "Almost every item I ordered was very unflattering and did not fit me nicely. Time to look into the return process.", "rating": 1}, {"title": "Not great ", "text": "Honestly the material were cheap, and they make the customer pay to return. Wouldn’t order from Halara again. ", "rating": 1}, {"title": "The pants is too large", "text": "Date of experience: October 15, 2024", "rating": 1}, {"title": "Return policy is horrible", "text": "Return policy is horrible, can't even download the return slip and have to pay at own expense to return.  Will never order from Halara again.", "rating": 1}, {"title": "I have sent several emails asking how…", "text": "I have sent several emails asking how to exchange my items for a larger size and nobody has gotten back to me.", "rating": 1}, {"title": "Will not purchase again…", "text": "I had purchased these same pants only 5 months ago and decided to size down this time. My old pair were 39% cotton but this new pair is 59%. So I sized down even though the pants will shrink… bummer. I have also managed to tear both pairs of pants first time wearing. And not because they’re too tight. First pair snagged by the knee due to a keyboard drawer… even my cheap SHEIN and Amazon pants/leggings have never snagged from my keyboard drawer. Second pair has now been torn from a small staple sticking out of a door frame. Possibly I’m just clumsy or bad luck but it’s awfully coincidental that the only two times I’ve torn my pants in the past decade was the same pair. For the price of these pants, it’s not worth it and I will not purchase again.", "rating": 1}, {"title": "expensive and bad quality", "text": "Date of experience: October 28, 2024", "rating": 1}, {"title": "Extremely uncomfortable and still…", "text": "Extremely uncomfortable and still waiting on seller to send me back shipping info. ", "rating": 1}, {"title": "The products add poor in quality for…", "text": "The products add poor in quality for the price (similar to shein or temu) and over large sizing…and the inability to return (easily) means I will never shop here again.  For a first order?  It should be an easy return process so you can assess sizing and quality Will never order again. Or recommend to friends for all these reasons. I do not appreciate having to pay for shipping for a refund from Canada to the US.  Unacceptable.  I willShop where there are better return policies ", "rating": 1}, {"title": "The returns process was complicated and…", "text": "The returns process was complicated and ridiculous. I had to take photos of the garments even though they were still in the original condition with tags and unworn, then produce my own returns label, pay for the return postage and email a tracking number! All other online shops I use make the returns process free and easy. I won't be shopping with Halara again for this reason.", "rating": 1}, {"title": "Fabric thin shows up skin texture", "text": "The fabric is thin and shows up the skin texture. Saggy in the front. Not as demonstrated in the website. I could not find a way to return it and will appreciate a contact for that.", "rating": 1}, {"title": "Fed up of waiting", "text": "My order, placed at the beginning of the month, still isn’t fulfilled. I reached out to customer services and was fed a story about one of my items being a preorder item which was delaying delivery time. This was not made clear before I paid, and if it had been, I wouldn’t have ordered. Amateur company with dodgy sales practices. ", "rating": 1}, {"title": "I ordered an 8/10 as per the website…", "text": "I ordered an 8/10 as per the website and they sent me a 7/8 so they don't fit. They also advertise if u order and need to fix your order they will help u. I ordered on a Sunday and the next day was a federal holiday. I emailed them about an hour after I ordered trying to fix my order but they \"alread shipped it\" this is my own fault but I will not order from this company again. Which is a shame because I liked the leggings. EDIT and as for your reply NO u sent me a M 7/8 and that has nothing to do with the length!!! So don't try to make this out like I don't understand SIZING!!", "rating": 1}, {"title": "Never got the right pants I order I…", "text": "Never got the right pants I order I order the one without the button in front and that what I got with the button ", "rating": 1}, {"title": "Never received the irem", "text": "Date of experience: October 28, 2024", "rating": 1}, {"title": "These pants are overpriced and terrible…", "text": "These pants are overpriced and terrible quality.", "rating": 1}, {"title": "I never received my order", "text": "I never received my order ", "rating": 1}, {"title": "Still waiting on a return label", "text": "Still waiting on a return label. Material is very very cheap feels like costume material. Would not purchase again!", "rating": 1}, {"title": "Comfortable pants sure, but stinks like rotting rubber balloons", "text": "The pants feel great, you can tell it isn't some amazing high quality material they have used but the SMELL- my god, when balloons get old and start to release gas, smells like a whole chemical factory- won't be buying again. Oh and they were not really cheap- as the pants I was looking for weren't valid for the 'additional discounts' they provide when they lure you into the site.", "rating": 1}, {"title": "Worst Experience ", "text": "Horrible sizing. The worst returns/exchange process of any company I've ever ordered from and I order alot of clothes online. Poor customer service. This company has created a system that takes your money with no intention of refunded it if the clothes don't work. Save yourself time and money by never ordering from them. I would give them zero stars if possible.", "rating": 1}, {"title": "Company is overseas and it takes way to…", "text": "Company is overseas and it takes way to long for the product you purchase  ! Never once was that mention.", "rating": 1}, {"title": "Return process is terrible ", "text": "You have to send pictures of yourself in items before you can return. ", "rating": 1}, {"title": "I don’t like the leggings I got", "text": "I don’t like the leggings I got. How do I return ?", "rating": 1}, {"title": "Sent wrong size", "text": "I ordered a 8/ 10 per the website and gott a 7/8 after waiting quite awhile. ", "rating": 1}, {"title": "I didn’t receive the gift card", "text": "I didn’t receive the gift card ", "rating": 1}, {"title": "TERRIBLE SERVICE, STILL HAVE NOT RECEIVED ORDER. ", "text": "I wish I could rate this less than 1 star. I have not received my order yet the delivery is saying it has come. I have checked around my home, asked concierge and my neighbours and no one has seen a delivery person. I contacted Halara chat and they sent me the tracking for a website in Mandarin, not in english. Ive also emailed and haven’t heard back from anyone. My order was no cheap and service has been awful, yet im getting  review links sent to me when I havent gotten any response or even received my items. Extremely dissatisfied and frustrated about this entire situation. ", "rating": 1}, {"title": "The pants are not like the photos", "text": "The pants are not like the photos, they are very wide at the end of the legs. I will have to send them to be fixed so that they are like I thought they were according to the photos.", "rating": 1}, {"title": "You sent me the wrong size in one of my…", "text": "You sent me the wrong size in one of my selections. When I tried to return the two items I was unable to access the return codes on your site. I online chatted with a representative and she said she was going to send me the labels. Nothing has transpired. But you have sent me two emails to review you. I really wanted to love this company but they have a ridiculous return policy", "rating": 1}, {"title": "I have not receive my order", "text": "Date of experience: October 27, 2024", "rating": 1}, {"title": "Wasn’t aware items couldn’t be returned…", "text": "Wasn’t aware items couldn’t be returned Jumper is poor quality", "rating": 1}, {"title": "bad shipping practices", "text": "bad shipping practices, clothes are very low quality, sizing is weird ", "rating": 1}, {"title": "Bad customer service ", "text": "I ordered three pairs of the exact same pants, all size large but three different colors. Two fit just fine. The third would barely go up past my hips. Clearly I was sent the wrong size!!! Then I was told I would have to pay for the return shipping. No way! Done with Halara!!!", "rating": 1}, {"title": "Shipping ", "text": "I paid extra for two day shipping to get order before a trip and it took 6 days or more. ", "rating": 1}, {"title": "I received someone else’s order", "text": "I received someone else’s order. I have not been able to have customer service contact me. I did send and receive a email. The email said someone would contact me. That has not happened. Very dissatisfied with this company. I want to return the entire order which was not mine. I want a refund for my original order which I did not receive.", "rating": 1}, {"title": "I have two items that I ordered and…", "text": "I have two items that I ordered and paid for and have not received them. I have started a chat 3X and was told that someone would get back to me and I still haven’t heard anything.", "rating": 1}, {"title": "Shady return policy", "text": "I feel that your return policy and how you communicate that policy is an unscrupulous business practice. When ordering you advertise easy returns within 30 days. When my items arrived the email you sent said the items couldn’t be returned. I contacted your chat support and they said I could get store credit but not a refund. Plus, I ordered 2 pairs of pants, both the same size, with the same sizing chart and one pair is significantly longer than the other, plus it has a really strong chemical smell. ", "rating": 1}, {"title": "It takes too long and comes from…", "text": "It takes too long and comes from another country.  Sizes are not true to size", "rating": 1}, {"title": "I tried to initiate a return due to the…", "text": "I tried to initiate a return due to the fact they are too short. That was on Saturday.  It is now Tuesday and I have never received the email it told me to expect. ", "rating": 1}, {"title": "Nothing fits well and the material is…", "text": "Nothing fits well and the material is polyester", "rating": 1}, {"title": "The jeans smell absolutely terrible", "text": "The jeans smell absolutely terrible. I washed them three times and they still smell like chemicals. Can I please have a refund or exchange? I cannot wear them. ", "rating": 1}, {"title": "Low quality and strange sizing.", "text": "Ordered same item and same size in a different colour - one item fits but the other one is fairly smaller and less elastic. Really bad quality.The whole return policy is so complicated that you give up even trying to return and you are stuck with a pile of clothes with low quality material and fit. ", "rating": 1}, {"title": "Missing item", "text": "Missing item. No PU holder was delivered as promised. ", "rating": 1}, {"title": "Long ship time with no tracking updates…", "text": "Long ship time with no tracking updates available. Color match is horrible and no one will help with a return. ", "rating": 1}, {"title": "The pants are very cheaply made not…", "text": "The pants are very cheaply made not worth the price at all ", "rating": 1}, {"title": "I asked for a return and no one has…", "text": "I asked for a return and no one has contacted me. ", "rating": 1}, {"title": "I have not received my last two orders.", "text": "I have not received my last two orders. ", "rating": 1}, {"title": "Not a good company & avoid", "text": "Not a good company & avoidJeans took 3 weeks to arrive Very small not English sizesTrying to return is taking ages & just got an email & they way they word it is you can get a refund but god knows how you get it! So I clicked on a refund light blue part and it says I know get a gift card!!! AVOID ", "rating": 1}, {"title": "The pants are very thin", "text": "The pants are very soft, but thin. I was looking for a better quality. ", "rating": 1}, {"title": "Like 3 of 4 items but I’m Finding it…", "text": "Like 3 of 4 items but I’m Finding it impossible to make a return, jumping through hoops! Was going to exchange but at this point im afraid to order again and have to go through this again.", "rating": 1}, {"title": "Terrible cheap material", "text": "Terrible cheap material. The pants look like a mix of scrubs and clown pants. Pretty disappointed ", "rating": 1}, {"title": "Very low quality product.", "text": "Date of experience: October 24, 2024", "rating": 1}, {"title": "The clothes take entirely too long to…", "text": "The clothes take entirely too long to be delivered.", "rating": 1}, {"title": "Fabric was awful Not true to size chart", "text": "Date of experience: October 19, 2024", "rating": 1}, {"title": "Never get my package ", "text": "They said I already received my package and I never got it. And they can't help me that I have to call Fedex directly when I made the purchase from their page not with Fedex.", "rating": 1}, {"title": "Pants are too short", "text": "Pants are too short. Can’t find the order number and can’t return with out it. ", "rating": 1}, {"title": "Pants were very cheap", "text": "Pants were very cheap, with no packing slip or confirmation email to return.. stuck with junkWill tell all my everyone I can ", "rating": 1}, {"title": "DO NOT BUY FROM THIS COMPANY", "text": "DO NOT BUY FROM THIS COMPANY,  WE PLACED AN ORDER NEVER RECEIVED WHAT WE ORDERED BUT THEY DID TAKE OUR MONEY OVER 200.00 DOLLARS , NO PHONE NUMBER TO CONTACT THEM AND DONT REPLY BACK TO EMAILS , NOT SURE IF THATS EVEN LEGIT EVERYTHING ELSE SURE ISNT , NOW GOING THROUGH AN ATTORNEY TO FIND THEM AND WHO THEY REALLY ARE . BUYER BEWARE !!! ", "rating": 1}, {"title": "I'm trying to return the item but the…", "text": "I'm trying to return the item but the website keeps saying error when going through the online return process. ", "rating": 1}, {"title": "I was really disappointed", "text": "I was really disappointed. I was looking forward to finding a brand with XL activewear/light fabric and ordered a jumpsuit and two dresses. Each product had a sizing issue. The jumpsuits legs were way too long (I'm 5'6), one dress had major side boob issues, and the other dress was shorter in the front and long in the back (which I was expecting). What I wasn't expecting was for the front of the dress to literally show my underwear (that's how short it was). I was disappointed to have to spend 45$ on tracked shipping back to the US from Canada because they don't do free returns. The other option was a gift card but I didn't see a point in buying more products that wouldn't fit my body type. ", "rating": 1}, {"title": "I thought I was buying straight leg…", "text": "I thought I was buying straight leg black pants size large. Waist and hips were good but they are wide straight leg. You have to pay for shipping to return so it would be like buying another pair of pants so I decided to try to alter. I’m cutting 2 inches off both sides of both legs. We will see if I can wear them or not. ", "rating": 1}, {"title": "The sizes are not consistent", "text": "The sizes are not consistent.  I ordered medium because the last time small was to tight on me .  I ordered medium this time and they are too big.  I'll be returning everything.  This is the 2nd time I've had to do this and it's only my second purchase.  It's very disappointing.  I had hi hopes", "rating": 1}, {"title": "Never received my order.", "text": "Date of experience: October 26, 2024", "rating": 1}, {"title": "I ordered a jumpsuit that didn’t and…", "text": "I ordered a jumpsuit that didn’t and the return process has been an ordeal. ", "rating": 1}, {"title": "I ordered a blazer", "text": "I ordered a blazer, trusted with Halara”s size measurements system and went for the size HALARA suggested. The size Halara suggested was not the right size. When I requested to get a return label or exchange, I gor denied by the Halara team . I am a corporate employee and I have been advocating Halara to my professional networks. However, I will never shop from Halara again and advise my network the same. ", "rating": 1}, {"title": "Over a month long for my order and too big ", "text": "Over a month long for my order. And then they come and the pants are so long I can’t even wear them. ", "rating": 1}, {"title": "Temu quality with a department store Price tag ", "text": "Had the pants on for 3 hours and the seem down the middle is already complete undone I was hesitant to order from Halara and I’m upset I ordered 3 pairs of these pants! safe to say I won’t buy this crap again after spending the kind of money for something so cheaply made I could have gotten of TEMU for 90% less. ", "rating": 1}, {"title": "Scammer for phone # .....You say put in your phone # and sign up…", "text": "You say put in your phone # and sign up for 25% off your first order I do all that you get my email address my phone # and text me to send back Y to receive your text messages on the site sales and then send me a code for 25% off on my first order I order 3 pair of pants go to,check out put in my 25% off code and it says can not use on this order.......WTH ...... you scam people into giving you their phone # for texts. BS... I ordered the pants anyway cause they are a gift for my daughter in law for Christmas BUT you are one and done for me on orders and will not be recommended to any one from me ......", "rating": 1}, {"title": "I am attempting to return", "text": "I am attempting to return.  Cannot without pictures.No response from your customer service department.", "rating": 1}, {"title": "Poor sizing", "text": "Poor sizing ", "rating": 1}, {"title": "Never received my package", "text": "Date of experience: October 23, 2024", "rating": 1}, {"title": "Aweful....will never recommend or buy…", "text": "Aweful....will never recommend or buy from again!", "rating": 1}, {"title": "legs are way to big", "text": "Date of experience: October 18, 2024", "rating": 1}, {"title": "I purchased a pair of denim look…", "text": "I purchased a pair of denim look keggings. Unfortunately for me it was a final sale. This is the first and last experience I will have with this company...the jeans looked like something an 8 year old could wear way way small. Terrible experience ", "rating": 1}, {"title": "The return policy sucks", "text": "The return policy sucks. Why are we charged for sending the clothes back. Not right at all. I am done with this company. ", "rating": 1}, {"title": "The jeans feel like cheap quality and…", "text": "The jeans feel like cheap quality and the wrong color was shipped to me, they are also look nothing like the picture, extremely wide legged and long. ", "rating": 1}, {"title": "No clear information about return ", "text": "No clear information about return , didn’t work! ", "rating": 1}, {"title": "Didn't get my trousers", "text": "Date of experience: October 26, 2024", "rating": 1}, {"title": "Too hard to return", "text": "Date of experience: October 21, 2024", "rating": 1}, {"title": "I wanted a refund for the order…", "text": "I wanted a refund for the order 241011025712592984 but instead I got gift card. I don’t want a gift card. ", "rating": 1}, {"title": "Didn’t receive package", "text": "Didn’t receive package ", "rating": 1}, {"title": "It is taking a long time to receive a…", "text": "It is taking a long time to receive a return label. Your response to my request for processing my return , says you will respond w/in 24hrs. It has been 72 hrs. I have been emailing you and no return label so far. ", "rating": 1}, {"title": "So Dissapointed!", "text": "I was really looking forward to Halara. They have a lot of cute items for reasonable priced. Unfortunately, I ordered some items that did not fit (I should have looked at the sizing charts a little closer, but that's my fault) and had to make a return. Halara does not do exchanges, which I would have loved, but the more annoying part is how agonizing it is to do a return through them. It's a multi-step process that involved submitting pictured of what you want to return (never seen that before, other than for damaged items) and then they make it very challenging to get a true refund. I was not interested in a gift card. Not only do they bury the option for a true refund, they make it near impossible to figure out where to ship your returns (spoiler alert: it's not the return address on your shipping label--they make that very clear). I'm still searching for the return address, so who knows if I'll ever get my refund. ", "rating": 1}, {"title": "Get it together!", "text": "I like your product.  But can't get a login account.  Never received free gift or promised deductions and the pants took way too long to get here. ", "rating": 1}, {"title": "They run very large", "text": "They run very large.  Not even made in the country so delivery took over 2 weeks.  The denim has a horrible scent.   Super soft denim but definitely a disappointment.  Not worth the long wait.   It's quite interesting that headquarters are in California but you ship via HDL.  Lesson learned. ", "rating": 1}, {"title": "Order never arrived", "text": "Order never arrived says it was delivered but did not come. Don’t trust this company. ", "rating": 1}, {"title": "Do not buy ", "text": "The tummy controll leggins are horrible everytime I sat down they would roll i have a toddler I was constantly pulling them up it was terrible ", "rating": 1}, {"title": "The material is not what I expected", "text": "The material is not what I expected, I’m going to return my items", "rating": 1}, {"title": "Smell like mothballs…", "text": "Ordered a pair of wide leg jeans and loved them. So ordered four more pair, and they smell horrific like moth balls.Washed them three times in laundry detergent and vinegar rinse, still can't get the mothball smell out.", "rating": 1}, {"title": "Bad customer service", "text": "My first order went very well. I liked the pants. I ordered the first time so I decided to order them and Black. I put an order in for the same pants and Black and I received a different pair of pants which were Work pants which is not the ones I ordered. I tried to chat and they didn’t understand what I was saying. They also sent me a email on October 24 saying I had received my delivery. That was not true either. I had not received any kind of delivery. I am still waiting on delivery for the black pants.. With the pockets on the backside.", "rating": 1}, {"title": "Will never order Halara again", "text": "Shipping took over a month, package was in terrible condition, pant material is garbage, and the fit is horrible. It’s my second time purchasing from Halara. The first pair of pants I ordered were great and shipping was so fast. It was also when they first came out. Now, I would never order from this company. Not even worth the hassle of returning, just going to donate them to a thrift store. ", "rating": 1}, {"title": "Pants are terrible", "text": "Pants are terrible. Size is very off. Returning isn’t easy.", "rating": 1}, {"title": "Quality of the product is very bad", "text": "Quality of the product is very bad ", "rating": 1}, {"title": "Horrible cheap fabric", "text": "Horrible cheap fabric. And now I can’t figure out how to return it because apparently they don’t have any records that I purchased anything. Sooo corrupt. ", "rating": 1}, {"title": "Their website did not save the correct…", "text": "Their website did not save the correct shipping address. In one screen is said the correct address, but in another it said the old. My order was sent to the old address and Halara basically told me it’s my fault and I’m out the money and product. I just feel like even a partial discount would be good customer service ", "rating": 1}, {"title": "Very happy with my purchase", "text": "Date of experience: October 18, 2024", "rating": 1}, {"title": "Poor Quality", "text": "Received wring items ; quality was not great", "rating": 1}, {"title": "The product is nothing that you show in…", "text": "The product is nothing that you show in the video. Is plastic, sintetic. Horrible for the skin feel awful. I'm not spend my money on your product anymore. ", "rating": 1}, {"title": "Quality not up to scratch", "text": "Quality not up to scratch. After one wear at the gym, the seams got scuffed up just from me lying on the floor doing some stretches at the end of the session. Also very very thin", "rating": 1}, {"title": "I was offered a discount if I gave my…", "text": "I was offered a discount if I gave my cell phone number which I did and when I went to check out I was told my items were not part of offer??  That is ridiculous!", "rating": 1}, {"title": "The colour of the jeans didn’t seem the…", "text": "The colour of the jeans didn’t seem the same as in the picture. The order took about 5 weeks to arrive and the returns seemed complicated.", "rating": 1}, {"title": "Poor quality", "text": "Poor quality ", "rating": 1}, {"title": "Just Bad ", "text": "China droppshipping ", "rating": 1}, {"title": "Customer Service is no help", "text": "Ordered over $150 worth of items. They were shipped to the wrong address. Halara refuses to replace the items or give a credit/refund. I'm filing a claim with PayPal since customer service is no help. I'm not paying for items I did not receive! ", "rating": 1}, {"title": "Terrible it arrived late and it's like…", "text": "Terrible it arrived late and it's like pulling a nail out of a hay stack just to get a return label!!!", "rating": 1}, {"title": "I wanted to send my items back as they…", "text": "I wanted to send my items back as they were too short and not as described. I asked to return and was told I needed to pay for delivery to send them back, I complained and did get a full refund and told to keep the items as well: I will donate to charity ", "rating": 1}, {"title": "Not a fan", "text": "Not a fan, All the hype over these leggings, they're sub par. It very low quality. Don't waste your money. ", "rating": 1}, {"title": "Returns ", "text": "I have sent multiple emails asking for a return label and where to drop off my return. I’ve received a gift card for my exchange already which is great but need to get the items returned before I’m double charged ", "rating": 1}, {"title": "Will not order from this brand again ", "text": "I went off the recommendation of the sizing on their website and all 5 pairs of pants did not fit. Unless you are willing to take a gift card for your returns you have to pay shipping.", "rating": 1}, {"title": "Difficult to return item", "text": "Making it very difficult to make a return of a product. I got a mail that said i would get another mail in 24 hours explaining how i could return my item. It has now been over 48 hours and i still havent got any mail. ", "rating": 1}, {"title": "Very difficult to make a return", "text": "Very difficult to make a return. Still have not figured out how. ", "rating": 1}, {"title": "Pilling instantly ", "text": "I wore my new tights for a few hours and they were already pilling in between the legs. Balling up. The fit was good, but not happy at all with the quality of material. ", "rating": 1}, {"title": "Great product go for it ", "text": "Absolutely horrible quality inseam is not as stated on website (ordered long, should have been long enough, are not)Colors not as shownJust terrible cheap quality ", "rating": 1}, {"title": "The fabric is very cheap and the…", "text": "The fabric is very cheap and the quality is very poor. I didn’t like the pants and overalls at all. I wouldn’t give it one star to be honest. I’m sorry I don’t want to be disrespectful but it’s really really bad. ", "rating": 1}, {"title": "I haven't received my refund", "text": "I haven't received my refund ", "rating": 1}, {"title": "i tried on a pair of my friends pants…", "text": "i tried on a pair of my friends pants from you, really liked them and ordered the same style but they do not seem to have the same feel or quality…My friend  loves your clothes and i was super excited to get them but i can’t wear the shirt .. very flimsy material and the pants are thin and look very inexpensive. The  jeans are not denim at all but a stretchy material and are ok… but stretched out of shape after a few hours …  it’s as if my friend and i ordered from two different companies .  I don’t think i will move  forward with the other items i was looking at. Not for me!", "rating": 1}, {"title": "Caution BE ready to pay for mailing your return and not immediate refund", "text": "The product The product quality was disappointing, and the return and refund process is unacceptable. As a customer, having to pay for return shipping and then wait weeks for a refund is unreasonable. No reputable online retailer operates this way. In short, the product wasn’t as described, and it’s frustrating to have to pay for the mistake of shopping at Halara. Please be cautious if you’re not certain about your purchase.", "rating": 1}, {"title": "The shipping time is atrocious", "text": "The pants are cute enough but fit a bit tighter than a 4/6. Cheaper quality than what I was expecting. The shipping time was RIDICULOUS. I understand making one order per request as opposed to mass producing a big batch and shipping them out, but a better system needs to be in place to ensure fair shipping times. I placed my order on Sep 9 and received it well into October. I understood my order was a pre-order, but I ordered during one of the last days of pre-order and efforts should have been put in place to have a decent amount of pants ready. Unfortunately due to this experience I will not be purchasing with Halara again. ", "rating": 1}, {"title": "I didn’t really like the pants how they fit …", "text": "I didn’t really like the pants how they fit. They were too short and I was not able to return them because you have no return policy.", "rating": 1}, {"title": "Still waiting to be able to send items…", "text": "Still waiting to be able to send items back very unhappy with service ", "rating": 1}, {"title": "Need better return policy", "text": "Need better return policy. It should not be such a hard and lengthy process. ", "rating": 1}, {"title": "Sizing guide not helpful", "text": "Date of experience: October 19, 2024", "rating": 1}, {"title": "My package never reached even though…", "text": "My package never reached even though from tracking it says delivered.BIG FRAUD!!!!!!!!!!!!", "rating": 1}, {"title": "Don't waste your money", "text": "Didn't receive any confirmation of purchase  Item is horrible cheap material. Like a cheap tracksuit  went straight in bin ", "rating": 1}, {"title": "Poor quality for the price", "text": "Date of experience: October 22, 2024", "rating": 1}, {"title": "Very poor quality", "text": "Very poor quality, bad fit and no way to return or exchange.  Do not recommend. ", "rating": 1}, {"title": "Pants are extreamly long", "text": "Pants are extreamly long.  I want to return the but you want to charge me for that.  Not acceptable!", "rating": 1}, {"title": "Obnoxious returns process ", "text": "I loved everything but it was clear I’m too short for their skirts. For the price, I don’t want to have to hem them so I opted to return. First, you have to photograph the items you wish to return- even if you’re not returning because of flaws. Then, you need to wait a day for it to be “approved”. Even when it’s approved, you get an email that directs you to wait at least one more day to be given the address to mail your returns. They purposely make it a hassle. ", "rating": 1}, {"title": "First order - disappointing! ", "text": "This was my first order.  I ordered a few things in multiple sizes to see how they fit.  Once I received my order I received an email stating final sale no returns.... That was completely misleading.  I will not recommend or be buying from this site again. Very disappointing. ", "rating": 1}, {"title": "Hello?! Is anyone in customer service?", "text": "Started a return 9 days ago immediately after I received my items due to the fit and it has yet to be reviewed so I can return these items. No response from customer service. 9+ days is unacceptable to get a response from customer service. ", "rating": 1}, {"title": "I’m not happy with the return policy …", "text": "I’m not happy with how you have to pay to return items if they don’t fit on TikTok, they do not require you to do this. Sometimes you order small items and you pay so much to ship back. It’s not  even worth it. I Don’t think I’ll be shopping anymore with this company. ", "rating": 1}, {"title": "Worst online purchase I ever made", "text": "Worst online purchase I ever made!  Not true to size, takes weeks to receive, no exchanges, and to return I have to pay the shipping, will not buy again", "rating": 1}, {"title": "Return policy is not clear and…", "text": "Return policy is not clear and misleading ", "rating": 1}, {"title": "Items took forever to arrive", "text": "Incredibly ridiculous amount of time for package to arrive. ", "rating": 1}, {"title": "cheap material", "text": "The leggings are cheap material and fall down when you walk or bend. Sorry not worth the price. ", "rating": 1}, {"title": "My pocket on my leggings has a hole!!!", "text": "My pocket on my leggings has a hole!!!! I wore them once and  realized this!!!!!!! For the cost of these I would expect better quality! ", "rating": 1}, {"title": "The fabric is not good", "text": "The fabric is not good. Looks cheap. Is not sew well. It not worth the cost. ", "rating": 1}, {"title": "I waited for about 3 weeks and I didn't…", "text": "I waited for about 3 weeks and I didn't like the texture of the fabric. The inside seam looks easy to break and is not comfortable.", "rating": 1}, {"title": "Material is too thin", "text": "Material is too thin. Wrinkles easily.", "rating": 1}, {"title": "Terrible experience ", "text": "Return entire purchase requests full refund which HALARA agees to, however it’s been weeks and they will not refund to the original form or payment they keep asking me for my bank routing number. Account number and security code to be sent to some stranger via email horrible customer service ", "rating": 1}, {"title": "Never again.", "text": "Inconsistent sizing and they charge you to send the items back, but won’t answer how much. They push you into a gift card. They are extremely non-communicative and if you don’t talk the app, no clue what’s happening. ", "rating": 1}, {"title": "SCAM", "text": "Somebody else used my email. Halara assured me it would be removed but took no actual action. The worst customer service ever and o still feel like they phished my info. Avoid.", "rating": 1}, {"title": "If you're in Canada I do not recommend…", "text": "If you're in Canada I do not recommend ordering anything from Halara unless you have zero plans to return items that did not work out. Halara does not offer free shipping on returns and there is nothing in the return policy that says returns are shipped to the USA. So not only will you have to pay shipping to return your items, but you will have to pay international shipping. ", "rating": 1}, {"title": "The pants are much to big", "text": "The pants are much to big. Did not run according to the size chart.", "rating": 1}, {"title": "Way too small", "text": "Way too small ", "rating": 1}, {"title": "Two shirts for almost 50 dollars and…", "text": "Two shirts for almost 50 dollars and the quality is cheap. This was my second attempt to like your brand, but I won't buy again.", "rating": 1}, {"title": "Run extremely small cheap fabric do not recommend", "text": "Sizing was way off I put in my measurements and couldn’t figure out what size it recommended so I ordered two sizes and both were extremely small. Didn’t realize this was a Chinese company til it took weeks to ship- that also explains the horrible sizing. Medium and large both fit more like smalls. I feel like the reviews are fake because there’s no way these fit normal sized people I’m 5’9” 150lbs and per the size chart the mediums or larges should fit me and neither did. At all. So uncomfortable. Too short, the waist has like a super tight seam at the top that digs in and is painful. And they’re made of the thinnest cheapest temu quality material. Beware. This is overpriced Chinese junk. Not at all like the photos and would probably not withstand being washed a few times. I’m returning them for a refund and disappointed that I have to eat the cost of return shipping. Learn from my mistake and get your work pants somewhere else. These are junk. ", "rating": 1}, {"title": "It took extremely long to get my order…", "text": "It took extremely long to get my order and it’s very difficult to return same ", "rating": 1}, {"title": "The package was shipped to the wrong…", "text": "The package was shipped to the wrong address and Halara support will not correct the error.", "rating": 1}, {"title": "Have not heard back on getting refund…", "text": "Have not heard back on getting refund for entire order since they will only refund to store credit. Store credit they also put an expiration on. Literally keeping your money and then making you buy more right away even with sending back the items to them. ", "rating": 1}, {"title": "My order never arrive and customer…", "text": "My order never arrive and customer service was no help. I’m out money and have no leggings. Scammed?!", "rating": 1}, {"title": "Didn’t get free pair", "text": "I bought a pair of pants that were supposed to be buy one get one free and I only received one pair.", "rating": 1}, {"title": "Inaccurate Sizing", "text": "Inaccurate SizingMaybe because I am right in between sizes, but I found my items (skirts/ leggings) didn't fit.It's frustrating because I ordered once before and sized down because again, im right at the edge between sizes and thought athleisure have some give and so sizing down made sense. That skirt was too small.So this time I went with the size chart- now it was too big. In my opinion, the size chart being inaccurate is a quality issue at best and false advertising at worst. Especially because I tried both sizes. However, customer service would not cover the shipping back so I had to spend MORE money if I wanted a refund even though the issue I was experiencing was not my fault. 3 of 5 items also had quality issues of loose threads and such.I would not buy from them again- it was a stressful process and a fair amount of money for things that don't even fit and customer service was unwilling to help.", "rating": 1}, {"title": "Overall very disappointed", "text": "The deal flashed for the flex crossover pants, buy one get one free.  Or so I thought I was getting this deal, because I only ordered 2 pairs because of the deal.I looked at my receipt after it was processed and I was charged for both pairs of paints.  I recahed out to customer support and they responded with the deal hadnt started yet...I sucked it up and waited for pants to come in the mail.  I hate them, they are way too stretchy and do not stay up, I'm constantly having to pull them up.I want to return them but now I have to pay for shipping, more money...I really like the flex high waisted wide leg jeans, amazing love them.  Totally reccomend.Order# 241003220147704585", "rating": 1}, {"title": "Difficult return process ", "text": "Difficult return process . Size and quality of garments are poor . Expensive ", "rating": 1}, {"title": "Leggings made of really thin material", "text": "Leggings made of really thin material. Runs a bit small as well. ", "rating": 1}, {"title": "I never received my package", "text": "I never received my package ", "rating": 1}, {"title": "The quality of the product was awful", "text": "The quality of the product was awful. Not at all what I expected! ", "rating": 1}, {"title": "Your coupons are useless .", "text": "Your coupons are useless .. they don’t work on anything I like…it should be allowed to work on any items I want since I’m a new customer ", "rating": 1}, {"title": "was committed to buy", "text": "was committed to buy then I left to come back later then a coupon. code was given and upon entering wasnt accepted. the pants are very expensive and grest profit margins Thought I I'd ask the team why give a 10% code for it not to work. most companies do this and it works wonders, even big retailers are nice so much issues and refused to honour it given me lectures about be wrong and think I am fibbing after this decided not to bother and go to a different company who has better customer service as so many on my feed", "rating": 1}, {"title": "Pants are not what i expected", "text": "Pants are not what i expected. The cargo pockets move toward the front and they don’t look nice. I will not wear them nor recommend them to anyone. ", "rating": 1}, {"title": "Sizing was totally off", "text": "Sizing was totally off. Items were way too big and not returnable as a final sale. Will never order here again.", "rating": 1}, {"title": "TRIED TO LIKE HALARA :(", "text": "I've tried and tried to order from halara.  1st pair of pants way too tight, so I ordered 1 size up - HUGE.  Just tried another style of pant and about 6\" too long.  Absolutely no consistency and just can't find clothes that fit.  Sadly I accepted a credit 1st time and now they won't ever give me money back.  Just credit for their ill-fitting clothes.  Don't order from Halara!!", "rating": 1}, {"title": "You material is cheap and thin", "text": "You material is cheap and thin. Online it says free returns but I have to pay for shipping. My recommended sizing that you guys gave was not accurate. Will never order from you guys again! ", "rating": 1}, {"title": "Never received my items", "text": "Date of experience: October 16, 2024", "rating": 1}, {"title": "defective product, dodgy about returns", "text": "I received two pair of size L leggings. One was at least a size bigger than the other, fabric quite stretched out with no elasticity. When I asked to return that one, I was send an email saying they would refund $22 of the price I paid, or give e a $22 coupon. So far, no coupon.", "rating": 1}, {"title": "Don’t buy these!!", "text": "The pants fit weird, and have an elastic in the waistband. Making me have a muffin top. Having a hard time figuring out how to return them and get a return label, as Halara doesn’t make it easy. ", "rating": 1}, {"title": "Neith item fit and I tried to return…", "text": "Neith item fit and I tried to return and had difficulty because I could not down load a picture of the item. I emailed many times without success in getting a return address for my items since without the pictures I was stuck. Would never buy from company again. ", "rating": 1}, {"title": "Unable to initiate return", "text": "Unable to initiate return, the return website does not recognize the order number 241011163402758993", "rating": 1}, {"title": "BAd return process", "text": "Hi!I write this comment for my order number 241006084913580044. I am really unsatisfied of the return process.First, i tried to make the return process online and something didnt work, thats why someone replied ( fast enough) by email. Second, i need to write 2 or 3 emails before i got the instruction for return.After that process, i have printed the paper that Halara needs , i finaly put in my bag and went to Post Canada. Halara ask for the tracking number which cost 42 $ before taxes for the shipping and tracking number. Its a non sense to pay about 50$ return which is not refundable for an order who cost 55 $.I am not impressed and i dont want to buy for Halara in the future. I am not happy to make that comment, i would like to say the opposite. Thank you", "rating": 1}, {"title": "Hard to descr", "text": "Hard to describe my order with any honest since I never received it. This is the second and LAST time I order from Halara because I do not receive my orders. No one tales them because someone is at my home all day. All of my other orders seem to have no trouble with delivering except Halara. I see a pattern that I will definitely not repeat again. ", "rating": 1}, {"title": "I can not get info to return", "text": "I can not get info to return.  The clothing was nothing like video. Fabric is way to heavy and very ugly", "rating": 1}, {"title": "The order took over 1 month to receive", "text": "The order took over 1 month to receive, with zero updates, I received updates because I sent emails looking for updates.. 2 of the 3 items I received are extremely long to my understanding I ordered petite lengths.. disappointed in what I received ", "rating": 1}, {"title": "Did not apply discount promised", "text": "Did not apply discount promised. Did not refund my return, sent gift card instead. Hard to contact. ", "rating": 1}, {"title": "I bought 3 pants they were all horrible…", "text": "I bought 3 pants they were all horrible quality, my cellulite could be seen through the pants that’s how thin they are. I wish I never bought anything!", "rating": 1}, {"title": "Worst return experience ever!!", "text": "Worst return experience ever!!This was the worst experience I have ever had returning items. Having to go through the email, then the website 3 times, not having a phone number to call, then having to go back to the email 2 times, to then print something off. This would prevent me from thinking about buying from Halara in the future. Period!If you are trying to make it as hard as possible to return an item, you have succeeded. If you were sold a \"process\" by a web developer, they are hurting your business.", "rating": 1}, {"title": "Products are low quality", "text": "Products are low quality, but unlike other Chinese companies, they are priced too high. But when it comes to return, they would not take the product back for a full refund, thry will charge you all the different ways to return the third of what you paid. Stay away from this fraud", "rating": 1}, {"title": "I did not receive my order", "text": "Date of experience: October 22, 2024", "rating": 1}, {"title": "The leggings rolled down immediately", "text": "The leggings rolled down immediately. I ordered the right size and yet they rolled. I contacted the company for a refund since I don't want an \"instore credit\",  I have to pay for shipping. I will never order anything from them again. ", "rating": 1}, {"title": "no exchanges - returns charge fee", "text": "it sucks when you try out a new brand, wait 3 weeks for the items to arrive, and then have no way way of exchanging for a different size without paying a fee for being too big to fit into a standard size.", "rating": 1}, {"title": "The order arrived a month later", "text": "The order arrived a month later. Given the logistics nightmare, I won’t bother trying to return the items that don’t fit me. ", "rating": 1}, {"title": "Wouldn’t order again", "text": "Takes way too long to get items and your return process is so not customer friendly. The back and forth emails to do a return is ridiculous in this day and technology. My sense is it’s your way of punishing a customer for returning items and not exchanging them. Do better!", "rating": 1}, {"title": "It’s too big even it’s petite size", "text": "Date of experience: October 22, 2024", "rating": 1}, {"title": "Ordered petite", "text": "Ordered petite. Even though they are marked petite, they are not. The return process needs some fine tuning. My return form will not print because of a virus. I have had to print all info on this return, order, conversation' etc.  You have customer phone line to talk to a person.  I want my return credited to my account.", "rating": 1}, {"title": "Very disappointed! ", "text": "I have been waiting for my order for a long period of time and then it said that it had been delivered to a safe place, however I have not received it at all.  I am still waiting for an outcome from the support team.  I am a very disappointed customer. ", "rating": 1}, {"title": "I was not happy that the company does…", "text": "I was not happy that the company does not provide return labels, therefore having to return a 60$ item and the label costs 30$ is unacceptable. The company needs to follow other companies policies on returns. Its an unfair practise. I wont be ordering from here again.", "rating": 1}, {"title": "The size is not consistent and most of…", "text": "The size is not consistent and most of all shipping was way over 10 business days. I needed this for travel and I’m still waiting on some items that were ordered Oct 8th -", "rating": 1}, {"title": "Unimpressed with Customer Service ", "text": "My items were too big and needed to return. The return process is terrible and can not get an actual response. Everything is computer generated. Also, having to pay for shipping to return my items is also a huge issue. I will never purchase from HALARA again, dut to that reason alone. ", "rating": 1}, {"title": "I have not received my item", "text": "Date of experience: October 14, 2024", "rating": 1}, {"title": "Kept waiting for several weeks ", "text": "Kept waiting for several weeks Before ver priced wrong colour", "rating": 1}, {"title": "Size is too much big", "text": "Size is too much big ", "rating": 1}, {"title": "Order took one month to come in and is missing items", "text": "My Order took about a month to come in and when it did arrive, it was missing two or three items. I am still waiting to hear back about those items that are missing.", "rating": 1}, {"title": "Shipping took a while due to a pre…", "text": "Shipping took a while due to a pre order- sizes are slightly small and fabrics are slightly less quality than expected ", "rating": 1}, {"title": "Bad bad bad bad", "text": "Bad bad bad bad ", "rating": 1}, {"title": "Disappointed with the quality and the…", "text": "Disappointed with the quality and the deception around making a return. Witholding the return details in return for offering a credit is not the way a British company would be allowed to operate. I should have been able to return at reasonable postage to a UK address when the item was too small.", "rating": 1}, {"title": "The shipping took forever", "text": "The shipping took forever. I paid for expedited shipping and my products still got here after the event I was going to wear them to. I reached out to their service department for support and have yet to hear back.", "rating": 1}, {"title": "Sizing is very inaccurate.", "text": "Date of experience: October 21, 2024", "rating": 1}, {"title": "Item did not look anything like the…", "text": "Item did not look anything like the photo", "rating": 1}, {"title": "Clothes are poor quality, color didn’t match the photos, sizes run small ", "text": "Clothes are poor quality. Color didn’t match from photos and the clothes run small", "rating": 1}, {"title": "Shein quality without shein prices", "text": "Shipping is slow. Product is cheaply made and overpriced. Returns process is a pain.", "rating": 1}, {"title": "I’ve been trying to return something…", "text": "I’ve been trying to return something for several days and it has been a nightmare. I noticed I finally got an email from y’all so I will check it out and see if it gives me help as to how to return my merchandise", "rating": 1}, {"title": "Disappointed with after sale support ", "text": "Disappointed with after sale support. Is a size 10 a medium or large ? Take your chances. No exchanges. Return shipping not included.", "rating": 1}, {"title": "The quality was not what I expected and…", "text": "The quality was not what I expected and I would like to return both items however they are final sale - which I did not realize before purchasing. ", "rating": 1}, {"title": "Disappointed ", "text": "Love my jeans , ordered trousers and can’t seem to return so that’s why I’ve given 1*No record of my orders online on website /app I ordered from , disappointed as love the products and wanted to order another size , but won’t be using them again ", "rating": 1}, {"title": "Delivery time too long", "text": "Delivery time too long - ordered these pants on 9/11 received on 10/20 - ridicules ", "rating": 1}, {"title": "I ordered a two for one offer", "text": "I ordered a two for one offer. Only got one pair, every time I try to message, they’re too busyVery disappointedVery bad service ", "rating": 1}, {"title": "horrible smell on clothes", "text": "horrible smell on clothesthere it all away ", "rating": 1}, {"title": "Took forever to get shipment", "text": "Took forever to get shipment, return process is a pain- the automated system says my order # doesn’t exist - send a refund label with your produce. ", "rating": 1}, {"title": "This is a scam and they take no accountability ", "text": "I did not receive my order although it states it was delivered! The chat isn’t a chat it’s just an IA auto response. They claim they aren’t responsible for the missing item and to follow up with the carrier. The carrier number I was given was discontinued. So basically I paid for an item I never received and Halara takes no responsibility, NEVER order from this company it’s a scam! ", "rating": 1}, {"title": "I never received my order and this…", "text": "I never received my order and this company does nothing for you to help remedy the situation. Their sizes are also inconsistent. Sadly Would not recommend this company. They have cool products but service is no good. ", "rating": 1}, {"title": "I never received my order ", "text": "I never received my order and when I went to look to see if I could at least get my money back it said I was liable if I didnt get it. I dont recommend. ", "rating": 1}, {"title": "Products are fine", "text": "Products are fine, The low rating is for the fact that their return process is horrible. They make it very hard to return items.  not only do they make you pay for your return..it up to their discretion whether they want to accept the return or not. The links for the return address are sketchy as well. ", "rating": 1}, {"title": "Difficult Refund Process & Understaffed Support Team", "text": "This review is for the High Waisted Work Pants, size 2X in gray and black AND my experience with Halara Support. I'm 5'2\" and bought these pants for a new job. I typically wear a 1X or 2X and used the Halara Size Guide to select the 2X size. Despite being $40 each, the pants I received were made of an extremely cheap polyester and would need to be hemmed at least four inches in order to fit me. After finding it impossible to initiate a return on the Halara website, I emailed support on 10/9/24. In response to my email, I was sent an unresponsive link to initiate a return. I then spent 25 minutes in Chat Support with a clearly overwhelmed team member who was able to eventually email me a return label despite her saying it would originally take her 24 hours to do so. On 10/11/24, I spent $4 on packaging and mailed the pants back to Halara via UPS. On the 17th, Halara Support emailed me and stated they needed a tracking number before initiating a return. I attached my UPS receipt and on the 18th they stated they initiated a refund of $89.90 to my card. It is now 10/22/24. The refund that is still processing to my account is only for $82 despite Halara support stating that the refund would include the cost of the shipping label. This also doesn't account for the $4 I spent on packaging. In total, I've wasted over $93, 25 minutes over chat, and hours on emails to wait 9 business days to MAYBE receive a partial refund. I do not recommend that you purchase anything from Halara. ", "rating": 1}, {"title": "I've been trying to return the items I…", "text": "I've been trying to return the items I need to return and am getting no where. Very frustrating", "rating": 1}, {"title": "NEGATIVE", "text": "I have ordered so many times now that it is ridiculous. All I wanted was a skirt that fit well and that is not what I received. The clothing is overpriced for how cheaply made it is. The skirts are all sized weird and do not match the size charts. Some of the items came slightly damp feeling. And now I am having to pay for shipping to return a couple items. Just an overall bad experience.", "rating": 1}, {"title": "Items not what I expected. ", "text": "Ordering and shopping were all fine but the product was not what I was expecting based on the pictures. ", "rating": 1}, {"title": "I’m so sad because I can’t use 2 pants…", "text": "I’m so sad because I can’t use 2 pants but this is the problem buying by internet. That’s not fear I spend $180 and I just use 3 🤦‍♀️ each pant $60 😔 too expensive.Sport but I never buy in your store ", "rating": 1}, {"title": "Are you kidding", "text": "Are you kidding? My package was never delivered and I haven’t been refunded or sent my outfit.", "rating": 1}, {"title": "Its big", "text": "Tooo bigg wate of money i want a refund ", "rating": 1}, {"title": "The material in the photo was very…", "text": "The material in the photo was very deceptive. Low quality. Does not look like photos. ", "rating": 1}, {"title": "Price is too high  according to product…", "text": "Price is too high  according to product quality  ", "rating": 1}, {"title": "I just spent about an hour using the…", "text": "I just spent about an hour using the customer service chat. The first person I was connected to took about 15 minutes between each response to get back to me and when disconnected from me submitted the incorrect items for return. The second person was much quicker and was able to get all the correct items on the return but it was a large waste of time. I would appreciate a phone call option as this was a simple customer service need that could have been a 10 minute phone call instead of and hour back and forth chat that I could use my phone to get other things done during or risk getting logged out of the chat.", "rating": 1}, {"title": "Disappointing Company", "text": "My order took over a month to arrive, and when I tried to return a few items, the process was unnecessarily complicated. I had to \"request\" a return, and instead of providing a return label like most companies, they told me they were \"looking into it.\" And now I have to call the company to try to resolve this. I'm extremely disappointed by how difficult it is to make a simple return. I do not recommend Halara.", "rating": 1}, {"title": "I need to make a return and I have to…", "text": "I need to make a return and I have to submit a picture? Very inconvenient ", "rating": 1}, {"title": "trying to sign in is becoming a…", "text": "trying to sign in is becoming a nightmare.I need to return my purchase and I keep going in circles to sign in with your site", "rating": 1}, {"title": "Terrible customer service ", "text": "The order is missing and I am getting the runaround from customer service. I requested a refund and wound up having to report it to PayPal", "rating": 1}, {"title": "I ordered 2 leggings for the price of…", "text": "I ordered 2 leggings for the price of 1. I only received 1 legging. ", "rating": 1}, {"title": "The order was incredibly delayed and smells.", "text": "First and last time ordering from here.The order was incredibly delayed.The quality is awful and very, very cheap.And to top it off my jeans smell like moth balls.I will never be buying from here again.Do not be fooled by the influencers pedalling this garbage.", "rating": 1}, {"title": "Definitely doesn't fit well", "text": "Definitely doesn't fit well. Tiny waist-- I ordered up two sizes based on the measuring chart. Huge legs in pants and very short length. Will only look good on you if you're very thin.", "rating": 1}, {"title": "Your leggings are really poor quality", "text": "Your leggings are really poor quality - paper thin. And you don't even provide a shipping label to return them, I have to pay for returns and pay for tracking myself. I'd never buy from Halara again. ", "rating": 1}, {"title": "never received my order it was…", "text": "never received my order it was \"delivered\" at 07:47 am? to who? what a scam  ", "rating": 1}, {"title": "Ordered 2 skirts  they are to…", "text": "Ordered 2 skirts  they are to small,very small correspondence with them has been very unprofessional, very disappointed,they make themselves out to have excellent customer service,clearly this is not the case,will never purchase from them again,I feel duped ", "rating": 1}, {"title": "Trash xxxxxxl", "text": "Trash xxxxxxl! OMG, I paid €63 for two jeggings, but the fabric is very cheap, and the model doesn’t even come close to what was shown in the pictures. The quality is even worse than Temu's. At first, I thought it was an American company, so I assumed the price and quality would be okay, but that couldn’t be further from the truth. I think all the good reviews are fake as well. I’ve been scammed, and returning the items is even more difficult. I've now lost €63 for nothing. Never buy anything from this Halara shop! It’s made in China, but the price was way too high for the quality I received!", "rating": 1}]