[{"title": "Got shipping address WRONG ", "text": "Got shipping address wrong. Hopefully caught in time!", "rating": 1}, {"title": "Tongkat Ali capsules", "text": "I’ve been taking the Tongkat Ali capsules and so far I haven’t noticed any difference. I’m not sure if this stuff is legit or a scam or if I just need to take them for a longer period of time. I’ve been taking it for about a week or so, but will continue to take it for a longer period of time as directed to see if any Thing actually changes and if I feel a difference. ", "rating": 1}, {"title": "Disappointed", "text": "I sent an email about how to receive free gift based on an email sent by LEH to me haven’t heard back. Also sent quite some time ago about guarantee on pine pollen and 3 tbls morning wood deal never heard back on that, however I do get regular emails about buying your products, as a company you might want to address that.", "rating": 1}, {"title": "No response from Logans family i.e. his support staff", "text": "Order # 861998 on 27th April - Have been chasing on my shipment with no updates on route or USPS, LEH has not responded to my query whether or not if I will receive my shipment. Even the route packaging is billed when it should be under buyer protection. Very disappointed with their service. Last option would be to fill out the refund form.", "rating": 1}, {"title": "Pine pollen has done NOTHING after a…", "text": "Pine pollen has done NOTHING after a week of mega dosing, except interrupt my ‘well-functioning’ sexual response.  It tastes terrible, hasn’t given any boost in energy, better sleep, or anything else the other ‘reviewers’ state it does.  I will not be purchasing any more, nor recommend it to anyone.  Like all the ads for this kind of stuff, this was a great way to get $25 from me- I’m ok with that- without any results.  Goodluck to anyone who thinks this is working for them:)", "rating": 1}, {"title": "I never received what I paid for, but Empire made it right.", "text": "I never received what I paid for. Actually, I have received nothing. Very disappointed.However, I am happy to report that Lost Empire reached out to me immediately upon seeing my review, called me directly, and arranged to send me a replacement at no additional cost. Their response shows me that these folks are trustworthy and serious about earning people's business. I am looking forward to share my results.", "rating": 1}, {"title": "Bad company", "text": "I placed an order with Lost Empire for Reishi mushroom, in December 2023 I received an order in a small bag with an expiration label of April 2023, the product is sold quite expensive but I did not buy it on Amazon because this company states that they grow their own natural products, but when I read the label it says: made in China. It is terrible. I do not recommend you to put your health and your money with this company I am really disappointed.", "rating": 1}, {"title": "Purchased Cistanche sporadic tincture…", "text": "Purchased Cistanche sporadic tincture and have had zero results of any kind. Don't know why but the powder works great for me. Everybody's body is different so I must not absorb this type of tincture well", "rating": 1}, {"title": "I attempted to do an online order and…", "text": "I attempted to do an online order and to no fault of lost empire herbs I couldn’t get it together.   It’s my in familiarity with the procedure that was the problem. I intend to call the order # Monday after the Thanksgiving Holidays to make the purchase. Thank you!", "rating": 1}, {"title": "Asked about any herbs that might help…", "text": "Asked about any herbs that might help with feet getting warm and toes get stiff at nightspoke about maybe from diabetes or gout was not happy with the replied  they reference they cannot make recommendations for medical conditions yet they talk about herbs for ed and other conditions maybe they want you to keep buying herbs without advice does not make sense to me really disappointed I buy alot of the product", "rating": 1}, {"title": "You sent an email yesterday stating I…", "text": "You sent an email yesterday stating I had to make a purchase before midnight and I would get a free $375 gift, I placed an order but have not received any word on a $375 gift. I will never purchase from you again as this feels like I was scammed.", "rating": 1}, {"title": "I recently ordered the tongkat ali on…", "text": "I recently ordered the tongkat ali on your website, and I must say I was excited to try it out. However, my experience with this package has been less than ideal. It has been a week since I ordered the package, and it has not arrived yet. I understand that shipping delays can happen, but it's frustrating not to have an update on its status.", "rating": 1}, {"title": "I first tried the pine pollen tincture…", "text": "I first tried the pine pollen tincture which had no effect.  Thinking maybe actual pine pollen would be better I tried that.  Unfortunately either has had no change. Sorry but I can't give this a good review", "rating": 1}, {"title": "my order number is Order #869919 and i…", "text": "my order number is Order #869919 and i got my order all damaged.the black rapper was torn in peices and in side plastib bag it was open and the powder was all over place.i sent a complanit through ur website but i did not get any answer.i m not using this powder as it was all over and i dont know if someone has mix something in it.pls tell me what should i do?whenever i call my call is going to answering mechine.i m ur 1st time buyer and not happy at all", "rating": 1}, {"title": "Have been with you a long time try to…", "text": "Have been with you a long time try to make an order you don't  remember my email address last 2 orders over the phone,why?", "rating": 1}, {"title": "Shilajit was extremely hard", "text": "Shilajit was extremely hard. To the point it almost broke enclosed spoon. Worst experience I've ever had with  Shilajit and won't be purchasing again", "rating": 1}, {"title": "I can not use the pine pollen", "text": "I can not use the pine pollen. I AM allergic to all things pollen. To make matters more frustrating I am female and don't need \"morning wood\". I was looking for something to help with hair loss.", "rating": 1}, {"title": "WHAT A SCAM", "text": "I'd give a minus 5 if possible. I purchased the hammer what a joke!!! This crap doesn't work like not even a little bit. An tastes like dirty Ass!!! Don't waste your hard earned$$$ Very disappointed😢😢😡😡😡", "rating": 1}, {"title": "You guys should have a disclaimer…", "text": "You guys should have a disclaimer because there may be guys like me that your product doesn't work on. it actually doesn't taste bad. I sure wish it would have worked.", "rating": 1}, {"title": "No customer service Chinese product", "text": "I placed an order they shorted my order. I contacted them sent a pic of what I received. They went silent and wont answer emails.Their product is from china had I known that I would have never ordered from them. They still owe me a refund.", "rating": 1}, {"title": "Try to contact customer service to…", "text": "Try to contact customer service to correct my address on a recent order and no one every picked up or contacted me to address my issue. ", "rating": 1}, {"title": "No customer services", "text": "No customer services, I have called 19 times because I made a mistake on the order I still have not spoke with anyone.", "rating": 1}, {"title": "Service was absolutely horrible and…", "text": "Service was absolutely horrible and there where any discounts what so ever ", "rating": 1}, {"title": "Sent to incorrect address", "text": "Package was not sent to correct address. Never received the package that I paid 60 dollars for...", "rating": 1}, {"title": "When I tried to place a order", "text": "When I tried to place a orderIt would not let me put Groves in with my shipping,this name has be on my orders as this is the drop of point for me to pick my order upGerald Howard Groves 204 N. Main ST.Plentywood,Mt. USA59254", "rating": 1}, {"title": "I didn’t feel any difference taking…", "text": "I didn’t feel any difference taking either Pinepollen ghost tincture or a regular one,so I will just continue to end it and continue with the regular Pinepollen powder.", "rating": 1}, {"title": "Did nothing at all", "text": "Did nothing at all. Wonder if all the good reviews were real. Should have researched a little more before I tried this.", "rating": 1}, {"title": "DISAPPOINTED", "text": "I thought I did review this, but I am very disappointed. I took the whole bottle for 30 days and seen no results!", "rating": 1}, {"title": "doesn't work", "text": "doesn't work any better than the other scams out there", "rating": 1}, {"title": "Sleep formula Spagyric tincture didn't…", "text": "Sleep formula Spagyric tincture didn't do anything for me.", "rating": 1}, {"title": "Your site was terrible to deal with", "text": "Your site was terrible to deal with! I tried three times to purchase and gave up,had to go back to it.", "rating": 1}, {"title": "I used the sleep tincture and it was a…", "text": "I used the sleep tincture and it was a disaster for me.  Ended up in ride to ER. IF Someone doubts the power of herbs don't. They can be very strong", "rating": 1}, {"title": "Even 3 tablespoons a night didn't do a…", "text": "Even 3 tablespoons a night didn't do a thing!", "rating": 1}, {"title": "Have not received item", "text": "Have not received itemHave checked mail and other places that item could be placed and do not have it", "rating": 1}, {"title": "I never received my order", "text": "Date of experience: May 05, 2024", "rating": 1}, {"title": "The products l tried were great", "text": "The products l tried were great. Promised not to sell your information, but failed, got a solicitation for computer privacy.Tried to unsubscribe, link would not work. After requesting “no more emails”, 3 times l get this survey. Someone does not respect our privacy. Thank you Callie W.", "rating": 1}, {"title": "Unsubscribe?", "text": "The \"unsubscribe and manage my subscription\" link does not work from their Email.Seems kind of shady to me. Never gonna buy from these people!Tried many time for many days.... and you guys say \"At the moment\", rest my case....", "rating": 1}, {"title": "Did not effect any effect", "text": "Date of experience: February 08, 2024", "rating": 1}, {"title": "Snake oil is the only way to describe…", "text": "Snake oil is the only way to describe everything I have tried from this company. I can see a few items not working or maybe a few working but nothing has done a single thing that it was advertised to do. Just a bunch of overpriced plant junk that is worthless and who knows what damage is doing to your health.", "rating": 1}, {"title": "Have not received my order yet!", "text": "Date of experience: March 13, 2023", "rating": 1}, {"title": "I cannot say with any confidence that…", "text": "I cannot say with any confidence that this product does anything at all. My energy levels have been the same with or without this powder. I have tried this at different times of day, drinking it on it's own, mixing it into various smoothies and teas, trying different dosages. I wouldn't recommend this, especially at this price point.", "rating": 1}, {"title": "Is negative zero stars an option?", "text": "If I had the option to give zero stars or even negative, I would. COMPLETE WASTE OF MONEY.  Incredibly disappointing products. I have tried the products (black ant extract and ashwaganda) for over a month with absolutely none of the promised results. In fact, I don’t feel different at all. I wouldn’t waste your money or your time With these rip offs.", "rating": 1}, {"title": "No improvement", "text": "Have not noticed anything no improvement", "rating": 1}, {"title": "I tried the pine pollen capsules", "text": "I tried the pine pollen capsules, took the capsules as directed 3 in the am 3 in the evening. There was no morning boner as I had read about from others that had taken the capsules.  I'm going to try the liquid.  I was told to give it time 4 weeksnothing. So sorry, I was hoping for the best and got nothing. for those of you thathad success I wish that could have been me.  No one offered me a refund aftertwo phone calls", "rating": 1}, {"title": "My order #LEH725982 was only partially…", "text": "My order #LEH725982 was only partially shipped.  I sent 2 emails that I had not received the missing nettle root or the Tongkat Ali.  Zuleika Curutan on 5/4/20 replied the missing items would be shipped ASAP.  I have still not received them. I DID receive the other items in the package as I explained in my email, but not the entire package.I have been ordering from your company for years and am disappointed that a quicker resolution has not been made.Frank Lewandowski", "rating": 1}, {"title": "I ordered 2 bottles of the…", "text": "I ordered 2 bottles of the much-promoted pine pollen from the lost empire. The package arrived in the mail with 1 bottle completely smashed at the bottom. I threw it away and was left with one bottle. Upon examination, I discovered that the box did not have any protective shield inside to protect the bottles. That is very poor shipping practice to Canada. I had written an email about this and no response or complimentary bottle given. That is very poor customer service.", "rating": 1}, {"title": "Damaged good !!!.", "text": "The bottle of Stag Swag had the dropper broken in pieces inside !!!. I called and write many times and I got no answer in what to do with it !!!. So what else could I say but Thank you for being of no help !!!.", "rating": 1}, {"title": "Order was wrong", "text": "Order was wrong !  Missing items from order!  That I was charged for! Powder instead of tincture! Paid for overnight shipping to insure I would receive it before I left town. Instead I got 2 day shipping. So it sat in a mailbox in Las Vegas summer heat  for  over a week! Not what I paid for!", "rating": 1}, {"title": "Poor Customer Service", "text": "I sent an email to them requesting not to send invoice with the shipment since it is meant to be a gift. I did not get ay response to my email and they sent the invoice with the shipment anyway. Poor customer service.", "rating": 1}, {"title": "Change in product. Phone number is NO Longer in Service", "text": "As of 15 October, their contact phone number is disconnected/\"not in service at this time\"I'd previously ordered one of their products on amazon numerous times. After the product worked well, decided to order the same product directly from the company. OOPS. the new lot of herb is DISGUSTING and I am unable  to consume it. In order to get a refund, I emailed twice and received no reply. I called the contact phone number on the website and their facebook page. Disconnected/No longer in service. I will be filing a claim with my bank today, and allow them to handle it from here.", "rating": 1}, {"title": "BROKEN BOTTLE OF TONGAT ALI.", "text": "I received my package but was very disappointed to find that the bottle of Tongkat Ali was completely broken and all the capsules were spilt in the shipping box. They were not salvageable as the glass bottle was shattered with pieces of glass everywhere. I had to fly out in the morning and was unable to get the benefit of the supplement. The packaging was not satisfactory as the bottle was not wrapped or secured for shipping. I am hoping that a customer service personnel of Lost Empire Herbs will call me and address this situation. CliffR", "rating": 1}, {"title": "Delivery failed and refund is taking forever", "text": "I bought pine pollen tinctures but it didn’t reach my address here in Oman. I waited for one month then they said USPS has sent it back to Lost Empire because they can’t ship liquid by plane. So I ask for refund of my $146-. Their system should have not accepted my order in the first place. They should know this already. Another thing, they said they refunded my money dated Jun 23, 2018. Until know it didn’t appear in my account it’s already July 11, 2018. I am totally disappointed with what happened to me. I could totally give -5 as my rating here.", "rating": 1}, {"title": "They spam you in to oblivion if you buy…", "text": "They spam you in to oblivion if you buy anything. EDIT: Not only do they spam you, but after you unsubscribe, they keep adding you back to additional lists after a week.", "rating": 1}, {"title": "Go figure, makes no sense.", "text": "All  received was an answering machine and nobody returned my call. Maybe your move was not such a good thing to do. This was unlike my previous experience. So sorry, it’s true. Maybe I’ll try again, it just left a bad taste for me.", "rating": 1}, {"title": "Good herbal products, really poor customer service", "text": "Update: As per their response, I have received email about refund. But no refund and it has been over 10 days. Payment was via PayPal. It shouldn't take more than couple of days. Why on earth did I ever order from them!—---------------------------------------I purchased ebooks, but didn't find them to be satisfactory. Raised refund request, no response in 2 weeks. Sent email, no response. The refund guarantee is a fraud. I am reasonable.. I have used other products and never requested a refund unlike many who try to exploit the guarantee. But false guarantee and poor customer service just don't sit well with me.", "rating": 1}, {"title": "Product on Hold", "text": "I have been ordering products from the US for over 2 decades and have never had any problems. I placed an order, and it was put on hold, for no reason. After I had sent an Email asking why my product was not shipped within 2 days, they said they needed to speak to me on the phone. Why? Is this the 1990s? You have gotten my money, you have my US address, why do we need to speak at all? I am an overseas client my timing is different and it costs alot of money to make overseas calls. They canceled the order and refunded. I ordered again and this time had a different billing and shipping address, they still put it on hold. I called them to \"verify\" the addresss even though I dont know why they are doing this. And now my second order is still on hold.", "rating": 1}, {"title": "Did not have a good experience with my…", "text": "Did not have a good experience with my first order from Lost Empire Herbs as the order never arrived (international - Australia).To be fair that is beyond their control however their customer service has been unhelpful and they have not resolved the matter at all three months later.They dispatched and shipped the order quickly but then according to tracking it is still languishing in Chicago. Was advised to “wait” and then to “contact my local post office”.I acknowledge that occasionally items do get lost but in the rare instances that has happened to me it has always been resolved satisfactorily and with great customer service  by the seller, not “unfortunately, there is nothing we can do at this time”!", "rating": 1}, {"title": "Well the problem with the reviewers…", "text": "Well the problem with the reviewers telling stories but are they telling the truth or made it up. I can not trust the internet with a lot of misinformation going on so it is too damn hard to believe.", "rating": 1}, {"title": "This substance caused me to hemorage…", "text": "This substance caused me to hemorage from my nose and bleed excessively.  I had to go to the emergency room and get in cauterized to stop it. So no, my review will not be a good one.", "rating": 1}, {"title": "I have ordered the phoenix formula (3)…", "text": "I have ordered the phoenix formula (3) and i have been taking it for 2 weeks now . I have been taken 2 tst per day and so far nothing . I don`t feel the energy or vigor that you have promise . I am trying another bag but no hope so far . I am very disapointed .", "rating": 1}, {"title": "Hello", "text": "Hello, I have ordered from the website and there was an error in the website and I emailed you in your other email and they said there is an error on the website so I had to cancel it. I ordered again but the error is still there and I paid by PayPal but I still haven’t received any confirmation about my order and I would like to know the process of my order because it is still on pending status. I really would like to try your product but if the customer service is bad it makes me put it into consideration and might cancel my order I’m trying to reach your from many places like Instagram and your other email but no one is responding! Please let me know ASAP! Order #739797", "rating": 1}, {"title": "I cancelled my auto renew each month…", "text": "I cancelled my auto renew each month over a week before it was scheduled to go out. I called twice and yet you still sent it to me. It wasn't labeled on the shipment who it was coming from so I opened it. So for the last time Cancel！！！！！", "rating": 1}, {"title": "My very first order was lost in the…", "text": "My very first order was lost in the mail. Even though I emailed that you had the wrong shipping address right after I placed the order. i put in the right address. After placing the order I saw that the address changed. You sent it out anyway. It took two weeks to finally get my package. I want to order again because although you are a little expensive, i liked the product but I am reluctant to place a big order and have it lost in the mail again, and then have to go through this whole email crap that seems to last forever. You cannot talk to anyone at your company. They think they are saving money but in reality, you are pissing off your customers and are losing business due too  the lack of any customer service.", "rating": 1}, {"title": "Still have not received order #743900…", "text": "Still have not received order #743900 placed on12/6/20 !! Eighteen days seems like a long time for shipping even for the Holiday Season. Phone calls not returned and already out of product.Terry Wall702-581-7938", "rating": 1}, {"title": "The pine Pollen did nothing for me", "text": "The pine Pollen did nothing for me. I called back a couple of times and it was the same message after New Year, Be back after January 4th and called again same message and just gave up.  I one called back ever", "rating": 1}, {"title": "I did not receive the shipment of the…", "text": "I did not receive the shipment of the order I did not want it's been over week now and I need to return this back asap. Because it wasnt what I needed", "rating": 1}, {"title": "Your selling part seems to work ok but…", "text": "Your selling part seems to work ok but have called your number 3 times and emailed you 3 times for information on ed treatment and have received NO RESPONCE AT ALL . HOW WOULD YOU RATE THAT TYPE OF REPONCE?", "rating": 1}, {"title": "In the beginning I was very excited…", "text": "In the beginning I was very excited about trying your products but after two weeks of cycling your products as recommended I have found nothing has changed. Now I find myself reluctant to try any of the other products which is very disappointing after my initial excitement after finding your website.I have about half a bottle left and will finish the bottle hopefully seeing some results. I am new to your products so maybe it’s my inexperience. I will try other products on your site because I understand results can be a process and not an event. So with fingers crossed I will finish my bottle and go from there. Just have to say guys I love the passion you have for your products and helping people. Keep up the good work.", "rating": 1}, {"title": "The website won't process payment on…", "text": "The website won't process payment on the same card I've been using in the past and the funds are available in the account I have sent this message to your website twice still have not received an answer", "rating": 1}, {"title": "Customer service sucks", "text": "Customer service sucks. They are very slow to respond to emails, if at all but they are sure you get plenty of company spam. They blacklisted me when I refused the package due to lack of response on their part.", "rating": 1}, {"title": "The product I ordered were a lot…", "text": "The product I ordered were a lot smaller than what I ordered. I compared it to the same bottle from a different company and I will not order from this company again nor will I be recommending them", "rating": 1}, {"title": "No Free Sample :(", "text": "Was told I would get a free sample of bee pollen but none showed up with the order.  Other than that is was a good experience.  I don't how to reply to your question big guy.  Email me please.", "rating": 1}, {"title": "After a month still waiting for my order…", "text": "A month ago I ordered several products in your shop.Mostly these arrive within 2 weeks.Unfortunately I am still waiting.For your in comparison high shipment costs that is too bad.", "rating": 1}, {"title": "I am sorry but I will put this on…", "text": "I am sorry but I will put this on facebook once a week .Warning Warning To all Canadian buyers be careful . I bought the phoenix formula (3 bags) it cost me 120$US = 151$CDN and they send me 2 placebo bags out of 3 and they tell me sometimes it takes time to be effective . Well nothing happen all their beautiful words are for nothing . I lost 151$ plus on top of that it is not secure for your credit card . I had a 6500$ fraud on my credit card . So for me my experience with Lost Empire Herbs cost me 6651$ and no benefits . I hope my message will be seen so that all Canadians who think that their herbs will change their life well think twice because it`s not working .Unless you replace those placebo bags .                                              Andre", "rating": 1}, {"title": "My name is Albert Roman I'm 60 years…", "text": "My name is Albert Roman I'm 60 years old I've been trying the pine pollen capsules for a little over 3 weeks now along with the ashwagandha.how to be very truthful it does not seem like they are working at all I actually find myself more tired more lazy sleeping a lot more maybe it's just me but these products are not doing anything for me I'm trying to find a very good product to give me energy and to help me also in the bedroom what that little boost but these products are not doing anything I still have some left I'm going to finish them off I will let you know at the end of the product thank you I will say that the customer service for Lost empire is very very excellent I don't doubt that some of these products don't work but these products are just didn't work for me", "rating": 1}, {"title": "Thor hammer is not affective as…", "text": "Thor hammer is not affective as described in the Product description, I took this for 3 weeks with zero affects. Strange to hear about the reviews posted here if it really works.", "rating": 1}, {"title": "Nothing worked and blamed it on my body.", "text": "Date of experience: March 02, 2023", "rating": 1}, {"title": "You keeping saying spend over $100 and…", "text": "You keeping saying spend over $100 and I get free shipping !! Yeah right ! All my orders are over $100 and yet I’m still paying for shipping .. so please concentrate on that !!", "rating": 1}, {"title": "Absolutely no effect whatsoever from…", "text": "Absolutely no effect whatsoever from your \"Pine Pollen\" product, after a month of consistent use. I will continue to stay with it, but so far no noticeable effect.", "rating": 1}, {"title": "Bought Pine Pollen Powder.", "text": "Bought Pine Pollen Powder.Consumed according to instructions.ZERO results.Responding to your reply:How do I proceed with other alternatives.No instructions on how to reply!", "rating": 1}, {"title": "Placed my order 10 days ago", "text": "Placed my order 10 days ago. Still haven't received it. Tracking hasn't updated and shows carrier is still waiting for the package.", "rating": 1}, {"title": "Ludicrous shipping plan. Absolutely ridiculous!", "text": "It’s been 20 days since I ordered product. Every order have been long time waiting to receive. But this time is just ludicrous. WHY? Because I ordered product on 8/10/20, after 10 days I Sent emailed cause I had no tracking info no product no nothing except empty pockets cause LEH got my money. So I Called left messages about my order, STILL NOTHING! Here its 20 days later No call back! no refund! no product ! no tracking info! no nothing.! Now I am a benefit-of-the-doubt kind of guy. To write a review like this means previous steps has been taken already. How far do I have to take this matter? While LEH IS INVESTING MY $160,00, (And yes it’s only 160.00 I’m concerned about but it’s mine) I’m left with no dignity, no product, no money as a LOYAL customer. I thought, and spoke highly about LEH PRIOR to this present experience. CONTEMPLATING MY NEXT MOVE!", "rating": 1}, {"title": "I purchased Pine Pollen and Thor’s…", "text": "I purchased Pine Pollen and Thor’s Hammer capsules recently, but I have not experienced any change thus far. How long does it usually take to start working? Thanks", "rating": 1}, {"title": "Did not work for me..", "text": "Did not work for me... Product did nothing", "rating": 1}, {"title": "This is a poor review due to lack of communication.", "text": "This is a poor review as I've been waiting for this order for more than three weeks! If I don't get it soon, I will stop buying from you.", "rating": 1}, {"title": "I could not tell any difference or…", "text": "I could not tell any difference or change. And was the grain alcohol required to make this stuff work?  The service and timelyness of delivery was fine.", "rating": 1}, {"title": "Honestly I am very disappointed in the…", "text": "Honestly I am very disappointed in the product.  I did the tincture pack and did not notice any difference Between taking them and not taking them", "rating": 1}, {"title": "No book.", "text": "Dont get this, spend good money on a book, it never arrived, no response from the owner of the website.do not buy from these guys.", "rating": 1}, {"title": "No results after 2 weeks", "text": "Date of experience: November 08, 2022", "rating": 1}, {"title": "Did not notice anything at all,zero…", "text": "Did not notice anything at all,zero nothing it is totaly useless to me.was a total wast of my money,sad to say you got paid i got nothing !!!!!", "rating": 1}, {"title": "Ordered my herbs but still not…", "text": "Ordered my herbs but still not delivered after a month. Seemingly unconcerned when checked with the staff，now looking into how to cut loss.", "rating": 1}, {"title": "Albizia power", "text": "I gave only 1 star for Albizia power  because I can't drink it. I tried juice and smoothie but it's impossible to drink.", "rating": 1}, {"title": "In term bitter", "text": "In term bitter, this med powder is hard to swallow. No wonder the pill sold out.I tried it once ... too bitter ... I had to stop!", "rating": 1}, {"title": "I feel I wasted money on your products", "text": "I feel I wasted money on your products. Absolutely no change to my Erectile Distinction. Still as limp as a rotten banana", "rating": 1}, {"title": "I had hopes on this based on the…", "text": "I had hopes on this based on the advertisement of ingredients and reputation. But all waste... haven’t seen an iota of benefit.", "rating": 1}, {"title": "The product did not work for me", "text": "The product did not work for me. It was a complete failure and disaster. I will not recommend this product to anyone.", "rating": 1}, {"title": "Careless packaging of my order", "text": "Careless packaging of my order. This is my first problems of any of my orders. Usually everything is A-OK. Thanks", "rating": 1}, {"title": "Very little product for the price", "text": "Very little product for the price. My bad for not paying attention to how much you get. I was very disappointed.", "rating": 1}, {"title": "Misleading advertising", "text": "They called a tiny bag of pine pollen the bulk bag......my fault for not reading the weight. Waste of money", "rating": 1}, {"title": "It's been almost a month since I…", "text": "It's been almost a month since I ordered and still have not received my products. I live in Switzerland.", "rating": 1}, {"title": "Goodnight", "text": "Goodnight! I Never reverted the item , the post office delivered it to the wrong house", "rating": 1}, {"title": "Not unhappy with the product but I…", "text": "Not unhappy with the product but I ordered over 10 days ago and still haven't received my order.", "rating": 1}, {"title": "product doesnt work at all!", "text": "product doesnt work at all!! misleading!! false advertisement!! took time to refund my money back!!!", "rating": 1}, {"title": "Shipped  wrong product for monthly subscription. I have subsciption for Pine Pollen tincture. I received Blue Vervrain tincture", "text": "I have a monthly Pine Pollen tincture subscription. This month I received Blue Vervrain tincture", "rating": 1}, {"title": "When I ordered", "text": "When I ordered, the purchase included a jar to hold the herbs. I never got the jar.The product works", "rating": 1}, {"title": "Never received product", "text": "Product ordered on 2nd Dec 21 & still waiting.. No updates yet.. Disappointing", "rating": 1}, {"title": "Hello", "text": "Hello, I like the honesty and the customer service and quality product of Lost Empire, Thank You", "rating": 1}, {"title": "no hard on", "text": "no hard on, no juice what a bullshitter these people,  RUN wasted $100 for no result.", "rating": 1}, {"title": "Never received my order", "text": "Never received my order. I am still waiting on your support ticket agent...", "rating": 1}, {"title": "Have used the herbs recommended", "text": "Have used the herbs recommended.  See no results worth reporting.   Will not use again.", "rating": 1}, {"title": "Not effective after following daily…", "text": "Not effective after following daily dosage recommendations", "rating": 1}, {"title": "Very little product for the price!", "text": "Date of experience: August 05, 2023", "rating": 1}, {"title": "Expensive!!too the MAX", "text": "Date of experience: October 03, 2022", "rating": 1}, {"title": "I didn't receive my oder [Order…", "text": "I didn't receive my oder [Order #768326] (August 18, 2021)", "rating": 1}, {"title": "The product did not do anything for me", "text": "The product did not do anything for me. It is a waste of money.", "rating": 1}, {"title": "as of today still no wood ...have half…", "text": "as of today still no wood ...have half a bottle to take...........", "rating": 1}, {"title": "Sorry for this for you but it is the truth based on what I experienced.", "text": "The Tongkat Ali product that I purchased from you and may I say close to $200 (4 packets) worth was lackluster and I believe that you're many reviews are made up. I found the quality to be poor and lousy and that is the best that I can say about it. Compared to the product that I was already using, which name I will not reveal, I believe your product is just pure garbage. Please have it analyzed again. As a matter of fact I will be happy to have it analyzed for you and provide the results, after which you can provide me a refund of the analysis. Based on my free testosterone going up or Serene meaning level, it actually went down.I followed the directions explicitly as described on the package and they were encapsulated in gelatin capsules that were released into the intestinal area instead of being digested in stomach acid. I felt no different after two weeks. Consequently following these results I increased the dosage 25% and again felt no different then I did when I started the regimen.Later, in order to give your product the benefits of my doubt, I increase the dosage 75% which is almost twice the dosage and again felt no difference and after being tested, my free testosterone levels actually went down.In my opinion, and in my opinion alone, this product represented no benefit, and I believe that your positive reviews are made up or overhyped. Thus, I regret to inform you, I will never purchase a product from you again and if people ask me about my experience I will give them my honest answer. I  you will actually post this but hey, one never knows.", "rating": 1}, {"title": "Products are one to 10 times more…", "text": "Products are one to 10 times more expensive than Swanson Herbs.", "rating": 1}, {"title": "PRODUCT DID NOTHING FOR ME BUT THE…", "text": "PRODUCT DID NOTHING FOR ME BUT THE CUSTOMER SERVICE WAS GREAT", "rating": 1}, {"title": "Did not help with ED.( tried it once)…", "text": "Did not help with ED.( tried it once) But thank you any way.", "rating": 1}, {"title": "Customer service representative was…", "text": "Customer service representative was rude.", "rating": 1}, {"title": "I been taking it for one week don't see…", "text": "I been taking it for one week don't see any results?", "rating": 1}, {"title": "product doesn't work", "text": "Date of experience: September 05, 2022", "rating": 1}, {"title": "Have not received product", "text": "Date of experience: August 27, 2022", "rating": 1}, {"title": "I asked a question but did not get an…", "text": "I asked a question but did not get an answer", "rating": 1}, {"title": "Haven’t received my package yet", "text": "Haven’t received my package yet. It’s been 3 weeks", "rating": 1}, {"title": "Did not receive my order.", "text": "Did not receive my order. This is unusual.", "rating": 1}, {"title": "Noticed nothing", "text": "Date of experience: November 22, 2023", "rating": 1}, {"title": "Never received my order", "text": "Never received my order, yet I paid for it!", "rating": 1}, {"title": "Never received the order", "text": "Date of experience: June 21, 2022", "rating": 1}, {"title": "Too much advertising", "text": "Too much advertising. It is exhausting", "rating": 1}, {"title": "I didn't not get my item I ordered", "text": "Date of experience: January 31, 2020", "rating": 1}, {"title": "The order has not arrived.", "text": "Date of experience: April 06, 2022", "rating": 1}, {"title": "No improvement at all", "text": "No improvement at all. Waste of money.", "rating": 1}, {"title": "nothing For me", "text": "Sorry it did not do anything for me", "rating": 1}, {"title": "Waste of money", "text": "Does not work, No effect at all.", "rating": 1}, {"title": "I have never recevide the item.", "text": "Date of experience: January 04, 2020", "rating": 1}, {"title": "Zero  benefits", "text": "Date of experience: November 26, 2022", "rating": 1}, {"title": "I never received my order!!!!", "text": "Date of experience: March 25, 2020", "rating": 1}, {"title": "Product did not work", "text": "Date of experience: February 27, 2022", "rating": 1}, {"title": "Didn't work for me", "text": "Date of experience: December 06, 2019", "rating": 1}, {"title": "It did not work", "text": "Date of experience: February 07, 2021", "rating": 1}, {"title": "Does not work", "text": "Date of experience: November 12, 2020", "rating": 1}, {"title": "Ineffective", "text": "Date of experience: November 08, 2020", "rating": 1}]