[
    {
        "title": "We NEVER received our policy…",
        "text": "We NEVER received our policy information !NO PAPER WORK IN THE MAIL OR AN EMAIL …AND WE ARE GERMANY NOW.Could you PLEASE send us an EMAIL, NOW.",
        "rating": 1
    },
    {
        "title": "Reivel",
        "text": "My representative was very nice, but not thorough. When I noticed the dates were wrong on the policy, I called John Hancock directly. Not only were the dates wrong but my name and address were not on the policy.",
        "rating": 1
    },
    {
        "title": "To many emails",
        "text": "To many emails, with in a 30 second period. ",
        "rating": 1
    },
    {
        "title": "Called me by the incorrect first name",
        "text": "Called me by the incorrect first name.  Wasn't pleased with the quotes.  Kept on changing the numbers.  ATTITUDE  have a good amount of money on this trip.  My husband is going to start chemo in September,  and will be until March, 2025.  I couldn't not understand, with a larger quote.",
        "rating": 1
    },
    {
        "title": "I was happy with the price and pleased…",
        "text": "I was happy with the price and pleased to have the coverage when a couple of glitches came up during the trip. I have sent emails to AARDY and the carrier they direct me to on the website, But I have yet to get a response from anybody.",
        "rating": 1
    },
    {
        "title": "Your claim process asks for too much",
        "text": "Your claim process asks for too much, including the bank's wire transfer instructions. As for checks, it does not say for how long will the checks be valid (in case those are sent to a USA address, and the claimant would be able to collect the check only upon return).",
        "rating": 1
    },
    {
        "title": "Missing my policy info",
        "text": "I was told I would get the policy/benefits info within 2 hours!  I still have not received the info promised and have not received them.  I purchased the travel insurance through Aardy on Aug.8,2024Kate Carroll 916-549-4859",
        "rating": 1
    },
    {
        "title": "Messed up policy",
        "text": "Instead of one policy for my wife and I aardvark wrote two policies both in my name.  ",
        "rating": 1
    },
    {
        "title": "I purchased travel insurance for a trip…",
        "text": "I purchased travel insurance for a trip through Vacations by Rail through the Western Canadian Rockies for September 2023.  2 hours before the trip began, we received an email from the railroad stating \"with the declared state of emergency due to spreading wildfires in Western and Northern Canada ... we cannot guarantee safe operation, this train might be cancelled ... while en route, without offer of alternative transportation.... emissions from forest fires ... etc.\"  To my husband with significant health issues, these concerns made the trip uninhabitable.  The railroad advised us to cancel the trip.  Our claim and subsequent appeal were both denied for a whole range of reasons.  We lost over $5,000.  Do not use AARDY.",
        "rating": 1
    },
    {
        "title": "Agent never full information   I do not…",
        "text": "Agent never full information   I do not you keep record under policy # or certificate #  . ? No live person available in customer service  Your sales person very careless , Your company appears to me do not believe in service . Once you have money do not gave dem about customer service I am writing a letter to ban you people to do business , IT is same on your company and agent taking advantage of older customers to rip  offAnd sale something which is correct . I want some body to call me at 732-873-0635 Rohit",
        "rating": 1
    },
    {
        "title": "I bought an insurance and next date all…",
        "text": "I bought an insurance and next date all my travel plans were cancelled. I contacted this company via email to advise about the cancellation and requested a refund of the policy fee that I paid or the option to change the dates for future travel.Five months later here I'm, after multiples email that I sent to them during all this time and I'm still waiting to get my money back or to have the options of transfer my policy to a new travel date.The careless shine in this company!",
        "rating": 1
    },
    {
        "title": "Travel insurance",
        "text": "Purchased travel insurance. Thru IMG. Good price and good coverage.Problem is canc t get policy and docu. printed out unless I'm a member of IMG. Site gives toll free # to call to get confirmation # in order to log in and print documents.. Toll free # isn' t maned by anyone on weekend.I have to wait until weekday to get a code. Very poor system!",
        "rating": 1
    },
    {
        "title": "I am going to cancel l this policy for…",
        "text": "I am going to cancel l this policy for trip insurance with AIG. Nothing from your quoted website translated to my requested policy coverage with AIG.Reached out to Customer Service  Nicole and said they would correct it. 24 hours later nothing has been done.Policy is for $26000 coverage and paid $1400 for 2 people not one person for coverage of $13000.Almost seems a bait and switch.",
        "rating": 1
    },
    {
        "title": "Beware of purchasing through Aardy.com",
        "text": "Aardy was helpful in finding relevant policies and providing insurors' documentation.  But purchasing a policy through Aardy was a serious mistake.  The policy documents shown on Aardy said you had the option to buy upgrades at time of purchase.  In fact, once you hit \"Purchase\" you have no option to do anything.   Correcting this through the insurer itself is almost impossible, and it is not clear at all that the problem can be resolved.   NEVER USE AARDY OR ANY 3rd PARTY WEBSITE TO BUY INSURANCE - ONLY DO IT THROUGH THE INSURANCE COMPANY'S OWN WEBSITE!",
        "rating": 1
    },
    {
        "title": "I had to speak with six people to get…",
        "text": "I had to speak with six people to get clarifications on the policy. the documents could not be tracked. I had to get written emails that explained the categories because the print outs did not carry all information.Very angry that I chose John Hancock to learn that it is a policy by another company called Starr. I had rejected  Seven Corners. However, when I paid, the policy was issued by Seven Corners. Your information is misleading. I will be lucky if I never need the insurance. I had recommended you to fellow travelers and I will now tell them not to use you. I came to you thru my AAA membership and your people say there is no affiliation.",
        "rating": 1
    },
    {
        "title": "Many things went wrong",
        "text": "Many things.  The phone number provided for the insurance co did not work.  I thought I was getting a JH policy, but it was underwritten by Starr and admin is seven corners.  I requested a certificate of insurance, and AARDY support sent me an expired one. Would have saved me a lot of stress by going to seven corners them directly.  My previous experience with AARDY was good, but not this time.",
        "rating": 1
    },
    {
        "title": "Problem with Travel Voucher",
        "text": "I have a travel voucher, I received the letter and following instruction I called the phone number on the letter. I just want to apply those fund to my next travel insurance quote.The lady, Angel, first she said that the voucher was wrong, she gave me a new number and then she could not find the quote I have for the new travel insurance. She put me on hold for several times, after 39 minutes on the phone I got tired and told her I will use the voucher later on. Terrible experience this time.",
        "rating": 1
    },
    {
        "title": "My sales women Is sold policy without…",
        "text": "My sales women Is sold policy without any details. This travel Insurance is scam . While trying to reach emergency contact person told me we do not have any information about your policy.!Emergency we can provide any help",
        "rating": 1
    },
    {
        "title": "Misleading quote",
        "text": "When the policy documents arrived the Emergency Medical coverage for the AXA Plan showed as secondary on an endorsement document that came with the download. Your website does not mention it is secondary.  I am having the policy cancelled. ",
        "rating": 1
    },
    {
        "title": "Difficult to collect on policy",
        "text": "Sold me a trip insurance policy which in my opinion Trawick and Nationwide appear to be doing everything possible to avoid paying. Demanding what appears to be unreasonable and in some instances information unavailable to me. AARDY response appears to be \"its not us\" we just sell!",
        "rating": 1
    },
    {
        "title": "not completed",
        "text": "I paid for and received the confirmation and IDs for the 3  who are going from Texas However I am going from Michigan I have no received my confirmation or ID.  The bank shows you debited my account for $640 for the 3 from Texas and $595 for me from Michigan. Please send my paperwork to me. Janice Gross ",
        "rating": 1
    },
    {
        "title": "AARDY is a scam like most travel…",
        "text": "AARDY is a scam like most travel insurance companies.  Our flight was cancelled hours before our trip and there was  no way we could get to our cruise.  Impossible.  AARDY used one of their loopholes so now our attorney is working with them.  This is pitiful.",
        "rating": 1
    },
    {
        "title": "Completely dissatisfied.",
        "text": "You make it almost impossible to get a meaningful response. You NEVER sent me a copy of my coverage. and when I called, I was sent through a song and dance, you sent everything in PDF - I cannot read PDF, so I cant get a copy of my coverage. I am severely disappointed, and with no faith in your company.",
        "rating": 1
    },
    {
        "title": "I made my payment and got a “policy”…",
        "text": "I made my payment and got a “policy” number but signing on with that number to get more information, I get account unknown?This is no way to run a business.",
        "rating": 1
    },
    {
        "title": "Scam with change requested",
        "text": "Asked for change in policy after less than 1 day (first name wrong and date of minimal down payment wrong) and received notification that an additional $200 was needed. Never received clarification of why and felt scammed for cancelled",
        "rating": 1
    },
    {
        "title": "I paid but never got the insurance…",
        "text": "I paid but never got the insurance documents. It said payment complete and in 2 hours I would get the insurance policies but didn't . In fact, my latest e-mail from AARDY tells me to get a quote. ",
        "rating": 1
    },
    {
        "title": "You can't get paper copy for proof of purchase.",
        "text": "I bought insurance today and paid for it with my credit card. I can't receive the paper work to prove I have paid etc.  I'm not computer literate and I volunteered to pay for a paper copy, but you can't do that.",
        "rating": 1
    },
    {
        "title": "RE: double charge for travel insurance",
        "text": "RE:  Policies TCLX284024468 and TCLX284024469Updated review regarding our recent travel insurance purchase. Though we were initially very pleased with the service, subsequent developments necessitate contacting you.It turns out that two insurance policies were issued, rather than one. I was unaware of this until I checked my VISA credit card account regarding the end of our billing cycle. I then noted your company had submitted to our credit card two charges, each in the amount of $1514.60. We called your company on 9/19/23. The agent cancelled policy TCLX284024469, issuing a credit to our VISA account. However, the email regarding this cancellation stated it would take 3-8 business for the refund to post to our account.The result is that I have had to now pay 2 charges, each in the amount of $1514.60 to my credit card company since the billing cycle has ended. I now have to wait for my refund that will appear on my next credit card statement.Needless to say, these developments have made me rather unhappy with the service provided.Sincerely, SJW",
        "rating": 1
    },
    {
        "title": "Fake reviews and ratings so be alert ",
        "text": "Paid review scam all reviews and ratings are fake ",
        "rating": 1
    },
    {
        "title": "Pick a travel insurance co. who do not have elderly people as ourselves to take care of the insurance on our own.  ALWAYS had policy sent directly to us.  Would not recommend this company.",
        "text": "Difficult for elderly to navigate.  Will not use this company in future travels.  Having said that, the Operator who worked with me was top-notch.",
        "rating": 1
    },
    {
        "title": "Customer Service Phone number no",
        "text": "Customer Service Phone number noLoner in service …..800 243 3174  Is there another number ….?…",
        "rating": 1
    },
    {
        "title": "Nothing is wrong",
        "text": "Nothing is wrong, I have not purchased yet.  I want to know about reviews from people who had to use it, please.   ",
        "rating": 1
    },
    {
        "title": "Could not get a copy of my policy",
        "text": "Could not get a copy of my policy. Called a service rep and she was unable to retrieve one either. Consequently asked to cancel my policy. I was told that I had to send email to request a refund. What a hassle.  I selected your company because of the low price. Big mistake, a lot of wasted time and anxiety. Never again.",
        "rating": 1
    },
    {
        "title": "I had a claim I faxed from the ship on…",
        "text": "I had a claim I faxed from the ship on Jan 15, 2024. On Feb 1st IMG asked for more information, I sent the info asked by Feb 5th. On Feb 29th they asked for more info.  This has evidently been passed down the line a couple of times. Now it is March 18 and they say its still under review or processing whatever that means. So far I feel I have been given the run around",
        "rating": 1
    },
    {
        "title": "Let the Buyer Beware",
        "text": "Stay clear of AARDY. In my opinion, their advertisements promise the world, but when it comes time to pay out they hide behind the fine print. Let the buyer beware!",
        "rating": 1
    },
    {
        "title": "Agent mistakenly wrote policy with the…",
        "text": "Agent mistakenly wrote policy with the wrong end date!Unable to correct . . . spoke with several reps to fix it but no luck. Poor customer service.",
        "rating": 1
    },
    {
        "title": "Wait till I return from my trip.",
        "text": "You sent this too soon because I just purchased the insurance. I have not even left for my trip. You should ask for the review after the coverage end date.",
        "rating": 1
    },
    {
        "title": "?? What is Trustpilot",
        "text": "What is Trustpilot? Why are you contacting me for a review? How did you get my info?",
        "rating": 1
    },
    {
        "title": "Premature rating request",
        "text": "The only thing that AARDY has done so far is to accept my money.  Why would you rate a product as soon as you buy it but have not yet used it?",
        "rating": 1
    },
    {
        "title": "Since I have not had the opportunity to…",
        "text": "Since I have not had the opportunity to use the service of the travel insurance, I can only comment on the arrangements made, they were quick, easy and done very pleasantly.",
        "rating": 1
    },
    {
        "title": "Foolish to ask",
        "text": "Of course, I can’t rate any of this unless I need it and can see how you respond. ",
        "rating": 1
    },
    {
        "title": "I didn't receive a policy from Seven…",
        "text": "I didn't receive a policy from Seven Corners yet, and your customer service is not the best to solve this issue, in a few hours I'll proceed to buy an another travel insurance from a different company, I can't travel without travel insurance ",
        "rating": 1
    },
    {
        "title": "I cannot open a copy of my policy",
        "text": "I cannot open a copy of my policy. I cannot join your membership. your customer service is closed!",
        "rating": 1
    },
    {
        "title": "Missing ONE day of securing the…",
        "text": "Missing ONE day of securing the insurance we needed for a trip - after having using you for 3 previous trips - no grace period - nothing",
        "rating": 1
    },
    {
        "title": "Christiana was very helpful",
        "text": "Christiana was very helpful, walked me thru different options.",
        "rating": 1
    },
    {
        "title": "Nice working so good job ✌🏼🤝",
        "text": "150r dene ka bola apki team ne or diye nhi ne tumhe 5star chyee ",
        "rating": 1
    },
    {
        "title": "Too many weasel words causing doubt you…",
        "text": "Too many weasel words causing doubt you would actually pay.",
        "rating": 1
    },
    {
        "title": "No one replied to my question online",
        "text": "No one replied to my question online. Do not know where to find information to make a copy of the policy!!",
        "rating": 1
    },
    {
        "title": "After doing research",
        "text": "After doing research, I purchased an AARDY insurance to cover my cruise. While on the cruise .my cellphone got dropped into the hot tub. Upon returning. I put in my claim.it was denied..It seems they don't cover any electric devices.. you don't learn this untill AFTER you've made your purchase.. So, be careful in your travel insurance search. But. DONT buy AARDY.  If you cell phone, laptop, hearing aid, or anything electric gets damaged or stolen. You've washed your money with this company..",
        "rating": 1
    },
    {
        "title": "Bad recommendation",
        "text": "The recommended company has terrible reviews from customers who actually needed to file a claim.",
        "rating": 1
    },
    {
        "title": "I bought travel insurance through…",
        "text": "I bought travel insurance through aardy. I had my cell phone get damaged. When I got home I put in a claim. It was denied. They don't cover personal electric devices. With today everyone having them. You'd think they would.but they don't. And you don't find out until AFTER you purchase. My advice is DON'T purchase AARDY. Look elsewhere.",
        "rating": 1
    },
    {
        "title": "Read their exclusions",
        "text": "I was on a cruise and forgot to remove my phone . When we got into port.i bought a cheap replacement. Upon my trips completion I purchased a new phone.I put in a claim. Only to get the response that it wasn't covered and was denied. Had I know this. I'd chose another company. But you don't get the contact until AFTER you have purchased it. I will choose another company.and will warm others of this exclusions.",
        "rating": 1
    },
    {
        "title": "Coverage not as advertised. Terrible customer service.",
        "text": "My return flight from Frankfurt to Detroit was canceled by Lufthansa two days prior to departure due to the unavailability of a flight crew. I was forced the purchase a flight on another airline due to Lufthansa's inability to book me on another flight for five days. When I purchased this policy from AARDY I was told that a benefit was \"Comprehensive Cancellation and Interruption Protection\" yet my claim was denied because lack of a flight crew was not a covered reason. When I called AARDY to question this the agent was extremely rude stating \"Is there anything else because this conversation is not productive.\" Do NOT give this company your business especially if you are a senior citizen.",
        "rating": 1
    },
    {
        "title": "Quote is not true",
        "text": "I am not happy with the insurance company because they quoted me a price and when I gave them my card information the price jumped and additional $43:00 more than the quoted price. They said I will receive a refund and two weeks have gone and nothing. When I called again the supervisor said I cannot get it. Wow please take your business somewhere else, I know I am!",
        "rating": 1
    },
    {
        "title": "Never received policy by email",
        "text": "Never received policy by email.  But money wa withdrawal from my account. If this is type of response I will receive, when needed, then I'm canceling the policy",
        "rating": 1
    },
    {
        "title": "I used the wrong credit card for my…",
        "text": "I used the wrong credit card for my purchase called 5 minutes after purchase to change the card. I was told that the credit would have to come from AIG or 10-15 day to refund which would cause me to miss the time sensitive date",
        "rating": 1
    },
    {
        "title": "We were supposed to have received a…",
        "text": "We were supposed to have received a policy within 2 hours and after almost five hours still no policy!",
        "rating": 1
    },
    {
        "title": "Dear Seven Corners,",
        "text": "This afternoon, I attempted to purchase a travel insurance plan for our 2023 trip to the UK TWICE, PAYING EACH TIME, WITHOUT SUCCESS.  I have been a long time customer of AARDY and have now spent more than two hours trying to purchase a plan for our trip. I am extremely frustrated. I have paid twice for plans that have incorrect personal data.",
        "rating": 1
    },
    {
        "title": "I purchased travel insurance for two…",
        "text": "I purchased travel insurance for two trips.  One to Portland and one to Ireland.  My brother-in-law pointed out that the cruise company already furnished travel insurance so I called to cancel the insurance on my Portland trip.  Instead, 2 weeks later, I discover that someone had taken it upon themselves to cancel BOTH of my policies.  The stupidity of one person cost me over $5000.00.  Would I recommend this company, not a snowballs change in Hell!",
        "rating": 1
    },
    {
        "title": "Sir I'm driver in I'm electrician",
        "text": "Sir I'm driver in I'm electrician ",
        "rating": 1
    },
    {
        "title": "don't make robot so hard to get pass",
        "text": "don't make robot so hard to get pass. i have landline",
        "rating": 1
    },
    {
        "title": "I never received the policy???",
        "text": "I never received the policy???It said I should recieve a copy.  I don’t even have the number.",
        "rating": 1
    },
    {
        "title": "Beware Aardy not extending policy even though it was the government that stopped all travel into and out of Italy due to COVID",
        "text": "Jetline Vacations recommended Aardy for travel insurance. We planned our trip in July 2020 for June 2021. The USA and Italian governments shut down all travel due to COVID. All airlines hotels, and car rental companies we were using extended our arrangements and kept same prices in effect until restrictions on travel were lifted. We are traveling in September 2022.Aardy did not and will not extend our travel insurance policy. They are pointing the finger at the travel insurer.In addition to this posting, I will be reporting them to BBB and my financial institution that they have not provided the service they were paid for.",
        "rating": 1
    },
    {
        "title": "Missed spilled name and address and…",
        "text": "Missed spilled name and address and when I called back to have them corrected they told me it will takes 10-15 days to have the right information on the policy and I'm traveling in few days. Or, they'll cancel the policy and purchase new one with right information and in 2 weeks they'll reimburse me.",
        "rating": 1
    },
    {
        "title": "Inaccurate information about COVID Coverage",
        "text": "I was told by Jerome with whom I spoke yesterday that the my coverage letter would specify that COVID coverage is included.  COVID coverage is required by Israel, and I explained that's the only coverage I care about.  He assured me it would be on the policy once I purchased it, and it is not!  I have been on hold calling to get a change made for 30 minutes so far.  Additionally, my husband's name includes a middle initial.  He does not have one.",
        "rating": 1
    },
    {
        "title": "Everything was easy to read and…",
        "text": "Everything was easy to read and understand",
        "rating": 1
    },
    {
        "title": "Big Mistake",
        "text": "At your recommendation, I paid IMG the full premium, then spent more than a hour trying to navigate their incredibly complicated system of documents, for which they use terms inconsistently and confusingly.  I am sorry that I did business with you.  I won't do it again.",
        "rating": 1
    },
    {
        "title": "Misleading information made it seem I…",
        "text": "Misleading information made it seem I was purchasing both trip cancel and interruption insurance coverage, but when I saw the insurance company document, interruption for any reason wasn't covered and I had to pay extra to add it. Misleading information on Aardy website and from Aardy rep Brandon.",
        "rating": 1
    },
    {
        "title": "I spoke with 2 of your employees on…",
        "text": "I spoke with 2 of your employees on separate daysBoth individuals were, knowledgeable and helpful This morning Matthew answered some additional questions and helped finalize my purchaseThanks for the assistance",
        "rating": 1
    },
    {
        "title": "I was offered the lowest insurance…",
        "text": "This company refuses to refund my premium even though the travel was cancel by airline and Governor of Hawaii request so they are offering a useless voucher which I have no interest in. Another words I am not traveling and Airlines (with no refund policy) refunded my ticket price due to this unforeseen circumstance but this company refuses to refund my premium. This is Hyway Rubbery.",
        "rating": 1
    },
    {
        "title": "Was quoted twice with incorrect trip…",
        "text": "Was quoted twice with incorrect trip costs.  Paid for coverage for my daughter and myself and discovered that the coverage was for over a thousand dollars less than the cost of the trip.  The policy for my daughter was through another company so they couldn't find it. I gave correct totals for the cost of the trip. l have worked in management in the travel industry and have purchased travel insurance before. My homeowners,  auto as well medical insurance is with AARP and have never had any problems.  After days of trying to resolve this matter l tried to cancel and was told they could not cancel and i would have to call the company my daughters was insured with directly. Booked by AARP.",
        "rating": 1
    },
    {
        "title": "Disappointed",
        "text": "I received a quote online, I called and spoke to Denise and used that quote to insure my sister and me for $424.97.  My cousin called right after to get insured for the same trip; her quote was $310.00. I quickly called back for clarification and was not satisfied with the agent's response. Age was noted as a factor but did not equate as my sister and cousin are the same age with no underlying issues. This felt like a scam and resulted in my cancellation for this travel insurance.",
        "rating": 1
    },
    {
        "title": "IMG is terrible",
        "text": "I purchased travel insurance through IMG and even though my cruise line cancelled our trip, IMG refused to pay anything.  They state  a customer has only 10 days to cancel the policy from the purchase date, so when our cruise line cancelled our trip, I assumed that the trip insurance would be refunded…WRONG.  I would stay away from this company.",
        "rating": 1
    },
    {
        "title": "Incredibly dissatisfied!",
        "text": "Incredibly dissatisfied!  Prices changed right before my eyes. Purchased travel insurance for myself ok. Then attempted to purchase insurance for my married daughter and the price more than doubled!  Unbelievable. Did not make that purchase!",
        "rating": 1
    },
    {
        "title": "I realized 4 days too late that I could…",
        "text": "I realized 4 days too late that I could have bought the same travel insurance with my airlines ticket at a price of $62 vs $500+ . I’m a senior citizen and that was a shock to my system to say the least. I requested per email a refund but received a short, to the point refusal back. It seems the rules are the rules and there is no discussion. I was hoping for at least a partial refund. I realized, too late, my options. I’m disappointed there wasn’t any consideration to the circumstances.My first experience with AARP referrals.",
        "rating": 1
    },
    {
        "title": "The site kept listing my age as 65 but…",
        "text": "The site kept listing my age as 65 but I'm 66. I re-entered the information correctly the second time, too, but it made the same mistake. If that could be corrected, that would be great.Your agents were excellent",
        "rating": 1
    },
    {
        "title": "The policy is 64 pages",
        "text": "The policy is 64 pages.  I asked for a hard copy to be sent to me.  No response.When I asked the claims department for a hard copy they said they were vey busy and to check the web site to insure you had all the claim documents.",
        "rating": 1
    },
    {
        "title": "Poor Customer Service",
        "text": "Poor Customer Service. It took 8 minutes for someone to answer your phone. The price I was quoted was higher than the price my friend who is 6 months younger then I received. Their was no flexibility to reduce the policy from $100,000 medical to $50,000 medical. I found the purchase experience to be very annoying.",
        "rating": 1
    },
    {
        "title": "The price went down by $5 the next day…",
        "text": "The price went down by $5 the next day with same input",
        "rating": 1
    },
    {
        "title": "I purchased travel insurance through…",
        "text": "I purchased travel insurance through your site with Itravelinsured (Travel Lite). The day after I purchased the insurance I made changes to my itinerary by adding a second night hotel and changed my return travel date.  I have been trying to update my coverage with them for 2 days and due to a \"computer\" problem they have been unable to help me. I have a 10 day window to cancel. I am beginning to think that perhaps they are not a reputable company.",
        "rating": 1
    },
    {
        "title": "COVID 19 trip cancel, no refund…",
        "text": "Forced to cancel our trip due to the COVID 19 virus and were offered a voucher not a refund. The insurance voucher is good for 2 years but could not get a refund.  Travel at the time of our trip was not allowed into Europe but no refund even under these special circumstances.  We did not buy the expensive \"cancel for any reason\"  rider but due to the COVID 19 pandemic I feel an exception should of been made. So be advised, if you don't buy the expensive rider you are stuck!!",
        "rating": 1
    },
    {
        "title": "First quote for my trip included 4 extra people when u knew exactly how many are traveling Your quote was increased when corrected. Will not use your site again!",
        "text": "First quote for my trip included 4 mo",
        "rating": 1
    },
    {
        "title": "I want to go to Las Vegas and go with…",
        "text": "I want to go to Las Vegas and go with my family to help people to have to buy things new things to have my boyfriend happy and to have fun with my family and I wish to go to casinos in Vegas okay thank you bye",
        "rating": 1
    },
    {
        "title": "Disappointed",
        "text": "I had an awesome experience getting the insurance the issues started when I wanted to cancel within to 10 review period!!!! I called 3 days after purchasing to cancel was advised it was processed. My friend Rachel Lee who also purchased the same time tried to cancel hers was told she couldn't and when she gave them my name they  said I wasn't cancelled. Which would explain why I haven't gotten a refund. I will be following up for a resolution as I am still within the 10 day period. My name is valerie killins",
        "rating": 1
    },
    {
        "title": "never used travel insurance and asked …no good info provided",
        "text": "never used travel insurance and asked if live person. wanted to get a number to call. got an email and was directed back to the general quote page. sent a second email and no response.................... the response from aardvark is interesting as my first DIFFICULT question was \" is this a live person\"  the second was that \" I was looking for a phone number to talk to someone as I had never used travel insurance before.\"   their response is worse than the service.....",
        "rating": 1
    },
    {
        "title": "very bad services!!!!!!",
        "text": "Date of experience: May 08, 2024",
        "rating": 1
    },
    {
        "title": "The webpage would not process my …",
        "text": "The webpage would not process my transaction. I emailed the person who sent me the quote and she was baffled as well. Told me to try another browser and get rid of cookies directed to your site. No luck still. Tried to call the phone number provided and waited atleast 10min two different times.",
        "rating": 1
    },
    {
        "title": "I feel we have been misled",
        "text": "I feel we have been misled. All we wanted was a medical policy and I thought this is what we bought. Come to find out it’s mostly trip cancellation and limited medical. Please rectify this issue. Thank youMichelle Selts5RTL17-fl-106390",
        "rating": 1
    },
    {
        "title": "Without the agent was very…",
        "text": "Without the agent was very knowledgeable and got me the insurance I need it I didn’t think the insurance was pretty high that I had left it for him to make sure I have the best plan. He did a great job",
        "rating": 1
    },
    {
        "title": "Bad service",
        "text": "Bad service ",
        "rating": 1
    },
    {
        "title": "I keep trying to print a copy of my…",
        "text": "I keep trying to print a copy of my plain but it does not print tryed to call spent over a half hour on the phone just a stuped recording where bussey please white but nobudy ever come to talk",
        "rating": 1
    },
    {
        "title": "excellent service, great agent",
        "text": "Excellent service, great agent.  I would certainly go with Aardvark again.  Only one problem:  after writing a favorable review, they contacted me several times wanting more.  That's against my rules.Marjorie Lutz",
        "rating": 1
    },
    {
        "title": "Need help!!",
        "text": "Can't  create an account or login  How do I get the policy that was to be sent 2 hrs after confirmation of my purchase.  Want to print it out and can't even find it  I need help  Very unfriendly site!!!!",
        "rating": 1
    },
    {
        "title": "Seven Corners Insurance - Do NOT purchase - Resolved!!!",
        "text": "We purchased a Roundtrip Elite policy on 3/3/20 for London leaving US on 3/28. On 3/15/20, due to the virus the government shut down travel to the UK. I wrote to Seven Corners for a refund or voucher until the trip could be rescheduled and they told me I was pass the 10 day look back (by 2 days) and would not issue the refund. They told me they would honor the policy if rescheduled by 3/28/20. Of course, that is impossible to know when it can be rescheduled. I wrote to HQ and no response. Seriously, worst customer service I have every seen!! When all the world is in turmoil, the mighty buck stops there with this company.3/20/20 - Received an email from agent and offered to move the date out 1 year for rescheduled plans. Thank you!!",
        "rating": 1
    },
    {
        "title": "your service really was not useful to…",
        "text": "your service really was not useful to us- though done in easy manner on-linewish it was said w/business class international seats- you can cancel at any time w/out reason",
        "rating": 1
    },
    {
        "title": "Big screw up....?",
        "text": "I bought insurance for $295 only to contact the insurance company to make a claim and they have no record of my policy.  Waiting to have this resolved. But at this point it seems to me this is a huge rip-off.",
        "rating": 1
    },
    {
        "title": "Everything seemed to go well",
        "text": "Everything seemed to go well, but despite Aardy's assurance that the carrier (Trawick) would send my policy within 2 hours, I have not received anything from them in 8 days!",
        "rating": 1
    },
    {
        "title": "The lack of coverage relating to the…",
        "text": "The lack of coverage relating to the pandemic only confirms that insurance companies want your money but have no interest in being a traveler's safety net.",
        "rating": 1
    },
    {
        "title": "I am concerned that the setup process…",
        "text": "I am concerned that the setup process did not follow through.  I am not able to access the website, create a presence and view my documents and anything else that I might need.",
        "rating": 1
    },
    {
        "title": "Almost double the cost of the same…",
        "text": "Almost double the cost of the same coverage on other sites.  It's a shame AARP supports you guys given how you try and rip people off. Shame on you.",
        "rating": 1
    },
    {
        "title": "Extremely difficult to Communicate with…",
        "text": "Extremely difficult to Communicate with a claims agent,Purchased the polocy in good faith, now having doubts about the Insurance Co.very concern",
        "rating": 1
    },
    {
        "title": "It was no problem to contact you to…",
        "text": "It was no problem to contact you to purchase the insurance but impossible to reach you with a question once the policy was purchased",
        "rating": 1
    },
    {
        "title": "The confirmation email stated that the…",
        "text": "The confirmation email stated that the policy would be sent in 2 hours.It is now 26 hours and no policy was received.",
        "rating": 1
    },
    {
        "title": "Impossible to rate as we haven’t used…",
        "text": "Impossible to rate as we haven’t used this service. If we have an issue on our trip I will rate this insurance after a claim is completed.",
        "rating": 1
    },
    {
        "title": "Impossible to open and view policy",
        "text": "Impossible to open and view policy. I keep putting the correct information requested in and it won't pull up the policy",
        "rating": 1
    },
    {
        "title": "trash Rate your recent experience",
        "text": "Date of experience: August 23, 2023",
        "rating": 1
    },
    {
        "title": "Seems like an affordable policy for two…",
        "text": "Seems like an affordable policy for two people. However If an annual policy would be available I’d be interested in that.",
        "rating": 1
    },
    {
        "title": "Delightful lady ,attentive and…",
        "text": "Delightful lady ,attentive and informative",
        "rating": 1
    },
    {
        "title": "Incomplete and uninformed information.",
        "text": "Date of experience: January 10, 2023",
        "rating": 1
    },
    {
        "title": "I purchased and immediately I couldn’t…",
        "text": "I purchased and immediately I couldn’t pull up my plan to print it. It was like it couldn’t be found.",
        "rating": 1
    },
    {
        "title": "Different agents I speak with at AARDY…",
        "text": "Different agents I speak with at AARDY give me different direction and opposing information. I ended up being given incorrect information which cost me a lot of money. Finally ended up talking to Trawick and a very nice person there corrected all of the problems. I initially put a deposit on a trip and then when I paid remaining balances I tried to increase the value of the policy. One AARDY agent sold me two individual policies one for my husband and one for myself when I wanted a joint policy. I agreed to keep it because they said it was the same. But when I tried to increase the insurance amount of the policies there was a problem. The agent that day told me it is cheaper if I was insuring a couple then buying 2 separate policies so I was looking at a higher cost.  I was then advised to buy another joint policy which was less expensive and stack the policies. At this point I had 3 policies for the same trip. I eventually called Trawick rather than work through AARDY and thankfully they straightened this mess out. You can't stack policies. Other problems. The agents at AARDY are not all well trained leading to confusion. You might want to call travel insurance companies directly.",
        "rating": 1
    },
    {
        "title": "Both Chase and Jamie went above and…",
        "text": "I never submitted this review.",
        "rating": 1
    },
    {
        "title": "I had to ask for the policy",
        "text": "I had to ask for the policy. Not a great start.",
        "rating": 1
    },
    {
        "title": "Wish you worked with Chrome",
        "text": "Wish you worked with Chrome.  Couldn't get a quote had to go to Microsoft Edge.  Bummer.",
        "rating": 1
    },
    {
        "title": "cant reach",
        "text": "Impossible to reach vendor by phone.  people seem to be unavailable",
        "rating": 1
    },
    {
        "title": "AIG refused to [provide their letter of…",
        "text": "AIG refused to [provide their letter of health care insurance as advertused",
        "rating": 1
    },
    {
        "title": "Awful experience with absolutely no…",
        "text": "Awful experience with absolutely no follow up. Never ever again.",
        "rating": 1
    },
    {
        "title": "Hard to use",
        "text": "Hard to use - your customer service leaves A LOT to be desired",
        "rating": 1
    },
    {
        "title": "bad experience",
        "text": " bad experience",
        "rating": 1
    },
    {
        "title": "listed several policies but could not…",
        "text": "listed several policies but could not find results",
        "rating": 1
    },
    {
        "title": "Quick and efficient",
        "text": "Quick and efficient.  Great personality!",
        "rating": 1
    },
    {
        "title": "Nobody answers the phone???",
        "text": "Date of experience: February 09, 2022",
        "rating": 1
    },
    {
        "title": "Travel insurance is a scam.",
        "text": "Date of experience: May 09, 2020",
        "rating": 1
    },
    {
        "title": "Quick and easy to enroll.",
        "text": "Date of experience: June 21, 2019",
        "rating": 1
    },
    {
        "title": "Too much spam",
        "text": "Date of experience: February 29, 2020",
        "rating": 1
    }
]