[{"title": "I purchased the rhinestone buckle…", "text": "I purchased the rhinestone buckle platform sandals in 8/2024 from Rainbow, East Hartford, CT.  I wore them once last month to an indoor event, and again on 9/21. As I was at my event, 1 of the bolts came out of the hole.  Tried to exchange it, but because I no longer have the receipt as I never planed to exchange or return it, I was told, although they looked like they were still fairly new, price tag sticker still secured to the bottom of one of the shoes, they could not exchange it without a receipt.  Poor policy. This is a great way to lose a valued customer. ", "rating": 1}, {"title": "I made an online purchase", "text": "I made an online purchase, received it a week ago, and when I try to return the items that don't fit in store they're telling me they can only do store credit. The return policy on the form and on their website claims that as long as it's returned within 30 days of the shipping date I can get a refund. I do not want store credit, the sizing is so off with their clothing, and honestly I don't want to continue wasting my money here! As a business, please do better in updating your policies so that your customers are not inconvenienced. This is extremely frustrating and makes me want to never purchase from Rainbow again. All the years I've been a customer, I've never experienced such horrible issues with returns. ", "rating": 1}, {"title": "Employees not giving a damn", "text": "Not only was the cashier and the manager was very rude. I ask about two different items. I was about a clearance item, there was 3 garments hanging on the rack but no colored sticker so asked the manager never stopped what she was doing. The only thing she said if it's on the clearance rack it is marked down. Not necessarily a customer could have put them their. And I asked the cashier about a shirt that's was on the plus size but it was a small. I asked if they had anymore. I told her that it was on the plus side and she never moved from unpacking house shoes. She asked was it anymore on the rack. Air head it was onthe wrong side of the store. The both of them was so occupied on putting stuff out. Until I was just wondering around in the store felling pissed. No customer service from either.", "rating": 1}, {"title": "WARNING", "text": "WARNING: DO NOT BELIEVE NONE OF THESE 68,000 LYING FAKE BOT REVIEWS THAT RAINBOW EMPLOYEES POSTED. ANY COMPANY THAT POSTS NOTHING BUY FAKE LYING POSITIVE BOTS REVIEWS, IS A COMPANY THAT MAKES NO MONEY BECAUSE REALLY NOBODY SHOPS THERE AND THEY HAVE NOTHING BUT LOTS OF BAD HONEST REVIEWS, THEY TRY TO COVER IT UP BY POSTING ALL THESE FAKE LYING POSITIVE BOTS REVIEWS THAT AREN'T EVEN REAL.RAINBOW SHOPS WEBSITE IS A TERRIBLE UNPROFESSIONAL COMPANY AND AS OTHER REVIEWS SAID, THEY NEED TO BE SHUT DOWN AND AS OTHER REVIEWS SAID, THERE CLOTHES AND EVERYTHING IS NOTHING BUT CHEAP FLIMSY THRIFT STORE JUNK THAT WILL BREAK AND FALL APART. NO WONDER NOBODY LIKES THEM BECAUSE THEY HAVE ALL THESE HONEST BAD REVIEWS.NEVER BELIEVE ANY FAKE LYING POSITIVE BOTS REVIEWS FOR ANY COMPANY IN GENERAL BECAUSE THEY ARE ALL BOTS FAKE REVIEWS POSTED BY EMPLOYEES.I ORDERED FROM THEM ONE TIME AND I NEVER RECEIVED MY ORDER AND THEY CLAIM THEY'LL INVESTIGATE AND LET ME KNOW ABOUT THE ORDER, DUMB LYING B*** NEVER EVEN CONTACTED ME BACK, I DISPUTED THE TRANSACTION WITH MY BANK AND RAINBOW SHOP B**** LIED TO MY BANK SAYING THAT I DID RECEIVE THE ORDER WHEN I DID NOT.SO ANOTHER WARNING: DON'T ORDER FROM THIS SH*** TERRIBLE UNCARING COMPANY BECAUSE IF YOU DON'T RECEIVE YOUR ORDER, THEY WON'T GIVE YOU YOUR MONEY BACK BECAUSE THEY DO NOT CARE ABOUT ANYONE.And fyi, if you see any company that says anything on there website like \"get free products, contact us with your social media\", or anything similar to that, please know that it's all NOTHING BUT A SCAM AND LIES, because no company is gonna send out free products to no one because that's illegal and if any company tried doing that then they would immediately go out of business and they'll lose lots of money and nobody gets nothing free in this world, and no company would have any customers if any company tried doing that, they would lose so many customers if they tried doing that because no customer is gonna shop with a company like that and the company would be out of business if they tried doing that and no company gives a crap about anyone on fake social media or youtube or blogging vlogging because all those platforms are fake and everyone is broke and fake on there and nothing but lies ppl tell on fake social media and youtube and blogging vlogging and ppl just create a fake rich happy luxury lifestyles on there that they don't live because nobody lives that way, and just like nobody gets paid on none of those platforms. And companies want to be fair to all customers, so of course there not gonna send out nothing free to no one. And no company features anyone on there social media because no one cares about that and any pics you see on the company social media or website, on there are not real life people, they're all created through CGI photoshop companies to look and act like real people, when none of them exist in real life.", "rating": 1}, {"title": "Horrible Manager", "text": "Store#1599 in Colonial Heights Va has the most RUDE manager I have ever encountered. The one star is for her specifically not for the store or the other person that assisted me when I checked at.  I was ready to complete my transaction so I walked up to the register where this person was standing she never uttered a word just continued on her phone never looked up or addressed me. She then walked away and another associate just so happen to see me standing there and walked over to help.  I am not a regular shopper of Rainbow but after experiencing the rudeness of a manager where I was spending my money I probably will not return. Please do better when hiring people that represent your business . ", "rating": 1}, {"title": "The ultimate customer service betrayal!", "text": "5/6/24, ordered 2 pair of 10$ sandals. 27.99$ w/shipping. Order thrown in unsecured hallway by carrier, when directions were clear on making secure delivery. Fed ex package stolen. Rainbow: \" we assume no responsibility for delivery\". FedEx, \" we threw your package in the unsecured hallway ignoring instructions,  so we delivered it and don't care your stuff was stolen\" Bank: \" we cannot refund your money because FedEx \"says\" they delivered the product. Ordered the shoes again in hopes of them arriving in time for function. FedEx took 9 days to get second order delivered. Paid 27.99$ twice for 2 10$ pair of sandals. Sandals are currently still in packaging not opened and not needed because function was missed. Had to spend money elsewhere for shoes.Don't want to hassle w/return. Will not repeat business w/Rainbow Shops locally, or online ever again. Accountability, lacking. ", "rating": 1}, {"title": "Store# 00200 in Orlando", "text": "Store# 00200 in Orlando, Fl. Rainbow Corp, or Employees, does not care about Customer Care, they don't  explain Layway to you, about refunds, & Customer Care Acted liked she didn't  give a dam, when I Call to voice my frustration. You have lost a good Customer, try to put your customer first for a change, because without  us there would be no business,  or Jobs.", "rating": 1}, {"title": "Customers Don't Matter", "text": "Sent me the wrong item twice within two weeks. No opportunity for online exchanges. Time and money spent making right, their wrong 2x. Sent me a discount code in which I used for the first repurchased item. Ended up returning the second incorrect item. I do not have the budget to keep purchasing items due to negligence. Customer Service offers minimal to no resolution at all. Satisfied customers equals longevity. Decently priced items is not the trade off for integrity. Discount aren't always the solution Order# 4261647#4282817", "rating": 1}, {"title": "Clothing not true to size", "text": "As a first time shopper, I felt disappointed with my order. I'm a size medium and I ordered large just to be on the safe side. Unfortunately the clothing seemed to be a size down because they all were too close. I contacted customer support to see if I could return it for a bigger size but was told they're not accepting returns and that I should replace the order. Wow, that's very encouraging to a first time customer who's left with over 14 pieces of items that's not true to size.", "rating": 1}, {"title": "Everything was fine as far as the…", "text": "Everything was fine as far as the clothes go but the Little cashier had a major attitude for no reason because I did nothing but stand in line to pay for my stuff. She was rushing and didn’t even use customer service as to speak but waved her hand with a rude motion. Usually when I go in they always ask for your email and sign you up if you already haven’t but she was just rude for no apparent reason and the next time she is working and is the cashier I will take my money elsewhere because I’m in public and refuse to be treated that way and don’t want to go to jail for smacking someone ", "rating": 1}, {"title": "Did I receive returned worn merchandise or what", "text": "My order received on 11/16/2023, included jogging pants and a jacket, as well as a nightgown and robe. As soon as I opened outer packaging I discovered the pants were balled up turned inside out and appeared worn, did not smell new and the inner package was already opened. The jacket was still sealed but when I opened it up to check it out it had white scuff-like marks over the hood. This was my first time ordering Rainbow online and I am very disappointed...", "rating": 1}, {"title": "WORST EXPERIENCE EVER!", "text": "I cannot locate my package and I am not able to contact the company concerning my package. The phone doesn't work and they are not responding to my email and messages.Update: I did get a response after trying numerous ways to get your attention. I'm still trying to wrap my head around what transpired because it just does not make any sense. The error wasn't mine. Now I've lost most of the items I wanted and now some are even more expensive because quite a bit of time has elapsed since my initial purchase. However, I'm kindly suggesting that you do something about your phones and the way items are tracked so that one would not have to come here.", "rating": 1}, {"title": "The employees at the store in st.john Missouri are extremely rude and prejudiced towards white women…", "text": "The employees at the store in st.john Missouri are biased against white women and extremely rude as if they can’t be bothered by a white customer. This experience happened on 05/31/2024 at around noon ", "rating": 1}, {"title": "They suck and customer service sucks", "text": "I place an order on Friday I put my old address by mistake since I didn’t cancel in 15 min and there customer service is closed on the weekend I call them on Monday customer service was very rude and getting smart when asked if I could change the address I was told no and I’m just out of money they said yes I asked to talk to supervisor was told they will call me never got a call. They will never get another penny from me", "rating": 1}, {"title": "Rainbowshop.com", "text": "Beware when shopping online with Rainbow. The issue is you can only return items purchased via PayPal by using the return by mail and they will not honor the return policy in store to go back on the card used for PayPal. They also charge you 7.99 fee to use their shipping label to return items by mail. I will not purchase anything else from Rainbow. Not good customer experience", "rating": 1}, {"title": "Just because it’s CHEAP doesn’t mean you have to get treated like crap!", "text": "Went I Rainbow shops on Fletcher Ave. I went to purchase some items on and use an app on my phone. As I was trying to complete my transactions one clerk that was passing behind the other clerk clearly  said ‘no dinero’ she thought I dint understand I DID. This ruined my entire weekend. This clerk is Hispanics and I am black. I don’t use the race card. I paid for that transaction with my debit card and left! I left and returned 30 minutes ago and return this crap. I am so pissed off. I have the name of the clerk and the manager and will be reaching out tomorrow. The nerve of this bleach blonde old over the age heffa to try and talk trash about me. I will continue to shop at Rainbow but not at this store. ", "rating": 1}, {"title": "Don’t order from this site on the…", "text": "Don’t order from this site on the weekend because no one will be available to assist you with anything about your order. The customer service sucks even when they contact you back. All the will tell you is there’s nothing we can do about your order just  take it back to the store when you receive it. Like really what’s the purpose of having customer care if they can’t help you anyway.I’ll never order from this website again and I suggest you don’t either if you need any assistance from there customer care because it’s useless.", "rating": 1}, {"title": "I went to the store on 1042 S Oliver St", "text": "I went to the store on 1042 S Oliver StWichita, KS 67218 and purchased 2 jumpsuits and when I checked out I asked if THESE 2 items can be returned and I was confirm the can be and they did not fit so I went to return them and was told MY items were “final sale” and they can not be returned or even exchanged so make sure your item is not a “final sale” item because it does no state that on the receipt or in the store. ", "rating": 1}, {"title": "It’s like they don’t exist when you need to communicate with customer service.", "text": "I placed an order and have a question, I can’t call because I am working but there is no other way to get ahold of this place. I sent an email and I wasn’t sent an automated acknowledgment that the email was received nor has anyone replied. Why would I spend money at a place I can’t comfortably communicate with. I will update you all when and if I hear back from them.", "rating": 1}, {"title": "After being treated like crap in store", "text": "After being treated like crap in store, I then call customer service, hoping that I would get a better experience but to my surprise it was just as worst! Agent spoke very aggressively! Called a second time different agent same experience! I’m not sure what’s going on in your customer service departments but it need to placed under control! As of right now, I will never spend another penny with this company. Just please issue my refund so I can be done and for good!", "rating": 1}, {"title": "I never received my package despite fed…", "text": "I never received my package despite fed ex saying the package was delivered. This is not a good way to take care of online orders, especially when there is nobody I can talk to. 732303260437 Was the fed ex tracking number, but there is no delivery there. ", "rating": 1}, {"title": "Very disappointed with your return…", "text": "Very disappointed with your return policy! I received a gift from the 1333 Western Ave Chicago Heights location,all I wanted was an even exchange I couldn't because I didn't have the receipt because it was a gift for Christmas. I felt very disappointed by the store manager and the cashier. I WILL NOT patronize this store anymore, i spend a LOT of money here all the time.", "rating": 1}, {"title": "Ordered my son some back to school…", "text": "Ordered my son some back to school Khaki pants. Although I sized up 2 sizes, when I received them they were too small. If you return using the SHIPPING LABEL they provide, be aware that you will be PAYING MORE to ship them back then what you would actually pay if you shipped them using your own label! Very disappointing, will NOT be buying from this site again.", "rating": 1}, {"title": "The purchase itself was fine- but 7 marketing emails in 36 hours is insane", "text": "The purchase itself was fine. I placed my order less than 36 hours ago (first time ordering) and I have gotten 7 marketing emails in that time frame. My purchase has not even been mailed to me yet and the marketing is ridiculous. I will not be buying from your company again and I’m tempted to return my purchase because of the ludicrous marketing tactics. Cool. It.", "rating": 1}, {"title": "First of all I never received my order", "text": "First of all I never received my order. I contacted FedEx. I'm going by my tracking number it says it's been delivered. I call Walgreens 394 Campbell avenue in West Haven Connecticut. They said there's nothing there with my name on it. So where is the package? And I have no intent on paying for anything I never received", "rating": 1}, {"title": "I have always been a Rainbow customer", "text": "I have always been a Rainbow customer, however I think I will no longer shop with them. I order online quite often. The last order I did FedEx delivered to the wrong address. I called and let customer service know, and there had to be an investigation. Well at the end of that I couldn't get a refund. But I live in a total house that looks completely different and you can see the address numbers displayed. So I think I am done with online ordering.", "rating": 1}, {"title": "I placed and order few days ago bought…", "text": "I placed and order few days ago bought 2 shirts one came damaged with a hole in it that was highlighted in btw 2 orange marker lines! If customers are paying money they shouldn't be sent returned items or damaged items. It's completely unfair! I had to go re-order the item before it being mailed back because their was only 1 left in stock. There's no store where I live in CT so bringing to a store is a hassle.", "rating": 1}, {"title": "The last time I ordered some boots for…", "text": "The last time I ordered some boots for $34.99 they wasn't actually size they were size 11 and they were to little when I called for refund Rainbow employees refused and I'm stuck with something I can't were made me thought twice about ordering again", "rating": 1}, {"title": "Great prices but poor customer support!!!", "text": "I never received my order!!! And have been going back and forth with “customer support\" for the last 2 weeks! To only be given the runaround. I have been demanding a refund and all I got was the same runaround. Be careful when buying anything from them!! Make sure to check on your packages!!!", "rating": 1}, {"title": "I brough light blue Lugg sandals", "text": "I purchased shoes from Rainbow the last order was a light blue pair of Lugg sandals that were mitch matched and appear to have been worn and dry rot. That would explain the tan sandal I bought prior to the light blue sandal and the sandal was again dry rot.  I love your merchandise but please inspect it before you mail it out.", "rating": 1}, {"title": "Placed order never received an email…", "text": "Placed order never received an email letting me know the item was no lt available.order was placed on the 14 th of March was waiting on item that was purchased.Just spoke with a representative today.I was told order was not available, that's why it wasn't shipped.Will not order from rainbow online . because of this problem.I should have been notified but was not. And this company has my email.I was told my card wasn't charged.", "rating": 1}, {"title": "Delivery issue", "text": "Previously had shipments sent o P.O. Box and now the delivery has changed to FedEx. Which will not be delivered a delay shipment. There needs to be an option where we can choose how we want items shipped like lost websites do offer ", "rating": 1}, {"title": "Just called rainbow to get my money…", "text": "Just called rainbow to get my money back they talking about it's still an investigation really.i just want my money back but if it's like that.somebody wearing the clothes I ordered and FedEx ain't nothing but fools and they waiting on to here from them better off going to pick up your stuff from the store. I'm really mad.", "rating": 1}, {"title": "I paid for clothes I never received I'm…", "text": "I paid for clothes I never received I'm disabled and my package never came here I contacted rainbow they said they would reach out to me in a couple of days and I didn't hear back from anyone. I need my clothes they got their money off my bank card. This is not good business ", "rating": 1}, {"title": "Now I remember why I don't shop here", "text": "Tried to cancel order before it was even processed, I couldn't.Ordered xl swim top according to the chart, the cups fit like a small! Lg pants are large everywhere but the waist (legs and hips are huge! Waist it tiny)Size 8.5 shoes are more like a 7.5Lg top (fits in every other brand and according to size chart) is tiny and basically useless.Items show 0 reviews... because you can't leave a review on items! There's no option to leave a review and it won't let you click on the review part to add one, so you can't even warn people about sizing.Customer service sucks for trying to get help.", "rating": 1}, {"title": "Fitting rooms", "text": "It’s bad enough there was always 1 fitting room but to be closed permanently long long after covid and they say it’s permanent!! I barely/rarely shop here anymore. YOU waste your gas and time returning things cause of the ignorance of the store!! Plus the quality of clothing has sunk!", "rating": 1}, {"title": "I agree with Karen love fecexis a…", "text": "I agree with Karen love fedex is a horrible delivering company...they need 2 be shut down...rainbow yall need 2 start using ups cause fedex sucks u might never get your package or packages fooling around with FedEx they delivery company need 2 go out of business they are horrible..my packages never come or it be marked as delivered but was not delivered taken back 2 the facility cause the lazy unprofessional carrier didn't do its job delivery the my packages just pathetic..that why I prefer 2 go in the stores but sometimes they don't have in the stores wat online haves no I have no other choice but imma just have 2 wait 2 the stores get it cause I can't deal with fedex..am sure rainbowshops loved alot of customers do 2 this", "rating": 1}, {"title": "Light brown skin worker with dreads…", "text": "Light brown skin worker with dreads being racist only grab black ppl bags for check in didn't bother any other race to check in bags ", "rating": 1}, {"title": "Trying to cancel an order on back order…", "text": "Trying to cancel an order with Eloquii that is on back order and was told it couldn't be done. I have to wait receive order and pay to have it returned is what I was told.  Not understanding why I can't cancel an item on back order that has not been shipped.NEVER ORDER FROM ELOQUII AGAIN. CUSTOMER SERVICE IS NOT HELPFUL", "rating": 1}, {"title": "I have been ordering from this company…", "text": "I have been ordering from this company with no problems, spending over $200 at a time but my last order was missing 4 items and they fail to replace them! I will never shop with them again!", "rating": 1}, {"title": "Poor Communication/Service. Extremely disappointed", "text": "A pair of boots was not sent in my order.( Pointed Toe Side Zip Stiletto Booties ) I was not notified that the order would not have the item until the package arrived. I needed them for an event. Poor service on behalf of Rainbow. I’m very disappointed.", "rating": 1}, {"title": "NO FITTING ROOMS!", "text": "I took a bus, all excited & all the way to my (FORMER) Fav store : Rainbow Shoppes @ Altamonte Springs Mall in Altamonte Springs Florida . Couldn't hardly wait to buy a complete fall wardrobe @ my fav store! I love their prices & selection! I spent (wasted) 2 hours of my life building a huge $200.00 + pile of great clothes in my size . When I was ready to begin trying them on ( planned to purchase every single item), I was told by sales associate that the fitting rooms were STILL closed \"due to COVID\". Pardon me, but wasn't COVID 4 years ago? It's August 2023 ! I left & spent that $200.00 that was burning a hole in my pocket, ELSEWHERE @ this mall !", "rating": 1}, {"title": "Very disappointed with customer service", "text": "I called this morning and I opted for  a call back.When I received call back I was driving and out to lunch.I felt very rushed to place order and did not have the opportunity to take advantage of discounted shipping.I paid $7.99 for shipping when I could have bought another pair of shoes for $7.99 or more.Very disappointed", "rating": 1}, {"title": "This company has the absolute worst…", "text": "This company has the absolute worst customer service I’ve ever encountered! From store managers, online reps and even the when they reach back out to you after your complaint it’s not a sincere apology! Just enough to let you know they read your complaint. It’s really sad that’s what customer service has come to! I wouldn’t recommend anyone to shop with them! And never will I ever shop with them again! Please issue my refund for the used merchandise that you delivered to me and now giving me a hard time to get back!", "rating": 1}, {"title": "I need a refund at this point ", "text": "Im giving 1 star I ordered my items on 3/23/2024 it is currently 3/31 and I am still getting the run around. First I was told the 28th it will be here, then the 29th it will most definitely for sure be there by the end of the day. Finally here I am 3/31 no order and still no update. This is ridiculous I spent over $200 and cannot get my items in a timely fashion. At this point I just want a refund I don't even want the clothes ", "rating": 1}, {"title": "The girls who work there are awesome…", "text": "The girls who work there are awesome they showed me the newest fashion. But that Manager JESSICA is just not rite I saw her belittle these women. I also saw her use words that I can't say. I think I'm going to another Rainbow the next time", "rating": 1}, {"title": "Order severely delayed", "text": "Order severely delayed, I had to email customer support.....they should have reached out to me if they were experiencing problems, I will not be placing anymore orders with this company", "rating": 1}, {"title": "When you move to your next item the…", "text": "When you move to your next item the screen keeps jumping  back and repeating. I am frustrated with this, so I go on to another site and find similar items. Takes too long to finish shopping. Don't like this!", "rating": 1}, {"title": "The shoes are not an American size 12", "text": "The shoes are not an American size 12. I was excited for the package and quickly disappointed. The white sweater dress had no give with the off the off the shoulder seam. A medium size person is more suited for the dress. I am really disappointed. ", "rating": 1}, {"title": "Maybe not a scam completely but horrible customer service", "text": "Package gets left at the wrong place and they gave me the run around repeatedly as if I’m lying. I was already skeptical and I should have followed my gut before ordering.", "rating": 1}, {"title": "I ordered a plus size acid wash distri…", "text": "I ordered a plus size acid wash distri denim jacket and skirt for my daughter's birthday May 15th. I was happy I got my order on time. But when I opened my package I only had a jacket and not the skirt. I looked online and I found out my skirt was removed. I called customer service the lady said she would call the warehouse to see what happened because they have the skirt in stock. She also asked me if I wanted to reorder the skirt, I said no because my daughter wants to wear the outfit today for her birthday. This was the stores fault not mine. She said would you like for me to tell you how to return the jacket. I said no I can figure it out. I love Rainbow Clothing but I was very disappointed today.", "rating": 1}, {"title": "I paid for $19.99 for 2-day shipping…", "text": "I paid $19.99 for 2-day shipping got shipping info and package was not delivered customer service rep was very rude when i called and i was told that i will not be refunded for my shipping even though it was an error with your delivery service which is fedex i will never shop here again because of the way i was treated.", "rating": 1}, {"title": "Customer service is very poor because…", "text": "Customer service is very poor because I’m trying to cancel my item they said I can’t it to late what the hell!this is the first I heard you can’t cancel your item! Please explain!went you order online some store we will cancel your item right away!I don’t understand it ridiculous!!!!", "rating": 1}, {"title": "Public Store Public Restroom", "text": "Recently stopped into Rainbow and had to use the bathroom. If you want me to spend my money then let me use your bathroom. I didn't buy anything literally because of this.", "rating": 1}, {"title": "I hate that the plus size section is…", "text": "I hate that the plus size section is totally different from the women’s section. The women’s section has a better selection. ", "rating": 1}, {"title": "I ordered items and received 2 damaged…", "text": "I ordered items and received 2 damaged sweaters.  1 with a big hole and 1 with a rip, i didn’t open the package until i was ready to wear them, i just opened the box to ensure all items was in the box…. So by time i was ready to wear it, it was 3 days pass the 30 days and i was told by customer service there was nothing they could do!", "rating": 1}, {"title": "My name is Linda", "text": "My name is Linda. I went and filled out an application. There was a young lady told me that I would have to talk to the store manager. I filled out my application. I left a lot of things unfilled so I waited till Tuesday, 3 September, and I went to talk to the manager, she was very dismissive. She didn’t wanna talk to me. She told me to leave my application and that she had several interviews and that she would talk to me if she’s hiring. I didn’t like the attitude because of her going over doing detail instead of talking to me, I’ve had management experience  Associate management experience I’ve had associates sales experience so it was not a reason for her not to hire me. I just did not want to use my Social Security number because of tax identification number, so so I went back in, but not before I talked to the district manager, who assured me that he would get back with me. I call home office and someone gave me , his number, so I called him that morning to assure him that I wanted to work he hung up in my face and I did not know why so I kept calling and kept calling till I figure out what was going on, so I went back up in the store to get my application from the store manager and she said she shredded my application  Why would you shred my application is supposed to be on file 90 days a year as I began to wanna express to her how I felt, she called security and told me that I wasn’t welcome back in the store and I did nothing to her to deserve to be talk to you that way her boyfriend works for people that rob other apparel stores I did not understand. Why would she do that cannot believe that she would do that, but when a person is jealous of you and insecure of herself because of her boyfriend working there, she made a decision based on her personal relationship what they were doing illegally, but mainly because of her personal relationship, you would never wanna work at a store where a woman is jealous and have no place for a relationship in any store. This is my experience with rainbow shop. My suggestion is now I’m not welcome back in the store because of a jealous woman home office is not gonna do anything because I’ve tried contacting them , trust me you better off my application off at that store they are liars I just got off the phone with the district office. The lady from personnel told me if I go into the store that the police will be called on me for trespassing and I did nothing wrong. The manager tore my application up and shredded it the minute I walked out the office, the older lady that was chewing gum. Say you ain’t got that shredded. I’m a tear it up. She tore it up and put it in the garbage for me to be disrespected. Trying to find a job. It is unethical. I love long message with home office you need to be concerned about who you’re hiring you need to be concerned about the crooked people that works for your company I am telling you vet people before you give your information I gave all of my information my social my birthday had I gave all of this gift for what happened they would have my information my tax identification number to do whatever it is they wanted to do this is why I wait till I’m hired before I give them anything I’m not as dumb as she thought I was ", "rating": 1}, {"title": "Make customers aware before purchase …", "text": "The fact that you can’t return SHADES with the tag still attached and a receipt is absurd. It’s not earrings or underwear and when asked why it wasn’t on the receipt, I was told it’s on their policy posted in the store at the COUNTER, in normal print , when it should have been on the shade stand. Everybody doesn’t have money to just throw away. They could at least give you store credit.  I will not be shopping here again.", "rating": 1}, {"title": "I'm still waiting for my package to be…", "text": "I'm still waiting for my package to be delivered by FEDX.   It was sent ground , the tracking first stated that it would be delivered on Friday (7-21) then Sat (7-22) then it said Monday (7/24)  it is now saying Tuesday.  However when I called it was still sitting at the Fedx Hub.   I will never order from you guys again.I tried to call Rainbow but no one answered the phone.", "rating": 1}, {"title": "Received used clothing", "text": "I ordered a shirt.  When I received it, the shirt was turned half inside out.  It had obviously been worn, taken off in a twisted way, and put in a plastic bag.  I requested that it be returned and refunded since I ordered a NEW shirt.  I was told the cost to return would be the entire price of the shirt, so therefore I'd be paying for it twice in order to get a refund.  Don't buy unless you're happy with used clothes that are not marketed as used.", "rating": 1}, {"title": "Rainbow sent packages with clothes…", "text": "Rainbow sent packages with clothes upside down as a bad impression and delivery guy didn't drop it at apt door.im a loyal customer with bad respect with this company.", "rating": 1}, {"title": "Elephant bottom utility pants.", "text": "So, I ordered the utility pants....watched the girl model them....They looked so nice, but they were like elephant pants at the bottom..They would have been SO NICE if they were not so big at the bottom...sooooI bring them back to the Rainbow shop,,it said i could get the money put back on my card,,,,no, the register would not allow it, so i have to walk around with four big pieces of paper,,,one item on each sheet , until I use up my credit.beWax jeans are the best,,,I have about four pair ,,,that are at least eight or ten years old,,,and they are awesome..You have the MOM jeans, and they are good,,,just wish you could make the bottoms less NARROW....Most plus sized women do NOT have super skinny calves.", "rating": 1}, {"title": "I am very unhappy with the shoes", "text": "I am very unhappy with the shoes, totally bad design!! In the soles there are many holes that will collect mud, sand and gravel and stain floors and carpets wherever I'll go. I am asking for a full refund, because I can't be walking wearing these shoes.", "rating": 1}, {"title": "I went the store #00054 address…", "text": "I went the store #00054 address 961E.174th St Bronx, N.Y. The manager was extremely rude & very unprofessional The staff made my shopping experience so difficult and uncomfortable A/C was deliberately turned off", "rating": 1}, {"title": "The prices are pretty and I have been…", "text": "The prices are pretty and I have been shopping with rainbow for years but I can honestly say the quality of the products has gone down significantly. I placed an order and tried to reach out to cancel there was no where to cancel the items. Now that I have the items the quality on the products is trash", "rating": 1}, {"title": "I paid for expedited next day shipping…", "text": "I paid for expedited next day shipping for Christmas and it won’t be here until the 26th. They won’t refund me my money even though they haven’t shipped the order yet and I asked them to cancel it. Then the response was kind of rude. Rainbow is ghetto even online.", "rating": 1}, {"title": "I had one of the most horrible…", "text": "I had one of the most horrible experiences I have ever had at Rainbow this past Saturday 5/25/24. At time of check out there were 2 young ladies at the register and 1 line. There were 2 ladies being checked out but one was still actively shopping and the cashier continued to wait in them even with a long line forming. The other cashier was holding a non-work conversation with the customer and manager of the store in Spanish then engaging the 2nd cashier in conversation. Again there was a long line forming. After the ladies finish checking out the 1st cashier looked at me and walked away from the register. There was another customer that approached the 1st register and the cashier walked back up and waited on the customer instead of taking the next person (me) in line. I said excuse me I was next and the cashier advised that the customer was with the other group that had already left and the customer told her to wait on her pissing off me and the rest of the people in line. The manager and 2nd cashier stood by and watched the whole situation play out and all the manager said was she will be with me next. I mostly shop online but with this bac customer service I may stop shopping with Rainbow altogether.  Managers should lead by example and everybody employed at the Rainbows at 141 N Nellis Blvd, Las Vegas, NV 89110 that worked there that day should be fired. Wish I could give no stars because that's what that store deserves. Also you may want them to clean the store as it was extremely filthy. ", "rating": 1}, {"title": "I’ve written a response many times", "text": "I’ve written a response many times. Please return my payment. Rainbow should give me installments. I cannot afford full payment. Call me 5027160056 DS.", "rating": 1}, {"title": "I placed my order then after they…", "text": "I placed my order then after they refunded me for two of my items without asking if I wanted to change the size or get something else. ", "rating": 1}, {"title": "Bad customer service", "text": "Bad customer service. “Gwen” is very rude and doesn’t know how to handle business. The store is a complete mess!! My daughter’s stroller couldn’t even get through the isles. i will not be returning to this store at all. And I will not recommend anyone to shop there.", "rating": 1}, {"title": "I paid $26 for expedited 1-day shipping…", "text": "I paid $26 for expedited 1-day shipping and it’s taking 3 days. Extremely disappointed. It shouldn’t be advertised as 1-day delivery if it can’t be delivered in 24hrs.", "rating": 1}, {"title": "NEVER SHOP AT RAINBOW ", "text": "Never received my order and customer service was a nasty individual. My mistake to think \"Rainbow\" could be a credible place to shop. NEVER AGAIN!! ", "rating": 1}, {"title": "Terrible checkout experience as well as…", "text": "Terrible checkout experience as well as terrible customer service.Never ordering from your site again.Please make sure my return label comes with my package because I will definitely return these items.", "rating": 1}, {"title": "Check out does not work with the app", "text": "Check process was very hard to do I had to keep adding the items back to the cart each time I tried to check out because the system would delete my cart and make me sign in over and over again it took me  2 hrs  before I was able to place my order ", "rating": 1}, {"title": "I purchase the Denim Bustier flare mini…", "text": "I purchase the Denim Bustier flare mini dress and before I can put the dress on the zipper broke. I would not recommend this purchase ", "rating": 1}, {"title": "I got a email saying that an refund was…", "text": "I got a email saying that an refund was sent but it's not saying what it's for and there's hasn't been no refund put back on my card", "rating": 1}, {"title": "Takes way to long to get a refund back", "text": "It has token almost a month for me to get my refund and I still haven't gotten it or even an email or a reply saying anything about my order...", "rating": 1}, {"title": "There have been no order updates or any…", "text": "There have been no order updates or any indication that package has even shipped. Did my order get cancelled?", "rating": 1}, {"title": "They sent my order to the wrong address…", "text": "They sent my order to the wrong address now I am not going to receive it and someone else will give it. I am in a rehab center. I’ll be here for probably two weeks. The address you sent it to was My last apartment that I lived in, but it’s too late now you’ve already shipped it and it won’t come to me.", "rating": 1}, {"title": "Order from rainbow online which my…", "text": "Order from rainbow online which my package delivered but two of my items were missing ! Did a claim and all they denied and said the items were sent  I never received them! I even sent them pictures of the package and everything! Spoke to someone about 10 mins ago and she hung up on me!", "rating": 1}, {"title": "Shipping is way high couldn’t even use…", "text": "Shipping is way high couldn’t even use all the money in my gift card because of shipping rather went into the store and buy and there really nothing online better options in the store wouldn’t order online ever again !", "rating": 1}, {"title": "No information", "text": "I ordered something on Wednesday and still have not heard anything about my order. Which makes me think it still haven’t been shipped yet. Plus, there was only one option for shipping.", "rating": 1}, {"title": "They can just cancel.your order whenever they want to!!", "text": "I placed and order and I'm waiting for delivery then they canceles my order and refunded me with no explanation. I will never buy from here again!!!!", "rating": 1}, {"title": "Loyal disappointed customer …", "text": "I have been shopping with rainbow shop for over approximately 20years. When we had a store in Anniston I took things back with no problems. I didn’t know that if you send a return back you have to pay even though they send a free postage label. When I talked to one of the employees she said I would have to pay for the return if I didn’t use the free label that came with it. If I knew that I still would have to pay to send the items back I would have kept it. because the way the young lady explained it I sent it back. I paid more sending it back. If it had been explain better I would have kept them. A long time customer and I am very disappointed.", "rating": 1}, {"title": "They always get orders wrong ", "text": "Ordered the faux leather leggings they sent me the patten leather which is not what I ordered they always get the orders wrong!!! ", "rating": 1}, {"title": "Exchange Policy Really Needs Changing!", "text": "I am extremely dissapointed with this shopping experience because I emailed Rainbow Customer Service to help me change an incorrect sizing issue on one out of the 4 pajamas sets that I ordered, and they replied back to me saying, \"We cannot change your order information regarding sizing. Once an order is placed, we cannot modify the sizing.\" I feel that this policy needs to be changed and their Customer Service reps need to do a better job providing better customer service to their customers.I feel that such a small matter as this could have quickly and easily been resolved, but since it wasn't is why I gave this a 1 star.", "rating": 1}, {"title": "I still have not received any…", "text": "I still have not received any confirmation that my order has been shipped. How long does it take for orders to begin shipping.", "rating": 1}, {"title": "Still waiting on order", "text": "Still waiting on order. It was supposed to be here on the 15th of july.I was told to call customer service. I called and the person I spoke to was rude & told me I need to wait on a email to find out what they will do with the missing package but they didn't have to wait on the payment.", "rating": 1}, {"title": "I didn’t received all the items that I paid for", "text": "I didn’t received all the items that I was charge for and contacted customer service about the issue and it’s been more than 10 days and have not receive an answer.", "rating": 1}, {"title": "Ratchet place to shop at", "text": "This use to be a go to place for what you need. You got a man who works here he stinks up the whole store. I was told that the manager Jessica that was her son. He needs to either wash his behind or get fire. Jessica she talks to these girls like they kids. It's no wonder she still playing manager. Next time I'm taking my money over to the east side to shop", "rating": 1}, {"title": "Order was awful", "text": "Order was awful. To small even ordering size larger. Cheap material. $24.00 with $8.00 shipping and only recieved $8.15 credit on my return.", "rating": 1}, {"title": "It has been 3 days since I order and I…", "text": "It has been 3 days since I order and I do not have an update I have nothing since I places the order.  I select 3 to 7 day shipping it has already been 3 days and my order has not even been shipped yet.", "rating": 1}, {"title": "Poor processing and cancellation", "text": "I ordered 1 day shipping order is still not processed or tracked. It will not arrive in the correct time frame and is NOT allowed to be cancelled after 15 Minutes!!", "rating": 1}, {"title": "Forgot my password and wouldnt send…", "text": "Forgit my password and wouldnt send confirmation email to change it n i ordered things n it wont let me get the email to change my password terrible looks scammish", "rating": 1}, {"title": "Where is my merchandise...Klarna is…", "text": "Where is my merchandise...Klarna is ready to take another payment and I've yet to receive my order...what's going on????", "rating": 1}, {"title": "Did a review 1 month ago for some pants…", "text": "Did a review 1 month ago for some pants that suck ass. In I was told, I would get a refund in 30 days, It has been 1 month in no refund, I guess that said that to make there company look good 🤦🏾‍♀️", "rating": 1}, {"title": "They said my package came and FedEx…", "text": "They said my package came and FedEx took a picture when I saw pic it wasn't my door it was clearance and almost $300", "rating": 1}, {"title": "False advertisement for payment through…", "text": "False advertisement for payment through SHOP on Rainbow website to split payments doesn’t work! Cancelled order!", "rating": 1}, {"title": "I paid $27.99 for overnight it been…", "text": "I paid $27.99 for overnight it been literally 3nights no package. Where is my refund what I got I got must be 3 to 7 days for $7.99. I would like a refund. Then I know I order gold looks like your sending silver wrong size.", "rating": 1}, {"title": "Problems when using Rainbow gift card", "text": "It didn’t let me apply my rainbow gift card to the order, it automatically charged my Visa card that I didn’t want to use!", "rating": 1}, {"title": "Give up the 10% off…", "text": "Signed up for emails as required to get 10% off total purchase the first time, but never received a 10% discount off.", "rating": 1}, {"title": "I have been trying to create an account…", "text": "I have been trying to create an account for the past hour but the system has yet to send me a verification email", "rating": 1}, {"title": "I placed the order with the wrong…address", "text": "I placed the order with the wrong address for delivery and I contact customer service right after I did it and they have not replied to my email", "rating": 1}, {"title": "I tried to pay for my order twice with…", "text": "I tried to pay for my order twice with PayPal and thr order could notBe processed however my card was still charged so now I have 3 charges instead of 1", "rating": 1}, {"title": "Poorly", "text": "Poorly, I haven’t received my package as yet it’s been a month and a half. I’ve text customer service and haven’t heard from no one.", "rating": 1}, {"title": "I think the shipping costs was…", "text": "I think the shipping costs was ridiculous and should of been free shipping for new customers.. I'm very disappointed 8 for shipping", "rating": 1}, {"title": "You took too long to ship the items", "text": "You took too long to ship the items. 1-2 weeks is unacceptable WHEN BASED IN THE STATES. LEARN something from Amazon. Or sell your items on Amazon. Items still HAVE NOT ARRIVED. ", "rating": 1}, {"title": "I paid extra for 2 day shipping so I…", "text": "I paid extra for 2 day shipping so I can receive order before Thanksgiving, but it's coming the day after.", "rating": 1}, {"title": "My items never arrived", "text": "My items never arrived. I sent an email to customer service and have not gotten a response.", "rating": 1}, {"title": "The website is horrible it doesn’t work…", "text": "The website is horrible it doesn’t work most times when trying to order. ", "rating": 1}, {"title": "My order was cancelled", "text": "My order was cancelled, and I did not cancel it. I emailed in to see if it could've been put back on to be processed and the response email was no help", "rating": 1}, {"title": "My order was bigger than $50.00 and…", "text": "My order was bigger than $50.00 and your offer says over $50.00 is shipping free, and you charge me with $14.99 of shipping in my order!", "rating": 1}, {"title": "Order was late and I wasn’t satisfied…", "text": "Order was late and I wasn’t satisfied with the way the items looked. Returning them. I don’t see an easy way to return items.", "rating": 1}, {"title": "I recently didn’t not receive my 10%…", "text": "I recently didn’t receive my 10% discount as promised I would like a discount as promised", "rating": 1}, {"title": "Consistent unprofessionalism and lack of integrity ", "text": "Today I went to Rainbow of Maple Heights in search of a dress . I couldn’t truly enjoy my shopping experience and  I couldn’t figure out why . Not to mention he ( the manager Mr. James) didn’t acknowledge me or other customers while they were entering the store. Granted , he was training someone.. but wouldn’t you want to show exceptional customer service while you’re training a new employee??!I begun to shake and feel super uncomfortable. Finally I asked the manager short , bald black guy and alittle heavy set was he the manager about a year ago. He shared that he was . He was very nonchalant and completely unprofessional. I  shared with him distressing experience at this location that directly involved him and impacted me .  I feel compelled to share due to my experience today . ( I hadn’t been back in this location since the accident till today) While shopping, I unexpectedly passed out. My best friend asked the manager if we could use the restroom because I wasn’t well. He hastily shared “ that’s not my problem and we don’t have a restroom , NO” .  Then I passed out and hit my head on a shopping rounder . I later learned , today that he is the store manager and his name is Mr. James. My best friend and Sorors called the EMs, which is where I regained consciousness. From the information given to my support system from the EMs workers and the Police that was present with me at the store they said , the manager had absolutely no concern and no comment.  They were disappointed by his complete lack of respect and concern for his customers. Unfortunately, the manager's response was far from helpful then and today while I was sharing my concerns and my story. Instead of offering support or calling for medical assistance, the manager seemed indifferent to my situation. This lack of compassion and basic customer care was incredibly disappointing. In an emergency, one would expect the staff, especially the manager, to be trained and prepared to handle such situations with kindness and professionalism. Regrettably, that was not the case here. I urge the upper  management of Mr. James to reconsider their approach to customer safety and staff training to prevent such distressing incidents from happening to others. Today , as I politely reviewed my past experience with him he remained utterly un phased, completely nonchalant and rude as he shared “ Well your ok now … so what was I supposed to do ?? You had a people there helping you “ . Also when this incident occurred my brother Darin left a review that is also posted on this forum. This terrible experience and his lack of customer service and compassion helped me remember why I stopped going to this location. It swiftly reminded me why I drive to the shaker location. Although,  I was literally shaking and almost in tears while sharing my experience with him. He held tight to being completely unsympathetic and rude and exposed a continued a lack of empathy. I’m proud that I was able to speak to him politely and with confidence. Praying that this doesn’t happen to anyone else again. I hope that upper management recognizes the importance of safe, effective and responsible management. It’s clear that this location lacks all of the above or atleast Mr. James does. Unfortunately from reading reviews it shows that many customers still share unfavorable experiences with Mr. James.", "rating": 1}, {"title": "Why is the shipping so much this will…", "text": "Why is the shipping so much this will be my last order from u all cuz I can go in the store for this", "rating": 1}, {"title": "I hate getting follow up emails like…", "text": "I hate getting follow up emails like this that I wasn't asked for. Haven't even received any product yet. Please don't spam people.", "rating": 1}, {"title": "I haven’t gotten a confirmation email…", "text": "I haven’t gotten a confirmation email for my item, have not received my items", "rating": 1}, {"title": "Very Bag every time I go in there it…", "text": "Very Bag every time I go in there it always a problem with my returns and credit.", "rating": 1}, {"title": "I never received the order", "text": "I never received the order. It was for my grand daughter birthday. Will not make it in time now.I don't know what happened to the order.", "rating": 1}, {"title": "Paid for 1 day delivery", "text": "Paid for 1 day delivery,  have not received my order", "rating": 1}, {"title": "HORRIBLE CUSTOMER SERVICE from the manager at the Hawthorne California Store and via Telephone for Online Orders!!", "text": "I went in to the Rainbowshops Store in Hawthorne California to return a blazer that was too small. I ordered it online and the receipt had the last 4 digits of a card as payment that is different from my actual credit card number. My credit card did work when swiped but the numbers are different from the ones on the receipt. The manager was very rude and basically said I didn’t know what card I used to pay for the purchase. She said this in front of other customers and she stopped taking care of my return to have a long conversation with another customer in Spanish. The lady had just been helped by another salesperson. I called customer service and the woman I spoke with said the same thing. I explained that I only had 2 cards and the one I used for the purchase I had in my hand and Rainbow charged. I didn’t know where the other numbers came from. The manager as well as the customer service person dismissed me as stupid saying it’s not their fault that I didn’t know what card I used. I was only allowed credit or a gift card. The manager said she never heard of this happening before and asked other salespeople if they had ever heard of this-in front of other customers. I did an exchange. I called customer service again after I left the store to find out what might have happened that the numbers were different and I asked for a supervisor. I spoke with Dee who informed me that sometimes when online orders are done credit card companies use different numbers for payment instead of the actual credit card number. I called my credit card company and that is what happened. They used a virtual card number to protect my privacy but that number is connected to my actual credit card. That’s why the card worked and the payment shows on my credit card statement. The manager at the Hawthorne Store as well as the customer service agent could have told me same thing. I will never shop at Rainbowshops again. Their Customer Service in store and online (the customer service agent I spoke with via telephone) is horrible.", "rating": 1}, {"title": "I wanted to use afterpay", "text": "I wanted to use afterpay , was sent the  verification code yeet it deducted my entire purchase from my bank.", "rating": 1}, {"title": "I will never order from Rainbow again I…", "text": "I will never order from Rainbow again I order those boots and rainbow must don't have exact size cause they were 11 and still to small and I wear size 10 and I just order those pants and they sent the same pants 2 pair that I didn't order and rainbow charger to much for shipping and they look like second time around pants clothes", "rating": 1}, {"title": "Discriminatory and aggressive treatment", "text": "The cashier in charge at the time of the transaction, a heavy-set black man with a foreign accent, was dismissive at the time of the sale transaction, which my niece and I tried to handle in a friendly manner. Although from the moment we entered the store we were aggressively followed closely by a white female employee, who almost got between the racks and my niece, every time she was looking for items she liked, under the pretext of arranging the garments. Unfortunately my niece chose the Rainbow store at Franklin Square Plaza, in Bloomfield NJ, 07003, to make her winter clothing purchase, since she was interested in some items that were on the outside racks, when we were on our way to Marshalls. Unfortunately the store does not have dressing rooms, she could not try on, so she bought everything she wanted, to later return what did not fit. However, the return resulted in an aggressive attack from the same cashier with whom the purchase had been made, because he was asked to make the return in cash, he denied that the transaction was made in debit, even though it was paid with a Visa Debit card, he insisted that it was a Visa Credit card, although in the receipt says in Spanish Visa Debit. That is why I usually don't go into Rainbow stores, the clothes are poor quality, and the staff is always rude. Same cashier referred to us when my niece was paying as \"these two\", in a derogatory way, even though she was making a purchase of more than $100, to them, we still looked like thieves. I say that we got a discriminatory treatment, because I saw the cashier been polite to a young black woman who was making a transaction before us. He practically treated me as ignorant, arguing loudly and aggressively with arrogance that I didn't know the difference between Visa Credit and Debit.Not because I am Latina, certain age and speak some English, I don't know the difference, I make almost all my transactions with credit and debit cards like anybody else in this country. He stereopypes us and he chose to treat us with aggressive contempt.  He deserves a lawsuit. I asked him to print his name, he didn't want to do it, I told him that I was going to express my complaint about the terrible treatment that he had given us as well as again the employee who aggressively followed us through the entire store during this bad experience, I wanted my niece to return everything, but she wanted to keep the majority of the purchase. Because I don't like to give my money to someone who treat me badly. Although  he didn't give me his name, I found this information on the receipt:Rainbow10 Franklin Street, Bloomfield, NJ 07003Store# 01189Term# 002Trans# 408841Operator#1178JW", "rating": 1}, {"title": "I wanted to use my Apple Pay and there…", "text": "I wanted to use my Apple Pay and there was no option to use Apple Pay but on your website says I can", "rating": 1}, {"title": "My items ate hard to find.", "text": "My items ate hard to find.  I hear to drive to a store for help.  They said I couldn't order in the store.  So sad you missed out on alot of money because I loved all of the initial things.", "rating": 1}, {"title": "I clicked on a survey and it said my…", "text": "I clicked on a survey and it said my order was cancelled. I lost my 10%!! No more surveys for me after checkout!!", "rating": 1}, {"title": "Never received package", "text": "Never received package, unable to contact to make an inquiry. Email addresses are returned indicating undeliverable.", "rating": 1}, {"title": "Free shipping amount to high", "text": "Free shipping amount to high. You guy don't honor tax exemption etc.", "rating": 1}, {"title": "Pant buyers beware!", "text": "The pants that I bought were way too tight even for plus size and they look nothing like the photo.", "rating": 1}, {"title": "No sizes in the shoes I want and I just…", "text": "No sizes in the shoes I want and I just got the email about the sale! I feel like I find out last even though I’m signed up for emails about sales and everything else!", "rating": 1}, {"title": "Worst Customer Service in the…", "text": "Worst Customer Service in the Store!..Worst return policy!..I can't wait for this store to go out of business!", "rating": 1}, {"title": "I made an order and it is saying…", "text": "I made an order and it is saying unfulfilled and I can't get any information.", "rating": 1}, {"title": "I could not cancel my order one minute…", "text": "I could not cancel my order one minute after ordering.", "rating": 1}, {"title": "I see that my order was cancelled and I…", "text": "I see that my order was cancelled and I did not cancel it, what happened", "rating": 1}, {"title": "Extremely slow shipping and delivery ", "text": "It's been almost two weeks since I placed my order online on 6/4/24 and its now 6/13/24 as of yet I still haven't received any of my packages but their quick to charge your debit card right after placing and submitting your order online and then they provide the customer's with the slowest low grade shipping carrier method possible although customer's have to pay for their items to be shipped, and it should be shipped and delivered in a timely manner, a lesson learned I will never buy anything else online from this place ever again ", "rating": 1}, {"title": "The website is SO slow so I was unable…", "text": "The website is SO slow so I was unable to shop the way I wanted and look at everything I wanted! ", "rating": 1}, {"title": "The black cargo pants with the string…And the other black pants I got one of the lines tore up the same day I put them on", "text": "The black cargo pants with the string in pockets suck ass. Thanks. That sound good too me. Thanks but it’s has been 30 days no refund 🤦🏾‍♀️ Y’all need to stop with the lies", "rating": 1}, {"title": "I place a order and called customer…", "text": "I place a order and called customer service to change address a few minutes after relying the addess what wrong and customer service said they could not change it to the right adress o will never shop with this store again i soent $200 and this is the customer service i get never again", "rating": 1}, {"title": "2X it fit like a Large.", "text": "When ordering a 2X it fit like a Large.If your sizes run that small at least let people know up front.", "rating": 1}, {"title": "Couldn't use my gift card with the…", "text": "Couldn't use my gift card with the purchase and had to pay out of pocket because of the funds immediately allocating towards one order that was never submitted", "rating": 1}, {"title": "I was not able to make the purchase for…", "text": "I was not able to make the purchase for all the item I requested.", "rating": 1}, {"title": "Have not received any update on my…", "text": "Have not received any update on my order has been 7 days", "rating": 1}, {"title": "I haven’t received my purchase as of…", "text": "I haven’t received my purchase as of yet.  And the tracking isn’t working.   ", "rating": 1}, {"title": "The white shorts I bought broke the…", "text": "The white shorts I bought broke the first time I wore them. I bought them in blue as well, they were great. They both are the same size but the white ones the button came off of them.", "rating": 1}, {"title": "I'm still waiting nearly two weeks later and still haven't received what I paid for …", "text": "It's now 6/16/24 and I'm still waiting nearly two weeks now on my two separate packages that I ordered on 6/4/24 and 6/5/24 to be delivered to me, slow low grade fedex smartpost shipping & delivery partner even though we as customers have to pay for our shipping and it's very selfish and unprofessional for this company to wait this long to deliver something that I've already paid them for, and I called customer service and the representative had a nasty attitude just because I wanted to know what was the hold up on my packages being delivered to me in a timely professional manner, never will I be ordering anything else from this disgraceful trashy low classed company ", "rating": 1}, {"title": "I wanted it to go thru shop pay and it…", "text": "I wanted it to go thru shop pay and it took to out my bank all at once not happy bout that", "rating": 1}, {"title": "My order was canceled when I didn't…", "text": "My order was canceled when I didn't cancel it", "rating": 1}, {"title": "2 days express delivery not delivered", "text": "I placed my order on 11/22 with a 2 days delivery, was of Dec 1st the package  is stucked at Fedex MN an for an unknown reason, I have been asking Rainbow customer service and the only thing they repeat and repeat is \"your order is on its way\" , Fedex could not answer neither why the package is there.", "rating": 1}, {"title": "I have not received my merchandise ", "text": "I have not received my merchandise Send it was sent ", "rating": 1}, {"title": "The only thing is", "text": "The only thing is, I didn't get my 10% off from my spin. Other than that, I am blessed and really love my products from y'all.", "rating": 1}, {"title": "I never received my package", "text": "I never received my package. The FedEx delivery picture is not my home,", "rating": 1}, {"title": "What I ordered changed at the end and…", "text": "What I ordered changed at the end and you don’t get to see the change until you pay for it", "rating": 1}, {"title": "Unable to cancel within a few hours", "text": "Unable to cancel within a few hours ", "rating": 1}, {"title": "Checking out was ridiculous", "text": "Checking out was ridiculous. I would show everything that was in my cart. ", "rating": 1}, {"title": "Iam still waiting for my merchandise…", "text": "Iam still waiting for my merchandise since july", "rating": 1}, {"title": "All sizes are wrong and the fit is no…", "text": "All sizes are wrong and the fit is no good .. I'll try a different size but don't think this is the store for me", "rating": 1}, {"title": "I wanna be able to update delivery…", "text": "I wanna be able to update delivery instructions for my package", "rating": 1}, {"title": "Took my money and not giving me my…", "text": "Took my money and not giving me my order I want my money back 64.94 rainbow shops ", "rating": 1}, {"title": "Loved the shopping just hate the…", "text": "Loved the shopping just hate the overpriced shipping", "rating": 1}, {"title": "I’m not sure about how deep the gym bag will be ", "text": "I’m not sure about how deep the gym bag is and how large is the logo on the gym bag!", "rating": 1}, {"title": "It says free shipping for orders over…", "text": "It says free shipping for orders over $35, mine was over that and I paid $7.99 for shipping.", "rating": 1}, {"title": "THIS IS JULY AND I STILL HAVE NOT…", "text": "THIS IS JULY AND I STILL HAVE NOT RECEIVED MY ORDER.", "rating": 1}, {"title": "Bad checkout system ", "text": "I changed the shipping address & the system automatically changed it back to incorrect address.", "rating": 1}, {"title": "Dissapointed", "text": "Over 2 weeks, package still has not arrived.", "rating": 1}, {"title": "Not Satisfied With The Persom I Talk To", "text": "I called and told the lady that the wrong card was charged for my order can she cancel it and I redo it she told me no because it was over 15 minutes which that was a lie i placed the order at 1135 and was talking to her by 1145 because I had to hold on for someone to pick up then when I asked for a manager to call me back on this matter still haven't heard from anyone this is very sad customer service and I will not be ordering from this site again", "rating": 1}, {"title": "Wished the time to arrive was faster…", "text": "Wished the time to arrive was faster without having to pay so much", "rating": 1}, {"title": "It was very difficult to reset password", "text": "Date of experience: April 14, 2024", "rating": 1}, {"title": "Shipping charges are outrageous", "text": "Shipping charges are outrageous ", "rating": 1}, {"title": "Representative pur in wrong item & i had  to pay for right item but suppose to sent 20% off coupon thru email haven't received it yet", "text": "Representative pur in wrong item & i had", "rating": 1}, {"title": "Wouldn’t accept address for 30 minutes…", "text": "Wouldn’t accept address for 30 minutes to an hour", "rating": 1}, {"title": "I didn't receive my 10 percent off…", "text": "I didn't receive my 10 percent off discount!!!", "rating": 1}, {"title": "I was unable  to apply my discount.", "text": "Date of experience: August 14, 2023", "rating": 1}, {"title": "Do not shop here", "text": "Absolutely terrible place to shop, terrible customer service as well", "rating": 1}, {"title": "Disappointed in the service", "text": "I ordered a dress on 01 02 24 and 3 pairs of boots on 01 10 24 and it has not been shipped yet", "rating": 1}, {"title": "You refunded my order for no reason", "text": "Date of experience: August 19, 2023", "rating": 1}, {"title": "Needs to be Much Better Quality!", "text": "Date of experience: January 11, 2024", "rating": 1}, {"title": "To much money you said the more I buy I…", "text": "To much money you said the more I buy I would have had free shipping", "rating": 1}, {"title": "I still haven't received my stuff yet a…", "text": "I still haven't received my stuff yet a week later still not here", "rating": 1}, {"title": "I NEVER RECEIVED THE ITEM", "text": "Date of experience: March 03, 2024", "rating": 1}, {"title": "You offered a coupon and then it didn’t…", "text": "You offered a coupon and then it didn’t accept.", "rating": 1}, {"title": "Wrong size and clothing was worn", "text": "Wrong size and clothing was worn. Smells horrible", "rating": 1}, {"title": "I was charged for something I did not…", "text": "I was charged for something I did not order.", "rating": 1}, {"title": "Good job.", "text": "Thank you. Appreciate the help.", "rating": 1}, {"title": "No coupons", "text": "No coupons. For repeat shopping especially for holiday", "rating": 1}, {"title": "Everything was out of stock once at…", "text": "Everything was out of stock once at check out. And even after I paid ", "rating": 1}, {"title": "I don't see my purple pants that goes…", "text": "I don't see my purple pants that goes with my shirt smh", "rating": 1}, {"title": "Promo codes", "text": "Stop sending promo codes that done  work", "rating": 1}, {"title": "They are bad at what they do and it's sad", "text": "They take to long to ship out orders ", "rating": 1}, {"title": "None of the discount codes I tried…", "text": "None of the discount codes I tried worked.", "rating": 1}, {"title": "Still Never delivered", "text": "Date of experience: August 16, 2023", "rating": 1}, {"title": "No info on my order", "text": "No info on my order ", "rating": 1}, {"title": "No help at all in out of 100.00. The package was sent to the wrong state I was told it's my fault.", "text": "No help at all in out of 100.00", "rating": 1}, {"title": "Prices are good", "text": "Prices are good. Sales are great.", "rating": 1}, {"title": "Can’t use my coupon", "text": "Can’t use my coupon ", "rating": 1}, {"title": "You sent wrong shoes im pissed", "text": "Date of experience: June 28, 2023", "rating": 1}, {"title": "Terrible customer support service", "text": "Date of experience: September 27, 2023", "rating": 1}, {"title": "all items gone", "text": "Date of experience: November 27, 2023", "rating": 1}, {"title": "Improve customer service", "text": "Date of experience: November 02, 2023", "rating": 1}, {"title": "I was unable to cancel my order because…", "text": "I was unable to cancel my order because it was after 15 minutes. This is unacceptable. I made the order by mistake and want to cancel and your policy of 15 minutes does not allow me to. Its ridculous.", "rating": 1}, {"title": "I placed two orders through your…", "text": "I placed two orders through your website the first one was defined So I placed a different one this one's also pending to be declined I don't understand why I can't make an order from your website the only answer I was told was because the distances of my address and delivery address which makes no sense so apparently I cannot order things from your company", "rating": 1}, {"title": "I didn't see the affirm option at check…", "text": "I didn't see the affirm option at check out. So the whole balance was charged at one time?", "rating": 1}, {"title": "It made a 2nd dress when only need one…", "text": "It made a 2nd dress when only need one dress", "rating": 1}, {"title": "Screenshot your final cart prior to checkout!!!", "text": "I stepped away from my cart for 15 minutes and when I returned, the cart was empty. I spent an hour shopping on your site and I don't appreciate wasting my time. Had to shop all over again. Also, it's misleading to offer a 10% coupon for signing up for emails, and once the email is provided, to then additionally require a mobile number. This is literally bait and switch. If you require both the email and mobile for the 10% coupon, then by law you are required to state that up-front.", "rating": 1}, {"title": "Deceitful", "text": "I signed up for email and text to get 10%off but code didn’t work. I called to speak with you and was given a code that didn’t work. Not happy and wasn’t going to order anything", "rating": 1}, {"title": "Stay away from Chagrin location Cleveland,OH", "text": "The Chagrin location in Cleveland Ohio was one of the worst experiences of my life. Two days prior I bought a cute dress for $9.99. When I got home I removed the tag and tried the dress on assuming it fit me, but it didn't fit at all. Remember the dressing rooms are still closed due to covid so you can't try anything on in store. Two days later I planned on doing a big summer haul at Rainbow at that point I would also return the $9.99 dress. The cashier was immediately combative in not wanting to except my refund due to the tag being removed, but I pointed out to her that I had the tag with me it was just simply removed. She still being combative and condescending did not want to issue the refund. She said we can ask the manager to who her surprise agreed with me that I am due a refund. She said the tag being removed is a simple fix that they can easily put the tag back on. More importantly was the fact that I had the receipt and the dress was purchased just two days prior so they should issue my refund. I believe this bruised the young woman's ego as she was expecting the Manager to agree with her. This woman had a very very condescending attitude towards me even when she was speaking to the Manager I tried to explain how I had the tag with me and the young girl raised her hand up as if to say \"talk to the hand\" because she too was speaking with the Manager. So already her tone was extremely arrogant and condescending toward me.  Next I began my huge haul that took almost two hours of shopping. From picking out clothes to standing in the mirror along with other women having to literally put clothes over are own clothes to see if they would fit, since the store has not reopened the changing rooms. As you can imagine this was extremely frustrating. So after two hours of this I was finally finished and ready to cash out. The only cashier available was the woman I had trouble with earlier. She began ringing up all the items which was extremely time consuming because I had roughly $500 worth of clothing. I had dresses, shorts, pants, jewelry etc.. that took up most of the counter space. As she began to ring up one blouse in particular she noticed it did not have a tag. She asked if I could pick out another one that might have the tag on it. To my surprise none of them had a tag and I took a few to her to show her. She then asked if I got these blouses off of a rack because if they weren't tagged they probably weren't supposed to have been put up yet. I told her they were on the rack. She then said well \"If there is no tag I cannot sell it to you\" I really wanted the blouse it was one of the few items in my haul that really stood out to me. So I said can we ask the Manager we spoke to earlier if she can find out what the price is because I really want this. She calls the Manager over and starts being difficult again exclaiming how she can't sell it to me. Then I asked if she wouldn't mind seeing what the price is. The Manager walked over and also didn't see a tag so she picked out another top on the same rack, similar style and told her to ring it up for that price. To which the confrontational casher replied \" I don't want to do that\" At this point I am now furious what do you mean YOU don't want to do that? Your superior gave you an instruction you have to do it. So I got mad and told the woman \"Look you have been confrontational with me ever since I walked in here earlier to return the $9.99 dress. You are just looking for a reason to be combative towards me. So I tell you what since you don't want to ring me up, I don't want to spend the $500 I was planning on spending how about that. To which she replied \"fine, cool\" So I said you are going to let a blouse that is worth roughly $25 to stop the store from receiving $500 in revenue? She says \"that's just fine\" So to wrap this all up this woman allowed a $500 ticket to leave the store in the middle of a recession over a $25 blouse and her ego! Asinine and I want her fired!DO NOT  I repeat DO NOT EVER shop at this location.", "rating": 1}, {"title": "Need a bigger selection of clothing…", "text": "Need a bigger selection of clothing over size 3X. Many women love shopping & just because some of us are plus sized, doesn’t mean we don’t want to look nice. We just don’t want to spend an arm & a leg in the process.", "rating": 1}, {"title": "I never received my item and the…", "text": "I never received my item and the customer service department stated there was nothing they could do.  I was so disappointed I had ordered that item for a birthday day gift for myself. I haven't been able to get myself anything after covid and all that the economy has been going thru for awhile. I finally got a little sense of peace to feel good about myself and didn't when receive anything.  Thanks for the horrible experience and service", "rating": 1}, {"title": "I was charged twice", "text": "Date of experience: June 06, 2023", "rating": 1}, {"title": "Can’t even ship or pick up locally in…", "text": "Can’t even ship or pick up locally in my town fontana CA you guys need to update the site! I’m very upset first time I’ve ordered online and will be the last time", "rating": 1}, {"title": "cannot track my package", "text": "Date of experience: June 01, 2023", "rating": 1}, {"title": "Not to good", "text": "Not to good. Takes an extremely long time to deliver order & tracking doesnt work with fedex. Always says that they cannot track package, try back later. Its been 2 wks since i placed my order. All items were in stock, whats the hold up ???", "rating": 1}, {"title": "Understanding that policy is policy &…", "text": "Understanding that policy is policy & that staff members are trained to always repeat & never wavier, but the demeanor in which supervising staff (store managers) & customer service representatives speaking to customers should should be addressed. Blind observations to evaluate the real truth how many are treat would become certainly clear. Truly a disappointing experience.", "rating": 1}, {"title": "Rainbow town an country needs trained again “ Manager & Staff", "text": "Rainbow town an country needs costumer service training They don’t offer to put your stuff in the counter “Then when your trying to spend big and put your stuff on the side they put it back . The woman who said she was the manager short hair with glasses and dark skinned acted clueless like she had no idea or experience, then watched me through the store “ yet offered no help “To young to vibrant to miss-such  a simple TaskMy experience sucked “I felt stereotyped!!It’s a lot of good clothes There But the store was dusty We now know their life story now  instead of what we where looking for or what we wanted to know  , it’s a shame a lot of people love town country But many have complaints about management and the upkeep Shoes and clothes was  all over the floor “And it was plenty if un helpful staff One gal was flying around putting stuff back when they felt like it “But only off a rack tucked in the middle of the store !!False advertising with out honor Smh 2nd time and I rather wobble  down to city trends *****Atleast they are honest and helpful", "rating": 1}, {"title": "There was an error in placing my order", "text": "There was an error in placing my order. I went to cancel it immediately, and there was no option to cancel, it said you can cancel your order within 15 minutes, it had not even been one minute, so why can’t I cancel? I’m not happy with my credit card was charged and I can’t cancel the order.", "rating": 1}, {"title": "cancelled my order for no reason", "text": "Date of experience: June 01, 2023", "rating": 1}, {"title": "can’t cancel my order after i out the…", "text": "can’t cancel my order after i out the wrong address", "rating": 1}, {"title": "I never received my order or refund", "text": "Date of experience: May 07, 2023", "rating": 1}, {"title": "Awful", "text": "Awful, everything went wrong. I ordered 5/14/23. My package said delivered on 5/17/23 but I still have not received any package. I send two emails about getting my money back. I still don’t have my package or my refund and we are on 5/29/23. Never ordering online at rainbows", "rating": 1}, {"title": "The dressing rooms are closed…", "text": "The dressing rooms are closed indefinitely. You only get 7 days to get your money back or you have to take store credit. If you aren't sure about your size you will make 2 or 3 trips. If you receive a gift from here you cannot bring the merchandise back without the original receipt. Most ppl don't think to get gift receipts so they, Rainbow, gets to keep money and you are stuck with close that don't fit.", "rating": 1}, {"title": "I had the worst experience I have ever…", "text": "I had the worst experience I have ever had shopping at Rainbow on 26100 Greenfield Rd Oak Park Mi 48237.On 5/15 I brought a tshirt. First of all they don’t have any dressing rooms or mirrors in the store and when I tried on the Tshirt at home it didn’t fit correctly. I brought the tshirt back on 5/24 around 11am and the manager whose badge read miss b dumped the bag on the counter a tag to a different tshirt fell out and she instantly told me oh you can’t return this because the tag is not on the tshirt but she didn’t look at the tshirt to see if there was a tag. She had a really nasty attitude. When I got home I pulled the tshirt out of the bag and I saw the tag on the tshirt and I discovered a loose tag in the bag. So on 5/25 I took the bag back to the store and I also wanted to purchase other items. When I Was ready to check out I gave her the bag and told her of the mistake that was made.She instantly started yelling at me and accusing me of bringing in a different tshirt that did not match the receipt. I was trying to explain to her what happened and she started yelling and over talking me. So I asked her to just ring up my other items and she said I don’t have to ring up anything for you and you can get out of my store I don’t have to do anything for you. I asked her why and I said I’m a customer and you’re refusing to ring up my items she said yes but gave me no explanation of why. I asked the young lady next to her could she do it and the manager told her not to and she agreed. I then asked for the corpora number and she said you can google it so I did. I explained  to them what happened and they said they would call the store. After the corporate lady called the store and talked to the manager she let the other cashier ring up my items, but now there is an investigation for me returning my shirt. The shirt does not fit and I don’t want it. I’m not trying to be difficult but my receipt and tag matches so I am entitled to a refund. This took 30 minutes for me to resolve and it was completely ridiculous for someone who works in the store to refuse to let me purchase things from the store. She is not the owner what right does she have to do that. She was very rude with a horrible nasty attitude she has no business being a manager and she needs customer service training. I still want the refund corporate is supposed to be following up with me I am expecting a phone call but I would no longer shop at rainbow and I will make sure I let others know about my experience.", "rating": 1}, {"title": "Because I’m trying to cancel my order…", "text": "Because I’m trying to cancel my order and it’s not working", "rating": 1}, {"title": "I changed my mind 20 minutes later to…", "text": "I changed my mind 20 minutes later to cancel the order wasn't given a option to cancel in such a short time", "rating": 1}, {"title": "Double Charged", "text": "Placed a order and system stated payment was not made due toAmount change and entered my information again only to be charged twice.", "rating": 1}, {"title": "Very bad", "text": "Good evening, my order was supposed to arrive today and I did not receive the package.", "rating": 1}, {"title": "Bought dont buy this product it seems watered down and very weak2 bottles of  solutions for my…", "text": "RECEIVED  2 bottles of  solutions for my Rainbow vacuum cleaner today , the product was nothing like it was in the small bottles,either it was old or watered down .The only option was to buy 2 bottles  so it was a expensive mistake and before  you ask for a refund  the site says you can't get a refund  .Got it today and added several caps still very weak.several people have complained about the same thing ,but of course  none of this info was seen when I bought it.So disappointed, not the money it's the principal  of buying something that doesn't meet the standards that your use to.NOW COMPANY  TRYING TO SAY THIS IS NOT THEIR SITE SAYING I WAS COMMENTING ON A VACUUM CLEANER, NO I WAS COMMENTING  ON THE SCENTS THEY SELL NOT A VACUUM CLEANER", "rating": 1}, {"title": "Payment clitch", "text": "After my order was place the system automatically used shop pay without verification with me if I wanted to use this method of payment and would not allow me to cancel my order", "rating": 1}, {"title": "I have spent the last few years…", "text": "I have spent the last few years ordering off of rainbow and have never had an issue and the last order I placed I never received I'm not sure what happened so I place the call the customer service and the very first thing that was said was we don't replace stolen orders which is fine but I feel like it should have been looked into first before it went directly to that and because the young lady that answered couldn't do much more for me I asked to speak with a supervisor they did call me back 2 days later because I was at work unfortunately I could not answer the phone so I called back they said that the supervisor couldn't talk to me that they would give me a back or could they respond via email I never got an email or a call back I have called three times since and still I have no calls back no answers it's almost like let's just not respond and they'll go away I work in customer service and I know there are rules and regulations but the fact that it's been going on two weeks and I still have not heard from anyone lets me know that customer service is not their top priority so as much as I love shopping on here I will never spend my money with them again", "rating": 1}, {"title": "Worst customer service ever", "text": "So I wrote a review about how you register for their promotions and you get bombarded with many text messages and emails then their promotional codes don't work then someone responds back to my review I called the customer service number listed spoke to a Tamara she stated that that's normally not what they do I have requested for a supervisor to call me back leaves me a voicemail asking me to send an email or the screenshot of the review with your organization telling me that you guys would take care of it and make it right You guys are the worst I want a full refund on my order at this point I think it's supposed to be delivered tomorrow You come back and pick it up because I work hard for everything I get in life and I don't choose to spend my money with an organization so horrible as rainbow!!!", "rating": 1}, {"title": "It's Late and now FedEx says they don't…", "text": "It's Late and now FedEx says they don't know when it'll be here 😡", "rating": 1}, {"title": "Your associate was rude and impatient…", "text": "Your associate was rude and impatient with me while on the phone.", "rating": 1}, {"title": "Always out of my size or out of stock", "text": "Always sold out or sizes are running too small, really cute clothes just not enough 4x's or size 11 women's shoes", "rating": 1}, {"title": "I returned a pair of boots almost 2…", "text": "I returned a pair of boots almost 2 months ago and haven't received a refund yet.", "rating": 1}, {"title": "It wouldn’t let me cancel within the 15…", "text": "It wouldn’t let me cancel within the 15 minutes. I went to cancel at a 2 minute mark and received an error message", "rating": 1}, {"title": "I HAD A CODE HOWEVER THE SYSTEM WON'T…", "text": "I HAD A CODE HOWEVER THE SYSTEM WON'T TAKE IT YOU TEXT ME AND EMAIL ME ALMOST DAILY NOW WHEN I PLACE AN ORDER I DON'T GET THE DISCOUNT", "rating": 1}, {"title": "was very disappointed", "text": "was very disappointed.   said we could put in a code for 10% off..it wouldnt do it at the end..decided to go ahead with order so not to disappoint my daughter.  don't think I will be making any more orders..we do most our buying on line.", "rating": 1}, {"title": "No 10% discount like advertised", "text": "You offer a 10% discount to sign up but I never received it.", "rating": 1}, {"title": "I thought it was gonna be a fully…", "text": "I thought it was gonna be a fully outfit but it wasn’t and I just wasted my damn money", "rating": 1}, {"title": "Don't order anything from your company", "text": "You claim that your company cannot change anything on my order that is not true the address that is on the shipping part isn't my address", "rating": 1}, {"title": "I shouldn't have to call to request…", "text": "I shouldn't have to call to request that my shipping info is emailed. Yet I do & why I will not place another order. Or recommend that anyone else does", "rating": 1}, {"title": "ripped off", "text": "i never ordered online and a dress only sold in the stores in plus sizes wasnt available in regular sizes but available online the black and white newspaper tank dress was vintage style due to mewspapers not really available anymore but i necer ordered from you online i save by going into the store the 7.99 shipping fee was as much as the dress which might not even fit right so i called your customer service shortly after placing the order april23 2023 at around 10.30 am and after a wait to speak to a customer service rep who was going to give me a free coupon for shipping i found out if i could cancel the order i could reorder  the item and save on shipping but it was a 15 minute window to cancel thats outrageous and i should be able to gotten the dress in the store bsince you sell it in plus sizes so i get ripped off and charged double for the same dress that i cant use in a plus size i need to hear from someome its not fair and i know you dont care but i will not shop at your store you should have the item in all sizes again i hope someone gets back to me but i doubt", "rating": 1}, {"title": "The bag was opened and I didn't receive…", "text": "The bag was opened and I didn't receive my accessories (bracelets) in my order.", "rating": 1}, {"title": "i shop at rainbow stores in person…", "text": "i shop at rainbow stores in person there is a tank dress i wanted in black and white newspaper print but only plus sizes i could only order it online my order number is 374853 and im a size small what bothered me was the 7.99 shipping and the dress i cant get in the stores at all in regular size  and the dress is 7.99 so that bothered me ive never ordered from rainbow online i ordered around 10 28 am and called customer service about any way to have it delivered to the store for free pickup but the cusyomer service rep said she would give me a coupon code for free shipping i called and was on a long wait got thru around12.09 pm outside what i found out was a 15 minute window to cancel this order so im not real happy i shoudnt have to not be able to pick up an item offered in plus sizes and not regular sizes its like a discrimination and shipping of 7.99 same price as a dress i cant get in the rainbow store or store pick up i feel ripped off i never would have thought theres only a 15 minute window to cancel yet the customer service rep would ghave given me a free shipping code i am now aware of this and will never shop online again unfair that i have to be a plus size to get an item that if available online should be available in the store my phone number is 954 254 3203", "rating": 1}, {"title": "Too long for order to arrive…", "text": "When you order your items you should get your order 3 to 5 days after your purchase not 2 weeks people order things for trips, special occasions and it takes more then 14 days to get your order", "rating": 1}, {"title": "I need to cancel this order", "text": "I need to cancel this order.  Was trying to check the price and it charged my credit card", "rating": 1}, {"title": "Attempt to update the order immediately…", "text": "Attempt to update the order immediately after realizing the size was wrong and unfortunately was not able to.  Very disappointed and will not be using rainbow in the future.", "rating": 1}, {"title": "I went to check out to pay online and…", "text": "I went to check out to pay online and the shipping automatically went to 1 day and charged me 26.00. Tried contacting they said its too late.. be careful went checking out the scheming...", "rating": 1}, {"title": "No think you don't need to do nothing", "text": "Date of experience: April 18, 2023", "rating": 1}, {"title": "You sold my dress I wanted it was in my…", "text": "You sold my dress I wanted it was in my cart to buy", "rating": 1}, {"title": "Very easy to order", "text": "Date of experience: April 16, 2023", "rating": 1}, {"title": "Double check Different options to pay", "text": "I was trying to pay with klarna I was directed to there website , I did everything they requested, but my debit card was charged the full amount, which was about $100 so I don't think I will be ordering from rainbow shops, I wasnt expecting a $100 withdrawal from my checking account", "rating": 1}, {"title": "My discount didn’t work", "text": "Date of experience: April 14, 2023", "rating": 1}, {"title": "I was hopeing to get my package before…", "text": "I was hopeing to get my package before Monday", "rating": 1}, {"title": "You need to find another delivery…", "text": "You need to find another delivery besides FedEx because fedx did not deliver your packages all time", "rating": 1}, {"title": "IT WOULD BETTER AND CHEAPER FOR THE…", "text": "IT WOULD BETTER AND CHEAPER FOR THE CUSTOMER IF YOU HAD PICK UP FROM THE STORE!!!!", "rating": 1}, {"title": "I placed an order which then hours…", "text": "I placed an order which then hours later told me it was cancelled. With no explanation as to why. I have a serious trip to go on next Sunday and really needed those items as well as being an amputee.", "rating": 1}, {"title": "I haven’t received my order yet and I’m…", "text": "I haven’t received my order yet and I’m still waiting", "rating": 1}, {"title": "The website said that I would get a 10%…", "text": "The website said that I would get a 10% discount on my order when I checked out I could not find the discount code to use", "rating": 1}, {"title": "I ordered clothes online on the 10th of…", "text": "I ordered clothes online on the 10th of March and I got an email confirmation for that order. A couple days later I got an shipping confirmation for my order. When I tracked it out kept saying delivery date is pending. I called FedEx to find out what's taking so long and they said it's stuck on a truck but has not been delivered. FedEx told me to contact rainbow shops for a refund. I spoke with someone from customer service from rainbow and they informed me they were opening an investigation on FedEx to find my package and to give me my refund. That was the 17th and it's the 24th and u haven't received an email back confirming my refund. Why is it so difficult to get my money back when it's so easy for your company to take my money?", "rating": 1}, {"title": "I don't want this order", "text": "Date of experience: March 23, 2023", "rating": 1}, {"title": "Shipping", "text": "I payed 11.99 extra for fast shipping and I still waited more than a week for my order", "rating": 1}, {"title": "I have had to wait for over two weeks…", "text": "I have had to wait for over two weeks for an order. Should have been here Friday then it said Saturday then it said Sunday now it says today and it’s 530 and I have no order never ever again.", "rating": 1}, {"title": "As a first time customer I did not…", "text": "As a first time customer I did not receive 2 orders. #3642539 Knit Cami Nude Dress & #3657528  Mocha Pants legging. Can I get my refund", "rating": 1}, {"title": "I placed an order and the site did not…", "text": "I placed an order and the site did not tell me when the order was due to ship or arrive.", "rating": 1}, {"title": "I couldn’t get my discount it would not…", "text": "I couldn’t get my discount it would not take the referral", "rating": 1}, {"title": "got two day shipping did not come here…", "text": "got two day shipping did not come here in two days", "rating": 1}, {"title": "CUSTOMERS BEWARE!!", "text": "CUSTOMERS BEWARE!!! THEY RIPPED ME OFF!! They do not give refunds on many products and have terrible customer service in store and even much much worse on the phone. They care absolutely ZERO about retaining any customers whatsoever. Go somewhere else", "rating": 1}, {"title": "If I could negative stars I would I was…", "text": "If I could negative stars I would I was going to try something on over my clothes she said you can’t try on anything here. Rude as everything she need to be fired that was my first time there and I was never greeted. Then someone came in saying they might have Covid and she kept talking to them. I will never return. I would rather spend my money elsewhere. So don’t go to the Gadsden store.", "rating": 1}, {"title": "Never offer anything to customers...", "text": "Date of experience: March 15, 2023", "rating": 1}, {"title": "Disappointed", "text": "I have been a loyal customer for many years and two days ago I placed a 200+ expedited  shipping order and none of the jewelry arrived. I hope Rainbow can fix this and refund my money back after they investigate what happened. I would hate having to return the whole order and shop somewhere else because somebody decided to keep the jewelry for themselves and not ship it. I feel very disappointed…", "rating": 1}, {"title": "I was charged two times???", "text": "I was charged two times???? How??", "rating": 1}, {"title": "Still have not received my order…", "text": "Still have not received my order communication with customers in regards to orders could be a lot better when something has gone wrong somewhere regarding purchase", "rating": 1}, {"title": "There is no system in place to cancel…", "text": "There is no system in place to cancel an order", "rating": 1}, {"title": "Loved the jacket but button was broken…", "text": "Loved the jacket but button was broken off :(", "rating": 1}, {"title": "I never received the product I purchased", "text": "Date of experience: February 28, 2023", "rating": 1}, {"title": "Should be FREE shipping to stores…", "text": "I buy stuff from other stores like Cato, Lane Bryant, etc., and is FREE the shipping to the stores, I bought this 2 dresses because I really liked them, and they were NOT available in the store that I went in Seffner, FL., but really NOT buying anything else until this change, (if change), TKS", "rating": 1}, {"title": "Worst store sell rip up clothes and…", "text": "Worst store sell rip up clothes and don’t want to exchange it very dishonest", "rating": 1}, {"title": "My experience was GREAT because all of…", "text": "My experience was GREAT because all of the items I wanted were still available. I seem to miss out and I'm a daily looker on the RAINBOW SITE. I have just 1 small suggestion. Can you possibly have more of your JEANS & PANTS come in longer lengths. Us plus size ladies aren't only wide, but tall too.", "rating": 1}, {"title": "Horrible experience", "text": "Horrible experience. Both items I ordered were sent in wrong size. I’m currently at the store returning the items.", "rating": 1}, {"title": "First and last time buying shoes from…", "text": "First and last time buying shoes from rainbow! I got sucked in by the huge sale gave it and go and every pair of boots i received were falling apart after one day wearing at my desk job! Just straight up cheap quality all around. Their shoes aren’t worth $5 let alone $15/$20 on sale and not to mention $29 and up regular price. I picked up my package from usps wore a pair to work and by the time i was clocking out and walking to my car the entire sole of the shoe was next to coming completely off. Then the next day trying to stay positive wore the combat boots i ordered they were comfortable all day got home and the inside padding/cushion is already coming undone", "rating": 1}, {"title": "THE SYSTEM CHANGED MY ORDER", "text": "THE SYSTEM CHANGED MY ORDER. I ORDERED TWO WHITE LONG SLEEVE TEES, NOT GREY OR CHARCOAL. I CONTACTED RAINBOW BEFORE IT WAS SHIPPED BUT THEY'RE GOVING ME A HARD TIME ABOUT FIXING THE ISSUE.", "rating": 1}, {"title": "You kept taking me to regular sizes…", "text": "You kept taking me to regular sizes instead of plus sizes. I wanted to see measurements  on the clothing I  buying but giving only 1x size.", "rating": 1}, {"title": "I did an order of course", "text": "I did an order of course. Then, it cancelled. Immediately. Stating it was cancelled by me.  I wanted my items.  Now I have to find a shop and hope those same items are readily available.", "rating": 1}, {"title": "Expensive shipping and amount you have…", "text": "Expensive shipping and amount you have to spend to receive free shipping", "rating": 1}, {"title": "I love your prices", "text": "I love your prices I'm a plus size and the tops are always made to short like for a small person..I'm very conservative please add some length to your tops..have 3x and 4x at the stores", "rating": 1}, {"title": "Never received my package", "text": "Date of experience: January 09, 2023", "rating": 1}, {"title": "Most of the clothes run small", "text": "Most of the clothes run small, if it wasn't a Rainbow in my area for me to return the items I don't want I wouldn't shop here", "rating": 1}, {"title": "Took too many times to get order…", "text": "Took too many times to get order processed. Took too long to get the order purchased.I did contact you on the 1800 number and still did not get any assistance with it. The representative was rude and condescending.", "rating": 1}, {"title": "I placed the order and then you…", "text": "I placed the order and then you cancelled for no reason. I’m so disappointed!", "rating": 1}, {"title": "Had to place the order several times…", "text": "Had to place the order several times before it actually went through plus I tried a 20% discount it didn't work.", "rating": 1}, {"title": "After getting all my stuff n ready to…", "text": "After getting all my stuff n ready to purchase it keep telling me FedEx n usps sauy my mailing address was wrong for so long i had to call the number provided. They told me they do see a problem on there end but I should get the numbers of the items n call bk.why would o do that .", "rating": 1}, {"title": "Disappointed 😥", "text": "My order was canceled and I don't know why. No explanation. Just your order was canceled payment voided. However Klarna took the payment and sent me a payment schedule. So so disappointed.", "rating": 1}, {"title": "I have yet to receive what I bought", "text": "I have yet to receive what I bought. The tracking number does not work. I am not able to contact you.", "rating": 1}, {"title": "Sizes are completely off", "text": "Size of clothing is about 3 sizes off.", "rating": 1}, {"title": "A long time ago the clothes were very…NOT HAPPY", "text": "A long time ago the clothes were very good quality but now it’s so cheaply made and the styling is very poor, especially for plus women clothes. The dresses and skirts are so poorly made and designs are to. Please why use china to make your clothes. I’m not in favor of china at all. Dresses and skirts are too short. Shipping is to high.", "rating": 1}, {"title": "Delivery nightmare.", "text": "I never received my package. I emailed and was send a picture of two bags on the floor saying it was delivered and I sent back pictures of our mail room which I had went down to check twice during the day and thee was nothing. Really upsetting since I want the cloths for an up coming trip.", "rating": 1}, {"title": "i didn’t get my 2 pairs of boots i…", "text": "i didn’t get my 2 pairs of boots i called and complained still no response", "rating": 1}, {"title": "Poor website setup", "text": "I purchased 2 items. One was not in sock after my order was completed and the refund amount is showing $0.00.", "rating": 1}, {"title": "Someone else was able to use my credit…", "text": "Someone else was able to use my credit card.  Don't store your card here if you do anyone can use it and you won't know until you get an email. Buyers Beware", "rating": 1}, {"title": "Shipping too high", "text": "Date of experience: January 30, 2023", "rating": 1}, {"title": "I’m upset because the 10% never applied…", "text": "I’m upset because the 10% never applied and the dresses and boots sold out in my size. It always happens about the 10% and it gets to be slim pickings with the size.", "rating": 1}, {"title": "I got charged twice", "text": "Date of experience: January 28, 2023", "rating": 1}, {"title": "I SPIN THE WHEEL FOR MY 10% DISCOUNT I PUT IN THE CODE IT DID NOT TAKE MY CODE U SENT ME", "text": "I SPIN THE WHEEL FOR MY 10% DISCOUNT I TYPE IN THE NUMBER YOU SENT TO MY MESSAGE VERIFICATION CODE WAS 393912 IT DID NOT TAKE IT", "rating": 1}, {"title": "Website not very user friendly", "text": "Website not very user friendly Could of got some discounts but codes would not take. I hope that I receive the items and enjoy them", "rating": 1}, {"title": "The company didn’t send me what I…", "text": "The company didn’t send me what I ordered, I was missing 4 items. The facts are that 13 items were ordered 4 out of 13 missing. The customer service isn’t pleasant and my frustration is justified. The customer representatives show no empathy and had me hold 45 minutes and hung up on my face about the online order. I sent a email detailing my frustration and the response back I received was very unprofessional. They said we had a bad connection which is not facts the last representative said she was discussing it with a manager. The response was inappropriate as they said they will not refund me very condescending.", "rating": 1}, {"title": "My Two Cents", "text": "Even though my order came to $49.98. I'm still being charged a shipping fee. First & Last order for me.", "rating": 1}, {"title": "You sent me a 10% off code that I…", "text": "You sent me a 10% off code that I couldn't use because it was not valid. I placed my order anyways, but you should modify my order and refund me the 10%z", "rating": 1}, {"title": "Gift cards should be a method of…", "text": "Gift cards should be a method of payment! I got a $150 gift card for Christmas that I can’t do anything with. The rainbow store in my town doesn’t have any of the same clothes in the store that they do online. The next closest store is an hour away.", "rating": 1}, {"title": "No discounts available as stated", "text": "Wasn’t able to use 10% discount because I was never offered a code, that was irritating.", "rating": 1}, {"title": "If you pay with PayPal when you go to the store you can only get a store credit.", "text": "The company can start by waving the shipping fee like other companies do when the order is incorrect also rainbow can let people know in advance of you pay with PayPal you cannot do a return at the store they will give you a store credit.", "rating": 1}, {"title": "I ordered 3 the same colognes I had…", "text": "I ordered 3 the same colognes I had been using that smell for a long time I received them they have filled with water and something else it’s not even close to what I ordered for. I want to get myMoney back. They’re fraud don’t trust this website", "rating": 1}, {"title": "I never got a response", "text": "I never got a response about the online bug issue with my wishlist. It's completely unacceptable.", "rating": 1}, {"title": "Never got it been calling an no…", "text": "Never got it been calling an no solution it’s frustrating was Xmas gifts", "rating": 1}, {"title": "I hate that I cannot cancel my stuff", "text": "For one I don't know what's up with your website it kept on glitching and then two I was trying to cancel my purchase because it had got charged on the wrong card but you don't even not open for me to cancel so that suck yeah so my experience with you guys I would never ever shop online with rainbow again sorry not sorry please don't call my phone", "rating": 1}, {"title": "Shipping was supposed to be 3-7 days", "text": "Shipping was supposed to be 3-7 days. I received a confirmation on day 2 that order had shipped.  It is now day 9 and the ups link still is invalid. I called on day 5 when link was invalid and received a garbage statement that link wouldn’t work until package received by local ups.  Website won’t show anything for my order number/email and ups link doesn’t show it is a valid number 7 days after email sent saying my order was shipped.", "rating": 1}, {"title": "Never received my package", "text": "Never received my package, now I’m waiting for anyone to reach out for my package whereabouts or my money back!", "rating": 1}, {"title": "I was told in my local store that my…", "text": "I was told in my local store that my gift card would work online, which is also stated on the gift card itself... gift card does not work online.", "rating": 1}, {"title": "Placed a free standard shipping order…", "text": "Placed a free standard shipping order 3-7 day delivery, the package sat with FedEx for 7days. Called rainbow shop for them to trace the package they (rainbow shop) provided a tracking number for USPS. Tracked the package through USPS it stated they received electronically 12/21/22 from the shipper to send via USPS which is odd, I order from the rainbow at least once a month and this has never happened before. On 12/22/22 FedEx sent to usps which took even longer. Make a long story short it took 13 days for my package to be delivered, which is way over the rainbow shop standard delivery. FedEx had a delivery date listed for 12/22/22 once they received the instructions from the shipper (rainbow) to send via USPS they did just that. FedEx has a responsibility as well, they held the package for 7 days instead of delivering it. The package went all over town before I received it. I placed a premium delivery order 12/28/22. Once again FedEx displayed a delivery date 1/1/23 I considered a holiday no delivery for a Sunday. Checked today my package is in a different part of town from where it's normally delivered from. Smh I can already tell it's going to be the same thing outside of the delivery time 2-5 days. If the rainbow shop is going to us USPS start with them and end with them it's too much handing packages off to another party to deliver. The online selection is better than the store selection which keeps me ordering online. I will say once USPS received the package which was a Friday I received it that Tuesday. Quicker delivery than FedEx. Let's you know FedEx is not the best/quickest for a delivery service. The sad part is as lm doing this review it looks like the rainbow shop does not respond but they ask for a order number to identify you and reply to you. The delivery is a problem and needs to be addressed and fixed.", "rating": 1}, {"title": "Ordering Mishap", "text": "I placed an order for some shirts. Then I got an email that my order was canceled by my request (I did not cancel my order). Then I got an email saying I would be refunded $0. So - my order is canceled and you're not refunding me? Unacceptable! I just wanted my shirts!", "rating": 1}, {"title": "The rating deserves zero stars", "text": "The rating deserves zero stars, because the advertisement of my order was very deceptive. It deceived and tricked (me), the customer into thinking I was ordering the entire outfit, (the matching tops and the bottoms), by advertising the matching sets together. When my order finally arrived, it only had the tops, without the bottoms, which was extremely disappointing, and made me very angry. I would have never placed that order if I knew I was only ordering the tops of the advertised matching outfits, or the jogging suit jacket without the bottoms. This was my first time placing an online order with Rainbow Shops. I placed the order to have some outfits to wear for the holidays, just to end up receiving only the tops, to the advertised outfits. Tricking the customers with deceptive advertisement is never good for business. You just lost a very valuable customer who shops at the local Rainbow stores on a regular basis. I do not want this order with only the tops of the outfits without the matching bottoms. I will never ever place another order from the online Rainbow shops ever again. It's been an extremely horrible and super disappointing first time experience.Respectfully,Marolyn Levon", "rating": 1}, {"title": "I never gotten my order I still waiting…", "text": "I never gotten my order I still waiting for it to get to my house", "rating": 1}, {"title": "First let me say that I love shopping…", "text": "First let me say that I love shopping with Rainbow, but my experience that time is the worst. I placed a order on 12-18-2022 and my order has been in limbo with the worst company to deal with which is UPS. My order has been sitting in transit since 12-22-2022 with no movement. I feel that as a company that cares about their customers that the company would offer to reship me another order ( that I paid for) to me overnight since this matter is not do to any fault of me. Every time I call Customer Service I get the same dry apology, which means nothin when there is no action. They said they put a trace on my order and the nerve to say that it will take about 5 days ( unbelievable). I am not faulting Rainbow that the issue is with UPS, but I would expect a little more from Rainbow in regards to this matter.", "rating": 1}, {"title": "Items where left at the wrong address…", "text": "Items where left at the wrong address rainbows refused to either replace them or do a refund stating FedEx delivered the items yes they delivered but to a house a block away from mines right along with my amazon package they are not a good company to do business with when shopping online", "rating": 1}, {"title": "Y'all suck and I will never deal with…", "text": "Y'all suck and I will never deal with rainbow ever again. Customer service does not do anything for the business.", "rating": 1}, {"title": "I didn't receive my items", "text": "I didn't receive my items. And am upset.", "rating": 1}, {"title": "Not sure you charge to much for shipping", "text": "Date of experience: December 28, 2022", "rating": 1}, {"title": "Ordered a pair of shoes to be shipped…", "text": "Ordered a pair of shoes to be shipped and the site said it would arrive in 3-7 days along with an email that it is being shipped. I have yet to receive any confirmation that it is being shipped. I did not count Sunday due to it being a holiday   I should have received word by now  I ordered the shoes on Dec. 24 and today it’s Dec. 27", "rating": 1}, {"title": "Has been two weeks have not received my…", "text": "Has been two weeks have not received my kid’s package for Christmas this will be my last time shopping with the company", "rating": 1}, {"title": "Horrible Experience Online", "text": "Horrible, I placed an order on 12/8/2022 thinking I would receive my order before Christmas however I still haven't received a shipping notice or an update on my order as of today 12/26/2022", "rating": 1}, {"title": "I couldn't login to my account before…", "text": "I couldn't login to my account before placing my order", "rating": 1}, {"title": "Be more accurate with the shipping.", "text": "Date of experience: December 22, 2022", "rating": 1}, {"title": "I ordered a duster on the app", "text": "I ordered a duster on the app. I get a text that an email will come when it’s been shipped. I paid for my order and then I received an email saying my order was refunded for $0.00 and when I went to check status on the order- it says it was updated, but waiting for shipment info while thanking me for my order. I did not see a refund go through my bank. Won’t order anything else from you all. It was apparently a scam.", "rating": 1}, {"title": "Never again!", "text": "They sent me a stained sweater with no tags. And their was some return information in the bag. They sent me some rejected merchandise. And you have to pay for return. I’m out $8. Not my fault but I’m paying for their not caring. Treat there customer’s like trash. Never shopping with rainbow shops again!!!", "rating": 1}, {"title": "The manager in pg plaza in rainbowshops…", "text": "The manager in pg plaza in rainbowshops in maryland named Kisha is very rude i don't like going in there when she's there shes very nasty and rude", "rating": 1}, {"title": "The boots I received have been worn", "text": "The boots I received have been worn.  There is wrinkles in the front and the bottom looks used.", "rating": 1}, {"title": "Last experience in Rainbows…", "text": "I had experience at this store in Greenville South Carolina 01053 I did not know that you only have 7 days of purchase to return items in the store I did not know that if you buy clearance there's no returning or exchanging even if you buy something that's too little once you get it to whoever you bought it for the cashier was one of the rudest people I've ever met in my life and the manager was beside her at another register and said nothing about her attitude or the way she was talking neither apologized it's never okay to be rude but because of my experience in this store I will never shop in another rainbows anywhere", "rating": 1}, {"title": "I never received my order....", "text": "I never received my order....I am not sure how to move forward", "rating": 1}, {"title": "Rainbow policy is full of sh!t", "text": "Rainbow policy full of sh!t who give somebody 15min to cancel a order that’s just dumb", "rating": 1}, {"title": "Inconsistency with DELIVERY DATE that…", "text": "Inconsistency with DELIVERY DATE that shown on updated status..It constantly showed DECEMBER 16th & as of RIGHT NOW(8:23pm)has NOT been DELIVERED YET!", "rating": 1}, {"title": "Never got my stuff", "text": "Date of experience: December 03, 2022", "rating": 1}, {"title": "Shopping was great", "text": "Shopping was great, you al could use a variety of trap purses more in neutral colors.", "rating": 1}, {"title": "The people u have for shipping packages…", "text": "The people u have for shipping packages is no good lost my package never got it very upset first time this happened to me u guys should have sent my package to the post office better with the post office never had a problem always got my package and I pay $73.35 for nothing so the stupid dum ass driver loose my package 😡😡😡😡😡😡😡😡😡😡😡 and I want a refund and I want to file a complaint very 😡😡😡 the name and address was on my package", "rating": 1}, {"title": "I ordered three different items that…", "text": "I ordered three different items that were on \"sale\" & got charged for one item so I had to cancel my order. False advertisement.", "rating": 1}, {"title": "10% code wasn't applied", "text": "I put in my email address and I was told I'd receive 10% off why wasn't this applied", "rating": 1}, {"title": "Order not received", "text": "My order was placed on December the 5th I paid for today deliveries order was supposed to be received on December 7th have not received my order yet per FedEx the sender did not create a shipping label now my package is pending at the FedEx facility and I need it for my vacation next week so I'm very upset.", "rating": 1}, {"title": "Rainbiw this my order number 3397960", "text": "Date of experience: November 17, 2022", "rating": 1}, {"title": "Not good", "text": "I got a notification that my package was delivered did get the packages and now I have to wait 24 hours to call back and get a refund of my money", "rating": 1}, {"title": "As of lately there's a lot of false…", "text": "As of lately there's a lot of false advertisement you keep advertising pieces that are not on your website but yet in your ad campaign and I'm getting very frustrated because there's quite a few pieces that I would like to purchase I am a plus size woman who enjoys shopping I am a former employee of rainbow shop but you have the black pendulum jacket that has gotten so bad that everyone is searching for it that is formed the support group of trying to locate this piece all over the US now you have a size and a Fringed skirt that is not on the website but it's in the ad campaign it actually has an online video of this piece of it then for the two pieces sets you have in the picture that is not on the website it can't be purchased it can't be found I'm truly disappointed that I cannot locate these pieces that y'all are advertising", "rating": 1}, {"title": "My order didn’t come on time not…", "text": "My order didn’t come on time not pleased and I paid for a faster delivery", "rating": 1}, {"title": "I live me some Rainbow but never been…", "text": "I live me some Rainbow but never been able to use any discount you had sent me but also I shop more in store but I will NEVER DO IT ON LINE again.  The shipping cost not even worth paying for.", "rating": 1}, {"title": "Competences is important and I didn't receive it on this order.", "text": "I ordered a patent leather over the knee black boot and I was sent the wrong boot two times and had to send them back. I gave up on trying to get the boot I want it because I didn't think I would ever get it. Pissed off!!!", "rating": 1}, {"title": "Everything was great and easy to order…", "text": "Everything was great and easy to order and I didn't have to wait months to receive it 👏🏾👏🏾👏🏾", "rating": 1}, {"title": "I had one day service still have not…", "text": "I had one day service still have not seen my package.", "rating": 1}, {"title": "The same thing happen 2 lenise happen too me", "text": "The same thing happen 2 lenise happen 2 me I order some boots November 17 never got my boots from rainbow shops been calling 4 my refund they keep saying your boots still coming so we can't issue u a refund cause they still coming its almost been a month now no updates or nothing..am done with rainbowshops I will never order from they scamming asses again...they online store need 2 be shut down they scammers.i will never order from they scamming asses again...I unsubcribe from them and blocked all they emails...never order from rainbowshops.com they are frauds....fedex kept saying my package will be delivered on this date never was delivered they kept sending me different dates that my package would be delivered never would be delivered on the day they say it would be delivered fedex the worst 2...I want my money this is unacceptable taking ppl money and we never get I packages...this my order number rainbow 3397960 I want my refund", "rating": 1}, {"title": "I used to purchase all of my clothes…", "text": "I used to purchase all of my clothes from Rainbow Shops until June 2022. I ordered nearly $170 with of clothing and I never received my order nor did I receive a refund. I called both Rainbow Shops and FedEx and continued to email them and they stopped communicating with me altogether. There was never any follow up from Rainbow Shops, so I removed them from my email list and I no longer order from them.", "rating": 1}, {"title": "Never received my order.", "text": "Date of experience: November 23, 2022", "rating": 1}, {"title": "Lost Order, ZERO Assistance", "text": "I placed an order over a week ago. It has not arrived. The shipper said it \"delivery failed,\" but no one can tell me what it means. The customer service representative was not helpful at all in resolve the issue. I am still without and order and have no idea where it or if it will ever arrive.", "rating": 1}, {"title": "Managers have attitude with customer…", "text": "Managers have attitude with customer service. Shouldnt be in a customer service field! All the employees were trying to fight a customer. And one of them did. This is a bad place to shop at! They give you attitude and argue with you!! Worse place!", "rating": 1}, {"title": "Plus Sizes are looking too small", "text": "Iam a plus size woman i just want to go on the record that your plus sizes for women are running too small. Example: Your 3x are fitting like they are a size 14 in women's. Iam a true fan of your styles but your Plus Sizes are not fitting comfortably, and they are getting smaller and smaller by appearance,", "rating": 1}, {"title": "Order and other issues", "text": "I just placed an order for over 250.00... I have placed several orders of 800.00 or more/a little less the last few months. I attempted to apply a discount code given to me by Rainbow from my last order and the site would not allow the code to work/apply to my order.Also, the lack of military discounts. The lack of price matching when orders are placed and prices fall within hours/days of the order being placed like other companies offer. All inconveniences, lack of consideration of for customers.Otherwise... I like Rainbow", "rating": 1}, {"title": "The shipping", "text": "Date of experience: November 15, 2022", "rating": 1}, {"title": "I received my order on time I ordered a…", "text": "I received my order on time I ordered a pair of boots for a upcoming event I was truly disappointed I received two right boots.", "rating": 1}, {"title": "App charged me without confirmation, website would not allow me to cancel only 5 minutes after and customer service was awful about it", "text": "I was looking at a possible item to order and wanted to see how long it would take before I actually committed to ordering it and before I could even see shipping options it automatically logged into my Shopify account and charged me for the order without any sort of confirmation! I then followed the prompts in my order confirmation email to cancel to order online and was denied cancellation. The email states I had 15 minutes to cancel and I attempted to do so only 5 minutes after however it still would not allow me. I emailed your customer service explaining what happened and that I would like the ordered cancelled and a refund but they kept saying because I emailed them after business hours it wasn’t possible. I repeatedly explained the problem wasn’t with them the human beings being able to cancel the order but the website saying I was not allowed to cancel even though it had only been five minutes after the order was made. I included screenshots of the order and website denying me cancellation and they kept running circles around me ignoring what I was saying and repeating the same thing about my email being after business hours when I kept telling them that was not what I was referring too until they just started to completely ignore me all together. Your app and website is a mess and has major flaws and now I have a piece of clothing I don’t even need anymore and either have to keep it or find time to drive out of my way to a store and return it like they suggested and lose the money (I did not consent to spending) on shipping. I will never order from you again.", "rating": 1}, {"title": "I made a payment with the wrong card I…", "text": "I made a payment with the wrong card I called to cancel it they told me that I couldn't because my 20 minutes was up I don't want the order", "rating": 1}, {"title": "The items material were soft and…floppy", "text": "The items material were soft and floppy.not what I expected. The red buffalo shirt should have a zipper to the front, weather full or half...when you button the shirt it has large gaps between buttons.Secondly...I wear a size 10 in foot wear and rogue makes their shoes extremely small because none of the shoes or slippers cannot fit my foot. I've been shopping at Rainbow for several years and I've bought size 10 a lot of times.I am about to return those items.I am about to place another order but am scared I won't be pleased.", "rating": 1}, {"title": "Delivery problems", "text": "For second time I am having problems w the items delivered,.. Delivery people live items at the door and neighbors stole ...", "rating": 1}, {"title": "Stolen package", "text": "Whoever delivered my package put it outside on the street in front of the building that I live in and somebody stole it I get plenty of packages here and they are delivered to the landlord at the side of the building or they enter the building and put it where the mail is but I never had an experience where my merchandise was stolen off the street", "rating": 1}, {"title": "I left my job on my lunch break from 20…", "text": "I left my job on my lunch break from 20 S. Charles St and walked my happy hips ALL the way to the Lexington Street store in downtown Baltimore Maryland and was told that the downstairs was closed. That is where my size, plus size is located. Bad enough that it's downstairs but to walk ALL the way there and have my time wasted. Not right at all.", "rating": 1}, {"title": "Rudest Sales Associates in Michigan!", "text": "I've never encountered ruder sales associates than the girls at your Oakland Mall Troy Michigan store. You can read similar comments all over this store's Google reviews.  They will literally stay on the phone and talk while customers stand there... It's almost like they're daring customers to say anything. Why aren't you addressing these reviews? Reprehensible!", "rating": 1}, {"title": "I ordered a few things that came up to…", "text": "I ordered a few things that came up to over $100 + dollars...I got a email saying my package was delivered but I never got it...when I call them about it they told me because it was delivered and left on my steps that could not refund my money nor was they responsible for leaving it outside... when i asked the young lady what am i supposed to do she said make a police report. I never got my package or my money back and I will never order from here again.", "rating": 1}, {"title": "I saw no reviews", "text": "I saw no reviews. I also had a hard time navigating your website.", "rating": 1}, {"title": "Some of the dresses I received from…", "text": "Some of the dresses I received from buying online arrived with black stains, not true to size.", "rating": 1}, {"title": "If you say 2 days I want my stuff in 2 days", "text": "I paid to have my order in 2 days yall charge me 20 dollars and now you are saying I'm getting it on the 27th I want my 20 returned to my debit card or atleast half of it.", "rating": 1}, {"title": "Do not order online and return because…", "text": "Do not order online and return because you will never receive your refunds. I have 20 orders to be refunded for from September 30 and still have not received my refunds. They are giving me the runaround of why they can’t and their stuff is sitting in their warehouse this is bad business if I pay for it and I don’t want it I have the right to have my money and no one wants to do anything about it, but give me the runaround and lie to me", "rating": 1}, {"title": "Canceled my order no explanation", "text": "Date of experience: October 21, 2022", "rating": 1}, {"title": "No sizes available", "text": "I had planned on buying two to three different style of basic t-shirts to go with my leggings because mine are starting to get holes. I'm a medium and in many of the styles I wanted in the colors I wanted their was only smalls. No m l or el.  Ita very disappointing when they're not Dale items.", "rating": 1}, {"title": "I canceled my order and I have to wait…", "text": "I canceled my order and I have to wait 3 days to get my money back", "rating": 1}, {"title": "Continuously rescheduling my delivery…", "text": "Continuously rescheduling my delivery date.", "rating": 1}, {"title": "Canceled order …", "text": "Ever order I have made in the last year has been canceled 😞, I’m told it’s all because I had a dispute regarding one order that was delivered and the delivery driver just left the package on the porch without ringing the bell or knocking on the door. I was out of the country at the time and the package was stolen. I disputed with rainbow and my bank and didn’t receive the goods nor a refund. Yet I continue to try…", "rating": 1}, {"title": "Hard to set up account took 4 ever", "text": "Date of experience: October 12, 2022", "rating": 1}, {"title": "I never received my merchandise", "text": "I never received my merchandise. They delivered to an abandoned address. When I called them, I was told by a rude customer rep person that I had put the wrong address down by one digit and there is nothing they could do about it. I informed them that if they looked at the billing address for my charge card that they billed it to, they would see the mistake. She said they didn't care", "rating": 1}, {"title": "You can’t cancel when you want", "text": "Date of experience: October 03, 2022", "rating": 1}, {"title": "So I brought a purse literally about…", "text": "So I brought a purse literally about 430pm Friday and Sunday they purse just break off my shoulder. But since they have a new policy you can’t return without the Original tag I am out of money. Y’all policy suck and you just lost a customer", "rating": 1}, {"title": "The website literally never works", "text": "The website literally never works, had to go on multiple times to complete order . To the point I was just going to give up and go on fashion nova.", "rating": 1}, {"title": "Very Cheap Looking Bag!!", "text": "Very Cheap Looking Bag!!! Completely not worth the price. You can get better looking bags at TJMaxx for the price of this bag.", "rating": 1}, {"title": "My order was canceled with no…", "text": "My order was canceled with no explanation as to why", "rating": 1}, {"title": "Got two dat shipping still haven't…", "text": "Got two day shipping still haven't received my items", "rating": 1}, {"title": "Affirm rainbow shop make it too…", "text": "Affirm rainbow shop make it too difficult to place an order they tell you you prove for the loan and then you check out you find out that you're not I guess they're doing the best they can", "rating": 1}, {"title": "I was charged for something that I…", "text": "I was charged for something that I didn’t ask for and I don’t even know what it is", "rating": 1}, {"title": "Could not use my 10% coupon code that…", "text": "Could not use my 10% coupon code that was sent. Spent 180 not cool..", "rating": 1}, {"title": "i just realized my coupon code didnt go…", "text": "i just realized my coupon code didnt go through so im upset at that 10% customer #3259532", "rating": 1}, {"title": "The wrong color I ordered pink and I…", "text": "The wrong color I ordered pink and I recieved multi color", "rating": 1}, {"title": "10% off…", "text": "I spun the wheel and received a 10% off reward after I signed up for email and txt. The code came to my phone immediately but the code only took 3 dollars off. My total was over 30 dollars.", "rating": 1}, {"title": "Wow I can’t see nothing on the site so…", "text": "Wow I can’t see nothing on the site so I can’t shop I am here wondering if rainbow block me", "rating": 1}, {"title": "I had a hard time looking for my size…", "text": "I had a hard time looking for my size y'all were sold out of certain pants", "rating": 1}, {"title": "Dont have a free delivery choice", "text": "Date of experience: September 11, 2022", "rating": 1}, {"title": "Everything ordered was not true to…", "text": "Everything ordered was not true to size. I am a 3X and I could not fit in the clothes! VERY DISAPPOINTED.", "rating": 1}, {"title": "The lack of care for paying customers!", "text": "There were two employees, one processing a return and the other one standing around eating Cheez-Its. The manager had just left and I stood there waiting for the young lady eating Cheez-It to check me out as I only had one pair of black gym shoes and hoping to get an additional pair. After I asked my questions. No one even acknowledged that I was standing there. I didn't expect the one lady who is already helping a customer to say anything. Oftentimes working in customer service. You are supposed to still say something but I didn't mind but for the person running the store after the manager left to still stand there and continue to eat while there were multiple people in line that was rude. This was in the store in Norwood Cincinnati, Ohio.", "rating": 1}, {"title": "Paid for faster shipping and order has…", "text": "Paid for faster shipping and order has not even shipped yet. Outfit was for my daughters first day of school so not too happy. I guess someone will owe me my shipping back", "rating": 1}, {"title": "Once my order went the items or not…", "text": "Once my order went the items or not what I order I order white combat and camel for the other order I'm very dissatisfied", "rating": 1}, {"title": "high taxes and high  free shipping cost", "text": "Taxes too high and I think $75 and over  for free shipping is way too high plus no promo codes were available. I love the  fact that the clothes are cheap.", "rating": 1}, {"title": "You should have free shipping on…", "text": "You should have free shipping on ordering over 35 dollars", "rating": 1}, {"title": "My 15% off was not taken off and I…", "text": "My 15% off was not taken off and I don’t know what happen to it! Didn’t want to cancel order because it’s for school children!", "rating": 1}, {"title": "Shipping is horrible still haven’t got…", "text": "Shipping is horrible still haven’t got what I ordered", "rating": 1}, {"title": "I order 3 pair of shoes with rainbow…", "text": "I order 3 pair of shoes with rainbow and was every disappointed. I wear a 12 in women and none of my shoes fit. Also a pair of them are size 11 inside of size 12 box. I ordered to come in time for that following weekend and now I’m stuck with NO options out of 3.", "rating": 1}, {"title": "I am writing a complaint about a…", "text": "I am writing a complaint about a rainbow shop located between 106 and 107 in Manhattan New York. Store #148. I originally bought the shoes at the 125th street store. When I went to return them two days later they said the computer was down. Then I went to store 148 to return. The lady said the shoes were worn. They were not. He shoes had a thread underneath them. And she told me to go back to the original store. This practice is unfair because the shoes were not worn. She just did not want to return my money from her store. I then went back to the store and they returned it. This woman doesn’t need to represent your store and brand. She is not honoring your store policy and hindering business", "rating": 1}, {"title": "DIDNT RECEIVE MY ORDER!", "text": "Date of experience: August 30, 2022", "rating": 1}, {"title": "Discounts should be able to be added on", "text": "Had a 10% discount code I review but forgot to add it to my order , unfortunately it couldn’t be added on after the fact ! So I have to rate 1 star for this", "rating": 1}, {"title": "I have not received my order I placed…", "text": "I have not received my order I placed back in July I called no one has contacted me", "rating": 1}, {"title": "Fake Advertising", "text": "They lie about the Free Shipping after you spend over $75.00 I ordered items that cost me $89.76 and was still charge Shipping fees I will be purchasing anything from you guys AGAIN", "rating": 1}, {"title": "I hit the wrong button I meant to hit…I wanna do 5 stars", "text": "I hit the wrong button I meant to hit the 5 stars", "rating": 1}, {"title": "Wolf Creek Parkway Cordova TN", "text": "I walked into the store on Wolf Creek Parkway in Cordova Tennessee about an hour before they closed yesterday. I walked in went straight to a rack that had leggings at it. There was a big yellow sign above the entire rack of leggings saying that they were on sale. I grabbed two pairs and the total should have came to about $12 with the sale. I've been shopping at rainbow for 10 years now. It's the same little sale signs they've always had. I stood at the register for 7 minutes with an associate unpacking boxes seeing me stand at the register and refuse to acknowledge me or get a cashier to the register. There was three employees total in the store so I don't really feel like there was a reason that I should have been standing there that long. I get to the register and the leggings ring up for almost double what they were supposed to be according to the sale sign. I brought it to the attention of the lady that was working at the cash register. She informed me that I got something that was not on sale. So I said okay that's fine. I walked back to the rack picked out two more pairs. They did not ring up through the correct price. My daughter needed them for school the following day as a requirement. The cashier never tried to make it right. They didn't remove the sale sign. Because my daughter needed them. I had to go to my vehicle to get some more money. This was about 30 minutes before close at this point. The lady had an attitude because she had to let me out the door because she had already locked it and let me back in. The issue was never about the money for me. It's the fact that the clothing was clearly marked that it was on sale and no one tried to even remove the signs or make it right. And the lack of good customer service that I received at that store. I have went to rainbow stores all over Tennessee and Mississippi. I have never been treated that way. Nor have I ever had an issue with buying stuff at the price that it's advertised for. I understand the frustration of last minute customers. I have worked in restaurant management for 13 years. Tired, long day, ready to go home or not all customers deserve to be treated well.", "rating": 1}, {"title": "Rainbow Shops Is A Scam", "text": "I would give 0 stars if I could I ordered three items and when they arrived they were nothing as pictured and the material didn't even match the description so I returned the items to them and asked for a refund on the invoice and they refunded me only a QUARTER of what I paid they told me they paid me that because of shipping It to me and me returning it back, I paid 23.33 and they gave me back 7.00 and I called customer service and they argued with me and I was explaining that if they deducted the shipping label on my order it would be 14 something back not 7.00, I ended up not getting my full return not even $14", "rating": 1}, {"title": "I was supposed to get 10% off of this…", "text": "I was supposed to get 10% off of this purchase and never got it. Rainbow Shops no longer does promo codes to help customers save money &now you have to spend $75 or more for free shipping. The pandemic affected EVERYONE, not just big business. So remember your long standing customers &show appreciation.", "rating": 1}, {"title": "Unhappy customer", "text": "I placed my order August 8th, it was shipped on August 9th and I haven't receive my package yet. It has been sitting in the Fedex transit in Houston Tx since August 15th. What is the problem?", "rating": 1}, {"title": "I never received the sandals", "text": "Date of experience: August 22, 2022", "rating": 1}, {"title": "Rainbow site is deceiving customers", "text": "Rainbow site is deceiving customers.  I kept buying several Mini Tank Dresses of different colors considering that are 95% Cotton as it is mentioned on item description.  I also purchased same style dresses from Shein, who is advertising 95% Cotton, 5% Spandex.I used one dress and it felt great, the material was soft to the skin.  Then I used another dress and I did not have the same pleasant feeling.  When I checked the percentage of cotton it was 50%, 45 Polyester, and 5% Spandex.  The one with 95% Cotton was from Shein, and those with 50% Cotton were from Rainbow.   I am very disappointed for being conned by Rainbow.  When I emailed them with the complain, I received a comment that mentioned they recorded and submitted the feed back, but there was no action taken.  I already washed all of them, and removed part of the tag that was uncomfortable. I am allergic to Polyester, and I do not know how to solve this matter.  I consider Rainbow very unprofessional, misinforming and deceiving customers.  They should be ashamed.", "rating": 1}, {"title": "Rainbow full of crap I order from them…", "text": "Rainbow full of crap I order from them then they turn around and cancel my order telling me my about some fraudulent crap I ordered with my capital one card with correct mailing address I called and customer service were very ruled I'll never order again from rainbow!!!", "rating": 1}, {"title": "Do not order from here and pay for fast delivery…", "text": "Do not order from here and pay for fast delivery they will lie to you it's taking 4 days for a 2days delivery. Scammer.....", "rating": 1}, {"title": "I placed a order and still have not…not happy!", "text": "I placed a order and still have not received it!!! I have gotten no answers to where my package is, but you sure did already get the money for it! Never had a problem before! This time is one big problem!", "rating": 1}, {"title": "You get what you pay for", "text": "You get what you pay for. Bought a cute denim dress. Smelled horrible when it arrived so I washed it. Big big big mistake, they will not do any returns or refunds if you washed anything, even if it's clearly cheap and of a sub standard even lower than their normal 1 day wear quality. This was a no wear buy. I will have to reconsider the next time I think of making a purchase from them.", "rating": 1}, {"title": "You refunded me without my requesting a…", "text": "You refunded me without my requesting a refund, extremely unprofessional, no need to be concerned, I will NEVER shop at Rainbow.", "rating": 1}, {"title": "Y'all canceled my order and I didn't…", "text": "Y'all canceled my order and I didn't even get an email about it or explaining on why it had to be refunded. Another thing is when I tried to look up my tracking, when I found out it wasn't coming, It said all my things were removed and total amount that is refunded is 0.00!! What the hell happened cos i am furious", "rating": 1}, {"title": "They didn’t give me my money back when…", "text": "They didn’t give me my money back when I canceled it", "rating": 1}, {"title": "I want a full refund", "text": "Date of experience: August 12, 2022", "rating": 1}, {"title": "Very high shipping rates", "text": "Very high shipping rates, it s not worth it", "rating": 1}, {"title": "Never received my order", "text": "Never received my order. Extremely disappointed. I would like my Money back or the actual product so I can return it. I am leaving to Brazil in 1 hour and everything I bought to take it was not delivered to me !! What a horrible experience !!!", "rating": 1}, {"title": "I haven’t received any package yet!", "text": "I am still waiting for the package to arrive to date Saturday, August 6, 2022.", "rating": 1}, {"title": "Then let me know something without a…", "text": "Then let me know something without a stock until I paid for it", "rating": 1}, {"title": "I have not received any more…", "text": "I have not received any more information on my oder and this is day 2", "rating": 1}, {"title": "Wasn't able to connect to the 4…", "text": "Wasn't able to connect to the 4 payments option.", "rating": 1}, {"title": "High Shipping Price", "text": "The shipping price is more than the material. The material won’t be good enough as always. This isn’t right. And it will take 7-10 business days even after paying $7.95 for shipping. Very disappointed. Never shopping from here again.", "rating": 1}, {"title": "Why is my order keep being refunded", "text": "Why is my order keep being refunded? Im trying to purchase.", "rating": 1}, {"title": "I placed an order for $365", "text": "I placed an order for $365, on the next day I received an email stating that rainbow had cancelled my order and it was for school clothes.very dissatisfied.will never order from this place again", "rating": 1}, {"title": "DISAPPOINTED", "text": "What is the essence in paying for 1 day shipping and your items reaches in 3 days?The reason one will pay extra is because they NEED the item immediately.When I track my item it said delivery will be Aug 2nd 2022 before 8:00 pm hours later they changed the date of arrival for my order this is ridiculous. I am disgustingly Upset with Rainbow and FEDEX...I WILL NEVER ORDER FROM HERR AGAIN AND CERTAINLY WOULD NOT US FEDEX AGAIN.BY THE WAY YALL NEED TO GET A PICKUP SERVICE ITS THE 20TH CENTURY ✌", "rating": 1}, {"title": "I have to say it’s the worst customer…", "text": "I have to say it’s the worst customer service ever specially dealing twice with the representative by the name of Brianna. The first order arrived in complete and do it an emergency I wasn’t able to reach out to them until after and when I did they refused to even help me . I placed a second order and received an email saying undeliverable address. I called customer service regarding the email I had received and the representative by the name of Brianna said don’t worry about it it should be returned back to the company and you can place a new order because I can see it on my end that the package will not be delivered and for the inconvenience once you place a new order I will notate the account to refund the shipping chargers for the new order and the return label you will also be refunded that amount. I said perfect Brianna I will do that once I’m done talking with you I will place a new order and we’ll take it from there. Brianna also added once you receive the new order please contact us rainbow shops to notify us that you will be returning the new order and once it’s received at the warehouse the refund will take place. So today August 2, 2022 I called and again Brianna answer the phone to let her know in regards to the package that was received yesterday and what did she tell me which another surprise that was not what I was expecting. Brianna tells me oh the only thing that you will received as a refund is the return label you won’t get deduction on that but unfortunately there is no note stating that you will receive  the shipping charges as a courtesy since the package was not supposed to be delivered and you place a new order. I said wow believe me I am very dissatisfied with this company rainbow shops I’ve had bad experiences back to back and obviously you guys don’t care about your customers but don’t worry I will leave the worst review ever so people can read  what you guys made me go through and not take care of what was promised. Once again Brianna said I don’t have that information and I responded of course not but you were the one that’s been helping me this whole time that I called regarding my order, but that’s OK I will take care of it on my end and I will leave once again the worst review.  Also Brianna added don’t worry I will have one of our upper management call because since these calls are remote we don’t have upper management on duty and I responded of course not that’s the same thing you had told me before and I’m still waiting for a call so obviously another lie but once again I will post the conversation we had from the very beginning so customers can read what I’ve been going through with rainbow shops .", "rating": 1}, {"title": "I paid for express shipping an didn't…", "text": "I paid for express shipping an didn't get express", "rating": 1}, {"title": "No fitting rooms \"due to covid\" covid…", "text": "No fitting rooms \"due to covid\" covid has been over a while now.  Every other store has fitting rooms.", "rating": 1}, {"title": "Over Priced Cheap Thin Materials", "text": "Rainbow should be ashamed of the cheap items they are now selling online. I am a Rainbow shopper in retail and online. But it's been awhile. And the dresses I ordered and received are so thin they may not last past one wash and wear. I really was shocked when I inspected the items upon arrival. Passing $1.00 material off as $6 and $7 dresses. My last order I purchased several dresses on sale and that was over 2 years and they all are still wearable. But I have no faith in these dresses that arrived. Single cheap thread stretching because the material is thin and see through and these are pattern dresses. Slips have more thickness than what I received. The plus sizes use to be true to size but now you clearly need to buy a size up because of how low quality the material is now. I would send theses items back if it were not for the gas and time I'd have to spend to take them to the FedEx office!!!", "rating": 1}, {"title": "I have not received my order", "text": "I have not received my order. The delivery date has changed twice and I am still waiting. FedEx says because you sent smart post they aren’t able to let me schedule a pickup or give any information. There seems to be 2 tracking numbers of sorts. I would like my money refunded. 11 days and counting first Saturday then Monday here it is Tuesday and nothing!!  Still waiting", "rating": 1}, {"title": "Update please", "text": "Update please, this order was placed on the 16 of July, today is the 26th, why is it still sitting in Philadelphia at the shipper which is rainbow?", "rating": 1}, {"title": "Satisfied", "text": "The experience with shopping online was simple and convenient. I just hope that my order and sizes are the right fit.", "rating": 1}, {"title": "DONT WASTE YOUR MONEY", "text": "I purchased a order for about 340 dollars worth of merchandise, 2 items were missing. When I called customer service I was told their was no supervisor in the whole company and if I wanted to file a complaint about the missing items I would have to send a email and wait on a response. It's been over a week since I made the call and still no one has called or sent the missing items. Will never do business with this company again and I had been a shopper for 12 years. Also filing a complaint with BBB and returning every single item in my order. Trash company and even worse customer service.", "rating": 1}, {"title": "Still haven't received the items I…", "text": "Still haven't received the items I ordered. They seem to be sitting in KS somewhere. Nobody at FedEx knows where they are...", "rating": 1}, {"title": "Worst experience ever!!!", "text": "Worst experience ever!!!! I arrived at Rainbows in Apopka FL at 6:49pm today. I had a return, as I’m walking to the line I see a pink dress it’s my size (sweet!) I grab it and continue to head to the line. There is a few people on the line, a couple, a lady who just got rung up, another lady waiting and two other ladies with two kids. I’m a patient person so no biggie. There are two cashiers (one is an assistant manager, who needs to go back to being an associate until she get more training, but back to the poor experience). The “assistant store manager” tells the other cashier to stop ringing up people and to lock the doors and turn off the lights. There are still people inside the store waiting online to be rung up, I understand locking the door but turning off the lights while there is still customers in the store I’m not sure on the but ok. So she finally gets to me, I place my return and pink dress on the counter she looks at the return and says “I can’t take this you need to leave my store my register is closed” I’m in shock, like excuse me come again!!! “She goes you should have been on line before 7” I say what you mean I been on the line this whole time!? She goes “well I can’t take this my register won’t ring up anything after 7 you should have came an hour earlier” I say”it shuts down?!  What ?!” She goes “ that is our store policy and if you don’t leave I will call the police” mind you she is taking the tills out the register and begins counting down the money. I call customer service she calls the police. I explain the situation to customer service she verify  the system automatically shuts down at the stores closing hour. That makes no sense because what if they are not finished checking people out! Then on top of that today was the last day to return or I would have gotten a store credit which I didn’t want. I leave the store the police outside I explain the situation to them and then I leave. I will never ever shop at this location again!", "rating": 1}, {"title": "App is not working correctly it makes…", "text": "App is not working correctly it makes you register and once you submitted it and takes you back to start all over and once you actually register and place your order and if you want to check your orders you can’t log in", "rating": 1}, {"title": "I ordered a size 8 toddler I have no…", "text": "I ordered a size 8 toddler I have no idea size 8 adult came but I have no idea for them", "rating": 1}, {"title": "The skirt ordered in a large came in too small", "text": "The skirt ordered in a large came in way too small.  There was no helpful explanation of the difference in sizing from China.", "rating": 1}, {"title": "Order Cancelation", "text": "I make three orders and all three where canceled without any explanation.", "rating": 1}, {"title": "Glad I found the shoes I need issues is…", "text": "Glad I found the shoes I need: issues is your SHIPPING FEES ARE WAY TOO HIGH .but I couldn't find these in the store so I dealt with it(shipping fee) 2day .. why ask customer's opinions when u will NEVER change shipping fees? 😔 ....smh. leave me alone now. I STILL LOVE THE SHOES", "rating": 1}, {"title": "I didn’t get my store credit in my…", "text": "I didn’t get my store credit in my email address I just gotten the receipt that was it. Now they have my stuff I took back and my money I have nothing my 72.00 is gone what the point of having customer service if they can’t help you I want my store credit or a gift card with my 72.00 on it I’m a very supportive customer and yall have my money", "rating": 1}, {"title": "I try to use my store credit today come…", "text": "I try to use my store credit today come to find out y’all just emailed me a Receipt I’m thinking  that my store credit so y’all have the clothes I took bad and my 72 dollars yall never sent me my store credit.I had the line help up trying to get through to customer service they was no help at all everybody I don’t know what to do like what’s the point of them even being there if they can’t help you.A big mess today I had to leave all my stuff there and y’all have my $72 nobody know how to give me back my $72 or the store credit that I didn’t even get to use y’all took my money and I am a-supportive  shopper I shopped there all the time they no me I’m very mad", "rating": 1}, {"title": "The Cottman store is the worse store…", "text": "The Cottman store is the worse store ever. Managers are very unprofessional. The way they treat staff and customers is ridiculous. They need new management there because there's a few friendly staff and they be cursing at them and treating them like crap. It's a shame! Corporate should go in there and get new managers. It's embarrassing to go in there and see how they curse at their employees. Very sad and bad for the business.", "rating": 1}, {"title": "Bad service", "text": "Bad service Why do You guys have things but don't sell thwm", "rating": 1}, {"title": "Disappointed", "text": "Ordered 11 items. Returned 9 of them. The sizing and fit were awful.", "rating": 1}, {"title": "shoes were way too small", "text": "Date of experience: July 12, 2022", "rating": 1}, {"title": "This company is a rip off", "text": "Even your Rating portion of your company doesn't work right......Where is my order??????? Your shipping company keeps giving bogus updates.....FedEx tracking number:61299994609370041790", "rating": 1}, {"title": "Order never received.", "text": "I never received my order and it was place June 12th.", "rating": 1}, {"title": "I placed an almost $150 order and was…", "text": "I placed an almost $150 order and was supposed to receive my shipment yesterday. Its still not here. There is no way to reach any one at rainbow to discuss. Now I want to cancel and get my money back", "rating": 1}, {"title": "Where's  my free shipping?", "text": "Where's  my free shipping?You All said anything over 75.00 will receive  free shipping, but it never happened, why? My order is 88 dollars and change, Where's  my free shipping?", "rating": 1}, {"title": "You hardly have size 4xl", "text": "You hardly have size 4xl . You hardly have black legging pants.", "rating": 1}, {"title": "Very poor shipping", "text": "The product I bought from your company is somewhere but who knows. You contracted with FedEx who doesn't think it's important to give your customers shipping status. You picked this company to ship your product so the overall buying experience is very poor.", "rating": 1}, {"title": "Order never received", "text": "I, unfortunately, was trying to give another company, that wasn’t the normal walmart or target, the opportunity to have my business. I placed the order on May 30th and have not received anything! According to their shipping details it’s still in New Jersey. I reside in New Hampshire. There is no way it should take over a month to reach me. Very unfortunate, but my credit card was charged & no package. Disappointing.", "rating": 1}, {"title": "NOT WORTH IT STORE", "text": "This company has offered a robotic response. I mailed items back on the 13th of June and Rainbow Shops received those items on 5th of July. I had a FedEx agent verify this twice. The Fedex Agent even called Rainbow Shops and the store said they had received the items and were issuing a refund I called today 3 times and each rep told a lie. They said the manager had to redo the refund because it did not go through the first time. I called back shortly and was told the manager was reviewing notes. I told them to just refund the money because they had the items. I told them this was too easy and they are doing nothing but ripping customers off. They give the runaround to keep peoples money. Thieves and thieves they are. There is nothing to look over. Do not shop at this store. If you have a return, they try to keep your money through a store credit. I ordered online through Klarna and took 3 items back to a physical store in Savannah, Ga for a refund. They are not set up to refund it back to Klarna, so I was issued a store credit. Later, I was informed that I had to return the items back through mail to credit my account. So, I went back to the store to request a refund or either the items and the clerk said I couldn't have either and needed to talk to her stupid manager in Jacksonville by waiting 5 more days and returning to the store. I told her that was unreasonable and to get the manager on the phone because this is called theft of them keeping customers money. This stupid clerk called mall security into the store to escort me out and then she tried to lie about the whole situation.  I told mall security this store had my money and I requested it or the items back and they could not keep my money.  I told this ragedy a&**( clerk I would call the police on her because this is called \"theft\" of what they are doing. In addition, I would also file a lawsuit calling mall security when they are the f%^& ones who had my money; stupid cow. However, I ended up finding 2 of the items I brought there for return and took them with me. It was an easy fix from the beginning and the clerk wanted to cause a big show. We will see who the big show will be on. I have never seen such stupidity and the great length this store would go to in order to steal money from customers; you can't take people's money. This is not over yet as they still owe me money.", "rating": 1}, {"title": "This is just unbelievable 🤦🏾‍♀️", "text": "Date of experience: July 04, 2022", "rating": 1}, {"title": "Shipping charges were ridiculous", "text": "Shipping charges were ridiculous. My item was $5 weight probably 3oz. Charged $8 shipping", "rating": 1}, {"title": "Stores in black areas have COVID Riot policies instead of the corporate, written policy", "text": "The have different return policies for stores in predominantly black areas. There's a verbal 2 year standing \"COVID Riot\" policy that supersedes the company's written return policy stating that you can't make exchanges for like items without receipt. Apparently, corporate can't enforce normal policy and the store and regional managers have no means to override this in black areas since there were riots 2 years ago.", "rating": 1}, {"title": "I love shopping at rainbow ...", "text": "I love shopping at rainbow ...They be having great deals...", "rating": 1}, {"title": "I am very disappointed because my order…", "text": "I am very disappointed because my order was canceled. Due to it not being in stock but when I placed the order. The black sandals were in stock at that time.", "rating": 1}, {"title": "On June 17 THE WORST CUSTOMER SERVICE EVER!!!!", "text": "On June 17, 2022 I try to return some shoes and I did not have the accurate receipt. I could not believe the customer service. It was WORST experience I had in my 67 years of my life. These people were not professional at all. They were sitting on the back counter speaking very loud. I mean ghetto!!  No customer service training. They were rude and nasty too. One of the cashier straight up and lied and told one of the manager that she made the transaction with me the day before. Not true. The cashier that waited on me was not present on that particular day when I try to return the shoes. Plus, I believe they did not give me a receipt. I normally keep every receipt. It seems as though they all had gang up on me. They claimed that the shoes had a stain. I'm like Wow! They were clean. I called the 800 number and spoke with several representative (3) and they lied too and told me that the district manager NICOLE GIBSON would get back with me, no return phone call at all. No professionalism!!!! I WILL NOT SHOP AT A RAINBOW STORE OR ONLINE EVER!", "rating": 1}, {"title": "Poor customer service", "text": "I ordered 3 pairs of shoes on 6/23/22. Estimated delivery was 6/25/22. There has been no movement of the shipment since 6/23/22. I called FedEx they looked into it and I was informed it more than likely lost and to contact rainbow. I called rainbow and was informed to wait until Wednesday.  Okay that's fine but if it's not here by Wednesday I would like a refund. Then the rainbow rep states no we won't refund you we will open an investigation. For what FedEx already said the package is lost.", "rating": 1}, {"title": "I was have good time shopping on rain…", "text": "I was have good time shopping on rain shop online....but i had a return ..thats taking a long time get back.... Thats not my issue .when i called to check on my return i dealt with bad customer ser. It felt alittle racial. So i hung up and called back to get another rep. Because i dont like confusion ..but the next rep. Had the same tone ..so i hope i get my refund but i wont do rainbow", "rating": 1}, {"title": "They refunded my monies back and never…", "text": "They refunded my monies back and never stated why?", "rating": 1}, {"title": "were giving attitude", "text": "The employees were giving attitude.", "rating": 1}, {"title": "I felt I didn't have the dam…", "text": "I felt I didn't have the dam opportunity to pay with any options.  I don't have the money. Why wasn't I given any options like Klarna to pay for my outfit that is wrong.  I will return it to get the amount I want to pay with Klarna.  I'm on the system.", "rating": 1}, {"title": "Horrible coupon code you text me never…", "text": "Horrible coupon code you text me never worked 😩", "rating": 1}, {"title": "No customer service in store so I…", "text": "No customer service in store so I ordered online and it was double the price", "rating": 1}, {"title": "I wish I could give zero stars", "text": "I wish I could give zero stars. I purchase a sandal on 28th May 2022. Wore it only once. On June 18 2022. It has unstuck all along the sides of both pairs. I emailed customer service and I was told that because the shoe was worn - ONLY ONCE- I even sent them pics to show the bottom was barely dirty - I was told there was nothing that could be done. I was offered free shipping on an order of $75 and above which is actually insulting given that this promotion exist for all customers. I am so extremely disappointed. Go to SHEIN - their quality is 100000% better and they actually care enough about their customers to compensate you when something like this occurs.", "rating": 1}, {"title": "Won't send 10% off coupon", "text": "Waiting for code for my 10% sign up coupon", "rating": 1}, {"title": "I never received my package and it said…", "text": "I never received my package and it said it was sent yesterday in my mailbox and when I checked it wasn't there", "rating": 1}, {"title": "Delivery service is slow", "text": "Date of experience: June 15, 2022", "rating": 1}, {"title": "I received a order on the 6th of June…", "text": "I received a order on the 6th of June and 6 items were not in the package I want my items or a refund.", "rating": 1}, {"title": "Griffin ga location", "text": "I went to the griffin ga location. They are the rudest people ever. One of the workers did speak but the other one acted like I was bothering her just by checking out. Her personal business was more important than her customer serviceStore 00505 operator 1598jw", "rating": 1}, {"title": "Because you said if I sign up you would…", "text": "Because you said if I sign up you would give me 10% discount and I never receive one the last time I signed up or this time that why I stop buying from you guys.", "rating": 1}, {"title": "I am most disappointed", "text": "I am most disappointed.  My order #3016358 was refunded (cancelled).  Your company was highly recommended to me for you wide selection of fashionable plus sizes..  It took me quite a while to make my selection.  Only to have it cancelled.  Not due to the payment or payment method.  But you \"suspect fraud\". *****PLEASE !!! ****\"", "rating": 1}, {"title": "The shipping is no good I still haven’t…", "text": "The shipping is no good I still haven’t received my order and it’s been two weeks I should of gone to the store if I know it takes so long to get here and I called them and they said I report lost and if you get it let’s use know they didn’t say I’ll give you a refund and report lost never again lost a good customer.", "rating": 1}, {"title": "CANCEL", "text": "Where my money at i cancled the order same day and dident get NOTHING back on my card yet !", "rating": 1}, {"title": "Ur kalra paying app nit work right smh", "text": "Date of experience: June 10, 2022", "rating": 1}, {"title": "Charged twice and when I contact…", "text": "Charged twice and when I contact customer service I basically received no help but to dispute with my bank!", "rating": 1}, {"title": "they canceled my order", "text": "Date of experience: June 06, 2022", "rating": 1}, {"title": "Worst Experience with In-Store Return EVER!!! Manager Needs to Learn & Adhere to Correct Return Policy Rather than Argue with Customers!", "text": "I'm disabled so getting out for me isn't always easy that's why I do 100% of my shopping online several times per week. Upon attempting to return online purchases at a Rainbow shop location the manager insisted that their store had a 7-day return policy should customer want cash payment and that my only option was in-store credit.  I told her that wasn't true, that it's a 30-day return policy and that I don't want cash but for my credit card to be refunded.  She refused, I left and the following day I called customer service.  Customer Service stated that the manager was incorrect and that she herself hates when the store employees give out wrong information and she apologized to me for the clerk/manager's actions.  Customer Service then instructed me to return to the store, explain the return policy to the manager and show the manager the back of my order slips that detailed their policy; also the representative instructed me to call Customer Service department back while in store should the manager continue to refuse to accept return under the correct policy.  So, I returned a couple of days later and instructed my son to record the interaction because I felt that the manager was going to give me a hard time and I knew that if I was being recorded as well that I would control responding negatively according to the manager's disrespectful attitude and behavior.  Needless to say, the same manager gave me the same response, I told her she was incorrect and showed her the return policy on the back of my order form and she still insisted that she was right, that she's been telling customers about the return policy there for a long time and that even on the back of their receipts printed out after purchases that the return policy states \"7-days\".  I said to her that just because the receipts states that, that doesn't mean it's correct information and that I'm going to call customer service so that she can hear/speak with them and she replied, \"Go ahead but it's not going to make a difference or change anything.\"I called customer service and as I explained the situation the manager leaves the counter as if she didn't want to hear what the representative had to say about the return policy.  The manager then reacts to my son recording the incident by saying: Oh, he's recording me!  He's recording me!  Who does that!I replied, \"Who gives out incorrect information?\"  She then tells my son to stop recording and we refused so she instructed another employee to call security on my son.  By this time several more employees surround the checkout counter, a few of which kept interjecting while the customer service rep on my speaker phone gave the store policy.  The manager continues to respond negatively to my son and he respond back to her that he wasn't doing anything wrong nor being disrespectful and that she was acting a little bit extra.  She then was told by another employee to go to the back and calm down.  Another older employee asked my son to walk away with them and I instructed my son to stay by my side.Another older employee whom stood by the counter beside me the entire time thought it was necessary to chastise our 20yr old son by telling him that he shouldn't have been disrespectful to the manager because she has sons too and that Black young men are getting into trouble , etc.  I ask how was he being disrespectful because he didn't curse nor call her names?  The lady contined to talk, not answering my question so I asked twice exactly what did he say that was disrespectful?   She never responded even when our son asked her the same question; instead she continued to chastise him.They still refused to acknowledge the customer service rep nor the policy on the back of my order form, telling me to come back a THIRD TIME when the District Manager would be available!  I refused whilst the customer service rep continued to explain over and over Rainbow's return policy.  Finally an employee called the District Manager, placed her on the speaker phone and the District Manager reiterated THREE times EXACTLY what the customer service rep and I both explained to them several times. Needless to say, another manager came from another store at the shopping complex and refunded my card accordingly.  There was this employee named Ashley whom were courteous to me the entire time we were there (about 20-25min).  Ashley apologized several times while the manager that was rude NEVER apologized nor acknowledged she was wrong about the return policy.  She was more concerned about the video being placed on social media and about being right rather than providing exceptional customer service.I've never experienced anything like this whenever I've made business or consumer transactions.  This was an awful, unprofessional, unforgettable experience in which I hope to never experience again.", "rating": 1}, {"title": "Never shopping from Rainbow again.", "text": "I have been a loyal customer at Rainbow for many years but after my recent purchase, I will NEVER order from them again. I ordered a size 10 shoe and they sent me the wrong size. I’m really irritated. What a waste of money!!! Their clothes are also very poor quality. I will never ever purchase from Rainbow again. I’m very disappointed.", "rating": 1}, {"title": "If you need a timely delivery I'd recomend buying elsewhere", "text": "I placed my order on may 27 it is now may 31 and my order still hasn't been shipped & no information has been posted to explain the delay.  The order was supposed to arrived by June 3 but I doubt that it'll be here by then.", "rating": 1}, {"title": "Paid for expedite still no package this a disappointment never order from your company again", "text": "Very Upset with you guys God Bless", "rating": 1}, {"title": "They went up on prices significantly…", "text": "They went up on prices significantly and no better quality clothing at all. Their free shipping is now spend 75 dollars for free shipping instead of spend 50 dollars for free shipping. I use to have a shopping problem on this site ( in a good way ) but NOT ANYMORE.!", "rating": 1}, {"title": "I placed a order and I got a email…", "text": "I placed a order and I got a email saying my order was successful.  Then got a email saying my order was refunded", "rating": 1}, {"title": "I have not received my items 4 days past delivery", "text": "I have not received mi items 4 daus past delivery date and its in my city", "rating": 1}, {"title": "My order was canceled without…", "text": "My order was canceled without explanation", "rating": 1}, {"title": "Hard to register", "text": "Date of experience: May 21, 2022", "rating": 1}]