[{"title": "Horrid company!", "text": "One hour after purchasing the bond, I learned from MVD that the amount needed to be corrected.  I asked the company to please recall the bond and refund my money to get the proper bond and was told that was \"impossible.\"  I will be contacting my bank to request a fraud investigation.  Also, none of the phone numbers listed for this company are valid working numbers.", "rating": 1}, {"title": "Your site does not give an option to…", "text": "Your site does not give an option to update names which is beneficial for an Organization such as a school district. Fortunately enough the person on our bond actually still works for the district and is kind enough to forward the information to us. Not only that when the initial email came though the system it look rather obscure and we could not verify the authenticity of the email and had to chase down the bond, and whom it actually belonged to, because, again, people leave, and newcomers are not aware of such things. For something this important it might be best to look at going back to the USPS to avoid such confusion in the future.Thank you,", "rating": 1}, {"title": "What you gave me was not a notary bond .", "text": "Snapdocs a notary company I work for says what I have is not a notary bond at all.  Plus there should be a place where I sign it and all I got was one page.  Our state doesn't even require a notary bond but they are saying they can't give me credit for whatever it is you sent me.  Please refund my money and I will order one from someone else if you can't provide one.", "rating": 1}, {"title": "I paid for a bond but the DMV rejected…", "text": "I paid for a bond but the DMV rejected my paperwork package based on FORM NRS 482.0000 provided by Surety because the address was not complete.  They duplicated the City while neglecting to include the suite number.  This has delayed the process by who knows how long and there is no way to contact them for correction.  maybe pick another online bond outfit.", "rating": 1}, {"title": "Bond was incorrect.", "text": "Bond was incorrect. ", "rating": 1}, {"title": "This place sucks", "text": "This place sucks.  They try to bang out bonds as fast as humanly possible. You can't review it until after you pay.  And if you question them, they make it even more difficult by all of a sudden. Needing to see financial statements when it wasn't requir3d for the first bond issued incorrectly", "rating": 1}, {"title": "Because I’m still waiting for my…", "text": "Because I’m still waiting for my package. I paid $10 for FedEx delivery next day and it’s been two days now so I’m not happy with this company at all and probably will not share.", "rating": 1}, {"title": "Waste of time for 2023 businesses", "text": "We operate car dealerships throughout the country, normally with owners living nowhere near the dealership location, because it’s 2023 and the internet exists. We’ve obtained 10-20 bonds throughout the last 5 years and never once have had any troubles. Matt Bocklage cannot grasp this concept and refused our business without explanation. Perfect waste of time. Thanks for that!", "rating": 1}, {"title": "You charged my bank card", "text": "You charged my bank card, then started your review. That's is illegal taking money when you are not sure you will provide the service. ", "rating": 1}, {"title": "I really worst service ever cannot give a review since I…", "text": "I really cannot give a review since I still have not received my bond get 225. I even paid extra money to have it delivered next day and still nothing so very bad service.", "rating": 1}, {"title": "No contacts", "text": "Have left phone messages and emails for Blake Oliver for several days, absolutely no response. Tried to fill out the online rate request page to get a quote. Horrible form, made no sense, tried to do this as an attorney for my client, had no way to make that clear.", "rating": 1}, {"title": "It forces you to leave 5 star review in…", "text": "It forces you to leave 5 star review in the middle of application fill out and if you don’t, then you can go to your next step on application. What a joke !!! ", "rating": 1}, {"title": "Received a letter yesterday", "text": "Received a letter yesterday, dated April 25 from        Paul Bruflat stating our policy was canceled for non-payment.  Obviously, we paid the total amount due.  Not sure why this letter was sent.  Not Happy!!", "rating": 1}, {"title": "Made the bond out to the wrong obligee…", "text": "Made the bond out to the wrong obligee and when I called to have this corrected, I was told the only way to fix it was to pay another $100! Basically saying that the $100 I already paid was $100 lesson and can not be refunded or re-applied to the bond I needed to start with....   Unless this is corrected I will not recommend using this Surety Bond provider to anyone in my region.", "rating": 1}, {"title": "I bought a bond three weeks ago through…", "text": "I bought a bond three weeks ago through Seda Guler everything went smooth as silk, I had the bond in about four Hours!! Two days ago I bought another bond from Surety with some clown named BOB?? Said I needed another bond, Bob seemed inconvenienced about the transaction. Never heard anything all day, finally at the end of the day I called, no answer. The next day someone else called and said the bond was ready and watch for DocuSign email. I paid for the second bond. Today I get a call the AZ ROC found a mistake on the bond that was submitted from Surety. Now supposedly After I signed another DocuSign a corrected copy has been sent to the AZ ROC. But I don't know for sure no one from surety has contacted me to tell what is going on??   James Schroeder ", "rating": 1}, {"title": "They should get the bond on the trailer…", "text": "They should get the bond on the trailer today by 5 o’clock and that’s for $1800 or $2800 and if you could just send it right back to me once you guys get it filled out. Thank you.", "rating": 1}, {"title": "Your survey asked me to tell what you…", "text": "Your survey asked me to tell what you did for last 2 years.  So you never did anything during last two tenure. Nothing goid nithing bad. I didn't need you during last tenure", "rating": 1}, {"title": "Received Poor service; now they have my personal Info", "text": "I received POOR SERVICE.  And now they have my personal identifying information! I received a call from Bernardo to discuss my Probate bond request.  I answered the call and could hear sounds of papers and movement; sounded like eating.  I repeatedly said 'hello,' but received no response.  I hung up about 1 minute into the call. Within seconds of hanging up, I received an email from Bernardo stating that he had tried to reach me, but I was unavailable and to respond with my availability.  I immediately responded with an option presented, 'I can talk now.' I waited TWO HOURS for a call back.  No call.  I followed up with an email the following day. STILL NO CALL.  Now it's been 24 HOURS - STILL NO CALL. I can't determine if this is a legit business or not. I'm going to find someone local that I can work with face-to-face.", "rating": 1}, {"title": "A WASTE OF TIME!!!", "text": "A WASTE OF TIME!!!They will run your credit and perfect paperwork to do anything.  If everything isn't perfect they can't do it.  Find another company.  Don't waste your time.  ", "rating": 1}, {"title": "Incomplete information on the bond", "text": "I provided the VIN number of the vehicle in every coorsponce for a surety bond to gain an Iowa title. The bond came back with the make and model of the vehicle repeated in the VIN number field. Iowa now rejected the bond I paid money for and provided all necessary information to purchase the bond. Now what?", "rating": 1}, {"title": "I haven't received anything with the…", "text": "I haven't received anything with the bind I purchased I emailed and asked where it was and git this survey saying thanks I got a receipt I need the policy number ", "rating": 1}, {"title": "Horrible experience", "text": "Horrible experience, link to download bond took me to a different page and I couldn’t download it. Couldn’t work for days cause I couldn’t file my overweight bond with TXDMV. 100 bucks costed me 1000 per day of no work. There was NOBODY to help me over the weekend.", "rating": 1}, {"title": "Not a good bond didn't receive all…", "text": "Not a good bond didn't receive all paperwork they wouldn't issue a refund unless care team bucks wasted my money 🤦🤷🏿‍♂️🥺", "rating": 1}, {"title": "My name is spelled wrong", "text": "My name is spelled wrong.  It's Cheri not Cherie.  I need this fixed right away. I have to turn it in tomorrow Sept 18th", "rating": 1}, {"title": "As of the present date and time", "text": "As of the present date and time, the Texas Secretary of State still has not honored my Notary Public Commission.", "rating": 1}, {"title": "Mr. know it all", "text": "They put a letter where a number was supposed to be so now I’m sending it back to them for them to send me a new one with the change for the motor vehicles get accepted so now we’re talking about we’re on our second week of something that should’ve happened in three days since I paid for a speedy delivery Yeah, wonderful service, right ", "rating": 1}, {"title": "Not a good bond I didn't receive all…", "text": "Not a good bond I didn't receive all paperwork waste of money costumer service team suck wouldn't even try to start the process of refund save yourself the headache ", "rating": 1}, {"title": "The issue date expires it’s documented…", "text": "The issue date expires it’s documented as 4/11/23 I paid for it in 2024!!!! Please reissue proper date ", "rating": 1}, {"title": "I don't like that the bond is not…", "text": "I don't like that the bond is not specific to what we do. the word janitorial is listed in the title and we are a home health care agency", "rating": 1}, {"title": "Unwilling to cancel bond which was…", "text": "Unwilling to cancel bond which was written wrong and I was forced to buy another bond from them to keep things going with my license reinstatement. ", "rating": 1}, {"title": "I have not received anything yet", "text": "I have not received anything yet.  I am still waiting on on paperwork ", "rating": 1}, {"title": "I keep getting email didn't pay…", "text": "I keep getting emails that I didn't pay dt know I have to call to see what a hassle ", "rating": 1}, {"title": "Bad company", "text": "After a visit to my AZ DOT WITH THE SURETY BOND I purchased for $100.00, I was told that i had purchased the wrong bond. I called Zack at Surety Bonds in an attempt to correct the error and he never bothered to call me back. I got screwed. Thanks Surety Bond's.", "rating": 1}, {"title": "I apparently have been charged for a…", "text": "I apparently have been charged for a bond I did not renew.  I would like your offices to call me and resolve this matter.  Thanks,  Kai", "rating": 1}, {"title": "I dislike the fact that you start…", "text": "I dislike the fact that you start harnessing me to renew my bond 2 months before it's due.", "rating": 1}, {"title": "I tried to get your code to proceed but…", "text": "I tried to get your code to proceed but it sent it to my email where i had to get out of your system to get code and and when i came back screen was gone. what a mess", "rating": 1}, {"title": "You're asking for a review and I…", "text": "You're asking for a review and I haven't received the bond I bought 24 hours ago", "rating": 1}, {"title": "WHERE DO I DOWNLOAD MY DOCUMENT?", "text": "WHERE DO I DOWNLOAD MY DOCUMENT?? I CANNOT FIND IT ANYWHERE! ", "rating": 1}, {"title": "They typed the vin number wrong on my…", "text": "They typed the vin number wrong on my bond so now I have to make two trips to get my vehicle title. Incompetence", "rating": 1}, {"title": "Tag office would not accept", "text": "Tag office would not accept. Stated they could not take a copy that the seal had to be the original seal", "rating": 1}, {"title": "I never got a copy of my bond for my…", "text": "I never got a copy of my bond for my car... I should of got it by now by email", "rating": 1}, {"title": "Terrible people", "text": "Terrible people, lied that I had bought from them before. Did not return my money", "rating": 1}, {"title": "Absolutely TERRIBLE experience", "text": "Absolutely TERRIBLE experience. Long time customer, never had any issues. Renewing a bond. Sent over financial statements and that wasn't good enough. Wanted a bank statement. Your employees response was I needed to \"Show a bank statement to back up the financials\" as though are AUDITED, professionally done financials are a lie. Chris and Matt Blockage are absolutely AWFUL and we will never do business with you all again. There are plenty of bond companies out there that appreciate their customers especially LONG TERM good customers! Good riddance!", "rating": 1}, {"title": "I never got the bond", "text": "I never got the bond. It was supposed to be emailed separately. So where is the bond? Thank you", "rating": 1}, {"title": "DMV of Gibson County Tenn said it was…", "text": "DMV of Gibson County Tenn said it was just useless, waist of my money . !?!", "rating": 1}, {"title": "I purchased it and paid for 3 day…", "text": "I purchased it and paid for 3 day delivery. I still have not received the bond.", "rating": 1}, {"title": "Horrible experience dealing with a…", "text": "Horrible experience dealing with a fraudulent claim and couldn’t renew because no one was able to get me in contact with a claims representative to resolve my issue, im very disappointed.", "rating": 1}, {"title": "NO RENEWAL PAPERWORK TO STATE OF SC OR…", "text": "NO RENEWAL PAPERWORK TO STATE OF SC OR ME !", "rating": 1}, {"title": "These people are very good.", "text": "This company is very good to its customer.", "rating": 1}, {"title": "Haven’t received anything for the money…", "text": "Haven’t received anything for the money I spent with you, so not too good.", "rating": 1}, {"title": "It's been a week and I haven't received…", "text": "It's been a week and I haven't received my bond information, that was paid in full.  Strange you're asking for a review, before sending my bond number and confirmation. Afterwards, I will gladly send you a nice review.", "rating": 1}, {"title": "Call around first", "text": "Expensive, my fault I didn't shop around.", "rating": 1}, {"title": "Stop sending survey request", "text": "Stop sending survey requestsStop responding to my review", "rating": 1}, {"title": "Had some more questions but the person…", "text": "Had some more questions but the person who sold me the surety bond did disappeared after selling the bond and never get back to me after sending him several emails.", "rating": 1}, {"title": "So if a person doesn't have a policy or…", "text": "So if a person doesn't have a policy or an existing policy that gives your customer service rep justification to treat customers in disrespectful manner?  That comment itself is disturbing. I think you should think before replying. Again, Unreal.", "rating": 1}, {"title": "The Florida guardianship was…", "text": "The Florida guardianship was transfefred to a family member in Ohio in 2020 where the disabled family member now lives, but they (Surety Bond) keep hounding me to pay the bond every year with threats of collection. A few years ago they woulldn't accept the OHIO courts Guardianship orders. They maintain:Only if I get the Florida court to provide proof that the guardianship was cancelled. This account is in dispute!", "rating": 1}, {"title": "Incorrect Bond Document", "text": "Incorrect probate bond document was used causing the bond to be rejected.  They were unable to find the bond by the bond number.  They had to locate the bond by my name because they had an incorrect number.", "rating": 1}, {"title": "I just got a notice my bond was…", "text": "I just got a notice my bond was cancelled", "rating": 1}, {"title": "I have had several contacts regarding…", "text": "I have had several contacts regarding renewal of this bond. I was contacted way before my renewal date. It's been several months since my bond was renewed. As of this date 5/24/2022 the state of Mississippi hasn't received notification of this bond's renewal. When will they be notified?", "rating": 1}, {"title": "After paying for my bond I repletely…", "text": "After paying for my bond I repletely asked for documentation. I needed a certificate to show the Government I was bonded. I was denied. I asked to speak to upper management and was denied. A rep even hung up the phone when I put him on the phone with FMCSA. Customer service is poor. Do not work with this company. In response to the update what they have stated is not true. You have to have a physical copy of the bond to apply for government contracts. Only after this post did I ger a copy of my bond.", "rating": 1}, {"title": "I repeatedly asked for a quote", "text": "I repeatedly asked for a quote. I was answered repeatedly by Chris Echternach with the same form email denying my request for a quote. Great customer service and way to listen to the customer. Lose my email and you will no longer receive my business.", "rating": 1}, {"title": "Y’all told me to purchase the bond and…", "text": "Y’all told me to purchase the bond and take to to the dmv for a title but y’all didn’t tell me it was only valid for 30 days and y’all also didn’t tell me about the other steps I need to take on order for me to obtain a certified bonded title from the dmv. Y’all just made me pay for the bond . The customer service is horrible the workers don’t know what the fukkk they doing .", "rating": 1}, {"title": "Avoid Surety Bonds!", "text": "Requested information for my bond renewal to a one year versus a two year.  Received no response back.  With no recourse, I renewed the bond on the due date; however, I received an email same day that it had been turned over to \"collections\" for late/non-payment, which was completely inaccurate. They are a high-pressure company, and wanted their money months before the due date.  I'll be finding another service when this bond expires.", "rating": 1}, {"title": "Services don't work for Florida..", "text": "Services don't work for Florida... Starting Jan 1 20212011 or earlier will not work... They told me I should have never been sold this at dmv..Great if it works... But it didn't and when I called to tell customer service I was told they can't do nothing about money... My loss....your website uses words like guaranteed but this is not true....$105.00 down the drain... Thanks surely bonds for making sure customers are satisfied", "rating": 1}, {"title": "Bond was sent incorrectly", "text": "Despite my lengthy and detailed discussion with the Agent regarding the exact wording required the bond was sent incorrectly. It cost me time and resources. It was difficult to reach the original agent to get the bond fixed and another agent I spoke to was rude and disrespectful.  At which point I returned the bond for a refund.", "rating": 1}, {"title": "My package did not arrive on time due…to address not being correctly listed on the package", "text": "My package did not arrive on time due to the fact that the complete mailing address was not displayed correctly on the package.  I paid extra funds to have the package overnighted and due to the Surety Bonds not listing the address correctly it delayed the packaging arriving on time.  At the writing of this review, I still do not have my package.  I'm extremely disappointed.  Also, this could have been resolved had the bond been sent via email vs. applying copy on all the documents.  This would have been the fastest and most cost-efficient way to send the bond.", "rating": 1}, {"title": "Horrible company", "text": "Horrible company - very obnoxious,, on the verge of violating debt collection practices, really waking a fine line. They start bugging you almost 2 months (!) prior to expiration of bond and then non-stop calling and emailing with threats.Someone will take them to the cleaners one day - for all the right reasons.", "rating": 1}, {"title": "Be careful before you do business with this company.", "text": "I had the misfortune of being told I needed a surety bond for a mobile home on a parcel my diseased father owned. Of course it was just some normal garbage information that a lender for the buyer required and I made the mistake following through with the bond, only to find I didn't need it upon contacting the last person in the chain of requirements. I should have read the fine print, but I didn't. Live and learn, but I am not happy with the way this company does business.", "rating": 1}, {"title": "I accidently purchased the wrong type…", "text": "I accidently purchased the wrong type of bond and every other bond company told me it would take 10 minutes to transfer and reissue for the correct type of bone.  I was told that there are no refunds or exchanges from suretybonds.com even though I purchased it for 3 years. $270 down the drain.  I will neither recommend or purcahse from them again.", "rating": 1}, {"title": "I just tried to cancel my bond and they…", "text": "I just tried to cancel my bond and they weren’t able to issue a refund since it was digital, that’s wrong!! I didn’t use them when I filed at the county and I don’t recommend using a company like this!! What a disappointment.", "rating": 1}, {"title": "Not very easy to work with", "text": "Not very easy to work with. Had a mistake naming my company as the bond holder when it should have been myself LLC. Instead of switching after 1 day your only answer was. “ Purchase a new one”Really", "rating": 1}, {"title": "Customer service representative", "text": "Customer service representative, Tyler Meyer is beyond the worse!! I called to ask why I was repeatedly being emailed and called about an upcoming payment. No less to be told via a phone message that if I didn't pay today (2 weeks early) that my account would be canceled. Alas, his talking over the top of me, told me he was going to cancel my account himself because I wasn't happy with the way I was being harassed! I told him I didn't want to cancel, but he didn't care!! Imagine how many customers his none receptive and nonunderstanding Self he's lost the company!! I can only hope upper management reads this and contacts me!! They should know!!", "rating": 1}, {"title": "Horrible policy", "text": "MVD told that they needed me to take out a larger value of policy after I had purchased. This company was unwilling to help me change the policy to a higher value because of some stupid policy that things cannot be changed after purchase. It is not my fault the MVD changed its mind and now I am stick buying another policy. Seems like a big scam set up between MVD and this insurance company.", "rating": 1}, {"title": "I’m trying to get in contact with the…", "text": "I’m trying to get in contact with the office or anyone about my bond I just bought…I need the original copy but I can’t get a hold of anyone I try calling..the email that’s on the website don’t work", "rating": 1}, {"title": "I had some questions and no one ever…", "text": "I had some questions and no one ever got back to me.", "rating": 1}, {"title": "Unreasonable price quote", "text": "Do not trust this company with any bonds. They will rob you blind. Just take quotes from others first.The account manager name Zach gave me a quote for a bond $5600 when other company is quoting the same for $1600 or less. You will waste your time working with dishonest people and loose your money for trusting suretybond.com", "rating": 1}, {"title": "I received my notary bond on time", "text": "I received my notary bond on time, but unfortunately there was an employee’s name typed onto the acknowledgment section of the bond that should have been left blank for my name. My bond was not accepted by the county and I had to wait for the corrected bond to be received. Considering that submitting your bond to the county is a time sensitive matter and this is what the company specializes in, this reflects poorly in my opinion. Out of all the companies that offer this service I chose this one based on reviews and turn around time. I was deeply disappointed in their performance.", "rating": 1}, {"title": "Nothing instantly about it", "text": "It says receive your surety bond instantly.... as in instantly.... 2 days later it sends me a review before I’ve even seen the bond... but they have already taken my money. No idea how long it’s going to take either as there is zero communication. Go somewhere else to get your bond.", "rating": 1}, {"title": "Horrible", "text": "Horrible! I am unable to renew my Kentucky license because I have emailed and phoned this company numerous times for my electronic surety bond to be filed and you have been completely negligent. I will be filing complaints with federal agencies", "rating": 1}, {"title": "These people are not clear about their…", "text": "These people are not clear about their bond premiums. I purchased a bond today and was not specified that as a person who does subcontracting work, that my subcontractors would not be covered. Also, I found out, that I am also not going to be covered as a business owner. So I paid $127 for no reason and it went down the drain. I have no bonding coverage at all.", "rating": 1}, {"title": "bond not received", "text": "Date of experience: July 09, 2024", "rating": 1}, {"title": "Price shop!", "text": "Not five minutes after purchasing a bond from this company I called back to request a refund due to a phone call from a competitor I had been waiting for - giving me a price of 33% less and for a 2 year bond. No other company I know of disallows a change of mind, especially in a very reasonable amount of time - 5 minutes...Definitely shop prices, they are not the cheapest.", "rating": 1}, {"title": "Very bad experience with this company", "text": "Very bad experience with this company. I requested a quote for a probate bond and filled out an application. I was told a bond would be found within a day or two. I was never contacted again and after several emails to the guy Blake, I finally got a response saying he couldnt help me. Very unprofessional and will never recommend this site to any of my co-workers or friends", "rating": 1}, {"title": "Who Does That?", "text": "Surety Bond sent a quote so we accepted it, signed it, paid for it then two day's later we were told we needed to send in some more information to get the qoute they offered. That put us behind, our company is still waiting on an approval. Who Does That! This is unexeptable, NOT GOOD BUSINESSThank You,NanetteiAuto Sales LLC", "rating": 1}, {"title": "Dont do it. There are better competitors out there!", "text": "First time requesting a bond. The bond was issued for the invalid amount. I called with the hope to rectify the issue or even pay a fee to process a rider, and I was then transfer to multiple representatives to immediately shut-down my request. I was told they could not work with me or cut me a discount, but they be happy to sell me another bond for the full amount. It was a bad experience and a compleate loss of money and time. I would 100% suggest to look for another surety company out there.", "rating": 1}, {"title": "Misleading and also misguiding", "text": "Misleading and also misguiding. I'll never do business with this company and I wouldn't recommend them. PERIOD!!! THE LIE ABOUT UOUR STATE ACCEPTING THEIR PRODUCT LIES!!!!!! THEN YOU HAVE TO WAIT 5 YEARS BEFORE YOU RECEIVE A REFUND??? NEVER AGAIN", "rating": 1}, {"title": "They have a zero refund policy. CAUTION", "text": "I purchased a bond for the state of MO, but I found out a week later that the bond was not needed.  They refused to cancel the bond and refund any of my premium.  I could understand a 25% fee, but 100% is a RIP OFF!  Be very careful with this company.", "rating": 1}, {"title": "Absolute worst service ever", "text": "Absolute worst service ever! I ordered my bond a week ago and have yet to receive it. I called in and spoke to 2 individuals who were no help. If you would like to get your insurance in a timely manner go elsewhere.Edited to add I was charged  a $10 “rush” shipping fee. So where’s the rush????", "rating": 1}, {"title": "Scam Artists", "text": "I am so disgusted that I fell for their scam. I was so excited to use their service to get my notary bond. I chose them over NAA because it seemed the added \"insurance\" you provided was an added value.Well, needless to say, they sent me a bogus bond that the county refused. I wasted an hour of my morning on line, not to mention the 30 minute drive to get to the county office to file the bogus bond.This company is sham. DO NOT PURCHASE a surety bond through them...they will only rip you off.", "rating": 1}, {"title": "It was not easy or fast", "text": "Si hablas espanol NO COMPRES ningun bond en esta compania. No te van a dar soluciones y te diran que te vayas a comprar a una empresa donde si hablen espanol. Su servicio al cliente es un desastre y mas aun el agente Mark Karr, debes estar preparado para que te ignoren y hagan las cosas dificiles para ti. NO COMPRES ACA, busca otras, yo encontre una y en menos de un minuto me dieron soluciones. It was not easy or fast. They do not speak spanish, they are not spanish speaker friendly. I DO NOT recommend this company at all.", "rating": 1}, {"title": "Unfair and possibly illegal refusal to refund money.", "text": "We purchased surety bond through SuretyBonds.com from Travelers. Upon realizing that we already had another surety bond through the same company with duplicate coverage and overlapping coverage dates, Travelers cancelled this new bond and refunded $317 in full to SuretyBonds.com However, SuretyBonds.com is unwilling to give that money back to us, claiming that they have no refund policy. This is unfair and possibly illegal to keep the customer's money with no coverage, when they have received full refund from surety company.", "rating": 1}, {"title": "Terrible", "text": "Terrible! Asked to have bind sent to alternate location 5 minutes after purchase. No response. Sent a second email and got their same automated response “we will cal you back” and never heard a thing! They take your money quick but anything after that is pointless.", "rating": 1}, {"title": "I bought a performance bond for a Handyman business not Janitorial.", "text": "I bought a performance bond for a Handyman. Came with title janitorial. Not acceptable. You refuse to change nor refund. It was never conveyed it would be titled Janitorial. After it expires I will not comtinue with SuretyBonds", "rating": 1}, {"title": "They issued a bond and transposed the…", "text": "They issued a bond and transposed the last two numbers. Johnathan Pearson never returned my call. I spoke with Alan who said he handles complaints for Johnathan. They wanted to charge me additional shipping when they made the mistake. Very poor customer service!", "rating": 1}, {"title": "Reading your apology does not negate…", "text": "Reading your apology does not negate that this situation happened. I firmly believe that this reflects the core values of your company having to again apologize twice. I reached out to your CEO Josh Kayser via Facebook its very alarming that I had to reach such lengths to inform your CEO of this strife. As many busy individuals I'm sure he has had time to read the dialogue, digest, and I'm also for sure he will reflect. It's very disheartening that you have to apologize twice. First for the experience, Second for the inappropriate response. So, in essence nothing has changed. I'm bothered by this. Working in a customer service industry is a privilege as I explained to your Chief Officer. I would prefer a real integrity check, so that this not become the norm. Please do not respond this but heed to what I'm asking. For your company to clean up your customer service. No one should have to experience what I had experience from your services.", "rating": 1}, {"title": "Poor experience with customer service…", "text": "Poor experience with customer service provided unrealistic expectations about wait time to receive bond via email. Would not buy again.", "rating": 1}, {"title": "Will not recommend  surety bond at all…", "text": "Will not recommend  surety bond at all , after two years with them they decided to cancel  my bond , never have claim as they collecting free money every year .no  true reason why they decided to cancel , person I deal with day one there MR Levi no longer work there , there is no honest good  business that cancel customers for no reason specially there is no claims or issue ,Reason why I look for another bond company is surety advise me that will not renew my bond on this coming April that why I decided to cancel now They said it’s will take month notice to cancel they  worry about couple dollars left in the account fir refund", "rating": 1}, {"title": "Misleading, had to get the document notarized again.", "text": "False instructions.  Misleading. Says to simply download the bond and apply with state......NOT TRUE.Downloaded and saw there is a place to notarize by a live notary!!! What a lie.BE TRUTHFUL BEFORE TAKING PEOPLE'S MONEY", "rating": 1}, {"title": "Poor customer service...", "text": "The rep I talked to didn't know that I did not need a bond since my resident state is Texas..i need a refund for CO.Not happy with customer service..been waiting almost 24 hrs on an amended..rider", "rating": 1}, {"title": "House always wins. Zero customer concern.", "text": "No matter how small any change you may need, read everything! You get nothing! They will not go to bat for you and make adjustments on any error you make. Needed bond changed from $2200 to $2800 premium would not have changed, no risk increase to them. Same price all the way to $6000! All I got were policies and procedures repeated back to me from every customer service person possible. If I make a mistake, they keep my money. If correcting my mistake changes essentially nothing to their risk they won't help and keep my money. Willy Wonka- etcetera, etcetera....you get nothing, good day sir!! Only I don't even get the good day.", "rating": 1}, {"title": "Unfortunately dmv wouldn't issue title …", "text": "Unfortunately dmv wouldn't issue title  for golf cart with additional paper work. It was my understanding the bond would replace missing title, not so, wasted 100.00", "rating": 1}, {"title": "did not work", "text": "Though I would like to say they helped me with a surety bond that allowed me to get my truck titled and registered THEY DID not and will not refund my payment. so, I would say pass them by.", "rating": 1}, {"title": "Bought a dealer bond through them", "text": "Bought a dealer bond through them.  Was issued a bond that was unacceptable to the DMV paid for the correct bond to be reissued to me which 4 month later have never received the correct document.", "rating": 1}, {"title": "Don't patronize their services", "text": "Don't patronize their services. Had an awful experience. They are not transparent. If you make a mistake they won’t amend your bond, you’ll lose the money. They’ll make you purchase a whole new bond.", "rating": 1}, {"title": "Slow service, High price.", "text": "I called for a quote, it took 24 hours for the quote to be emailed to me and only after I asked where it was.  The quote was 3 times higher than every other price I was given, so it was a waste of time as well.", "rating": 1}, {"title": "The Effingham county GA tag office will…", "text": "The Effingham county GA tag office will not accept the title bond certificate y'all sent me. I NEED A REFUND ASAP! PLEASE CALL ME 9123122609", "rating": 1}, {"title": "They had the content of my bond wrong", "text": "They had the content of my bond wrong.  Mine was renewal and I have been with this company for six years and all they had to do was copy last years bond content to this year bond.", "rating": 1}, {"title": "I bought the tax preparer  bond a day…", "text": "I bought the tax preparer  bond a day before due date Oct 31. 2021.  Got an email confirming payment  and to upload certificate. Next day I received an e mail from Surety Bonds that my payment from the credit card wasn't being processed and they'll cancel my bond. I checked my credit card and it was being paid no problem. Still since is last day and Surety Bond wants a payment I paid again. Sent an email right away to Surety Bond wanting an explanation.The office is closed on weekend. After three days I see they charged me twice. I called and first agent responding only saw one payment charged.  I called again, next agent did help me and I told him I was issued two bonds different number. He will ask for a refund and said he was \"helping\" me since I order a second bond. I never did! and I might not get back the full amount.", "rating": 1}, {"title": "Have yet to receive my bond slow…", "text": "Have yet to receive my bond slow delivery, terrible customer services", "rating": 1}, {"title": "These guys are clowns!", "text": "These guys are clowns!! Unprofessional, not honest and worst off indifferent. I had to use them this year, I will never use them again. Blake must have too much business to care about mine....", "rating": 1}, {"title": "I still haven't gotten the…", "text": "I still haven't gotten the documentation that I need to complete my paperwork.", "rating": 1}, {"title": "Unprofessional  use robocalls and pushy", "text": "Really unprofessional been with them for 3 years but are really annoying and spam with robocalls. Also they're become increasingly  rude and pushy for early renewals.", "rating": 1}, {"title": "Still can't get a title  from Florida", "text": "Date of experience: March 29, 2023", "rating": 1}, {"title": "Very disrespectful.", "text": "My experience with surety bond was very disrespectful. Yesterday I called. I pressed number 6. As I was in contact with the company a young man attempted to assist me. As I had received a bond three years ago with the same company. Instead of saying that they no longer did business by looking up the value of a car and helping the customer. Things began to deteriorate as customer service rep began to treat me as if I was lying and hung up on me after I asked to speak with his manager. He began to laugh as if this was a joke. He quickly began to say she not going to talk to me. Even laughing again as he hung up. I quickly called right back. He began to apologize and disguised himself as a manager name Robert after he calmed down. This company I sincerely suggests that no one buys from if they treat customers in such a manner of disrespect. I think I will call to follow up with the lady seeing if she has returned to work, I don't think she is aware of his exploits in her abscence. This was the worst experience of disrespect and humiliation I have ever received from any business.", "rating": 1}, {"title": "Where is my Bond", "text": "Where is my Bond? I still have not received it.", "rating": 1}, {"title": "I tried to get a change rider for $250", "text": "I tried to get a change rider for $250.  They told me that they could not do that per there terms and conditions.  I purchased an $8000 bond and needed it to be changed to $8250, they want me to purchase a new bond.  I talked with other bonding companies and they told me it was common practice to get change riders.  Stay clear of this bonding company.As you can see from the response below, the company will not let you make a mistake.  If you put in the wrong amount due to unforeseen circumstances, such as getting the wrong total from the state, you can not get anything changed.  They just want to blame the customer for not getting the right amount.  They will not make an exception, nor did that ask the circumstances of why the total was entered incorrectly.  They just say it was your mistake so you will have to deal with it.  Not great customers service", "rating": 1}, {"title": "My bond was incorrect and I called to…", "text": "My bond was incorrect and I called to request assistance to have it corrected a week ago and nobody has returned my call. I basically paid $260 for nothing.", "rating": 1}, {"title": "Paid extra for  2 day delivery now 5…", "text": "Paid extra for  2 day delivery now 5 days still has not arrived! Very disappointed. Makes me wonder if the bond is any good or have just wasted my money.", "rating": 1}, {"title": "I requested for an ARC Bond", "text": "I requested for an ARC Bond. They never called me back, nor they had the decency to reply back to my emails. Very Bad, Very Poor. Not done Bernado.", "rating": 1}, {"title": "New Mexico Adjuster Surety Bond", "text": "I purchased a Surety Bond for a New Mexico Adjuster License and was told by the State of New Mexico that the information on the bond was incorrect.I called suretybonds.com and told them but they assured me the information was correct and that the only thing missing was my signature. So I signed it and mailed it off.It cost me $120 for the bond and to have it overnighted, another $50 to overnight the bond to the State of New Mexico.Well, the State of New Mexico tells me that the information is incorrect, and now they’ve denied my application and are requiring me to pay the $30 application fee all over again!!!I did my part by calling suretybond.com immediately after being told their information on the bond was incorrect but they blew it off and now I’m paying the price for it.The only way I would ever recommend this company to anyone is if they covered the cost to make this right.", "rating": 1}, {"title": "Felt ripped off when you advertised 30 …", "text": "Felt ripped off when you advertised 30 bucks for the bond and after going through application process couldn't opt out of 10 dollar delivery service.", "rating": 1}, {"title": "I haven’t received it or had any…", "text": "I haven’t received it or had any communication on this since I purchased it. I would like my documents", "rating": 1}, {"title": "they send me the bond with rong name to…", "text": "they send me the bond with rong name to correc and send a new they charged me $20 mailling charges there mistake but i have to pay $20", "rating": 1}, {"title": "Appalling Indemnity provisions", "text": "Appalling Indemnity provisions. Asked me to appoint them as attorney in fact and assign to them ALL my assets and future income!?! Something wrong here.Update 25 June 2020, after SuretyBonds.com posted their first reply: this company inexplicably decided to identify me by name without my permission on their response, while their reviewer didn’t bother to sign their name. When they were after my business, the SuretyBonds.com representative, Blake, had told me on the phone that “many people complain about the indemnity provisions”. Most importantly, the response from SuretyBonds.com is patently false, because other underwriters do have reasonable and acceptable indemnity contracts and terms, as I personally found out working with someone else. To reaffirm the 1-star review here, I also want to report that we purchased the same bond for half (yes, half) the premium quoted from another bond exchange, who apparently select their providers and partners with more fiduciary care for the benefit of customers.", "rating": 1}, {"title": "Agent Alex is very unprofessional I…", "text": "Agent Alex is very unprofessional I asked him for terms and condition about terms and condition, his remark is Per our conversation, attached is s a log of your purchase process stating the specific terms agreed to with timestamps as you processed them through our website. As we discussed, this is the disclaimer agreed to for every online title bond purchase through our website directly to ensure that you have done the proper due diligence prior to purchase. At this time, given the nature of the purchases you have made in the past and disagreements with the way that we conduct business we would simply recommend you contact another agency for your bonding needs going forward. We're sorry for any inconvenience this may cause but please contact us with any other questions. Thank you, Alex CraigCustomer Care Team LeadFYI There are no disagreement. A customers should not ask question to get understand of products and services.  I am not an agent or do I work for your company.      Bond Company has good products.", "rating": 1}, {"title": "$81000", "text": "Value bond must be $8100 ", "rating": 1}, {"title": "Terrible experience", "text": "Terrible experience.  Did not receive correct documents and customer service refused to honor cancellation which was requested within minutes of purchase.  Got told a bogus line about every city calls a certificate of insurance something else.  Waste of my time and money.  I do not recommend.>>>Completely wrong response from company.  I did not call to update my bond info.  I called to cancel the bond because it did not meet the requirements.  The rep, D***, said they had a marketing lead under my address under a different company name.  I told him it was not a bond for that company, but for my personal home repair permit.  I never received a call from anyone stating they were calling from this company.  Why would I do that if they were sincerely attempting to make this right for me?  I did get hung up on after answering a phone call about the time that they state.  Their reply just confirms for me that they took my money for nothing and now it seems they got upset that I posted the truth of what really happened to me.  This has been a truly unbelievably terrible experience for me.", "rating": 1}, {"title": "Make sure you will use for your state.", "text": "Date of experience: April 05, 2023", "rating": 1}, {"title": "My bond turned out to be useless", "text": "My bond turned out to be useless.  Florida did not recognize or accept. I would like a full refund.", "rating": 1}, {"title": "Terrible", "text": "I purchased a Lottery bond for $75,000 and got a confirmed quote from from SuretyBonds.com. They had required me to provide my credit info and my personal financial statement before the quote. Which I provided to them gladly and they took time to check it for 2 days. My credit is A+ rated. I called the company to confirm the quote twice and even spoke personally to confirm the quote. They forwarded me to their web payment page and I made the payment online with my credit card. They confirmed the payment and sent me a message the confirmed the bond is on the way within a day. They thanked me for the purchase and I contacted the lottery department to inform them the bond was on the way. Next day one of their executive calls me and tells me they have made a mistake in the quote and it is now 5 times as much and not possible. They told me they are sending me a refund check by courier in two days. This is completely OUTRAGEOUS. This is unacceptable. I will report them to the feds and the state and better business bureau if they do not make it good on their quote and agreed upon price. The transaction was complete and they defaulted on a agreed purchase.", "rating": 1}, {"title": "Agents representives are rude", "text": "Agents representives are rude , even im there customer", "rating": 1}, {"title": "It's been almost 3 weeks and I have not…", "text": "It's been almost 3 weeks and I have not received mine yet. Has it even shipped?", "rating": 1}, {"title": "alex is a joke..", "text": "alex is a joke... asked for call back on a clarification and got a smart mouthed email back.", "rating": 1}, {"title": "SuretyBonds was unhelpful regarding…", "text": "SuretyBonds was unhelpful regarding clearly explaining steps to take when the beneficiary died.", "rating": 1}, {"title": "Could not print the bond without it…", "text": "Could not print the bond without it blacking out the signature. In usable lousy. Very unhappy", "rating": 1}, {"title": "Several days have passed and I still…", "text": "Several days have passed and I still have not received my bond in the mail", "rating": 1}, {"title": "I ordered it on Monday and did…", "text": "I ordered it on Monday and did overnight …. And I still don’t have it!", "rating": 1}, {"title": "Quick service", "text": "Quick service. Website very informational. Love it!!", "rating": 1}, {"title": "Everything was good except for FedEx", "text": "Everything was good except for FedEx.  Use a different deliverer please!", "rating": 1}, {"title": "Documents are not valid and not…", "text": "Documents are not valid and not accepted to update title.", "rating": 1}, {"title": "USE SOMEONE LOCAL", "text": "I bought a bond for $25 and I have received nothing from them.", "rating": 1}, {"title": "Hello", "text": "Hello, the surety bond was unacceptable at the Florida DMV", "rating": 1}, {"title": "Great just great", "text": "Great just great. Thank you so much!!!!", "rating": 1}, {"title": "I have yet to receive the bond I paid…", "text": "I have yet to receive the bond I paid you for!", "rating": 1}, {"title": "What is a bond if you aren't covered…", "text": "What is a bond if you aren't covered with theft.", "rating": 1}, {"title": "Did not receive in mail", "text": "I was to receive my bond via FedEx", "rating": 1}, {"title": "I ordered a notary bond and haven't…", "text": "I ordered a notary bond and haven't received it", "rating": 1}, {"title": "calling me for payment three months…", "text": "calling me for payment three months before due.", "rating": 1}, {"title": "Bond was filled out incorrectly for the…", "text": "Bond was filled out incorrectly for the State", "rating": 1}, {"title": "I still don’t have the bond", "text": "I still don’t have the bond. Has not been sent.", "rating": 1}, {"title": "Great Job as all ways !!", "text": "Date of experience: August 24, 2022", "rating": 1}, {"title": "where is my BOND?", "text": "Date of experience: November 30, 2023", "rating": 1}, {"title": "Nagging phone calls are extremely…", "text": "Nagging phone calls are extremely annoying", "rating": 1}, {"title": "Amazing", "text": "Great! You’re business is amazing", "rating": 1}, {"title": "Got double charged!", "text": "Date of experience: June 09, 2023", "rating": 1}, {"title": "Miserable customer service", "text": "Date of experience: April 14, 2022", "rating": 1}, {"title": "Name and vin were incorrect", "text": "Date of experience: March 10, 2022", "rating": 1}, {"title": "How do i get my bond info??", "text": "Date of experience: November 01, 2021", "rating": 1}, {"title": "Very rude customer service", "text": "Date of experience: November 10, 2021", "rating": 1}, {"title": "Didn’t give me a refund", "text": "Date of experience: October 09, 2021", "rating": 1}, {"title": "EXCELLENT SERVICE", "text": "Date of experience: August 10, 2021", "rating": 1}]