[{"title": "The frustration of placing my…", "text": "The initial experience of placing my first order was far from customer-friendly. This establishment was recommended to me, so I decided to give them a call on Friday afternoon at around 1 pm. I urgently needed a Chef Base to be installed in our kitchen before the store opened, as the one we initially ordered did not meet the space requirements.I made sure to confirm that they were local to Georgia, and once verified, I proceeded to inquire about the availability of the product. Although the price was on the higher side, I deemed it fair since I could pick it up myself Sat morning. However, the trouble began right after that. They assured me that I could pick it up without any issues, but they didn't have the product on hand, rather had to go pick it up from 'up the street' so, I could get it first thing on Monday. To my disappointment, they informed me that it would only be available on Monday afternoon.To complete the transaction, I paid with the owner's credit card, just as we have done for our previous purchases totaling well over 400k. However, the customer service took a sharp decline from that point onwards. They requested a picture of the credit card, which I promptly sent. Then, on Monday morning, they demanded another picture of the owner with the credit card via text. Subsequently, they called again, insisting on a picture of the owner along with the credit card and his driver's license. Finally, before providing me with a pick-up time, they required an email from the owner granting permission for me to collect the item.Needless to say, this whole experience has been absolutely frustrating. The lack of service, reliability, and professionalism displayed by this establishment is unprecedented. As of 2:00 pm, I still lack confidence that the order, which has already been paid for, will be released for pick-up (or that they even have it) for the installers to proceed with the installation and meet the reschedule for sign-off. Each call only added to the mounting frustration. I even asked to speak with the person responsible for these verification policies, but to no avail - there were no calls from them whatsoever.Nowhere on their website or the paid invoice was there any mention of such a stringent verification policy. We operate in the hospitality industry, and up until this point, every single supplier, vendor, and partner has gone above and beyond to ensure a pleasant experience. Unfortunately, this was not the case here. Never before have I encountered such a poor purchasing experience, especially when dealing with all the necessary equipment, services, and contracts required to open multiple restaurants. This was an unfortunate first for us in the hospitality industry, as our previous encounters with suppliers, vendors, and partners have always been exceptional.", "rating": 1}, {"title": "P Point Market", "text": "My Company, P Point Market has purchased kitchen equipment from A City Discount (03/25/2019)The store instead of placing a balance back in our credit card, placed a IS Credit ($3,798.00).When the issue was found, I contacted ACity to get the balance back into my account.  A City Discount said that because it is an old account they can't do the reimbursement.  We think this is an abuse and at least they could give us an opportunity to get some merchandise. Very bad for this company.  Please advise how to handle this type of abuse", "rating": 1}, {"title": "I have used this company for well over…", "text": "I have used this company for well over $10,000.00 worth of business. You would think that a $50.00 dispute would have been resolved in a more timely manner but it took over a month. I ordered a lift gate for delivery, but the driver didn't use it. I have video and pictures documented and sent to ACityDiscount. However, ACityDiscount said the driver was disputing my word so they would not give me the refund, without more investigation. It wasn't until started calling twice a week did I get to speak to a manager, Summer. She was extremely rude and curt. Larry and Brian were always very pleasant when I talked with them, (many times I might add) but they were unable to resolve the issue without me going over their heads. A little kindness goes a long way. Unfortunately Summer will have me looking elsewhere in the future.", "rating": 1}, {"title": "scam company", "text": "0rdered $2,500 of four different types of chairs, salesperson told me that they dont have those no more and they keep them listed on there website to get people to call them. I feel this company is a scam.", "rating": 1}, {"title": "DON'T BUY FROM THESE PEOPLE!", "text": "DON'T BUY FROM THESE PEOPLE!I ordered a simple metal lifter/handle for deep dish pizza pans.  I received it in a box that was big enough to hold a motorcycle helmet and the lifter was so flimsy and poorly made that I wouldn't trust it to pick up anything hot or otherwise.  Okay, so I wrote them a note saying I wanted to return it and they said that they would have to get a return authorization from THEIR supplier first and then I would have to pay return postage to both them AND their supplier.  HAH!", "rating": 1}, {"title": "TMGM36 Griddle", "text": "Ordered a TMGM36 Griddle 7/30/21 it was back ordered finally received 10/18/21.  All the accessories were missing. Legs, Drip Pan regulator, and orifices for LP gas. Talked to a someone about this and was sent the legs, drip pan and one of three orifices. Still missing the regulator and two of the orifices. talked to them again and have had no responce", "rating": 1}, {"title": "Horrible experience", "text": "Horrible....I got a lot of stuffs in this space.But I realized that I got over size sandwiches prep cooler and griddle. So, I try to return it.They told me they will charge 25% from my prep cooler and griddle....OMG....Even I did not used it.......I could not trust that......I decided to do re-sell it. That's better for me.I got Horrible Experiences.I ask them show me return policy ,they said do not have return policy.....omg", "rating": 1}, {"title": "I bought a imperial 6 burner stove", "text": "I bought a imperial 6 burner stove. I still haven’t recieved the screws for the wheels. The oven was way off temperature wise and the calibration was not covered under warranty so it cost me another $350. Burners don’t work well.  Imperial says pulling 7 amps when it is suppose to pull 12 per burner is “ok my man” to the tech.  Service department does not help at all.  Wanted to return the stove and they won’t take it back. Don’t buy from them it has been horrible", "rating": 1}, {"title": "If you like being ripped off, buy from ACity!", "text": "We ordered an item from ACity that showed up in horrible condition.  It was a Hobart Vertical Cutter-Mixer.  It was missing key components and was in general disrepair.  Upon requesting service from the company, they gave us the runaround, and finally told us the problems were our fault, and we had not other options.  If you like poor customers service, poor products, and an overall bad experience, shop ACityDiscount!!", "rating": 1}, {"title": "This place is the worst of worst on…", "text": "This place is the worst of worst on customer service - I bought a piece of equipment and asked them for help and I will even pay - but no not until leave message with manager and he will get back with you next am - did he NO - I have been chasing done parts so I can open", "rating": 1}, {"title": "I appreciate giving me the lowest price…", "text": "I appreciate giving me the lowest price possible, even less than the web price. The salesman was very easygoing and helpful. The blender jar came quickly and is just what I wanted.  Thank you.", "rating": 1}, {"title": "Never shipped my order! Wants me to file claim on a shipment UPS never received!", "text": "They want me to file a claim with UPS on a shipment in which their tracking number showsUPS Never receiving! Avoid! Ripe Off! Horrible Customer service! 1Z246AT94253709328", "rating": 1}, {"title": "Zero Progress-No Call back-Zero rating", "text": "Since last post they contacted me but now it has been over 10 days and nothing is being done.  Not only that, now they refuse to answer their phones!  Left several msgs and got nothing back! Leaving me out to dry I guess. You buy a new item that states it has the \"best warranty in the business\" you would expect to be able to use that warranty, but apparently not for me.  They left an answer saying they provide 5star service but as everyone can see that is just not so.  Not even the decency to call and let a person know what is going on, what they are doing to correct the problem or at least just to let me know they answer their phone msgs!  Guess I have to send this complaint to the BBB and Consumer Protection Agency for their review of this problem.  Hope everyone else got great service from these guys, just letting you know I have not after 10 days!!!", "rating": 1}, {"title": "Very good customer service over the…", "text": "Very good customer service over the phone quick and easy.Been 6 day since order hope I receive it soon as I am outof product.  Not sure when it should arrive.", "rating": 1}, {"title": "great selection of quality merchandise", "text": "great selection of hard to find quality merchandisevery reasonably priced outstanding customer service fast delivery will definitely use this again", "rating": 1}, {"title": "Deceptive dishonest business practices", "text": "If you're looking for restaurant equipment DO NOT PURCHASE FROM THE COMPANY BELOW. They sold me a split door freezer last year listed as \"new\" which was actually manufactured by True in 2005. The compressor went just two weeks ago. True only covers their compressors for 5 years and will not cover it because the unit is 12 years old. When delivered there was a USED sticker on the freezer and they still claimed it was new.  These folks are crooks.  There service manager is arrogant and rude and claims the unit was never even turned on and checked yet they still would not fix the compressor.   By the way....The Better Business Bureau has 11 complaints logged against this business!!!  Live & Learn.  Your reply below is a lie.  The unit was manufactured in 2005 according to True who said they would have honored the warranty on the compressor.  True stated you cannot sell a piece of their equipment that was manufactured 12 years prior as new, but you did.  Never been used huh, I guess that's why you guys slapped a USED sticker on the unit.  Regardless of your warranty True would have honored the compressor warranty so your argument is moot, and a lie.  You people are crooks!", "rating": 1}, {"title": "Stay away from Mike Ellin", "text": "I want to say that this review is solely based off of the customer service I have received from Mike Ellin, the Showroom Manager, since Justin Kennedy.I received a wall mount bracket that came with two plates but only one arm, in my mind this tells me I am missing an arm. I emailed Justin who I purchased it through and received no response. After a couple of weeks, Mike emailed me back saying that I only ordered one bracket and any others would have to be purchased. I asked follow-up questions, again thinking there should be two arms and received no response. I sent two more follow up emails with no response to Mike. I emailed the customer service email describing the service I received, funny enough it went to Mike. He did email me back, saying he did not see any order I have ever placed, nor does he have an account with my name on it. I have spent over $10,000 at ACD in the past year. I responded again with all of my information and have yet to received a response back, this was 5 days ago.Some of the salesmen may be great, but if they have to answer to this guy for any issues that come up I can promise you that you will not be taken care of as a customer. There are other options out there that want your business.", "rating": 1}, {"title": "Refusal to Contact their customer", "text": "I bought, what was promoted as new, 2 Coldtech refrigeration units which were to have the factory warranties.  Now it is time to use the warranty and I find out from the company there never was a warranty attached with these units!  ACity had even listed these units touting the company's warranty as 'the best in the business with 3 years bumper to bumper'.  They NEVER indicated these were being sold without a warranty.  Even my invoice states these items as being 'NEW' not used or discontinued models.  My disgust with Acity stems from their REFUSAL to call me back or put someone on the line when I call who can help!  They will not even be respectful enough to return a phone call.  Coldtech execs were very upset to hear of these practices and have since contacted Acity.  I am sure this feedback will do little to make them call or uphold the warranty they advocated with the units.  I hate to go to the Consumer Protection Agency and BBB but maybe that is my only course of action here as everyone at ACity is in hiding.  Seems everyone has had a great experience with ACity, lets see if they change my mind a re-write a new feedbackOne Very upset customer.  Do not like being misled and then left holding the bag!", "rating": 1}, {"title": "Worst experience Ever !!!!", "text": "Went in to buy two dishwashers went thru with the sales man to make sure I got the right ones. we got it all figured out then I gave him my credit card he ran it thru and of course it went thru then he tells me after the fact that they have to do a verification that would take 10 min. of my time by charging a random amount to my credit card thats when it all started if you use keybank they do not post there charges for a day or so so I told him forget the order I would just buy it from webresaurant who are awesome bought many of things of greater value from so he told me he coulnt cancel the order Imaginge that so i asked to talk to a superviser told him to just cancel the order after talking to him for 10 min him trying to get me to convince me to not cancel the order he hung up on me. what great customer service the they called me again the next day hounded me about doing this verification mind you I have bought from them before without any problems just to get this whole experience over with it took almost an hour to do this I told him to be sure one of the owners or someone high up called me guess what not a call do yourself a big favor pass these guy by terrible and very unprofessional buy somewhere else. would give them negitive stars if I could", "rating": 1}, {"title": "Bought a used True two-door freezer for…", "text": "Bought a used True two-door freezer for about $2000.00 in October.  Didn't work at all when finally plugged in (mid November)  I did call \"A City Discount\" and left a message.  No reply.  Spent $894.29 on refrigeration repair (just got the bill now, hence the review).  It was made operational, but leaking water into freezer compartment.  Then this week, the kitchen filled with a burnt electric smell and it went dead again.  Parts are on now on order. I had ordered equipment from them before, so, as a return customer, was hoping to at least get a return call.  No such luck.  My advice: don't go for their used equipment. My repairman says that the unit clearly had been worked on before as it had cheap replacement parts (which were the latest parts to fail).  I should have bought new, but I was caught needing to meet a health inspector's demands at a time where funds were short.  Now I'm out $2,900 and waiting on the next bill-- and I'll still have the leak in the freezer compartment to deal with... and I'm pretty sure I'll continue having issues.For $3,800 I could have bought a True T-49F new with 3 years warranty on parts and labor, 5 years on the compressor.Don't throw your hard-earned money away on folks who won't even return your call.  You will regret it, like I am right now.", "rating": 1}, {"title": "LIARS AND THIEVES", "text": "DO NOT TRUST OR DEAL WITH THIS SCAM COMPANY LEAD BY MARTY. THIEVES AND LIARS.", "rating": 1}, {"title": "worst customer service and don't trust their website", "text": "(Atlanta, GA.) I will never go back to that store. I called ahead and asked if they had continuous feed food processors in the showroom on display and the girl on the phone asked which brands and I told her and she said yes. So I drove 30 minutes to get there. When I walked in no one asked to help me so I asked where they would be. When I went to look there were none on display. On 2 brands in boxes, not on display and not one of the brand that I asked about. So I went back to the counter a 2nd time and had to interrupt a conversation between 2 employees to ask if there were any out in the store somewhere. The answer was no. So I went back to the shelf looking for the brand that I was interested in and could not see it. I looked on line and it said it was in stock (which I checked before driving so far).  So I went back to the counter a 3rd time and once again had to stop their conversation (between 2 employees) and ask if someone could help me. The girl asked what I needed, so I proceeded to ask about the appliance. She did not know what I was talking about so I showed her on my phone and that it was in stock but I could not see it anywhere. She looked it up and said it was online only. I asked her why it said \"in stock\" , she had no answer. And STILL no offered to go back to the shelf with me and take a look. I told her that I called before I came and drove 30 minutes to look at a product that was supposedly in stock. I was exasperated at the level of customer service and knowledge of their products. I just walked out. Don't expect any sort of help if you go to this store.Update after response 12/2/21I did not ask for a specific model. I wanted to see the brand which was not on the shelf and showed as \"In stock\" on your website, which I was told was not kept in the store and online only.  If it is not in the store it should not say \"In stock\". Its as simple as that.", "rating": 1}, {"title": "Shipped promptly", "text": "Shipped promptly, and was just what I ordered", "rating": 1}, {"title": "The cooler still not working", "text": "It should of been check beforehand", "rating": 1}, {"title": "Great customer service", "text": "Date of experience: February 26, 2018", "rating": 1}]