[{"title": "Had to cancel order because every time…", "text": "Had to cancel order because every time I try to pay for an item using my PayPal, RubyLane tries to charge me for a $900.00+ vase. Even when I then switch to a different payment ( credit card, debit card) it still tries to charge me for this same vase that I didn’t buy. I have had to go directly to the seller & waste countless emails & phone calls in order to finalize a sale. ", "rating": 1}, {"title": "Totally overcharged for everything ", "text": "Totally overcharged for everything . Insurance that I didn’t know about , the shipping charges , then sales TAX ? Not for TEXANS ON PRECIOUS METALS !   Never again ! $8.00 purchase into like $18.00 ?", "rating": 1}, {"title": "I made an offer to the seller Serene Jewelry Collections", "text": "I made an offer to the seller Serene Jewelry Collection , and they responded by stating that the item contains high-quality diamonds, subsequently declining my offer. I requested a detailed description of the diamonds, but instead of providing any factual information, the shop owner increased the item price by 37%. Their response was: *The price has been updated to reflect the current market price. In this environment, we have many pieces we have not updated the price on in several years. Thank you for your interest.Vivien and WilliamSerene Jewelry Collections on Ruby Lane”.This experience was disappointing as I was looking for transparency but received neither a description of the diamonds nor clear reasoning for the price increase.", "rating": 1}, {"title": "Have to wonder about their tech", "text": "For the longest time I was wondering why the website was down and finally just learnt from a friend on an antiques forum that they've actually blocked Singapore for \"security reasons\". Considering the country is Asia's wealthiest nation (and the world's 4th) this just makes no sense at all. Blocking numerous honest collectors who have good customer relationships with the sellers just because of the actions of a few bad apples. These bad apples exist in ALL countries -- would hate to think there was any racist bias here. Seems to me it would make more sense to strengthen the website's security and infrastructure?! Though it probably reflects on its security levels right now when it can't even handle the same concerns other major sites like Ebay, Etsy and Amazon have to deal with *roll eyes*", "rating": 1}, {"title": "The C5a GALAXY TN toys Nomura made in…", "text": "The C5a GALAXY TN toys Nomura made in japan doesn't work with batteries in. It's no say before. That's unusual. Bad expérience. I see your awsered. What do you Take me for? A complet idiot https www rubylane com shop mygrandmotherhadoneLouis SimpsonWichita Falls , TX  PlatinumRuby Lane Exclusive since 2008Vintage Rare 1960’s new old stock Nomura Toy Company of Japan battery operated Lockheed C-5A Galaxy transport plane. The Nomura Toy Company manufactured toys from the late 1940’s through the 1970’s. Vintage Rare 1960’s new old stock Nomura Toy Company of Japan battery operated Lockheed C-5A Galaxy transport plane. The Nomura Toy Company manufactured toys from the late 1940’s through the 1970’s. ", "rating": 1}, {"title": "Buyers beware and avoid ViaSophia Shop", "text": "Buyers be aware and beware!  Ruby Lane policy offers no protection for buyers even if the item is falsely or inaccurately described.  Buyer is responsible for all return shipping costs regardless of circumstance.  In my case specifically at ViaSophia shop, shop owner Devin Rench did not feel compelled to “do the right thing” and pay for return shipping charges and Ruby Lane policy leaves it to the discretion of the seller.  Furthermore, seller never answered emails and I eventually had to contact him by phone because Ruby Lane requires returns be handled thru Seller.", "rating": 1}, {"title": "The customer experience is clunky", "text": "The customer experience is clunky.  There is no place to edit/update your payment information.  I was unable to click on the payment for a credit card to see which card is on file so I clicked on check thinking I would be brought to a screen to put in an electronic check.   When I clicked on check I purchased the item.   Also, unsubscribing to emails does not work.   It shows on my acct as not being subscribed but yet I receive emails every day.   The browser I use is Firefox", "rating": 1}, {"title": "you could be clearer about each shopsin the end I am blocked by every shop…", "text": "you could be clearer about each shops separate terms and condition policy.tingyour policy of blocking a buyer so completely from communictating with a seller,, and which, which iin short time spreads so every seller in blocked is unfair, and doesn't help other seller who do not even know that they have blocked you via some automatic setting.", "rating": 1}, {"title": "To leave this review is sad", "text": "To leave this review is sad, my shop has over 1000 sales and over 400 5 star reviews and while trying to expand and open on rubylane, it won't let me, it says my item is not authentic...which one and how so and why shoot themselves in the foot as now they have given me a good reason to dislike them and not shop there. They are welcome to apologise and change their attitude if they choose.", "rating": 1}, {"title": "There is no help on the \"help\"…", "text": "There is no help on the \"help\" choice.You can only ask questions about the specific already programed categories not a real question. Want to ask about a specific type of JEWELRY i.e. vintage Mexican Sterling and the only choice is sterling in general sterling If you want actual real Vintage the category is swamped with modern mass made crap. How do I get around this?", "rating": 1}, {"title": "I bought an expensive meissen figurine…", "text": "I bought an expensive meissen figurine by The Vault Fine Antiques & Estate Jewelry, the shop owner Garre Swain and the fingers of the figurine is broken. I looked closely and it was repaired which I can see glues on it. And one finger is missing. I told the shop owner about this and he refuse to this matter and keep saying it was perfect condition even I send him the detailed pictures. Now he is saying that I switched the figurine and I am dishonest person. This is the worst experience I ever had and I will request the full refund of this.", "rating": 1}, {"title": "I don´t use ruby lane any more after…", "text": "I don´t use ruby lane any more after many years because you no longer make available \"Todays Arrivals\".  As it is now, it is far too time consuming and repetitious.  I am sorry about this because I enjoyed ruby lane and have spent several thousands of dollars over the years.  Alan Meeds", "rating": 1}, {"title": "Tedious process", "text": "Ruby Lane offered different payment options, but didn’t state that “PayPal” was the only payment offer until the very end after attempting processing. As a new customer this was a confusing and disconcerting buying process. There is nothing wrong with my card - nor account. You don’t even have the date of my transaction correct.", "rating": 1}, {"title": "I bought a clock from Sally’s Antiques of Ruby Lane…", "text": "I bought a clock from Sally’s Antiques & the dealer Andrew stated it was in working order but when I received it it was not working so I had to have it repaired by a reputable clock repairman $240.00 later. I emailed Andrew & sent a copy of the repair invoice & was ignored! Not a good experience at all! ", "rating": 1}, {"title": "As a seller", "text": "As a seller, the Ruby Red Tag Sale actually occurring on Black Friday is a disaster. I only sold ONE item at 50% off!  Everyone is out shopping at brick and mortar stores and the urgency of purchasing online at Ruby lane naturally diminishes each day of the sale (from past experience). I don’t think the length of the sale will help either but we’ll see. Please don’t scheduled this on Black Friday Again. Kind regards,", "rating": 1}, {"title": "Barkus Farm Antiques sent a picture in…", "text": "Barkus Farm Antiques sent a picture in a frame nothing like the painting pictured on the website or the receipt.  So very, very disappointing.The explanations given on the phone do not sound in the least bit credible.", "rating": 1}, {"title": "SIGNING-IN IS VERY PROBLEMATIC", "text": "SIGNING-IN IS VERY PROBLEMATIC, DEMANDS AUTHORIZATION CODE EVERY TIME. MESSAGING SYSTEM IS AWFUL, CAN NOT REPLY DIRECTLY TO A SELLER'S RESPONSE. FORCED TO GO BACK TO THE STORE HOME PAGE AND SEND A NEW MESSAGE. ARE WE IN 19TH CENTURY WITH RUBYLANE?", "rating": 1}, {"title": "I tried making an offer", "text": "I tried making an offer. It was rejected, too low. But Ruby Lane does not allow another offer being made for that item. What kind of buggary is that???Of course Ruby Lane says just contact the seller. The problem, seller said only accepts offers via the make offer function. So, Ruby Lane, why not allow more than one offer?????", "rating": 1}, {"title": "Ruby Lane is a company that you…Absolutely do not trust!!", "text": "Ruby Lane is a company that you definitely want to steer clear of!!  Ruby Lane stands behind the most nefarious and unscrupulous dealers on their website.  I purchased a Victorian bracelet on Ruby Lane which was misrepresented by the dealer in both wrist size and condition.  I sent the bracelet back to the dealer and now, he is refusing a full refund due to him stating the damage on the bracelet (which I received as damaged) was caused by USPS.  In order to get my money back, I would have to commit mail fraud by filing a bogus insurance form with USPS.  I say - No Way!  Ruby lane is fully in tandem with this crooked dealer!!  BEWARE!!", "rating": 1}, {"title": "Ruby Lane failed to communicate.", "text": "I made an offer that was accepted by the seller. When they tried to send an invoice, my account showed no offers. When I got no information on my offer, I had to contact the seller to understand what happened. When I contacted Ruby Lane, they said it was a technical problem. No further information from Ruby Lane. Unacceptable.", "rating": 1}, {"title": "Ruby lane did not provide the correct…", "text": "Ruby lane did not provide the correct link from the invoice to pay through PayPal. Still trying to resolve the issue.  It's one I've never had before.", "rating": 1}, {"title": "Scam", "text": "I purchased a necklace from one of your vendors. I received confirmation, and a mutual agreement to purchase / sell the item. I was told that I would receive shipping and payment instructions within 72 hours. Two days later I received an email from the seller stating they had sold the item elsewhere, presumably for more money. They offered to sell me something else, that I was not interested in. I looked on Ruby Lane again and the item is still listed. This is a classic bait and switch. What a scam!", "rating": 1}, {"title": "paypal doesn't work/scam", "text": "Fri 9/01/2023 10:02 am. Rubylane seems to have decided that everyone must pay via a paypal account. Paypal has been strange for some time and I haven't gotten it to work on numerous tries, until I realized they're insisting on a cellphone number, which I don't want to give them, and now it's so bolixed-up I *can't*, even if I wanted to. I have made numerous purchases from rubylane via credit card, so I guess that's the end of the trail....Sat 9/02/2023 9:11 am. Rubylane replied that when choosing paypal, I could select a credit card. I *USED* to be able to do that -- couldn't do it that day.", "rating": 1}, {"title": "Stupid search and order method", "text": "Why do you not put item numbers on your items.  Makes it very difficult to find a particular item if you are getting it for someone else.A item would make ordering a lot more simple than searching the whole thing with only an item description.Very stupid web site!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!111", "rating": 1}, {"title": "Purchased an item from seller stating…", "text": "Purchased an item from seller stating all in working order.  In fact, only 1 part of item worked.  Returned it and she said 1 item damaged in shipping and box opened.  Fighting to get a refund.  They want to claim UPS when it was broken to begin with.  Ruby Lane customer service absolutely no help.  Does not stand by their product.  Customer fighting me.", "rating": 1}, {"title": "Very poor way to do business", "text": "I paid nearly $900 for an item and the seller, who claims \"We respond to all orders within 24 hours\" has been unresponsive to all attempts to communicate. When I sought help from Ruby Lane I was told to wait 2 more days.", "rating": 1}, {"title": "My Grace Estate Jewelry - A Scam!!", "text": "I, unfortunately, am having to deal with a nefarious dealer on Ruby Lane by the name of My Grace Estate Jewelry.  The dealer misrepresented his Victorian 18k bracelet by stating it would fit a 7 inch wrist - it did not. I have purchased many bracelets that are truly 7 inches - no problem!!  Also, if the bracelet was truly 18k - it would not have had a huge dark silver area on it which could have been an old repair - the dealertried to claim it was just discoloration- No Way!!  Then, to top it off he states that he received the bracelet back damaged even though USPS packed it right in front of me and insured it.  Out of $2156.82 he offered me a whopping $975.00 - what a scam artist!!", "rating": 1}, {"title": "Why cant I view you on SAFARI", "text": "Why cant I view you on SAFARI. Ive shopped on RL for years using SAFARI and for some idiotic reason you have dropped this platform.WHY? Customers like this platform and you have made it more difficult for me to view and make my purchases and I resent it after so many years of using your site. Stupid move on your part!!!", "rating": 1}, {"title": "i clicked on NO INSURANCE and IT ADDED…", "text": "i clicked on NO INSURANCE and IT ADDED the Insurance fee ANYWAY and NOW I have a NOTE saying I BOUGHT the ITEM and NEED TO PAY FOR IT. RUBY LANE IS ABSOLUTELY NO HELP, I TRIED TO REACH THE CHAT LINE FOR LIVE HELP AND GOT NO HELP, I AM FED UP.  RL NEEDS TO GET THEIR ACT TOGETHER AND BE MORE LIKE EBAY WHERE THESE PROBLEMS DO NOT HAPPEN. WHERE DO I GET HELP FOR THIS??", "rating": 1}, {"title": "Worst Experience shopping for a…", "text": "Worst Experience shopping for a specific antique gift for a family member. The seller was beyond rude, degrading, harrassing and vulgar so much so that I canceled my ordered. I will NEVER deal with Drury House Antiques again.", "rating": 1}, {"title": "I felt wrongly accused by \"Twin Pines!\"…", "text": "I felt wrongly accused by \"Twin Pines!\" I was trying to talk (via Email,) to the seller. SHE said I had terrible comunication skills as well as many spelling mistakes(which was prob. true.) Who can spell well whitout spell check? She went on to say, because of my many goofey Emails( I was just asking about making an offer) I must be a scammer. She then banded me from ever shopping at \"twin Pines. I felt not only was this poor Costumer Service, but unfair. I have never had such treatment in all my years using Ruby Lane. Please excuse my spelling! Thanks for the oppertuneity to express this situation. I am still a loyal costumer to Ruby Lane but, not to Tewin Pines!", "rating": 1}, {"title": "RubyLane is Unreasonable When It Comes to What Browser they want you to use.", "text": "Rubylane tells me my browser needs to be updated OR I should buy a new computer.  My browser, Safari on a Mac Laptop, is updated as much as it can go.  NO OTHER INTERNET SITE has told me there is a problem with the browser OR had the nerve to tell me to buy a new computer.  They keep suggesting I use Google Chrome - I don't want to.  It's intrusive AND prone to hackers and virus' - Apple is known to have the most protected system of any computer system.  I only continue to use Rubylane because of the purchases I make with the vendors on the site - if those vendors sold elsewhere, I would definitely stop using rubylane.  In another matter, there used to be a pinterest button that you could copy and then pin to your pages - then Rubylane said they had to \"fix\" the one that would work on apple - and then promptly never fixed it - this goes back three years.", "rating": 1}, {"title": "For the second time Paypal refunded my…", "text": "For the second time Paypal refunded my money.  I never get the item.  I will never buy anything from ruby lane again.", "rating": 1}, {"title": "I hate PayPal and am uncertain as to my status.", "text": "I put in my credit card info but got an email saying I paid through PayPal. I hate PayPal. I won't use PayPal. I need to know that my card is being charged and I'm not using PayPay. If necessary, I'll contact the store owner, with whom I've done business before, directly.", "rating": 1}, {"title": "The website lacks", "text": "The website lacks. I could not complete my purchase because the PayPal link wasn’t there. Maybe this is just a glitch for me, but the experience has left me wishing I could at least contact someone.", "rating": 1}, {"title": "I tried to place an order", "text": "I tried to place an order, but seller was non-responsive. No shipping charge estimation - just instructions on how to pay. Not sure how much I'm paying yet. I cancelled the order.", "rating": 1}, {"title": "I keep having issues with email…", "text": "I keep having issues with email verification issue. Ruby lane says they’re sending me verification emails. I check my inbox, spam no email. Please fix", "rating": 1}, {"title": "Kings of Spamming you and sending multiple emails every day. Inbox polluters ", "text": "Update ..Despite the reply from Ruby lane who reported my review and tried to get it removed I can confirm I AM STILL Receiving UNWANTED EMAIL...More came yesterday. So I have reported as spam. Ruby Lane if you want proof I have a screen grab of my inbox.Spam, Spam, Spam, Spam SPAMMERS.I opened a profile to see if it was worth checking this site out to buy and sell through. From that moment I received daily, multiple daily marketing emails. I unsubscribed from all emails more than once and then that seemed to make it even worse. Today I received 10 emails in 1 hit before 8.39am. I would report them to the ISO for breach of GDPR but as Ruby Lane is a US based company that wouldn't stop them. If you want your inbox jammed up with junky, spammy, sales messages then this is the platform for you. ", "rating": 1}, {"title": "Seller \"TWIN PINES\"was very rude to me", "text": "Seller \"TWIN PINES\"was very rude to me! I made a mistake thinking one of their items was on sale for $90 but I missed the sale ending date by, one day.I then emailed the seller asking if I could still get thr item at the discounted price! She said the item had never been part of the sale. I then made some(what I thought,) were good offers. She then said, Imy emails were like those of a scammer(I could not beleave she really said what she did.) Then she blocked me from EVER doing any business with her again,I have been doing business with Ruby Lane for years(and have been happy with my expierances) But not the one with \"Twin Pines\" Very poor Customer Service!", "rating": 1}, {"title": "I just received the garnet ring", "text": "Misrepresented ct weight by double. Feel cheated. It is advertised as a 6 3/4, but it fits like a 7 1/4 and twirls  around my ring finger. Not big enough to change fingers. Will have to get it sized. I was avoiding this. Incorrect size advertised.", "rating": 1}, {"title": "I never received the item I ordered and…", "text": "I never received the item I ordered and I have never received a refund! I have spent way too much time trying to figure out how to close this unfortunate transaction (definitely my last with Ruby Lane)", "rating": 1}, {"title": "Hopefully a scammer has been thwarted!", "text": "Someone used my email address for a purchase I did not make. I alerted the shop owner, and hope that she does not ship the items until this is rectified and she receives payment. Sucks that this still goes on.", "rating": 1}, {"title": "Had problems paying", "text": "Had problems paying. I still do not know if it connected. It just kept circling around with thanks for paying with pay pal underneath.", "rating": 1}, {"title": "I paid with my credit card not PayPal…", "text": "I paid with my credit card not PayPal then got a notice it was going through PayPal!  I don’t use PayPal as I closed that due to issues with them.  Now it’s a mess.", "rating": 1}, {"title": "Upon questioning an item up for sale by…", "text": "Upon questioning an item up for sale by shop named \"Vintage Playthings\" I was given a rather rude response. they had a dolls described as mint and I questioned obvious flaws and was given a rather rude answer, as if to say how dare you. Another seller \"Dolls of the Golden Age has had a Cissette Magot doll still pictured when you do a search for these dolls. I asked my after several months why this doll was still up when she was sold long ago. She had some lame excuse and then blocked me from buying or contacting her. What is with these people? I have every right to question anything that is up for sale or being pictured in their shop when I'm a potential customer. I was never rude about anything, but I was treated as though I shouldn't ask questions. I don't shop here like I use to. Too much of a hassle and it use to be that better dolls were offered here. Not anymore. Now there is a lot of so-so dolls way over priced and with rude sellers. I rarely shop her anymore.", "rating": 1}, {"title": "Bad customer service", "text": "Every few months, you claim my email is not valid. Usually this is fixed quickly and I am sure the problem is at your end. This time the stoppage came the day before the RedTag sale  oh June 21 and still has not been fixed. No live person has answered my chat. Service is awful.", "rating": 1}, {"title": "The site not the vendors are the issue", "text": "I love the Vendors, I have always have trouble with their credit card payment system ", "rating": 1}, {"title": "I selected and purchased five plates by…", "text": "I selected and purchased five plates by Stangl and then the next day received an email \"not available\"!", "rating": 1}, {"title": "Seller cancelled my order because she…", "text": "Seller cancelled my order because she said it had been double sold. What rubbish! Not a trustworthy placeThe seller sent an echeque for the refund so I have not even got my refund yet", "rating": 1}, {"title": "I did not purchase this item", "text": "I did not purchase this item.  I asked right after I paid to stop this order.  We are getting a loan & my credit card is on hold.  I never made a payment. The next day I asked again to stop it.  It then read order fulfilled.  She is not reading my messages. I have not paid for this.", "rating": 1}, {"title": "Don't want to use PayPal", "text": "Don't want to use PayPal.  I gave you a debit card number and want you to subtract that account for my payment to you.  No PayPal.  Kind of tricky how PayPal got in there.  I don't want to pay you twice.  Jan Noel Koecke", "rating": 1}, {"title": "My silver vase arrived damaged", "text": "My silver vase arrived damaged.  I sent an email to report the damage, but I have not gotten a response", "rating": 1}, {"title": "Pretty useless Tiffany alarm clock", "text": "Good day,Ipurchased a Tiffany clock that arrived non functional. It does not work at all.I emailed the seller about the situation and have not heard back from them.Margaret Brand.", "rating": 1}, {"title": "I have been trying to cancel bid…", "text": "I have been trying to cancel bid 6005854 with no success! Jan RiesePlease respond to confirm bid is cancelled", "rating": 1}, {"title": "I was charged twice for my item", "text": "I was charged twice for my item. Once on PayPal and also by credit card. I want to pay be credit card NOT PayPal!!!! Thank you for correcting this error. Jane Hudak", "rating": 1}, {"title": "I have not received any information…", "text": "I have not received any information about my purchase.Thanks, I received the painting and I love it!!!", "rating": 1}, {"title": "Did not get back to me with shipping or…", "text": "Did not get back to me with shipping or exchange rate, and then rudely sent me a message saying they would not deal with me, I have not dealt with them yet and won’t be rude.", "rating": 1}, {"title": "AS A SELLER", "text": "What can we do to make your profitability better? ask RLCut your commission in half. It was so demoralizing to implement  that policy at the same time the internet tax became law. Maybe it was a bad decision by an out of touch CEO, but on the face it looked like betrayal. Something has changed at the top on RL and it trickled like acid rain down on everyone.  It was an all too familiar story and sadly - trust is gone. At least if costs had legitimately gone up, the starting number could have been 2%??  I used to grab people by the shirt sleeves and rattle their arms telling them about Ruby Lane! It was relaxing, I made friends, it was very profitable and I wanted people to open shops there to encourage the trajectory.. What happened? I do still recommend RL, but with many provisos and warnings - which is too bad. If you could wish for one thing that Ruby Lane could change to make your selling experience better, what would it be?Get rid of image gallery. It takes me 3 minutes to list  on Ebay. It takes me an hour to list on RL. Whoever thought that having to load your pictures twice was a time saver? And who decided to make it so every photo you attach to the listing DISAPPEARS from the image gallery and if you need that photo you have to load it AGAIN? Sellers should have the discretion to delete the pictures per their convenience, not have to worry that if they make a mistake it will be another 10 minutes of their day wasted and to make matters worse, RL doesn't even save the draft if I close the window by accident or RL signs me out. NONE of this would ever happen if you were simply taking photos from your PC or phone. Besides, it's in the best interest of the sellers to take excellent photos.  If a seller is not representing the quality that RL requires it could be dealt with separately.  The AIP as well is all negativity. It seems that the entire image processing part of RL was designed to complicate and frustrate. And the images that result are low quality, amateurish and quite obviously not processed in the US.", "rating": 1}, {"title": "I could not get the transaction to…", "text": "I could not get the trsnsaction to vomplete .", "rating": 1}, {"title": "Why do you assume everyone has a stupid…", "text": "Why do you assume everyone has a stupid cell phone.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "rating": 1}, {"title": "i don't use paypal.so try t0 use my…", "text": "i don't use paypal.so try t0 use my credit card and  y9u ddn't accept itl]so why can't pay with a credit card without paypal", "rating": 1}, {"title": "Very complicated process to get the…", "text": "Very complicated process to get the address correct and then because of that my bank has tagged it as a fraud and I don’t think that the purchase went through.", "rating": 1}, {"title": "PayPal will not let me use my Debit…", "text": "PayPal will not let me use my Debit Card everytime I have an issue!!!", "rating": 1}, {"title": "The product I paid for never arrived", "text": "The product I paid for never arrived, it has no tracking and its been 1 month now.", "rating": 1}, {"title": "Poor Service", "text": "The “shops” that I have sent questions to, do not respond. Poor customer service.", "rating": 1}, {"title": "Do not like the fact i was diverted to…", "text": "Do not like the fact i was diverted to paypal. I used my visa but they paid paypal. Hope this isnt a scam Donna", "rating": 1}, {"title": "Seller was great but not taking a…", "text": "Seller was great but not taking a credit card was ridiculous", "rating": 1}, {"title": "I am totally shell-shocked", "text": "I am totally shell-shocked! And confused. I was \"THINKING\" about making an offer, and was directed to \"join\" before I could make my offer, which WAS going to be $75. When I'd joined, I was taken to where I was to submit my offer of $89, which I didn't even make.  Then I was directed to pay. Its ok if i get the doll in the end because i want her, but after all else i was told it would not process unless the offer was accepted. I HAVE NOT BEEN TOLD IT'S BEEN ACCEPTED yet PayPal paid the seller.", "rating": 1}, {"title": "I found out the clarity of the diamonds…", "text": "I found out the clarity of the diamonds is not worth the price. So I cancelled the offer", "rating": 1}, {"title": "Very Difficult and Confusing if making…", "text": "Very Difficult and Confusing if making more than one purchase.", "rating": 1}, {"title": "I bought in something in a Ruby Lane…", "text": "I bought in something in a Ruby Lane shop. I got an invoice I paid it. I wrote 2 emails. I didn’t get an answer. I didn’t get the object!", "rating": 1}, {"title": "This website is awful", "text": "This website is awful! i tried to subscribe and make an account and every time i hit submit it erases what i've typed in! this is one of the worst websites ever go fluff yourself!💢💣💥🖕👎😡😠💀 also i'm using my moms account!", "rating": 1}, {"title": "I was deterred from offering vintage Items for this website. ", "text": "Bad idea to try and sell on this website. After I jumped through all hoops only to not be a seller. ", "rating": 1}, {"title": "I was purchasing a locket from a Seller…", "text": "I was purchasing a locket from a Seller who had sent photos of necklaces she felt would look nice with this locket. This Seller sold it to someone else after investing days corresponding with her.  Her reason for this was unfounded and ridiculous. A very uethical and untrustworthy individual. Extremely disappointing. Thank you", "rating": 1}, {"title": "Disappointing.", "text": "Unfortunately, I will be hesitant to shop with Ruby Lane, and more specifically, will never shop with Pauline Street on Ruby Lane, again.  The item purchased arrived as not described and with a broken and half missing diamond.  The seller, Pauline Street, after a slow response, argued with me about the missing stone and Karat of gold, which was tested by my jeweler.  I returned the item with much disappointment in the seller and the process.", "rating": 1}, {"title": "It’s been a week no cotact", "text": "It’s been a week. I made my purchase. The owner has not contacted me. Appear to be out my money. Not happy at all. Not sure if this is a scam", "rating": 1}, {"title": "unable to delete an order before…", "text": "unable to delete an order before payment, receiving ridiculous invoices without having even paid!!", "rating": 1}, {"title": "They are not seller friendly", "text": "They are not seller friendly. I had a store a few years back & my store was thriving but unfortunately it was hacked from overseas & instead of HELPING me they literally banned me from the site. I tried emailing, handwriting a letter & everything possible to get my store back… I did Absolutely NOTHING wrong!! There was no help, no number to call, no one responded, no email.. absolutely nothing!!! It was obvious they didn’t care.. believe me when I say if I could litigate what happened to me, I would! I’ve tried opening another store but they will not let me.. basically, their lack of 2 step authentication, no one for immediate help & no other options leads me to believe they don’t know what they’re doing. READ their bad reviews, you’ll get the ‘gist’ of what’s going on behind the scenes..  0 stars, no thumbs up & if you’re a seller, protect yourself because THEY WON’T .. find another venue.. Run!!! Don’t walk!!!**Follow up to their reply--Are you kidding me???There were NO 'lengthy' emails--you did NOT email me once, you did NOT call me, you did NOT try to even contact me, you closed my shop without explanation & subsequently blocked/banned me. You did not try to FIX your mistake or help me when I desperately needed it. In truth, my store was hacked by changing the password, there was no 2-step authentication & YOU failed to help me as a seller & BTW Your 'canned' responses here on Trustpilot are not helpful.. if anything it should show people exactly how you deal with sellers & buyers.", "rating": 1}, {"title": "Eddy*s sent a $235.00 soft metal item DANAGED", "text": "Eddy*s sent a $235.00 soft metal item that arrived in a damaged box, itself also crushed. Eddy*s requested I send pics of the item. Then days later requested pics of the box. Then days later stated, \"the box is not mine, what to do!\" I again sent pics of the box with his address, the damage, and the item and have not heard back. What to do is refund me!!! Help, I have been stiffed by Eddy*s!! I want my money back now!!!", "rating": 1}, {"title": "There should be seller ratings", "text": "There should be seller rating , the stupid platinum  badges that shows how many sales seller had is so useless. Not the best experience. Also Site is not buyer friendly and difficult to use (no I’m not old, just in the 30s). First and last time I shop here. Competitor sites are better.", "rating": 1}, {"title": "Difficult to purchase as a guest", "text": "Date of experience: April 23, 2023", "rating": 1}, {"title": "Don't get duped", "text": "I purchased a package off Ruby Lane that was delivered to the wrong address. I can't get the seller or Ruby Lane to respond to messages. No where is there a number to calm or an option to open a dispute with a seller. I finally emailed the person listed directly under customer service, but I'm starting to think it is all a scam. I paid extra for insurance but if no one responds it doesn't make a difference", "rating": 1}, {"title": "I don’t understand this payment method", "text": "I don’t understand this payment method. I chose to pay by credit card, entered my credit card information, clicked Submit, and then was taken to another page where I was told, “Thanks! Now you need to pay!” and then given blank fields to enter my CC information AGAIN. I buy almost everything online and have no idea what is going on here, and the website provides no explanation of why I need to enter my information twice. Did my order go through? What charges will appear on my credit card statement? Who knows????", "rating": 1}, {"title": "Terrible Experience", "text": "This website is much too difficult to use, much too difficult to change your information but most of all I just bought what was advertised as three bread-and-butter plates for $98. I put them in my cart I purchased them then got a note from the seller saying that was per plate. Well that’s funny because when I clicked on it to purchase it it put all three in my cart for the $98. So they need to be better about watching who sells on there. I won’t buy on Ruby Lane again.", "rating": 1}, {"title": "I can't seem to pay for my purchase", "text": "I can't seem to pay for my purchase! I'm trying but keep getting messages that the seller will contact me for payment info. This is frustrating. I just want to pay and for you to ship. It's too complicated. Too many steps.", "rating": 1}, {"title": "Ordering procedure is overly complicated", "text": "It required me to register with so many complex steps that by the time I was registered my item was gone.", "rating": 1}, {"title": "The seller sold undisclosed damaged merchandise that I know have to return and eat over 60.00 in shipping costs. They didn’t provide return label or refund overpriced shipping fees.", "text": "The seller sold damaged merchandise", "rating": 1}, {"title": "Ruby Lane should have a mechanism in place to prevent items that are no longer available from continuing to be listed", "text": "I went to the trouble of finding two antique oak columns on Ruby Lane.  I purchased them pending how they would be shipped.  I spent an hour researching shipping company’s.  After 24 hours I received an email from the seller apologizing that “ the columns had be sold and just not removed fro the Ruby Lane site”.  Very disappointed.  It seemed like no big deal to the seller", "rating": 1}, {"title": "My first ever purchase through…", "text": "My first ever purchase through Rubylane..Communication through the site very difficult. Took a long time for me to get a refund and eventually paypal had to step in and escalate the case for me. My second purchase i never got an email from the seller to calculate postage or any contact at all..So ended up not being able to purchase an item i wanted.I will not use Rubylane again. It was not a good experience for me.", "rating": 1}, {"title": "Your order system sucks", "text": "Your order system sucks. I can’t proceed in the checkout due to a shipping/ address issue. I think it’s due to the seller not shipping to countries outside of the US. I’ve contacted the sellers but the issue persists. Your ordering system won’t allow me to proceed with my order for 2 different sellers. If I continue to have problems with your site’s system I will stop buying through RL", "rating": 1}, {"title": "Some Things to consider when buying…", "text": "Some Things to consider when buying from Ruby Lane. If the purchase does not match the sellers description there is no recourse if the seller is unreasonable or dishonest. Ruby Lane does not mediate disputes. I strongly suggest you use Paypal in case that situation Occurs.", "rating": 1}, {"title": "I never got my item", "text": "I never got my item.  After waiting two weeks I was told the item is no longer available.  A refund would be immediately on the way.  Still waiting.", "rating": 1}, {"title": "my email works and ruby lane says it doesn't", "text": "I am very frustrated because Ruby land continues to tel me and the people I am buying from that my email does not work. I have tried to figure out the problem and Rubylane has been unresponsive", "rating": 1}, {"title": "Furious 😡I Purchased a dominos/flower double…", "text": "I Purchased a dominos/flower double sided bracelet and I put it on it was dry rotted and broke apart never received my Asian box yet not a good experience @ all😡", "rating": 1}, {"title": "No confirmation of card processing", "text": "Too hard to get my correct name and address into the billing portion - I used my nickname, then realized that populated my billing info. I could not change my billing info, so, I had to enter new addresses. And I kept getting error messages when I entered my credit card info. Add zip code. Ok. Now add address. OK. Now add City. Why were those not on the screen to start with?!? I am not sure if my payment info transmitted or not. Very poor system if you ask me. And now I find this review is public. That should have been stated up front.", "rating": 1}, {"title": "They stole my money", "text": "They stole my money. It's not a safe marketplace", "rating": 1}, {"title": "It is a terrible way to do business", "text": "It is a terrible way to do business.  I tried to make a purchase.  It was difficult to negotiate through a shipping address different from a billing address.  Poor web site designThen I was routed to the dealer.  The seller did not respond via email. The seller did not respond by telephone.  No way to pay for this purchase.  It is a terrible cumbersome, incomplete process that I will not repeatCheryl Maxwell", "rating": 1}, {"title": "I did not enjoy the shopping experience…", "text": "I did not enjoy the shopping experience - it was not intuitive and I accidentally ordered something without knowing how much shipping was, or being able to update where I wanted it shipped to. Poor website design and customer experience. I'm just glad I wasn't looking at anything too expensive! There's no option to cancel an order", "rating": 1}, {"title": "I tried to make an offer on a Steiff…", "text": "I tried to make an offer on a Steiff teddy bear but don't think my offer could be accepted because I wanted to use Visa.  I am not a member of Pay Pal.   Very disappointing!", "rating": 1}, {"title": "Purchased from Ruby Lane's \"Precious…", "text": "Purchased from Ruby Lane's \"Precious Toys\" Shop what looked like a real pretty \"Presentation Box\". I paid 180 Dollars + 78 Dollars  Shipping! When I finally received the package I almost fainted. The antique \"Presentation Box\" turned out to be an old CIGAR BOX the seller had glued wallpaper around the outside and painted the inside with kids watercolours. The Box still smelled of Cigars.  Unbelievable $258 for an old CIGAR BOX!! What a rip off!  Never been so disappointed!  The Seller never appologised!", "rating": 1}, {"title": "Antique toy lot", "text": "The lot of items I wanted to purchase was very poorly described. The photo of the lot  showed a grouping of 7 items, but the order was actually for only 2 of the items. Extra photos were included in the description for many other items that were not included. I realized this when I saw another identical photo for the lot. This was very confusing and I opted to cancel my order. I did receive an immediate refund. But of course I was disappointed not to receive the items I thought I would get. I recommend that sellers show only the items that the buyer is actually going to receive.", "rating": 1}, {"title": "i purchased an item for christmas then…", "text": "i purchased an item for christmas then was notified the next day the item was already sold when I purchased it.  I was fully refunded but how can you sell something twice if everything is online?  And why havent they responded to any emails?  Just poor business practice.", "rating": 1}, {"title": "Though I have used Pay Pal for 20 years…", "text": "Though I have used Pay Pal for 20 years or more, when I pressed it to pay I was torn away from this site and lost  the siteI wish I could p. When I tried to charge my payment using Visa I was stopped because the site demanded a mobile phone number, and I don’t possess  a mobile phone. I would like to know an email address where I could write to the store. I previously paid by check to this seller, but I can’t easily get to a mailbox at my great age.", "rating": 1}, {"title": "I feel very ripped off by Ruby Lane.", "text": "I feel very ripped off by Ruby Lane.Number 1: I made an offer for $175. Seller countered $245. I countered $215, but got email sold for $245. I decided to still go forward because okay price, but I never actually accepted the $245 seller counter offer. Number 2: I was charged tax on shipping and insurance. Ever hear of a class action? Your system is programmed to tax the entire amount, not just the amount of the merchandise.", "rating": 1}, {"title": "A total misunderstanding on my part, from my previous review! Please disregard! Thank You..", "text": "The seller blocked out my purchase, because I typed in the wrong 3 number code on the back of my card! They were not in the correct order, the numbers are similar, this is not the first time! I tried to correct the info., with the numbers in the right sequence, it was not allowed! Strange way to do business! I will not order again from this seller!", "rating": 1}, {"title": "The website can be cumbersome", "text": "The website can be cumbersome and quite counterintuitive. It is difficult to change delivery addresses and impossible to edit orders past a certain point. I have had numerous problems trying to make payments on this website and have become very frustrated. If the products I found were available elsewhere I would probably use a different website.", "rating": 1}, {"title": "Ordered a product for a special event. Weeks later was told they did not have it. Now too late.", "text": "I had a request from my son for a particular product, filling a niche that he had been trying to fill for years, for a special upcoming occasion.  He sent me the link on rubylane and I ordered it immediately.  Only weeks later did they send a refund to Paypal (never even an apology email) that said \"Oops...guess we don't have it\" and refunded my money. But now too late to find anything else. Really, really bad treatment for a not-cheap date.", "rating": 1}, {"title": "they just ignore my articles", "text": "they just ignore my articles. how do they think they are?", "rating": 1}, {"title": "The checkout process is terrible", "text": "The checkout and order process was so annoying, if I had not been buying a gift, I would have cancelled my order out of spite. 1. No option to check out as guest2. Can't add address at checkout, must go back to account and add3. Select payment method4. \"Place order\"5. Taken to payment screen, if wrong payment type selected, have to go back a page6. Enter card info7. Have to re-enter zip code and phone number, even though it is already in my account. 8. Finally get to actually place order.", "rating": 1}, {"title": "Rubylane is the worst .com site ever!", "text": "Rubylane is the worst .com site ever!! I've been shopping at Ruby Lane on and off and recently I tried to apply  to open a shop. I did everything they asked for. Even opened a Business Account with Paypal exclusively for them and sent them 50 Dollars in Fees! But they just shined me with a reply that their records show that the user of my email does not want my email to be used by Ruby Lane or that my email was removed from their records. I tried again and then was told that I can not open a shop. No reason given.Needless to say they never refunded my 50 Dollar fee!!", "rating": 1}, {"title": "I bought an item my first item and it…", "text": "I bought an item my first item and it was clear that my first order I would receive 50$ off my first order. There was no promo code I kept going back I tried relentlessly to get my 50$ Ruby Land if you want my business you need to refund me 50$ Thank you I paid via PayPal please refund me.Thank you 🙏🏽 💜", "rating": 1}, {"title": "Merchandise great, paying for it, not so much!", "text": "Why do you not simply take a credit card? Who wants or has the time to mail a check or money order?!?  I do not have \"pay pal\" and never will. In order to sell vintage anything, surely you must understand your customer base better.  Not sure I will follow through with this purchase.  I would not have made a purchase with any business this far out of touch.  Would have cancelled had the site been  more user friendly.  More importantly, up front about having to create another sign on and account to purchase. No thank you!  Ruby, you have a long way to go to earn my money.", "rating": 1}, {"title": "Very very confusing ordering procedure", "text": "Very very confusing ordering procedure.  Have lost out on many many items I would have otherwise purchased.  It keeps asking for my password and does not accept it, although I have recorded my pass word so am sure that I am putting in my correct password.   I have to wait until my granddaughter comes and she does it for me as I do not understand your methods of purchasing. I bid and purchase many things on EBTH and Etsy and have had no trouble.  A simpler method would be easier for people, such as me, (age 88) who does not understand computers.", "rating": 1}, {"title": "Ordered 1909 on line then talked to ur…", "text": "Ordered 1909 on line then talked to ur rep and he said it was in the safe, paid for item now he apologizes for not getting back to me Friday but he sold it at a FUN show and forgot to record it, not very good business, more than a simple mistake", "rating": 1}, {"title": "DO NOT MAKE A PURCHASE WITH THIS…", "text": "DO NOT MAKE A PURCHASE WITH THIS WEBSITE!Contacted merchant multiple times after not receiving the items for 3 weeks. Tried phone and texts. No answers. Nothing that said if items were shipped or not. Appears to be fraudulent.Needless to say, will not use this website again!", "rating": 1}, {"title": "Couldn't finish transaction and no help…", "text": "Couldn't finish transaction and no help from customer service.", "rating": 1}, {"title": "I just signed up for this site and…", "text": "I just signed up for this site and attempted to counteroffer on an item I made an offer on and immediately was informed that I committed to buying the item at the price I clearly wanted to counteroffer on. Be careful when you use this site. There is no option to verify offers.", "rating": 1}, {"title": "Bad Business Practice", "text": "I purchased a Victorian Garnet necklace last night for my wife's 65th Birthday. It was emailed by the seller as sold to me. Also marked as sold to me on the Ruby Lane website. The next morning at 6am I received an email from the seller to say, very sorry the item you have bought has been sold to someone else. This vendor has sold our item to another person, even though it was being held for us. If the item has already been sold, it should be removed from the website, or the seller should have removed it from the shop display. This is bad business. Will not trade with this website in the future.", "rating": 1}, {"title": "I like the site and the vendors very…", "text": "I like the site and the vendors very much, they are wonderful to work with.  However ever since the website upgrade it has not been as easy or intuitive to use.  I have to go to a random vendor at times to ask questions as there is not even an easy way to find out how to navigate the site.  Such as how to delete an item from your cart.  Therefore items remain in your cart for ages and eventually are deleted by the store. I then go back and if not sold, purchase the one item I want instead of the 3.  There is work to be done but vendors are lovely and trustworthy.", "rating": 1}, {"title": "I have tried to purchase from a Daniel …", "text": "I have tried to purchase from a Daniel  Meyer Having agreed a price of $170 I asked if the item could be sent without glass and frame for less postage and greater safety I have aske twice No reply Insulting behaviour from a fellow dealer", "rating": 1}, {"title": "$1100 Ring gone missing - No assistance at all", "text": "Paid $1100 for a ring 10 days ago.   I still do not have it.  Tracking the shipping shows no activity in over a week.I contacted the company to ask for help and what I got back was an insipid, useless email from their customer \"service\" department giving me the usual Covid excuses and suggesting I hold my mail.  The bottom line is they were too cheap to use a premium service like USP or Fed Ex on a valuable item and instead just threw it in the mail where it was promptly lost or stolen.  No refund offered but my credit card company has taken care of that.   NEVER AGAIN", "rating": 1}, {"title": "YEAH SURE !!!", "text": "The owner sent me an email telling me the price was a mistake for sure.Would not sell the item at the advertised price !!!Total ripoff !  Ruby Lane did not offer any help at all !!!I will not shop with Ruby Lane ever again.So long to a great customer ...", "rating": 1}, {"title": "Ruby Lane's computer forms are annoying…", "text": "Ruby Lane's computer forms are annoying and difficult.  Their directions for filling in my address were WRONG, INCOMPLETE, AND ANNOYING.  The form itself is finicky, requiring too much precision for phone numbers etc.  What an miserable experience it was!", "rating": 1}, {"title": "Terrible", "text": "Terrible, awful and deceptive. Ruby Lane treats their sellers terribly and literally makes you jump through hoops to be deemed “good enough” for them. They completely lack any customer service or support, as speaking to a live person is simply not an option. They will pocket your balance if they close your shop for no reason without explanation. I funded my shop and they closed it even though I was selling like crazy and am an antique appraiser myself. They kept my money and I had to contact and pay my attorney to send them a letter with no response back. I’m currently having to start a lawsuit against them. Please don’t buy into their lies.", "rating": 1}, {"title": "Failed purchase", "text": "So after a long process of narrowing down and finding the exact ring I wanted to purchase as a surprise engagement ring, I put in my order. I immediately received an invoice and was told that the shop would contact me with the payment details. The next afternoon I received a message saying the item I purchased was NOT AVAILABLE! How is this even possible? I've been hunting down the ring I wanted for months and now I feel completely defeated. Since it is vintage I will not find another like it and will now be comparing everything to the ring I should have got her. Why would I try to order again if this could happen AGAIN? Sincerely, a very disappointed \"customer\"", "rating": 1}, {"title": "Disappointed and won't buy in this…", "text": "Disappointed and won't buy in this store again. At first, the dispatch was long, I had to write to the owner of the store - Valerie Gomez ( OLGARI SHOP ) and ask if the doll was sent .. Upon receipt, I saw defects on leather hands - a large crack on one and a hole on the other, which were not mentioned in the description, and the photos were too small (taken from a height of human growth) on which, of course, nothing was visible. But the main blow was to discover that the doll is not 24 inches, but only 21 1/2 (after all, the size of the doll affects its price). I think this is not a mistake, but deliberate misleading - deception!", "rating": 1}, {"title": "Inventory Mysteries", "text": "I purchased a ring on their site only to be informed it was not available. I had hoped to replace a lost treasure/heirloom and the false advertisement certainly added insult to injury 😩 the only comfort was a refund. Gee, thanks.", "rating": 1}, {"title": "I found the process untrustworthy and…", "text": "I found the process untrustworthy and stressful.    After giving up my credit card data, I was told I could not purchase it, \"sale pnding.\" While this makes sense to them, for me - this was a block. I then tried to call them, not possible. I then had to research what it meant and found out.       Then, the specific dealer contacted me asking for me to pay him. I already paid. Wow, very confusing. He wants checks, I paid with Credit Card.      Again, I am sure that Ruby Lane has a process they KNOW, but I do not. I am still anxious, very anxious, not knowing why I am being asked to pay again, what will happen if I do.", "rating": 1}, {"title": "HI-I JUST ORDERED 3 VINTAGE GLASS DOLL…", "text": "HI-I JUST ORDERED 3 VINTAGE GLASS DOLL BOTTLES---I PUT MY AMERICAN EXPRESS NUMBER AND IT SAID I NEEDED 19 NUMBERS--WELL, MY CARD HAS ONLY 15-----I KEPT GOING AND HIT SUBMIT AND AS FAR AS I CAN TELL--NOTHING WENT THRU...I WOULD APPRECIATE IT IF MY AMERICAN EXPRESS NUMBER IS NOT ON ANY FORM, EXCEPT MY ORDER..CAN YOU E-MAIL ME AND TELL ME WHAT I DID WRONG???? DID MY ORDER FOR THE 3 BOTTLES GO THROUGH??? THERE ARE OTHER THINGS I WANT TO ORDER, BUT I NEED TO KNOW IF THIS ORDER IS OKEY !!!! PLEASE E-MAIL ME, MAYBE I AM DOING SOMETHING WRONG??? THANKS, BARBARA--STAY HEALTHY. I PUT ONLY ONE STAR,  LIKE I SAID, PERHAPS I AM DOING SOMETHING INCORRECT WHEN I ORDERED.", "rating": 1}, {"title": "This was the most horrible experience I…", "text": "This was the most horrible experience I ever had ordering an item online.  To make it worse this was a Christmas presentWhere The problem arose was after completing the order I cannot find a link to purchase it .I did get an email stating that I would be contacted by the seller to obtain my credit card information.  So after a couple days I went back in to check my order only to find out the Order had been canceled due to lack of payment.I sent an email to the ruby company asking for help in completing the purchase.  I never received a responseI only wish I could give this company less than one star like minus a 100 because their customer service sucks", "rating": 1}, {"title": "Original price $125", "text": "Original price $125. I made a counter offer of $90. Seller replied with $116. I countered, or so I thought, with $105. It immediately took me to the payment page. So I believe I unknowingly paid $116.", "rating": 1}, {"title": "Ordering from Ruby Lane was a nightmare", "text": "Ordering from Ruby Lane was a nightmare.  First off you can't just order as a guest you have to have an account.  Trying to set up an account was like catch 22.  Every time I tried to set an account up they said I already had one but did not have a password.  Tried to set up a new password and they sent me to facebook.  It went on and on.  The worst part was I could not contact Ruby lane.  There was no email there was no phone number there was nothing because I did not have an account.  After an hour I got the account straight I could not find an email to contact them.  This was a horrible experience!!  I will never order from them again if I can avoid it", "rating": 1}, {"title": "I ordered my item on the 27th January", "text": "I ordered my item on the 27th January, to be shipped in the US to a US address. To date nothing has arrived.Cannot get Gosha from PastNowFuture to reply to me in spite of many messages.", "rating": 1}, {"title": "I bought & paid for this doll dress", "text": "I bought & paid for this doll dress. I have not heard from the seller.the site said they were unavailable until 4/23/21. it now says theyare unavailable until 6/1/21. What is going on? I want my dress.", "rating": 1}, {"title": "I purchased a number of items in your…", "text": "I purchased a number of items in your Red Tag Sale.  I always paid as soon as I purchased the item, however some sellers asked for payment directly through PayPal, and others through my credit card, and still others with whom I must call to give them my c.c. numbers.  Now when I look at my purchase orders, I can't tell which is which.  Since I made quite a few purchases I am sitting here and trying to figure out what I have paid and what I have not since apparently RL does not recognize some payments.  I thought every item went through Ruby Lane regardless of how it was paid.  I do not think I will even try to purchase items on your Red Tag Sales again as it is so confusing.  I have better things to do with my day.", "rating": 1}, {"title": "Wrong email", "text": "There is a customer who has an email address similar to mine.  Instead of that customer receiving Ruby Lane emails, it is me.  I have never ordered from Ruby Lane, nor do I plan to order in the future.", "rating": 1}, {"title": "Worst online transaction of my life", "text": "Worst online transaction of my life. Purchased item and received copy of paid invoice. Three hours later received a partial refund. I searched emails and my online order history for an explanation  of what happened and there was none. Checked the listing and saw that the item was now priced $1000 higher. Sent an email to the seller and was told she had provided an explanation at cancellation (which I never saw) and that the original price was an error. I inquired about the disparity in refund and she stated that the parent website should provide the remainder of the refund because of fees. So I do not have the item, I will not get the item, and I am waiting for the second part of a refund from a third party.", "rating": 1}, {"title": "very hard to negotiate payment put in…", "text": "very hard to negotiate payment put in address and password about 5 times never would accept it. Also one should be able to know shipping before finnalizing a purchase. Do you do things in the dark", "rating": 1}, {"title": "Not easy to complete my first purchase…", "text": "Not easy to complete my first purchase on Ruby Lane!   Not sure there will be a second on this platform. Made offer, received counter offer and had one more opportunity to present my second offer. Despite multiple attempts, the system would not let me. Finally accepted  the seller’s offer and moved to complete purchase. Next, tried  multiple times to pay for my purchase. Their system kept telling me my card would not work through PayPal. Their system never even attempted to debit my card. Woke up this morning and tried a different PayPal route. This time it worked.Now, want to see my purchase on a larger screen. My order will show me lots of details but will not let me look at other than a thumbnail sketch of my purchase. I am online for work and my business throughout the day, so this isn’t user error. Next time, I’ll purchase the same item through eBay or Etsy and avoid all the system hassles. The same item was posted on all three sites.", "rating": 1}, {"title": "Tried to buy watch chain", "text": "Tried to buy watch chain. Can't figure out how to pay with my visa. Ruby lane is more complicated than it needs to be. Can you help me with my stalled purchase ?", "rating": 1}, {"title": "Awful seller R. Baskin", "text": "Your seller R. Baskin accepted my offer and then did not reply to my emails or send me a purchase order. This is very unprofessional treatment. Third time this has happened now. Wont shop here again.", "rating": 1}, {"title": "Stained glass window arrived very…", "text": "Stained glass window arrived very poorly wrapped Window had 1 sheet of bubble wrap in a box with NO padding.  It arrived in pieces.  SO DISAPPOINTING!", "rating": 1}, {"title": "The quality of the product is not what…", "text": "The quality of the product is not what i expected. The quality was very poor for the price. The napking holders were broken.", "rating": 1}, {"title": "Where is My Order?", "text": "I have received no tracking on my order. Paid for Priority Mail and it’s still not here. Contacted seller who said “on its way” and would send tracking. Has not. Have asked again No response.", "rating": 1}, {"title": "Do NOT buy from Ben and Joe!", "text": "I don't know about RubyLane in general, though I didn't have a great experience, but I'd say it was entirely the fault of the sellers, \"Ben and Joe\" that I had an unpleasant experience, so I want to specifically address them. Being that it was the first time I'd ever heard of or used RubyLane, I didn't exactly understand how the payment system worked. I explained that to them. They did not try to help, they were incredibly rude, and cancelled the invoice so that I couldn't buy my item, all because I didn't answer promptly enough for them (apparently waiting one day for an email reply is too much for these astute businessmen), even after I apologized for misunderstanding, they refused the sale. Huh, must be nice to be independently wealthy and not need to make money from sales...", "rating": 1}, {"title": "I purchased from Emily's Attic, LLC : item received not as described", "text": "The chain did not match to the description made on rubylane.It was described as a 3 mm chain but it was only 2 mm, for the wide of a chain it’s a big difference. I searched specifically a 3 mm serpentine link chain.The seller proposed me to send back the chain for a refund «  as the chain did not meet my needs ».I could not do that as I had paid the chain but also: + 16 $ delivery fees + 21 $ international taxes + had to pay 33 $ return fees, a total amount of 70 $, more expensive than the 59 $ chain itself ! I would have paid all that for nothing... So I kept the chain and will try to resell it. Very disappointing transaction.But what really shocked me is that the seller did not even apologise for her mistake.As rubylane doesn't allow to review the sellers, we have no idea if they are ok or not.", "rating": 1}, {"title": "I am 81 years old", "text": "I am 81 years old. I thought I ordered a doll and panicked when I didn't. Had my son order it again on the computer and got it! From now on he will order for me!!!", "rating": 1}, {"title": "I bought a couple of items but have no…", "text": "I bought a couple of items but have no idea what shipping will be or tax. I don’t think I like this website. You have to agree to the sellers terms before you know what they are.", "rating": 1}, {"title": "Avoid this site", "text": "Avoid this site. It is a scam. I entered my credit card information and the order was not placed and i later got a notice my order was cancelled because I didn't pay.", "rating": 1}, {"title": "BEWARE DOLLCOLLECT antique dolls paid…", "text": "BEWARE DOLLCOLLECT antique dolls paid us dollars802.48 to reserve a dolltehn I became suspicious after they gave me a load of rubbish about fraud on their account etc and would have to send funds via a different channel, I asked for a refund to cancel before lock down they asked me for my bank details and since haven't sent funds back and I am certain they have sold the doll to someone else anyway. I have sent hundreds of emails since and no reply. Ruby Lane can't do anything as it was a layaway item that isn't registering with them my bank can't refund me as it happened before lockdown too long ago now as i was thinking they were affected by COVID, they obviously haven't as they are still listing and still no reply or funds.  I HAVE BEEN CONNED OUT OF US$802.48.  CARE IF BUYING ON LAYAWAY FROM THEM!!!!!!!!!!!!!!!!", "rating": 1}, {"title": "My first offer and ruby lane sent…", "text": "My first offer and ruby lane sent counter and low and behold they sent me an invoice for counter offer. I never accepted or touched any buttons. I was holding at my offer", "rating": 1}, {"title": "MY FIRST TRANSACTION WAS A DUD. NEVER AGAIN!", "text": "Bought an autograph and received an email from seller in Vienna that it was \"misfiled\" and could not be sent. My first transaction. My last!", "rating": 1}, {"title": "I bought a antique clock that was falsely labeled to lure in buyers…", "text": "I bought a antique clock that was falsely labeled I believe trying to justify their high asking price.  I was excited because it was my first Ruby Lane purchase (Ellie's Treasure Shop) and they had a antique clock with a very rare movement in it.  But, I received an e-mail and a call from the seller a few days after the purchase stating the clock I bought did not have the movement they listed in the main title of the clock for sale but it had a more common, not as rare movement, in it which is less desirable and sells for less.  This is false advertising almost like a bait and switch technique.  I was extremely disappointed!  They did offer me a full refund which I accepted since they falsely listed the item.  This is the first and the last time I will ever buy from RUBY LANE!I don't trust Ruby Lane and never will again.BEWARE to any other buyers looking at this site to buy an item.  They might do the same to you.", "rating": 1}, {"title": "Nothing from shop owner yet!", "text": "Last week, I purchased an item that (hopefully) will be shipped soon. The thing is, per Ruby Lane’s follow-up email to me, I have to wait for the shop owner to get back to me with a grand total. I received an email from Ruby Lane yesterday stating that the shop owner would get back to me with totals for shipping, insurance and tax. I have not yet received an updated invoice from him/her. I can’t pay until I do! Another thought has crossed my mind: I have found shop owners that sell across platforms, so I truly hope this didn’t happen to me and that this seller gets back to me soon. I find it odd that a gold rated seller hasn’t yet responded to my purchase with further instructions. The reason for this rating is:  Ruby Lane needs a more efficient system of checks-and-balances. It shouldn’t take more than 24 hours for a shop owner to finalize a purchase!", "rating": 1}, {"title": "Tooo confusing of a site", "text": "I was trying to make an offer on some thing and for some reason it tried to bill me for the full amount. I’ll never go to the site again too confusing", "rating": 1}, {"title": "Seller couldn't find the earrings I…", "text": "Seller couldn't find the earrings I purchased.", "rating": 1}, {"title": "You can’t use anything but PayPal on…", "text": "You can’t use anything but PayPal on this site. PayPal sucks it doesn’t work most of the time so I guess I can’t purchase anything from this site", "rating": 1}, {"title": "Worst e-commerce site ever", "text": "Worst e-commerce site everEmails come as mime attachmentsNo appNot possible to click through to your order to correspond with other party on transaction", "rating": 1}, {"title": "I did not accept the counteroffer and…", "text": "I did not accept the counteroffer and was charged anyway the counter offered price for the item I was interested in.  Something is not working with system .", "rating": 1}, {"title": "Crazy complicated and hard -- simply to…", "text": "Crazy complicated and hard -- simply to make a $30 purchase. Never had these many complications and instructions. Good Grief. Cancel my order please.", "rating": 1}, {"title": "I put one item in the cart and you told me it is not available without giving any reason", "text": "Bad. Disappointed！", "rating": 1}, {"title": "Ruby Lane will not return calls or emails", "text": "The glass item arrived broken and we have tried many times to contact the seller with no response at all I would not buy anything from Ruby Lane", "rating": 1}, {"title": "frustration", "text": "Dificulty with search", "rating": 1}, {"title": "No reference numbers/codes for items so…", "text": "No reference numbers/codes for items so they are hard to find again/!@@@##$%%^^&&**(()())__+_++_))(*&^%%$$##@!!", "rating": 1}, {"title": "I asked for two questions to be…", "text": "I asked for two questions to be answered, and there was no response. Needless to say I didn't buy the product.", "rating": 1}, {"title": "It was tedious and I STILL haven’t…", "text": "It was tedious and I STILL haven’t figured out if I have the order and HOW TO PAY- I don’t use pay pal,I am totally confused", "rating": 1}, {"title": "First time purchasing and the seller is…", "text": "First time purchasing and the seller is already saying she had to refund me the piece is gone she sold elsewhere. Not ok", "rating": 1}, {"title": "I don’t know how long it’s going to…", "text": "I don’t know how long it’s going to take to get this because they have no information on it. I don’t trust it.", "rating": 1}, {"title": "Worst site EVER!!!", "text": "This is the most poorly structured and un-friendly site I have ever used!!! Communication between sellers and buyers is difficult. Buying is difficult! Customer service is non-existent!! The site posts a customer service phone number.  (that is no easy feat to find) and when you call it, you just get a recording. I will never use this site again!! I feel bad for all the sellers that want to sell their goods! They would be much better selling on eBay or Etsy than this crappy site!! Whoever owns this site, check out EBay’s site! They are successful for a reason! They have a great site, great customer service, easy communication between seller and buyer, etc. They have everything your site doesn’t. Here is the most constructive thing I can say for this company…GET A GREAT WEB DESIGNER TO DESIGN YOU A GOOD USER FRIENDLY SITE!!And for God’s sake, hire people to answer your phones and provide REAL customer service!!!You can take my advice and improve your company and increase your sales and customer satisfaction or just call me a complaining customer and remain a third rate site that continues to receive horrible ratings and one time customers. It’s your choice.", "rating": 1}, {"title": "Never received my order", "text": "Date of experience: January 22, 2023", "rating": 1}, {"title": "Order an item a week ago", "text": "Order an item a week ago  - had no contact from the seller at all, cost £80 and heard nothing about delivery.", "rating": 1}, {"title": "Sad day!", "text": "Disappointed! paid the ring but came out as mistaking inventory. and got refunded.. im afraid to purchased again.", "rating": 1}, {"title": "My item had damage not mentioned or…", "text": "My item had damage not mentioned or described in the description.    I feel my item mine fake not a real pearl", "rating": 1}, {"title": "I made a counter offer and instead they…", "text": "I made a counter offer and instead they charge the original price instead of denying the counter offer.", "rating": 1}, {"title": "Rubylane site is horrible", "text": "Rubylane site is horrible. It’s why I don’t like to shop on here because the site tries to make you pay more", "rating": 1}, {"title": "I did not make this purchase and I…", "text": "I did not make this purchase and I received an email stating that I “committed” to paying for the item.", "rating": 1}, {"title": "Instead of taking my counteroffer it", "text": "Instead of taking my counteroffer it billed me for the sellers offer that I DID NOT ACCEPT. SCAM!!!!!", "rating": 1}, {"title": "Omg NO DONT USE PAYPAL!", "text": "Omg. Pay pal is so violating. It asks for way too much information. Please stop doing PayPal", "rating": 1}, {"title": "Buyer Beware", "text": "Agree with another reviewer who said if the purchase does not match the sellers description there is no recourse with Ruby Lane if the seller is unreasonable or dishonest. Ruby Lane does not care about doing the right thing and Customer Support will not assist in any meaningful way. I purchased a watch from My Lowcountry Boutique described as being in EXCELLENT condition. I wore it a couple of times (literally once or twice) and then noticed the back had come off unbeknownst to me. I contacted the seller and described the issue and got what appeared to be a template response. I took the watch first to a local jeweler, then to a watch and clock specialist, who told me the watch could only be repaired by replacing the backing with a part of the same model. I reached back out to the shop for the model number but never received an acknowledgement or reply despite repeated attempts to contact them.I reached out to Customer Support who did nothing but what I had already tried, which was to send more emails to an unresponsive seller. An item is NOT in EXCELLENT condition if it cannot withstand even minimal wear. Neither the seller nor Ruby Lane was willing to stand behind the merchandise. I now have a watch that was clearly sold to me in POOR condition, that I can't wear, that I can't recoup my money for, or even attempt to fix since the seller can't be bothered to respond with a model number so I can try to find the needed part. I'm in the same camp as the reviewer who said they felt ripped off by Ruby Lane. I will never purchase from nor recommend this site again.", "rating": 1}, {"title": "I'VE NEVER BEEN SO FURIOUS", "text": "every step of this stupid web process is user UNFRIENDLY and a waste of my time. NEVER AGAIN.", "rating": 1}, {"title": "very bad", "text": "very bad. I haven't my purchase. I wrote a Camelot and I didnt answer", "rating": 1}, {"title": "FORCED TO USE PAYPAL...NO THANKS", "text": "When I use a credit card, I do not expect to be forced to use PayPal. NO THANK YOU.", "rating": 1}, {"title": "This is my first time ordering and I…", "text": "This is my first time ordering and I don't see any way to pay for my purchase!  Help!", "rating": 1}, {"title": "Ruby Lane Customer Service Fails Customers", "text": "I've had wonderful purchases from Ruby Lane over many years and have found by and large Shop owners to be helpful ,honest and caring of their Customers. But  a recent very bad experience merits comment. I made an expensive purchase from a Shop I had also worked with previously only last year and who offered Free Shipping, Insurance included. Layaway was offered and the Payment Invoices specified no shipping charge.Shipping was by UPS or Fedex. Since I was unfamiliar with UPS I asked for Fedex shipping. I opted to finalize earlier and then found I was charged for Shipping and despite the description of Luxury Box my   Jewelry Item was sent in a recycled box in bad condition and sent UPS . It was supposed to reach me quickly as the Service chosen was for Expedited Delivery. What ensued was a debacle of the Shipping Company and a prolonged email exchange with Ruby Lane Customer Service and the Shop Owner who then offered me a Shipping Refund and then Reneged. Ruby Lane's Customer Service assistant's stated position was that since the Shop's Terms of Sale were misleading namely Free Shipping I was entitled to the Shipping costs Refunded. I am still waiting for the Shipping Refund which was very expensive . Customer Service have since not replied to resolve the issue.", "rating": 1}, {"title": "The Crap is Too Expensive", "text": "The 'stuff' on your site is way too ridiculously expensive.It's that simple.", "rating": 1}, {"title": "BAD REVIEW MY GRACE ESTATE JEWELRY", "text": "My Grace - Estate Jewellery.I have been a member and have purchased on Ruby Lane for many years.  Never had a problem.UNTIL NOW.Had purchased an item from the above seller and it was  a great transaction. Thought so highly.The person Matthew from My Grace contacted me about two other items and said you should purchase them knowing I loved Victorian Jewellery.I said I couldn't afford it but he said ok to a layaway.After 6 weeks and making two payments total USD150  I contracted Covid 19 and I'm still very sick.I have not been able to work and as a single parent have had three children's birthday's over a two week period and was so overwhelmed with everything.I sent Matthew a message and said to my embarrassment I have to cancel the layaway which was not a problem.  I waited for my funds to be returned and when they were not I contacted Matthew requesting a refund.Matthew changed and tried to turn it around on me. He said I will not refund any of your money for the inconvenience caused and the way you went about it has taken me back. He called it all a sob story and had me in tears. I've never been made to feel so low as a person. He called me many disgusting names making me out to be a nothing for the rough patch of financial hardship. He said I was manipulative, a sob, and rude making up different excuses.This was said because I asked for a refund, and told him I was disappointed when he said no and the way he carried on I said true colours show. Well he kept my funds and it was a good learning curve for me.  Sad a person can put money before people.", "rating": 1}, {"title": "Absolute terrible website rap", "text": "Absolute terrible website, should be able to type in item number to find something.!", "rating": 1}, {"title": "Very disappointing", "text": "Very disappointing.  Seller refunded payment saying that he no longer had item.", "rating": 1}, {"title": "Not a good experience on Ruby Lane.", "text": "Not a good experience on Ruby Lane.Sellers do not respond and can be rude", "rating": 1}, {"title": "I made an offer which was…", "text": "I made an offer which was misinterpreted to the tune of $100. Not happy", "rating": 1}, {"title": "comment", "text": "Hopefully, the persons who are making the decisions here will read this review and have a change of heart. Ruby Lane has lost what made it a safe and fun selling venue. And it has started at the top and has attracted like employees and customer service types. They are not sorry and they are not helping. Whomever is running the site has removed themselves from the very people that make it a reality. People who cannot pay the bills anymore, because the unthinkable has happened. But THEY can pay their bills and so much more and that is all that matters. Yes Ruby Lane has gone the way of all industry. The lies were prodigious. Even knowing that everybody knew what was going on didn't deter them. Shame is gone. Initially I felt so betrayed. I sent many emails [ some not so nice ]. but now I'm just so sad. The relationships between the management and employees are so important and the onus of responsibility lies with the bosses as they have the least to lose. One would have hoped that a site that dealt mainly in the beautiful artifacts of the past would remain aloof from the vicious grasping of the mainstream, but no. Ruby Lane will be unrecognizable as it is already in many ways. The only people who will be able to sell here will be people who don't need to and it will change the whole place. Already I see friendly faces are disappearing, leaving an empty hole in the 'family' of dealers. There is time to admit to greed and deception and start over, but I am not overly optimistic.", "rating": 1}, {"title": "Not totally sure what happened but it did.", "text": "I have bought  hundreds of items off of Ruby Lane. I enjoy this site immensely . I  have only bought two things from this seller Susan.  One was about  2 years ago.  Loved it .  The second item purchased very recent.   She offers a return policy and I did  return it to her item after I contacted her and said nothing  bad about her vintage doll dress she  sold to me.  Having medical issues, extreme bad weather, cold snaps, snow storms,  over a foot of snow  blocking our long driveway. You get the picture.  I did get it to her late but did explain to her the  why. Its unfortunate I got blamed for things that I did not do. This seller blocked me now.?? Really  I did nothing more wrong then return item.  Her reply was I was mean to her I merely asked if she new how to file exempt tax, really that was it , have emails to prove that. She also accused me by name of emailing and emailing her and offering her 50% on her items. Not true  she must have me mixed up with someone else. There are no emails to substantiate that accusation .  I have bought from her 2 times only, would I have liked to  buy  more sure, but when I would see an item it was already pending.  I even said one day I will nab one of your dolls.  I never had? Two transactions (doll dresses) and I am blocked??  All that was not very nice that she blocked me over something that did not happen that I did not do? I sent the doll dress back so well she thought I didn't open it , I  actually tried it on a doll and apparently packed it up so well to get back to her.  I pay a price for something I did not do??", "rating": 1}, {"title": "The seller Luvmydiamonds was…rude. Threatening no refund if I contacted them again. Unprofessional and rude.", "text": "The seller Luvmydiamonds was unprofessional and extremely rude.", "rating": 1}, {"title": "The website crashed again and again very bad", "text": "The website crashed again and again bad bad experience", "rating": 1}, {"title": "Sellers respond very slowly", "text": "Date of experience: May 13, 2022", "rating": 1}, {"title": "Where is my traking number", "text": "Date of experience: September 27, 2021", "rating": 1}, {"title": "I have not yet received item", "text": "Date of experience: September 22, 2020", "rating": 1}, {"title": "Never received my item…", "text": "Date of experience: September 19, 2021", "rating": 1}, {"title": "very hard site  to  use", "text": "Date of experience: December 25, 2020", "rating": 1}, {"title": "To selective", "text": "To “chic’ bcbg", "rating": 1}, {"title": "When the 50% off sale started", "text": "When the 50% off sale started, the system crashed. That was very frustrating.", "rating": 1}, {"title": "I am still worried this is a scam…", "text": "I am still worried this is a scam website and may report it due to the lack of clarity and that I gave personal and credit card details before warned I merely had made a bid. Worried about fraud.", "rating": 1}, {"title": "CONFUSED", "text": "I AM NOT VERY COMPUTER LITERATE THUS I WAS CONFUSED WHILE TRYING TO PURCHASE THE PAPERWEIGHT FOR SALE ON YOUR SITE. however I AM ALSO STUBBORN AND I WANTED THAT PIECE. MY QUESTION IS -- WHY DOES ONE HAVE TO BE A BUSINESS PERSON IN ORDER TO PURCHASE AN ITEM OFFERED FOR SALE? I THOUGHT THE OBJECT OF YOUR SITE WAS TO SELL THINGS TO THE GENERAL PUBLIC. I DON'T HAVE A BUSINESS BUT HAD TO NAME ONE IN ORDER TO PURCHASE THE PAPERWEIGHT. I PROBABLY WILL NOT SHOP WITH YOU  AGAIN", "rating": 1}, {"title": "I spent a lot of time shopping for a…", "text": "I spent a lot of time shopping for a back cloth doll.  It was difficult making the purchase with pay pal which I have used ;many times before with success.  I followed your instructions and I was asked to do the same transaction over and over as pay pal was ;not accepting payment because I neglected to choose pay  pal which is not true.  I found the process frustrating and regretted the time I spent on the whole thing.Was the purchase completed?", "rating": 1}, {"title": "Ok A VERY UNHAPPY CUSTOMER  Jaclyn Hnat", "text": "Ok, I placed two offers with a seller for a doll being sold (nooshfairlovesdreamcorner) ,   and I just get home to see if my offer was accepted and I see instead that I have been BLOCKED from offers, questions, lol, and purchases. REALLY! I have never been treated so poorly by a seller and with no reason why. She says, \"ask questions\" before buying.  I guess I ask too many! . She has in quotes \"A PLACE WHERE ALL YOUR DOLL DREAMS COME TRUE\" Not for me. I have a great reputation with e-bay and etsy. She is way out of line. But, she is the owner and can do what she wants. I think if she is going to block a customer she needs to say why!  Anyways  thank you for listening and for your time. Have a blessed night.  Jackie (A very unhappy customer).", "rating": 1}, {"title": "Darla's fab finds", "text": "She sold  me earrings that had an obviously cracked stone.  Refused to refund my total return costs.", "rating": 1}, {"title": "In my last order I was charged sales…", "text": "In my last order I was charged sales tax even though the seller is not in my state.", "rating": 1}, {"title": "I had a real hard time trying to log…", "text": "I had a real hard time trying to log in. I just wanted to buy a necklace as it turned out the item i wanted was lost by the shop owner. So I basically wasted 2 hours of my time for nothing.i dont know if i will try again Ebay and Etsy are not as complicated.", "rating": 1}, {"title": "I made an offer on an item in good…", "text": "I made an offer on an item in good faith which was accepted by the seller, I  then  paid for the item with PayPal. I had a purchase order from Ruby Lane for the transaction and then received an e mail from the seller that the item was not available. The dealer was Konantiques of New Jersey.  I have purchased itemsfrom this site before  - I will not do so again. I have purchased items on Ebay for decades and have never had an experience like this.", "rating": 1}, {"title": "Both seller and Ruby Lane are to be…", "text": "Both seller and Ruby Lane are to be commended.  The seller was particularly obliging and helpful.", "rating": 1}, {"title": "I am very insulted by the treatment I…", "text": "I am very insulted by the treatment I received.   I attempted to purchase an item and Paypal took my payment and then the vendor indicated they had not received anything from Paypal.   I got online with Paypal and they said the email of the vendor was not registered with PayPal.   I was given a refund (I hope) and intended to still attempt to buy the necklace, but was blocked by the Vendor as though I was some kind of con artist.   Very insulting and I do not know if I want to come back on your site in the future.", "rating": 1}, {"title": "What happened to Ruby Lane?", "text": "What happened to Ruby Lane?? It Used to have a lot of quality stuff now it's just yard sale stuff you can find on Ebay for half the price.  There are a few good sellers still on there, but their prices have gone through the roof to keep up with RL's high fees. One seller I know told me the fees are the highest in the online selling business and she would be leaving soon.  Sad.", "rating": 1}, {"title": "I did not purchase any item", "text": "I did not purchase any item. FRAUD>", "rating": 1}, {"title": "Not user friendly, poorly designed software.", "text": "RubyLane is the most clumsy and cumbersome site on which to place an order and make an offer. Currently, a seller and I have already agreed upon a price for an item via email message, but since I \"used up\" my two offers, the last offer cannot be modified. Continually, RubyLane does not have a live chat feature like some of their competitors, so you have to email and wait for a response to remedy your issue. They're literally killing their seller's deal and forcing us to go elsewhere to complete the transaction.", "rating": 1}, {"title": "Cant use Internet Explorer", "text": "Cant use Internet Explorer . Only site I have problem with . Many other issues.", "rating": 1}, {"title": "I would not recommend this site to…", "text": "I would not recommend this site to anyone. After my purchase and payment of item, I received an email from the seller that the amount listed was the wrong price and that it was $25 more. That is not the way to do business and I will not buy from Something Wonderful or any other vendor thru Ruby Lane again.", "rating": 1}, {"title": "Rude seller", "text": "Rude seller. Very poor communication, no customer service. She should not be working with the public.", "rating": 1}, {"title": "My package never arrived to my house, and RL was zero help.", "text": "My package never arrived to my house. The priority mail tracking service said it was delivered, but I never saw it. I sent a polite email inquiring what next steps I should take because the package never arrived. The reply I received was terse and shifted all of the blame/responsibility to me and completely absolved themselves. \"I’m afraid that after delivery is made, and the Post Office has electronically scanned it in at delivery, that there is nothing else that I, the sender, can do, once this is completed. Hopefully you will find that it was brought in with other mail by someone else in the household - this has almost always turned out to be the case in over 20 years of buyers reporting missing packages to me. Twice, it was misdelivered to a neighbor and was quickly retrieved by the carrier once the post office ws contcated.\"Well, after I DID contact the post office, it turned out that the SENDER MISADDRESSED my shipping label and actually sent it to a different house about 7 blocks away. Pity that they can't take responsibility to double check for their own error before walking away from a customer's issue. Shoddy. Just shoddy.", "rating": 1}, {"title": "Your website is not user-friendly . Help!", "text": "Your website is not user-friendly. Tried to make a purchase and it wouldn’t allow it. Says I made a purchase but I didn’t even put in my payment. I’m stuck in the middle of an order and can’t figure out what to do. Definitely not user-friendly!", "rating": 1}, {"title": "I ordered two items from same seller…", "text": "I ordered two items from same seller but was disappointed when I was informed that they had already been sold. I then tried to request a refund from the site but didn’t see a way to do that. I then contacted the seller and requested the refund. It was processed but it was all a waste of my time not to mention my excitement in not receiving items.", "rating": 1}, {"title": "This has to be the worst site ever to…", "text": "This has to be the worst site ever to purchase anything from. can't even make up an account the first time have to go back and make a second account under a different name in a different email address and at the very end of it all you still end up paying with PayPal. Could have just paid with PayPal without making an account.", "rating": 1}, {"title": "Worst experience ever", "text": "Date of experience: April 14, 2020", "rating": 1}, {"title": "Bait and switch?", "text": "I tried to buy a vintage hat, but after I put in all my personal information, the site said the hat was no longer for sale.", "rating": 1}, {"title": "One item I dont know if i purchased it…", "text": "One item I dont know if i purchased it or not and the other could not ship to my address.     All in all a waste of time.", "rating": 1}, {"title": "I can't tell if I have paid or not", "text": "I can't tell if I have paid or not.  Each time I buy on RL it seems to change and is difficult to know what's going on. I entered my credit card number and then it asked me for it again. Says cannot use my cc with PayPal, however that is the correct number & even showed the last 4 digits correct. Just so confusing.", "rating": 1}, {"title": "For over a year it has been an absolute…", "text": "For over a year it has been an absolute nightmare to pay for my purchase. It has become impossible to bring up pay pal as it keeps saying there is no transaction for this item. I have been able to eventually accomplish the payment through my phone. Last night I attempted to make a purchase from The Wright Glitz and once again I cannot get it paid for. I thought it went through but Mr. James Wright said he did not get my pay pal payment. Lest you think it is a problem with pay pal I assure you Ruby Lane is the ONLY site this happens on. What has been changed to create this horrible problem? I will never make another purchase on RL again. I always pay for my online purchases immediately and to go through this nightmare is not worth the stress.Very Respectfully, Elizabeth Silta", "rating": 1}, {"title": "Horrible website", "text": "Horrible website, extremely un user friendly. I’ll never come back and will tell other not to as well.", "rating": 1}, {"title": "Very confusing way to pay with Paypal", "text": "Date of experience: March 12, 2020", "rating": 1}, {"title": "The sellers have been consistently…", "text": "The sellers have been consistently wonderful. However, about October 2019 I noticed a dramatic change in the type, variety and quantity of listings. This has limited my choices and sadly lost my full attention. I actually googled “what has happened to rubylane”.  That’s when I found out it was about money, as usual.....I have been a daily user of rubylane since 2016......my disappointment has left me looking for other vintage and antique jewelry sites.  You guys messed up imo", "rating": 1}, {"title": "Extremely Poor/NO Customer Service", "text": "Extremely poor customer service, meaning NONE. Only talk and no wolk!The customer is exposed to all the crooks out there on their site, to be taken advantage off.It is full of Chinese products sold as \"antiques', and like that it is not bad enough, one makes a purchase, and never receives the goods.I Do Not Recommend this platform! It is Hugely Unprofessional!", "rating": 1}, {"title": "Extra Extra!", "text": "Extra Extra!!  --- more devious trade by Rubylane.Sellers are well content with not having their buyers pay a 2.75% buyer's commission. Instead, this 2.75% commission has been passed on to the sellers making the total seller's commission 6.5% on a Rubylane sale. To compensate for this 6.75% seller's loss, seller's just raise their item prices by this amount or even more, so in effect, buyer's are no better off and are totally unaware. The whole process fortifies further devious trading that goes on behind the scenes.I will continue to keep prospective buyers and sellers informed what goes on behind the scenes as Rubylane will not give this information out themselves.", "rating": 1}, {"title": "Would Have Preferred a Receipt Showing the Actual Dollar Amount I Paid", "text": "I find disquieting the lack of itemized information regarding currency conversion fees on Rubylane receipts for purchases from overseas vendors.......... I bought something listed by a vendor from the U.K. in British Pounds. The Rubylane receipt emailed to me was in British Pounds (GBP).......... I was actually charged appreciably more than the U.S. Dollar equivalent and simply have to *guess* that the extra charge was added \"magically\" by PayPal. I realize that this is mostly a PayPal issue.......... However, I would have preferred to have received a receipt showing the actual USD amount I paid, the exchange rate on the transaction date, and how much I paid to PayPal for the currency conversion.......... You *know* a bank would never settle for the kind of receipt I got from Rubylane.", "rating": 1}, {"title": "I tried opening a store on Ruby Lane to…", "text": "I tried opening a store on Ruby Lane to sell some antiques. They pointed out some issues with my listing which needed to be fixed. I was appreciative of the recommendation and happy to improve the listings but the shop was deleted and I am not allowed to try again for another 60 days.", "rating": 1}, {"title": "Scam", "text": "After sending money to him, I didn't get an answer.  When I asked him to send my money back, he didn't send me all the money.  Only when I asked him again did I get my money back.  And now, a month later, he wants me to send him money.  It's really fun to do business with such people", "rating": 1}, {"title": "Dishonest & Unethical", "text": "Was extremely disappointed in my purchase from Rudy Lane.I ordered a Monies Horn Leather Necklace from one of theirCo assignments which was Estate Beads in Texas. The owner is Allison Dow who wrote on their website through Ruby Lane that the necklace was in excellent condition. The necklace arrived with three chips on it. I immediately returned it. She refuses to answer my emails.  Besides the coffee st of $137.31, it cost me an additional $11.25 to send it back to her. I can’t believe the dishonest and unethical way she runs her business, and Rudy Lane endorses it.", "rating": 1}, {"title": "Ruby Lane processed an order that l…", "text": "Ruby Lane processed an order that l didn’t make. I placed a second counter-offer, and they tagged the item as “sold” at very near the original, OVERPRICED, asking price!! Be careful, if you are a buyer!", "rating": 1}, {"title": "I was sending a counter offer for an…", "text": "I was sending a counter offer for an item, when suddenly I got an acceptance from the seller for an amount $200 higher than an offer I was trying to make as my 2nd offer.  I have written to the company and the seller and am now waiting to hear back.", "rating": 1}, {"title": "Disppointed at accuracy of description and offers of return", "text": "I unfortunately have to report my purchase was very  disappointing.  She has been throughout this ordeal very untrustworthy and I feel deceitful.  August 24, 2019, I selected a Jumeau doll to my Xmas present.  I did not look at her when she arrived, waiting for the holidays to open it.  I didn't give it a thought that she would be anything more than perfect. However, she was advertised as a 22\" doll and no mention of any flaws. But she was only 19inches and has a flaw underneath her eyebrow and several spots on her cheek all of which were not visible. After looking at the doll, I contactedKathy explaining the situation. On Jan 3, 2020, she emailed me with her offering to repay all shipping to us and return shipping of the doll and the offer to give a 10% discount on my next purchase. After several she made another offer to take $200 off of the purchase price.  I didn't want a Jumeau doll with flaws nor one that was 19\"tall.  I had looked at her offer of selecting another doll with a 10% discount among her 500 dolls. Thereafter there were several emails   and I have  copies of after Jan 3,2020.  These changed her offerings from now to the $200 refund, now to a 10% discount of any doll similar in price to the original doll.  I found another doll,which is  referenced above referring to her offer of Jan 3. but I received received no reply other than send the doll back and you will get a refund.  Because I fell in love in love with the new doll, I accepted her offer of $4,414. I feel that she was acting as a professional person, offering one thing on Jan. 3 2020, and not honoring that proposition, constantly changing her position, and not backing up her statement.  I feel that this is not professional. and am requesting 10% off the price of the new doll which is $414.00. In addition, she offered to repay return shipping which was $42 I have a copy of that also.  I am more than disgusted with her professionalism and manner in which she responds to issues but now the doll I original bought is back on ebay with the exact description of 22\"Jumeau with no mention of flaws. Some buyer is going to open the box and see a 19\" doll with flaws  instead of the one described with Kathy Libraty.  I understand NOW what her return policy is and unfortunately did not read it, only thinking that my husband will \"hide it for Christmas\".  Maybe that is childish but I never thought I needed to open the box to verify its description. Also, when a professional makes an offer and later does not stand by that offer is beyond unprofessional.  I feel that demonstrates no integrity.  Thank you for your time. The RLI 3260 of the first purchase", "rating": 1}, {"title": "A VERY PLAUSIBLE MISSLEADING DEALER BEWARE BEWARE…", "text": "rubylane ( wayne bock ) easy to deal with ameanable flexible polite courteous, i would gladly deal with wayne through rubylane casleford antiquesif and when the opportunity arise', duke  peter high-smith u.k. england       I RETRACT THE ABOVE THIS MAN WAYNE BOCK TRADING   AS CASTLEFIELD ANTIQUES  UNDER THE COVER OF RUBYLANE  HAS DISHONOURED THE ARRANGEMENT TO SELL ME A BRONZE ORNAMENT AFTER SENDING ME (20 ) E MAILS TELLING ME I HAD BEEN SUCCESFULL IN BUYING", "rating": 1}, {"title": "What have you done to the antique…", "text": "What have you done to the antique shop????  Basically, the quality of dealers have dropped to sub-level!!!!My purchasing on RL will be less!!!!", "rating": 1}, {"title": "It was next to impossible to register…", "text": "It was next to impossible to register as a new customer. Needs to be easier if you wish to obtain new clients. Absolutely, not user friendly.", "rating": 1}, {"title": "Rubylane does not stand by quality or authenticity of goods sold on the site.", "text": "I ordered a piece of jewelry of approximately $7000. They gave a three day return window. However, that is very short window and when we had a jeweler look at the piece several days later they said that it was not a quality piece and said that the jeweler would have been well of this when they sold it. We we were not aware of this issue, not told despite asking questions about the piece, etc. We contacted the seller less than 14 days later and asked if we could have a refund, minus whatever restocking fee they deemed appropriate for having it off the market for those two weeks. They refused to stand by their goods and wouldn't accept the return even with a restock fee. When I contacted Rubylane they did NOTHING. They simply told us to contact the seller. Ebay is a far better platform. At least they have a guarantee policy covering the quality of their goods. This looks like a professional site but it is just a portal. Do NOT order anything of significant value from this site, you may be sorry.", "rating": 1}, {"title": "I am having a bad experience from my…", "text": "I am having a bad experience from my purchase on Ruby Lane. This is my first and will be my LAST purchase.", "rating": 1}, {"title": "Outrageously expensive", "text": "With the taxes, shipping, and fees this was my first & LAST purchase..", "rating": 1}, {"title": "Your new charges make Ruby Lane a very undesirable shopping location.", "text": "Your new charges just to purchase something on the site has significantly reduced my purchases and annoys the crap out of me because it’s unreasonable. If it wasn’t for the vendors I enjoy working with I would never shop on Ruby lane again.  Enjoy your profits.", "rating": 1}, {"title": "Rubylane have become a super greedy…", "text": "Rubylane have become a super greedy organisation. Huge new fees have been imposed on buyers and sellers and if you are a US citizen, you get landed with state tax too, lovely jubbly!!The bit i like best is what they charge to Buyers - it is called a 2.9% 'Buyer's service charge'. Devious trading, they should call this 'Rubylane Service Charge' because this money goes to Rubylane. They are making believe that the seller is imposing this charge, but Rubylane are imposing this charge. They must think that we were all born yesterday.All done sneekily, 'purchase orders' for buyers are super escalated with state tax and Rubylane commission, hoping that they will not notice and just pay quietly. Many do and i feel sorry for them.A commission of 3.75% falls due for sellers shortly on the 1st January 2020. More lovely jubbly dosh for Rubylane. There excuse for the new high commission rates is that ''We have to pay the State Tax to the US Government and this is labour intensive''. Oh yes, pull the other one, it's got bells on!!Another funny feature is that Sellers on the site have NOW become ''collectors'', collecting the  commission and tax charges which they surrender at the end of the month to Rubylane. It made me feel like a slave. I use the word 'slave', as sellers have no choice. Either that or quit the site.Many sellers on the site appear to being dealing away from Rubylane to avoid the charges, just using the site as a shopping window and then going for the kill behind the back door. Who can blame them?A final word on the 'Helpline'-- can you get to speak to someone to help you now?, no, of course you can't. So to summarize, lots more commission and less service, great for Rubylane but awful for buyers and sellers. I have now left Rubylane as i don't want to be a small cog in a greedy machine. Rubylane uphold a sneeky devious business and i hope that they sink through greediness.", "rating": 1}, {"title": "Superb service", "text": "Superb service, everything exactly as described, phenomenal selection.", "rating": 1}, {"title": "I have tried for 2 days to order…", "text": "I have tried for 2 days to order earrings.  It finally took my order and then I couldn't pay with credit card.  So I am supposed to send a check which means I will not get earrings by Christmas!!  Poor way for business!", "rating": 1}, {"title": "working of website", "text": "Issue with checking in and out. Not being able to get help , very dissatisfied with website. Checked out one item at a time.Didn't show all that was in my cart. I had 4 items left in my cart. Still there.", "rating": 1}, {"title": "Placed an order 4 days ago. No idea what’s going on.", "text": "Placed an order 4 days ago. Got the confirmation email stating someone would contact me more information including shipping. I’ve heard nothing! Can’t get a response. This is why I am Leary of ordering anything online.", "rating": 1}, {"title": "New fees to both sellers and BUYERS…", "text": "New fees to both sellers and BUYERS make having a site and shopping there unsustainable.  The worst part? They don't process the payments for the merchants, they just collect sales tax, which means if a buyer pays by PayPal and wants a refund PP will take the RL fee charged to buyer out of the seller's pocket. Which means RL pockets the fee to pay an expensive accounting firm to determine that, in fact, NO the seller doesn't owe sales tax to the state because they don't meet the threshold as determined in South Dakota v. Wayfair! What happens then?  Is the seller refunded the sales tax?  NO, it goes into RL's pocket, which is probably illegal.Update: Ah, a response, delivered with first a non-sequitur, then the classic RL opacity and condescension.Not sure why flexibility is invoked since there isn’t any at RL, it’s irrelevant, so moving on: RL has not been transparent about the additional fees nor the issue of “marketplace facilitators”. It’s debatable whether RL would actually qualify since they don’t process payments.  So they have aggregated their customers, regardless of whether those customers would owe tax as independent vendors.  Congrats Euro and Oz sellers! If you ever wanted to be American you now are as far paying taxes is concerned. Oh, and if it’s not possible to create a payment platform, then how is one refunded?  Through “store credit” apparently applied to your RL account.  Which means, yes, RL pockets the $.They claim the fee is being used toward their tax compliance and audit costs.  A back of the envelope calculation indicates annual revenue of $3.5M to $4M or so.  Based on my sales alone, multiplied by the number of shops and the % now coming in new fees indicates additional revenue of close to $6M, or $9M per yr. Holy cow! That's one expensive accountant. And, would that we could all triple our revenue with no additional value added. If it’s not illegal, it’s sure unethical.", "rating": 1}, {"title": "I am still trying to close my purchase", "text": "I am still trying to close my purchase.  Your software kept me from doing so.  I had cleared PayPal but couldn’t get the program to use the counter offered price.  I’m still in limbo and am surprised at receiving this email from you.", "rating": 1}, {"title": "Bought a pair of earrings", "text": "Bought a pair of earrings. Never received them due to the item already being sold even though on the site it said they were still available. Very disappointed. I really really loved the earrings. Site claimed they refunded me but i am not really sure how and when that occurred. Waiting on a response to find the answers to these questions. So far i have not been refunded to my knowledge. Laurie Ann Hover", "rating": 1}, {"title": "TERRIBLE WAY TO DO PAYMENT SUPER…", "text": "TERRIBLE WAY TO DO PAYMENT SUPER ANNOYING", "rating": 1}, {"title": "ambiguous fees without logical…", "text": "ambiguous fees without logical explanation of almost 30 extra dollars seem like a rip off to me. Hence i will NOT be completing my purchase. We call that RIP OFF!!!!", "rating": 1}, {"title": "Ruby Lane added a new buyers fee of…", "text": "Ruby Lane added a new buyers fee of 2.95% - yes - for buyers! In addition to the fees they collect from sellers. Pure greed. In addition they are charging sales tax on every order which is not federally required unless the purchase is made by a buyer in the same state as the seller.", "rating": 1}, {"title": "I have purchased a number of antique…", "text": "I have purchased a number of antique pieces of jewelry from Ruby Lane, but after attempting buy a pair of earring today I now see that you are charging fees and taxes and on the piece I was going to buy it would have been 33.00 something.  I do not intend to buy this or anything else from you in the future, it is a shame because I have enjoyed the merchandise and the vendors.", "rating": 1}, {"title": "Unfair & unethical new Ruby Lane regulation", "text": "I am buying on Ruby Lane for years. I usually buy jewelries. Most jewelry shop owners there know me. Most of them are very good and honest people. I like them a lot. I consider some of them as friends without never meeting them.But now, with that new regulation about \"fees & taxes\" they are forcing on buyers, Ruby Lane becomes very greedy, unethical, and unfair. I feel very sorry for the sellers on Ruby Lane. Some of them will probably close their shop because customers are not going to put up with that craziness of ruby lane.", "rating": 1}, {"title": "I have loved Ruby Lane for years now…", "text": "I have loved Ruby Lane for years now and have always been very happy with my purchases.  I now see that vendors are charging not only shipping (which is fine) but also a  large \"fee\" attached, plus sales tax.  I cannot continue to purchase from this website with a hefty service charge added to everything else.  It makes me so sad, but I will no longer be shopping on Ruby Lane.  Such a pity.", "rating": 1}, {"title": "Ruby Lane management needs to look…", "text": "Ruby Lane management needs to look again very carefully at its new and controversial policy of charging buyers a \"fee\" to use its site. Imagine paying a fee to buy from a department store or the supermarket? What next!This has been introduced without warning and at an expensive time of year. Furthermore it is not being shown in a way that is transparent to buyers.As this fee is being added on after state sales tax and shipping it is inflating the cost of purchases to the extent that (in some cases) fees and taxes often equal or exceed the price of the item. Why are buyers paying a % based on taxes and shipping in addition to the price of the item/s? Ruby Lane does not pack and ship the item - the seller does.This tactic means that some buyers are paying out a large sum of DEAD money for which they receive nothing in return.Ruby Lane say that their expenses may have risen as a result of employing a high priced agency to handle their state sales tax obligations. They say that the cost of advertising has increased. These are \"business related\" expenses. As such they surely qualifiy to be offset against profits as a  tax deductable and not imposed upon buyers. Look at the effect this is having upon your reviews Ruby Lane. This can only result in loss of business from what was, in the past, a good site to buy and sell from.", "rating": 1}, {"title": "It’s too difficult to spend money and get what you want on Ruby Lane!!", "text": "I wrote an “ok” review of this site.  Boy was I wrong.  That was merely a first impression!!  Now that I have TRIED to order and gotten messages like “access denied” and “this item is no longer for sale.”  No kidding, Ruby Lane, it’s sitting in my shopping cart and your poor connection with PayPal is not working.  I actually looked up the vendors of the things that I really, really wanted and bought them directly from the dealers.  Sorry, Ruby Lane, if you cannot or will not take my money, your vendors certainly will!!!   Get it together, Ruby Lane!!!!!", "rating": 1}, {"title": "I wish I could give a zero because I…", "text": "I wish I could give a zero because I think the suits at Ruby Lane have completely lost their minds. I just learned last night that they are not only charging state tax but also a service fee. Are they on crack? They intend to charge a buyer for buying from their site? I have never heard of such nonsense. We collect antique bisque dolls and have been a member of Ruby for years. I had a number of items on my wish list with intentions of purchasing some of these items later this year. Last night I went in to my list to check on the shipping cost and found the shipping on one doll to be $105.00 (which I understand) but there was also a service fee of $108.00!!! And state tax of $255.00. So this would cost me $468.00 in shipping and fees. The doll was being shipped from IN to MD. All within the US. NO WAY. This is nothing but pure greed on Ruby Lanes part and I will not feed into it. I have removed everything from my wish list and as soon as I pay off two layaway's next month I'm closing my Ruby Lane account.  I have 2 friends that shut their account down last night and 3 more will do so within the next month. If the executive's at Ruby intended to hang themselves they have succeeded.", "rating": 1}, {"title": "I have been a Ruby Lane user for a few…", "text": "I have been a Ruby Lane user for a few years.The recent implementation of high fees, service charges and taxes is absolutely obscene.I will be very unlikely to make any future purchases unless this price gouging scheme is revoked.", "rating": 1}, {"title": "Waste time", "text": "Went to buy some cloth dolls. When I went to check out the shipping was only three dollars less than the dolls. My second item was for 35 dollars, after all the sellers cost it would be 85 dollars.  I did not buy that one either The third one said 50 dollars but apairitly it  was not in US dollars. Not willing to waste time on your site if that's my experience.", "rating": 1}, {"title": "I have been visiting Ruby Lane on…", "text": "I have been visiting Ruby Lane on average once daily for several years.  During that time, all of the shop owners with whom I've interacted have been absolutely wonderful.  However RL has now imposed an automatic service fee for each purchase that appears to be based on at least the purchase price, plus automatically adding sales tax instead of allowing the shop owner decide whether it needs to be charged.  This is totally unacceptable.  I most likely will not be buying anything through RL from here on in as long as this remains the policy.", "rating": 1}, {"title": "I've just read about the buyer's fees…", "text": "I've just read about the buyer's fees which will be introduced on Ruby Lane. I cannot see whether it will apply to buyers from overseas but if it does it will put an end to my purchases. US Postal charges are horrendous and adding another fee (will it be levied on cost of item + cost of postage?) will make items unaffordable for me and for many others I imagine. Sad, as it's a great site.", "rating": 1}, {"title": "I do not like the fact I have to…", "text": "I do not like the fact I have to purchase before seeing all applicable fees and total...janet despic", "rating": 1}, {"title": "Buyers service fee - Bad Idea!", "text": "I loved Ruby Lane until they recently instituted a nearly 3% buyer service fee on top of the item, shipping, and sales tax. I can't think of any other online shopping venue that charges a fee to purchase. They haven't announced the fee to buyers and hide it within \"taxes & fees\" in your shopping cart. In Paypal, it's listed as \"sales tax\". If they're going to try this sketchy way to pad their profits, they should be upfront about it. Very deceptive and unethical.If shoppers don't fight this, other venues may soon start imposing fees on buyers. How can we fight it when most shoppers will never realize there is such a thing as a separate buyers fee? Is this even legal?", "rating": 1}, {"title": "I have had so many problems paying for…", "text": "I have had so many problems paying for an item. There is no customer service number either.The seller is amazing however!", "rating": 1}, {"title": "Charging a fee to collect state tax is…", "text": "Charging a fee to collect state tax is not cool. This used to be a site I often recommended. Now I will let people know exactly what is up.", "rating": 1}, {"title": "It's impossible to contact a human…", "text": "It's impossible to contact a human being and there is no customer service.", "rating": 1}, {"title": "Service fee", "text": "Service fee, not using combined shipping, insurance fee.  Ridiculous.  Doubled the cost of my 12 ounces of items.  I cancelled order!", "rating": 1}, {"title": "Why can’t I just pay with my credit…", "text": "Why can’t I just pay with my credit card like everyplace else?  I couldn’t complete the transaction.", "rating": 1}, {"title": "Asked question about purchase and…", "text": "Asked question about purchase and shippng, was reassured it was all ok, then a refund was given, with no explanation...had to ask before explanation was given, leaving me in a serious bind, which could've all been avoided with communication...", "rating": 1}, {"title": "Very Disappointed!", "text": "This site has several items i was interested in purchasing, however, after struggling for over an hour to find a way to order more than 1 item at a time, and unable to find a contact number for help, i will not be doing business with them again.", "rating": 1}, {"title": "Framed vintage original hand tinted…", "text": "Framed vintage original hand tinted photograph of a Bedlington Terrier advertised in Florida for approximately $35. I live in the UK. The \"photo\" including shipping and import tax eventually cost $80.On arrival the \"photograph\" turned out to be a poor quality colour print probably cut out of a 1960's magazine and mounted in a very cheap and basic frame from the same period. I paid all of this money  for worthless trash. What a sucker I I am.", "rating": 1}, {"title": "I never made a purchase on Ruby Lane…", "text": "I never made a purchase on Ruby Lane although it thinks I did? All I did was go back and forth with a shop on an item inwhich I never bought the item.", "rating": 1}, {"title": "Mercy, Maude! shop is horrible!!", "text": "I had a very bad experience with a woman named Courtney from a shop called Mercy, Maude!  She was very abusive to me.", "rating": 1}, {"title": "WOW....as in wow I’m pretty disappointed.", "text": "Zero response to messages sent to shop owner asking when will my order be shipped. The only saving grace about this bad experience is that I paid via PayPal. Will now be opening a PayPal “item not received” dispute to get my money back.Obviously communication isn’t this sellers strong suit. I’m speechless.", "rating": 1}, {"title": "I have completed the payment form three…", "text": "I have completed the payment form three times and it does not process.  Please cancel my order.", "rating": 1}, {"title": "the sight is so confusing that i can't…", "text": "the sight is so confusing that i can't make payment.I am refusing to try any more and you can cancel my order.i was also told by \"takeastand\" that i would get a 20% discount on one item.This did not happen", "rating": 1}, {"title": "I cannot pay thru my PayPal", "text": "I cannot pay thru my PayPal. Don't know why", "rating": 1}, {"title": "BUYER BEWARE", "text": "BUYER BEWAREBrooke Hunter McPherson sells FAKE merchandise. She will claim it is GIA certified, have it valued by theRealReal, post it on Ruby Lane as an jeweler piece and then BOOM, when you have to take piece to the jeweler you find out that the Topaz and diamond piece you bought is really chipped CZ’s. Run as fast as you can to the jeweler and authenticate anything you have ever bought from her or you might get a BIG surprise. This is not a joke!!!She ruined my 35th wedding anniversary gift by selling us a fake ring. Shame on you Brooke!", "rating": 1}, {"title": "Butter mold", "text": "I asked if the butter mold would be large enough for my butter dish. I never got a confirmation as to how big it was.I bought it anyway and it is in great shape but only makes ONE pat of butter. Next time please specify the size.Ended up buying a miniature butter dish so I could actually use the product.", "rating": 1}, {"title": "BUYER BEWARE!!", "text": "BUYER BEWAREBrooke Hunter McPherson sells FAKE merchandise. She will claim it is GIA certified, have it valued by theRealReal, post it on Ruby Lane as an jeweler piece and then BOOM, when you have to take jeweler to the jeweler you fund out that the Topaz and diamond piece you bought is really jeweler CZ’s. Run as fast as you can to the jeweler and authenticate anything you have ever bought from her or you might get a BIG surprise. This is not a joke!!!", "rating": 1}, {"title": "Do Not Buy from Here", "text": "Do not buy from this site!!! I have purchased many pieces from this site, however, the most recent and most expensive was for a topaz and diamond ring. The diamonds were fake. Since this was past the 3 day return policy, Ruby Lane did nothing to fix this issue. The store owner was extremely rude and unprofessional. She screamed in all capital letters and refused to respond because I actually brought a real defense to her fraudulent case. If you fall in love with a piece, please make sure you will be in town upon its arrival, and be able to take it to a local jeweler to ensure its authenticity. This is the standard Ruby Lane has made clear through this experience that they uphold to the utmost. This is the only way Ruby Lane will process a return, despite the fact the seller sold a fake item to you. Buying this ring and going through Ruby Lane has been a horrible experience for me and I would not advise it for anyone else... just go to a designer/brand option, they will deliver authenticity and value for your purchase.", "rating": 1}, {"title": "The process for purchase and bidding…", "text": "David Newman one of the vendors countered our offer a second time we accepted and then never in four days responded. After reaching out to Ruby Lane he tells us he sold it to someone else! This site and its vendor scammed us caution to everyone!", "rating": 1}, {"title": "No communication from seller after…", "text": "No communication from seller after pmnt. Got invoice, pd within 24 hrs, then got email saying transaction was clxd. Responded to invoice email, and still no communication.  I paid in full thru PP, and no refund on \"cancelled\" transaction.  Never again will I purchase from RubyLane.  Never.", "rating": 1}, {"title": "Very difficult to delete an unwanted…", "text": "Very difficult to delete an unwanted item in shopping cart at checkout.  No customer service phone number or chat desk.", "rating": 1}, {"title": "Can’t trust all sellers are legitimate...", "text": "Can’t really trust that items on this are actually and legitimately available for sale. In reviewing one on your seller’s inventory, I noticed an item that was listed for sale, was actually sold by that seller roughly 4 months ago. Seems pretty deceitful or at minimum dishonest,", "rating": 1}, {"title": "The diamond engagement ring I purchased…", "text": "The diamond engagement ring I purchased was very expensive and the diamonds kept falling out. It was poor quality. So far I’ve had to have it repaired 3 separate times and I don’t really know what to do now. I feel like I fell in a trap. I will never buy anything from this site again.", "rating": 1}, {"title": "Communication was great", "text": "Communication was great. Item as described. Will definitely shop here again.", "rating": 1}, {"title": "Hate Ruby Lane because of the payment…", "text": "Hate Ruby Lane because of the payment system.  I just spend 45 minutes trying to pay for a couple of orders.  Cannot figure out hw to pay....so hardy check Ruby Lane because of their payment system,", "rating": 1}, {"title": "I could not believe my eyes when I saw what customer support had to say in response to my question.", "text": "I could not believe my eyes when I saw this response from customer support. In my mind this suggest that Ruby Lane does not care about its customer. Take it or leave it attitude is indicative of poor attitude and lack of respect to the customer. Read this message I received from customer support this morning and you be the judge.We have given you all the information you need to accept the special favor of offering to close your shop for a month, to try to help you because you said you were short of funds to pay your fees. This is not a service we provide to all shops and that is why there is not a specific function for it. We regret that you feel you need to criticize our service when we are doing this for you. Please note that we reserve the right to withdraw the offer.We provide Customer Support from Monday to Saturday across variable hours depending on the timezones in which Customer Support Staff are located. Generally, support is available for at least 8 hours each day, more often 10 or 12. We don't provide support on Sundays because we would have to increase our staff and, therefore, our fees to do so. We do not provide telephone support for the same reason. We try to respond to all emails within one working day.Please let this be enough on this subject. If you don't like the way we conduct our business, there is an obvious option available to you. Kind regards,SimonRuby Lane Customer Support", "rating": 1}, {"title": "Incomplete Listing, Distressing Checkout and Purchase", "text": "I could not see the shipping charges calculator while properly logged in. I consider the listing to be incomplete without shipping. The seller was nice enough to check and get quotes for me.  I tried to pay directly through my Paypal account balance and it seemed that the Ruby Lane program was only accepting a Paypal credit card. I believe I eventually paid for this item, but received a notification that this is a purchase order invoice, and not to forget to submit my payment. My purchase is listed as pending and not sold, so I am not sure if I actually bought the $600+ item. The entire process of using Ruby Lane was very upsetting, indirect and not intuitive. The seller was very kind, but I most likely will not use Ruby Lane again.", "rating": 1}, {"title": "I am not real happy with your new…", "text": "I am not real happy with your new format.....was there a reason to change?  Gail", "rating": 1}, {"title": "the process for payment was not user…", "text": "the process for payment was not user friendly and when i emailed the seller to see if the payment went through, she was a bit rude. I was having a hard time figuring it out and she acted like I was trying to cheat her. I was just trying to pay! won't buy from her again", "rating": 1}, {"title": "I have no idea if my second offer was…", "text": "I have no idea if my second offer was accepted or not", "rating": 1}, {"title": "The elephant in the room with RubyLane…", "text": "The elephant in the room with RubyLane is lousy photographs. For high quality crystal (I buy Lalique) the white background is a deal killer. The photos just look pathetic.In the day of high resolution photos on the web, any online marketing venue should strive to have IMAX quality photos. Ruby Lane just doesn't get it.", "rating": 1}, {"title": "Product NOT Available AFTER Purchase", "text": "Dear Ruby Lane:I was extremely happy to have found the set I've been searching for a while and found it through your page.  I immediately  placed an order yesterday Sunday June 16, 2019. For the following item:RS Prussia tea set | RS Prussia 17 Piece Tea Set: $150 USDFrom: Penn Floral & AntiquesSusan RafachBennet street Luzerne PA 18709(570) 821-1770My payment for this purchase was made with my Visa Card. Later on that evening  Sun, Jun 16, 2019 at 6:46 PMRuby Lane User: Susan Rafach sent me the following message:Dear JackieI'm sorry this was already sold and you unfortunately purchasedit on this site before I had a chance to remove it. I will refundyour moneySusan RafachI was deeply saddened the product was previously sold but more disappointed that the product was still online and available for purchase.  I became concerned when she said the payment did not show on PayPal. I have checked with my bank,  I was advised I would need to check with them tomorrow and ensure payment was not allocated through Penn Floral Antiques. This would have been my first go with Ruby Lane; Your Prussia Items are beautiful and this is the Tea set I had my hopes on. The importance of removing products online once sold is just as important to your potential customer when we see them available for purchase. Respectfully, Jackie P.", "rating": 1}, {"title": "Avoid this website if possible", "text": "Avoid this website if possible. It's poorly built and frustrating to navigate. Worst part was the link to add an address is completely broken and once you order something there are extravagant shipping fees as well as the inability to review your order. If you click the item in your order history it tells you the sale is pending and doesn't allow you to view it any further.", "rating": 1}, {"title": "It has now been 2 months since I placed…", "text": "It has now been 2 months since I placed my order without a response.  They received payment immediately.  Will never do business through them again, though it is likely the sellers’ negligence.", "rating": 1}, {"title": "Your website is very difficult to use", "text": "Your website is very difficult to use!  I bought several items and ended up having to send checks to the dealers because I don't do Facebook and don't have a PayPal account.  You certainly don't make it easy!", "rating": 1}, {"title": "I would give zero if I could.", "text": "I would give zero if I could. 1st time using this site.. never again. Stay away from Emarald Nine Antques and Vintage Jewlery.  I paid for an item on the 7th of may... emailed them on the 17th as to where it was.... emailed me back saying they were going mail it... I waited a week and item. I emailed again for the tracking number and on the 27th I was alerted by PayPal of a return of money into my account. Terrible correspondence.", "rating": 1}, {"title": "Stay away from Ruby Lane & their seller The Daisy Chain", "text": "Ruby Lane does not help customers and does everything to protect the seller. There was a 30% off sale. The item was $22 so the sale price should have been $15.40, but it was $16. I asked the seller & RL if they round up the prices and both said yes. I purchased salt & pepper shakers from a seller that misrepresented the condition of one of them, it had defects along the bottom. I contacted him about this and he played it off as though he did nothing wrong. Long story short, it was a bad buying experience. When I left my review of the seller, his remarks made me seem as though I was the shady one, that I complained about the price & he did nothing wrong. When I replied again thru Trustpilot, my review had been removed completely. According to RL, they contact Trustpilot on behalf of the seller if they feel the review isn't fair and then it's up to Trustpilot to decide if it should be removed (per Simon on live chat at RL). So the sellers/RL/TP make sure there aren't any negative reviews. The response from Ruby Lane below confirms the sellers have the ability to have negative reviews removed. So would you want to buy from a seller or site that hides reviews that expose their shady business practice of misrepresentation of items and poor customer service, not to mention, making the buyer look like the bad guy w/no support from the company site?", "rating": 1}, {"title": "Too confusing when trying to place an…", "text": "Too confusing when trying to place an order.  No trouble with EBTH or Etsy.", "rating": 1}, {"title": "Best of Everything???", "text": "Purchased from the Best of Everything shop. 7 days later I had no response to my emails and no item. Unacceptable.", "rating": 1}, {"title": "THIS ITEM WAS LISTED AS  30% OFF  AND I…", "text": "THIS ITEM WAS LISTED AS  30% OFF  AND I DID NOT RECEIVE THE DISCOUNT;  THE  SALE WAS FOR   FRIDAY ( THAT IS TODAY )  04/26/2019.   SHAME  ON RUBY LANE.", "rating": 1}, {"title": "On the 4/8/18    I paid £840 for a…", "text": "On the 4/8/18    I paid £840 for a diamond ring from Paul Pystock of Diamond Soul shop ,Ruby Lane, USA.He duly sent the ring by USPS who handed it over to PARCELFORCE WORLDWIDE  UK for delivery to Yorkshire .They charged me £118 vat before delivery and when it arrived in Yorkshire the parcel was empty. the ring had been stolen. .After my Girl Friend contacted  Paul Pystock straightaway  he asked questions but eventually lost email contact and he gave no help anymore.Since then Parcelforce Coventry gave no help saying that their contract is with Paul Pystock and yesterday 2/4/19 I received a note from VAT Coventry saying they will not refund my £118 vat until Parcelforce do and that relies upon Paul Pystock making a complaint to USPS but he has not done so because nothing has happened, Robin Andrew , Yorkshire UK .. .", "rating": 1}, {"title": "I made an offer of $700", "text": "I made an offer of $700And ended up getting an invoice for $880!Website needs to be more transparent", "rating": 1}, {"title": "Buyers Beware...", "text": "Buyers Beware...Dealer at Ruby Lane (Down the Road Antiques) just cancelled my purchase because they said they had the item priced too low.  They then offered it to me for a price 3 times higher.Not a good way to do business.", "rating": 1}, {"title": "Horrible company, worse website", "text": "Ruby Lane’s glitchy website resulted in a bid going through without my knowledge, and me paying almost $100 more for an item than the seller had posted as a counteroffer. When I asked for help on this, a RubyLane customer service rep brushed me off with a statement that they were a full-price website and some dealers take lower offers (nearly all take lower bids, FYI). In other words, the answer was a big “so what?”. It was a huge mistake to shop here.", "rating": 1}, {"title": "rubylane in general is great,the…", "text": "rubylane in general is great,the sellers know as goodbee collectables is very cold and unkind,thats my opinion.if you shop with them,i only hope they are more kind to you than they were to me.", "rating": 1}, {"title": "Refused two methods of payments", "text": "Since I had not ever purchased a coin from them before they refused to accept my debit card or credit card and required the funds to be wired; this transaction from their website.  The other forty plus vendors I purchased from did not have any of these issues.  I will never purchase from this company or their Ebay site.", "rating": 1}, {"title": "Never got my order", "text": "Never got my order. So frustrated, that I immediately asked for a refund. Lesson learned!", "rating": 1}, {"title": "Bad program", "text": "I bid on a doll and the seller counter offered. I did not accept the counter offer but instead made a lower counter offer. When I submitted my lower counter offer, Ruby lane said I had bought the doll for a price I did not agree to ($200 higher). Still trying to get the situation resolved. Will never buy from them again.", "rating": 1}, {"title": "I have purchased (via PayPal) an…", "text": "I have purchased (via PayPal) an expensive piece over $800 from one of your shops.  It has been over 24 hours (closer to 40) and I have not received an answer to my email, a confirmation from the seller (shop) nor have they answered the phone number listed, during their bus hours. I DO NOT even know if my purchase is still in stock!! How do I get my PayPal $ back, or know if I can still receive this item?", "rating": 1}, {"title": "Got no confirmation of the purchase", "text": "Got no confirmation of the purchase, Paypal went into a holding pattern for several minutes, never turned off.", "rating": 1}, {"title": "Historic Shop suddenly couldn't find…", "text": "Historic Shop suddenly couldn't find the item I paid for. Not happy.", "rating": 1}, {"title": ")ver 3 days after my purchase seller…", "text": ")ver 3 days after my purchase seller has not called me, as stated on her site, for my credit card information.", "rating": 1}, {"title": "This rating if for Ruby Lane's not…", "text": "This rating if for Ruby Lane's not returning two calls I made back in August 2018 to complain about Lisa Kramer.  I will continue purchasing from Ruby Lane's shops but will more carefully read the reviews on a shop before purchasing.  Even if the store has 5 stars, that does not mean all reviews are positive.", "rating": 1}, {"title": "I have not bought anything  I waited…", "text": "I have not bought anything  I waited hours for the total ,   If you think I am going to buy without the total .  I have tried to cancel this over and over.  You do not have my credit card information  no I am not happy   Carolyn  Landrum", "rating": 1}, {"title": "same problem just trying to BUY!!", "text": "same problem just trying to BUY!!! i only use VISATAKE MY MONEY PLEASE! no? ok.i will never be on facebook.HOW DOES SOMEONE CREATE A RUBY LANE ACCOUNT?simple. you cannot.", "rating": 1}, {"title": "Problem with payment", "text": "Date of experience: January 17, 2019", "rating": 1}, {"title": "Very user unfriendly merchandise and…", "text": "Very user unfriendly merchandise and sellers good but web site to buy awful.", "rating": 1}, {"title": "It was INCREDIBLY difficult to enter…", "text": "It was INCREDIBLY difficult to enter all those senseless 'steps' just to order something...be aware that there ARE other sites in which to order identical items WITHOUT going through anything quite so difficult as your purchasing 'process'...and say, DID I make a purchase through you!!?? Not quite sure!! No confirmation and the process so strange, I'm not quite sure!!", "rating": 1}, {"title": "on the 4th august 2018", "text": "on the 4th august 2018, I ordered a diamond ring from paul pystock of diamond soul shop.  He duly sent it by the end of the month costing me £846 + £118 customs .  it had been sent by USPS who transferred it to Parcelforce in the UK but upon delivery , the ring had been stolen out of the package.Since then after notifying Paul Pystock, he stopped emails and Parcelforce refused to help at all saying that an enquiry had to be launched by Paul Pystock so to date nothing has worked.robin Andrew/Birmingham/uk", "rating": 1}, {"title": "Shop owner was prompt to reply to…", "text": "Shop owner was prompt to reply to questions. However, once I tried to pay for my order, I was unable to get PayPal to work. It kept giving me a message \"We aren't able to process your payment using your PayPal account at this time. Please go back to merchant and try using a different payment method.\" Frustrating.", "rating": 1}, {"title": "BUYERS BEWARE !!!", "text": "I purchased a necklace on Ruby Lane that my sister wanted and it was to be her belated xmas gift.  I was trying to find out today why I hadn't rec'd shipping info yet and discovered the sale had been cancelled.  Contacted seller who said she refunded my money because she decided to seel her inventory to another vendor and close shop.  Besides the fact I had already paid her, she never even contacted me to let me know she was renigging.  I am heartbroken AND furious!", "rating": 1}, {"title": "Bought 3 cissy dresses outfits from a  non performing seller", "text": "Bought 3 cissy dresses outfits, paid asked a question about items being tagged.  Got a very weird email , saying by them they weren't sure about me .  Remember now they have already  been paid.   So I wrote back looking at pictures on a computer they were very tiny,  wanted them to fit my doll.  As sellers they should expect questions thats part of being a seller. Next thing I know,   So they refund and cancel , non performing seller and they must have had something to hide?? After all I paid  that evening when I got home.   So now they blocked me like would I want to ever buy from them  a big NOOOOOO", "rating": 1}, {"title": "Awesome", "text": "AwesomeEverything is clear and preciseFast shippingVery detailed in description Products shown clearlyLove everything about Ruby Lane", "rating": 1}, {"title": "Payment hassles", "text": "The website was fine and I found  beautiful Fenton bell I wanted to order for my Granddaughter.  The order was easy enough.  Paying for it has been a nightmare.  Cannot pay with visa or mastercard, etc.  Has to be pay pal or moneygram.  Neither of which I am familiar with.  Will probably cancel order, and will not use ruby lane again.", "rating": 1}, {"title": "Purchased, paid and and then cancelled by seller!", "text": "Purchased, paid immediately and then my Pay Pal was cancelled by seller within hours without any explanation.  This type of customer relations is unacceptable!!", "rating": 1}, {"title": "I went to pay for my online order for a…", "text": "I went to pay for my online order for a purchase that is most certainly on a whim, but there was no way to actually pay without using PayPal or signing up for a PayPal account. When I tried to pay with credit/debit it ended with \"create account and pay now\". I only want to pay, I do not want to create an account.", "rating": 1}, {"title": "Dissatisfied customer", "text": "Placed order on November 30, 2018 . Still have not received my order# 5193432. I paid for the order with PayPal . Tracking says still in route. Need order or refund", "rating": 1}, {"title": "Scam?", "text": "Placed my order on the 28th of last month, haven't even gotten a confirmed shipping order yet. Just that the money was taken. I have left messages asking for any progress and have gotten silence. Starting to think this may be a scam.", "rating": 1}, {"title": "Rip off!", "text": "I bought a clock and what I was sent does not match the description at all! I was ripped off and lied to. I will never use or recommend ruby lane again!", "rating": 1}, {"title": "4 days after order I have not had any…", "text": "4 days after order I have not had any contact from supplier. I sent email but no response. I have paid for delivery but no advice has come.", "rating": 1}, {"title": "I have been shopping on Rubylane for 5…", "text": "I have been shopping on Rubylane for 5 years and my experience has been great until today. I was trying to purchase a ring from one buyer.I explained that I was travelling in Japan and asked to purchase it just before the red tag sales starts due to the time difference. The owner refused to do so even though I have done it before with other owners. I purposely woke up at 2AM local time and purchased the ring. Without  consulting with me, the owner cancelled the sale and blocked me thinking that I have a shipping address in Canada, when in fact the shipping address was in USA, which was stated in PayPal notification. I cannot connect with her as she blocked me. I know that blocking on Ruby Lane results in troubles with other sellers. Can can I dispute such terrible misunderstand and poor treatment of a customer?", "rating": 1}, {"title": "worst experience I have ever had", "text": "worst experience I have ever had. Pay pal sucks Not having an alternate method for VISA ext is stupid. Take advice from Amazon.", "rating": 1}, {"title": "Ripped off", "text": "I received my package today and was very disappointed. I purchased antique \"silver\" Mercury string garlands for a total of $91.00 with shipping and what I received were plastic \"gold\" garlands that can be purchased at the dollar store for a dollar.. a Total of $3.00. I thought I  I of course would like my money back immediately. I am hoping that it was just an error before I contact Pay Pal and Ruby lane. Please refund my money now.  I have attached a photo.Please let me know how to proceed. Thank you. KIMimage.png", "rating": 1}, {"title": "Great Victorian Earrings", "text": "Hi,  This is Mary,    I recently purchased a truly beautiful pair of earrings from  Kirstens Corner  at Ruby Lane They are from the Victorian era & are gold, shield shape, & have filigree work in black enamel & have tiny seed pearls  They are being shipped from USA  to me in Melboune Victoria Australia at a very reasonable price.  I am so excited can't wait to receive them  as I had been looking for a pair I loved for a while.  Great service & friendly at  Kirstens Corner at Ruby Lane  Thankyou so much", "rating": 1}, {"title": "Just placed an order", "text": "Just placed an order.  Have no way of finding sellers address to send check plus the item ordered is no longer in my cart.  Not worth the aggravation to pursue the situation further.", "rating": 1}, {"title": "Lack of Customer Service", "text": "In August I received a small pin from Lisa Kramer and was surprised to find that the C clasp on the very old pin extended out far enough from the body of the pin as to make it unusable.  I contacted L. Kramer and explained the  problem with the pin but she was not helpful.  I fully expected the shop owner to say, \"Send it back and I'll get it fixed or perhaps you would like a refund, etc.\"  But no, she said she would let me return it but keep in mind the time period for returning it had long expired.  I visited a nearby jeweler who said that, of course, with the C clasp being so far above the pin, it would flop over.  I asked could he fix it.  He said no, but maybe I could wear it on a very thick fabric, maybe 1/2\" thick.  I told this to Lisa and she replied that I was wearing the pin on the wrong fabric. I don't even own a dress, blouse or coat with fabric that thick.  Absurd suggestion.  I live in the South, not in Alaska. I told her I would return it but then decided it was not worth $20.00 (shipping from L. Kramer and then back to L. Kramer) so I waited until my husband again would drive me to a jeweler.  The jeweler I visited today, Oct. 8, saw what was wrong straight away, spent about 15 minutes adjusting the height and doing some kind of thing so the clasp actually sort of clicks closed.  He knew just what to do and said if he hadn't gotten it low enough to stay in place, he could adjust it further.  I was so grateful that tears sprang to my eyes leaving the shop.  I saw this L. Kramer woman had 5 stars so didn't look through every review until after I was disappointed.  L. Kramer got what she wanted.  She made a full price sale, she did no follow up on a defective pin and it cost her nothing - no shipping, no repair to the pin, just the wholesale price she paid for the pin.  No customer service is what I received.", "rating": 1}, {"title": "Item had the wrong price and sale was…", "text": "Item had the wrong price and sale was rejected.", "rating": 1}, {"title": "The Antique Pooch rocks", "text": "The Antique Pooch rocks! Always has something I want. I collect Newfound Dog antiques she always has has something I want", "rating": 1}, {"title": "Gary Germer - bad seller", "text": "Gary Germer - bad experience with this seller.  Refunded my purchase with no explanation.  Ruby Lane - do you allow your sellers to back out of transactions?  Very disappointed with both!", "rating": 1}, {"title": "Wanted to make multiple purchases", "text": "Wanted to make multiple purchases.  Impossible to do with this format.", "rating": 1}, {"title": "Was not what was advertised", "text": "Was not what was advertised.  Said the earrings were 1 inch long.  They were not.  They are so small you can hardly see them.  A very bad experience.  I will never buy anything from this site again!!", "rating": 1}, {"title": "Beware of Seller canceling orders.", "text": "I placed a purchase order for a collectible doll but didn't want to purchase it until I knew the seller was aware of the transaction. After placing the order, I emailed the seller, asking them to touch bases with me and then I'd buy the doll. Hours later I received a terse one-liner: \"This doll is no longer available. Sorry.", "rating": 1}, {"title": "The website is not user friendly when…", "text": "The website is not user friendly when it comes to completing a purchase without PayPal. Should be a separate selection to just use my Amex card. I’m now waiting for assistance", "rating": 1}, {"title": "I had problems with a seller not living…", "text": "I had problems with a seller not living up to Rubylane's policy.  At first, they stepped in to help but as time went by and the seller would not honor the policy of having adequate insurance ( Charlottes Web- mailed a package -She did not have  enough packing materials and the doll was damaged)- had only priority mailing insurance ( $15.00-this is not extra insurance) not enough to cover damage to the doll).  I have spent thousands of dollars at EBay- this is lost Money for Rubylane- I don't trust that if anything goes wrong again that things will be made right.Frustrated Buyer", "rating": 1}, {"title": "Garbage Site", "text": "Garbage site with overpriced, glorified, garage sale pieces. Total disregard for customer concerns/suggestions. Site is hard to navigate, and their customer service is terrible.", "rating": 1}, {"title": "Absolutely unforgivable treatment", "text": "Absolutely unforgivable treatment of a customer. I have never been treated so poorly or unfairly by a company as by Ruby Lane. A serious customer service issue was ignored and left unresolved due to the unprofessional, uncaring, and unresponsive team of \"customer service\" (what a joke) reps at Ruby Lane. A terrible experience with this company and their website.", "rating": 1}, {"title": "Your payment section ...", "text": "Your payment section is the most frustrating, antiquated design I have ever run across! Nothing in your webpage design is geared towards todays normal, simple & efficient 'place your order' that all other sites have. This tie to PayPal is so old fashioned. I do 99.9% of my shopping on-line and will NEVER deal with this site again.It's too bad, because this site has desirable products, a great name. It is just your PAYMENT side of the website that sucks (real bad) and that is partially due to the websites 'Place your order' design itself. The other is this PayPal crap.May I suggest you visit a variety of on-line shopping sites and see that you have the OPTION to choose PayPal, not like this site where you have to figure out how to get around (out of) this ridiculous PayPal crap.", "rating": 1}, {"title": "I am new to Ruby Lane", "text": "I am new to Ruby Lane, but will be closing my account.  I submitted an offer.  The seller made a counteroffer, which I didn't find acceptable.  I deleted the emails.  This morning, I get a note and an invoice from the seller that I am delinquent in my payment for the item at the amount of his counteroffer.  If the Ruby Lane system indeed simply pushes through the counteroffer as the sales price, then it's simply an unacceptable system.  Nothing in the U.C.C. requires a potential buyer to accept a counteroffer during a negotiation process.", "rating": 1}, {"title": "Rejected the First Offer", "text": "I purchased a doll from RubyLane under La Reine Des Poupees Antiques by Eva DelGrande at 12:00 pm on Friday July 22. However she had a live auction from EBay which was done at 5 pm. She told me several interested parties and had to be fair to honor the first offer which came before me made my final decision to purchase her. Really I was the first did offer on RubyLane but she took second offer from EBay because they have to pay upfront where I was able to do layaway. She knew all along what was going on!! Robert", "rating": 1}, {"title": "Dusty, tired, digital inventory", "text": "Dusty, digital inventory of overpriced, garage sale goods. If you don't have time to stop by your local thrift store, stop by here to see just how expensive garbage can be. Site is hard to navigate. Need a degree in computer science to figure out how to complete a purchased. Ruby Lane does not stand behind the merchandise on its site. Caveat Emptor", "rating": 1}, {"title": "I love the merchandise but hate the…", "text": "I love the merchandise but hate the RubyLane site.   It gives me trouble when I try to make payment telling me my address is different than PayPal, even though I checked and they are exactly same.    I try not to shop RubyLane for this reason.", "rating": 1}, {"title": "So far no response from seller", "text": "So far no response from seller. I’ve paid for my product but no idea if it or when it will ship. I don’t recommend this site.", "rating": 1}, {"title": "A two way street is mucho nEEded or at thE very lEast a chance to respond before a block is implemented!", "text": "ShopkEEpers shouldn’t be allowed to block users with no feedback from that customer. Some shopkeepers are petty with their reasons and they should be required to shOw good and just cause, preferably with detailed backup before they are allowed to initiate a blocked user and have it stick because iHad one that iJust knOw blocked me because his inventory was not up to par with my standards, sO it was petty and uncalled for that he should get to block me because his inventory was sub par bEfore aNything was pAid for or sent, iJust wasn’t happy with his wares and he took offense to that after trying very hard and getting me to look at all of his inventory in a very controlling manner that made me feel manipulated into looking at stuff that was crap compared to what iNormally purchase. There’s no way iWould ever have returned to his shop for anything, yet he was allowed to block meeee which kept me from being able to spend thousands with other shops who are worthy of my business. How is that fair to mE or to my potential business with other shopkEEpers!!!Some shopkEEpers are great and deliver over and above what their descriptions and pictures indicate which is awesome but on the far end of that spectrum you have shopkEEpers which deliberately overly enhance what they are selling to the point of it being unrecognizable as the same item that was pictured and described, once that item is viewed in person! Just as there is a way for shopkEEpers to block good paying customers which can lead to being prohibited from shopping anywhere on the Ruby LAne site due to what Ruby LAne itself advises, so to should customers have a way to give feedback about the products which are not delivered as described! This is a very big issue which needs to be addressed!", "rating": 1}, {"title": "I have purchased many items from…", "text": "I have purchased many items from various sites but have NEVER had so much trouble paying for my order or being assured by you that my order is complete and confirmed.  After answering all the required questions I'm STILL not sure that I will actually receive the merchandise for which I paid.", "rating": 1}, {"title": "This was my first time buying through…", "text": "This was my first time buying through Ruby Lane and most likely my last.It took a whole day to receive a reply and even then, my questions were not answered.  The glass vase was so exceptional I took a chance & bought it.  Now I am very glad I took a chance !I was told the shipping would be done the next day and that was it.  No information regarding the shipping sent.  I sent an information note that was very important, no reply.  The only positive to note is the packing as it was very well packaged and arrived intact & safe.  I worried for several day and expected a broken piece.  This seller needs to communicate before the sale in a much better way so the buyer is kept informed.Just so you know this review is based on the truth, the whole truth and nothing but the truth.Mr. J. Paul Richer, Ottawa, Ontario, Canada.", "rating": 1}, {"title": "I purchased a Meissen gold cup from…", "text": "I purchased a Meissen gold cup from Hazen and Howard Antiques that is affiliated with your site, and was so excited to receive it, being that it is a hard item to find.  I received a message today that the item had already been sold, and they forgot to take it off their website.  I saw several of them listed last night, and all of a sudden they don't have any. Or is it more, they want more money for the item?  Either way, this is bad business and will affect my future decisions to purchase on your site.  Disappointed,dbcmichigan2018", "rating": 1}, {"title": "Need phone number contact with seller", "text": "Need phone number contact with seller. Sign in Emails fail. Doll arrived severely damaged, EXTREMELY poorly packaged. Arms wrapped in bubble wrap but not legs. Right foot broken off completely and sawdust leaking from leg everywhere.Heartbroken.My phone 318 322 0106. Kerry", "rating": 1}, {"title": "Had an issue with the vendor and was…", "text": "Had an issue with the vendor and was not at all supported by Ruby Lane customer service or policies regarding layaway. My purchase of over $300 was a test to buying an antique on my wish list for over $1000. Given the lack of protection Ruby Lane affords it's customers on line, as well as the heavy mark up it's vendors exercise relative to the value of the market, and the lack of verifiable authenticity by Ruby Lane of it's vendors claims to authenticity and antiquity...I will never again buy a high priced item online from you.", "rating": 1}, {"title": "Poor website, poor return policy", "text": "Poor website,I cannot find the original podting to see return policy, I cannot upload photos of damage to send to vendor.  There is no clear descripton of the mechanics of return ...other that send an email.For goodness sakes just take a page from EBAY.", "rating": 1}, {"title": "Payment options/means of paying are lacking", "text": "The site tells you to click on icon's that are not shown while trying to complete transaction and pay with credit card.  Subsequent email message says that the individual business owner will contact to confirm purchase and shipping arrangements though that particular individual or the individual's representative has failed to do so. Most likely will not use this site in future once transaction is completed.  Spent way to much time dealing with the situation.", "rating": 1}, {"title": "Site Glitch.I spent an hour looking for a champagne…", "text": "I spent an hour looking for a champagne pill box  1960’s hat for a wedding dress show for my Senior Living Community.  I finally found one that would do.  When it cane to check out the site would not move forward!", "rating": 1}, {"title": "Ruby Lane Photoshop Photos", "text": "Ruby Lane Photoshop sellers  photos until they are barely recognizable and then contact them advising seller to remove or replace the offending photoshop photo as it is against their policy to have an unrecognizable photograph as the main photoHa Ha you could not make it up", "rating": 1}, {"title": "It was not east to navigate.", "text": "Date of experience: April 13, 2018", "rating": 1}, {"title": "As a first time user of Ruby Lane", "text": "As a first time user of Ruby Zlane I find it very confusing.  My order number 4974826 was rejected by Visa.  I called them as to why and it was about my zip code if I understood correctly.  However, I entered it correctly.  Can I pay by check or will this be rejected too?  Frankly what should have been a satisfying experience turned out with too much time spent for nothing.  Frankly Iam not sure what you want me to do in order to rectify this situation.  Thanking you in advance for a reply.  Doniaa", "rating": 1}, {"title": "Made a purchase only for the buyer to…", "text": "Made a purchase only for the buyer to say sorry haven't got it anymore.", "rating": 1}, {"title": "Purchase a doll and the doll arrived…", "text": "Purchase a doll and the doll arrived very dirty, and the outfit had a very bad musty smell, major rip in the dress.  When contacting the seller they tried to blame the post office and told me to file a claim.  Wrong, this was not a post office issue.  Seller also stated I got a bargain with the price.  The final price on the doll is not the talk, it s the condition of doll and clothing.  Contacted management in regards to this seller, an they did nothing to support the buyer.  I also offered to send the outfit to their office so they may see and smell what I received.  They refused.  Poor Management Team.", "rating": 1}, {"title": "Your site is terrible", "text": "Your site is terrible, tried to do a purchase using paypal and kept telling me to open an accout with Ruby Lane, which I will not do...", "rating": 1}, {"title": "Unprofessional", "text": "I purchased earrings and was transferred to Lunatique.  I paid via PayPal and expected no problems, however I heard from the seller that she could not find the earrings...What!?!  Sounds fishy to me and very unprofessional.  Will not buy from this company again.  Sandy Honeycutt", "rating": 1}, {"title": "The site lacks an app", "text": "The site lacks an app and is a NIGHTMARE to navigate on a cellphone which, lets be honest, it the medium everyone uses these days.", "rating": 1}, {"title": "RL makes it impossible to use Paypal to…", "text": "RL makes it impossible to use Paypal to pay a vendor's invoice.  I wish you could fix that because I love the shops @ Ruby Lane, but the check-out process is such a headache!Sarah M., San Marcos, CA", "rating": 1}, {"title": "Disappointed", "text": "Interestingly, I just received this \"voice your opinion\" for Ruby Lane at the same time that I purchased an item and within 10 minutes received an email that the item had been sold on another site.  Very frustrated! So, am voicing my opinion that I may not be back to Ruby Lane!!", "rating": 1}, {"title": "Pictures are key in buying online and…", "text": "Pictures are key in buying online and the new picture feature on Ruby Lane is not good. When I expand the pictures in order to see better detail the pictures are actually smaller than the original on the page. What happened to the magnifying feature that you used to have?? Please bring it back.", "rating": 1}, {"title": "Your payment process is horrendous", "text": "Your payment process is horrendous, just trying to get the option of finding/entering credit card information.  Be happy to review site, vendor, purchase when item is received.", "rating": 1}, {"title": "I couldn't use my credit card for the…", "text": "I couldn't use my credit card for the transaction, I was forced to go to paypal. NOT GOOD. Ruby lane's web site took me to and I'm not sure if I made a payment to ( \"JUST FOR ME\"). It was a very unpleasant way to pay money for something I wanted. Not sure if I will recommend Ruby Lane to anyone .Thank you,Shawn", "rating": 1}, {"title": "Frustrating website - update!", "text": "My credit card was refused. I contacted Visa Andthere is no problem there. They said the problem must be on the merchant’s end. I tried to go back, go through the checkout again but am unable to pull up my cart. I did sign in as requested.  Am totally frustrated! I later was able to talk to someone, ordered what I wanted and it was shipped that day! I think sometimes the internet just doesn’t always work as you expect! The person I spoke with could not have been more helpful. As I recall, I did have a problem finding their phone number, and I must admiittedly, patience is not one of my virtues. Apologies to Ruby Lane!", "rating": 1}, {"title": "Rubylane won't help you if you're…", "text": "Rubylane won't help you if you're cheated by a dishonest dealer. A dealer photoshopped the pictures of an item. They didn't look anything like the photos. The description didn't disclose the damage. I returned the item, but lost all my shipping $30. When I complained, received a nasty note from the dealer who then blocked me so I couldn't respond.", "rating": 1}, {"title": "Created account for no reason", "text": "Made me create an account before telling me the item I wanted was no longer available, so now I have been sent multiple emails for no reason.", "rating": 1}, {"title": "I paid for badge on pay pal account", "text": "I paid for badge on pay pal account. My social security number is already on PAY PAL and I see no reason to put it on another web site. If ss# is mandatory again for purchase, CANCEL THE ORDER.", "rating": 1}, {"title": "Seller is so rude she has blocked me", "text": "Seller is so rude she has blocked me. I was trying to buy her blue bangle. I said she had it up at price §2.7000 dollar a couple weeks ago then it went up around the §3.400 . I messaged her to say about it then she has blocked me. My offer was was 2,900 if they treat people like this she will never seller items. Very disappointed.Ann", "rating": 1}, {"title": "SIte is confusing..", "text": "SIte is confusing... There's no phone customer service.", "rating": 1}, {"title": "I had to demand a refund as their …", "text": "I had to demand a refund as their shipping policy was inflexible. Either paying insurance on an item not worth the cost of it or having to be available to sign for a package. (Some folks travel for a living!) No attempt to resolve from them, only a lecture about how they are right and the customer is wrong. Rude communication is always a sign of a bad business. Now I remember why I had always purchased jewelry from a trusted local shop!", "rating": 1}, {"title": "Please cancel and delete all my orders …", "text": "Please cancel and delete all my orders I have never encountered the most confusing website, I couldn't pay it kept sending to other screens or site that required passwords that I couldn't enter or reset.", "rating": 1}, {"title": "I think this is deplorable way of doing business", "text": "I think this is deplorable way of doing business having merchandise on different sites and not knowing if it’s sold or not .....would never do business with this vendor and probably not purchase anything again from Ruby Lane ...second time happening ....unreliable . And I’m sure this has happened to others gross misrepresentation.....thanks but no thanks", "rating": 1}, {"title": "Ruby lane does NOT protect buyers", "text": "Ruby lane does NOT protect buyers, be forewarned   It strictly protects sellers.", "rating": 1}, {"title": "Buyer Beware", "text": "Please, please, please have your purchase checked out by a trusted jeweler once you receive it. The clasp on mine must have been defective causing the bracelet to fall of for the second time in two wearings. Unfortunately, I didn’t realize it the second time and now the bracelet is lost. I had it all of four days. What a waste of good money.", "rating": 1}, {"title": "I have bought several items on Ruby …", "text": "I have bought several items on Ruby Lane.  In the past my experience has been great.  However, since having to use a faulty PayPal account I haven't been able to correct on line (and trying to do it unsuccessfully by phone) I don't believe future attempts to make purchases will turn out well.", "rating": 1}, {"title": "Product was advertised as new", "text": "Product was advertised as new. The box was opened and tampered with and the product did not work.", "rating": 1}, {"title": "I sent in an offer on a doll Fun City …", "text": "I sent in an offer on a doll Fun City had advertised for sale. The owner of the doll at fun city accepted my offer then went silent. I sent him numerous emails asking for an invoice so i could pay for the doll through PayPal but all went unanswered. I check the statis on Ruby Lane to see the seller has cancelled the sale without any coorespondence to me. What a bad way to do business. After all this hassle and upset i dont want this doll anyway, hed likely substitute the doll for one i wouldnt want now. Its shaken my desire to buy from Ruby Lane where prior to this i have had numerous purchases from sellers with all great results, but not now.I'm sorry Joan Klingbile", "rating": 1}, {"title": "placed an order", "text": "placed an order, submitted paymentreceived message payment not received, am blocked from asking question or viewing any items including one I orderedwill not use you again", "rating": 1}, {"title": "I did not want to pay by PayPal", "text": "I did not want to pay by PayPal.  I kept hitting visa and it defaulted to PayPal.   Not cool!  You just missed a sale.Now it won't even let me submit my remarks....obnoxious.Mary Lawson", "rating": 1}, {"title": "Don’t bother wasting your time with …", "text": "Don’t bother wasting your time with this site.  You get tons of junk mail you can’t back out of.  You’re forced to sign up for an account then sign up for PayPal in order to purchase anything. Multiple windows pop up and trying to find your screen is next to impossible. It took 38 minutes to buy a 20 dollar pin.  Waste!", "rating": 1}, {"title": "Bad place to sell for nonexclusive …", "text": "Bad place to sell for nonexclusive sellers. Been a seller since 2008 and sales have never been so low. I don't have to review here with my shop name. I complained a few years ago and I've been told if I'm not happy I can leave Rubylane.", "rating": 1}, {"title": "I was not given the opportunity to …", "text": "I was not given the opportunity to check out as a guest and my order could not be placed unless I created that account.  I never want to become a member at any site as I am then inundated with emails and sure enough within 4 hours I received 4 emails 1 of course confirming my order which was ok however 3 additional emails were not necessary including \"your opinion\" matters...so far you have done nothing but confirm my order and then harassed me with emails!", "rating": 1}, {"title": "Not happy with the book I bought", "text": "Not happy with the book I bought.  It was advertised as a 1960 book, I  got it and it is stamped Chic Fil A. $12.00 plus shipping for a children's book from Chik Fil A? 1960 original? No way!", "rating": 1}, {"title": "currently there is NO cellphone …", "text": "currently there is NO cellphone application.I must use internet site for Ruby Lane. When keying searches, there is an annoying lag in lettrrs appearing on screen.I need and want an APP for Ruby Lane!", "rating": 1}, {"title": "could not purchase", "text": "could not purchase. E mail said to link on to paypaL SITE BELOW PURCHASE ORDER. COULD NOT FIND LINK SO COULDNT PURCHASE", "rating": 1}, {"title": "Be wary of this site!", "text": "Be careful here! I had thought I had made a purchase through Ruby Lane...  Wrong. I used Pay pal for payment. Now the seller informs me that the item was sold months ago and that mistakes were made. I am trying to track my payment. Such a waste of time!!! And effort. So disappointed. Be wary. I will not be back.", "rating": 1}, {"title": "Still waiting", "text": "Still waiting.  And waiting.  And waiting.  Maybe they ship with the Pony Express.", "rating": 1}, {"title": "When I order something", "text": "When I order something, either I order it all online or through phone. This place made me put my info in and th n said someone would ‘call me’ to complete my order.Never got the call but did get an email stating to complete my order through paypal.Nope. I reconsidered and ordered elsewhere.", "rating": 1}, {"title": "No more Ruby Lane", "text": "I have purchased on Ruby Lane in the past and never duped into using Pay Pal as the form of payment until now. I refuse to use Pay Pal and now will never shop Ruby Lane again. How dare Ruby Lane default to Pay Pal. My son was cheated out of thousands of dollars because of using Pay Pal once.", "rating": 1}, {"title": "ISSUES ON ANDROID PHONE", "text": "I use ruby lane on my phone, I get an error message EVERY TIME I want to look at anything in my daily email alert. It is so annoying. I have to click the link for the store then dig the item out of their recent additions. I shop for my mom, so if I really like the look of the item, I bother to do it. But it is super annoying and its been going on for months.", "rating": 1}, {"title": "At the end as I was about to place my …", "text": "At the end as I was about to place my order and use PayPal, the system asked me to confirm the last 4 digits of my SS# which is TOTALLY unheard of AND unacceptable. I will not buy from this vendor again. Something like this should be reported and that is exactly what I am contemplating.This is NOT a PayPal issue as you pointed out. Been using PayPal for years and they NEVER require any combination of my SS#. Your issue, YOU own it.", "rating": 1}, {"title": "An extremely convoluted website", "text": "An extremely convoluted website. Very difficult to navigate. I'm surprised I was successful at even placing an order.", "rating": 1}, {"title": "THIS WAS THE MOST SCREWED PROCESS I …", "text": "THIS WAS THE MOST SCREWED PROCESS I HAVE EVER SEENI WILL NOT BUY ANYTHING EVER AND I AM TRYING TO CANCEL AN ORDER I THINK WQS SUBMIITED BUT NOT SURE", "rating": 1}, {"title": "Problems making the payment as u …", "text": "Problems making the payment as u suddenly changed the icons in only one, Paypal. In past purchases with Amazon and Etsy I had no problems at all by using my AmExpress card (Costa Rican address) while shipping to a Florida address. By limiting payment options u will lose a lot of people to use your system.", "rating": 1}, {"title": "Worst experience I've had on Ruby Lane …", "text": "Roselady Antique Vintage Jewelry and Dolls made this a day to remember. In all the years I have purchased on RUby LaneI have never been  barred for asking questions about condition of stones. I have been burnt too many times as a dealer myself. This dealer asks for offers on every one of her 1400 items. I thought she wanted to SELL! Silly me!. I should have realized that when there are no reviews and no listing of sold or pending items something is very wrong. I was unprepared when Ruby Lane disputed my offers before sending them to the dealer. Then the dealer declined the offer presented to her, never answered questions, never gave an acceptable price and blocked my entry into her site.This is a terrible way to do business and Ruby Lane should be ashamed of allowing a dealer to continually post items and ask for offers on EVERY one when selling does not appear to be the true motive of the dealer.", "rating": 1}, {"title": "The site is forcing me to join PayPal", "text": "The site is forcing me to join PayPal, something I would not like to do. However, in order to proceed with the purchase, I accepted it and filled in what was requested. However, it came a message saying that I already haqve a Paypal account and that I should enter \"through it\" without saying HOW. Again, I tried and came a message of ERROR, in Portuguese(I am in Brazil) . So I have 2 items which I really would like to purchase, the sellers already sent me their notes and I AM NOT ABLE TO PAY FOR THEM.Why force me to join PayPal? I have a Credit Card and pay insurance for it, I do not need Pay Pal. However, if a site FORCES ME to join it, why not be clear and helpful? The system is unnaffective and is preventing me from buying, not helping me!!!! And not helping the sellers either!", "rating": 1}, {"title": "Do not use", "text": "Do not use. VERY bad customer service. Placed order. Received confirmation. Asked for bank details. No reply. Sent two e mails chasing but still no reply.", "rating": 1}, {"title": "Tried to purchase three cabinet from …", "text": "Tried to purchase three cabinet from two different 'stores'. One sent an email the next morning that the item had been sold in their bricks and mortar store. The other said it he items were on hold for another customer. Of course this is after you've already provided your credit card information!!!", "rating": 1}, {"title": "Don't use Ruby lane", "text": "Legitimately purchased something on Ruby lane, invoice received etc. Seller decided to cancel the sale and sell to another customer that had bought from them before. How rubbish is that!", "rating": 1}, {"title": "You have a button \"Make an offer\"", "text": "You have a button \"Make an offer\". I make an offer, I get the consent of the seller. And then the seller declined my offer. This is very bad. I've already bought 500 items at the Ebay auction, and I'll buy there later. And I will not buy at Rubilane.", "rating": 1}, {"title": "i could not finalize my purchase …", "text": "i could not finalize my purchase because you would not take a credit card and i was unwilling to use pay pal", "rating": 1}, {"title": "I have been trying to pay for an item I …", "text": "I have been trying to pay for an item I purchased for days now.Where in the devil do I put my CC information??????????????I have never received an INVOICE?    When I clicked on Paypal it came up Paypal credit.  I dont want paypal credit I want to use my paypal account!!!!!!!!  Why cant you make it EASY like Ebay?????????Patty Shaw", "rating": 1}, {"title": "Won't use site any more.", "text": "Date of experience: July 02, 2017", "rating": 1}, {"title": "To ask for payment before advising cost …Dissatisfied", "text": "To ask for payment before advising cost of shipping,insurance etc is most unsatisfactory and has prevented my proceeding with this proposed order.", "rating": 1}, {"title": "ALWAYS ALWAYS ALWAYS PAY WITH.YOUR.CREDIT.CARD!!!", "text": "Currently, I am embroiled in a transaction with R*** and U******, an unrated Ruby Lane shop. This has been a TORTUOUS AND FRUSTRATING experience. The seller, S**** M****, clearly does not know what she is doing, having directly sent me at least 5 text messages (bypassing the Ruby Lane interface) providing live commentary of her attempts to adjust the Purchase Order, while volunteering no acknowledgement of having received payment or of having shipped the item, despite having been asked twice for a Tracking Number. Due to her self-professed inexperience, I have asked at least 3 times that she please ask Ruby Lane Customer Service for help with her first sale, “for my sake as well as yours”. But no. S**** M**** steadfastly ignores such requests, along with requests for shipping confirmation. Did this situation not so much resemble being driven by taxi through a teeming city in the Developing World by Manuel of Fawlty Towers, I would ask to back out immediately. But who knows (1) whether my request would be heard or acknowledged, and (2) where I would end up even if it were. —> Had I not paid using my charge card, through PayPal, I would be ready to kiss my money goodbye. Moral of the story: whether or not you pay through PayPal, ALWAYS ALWAYS ALWAYS PAY WITH.YOUR.CREDIT.CARD. A credit card chargeback is the only and final assurance you have that you will get your money back from a Black Hole such as this current transaction.", "rating": 1}, {"title": "Apaulling Service", "text": "Bought an item online which arrived badly damaged with parts smashed of.Ruby lane was of no help kept advising the seller of the wtong information and still waiting for refund a month later! Very untrustworthy.", "rating": 1}, {"title": "Well Establish Ebay seller tried to Open store on Ruby Lane", "text": "Recently applied to open store on RUBY LANE. I have sold on EBAY for many years with a positive feedback of over 4000 - no negatives. I have never encountered such poor customer service - over a 4 week period I filled out the forms over and over and they kept rejecting the application as incomplete - I wrote to them many times asking what I was missing and they wouldn't respond - just told me to answer the guideline questions - finally after going over it with a fine tooth comb, I asked them to clarify which answers they didn't like and to give me the answers they were looking for. I then did them the way they wanted - some of the questions were ambiguous - could be yes or no depending on how you were interpreting them. Finally, I was able to send it to review. Should take 5 days for an answer, no word 10 days later. By this point I think they were tired of me and said they were rejecting my store because I didn't meet their standards. My antique dolls were of the best quality, my pictures and descriptions were better than many of the other stores - they said they didn't care - those were established sellers and I guess they didn't have to meet the standards that new sellers did. All through the process they made me feel like a second rate person. Oh, they did invite me to try again someday. Right!!! To verify my claims of great pictures and great descriptions and great products - mostly vintage dolls check me out on ebay. My seller name is mariael59. You might have a better experience, but beware.", "rating": 1}, {"title": "order submitted without clicking submit", "text": "I just went to place an order and changed my mind as soon as I put in my credit card info. Instead of proceeding to the next screen or clicking submit, I then deleted out my credit card info and the item from my cart which then showed that my cart was empty. I then received an order confirmation email. I did a live chat with the company right away and they state that they can't cancel my order and I don't know how to checkout and I had to have clicked on submit. I definitely did not, this means they save your credit card info. Beware, if you even key in your credit card - the order will get recognized and \"submitted\". Very sketchy practices and unhelpful and rude service.", "rating": 1}, {"title": "I do not use PayPal!", "text": "Have had a horrible experience with paypal in the past. No more.", "rating": 1}, {"title": "Paypal Hijack", "text": "Kind of annoyed.I didn't select paypal and if I have to use paypal I won't shop here.", "rating": 1}, {"title": "Not Satisfied", "text": "From: Cohen, Gary O. Sent: Monday, November 21, 2016 10:45 AMTo: 'Carlos King'Cc: 'Ruby Lane'Subject: Ruby Lane Purchase Order Number 4464094 for GalleryTwentyFourJewelryMr. King, the bracelet I bought from you and received by me this morning is not satisfactory for the $335 price I paid, because:•\tthe two buttons detached from the chrome band (see first attached photo),•\tthe bracelet measures less than 2 inches wide, rather than the advertised 2 ½ inches (see second attached photo), and•\tthe two buttons are not matched, the black being higher than the yellow (see third attached photo) and the yellow, unlike the black, appearing to have four holes that have been filled with glue (see fourth attached photo).The advertised description represented that this is a “vintage” French bracelet dating to the”1930s-1940s,but, as a long-time collector of deco jewelry, the foregoing raises doubts in my mind.", "rating": 1}, {"title": "Unsuccessful", "text": "Tried to purchase an item.Had to start an account, not something I wanted to do.Wanted to pay with credit card, was instead directed toward PayPal, not something I want to use.Immediately closed PayPal web page, but told transaction has already been completed, item no longer available.Complete waste of time.", "rating": 1}, {"title": "Buyer Beware", "text": "Neither item I ordered was as pictured.  They refused to let me return them.  They claimed an item had to be returned within 3 days after delivery but I live abroad and had pre-ordered them for pick up when I arrived in the USA.  As far as I am concerned, this company is dishonest.", "rating": 1}, {"title": "Ur web is very baaaad", "text": "Ur website is ages behind. Regarding registration and online payment. First,  it says that phone is not a must,  then I insert a phone number in payment page,  and it didn't accept it.", "rating": 1}, {"title": "Steady Decline in Quality", "text": "Overall bad experience with overpriced, low quality product. This one was the last straw. After years as a buyer, I've closed my account on Ruby Lane. It's become as chancy as buying on E-Bay.", "rating": 1}, {"title": "I cannot edit my cart", "text": "I have tried repeatedly to contact Ruby Lane for help and have tried several merchants and the icons of the heart and trash can don't appear above the items after they are added to my cart.", "rating": 1}, {"title": "Still have received nothing--no product!", "text": "I have received nothing from the seller--no product. It has been 2weeks since I purchased the ring from the RUBY LANE Merchant! Is this site a scam?", "rating": 1}, {"title": "The worst I have seen", "text": "No communication", "rating": 1}, {"title": "No good", "text": "I ordered a necklace that was not as represented ( owner must have shot  picture through magnifying glass!) I followed procedure for return, NO RESPONSE from shop owner, and after one e-mail, no response from Ruby Lane. Never again!!!", "rating": 1}, {"title": "Items never shipped", "text": "I purchased two pairs of earrings a month ago. I contacted the seller 2 weeks ago to ask if they had been shipped. She said she would ship them this week. They still have not been shipped. I contacted her again and have heard nothing back. If the site allowed me to give zero stars I would.", "rating": 1}, {"title": "I was doing a layaway. In my opinion I the process of which button that need to be push explained", "text": "Took a while and was stressful to make a purchase", "rating": 1}, {"title": "Beacon Hill Jewelers_Beware", "text": "Beacon Hill Jewelers are not honest. Their written purchase policies are different then what they tell you personally; that is when you can actually talk to a live person. They want everything done via email and routinely contradict themselves in an effort to keep your money instead of canceling an order for return. They strong arm and threaten by setting payment deadlines that are un-reasonable, like telling you on a Friday that if they do not receive the payment the following Monday, you forfeit the sale and the deposit. They do this especially on lay-a-way or payment plans. They accuse the purchaser of not mailing in the payments in time which allows them to cancel the order, keep the money AND the item. Then they admit to not checking their mail for several days or having it forwarded to another area business when they are not around. The merchandise is also not what they advertise it. The do not know their products and are over priced.I blame Ruby Lane because they do not vet their vendors and do not offer any assistance in resolving any disputes with their vendors. Their attitude is \"buyer beware\" and solve the problem on your own. If you can't trust Ruby Lane then you can't trust their vendors. I will not deal with Ruby Lane ever again.To respond Maddy, you say \"Ruby Lane takes note of any dissatisfactory transactions between a buyer and a shop owner and if there is a recurring issue, we will close down the shop.\" I find it sad that you only take note and then only action against your vendors over recurring issues. Seems Ruby Lane only cares about any egregious offenses to customers until it becomes systemic and problematic with no regard to the customer who has a singular but serious problem that needs intervention in resolving an issue. Especially with a vendor like Beacon Hill who make up their own rules once they get your money and are holding your purchase hostage.In fact, when a call was placed to Ruby Lane Customer Service and to the office of Tom Johnson, Founder, President and CEO about our problems, we were told on both accounts that it wasn't Ruby Lane's policy to intervene in customer-buyer disputes.Maddie, you can very easily search reviews on line for Beacon Hill Jewelers and find many less than positive complaints. It is something I should have down before dealing with them but given what was thought to be the reputable name of Ruby Lane, it was assumed that the quality and integrity of your vendors was vetted.You say to feel free to contact your customer support team and they will be happy to assist. In what way will they assist now when they cared not before?", "rating": 1}, {"title": "No rude conduct.", "text": "Conduct is/was not rude, just NO communication that was at all helpful.  Actually communication was a general response with directions which did not apply to my problem and nothing from a person, except the poor people I have tired to purchase items from.I am sorry to have to report this and it is also the very first time to do something like this.", "rating": 1}, {"title": "LOUSY CUSTOMER SERVICE", "text": "Purchased an item that was not as described, at all. Have repeatedly contacted the seller about a return (as stated in the listing), with no response.  Have contacted Ruby Lane also & no response.  I would never make a purchase thru Ruby Lane ever again.  Stick to EBay.  They actually honor their return policy.", "rating": 1}, {"title": "Ruby Lane tainted by seller", "text": "I would never had proceeded with my purchase had it not been promised as a Mother's Day gift. I would never consider patronizing this seller again under any circumstances. The negative experience has made me leary of the reviews posted on Ruby Lane as any positive review of this seller must be contrived. In short, it took several emails before receiving answers and the seller was not honest. The seller will say anything to make a sale.With so many other trusted shopping options, no one needs this nonsense.", "rating": 1}, {"title": "Palpal antique method of payment", "text": "I will not purchase again because of billing system", "rating": 1}, {"title": "Checkout a disaster", "text": "I can't even figure out how to pay through The only means PayPal. It keeps asking me to scan a card. I don't even know what that means!?? I have googled his and so many others have had this problem. It won't let than skip the scan. I really should not have to spend an hour researching how to buy something. This is unacceptable.", "rating": 1}, {"title": "Item offered was misrepresented.", "text": "Selling fraudulently attributed items is wrong!", "rating": 1}, {"title": "Didn't look trustworthy", "text": "I chose to back out of buying the product for two reasons. 1 it didn't give me an expected arrival time for the product I'm buying. For most people buying jewelry is often a time sensitive process and ensuring the product gets here in time is essential. They didn't give me an expected time and therefore made it very hard to spend 85 dollars on their site. 2. I hate PayPal. I don't trust PayPal, they are a scam and spam me with endless advertising emails and they've been hacked too many times for me to give them my information.", "rating": 1}, {"title": "Where is my purchase?", "text": "I have not received my order.  It has been 10 days.  What is going on?  I am very unhappy.", "rating": 1}, {"title": "Item sold to me was cancelled", "text": "I bought an antique cross and paid for it. It was for my mom who has terminal cancer to replace one very similar that was stolen from her. It was very special to her and I was so excited to find it.  The next thing I know my paypal acct was refunded the money with no explaination  just a note saying sorry.   The least you could do is contact the other person who you must have solid it to as well  and see if it was that important to them.  Extremely disappointed!!!", "rating": 1}, {"title": "i could not purchase both lamps at one time. system would not allow it", "text": "Problems in purchasing", "rating": 1}, {"title": "Bought many porcelains on this site and had to chases sellers to get pictures for purchased for record ? Sadly!", "text": "I don't buy much on this site anymore Spending money and get restricted !", "rating": 1}, {"title": "Several Problems.  Don't Do It !!!!", "text": "First, let me say that the return policy is ridiculous.  We had 3 days to return the 75 pound light fixture.  NONE of the lights worked.  NONE, as they are French.  We had to pay someone to change out all eight lights.That took some time because there were 2 different problems with the lights, necessitating two different trips to the hardware store! Furthermore, there was no canopy.  We had to purchase and paint a canopy before the fixture could be hung.  I'll have to try to sell it online.  Something I've never done before.", "rating": 1}, {"title": "Not happy", "text": "Never heard from the shop. Couldn't buy the product. Unhappy with the whole procedure.", "rating": 1}, {"title": "Swindler !!!", "text": "I was cheated and I've lost my money.", "rating": 1}, {"title": "Lost payment", "text": "Made payment for item thru pay-pal. Then waited for item. One week later I was informed that I had not made payment, even though I had the receipt and the item was not shipped, missing my wife's birthday. Even though I e-mailed Ruby Lane they have not responded. I contacted the seller for help and still have not received the item. Am canceling the credit card payment.", "rating": 1}, {"title": "Making an offer", "text": "It very hard to make an offer on your site... I tried for 15 minutes... It should be that way!! I never could see the numbers I was typing for the offer I was making. This is horrible... I was trusting that their would be the next step ... Where I would see and accept the offer I was making!", "rating": 1}, {"title": "Disappointed...", "text": "Never heard from the merchant...do not know if I am receiving merchandise or not.....", "rating": 1}, {"title": "Did not receive described item", "text": "Prompt delivery but item was not what was described in the shop I wanted sapphires but got Oryx very disappointed!!!!", "rating": 1}, {"title": "No guarantees", "text": "Ruby Lane does not offer any recourse if a seller chooses to defraud you.  I purchased a fairly expensive item.  The money was transferred.  I never heard from the seller.  Ruby Lane opened a complaint and determined that he had not responded or sent the item.  They said that they were unable to do anything.   I lost my money and the seller is still selling items on the site.", "rating": 1}, {"title": "came on time was exactly what was described", "text": "Was fine experience got what I wanted", "rating": 1}, {"title": "No feedback from a question sent b email this morning, couldn't complete purchase.", "text": "See title above", "rating": 1}, {"title": "Rose Hill's lame and dishonest excuse for cancelling my purchase", "text": "I just found out sellers get to choose what comments will be posted on their Lane. Who would post negatives? Do you know what certain sellers do when they want to cancel a purchase without being penalized by RL?  They lie about what happened to your item. This one is especially insulting. Her elderly aunt dropped my 30inch bead necklace, stepped on it, and turned it into dust. Darn, she was forced to throw the item in the trash. Did you find out it was worth more than it sold for? Did a family member or friend decide they wanted it after it sold? Once again I have been shafted by a greedy, dishonest and unethical vendor who really doesn't care about disappointing a customer. Shame on Rose Hill!", "rating": 1}, {"title": "HORROR!", "text": "I have never had so much trouble making a purchase. I would never consider selling on Rubylane. I sell on Ebay and Etsy. I have struggled to make this one purchase for a week already. I will never attempt to buy again on Rubylane. I need this part that I cannot get elsewhere otherwise I would have given up already.", "rating": 1}, {"title": "wasnt as discribed.", "text": "was a children size oriental bowl and tea set. nothing was discribed as very small. paid a large price for it. very discouraged.", "rating": 1}, {"title": "Atrocious transaction & customer support", "text": "Honey Shrunk the Kid!\r HoneyandShars gave me my worst buying experience by far in 50 years. It was astounding, absurd, atrocious--meat for Stephen King. I found an antique doll in the HoneyandShar shop on the Ruby Lane site. Due to its skimpy description, I emailed for more detail. I received an uninformative two-word response. Knowing from this I should vamoose and  look elsewhere for a doll, I chose to pursue this one because I was buying it for a terminally ill friend who had seen it online and admired it. So I emailed again with several very specific questions about its condition, including the valuation of the doll since it was 3 times more expensive than others I had seen. The answer: the doll is 26\" and the largest made in this model and the price reflects size and rarity. Huh? The doll was listed by the seller as 22\".  No, says seller. It's 26\"--she is looking at it and just measured it. Now I ask if fingers are missing which I thought I detected in the photo. Response: no fingers missing. I send proof. Seller says, Yes, finger is missing. \r  EEEK. Now I am looking elsewhere and find a similar doll on Ebay. Then I notice it's the same seller. By now I am desperate to make this work out for my friend, and have a sort of morbid curiosity about these sellers. So I enquire as to how this doll compares to the other. Answer: \"It's just another doll.\" Scout's honor. That's the direct quote. OK. Now my Sherlock Holmes and Sigmund Freud multiple personalities enter the quest. Seller sends me photos of dolls together, again stating their sizes as 26\" and 22\". Yep, the original doll is much larger, more lifelike I think. And this is the one my friend loves. So I do the unthinkable. I make an offer for the Ruby Lane 26” doll. (All this seller's listings  invite offers.) Doll is priced at $1200; Seller won't budge beyond $1050, reminding me of its rare 26\" size. I do the unpardonable. I buy it. Welllll, I try to buy it. Turns out the seller doesn't know how to invoice through the Ruby Lane site. Insists I simply send her the payment directly. Uh, no. I don't think so. I explain several times I want a Ruby Lane sanctioned sale (and the safety of its return policy!) After a total of 12 emails in which I explain to the seller how to invoice her sale, she can't do it. I contact Ruby Lane. RL says no prob. Send it to her. It was listed on our site. You are golden. Okeydokey but don't you guys think it's a bit odd for one of your experienced sellers? And by the way, the doll is still incorrectly listed as 22\" on your site. Wellllllll ya know, says RL, a different team would handle that.....  \r I PayPal the money. A day later no acknowledgement or receipt, no PO or tracking number on my RL account. I send the 33rd email (I actually counted them wanting to track my spiral into insanity). Oh yeah. She got it. Packing this big beautiful girl now! I confirm head will be removed and stuffed to protect eye rocker. Nope. No need, 30 years in dolls.......  By now my migraine prescription is running low so I don't argue.   \rAND NOW. The finale you readers believe I so deserve for my stupidity.  The doll arrives. I open it. I oh so carefully unwrap it with trembling fingers to find a 22” Ruby Lane DOLL. \rA 22\" doll with a split arm and wrist and a 1\" square chink of loose composition in the wrapping. (One of my emails asked if the composition issues were surface or deeper split and cracks. ) A 22\" doll with multiple fractures AND one eye frozen at half mast with the upper half chipped paint. How's that 30 years of expert packing working out......?  Back to the email. All the lurid details. Many photos. Doll with measuring tape. Seller's leisurely  response: \"I'm sorry you're not pleased. You can return her and I will refund you if she's in the same condition I sent her.\" No explanation. No apology. No reference to blatant misrepresentation. NADDA Nada. And does anyone see another snake head poking up through the \"same condition\" clause? She will cover the return shipping (IF the doll is as sublime as it was when it left her) because that's just the kinda gal she is. I now have a 3 day return window. I contact Ruby Lane to be sure my tees are crossed. Alphabet soup. Customer service guy Mark quotes me the RL scriptures, tells me it's been turned over to another team member HIKE (who turns out NOT to be Peyton Manning), he Mark can't help me cuz the ball is not in play yet, and this is another golden nugget of a quote: \"Oh my, I can't find the sale on your account!\" Several minutes ensue in which I explain to Mark exactly where and how he can find that information as I am staring at it as we speak. No can do. Mark is offended and rude when I gently ask if I might speak with a supervisor ( preferably someone who can access their accounts.) Now another CS member suits up and he verbally spanks me for not memorizing the RL scriptures, reminds me it is Friday afternoon and I'm not the only one with needs. He clearly wants to begin his TGIF and assures me yet another team player will contact me. I remind him I am calling because I want to abide by the rules but need to speak with someone about what happens when their illustrious seller does NOT refund. I'm told it's buyer beware. Contact Paypal. OK but exactly HOW should RL customers be responsible for detecting misrepresentations of sales items, and doctored photos in the listings? No answer except we'll look into it. That was a week ago. As of now, the listing has not been corrected, and Sonny and Char are  still \"selling\" and singing \"It Ain't Me, Babe....\"\r Finally the seller agrees to pay for return shipping given the circumstances. After I carefully repack the doll and ship it, I email the seller the tracking number and a reminder of our agreement that she will refund the return shipping. Response: \"What makes you think I would pay for return shipping?\" Now I KNOW I'm being taped for \"What Would YOU Do...\" I forward her e-mail of the previous day, and she remembers. The doll has now been refunded, as have shipping costs. I suspect RL's \"WHASSUP? note may have had something to do with that. Just saying……  \rIf you are into torture chambers and insane asylums, check out this shop. And if you are interested in shocker dolls in deplorable condition at very high prices, run don't walk.", "rating": 1}, {"title": "Tried emailing to complete a transaction due to credit card block and nobody is responding!", "text": "Terrible!....I'm trying to complete a transaction and cannot get a return call from anyone!", "rating": 1}, {"title": "Not user friendly", "text": "Unfortunately there is nothing easy about your site.   Your shop owners are wonderful and respond quickly and professionally.  Your website is another story.  It is not mobile friendly and not user friendly.  When using on a mobile, areas of the site just don't work.  How do you create a purchase order?  You can't, adding items to your cart should create a PO so a shop owner can add postage.   All in all your site makes it an unpleasant experience.", "rating": 1}, {"title": "Web Site & Ordering", "text": "This is the most difficult site to order from that I have ever encountered.  Even after chatting with a rep I still could not order two of the same items.I would fill the form out and when I submitted it the info would clear and I had to do it a third time.  This included my password.  I still never was able t order two of Purchase Order #4200335.", "rating": 1}, {"title": "Closed My Store Late 2015 & Cannot Have Access to Any Sales Summary or Records", "text": "I closed my store August 2015 due to lack of sales, declining sales and no actual way to correspond with a live person over the phone with questions, concerns or comments. I now need my store's sales summary for the 2015 tax season but unbelievably I cannot access any records. Sellers need to be made aware..up front, that if you open a store, conduct business & then close your store, everything you've sold or done will be wiped within 24 hours. Funny, how I can access any purchase history for any legitimate company for at least a year and some for over 5 years and download all the history & invoices...but, I can't access my sales from this website for more than 24 hours after closing before its wiped off the map. It doesn't add up. Disappointing to say the least and maybe people should be very leery of signing up. To me, that is a poorly run business with serious flaws. I will never recommend them to anyone.  No stars and 2 thumbs down. DO yourselves a favor, buy somewhere else and find another site to sell on, anywhere but here....\r Your feeble reply is nothing less than another set of 'Quotes from the Ruby Lane Scripture's' as usual...and as for \"prominently\" posted...I wouldn't have the need for writing this review if it was indeed \"prominently\" posted...and personally, only having a mere 24 hours to print all store records of sales, invoices, fees, payments, disputes, returns, inventory, statistics, tax records and any & all pertinent information necessary is illogical..especially for stores opened for over a year. Some stores have been open for over 8+ years yet only 24 hrs to retain any info for all those cumulative sales is insulting.", "rating": 1}, {"title": "Can't trust Ruby Lane", "text": "A dealer sold me a bracelet that was advertised as authentic. A jewelry appraiser said it was a composite piece and valueless. When I complained to Ruby Lane, they responded \"Please note that our Terms of Use of our site do state that we are not involved in the actual transaction between Buyers and Sellers and that we have no control over and do not guarantee the quality, safety, authenticity, value, or legality of the items advertised on the Site by Sellers. Ruby Lane has no liability for the success or failure of your transaction and cannot guarantee its success. \"\rIn other words, they don't care if their dealers are cheats.", "rating": 1}, {"title": "Use eBay checkout methods", "text": "You should really make it a lot easier to check out. I just about cancelled my order because of the out dated method you use to check out. Probably will not use Ruby Lane again.", "rating": 1}, {"title": "Sold out from under me.", "text": "I purchased an advertised item and then was advised that it had already been sold.  This is poor business practice and I won't be using this site again.", "rating": 1}, {"title": "confusing web site - frustrating experience.", "text": "I just put in a bid for a ring - the offer was accepted but I have NO idea on how to complete this transaction. I don't recall putting in a password and therefore I am unable to see this transaction and follow through with this payment. The link from my email should go directly to the transaction to complete it. I guess I will have to call this shop owner to figure this out.", "rating": 1}, {"title": "I am bleeding money", "text": "I  have pretty much the same items as some other  shops..I buy low so my prices are low.\rNothing.\rI'm closing my shop", "rating": 1}, {"title": "Terrible website...", "text": "Who still uses PayPal?  Please upgrade your website from 1999.", "rating": 1}, {"title": "It pains me to give Ruby Lane a bad rating because of one shop.", "text": "I sell on Ruby Lane, so it bothers me to give a bad rating because for the most part Ruby Lane is a wonderful marketplace where caring and concerned venders want customers to be happy. \rMy very bad experience starts with a purchase from  \"Fantasy Costume Jewelry\" and owner Pauline Jones (Baluski). I bought a dress clip on Dec.2nd and never heard from the seller. I contacted her on the 5th to ask for tracking information because she advertises she ships next business day. Her reply on the 5th was \"Hi I was going to ship today was waiting till the end of the sale and do all the shipping at once\" She didn't ship till the 7th. \r It arrived on the 11th and not only was it not as described, The description said it was Rhodium Plated and it was actually Pot Metal, but it had obvious replacement stones as they were not all the same color shade, also a stone accidentally got glued into a crevice upside down! That alone was enough to make me want to return the item, but I was heartbroken when my dress clip arrived broken and obviously on purpose. The clip had been pried loose in such a way as it could not be repaired. Fortunately I videotape opening packages from independent sellers such as this as these things can happen. It would have been a \"she said, I said\" situation otherwise. I feel this woman knew I would want to return it once she found out I was also a dealer and hoped to deny my claim.\r When I went into my purchase order to ask for return instructions the sale had already been completed before it even got here! I finally got her attention and a reply when I told her I was going to bring RL into this situation to mediate and show them the video.\r The only good thing I have to say about any of this transaction was she did give me a prompt refund and refunded my shipping as well. Which in my opinion was too little too late.  Badly handled from start to finish, I suggest caution to anyone that may want to purchase from this shop.", "rating": 1}, {"title": "FRAUDS:The Geffner Girls Antiques", "text": "I have used Ruby Lane for years and have great experiences.  Then I ordered an item from The Geffner Girls Antiques..EKKKKKKK.\rThe product was not what was advertised, I returned and requested a full refund.  I worked directly with Ruby Lane to assist me.\rIt took forever to get my refund and when the check came, it BOUNCED for insufficient funds.  \rSeriously, the owner is a complete fraud!  Still waiting for my money!!", "rating": 1}, {"title": "too much grief", "text": "Tried to place order for overnight delivery for a friend. Could not get it done with vendor. Wasted time", "rating": 1}, {"title": "Seller ignored shipping address, sent to billing address", "text": "I ordered an item from a seller and carefully confirmed with her that it would be delivered prior to Christmas.  I entered my billing address and a separate shipping address as per the options on the (not very user friendly) Ruby Lane web site.  I submitted my payment via PayPal.  My invoice clearly lists the shipping address, but the seller informed me that she just prints out a shipping label from the PayPal account, i.e., my billing address.  When I called her, she was very blase and suggested that I try calling my local postmaster.  Other than that, she didn't seem to care and didn't take any responsibility for her mistake.  I am extremely dissatisfied.  I have to scramble to find a new Christmas present.  And I will never use Ruby Lane again, as it appears that there is no communication or coordination between Ruby Lane and its sellers.  This is an amateurish operation.", "rating": 1}, {"title": "Inadequate", "text": "Impossible and totally ignorant programming of website.", "rating": 1}, {"title": "New seller has yet to learn customer service skills.", "text": "Will never purchase from that seller again. I have been shopping Ruby Lane for years and have never been so totally ignored. This seller should be removed from RL?", "rating": 1}, {"title": "hopefully no more purchases", "text": "NOT A GOOD SITE TO BUY FROM", "rating": 1}, {"title": "Ordering is Very Confusing", "text": "I selected an Item--as opposed to just ordering, you required me to open and account--why.\r Then after I did that - and entered a credit card, which was approved--you then tell me that the \"seller\" will contact me separately for payment instructions.  But I just gave you a credit card--why do I do it again with the \"seller\"\r I just want to select an item--give you an address and credit card and have it mailed to me.  You make this way to confusing", "rating": 1}, {"title": "Very confusing", "text": "When I went to make a purchase I wasn't able to put in my card number.  Only took my address.  Not sure if thw y somehow got a card number from something else.  Set up my account with address. Now it says I made a purchase. Not sure if my accounts are secure.\rVery confusing!", "rating": 1}, {"title": "Totally Unacceptable", "text": "I made a purchase for over $1500, and per the Ruby Lane disclosures and user agreements, I had to agree that when I hit \"purchase\" I was committed to buying the item. My credit card was charged and then about 3 hrs later the vendor contacted me and said the owner decided to sell it to someone else. They did refund my credit card. However, once I commit to buy the seller needs to commit to sell. This seller was Deep in the South Primitiques and they should be removed as a seller on Ruby Lane since they renege on sales contracts!!!!!!", "rating": 1}, {"title": "Ruby Lane is a cumbersome, unsatisfactory shopping site.", "text": "When I search, too few items show up at one time. Too many sold items show up. Too many listings for doll furniture and doll accessories show up during just about every search. The look of the site is dated (despite your attempts at improvements) and it's also time-consuming to navigate. For antiques shopping, Ruby Lane is my last resort.", "rating": 1}, {"title": "Sometimes seller is not reliable", "text": "Most sellers are reliable but I met a trustless seller for the first time in my 10 years dealer life. I bought a pin in Sunnyside Farms Antiques but it was broken.So I e-mailed the seller and she agreed about full refund. I returned with EMS.I asked her to refund after I confirmed item was delivered safely because of tracking number.She said she started procedure to refund and I would receive in a few days.But I didn't receive even in a week,so I called PayPal and they said she did not take any procedure.I don't know if the seller took a lie or had some reason but it is truth she sold broken item and didn't refund. \rPayPal will get my money back from her forcibly .", "rating": 1}, {"title": "Not happy", "text": "Not happy, purchased a ring and offer was accepted, was told she had been working at two stores and would find out next day if it was available, Next day was told that she had been in hospital and hadn't kept up with sales and the ring was previously sold. May not use your site again\rSteve Moresi", "rating": 1}, {"title": "Seller misrepresented item and will not refund", "text": "The site polucy is you have 3 days to return an item.  Seller can ship item at any time and some sellers are quite slow to ship larger items.  If item is delivered when you are out of town you basically are at mercy of particular seller. And as you have no way of knowing when item will arrive you have zero protection.   Recently I was sold an \"oil painting\". which was in fact a print on canvas with a few areas painted.  A colorized print in other words.   Because of 3 day deadline I was told  no recourse.  I will no longer br purchasing items on this site and I will be contacting my credit card company to file a complaint.", "rating": 1}, {"title": "Would like to have given Zero stars but wasn't allowed to.", "text": "This web site was dreadful. It kept falling out and I will not use it again. I have no idea if or when the gift I bought will arrive and if it hadn't been asked for especially I would not have bothered. An amature set up.", "rating": 1}, {"title": "Cancel order", "text": "Tooo complicated", "rating": 1}, {"title": "Buyer Beware!", "text": "This review is regarding item # 14KSPB003\r This was my first purchase with Oddities and Antiquities through Ruby Lane so I chose a piece that came with an appraisal since pictures\rof jewelry can often be an inaccurate representation of the actual piece. The five stone channel set princess diamond band I purchased was stated to contain 1.16 carat weight in diamonds and a total gram weight of 5.2.The ring arrived promptly and I was excited to see it after viewing the lovely pictures online as well as the posted appraisal. First I took out the appraisal which turned out to only be a fuzzy hardly readable photo copy with the bottom seal cut off.  Then I opened the box to see a pretty ring but seriously questioned the carat weight of the center stone. Then I removed the ring from the box and it didn't appear to have the heavy gram weight stated in the description. This was a Saturday and a local family owned jewelry store I deal with was open so I took the ring down there just to see if my concerns were valad. The jeweler tested the diamonds as real and proceeded to measure the stones with a jewelers caliper. That's were the inconsistencies between the appraisal and the actual ring started. \rItem # 14KSPB003\rWas said to contain a center princess diamond .43 carat weight\rJeweler measured  stone at .31ct.\rPrincess diamonds on either side were stated to be .21 on one side and .22 on the other.\rJeweler measured stones as .18 each\rPrincess diamonds on outside were stated to be .14 and .16.\rJeweler measured stones as .13 each.\rThis may not seem like much of a difference but on the center stone alone, the focal point of the ring that's a 12 point difference.  That's taking the stone from almost a half carat (50 pts.) down to a third carat (30 pts.)\rThat makes this certified appraised 1.16 carat diamond ring was actually only a .93 carat ring. The ring was .33 cts. less than claimed to be. That's over a third carat difference! In the world of appraised jewelery that's huge.The jeweler also weighed the ring at 4.43 grams. The description of the ring stated heavy 5.2 grams.\rBottom line there is no way that appraisal went with that ring.\rI brought my concerns to the vendors attention and she proceeded to get very defensive and called me nasty and arrogant and said she never should have sold it to me and that I had gotton a good deal and I knew it.\rThe ring may have been a good price , but it was not what it was stated to be.\rThat poor excuse for an appraisal wasn't worth the paper it was copied on!\rBesides being totally inaccurate it would never have been accepted as legitimate for  insurance purposes.\rThough some may not care about the  appraisal for their insurance company a certified appraisal is important when your buying online. It assures you your getting what you pay for.\rJust a word to the wise.\rBy the way I was on Ruby Lane today and this vendor has relisted the ring with the same original inaccurate information and inaccurate appraisal! Even though she was informed of all these inconsistencies, claiming to not know in one breath and in another email claiming to know jewelry! \rBEWARE!\rNo more business with Oddities and Antiquities!", "rating": 1}, {"title": "outrageous shipping costs", "text": "I am very disappointed that a seller requires a shipping cost of $35 for a $9 item!   In the interests of positive customer service, aAny respectable seller would gives shipping options / prices for the buyer to consider.", "rating": 1}, {"title": "My 2 PO was canceled for asking about shipping details...!?!?", "text": "I still can't believe that such thing can happened on RubyLane!? I have purchased from Ruby Lane before many times and I overlook back pictures, erroneous descriptions, no condition report, excessive shipping costs just to buy an items that looks good to me and know no problem return/refund Ruby Lane policy. But this time it was just totally unacceptable experience, unreasonable and rude conduct. I purchase 2 items from Robert Steffen from  The Steffen Collection.  I check the money order payment option. I email to Robert Steffen with 2 questions: where to send my payment and what is it Standard USPS shipping. I didn't get any reply so I call him. He said he can't hear me and can't understand what I'm saying. I told him that I have sent email with questions. He said he is going to look!? (he can hear me and can understand me) . He said he will email payment address. I ask what is Standard USPS shipping and he said its land shipping and may takes 2-3 weeks!? One of the item is crystal bowl and its weight 10 1/4 pounds. I told him that I would like to ship this item by 2-days Priority Mail. He said its very expensive. I just look at USPS shipping calculator and it was $43. I told him that and said I have no problem to pay this costs. He said no its much more then this and this is to complicated and email this request to him. I email this request to him and ask to re-issue the purchase order and include all details and I will send my payment. This is what stated in Ruby Lane email to me \"The shop owner, not Ruby Lane, will contact you shortly to confirm this Order, explain any Shipping/Handling, Insurance or Sales Tax, and to make payment arrangements.\" After that he send me $95 total for shipment and no details. I email him and ask for details. I went to look for some details and when I click on links to items I find that both orders are canceled and items are relisted and no any notice to me. This is really unprofessional.", "rating": 1}, {"title": "Don't buy from Marzilli Vintage", "text": "Bracelet they sold me was repaired and scratched my collector friend who has been so for over 30 years. Francis claims this is how the bracelet was made, however Native Americans will lay silver horizontal over the wrist and repair was vertical. They promised to pay return postage and did not. They ripped me off for around $10. They are dishonest dealers.", "rating": 1}, {"title": "Delighted with my find, but very frustrated with website.", "text": "Website too difficult to navigate, confusing, frustrating.", "rating": 1}, {"title": "dirty with hair", "text": "Purchased a pretty powder box with puffs as a birthday gift. The box was dusty and the puffs had hair. I was disappointed and embarrassed and did reach out to the merchant for a fix to this ordeal. What a shame I deed.", "rating": 1}, {"title": "I HATE your site", "text": "I've spent the last 45 minutes trying to buy something from your site. I don't shop here often so I didn't remember my password. Every time I'd click \"Forgot password\" I'd click on the link that was sent to my email to reset my password. But that link brought me to your sign in page. The same one asking for my password I couldn't remember. This has happened before to me on your site (and only your site). If you didn't have such good sellers I'd never shop your site again. I finally remembered my password (try enough things and sometimes you get lucky). I had already paid for the item via PayPal through the seller's website (although using the RubyLane item number). When I \"purchased\" the same item through your site (when I was finally able to log in) I indicated I'd pay by check. I HATE rubylane. There's no one to contact on your site and your site doesn't work.", "rating": 1}, {"title": "WASTE OF MY TIME", "text": "I was following the prompts to make a purchase which was a complete waste of my time as at the end of it all I was advised that i could not ??????? No explanation was given as to why.  Later I was even thanked for my purchase and asked to write this review!!!!!   Strange affair!", "rating": 1}]