[{"title": "Unreliable", "text": "Waste of money and unreliable. Too expensive!I gave information that my document was to be used in a specific country!My document was notorized by a lawyer in a country that the document is not valid for use. I was asked to pay again for notorizing the document by another lawyer so that it was approved in the country that the document was going to be used!", "rating": 1}, {"title": "Unfortunately not a good experience", "text": "Unfortunately, I didn't have such good experience with e- residence. The service is far too expensive! The documents were wrong (my date of birth) and it was a lot of effort to request the correct document again… But the price for the Service with this kind of circumstances is much to high. ", "rating": 1}, {"title": "This has been the absolute worst…", "text": "This has been the absolute worst customer experience I've ever had. They don't explain the process before you submit the form; they're only quick to charge you money. Even after application submission you don't get a confirmation or explanation of next steps. I had to wait for my appointment for 2 months, which was booked 2 hours and 3 train rides away in another town. The day before the appointment, I noticed that they applied for the wrong thing. When I contacted them, they said there was nothing they could do. To sum it up, I lost 2 months and made two payments for the wrong NIE. I strongly advise staying away from them; they have no idea what they're doing.", "rating": 1}, {"title": "Waiting for 5 plus weeks for my Finanças…", "text": "Heading into week 5 and waiting for my Finanças password reset and then they had to reapply,Should only take 7 to 10 business days .  Now I will probably have to fly to Portugal from the States to get this done .I am referring to the password to access the Financas website not the NIF application .In their response they refer to the initial NIF application . That is a smokescreen .  This review pertains to the password which is essential to registering your address as part of the residency process . I paid them seperately both fro myself and my wife   . She has not received hers either . You cannot apply for residency without accessing the Financas website to register your new address .", "rating": 1}, {"title": "I paid 350 euros to schedule a tax…", "text": "I paid 350 euros to schedule a tax consult with e-residence via their web page. They sent me Google Meet link. I logged on at the scheduled time and no one was there. I wrote to their customer support line by Whatsapp and no one responded. I am extremely disappointed. This is a ghost service and a fraud. I will be contacting my credit card company to block payment to e-residence.", "rating": 1}, {"title": "Scam company", "text": "Scam company. I used them to get a tax number/attorney representation for potential home purchase in Portugal. The service should have only been for 1 year but they hid in small writing that the fee will be renewed each year unless I appoint a new tax representatitive in Portugal. Now that the golden visa program has been discontinued, they continue to charge me a \"subscription fee\" and refuse to cancel it since I have no need for a new tax representative. Pathetic they need to do this to make a living.", "rating": 1}, {"title": "I was Bouth NIF and Bank account…", "text": "I was Bouth NIF and Bank account service. after 3 months the bank send an email they did not get my id and Utility bill. i ask them and the bank Manager update for this information they told me they already updated some days after I got notified and my account got closed, They just wasted my time and money.", "rating": 1}, {"title": "Not recommend", "text": "On 26 October, I paid for the issue of a NIF number for my son. I chose to issue it in 5 days.It has been 3 weeks (more than 20 days), NIF is not done.I have sent the child's birth certificate twice in English (!), the manager writes in Whatsapp that the document needs to be translated into English. This is a silly thing to say. I have done NIF for myself and my wife with this company before, but now I see that the company fails to handle objections and basic function. I don't recommend", "rating": 1}, {"title": "Very poor customer service.", "text": "Very poor customer service.I have requested both my NIF and NISS through them and in both cases, the experience was rather expensive and soon regrettable once in touch with their customer service. On top of that, they got my NISS wrong creating severe issues with my employment and not being clear if I ever will get a reimbursement", "rating": 1}, {"title": "Document had someone elses details on…", "text": "Document had someone elses details on it, took about a week to fully correct. Whatsapp is better for communication than email. I would not use the service again", "rating": 1}, {"title": "Don’t open bank account with e-residence", "text": "I contracted E-residence to open a bank account for me in Portugal. While I understand that Portuguese banks have their procedures to verify the information, the process has been confusing and frustrating to say the least. To make matters worse I have just tried to use the bank app and was informed that the bank account was canceled and the money that was in the account disappeared. No communication about any of this was provided to me and it’s impossible to talk to the so-called bank manager ( I am fluent in Portuguese!) E-residence I need an immediate solution to this problem and my money to be deposited in my US bank account. Or are you in the business of stealing money from your clients?", "rating": 1}, {"title": "Paid 10days ago and so far no NIF", "text": "I paid 10 days ago for 10days subscrition, and so far no NIF, the only response i get  is \"Your NIF is in process now\".I am praying, so i can may have it within next 2 days, to move my other processes holded by this NIF.", "rating": 1}, {"title": "Paying 70€ I just got the forms I need…", "text": "Paying 70€ I just got the forms I need to print and fill in and bring to the police office. The same application forms I can get at police office for free! What a SCAM this e-residence.com!!!", "rating": 1}, {"title": "Worse ever", "text": "Worse ever. Yes, they sent me the NIF pretty quickly. But then everything after that is a nightmare. First, there was a ton of confusion there about my password and I had to beg them to communicate with AT to produce a password for me. Finally, weeks after when they sent me the password, it turns out they had sent me a password of a completely different individual!!! Stay away.", "rating": 1}, {"title": "They will set up a subscription in your payment method", "text": "They set up a subscription on your payment method, then it turns out to one year later they make you sent a bunch of emails and forms to cancel the representation otherwise they will keep charging you 100 eur", "rating": 1}, {"title": "do it yourself", "text": "promissing a nie nr within 3 weeks. they will keep you on the hook for weeks.i requested 14 of march 23 and they kept promising an appointment at a police station had been booked, today 10 of april 23 again a message that appointment has been made for 28 april 23?requested for a refund, which was rcvd a couple of days later. i have applied myself, you require a Spanish tel nr to reach the booking site and git appointment exactly 2 weeks later.for completing the required forms and amount of copies and passport pictures etc see the links available internet when google for \" how to complete NIE forms\"the required fee was less than 10€ Documentation required to apply for a NIE at the Consular Office EX-15 standard application form (original and one copy), completed and signed by the applicant or representative.The form should preferably be completed online and printed.The application form must indicate the economic, professional, or social reasons that justify the NIE application.Original of the applicant's valid passport and a copy of the passport's biographical data page.Nationals of Member States of the European Union may identify themselves with their identity document (original and one copy, front and back).If the application is presented by a representative, only the certified copy of the document should be provided.If the applicant is a minor or is incapacitated, a copy of the family record book or the birth certificate or the guardianship document must be presented. In addition, the valid passport or ID of the parent or guardian must be shown.or the birth certificate or the guardianship document must be presented.Document proving residence in the Consular area.Form 790, code 12, duly completed, and payment of the corresponding fee.In 2021, the fee is 9.74 euros.", "rating": 1}, {"title": "Spent a fortune and sent me wrong…", "text": "Spent a fortune and sent me wrong documents that I couldn’t use ! And wouldn’t refund me !!!! ", "rating": 1}, {"title": "I did the procedure through e-residence…", "text": "I did the procedure through e-residence in hopes to speed up the process but it ended up taking 40 days for the NISS number to get ready and for the high price of the service I expected more since filing for the NISS on my own is quite simple and straightforward.", "rating": 1}, {"title": "Cancelling subscription is overcomplicated", "text": "Overcomplicated process of cancelling tax representation service. I've already cancelled their tax representation service in tax office, but they willing to charge me for this (obviously, impossible-to-provide) service. Also asking documents containing PII \"as a proof\". Nonsense.", "rating": 1}, {"title": "The worse immigration lawyers in portugal, rude and unprofessional", "text": "E residence is unprofessional and rude. I will not recommend them to my worst enemy. I have worked with them for over 2 years trying to get my residency and still have nothing.I paid them 5000 euros to help my wife and I with residency in portugal. When they finally got me an appointment i asked on whatsapp what documents i need and they replied passport only ( i have screenshots to prove this) then a few days before my appointment i contacted them again only to be told i need a whole list of documents. I told them that there is not enough time now and why did they tell me on whatsapp all i need is my passport.They were unapologetic and rude and  told me its my responsibility to know what paperwork i need not theres, so i must stop blaming them. Since i couldnt get my docs in time they agreed to get me a new date. After more than 6 months of waiting i reached out to them on whatsapp and asked what the impact would be of me hiring a second lawyer  to help me get an appointment would be, they did not respond. I asked multiple times and got no response. I have screenshots to prove this. So i went ahead and hired a second law firm to get me an appointment. The new law firm got me an appointment within one week ( e residency claimed they were trying for more than 6 months) When i informed them that i got an appomtment at the SEF and can they please assist me, they told me that they are unable to help me. I asked for a reason and they would not provide it to me. I asked to meet with them on zoom and they refuse. I asked my proof of address that i paid them for and they said its expired. I asked them if they can get me a new proof of address and they just say sorry we cant help you. They flat out ignore me now. I have struggled for over 2 years with this law firm, they have been rude and very unproffessional. I am absolutely shocked at their treatment. Truly horrible experience. Im almost at 5000 euro loss and have nothing to show for it.", "rating": 1}, {"title": "Maybe they respond to a bad review...", "text": "This review is about a problem with my NIF. The company is aware of the problem but has not been able to resolve it for some 5 months now. For the past 4 months my messages have been ignored (no response whatsoever to my emails) and there is no other way I can get in touch with anyone to find out about the status of my problem and how and by when it is going to be resolved. It makes me sad to give a bad review to a company that has predominantly excellent reviews. If the company responds to my messages and resolves the problem, I may revise this review.I received my NIF within a few days after applying. I also received the respective password some weeks later. My last name is misspelled on that NIF (there is a letter missing, most people wouldn’t realize it) so I asked for the spelling to be corrected. That’s where the problems began. Instead of correcting the spelling of my last name, I was assigned another NIF (by another office and with a new fiscal representative), this time with the correct spelling of my name. But now I have two NIF’s and cannot be sure which one I should use, the one with the misspelled last name which I already used to open a bank account (and for which I received a password) or the one with the correct spelling for which I never received a password (it’s been 5 months so far). Additionally, since someone can have only one NIF, one of the two needs be cancelled, which has not happened yet.The problem with e-residence seems to be that the company really has no influence over the fiscal authorities. If there is a problem, they cannot solve it. They do not have insider access, a fixer, or some special way to make things happen. They must wait like everybody else for their requests to get acted upon. All of this would not be so bad if they communicated effectively (or in my case if they communicated at all) with the client. Even before they broke up contact, the communications were very short, bordering on rude, showing no empathy with the client.My expectation is that the company apologizes for the fact that they did not respond to my messages, that they listen to my preferred solution, that we agree on how to resolve this and by when, and that I receive regular updates along the way, and that they answer promptly any questions that may come up until the problem is being resolved.", "rating": 1}, {"title": "NIF was not accepted by the bank…", "text": "NIF was not accepted by the bank because it was partly handwritten and so provisionally.The bank didn’t accept.I hope you sent the official document to my home adres.Anyway : it means that I have to come back to Portugal to make this things in order.So: not happy with your (expensive) service.", "rating": 1}, {"title": "Waiting for NIF access for +2 months", "text": "I've been waiting for the password to access AT for +2 months. They never give me a time estimate and keep always saying it's coming soon.", "rating": 1}, {"title": "Simply unprofessional", "text": "Contracted company via WhatsApp 19.04.22, asking about opportunities and their services. First, they have auto response about paid consultations. Ok I do not need consultations, I need to find out about relative information on their website. Then I ask again and they replied with \"Hello\". And that is it. No response no communications. Simply ignoring the questions.", "rating": 1}, {"title": "Be careful about this product", "text": "Be careful about this product. The local lawyer in the company needs to confirm your taxes and it doesn't happen. This has give me so many complications!", "rating": 1}, {"title": "Company formation", "text": "The foundation of our company did not work out. In my eyes not complete and very tedious, foundation after 3 months nothing, very poor communication. NOT RECOMMENDED", "rating": 1}, {"title": "Late", "text": "Late, so I lost my lease - no proactive communication between the expected date and the date the NIF was actually issued, only received it when I followed up. What a joke.", "rating": 1}, {"title": "NIF Portigal", "text": "You should know that a \"subscription\" costs 100 euros per year. It was unexpected for me.", "rating": 1}, {"title": "Disgusted", "text": "Wasn’t happy at all - customer service so poor!", "rating": 1}, {"title": "DUPLICATION DUPLICATION", "text": "Date of experience: July 09, 2022", "rating": 1}]