[{"title": "Andy: poor customer service ", "text": "I had a coupon from a free bottle that i forgot to put in my cart. Andy gave me a hard time about sending it on so i had to refuse the delivery and place a new order for the same thing. I've given these guys lots of business over the year but boy have they gone down hill. They have so many competitors now I think this will be my last order from them.", "rating": 1}, {"title": "Buyer Beware, return policy is bogus", "text": "After many back & forth emails with slow replies from the company (also them dodging the issue hence so many emails) I found out that they do not accept returns on opened products that I am unsatisfied with and, in the last email from them, they advised me to consider ordering a free sample before making any future purchases. Something felt fishy with them not responding promptly and how they worded their emails. Their website states their headquarters are located in Chicago but I wonder if they are based in China.  This could be a Chinese supplement company with a facade of being an American company.  From the return policy to the faulty Chicago headquarters address, they whole vibe feels deceptive. Plus, I am unhappy with the products I received but they refuse to honor a return/refund. Yes you get an order sent to you but the legitimacy of the company and quality is overall sketchy. Buyer beware, not all is what it appears to be. ", "rating": 1}, {"title": "Sent it regular mail instead of courier…", "text": "Sent it regular mail instead of courier I paid a lot for and don't respond to support requests", "rating": 1}, {"title": "I never received my package.", "text": "I never received my package! And I've tried to contact liftmode multiple times and no response! I'm super pissed and I think I'm going to contact the BBB! ", "rating": 1}, {"title": "It has been nearly a week since I…", "text": "It has been nearly a week since I placed an order and the order status is still listed as \"processing\". I have sent multiple emails requesting updates on my order and have heard nothing back.Starting to wonder if this company has gone out of business and if I should be contacting my bank to get my money back..", "rating": 1}, {"title": "Same name different product…", "text": "It has been a few years since I’ve ordered Liftmode phenibut hcl, when I had it then. It was tasteless and I would take one or two serving before bed I would experience the most realistic dreams so much that waking up was going to sleep. Now that there’s been some change to the formula I haven’t consumed a single serving due to its different consistency, sour taste, and my doubtfulness of its new effects.", "rating": 1}, {"title": "Didn't receive package. ", "text": "My package was supposed to be delivered today. Took a little over a week though I hit the threshold for free 2-3 day shipping. Package wasn't delivered. Says \"delivered to parcel locker\" which we don't have. Pretty upset. ", "rating": 1}, {"title": "Never received package", "text": "Never received package. I reached out with several emails to liftmode and the last one was so unprofessional on their part. You don’t want to keep a customer using your site of several years? Fine with me. I have since filed a claim with usps. But I would consider hiring better people to reply to your emails in a professional way.", "rating": 1}, {"title": "I purchased phenibut powder from…", "text": "I purchased phenibut powder from LiftMode and received it pretty quickly. I opened the box carefully, everything looks well, but when I unscrewed the cap of the bottle containing the phenibut powder, I gagged, almost vomit, it emits a strong stench, it smells like a very filthy person spit on it many times. I would not ingest such a stinky and yuck and gross and disgusting phenibut powder, even though they have a test report. And even if the whole world doesn't sell phenibut powder, I would not buy from LiftMode either.", "rating": 1}, {"title": "Phenibut discontinued", "text": "They didn’t announce or let anybody know that Phenibut was going to be discontinued. This will cause many issues for users of this nootropic especially with side effects of coming off so quickly.", "rating": 1}, {"title": "I never received my phenibut", "text": "I never received my phenibut, it said it got dropped off according to the tracking but nothing was here and I watched for it the whole time. Can I please get a new one sent to me at my new address which I will know of here in the next few days?", "rating": 1}, {"title": "The wrong thing was sending me a review…", "text": "The wrong thing was sending me a review as if I received the product... I got my hopes up and went to the mailbox the day after receiving such email expecting to receive this product so I can have fun tonight... I already have low expectations after reading the horrendous shipping issue reviews and after realizing the product DIDNT arrive I got even more disappointed. Hopefully I can get the dang thing for the price I paid. Maybe I'll leave a better one after I get the product....", "rating": 1}, {"title": "Not the LiftMode I remember", "text": "Unwilling to contact me back. Before they were always on point, now they ignore you. Even though I’ve made half a dozen purchases before.Must be new owners. Either way the customer service is absolutely terrible now. Several emails sent without a response. The Trustpilot reviews are shockingly high in my opinion now as they don’t seem to care one bit about their customers with several prior purchases.Something fishy is going on with LiftMode. Never had an issue when Leo was around. Check out my prior review of LiftMode compared to this one. 5* vs 0* if I could give that.Also my antivirus considers LiftMode’s website suspicious now. And it’s the top antivirus protection you can get.", "rating": 1}, {"title": "Discontinued product", "text": "I've been a loyal customer for 8 years and they decided to discontinue the product I have been purchasing with no warning. When I emailed a month ago they stated they had no plans to discontinue. I loved Liftmode up until this point but a little transparency would have been nice.", "rating": 1}, {"title": "This is a review of the Kanna elixir…", "text": "This is a review of the Kanna elixir product only; I want to emphasise this as I find the people at liftmode to be nice. The Kanna elixir did not agree with me at all. Made me feel extremely depressed and gave me major heart palpitations, to the point where I needed to visit the emergency room. Kanna is not a product for everyone and can be dangerous (max I ever took was one dropper, so definitely on the lower end in terms of dosage). I’d like to see more done by liftmode to highlight the potential dangers of the product", "rating": 1}, {"title": "DO NOT ORDER IF YOU ARE FROM CANADA", "text": "DO NOT ORDER IF YOU ARE FROM CANADAHad to pay $30 for the cheapest shipping option. Ships through USPS and took almost 2 weeks to come, and I live somewhere popular. This wasn't including customs, it cleared in 2 hours. Just the slowest shipping speed possible. On top of this, the duties aren't covered under the shipping and had to pay $29 at the door. Just buy from a Canadian vendor unless you want to overpay by a lot.", "rating": 1}, {"title": "Minimal if any effect other than…", "text": "Minimal if any effect other than diarrheaResponse to Liftmode: thanks for the reply and offer for a return, but it has been thrown out. I agree that people can have highly variable and individual responses, but I have consistently had noticeable effect with Phenibut in the past.", "rating": 1}, {"title": "Fake phenibut powder.", "text": "I bought phenibut from liftmode. After taking it I went to emergency. My lips turned purple and my toes turned purple, doctors did a lot of things to bring me back to life, they told me I may have sequelae. Fake phenibut powder.", "rating": 1}, {"title": "Discontinued", "text": "Well, I’d give 5 stars because I love this stuff. I understand the concern, but if used responsibly, this stuff is fantastic and improves quality of life. But now I’m giving 1 star since you’re discontinuing it. What a shame.", "rating": 1}, {"title": "Phenibut review", "text": "I bought Phenibut to help with my insomnia. I have tried it twice and haven't noticed any help. There aren't any good instructions that come with it. I ordered the powder form and wondered how much water I should take it with, what time of day, and how much to take based on my weight. Google gives such a wide variety of answers its confusing and the Liftmode website lacks information pretty bad. It only warns of taking to much which is good to know but consumers need more information than that.", "rating": 1}, {"title": "Couldn’t even make it through your…", "text": "Couldn’t even make it through your website. Every time I put in my credit information, it would disappear and tell me it needed it again. I couldn’t even get past that part so I went with another company with my purchase.", "rating": 1}, {"title": "I've been buying phenibut for 10 years…", "text": "I've been buying phenibut for 10 years from you guys. Supply was drying up but phenibut F.A.A. was still there so I bought some. I asked Chet if you were discontinuing it. He said \"Absolutely not\", try back in a month. I came back and there's nothing. I ask Chet and he says yes, it's discontinued. Had he been honest, I would have bought a lot more while it was available. After 10 years, I would hope for some communication...like hey Brent, long time loyal customer, it's not looking good, get it while u can. Instead I got fed \"absolutely not\". Now I've been struggling to find anything I can out there.", "rating": 1}, {"title": "Hi Stim junky here", "text": "For a stimulant, caffeine junky like myself these provide whack energy. I can’t justify buying more. I have to take 3 to get a buzz I can use, and it feels janky, not smooth. I prefer straight up 200mg caffeine or other alternatives I can save $$ on", "rating": 1}, {"title": "Kanna 😕", "text": "I was expecting greater results, due to the great reviews concerning kanna. However,  this product did nothing for me, other than raise my heartbeat for 10 minutes, then subsided off into nothingness.  Wondering if there are other nootropics that may have greater results?", "rating": 1}, {"title": "Loved how fast I received product and…", "text": "Loved how fast I received product and using your website is great.I did not get anything from this product regarding any change in mood. It is basically caffeine and I was disappointed! Will not buy again, lesson learned that it was to good to be true.", "rating": 1}, {"title": "Phenibut Crystals don't work", "text": "Bought the Phenibut crystals and took the recommended dosage on the back of the jar and felt nothing, doubled the dosage once as it says you can take only 2 doses in 24 hours and still felt absolutely nothing. Waste of money. I guess that's what they mean when they say buy from a reputable company.", "rating": 1}, {"title": "package not delivered", "text": "Was very excited about my order since i’ve heard nothing but good reviews about this company but my package was never delivered. Very disappointing since it was claimed to be delivered but the cameras on my house show that the package was not delivered at the time it was claimed to be.", "rating": 1}, {"title": "It's now illegal in Alabama, due your research before buying sleep supplements from this company", "text": "I literally wrote to you asking about sleep supplements, vitamins! I was told that phenibut was and I quote from Leo \" Phenibut is our strongest SUPPLEMENT for sleep support\" I kept the email. I explained to him that I didn't want to use narcotic sleeping pills. I then find out, (which no told me)  that it's not recommended for human or animal consumption and its literally a drug that's being abused by people!!! Its also now illegal in Alabama!!! I would think that you would want to inform people of this rather then chase the Almighty dollar. It's simple, explain to people their options not send them something and then have them find out later. And do not tell me that it is covered on your website because I as a customer did my due diligence when I reached out to your customer service to begin with. To everyone out there understand what phenibut truly is!!", "rating": 1}, {"title": "I've been a customer since 2016", "text": "I've been a customer since 2016, i can no longer afford your crazy prices for phenibut. By the time it got to my door it was well over $300. I also have to pay a duty, were as before i didn't. I've found another supplier for much cheaper so F U C K LIFTMODE", "rating": 1}, {"title": "It is days past the estimated arrival…", "text": "It is days past the estimated arrival time of the package and no sign of it coming anytime soon. Super frustrating and they need to use a different mail carrier than USPS.", "rating": 1}, {"title": "I have been a long time customer and…", "text": "I have been a long time customer and have always been happy with lift mode even if the product is a little more expensive. I am very disappointed they are getting rid of phenibut. Especially without notice. A notice would have gone a long way. I feel like I won't use lift mode anymore but can't be certain. Before I was really happy with lift mode. We will see. People could die from a seizure due to being unable source phenibut.", "rating": 1}, {"title": "Over a month and no update on my order", "text": "Over a month and no update on my order. I tried reaching out to customer support and no answer.EDIT: Thanks for the reply nina but my emails are still being ignored and no update on tracking in 34 days.", "rating": 1}, {"title": "Have not received product: paid $28!", "text": "I paid $28 on Thursday June 1st to have it delivered UPS second day air and it is now Monday and I do not have my shipment, or the confirmation email with the tracking number that it has been shipped", "rating": 1}, {"title": "So far I’m quite disappointed in the…", "text": "So far I’m quite disappointed in the change in service. Historically, processing and shipping has been prompt and liftmode had set themselves apart with excellent customer service. But this most recent order has been unacceptably delayed without acknowledgement or apology. It may be time to look elsewhere for my supplement experience.", "rating": 1}, {"title": "I ordered 2 containers of phenibut HCL…", "text": "I ordered 2 containers of phenibut HCL fine crystals 200 grams and paid for two containers. I only received one container. Where is the other container?", "rating": 1}, {"title": "I paid for 2 day shipping and it's…", "text": "I paid for 2 day shipping and it's taken 5 days for my delivery. I've tried many times to communicate through the chat... It doesn't work.Tried emailing.... Doesn't work.Not cool", "rating": 1}, {"title": "Ruined product", "text": "Ordered 5 grams of Phenibut hcl but product came with the lid loose with the powder spilt everywhere. Ended up just tossing due to not wanting to injest unsealed product. Other than that, fast shipping.", "rating": 1}, {"title": "Phone number on bottle is not a working…", "text": "Phone number on bottle is not a working number, to start this complaint.  Says “Out of service”.   Paper work that came with the bottle is a scam.  I called number on that paper and they say they do not know any thing about product.  I asked for my money back as I DO NOT PUT ANY THING ON MY BODY OR IN MY MOUTH THAT SAYS MADE IN CHINA!!!!!!!!!!", "rating": 1}, {"title": "Amison Overseas", "text": "Scammer alert! Sent Bitcoin to order some ovér the counter meds. Prices seemed too good to be true. I should have known. They stopped all communication. ", "rating": 1}, {"title": "I bought phenibut powder from you to…", "text": "I bought phenibut powder from you to help me sleep. But after I took your phenibut powder, it doesn't help me sleep, instead, it makes me very excited and can not sleep, and my heart failure and beat more than 100 times per minute and palpitation, my voice become hoarse, my neck and face grow long, my toes become purple and very painful, I lost my appetite. The worst thing is I can't sleep, it makes my entire body failure. I am in danger now and may die at anytime. I know some Chinese evil spies found you, they made up bad stories about me and pay you, and ask you add poison in my phenibut powder. They want to use this way to kill me. Now I know why the shipment delayed, you were buying time for Chinese evil spies to put poison in my order. You helped them to kill me. You have lost your conscience. You will be punished by God.", "rating": 1}, {"title": "Liftmode stabs their customers in the back...", "text": "Liftmode (which is a goofy@$$ name to begin with-everytime I ordered from their I felt exponentially dumber ~ Which is funny bc some of the products are listed as \"smart drugs\".)They knowingly got countless people hooked on their drug \"Phenibut\" and then suddenly, with NO WARNING, pulled the product from their sales lineup. However, at least several months beforehand they reduced the amount you could buy from 1000grams down to just 5grams. Which meant if the addict needed 200grams... they would need to buy 40 - 5gram amounts @15$ per gram... would be 600$!!!!! Which normally would have been about 100$.They did this because Phenibut was the product they made the most money on and sold the most of. When they discontinue it their company will probably tank. They didnt care about their customers one bit - not even enough to give them advanced notice that they would no longer be selling it.Knowing these customers would go through excruciating withdrawal without doing a long taper... .meaning theyd have no choice but to buy all those 5 gram amounts or whatever they could afford. In the end making a killing in their financial  exit strategy. You should be able to give these ***********s NO STARS.", "rating": 1}, {"title": "Terrible Customer Service and No response to order!!", "text": "First order came ok, second order was placed on hold 3 weeks ago and no response to multiple emails and IG", "rating": 1}, {"title": "I've ordered plenty of stuff from…", "text": "I've ordered plenty of stuff from liftmode. Usually I don't have any problems getting my package. But it happened three times. I didn't receive my package the first time. And I messaged them and they said they would send another one. And I asked them to have UPS have someone sign for it the second time. But they it still didn't come the second time and nobody signed it. So my girlfriend called and demanded her money back. Because it was her card. And on  top of everything because of their mistake. They told us that they wouldn't sell anything to us anymore. This was not our fault. It was either liftmode or UPS that got it wrong. But they returned our money.but they actually blacklisted us. That's horrible customer service in my opinion. I'd give them zero stars if I could", "rating": 1}, {"title": "I placed an order Friday night", "text": "I placed an order Friday night, hoping it'd be shipped first thing Monday morning.... but nope. Still hasn't shipped and it's almost 3pm", "rating": 1}, {"title": "Did not receive package :(", "text": "USPS says package was delivered to sender because of an issue with the address but it was all correct on my end", "rating": 1}, {"title": "Did not receive package", "text": "Did not receive package. Customer service is terrible at their job. Will not use LM again", "rating": 1}, {"title": "This is an excellent company", "text": "This is an excellent company, I have been buying phenibut for years and I am very satisfied with their product and service", "rating": 1}, {"title": "Since they’re phasing out phenibute my…", "text": "Since they’re phasing out phenibute my order was horrific. They cut it with something and it was a waste of my money. I wish I could get a refund it’s not fair at all. Do not order.", "rating": 1}, {"title": "It had been pending for shipping for 3…", "text": "It had been pending for shipping for 3 days but hadn't even started the shipping process yet. What's going on?", "rating": 1}, {"title": "Correct info on product.", "text": "I called right after my order and asked if these vita’s were made in China?  I was told no. When I sat down to read the inserts they both said made in China.  I want a refund as I DO NOT put any thing on my body or mouth made in China. I will call about this on Monday.", "rating": 1}, {"title": "Not sure which kitchen in China this…", "text": "Not sure which kitchen in China this stuff was cooked in but this was the dirtiest substance I’ve ever put in my body. Complete body cramps and intense body aches. STAY AWAY FROM THIS!!!", "rating": 1}, {"title": "The site don't accept credit card For…", "text": "The site don't accept credit card For insternational payment only bitcoin but this form of payment doesnt work , so i can't purchase", "rating": 1}, {"title": "Missing items from order", "text": "Missing items from order. Still charged for items.Prior to my review I reach out to customer service", "rating": 1}, {"title": "send any of faa phenibut an only 5grams…", "text": "send any of faa phenibut an only 5grams of phenibut hcl not the 100 I ordered with next day air ups had 250mg 70 CT bottles times TWO", "rating": 1}, {"title": "The cs rep was rude", "text": "The cs rep was rude. I asked him to explain something and twice he said \" you would know if you listened to me.\" I wrote about this guy last week as well when I received this same email. He has no patience.", "rating": 1}, {"title": "Bought phenibut fine crystals", "text": "Bought phenibut fine crystals. I bought from them years ago and used to really respect them. 2 years ago, their phenibut was extremely potent. 2 grams used to work really well. I recently wanted to try them again for my birthday and even after taking 6 grams of whatever it is they sent me, all it would do is make me nauseous. Nothing. Else. I don’t care about the money or a guaranteed money back, I just wanted the same product I had years ago. This isn’t the first time they’ve done this as this happened to me last year when I stuck with them right before I was sick of buying bad stuff from them. So it’s been a year and I tried again for my birthday and nothing. Only thing I want to do is ward people off buying fake stuff, or stuff that’s really low quality. The fact that they are selling this means they care about the money when it’s coming in. I wouldn’t question their other products. They seem to have amazing ratings for everything else. But, hopefully this influences someone to be cautious buying any phenibut from them. This is just a comparison of what they used to sell, vs what they sell now", "rating": 1}, {"title": "Medication poisoned me", "text": "Medication poisoned me. Ended up hospitalized and I wouldn't risk this ever again.", "rating": 1}, {"title": "No plastic seal this time and cm low…", "text": "No plastic seal this time and cm low every other time its almost to the top not happy this time at all feel rip off another of scoops missing for now on I'm going to record me opening package and if happens again going to have to look else where was very happy with product and company until this purchase", "rating": 1}, {"title": "Purchased a few weeks ago and now the…", "text": "Purchased a few weeks ago and now the price is $15 less, very annoying.", "rating": 1}, {"title": "I asked to return product and get a refund.", "text": "I asked to return product and get a refund three times and I never got a response.", "rating": 1}, {"title": "UPDATE!!", "text": "UPDATE!! I'M using my review, or actually just updating due to their reply. Let me just say first that I have never dealt with this company prior to this incident. Now with that being said, I'm just confused at to why they got so upset enough to end their relationship with me, that mind you hadn't even started yet, but they said I sounded like a risky customer. I don't even know what that means!!?? Yes, I did get very upset that my delivery wasn't shipped on the day it was supposed to be, but that's only bc I was leaving to go out off town for 3 weeks and I used my sis in laws card to pay for it, and she would be pissed if she got a package after I had left, I was wrong on that part, but I've surely to get already saved she said she got a refund from them today, which they did say they were gonna do. Also, I do want to say they even sent the package, even after refunding, bc she got it off the porch, it has my name on it, so that has to be what it was bc I haven't ordered anything else. So, that was really nice of them. I'm updating this review for a few reasons and I just feel like we had a huge misunderstanding and I feel awful about the whole thing. I am looking forward to trying the stuff I ordered, my sis in laws sister told me about it and said it is very helpful. I apologize to Liftmode for this misunderstanding!  OLDER REVIEW!! 09/29/2023 I'm not happy! This is the first time I ordered from this company. They have lied to me, and they responded once to my email. They promised my package would be shipped the very next business day, it's been 2 days and ups is claiming they haven't received the package. Liftmodes shipping email actually said they shipped it in the 3rd of October, but they promised it would be the 2nd. I've explained to them that I was at my brother's house and have to leave Thursday, if it arrives after that, I won't be able to get it. I will not order from them again if they don't fix this and compensate me.", "rating": 1}, {"title": "never got my package after paying for next day", "text": "never got my package after paying for next day-where is it?", "rating": 1}, {"title": "The label got messed up and I still…", "text": "The label got messed up and I still haven't gotten a refund for it", "rating": 1}, {"title": "I never received my package so I can’t…", "text": "I never received my package so I can’t review. It was marked delivered but I never received", "rating": 1}, {"title": "Never received the product", "text": "Never received the product. Order was cancelled without a cancellation notice being sent.", "rating": 1}, {"title": "Paid $15 dollars for shipping", "text": "Paid $15 dollars for shipping, it's been 4 days and I still don't have my product.", "rating": 1}, {"title": "I never received my package", "text": "I never received my package. Please send a new one.", "rating": 1}, {"title": "I can’t take the oil…i think I’m…", "text": "I can’t take the oil…i think I’m allergic to it or something. Can I get a refund?", "rating": 1}, {"title": "I opened a account and was told I could…", "text": "I opened a account and was told I could track it and I can't. It's a small order and should be here by now?", "rating": 1}, {"title": "Excellent service", "text": "Excellent service, great product.", "rating": 1}, {"title": "I didn't get my package", "text": "I didn't get my package, I am not very happy, they are trying to charge me 23 dollars in import fees,  no thank you, you guys can have it back, I will look at it as a loss, its to bad I'm being treated this way I would have sent a lot of business your way.", "rating": 1}, {"title": "I just thought when you paid for…", "text": "I just thought when you paid for expedited shipping that they would honor the time span.", "rating": 1}, {"title": "Still waiting for you to send me…", "text": "Still waiting for you to send me tracking INFO....................today is Jan. 9th", "rating": 1}, {"title": "I have not received my my package", "text": "I have not received my my package.  USPS could not find my address.", "rating": 1}, {"title": "Made my first order almost a few weeks…", "text": "Made my first order almost a few weeks ago and now I can log into web site from my phone to track my package…", "rating": 1}, {"title": "Order not shipped???", "text": "Order not shipped??? ", "rating": 1}, {"title": "Disappointed in product", "text": "Disappointed in product. Not worth the money, at all. I'd like my money back.", "rating": 1}, {"title": "I’m missing 3 things in my order…", "text": "I ordered 4 individual sized phenibut Hcl 5mg containers and only received 1. The tracking says it was all shipped and nothing else is coming. Would like a refund of the other 3 I’m missing.", "rating": 1}, {"title": "Im still waiting on a confirmation of…", "text": "Im still waiting on a confirmation of package to be shipped. I ordered 3 products from nootropics depot the same day I ordered from liftmode, I got package updates, and it was delivered 2 days later", "rating": 1}, {"title": "The new glitchy buggy website added two…", "text": "The new glitchy buggy website added two items to my cart instead of one.  I emailed immediately after the order went through and then received a response days later saying it’s too late unless I cancel my order and start a new one.  By the time I responded to that email saying that’s what I’d like to do, they had the item shipped, therefore giving me no time to make the change.  I was not looking to spend over $100 for this single order.", "rating": 1}, {"title": "The Phenibut I ordered was not included…", "text": "The Phenibut I ordered was not included even though I was charged for it.", "rating": 1}, {"title": "Don’t bother ordering from here", "text": "I’ve been waiting almost a month for my purchase and it sat saying “order placed” with two emails sent asking for what’s going on and no response until I reported it to PayPal. I thought it was a scam because I couldn’t get my product or a timely response let alone any tracking information. You have horrible customer service and I will not be ordering again. Who knows if I will even get my product. And if I do get what I ordered, now I will have ordered two because I had to go on Amazon and buy the same product so I would actually receive it because it’s a trustworthy site that gives updates. So thanks for that.", "rating": 1}, {"title": "Bad customer service/no shipping", "text": "I made an order from them on 19th of February and today (28 feb) the item still hasn’t even shipped i contacted them about it about 2-3days ago and they said the item will be upgraded to next days ups and it will be shipped by tomorrow and it wasnt shipped till now. I was lied to by this company and they are not even responding to my emails anymore i’ll contact my bank and get a chargeback cause this is unreal and disgusting", "rating": 1}, {"title": "I'm so disappointed", "text": "I have been buying my phenibut only from liftmode. And I understand that it supply is shorter than it once was but now liftmode had jacked there prices up insanely. A bottle of 800 capsules was about 90 bucks for me. Now there price for that same bottle is $186. Liftmode should be ashamed of themselves. All your doing now is taking advantage of us the customers. U lost me as a customer", "rating": 1}, {"title": "No refund or product", "text": "I sent money via Bitcoin, and you claimed you never received it. I sent it to the correct wallet address immediately after it was requested. On my end it says the transfer was successful. I never got my money back or the product I ordered. I will never order from you again.", "rating": 1}, {"title": "Never received the package", "text": "Never received the package and im being blamed by the company because I \"chose\" the shipping, thats false its the shipping company you guys provided and I have yet to receive the package still that was orded last month.", "rating": 1}, {"title": "They really suck since new website", "text": "They really suck since new website.  When you review order then confirm, the item remains in cart but bank gets charged.  No matter what.  Impossible to get charge removed until it falls off. So no item and money in bank account no longer available.  No agents on phone available to take call.  “Call back later.”  Great company to ruin your day and week.  No product while bank has your money pending.", "rating": 1}, {"title": "Caused extreme depression and suicidal…", "text": "Caused extreme depression and suicidal thoughts. EXTREMELY DANGEROUS DO NOT RECOMMEND", "rating": 1}, {"title": "the shipping you pay is just for the…", "text": "the shipping you pay is just for the shipper to pick up the package from liftmode, you are not paying for them to actually ship it to you, you must still pay shipping for it to be actually sent to you after it is picked upin the united states via USPS it was a flat $60.00 + the $20 or so liftmode charges for pickup, this was for an order that was only $50, imagine paying more in shipping than actual product in 2021", "rating": 1}, {"title": "Prescription needed for delivery in Thailand", "text": "Allows shipping to Thailand as an option but their products are FDA controlled and require a prescription or medical certificate in order to be delivered. Out $100 worth of product plus wasted time and resources as this requirement is not mentioned anywhere on their website.", "rating": 1}, {"title": "The only option for delivery was UPS", "text": "The only option for delivery was UPS. After reaching my country, it got hold at customs, the total of the order was 78 dollars, I ended up paying 210 dollars to be able to receive it from customs. If I knew that from the start I would never have ordered it. UPS was no help at all. And there was no way for me to cancel the order or ask for it to be taken back. Never again.", "rating": 1}, {"title": "Wrong type and missing product", "text": "I take phenibut Hcl every day for anxiety and ptsd with only a 2 week break every 6 months. I’ve taken phenibut hcl for 6 years.Hcl crystals are not supposed to be the consistency of flour, but more like sugar. My phenibut is more like flour… but it does taste like it should.   My order was for 500g  HCL powder. I weighed the contents without the jar after taking only 2 grams and my digital scale read 454 grams… with the container it weighed slightly over 500 grams… So I got something that isn’t hcl powder and got 10% less product than I paid for. Will not be ordering from liftmode again.", "rating": 1}, {"title": "Thanks guys this time the package was here as quickly as it possibly could have been,apparently my phone gave you my old address and it’s done that before so I’m sorry about my first review you guys !", "text": "So I never received my order! It says it was delivered to my front door and that’s simply not true, I emailed them and left a phone message and they couldn’t bother to answer me on either and they make it difficult enough just to see what’s going on! So unless you’re great with computers and know the law very well don’t waste your money!", "rating": 1}, {"title": "The 200g container of phenibut I…", "text": "The 200g container of phenibut I received was less than half full. I realize it is sold by weight not volume but other packages I purchased from you contained more. I am unsure how to measure with the spoon you supply since the density of this product is different.", "rating": 1}, {"title": "I ordered a product and got no…", "text": "I ordered a product and got no verification that they are going to send me my product. The worst part is the money was withdrawn from my bank account and i have no product to show for my money. Very disappointed with LiftMode after hearing nothing but good things from the company. Hopefully LiftMode can send me my order and I can write a positive review when they settle the matter.", "rating": 1}, {"title": "Order never arrived.", "text": "This was my third time ordering from LiftMode.  My first two orders were great - no problems whatsoever.  This time, however, my package didn't arrive at all.  Tracking via UPS said that my order had been delivered, but I had nothing - no package, no delivery notice, etc.Not really even sure this is LiftMode's fault, but it was not a good experience.For the record, I have reached out to them and let them know.", "rating": 1}, {"title": "website was fine but my order went to…", "text": "website was fine but my order went to los angeles from illinois instead of jackson tennessee and my status only says it will take longer than anticipated...yeah cause you shipped it across the country to the wrong state...not happy", "rating": 1}, {"title": "Item was paid for on 19 August 2020", "text": "Item was paid for on 19 August 2020. Today is 19 September 2020.Item has NOT BEEN RECEIVED! I did contact them for an explanation here is what Naila said: Hello,Please accept our sincerest apologies for this inconvenience.Kindly note your query has been forwarded to the concerned team. We will update you shortly on the same.In case you have any further questions or concerns about your order, feel free to reply to this email.Thanks and regards,NailaToday is 19 September. Still no UPDATE.", "rating": 1}, {"title": "Honestly worried I was going to die", "text": "I've taken phenibut hcl on occasion for over a decade and know how it affects me. After using your product I ended up having to call 911 for the first time, and was taken to the emergency room. I experienced muscle spasms that felt like they were about to break me in half, symptoms akin to tardive dyskina, sweating like I never have before, and had difficulty breathing and speaking. I cannot attribute my experience to your product with 100% certainty since I am not paying to have it analyzed, but the only explanation I can think of is the product contained adulterants of some kind.", "rating": 1}, {"title": "My order hasn’t shipped yet.", "text": "Date of experience: May 20, 2024", "rating": 1}, {"title": "Possibly no fault of LiftMode", "text": "Because of \"Boost my Biology\" on YouTube I tried your products. I know phenibut is on it's way out and soon I won't be able to get it. The one pill that actually helps with my anxiety. And it seems like you are the last place where I could get it. But sadly it does not have the same effect it had when I was getting it from Nootropics Depot. So you realize when I last purchased Phenibut (they haven't sold it in almost a year.) I'm inclined to think with the growing difficulty to get Phenibut the quality has since declined. So while my purchase of Phenibut from you may be a disappointment I'm not sure if your company is at fault or the quality that is left around is just not there. Sad the government is once again interfering with substances that actually work. I will continue to make due with GABA until the government bans that too. I will try other products with your company to see how well they work before I put the blame solely on your products. Thanks.", "rating": 1}, {"title": "I opened my package and the seal for…", "text": "I opened my package and the seal for the phenibut i ordered was open. Once i open the bottle thr capsules were open and power was spilling out of each capsule. Wasted my money", "rating": 1}, {"title": "I never received my order.", "text": "Date of experience: April 10, 2023", "rating": 1}, {"title": "Waste of money", "text": "Waste of money . I bought there product. There is no ingredient list. I think it's just mint oil. Scammers making tons of money on people in pain. They didn't offer refund. That makes you know the product is fake", "rating": 1}, {"title": "Stuff didn't work", "text": "Stuff didn't work. Tried twice, hours before, empty stomach. Didn't have nearly the effect like Primaforce Phenibut. I don't think I'd by this product again.Edit: Already threw it away. Was dissatisfied. Not sure the refund would help at this point per your instructions.", "rating": 1}, {"title": "I never received my package", "text": "Date of experience: February 03, 2023", "rating": 1}, {"title": "Still haven't received purchase", "text": "Still haven't received purchase. Paid much higher cost to Canada.UPDATE TO REPLY:THEY HAVEN'T CONTACTED ME OTHER THAN 2 PEICES OF ID CERIFYING I'M CANADIAN. CAN YOU PLEASE FOLLOW UP AND HAVE THEM CONTACT ME WITH INFORMATION PROVIDED?", "rating": 1}, {"title": "Other vendors would have reached out to remedy their mistake", "text": "Never received package. When I looked back in the history, it appears that they sent it to a deeded address. I had to fix that in the order form, and still my package was sent to the old address. Nobody has reached out to contact me. It's $40 down the drain", "rating": 1}, {"title": "charged and no purchase showed", "text": "I was charged and no purchase showed on your site, then the guy on the phone was rude and accusstional, and I didnt get my money back till it was too late for Christmas shopping.I eventually had to both make another account on the old site, AND use a different card so billing and shipping addresses would match in order to place an order that would go through.None of this information was provided by your support. They were too busy playing the blame game and covering the ass of your malfeasant billing system. I figured out the problem on Reddit.Hopefully nootropics depot will be Back online by my next order so I wont have to deal with the rude nightmare that is LiftMode customer service again...", "rating": 1}, {"title": "Phenibut HCL no effect.", "text": "I ordered the Phenibut HCL. After trying it multiple times on various days, I have yet to feel any effects.", "rating": 1}, {"title": "I was very disappointed with my last…", "text": "I was very disappointed with my last transaction. They did not have the 300 count bottle of Phenibut so I had to order 3 bottles of the 70 count Phenibut. I got way less pills and it cost me more. Very unhappy with this last transaction", "rating": 1}, {"title": "I hated it all the way around it made…", "text": "I hated it all the way around it made me sick as a dog I missed work I was vomiting for 2 days I hated the feeling it gave me it's a horrible product. If I dont get a refund on my order and the shipping I will take further action immediately", "rating": 1}, {"title": "Phenibut Review", "text": "The phenibut was absolutely horrible. I felt absolutely nothing and tried it 5 times, all it did was give me severe anxiety, nausea, restlessness and a panic attack. I would not recommend.", "rating": 1}, {"title": "Phenibut HCL is bunk", "text": "Purchased a tub of Phenibut HCL powder but the product doesn’t work. Phenibut purchased from another company works as intended. I’ll not purchase from LiftMode again.", "rating": 1}, {"title": "I'm not sure how the actual powder is…", "text": "I'm not sure how the actual powder is because there was a hair in it. Disgusting. I've heard great things about liftmode and then this happens.", "rating": 1}, {"title": "The website glitches", "text": "The website glitches. They should also allow cancellation if it is right after the order is placed. They are slow to respond to customers and keep spamming emails asking for feedback.", "rating": 1}, {"title": "You must spend $49 for free shipping", "text": "You must spend $49 for free shipping, they price the item I regularly buy at $48.98.....Low class way to get you to buy something else, screw them,  I just pay the shipping.", "rating": 1}, {"title": "Absolutely horrible company", "text": "Absolutely horrible company.  Good luck getting them to address any issue that you call them out on.  When they mess up an order they will ignore you at all costs.  The company is grimy.", "rating": 1}, {"title": "Their site isn’t working so the 10% off…", "text": "Their site isn’t working so the 10% off coupon they gave me wouldn’t work. They refused to refund the $3.98 and offered me 8% off a future order instead. ND would never. F this place.", "rating": 1}, {"title": "MISSING 200 DOLLAR ITEM", "text": "i received my order but come to find out my phenibut 300mg 800 counts that costed186 dollars i missing and only my sleep caps are here i double checked and still noting", "rating": 1}, {"title": "Shipping sucks!", "text": "Date of experience: July 29, 2023", "rating": 1}, {"title": "I tried to order something off this…", "text": "I tried to order something off this site and it kept erroring when I would place the order. I fixed the problem and another error, I did not get to order anything and yet, LiftMode still charged my card!", "rating": 1}, {"title": "Got my order very quickly", "text": "Got my order very quickly.  Product is not working. Phenibut FAA is trash. Took 500mg.. nothing...750mg... nothing...1000mg... nothing...1500mg... nothing....2000mg.... nothing", "rating": 1}, {"title": "Can I get the product before I review it?", "text": "I keep getting emails to review and I still haven't received my product when your package is late the last thing you want is constant reminders.", "rating": 1}, {"title": "I ordered  Synephrine in the  powder …", "text": "I ordered  Synephrine in the  powder  form and they was no scoop included but  on the website  it said  that  a scoop would be included and I emailed them and  I haven't  gotten a response back", "rating": 1}, {"title": "Their parcels never come", "text": "Date of experience: November 16, 2022", "rating": 1}, {"title": "Prices have increased 100% since my…", "text": "Prices have increased 100% since my last order. I don't plan to reorder if I can find more reasonable pricing on other websites.", "rating": 1}, {"title": "Normally amazing, this time—not so great.", "text": "Historically liftmode has been awesome. Great customer service, always on point. This time sucked. I’m a Canadian customer, (always a pain) and I’ve been buying off them regularly since 2017. The item I usually order wasn’t available in the quantity I required, so when asked they assured me would be back in stock by the end of last week. Which it wasn’t. The item was available in smaller quantities, mind you at a much higher rate. I emailed them to see if there was something we could work out, and the only option I was given was to order the smaller versions. For some reason the shipping option I usually opt for, UPS, was at a highly inflated rate, in USD. This is the only time I’ve encountered this service being cost as such online, and I regularly buy items from the states. Because of this, I spent nearly the same amount, (roughly $360 CAD) for a fraction of what I normally purchase from them. Which sucks. Love you liftmode but you guys dropped the ball this time.", "rating": 1}, {"title": "Energy supplement", "text": "I ordered the energy supplement. I have no idea why but it makes me feel tired. I have tried it on several different days. From my experience I would not recommend this supplement.", "rating": 1}, {"title": "I am almost certain i received the…", "text": "I am almost certain i received the wrong product by mistake.  Have taken phenibut for years.    This last order of large crystals was like complete opposite of typical feeling from phenibut.", "rating": 1}, {"title": "Why is my package from you in Chicago…", "text": "Why is my package from you in Chicago international center. It now can stay there for 4 days. Us customs. What is going on?", "rating": 1}, {"title": "Terrible quality- not worth it unless you want to be sick", "text": "Unfortunately this Phenibut FAA isn’t great, it’s not even worth trying. I had read reviews saying that Liftmode had changed suppliers since the shortage of Phenibut and that it was terrible, when it used to be highly recommended, and I decided to try it anyways for occasional anxiety and depression episodes. The first time I tried it, I took exactly the recommended dose, and… nothing. I asked on a popular Reddit forum and they said to try dosing again up to 4x every 4-5 hours. After the second dose I got a massive migraine and felt dizzy, shaky and nauseous. I waited 5 days (it is not recommended to take this product more than 1-2 times per week) and it did nothing except make me extremely tired and again anxious. I tried one last time with a “good sized” dose and same thing- zero effects except shakiness and a little dizziness, some mild nausea and anxiety. I threw it away and am irritated that I wasted $68.00, I should’ve listened to the thousands of reviews saying it was terrible quality.", "rating": 1}, {"title": "Nootropic Depot is better", "text": "I've tried phenibut from Nootropics Depot and that worked great, but with Lift mode I felt nothing.", "rating": 1}, {"title": "I never received the item", "text": "Date of experience: January 01, 2023", "rating": 1}, {"title": "Didn't lift up my mood at all", "text": "Didn't lift up my mood at all. No change in feelings or mood.", "rating": 1}, {"title": "Item never arrived.", "text": "Date of experience: January 12, 2023", "rating": 1}, {"title": "The product that I ordered", "text": "The product that I ordered: \"KANNA EXTRACT (POWDER) - 1 GRAM (1000MG) - 5+% ALKALOIDS / 3+% MESEMBRINE\" did absolutely nothing. Waste of 30 bucks.", "rating": 1}, {"title": "nothing…", "text": "Unfortunately felt absolutely nothing after taking phenibut, and double the dose required. Disappointing.", "rating": 1}, {"title": "My order has not arrived..", "text": "My order has not arrived... it's been 5 days. All my previous orders have disappeared from the website...", "rating": 1}, {"title": "Almost 2 weeks and haven't recieved my…", "text": "Almost 2 weeks and haven't recieved my order yet. Have to wait 15 days I guess.  Got the same order faster through Nootropics site.", "rating": 1}, {"title": "Two weeks after ordering with 2 day…", "text": "Two weeks after ordering with 2 day ups, no package. Tried to call, got message that you weren't taking calls and try again. Not happy.", "rating": 1}, {"title": "Free 2 day shipping turned into 7 day…", "text": "Free 2 day shipping turned into 7 day free shipping...", "rating": 1}, {"title": "The bottle I received was empty", "text": "The bottle I received was empty, the only thing inside was an excessive amount of cotton filling.", "rating": 1}, {"title": "Recieved the wrong product", "text": "I ordered the phenibut capsules and was sent L theanine. I'm a little disappointed.", "rating": 1}, {"title": "Contacted customer service due to issue…", "text": "Contacted customer service due to issue with order and they stopped responding after the first email.", "rating": 1}, {"title": "It’s broken.along my life miserable for…", "text": "It’s broken.along my life miserable for almost a week.", "rating": 1}, {"title": "Fast af delivery but the product is not…", "text": "Fast af delivery but the product is not good it just intoxicating", "rating": 1}, {"title": "Have not received it yet", "text": "Have not received it yet. This is day three of the second day air shipment.Slow.", "rating": 1}, {"title": "I ordered 200g of phenibut and only got…", "text": "I ordered 200g of phenibut and only got 100g", "rating": 1}, {"title": "It's been a week and still haven't…", "text": "It's been a week and still haven't received my refund. I was told 3 business days", "rating": 1}, {"title": "Would have gave 5 stars but it came…", "text": "Would have gave 5 stars but it came late and they didn't send any notification as of why.", "rating": 1}, {"title": "It doesn't work and they were expired", "text": "It doesn't work and they were expired. There customer service and promptness was excellent.", "rating": 1}, {"title": "I was shipped the wrong product", "text": "I was shipped the wrong product, and contacted customer service via email twice - no response still.", "rating": 1}, {"title": "Phenibut was not the same quality as my…", "text": "Phenibut was not the same quality as my usual supplier and made me ill.", "rating": 1}, {"title": "I payed for 1 day shipping and am still…", "text": "I payed for 1 day shipping and am still waiting for my package.", "rating": 1}, {"title": "order did not arrive", "text": "order did not arrive.  are you going to do anything about this?", "rating": 1}, {"title": "received overnight package in 2 days.", "text": "received overnight package in 2 days.written twice and received no response!!!", "rating": 1}, {"title": "My order went to the wrong address", "text": "My order went to the wrong address, even after informing them of the error.", "rating": 1}, {"title": "I was supposed to get a scoop with my…", "text": "I was supposed to get a scoop with my piperine. I used too much and got FLUSH", "rating": 1}, {"title": "Never received my order", "text": "Never received my order. Issue was dismissed by company. Terrible service.", "rating": 1}, {"title": "Been over a week since I paid for my…", "text": "Been over a week since I paid for my order, and it says pending?!", "rating": 1}, {"title": "Hasn't even shipped yet but they sent…", "text": "Hasn't even shipped yet but they sent me an email asking for feedback", "rating": 1}, {"title": "I think the blowback on high priced…", "text": "I think the blowback on high priced mask sales has harmed your reputation.", "rating": 1}, {"title": "Didn’t relax me at all made me feel…", "text": "Didn’t relax me at all made me feel like I was gonna have a heart attack", "rating": 1}, {"title": "Had terrible review", "text": "Had terrible review. This is it safe for alcohol become", "rating": 1}, {"title": "unacceptable shipping", "text": "unacceptable shipping. still have not received item.", "rating": 1}, {"title": "Never received my product yet the order…", "text": "Never received my product yet the order says completed.", "rating": 1}, {"title": "Phenibut did not work at all", "text": "Phenibut did not work at all. literally felt nothing.", "rating": 1}, {"title": "Received expired phenibut and had to…", "text": "Received expired phenibut and had to throw it away wasting 20$", "rating": 1}, {"title": "It is still in transit in Chicago for a…", "text": "It is still in transit in Chicago for a week or more.", "rating": 1}, {"title": "I have not received my product how can…", "text": "I have not received my product how can I give any feedback at all.", "rating": 1}, {"title": "I am not writing a review since you…", "text": "I am not writing a review since you didn't even read my email.", "rating": 1}, {"title": "have not received product", "text": "have not received product. How can I review it????", "rating": 1}, {"title": "product came with seal broken", "text": "Date of experience: January 23, 2023", "rating": 1}, {"title": "It was the case", "text": "It was the case. The bottle had an expired sticker on it.", "rating": 1}, {"title": "The godamned package takes a lifetime…", "text": "The godamned package takes a lifetime and i still did not get it", "rating": 1}, {"title": "Tis weak", "text": "Tis weak. Used to be good. Now it’s not.", "rating": 1}, {"title": "I HAVE NOT RECEIVED MY ORDER", "text": "I HAVE NOT RECEIVED MY ORDER. It’s been almost 2 weeks!!!!!!", "rating": 1}, {"title": "Taken phen before feel nothing on…", "text": "Taken phen before feel nothing on these. Do not recommend", "rating": 1}, {"title": "Didn’t work for me", "text": "Didn’t work for me. Super disappointing.", "rating": 1}, {"title": "Still waiting on this order to arrive...", "text": "haven't received order yet and it's been 10 days", "rating": 1}, {"title": "Doesn’t work for me👎", "text": "Date of experience: March 30, 2023", "rating": 1}, {"title": "Save your money", "text": "Save your money – these are not legit", "rating": 1}, {"title": "Customer service is good product is not…", "text": "Customer service is good product is not so good anymore", "rating": 1}, {"title": "You sent all wrong products", "text": "You sent all wrong products. Terrible.", "rating": 1}, {"title": "The product SLEEP CAPS didn't work for…", "text": "The product SLEEP CAPS didn't work for me.", "rating": 1}, {"title": "My last order if Phenibut was bunk.", "text": "Date of experience: March 17, 2022", "rating": 1}, {"title": "Product doesn’t DO anything.", "text": "Date of experience: March 12, 2022", "rating": 1}, {"title": "I never received my package!", "text": "Date of experience: November 29, 2021", "rating": 1}, {"title": "your website didnt work", "text": "Date of experience: February 28, 2022", "rating": 1}, {"title": "The stuff was a waste of money", "text": "Date of experience: January 03, 2020", "rating": 1}, {"title": "Mid quality", "text": "Honestly, bad quality", "rating": 1}, {"title": "payment experience", "text": "Date of experience: February 10, 2024", "rating": 1}, {"title": "Never recieved the product", "text": "Date of experience: May 20, 2021", "rating": 1}, {"title": "Package never arrived", "text": "Date of experience: January 01, 2022", "rating": 1}, {"title": "I never got the product", "text": "Date of experience: March 21, 2021", "rating": 1}, {"title": "Delivery issues.", "text": "Date of experience: April 24, 2023", "rating": 1}, {"title": "ALMOST KILLED ME", "text": "Date of experience: May 29, 2020", "rating": 1}, {"title": "Products suck", "text": "Date of experience: April 09, 2020", "rating": 1}, {"title": "Terrible Customer Service", "text": "I attempted to place an order today, 3-28-22, for a product on their site.Their checkout process was not working, so I reached out to them in chats. They said they could process the order over the phone.I couldn't immediately place the order but told them I would call back.I started asking them questions in their in-website chat. I was browsing the internet at the same time and would come and go in the chat and ask questions as I thought of them.When I reached out some time later, an associate LEO told me I was wasting his time and that they had been tied up with me for an hour and a half with no resolution and me just asking the same questions over and over and it was taking away from their time to help other customers.I was unaware that keeping the chat open meant that they couldn't help other customers. I thought it ended and then picked back up once I typed something new.At several points during the chat, it would prompt me to rate the interaction. I rated each interaction honestly and did not act mean or hateful to any associate.LEO saw that I had rated one of our interactions negatively, so he launched into a tirade saying I was an abusive customer. He then sent me an email saying he banned my account.I tried to call and speak to someone and got ahold of LEO. He started yelling at me over the phone saying I was an abusive customer. I asked to speak to a Manager and LEO told me \"they\" didn't have time for that or for me.I then went back to the in-website chat and started asking questions about different products and LEO came on and said I was banned and they wouldn't sell any products to me.This was all within the span of about 1.5 hours where I was a new customer and just inquiring about their products and services.Somehow it went from me chatting with them in the app, to their employee LEO yelling at me over the phone, sending me emails that he was banning me and saying I was an abusive customer. All because I asked a few questions and needed some time to do my due diligence before ordering.If they are legitimate, they sure seem to be absolutely terrible at customer service.LEO attacked me verbally and then said I was the one who was abusive to them for asking questions.THEY sell supplements that are designed to “CALM” people down. Maybe LEO should consider taking the same supplements he’s selling on behalf of this company…I'm still trying to process this, but I would steer clear of this website at all costs. They have no patience and will blow up on you if they feel you've taken too much of their time or asked too many questions before handing over your Credit Card Information.Be careful...Addendum:If you are any person reading this (other than the LiftMode clan), please do this thought experiment for me. Do you think myself as a new customer just randomly decided out of the blue to suddenly get embroiled in a battle with an obscure website I had literally only discovered a few days ago, just for my own kicks, or is it possible that what I'm saying is real and actually happened?? I did NOT just seek out to become ensnared in a battle with a website I barely even knew existed. Everything I wrote in my review ACTUALLY happened. I have NO motive to make anything up and it would be an absolute WASTE of my time to fabricate or embellish anything. Look at how much time I've spent writing this review and how intricate and detailed I've made it. I wouldn't just do that if NOTHING happened and I was just wanting to without CAUSE, slander someone (as LEO claims).LEO claims I said I would slander him online. I NEVER said anything like that. After he yelled at me over the phone and sent me emails saying he was banning me, I responded to his email saying I would write as many reviews as I could about my experience with him. Honest reviews. LEO was unhelpful, hostile, aggressive and downright mean the entire interaction. And...he wants to just parrot my claims of his treatment towards me, back saying I did the same to him. I was professional and courteous. What started WW3 for LEO was after I rated an in-app chat negatively. He went from Hot to Cold instantaneously and then abruptly became defensive, aggressive and mean and emailed immediately that he was banning me.I found another website that sold the identical product for a 1/3 of their price. That associate threw in a freebie and same day shipping, along with a deep discount code. All while being unbelievably nice to me. I'm wondering why that website was overly helpful, but LEO and company were incredibly aggressive the entire time??LEO needs to take his own supplements he peddles. Because acting like that in life, is never acceptable. I was a brand new potential customer and LEO treated me like I was trash, yelling and screaming and threatening the entire time. He is NOT innocent! He is NOT the victim here. He is and was the AGGRESSOR.", "rating": 1}, {"title": "Charged me for freight when it should…", "text": "Charged me for freight when it should have been free, emailed customer service with no reply.", "rating": 1}, {"title": "I haven’t received yet", "text": "Date of experience: October 15, 2019", "rating": 1}, {"title": "1 or 2 capsules does nothing", "text": "1 or 2 capsules does nothing. 3 is a bad trip.", "rating": 1}, {"title": "Don’t buy from here", "text": "No response, you shipment.  Stole my money.", "rating": 1}, {"title": "I ordered phenibut i don’t feel…", "text": "I ordered phenibut i don’t feel anything after several tries", "rating": 1}, {"title": "Never got product", "text": "Never got product and was sent email about the problem that’s not be fixed or from what I can’t lift mod has not try to or reimbursed me", "rating": 1}, {"title": "Poor Service", "text": "I placed my order on a Monday with 2 day priority mail. My order sat in the office the entire week. I received it the following Monday.", "rating": 1}, {"title": "I’m sure they’re Phenibut works great…", "text": "I’m sure they’re Phenibut works great but it just doesn’t do anything to me, I’m 150 I don’t eat for over 4 hours before I take it and sometimes I would try up to 3 grams but it does nothing I was looking forward to buzzing off this stuff but I don’t get anything out of it.", "rating": 1}, {"title": "I didn’t feel any effect whatsoever ....", "text": "Date of experience: July 19, 2019", "rating": 1}, {"title": "phenibut is extremely addictive.", "text": "phenibut is extremely addictive.. should put a warning with this stuff.", "rating": 1}, {"title": "Still Waiting for my order since April 17th !!!", "text": "I could rate you guys with zero stars then I would.I have not received my order yet although I have placed it on April 17th. I have sent numerous emails with no replies yet, and the tracking number you supplied me with via email is unrecognized after I have spoken to UPS. My order number is 10040279385Plz, help or return my money ...", "rating": 1}, {"title": "My honest experience", "text": "My honest experience, was dissapointment. I bought the powder phenibut sample and, i might have made a mistake by not bying the other form, my friend was telling me. Im not angry because i bought it, but perhaps you could recommend what form is better because i feel like i wasted my money, a refund would be awesome but im not mad, my friends and I we buy phenibut from you strictly, my friend bought the capsules, and i dident have the same experience as him, sadly.", "rating": 1}, {"title": "Unfortunately the 300mg Liftmode", "text": "Unfortunately the 300mg Liftmode Phenibut HCL capsules made my stomach hurt which resulted in painful bowel movements of the watery variety. No positive effects were felt . Only tiredness and discomfort.", "rating": 1}, {"title": "Excellent company in my opinion", "text": "Excellent company in my opinion. My only issue is that my sample order arrived damaged. It could have happened during shipping but there was contents scattered in the package.", "rating": 1}, {"title": "I’ve ordered a lot of phenibut from…", "text": "I’ve ordered a lot of phenibut from Liftmode over the last 4 years. Usually good quality stuff but the last few times I have had really bad experiences with it. I’m not sure if things have changed or products are tainted- it all comes from China so who knows- I just know I’m steering clear of it for now", "rating": 1}, {"title": "phenibut hcl powder did nothing", "text": "Ordered phenibut HCL powder. It was my first time trying it and I took 2 grams but felt absolutely nothing. 3 Days later I took 4 grams but once again felt nothing, just maybe a bit nausous. Finally a couple days later I took 6.5 grams and felt no positive effects whatsoever and it actually made my anxiety worse each time.", "rating": 1}, {"title": "Product is not consistant", "text": "Product is not consistant. Use to be great every time. Now it's almost like the product is mixed with something that gives an opposite effect.", "rating": 1}, {"title": "order number is 10040272265)", "text": "order number is 10040272265) For one the seal on my phenibut was completely open and then there was a shipping issue which I was reimbursed for the shipping but still unhappy with the whole ordeal", "rating": 1}, {"title": "My product has not arrived", "text": "My product has not arrived. I’m disappointed I’m very excited to try it and still has not come, it says it was delivered. I never saw it.", "rating": 1}, {"title": "Did not help at all what so ever", "text": "Did not help at all what so ever. Took suggested dose then more. Absolute garbage", "rating": 1}, {"title": "BAD CUSTOMER SERVICE", "text": "one of rudest customer service is Eevee !!here is a copy of her e-mail address which is unacceptable Thanks for contacting us at LiftMode!We regret to inform you that your request for a refund is past our refund deadline and will not be accepted.If you have any further questions or concerns, please let us know, and we will be sure to get back to you right away!Best Regards,Eevee and the LiftMode team", "rating": 1}, {"title": "Worst experience ever will never order…", "text": "Worst experience ever will never order from here again, and will refer everyone to another website.", "rating": 1}, {"title": "I am disappointed with how hard the…", "text": "I am disappointed with how hard the ordered products come from, I have ordered a while ago and am disappointed that I have not received them quickly as it says on the site, I went on vacation without them. I think I will search for another site, I am very disappointed with the services transport.", "rating": 1}, {"title": "Shipping was very slow and product was…", "text": "Shipping was very slow and product was substandard.", "rating": 1}, {"title": "I am still waiting on delivery", "text": "I am still waiting on delivery.  It’s been eleven days since I ordered and paid for expedited postage.....I don’t think I should have to wait this long.", "rating": 1}, {"title": "Very bad experience", "text": "I asked if they could send my parcel as a 20 dollar gift. Support said no. The order was sent but never arrived. Very bad experience.", "rating": 1}, {"title": "Bought phenibut and it was much weaker…", "text": "Bought phenibut and it was much weaker than a few months ago.", "rating": 1}, {"title": "I still didn’t get my package!", "text": "Date of experience: November 22, 2018", "rating": 1}, {"title": "Phenibut HCL did not work at all  but I…", "text": "Phenibut HCL did not work at all  but I have 100g of useless powder.  Pea it was what it said.  I bought a 30g of absorb health Phenibut HCL at the same time and it worked great.", "rating": 1}, {"title": "I ordered PHENIBUT", "text": "I ordered PHENIBUT, order num. 10040244192 and this is not PHENIBUT not sure what it is.", "rating": 1}, {"title": "I just went from the biggest fan to…", "text": "I just went from the biggest fan to boycotting this company. They just raised the price of phenibut by 150% and they deleted all the products bigger than 100 grams. Extremely disappointed. They are taking advantage of customers who have mental health. It is just disgusting how money hungry they have become. I am boycotting this company.", "rating": 1}, {"title": "Bad quality", "text": "I tried one of their product and it was weak", "rating": 1}, {"title": "Was given the wrong size measuring spoon", "text": "Was given the wrong size measuring spoon for my phenibut and ended up overdosing. had a 2500$ hospital trip.", "rating": 1}, {"title": "This batch was tainted with mdma", "text": "This batch was tainted with mdma. I take no other substances and tested positive for mdma. This will be the last time i purchase anything from liftmode.", "rating": 1}, {"title": "I never received my package...", "text": "Date of experience: August 28, 2018", "rating": 1}, {"title": "Attention: I nearly lost my life do to phentibut", "text": "My name is Mishelae Alsandor. I'm 29 years old. I've struggled with anxiety for over a decade, so after in depth research on phentibut, liftmode seemed as if it was the most trusted company. I had a fantastic day when first taking it. But that very night I blacked out. Ended up in the E.R. not remembering a thing. I was told I was non responsive. I couldn't remember how I got there. My I didn't know the date time. All I knew was my mother's phone number. Phentibut is similar to a date rape drug. It's not a miracle supplement. I'm just now coming back out of my shell. And this is a 2 weeks later. Every medical professional thought it was a drug induced..writing it off as GHB.  Blood was drawn over 3 times. My mother insisted on cat scan. As I'm writing this very review I'm fading in and out. I was put in a crisis center twice in 24hrs. Waking up with night terrors. Bottom line. Don't believe the hype. This product nearly landed me in a room with padded walls. And I will be taking legal action. I truly hope liftmode reviews their reviews.", "rating": 1}, {"title": "I paid extra for 2 day priority…", "text": "I paid extra for 2 day priority shipping and did not receive my order until 10 days later. The container was smashed open and the was a hole in the shipping back and the powder was falling out into my mailbox. I have yet to weight it out so I do not know how much was lost. This is unacceptable to me.", "rating": 1}, {"title": "I AM DISGUSTED WITH THIS COMPANY AND…", "text": "I AM DISGUSTED WITH THIS COMPANY AND ANY OTHER COMPANY SELLING THESE SO CALLED \"BRAIN\" \"ALL NATURAL\" ETC..PRODUCTS THAT KIDS CAN GET THEIR HANDS ON! MY SON PURCHASES PHENIBUT FROM YOU AND HAD. TO TAKEN TO HOSPTAL IT IS DANGEROUS!!! PLEASE IF ANYONE IS READING THIS DO NOT ORDER THAT STUFF OR ANYTHING ELSE THAT IS NOT PRESCRIBED. IF YOU WANT TO GO ALL NATURAL GO SEE A HOLISTIC DR !! DONT BUY SOMETHING THAT YOU HAVE NO CLUE WHAT YOU ARE REALLY GETTING!!! BE VERY CAREFUL THESE PRODUCTS ARE DANGEROUS!!!!!", "rating": 1}, {"title": "This stuff made me feel really strange…", "text": "This stuff made me feel really strange in a mostly bad way. Nauseous the next day and mostly every time I took it . After a week I threw it away. Poison to me maybe not to others. Gave it a try , I won't buy any more.", "rating": 1}, {"title": "This does absolutely nothing", "text": "This does absolutely nothing. I'm thinking it's a placebo!", "rating": 1}, {"title": "Waste of my money..", "text": "Waste of my money... It didn't do anything for me", "rating": 1}, {"title": "I paid over $ 650 and still haven’t…", "text": "I paid over $ 650 and still haven’t received anything", "rating": 1}, {"title": "Package never arrived", "text": "Package never arrived, 0 customer service, no refund. Liftmode is a scam.", "rating": 1}, {"title": "Terrible", "text": "They sent me a dirty bottle with a broken seal and on the bottle it says “do not use if seal is broken” and when I tried calling them, it says the number you have dialed is not in service.. I tried their “live” chat on their website too with no replies.. I basically spent money on something I can’t use.. customer service horrible and as a first time customer, all this was enough not to ever come back.", "rating": 1}, {"title": "This product is dangerous!!", "text": "This product is dangerous!!! Will never use again! Highly recommend no one use this!", "rating": 1}, {"title": "No response to two emails after…", "text": "No response to two emails after receiving wrong product.", "rating": 1}, {"title": "I did not received the product I…", "text": "I did not received the product I purchased.", "rating": 1}, {"title": "Terrible phenibut product", "text": "I purchased 100 grams of phenibut from liftmode because my previous supplier wasn't accepting credit cards at the time.The product was horrible. I'm sure there was actually some phenibut in there but the rest seemed like flour. It was like they took  50 grams of phenibut and mixed it with 50 grams of flour. Pure phenibut dissolves in water. Liftmodes just left a powdery film on top of the glassI will NEVER purchase from them again. Shame on you liftmode", "rating": 1}, {"title": "I ordered from liftmode", "text": "I ordered from liftmode. My package has been stuck in Canadian customs for 2 weeks. No word why. Don't go the ups option.", "rating": 1}, {"title": "I never received my order because they…", "text": "I never received my order because they said my son was blacklisted from making any purchases on LiftMode I suppose it was because they said my son emails too much and took advantage of there return policy So this affected everyone in our household", "rating": 1}, {"title": "no package shipped.", "text": "My money was put as \"pending\".. my order never shipped and am yet to get a refund...", "rating": 1}, {"title": "Didn't feel anything at 1.5g", "text": "Date of experience: January 25, 2018", "rating": 1}, {"title": "I've tried the smallest recommended …", "text": "My Phenibut FAA. I've tried the smallest recommended dose,I've doubled that dose a couple days later,I've even tried 3 scoops after another couple of days. All on empty stomach and the most I have felt is slight lethargy.", "rating": 1}, {"title": "You guys quit selling phenibut I took …", "text": "You guys quit selling phenibut I took my business to happy hippo bring it back you will have my business again along with several of my friends", "rating": 1}, {"title": "DO NOT PURCHASE WITH LIFTMODE!  SCAMMERS.", "text": "My opinion of this company has done a 360.  I purchased a tub of 1000 g large crystal phenibut.  When I went to open the tub the 'seal' which should have been intact around the lid had been cut around so the top was able to come off without breaking it.  Also, the actual seal to get at the product was missing.  I've been purchasing phenibut since 2007 from various sources and it's ALWAYS sealed. I called into their 'customer service' line quite upset and was told to take photos and send them in, which I did.  I will not lie.  I was escalated as that's a lot of money for me to spend on a supplement.   After this all 'customer service' ended with them and they avoided all my future contacts with them. I mean, they responded to me but wouldn't do anything.  For instance, I'd request a return label and they're reply with an email telling me they've sent me an email but there wouldn't be a return label attached, they'd say it might be in my junk mail, etc. One of my many calls into the call center were returned with someone leaving me a voicemail of them asking why I was calling?!  It was obvious by Saturday that they were playing a game with me and I told them I wasn't going to be ripped off.  Well, that got a reaction.  The chord was struck and they seemed to ramp up the passive aggressive behavior of returning my emails with \"We're going to close this incident case since it appears to have been resolved\" when nothing had been done.  So I'm out over $150.  I will not use this product as it's been opened.  Part of me is considering sending it back on my own dime but I'm afraid they'll claim non-receipt of the product and I'll be completely out of everything.  I'm hoping the owner or an investor in this company sees this and inquires into my experience.  It's horrible customer service.  If they did a bit of research on my past they'd see I had a good history.  A package they sent me got lost in the mail, they had to reship a package to me.  After a couple of weeks the first package they sent to me arrived, I got a return label from them and shipped it back.    It really is puzzling to me.  I tried leaving feedback on the Liftmode site but someone there changed my password on my account and made it so I couldn't reset it to leave feedback.  If an owner/investor is reading this my order number is 10040189050", "rating": 1}, {"title": "Your Phenibut HCL", "text": "Your Phenibut HCL, \"70 capsules - 300 mg >99% Purity\" does absolutely nothing for me.  I am truly disappointed.", "rating": 1}, {"title": "Name is miss leading..", "text": "Name is miss leading... Same day supplements.... note like 3 to 7 days", "rating": 1}, {"title": "went into withdrawal when I switched to this brand..", "text": "hate to say it but when I switched to this brand... i went right into phenibut withdrawal.. as if I hadn't taken anything..  ok that's it..", "rating": 1}, {"title": "Sorry for the bad rating guys BUT I …", "text": "Sorry for the bad rating guys BUT I ordered phenibut 12 days ago and it's not here.", "rating": 1}, {"title": "Never got it.", "text": "Date of experience: August 20, 2017", "rating": 1}, {"title": "I'm not happy with the experience", "text": "I'm not happy with the experience. I paid14.94 to expedite the shipping and in arrived past the day Promised...  Lauren W.", "rating": 1}, {"title": "The yohimbine almost killed me", "text": "The yohimbine almost killed me! I had to go to the doctors than the hospital. The powder should come in capsule form. The powder almost put me into cardiac arrest! Please notify your clients.", "rating": 1}, {"title": "These products have NOT been approved …", "text": "These products have NOT been approved in the United States as a form of treating depression, anxiety, or giving a calming effect. Doctors around our country are seeing an increase in rehab centers of people who have taken this dangerous substance. The issue comes when they try to stop taking the substance.First of all this substance is highly addictive. Over time, staying at the same dosage is impossible and you will have to increase the dosage to get the same effect. Second, it is NOT a natural vitamin or a natural supplement. It has ingredients similar to Meth and can cause hallucinations and a change in your personality when you try to quit. It destroys your dopamine receptors, making you feel depressed if you try to stop taking the substance.I am making it one of my missions to raise awareness. As a result, my sister is in the hospital because of this substance. She used this product for over a year. The scientific study that you use as a reference only lasted for 6 weeks.", "rating": 1}, {"title": "I was very disappointed with the …", "text": "I was very disappointed with the product that I purchased. It was not beneficial to me at all. I turned right around and order from another company. I'm sorry to say but I will not be ordering again.", "rating": 1}, {"title": "Ordered something that was 30$ and they …", "text": "Ordered something that was 30$ and they took 75$ out my account then told me it wasn't there problem that 75$ came out instead of 30$ and I have one of those pay cards so there's no way to talk to customer service so they just got me for 45$ and there's nothing I can do but warn others LIFTMODE WILL STILL YOUR MONEY go to another website", "rating": 1}, {"title": "Terrible!", "text": "Heard from 3 people that my order was shipping- 11 days later. NOTHING!  Can I rate zero stars?", "rating": 1}, {"title": "It didn't work one bit", "text": "Date of experience: July 13, 2017", "rating": 1}, {"title": "USPS lost my package", "text": "USPS lost my package, never received product and was not notified in a timely manner.", "rating": 1}, {"title": "RIP OFF!!! DO NOT BUY FROM THEM.", "text": "Never even received the product!  This site is a complete rip off.  Buyer beware.", "rating": 1}, {"title": "awrful i get dizzinesan heaches like u …", "text": "awrful i get dizzinesan heaches like u cant believe, then ultimately, pass out", "rating": 1}, {"title": "Still nothing in the mail", "text": "Still nothing in the mail. And I was using this to study for a test Friday and now I'm screwed. Not happy.", "rating": 1}, {"title": "Angry at incompetence.", "text": "I placed two orders with Liftmode.  I paid.  But I have not had the goods.  On checking the tracking history they claimed the parcels were \"abandoned\".This seems to be because Liftmode had absolutely no mechanism for informing me that the goods were *in customs awaiting payment of a charge.*  (If I had known about it I would, of course, have paid it.) That's their story, anyway.  Take my advice.  Don't use these guys.", "rating": 1}, {"title": "The Philabutt was over 6 months older than expiration date;", "text": "I received my package in a timely manner but when I wrote LiftMode to let them know that the content was over 6 months past it's expiration date they replied asking for numbers off the package and all as if they were concerned with me and my dilemna but then never replied or seemed to care to replace it or anything. I'd never be abler to comfortably order a substance from them again.", "rating": 1}, {"title": "Great company, bad product issues.", "text": "The customer service and everything to do with the website and company was great! As usual.. The product, however, made me very, very, very ill and I almost ended up in the hospital.I have taken phenibut before and I started off with lower than the recommended dose, as I usually do, and I was extremely ill, dizzy, and throwing up for 24 hours. I did not consume anything else in the prior to taking the phenibut that could have made me ill or ever has in the past. I'm not sure what happened or why this particular batch made me so ill, but I'm definitely afraid to take it again.", "rating": 1}, {"title": "UPS is no good", "text": "UPS wsa very disappointment, the Oleamind should be delivered at 3/3/2017, but I haven't receive it now. The UPS was expensive, but the service was very disappointment. I wish Liftmode can provide other delivery channel (e.g. EMS).", "rating": 1}, {"title": "My item hasn't arrived", "text": "My item hasn't arrived. The mailman put some paper mail in my mailbox and marked it that he delivered my package to me but nothing from liftmode was there.", "rating": 1}, {"title": "i placed an order before paypal was …", "text": "i placed an order before paypal was taken off and never got my order. my paypal account was overdrawn and I never got my package,", "rating": 1}, {"title": "Just gave me a headache", "text": "This product did nothing but give me a headache. I was excited about trying this out but now I'm just going to throw it out and take a loss of $6.", "rating": 1}, {"title": "Took too long", "text": "Normally the shipping takes two days but this time it took six. Product is good as usual, but the shipping was a lag.", "rating": 1}, {"title": "Never received product", "text": "It is unbelievable that this company never delivered my product especially after the fact I paid extra for 2 day shipping! I am very dissatisfied and would like to receive my phenibut asap! This is not a good way to run a business..", "rating": 1}, {"title": "Where is it?", "text": "Ordered priory shipment, never got it. They resent it, but used first class mail ( cheapest and slowest). They never sent this either, just printed the shipping label, never gave it to USPS. Now they are trying next day.  We will see...USPS is still waiting for the package.", "rating": 1}, {"title": "never got it", "text": "ten days so far- the shipment is still in Chicago", "rating": 1}, {"title": "ALL SMOKE AND MIRRORS", "text": "My package was sent to the wrong address. Before it arrived I contacted customer service and they said it would be faster if they sent me a knew one instead of rerouting it. The new package was never sent. Fast forward a few days, I contacted them again and they said they would resend it first thing on Monday. After 3pm I finally get a message that it was \"sent.\"  But they used the same order number as the first pakage so I couldn't track it on Liftmode's website because it only showed info on first pakage to the wrong address. It's been a few days now, and USPS only shows \"pre shippment\" tracking and report they never received it. I live in the same area as the company and still haven't received anything after about two weeks. I can take the mislabeling, it happens, but cannot understand the multiple lies just for this transaction.  Reusing the same order number shows laziness. I now question the legitimacy of their health products.  I also informed them of the urgency needed on the resend but they still used the slowest route (first class).  At this point it will not matter when it comes because I will not be home for weeks now.  It didn't mind hearing they paid people for writing good reviews, but after this I have lost confidence in them, especially because they sell \"health supplements.\"", "rating": 1}, {"title": "No product... No review...", "text": "I ordered over a week ago and still no product. I followed tracking and it had a \"Scheduled Delivery\" of 3 days ago. While I was tracking it claimed to be out for delivery 4 days ago and I got nothing. I checked the tracking and got a message of \r \"The shipment is being held. Commodity description information must be validated by the sender. / Delivery will be rescheduled.\"\r I contacted the shipper who was not very helpful but gave me a USPS tracking # because use of Sharepost but she assured me it would be delivered the next day (3 days ago, it has been sitting in my town for over 4 days). Got another tracking # for USPS, which now shows invalid # and I am just getting the same response.\r It is a shame because I also was about to try their Noopept 5gm deal and possible switch suppliers :(", "rating": 1}, {"title": "Did nothing", "text": "Wish i felt at least something", "rating": 1}, {"title": "So far no sign of package.  Ultra slow package professing/ delivery (assuming it ever shows up) b", "text": "Hope they manage to get the item to me.", "rating": 1}, {"title": "Wrong product", "text": "Two times in a row I ordered something & they sent me the wrong thing, even though it clearly states on the order paper what I ordered. Didn't even bother calling the second time cause it totally turned me off to the product.", "rating": 1}, {"title": "Never received my product!", "text": "I filed a claim with Paypal....  All I asked for was a replacement....  They denied.", "rating": 1}, {"title": "disappointed in product", "text": "Product came looking like it had moisture inside container. It was very clumpy. I've used it 4 different times on different days and felt nothing.", "rating": 1}, {"title": "would never buy from this site again!", "text": "this product did not work for me, some people are different and it may work for them. but in my opinion and my opinion onlyvi would never try this product again it was a waist of almost fifty dollars wish i would have tried a different nootropic! i personally did not like the product at all. i rate this product as a hoax or i got a bad batch.", "rating": 1}]