[{"title": "DO NOT USE THIS COMPANY", "text": "DO NOT USE THIS COMPANYAbsolutely disgusting company. They get away with not sending a refund by telling you the product was returned stained with a bad smell. There are several reviews on here to cinfirm.They they then send a picture that does not bear a resemblance to what you returned nor the condition it was sent in.Then when they eventually offer a gesture but only in store credit regardless if you confirming you would never use again.Steer clear of this site at all costs.And before you ask for my order number so you can 'look into it', don't bother and  lie about that too!!", "rating": 1}, {"title": "Awful return policy, think twice before you order here.", "text": "I ordered multiple times at Rotita, and you know how it works. Sometimes a product is slightly disappointing or maybe doesn't fit exactly right but you decide to keep it anyway because it's a hassle to send it back.So not this time. I bought 4 items, paid €140,34 and the items really didn't fit. I found out one item wasn't eligible for return unfortunately, so I sent back only the other 3 and had to pay around 15 euro for the return package. Then I received only 69,75 back. One of the items was stained according to Rotita. I am very sure there was no stain on the item when I packed it for the return. Just fitted it briefly and carefully put it back in the plastic bag.  So I end up having spend a total of  85 euros on one lousy bikini that doesn't even fit. ", "rating": 1}, {"title": "DON\"T TOUCH THEM!!!", "text": "The quality of the product was fabulous but the customer service REALLY BAD!! I wouldn't touch them!!The first order was the wrong size but to send it back costs more than the product. They also sent and charged me for a duplicate order!!! To send this back I have to pay for it even though its their mistake. The order doesn't even show in my log in. But again it will cost me more to send it back than what they wrongly charged me for. They have really cheap freight but won't uplift the order and put things right!!! DONT TOUCH THEM!!!", "rating": 1}, {"title": "POOR SERVICE. CUSTOMER SERVICE WOEFUL", "text": "Made a big mistake not reading trust pilot reviews prior to ordering. Took payment immediately over 4 weeks ago. All 4 items still not dispatched. Customer service woeful by email.  They simply churn out a script saying the same thing each time you chase. Live chat marginally better very polite contact. I live in hope that I will eventually get my order. Exercise caution dealing with this company. I have no confidence I will get what I paid for !", "rating": 1}, {"title": "TOTAL SHAMBLES ", "text": "Shame I can't give this shambles of a company zero rating. See my previous review.  I have now had several different delivery dates churned out in what is clearly a stock reply. DONT TOUCH THIS COMPANY WITH A BARGE POLE. I have reluctantly accepted no delivery or refund.  How they get so many 5 star reviews is a mystery. Are they fake ?", "rating": 1}, {"title": "AWFUL company, DISHONEST and don't trust them!!!", "text": "I would give them ZERO stars if that was an option.  AWFUL company, DISHONEST and don't trust them!!!  Their size chart is way off; the size chart recommended a too large size based on my body measurements and larger than I normally wear.  I went with the size recommendation from their company as I'd never ordered from them (and wish I never had).  I tried to do an exchange and got the run around.  They WON'T honor an even exchange, have wasted 2 weeks of time with nonsense and unhelpful emails (all they needed to do was look at the exchange request I submitted) and have tried to charge me more, multiple times, for an even exchange.  Now that I'm out of time and had to go elsewhere to get what I needed, they're not giving me a refund.  The items were returned in unworn, new condition, in the original baggies.  All I did was try things on, then ship them right back the next day.  ", "rating": 1}, {"title": "Product way too small when ordering…", "text": "Product way too small when ordering normal size, quality not impressive . Return far too expensive from UK so will give to charity shop and never order again as not financially viable . Also inundated with emails from moment I checked out website ! Bye Rotita!!", "rating": 1}, {"title": "A company to be avoided", "text": "This is the worst company I have ever dealt with, goods were rubbish, size did not agree with product no, tried many times to arrange return with no luck, now gone past return period so now being hassled by payment company(Klarna).Best advice avoid this company or say goodbye to your money", "rating": 1}, {"title": "FRUSTRATING CUSTOMER SERVICE: I am so sorry to say this but your…", "text": "I am so sorry to say this but your customer service being only on chat basis is beyond hard. The people that are on to chat with you seem like maybe they're speaking on different language and they don't understand English. I have never had such a terrible experience every single time I call or I should say chat on your customer service. One improvement you could do that would be extraordinarily helpful is to have customer service be a phone that you can actually talk to a person. I'm pretty much given up on trying to get anywhere with your chat. it's really a very terrible Way to do business. ", "rating": 1}, {"title": "Wouldn't recommend purchasing from here", "text": "Though the items look beautiful in picture, I placed an order Aug 10th and still haven't received, had ordered for a holiday which I am already leaving for. When I contacted customer support to cancel the order all they say is with shipping. Update only part of the order arrived, doesn't fit well having trouble returning it Dress I ordered a MONTH back is still in transit Like I mentioned I am not able to cancel or return this is really bad, money stuck", "rating": 1}, {"title": "Refund is a Scam", "text": "Over the past year I have ordered 5 swim suits and 2 summer tops.  I returned 1 swim suit and 1 summer top because they were to large. These 2 items total 57.00, they refunded me only a 10.00 credit.  I tried on  the outfits, put them back in the bag they came in and returned.  They stated the return didn’t meet their criteria. I return in absolute perfect condition. It’s a scam trying to get a refund ", "rating": 1}, {"title": "No Refund", "text": "Ordered 2 bikinis, both poor quality they wouldn’t accept one back as it was in the sale so gave me a small discount and had to keep it. Sent the other bikini back and couldn’t put return information on the website so sent confirmation on the chat function was promised a refund and that was over 3 weeks ago and they still haven’t refunded.Don’t waste your money", "rating": 1}, {"title": "Ordered two different bathing suits…", "text": "Ordered two different bathing suits same size.  One was so tight upper part and bottom way too big. Returned in same pkg. returned same day received. Kept one suit that fit returned other and extra suit sent for special. Opened ticket- CS texted me and said suit was damaged and would not refund cost!  I could not even put on / no way I damaged it!!!!", "rating": 1}, {"title": "Didn’t look anything like picture won’t…", "text": "Didn’t look anything like picture won’t allow me to return as I have had item few days over return period a lot of money for something that doesn’t look good on brought for holiday so didn’t try on till thenAs stated previously I have contacted you but due to it been over 30 days you have only offered a 10% refund", "rating": 1}, {"title": "Ordered products from Canadian site", "text": "Ordered products from Canadian site.  Return is to be done to the USA.  Shipping charges are very high, too high to ship products back. Canadians, I would not suggest you order from here, as any products you need to return or exchange will cost you far too much.  No indication on Return policy that you are shipping to another Country.  I can return to USA or UK.   Not worth purchasing as really too expensive to return.", "rating": 1}, {"title": "Totally misleading photos on website.", "text": "The tops I purchased were nothing like advertised. I actually thought one they had sent was a different item. The colour was much darker, the cut was different, the length was ridiculously smaller than it was in the photo.The other item was colour as advertised, totally different cut and this wasn’t due to the wrong size being ordered, the shape just totally different.They make it purposefully difficult to return items.Will certainly not be buying again, as the images are fake I’m sure.", "rating": 1}, {"title": "Swim suit bottom lacks comfort", "text": "You left the following comment: the agent was very helpful answering questions. However  the bottoms of this swim suit needs to be fully lined not pleased with the lack of protection between legs and backside of suit. Very dissatisfied with bottoms. You left the following comment: Thanks for your help however the bottoms of this swim suit needs to be fully lined not pleased with the lack of protection", "rating": 1}, {"title": "Same model picture, different garment", "text": "Does nobody else find it hilarious that the models are quite clearly not actually wearing the dress in many of the pictures. The model is in exactly the same pose, you can see by hand positioning and then a computer image of a dress has been placed over it! Very misleading to the fit of the garment. She seems to have her hand in a pocket on many of the dresses!!", "rating": 1}, {"title": "never received my order on…", "text": "I ordered three blouses and earrings on October 1 something I could wear for the holidays early December I tracked it to LA as of January 9 it was still in LA. I am trying to contact them now unsuccessfully the phone number listed just goes to a fast busy signal life tried several times. Do not trust this company", "rating": 1}, {"title": "Too good to be true", "text": "Too good to be true, 1 stained dress, 2 dresses nothing like photos on web.  Been trying to return but unable to submit details online and a customer service assistant via chat was supposed to email me with return details…. Nothing!! £120 gone if unable to return.  AVOID", "rating": 1}, {"title": "I am really disappointed with this…", "text": "I am really disappointed with this company. I am not going to be ordering anything from them ever again. I received 3 shirts, they didn’t fit at all, way too large!! I contacted customer service to get refund, plus a return shipping label & return address. I was promised to receive it, within 1-2 weeks. It has been 3 weeks, plus. Nothing has been emailed to me to help me out with the returns. I have sent them/customer service a complaint email about the whole experience. Wish me good luck with this, what a ripoff company!! I will never order from Rotita again!!", "rating": 1}, {"title": "Fraudulent company do not use", "text": "Ordered two items received the first after a week the quality worse ever on the ladies blouse made in China the quality dreadful please avoid using this s company.I never received the second item After a month and several emails send so I have had to go back to my bank to arrange a charge back for fraudulent funds taken for goods not received. Do not use this company goods are from China and very poorly made", "rating": 1}, {"title": "Only putting 1 star as the least u can…", "text": "Only putting 1 star as the least u can put, would be -0 don’t bother! Item looked nothing like picture contacted them to send back they said I had to pay return costs and it would cost more than the dress and you don’t get refunded! Terrible customer service warning don’t use! Terrible place", "rating": 1}, {"title": "Do NOT purchase anything from Rotita", "text": "Do NOT purchase anything from Rotita, what a waste of time.  The sizes I purchased were the sizes my wife wears, they didn't even come close to fitting.  the quality of the product was OK at best.  You can go to Wal-mart to get something similar for less.  OK, that's fine, I'll return them.  I return them and once received by Rotita, Rotita does the following: 1) they give you store credit, that's not what I asked for, I want a credit to my credit card, and 2) they deduct the shipping from your credit amount - REALLY who does that.  NEVER EVER purchase anything from them.", "rating": 1}, {"title": "3 dresses-not received but misdelivered elsewhere", "text": "I ordered 3 dresses June 8th, I live in TEXAS.  Tracking # for package states it was sent to an \"Individual\" in a  warehouse in New Jersey (not the actual Post Office) on June 23rd.  No one at Post Office has contact information for Rotita's assumed warehouse.  And customer service at Rotita keeps telling me it's nothing they can do and won't resend clothes order or refund my money....so I am now forced to file an official claim ad review against Rotita in USA.   This is ridiculous, as I've wasted 3 hours of my life on the phone and online trying to get help to no avail. Rotita originally sent package to an old address that i haven't lived at for 18months, however, the shipping information showed my current address when order was placed and per confirmation email. order # 92124903245031800001471857", "rating": 1}, {"title": "DONOT BUY", "text": "After a month of ordering I received the items they are not good, quality is not great I paid 82$ for a shirt and dress biggest mistake I made, they will not let you return and say you have to pay return cost They offered me 5 USD and said keep the outfits! Horrible horrible customer service The dress has no linings ND nothing like the pictureDONOT  buy from here I have reported this website", "rating": 1}, {"title": "I've come on here hoping to see what…", "text": "I've come on here hoping to see what the sizes are like but all I seem to find is how good and helpful the customer service are in returning goods. So my assumption is the clothes r shocking and everyone who has orderd has had to send items back there's not even any feedback on the quality of the clothes", "rating": 1}, {"title": "NO SHOW CHRISTMAS GIFT", "text": "I ordered 3 tops in November,  2 for me and 1 for my daughter for Christmas.  I received the 2 for me, but as of this writing (December 24th) I have not received the other one.  I have communicated and started a \"ticket\" and keep getting the response, \"wait 2 more days\" then \"wait 7 more days\".  NOPE, done waiting.  I would like a refund, but doubt that will happen.  Never ordering from here again!", "rating": 1}, {"title": "I ordered 2 swim suites on 3/16/2023", "text": "I ordered 2 swim suites on 3/16/2023, they confirmed they received my money 3/17/2023.  They didn't ship until 4/3/2023, even after 4 chats with customer service telling me they have changed my order to \"expedited\". As of 4/12/2023, my order has gone from Los Angeles, CA to Woodridge to Chicago, IL to Elk Grove, IL and I live in Arizona, the state next to CA. It has been 4 days shy of 1 month, so this is truly the slow boat from China. And i can't even tell you how many emails I keep getting from this company asking me to order more - NOT GOING TO HAPPEN!!!", "rating": 1}, {"title": "ABSOLUTELY DISAPPOINTED", "text": "ABSOLUTELY DISAPPOINTED Took my money from my bank account without sending an order number had a hell of a job trying to get one top arrived finally bad quality material too small but I ordered a larger size DON’T USE THIS COMPANY  would not give any stars", "rating": 1}, {"title": "I recently ordered a few outfits and…", "text": "I recently ordered a few outfits and received no email confirmation but payment taken. I’ve attempted to contact though email and chat without success. I looked up reviews and thought company reliable but I’m now doubting my division to purchase!", "rating": 1}, {"title": "First time purchasing", "text": "First time purchasing - cancelled immediately after ordering literally 15 min and was told it was already shipped they could do nothing. As suspected did not fit and to add to injustice they only mailed 3 out of the 4 items purchased.", "rating": 1}, {"title": "Don’t waste your time", "text": "Don’t waste your time - returns have to be made to the USA and you have to pay for the return which is extremely costly. I ordered a bunch of bikinis but every single item was received damaged with mainly manufacturing faults. Marks damages metal of Bikini discoloured etc. I sent images for every single item and was told I could keep for 20% discount. I advised thank you but don’t want to keep, I then asked for prepaid label to return the goods not fit for purpose but rotita will not pay and will not reimburse either! The return fee is £30 so I have paid my money for damaged goods … and have to pay £30 return fee for items I cannot keep. Really poor service honestly wish I never ordered but everything looked so nice online so disappointed", "rating": 1}, {"title": "Horrible company to deal with", "text": "Horrible company to deal with! I paid with my PayPal account received the first shipment a couple weeks later. I was waiting arrival for the last four pieces on the second shipment, but it never arrived. I continue to track the US PS tracking number and it continued to tell me that it was in Los Angeles, but in transit soon. I waited and waited for it to arrive to my locked mailbox at my residence. It has never arrived. Now they tell me through numerous emails that I have sent back-and-forth that the time limit has expired and there is nothing they can do . Did companies really get away with this? Is this acceptable business practice? Charge a customer almost $150 for clothing and four of those pieces never arrive? Don’t do business with this company.", "rating": 1}, {"title": "Don't buy!! SCAM SITE!!", "text": "Don't buy, total scam!!!clothes made by monkeys... dispute all purchases when they will not give your money back, then the credit card company can go after their bank and they will get shut down.  Beware- other companies same crap, I think they have 5 companies they use the same pics for. Flycurvy, Curvedream or something like that, also Rotita Don't waste your money or time!!!!", "rating": 1}, {"title": "Hopeless customer service", "text": "If I could give minus stars that would be appropite. Item arrived promptly. No paperwork in parcel Emailed them to say item wrong size please send me return label or at least a return addtess. Email came back asking me to confirm that I had received the goods. I replied asking again for returns label/procedure. I received another automatic reply asking if I had received my order. Complete nightmare. Please ensure you want the goods, order correct size etc before you buy from this company as it looks like you cannot return them. Update 7th June in Response to your reply: My issue is not with the quality of the garment. Its fine, just too big. My issue is that there was no enclosed receipt, returns label or return instructions. Each time I ask for these I receive an automatic \"have you received your parcel\" email. Even your response to my reveiw does not address the stated issue.", "rating": 1}, {"title": "Inferior quality", "text": "Bought two evening jumpsuits theatrical was cheap finish was cheap and the after service terrible,was going to cost $58 to return to USA or England? I feel that there should be some responsibility taken for false advertising won't be buying from them again", "rating": 1}, {"title": "Ordered a swim shorts set for £30.54 …", "text": "Ordered a swim shorts set for £30.54  was told the order was cancelled and to ask for refund. Asked for refund but keep getting fobbed off with 10%and 15% extra off any clothes if i keep my money there in the wallet. Asked for the second time that i want my money refunded. Hate companys like this just take your money and have no intention of refunding   . Not sure where to go for help either. Just be careful when ordering.", "rating": 1}, {"title": "Ordered 2 bathing suits for my…", "text": "Ordered 2 bathing suits for my wife-they finally arrived-don’t look anything at all like the photos were. “Hard cup” tops, way too many straps and ties. Very laborious to put on and take off. We are returning them. However, their quality looks quite good.", "rating": 1}, {"title": "TERRIBLE COMPMANY AVOID AT ALL COSTS", "text": "Part 3 of if my report on this shambles of a company. Shipping date moved back again. For the 6 or 7 time. Have waved goodbye to my order or my money. I also suspect the glowing trust pilot reviews are likely fakes.  DONT USE THIS COMPAMY. YOU WILL SURELY BE DISAPPOINTED AND FRUSTRATED ", "rating": 1}, {"title": "I ordered a few outfits got to checkout…", "text": "I ordered a few outfits got to checkout and supposed to be a 15% discount per advertisement and it wasn't deducted. Contacted this company and was told they credited my account for future purchases. Bait and switch Company. I want the credit back to my purchase", "rating": 1}, {"title": "Beware if you need to return items", "text": "The returns process is unnecessarily complicated and very time consuming. Also I had no idea the returns warehouse is in North America. The cost of returning the items would therefore be extremely expensive. I will probably end up donating the clothes to charity and I will never order from this company again.", "rating": 1}, {"title": "Ad said buy 4 get one free but I…", "text": "Ad said buy 4 get one free but I entered 4FREE and it said I had to buy 2 more items for the code to apply. If I hadn’t been buying some tops for an upcoming vacation I wouldn’t have purchased anything. Feeling very conned at this point.", "rating": 1}, {"title": "Absolute robbers", "text": "Absolute robbers. Make your search prior to ordering. You are buying items that are going straight to the garbage.Can't even reply with individual customized comments.", "rating": 1}, {"title": "Terrible company", "text": "Similar to other poor reviews; ordered a tankini, it did not fit so I wanted to return. Was told that, although items shipped from China, the returns had to go to North America, tracked postage. This would have cost nearly £20, as the items only cost £30 it just wasn't worth it. What a complete rip off. Will never use this company again.", "rating": 1}, {"title": "I ordered 3 bathing suits", "text": "I ordered 3 bathing suits. When they finally arrived (which took forever) they looked very different from the enhanced pictures on the website. The print was very poor quality and overall craftsmanship was awful. The sizes were way off, one of the bottoms was way large and the top looked to be a small. Buttons on one of the swimsuits were very cheap looking and not sewn on where they were supposed to be. Customer service is awful! Getting a refund is extremely time consuming and a hassle. They claim items ordered were non returnable/ nonrefundable but there was no mention of this on the item listing or prior to purchase, only when I logged in to return the items was there red print stating no returns on these 2 items. This company is a joke and scammers, unethical business with the final sale claims. I will NEVER order from this site again and would advise any and everyone against ordering from them.", "rating": 1}, {"title": "Disgusted!  DO NOT BUY FROM THIS SITE!", "text": "I ordered 2 dresses from this site, returned them as the quality was crap.  They were never worn, I took them out of the package and put them right back as I wanted to return them.  I returned both at my expense only to be told I would be refunded for one as the other had a \"peculiar smell\".  What BS.  The only thing that stinks is their customer service and truthfulness.  Since they refused to give me my money back for the one dress and I paid for it, I asked them to ship it back to me.  I will sell it elsewhere.  I have never been so disgusted and their tactics are so fraudulent.", "rating": 1}, {"title": "I placed an order for buy 2 get one 1…", "text": "I placed an order for buy 2 get one 1 free and delivery stated 2-5 days. When I eventually got my confirmation email delivery was for 3-5 weeks. I then tried to cancel my order on the App. I struggled. I chatted online they refused and said they rushed shipping - what a joke. I have emailed them now to say cancel my order and return my money! Let’s see the outcome? I wish I had seen these reviews!!", "rating": 1}, {"title": "The returns procedure is VERY…", "text": "The returns procedure is VERY difficult. They have refused my refund even though they have received the returns. This is a very dishonest company and I will NEVER use them again. Have given one star because no stars is not an option", "rating": 1}, {"title": "I cannot review the quality of the…", "text": "I cannot review the quality of the clothing items from Rotito, because I have yet to receive them. I ordered November 28 and needed the items for Christmas events. My order arrived nearby, but has been waiting on a shipping company to pick it up and deliver it to me. Then I get an email from Express Shipping informing me I need to pay the unpaid shipping costs ($2.00) before they will schedule my delivery. Even such a small amount is still extortion. The promised date of Dec. 15th would have been fine.FROM ROTITA: We are processing the order now and will ship it soon. We promise you will get the order before the estimated latest receiving Date: Earliest Date:08 Dec 2022 Latest Date: 15 Dec 2022.You will be thrilled with your order.", "rating": 1}, {"title": "AVOID", "text": "Update **Customer service has contacted me and they have given me a partial refund for my trouble. This will cover the return postage. Very happy with the speed of service and resolution.AVOID! AVOID! AVOID! Ordered some swimwear When it arrived it was too small and very cheaply made not even finished correctly. I tried to raise a return ticket via the app. I just kept getting a corrupted message, so I contacted customer service and they told me they had raised the return ticket and to wait 24 hours to receive the return address email. It hasn’t arrived I have now read other reviews and the return is in North America and it will cost me £30.00 to return the items-they are untrustworthy  -  avoid this company", "rating": 1}, {"title": "I ordered a swimsuit and instead lost my money.", "text": "I ordered a swimsuit.  The money was taken out of my account and I received a confirmation.  When I tried to track the order, it took me to a fake tracking site.  I tried to track my order on Rotita and it said the order number wasn't found.  This is a scam.", "rating": 1}, {"title": "I ordered swim shorts and top", "text": "I ordered swim shorts and top. Received it this morning. Wrong size and it smelt disgusting. Their returns are impossible. No terms and conditions regarding this. Please do not order from this company. They are a scam. I am giving my order to charity.", "rating": 1}, {"title": "Nightmare!!!", "text": "I am tired of explaining how inadequate this place is!!! I still want to order 2 items but cant!!!!!!!!!!@@What is the problem there!! I order clothes frequently at other stores all the time!!!!! Your system is inexcusable!! I can't get my 2 items from your company!!!! My credit is great!!! What is wrong with this system?????", "rating": 1}, {"title": "Disappointed.", "text": "Arrived early so that's the only reason for the star.Sizing is all wrong,  ordered 2 different items in the same size, I even ordered them 2 sizes bigger as wasn't sure how they would size up. 1 item just about fitted, the other (a 2 piece swim suit) couldn't even get it over my head! Total waste of money now I have to waste more money to send it back to the USA.", "rating": 1}, {"title": "Avoid like the plague!", "text": "Avoid like the plague!! They wouldnt refund my returns until I made a complaint to Paypal, returns cost nearly the same as what I was returning, shocking customer service, Do not buy from them!!!!", "rating": 1}, {"title": "I’ve purchased from ROTITA for over 3…", "text": "I’ve purchased from ROTITA for over 3 years! I’ve had to give away a lot of their products for poor fitting! My most recent purchase included 5 pieces, 4 styles in the same color. I tried on only 2 pieces, they were horribly fitting, tent like! So after 3 years and spending over $1000. I decided to make my first return! I received correspondence that they would not refund me because they smelled putrid! If I had on 2 of the 5 blouses for 30 seconds it would be a lot! I feel I was treated so poorly and I have zero faith in this company! Not only will I never buy again but I will spread the word to our 8000 member community of their rip off behavior! ROTITA is not a reputable company STAY AWAY ", "rating": 1}, {"title": "So the company takes your payment asap…", "text": "So the company takes your payment asap I have had to return goods that was worn before sending to me it had black marks on the hem and totally wrong colourIt's cost me £25:00  to return package to USA and this was  the cheapest courier other couriers wanted £55:00 this was May 5th they still not paid my refund £94:84 Absolutely awful customer service and company don't use at all", "rating": 1}, {"title": "Reason for 1 star coz I see so many…", "text": "Reason for 1 star coz I see so many lovely bikini for summer and all go up to D cup no f or g or gg Cup size soni can't buy 42 inch bust", "rating": 1}, {"title": "BEWARE!!!!! I ordered a dress from this website and it took 6 weeks to get here. It was in transit from 2 foreign airports.  The dress was cheap and unexceptionable!!!!! They will not accept returns. ", "text": "BEWARE!!!!! BEWARE!!!!! I ordered a dress from this website and it took 6 weeks to get here. It was in transit from 2 foreign airports.  The dress was cheap and unexceptionable!!!!! They will not accept returns. ", "rating": 1}, {"title": "I used the live chat to find out about returns.  I was pleasantly surprised with all the information and helpful assistance I received.I bought 2 bath suits.Both were of very good quality. 1 was large", "text": "I used Live chat and was pleasantly surprised at the helpful information I received.I would help if return information was cited on the website.  It explains the policy but not how to use it.", "rating": 1}, {"title": "Horrible Quality material", "text": "Horrible Quality material. One of my outfits came bundled in a bag with dog hair on it. someone had worn it, rolled it in a ball and put it in a package and thats what the. company sent me. I tries to get the other ones altered but they would not do it because they had such uneven hemlines and lengths were different on each leg and arm. Really shocked at how bad these outfit's were.", "rating": 1}, {"title": "I ordered 5 items - Very disappointing", "text": "I ordered 5 items - The fabric was poor and return postage from the UK was so expensive that they were not returnable. Also beware of the items where they do not accept returns anyway", "rating": 1}, {"title": "I never received my items", "text": "I never received my items.  They are lost in the mail system. I wanted them shipped to my Florida house but instead went to my Pa. Address and then should have been forwarded down to Florida, I am still waiting...", "rating": 1}, {"title": "Will not order from this company again", "text": "Will not order from this company again. Takes way too long to receive anything. It has been over 2 months and I still haven’t received my order. I ordered long sleeves and it is almost spring. If it takes this long to receive orders I will order from someone who doesn’t take so long. I am really disappointed.", "rating": 1}, {"title": "Not worth a star !!", "text": "Not worth a star !!! DO NOT buy from this company. I ordered a very expensive tankini set, the strap was breaking off at the back so I messaged them and sent pictures but they have not got back to me as promised. They totally ignored all my messages and emails. I have had to report them to clear pay and I am now getting my first payment back from my bank. This is a joke. No replies, no contact, nothing.Poor quality clothes, over priced and zero customer help.BUYER BEWARE", "rating": 1}, {"title": "Do not use this company", "text": "Do not use this company. They will help themselves to money from your account. Made 1 order received 3 all charged for. Asked for a label to return goods and was told I need to pay to return £28 cheapest. Disgusting customer service. Avoid like the plague.", "rating": 1}, {"title": "DO NOT BUY FROM THEM !", "text": "All there replies are absolute rubbish . I truly don’t know how they’re allowed to get away with how they run this sham of a business. I have no doubt the positives are written by themselves. Nobody could be pleased with the quality of their ..clothes !That’s the first I’ve heard about free return ! Not what it said in email I finally received.. almost funny .", "rating": 1}, {"title": "Buyer beware: deceitful returns approach and lack of transparency", "text": "Ordered 3 items for size and preference, kept one and returned the others the same day having simply tried each on in my very clean and tidy bedroom, using the same packaging they were sent in as had kept everything neatly together knowing I would only be retraining one outfit. The quality of the material wasn’t great, but I expected that for the price (the sale price is a fair reflection of value, I’d definitely say full price is absolutely not) and was happy to keep one. However, following return as per the company policy, I received an email stating that no refund would be issued due to stains and smell on the garments, and alleged photos attached to document the concerns. Actually, no photos were attached and the links were empty. Having immediately contacted the company to challenge the decision and ask for sight of the alleged stains, I had a second email response stating that there was ‘dust’ on the items making them unsaleable and in contravention of the returns policy. Again, no images attached and when I replied querying the difference in alleged faults and the lack of visual proof being provided, I was offered 50% of the costs reimbursed. As this was only about £20 and frankly I had neither the time nor energy to keep emailing and pushing it, I accepted the refund and thought I’d just treat this as a lesson learnt not to shop with Rotita again. However, the money was then credited to my account for use on future purchases, rather than refunded to my payment method. So, I had to write yet more emails, attaching the proof of the previous offer of a reimbursement and pointing out that based on my experience I wouldn’t ever shop with them again so credit was no use at all. After several weeks and emails, I finally got the refund issued and a valuable lesson learnt. I would neither trust nor recommend this company to anyone - the advertised returns policy is clearly not followed and a level of dishonesty applied in seeking not to refund returned items", "rating": 1}, {"title": "Worst Online Purchase Ever", "text": "WARNING TO ALL POTENTIAL CUSTOMERS...ROTITA DOES NOT OPERATE THEIR BUSINESS IN A TRUSTWORTHY MANNER. SHOP ELSEWHERE.  THE QUALITY OF THEIR MERCHANDISE IS POOR AND SIZES DON'T JIVE WITH THE MEASUREMENTS.................................................................................................Where do I start? I placed an order on 7/2/24 for two swimsuits for a scheduled vacation. They never warn you it takes weeks to receive your items and that their business is not located in the USA. My estimated latest shipping date was 7/5 but the items were not shipped out until 7/10.  Eight days for processing a package for shipping is an extensive amount of time. I didn't receive the package until 7/16 which was too late. I had just left on vacation. When I returned, I contacted customer service and requested a refund. I sent the items back unworn in 100% new condition in their original packaging. Their policy is once their warehouse receives your package, they will have 7 days to review the items and issue a refund. I had to contact CS via email because I never received the refund.  I tracked my package and it was delivered on 8/2. I waited the 7 days and nothing.  CS said the warehouse needs more time to review the items and to be patient. Long story short...after numerous emails back and forth with CS, they tell me I received a store credit. I was livid and told them I never authorized a store credit and told them to credit my credit card which was the original form of payment. I finally received a refund, but it was not the same amount as the store credit. They charged me for using the return shipping label which is their policy. My biggest problem with this company is that they charged me $3.72 for shipping insurance (I had a coupon for free shipping) and my bank account was charged a separate international service assessment fee of $2.01. The total purchase price was $67.04. I received a refund of $52.33. I lost a total of $16.72. That is a lot of money to lose when making online clothing purchases.  MY POINT HERE IS TO STEER CLEAR OF THIS SHADY DISHONEST BUSINESS. THEY ARE ONLY OUT TO TAKE YOUR HARD-EARNED MONEY AND SCAM GOOD DECENT PEOPLE. IF YOU WANT TO BUY INTERNATIONALLY, GIVE TEMU A TRY. THEY ALWAYS HAVE FREE SHIPPING AND FREE RETURNS!", "rating": 1}, {"title": "Quality is cheap and shipping is a ripoff", "text": "Quality is cheap!  Don't be fooled by the pics!  Return policy sucks they charge an outrageous amount for shipping and then ship by the cheapest method!  Highly recommend you avoid this ripoff company", "rating": 1}, {"title": "This company is useless.", "text": "This company is useless.. trying to exchange size . Many many emails back n fourth … 4 months later they refunded", "rating": 1}, {"title": "This company is absolutely horrible and…", "text": "This company is absolutely horrible and should shut down! When I got my jumpsuit it was so cheaply made and wasn’t even true to size. So I went to the online chat to see if I could have that item replace with something else and they said yes so I pick something out and they said it would be shipped to me. Now mind you after them telling me all of this They asked me to please give them a ton thumbs up and tell people if I was happy with the response they gave me. Of course because I thought that they were doing what they said I did that. But for two weeks I’ve been getting the runaround about having the merchandise replace that I didn’t care so I know they just simply lied. Horrible company save your money shop somewhere else", "rating": 1}, {"title": "Ordered items on October 27th", "text": "Ordered items on October 27th. Was told items would be sent between November 7th-11th. Next , I was told they would be sent out by November 22nd and that was not true. Was going to buy my daughter some blouses for Christmas, but obviously I can’t depend on them to get here in time.", "rating": 1}, {"title": "Total rip off ", "text": " Ordered a top came back nothing looks nothing’s like the pic  sent it back Ipayed 36 dollars and 12 to post it back.  Rotita would only refund me 24 dollars  they said it was because the product was reduced.  Never shop theee again ", "rating": 1}, {"title": "Terrible refund policies.. so don't buy!", "text": "I bought two and they were unfortunately the wrong size, so I was going to order replacements but when I went to return them I was told I had to send them to the USA! I am in the UK, of course you have to send with tracking info so cost me just over £18 to send back! I then got a refund but instead of £54 I got £51, when I questioned this I was told it was the insurance payment! why should I pay for their insurance.Very bad experience and I warn everyone... I suppose it may be OK if you live in the USA but even then if you need to return it you will pay insurance and it does not mention this at all on the refunds page*** Update: In answer to your reply, I did not receive the breakdown of costs but I am sure I ordered two to avoid the postage costs! I have just checked your return policy and it still does not say you need to send them back to USA at your own cost so I would still suggest anyone buying outside of the USA avoids buying from this website!!", "rating": 1}, {"title": "I made my order on the 28/04/2023 I was…disappointed", "text": "I made my order on the 28/04/2023 I was told it would arrive between the 11th-17th of may it’s now the 21st and according to the tracking it hasn’t moved since the 5th mayI’ve made queries but no response", "rating": 1}, {"title": "Disgusting company scammers don’t buy, will get shut down", "text": "Disgusting company. Returns is a joke. I had to contact them to make a return as unable to do so on account for some reason. Took days and days for a reply. Gave me an address to return to. Cost me £23 to return this. Had another order which again couldn’t even make a return so sent them back with first order, sizes completely wrong. It takes them so long to reply and no once ounce of help either. Also they Have a uk address on parcel if it’s not delivered, but expect you to pay the £23 return fees to America which you won’t get back. Now trying to tell me that they won’t except returns after a date, even though they took weeks to reply to my email unable to request an return from account, which they clearly do to everyone!! Have reported the company and also other names they go by, also reported to trading standards. Two holiday outfits has cost me a fortune that a single mum like myself now is unable to get money back!!", "rating": 1}, {"title": "I received a text for FREE SHIPPING ON…", "text": "I received a text for FREE SHIPPING ON ALL ORDERS.   I went to the link and ordered a swimsuit. It charged me for shipping.  I spent literally hours on live chat.  Issue unresolved.   They kept saying that I had to spend $39", "rating": 1}, {"title": "SCAM SITE", "text": "SCAM SITE, EVERYONE SAYS THE SAME. THEY ARE ALL THE SAME SCAMMERS, 4 DIFFERENT SITES, FLYCURVY, CURVEDREAM, ROTITA HAS 2 DIFFERENT NAMES. THEY WILL NEVER GIVE YOUR MONEY BACK WHEN YOUR CLOTHES DON'T COME, OR ARE DEFORMED. THEY HAVE MONKEYS SEWING THESE CLOTHES...ONLY WAY TO EXPLAIN IT. SAVE YOUR MONEY AND TIME, DON'T BUY!!!!They want to fix it but I tell you that is a whole lot of crap they don’t give back a dime and it’s crap merchandise.", "rating": 1}, {"title": "Avoid this company", "text": "Item not received. Avoid this company. I ordered and paid for a swimsuit on 22nd Feb. This was supposed to be delivered by 1st March. Despite numerous emails and live chats I still don’t have my order.. I received a tracking number which eventually said it was delivered on 14th March. This has not been delivered to my address and I tried to contact the courier who turns out to be Evri but you can’t speak to a person it is all automated. I asked for proof of delivery but nothing has been presented. I asked for a refund and just keep being asked to wait for an email saying where the parcel is. I go on my holiday on 16 th April so need to purchase elsewhere. The customer service is non existent you just get fobbed off. As I paid via pay pal I will take the refund up with them. Never again will I attempt to order from RotitaCLEARLY THE REVIEWS ARE NOT READ PROPERLY. THE REPLY IS APOLOGISING FOR ME NOT BEING SATISFIED WITH THE PRODUCT. MY REVIEW CLEARLY SAYS I HAVENT RECEIVED THE ORDER SO CANT RETURN  IT AS ADVISED. THIS IS BEYOND BELIEF NEVER AGAIN !!!!!", "rating": 1}, {"title": "Not been refunded for goods returned and received keep being promised but not happening", "text": "I ordered goods from Rotita and they were delivered in May. I started a return for three items that were too small. Not the end of the world as I knew I could get refund. I requested the money be returned to my original payment card. The items were delivered back to them 22nd May. I waited the 7 days they stated on their website. I chased and chased and kept being told they had not received confirmation back from warehouse. Eventually I was emailed to say that although they had not received confirmation they would refund the money for the items within 1 to 3 working days. They came and went I went onto my account to find the refund had been put onto the rotita account to use at a later date. I did not want that so I contacted them via live chat to say I wanted money refunded to my original account. Then I received not one but several emails offering me a discount to keep the money on the wallet. Again several replies later I said I did not want that and want my money back now. We are 2nd June and still no money has hit my bank. I am absolutely furious as they are not honouring there own policy on returns. I put a bad review on the live chat and they had the cheek to ask me to take it down. I said once I have been paid my money. I will never use them again and would advise anyone that needs to return items be warned they do not like returning your money.", "rating": 1}, {"title": "Do not order from Rotita.com they do…", "text": "Do not order from Rotita.com they do not post out any orders I placed an order over a month ago and it still has not been posted so now I am waiting for a refund", "rating": 1}, {"title": "NEVER AGAIN !", "text": "I ordered on 12 14 2023 .  It was a Christmas Present If it was a few days late , no big deal .  It is 27 days later and all I have gotten is updated tickets as email responses of information I already knew .   On top of that what frustrates me the most is I have been inundated with email adverts at the rate of 3 a day , which comes out to 81 Ad's but no satisfaction on the delivery of my item .  I rated 1 star because they wouldn't let me score it lower .   Steer clear of this company . My life's purpose is to now place my review in every possible board I can , Horrible Company .The answer to this Email from Rotita is understaffing at the Post Office ???  WT F ... I haven't had trouble with any other company .  And they did nothing to compensate the customer .  I unsubscribed from the emails ,, That I must say you do well .   Your adverts are over the top .   Never will I use this company again and you are taking a chance if you do based on the countless bad reviews i read .", "rating": 1}, {"title": "Do not order from this company", "text": "Do not order from this company.  I’ve been stung before when I ordered various items from Rotita to the value of £189.00  I ordered everything in a size 18 & size 20 as I wasn’t sure what their sizing would be like.  Only 1 item actually fitted me, then I found out the return address was AMERICA!!!! & it would cost me £68 to return all the unwanted/too small or too big items!!!! Ended up lumbered with the lot!!!! This time round I took a chance on just 1 top, & ordered a size bigger than what I actually needed (better to turn out too big than too small as I can always take it in a bit).  It arrived today, the lace in the picture is pure white, the lace on the item I’ve received is an awful dirty cream colour……& guess what? Despite ordering a top in a size bigger than what I am…..it’s TOO SMALL!!!!! So I’mLumbered once again!", "rating": 1}, {"title": "This is not a reputable company", "text": "This is not a reputable company. Only 1 of 3 items were delivered and I having a hard time getting refunded.", "rating": 1}, {"title": "Replacement order gone missing! No help from Customer Service at all. …", "text": "I placed an order last year in April 2022 and the bathing suit top was too small. I paid almost $10.00 to return the merchandise and followed their instructions to return the entire package (top and bottoms). My replacement order arrived, however without the black bathing suit bottoms. I have made several attempts in Live Chat starting in June 2022' with Swoshi, Brinda, Oviya, Clara for months to find out when I can expect my black bathing suit bottoms. At one point, they said that they were out of stock and was going to issue me a credit. Well that never happened. So I continue to follow up with Clara and Brinda for the past several months and was promised that they will notify shipping and provided me with tracking numbers for USPS. I track the shipment for weeks and it was never shipped, the labeled was created but never shipped. On 2/19/23 I chatted with Clara and now she tells me that she cannot help me because this issue is too old 4/22/2022. I've been waiting for months and now she tells me that she cannot help, what kind of Customer Service is that. I sent several emails and I never receive a reply to my issue. If I would have known that I would never receive the black bathing suit bottoms, I would have kept the original ones from my first order and not follow their return instructions.", "rating": 1}, {"title": "This is general", "text": "This is general. So many people complain. If item is 'hot' and not in stock, then mark it as such on website.  Don't argue with people if they want a refund because of time delay.  They may not have the money to get something else, for the date required. If the items are that 'hot' you won't have trouble making your profits.", "rating": 1}, {"title": "They are dishonest and make you pay for return shipping for defective products", "text": "When you order from this company it is hit or miss.  Some of the clothing is adorable.  I ordered a jacket and even though I normally where an XL, I ordered 1 5X per size recommendations and still extremely small.  It came with lots of defects in the material.  Contacted customer service who said I had to pay for the return shipping.  When I complained and said that was unfair for a defective item, they replied and said once I pay for the shipping send them the receipt and they will reimburse me.  They did not reimburse me as promised, and when asked about it, they said it is their policy that customers pay the return shipping.  I pointed out their representative promised they would reimburse me, but they still refused to honor what they promised.  I don’t do business with dishonest companies.  It is a shame, because I would of definitely ordered more, but between their customer service out and out telling me a lie, the fact their size charts are inaccurate, and the quality of the clothing is hit or miss, I will have to shop someplace else.  Also if you preorder and item, they charge you upfront, then when they decide they can fulfill the order they don’t refund you, they just give you a store credit, vs a refund. Seems dishonest to keep your money under false pretenses.  This company Unfortunately is not trustworthy", "rating": 1}, {"title": "This company is constantly emailing me…", "text": "This company is constantly emailing me but im not interested and i have tried to email them but cant get through to them this company is harassing me and needs to be reported", "rating": 1}, {"title": "Hidden return fees of $31.97 for my…", "text": "Hidden return fees of $31.97 for my purchase of $91.93. My refund was $57.  Ridiculous and outrageous  fees.  I will NOT be using ROTITA ever again.", "rating": 1}, {"title": "I WAS NOT ABLE TO PRINT OFF RETURN LABEL", "text": "Date of experience: September 16, 2024", "rating": 1}, {"title": "I order 2 tops 11/11/22 and they were…", "text": "I order 2 tops 11/11/22 and they were suppose to be instock. The delivery date was told they would be delivered no later than the 12/10/22. Finally to a email on 12/14/22 saying they was in McDonoungh, GA. then on the 12/17/22 got one saying they been shipped and they was in FAYETTEVILLE, GA and was on the way saying the arrive would be 12/25/22. Never seen themand then another email saying they would be 12/30/22. So now there still in FAYETTEVILLE, GA. and get another date this morning saying the delivery date would now estimated to be delivered on10 Jan,2023 - 17 Jan,2023. This is really not good business when this stuff only moved 70 miles in over 2 weeks. I see all these reviews and the only ones they post on their website is the ones that has GOOD REVIEWS. As of now I cant give a good review cause I never got anything to review. These were all to be Christmas and Birthday presents and now I had to go out and spend more money due to not getting in a timely matter like the ship date was promised.Kinda laugh at their reply. Order slow cause of Christmas I ordered this the first of November and snow in the area lol. There's no snow in Georgia.  So now wonder what their answer will be to this. VERY DISAPPOINTED IN THEIR COMPANY", "rating": 1}, {"title": "Cost of returning items is ridiculous", "text": "Cost of returning items is ridiculous. Buyer be ware and read all the small print before ordering", "rating": 1}, {"title": "2 swim suits", "text": "I purchased 2 swim suits from rotita.  The delivery took a long time.  The size charts are way off.  I studied the size charts and choose the sizes I believed to fit right. I received the suits they were way to big.  I don't believe the quality was good. The materials were cheap and one had no hem. I will not buy from rotita again.", "rating": 1}, {"title": "When I tried to return something I was ignored…", "text": "When I tried to return something I was completely ignored and couldn't even get a response to receive a claim number to return.", "rating": 1}, {"title": "I was not impressed with the quality of…", "text": "I was not impressed with the quality of my purchase. The images online did not reflect the quality of my item.", "rating": 1}, {"title": "BAD BUSINESS", "text": "This company is a scam, they sent me an XS bathing suit when I ordered an XL and they refused to send me a new one until I paid them $10 return fee! BS!", "rating": 1}, {"title": "The return/exchange is a hassle", "text": "The return/exchange is a hassle. The quality of clothes is cheap and poor quality.  Not as seen on website.  Will never order from them again.", "rating": 1}, {"title": "DON'T USE THE ROTITA!", "text": "DON'T USE THE ROTITA!I ordered 2 bathing suits and 1 cover-up. The quality of those things is so poor and all things look very cheap. I returned the parcel to the Rotita. And never get my money back because I don't know my tracking number. So now they have my money and their goods as well.", "rating": 1}, {"title": "Why are the majority of reviews about…", "text": "Why are the majority of reviews about customer service people and not the products? Somethings fishy. It's a hard pass for me!", "rating": 1}, {"title": "BE AWARE AVOID THIS COMPANY", "text": "BE AWARE AVOID THIS COMPANY Having purchased 21 items for holiday every item was 3 sizes too small and had to be returned after arguing eventually got partial refund be cautious they will not refund the full amount and you have to pay for the return postage I am £136 OUT OF POCKET for purchasing from this company they promise the earth and on top of that the garments are badly made with bad quality material is all I've waited 9 weeks fighting to get back 2/3rds of what I a paid AVOID AT ALL COST I wish I read the reviews before purchasing", "rating": 1}, {"title": "i CAN'T SEE ANY SHIPPING INFORMATION ON…", "text": "i CAN'T SEE ANY SHIPPING INFORMATION ON MY ORDER DATED NOV 15th", "rating": 1}, {"title": "DO NOT TRUST A WORD THEY SAY !!", "text": "DO NOT TRUST A WORD THEY SAY !!I’m sure most of the 5* reviews on here are fake, all sound very scripted !! My experience with Rotita has been disgraceful. I place a rather large order, choosing items that stated ‘next day dispatch’. I was then told the order had been delayed because 2 items were out of stock. I explained that I needed the items before a specific date as I was going on holiday and I was PROMISED it would be there before that date. As the date got closer and the items still hadn’t been dispatch I asked to cancel the order but was told I couldn’t but that if it didn’t arrive in time I could return it at no cost to myself and I would receive a full refund. I finally got notification that it had been dispatched 2 days before my holiday. I contacted Rotita and explained there was no way it was going to reach me in time and I would be on holiday when it arrives. They said it was ok, the courier will return it if there is no one there & I’d be issued with a full refund straight away. They even assured me they would contact the courier to ensure it wasn’t left with a neighbour or in a ‘safe place’. This was ALL lies, the parcel arrived whilst I was on holiday, it was left with a neighbour, they then said I had to organise a return to USA (from UK) which cost me almost £50 plus they didn’t refund the full amount, I was charged for the ‘free’ delivery. So all told I’m now out of pocket by £60. Their promises mean nothing & they lie through their teeth so please be very careful when ordering from these crooks !!UPDATE:In reply to Rotita’s response…1. I first tried to cancel the order BEFORE it had been dispatched and was told it was not possible !!2. I was told that if order didn’t arrive in time I could return it at no cost to myself. 3. The order was almost £300 and qualified for FREE delivery however you have deducted delivery charges from my refund. 4. I was assured you had instructed the courier not to leave parcel with a neighbour etc but to return it, OBVIOUSLY A LIE !!", "rating": 1}, {"title": "Nothing like the pictures would not use…", "text": "Nothing like the pictures would not use again. Absolutely rubbish", "rating": 1}, {"title": "If I could give no stars I would", "text": "If I could give no stars I would.  I placed an order with them on 11/22/22.  The website stated I should have the items by 12/09/22 at the latest. On 12/13/22 it said still processing so I got in touch with them.  They told me item I order was \"hot\" so there would be a delay.  I told them I needed it by 12/23/22 and if they couldn't guarantee that then to cancel the order.  They said they would \"urge shipment\".  On 12/16/22 a shipping label was created and it was on it's way yo the USPS from some place in Queens, NY.  Well, it was on its way to the USPS for 10 days.  I told them to cancel the order.  That was 12:31pm my time on 12/26.  I get a response asking me to wait a few more days.  The next thing I find is that the order came back to the place in Queens that it had supposedly left on 12/16.  Then it ships at 9:39pm on 12/26.  Then I get a message telling me it is too late to cancel even though she tried immediately to cancel when I said to.  Ummmm....no, you asked me to wait a few more days. Then I'm told to \"refuse\" the order.  I wasn't home to refuse it plus at this point I already didn't trust them to refund me if I canceled.  I want to return the order but they want me to pay shipping.  I want a free return tag.  I don't think I should have to pay return shipping on an item that didn't arrive when expected and was shipped after I said to cancel the order. I feel like waiting for over a month to receive an order, one that I might add they took the money for immediately, is completely unacceptable and I don't think asking for FREE return shipping is too much!!", "rating": 1}, {"title": "RIP OFF", "text": "I returned 2 swim suites and i still don't have my refund i have since notified the BBB poor customer service i chatted with someonee 3 times and keep getting the same story that i will get a confirmatinon in 24 hours and a refund in 7 buisness days here is a month later and still getting the same story when i ta**", "rating": 1}, {"title": "I  am still looking for 4 tops", "text": "I  am still looking for 4 tops, my Christmas tops,I am hoping that you have mailed them to me.Thank you, Anne Armstrong", "rating": 1}, {"title": "I bought a jumpsuit which with postage…", "text": "I bought a jumpsuit which with postage cost £45 it was not suitable  so was returned after which i was £31would be returned to my bank thats about £14 charged for postage then today there trying to say it was marked so no money I literally took it out the packet looked at it and put it back no way did it get any marks on didnt even try it on this firm is a scam discussing", "rating": 1}, {"title": "Rubish", "text": "I have only given one star as that is the least as I would score a big fat 0 do not order from this company the dress I received was absolutely diabolical very cheaply made you can see through it nothing like the picture I have had better from Primark at least there clothes you can ware would I order again certainly not and they make it impossible to send back please don't waist your money.", "rating": 1}, {"title": "I would never recommend ordering from…", "text": "I would never recommend ordering from this company - the parcel took longer than it said in the details so was useless for what I needed it for and I now discover returns have to Gm to North America which is incredibly expensive- so disappointed as the adverts always look amazing", "rating": 1}, {"title": "I send several emails and I have never…", "text": "I send several emails and I have never received an answer although we had a very good collaboration previously", "rating": 1}, {"title": "If you not sending my order please…", "text": "If you not sending my order please return my money12", "rating": 1}, {"title": "I paid for 2 dresses and a blouse", "text": "I paid for 2 dresses and a blouse.  I have never received them.", "rating": 1}, {"title": "I am absolutely never going to buy from…", "text": "I am absolutely never going to buy from these again the item took ages to come and when it finally arrived it was two sizes smaller than the one I ordered and it’s a nightmare trying to find out how to return and there is no return label this is no less than theft if they make it hard to return then they keep your money and your left with a worthless item and I have to say the item is very poorly made DO NOT buy from this company", "rating": 1}, {"title": "Scam!!!!", "text": "Scam!  Don't buy from here!  Fake company. ...take your money never send goods!", "rating": 1}, {"title": "Terrible return policy", "text": "The order took forever to arrive and when it did, the items didn't look like the beautiful pictures on the website. The quality is not that great.  If you need to return, they charge you 9.99 to return and they also don't take all items back.  They don't alert you to this until you try to return the items.", "rating": 1}, {"title": "IMO Fake 5 star Reviews", "text": "I read many of the 25% 1 star reviews and 5 star reviews and have concluded the 5 star reviews are indeed fake.  The 5 star reviews are written in the same style as the company's responses to poor customer reviews. ie. Clearly English second language, as the English used is grammatically incorrect and do not in any case address clothing quality, or lack thereof.  Based on the legitimate 1 star reviews, I will not be purchasing from this company.", "rating": 1}, {"title": "Disgusting company", "text": "Disgusting company. I placed an order before 2 major events in my life, one was my husband's cancer diagnosis, the other was personal finance issues. I have never received goods from them and I couldn't find any way to cancel my order. Now I've had a letter in the post for late payment. Late payment for what!!!!! I have no products to pay for anyway..DO NOT ORDER THEY ARE SCAMMERS", "rating": 1}, {"title": "I would not recommend this company", "text": "I would not recommend this company. I returned items 2 months ago at the expense of £9.00 and am still waiting for a refund. I have emailed many times regarding this. I have also sent them a copy of my Post Office receipt twice. They do not reply. When you go on the chat it is not a real person just some bot device. I will never order again and have advised friends and family the same. Avoid this company!", "rating": 1}, {"title": "Please don’t you this company", "text": "Please don’t you this company. They have just refused to refund me after i returned my dress on time. After acknowledging delivery on time now they are turning around saying it didn’t arrive in time Who do i even complain to.? Now they have my money and their dress back. That is daylight robbery", "rating": 1}, {"title": "Money taken and no goods received.", "text": "I placed an order in March and two months later I have not received a single item from the order. I've tried to track the item but the Rotita tracking site is unuseable. I will never order from them again and would not recommend them.Next challenge will be getting my money back.As per the reply posted by Rotita - no such email received and still no goods.", "rating": 1}, {"title": "Customer Services Not So Helpful", "text": "The quality of the items I ordered are good, but unfortunately, when I had to return items - the return postage was £21 and the refund was £30.  Customer Services said if I removed my negative comments they would refund me half the postage, but they did not honor this and therefore I am updating my post with my original comments.", "rating": 1}, {"title": "ROTITA SEND ME THE DRESS I NEED FOR A…", "text": "ROTITA SEND ME THE DRESS I NEED FOR A WEDDING FAR TOO LATE .I M TRYING TO RETURN IT AND THEY CHARGE ME £21.00 WHEN ACTUALLY THE DRESS COST £37.00 RIDICULOUS COMPANY DO NOT ORDER NOTHING FROM THEM IM STILL ARGUING FOR THEM TO TAKE THE ITEM BACK WITHOUT CHARGING ME!😡😡😡", "rating": 1}, {"title": "Supply chain problems with Rotita", "text": "Unfortunately, I have to agree with some of the comments. Using Covid as an excuse is not acceptable.  Clearly they have supply chain problems. I will wait until 05 May which is 4 weeks after the original delivery date, which was 4 weeks from order!!! Else will advise my card company to return funds. Buyers beware you may not get your item for when you need it!!!", "rating": 1}, {"title": "Terrible Service", "text": "I placed my order on 28th March 2022. I checked my emails and I had an update to tell me that the order would be delayed until 11th April 2022. Nothing following that. Today 17th April I contacted their live chat. I was told it had not even been dispatched yet and that they would prioritize the dispatch. I am not happy at all with their service and lack of information. They cannot tell me when I will receive my order!", "rating": 1}, {"title": "Beware ordering from Rotita", "text": "Beware ordering from Rotita. I ordered four swimming suits, and returned four swimming suits with their return label. The package got lost in shipping so they would not refund my money. I was out $122.68 They said that because they did not receive the package even though I showed that I shipped it, they would not refund me any of my money. So beware!!!!!", "rating": 1}, {"title": "Impossible to get a refund", "text": "I have been trying for months to get a refund for a dress that did not fit and was sent back to them. It cost me £8 to return it to the USA at the address given and I’ve sent numerous photographs of postage parcels with the address on an incident number etc.I have contacted PayPal to try and get my money back and as yet no success. They have always got some excuse the latest one is they cannot open my photo of the certificate of posting so cannot give me my money back. I will not be buying from them again.", "rating": 1}, {"title": "Customer Service just fob you off.", "text": "I bought 3 swim costumes from this company. They did arrive but one had a big hole in the stitching & the other the bottoms were missing. I have contacted them 3 times to be told they will pass it onto the warehouse. No details taken from me. When I asked how they will refund me they have said by email. No email. I have even contacted them on different platforms & have still not got anywhere.REPLY TO ROTITA REPLY - No email has been sent. Stop lying to make people think you actually do something.I message and you fob me off each time.", "rating": 1}, {"title": "I wouldn't recommend rotita to anyone…", "text": "I wouldn't recommend rotita to anyone ,I want to return 2 dress that I order that I don't like and poor quality ,the dresses was £60 ,took them to post office today to return them and they wanted £29.80 ,I don't think so  ,I am now going to ring ofcom and citizens advice to ask what I should do ,", "rating": 1}, {"title": "I ordered an item in  February", "text": "I ordered an item in  February. By yesterday it had not arrived.  When I went to look it said item out of. Checked to make sure I hadn't had a refund.  No I hadn't.  I messaged them and they have refunded me now.  I wonder what would have happened if I hadn't contacted them.  Very poor. My advise is do not use", "rating": 1}, {"title": "WARNING", "text": "WARNING: I NEVER GOT all my clothing ( ordered 8 pieces) and got 1 piece!Spend $253.00 USD and got something for $30.00.WHEN I ASKED FOR MY MONEY BACK THEY SAID THAT THEY WOULD GIVE AND NEVER GOT.So I charged back my American Express card and got $220 back.", "rating": 1}, {"title": "Lovely clothes but terrible company for…", "text": "Lovely clothes but terrible company for dealing with complaints and returns. Expect you to pay £18 to return a product that they missold. Items that they say are uk size 20 are actually a uk size 14 just. They said the label says international sizes! A uk 14And a uk 20 are completely different sizes.", "rating": 1}, {"title": "Very bad service.", "text": "I ordered a dress from rotita on 25/02/2022. I didn’t receive any email  or tracking info from rotita to acknowledge it.Also, they have written a wrong incomplete address on the package. They only wrote the postcode.Your service is very very bad.This is the Tracking Number EQKPT8571719092YQLocation：UNITED KINGDOM", "rating": 1}, {"title": "DO NOT PURCHASE!!!", "text": "DO NOT PURCHASE!!!Customer service is rude and unprofessional i have never received this sort of service in my life they have sent me a item that is nothing like advertised completely see through awful item they will not help with the return as apparently its not a error of there apparently the material error is mine!!!", "rating": 1}, {"title": "Nightmare to return", "text": "Nightmare to return which cost 18GBP and still waitingfor refund which Rotita say was paid into my accountlast month but nothing has appeared on my bank statements.  As a result of the complicated addifficult returns system I would definitely not useRotita again", "rating": 1}, {"title": "0/1000000%", "text": "How effective can Ritita customer service representatives be if to date my returns have not been rectified?I returned the items since November 2021 and my refund is still pending.Do you call this effective service?This is an utter shame and disgra e upon this Chinese company that they say is based in America.", "rating": 1}, {"title": "i bought 3  christmas jumpers THE PICS…", "text": "i bought 3  christmas jumpers THE PICS IS PHOTO SHOP MADE THE PRODUCTS ARE OF TERRIBLE QUALITY .i was SHOCKED its a massive fake chinese company very thin material poor quality you simply cannot send nothing back with this dreadful company the trick they use is you must pay for the postage USA? IT COST A SMALL FORTUNE TO SEND BACK i lost 100 pounds on rubbish here can never get your money back NEVER BE WARNED.. THIS IS A REAL HONEST REVIEW .WHAT A MASSIVE RIP OFF I SUFFERD HERE ,", "rating": 1}, {"title": "Outstanding order still", "text": "Sent and order 2nd  April received message says would be eith me latest 25th April. No shipping email do can track contacted them, end of april, they said be shipped immediately as urgent, got shipping email, look on tracking app and it still hasn't be despatched , then receive another email saying its been despatched which it hasn't and it will arrive by 25th April,  so I'm assuming April 2023???? You gave Sent me the sane shipping information a number of times , and told me to wait 3 more days for the last 2 weeks, you  repeat the sane things over and over but nothing happens.", "rating": 1}, {"title": "Disgusting service", "text": "The service provided by Suganya was terrible. Returns are not made clear on the website and they provide no information until after you have order and need to return. The return address is in the US and customers are expected to pay the return fee so it will cost me £14 just to try on a poor quality item. Avoid this company.", "rating": 1}, {"title": "This is without doubt one of the worst…", "text": "This is without doubt one of the worst online companies I have dealt with. The quality of the clothing is poor. To send returns is confusing, misleading and costly. I would advise to buy with a different and transparent business. A total waste of £70.", "rating": 1}, {"title": "Good reviews have got to be fakes", "text": "Terribly disappointed. Their discount code only showed half the amount they were publishing when I put it in at checkout. Their customer service was lousy and I have to guess that most of the good reviews are phony. Go with names you trust!", "rating": 1}, {"title": "I placed an order for 3 items", "text": "I placed an order for 3 items, the money was cashed from PayPal immediately, but I did not receive a confirmation or an order number. The items did not arrive on time, so after 3 weeks I asked PayPal to inquire for me. PayPal reported that the items were shipped. Few days later I received the items but they did not fit at all, so I requested a return label. I shipped the items back but I received a partial refund. I inquired several times, but the company did not respond back.This is an awful experience dealing with this company.", "rating": 1}, {"title": "Blatant lying about shipment dates", "text": "Blatant lying about shipment dates. Was promised delivery between 4th and 14th April and on 16th April goods still in China. Cannot get onto my account and just keep getting promises and vouchers from Rotita. Do not but unless you want to wait months for your good.", "rating": 1}, {"title": "If i could give this company nil stars…", "text": "If i could give this company nil stars i would, took ages to arrive i spent £140 for a bag of total rubbish! three items were missing after numerous calls on chat i eventually gave up, they don't seem to understand what you are talking about! infuriating! please do not buy from this company as you will be bitterly disappointed as i am.", "rating": 1}, {"title": "Crooks", "text": "Crooks. Can’t get my money back from returns. Tried everything. Crooks", "rating": 1}, {"title": "The order arrived in good time and as…", "text": "The order arrived in good time and as expected but the quality of the fabric is poor. Sending items back is difficult and appears aimed at putting customers off doing so. There are many hoops to jump through including completing computer forms, taking and attaching pictures, paying restrictive amounts of return fees at post offices etc. Though I have received prompt return of my monies I will NOT use Rotita again and will advise my friends not to do so.", "rating": 1}, {"title": "I recently bought two item from Rotita…", "text": "I recently bought two item from Rotita i kept one wanted to return the unopened other I was told it would cost £20+ to send back to USA I did get a reply from company after contacting you the offer was 20% refund!! I have rejected offer. I want to return and get a full refund. But not at a cost of £20+ Scam!!", "rating": 1}, {"title": "Rude and unprofesssional", "text": "This is the most Rude company i have ever has the displeasure of dealing with. Needed to send something back but it was about 4 days late due to personal circumstances I could not return any earlier. WELL the customer service has been utterly shocking anywhere else would have returned after I kindly asked as a once off but not these clowns oh no and you should see their emails  The product was like a child's size and quite frankly tat. I have stopped payments and taking steps to get my other money refunded. Avoid these clowns at all costs they actually told me I had not OBEYED there policy yet they didn't mind sending the order to me weeks late in the beginning!", "rating": 1}, {"title": "Cheap nasty goods", "text": "the pictures advertised bear no resemblance to the clothes actually received. It is impossible to contact this company and there is no valid means of returning the goods without paying a fortune in postage.so a complete waste of timeDO NOT BUY ANYTHING !!!!!!!!!!", "rating": 1}, {"title": "Expensive delivery charges.", "text": "I have to agree with the previous review.  It's cost me £25.09 in delivery charges. I ordered a dress that wasn't the right size even though I measured myself and ordered the size according to their sizing chart. The returns process is straight forward but the costs are ridiculous! I have spent this money and have nothing to show for it. Most companies at least offer free returns and send you a label. I wont be shopping with Rotita again. Be careful if you live outside the US before ordering.", "rating": 1}, {"title": "Do not buy from this site", "text": "Do not buy from this site. Ordered a dress, which cost £40 including £6 postage, dress very poor quality (very thin fabric and in millions of creases) when I went to return the postage was £20 ( you have to pay tracking postage and don’t get it back) as they are in USA, so stuck with the dress. I did complain and they gave me £6.73 back!! I guess you get what you pay for and in this case a very cheap looking dress of poor quality - I wouldn’t give £5 for!! You have been warned!", "rating": 1}, {"title": "What a cluster - will never buy from them", "text": "What a cluster! They have apparently hidden the bad reviews with fake good ones. I spent over an hour shopping with this Chinese company Rotita. When the time came to put in my coupon code, they only gave me half of it. When I went on- line and chatted with “customer no-service,” his/her English was horrible and the conclusion was that I was to wait to get a new code in my inbox in the next 24 hours. The old code was what showed up 18 hours later with the same bad result. They had a note that said, why don’t you just buy it anyway and then call us later? Glad I learned my lesson before giving them my credit card info. I will never buy from them.", "rating": 1}, {"title": "I have absolutely no confidence in this…", "text": "I have absolutely no confidence in this company I have contacted them daily about a delivery and have been fobbed off every day.  The latest excuse is they can’t do anything because of Chinese New Year which ends on the 12th Feb.  But was told my delivery was at Manchester Royal Mail 😱 what has that got to do with Chinese New Year.  I have asked daily for a refund for none delivery to no avail.UPDATE. 15.2.22THE ITEMS FINALLY ARRIVED EXTREMELY POOR QUALITY, BAD FIT, BAD CUSTOMER SERVICE, TO RETURN ITEMS IT COST £26.50 NEVER USE THIS COMPANY", "rating": 1}, {"title": "I ordered 4 swimming suits from Rotita…", "text": "I ordered 4 swimming suits from Rotita at the cost of $122.68 and had to send them all back because they didn't fit right. I attached their label and sent the package back. It got lost in shipping so now they will not give me my refund. They said it is my loss. So beware of this company and their return policies.", "rating": 1}, {"title": "Avoid, very very poor quality.", "text": "My husband ordered two dresses, one from Rotita and one from Rrosewe dresses. Very poor quality, cheap and nasty material. Dresses cost £45 each. Both companies provided the same return address!!! Chinese quality products. Return cost us £25 (tracked to USA). Avoid!!!", "rating": 1}, {"title": "If I could go lower than 1 star I…", "text": "If I could go lower than 1 star I would. Ordered a Christmas sweater on the 29th, was told it would be here by the 21st. It is now the 23rd and it still hasn’t arrived in the country. Live chat to ask where it is was useless and they simply don’t care. Avoid this company at all costs.", "rating": 1}, {"title": "Don't trust what you are told", "text": "I placed an order in November and have spent hours trying to place my order, get the discounts advertised, and get my return issues resolved.  Since I have never ordered before, I went to the trouble of contacting Customer Service to make sure that I would receive a full refund if the items did not fit.  When I WAS TOLD THAT I WOULD BE ABLE TO, I placed the order, but the clothing was of poor quality. It cost me money (plus a foreign transaction fee) and I have no clothes. I feel that I was deceived and that further contact with customer service was of no help.", "rating": 1}, {"title": "Rotita WARNING I received a reply from this company but the link they gave to click on did not work and I immediately tried the 'Contact Us' route again giving details of my order no. but no reply !1", "text": "Rotita WARNINGThey posted a picture of a very sparkly green top advertised as \"Sequin Green Velvet Stitching Round Nevck Sweatshirt\"- I thought it was perfect for the Christmas season but when it arrived there were NO SEQUINS as it was just a printed material with different coloured circles.  I was extremely disappointed as this was completely misleading.  I tried on oh so many times for \"Contact Us\" team to contact me but absolutely nothing - not even an acknowledgement.  I am therefore saying \"BUYER BEWARE\" of this Company\"", "rating": 1}, {"title": "Items very poor quality and sizing is…", "text": "Items very poor quality and sizing is totally out. Need to return items but impossible to follow the instructed process as the website doesn't work when trying to return. Had to contact customer services and received a barely literate response asking me to return via tracked postage to USA that would have cost me the same as the items. Don't trust them to subsequently issue a refund (as the items turned up in a mess, so would be returned in a mess) so decided it's not worth risk of losing more money. Items have been put in bin.Very disappointed.", "rating": 1}, {"title": "BEWARE", "text": "NEVER ORDER FROM THUS COMPANY, SEE SOMETHING YOU LIKE ON THERE WEBSITE, GET IT FROM SOMEWHERE ELSE. I ordered 2 dresses and earrings from ROTITA.  The dresses looked lovely in the picture but on arrival the material was paper thin, the earrings were never packaged with the dresses, I tried many attempts to advise I hadn't received the earrings, they billed for them anyway. I returned the dresses, no return labels are included, which is a red flag straight away, it took ROTITA 7wks and a threat to go to the ombudsman to get my refund. STAY AWAY FROM THIS COMPANY.", "rating": 1}, {"title": "I wanted to return a parcel to Rotita…", "text": "I wanted to return a parcel to Rotita but before I could get a return address I wad asked to give a good review the item i ordered didn’t look anything like the photo on line ,I want people to know it cost £19 to return this item to the USA so I’m not going to bother", "rating": 1}, {"title": "A terrible business to deal with in our…", "text": "My original post below prompted a very positive and professional direct reply from Rotita to which I acknowledge and thank them for their service. Thank you.A terrible business to deal with in our experience. We purchased garments for my wife that needed to be returned. Having followed the protocol in place, latterly we received email requesting we login. Firstly, it says that the system doesn't recognise the email address and suggests registering.so we try to register and system states that email address already in use. WE CANNOT COMMUNICATE WITH THIS LOT! Rotita if you read this please refund our money, or send a communication we can both use to communicated.  So frustrating at least.", "rating": 1}, {"title": "I had ordered 2 making sure fit", "text": "I had ordered 2 making sure fit, knowing I was going to return at least 1, they say easy return.. But when trying to return freight was more expense than the garment.  What a con.. Be careful, you get what you pay for.. Never again.", "rating": 1}, {"title": "Disgraceful company", "text": "This company will only accept returns to America therefor you don’t return because the costs are so high.The goods are very poor quality and are not worth what they charge. Items look good due to clever photographs - I strongly advise you not to have anything to do with them. I believe British trading standards should look into this companyThey replied as you can see but they are not sincere in trying to resolve the problem that they have made by not clearly stating that returns are to USA - other reviews have raised this issue so I am not alone in being mislead. I did contact them as they asked but just wasted my time. DO NOT USE THIS COMPANY they are dreadful", "rating": 1}, {"title": "return policy", "text": "I recently bought 2 tops on line of which neither fitted.I contacted the company on line and was told I had to return the items at my expense to an address in America .Returning the items has cost me half of what I paid for the Items", "rating": 1}, {"title": "Rubbish returns", "text": "I bought two items M & L the M medium fit fine so wanted to send L large back was told I had to send back to USA at a cost of £20 what a scam. I was told I need a ticket number which I got but returns label unavailable!!!!!", "rating": 1}, {"title": "Rip Off Company", "text": "Avoid at all costs. They do not cover returns and their clothing is incorrectly sized. Purchased a number of plus-size swimming garments from this retailer. Items arrived and are at least 5 sizes smaller than marked. They don't offer free returns, I would have avoided them had I realised. To send the items back will cost £36 with the post office or Rotita offer 10% refund if items aren't returned. I spent £135.82. So essentially, it's paying a huge return fee I shouldn't have to or take a massive hit for only £13.58 refunded. On top of that, they take you providing your email for the order as permission to spam you with dozens of emails a day. Joke of a company. Poor quality clothes and scammy email behaviour. Avoid them at all costs.", "rating": 1}, {"title": "Never received my order", "text": "Never received my order. I have spoken with 4 different people now on 4 different occasions. First 2 said to wait another 3-5 days which I was happy to do. On the 3rd time I asked for a refund and was told this would be processed and I would recieve an email. This never happened. I spoke to a 4th person who was trying to tell me to wait longer as the order can't be cancelled. I said no I was told a refund would be processed and again another confirmation email. Still not received my item, any emails or my refund. Avoid using this company the customer service are all talk an no action.Update: order number WW2203261836029116Update: They obviously haven't taken the review seriously or read it properly as they have just emailed and told me to wait a few days, again. Ridiculous!", "rating": 1}, {"title": "Awful beyond belief!", "text": "Following on from my review below, Rotita promised to dispatch my order by 23rd April. I contacted them again to ask if it had been dispatched. The reply I got back was simply ‘not yet, we will urge for you’. This is honestly the worst company I have ever dealt with. I have absolutely no idea when I will receive my order, if at all. Avoid them at all costs. I placed my order on 28th March 2022. I checked my emails and I had an update to tell me that the order would be delayed until 11th April 2022. Nothing following that. Today 17th April I contacted their live chat. I was told it had not even been dispatched yet and that they would prioritize the dispatch. I am not happy at all with their service and lack of information. They cannot tell me when I will receive my order!", "rating": 1}, {"title": "Scam company", "text": "Scam company. DO NOT BUY from this company.  2 garments same size purchased and only one fitted. Had to pay over £15 to return faulty goods and they refused to refund me", "rating": 1}, {"title": "Poor quality, poor fit and high cost of returns to USA", "text": "High cost of returns does not make it sensible to purchase from this company. The returns have to go to the USA, and cost £20 to return an item that cost me £30 plus delivery. Poor quality and fit$", "rating": 1}, {"title": "Terrible experience", "text": "Terrible experience. The order arrived early but the option to refund was not available as the website did not mark it as delivered. I emailed and didn’t get a response.The option to return has finally appeared and I clicked on it and it says that I am out of time for returns.It’s a scam as they wait until it is out of time to then allow the return button to be clicked so you are stuck with the item. Have spoken with customer services and they repeat the same lines over and over and do not deal with the issue at hand. Would not recommend at allTheir response below is also a lie as I have been back and forth with them and they say that as I contacted them through the webpage that I have no proof and so no refund. Appalling", "rating": 1}, {"title": "I order several items", "text": "I order several items, and only received one. That item was way to small. Didn't try to recover money. They can keep it. They just lost a customer. Thanks for nothing.", "rating": 1}, {"title": "Expensive mistake", "text": "This was advertised as a swimsuit with skirt. There was no swimsuit, only a padded top. It also took weeks to arrive. It wasn't cheap either.", "rating": 1}, {"title": "I purchased some items and returned…", "text": "I purchased some items and returned them last year November and to date I have not received my refund.I found the quality to be crop with the 7 items I ordered.", "rating": 1}, {"title": "This company is really terrible", "text": "This company is terrible!  I keep telling myself not to buy any of this rubbish from China but each time I weaken and think that by now they must have sorted themselves out regarding sizing - but no! I ordered two garments and both arrived ripped and the largest was smaller than the other of the same size. One other items ordered was not even in the parcel.  After sending photos of the damage, I was instructed to rip up the garments and send photos of the pieces if I wanted a refund!  I had told them I would give the items to a lady collecting for the Ukraine effort and pay for the repairs myself, but they wanted the items destroyed.  It is hard to imagine a more irresponsible or useless seller.  PLEASE don't go there!** Since writing this review I have had another communication from this company asking me to return - in good condition - the items they asked me to cut up yesterday!  I have escalated the matter to PayPal.", "rating": 1}, {"title": "I am having trouble posting a…", "text": "I am having trouble posting a (positive) review. All I've got to say is Clara responded quickly and allayed my concerns. I am a happy vegemite.", "rating": 1}, {"title": "Absolutely horrible company..sizes…", "text": "Absolutely horrible company..sizes aren't right they don't except returns if it's on Clearance so then your stck with their product", "rating": 1}, {"title": "PLEASE PLEASE think VERY CAREFULLY about ordering ANYTHING if you live outside the US", "text": "Should be ZERO stars. Spent just under £50 on two items - prices seemed reasonable, but a wee bit on the high side. One item was lovely but a bit small but the other was of REALLY poor quality material. Arranging return seemed straightforward until I read that I'd have to pay for return postage. I didn't think that would be a problem for a parcel weighing less than a kilo until I read the return address - New Jersey USA! Turns out that I'll need to spend a minimum of £18.80 AND have to drop off the parcel (otherwise almost £27 for pickup). If I drop the parcel of then it will cost me just over 38% of the original cost of the items I bought. It costs so much that coupled with the whole posting hassle along with the wait for the refund that I'm actually considering just keeping the stuff - I expect that's what they hope you'll do... BEWARE. IF YOU DON'T LIVE IN THE US THEN GO ELSEWHERE.", "rating": 1}, {"title": "I was going to order quite a few items…", "text": "I was going to order quite a few items from this company, however after reading the dreadful reviews I have changed my mind!", "rating": 1}, {"title": "Good until you have an issue!!", "text": "ORDER W2202070540445706Ticket 0397413661I ordered tons of clothes from Rotita over the years,  and all was well until I received two items which were of poor quality/fit.I contacted their customer services to get a full refund, trusting that it would be as easy as stated on the site.Big MISTAKE: it appears that the only solution for a U.K. client is to send back the items to the U.S… costing more than the initial cost, at the client’s charge!!What a JOKE!They were very inflexible-yet polite as they apologise- and the best they could offer was a 20% refund without me sending the clothes I will never wear or be able to sell… about £8 out of nearly £43!!So just be aware that ordering from them is a gamble.I found this experience unpleasant, their response unacceptable & I fully intend to inform anyone not willing to take the risk to send money to a company without any Rep.in U.K. or even in Europe.I will have to find another company who values their loyal  clients.", "rating": 1}, {"title": "I am very disappointed with the Rotita company…", "text": "I am very disappointed with the Rotita service and the products I received in my last order.In March 2022, I ordered and paid for 4 swim skirts;In May 2022, I received 4 unfinished swim skirts. The hems were unfinished unlike the catalogue photo and skirts I had purchased earlier;I immediately alerted Rotita to the fact that I did not receive what I paid for, due to a Rotita error;I provided photos showing the difference between finished skirts, initially purchased, and unfinished skirts received in the later order;I was told that if I paid to return the unfinished products. Rotita would refund my money.I indicated that all I wanted was the finished skirts I paid for. I am happy to return the products Rotita sent in error, but I don’t understand why I would have to pay for a Rotita error.Ninety days later, i) I am get to get the finished skirts I ordered and paid for in March or an explanation of how I can get them.ii) I am storing Rotita's unfinished products the return of which they do not want to pay for.  I am VERY disappointed about the unfair way this company is treating is treating a customer.", "rating": 1}, {"title": "Buyers Beware", "text": "I placed an order on September 26, 2021. The delivery time frame was between October 8 -18. I never received the order and had to file a case with Paypal on October 29 to get a refund. The order showed a shipping status of Jamaica, NY as of September 30 but the status never moved. I contacted Rotita customer service on several occasions and was told to either wait or that the company would \"urge\" logistics. Customer service initially offered a refund of the shipping fee for inconvenience. I continued to wait after latest delivery time frame but noticed shipment hadn't moved from the 9/30 tracking status. I finally asked for a refund. I was told I'd receive a refund minus the insurance fee, which is contradictory to the return policy that states if an order is outside of delivery date a full refund is to be issued. I was patient and waited but the shipping status never changed. I received a full refund through Paypal on November 28. As a first time customer this was a horrible experience.", "rating": 1}, {"title": "Terrible service and slow processing", "text": "Horrible service, answered my question with promptness but not a trustworthy company. I ordered nearly $300.00 in clothing items and it has been nearly a month and they keep saying, “wait a few more days for shipping”.  They are very unreliable and you only have email contact with them. They keep giving you worthless coupons to drag your order request out. I always render a fair review for a company but this company is not one I would trust for my clothing needs. They are horridly slow and please don’t believe them when they say shipping is 5-7 days. They cannot accommodate when you order from the US and use COVID as an every day excuse. Every email you receive, they will state COVID is why they are delayed. Don’t believe I will ever use them again. I have to have my money reversed because I can’t get a refund. Have to report it as fraud because they advertise what they can’t honor. Please don’t do like I did, just find another company to order from. You will regret using this company.  I’m going to post this review to other sites so others won’t have to go through what I went through. Bypass this company.", "rating": 1}, {"title": "Rotita's return policy is ridiculous…", "text": "Rotita's return policy is ridiculous $10 taken off the product first thing and an unbelievably short time for returns.", "rating": 1}, {"title": "Sad company/fake reviews", "text": "So I saw an ad for this company whilst I was playing a game and I liked the look of their swim wear, I thought I'd have a look at their reviews as every time I've bought from an ad on a game I've found out the company is a major scam. Looking at the reviews it seems this company is no different. All the \"positive\" reviews are pretty much copy and pasted with slight variations, there's no way in hell they're written by actual human beings. All the genuine reviews are bad reviews, you'd think if you actually wanted to be a good company you'd stop scamming your customers, start selling decent quality clothing, have a better returns policy (it's obvious that returns are so expensive so they can pocket more money) and have better communication with your customers. Why even bother with the fake reviews? Do you think people are that stupid not to see that they're fake? Trust pilot needs to take a look into this company and remove all the fake reviews because some people don't look far enough into them and are caught out. Now I'm going to wait till they reply with their usual copy/paste nonsense saying all their reviews are genuine 🙄", "rating": 1}, {"title": "Appalling service. DO NOT WASTE YOUR MONEY.", "text": "Appalling service. DO NOT WASTE YOUR MONEY.  I felt the swimming costume was faulty as it was unfinished with raw edges because it was not hemmed. My first request to return it was ignored. I sent 2 more email reminders, one of which included a message to say their website will not allow me to login, 2 weeks later. Both were also ignored. Then, two weeks later, conveniently after their return window was closed, a reply came claiming they’d sent me instructions to return on their website but as I had not replied to it the return window was now closed. I never received any reply directly to my emails and since I couldn’t login I couldn’t see any other message which may (or may not) have been there. They were aware I couldn’t login.  Rotita first denied receiving my first return request and then a month later would not accept I didn’t receive some return info instructions after my 3rd reminder.  Obviously if the return address or an invoice had been included the parcel I would have been able to return immediately but nothing was. Such an approach obviously deters returns.Effectively they timed me out so their return window was missed and thus they refused a return. I would not recommend dealing with these people to anyone.", "rating": 1}, {"title": "Lesson learned never again …", "text": "After ordering 2 dresses for my sons wedding for myself and my daughter, took around 10 days to arrive. Daughters dress wasn't to bad but the one I ordered was covered in hot glue, trying to return is a total nightmare it works on a ticket system which takes ages for a reply (messages back and forth for days) they then give you a top secret location in the USA to post it back. They refused to believe the dress was faulty after  sending many pictures of the damaged dress . They try to offer me 20% refund and to keep the item . The cost of returning the dress to the USA was over £20 which they refused to pay. I'm pleased I paid with PayPal.which I then decided to open a case with. I returned the dress and got a all my money back plus p and p. They lie all the way, saying I hadn't returned it when I had all the information returned recorded delivery .. Never again to much hassle and took around 6 weeks to get money back. Oh and the size guide is bad.if your a UK size 12/14 it must mean your 6 foot tall and have very long arms with a massive back. Badly made clothes. Stay clear.. Hit and miss and if its a miss its to much hassle", "rating": 1}, {"title": "Terrible sizing and then you get charge…", "text": "Terrible sizing and then you get charge to return. Do not order!!!Order number W2202200830596179", "rating": 1}, {"title": "Don’t order from them", "text": "Don’t order from them, lm still awaiting my order from a month ago. it’s a scam🙁", "rating": 1}, {"title": "Very disappointment that i never got my…", "text": "Very disappointment that i never got my parcel.  The reply was it was lost in transet.", "rating": 1}, {"title": "I bought a blouse for £19", "text": "I bought a blouse for £19; very poor quality and fit. Looked cheap. I tried to return it to the UK address from where the blouse was despatched from. The company appeared to be Canadian based. However, it became apparent that I had to return the blouse to Hong Kong at a cost of £10. Rotita were very unhelpful and insisted that they would not cover the return postage. I was willing to post it to the UK addresss but not to Hong Kong. I checked that the blouse would be sent from the UK when ordering. I got absolutely nowhere with Rotita. Their customer service is dire.I shall never use the Rotita website again.I don't know if this is the correct way to reply to Rotita response.Unfortunately, I cannot give you the receipts as I was so angry and disgusted with the lack of response from Rotita that I threw everything away.  All I kept getting was \"tickets\" and then a long winded email correspondence which went round in circles. This went over many weeks and the agent would not relent.  The blouse was awful and only fit for the bin but I persevered because I felt so determined that the £10 postage should be refunded. The UK postage would have been less than £3 as the blouse was very light weight.  The way I treated was very unsatisfactory and I am still very unhappy with Rotita and want everyone to know not to purchase from this company.", "rating": 1}, {"title": "I would like to share my experiences…", "text": "I would like to share my experiences of shopping on the Rotita website. *Over 30% of items I received went straight to the not to wear pile.because Rotita has no return or exchange policy on clearance items and...*Quality of the fabric clothing made and the quality of some jewelry is very low.*Unfortunately pictures of the colors on the website are often enhanced too much and look different in reality, which is disappointing. *Sometimes hard to find the right size and there is no return if you guess wrong on clearance items.*Customer service at first was not bad, but lately I have been working with rude and careless agents. *Also, I have received several emails that were actually addressed to other people. Which makes me wonder if the emails I was waiting for went to someone else.*Promotions, like one recently for Mothers Day, were not actually given to customers. I have logged in seven days in a row as a condition to receive the promotion and I have not received anything in the end. Live chats didn't help with solving the issue either.*There were a few glitches with the website I have found and reported to customer service but they are still appearing.* Advertisements popping out on every site or email I am going to. It is a little bit annoying but it is what enthusiastic marketing does for them.Overall, I do like some of their clothing styles. It was a reason for me to start my shopping adventures there. Shipping is fine too. But the risk is too high for me to spend anymore on this website.", "rating": 1}, {"title": "Ridiculous - DO NOT TRUST", "text": "Ridiculous! Really think before you buy!!!Dress marked as £31, ended up spending over £40 to get it delivered. I received my dress and it wasn't as I expected at all! Cheap material, no shape to it at all.. I was definitely not going to wear it.  You have to wait for the item to be marked as \"Recieved\" or \"Delivered\" before you are able to go through the refund progress, the order status remained at \"Shipped\" for several days so had to keep checking, and then after about a week it was in the right status for me to start the refund.Refund is only accepted for up to 30 days following the delivery of your order. They had marked the delivery date down as the actual date I received it, not from the date they marked it as complete on the order status.They want YOU to pay for the shipping back to them, even though they charged a lot extra for it to be shipped to me in the first place, and they make a point of advising we will only be refunded for the item cost itself. So I'm down £10 already. The return address is in America, even though I was using the UK website, plus they only accept the refund if you send it to them via tracked delivery. Took it to the post office; Tracked delivery is £18, tracked and signed for £25. If I was to go ahead with this refund, I would have spent around £65 and only got £31 in return. What's the point? I guess this is how they make money!!SCAMMERS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "rating": 1}, {"title": "This is not a reputable online company", "text": "This is not a trustworthy reputable company. Do not buy anything from them, they are a scam company, I wish I had read reviews before I ordered anything from them. Your will pay a normal UK delivery price but if you need to return your items that is another matter. On your parcel you will see a return address in Walsall WS9 but through the website (which is what you have to do to start your return), The address they give you to return your items is in USA …. My return cost me £18.10 for goods costing £37 and when you read the small print they say refund is dependent on condition of the items returns???? So my expectations are extremely low. Best advice if you do need to rerun anything take photographs of the items from every angle as I suspect they will try to avoid paying the refund. Plus when I tried to find out why I was returning items to the US when they came from the UK it’s a bot on the website that just goes round and round in circles. Total scam companyEdit to above, attached is the reply I have received from rotita… At no point do they offer an explanation as to why I have had to return these items to the US at a cost of £18.10 to me. Plus it still contains what I perceive to be a veiled threat of not refunding my money if the items don’t meet their inspection?. Here is their replyDear Ms J AThank you for contacting us. Once we have received the returned item(s), our customer service will apply the refund or exchange in 7 working days, the warehouse need time to pick up the package and examine the condition. Please be patient for a few days. If you have any questions, please feel free to contact us. Best Wishes!Alice,Friday, 03 December 2021 at 10:40:09 AM", "rating": 1}, {"title": "Beware, Rip off!!!!", "text": "So dear peopleJust to update you, that when they say pls check your email we have responded to your query, its means they blackmail you to remove the reviews here before they can credit my delivery charges which they agreed to pay, even that only one delivery charge. So please be careful what you order from here. Because customer services are a bully and have no empathy. To them its your problem if you order and goods dont arrive on time. Consumer Ombudsman it is from here on because i actually feel bullied now. Even the managers are in hiding and the staff give you all sorts of reasons for not refunding you the money, things like weather was bad so took to arrive. Are they even serious, we live in a developed country, faced paced environment. On top of that they also tell us that we have speak with their couriers to get the charges back. Have any of you ever heard this kind of ridiculous statements from any customer service agents in england. Jokers!!!!!Did they ask us when ordering the goods to arrange your own courier that upon returns we have to find a way to speak to the couriers they decide to choose. Seriously this is another level of customer service!!!!!Order no W2202130758262365Absolutely terrible with customer service. They delayed my shipment and hence didn't want the goods as i ordered them for holiday. So I told them via the online chat not to deliver the items. It arrived whilst I was away and because it didn't need a signature they just dropped it at my address. Upon coming back I had to send it back for a refund which costed me £35 as you have to send them back to USA, which I didn't know. Now obviously they don't want to pay out these charges. I bought £93 worth of of goods plus I paid express postage of £12 and on top of this for refunds and send the goods back to them , another £35. complete rip off. I'm actually going further with this because its just unacceptable. Just beware people!!!", "rating": 1}, {"title": "Horrible service, incompetent at best and more probably dishonest", "text": "I ordered several things from them in the middle of November that were all supposed to be here by Christmas. They split the order up and mailed the first package to some ZIP Code for a town in Florida I've never heard of, that is 1800 miles from where I live. Of course it was returned to them and when I got notice of that I am mediately contacted Rotita to tell them what my ZIP Code actually is. They lied and said I made that mistake. Fortunately I had my PayPal receipt to prove that I had not entered that incorrect ZIP Code.  They ignored my correction for 10 days until I contacted them to ask them where my stuff was. They again lied and said they never received my correction. I took a screenshot of my correction of 10 days earlier and emailed it to them.  In the meantime, they had sent the second part of my order to me, using the incorrect ZIP Code again, even though I had already sent them the correct one. They handled everything so badly.  We just kept going round and round with their pretending that they did not understand, that this was my fault, that kind of thing. I finally opened a dispute with PayPal, which was of course eventually resolved in my favor. Maybe it's a different culture that does not understand owning a mistake, trying to get out of making a refund for their own mistake they don't own.  I will never buy anything from them again and I would recommend that anyone who does risk it should use an intermediary such as PayPal so that they have a resource for getting their money back if needed.  Absolutely nightmare service.The shipping address came from you. I did not put a second shipping address into the PayPal account when I paid for the merchandise. You are telling another lie.As usual, you didn't even read carefully what I wrote. I said in this review, as well as to you several times in emails, that PayPal has already resolved the issue in my favor. They have given me my money back, they've taken that money back from you, and you don't need to do anything now to resolve the issue. This indicates again, that you are incompetent.", "rating": 1}, {"title": "Thieves", "text": "I purchased a black, white and pink cold shoulder top. I received a black and orange t-shirt which was more like a football shirt that I doubt could have been sold on with it being so ugly.  They will not refund the full amount of the top, the postage I originally paid or the amount to send the incorrect item back. If the top didn't fit or I didn't like it then I understand that they won't reimburse postage costs but in this case, I think even as a matter of goodwill, they should cover the cost of postage as it was due to their incompetence that I am having to pay and post back. I paid £24.83 for the top but with postage costs it came to £31.82. I was told I would be reimbursed if I send proof of postage, so I did. They will now not pay the  £13.45 Royal Mail costs and had I known this I wouldn't have bothered to return. The only refund they will give is £12.42 because the unworn item I returned is 'not in new condition'. The issue has not reached a conclusion yet they have cleared all chat logs. Luckily I have screenshot the thread to prove they did promise to reimburse.  Good tip... if you choose to deal with this company, screenshot everything before they clear it and can deny everything. Please be warned that they conduct their business in a very underhand and deceitful manner.  They now have both items of clothing plus more than half of the payment. Thieves!Update. They have emailed me stating that they had told me to keep the original item and that they would send the correct item. I forwarded my 'chat' screenshot where they informed me to send the wrong item back with me asking will the postage be refunded and they had said yes as long as there is a tracking number. No mention anywhere that they told me to keep the item. It's lie after lie with this company.Last update as this is a very stress inducing company to be dealing with. They have admitted fault. Their return policy states one thing which is why I clarified BEFORE I made a return and was definitely told I WOULD receive a postage refund. They will not refund as promised but re the member of staff that gave me false information \"we have told her and correct it\" which does NOT help me in the slightest. Trying to deal with this company whose first language is not English it seems, lie (on numerous occasions), try to delete the evidence, admit fault and still leave me out of pocket is not something I ever want to deal with again. For those of you that still use this company, I wish you luck.", "rating": 1}, {"title": "Never received my top", "text": "Date of experience: December 18, 2021", "rating": 1}, {"title": "If you get what you ordered from rotita", "text": "If you get what you ordered - well done - sadly half the order was missing and what did come was either too small or damaged and had been worn... I wouldn't bother.. and your lies and attempts to rectify are as blatant as your fake reviews...", "rating": 1}, {"title": "Products what products", "text": "This both on Rotita and Fedex.  I ordered a bunch if clothes for a family event and did it online  as I couldn't get to a store. I paid for expedited shipping on all of them hoping one would get here on time.  I wasn't allowed to use my coupon at rotita either since it was sent in 3 packages instead of 1 package.  Added cost over 50$ on top of the clothes cost. Expedited shipping is supposed to be 3-7 buisness days with Rotita.  Here we are 7 buisness days later my orders are still listed as pending and out several wreks some haven't even left China yet which is where they are located I guess..  I contacted the company and all I got was I'm sorry to hear that we checked with FedEx and they are out.  While FedEx says delayed delivery pending. .  At the very least they should be refunding my money for expedited shipping hat will arrive days to weeks after the standard free shipping would have.  Have to say while quick to respondn o emails they offer no solutions nor do they do anything about money paid out for a service or products not recieved.  Now I'm scrambling at the last minute to find replacements and I'm out all my money too.  Can't speak to clothes quality haven't gotten them. If you order from Rotita be warned they use FedEx who are horrible and don't make good when their buisness associates don't deliver in the time paid for.  Of course fedex puts it on rotita for any refunds even for the shipping which is their responsibility all in all its prob more fedex fault but your only as reliable as those whom you work with.  Rotita at the very least should refund the shipping cost i paid out and get it back from FedEx so the customer (me)  isn't left holding the bag.I appreciate rottita reaching out to the shipping company to try to expedite the shipping.  However they only did this when I places this review on Trustpiolit.  When I contacted them about the shipping issues prior to this they just copied me on my tracking number.  It should have been done when I contacted them prior to this review.  Issue is I paid forbfaster delivery and it wasn't recieved so I feel I'm owed a refund on the shipping.  Also most of the items came after I needed them so now I hope Rotita handles returns well.Side note fedex the day before Rotita contacted them said my packages were still overseas and the delivery date was pending.  This shows fedex dishonesty if they were indeed overseas it would not have been deliverable within less then 24 hors from Rotita contacting then.  Also it shows they have the capability of delivering items bit hold them up until the shipper raises an issue.all in all rotita tried to make it right but only after a bad public review otherwise nothing was done.  Also fedex is horrible but I already knew this.  I still have no refund for my shipping costs rotita should make that right and be the ones to fight fedex for reinburment since they dropped the shipping ball.", "rating": 1}, {"title": "Ordered two dresses very poor quality", "text": "Ordered two dresses very poor quality. Returned which required posting to USA but did not receive refund. Don't hold out mech chanceAVOID USING THIS COMPANY WOULD NOT RECOMMEND FOR UK USERS", "rating": 1}, {"title": "Bought a dress - No Refund", "text": "Bought a dress, It was to big so i tried to return the items. There is no return information on there website, even though the address on the package was UK, they wanted me to pay to return it to the USA. Tried to speak to them several times, emailed several times, did the webchat. Never got a response, never got my money back. Would never buy from them again or recommend.", "rating": 1}, {"title": "This is a really bad company", "text": "This is a really bad company - when I spoke to a \" person\" on a live chat she informed me my item had not been shipped desite paying extra to receive it for a certain date - they have aticket system so you can chase the orders up - each time its some event happening ie Fall Day and now its national day so they wont be replying for 10 days - well after my order should have arrived !! I would suggest if you need items for a certain occasion - dont use this company - as their shipping and receiving dates are NOT correct !!", "rating": 1}, {"title": "Placed an order in August..Recieved…", "text": "Placed an order in August..Recieved partial order and charged for Full..$56 Jacket..Out of Stock??  Then why did you charge me?? Never Again and will pass this experience on to others", "rating": 1}, {"title": "Terrible company", "text": "Purchased two dresses for my partner which took 8 weeks to arrive. Material was awful so tried to return but was told I was too late due to their return policy of 30 days. After some correspondence they finally agreed to refund me as the products took so long to arrive. I duly posted them off to the United States which cost £22 to then be told that they had not received them in their 30 day window for return packages, but I had proof of posting and tracking that they had in fact received them within 19 days. I relayed this to them and they again agreed to a full refund within 5 days when I had confirmed with them on their website that the two dresses pictured were the ones I had returned! This company need to be investigated, I am contacting Trading Standards as It is now over the 5 days that they agreed to my refund with no sign of it. This has been going on for months! A truly awful experience, shame on you Rotita!", "rating": 1}, {"title": "I   Was going to order but due to…", "text": "I   Was going to order but due to negative remarks I won’t waste my money", "rating": 1}, {"title": "If it looks too good to be true, it usually is", "text": "After seeing this company pop up a lot, there was a few items i liked, checked out the reviews, alarm bells should have been going off straight away, practically every review was excellent, a bit like the high reviews on here, made by ones that have only 1 review, not surprisingly to this company, but i went ahead anyway, a lot of family members wanted to try this site but were waiting to see my experience, so here it is, first they state you get 40$ off your first order if you subscribe to their mailing list, which i did but didn't get the money off, i wanted to order a lot of items but stuck to three just to see how it went and also to get free shipping, so glad it was only 3 items as not one of them is fit for purpose, i already had experience of sizing issues before from China so i knew to go a size bigger, the first top was slightly tight but the bottom part was like a skirt, just because i have big boobs does not mean the rest of me is big, the feel of the material is like cheap silk/nylon, 2nd item was a casual shirt, same type of cheap material, although it fitted, the collar sat weird and the sleeves were about 5 inches longer from my hands, item 3 was a sweatshirt, lovely material and colour, again it fitted but this time the sleeves were about 7 inches longer, just because you order a bigger size does not mean your arms grow in length, so out of the 3 items, the sweatshirt is the only one worth keeping although unwearable outdoors i can use it as a nightshirt, the other 2 are going to charity as it would cause too much hassle to return, as you have to pay yourself to return, non refundable, now considering you have to send to USA for some reason, you are likely to go over the 30 days, especially if you want to keep your postage costs down, so i am out of pocket of over £60, very expensive lesson, i use a few good companies from China, but this one is a thumbs down, free returns is a must if you want to keep customers, good customer service also which this company does not have, and don't be fooled by false positive reviews to hook you in, so needless to say, my family members were not impressed either so no sales there", "rating": 1}, {"title": "Incorrect sizing!!", "text": "I received the dress I ordered however the sizing was incorrect it was considerably smaller than it should have been, I contacted customer service on a number of occasions and was advised a few times that I would receive a free returns label within a few hours, the label never came and when I went back on chat they advised they do not issue free return labels to the UK. The shipping costs to return the dress would not make it worth getting a refund.", "rating": 1}, {"title": "Thank You and Kudos to Vicky of Rotita!", "text": "Yesterday I had great service from a Rotita employee named Vicky, who quickly and competently made sure my mailing and credit card addresses matched. People like her deserve credit, and are part of the reason I shop online at Rotita. THANKS, Vicky!", "rating": 1}, {"title": "Awful company", "text": "Awful company. Tried to return two dresses I ended up waiting 8 weeks for! There was always some excuse for the delay in delivery but was never their fault. They refused to refund me as they stated I had had the goods for over 30 days, I had actually had them for 6 days when I tried to return them. Steer clear, quality of goods and after care shocking.", "rating": 1}, {"title": "Expensive to return", "text": "Expensive to return....paid £25 to return to America for a refund of £58 for 2 dresses.....they state you need tracking but not signed for, if it wasn't for the tracking it would of cost me just over £9.....won't order from them again.....quality quite good thoughMy order number is WW2108140738186216", "rating": 1}, {"title": "Warning expensive mistake", "text": "Ordered a dress,did not reach my wife's expectation shabby workmanship cost  me £52.94 with postage & it cost me £20.84 to return the item leaving me out of pocket to the sum of £39.04 , the was because of the postage to America so its not ideal to buy from this Company please be warned.", "rating": 1}, {"title": "My dress was nothing like the photo and unwearable!", "text": "I bought a dress which was long and tied at the waist in the photo but when it arrived the bodice was far too short, only just under my bust in an empire line and the hem dragged on the floor, and I am 5'8''. I tried to return it but the postage to the States was half the price of the garment. They offered me 20% refund which I declined. They asked me to show that the garment was faulty so I took photos wearing it and then they said they cant refund as I have worn it!!! I could never wear it, it is hideous! The back seam also gave way so now they say I damaged it while wearing it and in fact I tried it on twice and took it straight off again in disgust. Very disappointed. I have been offered 30% refund but the garment is unwearable and I deserve 100% back. Be warned, dont buy in the UK.", "rating": 1}, {"title": "BE WARNED", "text": "BE WARNED I thought this was a great company - the service was good and the clothes were very reasonable.  It was only when I came to exchange a dress as it was too small, I was given the return address in the USA!  No good for people living in UK!  I won't be buying anything else.", "rating": 1}, {"title": "Requested Order number", "text": "You asked for my order number…here it is. TXU95796. Strange, you will not respond to emails but to reviews. I have 334 reads on my review. Reviews have influence, if you credit me back and handle this situation I will remove the review. Still would never order again here.", "rating": 1}, {"title": "I had a dress ordered which I could not…", "text": "Highly disappointed!!! I had a dress ordered which I could not get on the expected date of delivery. I had no delivery, no mail to update me about delay and a very poor live chat and customer service. This is the worst company I have ever ordered from.", "rating": 1}, {"title": "I am still awaiting a refund after over…", "text": "I am still awaiting a refund after over a month of them receiving the goods back. I would never buy from them again", "rating": 1}, {"title": "SCAMMERS/ LIARS/FLIMFLAMMERS-…", "text": "I ordered six items  seven days ago- most on sale - made a change to the order with Sara- Huge mistake.  Instead of changing order, I had to pay and she indicated that I would receive a refund.  No refund and six days have passed.  I received an email saying one item was out of stock.  Then another emailing saying that another item was out of stock.  So two of the six items were out of stock.  Then Sumi stated order is to confusing because there were too many changes-  How??? I made one change.  Then she offered a discount or credit for the one out of stock item.  Who wants a discount, when they can't get their crap together.  I paid with my card.  Items ordered or refund!!!! I don't have photos as I received no merchandise.  Ironically, I ordered last year and received the order.  I guess that was a fluke!!! This  place is a joke.  What comapny can't fill orders.  Calling card company today!", "rating": 1}, {"title": "Crap company", "text": "Crap company! beware! I ordered clothes for a wedding that said shipping would arrive in 14 days. It's been 6 weeks! well, that wedding came and gone. They do not give me any information or respond to emails. Not worth it! spare yourself!", "rating": 1}, {"title": "Only one bathing suit out of four fit", "text": "Only one bathing suit out of four fit. The rest were much smaller than the size chart indicated. I’m having some trouble trying to return the rest.I DO love the one which fit as described!", "rating": 1}, {"title": "Wouldn't recommend this site due it's… poor quality and not free refunds", "text": "Wouldn't recommend this site due it's poor quality, sizes hit and miss and is not free returns. I've just had to pay £61.05 to send my returns to America for a refund and won't be refunded for the amount I paid to return it ......  BUYERS BEWARE", "rating": 1}, {"title": "Will never use this company again", "text": "Will never use this company again. Purchased two dresses from Rotita both of which are not suitable.The return policy is reidculously difficult and you have to do everything via a silly ticket process. I wasn't able to obtain a relevant ticket consequently I'm now stuck with two items I will never wear, and almost £70.00 out of pocket.Will never use this company again.", "rating": 1}, {"title": "Terrible - do not order from. No ability to deliver in any sensible time scale.", "text": "Terrible. Scam site.  Take orders with no ability whatsoever to deliver the goods in any sensible time scale.  Do not order from under any circumstances.  I ordered some swimwear first week of June, they promised it would be with me by 29th June at absolute latest.  By 1st July their own tracking information shows that it hasn't even left China yet!  It's of absolutely no use to me now at all, will arrive far too late for my holiday.  And they've flatly refused to give a refund even though I've told them that I no longer consent to being part of this sales contract given that they unilaterally substantially changed the terms of it.Update - items finally arrived.  Far too late and of very poor quality.  And only at that point do they tell you that any returns must be posted to the USA - at your own cost!!!", "rating": 1}, {"title": "I am very disappointed with the…", "text": "I am very disappointed with the services provided. My request to return the insurance cost, which I am not willing to cover, is denied, based on statement, that item in transit, that is not truth. The shipping label has been created, but the item has not been picked up until now!\"...Delivery status  Expected delivery:    Item delayed — stay tuned for updates         The sender has created a shipping label. As we process the item, we’ll update its status and expected delivery date....\"", "rating": 1}, {"title": "refund problem", "text": "Hi, Rotita customers be very careful about shopping at Rotita. i have negative experience i returned an item . it was a fight to get my refund back it took almost 4 months and even when they refunded it was less 9.39 dollar . you get agents like Sarah, Sowshi, and losliya and what they do is lie after another. please customer be careful because you shopping at Rotita  website at your own risk. i had to give up 9.39 dollars that they refused to refund. NEVER AGAIN WILL I SHOP AT ROTITA. remember they do not have telephone support so you can only chat.", "rating": 1}, {"title": "Appalling product and customer service", "text": "Appalling product and no way to get a refund as the item cost more to return than it's actual cost to purchase.  Not impressed", "rating": 1}, {"title": "3 items i sent back", "text": "3 of the items i sent back along with  several pictures as the did not fit for that size, which by the way is what I normally wear. They were way too small and once I got them on were very tight and uncomfortable. The white shirt was very hard to even take off. I sent them back for a refund and only received them right back to me.Not happy at all.", "rating": 1}, {"title": "return policy is not honored by Rotita…", "text": "return policy is not honored by Rotita - they will just talk in circles to avoid dealing with any issues.  Avoid doing business with them!  My experience with their customer service has been horrible", "rating": 1}, {"title": "Expensive return shipping and did not issue refund for products purchased", "text": "Ordered items. They were all pretty decent but none of them fit my bust area. Went to return and it charged me about £30 to ship them back from the Uk to the USA. They should warn costumers in Europe that they will have to pay crazy expensive shipping fees if they wish to return or exchange anything. I paid a crazy amount to return items in which they refunded but these people never gave me my money for the items I returned. I finally emailed them after one month and then They only issued partial payment. Do not order from this company!!! I’m still fighting to get my damn money back smh!!!", "rating": 1}, {"title": "most of the reviews appear fake", "text": "most of the reviews appear fake, clothing is much smaller and not as nice once received.", "rating": 1}, {"title": "Wouldn't bother...", "text": "Wouldn't bother...The items received were too small, and the customer service around returning the items was appalling.  The livechat individual clearly hadn't read their returns policy which I am glad for once I did, or I wouldn't have got anything (though I am still waiting for the refund).  Also any returns are to the UNITED STATES and therefore, cost as much as one of the items.  I would NEVER purchase from this company again.", "rating": 1}, {"title": "My contact with your CSR was excellent", "text": "My contact with your CSR was excellent. The CSR handled my concerns very professionally and expediently. Thank you for your service.", "rating": 1}, {"title": "If I COULD rate this RIPOFF company…", "text": "If I COULD rate this RIPOFF company lower I would GLADLY DO IT!!!!!!SERIOUSLY DON'T DO NOTGIVE THESE CON ARTISTS ANY OF YOUR MONEY.GO TO WALMARTINSTEAD.NOTHING THEY SEND YOU WILL FIT THAT IS IF YOU EVEN GET THE ORDER YOU ALREADY PAID FOR.WHICH YOU PROBABLY WON'T", "rating": 1}, {"title": "Do not use this company", "text": "Do not use this company, we are based in the UK and the goods were sent from an address in Southall but because the quality and sizing is so poor we want to return the items and you have to send them back to the US at your expense - give them a wide berth !!", "rating": 1}, {"title": "I PLACED AN ORDER OVER A MONTH AGO", "text": "I PLACED AN ORDER OVER A MONTH AGO , SUPPOSE TO HAVE BEEN HERE BETWEEN APRIL 1-12 STILL WAITING... WENT FROM LOS ANGELES TO ILLINOS NOW... ELK GROVE VILLAGE IL DISTRIBUTION CENTER CRAPPY SERVICE...MAKES NO SENSE IM IN AZ", "rating": 1}, {"title": "Worst company EVER!!!!!!!", "text": "Returns... horrible!! They request photos before they send you return info if they decide to approve it. They mark down items after u purchase them to clearance and then say they are nonrefundable. They only give u a percentage of what you paid back on brand new unworn (poorly made, poorly sized) clothing. On one item that I ordered the bow just fell off in the box. Also, they have a review system on their page that ONLY gives you deceitfully positive multiple choice answers to choose from WHEN THEY SUCK!! This business is HORRIBLE and I will NEVER ORDER FROM THEM AGAIN!!! Save your money! In response to Rotita’s reply... I have messaged you about it and haven’t gotten a response to that specific issue. Also, I see that you did NOT deny any of my complaints.", "rating": 1}, {"title": "Rotita is a Chinese based wholesale…", "text": "Rotita is a Chinese based wholesale online  clothing store, it is too bad that United State citizens get to shop at this online overseas clothing stores with very bad quality fabrics, and not the right size. People don’t waste your money on those unsecured gold digger overseas clothing stores. I just bought two dresses and I regretted. My order number is W2103220352017603", "rating": 1}, {"title": "I had a terrible experience with this company", "text": "I had a terrible experience with this company and would never use them again or recommend them to anybody! The clothes I received did not look half as nice as they did in the pictures and one was faulty. However this company would not pay to return the faulty one and I ended up paying £25 to return these clothes. They received the clothes back but have not given me a refund.Luckily I used PayPal and they gave me £15 towards return postage They will find whatever excuse they can not to refund you and even below it says they have emailed me but not to apologise for the way they have treated me and they are still finding more reasons not to refund me!!! Don’t be taken in by them!", "rating": 1}, {"title": "I would not recommend this company", "text": "I would not recommend this company, they sell in UK but ask you return the goods to US cost me £25, further more they do not offer refund for every item you purchased.  The quality of the products are also poor hence need to return most of them.", "rating": 1}, {"title": "The order didn’t fit and they had me…", "text": "The order didn’t fit and they had me ship back the order, which was not a surprise, but what was a shock was, they wouldn’t ship the exchange order back out until 2-4 business days AFTER they receive the order back", "rating": 1}, {"title": "Shamrock jersey is cheap quality", "text": "Shamrock jersey is cheap quality . Colors are very dull, and it is completely see thru...not see thru in the picture.  NOTHING  at all like the model was wearing.  So very disappointing.  I was looking forward to wearing what was shown in the website.", "rating": 1}, {"title": "DO NOT USE THIS COMPANY", "text": "DO NOT USE THIS COMPANY  YOU  ARE ASKED TO RETURN ITEMS TO UNIT 5 TRIDENT WAY SOUTHALL LONDON GOOGLE THIS ADDRESS  AND YOU CAN READ ABOUT THIS SCAM COMPANY l LOST £55.99 don't take any notice of the notice below  they won't you to send returns to  unit 5 trident  way southall read aboutt this place on Google it's a scam company", "rating": 1}, {"title": "Absolutely unwearable", "text": "Absolutely unwearable. Cheaply made swim wear . Straps sewn twisted. No finished hems and seams. I’m so disappointed. Nothing good to say. Fit is terrible . They are the worst I have ever seen", "rating": 1}, {"title": "Ghost packages", "text": "Made an order here for whatever reason they made it into a 2 part shipment. 2nd shipment never made it to my mailbox. We have a secure mailbox thats what doesnt make any sense. When i track it says it got delivered. Talked to the mailman and said he hasnt seen any package from rotita. This items already took like over amonth jus trackin and then ghosting. This is very unacxeptable. Ave   emailed numerous times with my order no. And no response. Next thing i do is report this to bbb if i dont get a solution", "rating": 1}, {"title": "Poor quality material", "text": "I recently purchased a top and the material deteriorated after the first wash and yes I did follow the instructions to the letter.  Unfortunately I washed it over 30 days and so couldn't return it.", "rating": 1}, {"title": "Buyer Beware! Fake Reviews!", "text": "I ordered a swimsuit as a Christmas present that still has not arrived. After 3 support inquiries and 2 emails no one has gotten into contact with me. I have been trying to cancel the order.It appears that many of the reviews on Trustpilot are fake, and likely written by employees. These reviewers only leave 1 review, or if multiple reviews, they write all reviews for Rotita.Maybe if the employees weren't so busy leaving themselves positive reviews I could get my clothes or cancel my order. :)The reviews written on sitejabber are more in line with what I have experienced.", "rating": 1}, {"title": "BAD REVIEW OF ROTITA...the good ones are probably fake.", "text": "So once again you ask for an order number just how many customers are you trying to steal from and if you check your PayPal open cases I'm sure there must be many you will find it and by the way Stop trying to avoid the issue and pay her and everyone else that you are defrauding back ...update 19th febuary...why do you need an order number ? You simply refund all of the people ( of which there must be many ) who you are defrauding after all you should not need an order number if it was only one or two cases, should you ? It has  been 41 days since her order was placed and 18 days since the latest delivery date provided by you...not very good is it ? You people get vulnerable people to place orders and then STEAL thier money because you think it's alright to do that ..well it's not, tell me please are all of you traders the same. Just for the record folks my partner is 72years old and living on  limited pension because she made some bad choices in life and obviously buying from ROTITA is another bad choice.", "rating": 1}, {"title": "So rotita has asked for my order number…", "text": "So rotita has asked for my order number and they will find a reasonable solution hmmm.....well firstly it's not my order, it's my partners secondly if they have to ask for an order number it makes me wonder just how many of their customers have opened PayPal cases against them..and thirdly the most reasonable solution is to make the refund instead of stealing my partners money because her order STILL has NOT arrived they are just trying to get out of paying her back her money they have stolen from her", "rating": 1}, {"title": "Absolute rubbish", "text": "Well I'm pleased that most people on here are satisfied with this company but it is NOT my partners experience she has been waiting for her order since placing it on the 9th of January and it's now 10days late and all rotita can do is fob her off she has asked for a refund and they haven't even had the decency to reply she has also opened a case with PayPal and rotita won't even respond to them what an absolutely disgusting way to treat a 72 year old pensioner living on a limited income ...I would urge everyone on here Not to buy from this company because it is very clear that they treat a percentage of customers with distaste ...probably to get their shipping costs back", "rating": 1}, {"title": "**Buyer Beware**!!", "text": "Do not trust the positive reviews on this site, please do your research. I was about to place an order based on an advertisement, came on here and something told me to REALLY do my research. Came upon other reviews, including on YouTube and glad I did. Saving my hard earned money. The saying \"you get what you paid for\" comes into play here. $39.99 for an evening dress should really be a first clue, taking 6 months to get order another clue, poor customer satisfaction and refusal of refunds definitely another clue that this company is not to be trusted. **Buyer Beware**", "rating": 1}, {"title": "The positive reviews here are scams", "text": "The positive reviews here are scams, just like this company. If you look on ANY other review site you’ll see they have awful, awful reviews and scam people left and right. Look closely at he good reviews on here. They use odd names and broken English. A lot mention the same workers over and over, likely posted by those workers to keep their scam job with their scale employer safe. Read reviews on other websites and DO NOT buy. You will lose your money!", "rating": 1}, {"title": "2 out of 3 FAULTY £30 to return.", "text": "Bought 3 items. The dress i couldnt undo the zip to try on. The jumpsuit was slashed to waist and it showed on picture a small slash above the breasts. Black dress was very cheap and nasty. I asked to return it several times, I could not get an answer. I contacted paypal resolution . I got the address then! I was told I could have £50 back of an £87.03 order and keep the items. As the items were faulty I said no. Paypal asked what I would agree to and I said a full refund. I was then expected to pay £30 to return items to USA. I couldnt reply to resolution center as they just wanted tracking order number. As I hadnt sent items back on 8 January Paypal has found in their favour!! I am now contacting visa and also ombudsman. I am also closing my paypal account as you have no protection using them. Roita are cheap and nasty. You may get some items ok but if you get faults remember you have to pay to ship back to USA , even though this is against U.K. consumer rules and regulations. Paypal say that they abide by UK law but they dont.", "rating": 1}, {"title": "Incorrect size chart", "text": "I ordered a top to my size according to their size chart but unfortunately, when I received the article it was too small therefore, their size chart is incorrect.  If I want to obtain a larger size I need to pay for the return postage, as they are in USA it is quite expensive.  They refuse to pay for the return postage.  I will never buy from this company again!", "rating": 1}, {"title": "Dress I ordered didn’t fit", "text": "Dress I ordered didn’t fit, lining was hanging below hem and very poor quality. Tried to return and found this a very difficult process. Eventually given a “ticket” number and posted back to USA from Scotland. Cost me £16.00 to return!! Will never use this site again for fear of having to return goods. Beware buyers in U K.", "rating": 1}, {"title": "Top far to small poor quality", "text": "Top far to small poor quality. Really disappointed won't use them again", "rating": 1}, {"title": "The item that arrived was not the same colour…", "text": "The item that arrived was not the same colour as what was advertised on Facebook ,I would never have ordered a purple top, on the original advert it was royal blue, they asked me for a photo of the original order, who takes photos of that? they are now saying that it was a mistake And I was sent the wrong colour , they basically had run out of the colour I ordered and tried to fob me off with a different colour hoping I wouldn't notice, very poor service, beware the items are not what they seem on Facebook", "rating": 1}, {"title": "The worst quality ever!!!", "text": "The worst quality, worst fabric, most disappointing and cheapest possible order I have ever received. What they advertise on their website and what you actually receive is truly shocking. It’s very sad to see the extent that people will go to in an attempt to make money. Some people give and are honest and some people are just dishonest and this Company is.", "rating": 1}, {"title": "Poor returns proceedure", "text": "The dress arrived within time but too big. They supplied a returns ticket but I had to post it to USA. When I queried that they said I could send it to China. So, no UK returns address. I was also told that if I did not want to send it back I could have a 30% refund. What about the other 70%? Feel ripped off. If they sell in this country they should have a UK returns address.", "rating": 1}, {"title": "I have been watching this site for…", "text": "I have been watching this site for months. When the reviews were bad you can see an obvious pattern of 5 star reviews within the past few days. Names only a Hollywood producer could make up. FAKE REVIEWS to up their rating. Fakers, at least in my year old case.", "rating": 1}, {"title": "Bought a christmas top", "text": "Bought a christmas top. The top was nothing like the picture. It was of white almost a cream colour. Now costing me $ 21.34 to really urn it. Never again .!", "rating": 1}, {"title": "Rotita  this is the first time I have…", "text": "Rotita  this is the first time I have ever felt the need to warn others about the treatment I received when placing an order from the U.K. To be honest ..... I feel scammed!! You are not transparet with your customers and you take money off all refunds. Charging extremely high costs to have orders returned to you in the USA.Even when trying to access your  Rotita Uk, your  website will take you to the  one, which I have been informed is based in China, but all returns go to the USA.My order  did not arrive for over 4 months. The clothes  were  like, oversized over priced garbage .  They were of extremely poor quality. I had paid you for express postage. You are a company that  definitely needs to be avoided. You,  have caused untold upset & damage to others. We had months of falling out over PayPal.  I was told that many, of the amazing reviews, were made, by your own staff.     I am a USA size 14.  The clothes I received were plus 3XL.  I honestly feel your company has no morals at all and sincerely hope, you are not giving the same treatment to your UK customers this Holiday Season.", "rating": 1}, {"title": "Appalling returns policy.", "text": "Losliya on live chat was very helpful but Rotita policies are unacceptable. You check out the returns policy where it says you have to pay your own postage on returns but at no time does it say the return address is the US! I bought more than one item knowing I was going to return some but the postage to USA was £17 for a refund of £24. I would never have bought from Rotita had I known and will not be buying again.  Also found the quality pretty poor.", "rating": 1}, {"title": "Cheap fabric and badly sewn clothes.", "text": "Cheap fabric and badly sewn clothes.Utterly waste of money and to return, it's even more difficult and expensive, so you will end up keeping/thrownig the rubbish in the bin.AVOID LIKE A PLAQUE!!!!!!!!", "rating": 1}, {"title": "Do Not order anything from Rotita", "text": "I ordered goods from Rotita with difficulty because their website would only allow me to access the goods order form and sizing chart.   I could not access anything else like live chat, their terms and conditions or returns policy.  However because the items seems very good value for money and just what I was looking for, I ordered 3 tops.  They took 3 weeks to arrive and due to the quality and size, I had to return them.  Again I found it very difficult to access their website to arrange a return.  This took several days to finally receive a response and a 'ticket' number, and I emailed them to ask for a returns label.  It was only then that I was informed I had to pay for the return myself.  I asked for a UK address, but they told me no UK address only an address in New Jersey USA.  I was dumbfounded.  Nothing that I was able to access on their website prior to my order informed me that returns had to be sent to America at my own cost.After several more weeks and Rotita originally denying receipt of my parcel, even though the tracking showed they had received it, I finally had a refund.Again, they did not tell me they would deduct money from my refund.  The goods were in the original packing, in perfect condition and unmarked, but they still deducted 6.00 from me.  That together with the 22.00 I had to pay to return the goods to America totalled 28.00 which they still owe me.I have emailed 5 times to ask to speak to their Chief Sales person, or Managing Director, or even a Manager and they just say I have had my refund and totally ignore anything else in my email.To return goods ordered online in the UK usually costs around 4.00 to 6.00 which I would gladly pay, if I knew I had to pay for the return.  But Rotita make it difficult for anyone to access their full website - only the order form therefore ensuring I did not have knowledge of the fact I had to pay for the returns.If you click on Terms and Conditions, Returns and Refunds or Live Chat, the screen just goes blank, then reload the page and the  same thing happens, unless, you wish to place an order that is !.  Basically, they want you to be able to access the order form and nothing else on their site.  I have read reviews since my problem with Rotita are experiencing the same problem.It is not the fact that this whole episode has cost me money, but the fact that Rotita are not transparet with their customers and also take money off refunds which again, there is nowhere on their website that is accessable that informs customers of this practice.Even when trying to access Rotita Uk, the website takes you to the same one, which I have been informed is based in China, but the returns go to the USA.A company definitely to be avoided.", "rating": 1}, {"title": "Awful quality clothes", "text": "Awful quality clothes - you asked me to make contact but didn't say how. Returns cost a fortune so lost a lot of money on purchase.", "rating": 1}, {"title": "I would give them a zero if I could", "text": "I would give them a zero if I could. Unfortunately did not read reviews before purchasing. DO NOT, I REPEAT DO NOT waste your time or money. Clothes are CHEAP quality. I mean CHEAP. Poorly sewn and just a disaster. DO NOT believe these fake bogus reviews on here, clearly written by employees. CHECK ROTITA.CO for the real reviews.", "rating": 1}, {"title": "No free returns as advertised", "text": "Only ordered from Rotita as it advertised free returns as I am in between sizes it is difficult to know whether the items will fit. Went to return a flimsy top with little weight and I was advised of an address in USA and had to post it with a tracking number , as the cost was going to be £12, I contacted Rotita asking if my postage money would be refunded and the automated reply was ‘sorry for that’I replied saying, won’t order again to an automated reply ‘sorry for that’ Please don’t believe you have free returns. Disappointed", "rating": 1}, {"title": "Totally untrustworthy company and not UK based.", "text": "This is not about the quality of goods but their return procedure.  BE WARNED!!!!!If you return anything to this company it has to go back to the USA and tracked - basic cost £22.00 from UK.Then the fun starts, firstly they will deny receiving the goods back - you prove return sent. Next they want to know what you sent back - they have the goods, can't they check. Next they want to know the invoice number - they sent the goods they should know. Next they want to know the state of the goods returned - they have goods at their end!.Next, they do not refund postage costs - but their website states they do not charge postage on the goods you order.Next, they offer you half the value of the goods you sent back as a refund.This company is totally untrustworthy and you should be careful, very careful when ordering from them.Probabaly great if what you order fits, if not, then your in for some emailing!", "rating": 1}, {"title": "Avoid this company!", "text": "Do not buy anything from this company! The quality and the sizing is extremely poor, as is the followup service. Its USA based but run by....? I spent an hour trying to return £60 of what's basically rubbish only to find that it would cost me £27 with no guarantee of ever getting my money back. The people contacted were most unhelpful. Never again!", "rating": 1}, {"title": "Very disappointed with tops ordered", "text": "Very disappointed with tops ordered. Material like a nylon football shirt, sizing bigger than expected. Had to pay own return £19.63 which will not be refunded. Will never shop with this company ever again.", "rating": 1}, {"title": "Poor quality, tedious and costly returns", "text": "Poor quality. Horrid fabrics, poor fit. Returns process tedious, you have to wait for them to issue instructions. You also have to pay the return postage - to the USA! I just had to pay £19.23 to return goods worth about £50. Even though it seemed to be delivered, via Hermes, from within the UK. I should’ve just donated them to a charity shop, but they’re all closed at the moment, of course. I’d strongly advise avoiding this website.", "rating": 1}, {"title": "never got refund or credit", "text": "I sent my products back but never got refund or creditI thought I would get a refund or credit to my pay pal account. Also just FYI, your website doesn’t allow for communication or creating a ticket pass a certain date of the order. It’s just loops back to same it’s too late message.", "rating": 1}, {"title": "Avoid at all costs!", "text": "I bought a shirt from Rotita and when it finally arrived I loved the style and it looked great when I put it on. Within minutes the fabric began to bauble up. Seriously......within minutes.I contacted the site and sent them pictures of the numerous places where the fabric had started to bauble (there were 3). The site insisted I send back the item with tracking (proof of posting). As I'm in the UK and they are in the US it would cost me more to send back the blouse than the cost of the blouse in the first place.Customer service was worse than useless. The rep barely spoke English and just kept repeating herself. When I was finally able to get her to understand she said she'd process the refund and get back to me in 24 hours. HA! Fat chance!I chased up customer services and was given the same old story of return the blouse wu=ith tracking. Instead, I think I'll take it out and use it as kindling for a bonfire. It's about the only thing it's suitable for.DO NOT BUY FROM THESE SCAM ARTISTS!", "rating": 1}, {"title": "Difficult returns - had to demand a refund", "text": "I ordered 3 items from this company. One was OK, one was ghastly but I couldn't return it because it was a clearance item. So, I threw it away. The last item I returned. You have to pay for return shipping. After 2 months I had not received a refund. So I had to write and ask for it. I wouldn't order from them again. Returns are too difficult and I shouldn't have to chase down a return as a consumer.", "rating": 1}, {"title": "Beware similar named company using Rotita", "text": "AUTHOR'S UPDATE: Unfortunately Rotita has been scammed by an alleged company called Rolitita which is sending out its Trust Pilot reviews for completion to justify it as a genuine company. Therefore this review is not relevant as it doesn't refer to Rotita. The review below is for the alleged 'fake' company Rolitita.Oh dear. Where to begin? I ordered online more than six weeks ago and have been keeping check on progress on the website since. I appreciate we’re in the middle of a pandemic, but only expected delayed shipping not supply to the company because the website claimed everything was in stock. However my first enquiry revealed they didn’t have the goods in stock at all. They promised a delivery within a couple of weeks which didn’t happen. I chased it up and was asked to wait another couple of weeks and was promised a further discount. I agreed but received no response to my deadline. Likewise when I asked for my money back or I’ll ask my credit card company to investigate whether this company is real or not (there are a lot selling similar items that appear on Facebook ads). I await to see if I do get a response.", "rating": 1}, {"title": "Zoe didn't fix my problem but said he did", "text": "Zoe told me they fixed my problem but didn't I'm disappointed . I still need help", "rating": 1}, {"title": "Save your money!!! Don’t buy.", "text": "I thought everything was in a very cheap parachute feeling fabric. Seems we’re crooked, zippers get caught easily, the fit just doesn’t look good when you put it on. Let’s not even get into the return process. GOOD LUCK.  They sent me a return label through email. When I took it to the post office it was for 1 oz. I was like what? So I ended up paying $36.00 for returning. They didn’t care. Only got partial refund and of course no reimbursement for shipping it back. Don’t order from them! Outfits look cute online, but nothing like them when you see, touch, feel, and try on!", "rating": 1}, {"title": "Do not purchase from this company", "text": "Do not purchase from this company. Ordered a dress, size medium. Came super small and the asymmetric was literally in the back of the dress, not the front. I will never waste my time or money for this crap! The good thing is that I’m getting a refund back.", "rating": 1}, {"title": "CUSTOMERS BEWARE!!!", "text": "CUSTOMERS BEWARE!!!! AS SOON AS I PLACED AN ORDER WITH ROTITA, I RECEIVED AN ALERT ON MY CREDIT REPORT THAT MY EMAIL AND PASSWORD WERE EXPOSED ON THE DARK WEB!  COMPANY DOES NOT HAVE MUCH SECURITY FOR ITS CUSTOMERS!!!!  BEWARE!!", "rating": 1}, {"title": "Feels as cheap as they look!", "text": "Sadly their styles are very nice. The true downfall is the products are cheaply made! Cheap material. Very cheap feel. In one word ‘yuck’. Feels as cheap as they looks! Try improving the material. Dollar store clothings. Way overpriced.", "rating": 1}, {"title": "I purchased 2 pair of bathers from…", "text": "I purchased 2 pair of bathers from Rotita Australia online. They arrived quite quickly from an address in NSW. They were terrible quality and when I tried to return them I was told I would have to post them at my cost back to either the USA or China which would cost more than double the cost of the article. There answer was  \"SORRY\"Not good enough!!!    Never Again", "rating": 1}, {"title": "Save your money, don't buy from this company!", "text": "Save your money, do not buy from this company from China. I bought a button up blouse in June and when it came in the mail over 2 months later, the buttons were fake, it was a shirt with cheap buttons down it. The material was very thin and extremely poor quality. I emailed them 5 times to get a return address so I could send it back, and heard nothing. Then I got my credit card company involved to receive a refund. Still waiting. Don't waste your time buying from Rotita. Poor quality & poor customer service.", "rating": 1}, {"title": "I have not received my stuff yet I have…", "text": "I have not received my stuff yet I have emailed you.this is sometime to wait for 2 items payed £14.56 pp totally disappointed in this service", "rating": 1}, {"title": "Update..", "text": "So I’m gonna add another review to give some updates. Honestly if I could give these people negative stars I would! I have live chatted with their customer service atleast 6 times already. My order STILL is sitting in the same location since July 12. I requested a refund. They WILL NOT give me a refund. They keep telling me “I contacted our shipping agency and told them to rush your order. You will receive an email in 3 days with your updated information and will receive your package shortly.” The first time I heard that was on August 2, 13 days ago. DO NOT ORDER FROM THIS COMPANY!!!!!@Rotita in response to your reply on my review, obviously I want either my order resent or my money back. But your company refuses to do either of those things and your customer service people are rude and liars.", "rating": 1}, {"title": "Awful quality", "text": "I ordered from them. The clothes were nothing like the pictures online and had to pay quite a lot to return them. Learnt a sad lesson - offered peanuts in comparison. Don't buy!", "rating": 1}, {"title": "never returned the money", "text": "Terrible quality of the tops, feels like wearing plastic although the photos look so promising! I returned them instantly, paid for the return shipping and although they have received everything and have promised 14 times ever since I have been in the live-chats with them (over a span of three months now) they would return the money within days. Nothing has ever posted on my card, so I have filed a dispute now.", "rating": 1}, {"title": "I wore one of the suits for the first…", "text": "I wore one of the suits for the first time yesterday and it cause a severe rash on my left breast.  Not good!", "rating": 1}, {"title": "Customer service is horrible…", "text": "Customer service is absolutely horrible...one asks a question and nobody answers back to what has been asked..it seems no one understand english...chat is a total waste of time, it is even worse and their english is horrible. They seem to be asleep at the other end,I did receive some nice bathing suits so I left them a great review but I am expecting 2 more packages...I pray there will be nothing wrong with anything because it probably would  be a torture to deal with customer service to fix any problem! Also , their TPoints system is ridiculous...I spent  $ 133.00 on 2 orders and only got 35 points....Spent over 2 hours chatting , ending email, submitting a ticket...they never explained why I only got 35 points!!! Total waste of time!!", "rating": 1}, {"title": "Never received my order", "text": "I placed my order on July 2. Received my shipment information on July 3. I have yet to receive my order. Customer service has not helped me. I’ve spoken to them multiple times and all they tell me is there’s nothing they can do because the shipment has left the building and to keep tracking it. My package has been sitting in the same spot since July 11. My tracking information doesn’t update. They won’t issue a refund. They won’t figure out where my package is. I just get told to continue waiting. Will NEVER order from here again!", "rating": 1}, {"title": "UNDELIVERED MERCHANDISE", "text": "I ordered 3 tops 3/23/2020. I contacted Rotita early July after checking the tracking # and found there was no evidence anything had changed from my initial order. I contacted customer service in early July with reassurance Rotita's customer service would be on top of things. Well it is now July 25, 2020 and after checking the tracking # it seems nothing has changed and order is China still. VERY DISAPPOINTING...I really like the merchandise they advertise,but it's not worth the hassle. I do want my $75.00 refunded now!!!NOT RECOMMENDED!!!", "rating": 1}, {"title": "Received my order today", "text": "Received my order today.  Quality is comparable to a 70's Hallowee'en costume.  Garbage.  Will be returning it.  Very disappointed.  Looked cute on website. Don't be fooled.", "rating": 1}, {"title": "I never received my full order", "text": "I never received my full order. The dispute was won by them as due to the pandemic, I missed the window to re-open the dispute with Discover. I never have delivery problems in my neighborhood. They should be responsible for the lost shipment, which was delayed for months anyway, due to the pandemic which began in Chine (company location).", "rating": 1}, {"title": "I bought 3 blouses for my fiance", "text": "I bought 3 blouses for my fiance. They came in 2 separate shipments. When the first one arrived I was so disappointed I almost did not give it to her. Now the next to have arrived and the experience has only  worsen. Very low quality. Material is so thin she will have to wear something under them to wear them at all. I easily could have done better by shopping locally. Now have a product I'm embarrassed for her too receive.", "rating": 1}, {"title": "Complete run around trying to return…", "text": "Complete run around trying to return something. Customer support is there simply to waste your time. I will not be reordering.", "rating": 1}, {"title": "No REFUND for YOU", "text": "They are REFUSING to give any form of reimbursement for return I had to pay for in addition to the fact they require a tracking number.  They NOW have a different way of doing returns.  But the following is what pops up when you request a return.  But they will not honor giving you a refund for shipping.  YET, because of the tracking number, it cost me $14.90.  But they won't even honor the $7.99.  I have the scanned image to prove it and sent it to them too.  But to no avail.  Return Conditions:1. You have 30 days to decide if an item is right for you, if not, you can certainly come to us within 30 days of receipt.2. Flash sale products, Babydolls&Chemises, Bustiers&Corsets, Teddies, Bras&Bra Sets, Panties, Shapewear, Specialoffer products, Jewelry are not covered by warranty.3. Return items must be received in new condition, unwashed, unstained.4. Damage or stain caused by customers may result in partial refund up to 50% of total payment.5. Free return for 1st package, $7.99USD for 2nd and following returns, which will be deducted from the refund.6. Shipping fee and insurance fee are non-refundable if any return occurs.", "rating": 1}, {"title": "Terrible clothing!", "text": "These clothes look nice in photos, but are actually terrible quality.  I ordered several tops--some had badly mis-aligned buttons or mismatched fabrics.  Others were too small, although all items were supposed to be the same size.  Then it was a big hassle to return them--Rotita required photos of my items before they would give me the return address.  The return postage was more than $20--a huge waste of my money and time for items that were completely unwearable.", "rating": 1}, {"title": "This is the worst company ever", "text": "This is the worst company ever. But they’re the best scammers on planet earth. I placed an order three weeks before the 4th of July, and was promised that with the shipping I paid extra for, that my order would arrive in time. I constantly tracked my order, and DHL said that it was waiting on my items from the shipping partner. When I reached out to Rotita via live chat, I was told my item had shipped and that I was due to expect it on the 7th of July. I advised that my package had not yet shipped, per DHL, and asked that I be given a refund and to cancel my order. I was then told that my order shipped via FedEx, but that they were unable to provide a tracking number. I again asked for a refund, and was given a confirmation number for my refund just before the person on the other end, closed out the chat. I logged back in and asked for an email confirmation regarding my refund, only to go around in circles again. I later found out that the order never shipped with FedEx, lie number one. Then found out it still hadn’t shipped with DHL, which I already knew. Lastly I found out that the confirmation number I was given for my refund was in fact bogus, and a refund was never issued. I will now be calling my bank to start a fraud claim, and will be doing everything in my power to ensure this company tanks. I wish I could give them a negative 5 star review.", "rating": 1}, {"title": "STAY AWAY FROM ROTITA", "text": "Made a purchase of a gift. Size was way off as well as color...I followed their return process...8 months = no refund. I have emailed them and they never respond.I supplied my order number...my return ticket number...all that was required.Go to MACYS.", "rating": 1}, {"title": "Ordered over 2 months ago still no…", "text": "Ordered over 2 months ago still no package. Tracking# received over 1 month ago.", "rating": 1}, {"title": "I havent recieved my whole order and it…", "text": "I havent recieved my whole order and it has been two months", "rating": 1}, {"title": "I still haven't received the rest of my…", "text": "I still haven't received the rest of my stuff", "rating": 1}, {"title": "DO NOT RECCOMEND AT ALL", "text": "DO NOT RECCOMEND AT ALL. The bathing suit material is very thin and cheap looking. The bra cups can be seen through the material. The tankini top is not finished on the bottom and looks like a rag.Very disappointed and would NEVER order again. Do yourself a favor and look elsewhere!!", "rating": 1}, {"title": "Ordered my shirts in the beginning of…", "text": "Ordered my shirts in the beginning of April 2020. As of today, June 7, 2020 I have not received my order. I have emailed them 6 times at each time they ask me to wait a few more days. I just tracked my order and it is still in Los Angeles where it has been since May 5, 2020. I have on several occasions demanded a refund and so far no response!!", "rating": 1}, {"title": "Awful. Just awful", "text": "I have never ordered anything that took almost 2 months to arrive and when it did, it was the worst. The quality is, at best, poor. Items look beautiful on line, but it feels like a cheap shower curtain, and the designs on the fabric are screen printed not stitched. After much back and forth, wrong address, wrong delivery code, wrong tracking number, I got Paypal involved. Within two days these items arrived. Please do not buy anything from this company.", "rating": 1}, {"title": "My issue with this company is still not…", "text": "My issue with this company is still not been dealt with. They will not refund my money. My order has not been delivered and the postal service has not details of their tracking numbers. It’s a scam. They are thieves", "rating": 1}, {"title": "Purchased several blouses and they are…", "text": "Purchased several blouses and they are all very pretty.  Unfortunately, they are made of very cheap fabric.  Non-stretch so they run small; subject to electricity so they stick to your skin, and they shrink in the dryer.  Not to mention, just plain uncomfortable.  Don't recommend.", "rating": 1}, {"title": "Bad customer service", "text": "At the beginning of April I ordered two swim suits.  It was returned b/c of insufficient address.  Today is May 29 I still have no credit or suits.  I check with them and I keep getting the run around.  Its also frustrating I never know who I am chatting with it always says Sowshi.  I will never order from them again.", "rating": 1}, {"title": "Placed an order weeks ago", "text": "Placed an order weeks ago . Every time I try to check on my order I get the same response that it has shipped but has no label an they can t give me any more information. I give 0 stars", "rating": 1}, {"title": "The clothing looks nothing like the pictures", "text": "The clothing looks nothing like the pictures.  The fabric is thin and flimsy. You can actually see through the fabric of some of the blouses.  Their merchandise is extremely poor quality. Not worth the money.", "rating": 1}, {"title": "Order Placed 7 Weeks Ago, Still NOT Received", "text": "I placed a $100 order over 7 weeks ago and have never received it.  I starting asking about my order with customer service at the end of 3 weeks.  They keep sending me tracking link.  The tracking link says only that a label was created.  It doesn't show my order ever leaving their plant.  I've asked to cancel the order which they won't do because \"it shipped already\".  HORRIBLE!  I've finally gone to my bank to cancel the order.  At least my money was refunded, but not by them, my bank investigated and refunded my money.", "rating": 1}, {"title": "DO NOT BUY FROM THEM -THEY TAKE YOUR…", "text": "DO NOT BUY FROM THEM -THEY TAKE YOUR MONEY FOR NOTHING!!!!I ordered a bathing suit on April 22, 2020, and paid extra shipping to get it by the first week of May. Ok, now it’s 5/22, and still no swimsuit. All I Keep getting are responses to my inquiries that say “your ticket has been updated”. I don’t believe they ever plan to send my suit. $56.00 NOTHING BUT AGGRAVATION!!!!!", "rating": 1}, {"title": "DON'T BUY ANYTHING FROM THIS SHAM…", "text": "DON'T BUY ANYTHING FROM THIS SHAM COMPANY! My order took a month to arrive. I ordered it 2 weeks before Mother's Day. My wife liked the shirts, but they were over-priced, and TOOK A MONTH TO ARRIVE! Don't buy anything from this sham company!", "rating": 1}, {"title": "It's been almost a month and I have not…", "text": "It's been almost a month and I have not received my order.  Customer service will not refund my money.  They just keep sending shipping updates and ignore my request for a refund.  DO NOT ORDER FROM THIS COMPANY.  YOU WILL NEVER GET YOUR STUFF OR YOUR MONEY BACK!!!Here is a copy of my ticket, most likely from someone in China...I ordered this 4/23 and still has not arrived.Please send a refund.Beth,Tuesday, 19 May 2020 at 18:45:33 PMRotitaDear Beth Sorry for the inconvenience, I have checked your order, your order has been sent out, but due to the coronavirus, the logistics has been delayed, we have urged the express to speed up the transportation, can you wait for a few more days?  Best Wishes!Flora,Wednesday, 20 May 2020 at 09:14:13 AMYouNo. Please send a refund.Beth,Wednesday, 20 May 2020 at 17:56:00 PMYouNo, I've waited long enough.  Please send me a refund.Wednesday, 20 May 2020 at 18:10:15 PMRotitaDear Bethwe are so sorry for delay as the virus , so the shipping is longer than before we also urged the shipping company to update for us can u wait please?if u dont want that , u can refuse the parcel and we will refund for u asap sorry for inconvenience again Best Wishes!Flora,Thursday, 21 May 2020 at 09:19:33 AMYouSEND ME A REFUND NOW. THIS IS STUPID. HOW CAN I REFUSE A PARCEL THAT WILL NEVER COME. IT'S BEEN A MONTH!!! OTHER COMPANIES ARE DEALING WITH THE VIRUS JUST FINE.SEND ME A REFUND, NOW!!!Beth,Thursday, 21 May 2020 at 19:00:10 PMRotitaDear Bethwe checked for u 2020-05-20 11:53 GREENWOOD,IN46143 Arrived Shipping Partner Facility, USPS Awaiting Item Shipping Partner: PITNEY BOWESBest Wishes!Flora,Friday, 22 May 2020 at 09:49:24 AM", "rating": 1}, {"title": "I give Rotita ZERO stars", "text": "I give Rotita ZERO stars. I placed my order on April 18th; today is May 22nd and it still hasn't shipped.  They said it shipped May 15th, but FedEx says otherwise.  The 24/7 online chat service is offline now (go figure) and says to check back in 1 to 2 hours.  Very frustrating - I will never order from Rotita again.", "rating": 1}, {"title": "I ordered a dress for my daughters…", "text": "I ordered a dress for my daughters graduation pictures on April 25th. Today is May 22nd and FedEx still has not received my package from them. I have emailed them 3 times and keep being told it's on its way. I just want the dress immediately or $ back. They respond again it's on its way on Monday and as of today, Friday,  FedEx has not received it. I'm very disappointed and will never order from them again.Follow up: June 5th I asked for my money back again and they again asked if I could be patient and wait 2 more days. I waited 2 days earlier this week and still FedEx has nothing. They said they can't refund me my money 😡", "rating": 1}, {"title": "BUYER BEWARE", "text": "BUYER BEWARE - ROTITA.COMHad the WORST experience trying to do a return with Rotita.com.  I put in a ticket to return nearly two months ago, and constantly followed up via online chat and tickets for support as customs needed a lot of information I wouldn't have on the product.  Rotita kept assuring me they would send a pre-paid return label, promised a manager would contact me within 12 hours, etc etc.....and would never follow up.The latest update I received was yesterday when they informed me that it's now TOO LATE to return the items, even though I've been working to try and return with them for nearly 2 months.  When I expressed my frustration via chat with a representative, they seemed to have blocked my account from using the chat feature.", "rating": 1}, {"title": "This company STOLE my money", "text": "This company STOLE my money, I never received my order and the tracking information/website is fake I called UPS the tracking number doesn’t exist they are refusing to refund my money DO NOT BUY FROM THIS COMPANY THEY WILL STEAL YOUR MONEY", "rating": 1}, {"title": "I ordered 3 shirts on April 27", "text": "I ordered 3 shirts on April 27. This was my first order. As of today May 20 I have not received my order. I went to chat yesterday and today and feel like I got a runaround. Tracking doesn't work. It has been 5 weeks. They say I should get order next week. This seems to be a recurring problem.", "rating": 1}, {"title": "This is my first time ordering from…", "text": "This is my first time ordering from Rotita. My credit card was charged within 2 days but it's been almost a month now and I have not received my Shirts. It's not a good feeling to order something and have to pay interest on money when you haven't seen the product. Not sure if I will use this company again.", "rating": 1}, {"title": "TERRIBLE, TERRIBLE, TERRIBLE ! ! !", "text": "Was told my order shipped on April 24th.  Plenty of time for  a mothers day gift.  As of this morning May 18th, no shipper has received this order.  Numerous emails and on line \"chats\" gets you promises, but no results.  Can't imagine why they don't have phone customer support.TERRIBLE, TERRIBLE customer service.", "rating": 1}, {"title": "I’m still waiting for my full refund", "text": "I’m still waiting for my full refund. They received the merchandise back in the proper amount of time. I paid and insured my package back and tracked it. They received it and the said they cannot give me my refund. Merchandise window was good. Merchandise was packed good. Bathing suits are cheap, thin, and have no elasticity. If you plan on diving in a pool or swimming in the ocean then don’t bother with these cheaply made bathing suits. You will come out of the water with nothing on!", "rating": 1}, {"title": "Ordered 6 weeks ago still no shirts but…", "text": "Ordered 6 weeks received one shirt size medium firts like and xl still have not recieved the other shirts ???", "rating": 1}, {"title": "I didn’t even want to give them a star", "text": "I didn’t even want to give them a star. The bathing suits have no elasticity to them. They are very thin and cheaply made. It took 2 weeks to get because it comes from China. They gave me a tracking number that didn’t work and it came later then the date they gave me. I returned them at my expense for a full refund. Now I’m in battle for my refund. They won’t give me my refund now! Don’t use this company!", "rating": 1}, {"title": "ORDER ISSUES", "text": "I ordered a shirt 3/30 - I truly didn't see this was going to be shipped from China until I received the confirmation of payment within an hour of the order.  I was repeatedly given a delivery date, never came.  Made a complaint thru PayPal and low and behold, got a package today - had a label shipped from California - but the product was nothing like the order.  It was a dress not shirt, navy blue not turquoise, and a full size smaller than the order.  This isn't just an error - this is their way of not having to return money because the order was delivered, even if wrong.  Getting my money back is fruitless.  BUYER BEWARE!!", "rating": 1}, {"title": "I am so upset", "text": "UPDATE:  May 21, 2020Order delivered.  Product review:  I would have returned (because fabric extremely cheap and bottoms are 4 times too big) but unfortunately this particular bathing suit is unreturnable. Final thought...  if you don't mind waiting & waiting and you don't care about quality this china company is for you.  Original post:I am so upset.  You have not even made the label!!!You had no trouble getting my money into your pocket.  That was so fast fast fast!  Only hours after I ordered you got your hands on my money.You haven't done the tiniest of effort on my order.  You have not even made the label. How dare you, your laziness is shameful. Are you gypsies?Shirley L.", "rating": 1}, {"title": "Non delivery and no refund.", "text": "Ordered a top approx 2 months ago. Still hasnt arrived and they wont give me a refund saying I have to wait for the delivery and to refuse the item. I am certainly never going to order from them again and I would urge caution to everyone.", "rating": 1}, {"title": "*Warning!* Rotita Customer Service frustrating beyond words.  Will never purchase anything from these charlatans, again", "text": "Ordered swimsuit 4/30.  As of May 5th, no accurate tracking information.  Spoke to cust service informed them the FedEx tracking number is \"invalid\".Zero explanation why order that they claim has shipped has no accurate tracking info.  Frustrated, angry at being suckered by another China scam site. Expensive lessons learned... only order online from USA vendors.", "rating": 1}, {"title": "Not impressed", "text": "I ordered 2 dresses, they took ages to arrive and didn’t look at all like the pictures, the quality was poor, and it costs a fortune to return them from the UK . I would not recommend to friends nor would i buy anything else. Sorry just being honest", "rating": 1}, {"title": "Not getting order been 3 months", "text": "This is my second time from ordering from Rotita. First time all went well. Loved the dresses. Dresses fit to a tee. My second time ordering has been a disaster. Ordered at end of January. Here it is close to May. Still have not received order. Tracking said it in SC. Been there since 26 Mar. did credit card so I’m gonna make a claim on the card to get my money back. So disappointed and dissatisfied.   Written 3 email. Get same response. Will check on it. Most likely not order from them again.", "rating": 1}, {"title": "I am disgusted …", "text": "I am disgusted with the service I have received.On the 22nd January I ordered two tops. One was out of stock the other was sent.The top I received was not as described I therefore returned it in line with Rotita policy and at a further cost to myself.I have been charged for both items?How is this correct, I never even received one of them!I have requested a full refund of £50.47 only to be offered the top to keep. I haven't got any items!The Customer Service is disgraceful, I would like some form of contact!!", "rating": 1}, {"title": "I am an optimistic person BUT!", "text": "I am an optimistic person and usually understand things happen.  but 3 orders over 9 months have all had some or all of the items out of stock after I purchased them.  Then the difficult process of refund is enormous and always they want to give you store credit on a different item.  My patience is gone, and trust is eliminated.  Oh, and why would I not get money back for shipping and insurance when a complete order is canceled.  I'm thinking there are some consumer laws being violated here", "rating": 1}, {"title": "I ordered a swimsuit a month ago", "text": "I ordered a swimsuit a month ago, they sent me tracking info but it just says label created not yet shipped!!! I have contacted them twice now and get the same answer, they are expediting my order!!! Still not shipped!!!", "rating": 1}, {"title": "Worst company ever!", "text": "Worst company ever! Have not received my order that was purchased back in February, it is now almost May. Every time we contact customer service they say it should be here any day. Still no order. We have requested a refund several times to no avail. Never received an order confirmation when purchased and now they don’t recognize my email and password. When I tried to reset password, I never received the email to do so! STAY AWAY FROM ROTITA! You will never get your product anyway!", "rating": 1}, {"title": "Warning!!", "text": "Warning!!! I returned clothes for a refund right after I received them.  They still had tags on them, I didn't wear them.  They were too big and the quality is nothing like the pictures on line.  I have contacted Rotita 4 times for my refund...going on a month and still no refund!  They do nothing but, give you the run around.  They have had their clothes back since 03/23/2020.  I gave them ample times to give me back my money before writing this review.  Time is up.  I felt I needed to warn you about their very poor business practices.", "rating": 1}, {"title": "Ordered 3/26", "text": "Ordered 3/26, still trackingnot updated to seewhere it is because Ididnt receive it. Rotita keeps telling me to be patient but it doe not take a month for tracking to update. Did they ecen ship it for real? Refund not even offered. Want a damn refund, this is dumb!", "rating": 1}, {"title": "I would never use this site again", "text": "I would never use this site again. I paid £45.25 for swimwear on the 2nd February.  It's now 21 April.  I have never received them and they will notrepay my money after numerous emails and 'chats' I have sent them proof of payment on my credit card but their customer service just keep fobbing me off . They are frauds liars and thieves.  I GIVE THEM MINUS ANY STARS. 😡😡😡", "rating": 1}, {"title": "WON'T REFUND MONEY FOR PRODUCT NEVER DELIVERED!!!", "text": "UPDATE 7/318/2020:Rotitia continues to lie to me and ignore me after seven months of refusing to refund for product they never delivered! They now \"claim\" they issued a refund 7/08/2020, BUT STILL NO REFUND!!!!!REMEMBER PEOPLE, STAY AWAY FROM THIS COMPANY, IF YOU ORDER FROM THEM BE PREPARED TO THROW AWAY YOUR MONEY IF YOU DON'T GET YOUR PRODUCT BECAUSE EVEN IF YOU PAY FOR SHIPPING INSURANCE THEY STILL WON'T REFUND!UPDATE 5/05/2020:So here is the latest response from Rotita on 4/2/2020, and there hasn't been another response from them since this:Here's a direct request from Rotita:\"We will contact PayPal to speed up the review of disputes, please be patient\".So now everyone can see just how much Rotita cares about making things right with their customers who were never delivered their product, they do NOTHING!!!!! They just keep telling lies and trying to give the run around to their customers, because all they want IS YOUR MONEY IN RETURN FOR NOTHING!!!!! SO CONTINUE TO BE AWARE POTENTIAL BUYERS, BEWARE OF ROTITA AND THEIR LIES!!!!UPDATE 4/23/2020:Here is Rotita's next response to my complaint, and mind you this complaint began in January 2020, they continue to use the same excuses and responses, over and over and over and over and over again.  And still they do not honor their policies.   Message from Rotita12 hours ago:We will process your refund immediately after closing the dispute   **Rotita has given me this same response over ten times, and still they haven't refunded my money.  So I will just keep letting the world know exactly what kind of organization this is, and hopefully I can save thousands of potential victims their money and time. DO NOT BUY FROM ROTITA!!!!!  BEWARE OF THE CRIMINALS AND LIARS AND THIEVES THAT THEY ARE!!!!!UPDATE 4/20/2020:Here is another response from Rotita, must be their 100th response by now, then you can read my reply to them, which is after their response:ROTITA REPLIES ON TRUSTPILOT ON 04/20/2020:Thanks for raising this issue with us.According to the tracking status, your order was successfully delivered to the provided shipping address in order: (address removed for privacy reasons)Is it correct? Packages might be delivered to your mail box or signed by your neighbors. We suggest you check in your mail box and with your neighbors first.If you cannot find it, don not worry. We will help you resolve it. Please check for your package with the shipping company and ask for investigation.Your track number is (I removed tracking numbers for privacy reasons).If you still have not found out the package, please come back to me for further help.   My Message to Rotita:To the Rotita representative that responded to my post earlier:YES, for the hump-teenth thousand time, I HAVE CHECKED WITH THE NEIGHBORS AND EVERYONE ELSE AROUND HERE, THE PACKAGES ARE NOT HERE!!!! I have already provided this to Rotita more than TEN TIMES!! Why do you think I am still screaming for a refund?? I have also repeatedly reminded Rotita that I paid for shipping insurance, so that if anything went wrong with the packages, then I would get a refund or get the product replaced. But ROTITA doesn't want to honor their shipping policy, they would rather just keep telling me \"THE PACKAGES WERE DELIVERED, GO ASK YOUR NEIGHBORS!\". I just want my freaking money back, and I vow to never do business with this company again! Freaking thieves and liars!04/15/2020 UPDATE! SEE THE HORRIBLE EXCUSE AND RESPONSE THAT ROTITA GAVE ME REGARDING NOT ISSUING MY REFUND FOR PRODUCT NEVER DELIVERED, EVEN AFTER I'VE PAID FOR THE SHIPPING INSURANCE!  ROTITA HAS NO INTENTIONS OF REFUNDING THEIR CUSTOMERS FOR ANY LOST PACKAGES OR DAMAGED PRODUCT WHATSOEVER!!!  HORRIBLE COMPANY: HERE'S THEIR RESPONSE TO MY COMPLAINT ON TRUSTPILOT:    Reference number: W1912130830491176    Name: TRACY LANGLEY    Email: XXXXXXXXXXMessage from RotitaFriday, April 3, 2020We are not refusing to process your refund, I reviewed your order again, and your dispute is under review, so the refund cannot be processedchargeback-items not received-PP-D-54341875Please close the dispute and contact us to process your refund, or wait for the decision of PayPal, thank you. SO IN SHORT, ROTITA IS A COMPANY OF THIEVES AND LIARS!!!! STAY AWAY FROM THEM!!!!I wish I would have done my research on this company before placing an order.  They charged me for shipping insurance, which their policy states that if I don't receive the product or I receive damaged product, they will replace the product or refund my money.  THEY WON'T REFUND OR REPLACE!!!!  This has been going on since December when I placed an order for 173.41.  They simply refuse to refund the money even though they can't prove that USPS delivered the product to me.  DON'T BUY FROM THESE CRIMINALS AND THIEVES!!!", "rating": 1}, {"title": "I would give them negative stars if I…", "text": "I would give them negative stars if I could. I returned an order. I sent it back they day after it arrived, with the blouses in the plastic bags they arrived in and they told me they could not refund my money because the items are defective. If they are defective it is because they sent them to me that way.", "rating": 1}, {"title": "What a terrible company to deal with.", "text": "I purchased a dress over a month ago and still have not received it. They said the latest it would be here is 4/5/20. That day has come and gone. They can't tell me if it was even sent out because I don't need it anymore nor do I want it. All they keep saying is I should refuse it. They have my money all this time, too.", "rating": 1}, {"title": "THEY LIE ABOUT MATERIAL USED", "text": "They lied about the material used in a dress I ordered. When it came, I knew it was wrong straight away - checked the tag and it was not made from what it was advertised as. I have been arguing back and forth with them because I can't wear a dress to my son's wedding that is made from t-shirt material! They are refusing to pay for the postage to return it. They say it's \"not their fault\"! What a scam... they are rude and ignorant.", "rating": 1}, {"title": "Do not order from this company they are…", "text": "Do not order from this company they are a total sham.take $ say item on back order or it was delivered and no merchandise", "rating": 1}, {"title": "I ordered an item from this company…", "text": "I ordered an item from this company onJan25, 2020 they said my order was going to be shipped  at my house on Valentine's Day I needed it on the 15th it had never arrived they claim the item came,that item didn't come in the mailbox and did not hit my front door now they do not want to refund my money do not order from this company they are thieves, I have sent them numerous of email still to this day and they do not want to refund my money this company is trash garbage thieves", "rating": 1}, {"title": "I ordered 3 tops they were to small I…", "text": "I ordered 3 tops they were to small I requested return ,given return label, did not remove tags only tried on once ,sent in same package they came in ,1week after receiving them they responded that my refund would come after their New year the month of Jan.then in Feb I was told items damaged ,Not True! Would only refund part for the 3 new tops I never received a penny of replacement ,$40.00 for nothing!! Never order from Rotita", "rating": 1}, {"title": "WON'T REFUND MONEY FOR PRODUCT NEVER DELIVERED!!!", "text": "UPDATE JULY 31, 2020:Well Rotitia continues to lie to me and ignore me after more than seven months of refusing to issue me a refund for product they never delivered to me! What's new? Well I sent them another email and dispute ticket on their website via my customer account with them, and they responded by asking for my PayPal account information and claimed they would issue the refund as soon as they received such info. Then they claim refund issued 7/08/2020-BUT STILL NO REFUND! ABSOLUTE LIARS AND THIEVES!STAY AWAY FROM THEM PEOPLE, FAR AWAY!!!UPDATE 06/23/2020:Still no refund or further acknowledgement from Rotitia, that figures since they are thieves and liars! Don't trust their \"shipping insurance\" either, they don't honor the shipping insurance policy, you're just basically giving them more free money for nothing! They haven't delivered the product to me, they won't honor their shipping insurance policy, they won't resend missing product I never received and they won't issue a refund either.  Basically, they just take your money and hope that you get tired of asking them for your missing product or a refund.  I won't get tired, they STOLE MONEY FROM ME AND I WON'T STOP UNTIL THEY ACKNOWLEDGE WHAT THEY HAVE DONE AND GIVE ME A REFUND!  I don't even want their product anymore, it's probably a bunch of garbage anyway. They told me it was delivered, but they can't produce proof, a signature from me that I received the product. They keep telling me to \"go check with my neighbor, maybe they have it\"!  What kind of customer service is that?  Go check with my neighbor????  DON'T BUY FROM ROTITIA, THEY ARE LIARS AND THIEVES!!!UPDATE: It is now 6/12/2020 and Rotitia still has not issued my refund for product they did not deliver to me! As I said before, I WILL NOT STOP PURSUING MY REFUND!!!! IT IS TIME FOR ROTITIA TO HONOR THEIR LAST RESPONSE TO ME THAT THEY WOULD CONTACT PAYPAL TO SPEED UP THE REFUND PROCESS!  WHICH APPARENTLY WAS JUST ANOTHER LIE SINCE THEY STILL HAVE ISSUED MY REFUND!So I just wanted to let the general public know where Rotitia is on refunding my money for product they never delivered to me.  Here's their last response, after over four months of me requesting my refund:You have already sent the following information to Rotita:Email: *******@aol.comMessage:UPDATE FROM ROTITA RESPONDING ON 4/27/2020:***Message from RotitaWe will contact PayPal to speed up the review of disputes, please be patient*************Tracy Langley's response:To Rotita, \"Be Patient?????\" Are you joking right now? I've been complaining about this since January when I never received my package, and Rotitia has done NOTHING but give me excuse after excuse after excuse, telling me so much as to \"Go check with your neighbor, maybe they have your package\"! I HAVE BEEN PATIENT!!! And NO, I will not stop until I get my money back from you criminals!!!!! So you see folks, this is what you get when you order from Chinese criminals online, DON'T EXPECT YOUR PRODUCT AND DON'T EXPECT THEM TO REFUND YOUR MONEY IF SOMETHING GOES WRONG!!!!  STRAIGHT UP CRIMINALS AT ROTITIA!!!!!!!  BUT I AM NOT GOING TO STOP, I WILL BASH THIS COMPANY UNTIL THE END OF TIME UNTIL THEY DO THE RIGHT THING!!!!!I wish I would have done my research on this company before placing an order.  They charged me for shipping insurance, which their policy states that if I don't receive the product or I receive damaged product, they will replace the product or refund my money.  THEY WON'T REFUND OR REPLACE!!!!  This has been going on since December when I placed an order for 173.41.  They simply refuse to refund the money even though they can't prove that USPS delivered the product to me. I wish I would have done my research on this company before placing an order. They charged me for shipping insurance, which their policy states that if I don't receive the product or I receive damaged product, they will replace the product or refund my money. THEY WON'T REFUND OR REPLACE!!!! This has been going on since December when I placed an order for 173.41. They simply refuse to refund the money even though they can't prove that USPS delivered the product to me. DON'T BUY FROM THESE CRIMINALS AND THIEVES!!! You will regret it !!!!! ROTITA-WHY WON'T YOU REFUND MONEY FOR PRODUCT NOT RECEIVED???? BECAUSE YOU ARE A PACK OF THIEVES!!!!! THE ONLY WAY YOU CAN GET MONEY IS TO STEAL IT FROM PEOPLE, YOU ARE NASTY DISGUSTING MONEY HUNGRY DEMONS!!!!!!", "rating": 1}, {"title": "DO NOT TRUST THEY LIE. DISHONEST COMPANY", "text": "DO NOT TRUST THEY LIE.See below about cost of returns when you have taken out shipping insurance.this is just a selection of daily emails. They refuse to pay shipping costs even though before i returned the items I was told twice in writing they would refund because i had shipping insurance. Had i known what it would cost i would prob have kept the clothes and sold on. Now they refuse to provide the name of someone to whom I can complain. They just keep asking what my problem is and repeating I have to pay shipping costs even though they twice in writing said they would refund. DISHONEST LIARS.SEE POINT 4 OF THIS MESSAGEMessage from Rotita12 February 20201. If you do not receive the order in the end, we will refund the full amount. 2.our supply chain and logistics networks in China are experiencing extended shutdowns, so the order arrival time is delayed 3. The latest logistics information shows: 2020-02-11 19:15 Shipment Depart From Hub Scan, CN. Shanghai Hub Export 4.Shipping insurance is optional when you pay. For orders purchased with shipping insurance, if you are not satisfied after receiving the item, we can provide free returns and exchange  Then on 20th febMessage from Rotita20 February 2020OK，fine，Please submit the return tracking number here, once we received the return package, we will arrange the refund or exchange for you immediately. Also, please tell us your PayPal account and we will pay the return shipping fee to you  Now repeatedly..Flora,Tuesday, 17 March 2020 at 17:47:37 PMCustomers are responsible for shipping cost. Judy,Wednesday, 18 March 2020 at 15:37:47 PMthe shipping insurance  is for the refund of the order,sorry. Then ..Judy,Saturday, 21 March 2020 at 13:20:17 PMSorry,according to return policy,you have to bear the shipping fee of return.please kindly knowing that.Then more…Judy,Monday, 23 March 2020 at 16:20:31 PMSorry,according to return policy,you have to bear the shipping fee of return.please kindly knowing that.JUST DO NOT TRUST", "rating": 1}, {"title": "Dress I ordered was so disappointing", "text": "Dress I ordered was so disappointing, really cheap material and very poorly made. Also it was defective having a tear high on the shoulder which couldn't be hidden. The company, in America, ask for returns to be tracked, this cost £13.50 which was nearly half the value of the dress, but .THEY DO NOT PAY RETURN POSTAGE.  So I just wasted my money on a terrible defective garment. Don't be fooled by the lovely photos.", "rating": 1}, {"title": "I think the review here for Rotita are…", "text": "I think the review here for Rotita are FAKES. Take a look at this website - go to sitejabber dot com (Trustpilot doesn't allow websites to be posted)  to get real reviews. Nonexistant customer service, poor quality material, sizes way off, nonexistant delivery etc etc etc Buyer beware.", "rating": 1}, {"title": "BEWARE OF YOUR RETURNS", "text": "BEWARE OF YOUR RETURNS - MAY NOT GET MONEY BACK!!  I ordered two items - took them out of the bag and put right back in - they didn't work.  So I followed instructions  and sent back for refund - Now Rotita is saying they will not refund me because items were returned \" damaged and stained and looked worn\"  That is so not true!!  I returned them in same condition as I received them.  I would recommend not ordering from Rotita if you are not sure you will keep items!   You are not guaranteed getting money back - take pictures to prove the condition!!  The first orders I got I kept all the items - loved them - but no more will I be ordering from a company that is dishonest in their refunding items.", "rating": 1}, {"title": "I wouldn't buy anything here anymore.", "text": "If you buy anything here, make sure you want to keep it, because they will not refund the shipping costs for you. When I wanted to return the order I suddenly couldn't sign in anymore. Then I had a live chat with someone there and suddenly got cut off. Just before they'd told me I had to pay for at least half of the shipping costs. After that I couldn't use the chatroom either. This is the 1st time that I've had a problem like this.I should have read the reviews before I ordered...Lesson learned. I will never order here again.", "rating": 1}, {"title": "Ordered 2nd Feb was late shipping now…", "text": "Ordered 2nd Feb was late shipping now from 28th Feb tracking says missing parcel no further update have emailed 6 times and all I get back is wait more days have a good day that's no good to me parcel was supposed to arrive Friday and hasn't ordered for a party so no need for it now if it ever turns up. If not I expect my money back as items come to £68Update 9.3.20 still showing same tracking went on live chat to be told parcel will be here in days I asked how they know that when they haven't checked there response I will mail you. They have since sent me numerous emails with the return policy on how can I return if I haven't receive it!.", "rating": 1}, {"title": "I haven't received the order my order…", "text": "I haven't received the order my order was made January 31st and I have not received it yet and I don't know my reference number", "rating": 1}, {"title": "Lies", "text": "This website is scary, not trustful, they said good for returns, but nope. The products are very cheap, super bad quality, I hope I read the reviews before I order. I place an order for 7 pieces, and I cancel like 4 days after my order because i received an email saying that my order will be late. I contact  Rotita chat and cancel my order, the lady said ok to cancel dont worry you will received credit in 5 to 7 business days. I ask for a confirmation and they said they will email me the confirmation. I have the chat save ....Like 2 weeks after this i received an email saying they will ship the order. I contact them again and they said sorry we ship you dont want it just refused I supposed to received 2 separate shipments, i refuse one and the other i couldn't because they delivery in front of my house, so I emailed them and ask them for a label for return the items and they said its a flash sale you cant return the items This is ridiculous, i dint order with a flash sale, each piece was $23 so expensive for items coming from china So Now i have to talk to my bank because this company its a joke.Do not recommended and very bad customer service", "rating": 1}, {"title": "NOT a happy customer", "text": "I ordered 2 dresses on Feb. 2, 2020 & its taken over 2 weeks just for them to be shipped out to which I had to write twice about that issue. Now it is Feb. 23rd & I have no idea where they are at this point. I am very irritated at the lack of customer service & the waiting time. The shipping date said they would be shipped out at the very latest on 2/13 but they were not shipped out at that date & I had to write & inquire. If they dont arrive soon, I seriously doubt if I will ever order again.", "rating": 1}, {"title": "I am very displeased of your service", "text": "I am very displeased of your service. I ordered 5 garments and received one. A jumpsuit came yesterday but I didnt order that. One of the items I ordered was supposed to be for an event this weekend. I am very disappointed.  When I track the items, they say already delivered.  Please help..", "rating": 1}, {"title": "order delay", "text": "I don’t receive any item till now how I give you good feedback I don’t buy again from this said.", "rating": 1}, {"title": "Order placed a month ago and payment…", "text": "Order placed a month ago and payment taken.No delivery and no response to the email sent to the customer service couple of weeks ago", "rating": 1}, {"title": "I never got my dress as I cancelled the…", "text": "I never got my dress as I cancelled the order due to no shipment and guarantee that would deliver on time! Said it would be shipped in 3days 10days later still not processed. They said it was to do with Chinese new year but that was in January not now and they are still using that excuse 😒😒I did get a full refund but I would have rather had the dress that I needed for a special occasion.", "rating": 1}, {"title": "Do not buy anything from this site", "text": "Do not buy anything from this site. All the clothes I ordered where made so badly my daughter thought I had bought them for a fancy dress party, Fabric cheap and nothing like the pictures. Usual thing that others are reporting- orders take ages to come and payment is delayed. I will never order from this company ever again. They don't appear to be acting on comments made at all.", "rating": 1}, {"title": "TERRIBLE COMPANY", "text": "I ordered a top which was too big so I returned it and asked for a refund.  It cost £9 as it had to go to America for some reason.  They would only refund in their account which meant I had to buy something else. I sent numerous requests which were ignored, telephoned twice and was fobbed off.  Eventually I got in touch with PayPal and they started a Case for me.  Within two days the money was back in Paypal.  They are a terrible company and I would say dishonest.Would not recommend.", "rating": 1}, {"title": "I was very disappointed in the quality…", "text": "I was very disappointed in the quality of the swimsuit.  It was not even hemmed on the bottom and was cut very crooked.  The shipping time took 37 days from the day I ordered it.  I will not waste my time trying to return it.", "rating": 1}, {"title": "AVOID AT ALL COSTS..DISHONEST ADVERTISING No items delivered, no reply to emails NOW REFUSING TO REFUND", "text": "FURTHER UPDATEDon't bother with shipping insurance which I am told by the company is for free returns if you don't want your items which will have to be shipped to America.  I paid for shipping insurance (£5.99) and they are now refusing to refund £22 postage so I am  now out nearly £30 because of this company's dishonesty.When I asked for a refund and drew their attention to this clause in mails they had sent they replied, ok if you have any questions pls ask, have a nice day!!!!  MY QUESTION IS WHY IS EVERYTHING SO DIFFICULT AND YOU ARE SO DISHONEST??TOTAL JOKE OF A COMPANY. Ordered items in early Jan. They advertise shipping within 3 - 4 days. Then had email saying Chinese new year which starts on 20th Jan was causing probs with delivery. WHY?  If they were shipped in 3 - 4 days they should have been half way to me by 20th.  Was told guaranteed delivery by 6th Feb latest but nothing has come. Have emailed but no reply.  Suspect this is elaborate scam.  Now have to try to get money refunded by credit card.UPDATE It is now a week past the delivery date given. I have been in contact with this company and asked no less than 4 times for a refund and they refuse. Answers are totally illogical. Told they could not cancel the order because it had shipped and I had to wait for them to be missing before they would refund, how long I have to wait is not clear as far as I am  concerned they have not been delivered now.  Then I am told they have now shipped on 11th Feb so they didn't even leave China until well after the date for delivery and they could have cancelled this order because it hadn't shipped which was their argument in the first place FOR BEING UNABLE TO CANCEL IT. I would NOT RECOMMEND THIS COMPANY . Very slippery business dealings they just want to take your money, VERY POOR CUSTOMER SERVICE. SHOCKING DOESNT EVEN COVER IT.FURTHER UPDATE This company has now said that the items have been posted  (ON 11TH) but will take another 3 weeks to get to me, I am to refuse delivery then wait another 3 weeks before they will refund.  So in total it will have taken more than 2 months for them to discharge their  responsibilities, very reluctantly.  THEY ARE A JOKE. TOTALLY UNREASONABLE EXPECTATIONS.", "rating": 1}, {"title": "I have palced to order just prior to…", "text": "I have palced to order just prior to the coronavirus outbreat and mor my orders are still in Processing status.  I need to get a refund and fear the items shipping one day and being infected.  I need a good number to call for a refund.", "rating": 1}, {"title": "I returned this sweater and was told…", "text": "I returned this sweater and was told that I would be getting my refund within 6 to 10 days. It has been over 2 weeks and I have yet to receive my refund", "rating": 1}, {"title": "Bad service", "text": "Very bad service. They said processing time is 1 to 3 days. I ordered a jumpsuit since 26th January till now they didn’t ship my order. I sent couple of tickets no one is replying from customer service .", "rating": 1}, {"title": "I have been waiting a month for my…", "text": "I have been waiting a month for my stuff. I asked where is was and got a BS response that it was being PACKAGED. Just now being PACKAGED after a MONTH???.!!! Will never ever ever buy from here again!!! STAY AWAY!!!!", "rating": 1}, {"title": "0 stars!!", "text": "This company should not even be in business. Put in an order for 16 items. I received a email saying it may be shipped in separate orders. okay. Got the first 7 days later 2 items. next one 4 items. No email stating why the rest had not shown up. I put in a ticket for cust serv to contact me. They said within 1 business day I would get a response. 5 days later I contacted chat service. She said the rest of my order would come 15 days later! I said unacceptable! She then said 10 days later, I said unacceptable. She said my order would be delivered in 2 days. Never happened. 5 days later, I get another email that your order will be divided into separate orders. The clothes that I have received are of horrendous quality. Since you cannot get a magnified look at the items, you really cannot tell what material they are made of. I will probably need to return all of them. Save yourself some trouble and grief and stay away from this online store!", "rating": 1}, {"title": "Don't waste your money", "text": "Waited 6 weeks for awful bad fitting top. Very badly made with loose threads on seams, no wash instructions label & no returns label.I am not attempting to return it - too complicated - judging by other customers experiences. Just will never again buy from Rotita.", "rating": 1}, {"title": "Bad Shipping Time", "text": "I ordered two items on Dec. 19, 2019. It is now January 17, 2020. I have submitted a ticket to Rotita asking where my package is in tracking and they can not give me an answer. I contacted the support chat and all they could tell is it would be here soon. On Google it states 1-4 business day or 6-9 business days on some items.", "rating": 1}, {"title": "Awful Awful Awful", "text": "Awful Awful Awful - THIEVES!!!Also, do not call ANY phone numbers associated with Rotita or it will cost you MORE money.", "rating": 1}, {"title": "Not received my products bought…", "text": "Not received my products bought on12/12/19 latest delivery date was 9/1/2020. Order number w1912132202447953", "rating": 1}, {"title": "Material awful", "text": "Material awful. Customer Service even worse.Wish I would have researched this company prior to placing a large order. I doubt I will ever see my money.Don't bother with this company. No phone number to talk to a rep.", "rating": 1}, {"title": "I ordered a shirt from this company…", "text": "I ordered a shirt from this company almost a month ago. Still have not received my item but they quickly took my money out of my account for the item. At this point I'm over it and asked for my money back. Live chatted with a Rotita worker who told me I would have to receive the item first then return it. When asked why if I dont want item.  There reply was ship it back with flat rate. I URGE PEOPLE DO NOT GET SUCK IN BY THIS COMPANY ROTITA IT IS NOT WHAT IT SEEMS. THEY ARE NOT CUSTOMER FRIENDLY. READ THE REAL REVIEWS LIKE THIS NOT THE ONES ON THERE WEBSITE.  ANY HIGH REVIEWS ARE FAKE I SHOULD HAVE RESEARCHED BEFORE ORDERING FROM THEM I WILL HAVE TO TAKE THIS HIT LIKE A TROOPER BUT I WILL WARN OTHERS.", "rating": 1}, {"title": "Beware", "text": "Beware !  Same web advert, diiferent company names. Another Chinese site selling cheap and nasty clothes. Like Damensein. Avoid.", "rating": 1}, {"title": "It has been 48 days sense I placed my…", "text": "It has been 48 days sense I placed my order.  No update on tracking page.  No help from customer service!  If they have a 30 day return policy from order date, WHAT THE HELL!  Right now 18 days past this and have not received anything!  I will be reporting this to anyone that will listen!UPDATE:  My package finally came 60 days later!  I did receive some of my money back.  Yes I did get my product so what was I out... TIME and money.  I needed to buy another outfit for my outing.  After I posted a review did someone try to reach out.  They just wanted to get a better review.  Nope!  I am not happy with not knowing this company gets things from overseas.  Would never have ordered from them.", "rating": 1}, {"title": "I wish I would have done my research…", "text": "I wish I would have done my research before I purchased from this company.  I placed an order on 12/13/2019 and I still have not received my product as of 01/10/2020.  Every time I open a Chat Session to inquire about my order, \"I am told to be patient and I will receive my product\".  The Chat agents don't work for Rotita directly, they are outsourced, so they can't actually do anything for you except to try and reassure you that your product will arrive soon.  Since there is no phone number to contact Rotita directly, all you can do is open a \"Ticket\" about your order on their website, which I have done several times, and still to this date I have not received a response from them.  THEY ARE DOWN-RIGHT THIEVES!!!!  I have disputed the transaction with my credit card company, and thankfully they are honest and reputable so I will get my money back from Rotita, but if I could turn back time and never have placed the order, I would!!!  I will file complaints with any and all Domestic and International agencies that will allow me to.  Consumers should not have to deal with online thieves like this!  SHAME SHAME SHAME!!!", "rating": 1}, {"title": "Avoid this company altogether", "text": "Avoid this company altogether.  First tee shirt I received was way too big.  Had to pay £6 to return it and the replacement was even bigger.  I have been trying to get a pre-paid returns label without success even though I tried through the live chat system, which was painful to say the least.  Aside from this, quality of product was poor contrary to other glowing reviews.  Would not buy from Rotita again.", "rating": 1}, {"title": "The clothes are poor quality thrown…", "text": "The clothes are poor quality thrown together very quick and the return policy is even worse. I have tried and tried to return these 2 tops it keeps telling me my order number is not correct. This is the same order number I got when I placed my order and there is no phone number to call anyone.  Next stop goodwill!", "rating": 1}, {"title": "Refund policy", "text": "They make returning an item for refund nearly impossible, for us, completely impossible.  Bought 2 items for my wife for Christmas.  One wasn't to her liking.  To get in time for Christmas had to order over 30 days before the holiday and that negates their return policy.  Even then when trying to return, the only option available was to credit our account, meaning no refund, just have to buy something else from them.  Will never buy from them again, suggest you don't either.", "rating": 1}, {"title": "I returned 1 of 4 things to Rotita for…", "text": "I returned 1 of 4 things to Rotita for a refund and have not yet received any information as to whether the item was received. I have not received a refund.I went on their chat service and the lady (Suganya) was slow to respond every time I asked a question (about 6 times) and in the end and after 45 minutes of being on the chat, she hung up on me without any kind of an answer. When I asked how long this would take, she would just say \"wait\" and keep me there until she no longer was there.I had a similar experience (but not as bad) when I first asked how to refund the item. If this is the kind of service they offer, I want nothing to do with them and will not buy from them.", "rating": 1}, {"title": "Beware of 30 Day from Order Return/Refund Policy", "text": "I bought a couple of nice looking tops for my wife for Christmas 2019.  Because of the advertised 2-3 week shipment schedule, I ordered them just before Thanksgiving on November 17th.  And they arrived on December 18th – basically, one month after order.  But in sufficient time for me to wrap them for Christmas.Anyway, after Christmas\"try-on\", they didn't fit.  My bad.  Worse, I discovered that Rotita has a 30 day refund/return policy FROM THE DATE OF ORDER!  No exceptions – even though it took the 30 days just for shipment.  I find this unacceptable.  I won't buy from this company/.com site again.Advice to you, don't buy if you can't live with the 30 day refund/return policy.", "rating": 1}, {"title": "Beware fake five star reviews", "text": "Beware fake five star reviews. The five star reviews on this website seem to be by people with broken English and are probably written by scammers. As 40% appear to be 1 star, obviously not s good company.", "rating": 1}, {"title": "This is a total scam you do not get…", "text": "This is a total scam you do not get your order they keep telling you to wait because after a certain time you cannot do anything about it buyer beware and the items you get are not the quality that is stated on the website.", "rating": 1}, {"title": "WORSE CUSTOMER SERVICE", "text": "WORSE CUSTOMER SERVICE. EVER!!! Never received any email such as confirmation emails, customer service emails or any other notification emails. Can't log into my account. Keeps telling me my password is incorrect, which is BS. Requested the link to reset my password a week ago. Tried calling them and it was horrible. Could not understand a damn word as the background was too loud. Absolute incompetent company. Cloth are not as pictured. I wouldn't even bother! Completely waste of money and time. Still need to return two items. Absolute horroble.", "rating": 1}, {"title": "The top I ordered looked absolutely cheap", "text": "The top I ordered looked absolutely nothing like the photo online.  It was a gift for my aunt and I thought she still might like it but she didn't.  It was ONE day over the 30 day return policy and they won't take it back even after I explained that it was a Christmas gift and therefore I had to wait for Christmas.  The inflexibility of this company shows that they don't value customer relationships.  I can go to Kohls, Target or anywhere else and they will take returns pretty much whenever (within reason). In today's competitive online marketplace with so many choices, this company is not one that I choose to do business with.", "rating": 1}, {"title": "Ordered 3 tops for Christmas on…never received", "text": "Ordered 3 tops for Christmas on November 26 and never received them. Wow... said 7-10 days.", "rating": 1}, {"title": "Cheap and nasty material", "text": "Bought a top. Looked ok on picture. When it came, cheap and nasty material. Nothing like the picture. Horrible.", "rating": 1}, {"title": "Very Bad", "text": "Very Bad! They do NOT refund you when you return items even with proof of postage! I am still waiting for an £81 refund when i returned the items back to them on 3rd November 2019. I have tried to chase it up and contact them many times but they are just ignoring me. They will also only be contacted by email or chat, not by phone. Please dont get conned like i did!", "rating": 1}, {"title": "Refunds cost you more as it’s a USA company!!!!", "text": "I ordered a jumpsuit and then realised it wouldn’t get to me in time as being shipped from USA , cancelled it 10minutes later, but they said it had already been shipped? Once arrived it was very cheap and nasty material, nothing like the picture. Cost me £13:50 to return (they don’t refund you the postage), I would say if you return anything to them always have your package tracked, as they ask for your track number for refund. Will never ordered from them again, avoid like the plague!!!!!!", "rating": 1}, {"title": "Avoid like the plague", "text": "Avoid like the plague, pictured items shown do not represent the true item. The product are cheap looking in the flesh and badly finished.  Shipped out from overseas and not easy to return. Costs more to return the item than to purchase in the first place.", "rating": 1}, {"title": "I ordered 3 tops online which were…", "text": "I ordered 3 tops online which were supposed to be plus sizes. Well they weren’t plus size & they didn’t fit. My caregiver talked me into going through PayPal (mistake) when the package arrived it did not contain any paper work, no bill of sale, nothing to identify where it came from. Return address was:Dept. NJ # 11691100 Cranberry South River RoadMonroe Township NJ 08831There was no company name & without any paperwork I was afraid to just send it back. All that PayPal could tell me that the tops were ROTITA.  I googled the address on package & discovered that it was shipped from a fulfillment center called:US ELOGISTICS SERVICE CORP(833) 356-4478All that one reaches is recorded messages. So I own 3 ROTITA tops that I can’t wear.", "rating": 1}, {"title": "Xmas top in time for January 11th. Disgusted.", "text": "Utterly disgusted that this company is allowed to advertise Christmas products on my Facebook page. I had no idea they are in China and despite ordering on 6th December they inform me I will receive my ‘Christmas outfit’ by11th January. They haven’t even sent it yet!This should not be allowedI am reporting to face book and PayPalMisleading and dishonestI want a refund but I cannot get one. Why on earth would I want a Christmas top in January?", "rating": 1}, {"title": "Had I know Rotita HQ is located in…", "text": "Had I know Rotita HQ is located in China, I won't place an order!  I am still waiting the items to be delivered since November 29th and nothing yet!  No updates in the tracking system even though I have place two tickets for follow up.   I am not going to buy anymore from Rotita.", "rating": 1}, {"title": "I haven't received my items yet, I place my order December 24,2019 it should've been hear by Jan 15,2020..My items haven't move since January 7, I need to speak to a manager about this once again issu", "text": "I can't wait to get my items from this company so I can be done! They are not on the same page yall telling me two different responses, This company was trying to  Accommodating me from my The experience I was having, Thanks for the fast refund you did. Just shipp my items on time.. So I don't have to contact you anymore. You are not responding anymore, you ask me to give you a 5 star I can't at this time, maybe once I was receive my items on time I will. You said it would be shipp on December 31, I'm still waiting and see..", "rating": 1}, {"title": "Do you not buy anything rotita", "text": "Do you not buy anything from this company. I sent two items back following all of their directions which are very specific. I did not get a refund so I followed up with claim emails which I got computerized responses. No matter what I did changed the response. I asked them to call me and then I started getting calls in Chinese. Finally I gave up because I was sick physically and felt it just wasn’t worth it.", "rating": 1}, {"title": "Ordered a dress-Dreadful quality. Poor return policy", "text": "Ordere a dress some weeks ago. No order confirmation sent via emai and unable to track order. It arrived a few days ago and the quality was very poor with unfinished stiching and large threads hanging loose at the front. I requested a refund and was told I would have to pay for the P&P to an address in New Jersey! Never again will I buy from them and I will be checking their status in the US and whether they are breaching US consumer rights as they are trading from a US address.", "rating": 1}, {"title": "Not happy at all", "text": "I would rather have given no star. I bought a dress for Christmas, but when I received it the quality was poor. I contacted Rotita and had an online chat at first and was told to return it to a specific address in USA and that I had to fund the postage myself. The postage was nearly £12 which was just under the cost of the dress. I contacted Rotita again and asked if I could exchange it. They said yes exchange would be free. But it had to be for the same item. I will never shop here again.", "rating": 1}, {"title": "Buyer Beware", "text": "I ordered 3 tops  and the prices were great. When they arrived, I was very disappointed. They looked much better on line. The material is very thin and cheap looking. Returning has been difficult. The Company is difficult to contact and when they finally gave me the address to ship my items back, they continue to question asking \"which items did you send back?''. It's been weeks since I did the return and still no refund. Plus, you have to pay for the return postage.", "rating": 1}, {"title": "This is probably been one of the worse…", "text": "This is probably been one of the worse shopping experiences that I have any had. I paid foe expedited shipping and can't even track my merchandise. It has been 10 days and  still no merchandise or am I am to track it. And what makes me the angriest they don't even have a contact number. You have to correspond with them through email and they seem to only respond in the middle of the night. They don't try to go above and beyond to assist the customers with these issues. All of the agents keep telling you the same thing instead of trying to see where your item is. I will never deal with this company again", "rating": 1}, {"title": "Waste of time if you live in the UK…", "text": "Waste of time if you live in the UK throw your money in the drain it's less effort", "rating": 1}, {"title": "Bad service - dont go here", "text": "I returned one Item, very expencive from Denmark. You told me you Got it, but I never get my money back.Stay away from Rotita if you by wrong size.Very very Bad service, no wrong, not service at all.", "rating": 1}, {"title": "I was promised delivery before 12/25. Not true!", "text": "I was promised my order would be delivered by 12/21/19. Now that I paid for the order, only 2 of the 4 items ordered will be here before Christmas at all. Now I have to buy additional items and go through the hassle of returning half of the order. I WILL NEVER USE THIS COMPANY AGAIN.", "rating": 1}, {"title": "Poor quality/sizing/shipping time", "text": "The clothing took forever to get and the quality and sizing is terrible. Didn't even bother trying to send them back for a refund.  Not worth the $50.   Do not buy from them.", "rating": 1}, {"title": "Beware of this company", "text": "Beware of this company. The fabric is cheap and sizing is bad. I returned a blouse over 2 months ago and still no refund. First they kept saying they didn't receive the return (even though tracking said they did and post master checked their box and said item was in their return box. He also said \"they just rarely open it\".) After reporting them to PayPal they finally wrote to me admitted they received it and then said \"we need to check its status and record it to our systems first, could you please wait more several days for refund?\".  That was over a month ago...still no refund and now they say they cannot refund now because I opened a case with PayPal. They wrote \" Go to PayPal and close the dispute first. Or the system won't let me refund you.\"What a joke!Now we are out not only the cost of blouse, but also shipping (back) cost. Do not buy from them!!", "rating": 1}, {"title": "just vile the clothing is cheap and…", "text": "just vile the clothing is cheap and nasty and their client liaison is rubbish , they gave me the wrong post code to send items back, i believe on purpose . Never ever purchase from this company", "rating": 1}, {"title": "The phone number that was left in the…", "text": "The phone number that was left in the reviews is a scam I called it and the guy stole my Identity and tried to use my card to buy gift cards at Target luckily I shut the card off before he got anything. I hope.", "rating": 1}, {"title": "All items too small", "text": "All items too small.  It will cost so much to return them to the USA and they might only give you a partial refund if you have tried them on - ie taken them out of the packet.  Although they are a legitimate company it is a kind of scam as they know that it will cost so much to return the goods that people will keep them and give them to someone else.  VERY disappointed.DO NOT BUY FROM them", "rating": 1}, {"title": "This site is a scam I lost my money I…", "text": "This site is a scam I lost my money I guess. They took my money said they shipped it but when I tracked it it never made it to the postal service. When I tried to contact them they had no phone. Only live chat which wasn't live and now 22days later I haven't gotten any answers", "rating": 1}, {"title": "This company sells weird polyester clothes!", "text": "This site just sucks! Clothes are trash!Do NOT waste your money buying this stuff. I wouldn't even give it to charity!I have been emailing back and forth for a  ticket to send products back. What a nightmare!!!!If I could rate ZERO I would!", "rating": 1}, {"title": "Do not use this company at all!", "text": "Do not use this company at all!. They don't send the goods out. I tried to contact them several times and they refused to chase the courier. When I asked for a manager and a refund, they refused. They also lied and said the goods have been delivered when the courier site clearly says \"in transit\". I've been charged for something I have never received..", "rating": 1}, {"title": "Very bad website", "text": "Very bad website. Took money and do not send the goods. Avoid this company at all costs. You've been warnedFinally goods have arrived but quality is poor. Not like the images shown on website. Not worth the money even with discount.", "rating": 1}, {"title": "I've had a very bad experience with…", "text": "I've had a very bad experience with Rotita and i just had to come warn other buyers to beware. I ordered three dresses on rotita in September. The orders were delivered on October 6. For context, i live in Canada. On getting the order, i found the quality of the dresses were really poor and substandard for a $40 dress (each) so i returned them through USPS to the address provided to me by their agent. My return was received on October 14, still within the 30 days return policy. I never received a refund and today, December 5, i reached out to them through live chat and the agent disconnected the chat when i asked for my refund. So i opened a new ticket, aside from my original refund ticket and got a message from them saying my return period had exceeded the 30 days return period and was no longer eligible for a refund. In my mind, an online store with no physical location shipping from China is nothing but a scam. Buyers beware!Update: After posting my review here and various comments on their Facebook page, i got my money back. So thank you Trustpilot!", "rating": 1}, {"title": "This is a company is in China and Scams you out of money.", "text": "This is a company in China.  I do not trust their reviews. They probably have people writing fake reviews. I heard many Chinese companies do this. They do not provide a phone or email to contact customer service. Ordered $245 worth of tops for granddaughter 3 months ago and never got them. Went to try to chat online and rep said she does not see my order, then she disconnected chat and now I can’t get back in to chat. I think they blocked me some way.  They got my money. Scam alert.", "rating": 1}, {"title": "WHAT A JOKE!!!", "text": "They take your money quick and then when you question them they say item is out of stock!!! DONT WASTE YOUR TIME", "rating": 1}, {"title": "NO Customer Service at all!!!!", "text": "I spent quite a bit of money with Rotita, but they do not appreciate your business and do not value their customers at all. Their customer service does not exist. I requested an exchange of a shirt because the size was wrong and they refused!!! Yes they refused an exchange and kept quoting the same paragraph over and over which talked about a return and refund. Apparently they do NOT understand English at all and care nothing about their customers' happiness!!!!", "rating": 1}, {"title": "HORRIBLE CUSTOMER SERVICE, AND A SCAM!!!!", "text": "I placed an order a month ago.  Still haven't received the order.  The only way to contact customer service on this site is through live chat.  When I went on the live chat this morning and asked about my order,they said it was never shipped out.  When I started asking more questions and demanded my money back, THE REP LEFT THE CHAT, THEN BLOCKED ME FROM CONTACTING ANYMORE! WHAT THE HELL KIND OF CUSTOMER SERVICE IS THIS???  I will be telling EVERYONE I KNOW, and also sharing on all of my social media, what a SCAM this place is!  HORRIBLE!!!!!!!", "rating": 1}, {"title": "DO NOT ORDER FROM THIS COMPANY!!", "text": "DO NOT ORDER FROM THIS COMPANY!!! I've been trying for over a week to get a return label. The only way to talk to someone is by Live Chat, I've been on there 5 different times and they promise they will send a return label by email but it never comes. I will never order from this website again!", "rating": 1}, {"title": "AVOID AVOID AVOID", "text": "The worst company I dealt with.Ordered some staff,got them a month later,looks cheap,secondhand clothes,went on live chat and been advised that I do not need the items back and I will get my money back within 7days,waited for 2 weeks,nothing happened.Went on live chat again,spoke to someone and been advised they will send me a free label within 12 hours,that I can return the items,then they will proceed the refund.Waited 4days,and of course no email,went on live chat again and the same story,that first refund us free and they will send me a free label to send the items back.It is more than 24 hours and no email.I also complained the consumers.ACOID AVOID AVOID.They were my biggest disappointment", "rating": 1}, {"title": "This company is a scam!", "text": "I ordered two tops from rotita. They were very unattractive and ill-fitting. I followed the company's instructions for returning products for a refund, paying return postage myself. I finally received an email stating they would not give me a refund because the tops were 'soiled and stained'. This was decidedly untrue. I believe this company is a scam. I would NEVER buy anything from them again.", "rating": 1}, {"title": "I ordered bathing suits which I tried…", "text": "I ordered bathing suits which I tried to return. I sent them back in a timely manner and did not hear back from the company for many weeks. When I finally did they told me they could not refund the original form of payment because too much time had passed. They never did refund, only gave me a credit. Their excuse made no sense. They said the system would not allow it. I will try to use the credit but I will never shop with them again once the credit is used.", "rating": 1}, {"title": "Customer service was terrible", "text": "Customer service was terrible.  I needed to return a gift I got for my wife because the size was wrong.  I had planned on ordering a different size to replace it but whenever I tried to process the return it would tell me there was a problem with my zip code (it said zip code must be an integer but you can't change anything).  After seeking assistance I was told all sorts of odd things, including \"go to the checkout page to get free shipping\" and \"I would be sent a return label to my email address\" all of which was wrong.  Won't shop here again if this is what they mean by \"easy returns\".", "rating": 1}, {"title": "Customer services are a bad joke", "text": "Customer services are a bad joke. No help whatsoever. Twice tried to resolve my problem, a simple question, and both times eventually asked to speak to a supervisor and agent cut the connection and I could not retrieve the transcript of online \"help\". Returning an item cost £9.10 without tracking. Such a shame nice clothing is ruined by uncaring, untrained and ignorant customer services. Tried submitting a ticket. That didn't work either! I will not be using again.", "rating": 1}, {"title": "Still waiting on my money back after 10…", "text": "Still waiting on my money back after 10 + emails giving them the same information over and over........They say money was given back but haven't seen it yet!!! Please be careful when ordering from this company!!!  I will never order from them again.", "rating": 1}, {"title": "Appalling", "text": "Appalling, they are not worth any stars. I ordered a top on the 2nd Nov paid for via PayPal on the 4th Nov. After item not delivered within time scale given, I checked with them to be told order expired??. They have my address but didn't bother to inform me nor have they returned my payment. Company very hard to contact.", "rating": 1}, {"title": "I ordered 1 item from Rotita", "text": "I ordered 1 item from Rotita. I received 3 of the same kind. I realized that they had charged me for more that one item even if the receipt specified that the order was for one. I contacted Rotita and asked if they wanted me to return the extra 2 items and if I would get a refund. They said \"no.\" This company is not  straight forward. Do not order from them.", "rating": 1}, {"title": "I will never order from Rotita again", "text": "I ordered 2 Christmas tops.  One was sewn very poorly, so I returned it.   The other one had wrinkles all around the shoulders and sides of the sleeves.  I can sew, so I decided to take the sleeves out and sew them in correctly.  However, the one arm hole ended up being much larger than the sleeve, so I took the sleeves out completely.  I will NEVER order from this company again.", "rating": 1}, {"title": "I am disgusted with this company...no…", "text": "I am disgusted with this company...no returns form...they make it very hard to get any information to send any item back ...plus the customer has to pay delivery back ...when received item the material is cheap and tacky...stay well clear😵", "rating": 1}, {"title": "Ordered and received a Christmas top", "text": "Ordered and received a Christmas top.  It was nothing like the advert'.  Quality was appalling - went straight into the bin.  I'm surprised they're still in business.", "rating": 1}, {"title": "POOR SERVICE", "text": "They are the worst never ever ordering anything from them ever I had ordered two dresses from them to go to a wedding here I am waiting for it to arrive not knowing that they canceled my order without informing me they couldn’t give me a reason why they cancelled it I contacted the customer service live chat all they told me was that the order was cancelled and that I would get back my refund in 7-10 business days and the person just ended the chat right away I couldn’t even ask anything else they so rude and unreliable DO NOT BUY FROM THEM", "rating": 1}, {"title": "The dress looks nothing like photo on…", "text": "The dress looks nothing like photo on web site  it looks like a potato sack never purchase again from Rotita", "rating": 1}, {"title": "I will not buy from them again", "text": "I will not buy from them again.  Some orders never arrived and tracking #s were incorrect.  The order was split into multiple orders and the ones that actually arrived took several weeks and there are no use and care directions on the garments or in the packaging.  No tags or labels at all, so not sure where they were made or how to wash them.  The sizes are inconsistent and none fit well.  Feel like cheap material.  Tried to contact their customer support but not able to connect.", "rating": 1}, {"title": "Do not order from these people!", "text": "Do not order from these people!After 5 weeks of waiting I received my parcel. So disappointed as it was nothing like the advert. Same material but shapeless and made of inferior material. I am a size 14 and this would fit a size 20+. The advert made the top look fitted and this was anything but. No shape to it at all. I tried to return it and was given 2 choices. Return it or accept a refund without returning it. The price to return it - to the States- even though it had come from China - was £12. I'd paid £25 for it.So I decided to take the refund and not send it back thinking I would get at least half back. They gave me £4.96 So do not order, you will not get what you are expecting.I am now seeking a fat woman I can give it to for Christmas!", "rating": 1}, {"title": "WORST COMPANY EVER", "text": "WORST COMPANY EVERI ordered four different types of tops. The material was horrible. Super cheap looking and felt like plastic. I only took two items out of their bags to check it out and did NOT even try it on. When I returned all the items, they said that one of the items that I took out of the bag was damaged even though it was never even tried on. In addition, the refund process has been very difficult. An email was sent to me saying my money was refunded on Oct. 2 but the credit card company has still NOT received it.DO NOT RECOMMEND!!", "rating": 1}, {"title": "I  agree with all the negatives", "text": "I  agree with all the negatives.   This is the worse company I've ever dealt with.   Ordered merchandise which was at least two sizes smaller than my usual and was told I had to complete a \"ticket\" to exchange them.   I completed 4 tickets but no answer and no way to get in touch with them.I'm stuck with the cothing and out a fair bit of money", "rating": 1}, {"title": "Wished i read the reviews first.", "text": "I was hesitant about buying from this company and now i wished i didn't. i placed my order last week and the shipping for my items was way too long. So i decided to have my items expedited because i am leaving town for the thanksgiving holiday. I did live chat and was told i can get it sooner by paying the shipping fee which was $11.47. This was on nov 11. I clarified with the rep when will i get my items and she said 3-5 days. I got an email today saying my order has been dispatched and start tracking in 3 days and my items will be here between nov 30-dec11. UNACCEPTABLE!!!! Oh can't live chat now. imagine that. Never will i order from them again!", "rating": 1}, {"title": "Do not buy from this company", "text": "Do not buy from this company. Items are poor quality. You must pay shipping for refund to China. Company representatives want you to be front of computer to explain refund. Don't fall for this foolishness just DONT buy from Rotita.!!", "rating": 1}, {"title": "Untrustworthy company", "text": "Tried to return an item when I put in my details it said my e mail was incorrect, that funny as I have numerous e mail with adds and confirmation of order & delivery.  Tried to use their on line chat but said they would e mail me with refund details!!.Then lost connection.Clothing I was sent was disgusting still one waiting on another item.Only gave one star as You have to do to let you right a review.Obliviously a very untrustworthy company.", "rating": 1}, {"title": "Horrible service", "text": "Horrible service. I placed my order for four blouses on 10/20/19 and it was worth $124.00 until today (11/14/19) I have not received all my ordered items. I just received one blouse it is absolutely not worth the money that I paid for it. The blouse that I received looks like rag pieces stitched together. Still waiting for the rest of my three items. God knows when I will receive the rest of my items.", "rating": 1}, {"title": "I received my jumper/top today and it is horrible quality.@", "text": "I received my jumper/top today and it is diabolical, too small, badly finished and in really lousy material.It is a shame that the picture of it on the website is so inviting, I will never purchase anything from them again and am now going to see about a getting a refund.", "rating": 1}, {"title": "Order of 3 shirts.", "text": "I ordered 3 of their shirts.  In their pictures all the colors were very bright and pretty.  When I finally received these shirts the colors are dull and looks very cheap. I will not order from them again. I have thought about ordering some of their swim suits but I guess I will not be doing that.", "rating": 1}, {"title": "Don't Give Them Your Money", "text": "I noticed all the fake five star reviews in a transparent effort of the company to get a higher rating. I am giving them a 1-star rating to balance out their fake positive reviews. Hopefully enough people read the bad reviews and stay away before they throw away their money on a crappy product from a company with a bad business model. After reading real reviews from real people, I will not buy from Rotita. I decided to look them up because I noticed that the photos showing their tops use the exact same model in the exact same pose, meaning that the shirts were photoshopped on to the model. I was suspicious that this likely means the clothing doesn't look like it does in the photos. After reading the reviews, I can see that the negative reviews all state that the clothing does not fit as expected and is not made from quality materials. I've been in that situation before and will never take a chance again on something that looks fishy. Avoid, avoid, avoid. Come on, Rotita, just make stuff that's actually as good as you say it is.", "rating": 1}, {"title": "i ordered a few dresses to try for size…", "text": "i ordered a few dresses to try for size which looked lovely on their website, they took ages to arrive even though i paid for faster delivery. when i opened the packets they were cheap tat and nothing like the photos on the website. when i clicked on return, all these terms and conditions came up about, even if the dresses have only been tried on, they will view them as been worn and they will only refund 50%!! And that if i send them back with a signature required, there is a good chance,they won't receive them, and if that were to happen i would receive no refund at all. To continue with the return they wanted me to accept these terms. i logged out of the account and im seeking help from paypal, as i can't risk not getting a refund or 50% back. Not worth buying from them.", "rating": 1}, {"title": "Beware, Don't Order from them!!!", "text": "Apparently, I'm not the only one!  I've been trying for more than a month to get my refund for items I did not received and as of today, I have yet to see my refund.  I've been given the run around, that it's been more than 30 days and our policy, blah, blah, blah.  I keep telling them, it was resolved and JUDY (who ever she is), was going to refund my money and I haven't see it yet.  Good luck if you use them, but beware, their products are poor quality and are not true to size.", "rating": 1}, {"title": "Good thing I read the reviews", "text": "Good thing I read the reviews. I'm not going to order the top that I really liked. Seems most people we're not happy with this company", "rating": 1}, {"title": "Awful.. avoid this company", "text": "Awful... avoid this company. i bought a christmas dress for £25, which is too big and doesn't look nice... only to find that their return address is in USA... which will cost me about 1/2 the price i paid to return it!  plus they say that they will reduce the refund if the item has been tried on... of course i tried it on!!    customer service chat is ridiculous and saying \"sorry\" but not really helping - just frustrating!   and to top it off, the same horrible dress i bought is now selling at 1/2 price on their site.  that is really rubbing salt into the wounds!  Avoid and buy the same dress from a UK site and save yourself the heartache and disappointment - and probably some money, too!", "rating": 1}, {"title": "Still waiting on my money back....", "text": "Still waiting on my money back....They keep asking the same questions in about 10 + emails!!Judy just doesn't get it.Please do your research before ordering from this company. I just want my money back, they received the suit I ordered and said a store credit was issued.  Went back in to login so I could see the credit and they blocked me.Not a happy camper to say the least!!!", "rating": 1}, {"title": "You Have Been WARNED...", "text": "This company is a scam. If you try to return something they will tell you they received it back “soiled” in order to avoid giving you your money. You will never get a refund so don’t waste your time and hard earned money on this company. I paid for expedited service and that was an utter waste of money. They sent me a Fed Ex tracking number saying the shipping label was MADE but it never actually SHIPPED. I used the online chat where they kept telling me to be patient and wait then kept saying “have a nice day” as to try and end the conversation. It was the most frustrating experience I’ve ever had with a company. And guess what?  There’s nothing you can do about it either. You have been warned. And looking at these 5-star ratings makes me want to laugh because no one would seek out this site to write a good review. They are obviously written by the company. Especially since they are so short and all refer to “Demi’s” wonderful service. Ha!  You’ve got to be kidding. If you look at the “reviews” on their site, they are ALL positive. I tried to leave a review but it has to be “approved” first. So you have the assurance that they post nothing but the good reviews. So mad I can’t see straight.", "rating": 1}, {"title": "Terrible customer service.......getting…", "text": "Terrible customer service.......getting to ship something back is like a trail of time consuming steps, product is poor quality, not as shown on site.  Then you try to get on their site and it says \"The service is busy. Please try again later.\"  After 3 hours of trying to send them my return tracking number, (as they demand) I am irritated and will NEVER SHOP HERE AGAIN.  BESIDES THEY DO NOT SPEAK OR SPELL ENGLISH!", "rating": 1}, {"title": "Don't waste your money!", "text": "I wish I had checked the reviews before ordering as I feel I have wasted a lot of money! Both tops were supposed to be a medium, one was tiny the other huge! The material used was of very poor quality and looked nothing like the image advertised. However, I thought refunds would be easy.... I was very wrong. It has cost me £15.80 to return both tops as the tracking was required, this makes my total over £67. The comment received suggested the refund/exchange will depend on them receiving the order and the condition it is in upon arrival..... Just as well I have taken a lot of pics before I sent it off then! I'm am almost sure I will have lost my money and will get nowhere with my refund... But while I wait on the outcome I want to make sure no one else falls victim to this con! I will be sure to come back and update my review.... And you never know maybe I will be pleasantly surprised and have to give more stars based on their customer service.....", "rating": 1}, {"title": "Very low quality and too small", "text": "Very low quality and the top doesn't look as good as the picture.  The sizing is way too small and so I can't wear it.  It costs more than the item to return.  Waste of money and time!", "rating": 1}, {"title": "Do NOT Buy", "text": "Do NOT. Buy from this company. The goods are awful. They offer a refund but you have to return by recorded mail to USA costing more than the goods purchased they offer a partial refund the most you can get back is £1.  Disgusting", "rating": 1}, {"title": "AVOID.  BAD QUALITY, BAD SERVICE, BAD COMPANY", "text": "If I could give zero stars I would.  They do not even deserve 1 star. This company are impossible.  My items arrived.  And was I disappointed?  They look nothing like the photo's, so straight away they are falsely advertising. They were the most disgusting material.  Really uncomfortable.  The sizing is all wrong.  A potato sack would hang better.  I ordered according to their sizing and they are clearly not that size.  The material is scratchy and stiff, and they hang horribly.  They are not fit for purpose.  I want to return them but they are refusing to cover the cost of the shipping to the USA even though they came from China.  The tops are clearly faulty.  I am now getting involved with trading standards as according to them they have misled me into buying their products with misleading descriptions and photos.", "rating": 1}, {"title": "RED FLAGS!!   BEWARE!!!", "text": "DO NOT BUY FROM THIS COMPANY! DO NOT BUY FROM THIS COMPANY!!  I ordered 3 blouses which arrived several weeks late.  They did not fit. I tried to contact them for return authorization. Took several attempts and their \"customer service\" is very poor and does not answer the questions I have.  They offered me 30% of the cost for me to keep them.  No, I said, I want a full refund as I do not like the quality and they do not fit.  They were never worn.  I wanted to return them for a full refund. They said once they received them they would immediately issue a refund. So they gave me a return authorization number and received the items back, but gave me a 0.00 refund.    Well it's been 2 weeks & still no refund. Now they said they were \"happy to give me a store credit\" on their website.  Now I have to file a dispute with my credit card company, and I am going to report them to the BBB.  Rotita has VERY poor service, poor quality product and extremely difficult to work with.  I will caution others NOT to order from them.  They are not reputable.", "rating": 1}, {"title": "This company is a scam", "text": "This company is a scam. I ordered several tops in July. Since it was late October and I received nothing I sent several emails to them trying to cancel my order and asking them to refund the $261 that they charged my credit card. Only after I disputed the charge with my credit card company did they contact me and tell me that one of the blouses was being prepared for shipment. I then sent several emails back stating that I wished to cancel my order and they were not authorized to ship anything to me. I once again asked for a full refund. A week later I received a top in the mail from them that looked nothing like what I ordered. The quality was very poor and much worse than anything that would be found at Walmart.", "rating": 1}, {"title": "Beware of dealing with this company", "text": "Beware of dealing with this company.   I waited 3 weeks for an item to arrive.  When it did, I tried it on for a couple of seconds and put it back in the box.  It was a bathing suit and the shield was still on it.   It was cheaply made and ill-fitting.   I received this message when I returned it:   \"Mon, Oct 28, 2019 10:45 pmRotita.com To:you DetailsDear Diane,sorry, i just got informed that the returned clothes are not in good condition, some are used ,damaged or stained.  did you wear it or wash it? if the message i received about  the condition on the returned parcel were wrong, please tell me the real situation. and please do not worry, if the clothes are never wore , i surely will give you full refund. Your ticket  has been replied by our customer service. The communication records have been listed below:Rotita.com,Tuesday, 29 October 2019 at 04:20:33 AMWe have received your returned package, but we are so sorry to tell you that your returned package can’t be refunded in full as the following reasons:Return Items:190301650-0-2X .1. The items are defective.2. The items have been stained.3. The items are not same as you choose when you return the order.4. The items have been used.5.The item(s) is missing.If there is still any inquiry, please feel free to reply and I will be always here to help.\"NONE OF THESE THINGS ARE TRUE.", "rating": 1}, {"title": "SCAMMERS..SO BEWARE", "text": "I ordered 3 blouses for my partner, its now 36 days and their promises are empty. DO NOT BUY FROM THIS COMPANY or any others on facebook as they all are the same mob of bad apples and distributing out of the same factory. DO NOT GET SCAMMED...They got $156.00 Aus out of me and I have nothing...…..Chinese CRAP>>>>", "rating": 1}, {"title": "DO NOT BUY FROM THIS COMPANY!", "text": "DO NOT BUY FROM THIS COMPANY!! Sent me 3 blouses of bad quality, I tried to contact them for return authorization.  Their tel number does not work. I next contacted them on their \"customer service\" website... IT WAS BROKEN, WOULD NOT WORK. I finally filed a claim w/ PayPal, rotida emailed me, offered me a partial 50% refund and I keep the blouses. I said NO, I want to return them. So they gave me a return authorization number and I PAID to return them. They said once they received them they would immediately issue a refund. Well it's been 3 weeks & still no refund. I contacted Paypal again, and they said rotida has offered a partial refund again. WHY WOULD I ACCEPT A PARTIAL REFUND AND THEY HAVE THE BLOUSES?? Hassle hassle hassle. They are a VERY poor service, poor quality company, don't buy from them unless you like trouble.", "rating": 1}, {"title": "What a scam", "text": "What a scam!  I have no idea how there would be any positive reviews. Apparently they didn't need to contact customer service or return an item. I received my item late from Vietnam, poorly packaged and no receipt or any paperwork. Went online to contact them to no avail! How disgusting. Many other people have reported same experience.", "rating": 1}, {"title": "Love my dress it's exactly as…", "text": "Love my dress it's exactly as advertised and only took just over a week to arrive in new Zealand  will definitely be ordering more dresses.  Very happy", "rating": 1}, {"title": "Wish I could give zero starsDO NOT FALL FOR THIS SCAM", "text": "Wish I could give zero stars. Bought 3 shirts all same size, just like the Three Bears, one too big, one too small and one did fit. All three were of poor quality materials. I returned 2 at my cost only to be told sorry to a refund. They stated that the shirts were stained and worn. These were only tried on and put directly back into the bag.  The pictures of their clothing  are very appealing, however the quality of the garments and the company itself is horrible. DONOT PURCHASE FROM ROTITA!!!!!", "rating": 1}, {"title": "Customer service lies and deceptions", "text": "Rotita insisted on having phone numbers for an order.  I gave them mine. Within 12 hours, my spam calls tripled.  They were all from Chinese \"boiler rooms.\"  I went immediately to their site and put in an order cancelation. FIFTEEN DAYS later, they sent the shirts.  This is documented in my customer service record. They also told the bank that they didn't receive the cancelation.  (Then, Chase lost the documentation I sent them about the dispute.)  I've spent almost an hour fighting for $82 back.  I am prepared to ship their crap back but will not pay postage for it.Do not buy from them. I've urged PayPal and Visa not to serve them anymore.", "rating": 1}, {"title": "If I could give 0 stars I would !", "text": "If I could give 0 stars I would !I made a purchase (9-22) for my wife and daughter almost 5 weeks ago. I know they said it could take 2-3 weeks so I ordered far early (5 weeks in advance) to have the items for a Halloween party (in 2 days now)..So on the 10th I inquired about the items. I was told they will be here the 15th. I wait and nothing. The 17th I'm told delivered already. I said no they weren't. Then they will be here in 4 days. When I questioned about you said delivered and now 4 days what's going on ? They disconnected me.Now on the 22nd they say delivered and I said it wasn't. They supply a tracking link in Chinese .. useless.Then they say it was out of stock and I'll be reimbursed in a week or so. I told them it wasn't out of stock a month ago. After questioning them they disconnect me .. again.I went to PayPal and filed a dispute. They respond that give it a few days please. I request a tracking # and they finally supply it and it hasn't left China yet. I demand my money back through PayPal because now I can't use the items .. the party in 2 days .. and I'm sick of their lies.Their reply :  I have checked your order.Your order is passing customs and then shipped to your country.It will take some time . After that, it will continue to be shipped.I have urged the express company to expedite shipment. Please be patient for a few days. Thank you for your patience and understanding.  Best Wishes!They are refusing to refund me with this reply. Then when I finally get it they will say ship it back. Then they will make an excuse and only refund 1/2 back and after 2 months or so. I've just read the reviews which I should have prior.And to all the positive reviews you're Trolls for Rotita !!Do Not Buy from Rotita or China ! If you do you were warned !!Do Not Believe these trolls. Check with the BBB !!", "rating": 1}, {"title": "Package was sent 10/19/19 and arrived…", "text": "Package was sent 10/19/19 and arrived at Facility 10/21/19 awaiting pick up.Why has this return not be picked up yet?  Still waiting for money to be returned!!!!!!", "rating": 1}, {"title": "Buyer beware is correct", "text": "Buyer beware is correct.  I ordered and paid for 3 blouses.  I received 2 blouses and a 2 piece bathing suit......I am well over 60 and will never wear that!  I have phoned and emailed over and over explaining this situation and they argue with me.  I have communicated with them at least 15 times.The clothes are cheap, not well made and do not match descriptions.It's a scam.........DO NOT BUY FROM THIS COMPANY", "rating": 1}, {"title": "Buyer Beware !!", "text": "I was seduced by the colourful garments on Rotitas website and it cost me big style !!! Two garments arrived separately which I kept even though the material was poor quality in proportion to the prices. But a third parcel - all came from China with token low values on the customs labels - arrived the shape of a football. Three garments were literally scrunched up and rammed into a small bag. They were so badly creased I almost didn’t even try on. Two of the three were very poor material, clingy and scratchy. The third had a faulty jammed zip. After a pantomime of attempting to return I finally received authority but to return to NEW JERSEY in USA at MY expense ??? On a chat line I was told I wouldn’t get a refund if I sent to a UK address that was displayed on the parcel label and they didn’t even bother to engage over the faulty item. They didn’t want to know!! The customer service was appalling and as shoddy as their “fashions”. As I had spent a lot of money I had to bite the bullet and return the three items. It cost me £17 postage. If I had tracked like Rotita Customer Services had insisted it would have cost me £27. I have eventually received a refund with NO contribution to the postage despite one item being faulty. I would urge the public to beware this company. Not only are the garments distributed directly to the UK customer by seemingly different Asian manufacturers but Rotita appears to simply be a middleman taking in all the money but shirking any after-sale responsibilities. I would never EVER have bought anything that meant a return would cost upto £27 !! I still cannot find that in the small print.", "rating": 1}, {"title": "No top no refund", "text": "Hi all 23rd of September I was told my top was dispatched well today 22nd of October 2 weeks after arrival date still has not come  now I’ve requested a refund was told sorry it’s dispatched well I’ve no top and they have my money do not but from these there a con", "rating": 1}, {"title": "Item was wrong size,never measured same…", "text": "Item was wrong size,never measured same as it said,little stones on collar were glues on,on opening the dress the fumes of glue were so bad.£9.10 to return this item and they don't refund you cost.", "rating": 1}, {"title": "Just a fraud don’t order from them.", "text": "This is a scam I ordered two dresses on9/30/19. It took 19 days for the shipment to deliver. The quality of the fabric is the worst and horrible. They look like cheap Halloween customes . The dresses don’t look a bit like they look in pictures. Please don’t buy from this company is just a scam.", "rating": 1}, {"title": "It takes forever to get the shipment", "text": "It takes forever to get the shipment.  I order months ago for a Halloween top and still have not received it as of now 10/16. I’m wondering if I will get it. Had no idea this was  anAsian company outside of the US. Buyer beware", "rating": 1}, {"title": "Finally after this company receiving…", "text": "Finally after this company receiving the dress I returned AND numerous emails as they seem to know how to avoid your messages I got PART just PART of my refund it took them over 3 weeks to do this, and I am fed up with fighting. They ripped me off the return shipping and the delivery shipping and the insurance that they charge you approx $25 in total. SO WORD OF WISDOM THINK TWICE BEFORE YOU ORDER FROM A COMPANY LIKE THIS!!!", "rating": 1}, {"title": "O my God I bout 100.00 pounds of…", "text": "O my God I bout 100.00 pounds of clothes I am so disappointed the colour is different and material is bad quietly and fitting is bad and nothing like the pictures they have put o  line if i had burned my money I would of been more happier. Please do not shop from there if you want through your money an time away .", "rating": 1}, {"title": "SCAM COMPANY", "text": "This company is horrible.   I requested a return label to return subpar items that I received.   I was sent an email that said click here to download your return label.   Every time I clicked it I was given an error message that said try again later.   This has been happening for 2 days.    I emailed the company again and they are not responding.   I am now going to get my credit card company involved as well as reporting them to the Attorney Generals Office.   What a scam.", "rating": 1}, {"title": "WARNING--DO NOT BUY FROM THIS…", "text": "WARNING--DO NOT BUY FROM THIS COMPANY--THEY ARE SCAMMERS.  THE PRODUCTS THEY SENT WERE SEWN TOGETHER BACKWARDS AND THE OTHER 2 SIZES TOO BIG. I followed their detailed return instructions to a 'T' and they acknowledged receipt and in good condition of both orders but only returned 1/2 of my monies saying they suddenly only got 1/2 of the return shipment.MAJOR SCAMMERS AND THIEVES, POOR PRODUCT  DO NOT BUY--TELL ALL OF YOUR FRIENDS!", "rating": 1}, {"title": "Thanks to those who wrote a review", "text": "Thanks to those who wrote a review, I think I’ll pass on ordering anything!!", "rating": 1}, {"title": "Poor company to deal with!! Scammers", "text": "I had to give 1 star to write a review.  Received my package opened and 1 item inside.  Ordered 2 swimsuits and got 1.  Dissatisfied with quality and color (faded).My package had been opened by post office and received much later and unable to return.  They have we have been notified that you received both....really. Never signed for anything...  Will never buy from them again, to me they are scammers!!  $70.00 down the drain...Caution when purchasing from them!!", "rating": 1}, {"title": "sizes run small", "text": "sizes run small, I read the reviews about sending stuff back thought forget it its not worth the hassle so in the garbage they went. the pattern I got didnt look like the one on their page.", "rating": 1}, {"title": "Do not order from this company if you…", "text": "Do not order from this company if you want my advice. 20 days ago they received a dress I returned as I HAD to pay and get a tracking number so I know when it was received. I have been waiting and back and forth messaged them and still NO REFUND. They offered me a credit that's a joke, dress was too big and poor quality looked like a sack!! So I am now out a dress and refund. Poor quality poor service and it cost me, but I am not letting this end I want my refund. Last message said sorry Lol!!!!", "rating": 1}, {"title": "VERY poor quality ,wrote a review on…", "text": "VERY poor quality ,wrote a review on their website ,it did not even appear on their reviews ,so they chose to post only good reviews to make more false ratio of satisfied customer !", "rating": 1}, {"title": "These items are shipped from China", "text": "These items are shipped from China.    I ordered two shirts and they were such poor quality that it was embarrassing.    Buttons sewn on crooked, hems not even.    I would highly caution anyone from ordering from this company", "rating": 1}, {"title": "TRASH", "text": "TRASHInferior quality material, sizes not right,  pictures of clothing very deceptive, takes about 4 weeks for delivery WASTE OF MONEY", "rating": 1}, {"title": "Absolute rubbish", "text": "Absolute rubbish, poor material, Very poorly stitched. WANT my money back.", "rating": 1}, {"title": "Terrible company and customer service", "text": "Terrible company and customer service.  I have never written a review, good or bad on any online company but this is my attempt to stop people from working with this company because of their poor service.I returned a really poor item/sweatshirt and followed the instructions which were not easy - I had to pay $8 to mail back (no free return label) and send copies of what they required, back in April 2019 and today, October 2019 i receive an email saying they received everything in good condition (6 months ago!)  But still no refund.  Their \"live chat\" doesn't even come back to you when you ask a question.  Apparently they do not give people a phone number for customer service.  I'm out the money, and the order, and have wasted too much time on this.  Don't take a chance, is my advice, even if the clothing looks tempting.  The shirt was big enough to cover a couch!  Exaggerating, but it was ridiculous, with sleeves way out of proportion, so of course I returned it!   To make this matter worse, they are posting it under the wrong name.", "rating": 1}, {"title": "Fraud", "text": "I just ordered from them on the 3d of October, I noticed the dress I bought wouldn't be here until after my brothers wedding, so within minutes of buying I cancelled. I went through PayPal from my checking account, PayPal is saying the transaction was cancelled, not true, I called my bank and found out that they took the money and hasn't refunded anything. I reported fraud on them because I did not authorize that payment.", "rating": 1}, {"title": "Returned dress 4 months ago still…", "text": "Returned dress 4 months ago still chasing a refund do not buy from this site , spoke with them 5 times promised a Refund would go through in a 3/4 days nothing still waiting for my 36.00 pound do not trust this site", "rating": 1}, {"title": "I ordered a blouse in March", "text": "I ordered a blouse in March. When it came it was cheap and didn’t fit right. I had to jump through hoops just to find the way to do a return. I did it quickly and to their ridiculous instructions so I could get my money back. This is now October and I got an email telling me they can’t do the return because the item was damaged in return.  Such a lie!  It’s probably been kicked around in a dusty wear house of theirs. Beware!  Never do business with these cheap China markets..", "rating": 1}, {"title": "I rated BAD", "text": "I rated BAD, but trust me their products and service was and is HORRIFIC.  Even though I gave them a chance, the tops received were completely awful.  Still having a problem getting in contact with anyone so items can be returned.  Ive worked too hard to spend even a cent on such poor quality.  Can't wait to get th items out of my house and on their way.  Would like to know where they got anyone to give them high ratings.  Please buy anywhere else.  If you know how to return them and get my money back, please let me know.", "rating": 1}, {"title": "Horrible experience", "text": "Horrible experience. I called after 3 weeks of not receiving. They said not available until end of November when I ordered in September. They were trying to get me to let them log onto my computer to get me a refund. I am old but not that old. Why would I let China log into my computer.  They said they canceled my order but had to do refund the way they were. I hung up. I will eat the 67.00 refund rather then have them enter my computer.", "rating": 1}, {"title": "I WAS a first time customer", "text": "I WAS a first time customer - ordered 4 dresses  - their return policy seemed very easy. I took 2 of the dresses out of their plastic sleeve and held them up in front of me looking in the mirror. I was horrified at the quality of the material - seems like 1950's lining - paper thin and horrific to the touch.... I promptly put them back in plastic bags and into the shipping envelope. I returned them two days later. I received my first email telling me that two of the dresses arrived back to them damaged and stained, so they would only offer me 40% refund - minus the minimal return fee.... I emailed back that I would only consider 100% refund since they could not be damaged. They came back the next day with \"how about 60%?\" How about my full refund ........", "rating": 1}, {"title": "Products are inferior quality.", "text": "Products are inferior quality.Would never wear them.Customer service non-existant.Tried once.....never again!!", "rating": 1}, {"title": "I purchased 3 swimsuits late early…", "text": "I purchased 3 swimsuits late early APRIL. When received, I :1. tried them on, 2. they did not fit, 3. repackaged them and sent them back within 2 days.I did not receive a refund because as they stated - in OCTOBER:1. They items are defective2. The items have been stained.3. The items are not the same as you choose when you return the item. - whatever that means.....4. The items have been used.All complete BS! I will never shop their website again. BEWARE!!", "rating": 1}, {"title": "Their Customer Service is Horrible!!!!!", "text": "Actually, if you don't have to return anything, their clothing is good.  However, if you need to return anything, you are out of luck!  I bought two beautiful blouses, one fit and the other was too tight.  They will not accept returns without a confirmation number that they must email you.  When or if they finally send it, they will give you an address, located in the US.  They send an email saying you will get a refund.  I never got a refund from them, however, American Express retrieved my money.  Once American Express contacted them, they sent me an email promising me the money was forthcoming, however it never arrived!  If you must buy anything from their website, please use your American Express card so you will not lose your money, only your time!", "rating": 1}, {"title": "Horrible customer service and liars", "text": "If I could give the website Rotita  A negative star  I would. I ordered a dress for my mother to attend an event in Las Vegas I was told that the dress would be sent priority and a delivery date would be October 1 which I work at the post office I can look things up the label was printed on the 23rd and nothing was even done until I inquired about the shipment on the 28th after waiting in waiting it shows that the label was just me that’s it they told me today that they did send it priority and that’s a lie it was sent out first class for $2.60 will not sent out it was printed out I just talk to them on chat and the lady continuously lied and then when I sent her Shot from my computer showing that it was made for first class She didn’t quit the chat on me I am highly disappointed these websites need to be shut down for people spend their hard earned  money On items and lied to about the shipment date and expected date if she would’ve acknowledge their mistake I wouldn’t even of said anything about it on the site but she wouldn’t even do that she cowardly closed out this chat", "rating": 1}, {"title": "Very disappointed", "text": "O my!  I'm looking at the reviews and I'm thinking I probably shouldn't have ordered anything. I put my order in on the 14th of September and paid for 7-10 day shipping and still haven't received anything. I'm starting to worry my dress won't be here by the 5th of October.", "rating": 1}, {"title": "fake company no Email", "text": "fake company no Email, no phone and you never get your money back and they keep saying lies 'you will receive your refund within 7 days' after waiting 60 days nothing I got.", "rating": 1}, {"title": "Very dissatisfied and Angry Customer", "text": "I ordered a swimsuit from this company not realizing that i would have to pay nearly £10 to return it to America when it was not Suitable! It clearly states free shipping in its advertisements online ! this is a very bad policy and misleading to customers ! very Angry !", "rating": 1}, {"title": "I ordered and paid for 3 blouses", "text": "I ordered and paid for 3 blouses.  It took over 2 wks to arrive but that was ok.  When the order came I got 2 blouses and a bathing suit.  I cannot find out if or when they are going to send me the blouse I have paid for.  I asked for a free shipping label for the bathing suit and can't seem to get this.  I do not want a 2 piece bathing suit but I am not paying to ship it back.........it's their mistake.Will never order from them again if this is not straightened out.", "rating": 1}, {"title": "I am sorry to even have to give this…", "text": "I am sorry to even have to give this company one star. I recently placed an order for 3 swim suits. I received them. I wanted to exchange 2 for smaller sizes. They show no record of my order. And in (online communication which is the only means), they are sending standard notes that do not acknowledge my issue. The suits look pretty BUT DO NOT ORDER through this company. Its a rip-off. I'm stuck now with 3 swim suits that do not fit. Never Again Roto-Rita!", "rating": 1}, {"title": "Poor metal", "text": "I just received two orders. Normally fit size 6 so I ordered medium but it didn't fit at all too tight. Fabric are so cheap no tags inside the shirt. Both don't looks like pictures at all. Also return policy are so poor. Shipping from  California to Washington but took more than two weeks. I gave up to return just I will donate to Goodwill. I will not buy from that company ever again.", "rating": 1}, {"title": "Should have been 0 stars", "text": "Should have been 0 stars! They took my money and claim that I wore and stained the shirts that I bought, looked at, realized they were really cheap quality, and instantly returned! This is a scam. You will get really cheap clothing, but you can't return it.", "rating": 1}]