[{"title": "Rocket mortgage did not keep their word…", "text": "Rocket mortgage did not keep their word about the Spirit airlines miles promotion , would never do business with Rocket again or recommend this company.Thats the first thing I asked the loan agent, she acknowledged my goals but they all went back on their word including Tyler the manager.", "rating": 1}, {"title": "Stay away ", "text": "Don’t switch around people’s bankers in the middle of a huge financial process! That shouldn’t even have to be said but given our experience apparently it does. Stay away from rocket mortgage it is such a mess and they do not communicate at all through the process which makes a stressful time even more stressful. Steer clear and find a local bank and go through them I guarantee it would be a smoother process. ", "rating": 1}, {"title": "Lied and messed up my escrow", "text": "I called rocket mortgage 5 days ago to notify them I no longer wish to pay my insurance through escrow, and that I'm changing my insurance company. I am paying it monthly, not yearly, and they assured me they would not disburse any money to the new insurance company.I was just notified that despite the assurance they still disbursed the money. Now my escrow is all messed up and it will be who knows how long until I see that money and and my monthly payments will probably increase.I called rocket mortgage and they were less than helpful and could not care less. They just told me that the escrow change takes 10 business days to become effective and did not address why they paid it despite my insurance company NOT setting up the account for escrow. They would do nothing to help me and wouldn't let me talk to a manager, I have to wait 24 hours for one to call me.I am beyond disappointed with his this has been handled", "rating": 1}, {"title": "I’m a 1st time buyer and I received no…", "text": "I’m a 1st time buyer and I received no kinds of perks. I got no money back and everyone I spoke to that purchased a home for the 1st time got some kind of funds back. Honestly if I could do it all over I wouldn’t have chosen this bank. And that lady Stephanie did nothing to help me with any of this. All you guys were interested in was taking my money. ", "rating": 1}, {"title": "Loan officer did not listen to my needs…", "text": "Loan officer did not listen to my needs at all . Had to send 4 emails and even a phone call and still closing papers not right 1 day before closing.", "rating": 1}, {"title": "I cannot recommend this company at all…", "text": "I cannot recommend this company at all as they have taken our 15 year mortgage and because of Huricane Harvey in 2020 when we had to apply for Loan Modification to keep our home ... turned that 15 mortgage into a 40 year Mortgage and didnt see fit to tell us that it had been modified in such outrageous terms that no one would be able to accept that  Additionally had to try to do another loan modification because of job loss then when all facets of the agreement was fullfilled on my end ... they reniged on the deal and tried to forclose on our home if I didnt make an *K payment to bring myself current.  If I could get out from under this insanity I would.  ", "rating": 1}, {"title": "I won't use Rocket again", "text": "I won't use Rocket again, They denied me a forbearance for no reason. Its says all over their website that you don't have to miss a payment to be eligible for a forbearance, yet today they told me that I had to, why wouldnt I just do a deferment then? They are different and I DONT think what they are doing with the forbearance is legal. I made a complaint to the Federal Housing Department. I wont let them do this to me, not to mention at closing they inaccurately assessed what I needed so I didnt have enough at closing so they had to basically give me money then I had to opt out of the home warranty and then had 35k in damage to the home later. Just a nightmare working with them, will go with a credit agency next time 100%", "rating": 1}, {"title": "Don’t use rocket mortgage. ", "text": "If you’re looking for clear communication and accurate estimates then do NOT go through rocket mortgage. They wait last minute for you to find out your numbers that are thousands more than they estimated. You work with many different agents that don’t communicate with each other. It was truthfully a horrible experience. ", "rating": 1}, {"title": "Worst loan experience I ever had!", "text": "Do not waste your time doing a loan with Rocket Mortgage!!! They led me to believe we were getting a loan after months of sending paper work and receiving 100 calls a day from other brokers. They made us pay $500 for an appraisal and everything for months they kept saying we need more documents to eventually just denying us for no reason! Now I’m out $500, my credit score as dropped and my phone won’t stop ringing from their solicitors. Worst experience in my life trying to get a loan! ", "rating": 1}, {"title": "Everything went wrong", "text": "Everything went wrong. Too much to explain. I spoke with Brett Fillmore several times to complain but he only knows half of what went wrong. He stopped taking my phone calls. Andrii Pyhyk flat out lied several times & then made up excuses. I've had numerous mortgages throughout my life & this was the worst ever. I will never refinance or recommend Rocket Mortgage.", "rating": 1}, {"title": "Too many moving parts", "text": "Too many moving parts. Too many departments to deal with and no ONE person to take responsibility. Also, you can't even get a question answered without giving your last 4 didgets of your SS#. The experience overall was miserable. Will not use Rocket Mortgage again. ", "rating": 1}, {"title": "I am still getting robot calls", "text": "I am still getting robot calls, about 50 per day.  Also, we still paying interest on debts that your company is slow by paying.  If the calls do not stop soon, we will seek legal counsel.", "rating": 1}, {"title": "Horrible experience.", "text": "A miserable experience.  Signed the papers on Aug 16 and was told it would take about a week to close.  Almost FOUR WEEKS later we finally closed!!  Between unresponsive and/or unknowledgeable employees to endless extra documents needed I almost had a nervous breakdown. (I needed that money within a certain time period and was assured we had plenty of time.  I guess the joke was on me.)  Never again.", "rating": 1}, {"title": "Absolutely the most unprofessional and…", "text": "Absolutely the most unprofessional and unorganized process I have ever experienced… promised and told one thing and then completely ignored.. worked with so many different people constantly… I believe manipulated and taken advantage of once we got close to closing because at that point we had invested so much not to back out.", "rating": 1}, {"title": "Escrow failures ", "text": "This is the fourth time in 10 years they've messed up the escrow increasing our payment. The first time it increased by $200 this time the fourth time it is increasing by 60 plus dollars! Do not use this company! ", "rating": 1}, {"title": "George Petersmarck ", "text": "My wife asked a question about interest rates and this guy had a meltdown and ditched us.  Prior to that, he was always very confused about our timeline and seemed nervous that we had an attorney.  Everything is documented. I'm sure if you make his job easy he's \"good enough\" to deal with, but he's mentally weak, impatient, and folds from any sort of challenge. ", "rating": 1}, {"title": "The 60 day occupancy requirement was…", "text": "The 60 day occupancy requirement was not explained to me until the last minute.  Due to this issue this loan is costing me significantly more than it would have as a primary residence. Furthermore, without any evidence I’m being asked to trust that I was provided 3/4 pt discount on my rate. I had zero input on what points I paid or what options existed. It was a “this is what it is”…. Meanwhile I was asked to provide proof beyond the normal requirement once the loan became a second home/investment property. ", "rating": 1}, {"title": "We are losing our money because of their incompetence ", "text": "This company approved my girlfriend and I for a home loan and then turned their backs on us after we paid the downpayment on the house. They later stated that we do not qualify financially after being approved. Now, we have the downpayment on the line and they won’t budge. Patrick Driscoli, the underwriter who turned us down, completely turned his back on us claiming absurd excuses to reject the loan.  They have very bad communication methods, they reword the intentions of the initial application process, and are very unprofessional. This company approved our loan, to later bring up a problem after we made the downpayment. They are showing us that they could care less that we are going to lose our money because they were incompetent with their process. ", "rating": 1}, {"title": "Awful service", "text": "Awful service! Left hand doesn’t know what the right hand is doing! Multiple people contacted me asking for documents over and over! They called me asking for immediate answers regardless of where or what you were doing! This company was working with complete CHAOS!", "rating": 1}, {"title": "So Rocket Mtg keeps Removing my review", "text": "So Rocket Mtg keeps Removing my review, as it Honeysheds light on them and Christian Hoght. We got scammed by him, and now working a part time job just to pay the difference,, run from this company ", "rating": 1}, {"title": "My morgage person ended making my…", "text": "My morgage person ended making my experience with Rocket this time a complete nightmare, for me and my family. She’s not on the top of her game, never in the know, delusional time line and she yelled at me too. I had to tell her with my realtor on the phone that she will not disrespect me ever again. She was out of sync, we had to move to the escalator team otherwise I would’ve closed when I did. She changed the closing date like 4 times, and was just not on her game. My realtor and morgage person before never had to get me involved; it was a smooth transition. Megan even told her co-worker good luck telling me that my morgage was denied; after u caught to keep her on my loan. I have the txt messages to prove it. She was so unprofessional until I needed up having an onset of symptoms of cluster headaches for about 4 days. She had my blood pressure elevated, as well and stressed my realtor and I out. Even down to the last days Megan had no clue of what was going on. The escalation team had my loan and the gave me a closing date of 10/9, then Megan picks up the phone and tells me it’s 10/11; then told my realtor it was 10/18. The attorney office questions the ability of the company because of her being so disconnected and discombobulated. She was so out of touch with me and my needs. Please listen to our calls and listen how she handled me. Then she apologized and said to me on one call that she was raised in a home where her parents talked fussed and she didn’t have the calm childhood that I had to be able to keep self control.I was raised with 14 other siblings and as you can imagine it wasn’t nothing calm about that. Actually my Dad beat my mom most of my childhood but, it taught me to want better as an adult. So, for her to make an excuse for her behavior was another triggering experience. So, again this was the worse experience I’ve had to date with Rocket and my future relationship and plans I had for my group homes is not the same as it was before this experience. Megan is a sad example of a loan personnel with 8 years of experience. It let me having to enjoy church and work because of a migraine that I had that lasted 4 days, elevated blood pressure and just sick to my stomach. I think it would be a great idea that Rocket write my morgage off, because of this terrible experience. Thank you. ", "rating": 1}, {"title": "Lied to and cheated ", "text": "I was quoted numbers then after I accepted the numbers they could not give me that rate. I accepted the numbers the same day they were quoted. I didn't get the updated numbers till the end of the process. I would have canceled the process but it was contigent on another purchase which I would have lost. I am now out 70k. I feel lied to and cheated. After that my loan officer never returned a call or email. Having gone through mortgage processes over 10 times, this was the worst experience I have ever had.", "rating": 1}, {"title": "lack of follow-up after closing regarding disbursement", "text": "after the closing no follow-up to ensure proper disbursement ", "rating": 1}, {"title": "I am an existing customer of Rocket…", "text": "I am an existing customer of Rocket Mortgage and have been for several years. Upon checking with Rocket Mortgage for additional needs, the initial offer I received to do additional business with them sounded great! Unfortunately, that's where the \"great\" part ended. Within less than week of initiating the process with them, I provided EVERYTHING that was needed to process my transaction. I then waited and waited and waited oh yeah, and waited some more, with no updates on the status of my closing. I sent emails, texts, made phone calls and yet no one at Rocket Mortgage ever knew what the actual status of my closing was.Without boring you with any additional details, I will tell you that it will absolutely be the last time I do any additional business with RM. If you want/need the process to go quickly, even if you are quick with your providing of documents needed, look elsewhere because they don't care about your wants/needs. Zero accountability, zero urgency and zero true customer service, especially for an existing long term RM customer.", "rating": 1}, {"title": "Use Local Lenders", "text": "Mass replied emails to other customersNo one knew anythingWas told the appraisal was to happen on a Saturday 2 weeks after it was due with the report coming in after closingNo new credit report pulled before closing. Pretty sure jumping over 50 points would have lowered the rateYou're not communicating with homeowners insurance companyNot everyone leaves voicemails and the system directs you to whoever it thinks you're looking for", "rating": 1}, {"title": "Poor communication", "text": "Poor communication.  Didn't run through the process, and rude people that work there. ", "rating": 1}, {"title": "Many Many Issues", "text": "Closing date promised was not available. Dual closing promised was not delivered. Spouse had to travel 11 hours round trip to make it to closing. Interest rate was awarded on 40% LTV and high credit score but Rocket still took $1100 in prepaid interest (points) to buy down the rate. The funds were available 4 1/2 days after closing. Request to increase the loan by $10,000 was ignored. LTV would have still been at 41%", "rating": 1}, {"title": "High interest rate.", "text": "High interest rate.Long closing.  Took 4 appointments to be able to close.Repeatative upload paperworks. Amrock appraisal took over 2 hundred pictures for appraisal.  Never see that before and almost felt a violation of privacy.  They said that they need pictures for appraisal.  Over 2 hundred! Closing team is unreachable.Did not give me options to allocate my funds. This is my 3rd times refinancing with rocketmorgate and will be my last.  It was not a good transaction.", "rating": 1}, {"title": "ROCKET RIP-OFF", "text": "Long story short Rocket mortgage sent my insurance payment to the wrong company and my insurance was canceled..my insurance cost was 738$ because rockets failure now they want over 2000$ also on the documents that got sent to me I could see they sent bulk check payments to the wrong company. For many other mortgages. So how many other people lost their insurance because of there incompetence. THEY SHOULD HAVE TO TAKE CARE OF THIS MESS, NOT ME. I SPENT enough time trying to figure out the mistake they made. These huge companies need to be held accountable!!! As to their response......that's pretty funny. That's what they told me a long time ago...guess what, all they have done since then is send me notifications that I need to fix my insurance before they charge me. You messed up you fix it!!", "rating": 1}, {"title": "Be honest", "text": "Be honest! Our recorded conversations will show that we repeatedly told Rocket Mortgage that we did NOT want to pay PMI. We very clearly and directly told them we would pay the 20% down to avoid paying PMI. Instead Myles chose to change it to 19%. But according to our recorded conversations that was not supposed to happen. ", "rating": 1}, {"title": "worst first time home buying process ever", "text": "every single person we talk to. It was very difficult to communicate with them and to get them to actually give us accurate answers. It was a back and forth the entire two month process. We had several times where our agents would be on leave for a week, and the agent we were left with would know nothing and would be asking us for stuff we did the first month overall it was an awful experience.", "rating": 1}, {"title": "This lender was horrible to work with…", "text": "This lender was horrible to work with when selling our home. We were working on a modification and they were NOT CLEAR that any “missed” payments (while they were setting up the trial modification period) would accrue interest until the account is brought current. We were NEVER advised of this, and have had a HELL of a time trying to get someone on the phone or to answer questions.  I do NOT recommend Rocket Mortgage! Awful service when things got difficult. They didn’t try to even work with us :( ", "rating": 1}, {"title": "Web site unclear and never updated", "text": "Web site unclear and never updated.  Switched loan officers multiple times, they did not communicate with each other. When I was having problems with a loan company I was going to pay off, I was treated like I was at fault. Costs seemed excessive. No contact on when I would receive funds, I assumed it would be at closing, not a week later.", "rating": 1}, {"title": "Lack of knowledgeable stakk", "text": "can be improved by hireing more knowledgeable staff.Rocket Rocket insisted we were part of a HOA located over a 100 miles from our house and wanted documentation about thire annual fees for an HOA that we were never part of. This resulted in a delay of processijg our loan.", "rating": 1}, {"title": "The communication is horrible", "text": "The communication is horrible! They bounce you from one person to the next constantly and don’t communicate anything that’s going on to that next person…. Paid way more then we needed to just to be able to close on time. ", "rating": 1}, {"title": "Shocking $11,585 of discount points not disclosed verbally, by loan office. ", "text": "They can decide to assure clients that their loan officers verbally disclose EVERYTHING related to the quoted interest rate. Especially that the rate will cost the receiver of the loan big bucks on discount points. That should never be hidden at any point during the process.", "rating": 1}, {"title": "The lack of customer support and…", "text": "The lack of customer support and terrible rules have resulted in me not trusting Rocket nor will I ever recommend anyone using this company.  I dealt with them on a simple matter and the lack of even basic help was astounding.  It is clear they value one thing, charging fees, ridiculous fees.   ", "rating": 1}, {"title": "My wife gets up to 50 text a day…", "text": "My wife gets up to 50 text a day sometimes 5 in two minutes. We both are getting calls and we are extremely unhappy with our loan process due to the robot calls that it has brought us. I called and complained but all they did was direct me to a \"do not call\" registry where we registered out phone numbers and emails and it only increased. We must stop our loan process with Rocket Mortgage as we find them not a loan-providing service but just a place to collect personal data and sell it.", "rating": 1}, {"title": "Everything went well until the closing…", "text": "Everything went well until the closing which in my opinion was the most important part. I was instructed to obtain balance payment letters from each loan/credit card which I forwarded to your company and one of the checks you issued was an overpayment of a thousand dollars. I attempted to resolve this over the telephone yet your company supposedly couldn’t fix your botched error. Now I have to wait for who knows how long to get my money back. I paid your company a ridiculously high fee of over $2700 and you failed miserably. I demand you refund half my $2700 fee immediately. If you don’t I’m going to file complaints with every consumer protection agency that exists regarding this matter. ", "rating": 1}, {"title": "My experience with Rocket this time…", "text": "My experience with Rocket this time around was terrible. I started with one person who had my whole loan screwed up and then supposedly he took a leave and then I got another person who was rude and condescending! Everyone told me something different and it really makes me want to switch companies once I am able to. I would never recommend Rocket anymore. ", "rating": 1}, {"title": "My wife emailed the servicing…", "text": "My wife emailed the servicing department via email. They directed her to contact Origination team and provided a phone number. I contacted the phone number and then was asked for a 10 digit extension. I was not provided this extension number and there are no options to talk to anyone directly for assistance. This is all a headache from when the team sent us checks to mail access that were already paid and closed. We expressed this to them several times but we're still told to mail the checks. This seems quite tedious and frustrating.", "rating": 1}, {"title": "They lied about changing my payment…", "text": "They lied about changing my payment date. They say to wait after closing when you can’t do anything anymore. I was very disappointed.", "rating": 1}, {"title": "Disappointed ", "text": "They messed up on our and the seller's mortgage. Then refused to answer any calls until the very last day, the day of the closure on the house!! We ended up paying more than anticipated because of their mistakes and they refused to take responsibility. We were in a hurry to close because of some other issues but if if we had time we would definitely go with another mortgage company. Do not work with them...", "rating": 1}, {"title": "You picked Amrock", "text": "You picked a bad Title Team in Amrock and your inability or unwillingness to address the issues is reflecting poorly on you. We closed 10 days ago, and our funds are STILL not even pending deposit. Amrock should have seen the issue and been proactive instead of waiting a week for me to call THEM and question the hold up. If I EVER have a loan with you again where they are involved I will find another lender", "rating": 1}, {"title": "Spam calls is unbearable…", "text": "The amount of spam calls after my credit was pulled was unbearable. I would receive approximately 100 phone calls a day a lot of them from rocket mortgage trying to “help me” get a better rate. A lot of wholesale mortgage leaders too. This persisted for about a week and after about 45 days it finally dwindled down to an acceptable level.", "rating": 1}, {"title": "Don’t ever use rocket mortgage ", "text": "My loan closed a week ago and our creditors still haven’t credited our accounts. Rocket mortgage didn’t bother to get pay off amounts on the loans so they are overpaying on all the accounts by approximately $2000.00 and we are trying to figure out how to get the money back. I am telling everybody I know about what a nightmare this has been ", "rating": 1}, {"title": "Took forever", "text": "Took forever. Had to cancel all plans that was put in place. Couldn't do anything or go another route due to credit had already took a huge hit from the their hard inquiry. Mind you I had all my paperwork completed. The only thing was the way my job prints out my check stub online when it provides the same information.(Which isn't my fault) Something needs to be done or processes need to be updated.  This whole process was very frustrating and discouraging. The lack of communication at the end was inexcusable.", "rating": 1}, {"title": "Everything was great until…", "text": "Everything was great until…We refinanced and paid off some bills. They mailed us paper checks to do so. This is so outdated and not how we pay bills. We can’t find the account numbers because we don’t do paper statements. It is creating so much more work and costing us money for stamps. No one let us know this is how it would be done, we definitely would not have gone for this. Also, they put my husband’s name on ALL the checks, including my accounts that I had before we were married. It made nothing easy for sure. So now, wrong name and no account number. ", "rating": 1}, {"title": "Dont go online and apply with this company. Waist of time.", "text": "Applied for a loan and wanted a number that I could compare to others I have received. I asked for this number on line and was told that I need to fill out the paper work before I could get a number and when I said this is the only time I was told to get a number I would have to fill out a bunch of forms. I did the credit check and filled out all I needed to get a number. He then said that I should go with them then. You just lost a $65000 heloc and possibly a full mortgage.", "rating": 1}, {"title": "Bait and SWITCH ", "text": "Refinanced a 1.4 m loan was promised that Rocket would not sell the mortgage. The MAIN reason I went with Rocket instead of my long time credit union (Rocket’s closing costs were actually higher) was the promise that why would continue their excellent customer service and would absolutely NOT sell my mortgage to someone else.. I’ve not made 3 payments yet and they sold it. This isn’t over here.. furious. ", "rating": 1}, {"title": "This process took forever!", "text": "This process took forever!!  They kept saying “this is the last thing” and then there was always one more thing they needed.  Additionally, I did not appreciate the lack of professionalism. When I would call our assigned rep her young children were constantly screaming in the background.  I am also a work from home mother, but I make sure my environment is professional for my clients, especially when we are talking about a large transaction like this.   ", "rating": 1}, {"title": "Customer service from our agent was…", "text": "Customer service from our agent was patchy and not the best. Appalling communication on all aspects and the closing was a complete disaster. Something that normally takes an hour, we had to sit for five hours because nobody did their job at your company. I had my 4 month old with us at closing and my agent also had to leave because she had to get to her children. Overall a horrible experience and extremely disappointed that this is how it went the first time buying a house.", "rating": 1}, {"title": "Ryan kish and Christine housey are both…", "text": "Ryan kish and Christine housey are both liars and gave me and my husband the run around for months.  We gave them all the documents they requested. Ryan kish obviously was not doing his job and getting them to the underwriters. The collected $500 from us and told us to fix things on a house we were in the process of getting a loan for then denied us. We spent $4,000 fixing these things and now we cannot get our money back. Do not do business with rocket mortgage. ", "rating": 1}, {"title": "This is the worst possible company to select", "text": "This is the worst possible company we could have selected.  Attempted to illegally over charge us which forced us not to be able to close on time.  We missed multiple days of work due to the error, not mention additional moving expenses.  We not appropriately compensated for this issue.  Do yourself a favor and run to a different company.  We will be refinancing to get away from this company. ", "rating": 1}, {"title": "Closing Process", "text": "During process, the loan officer never told me to disconnect auto pay on previous mortgage with Rocket.  AMRock set up remote closing that would not accept ID. Had to have a notary come an hour away to sign close. Notary waited four hours for documents. During hthis time, AMRock cancelled close twice while notary waited for documents. Called Rocket, AMRock finally sent documents to close. Later I get UPS packet with checks to debtors. All balances were wrong. Called Rocket, told this is the normal way Rocket has always done this procedure. Unfortunately, I have had two previous loans with Rocket amd NEVER had this experience. Frustrating to be callled a liar by Rocket representative. So after all this, with old loan payment taken out on close of new loan has left me with less than $200 until the first of July. Most frustrating experience with Rocket.", "rating": 1}, {"title": "Worst closing experience ever", "text": "The agent working with me either deceived me or didn't know what he was doing.  When it came time to close, he was on vacation somewhere and not available to answer my questions.  The agent that filled in for him was argumentative and delayed the closing with lots of insurance questions.", "rating": 1}, {"title": "Nightmare ", "text": "After all of our information was sent over communication was minimal. We were told no mortgage payment for two months. It was a big selling point that didn’t happen. It hurt us financially. The appraisal didn’t come in for as much as we needed it to, but I don’t blame you guys for that. It was actually one of the worst experiences I’ve ever had. I can go on and on but I am sure it’s not going to get me anywhere. I did express my feelings on my experience, and nobody even called me to try and explain ", "rating": 1}, {"title": "This isn’t the normal Rocket Mortgage…", "text": "This isn’t the normal Rocket Mortgage that I usually work with this time around people didn’t know what they were doing. I was told one thing and something else happened instead Rocket Mortgage has a lot of incompetent people working for them now.Mary ", "rating": 1}, {"title": "Just such a lousy company", "text": "Just such a lousy company. My house burned down, My insurance company(state Farm) was great! my contractor was great! My mortgage servicer (Rocket Mortgage) is terrible. They withhold a portion of the claim until you have a final Inspection, which I have had, then they drag their feet, asking for pictures of things (this is after the inspection that they set up). They do not communicate with you directly, so there is no one you can talk to directly about it. You call and talk to a CSR and they will relay to the team involved, then you will not hear back from them. They make the process take much longer than it should and leave you having to answer questions from your contractors on when they might get their payment. ", "rating": 1}, {"title": "When your lender is a predatory lender…", "text": "When your lender is a predatory lender and kept changing your interest rate and closing cost amount. And after closing on a house decide to change the loan type all together which prevented me from looking at other houses. Worst experience ", "rating": 1}, {"title": "Poor communication", "text": "Poor communication.  Was mislead about closing from the beginning.  Closing date was moved several times and closing had to be signed twice from not having correct paperwork sent. ", "rating": 1}, {"title": "The loan officer was lazy", "text": "The loan officer was lazy. Because of his carelessness my closing got delayed by one week. And, in that last week, he started asking about the same documents that i have submitted before. I wont recommend rocket mortgage to my friends. ", "rating": 1}, {"title": "You utilize a service that was suppose…", "text": "You utilize a service that was suppose to contact me about pulling some sort of supplemental credit. They never called. The title company you use issued checks that my credit union does not accept.  ", "rating": 1}, {"title": "Selected a HELOC", "text": "Selected a HELOC, went through a 2 hour process with a rep on line only to find out they can't do a HELOC in Texas, then why ask & make me going through the process? Complete waste of time. Pick a company who knows what they're doing. ", "rating": 1}, {"title": "I was allowed to close without…", "text": "I was allowed to close without significant insurance!! And now 1 1/2 months later I'm expected to pay for another policy  that I already paid for at closing cause rocket mortgage said it was good enough insurance now it's not ", "rating": 1}, {"title": "Stay away from Rocket Mortgage..", "text": "Stay away from Rocket Mortgage... the entire loan process was an absolute nightmare for me (way too many issues with every single person in charge of my loan being put through) Even after closing on my house, I'm still having issues with Rocket Mortgage due to how my personal contact/mailing address was not properly put into their computer system. I made it very clear that all of my mail needs to be sent to my P.O. Box!Not even a month after closing on my house I'm getting mail from rocket mortgage sent to my house!!! Every single person I spoke to was well informed that no mail is to be sent to my house address. I will never again consider using Rocket Mortgage. I'm actually thinking on refinancing with a local bank due to non stop issues I'm still having!", "rating": 1}, {"title": "Closing fees are high", "text": "Closing fees are high. A rep promised me a low closing amount. That didn't happen. They claimed my work discount bought down my points.  But they just compensate that from higher closing costs. The rocket rewards program was a scam as well. I dont see it on my closing documents. But they claim I'm getting it.", "rating": 1}, {"title": "Terrible ", "text": "Rocket mortgage has a reputation for not being able to close on time.  You'll get passed around to 10 different agents.  It's no wonder they can't keep anything straight.  Not only will they completely mess up closing, you won't be compensated for the trouble you face.  Do yourself a favor and find a real mortgage company to work with ", "rating": 1}, {"title": "Poor customer serve", "text": "Repeatedly lied too and staff either not trained or incompetent asked the same questions repeatedly so apparently they don't take notes  they failed to order the appraisal in a timely manner so I was unable to use my VA loan.  Late closing due to their incompetence.", "rating": 1}, {"title": "Renee has given the run around several…", "text": "Renee has given the run around several times, after she said. I went by what she said, just to be lie to. I wish I went with the first company instead of this, I even ask for another specialist which I didn’t get. You may have better experience as long you don’t work with Rene!", "rating": 1}, {"title": "Lack of Communication", "text": "Initially the experience was great, I worked with Andrue Harless and he was seemingly great. Unfortunately communication with him and his team was not great and was sparse due to different time zones as well as having weird work hours.    I was using this refinance to pay down some debt as well as possibly get some extra cash for savings. I was initially promised that, but at some point the deal changed and I was not told of the change.   I will say that I did not do my due diligence when reading through the final papers, some spaces that should have been checked no longer were and I wasn't able to pay everything I wanted to because of that. Had I been told that things wouldn't be able to go as originally planned, I would have pulled out, (again I do take responsibility for not reading more carefully.). Sadly Andrue and his team dropped the ball when keeping me in the loop, calls were few and far between and in the end when Andrue promised to see if he could do something, he never once gave me a call back. I wouldn't recommend working with this company, least of all if you get Andrue to help you. ", "rating": 1}, {"title": "underwriting process", "text": "The underwriting process was horrible and it made us feel like there was some racism going on. We provided all the necessary documentation but you all continued to push at whether my income was valid and it almost seemed like you were trying to find a reason to deny us the mortgage. We will not work with rocket mortgage again! ", "rating": 1}, {"title": "Aggressively marketing campings = they…", "text": "Aggressively marketing campings = they rely on that to sustain their business because their customers don’t refer other customers. Know why? Because they are terrible. Just bad service overall. Coming from a Rocket mortgage customer. Never again. ", "rating": 1}, {"title": "Things up until after the closing went…", "text": "Things up until after the closing went very well. We closed on July 2 and we are still waiting  for our money. It was supposed to be deposited on the 8th. We even have our automatic payment to you set up to take place August 1. This is very frustrating. We have  contacted you and wherever the money was coming from. We closed 2 weeks ago tomorrow!", "rating": 1}, {"title": "Avoid Rocket Mortgage and save your sanity", "text": "I would leave less but couldn’t.  We closed on the sale of our house over 5 weeks ago.  Rocket said they sent a check for the escrow.  We never received it.  So they stopped payment and issued another check.  We received it last Friday.  We deposited it on Monday.  I had called and written multiple times to make sure the check coming was in fact, a good check.  They said the check just issued with the September date was good.  Well, lo and behold I received a call from my bank today.  The check came back from good ole rocket mortgage as a Stop payment.  And my bank charged us $20 for the opportunity to cash a bad check sent from rocket mortgage.  And of course, not a single. A agent was available when I called.   Nor a single manager returned my call AND they are still holding our over $1,600 check hostage and who knows when we will get our escrow money.  This is our money, not a rocket mortgage company refund but our money set aside to pay our taxes and insurance.  We want our money.  Stay away from these people.", "rating": 1}, {"title": "Too many cooks in the kitchen....", "text": "There were way too many people handling the account, which allowed for no personalized service.  I had one of your bankers argue with me about how much my loan was and what documents were missing - until he figured out that I was a \"different Tracy\" then the loan he was looking at.  ", "rating": 1}, {"title": "Delay after delay after delay", "text": "Delay after delay after delay. 4 or 5 different points of contact, and none of them seemed competent. Our original loan person included a “non subject property “ in the loan and it messed everything up- no matter how many times we tried to explain. For the amount we paid for that loan we should have gotten far better service. I will likely not use Rocket again. ", "rating": 1}, {"title": "Refinance was far from smooth. ", "text": "Online forms were great. Attention to detail was poor. What was communicated originally did not match the rates, fees and amount financed as expected but only realized it after we gave the good faith deposit. ", "rating": 1}, {"title": "I have not received a check for the…", "text": "I was supposed to receive a check from Rocket Mortgage 5 days ago, but I still have not received it, and they claim to not know why the check has not arrived. They were not apologetic at all and are offering no solutions. Why is it that I get penalized if I am late on payments, but they won’t even send me the check in the first place? Anyone who is considering Rocket Mortgage should NOT work with them and consider other companies. They are extremely unprofessional.", "rating": 1}, {"title": "Extremely unprofessional experience", "text": "Extremely unprofessional experience. Was skeptical from the beginning because of how persistent the Mortage lender was to get us to commit “that day”. After a few months of discussing with them, eventually agreed on a refinancing interest rate for it to later be changed without our knowledge or permission to benefit them financially. Tried to withdraw our application because we were unsatisfied with the lack of knowledge and honesty and they said we could not get our deposit back. We sent it to the executive level where they told us they would review our phone calls to see if we could get a refund to later tell us we were not eligible. When we asked if we could get the records and specifics of where “we weren’t eligible” they said that was not information that could not be shared. Extremely money hunter individuals who don’t care about how they affect the financial status of their consumers. Do not recommend. ", "rating": 1}, {"title": "Use the Online Tools", "text": "The largest issue was having to constantly get on the phone for Rocket Mortgage to read me my to-do list, especially when there isn't anything to-do right now. I've done 4 home purchases and 2 refinance through Rocket Mortgage but will go somewhere else next time.", "rating": 1}, {"title": "Rocket Mortgage ", "text": "Rocket Mortgage Poor communication Un-educated sales team on setting up a loan and setting up an escrow account and setting expectations.Alot of extra constant reminders to my Banker Ryan Dowell and Francheskca yet they still screwed the accounts up and still having issues to date.Both the above mentioned would lie through their teeth and say whatever they have to get you to sign the papers even though the account set up/ escrow account was not set up correctlyMy lawyer and I held up the closing to make sure everything was correct. More lying to place on rocket mortgage part saying everything would be taken care of and adjusted for my first payment, starting August 1st and to just sign the paperwork.That was a lie. Still having issuesAndrew Carter is a triple crown joke giving a determination 7/10/24 of the issue without reviewing the supporting documentation sent by my lawyer 7/11/24. Not adding up, usually where there is smoke there is a fire. Run away if you ever think about using rocket mortgage as a lender Would never recommend rocket mortgage ", "rating": 1}, {"title": "Nothing went well. Total disaster. ", "text": "Fees were too high. Underwriting took longer than promised. Was supposed to close with mobile notary. Had to take a day off from work with no notice as the notary was never set up. Appraisal came in low. No real help was offered. Closing was put off until the end of the month for no reason. Builder was furious. ", "rating": 1}, {"title": "This was just a bad experience from the…", "text": "This was just a bad experience from the beginning.  My \"banker\" was obviously new in his job. He gave me false information and failed to respond to my calls or emails.  I explained multiple times that the balances that were to be paid were incorrect.  Nothing was changed. They sent me checks for accounts that had a ZERO BALANCE! I was told as soon as I closed, the money would be wired to my account.  Again, false information. Rocket needs to properly train these \"bankers\" or go out of business!", "rating": 1}, {"title": "Do NOT proceed with Rocket!!!!", "text": "You guys really need to streamline your process. I own my home outright, it should NOT have taken over 2 months to get a loan closed. You took over 7 weeks to verify OVERTIME? (Totally unnecessary, as this WASN’T our first loan and we know how things work). When our tax returns showed my husband’s earning history??? Based on his current check stubs, he’s on pace to make over $300k. Worst mortgage experience EVER. The ONLY good things I can say about your company are 2 names-Pat Kilrain and Agnese. ", "rating": 1}, {"title": "My husband was diagnosed with terminal…", "text": "My husband was diagnosed with terminal brain cancer in September, and we have never missed a payment , I even sent in double payments to make sure they were paid. May we not afford to make it on time due to a down time between short-term and long-term disability where you're not paid for a month and a half. So I asked for any help with this situation for only two weeks actuay , the first representative told me he had to have our payment there is no help  I asked about why I saw online and the rep laughed , spoke with the executive office and same thing no help and it was the same thing.  I am so disappointed in humanity 😞 ", "rating": 1}, {"title": "Terrible Customer Service", "text": "Communication with our point person Ryan Bowren almost completely stopped after we agreed to the loan.  This was very upsetting as we had questions and concerns and could not get those addressed", "rating": 1}, {"title": "Unacceptable ", "text": "I appreciate the kindness Candice and Ray Dean have shown me.  He was very helpful during our interaction. However, I find it utterly distasteful and disrespectful for a company to allow such an event to occur. Having made a complaint against an employee in a very respectful manner, and into intern have the same employee contact me after the Complaint was made so hurtful. This has truly been one of the worst customer service experiences I have ever had and I am deeply Offended. Though it may not matter to your company, I will never use Rocket Mortgage again and to anyone who will listen I will tell them never to use this company. I will be refinancing with someone else once mortgage rates go down. ", "rating": 1}, {"title": "Please I have paid for an appraisal and…", "text": "Please I have paid for an appraisal and I would like a hard copy of my appraisal, I only use an iPhone and it makes it difficult to read. I requested this appraisal at least 5 times. Thank you,  Kathy Feeney,305 River Rd, Hollis Center, ME 04042", "rating": 1}, {"title": "I feel scammed by them", "text": "I feel scammed by them. They advertise that you put 1% down and they put 2%. The home I purchased was $126,000. I used a down payment assistance program that gave me $13,999, but I still needed to come out of pocket almost $5,000 and guess how much Rocket mortgage gave: NOTHING! Not a single dollar. When I asked why, they gave me a bunch of bs about why they were giving me nothing but it was literally while looking at my final closing disclosure that I seen that and my closing date was just a couple days away so I didn’t want to start all over with another company so I just took the loss. Oh and with the $13,999 from the dpa program and my almost $5,000 that I paid out of pocket, somehow my down payment for the house only shows a little over $7,000! Hopefully my review saves someone from going through what I went through. ", "rating": 1}, {"title": "No Integrity ", "text": "Before anything paperwork was signed I informed your company I only had $10,000 for a down payment and for closing. Numbers kept changing, we made a deal on how much down at closing and they kept changing the numbers. Even one day before closing the numbers changed again. No honesty. I was then forced double out of pocket just to get the house we wanted. ", "rating": 1}, {"title": "Absolutely awful experience ", "text": "We chose to use you again because of a good experience we had with refinancing a home. This experience was a complete 180, absolutely awful. Your team did nothing but provide conflicting instructions and made every step harder than it needed to be. ", "rating": 1}, {"title": "Very stressful and frustrating experience ", "text": "The people I dealt with were great.  Underwriting is an absolute mess!  Their requests for required repairs were very vague.  One of my reasons for borrowing the money was to make repairs and updates to the house.  I ended up spending over $30,000 out of pocket in order to get to closing.  It took 90 days to close the loan.  My loan to value on the deal was less than 50%.  This should have been a no brainer, but I got jerked around for 3 months.  This was a very stressful and frustrating experience and I hope to never repeat it.", "rating": 1}, {"title": "The Rocket Mortgage team dropped the…", "text": "The Rocket Mortgage team dropped the ball and failed to deliver on providing a \"great customer experience\" on the road to home ownership. The loan officer, loan processor, and upper-level management team all held back information that created great levels of stress for us every step of the way. As a result of their inept handling of our mortgage loan and poor functioning dashboard, we did not close on time. They seemed to be unaware or uncaring about the fact that their processes led to delays, rescheduling challenges and countless phone calls among all the individuals involved in the closing. I would not even recommend them to an enemy and plan to report them to the Better Business Bureau. ", "rating": 1}, {"title": "The mortgage process was very confusing…", "text": "The mortgage process was very confusing and redundant. The rocket app was late in updating and usually in conflict with my process advisor. I often had to send in same info more than once. The directions for how and what to send if also changed. The process was longer and more stressful than it needed to be. I was confident I had the funds and the documentation to secure the loan but I did not have confidence that Rocket Mortgage would understand or process the information correctly or timely. When I did not understand why some info was being requested the process adviser asked if this was my first home purchase when in fact it was my fifth. Not a good experience will not recommend Rocket Mortgage to others. My real estate agent said he had heard negative experiences with Rocket.", "rating": 1}, {"title": "Took a lot longer than we were advised", "text": "Took a lot longer than we were advised, did not get checkes at close like we were advised.  When you would email would not get an accurate answer.  Got multiple calls about the same thing because no one would notate the system. ", "rating": 1}, {"title": "Lack of knowledge about VA mortgage…", "text": "Lack of knowledge about VA mortgage requirements and the CAIRNS system, I spoke with the VA about the information Rocket Mortgage was telling me and they were wrong…referred me to google in an attempt to prove their point.  I spoke to the VA…", "rating": 1}, {"title": "An important document was missed at…", "text": "An important document was missed at closing so now I'm told that it's on me to hire a lawyer and finish the process myself. Rocket mortgage says I'm sorry but they refuse to help. ", "rating": 1}, {"title": "I let them know in May my husband has…", "text": "I let them know in May my husband has brain cancer and asked if they had an options for. First rep laughed when I told him about my husband the 2sd said im sorry but would you like tk make a payment . I applied for a hardship that's in limbo. This is a horrible company. Now I'm getting letters and phone calls rocket mortgage can help so I call bit it's the same thing if you don't have your payment we can't help you. This is the only company thay has shown no empathy.  I'm not asking to not pay my bill but try and work with us as much as they can and apparently they can offer no help. I also left a review on yelp", "rating": 1}, {"title": "the service is poor and not worth the…", "text": "the service is poor and not worth the time. agents are not helpful or insightful. rude and condescending. better to go to your bank--they offer nothing your bank does not..", "rating": 1}, {"title": "Can't process my autopay without…", "text": "Can't process my autopay without getting an oops something went wrong on our side, so fix it, will try again Wednesday. ", "rating": 1}, {"title": "My loan number 3544216943", "text": "My loan number 3544216943.  My loan closed on 5/13/24.  My disbursement checks were supposed to be sent out on 5/17/24.  As of 5/23/24 3:30 PM PST, disbursement checks have not left the AMROCK office.  I am paying interest on the loan that I did not even receive after 10 days of closing.  Very frustrating.  ", "rating": 1}, {"title": "Mislead from the beginning about my…", "text": "Mislead from the beginning about my closing rate. My loan changed four times on me,two of which were done after i paid for my appraisal. Would/should of went with a local lender that I can actually meet in person. ", "rating": 1}, {"title": "The process was frustrating ", "text": "Out of the gate our rep was great. He was efficient and kept us in the loop. After he got all the info the communication was not good at all. No updates. No returned messages or calls. Things didn’t get better until we asked for someone else to step in. After that it was better. We are sorry to say that our experience was frustrating. ", "rating": 1}, {"title": "Will not recommend to others.", "text": "My first payment was a month sooner than I was told it would be, and my closing costs were $1200 more than I was told they would be.  When asked my loan officer said \"Sorry, I guess I was wrong about that, nothing I can do.\"", "rating": 1}, {"title": "Instead of Rocket Mortgage paying our…", "text": "Instead of Rocket Mortgage paying our creditors they send us checks for each creditor which we mailed out the same day as we received them. It cost us $100.00 to mail our bills (checks out from Rocket Mortgage) so we would have tracking numbers & information. We got them on Wednesday morning we sent them out Wednesday at 1:00pm and they still haven’t received them so some are now past due. I guess even though it’s our money from our house, Rocket Mortgage don’t trust us to pay our bills, if we had received a check from Rocket Mortgage everything & all our bills would’ve already been taken care of through our on line accounts but since it was done Rocket Mortgage way we are still waiting. We were lied too about when we would receive the checks at closing it took 6 days to get them. So I give you no stars. And the closing man that came out was wearing sweatpants!!!! Very unprofessional!!!! That was our experience need to ask me anything else?", "rating": 1}, {"title": "Broker went silent after initial steps", "text": "Broker went silent after initial steps. I had to reach out to someone each step of the way, no guidance. If it wasn’t for the chat box on the website I would’ve been lost. I found out after a week of waiting there were still documents needed from me. I learned my lesson, I will be using a smaller local brokerage next time. ", "rating": 1}, {"title": "Happy", "text": "Nothing. The process was extremely easy and comfortable. I am in a wheelchair, having the lawyer come to our home to sign the forms was wonderful. Thank you.", "rating": 1}, {"title": "Out applicati9n was deleted without notice or reason", "text": "My family wanted to buy a property and we found Rocket Mortgage and figured we'd give them a go regarding financing. With 4 buyers we all submitted our sensitive documents. During this process our contact there was receptive and available. If I texted a question he would immediately call me back with an answer (even though sometimes a call was not what we wanted). After we had been unable to find a property we wanted to buy, maybe a month, I received a call from someone I didn't know but who said he worked for Rocket. I asked why our contact \"John\" didn't call us and we were told this second person was just checking in on older accounts. I appreciate sales processes and I know these folks have sales goals to make. The second guy calling seemed like a level 2 guy or something. It was a strange conversation. Today, while taking care of some personal business, I logged on to Rocket to check if there was anything there to see. OUR APPLICATION AND ALL OF OUR SENSITIVE INFORMATION IS GONE! Where is our sensitive information? Whee did our application go? Have we been dumped as clients because we took too long to find a place to buy? Why have we not hear a peep from. Them since the second person called us? Needless to say we will be seeking our an actual mortgage broker that is recommended to us by our realtor. I thought Rocket would make this process easier but they have just ghosted us because we are careful buyers. ", "rating": 1}, {"title": "Rocket Mortgage Bright Star Daniel Morales", "text": "The only bright star with Rocket was Daniel Morales, other than that the experience was terrible.  The timeframe to complete the remortgage was extremely long and filled with several computer glitches which kept delaying the closing process. ", "rating": 1}, {"title": "Horrible company to work with", "text": "Horrible company to work with. Everything that could go wrong went wrong. That asked for proof that we were self employed but would not accept a letter from my accountant stating so. Sent them a copy of our financial statement from our bank but since it was dated on the date it was made it wasn’t good enough(didn’t cover dates). Anyone who farms knows you do a financial statement once a year. Had to make up some numbers to satisfy them. Finally they asked for our insurance information which I sent to them showing that we had insurance on all of our stuff. They were still not satisfied that we were self employed so after several calls and discussions with different representatives I looked over what they said would prove you are self employed and an insurance policy was one of the things that would work (which they had for over 2 weeks already. All of this was just to co-sign a note. If it wasn’t for the assumable interest rate that was available on this loan our daughter was getting we would have told them to stick it. This is just some of the problems, there were so many more!!  ", "rating": 1}, {"title": "I’m really disappointed with Rocket", "text": "I’m really disappointed with Rocket on this second round. I have two mortgages with you and this experience was not so great. Kalvin made promises he did not keep. He was kind to my wife but quite off putting to me. In the end, I should have gone with Chase as what Kalvin stated was not accurate.  ", "rating": 1}, {"title": "My payoff were suppose to be paid off…", "text": "My payoff were suppose to be paid off on July 19, 2024 and that still hasn’t been done. Calling and trying to find out what is going on and no answer. ", "rating": 1}, {"title": "Inexperienced loan officer ", "text": "Inexperienced loan officer . Many errors within the process . Extremely poor communication . Just glad that the closing happened and I don’t have to use this company again .", "rating": 1}, {"title": "Never again", "text": "Homeowners insurance was discussed between me (buyer), insurance agent, and Rocket Mortgage. An annual amount was agreed upon (although very high $ amount) and paid by me in full for one year.  Rocket Mortgage has now come back to me stating that the homeowners insurance coverage is not enough to cover the dwelling, and needs an additional 46K in coverage ending in an additional $1,094.00 out of pocket for the additional coverage.  Very upset with Rocket Mortgage right now.  This is very unprofessional, and worst experience I have ever had from any mortgage company.", "rating": 1}, {"title": "Had a lot of conflicting information…", "text": "Had a lot of conflicting information coming from multiple sources through Rocket Mortgage.. After scheduling my closing, and then reviewing the details with my closer, Someone else completely showed up for the closing overall the experience was just so poor  I don’t think I’ll ever do business with Rocket Mortgage again", "rating": 1}, {"title": "Trying to pay these accounts off from…", "text": "Trying to pay these accounts off from the escrow checks is not possible while out of the country i asked gor help before but none of the amounts are correct", "rating": 1}, {"title": "Would not ever reccomend them", "text": "Would not ever reccomend them to anyone. No one on your \"team\" communicates. You'll have your initial person who does your pre-approval, then you'll be sent to 2 or 3 different people to \"finalize\" your loan. The entire process was terrible and I will never use them again. I was harassed by 2 people telling me I hadn't turned in X, Y, Z, even though I had already turned it in. The day before closing, I got a call saying I was not going to be able to close on my scheduled date. It turns out someone had deleted some of my funds from my report, thus making it show I was short on funds to close. I again had to provide proof of where I was not short. Items I had already sent in for proof, 2 times prior. No one communicates. No one actually know what's going on with your loan. I had to send in proofs of the same thing 3+ times, just to be told it wasn't there. Horrible experience. ", "rating": 1}, {"title": "Think twice", "text": "The people I dealt with were greatThe higher ups in the company are unorganized.  I believe you have too many Chiefs and not enough Indians.This process was so frustrating. ", "rating": 1}, {"title": "Only after I declined the expensive…", "text": "Only after I declined the expensive equity loan was I offered other products.  I'm currently closing on a Heloc which better suited my needs.", "rating": 1}, {"title": "Closing documents were incorrect at…", "text": "Closing documents were incorrect at closing. This error should have been corrected 14 days prior. All information sent by the buyer ( us ) was provided in advance to closing. Information and details for insurance companies listed incorrectly causing the amount of cash out of pocket to be misleading and inaccurate. ", "rating": 1}, {"title": "55 days of BS", "text": "It was going to be two week deal 55 days later they finished so many delays they said I could be looking at a two month grace period BS I got one not happy at all with my experience when I re do my loan I'll be shopping a round.", "rating": 1}, {"title": "Your so called experts didn't know how…", "text": "Your so called experts didn't know how Social Security funds worked and made us feel like criminals.", "rating": 1}, {"title": "Was told that there would be a 2 month…", "text": "Was told that there would be a 2 month postponement on the mortgage payment if I signed by a certain date and it shows only one delayed payment. Was told this in a text and email from Heather Myles. ", "rating": 1}, {"title": "Taxes are nearly double from their…", "text": "Taxes are nearly double from their calculations.  If I had spent the money they approved me, and I knew better not too I wouldn't be able to afford the property. ", "rating": 1}, {"title": "Good Luck with Rocket, you just might need it, Good Luck That Is!!", "text": "This process was the worst I've had to go through! Ed Kanibar was great! He was so very helpful until the end, when the rest of the team players failed him and me! The appraiser was very questionable, from the start he was telling me the housing markets upswing was coming to an end. Housing prices are over inflated! He even said, \"My home outside of Canton, Il., was worth more than they will tell me!\" Which was contradictive to what he just claimed! He failed in not process the appraisal on site the first time and had to come back. This all took unneeded extra time! Then the closing was a joke! Amerock and/or Rocket messed that up, (speak to Ed)!! But you won't and you don't care less!!", "rating": 1}, {"title": "I feel I was miss informed about the…", "text": "I feel I was miss informed about the whole process. I was called about a better rate. Then after all the hoops I had to jump through to get the refinance the rate never went down. I should have been told that I was unable to get a lower rate not just surprised about it at closing. ", "rating": 1}, {"title": "This will be my last mortgage with…", "text": "This will be my last mortgage with Rocket. The lack of urgency and failure to hold up to basic timelines was incredibly concerning. ", "rating": 1}, {"title": "In this process we had 5 issues come up…", "text": "In this process we had 5 issues come up from start to finish the last problem that arose was an issue where the contact was not drafted properly which caused a short in how much money was available for the payment of home owners insurance. After weeks of negotiations and back in forth with everyone they finally said they would pay the insurance out of the escrow account which put the escrow account in a negative balance. This is not what needed to be done but they did it anyway. What should of happened is the $3006 that was due should have been paid by rocket mortgage for not only the issues that have happened but for the constant back and forth that occurred in order to even come to a solution that was not satisfactory to me. I will be letting my friends and family know not to use this service due to the incompetence that has occurred in multiple areas. ", "rating": 1}, {"title": "Not disclosing all cost", "text": "Loan agent (Alicia Ayala)Banker was not honest upfront when we opened a loan application. We told her our situation and our source of income but she still pressured us to open an application and then said we had to pay 500.00 USD to start the process. We have just gotten a sign purchase Agreement the day before and we still have not gotten a Home Inspection. She said that she was going to do a hard Credit Pull on myself and my wife and that I will need to sign an agreement to that. In the agreement it doesn't state at all what the cost was going to be for the credit pull and she never told us on the phone. It seems she was only concerned about getting a loan in the process and not about us. 3 days later we got back the Home Inspection that cost us 300.00 USD. The Home inspection had a lot of problems and even had a large hole in the roof with rain going inside the house. We cancelled the RE Contract ASAP. We contacted the Broker and sent a copy of the cancellation to her as well. She said I will get my refund back in 10 days. After 10 days we still did not get our refund and spoke to the Supervisor and she said it was processed 3 days ago. Also she said the refund was only 300.00 and that they charged us 100.00 per person for the hard credit pull. When I heard that I hit the wall. I told the supervisor(Angela Ramos) that it is against the customer loan protection law that you can not charge a borrower without disclosing the cost so the borrower can decide if they want this done. They have committed fraud in this situation and I told the superviver I will file fraud charges with the Financial Protection Bureau (CFPB). I have been in the RE and loan business since I was 21 years old and this company is the 1st that asks for a 500.00 deposit and charges 100.00 for a hard credit pull. I would not use this company at all and there are many other companies that can provide you with much better service and good rates. ", "rating": 1}, {"title": "The process started off really good", "text": "The process started off really good. It was a actually a very easy process from start to finish. We only have two real complaints. 1) Buyer beware get everything in writing.Are representative told us they would cover the appraisal he then added it to the closing disclosure hoping we would miss it. When I question him on it he said he would talk to his manager and then ghosted me. 2) This was a consolidation I believed they would make payments to the credit cards we were paying off through the loan process. I believed this is what would happen because this is what I was told what happened. After closing for about the next week I checked with my credit card companies and the balance had not been paid. Then an overnight delivery showed up at my front doorstep. They did not pay off the credit cards through the escrow process as they said they would. Instead they printed checks gave them to me to fill in the account numbers put them in envelopes stamp and mail them out. This added almost 2 weeks of interest accruing on both the loan and the credit cards. Not sure I'll use them again.If it's not in writing it didn't happen...", "rating": 1}, {"title": "My credit dropped 31 points from time I…", "text": "My credit dropped 31 points from time I contacted you to closing. I now get at least a dozen spam events in my email. Thanks for putting my address out there.", "rating": 1}, {"title": "Initially I reached out to refinance…", "text": "Initially I reached out to refinance due to a divorce. I had to give my X 45k as part of the decree. This was the only reason I was looking at a refinance. I also had some other debt as well. I jumped through all the hoops, well water test(420.00), pest inspection(100.00), appraisal. Not to mention the three weeks I lost during the process. Only to find out the 45k was not in the appraisal. My mind was blown! Are you kidding me!!! The only reason I was refinancing and it was nowhere to be seen. Long story short your team jumped into damage control and I was able to get an equity loan for 45k. But I did lose three weeks of me being able to move back to my residence. As part of the decree my X has 30 days to vacate after she received her 45k. Just so you know I started the refinance process first week of May. So long story short, I’m disappointed that my time and money was wasted. I know you make good money on refinancing, but don’t mislead an existing customer in hopes they will still go through even if their needs weren’t meet.", "rating": 1}, {"title": "I've lost count on how many times RM…", "text": "I've lost count on how many times RM dropped the ball with my loan. It's bad enough when the escalation specialist did his review on the situation and agrees that they have dropped the ball when they withdrew an already scheduled to close loan the day of because they didn't notice an fha id number difference on the estimate inspection because I had it transfered from a previous buyer on the same year to avoid additional costs.  I ended up being homeless for a week because of this and was told to figure it out even though they were the cause of my homelessness since my house sold on the scheduled time when they decided to pull back last second....", "rating": 1}, {"title": "Triple Check everything and only deal with original support team member", "text": "The final documents were switched and was not was previously discussed several times. Which ended up in the wrong creditors being deleted for payment.", "rating": 1}, {"title": "We were told all of our bills would be…", "text": "We were told all of our bills would be paid, and then our home didn't appraise for as much. We were told all of them would be paid off except for one, which had a zero percent balance anyway, so we weren't worried about it. In the end, 3 of our credit cards with 14.99 % and above were not paid off, and my car, that I didn't even want paid off, was. It only had a 2.4% interest. Nothing could be done because the checks were already sent. I feel like this equity money was never ours, when we couldn't even decide on the bills we wanted paid off. Horrible!!! I wish we would of never done it!!!!", "rating": 1}, {"title": "I signed twice to close still haven’t…", "text": "I signed twice to close still haven’t gotten my money but have a loan payment already and being charged interest.", "rating": 1}, {"title": "Everything went well", "text": "Everything went well. Jordan the person who handled my loan was wonderful. He always returned my calls and helped me anyway he could. Every body I talked to was great. Very friendly. I would recommend you to anyone. Thanks!", "rating": 1}, {"title": "Never again", "text": "Used them several times. Last time we got screwed. Asked for a $40,000 equity loan just like the one we received 2 years prior. I had no idea the 1st $40,000 had to be paid off. That was never told to me. Yes I know I’m supposed to read every single word of the closing docs but didn’t. Now I’m paying a higher APR for the 1st $40,000 payoff.   Out of the $40,000 I expected to receive I got $18,000.  Not enough money to do what we needed the money for. Sorry, will not use them again. ", "rating": 1}, {"title": "This has been the absolutely worst…", "text": "This has been the absolutely worst experience. I closed my loan 2 WEEKS ago. Before Amrock can send my checks ROCKET ordered a RE-CLOSE for NO DAMN REASON that they can tell me. Everybody I speak to at Rocket keeps wanting to blame Amrock, Amrock says it’s Rocket’s fault (and I agree with them). Every time I speak to Rocket I’m told a lie. I’m hold right now with ROCKET trying to get scheduled for ANOTHER DAMN closing. That I’ve already done. I was told Friday that they would try and get the closing process bypassed since I’d already done it and it was cleared. But at the “very worst I could be scheduled a same-day closing, no problem” Today is Monday and I have to schedule the closing again (cmon guys!). But what’s this? I can’t get anything same-day as promised? Why am I not shocked. Guess what? Nobody gets a second mortgage for fun and I need this damn money for good reason. And ROCKET has put me out a few weeks and caused a WORLD OF PAIN for me. Not to exclude tons of STRESS and financial strain. I seriously regret going with Rocket and could never recommend you to anyone. Not once has Rocket tried to so much as take ownership or make things right for THEIR ERROR.", "rating": 1}, {"title": " Terrible Experience ", "text": "The underwriters were ignorant with regards to the specific parameters of ground rent, which is a concept that is unique to a handful of states. Due to their ignorance my final loan approval was jeopardized. I consulted with four real estate Attorneys who shared that Rocket didn’t know what they were doing and eventually I had to hire a real estate Attorney to resolve the matter and file a BBB complaint. In the midst of this my mortgage lender aka point of contact stopped communicating with me and eventually had to be replaced. I am a repeat customer and have had mortgages on 6 different occasions prior to this and this was by far the most egregious and unprofessional experience that I’ve ever had with a lender…looking forward to a decline in interest rates so that I can refinance with another company. They failed to respect and to keep my business. ", "rating": 1}, {"title": "I was told initially that it would take…", "text": "I was told initially that it would take 2-3 weeks to close and they hit the mark.  My appraisal also came in higher so I could use more equity.  Great experience all the way around.", "rating": 1}, {"title": "Checks", "text": "Still waiting on one check to be sent out by your company. This was not a good experience as far as getting my credit cards paid. The money could have been wired to me and I could have taken care of them", "rating": 1}, {"title": "don't go here", "text": "don't go here they'll run your credit like six times and they  don't do a self credit check so it ruins your credit", "rating": 1}, {"title": "There was no follow thru on promises…", "text": "There was no follow thru on promises made. Time line was not accurate. Would not recommend to other people.", "rating": 1}, {"title": "I was promised no points by Jake…", "text": "I was promised no points by Jake Lawrence. I asked regularly for the closing costs.I was told it would be sent. It wasn’t sent until the Thursday before the closing. That was the first time I saw there were 2points or 5,000.Jake gave some excuse why there were points.I called my lawyer.", "rating": 1}, {"title": "Had a question about my payoffs no one…", "text": "Had a question about my payoffs no one would message me back and let me know what happened. It was my payoff for my rocket loan not my mortgage my loan. I wanted to know when that was gonna be resolved. No one would respond.", "rating": 1}, {"title": "There’s just better options ", "text": "Lack of communication, clarity, and professionalism as to the status and where/why I was paying what I had to pay. I would not recommend Rocket morgage", "rating": 1}, {"title": "Payment lost", "text": "I was advised not to make payments on the bills that were to be paid off.  Those were due at the beginning of the month.  They are now past due with large late fees.  Since they were not paid electronically one of the checks is now lost. ", "rating": 1}, {"title": "DO NOT use Rocket Mortgage!", "text": "Rocket mortgage is a company that NOONE needs. They had our funds tied up for nearly 3 months. They will ask for paperwork that even your credit and debit companies say don't exist. By the time we did move in we were financially screwed. If you have to use rocket mortgage, take my advice, you Do not need a house bad enough to call them.you are better off sleeping on the street because by the time you are done with them you just might be. (Edit) Because Rocket mortgage just does not want to leave us alone. Because of all this me and my husband and 2 daughters were evicted from our rental home. They had 4500 dollars in our 401k money held up for almost 3 months. We kept being told closing will be this date. It changed maybe 4 or 5 times, all over LITERALLY we kept being told 1 more thing. We got the house but we are fully struggling now. Rocket really hurt us in the long run because of how they do things we could not use our money or credit cards for that long. As I said they contacted cash app 2 times directly for info THAT DONT EXIST \"simply because rocket mortgage does not accept screen shots.\" If you need rocket mortgage. A few hints, have NO DEBIT, NO CARDS, HAVE AN 800 credit score and they will still tell you ONE MORE THING. Oh and also be single no kids no partner NOTHING, or your life will be torn apart financially. The only reason they have a 1 star is because 0 stars is not an option.", "rating": 1}, {"title": "Bad from the start", "text": "This loan was bad from the start. If I didn’t provide a down I would have stop this all together but I tried to make it work. Appraisal came in not apples to apples and did not consider the many upgrades to my home I.e owned solar, pool, etc. so appraisal came in lower than projected. I believe this to be a bait and switch on interest rates. Considering my FICO SCORE IS 805! We have over 400k in equity and only asking for 85k. But we still took the loan as the time constraints we had. Then you didn’t get any payout letters and over paid my creditors by not just a little but in some cases over 1k per creditor basing it on the credit report. Not a good practice and in all the refinancing I have done over the years this is the worst. Then you mailed me not my creditors the checks so I had to over night them in order to not pay late fees or more interest on those loans. But glad you got your money! Rocket doesn’t care for their customers they only care about making money. When I called to talk about this to your team I got no customer service and brushed off saying I should have read the fine print. No where on the documents I signed said that the checks would be mailed to me for distribution. Not a good experience and will not use this company or refer any friends or family. ", "rating": 1}, {"title": "Late to close", "text": "Late to close, horrible customer service. Did not attend to phone calls or emails properly. ", "rating": 1}, {"title": "Glad I LEFT Rocket Mortgage", "text": "I recently began working with a Rocket Mortgage loan consultant. During the process, the encounters were pleasant and I felt well taken care of. When it came time to sign the mortgage agreement, I did not feel like I was given any time or consideration of reviewing the documents and pressured to sign and move on. That interaction caused me to consider another lender who actually looked through our signed documents and compare to see exactly what differed and what options we had, where as the Rocket Mortgage consultant would not actually look over the other option and just guaranteed they were better. After mentioning we would be changing lenders, Rocket offered a \"better deal\" which actually just moved numbers around on the estimate to seem better but was a worse deal in the long run. The consultant turned aggressive and made direct comments about my judgement and ability to care for my family. After multiple direct lies about company policy, timelines, and other pieces along the way, I am VERY glad I did not move forward with Rocket and I will not recommend it to anyone I know, especially the specific consultant we worked with.", "rating": 1}, {"title": "Takes to long to get a loan and…", "text": "Takes to long to get a loan and appraisal sucks I will never do business with you all again…..", "rating": 1}, {"title": "I was massively mislead on the closing…", "text": "I was massively mislead on the closing cost!!! Fee's were higher than originally told!!!", "rating": 1}, {"title": "The Rocket Mortgage title company…", "text": "The Rocket Mortgage title company Amrock is not efficient and does not communicate.  They need a portal that provides updates and allows for communication between all parties.  Because of my experience with Amrock, Rocket Mortgage receives an unsatisfactory score.  ", "rating": 1}, {"title": "I pay my credit cards every month they…", "text": "I pay my credit cards every month they were do and I paid them I had not closed the loan Now Amrock who your company uses send me checks made out to the bill I already paid I tried to deposit them bank says can’t do it I need a bill showing there paid I pay them on line I don’t have a paper to send them it’s turning into a real pain ", "rating": 1}, {"title": "To much to type ", "text": "To much to type , not doing a Survey ! If ya wanna know details have someone call", "rating": 1}, {"title": "refi bait and switch", "text": "I was not advised to skip the last mortgage payment and thus lost thousands which I expected to pocket - after a refinance. ", "rating": 1}, {"title": "Experience with Lacey Hunter ", "text": "I spoke with Lacey Hunter from Rocket  mortgage. I explained very clearly that I was a 1099 self employed. I was trying to get a home loan. My debt to income is only one truck payment of $650 a month no other debt, and over 700 credit score. I spoke with 4 other lenders that all said I need to show around $80,000 net income on my taxes to afford around $300,000 home. I make enough to do that without writing off hardly any expenses. The obvious issue is that I would have to owe the IRS around $20,000 in order to show that net income. I explained all this many times and even told Lacey many times I don’t want to file this years taxes in order to get pre approved unless I was sure  I was showing enough net income. She said that Rocket mortgage does not base a loan simply of IRS. If I put around 10 percent down with my credit and low debt to income I would be approved as long as a showed a net profit for the last 2 years. She insured me this several times. So I filed my taxes and showed a little extra income ( just in case) and Lacey is now telling me that I don’t show enough income on my taxes to afford a loan. Just like the other lenders. Now I owe the IRS more and can’t re file more income until next year. I’m screwed and it’s  exactly the concern I explained to her from the beginning.  She clearly didnt  know what she was doing and now she’s telling  me that I said a made $150,000 (which I do) but I told her if I don’t write off some I will owe a lot. Now I wasted months of time, a few thousand extra I owe the IRS,and on top of all that nonsense, 10 minutes of my life writing this review which doesn’t get me a home loan…", "rating": 1}, {"title": "TOO many people involved in the process", "text": "Date of experience: October 03, 2024", "rating": 1}, {"title": "Rocket Mortgage is a SPAM!!", "text": "Will rate it 0.I had a deeply frustrating experience with Rocket Mortgage that I feel compelled to share. Initially, I was contacted by their sales team while shopping for a 30-year conventional mortgage. However, the service I received was far from satisfactory.Despite numerous calls from their sales representatives asking for my personal information, they consistently failed to provide me with clear and honest details about the mortgage rates and options available. Each call left me more confused and frustrated, as I was unable to obtain the essential information needed to make an informed decision.Adding to my frustration, Rocket Mortgage claimed they would conduct a 'soft' credit pull to assess my eligibility. Instead, they performed two 'hard' credit pulls within the span of a month, which resulted in a significant 27-point decrease in my credit score. This impact was entirely unwarranted, as I had not even applied for a mortgage with them.To make matters worse, despite never having signed any documentation or formally applying for a mortgage with Rocket Mortgage, I received a refusal letter from them. This was baffling and frustrating, given that I had not pursued any application process with their company. Their sales representatives continued to call me even after receiving the refusal letter, leading me to block their numbers and report them as spam.In summary, my experience with Rocket Mortgage was marked by unprofessional behavior, misleading practices, and a lack of respect for my personal information. I would strongly advise against engaging with this company for mortgage services based on my experience.", "rating": 1}, {"title": "Refinance with Equity…", "text": "This Refinance with a Cash Back Equity Loan took too long and had to be carefully checked through the process as so many things went wrong with it.  We simply were not happy starting out with a Conventional Loan and wanted to stay with a VA Loan.  We finally were able to get the process turned around the way as it first should have been done.This whole process wasted a lot of time of our time.  It could have been easier with a check list applied for the documentation needs  for a smoother transition, etc.  We never knew from one day to the next what the next item needed/asked and the company broker kept us on pins and needles.  Very uncomfortable and we considered stopping the process a couple of times due to this.  Changing the Closing Date at the last minute when we prepared our errands for a trip into town did not make up feel too kindly towards the company either.  Needs some changes made.A check list is a good suggestion for all your future endeavors going forward.  Also some classes for your brokers/staff to understand what can be charged and not charged on the different loans.  We have been with Rocket Mortgage for 18 years and this time was an absolute nightmare for us.  It was not the same company in so many ways.  It was a bad experience for us and the Appraisal Amounts and items not updated regularly to keep us up to date.  Not the best way for a company to do business and cannot give it a good rating as in the past much to our sorrow.  The first Appraisal started on the Convention Appraisal Loan was done by a woman who showed up smelling like marijuana and smoke.  She stumbled around and insisted on going out to a broken down shed not used by us in the trees.  It was a strange experience for us and we suggest that you not use that company again for Appraisals.  On the second Appraisal, the VA Appraiser was just the opposite, checked out everything, took good clear pictures and wrote up an exceptional report.  Of the two Appraisals, he would be the only one allowed back to our home.", "rating": 1}, {"title": "Terrible customer service", "text": "Terrible customer service, limited choices to do with my money in loan. Would not do bus again ", "rating": 1}, {"title": "The most UNPROFESSIONAL company for…", "text": "The most UNPROFESSIONAL company for Realestate we have ever worked with! Not ever again! ", "rating": 1}, {"title": "Why hasn’t my creditor been paid off", "text": "Why hasn’t my creditor been paid off, that was apart of the loan process.", "rating": 1}, {"title": "Basically the whole experience was…", "text": "Basically the whole experience was awful. Failures all over your organization.  Too many to list here.", "rating": 1}, {"title": "Was a horrible experience", "text": "Was a horrible experience. First off the agent gave me a 5.6% interest rate but forgot lock it in so when the rate hikes went up my rates also went up and he couldn't give me an explanation.  Next, everyone knew the closing date  in advance and we had been working on it for a month.  They were not ready and we stood loosing our property. We were told by the builder since it was the end of the month that if we could not close we would have to pay a penalty of $9,900 to keep the property.  A penalty we had to pay because rocket mortgage could not make the date.  And this was with me calling them almost everyday asking them if we were on track for closing.  And yes were gonna drop them as a mortgage company but it was too late and we would not make closing by then.  The only thing good was that the lady handling our closing was honest while the loan officer kept lying to us.  They had to escalate it of executive officer of customer service.  In order to close on time they made us write a \"hardship letter\" which we needed to do or else we would stand to pay almost $10K penalty for something that wasn't our fault.  And here's the kicker, we had escrow included in the mortgage which included home insurance and windstorm.  everyone knew that because we could not close the house unless we showed proof of insurance.  I had to go through hoops to get the engineer to come to the house to inspect and register it to the state. Come to find out after closing they only included home insurance and not windstorm.  When I called them the answer was \"you should have read the contract you signed.\" At that time we were just in a hurry not close the house that day or we end up paying penalty. So I assumed they included it as we had discussed.  You should never assume anything with Rocket mortgage.  In the end I paid windstorm out of pocket $2500.  I guess its better than paying $9900.   I went with Rocket mortgage because they had good reviews and is a big company.  This was not our first experience buying a house.  In fact this will be our retirement home.  But I have never experience so many issues.  I can not in good conscience recommend this company. Instead of making it a happy occasion, it was so stressful. ", "rating": 1}, {"title": "Extremely Slow and Not Thorough", "text": "Extremely Slow and Not Thorough - My experience with RM was extremely disappointing. Most of the people I worked with was nice enough, but by the end, the only reason I had not moved on to another lending company was because I had already invested so much time and energy. I also did not want my credit pulled by another lender and I just overall lost all faith and trust in RM. I also didn't feel I would get any of my Earnest money back if I had cancelled my service with RM. My loan took nearly two months for completion. Each week, I was told that the loan should be wrapped up and ready for closing, but instead it was just one issue after another. All the issues I was told (excuses is what I actually started to believe) was that there were technical challenges, issues with appraisal (back and forth between drive-by and hard appraisal), the SSN transposed so the IRS couldn't provide the information needed, documents not properly being reviewed/audited before forwarding to the IRS, paperwork to the IRS not being completed, requests to physically print and sign documents (when they could all be done electronically) so taking the time to physically drive to a location to print and scan a single document, not being given the correct information up-front such as closing cost information, being told our credit was good enough to be approved for the amount requested, but then being told later we needed to pay down a credit card to a certain amount, and then in the end, still not getting the amount requested because the appraisal didn't come back at the amount they were initially thinking. Each time an issue came up, it would take 3 to 5 business days for that issue to get resolved. The list goes on. Working in finance and customer service, I understand the technical challenges companies can sometimes face and that sometimes you just have to be patient, but by the end, I had lost all faith, and trust in RM. I was always the one to reach out first for any updates. Communication towards the end got a little better, but I feel it was only because I had to escalate my concerns up to management and because I just became that squeaky wheel. As mentioned, most people I spoke with were nice enough, but I would absolutely not go through RM ever again, nor would I recommend RM to anyone. The stress and anxiety of not knowing what the next day was going to be like was just too much.", "rating": 1}, {"title": "go elsewhere", "text": "Took way too long to get the loan and timing was everything for my situation as I needed a new roof. ", "rating": 1}, {"title": "Worst Mortgage experience of my life", "text": "Worst Mortgage experience of my life. Need I say more.", "rating": 1}, {"title": "My Experience", "text": "If you are seeking a lot of hoops to jump through, choose Rocket Mortgage.I have used this company for servicing my home loan for five years, refinanced with them, and am in the process of taking an equity loan. The initial purchase of my home, the process took a bit over a month to get through and they required verification of every cent of my worth, but could not count money I had taken out of the bank to purchase a vehicle, which I ended up returning the same money into the bank. Due to this I needed to muster another $3,000 because that cash could not be 'verified.' I came up with the money, they re-ran their math prior to closing and told me I was $37.00 short. I said you have to be kidding me, and sent a photo of 2 $20.00 bills in my wallet (though they would be unverified). They actually managed to close even though they couldn't verify these $37.I was contacted every six months about refinancing, usually to go through the process and get credit checked and talk with them for a couple weeks, just to end up with \"Well there isn't anything better we can do for you.\" This went on for a few years. Once I was able to refinance and it went without much fuss besides reverification of all finances.In the attempt to take out equity in the home, I was told they close on the loans in 1-2 weeks. They required a home appraisal, and the soonest someone could get out was 2.5 weeks away. During this time I verified all income and taxes, and awaited the appraisal. The meeting went without a hitch, mentioning I may just have to put exterior trim back on a window that was replaced. The appraisal took ~1 week to get, and mentioned they 'Recommended' I have my woodstove inspected. Rocketmortage told me when an appraiser says 'Recommend' it means 'Requires' and told me I would have to foot the bill for the inspection of the stove (although I was charged $965 for the appraisal that \"Required\" this). The soonest someone could inspect the stove was over 1 week away. During this time I questioned the rates and charges I had noticed on the paperwork. They added \"Discount Points\" on the sale to the sum of $1237.00, and after 2 days of attempting to get an answer as to what each point was worth in its percentage reduction on the rate, I concluded it would take 40 months to recoup the cost incurred. I asked to remove the points, as rates would probably drop and I would refinance within that timeframe. I was told if I did that, it would increase my rate by another 0.75% on top of the points-worth, because that changed my DTI. In essence I was stuck with spending the money on the discount points just to lose later.After a week of waiting for the inspection of the stove, I was told I needed to move it to provide clearances to the tile. I was out of town and had a friend move and reinstall the stove to the specifications provided, and photograph the measurements. I sent the photos to the inspector, and was ignored for 2 days before being told it actually needed to be moved to different measures, although no one would be around now to move it. I would have to move it three days later when I returned. The window trim was requested just before this time, and the project was completed and photographed to detail, and proof provided to Rocketmortgage. I was told it would have to be photographed by the appraiser, and he would have to come back out to do so. This was scheduled 2.5 weeks away as the soonest it was possible. My patience ran thin, and it made no sense, as I run a construction company and this is our business. On a whim working with a great member of the company she thought we could potentially provide the underwriters with a letter stating how it was done and signed by those in the business. This was provided. Underwriters have now taken 1.5 weeks to review information, and were asked to expedite, and asked for status, and we have largely been ghosted and dragged on. Asked for status on Friday and Saturday, just to be told Monday that the letter needs another signature and date.I am not one to write reviews, ever. This I felt needed to be known that the company in question has such a lack of humanity they will do you no favors, help you zero, and it is truly about profits. If you want it to be easy, I have found this is far from it. I am currently at about 60 days waiting for this to close, and those at the top do not care one bit to move things along, regardless of your situation.I began using Rocketmortgage due to them being the most affordable at the time. From my experiences in the last five years, I will be leaving them regardless of price, they are by far one of the worst companies to do business with. There are great people working for them, and I truly hope they leave and find a place that can allow them to help people like they desire, not just to be a cog for this dispenser of plutocratic red tape. ", "rating": 1}, {"title": "Too many steps submitting same papers…", "text": "Too many steps submitting same papers over and over. Bryan was the only great one", "rating": 1}, {"title": "We had a terrible experience with this…", "text": "We had a terrible experience with this mortgage origination thought Rocket mortgage and with our loan originator, Justin. We have made a complaint with the CFPB and will with the FTC as well as the KY Secretary of State. Material facts about our loan were misrepresented by RM and Justin regarding our interest rate and overall loan, then the day before closing we were told that the 2 year interest rate buy down, that we had purchased for over 10k and that we had increased the overall loan amount in order to purchase, would actually not be materializing but the loan would still be 10k larger ( we only increased our loan amount originally on Justin’s advise in order to do the interest rate buy down) but we were told last second that we would have to accept this loan without the buy down but still do the larger loan or we would have to delay closing and risk falling out of contract. This was very deceptive and put us in a situation where we felt like we had no choice but to go through with these changed terms or risk losing out on the house. This feels like a misrepresentation of important information about our loan especially the interest rate and a recommendation to take out a larger loan against our best interest and for the benefit of RM. ", "rating": 1}, {"title": "Won't be coming back to Rocket again", "text": "This isn't the first time I have used Rocket Mtg.  The first time was years ago and it was incredibly smooth.  This time around, not so much.The process at first seemed easy this time around.  Brad seemed nice and was helpful.  Unfortunately, things changed.  We decided not to purchase our mother's home and instead do a refinance in a trust created for our mother.  We got the information and then began the process on our end and things started to get ridiculous and frustrating.From the information that they kept asking for over and over, even after things had been provided multiple times.  I had to keep calling to tell Brad to let the team know that it had been provided.  Speaking to Brad (our contact there) also became more like speaking to a used car salesman around the middle of the process too.  We had specifically told him that we weren't going to be using family equity during the process at all yet it kept being put into the mix, including when we got paperwork and requests for information about said equity.  When I spoke to him after I received the request, his response was \"Oh, I thought we were going to use it\".  It was made VERY clear that it wasn't going to be used.  They had also given us rates based on the approximate appraised value that BRAD gave us.  When the official appraisal from their service came back, it was $25K HIGHER.  We were told that we would have to pay points to keep the rate at where we were told.  When questioned, Brad told us that it basically came down to the loan to value and it needed to be another $25K higher.  When I asked why we were told a lower rate when we a) had been basing it on his estimated value and b) he KNEW the amount of the loan from the start, he said there was nothing that could be done.  Yes there was..... tell us a rate based on the information provided from the beginning.While my mother was the owner of the trust, she is on SSI and makes under $2,000 a month.  As such, we were using the trustees incomes as we are all working.  When my mother made a purchase on a store credit card for $100, they nagged us for the statement as the card had just been opened.  They saw what the amount was and, when I said it's a $300k mortgage and we aren't using her credit as backing, it still took WEEKS to get resolved when I sent them the info.  Seriously?!?!?  It isn't even a blip compared to the amount we are borrowing and our incomes outside of my mother were what was being used.  We both make very good salaries and have credit scores above 770.There were more issues but I think that the point has been made.  We will definitely NOT be coming back to Rocket for future needs.", "rating": 1}, {"title": "Very unorganized ", "text": "Very unorganized the left hand never knows what the right hand is doing they took away a state awarded grant to a first time homebuyer pushed them back to square one and required them to come up with all that money on the spot as a first time homebuyer Rocket made this a long horrible experience the day of closing none of the paperwork was ready 2/3 hours went by while waiting at the table the title company asked the buyer to reach out to Rocket just a bad experience ", "rating": 1}, {"title": "They gave me pre approval letters and…", "text": "They gave me pre approval letters and then when it came down to closing on my house they said I wasn’t approved then they said I didn’t make enough money and jacked me around for months never telling me what was going on in the end I had to put way more money down then I was supposed and had to keep explaining to them that I had the money to pay for it and they just kept throwing me for loops was very unhappy with the lady jackalyn who was not helpful and was clueless ", "rating": 1}, {"title": "Credit score dropped", "text": "Credit score dropped, bad communication and explanations.  The worst home service ever.", "rating": 1}, {"title": "It was not a good experience with me", "text": "It was not a good experience with me ", "rating": 1}, {"title": "Loan officer was awful", "text": "Loan officer was awful. Dodge most if not all my calls. ", "rating": 1}, {"title": "Did not make closing date", "text": "Did not make closing date.  Inexcusable!", "rating": 1}, {"title": "All moments of your people and…worst rocket of all", "text": "All moments of your people and techniques ", "rating": 1}, {"title": "Poor communication and Excessive fees for first time homebuyers", "text": "Poor communication.. excessive latent fees that were not disclosed to buyer ", "rating": 1}, {"title": "Closing was delayed because off staff…", "text": "Closing was delayed because off staff incompetence", "rating": 1}, {"title": "One cause negative isn't an option", "text": "Date of experience: June 03, 2024", "rating": 1}, {"title": "Your approval process was a nightmare", "text": "Date of experience: May 04, 2024", "rating": 1}, {"title": "Stay local.", "text": "Date of experience: June 21, 2024", "rating": 1}, {"title": "Please read the review I already sent", "text": "Date of experience: July 05, 2024", "rating": 1}, {"title": "They got slow at the end of the process", "text": "Date of experience: May 19, 2024", "rating": 1}, {"title": "Misleading", "text": "Misleading. High interest rates.", "rating": 1}, {"title": "these + REVIEWS ARE FAKE", "text": "Date of experience: June 19, 2024", "rating": 1}, {"title": "Customer service and follow up was…", "text": "Customer service and follow up was absolutely rerrible", "rating": 1}, {"title": "Staff does not know how to do their job", "text": "Date of experience: June 13, 2024", "rating": 1}, {"title": "Was rushed to settle", "text": "Was rushed to settle. Won’t use again. ", "rating": 1}, {"title": "Terrible experience with very limited…", "text": "Terrible experience with very limited communication!!", "rating": 1}, {"title": "I closed a week ago, and we are not done.", "text": "I closed a week ago ", "rating": 1}, {"title": "Mislead by broker", "text": "Mislead by broker. Unprofessional and unethical.", "rating": 1}, {"title": "Some people say", "text": "Date of experience: July 06, 2024", "rating": 1}, {"title": "Bad!!!!!!", "text": "No No No No No", "rating": 1}, {"title": "Everything", "text": "Everything ", "rating": 1}, {"title": "find another company, not what it used to be…", "text": "I was asked for a lot of extra documents. The documents included the right names and phone numbers for the individual to contact. The process was made painful by a lack of using/reading provided documents. Then asking me to get people to call rocket mortgage. You want to verify things, you call the right number provided. No have me ask them to call. Have had 2 previous mortgage with rocket mortgage. Very experienced such laziness on rocket mortgage’s part. ", "rating": 1}, {"title": "Our banker was unprofessional.", "text": "I’ve never worked with a banker less communicative and transparent than Kristian Sellers. She made us feel like we were a burden and that our requests were below her. Additionally, more times than not, she appeared disorganized and unknowledgeable (we even had our rate changed several times — one of which was due a documente she said they never received but our other lenders forwarded us an email proving she/Rocket Mortgage received it three weeks prior). We turned down the many competing lenders in hopes things would’ve changed but our outcome was below satisfactory. As soon as rates drop, we’re going to find a different lender to refinance with.", "rating": 1}, {"title": "We had to jump through hoops to get…", "text": "We had to jump through hoops to get anything done and we been with them for 4 years", "rating": 1}, {"title": "Communication was lacking and the…", "text": "Communication was lacking and the process moved at a snails pace. ", "rating": 1}, {"title": "You mortgage loan specialist was not…", "text": "You mortgage loan specialist was not honest with myself and my wife. ", "rating": 1}, {"title": "Ten year customer very unsatisfied", "text": "They didn't work hard to give me the best loan possible.All they wanted to do is make money, as much money as possible. It also took twice as much time as promised and they didn't use my real credit score. 731", "rating": 1}, {"title": "Terrible experience! ", "text": "This whole process from beginning to end and even after closing was nothing but a headache! We, the client, had to do the majority of the work. But we patiently responded to every request for documents, payment histories, etc. even when they were requested multiple times. Throughout the process we were told conflicting information. There were things we were told that we found out after closing weren't factual. Like when our first payment would be due. We, also, found out after closing that the the checks that were issued to payoff for some of the accounts were short and we, the client, would be responsible to pay any overages!Also, after closing on the loan, they realized one of the payoffs of one of the accounts we were paying off had expired so they held ALL the other checks from being dispersed on time. This caused us to have to make some payments on accounts that we shouldn't have had to but the payments were due. These were accounts that were supposed to have been paid off by then.Now here we are just two weeks away from our first payment due and instead of being able to save up for it we're having to pay payments and overages on accounts that were supposed to have been paid off at the beginning of the month.We are definitely frustrated with something that could have been a lot smoother if Rocket Mortgage took better care of the client! They definitely didn't!Update after response on 5.20.2024:Yes, we spoke with Jessica. Throughout this process we were passed around to different associates, we started with Nichole, then were passed to Josh, then Jessica. Now we're on our own with no help from anyone. Everyone was helpful up until after all the \"payoffs\" were dispersed. Then after that we were left on our own without anyone's help at Rocket Mortgage's and had to pay the shortage of what we were left owing. When Rocket Mortgage says they will payoff a loan they mean they may or may not payoff the entire loan.You will have to do their job for them and MAKE SURE they have the right payoff amount on your loans or you WILL HAVE TO PAY the difference! ", "rating": 1}, {"title": "Dishonest Bankers! ", "text": "It’s funny you ask a question and you say be honest! It would help if your staff was honest, it would help if Rocket Mortgage was honest! I have already given a horrible review and you keep asking for more reviews. So here you go. Our banker was a dishonest individual and I will never deal or recommend again this company to anyone! I can speak to 3 different mortgage deals that all went the same way and none of it was good! Rocket mortgage seems to follow the same script of screwing people out of as much money as they can, you pre qualify people and give them everything they want to hear but come closing time and it’s every excuse in the world to squeeze another 5-12 thousand dollars over the original quote and again this just happened 3 times to people I recommend and one didn’t get their loan because of your lying ways! This company is dishonest and will never get my business or anyone I know! Seems like a small threat I know but I have SEVERAL friends in a small town that are realtors and I will make sure they all spread the word to potential clients/buyers not to use this scam of a mortgage company. Have a nice day! ", "rating": 1}, {"title": "This was the WORST home buying…", "text": "This was the WORST home buying experience EVER! My loan officer Luke had to literally handle everything. I would give him a 10. Kim Cimorelli NEEDS TO BE FIRED! She did nothing to help continuously asked for documents that had been provided did not answer emails from my insurance company did not request the binder I had to do it all. Her rebuttal was that SHE was my point of contact not Luke. But could NOT do her job. Now after I have closed my payment is due in 2 weeks you people are threatening to impose insurance because you say I have none!!!! If that’s the case how did my loan close!!!!!! I will never use your company again and will tell everyone I know not to use you!! Luke Bradford needs to work for a company that works with him not against him and he needs a raise! The rest of this company sucks and no one is in the right page! After closing and you are still giving me grief and nightmares! Definitely not the experience I wanted!!!", "rating": 1}, {"title": "The Sell Your Info to 3rd Party Vendors", "text": "They clearly state they keep your information confidential. Two minutes after providing my email address and number my phone started blowing up. When I did speak to someone, all they did was regurgitate from a script. I do not recommend. ", "rating": 1}, {"title": "Unhappy/disappointed", "text": "Initially I was very happy with Rocket mortgage. I was offered a buy down deal and in the end the buy down did not happen. I was told that several people within Rocket dropped the ball on making sure that we got the buy down offer. It was a shock to know that my mortgage is between $200-$400 more than expected for the first year. ", "rating": 1}, {"title": "Too many hands in the cookie jar", "text": "Too many hands in the cookie jar, got to closing, the closing agent was very unprepared, took over an hour, then rocket and amrock do not follow up and if you have a problem, don’t look for any help, you have to keep on them to get the funds on time", "rating": 1}, {"title": "I will NEVER use Rocket Mortgage again! ", "text": "I barely closed this loan, due to countless delays and hiccups. This was the most stressful, time consuming, and confusing thing I’ve ever had to do. I am not, by the way, implicating any of the people I’ve dealt with through the process, as they all seemed very helpful and easy going, however the whole system was lacking in communication and too much was lost in translation between different people in the process. I was told multiple times that I would be closing within the week and the always had some issue a day before closing. Because of this, my “locked” interest rate on my loan increased 3 times throughout the process, and my rocket rewards never got applied towards my closing costs. I started this process in December of 2023, and didn’t close until the 2nd of May 2022. If I hadn’t been good friends with the seller I never would’ve gotten the deal closed. This is the most disorganized mortgage company I’ve ever seen and I would urge anyone going forward to not do business with them. Go to a bank or a traditional mortgage lender, you WILL regret dealing with Rocket Mortgage. ", "rating": 1}, {"title": "I am not going to waste my time…", "text": "I am not going to waste my time commenting. I have wasted enough time with Rocket.", "rating": 1}, {"title": "I was lied to from day one", "text": "I was lied to from day one. My monthly payment and interest rate ended up being more than what I was told it was going to be. It seems like every time I talked to someone at rocket mortgage it was a different person. It took so long to close that my so called locked in interest rate expired and of course it went up. Was this done on purpose so rocket mortgage can make more money ? I will never use rocket mortgage again. ", "rating": 1}, {"title": "The last person to handle my account…", "text": "The last person to handle my account dropped the ball if I didn’t call him I Wouldn’t have closed on time ", "rating": 1}, {"title": "Nothing was done right", "text": "Nothing was done right.  Estimates low.  VA inspection not done until I had to call VA 3 times.  Paperwork constantly changing. Ridiculous requirements on closing coats.  Missed 2 closing dates.  NOTHING WAS DONE RIGHT.", "rating": 1}, {"title": "First I must say thanks to Rima Bakos…", "text": "First I must say thanks to Rima Bakos and Jeff, they were awesome. I recently did my closing with Rocket Mortgage, some hits and misses at times. What I'm really upset about is the fact that I am to get some money back. Now this is a buy out case. Only to hear that my money is in equity. Why my money is sitting in escrow and not my pocket is  a mystery. The worst part about this is, I can't get a decent explanation. the money was supposed to go to my attorney to be disbursed to me. That did not happen. This is my personal money which was calculated as stated in the HUD. Rocket mortgage should be able to make adjustment and give me my money without increasing my loan amount. At this moment I am very disappointed. People keep your eyes open, the level of dishonesty is real in this country.", "rating": 1}, {"title": "Too large", "text": "Second time around getting a loan, and the experience was terrible from start to finish.", "rating": 1}, {"title": "Don't ever use rocket", "text": "Lack of communication having to track down problems myself the system \"broke\" in the middle of my process closing delayed a week employees telling me other employees dont know what they're talking about, getting the run around on things constant headache would never recommend rocket to anyone who wants to keep their sanity I've already told numerous people about this horrid experience and this isnt my first time with rocket, i dropped them like a bad habit the last time i tried using them", "rating": 1}, {"title": "Sam was very professional and explained…", "text": "Sam was very professional and explained everything in detail. Closing was the easiest one I’ve ever done. I’m very impressed with your company ", "rating": 1}, {"title": "My experience was terrible from start…", "text": "My experience was terrible from start to finish, it got better once I made it an issue regarding the customer service. It was “every customer every time” it felt as if I was a burden versus being a customer who services 2 different loans through Rocket Mortage.  ", "rating": 1}, {"title": "Part of our electronic/virtual signing…", "text": "Part of our electronic/virtual signing paperwork was not submitted.  Rocket mortgage did not inform us that paper work needed to be resigned.  We received multiple emails telling us that our loan had closed and that we were done.  4 days after the dispersment was supposed to come thru I called Rocket to see what was going on.  Only then was the problem found.  Over the next week I received more emails telling me that the loan had closed despite the paperwork not being submitted. Confusing communication and poor oversight.  That I had to call in and point out that there was a problem 4 days after the payoff and dispersment was supposed to be there was very upsetting.  Over all a very frustrating experience.  We are not planning to refinance with Rocket again.  ", "rating": 1}, {"title": "The worst experience I have ever had…", "text": "The worst experience I have ever had took years off my life! Due to the stress I went through with this mortgage company, I almost had to go to the emergency room twice. The unprofessionalism was like living a nightmare. I would not recommend this company to my worst enemy! If you are considering using rocket and have not yet done so, DON'T!!!  ", "rating": 1}, {"title": "Several documents had to resubmitted…", "text": "Several documents had to resubmitted several times b/c they kept changing what they wanted on them. Part of my money was cut in a check to a company that I do not owe money to. I have no way to cash out that portion of my profit", "rating": 1}, {"title": "I did all the work", "text": "I did all the work, found the home. Even came up with the ridiculous amount of 30% down an a 80,000 home purchase. Over 6 grand in fees… paid 29,856$ and still owe 56k… screwing the small guy is what you companies do best.", "rating": 1}, {"title": "Poor information from Michael", "text": "Date of experience: May 04, 2024", "rating": 1}, {"title": "Underwriting was horrible", "text": "Underwriting was horrible. My loan officer was great. If I could have left o& went somewhere else I would have!! I thought it would be great having another loan BECAUSE I already have an existing loan. Again my loan officer was great but my experience was horrible!! ", "rating": 1}, {"title": "Poor quality assurance ", "text": " Horrible experience. That’s all I’m going to say. ", "rating": 1}, {"title": "Wish someone would of explained the…", "text": "Wish someone would of explained the mortgage process with me instead of handing me off to a different person thru every process of the Loan.", "rating": 1}, {"title": "This is our second Mortgage.. but not again..", "text": "This is our second mortgage with rocket mortgage. We were promised by “Fox” the lowest rate on the market if we continued with Rocket. After one week of researching we decided to make it official to apply within Rocket. Once we did, the % rate jumped 1.9% from promised the week prior. While we were not pleased, we continued. After finalizing a verbal agreement on a price of a home- we had considerably the worst experience with the Lawyers of Rocket Mortgage. This department does not communicate with the sale/loan processing side. We had weekly check-ins with our loan guarantor & processor yet both failed to tell us there was a 10-day lead time for all documents to be submitted prior to closing date. This meant that our %rate expired. Therefore, we had to pay a fine for extending this rate. Fast forward to the local party-attorneys … documents were still missing coming onto the second deadline. I had to force communication and demand results between rocket lawyers and our lawyers in order to make our deadline on time. It quite frankly felt rocket set us up to fail and force the rate lock extension penalty. Our real estate lawyer has dealt with Rocket many times and even himself agreed Rocket lawyer department is one of the worst companies he has had to deal with. With this said, please take this review into consideration and try to improve. We got many apologies throughout the way, but never once, “we’ll make sure this doesn’t happen again” . Not promising to the customer. Do better, Rocket. ", "rating": 1}, {"title": "Settlement pushed back 2 weeks which in…", "text": "Settlement pushed back 2 weeks which in turn caused me 1 week to have all the work done before moving in. Work is not completed and had to move in with my sister. I had to be out of my apartment on 4/30. I will not be in my house till 5/5. I was also told my fico score went up and would get a lower interest rate that didn't happen. I was also told that your fee of 2.35% would be deceased to 1% that didnt happen. Horrible experience!!!!", "rating": 1}, {"title": "I ask for a HELOC and got a refinance", "text": "I ask for a HELOC and got a refinance. Making my entire loan a higher amount. ", "rating": 1}, {"title": "Too many folks involved with the  loan…", "text": "Too many folks involved with the  loan process, they are all not on the same page. Also, when files were uploaded we still had others in the loan process  asking us for the file. Some of your mortage folks do not know all they need to in the process of doing applications,  laws, of specific  loans etc...", "rating": 1}, {"title": "The experience was terrible", "text": "The experience was terrible! The initial loan guy \"DJ\" was hard to understand ( language barrier).  He made me upload the same documents repeatedly.  He made mistakes on the debt ration worksheet lisitng items multiple times, would send me the wrong paperwork to sign, just such a bad experience with him that after a while, I refused to work with him.  I was assigned someone else who did better but there are just too many people at rocket involved in the process asking for things to repeatedly be sent after being sent, telling me wrong thigs, etc. I will NEVER EVER EVER recommend Rocket as a mortgage lender. HORRIBLE experience and as I was just a cosigner helping my sister to get a loan. Rocket was AWFUL!", "rating": 1}, {"title": "The process was frustrating", "text": "The process was frustrating. Every day I was given another hurdle to jump through. I was told so many different things all the time that it made everything so extremely frustrating. What was supposed to be the happiest most exciting times in life was ruined. ", "rating": 1}, {"title": "Poor execution ", "text": "Many items went wrong and the company just says they are sorry as they take my moment.  ", "rating": 1}, {"title": "In April we had our bank account was…", "text": "In April we had our bank account was breached due to a online payment for another bill We called Rocket mortgage to let them know the problem that we were having that we need to cancel payment until we change bank accounts,we where told to tun off autopay and delete payment info we  did then on the payment date they took our money out of the bank had to put a stop payment on it.Now we our only one payment behind and will be taken care of this month and  and all payment will up to date by June. 8phone calls later instead of them helping us resolve this problem we now getting threatening emails about for about late payment.this is the first time in 30 years we have missed a payment when all of this is said and done its time to move out rocket mortgage ", "rating": 1}, {"title": "The entire process was cumbersome…", "text": "The entire process was cumbersome compared to our past experiences with Rocket.  I believe the agent helping us, while very nice and trying her best, was likely too new to be on this solo.  In the past we have felt the agents were much more knowledgeable, proactive and accurate.  We also feel like the cost to work with Rocket was MUCH more reasonable in the past. In the end, a more senior agent aided us (very knowledgeable and helpful), and we were able to close, but I would not recommend the process to others the way I have in the past.", "rating": 1}, {"title": "Terrible experience", "text": "Absolutely the worst mortgage company we've dealt with.  ", "rating": 1}, {"title": "Our experience with Kim at RMortgage…", "text": "Our experience with Kim at RMortgage was disappointing. Despite our efforts to communicate our needs, there was no follow-up or guidance provided throughout the process. As our closing date approached and delays ensued, it became evident that Kim’s communication skills were lacking. We were left with no choice but to escalate the issue to her supervisor. While we ultimately closed with RMortgage due to time constraints, the overall experience was subpar, and we cannot in good faith recommend their services to others.", "rating": 1}, {"title": "We explained to you that we didn't want…", "text": "We explained to you that we didn't want a long drawn out process, that we needed our money before a  certain date and you assured us that you could do it.  Then, you dragged your feet, held up a series of hoops for us to jump through and then gave us our money waaay too late!!!  You will not fulfill your promises!!!", "rating": 1}, {"title": "Everything went perfect until closing…", "text": "Everything went perfect until closing date. My passport of the United States of America was refused as my identity document they were demanding a state ID, when a passport surpasses any, and every ID. I told the loan officer that I was out of the country in Puerto Rico and I only had the passport.  I do not understand why I was being inconvenienced to have my signature notarize in person when originally, my electronic signature was going to be notarized my electronic signature I repeat, and then to top it off after nobody paid attention that I had not closed until I followed up on the issue I was told to send the documents as they were and then nobody did anything, and when I finally closed after being inconvenienced to hire an attorney to notarize my documents  with the passport, my distribution was not deposited into my bank account and again I was given a poor excuse for it not to happen they need to get their communication fixed nobody communicated in this process of mine. Nobody communicated with me or each other. I was treated like a third class citizen by uneducated people that don’t know Puerto Rico is a territorial of the United States of AmericaSincerely Madelina Colon", "rating": 1}, {"title": "You should be honest and give your…", "text": "You should be honest and give your client what you promised!! ", "rating": 1}, {"title": "Communication ", "text": "After giving all of our information, we were told he would call us right back, after going over all our options. Never heard anything back. Tried calling him back for 3 days. Still nothing. We left message to let us know what was going on, so we could move forward. Still nothing.", "rating": 1}, {"title": "Ir was terrible could be better. needs major improvement.", "text": "Date of experience: April 21, 2024", "rating": 1}, {"title": "Was happy until I did not.receive my…", "text": "Was happy until I did not.receive my checks to payoff creditors and no one has been able to resolve my problem.", "rating": 1}, {"title": "unprofessional, deceitful, error riddled process to maximize loan cost and rocket income", "text": "amroc low balled appraisal to maximize interest rate and loan fees.unprofessional, unethical, unreasonable, riddled with errors, and have been reported to the state board for license to be revoked.", "rating": 1}, {"title": "Crazy unacceptable ", "text": "There was hardly any communication during the process. The communication I did receive no one knew the answers to my questions. If it wasn’t to risk my home, i would’ve chose a different lender. Staff is extremely unprofessional and very very rude", "rating": 1}, {"title": "Deceptive lending", "text": "Deceptive lending. Rocket mortgage snuck in $940 on the principal for a credit card I have. They didn't tell me. I am now paying interest for the next 30yrs on something that I pay off every month with 0 interest. They will not remove the $940 from my loan. ", "rating": 1}, {"title": "We were lied to the entire time ", "text": "We were lied to the entire time we worked with Steven Sandoval. There are so many hidden fees.", "rating": 1}, {"title": "I have been buying house since I was…", "text": "I have been buying house since I was 19. I’m 58 now and this was the worst experience I have ever had. ", "rating": 1}, {"title": "Not a good experience ", "text": "A lot of unnecessary document requirements. We were told in the beginning that we would be able to make additional payments as we desired. Now we can only do automatic payments. We have never had to mail check payments to companies this was always done on-line. The amounts to be paid were not correct. ", "rating": 1}, {"title": "I almost lost my condo", "text": "I almost lost my condo. I did not close on the day I was supposed to. I worked harder than anyone on my 'team' to gather and RE-gather documents.  Underwriting asked for docs the day I was supposed to close.  Shouldn't they have already done that?  It was a nightmare. I wouldn't suggest this process to anyone. Even the seller's realtor was suspicious of their 11th hour requests.  Speaking with executives did not change a thing.  ", "rating": 1}, {"title": "Rocket continues to hound me to…", "text": "Rocket continues to hound me to purchase mortgage life insurance. ", "rating": 1}, {"title": "GO SOME WR ELSE ", "text": "Sales guy a ten Appraisal total S  show I already sent in a complaint NO RESPONSE ! TITLE Ugh Notary was amazing ", "rating": 1}, {"title": "Worst loan company.", "text": "Worst loan company. ", "rating": 1}, {"title": "Yvonne Jones was terrible to work with", "text": "Yvonne Jones was terrible to work with.  She sent back documents that if she had read them would have filled requirements.  She did not return calls or emails.  I would not recommend simply because there are too many people involved on a loan with no communication between them or the buyers.  It was a Very stressful transaction", "rating": 1}, {"title": "I stated already that the experience…", "text": "I stated already that the experience was awful and expensive. ", "rating": 1}, {"title": "Process was too long and the closing…", "text": "Process was too long and the closing costs were excessive.", "rating": 1}, {"title": "They give me too much hard time", "text": "Date of experience: April 15, 2024", "rating": 1}, {"title": "Very difficult process", "text": "Very difficult process. Why do you not send checks to pay off debt s to creditors? I would not recommend or use your company again.  ", "rating": 1}, {"title": "Do NOT use Rocket Mortgage", "text": "Do NOT, I Repeat, Do NOT use Rocket Mortgage for a loan or ReFi. I was deceived & lied to from getgo by Adam B. Started me out at a HIGH Int rate,but once he learned I was speaking w/ another Lender he dropped the Int dramatically. Hmm, why wasn't that rate provided from the start? I finally phoned his superior, Jordan S. They bullsh-t you literally to the end! I have been jumping all kinds of hurdles for 7 weeks, only to be SCREWED right before Closing Date, all because I had surgery. Which, btw, Adam & Jordan were aware of! Folks, DON'T use this company! Avoid the headache, heartache, bullsh-t!  ", "rating": 1}, {"title": "What timeline to get thru the was worst…", "text": "What timeline to get thru the was worst underwrites and they fought me to pay 139 credit bill for 4 days and made me close only on the last day of my rate lock.   ", "rating": 1}, {"title": "I HAVE PURCHASED MANY MORTGAGES", "text": "I HAVE PURCHASED MANY MORTGAGES. WORST ONE OF ALL. WOULD NEVER RECOMMEND ROCKET MORTGAGE TO MY WORST ENEMY. STAY FAR AWAY.", "rating": 1}, {"title": "Sent the documents to the wrong place…", "text": "Sent the documents to the wrong place and charged me form thank you rocket", "rating": 1}, {"title": "Please have someone call me to discuss…", "text": "Please have someone call me to discuss the details. Trust was my issue! ", "rating": 1}, {"title": "Misleading and disappointing experience on house purchase", "text": "We had re-financed with Rocket and had a good experience, so when it was time for us to purchase our new house we thought it would be good to keep business with them. I regret that decision.It started by Rocket erroneously telling us that if we use one of their realtors we would have $10k back. We used their realtors instead of using one of our great realtor that had helped us in the past. The realtor that Rocket recommended was not good! Sometimes it felt they were not sure of what was going on and definitely felt they were not on our side.Then, later on the process (a few days before our closing date) we were informed that due to a mistake, Rocket could not give us the promised 10k. The agent assigned to our case said it was her mistake and that she gave us the wrong information and that unfortunately she would not be able to give us the promised 10k. She said she would make up to us and give us $5k. Because we were so close to the closing day we had no option but to accept it. Then, on the day before the closing that person assigned to our case called us to give the final numbers and then informed us that she wouldn’t be able to give us $5k but $3k and that she gave us a discount on something that until today I have no idea what it was. That was so frustrating and I felt fooled or that we are stupid for trusting this company.Also, we had informed multiple times that we did not want to buy points in order to make our rate lower. On the day before our closing we were informed that we paid $17k to lower the rate (I was furious but again couldn’t say anything because it was the day before our closing date, also it was like 6pm at night!)We also said that we would not like more than $20k back. This person again ignored us and gave us $50k back instead of using this money on the payment of the house.These things made my family and I not trust rocket anymore and we can’t wait to refinance with another company!No one listened to us, it was all about the money!Also, the other agent assigned to us decided that it was not enough time to close on our house on the day stipulated on the contract, because the appraiser (request by Rocket) was late on delivering his report. If that would had happened we would had lost our deposit of $17k and probably lost our house. I had to call this guy crying and I desperately beg the him to not postpone the closing date. I explained that it was not our fault but the appraiser and finally he agreed to not postponed. Later on the closing we found out that this person was going to be out that day and probably that was why he didn’t want to close on the day on the contract!It was so unfortunate and disappointing working with Rocket! I didn’t expect that on the purchase of our house specially having a “relationship” with the company for so many years!We felt we were mislead on borrowing more money than necessary, buying points against our will and deceived into this “use our realtors and get some money back”. I Will not recommend Rocket to anyone. ", "rating": 1}, {"title": "Rocket Denied Us Our Lender Credit 3 Days Before Closing ", "text": "We are purchasing a home and agreed to proceed with Rocket Mortgage based on an interest rate that included points purchased for $6,694, which were being covered by a $6,694 lender credit (LC). The loan included a shortage for 1.5% points. Other lenders had provided us with identical interest rates, but without the need to buy down the rate. Our agent provided the LC to bring their loan offer in-line with the competition. We explicitly told our agent that we did not use a Rocket Homes agent for our home purchase, but they assured us that the LC would be applied regardless due to management approval. Closing was scheduled for 2.5 weeks later. We received a Loan Estimate a week later that removed the LC. When questioned on the change, our agent assured us it was a technical issue that would be resolved. 6 days later, we received another updated Estimate that removed both the shortage and the LC. I flagged the issue again for Rocket but they didn't inform us until a week before closing that the LC was intentionally removed by their underwriters, due to the fact we didn't use a Rocket Homes agent, but they assured us they were working on a solution. 3 days before closing the agent finally came clean and told us Rocket would not honor the original terms of our agreement. The agent admitted they attempted to \"sneak [the lender credit] past\" underwriting, which management confirmed was not possible. We could either accept the shortage credit or the LC, but not both. Throughout this process the agent routinely failed to respond to calls and texts requesting to discuss the issue. As of closing, Rocket has acknowledged all of these events took place and that our original terms were approved by the capital markets team, but they refused to honor this approval because of their own agent's deception. Our options were to proceed with Rocket without the promised credit or lose the home. I've seen other posts discussing similar behavior so it appears to be a patter to pull in clients. Don’t trust them. Edit: I have not received a call or voicemail from Mr. Fuss and he has failed to answer both times I attempted to reach him directly. ", "rating": 1}, {"title": "Disastrous Experience with Rocket Mortgage - Beware!", "text": "If I could give zero stars, I would. My journey with Rocket Mortgage turned into an absolute nightmare, leaving me frustrated and utterly disappointed. I was initially attracted by their slick advertising and promises of a hassle-free, efficient mortgage process. However, the reality was far from what was promised.First and foremost, the communication was horrendous. I was passed around from one representative to another, each time having to re-explain my situation. It was as if my file was lost in a black hole, with little to no updates unless I bombarded them with calls and emails. And even then, the information given was contradictory, leaving me confused about the status of my application.The lack of transparency was appalling. Hidden fees started to emerge out of nowhere, significantly increasing the cost beyond what was initially discussed. It was like a bad magic show where every trick was designed to make more money disappear from my pocket. The final closing costs were shockingly higher than the Good Faith Estimate, which was a bitter pill to swallow.Furthermore, the processing time was painfully slow. What was advertised as a rocket-speed process turned out to be more like a bicycle with flat tires. Constant need for unnecessary documentation became the norm, not the exception, causing significant stress until my final hours of closing. I have been faithful in my patience of processes because with my numerous years of being a government employee but this process was a test of my faith. My company Lockheed Martin referred them and this felt like a betrayal, considering the amount of time and energy I had invested in this process. In conclusion, my experience with Rocket Mortgage was far from the fast, friendly, and straightforward process they advertise. It was a sequence of mismanaged steps, lack of transparency, and utter disregard for the customer's time and money. I strongly advise anyone considering Rocket Mortgage to look elsewhere and spare themselves the agony and frustration I endured.", "rating": 1}, {"title": "This was the absolutely worst EXPERIENCE EVER, A HELLACIOUS NIGHTMARE- SEE ABOVE…", "text": "This was the absolutely worst experience that I've ever encountered.  I kept getting calls that I was ready to close then there was a mixed up with my Trust, no transparency, none disclosure, runarounds, bogus and incorrect text messages to build up my hope, duplicate information, excessive info already on file, demands on my time with no valid explanation, rescheduling me apprx 15 times, this was absurd and the worst experience ever and then checks were delivered without any knowledge of such just dropped off along with checks having to be voided and no one informed me that the monies would be wired into my account for the voided checks, unethical procedures, etc.  This was a hellacious nightmare to say the least and an unprofessional way to conduct business.  This was mentally exhaustive, causing anxiety, mental anguish, stress and duress.  I would not recommend your company to anyone and I'm going to file complaints to companies who regulate and govern how your company conducts business as you all wasted a lot of my valuable time.", "rating": 1}, {"title": "Nightmare", "text": "The entire experience was awful. Several of the Rocket Mortgage team were great however, we had an awful time with things not being done on time. The appraiser really screwed up and we ended up paying much more out of pocket up front than anticipated. They recommend our realtor and that wasn't great either. Communication was ok during the debacle but every delay cost money out of our pocket. We had to pay for several extra inspections due to the appraiser finding issues that the initial inspector missed. Rocket was unable to close the loan as it was initially written and we had to go back to the drawing board and change everything.", "rating": 1}, {"title": "Does not Make sense.", "text": "RM contacted my to offer refi on property. Nothing had changed from the original mortgage except that property had increased in value and improvements had been made. Expecting to receive a call for closing and received a call loan was going to be denied due to new guidelines. Investors needed to be protected. I attempted to ask for better understanding several times, submitting pics and docs to my not understanding the reasoning. Everyone up to the last person I spoke with a Ms. Reid, was very helpful. When Ms. Reid contacted me she had already decided the decision was made and there was nothing else to talk about. OF course, the current loan on my home is still acceptable, but a refi on property that has improved and appraised for more is not? I went from a very satisfied customer dealing with RM for years, referring friends and family, to now wanting to move my business else where. Thank you Ms, Reid. The customer service skills you have will take you far with your investors I am sure. ", "rating": 1}, {"title": "Had to deal with Too many people", "text": "Had to deal with Too many people! Miscommunication and given misinformation. Will never deal with this company again found better rates. decided because of time frame promised and then they fell through.", "rating": 1}, {"title": "Worse experience with a mortgage I have…", "text": "Worse experience with a mortgage I have ever had. Each part of the process was extremely long. Poor communication. The amount that Rocket would loan me changed several times. During the process I saw an large amount that I would have to pay at closing, I had to ask what that was and was told that they required that I had to pay off two auto payments. Then the day before the scheduled closing that amount had gotten much larger and was told that now I had to pay off eight different debt accounts. This was at the last minute, I am out of town for the closing the next day and have to arrange new money to be wired, etc. the final closing cost numbers were not finalized until three hours before closing. All the way through this experience it was either inexperience or incompetence. I will say that each person that I dealt with at Rocket (and there were many) was very personable, friendly, and nice. However, I don’t trust any of them. I can’t wait to pay this off and separate from Rocket. I will never do business with Rocket Mortgage again and will advise others not to either.", "rating": 1}, {"title": "Rocket is fast at closing and taking…", "text": "Rocket is fast at closing and taking your money.  Then they lie to you about costs.  Ben Kiehl should wear a mask when he is busy robbing you.  I have more respect for bank robbers than I do mortgage brokers.  They need the same government reform treatment that realtors now have.  I regret doing business with Rocket.", "rating": 1}, {"title": "Way to long to close ", "text": "It took 5 months to close and had way to many requirements. They make you do all the work. If you can go with someone local that you can see face to face.  They told me 30 days to close ha ha!  I also was told they will contact me if and when interest rates go down to get a better rate. I'm waiting for that then I may adjust my review.", "rating": 1}, {"title": "It took way to long for everything but closing.", "text": "Kianda was great, but, The whole process was long, drawn out and unnecessary! Asking for proof of employment after most recent W2, paystub and all my 401K documents were sent over. I will not nor recommend anyone to use Rocket for anything in the future.", "rating": 1}, {"title": "Highly Disappointed ", "text": "1. Communication was poor2. 48 days to close3. We were told to be ready for a closing date and we shorten our vacation to be in attendance4. Our presidents club banker Kyle quit5. New person assigned Zaven - very helpful6. UW stated that my annual corporate stocks and options were not considered income?  So loan had to be restarted with less income7. Xactus rep verifying accounts did not understand the repeated checks on basic account info already in UW possession8. Over 100 docs submitted to UW seemed excessive9. My daughter had to get involved multiple times to validate she pays her own college bills. Embarrassing for all10. I hope this is enough information. All of this can be validated via your own website and recorded calls11. Communication was non existent and when I reached out for help it wasn’t to be found", "rating": 1}, {"title": "Nothing went as it said it would…", "text": "Nothing went as it said it would absolutely nothing and I’m severely disappointed in this refinance, I will never recommend rocket mortgage refinance.", "rating": 1}, {"title": "Just find some other lender", "text": "We understand full-heartedly that closing dates can change but the pure fact that the person who is supposed to be in contact with us throughout the whole thing wouldn't give us the list of things that needed to be done until after we got one thing done he would say oh but this needs to be done we would get it done oh but wait this needs to be done too this went on for a solid two and a half weeks and we ended up closing almost a month later than we were supposed to and when we asked to be compensated we were told no because we did everything right. Because of what Dennis did or lack thereof. My family had to stay in a hotel for two weeks and barely had enough for the closing cost let alone a moving van to move. 10 out of 10 would not recommend to anybody else.", "rating": 1}, {"title": "Terrible service and not honest on…", "text": "Terrible service and not honest on timing and   methods of final payment. I WILL NEVER USE OR REFER ROCKET MORTGAGE. EVEN TO MY WORST ENEMY!!!!", "rating": 1}, {"title": "Nothing more than car salesman wanting commission ", "text": "They sound like a car salesman every time you talk with them.  The person that handled our loan was constantly not in the office or busy with other clients.  They demand you trust them and they constantly tell you to be patient.  They send checks to pay off other debt and tell you that they will have priority envelopes with them and they lie about that.  Notice how they send those out after the 3 days have passed to cancel the loan.", "rating": 1}, {"title": "You lost me over 672.00 fraud charge on…", "text": "You lost me over 672.00 fraud charge on my credit that you are trying to make me pay off It was a renter purchase of Direct tv and is 11 years old picked up buy the third collection agency Espertain has it now Utter BS but no one did a damn thing send me another check made out to me because I pissed on the one made out to the collection agency", "rating": 1}, {"title": "It sucked so bad and will never use…", "text": "It sucked so bad and will never use them or recommend them to anyone ", "rating": 1}, {"title": "I originally gave a 3 rating, now a 1", "text": "I originally gave a 3 rating. But Im reducing to a 1. I received a yet another promo mail-piece. AN OPEN POSTCARD WITH MY NAME, NEW MORTGAGE AMOUNT, RECORDING DATE, AND ID NUMBER for anyone to see.If exposing my personal information like this is not illegal, it should be. I intend to find out.", "rating": 1}, {"title": "rate is not good", "text": "I am reaching out to share our feedback regarding our recent experience with Rocket Mortgage. Unfortunately, we found the rates to be unsatisfactory, and due to our tight schedule, we are unable to consider switching providers at this moment. This situation has led us to feel trapped and has significantly diminished our experience, making it one of the worst we've encountered in this context.We had high hopes for a beneficial partnership with Rocket Mortgage, but the outcome has been far from expected. It's important for us to communicate our disappointment and the challenges we've faced as a result of these issues.", "rating": 1}, {"title": "E your system is a failureven though you were informed for a…", "text": "Even though you were informed for a telephone call that this mortgage was on a house in Pennsylvania but we were in New Mexico you sell the paperwork to the front porch including checks to Pennsylvania", "rating": 1}, {"title": "After a good experience refinancing our…", "text": "After a good experience refinancing our loan, I am unable to get online assitance setting up auto pay account unable to be found!", "rating": 1}, {"title": "Everything that could go wrong did go…", "text": "Everything that could go wrong did go wrong. It took months to process the loan, duplicate questions being asked over and over. The appraisal was way off the money and frankly the terms kept changing. We felt like we entered an expensive transaction with few controls and if we were told the full and correct terms up front; I don't think we would have continued. The closing was a cluster**** where we asked for money to be wired to our bank, same bank they withdraw our mortgage every month and instead sent a check. I would not recommend Rocket.  Rocket did reach out to us but the loan was over by that point. I think they need to have intervened earlier when problems showed up. The change in appraisal values from their own initial and honestly correct appraisal based on recent sales should have triggered a warning. So my original review stands. ", "rating": 1}, {"title": "STOP ALL ADS AND EMAIL", "text": "Date of experience: March 28, 2024", "rating": 1}, {"title": "This company over promised and under…", "text": "This company over promised and under delivered! ", "rating": 1}, {"title": "Total incompantence", "text": "Total incompantence.  Worst experience my wife and I have had buying a home.  Add to the sleazy and deceptive practices and I will never do business with Rocket again.  As soon as rates drop and it makes sense to refinance I will go elsewhere.", "rating": 1}, {"title": "I am highly frustrated with MARIUS AND AMROCK ", "text": "I am highly frustrated with the communication and the way everything was handled as well as the lies that took place. We were told a specific time frame so I had to fly back from overseas to sign the paperwork. Which they did kno wI had to fly out of the country yet they did not warn nor tell us how texas laws were. When I came back I was reassured everythign was good to go and we would be signing. I had to change my flight 6x, which means I was out 2 grand plus other flights due to their incompentence. Amrock was also not good at their job. The lack of communication and understanding is beyond what it should ever had been. We continued to express our frustrations and ask questions to be lead in circles. Later, we were transferred to out loan officers manager who proceeded to apologize and tell us he would give us my $2000 back plus a better rate next year when they follow up with us. Ali Bazzi would not give this assurance in writing. Our original loan officer was Marius. Please do not use either as they do not know the laws, and will reassure you and never follow up and drag it all out. We did finally get the load 3 weeks after they told us we could sign, which in total it took over 3 month to get. Not to mention they requested a survey and did not pay it when we already had a land survey. there is so much more...", "rating": 1}, {"title": "Your team was friendly and helpful", "text": "Your team was friendly and helpful; however, completely flubbed the closing and did not include the correct items that we wanted to refinance.  Do you have a quality control department that reviews closing statements to ensure that they are correct? ", "rating": 1}, {"title": "the first agent we spoke to was great... then it got worse. ", "text": "the first agent we spoke to was great. it wasn't until we decided to proceed with rocket mortgage that we seemed to get questionable service. confusion when it came to what documents to put in. for example we submitted a document showing our insurance was paid in full for the year. and rocket mortgage messed up and added the insurance cost to our closing. costing us thousands. still waiting to get reimbursed. ", "rating": 1}, {"title": "The initial application process was fantastic - easy and fast and clear.", "text": "The initial application process was fantastic.  But once it got into processing it languished.  And the app reported elements being worked on that I knew were not.  Very frustrating.  Had to escalate multiple times.", "rating": 1}, {"title": "Definitely treated like a number rather…", "text": "Definitely treated like a number rather than a human. Can correspond with 3 dif people on an issue and recieve 3 dif answers. No one seems to truly care, treat you like a nuisance just to get you off their plate. The process was torture but once you get so far you feel trapped. I will never recommend to anyone, will actively dissuade from using rocket mortgage. I've never been so glad a process was over. Would rather give unmedicated child birth than go thru this process again. ", "rating": 1}, {"title": "Terrible experience so t use them again", "text": "Terrible experience so t use them again ", "rating": 1}, {"title": "Poor communication", "text": "Poor communication, requested the same thing multiple times, didn’t have a point person to reach out to. We didn’t feel that we were kept updated throughout the process and had to repeatedly reach out for updates. ", "rating": 1}, {"title": "Loan Officers just tell you what you want to hear to get your business and then under-deliver", "text": "Very dissatisfied with Rocket Mortgage.  Loan officers were quick to process a $200k Home Equity Loan while assuring me that I could use that equity to purchase a second home.  The equity loan rate was not great at 9% for a borrower with a 790 credit score.We found a second home within weeks of closing on the equity loan, and decided to use Rocket to do the second home loan only to be told underwriters did not approve the loan since we just took out an equity loan on my primary residence.  Wasted precious purchase agreement time dealing with Rocket and now we risk losing out on our second home and the earnest money we put down. Hopefully I'll get this purchase done using a credit union.  You have many options in Lenders, I would not recommend using Rocket Mortgage.", "rating": 1}, {"title": "Worst mortgage experience ever", "text": "Worst mortgage experience ever. Between my status being in an apparent que and five to six different people calling about the same thing, then my whole intention was to consolidate all my outstanding loans and use some equity to build a small shop. Rocket consolidated everything but my auto loan, that I was asked to provide, and because I didn’t catch a small box someone in underwriting didn’t check there won’t be any shop, all I got was a “I’m sorry about that,” and was essentially a complete waste of my time an effort to refi to a higher interest rate. Won’t ever deal with Rocket Mortgage again.", "rating": 1}, {"title": "Rocket… don't believe their rating", "text": "I simply cannot understand how Rocket Mortgage gets such high reviews. The closing on my mortgage was just about the worst I have ever known, and now that I have a mortgage, I have received three threatening letters regarding insurance, the documents for which have been uploaded to their portal THREE times ... and there is no way to actually talk to a representative. Old customers are not welcome to discuss problems, only new ones. The company is an overgrown bureaucracy . Avoid them if you can.Followup to your response: Thank you. Very polite, but confirming that Rocket is inadequate when it comes to supporting customers … but don’t worry. I used your chat system. I was given the Fax number so my insurance company can also send documents; and I was given a telephone to your customer team that actually routes, eventually, to an actually human … and that human, very polite, confirmed that my documents were there … and they were there long before you sent the second threatening letter.If you are truly in a position to make changes, instead of just being polite but inept, try to get your record confirmations under control.I’ll leave my rating as is.", "rating": 1}, {"title": "Rocket mortgage team Nolan was Great", "text": "Rocket mortgage team Nolan was Great, the underwriting people not I think they ask for to much info that holds up the process ", "rating": 1}, {"title": "not responsive on time and not given…", "text": "not responsive on time and not given all the details ahead of the time. ", "rating": 1}, {"title": "Because we asked the underwriter…", "text": "Because we asked the underwriter notable out payments to anyone and that did anyway.  I recv’d a check for a creditor and don’t plan on sending it out.  Spoke to Myles and he was suppose to take care of the situation and haven’t heard from him either!  So disappointed with Rocket", "rating": 1}, {"title": "So many many cooks in the kitchen", "text": "Everything was wrong from the start. I absolutely hate it. Dealing with this company. There was so many cooks in the kitchen. There is something sad about them with a local bank and one person every five minutes I had a new person dealing with my account never again.", "rating": 1}, {"title": "I agreed to certain debts to be paid…", "text": "I agreed to certain debts to be paid off with my cash out refi.  Rocket paid a debt that I did not want too pay leaving the largest payment unpaid.  They refuse to correct their mistake leaving me with $500 more going out each month than I agreed to in writing.  I have six emails agreeing to the terms and they do not care.  Their mistake they do not care.  ", "rating": 1}, {"title": "I already called in my complaints and…", "text": "I already called in my complaints and am waiting for results now. Was the worst thing I’ve ever gone through. Nothing happened when or how it was said it was going to happen. Couldn’t get ahold of Joshua Harman first 3 weeks of my 45 day rate lock to answer questions about repairs. In fact the only time I was ever able to get him to answer the phone was the first day and on closing day. Since things were finalized he has ignored every message and call of mine. Nothing happened unless I was pushing. The appraiser missed something in first visit bc they sent someone to take pictures for them to refer to to appraise my home instead of doing the appraisal in person then came back 3 days before closing and said they didn’t notice there wasn’t a floor in the living room then I woke up next morning with another thing on todo list to fix floor with 3 days left. Joshua Harman was home through this entire process and did not deserve to be paid at all or keep his job for that matter. I’m waiting on refund at the moment for all my troubles!!", "rating": 1}, {"title": "2minths to close and still 21/2 months later no money. ", "text": "Closed our loan on 3/15/24 and as of 3/26/24 we STILL have not had our funds dispersed and the first mortgage paid off.  Rocket is blaming Amocco but WE TOOK THE MORTGAGE OUT WITH ROCKET NOT THE TITLE COMPANY. Started loan process on 1/15/24 and we didn’t close til 3/15/24 AND IT WAS A REFINANCE IF YOUR LOAN.  Told at time of loan application it would be a 2-3 weeks process with no appraisal necessary.  WAS NOT A GREAT EXPERIENCE AND STILL ISN’T BECAUSE WE STILL DON’T HAVE OUR MONEY!. ", "rating": 1}, {"title": "While I was working with one of the…", "text": "While I was working with one of the people handling my loan processing They were constantly looking for emails that had already been sent.  At one point I was told that it had gone to her spam email.  I had the same complaint from the realtor I was working with.", "rating": 1}, {"title": "Worst experience ever! Never again ", "text": "If they were truthful with with time frame it will take would be great! We had bought our home for cash and ended up wanting to take out a loan to pay off other debt we started the process at the end of January with them based on what we were told we didn't shop around to much for other mortgage companies they seemed to have the best rate and cost. Told we could make bimonthly payments well you can but they do not post them to your mortgage until they have the full amount. We were wrong so wrong it is now March 25th finally closing everything and waiting for checks from them which has been over a week already. The only thing they've caused is our credit rating to dive because of them pulling our record more then once and when we went to go with another company it showed we had a mortgage with them before we had even closed? I can not wait to refinance with another company! ", "rating": 1}, {"title": "I do NOT recommend Rocket Mortgage", "text": "I do NOT recommend Rocket Mortgage. The process was awful. Rocket Mortgage sent the wrong person to do home appraisal  even though we continued to question it. Then charged us for a second appraisal! We lost over month in waiting because of this. Our closing cost then went up more. Sadly we were to far in to start over, but will NEVER use Rocket Mortgage again!!!! The only good part… was the lawyer who did not work for Rocket Mortgage! ", "rating": 1}, {"title": "Worst mortgage experience ever", "text": "Worst mortgage experience ever! You guys suck! I will never ever ever use Rocket or Amrock! I’m telling everyone and anyone about what horrible companies they are! ", "rating": 1}, {"title": "You put a bill on my mortgage that was…", "text": "You put a bill on my mortgage that was not my bill nor was my name on that bill.who you did see on thatbill was Maxine and Melvin Reed I will not pay someone  else bill .Rocket Mortgage wronged me you should make that right", "rating": 1}, {"title": "I will never to use Rocket Mortgage Again", "text": "The experience I had with Rocket Mortgage was horrible.  I was told that I qualified for a home loan grant that would pay for points.  Then after 4 weeks of processing all of my paperwork, they said I did not qualify for the grant and I could keep my rate, however they charged me all of the points.  They manipulated the situation holding that information for weeks to keep me from withdrawing the loan from Rocket.  Rocket Mortgage could have notified me within the 1st week and I could have gone with another lender.  This is a deceptive sales practice.", "rating": 1}, {"title": "Nightmare", "text": "One word, Nightmare!", "rating": 1}, {"title": "Matthew was terrible", "text": "Matthew was terrible, didn’t listen or follow up", "rating": 1}, {"title": "oh boy - refinancing becomes 7 month saga", "text": "oh boy!  applied on July 31, 2023.  The representative was not a good listener, kept bringing verbal pressure (interest rates) when I said that was not a concern.  Learn to listen.Just like any other existing homeowner there is an existing mortgage on my home (apartment).  As with any re-finance, one needs to pay off the existing loan. I live in a co-op in NYC, and each co-op issues stock to the homeowners.  A mortgage company is obligated to securely store the stock documents as collateral.  The company allegedly responsible to do this, SPS Servicing (not Rocket's fault) - but no one from Rocket was actively chasing these folks down until I started harassing the attorneys or anyone I could get to listen and follow up. I'll spare you the rest of the story, it took a village to close this mortgage - 230 days!!!  Without the individual dedication of Ryan Cabrita of Rocket, this never would have been closed happily and successfully.  That the 'executive' who was supposed to help this process never called to thank me for hanging in or apologize for my terrible service.  ", "rating": 1}, {"title": "It was horrible!!!", "text": "It was horrible! It started off ok when the loan officer agreed to 6.375% for the loan because it matched all the other offers I received. I signed to that offer. The first thing was that I uploaded all bank statements to him while he was on the phone about 24 pages in all, he said he had them. The next day he called and asked me to do it again because he could barely see it. WOW!!There were several incidents after that where the money did not add up in the end. The credits from them and sellers. I asked and they tried to fix but there were still questions that they could not answer so we had to change the date of the closing. Several times I was about to find another company but my realtor asked me to work it out since we were so close to the end. They also added on a sneaky 1% fee and when I asked they told me I had to buy down the loan from 6.5  get it to 6.375. I told him that was not the agreement and he argued with me and told me I had to buy it down. That evening I went to the emergency room because my pressure got so high I thought I was having a heart attack. We had closing date set up for 2days. They then sent a several texts to say they would do it for 6.375%. The damage had already been done. I was at the hospital and would not answer and asked my realtor to take care of it.The next day when they gave me all access to my docs I saw that they filled out a form saying I would buy down the loan and printed my name at the end.WOW!!! Do Not Use This company! They suck you in with promised credits and the end charge more fees.  ", "rating": 1}, {"title": "There was a mistake on the payoff…", "text": "There was a mistake on the payoff amounts and instead of helping me they want me to pay money I don’t have. I wouldn’t have agreed to the loan if the payoff amount was different. Now they want me to keep the loan but not honor what we agreed on with the payoff amount. I am literally trying to get out of a $300k mortgage over $300 this is absolutely ridiculous.. I will never recommend this company and am trying to get rid of them asap. ", "rating": 1}, {"title": "Too many cooks in the kitchen", "text": "Too many cooks in the kitchen!  I made initial contact with Christopher Roberts but over the period of 30 days was contacted by several other employees of the Rocket Mortgage \"Team\".  When I asked questions about the status of my loan and the timing of the closing no one could provide a straight answer.  When I provided documents regarding liens on our deed of trust your people could not verify and or locate those scanned documents.  Recommendation:  have one point person on each loan application that all communications funnel through.  Have that person outline in detail the flow chart steps the loan application will travel through and the time required to complete the process.  We had a first trust deed loan with Rocket several years ago which required about 15 days to complete and dealt with one mortgage broker throughout the process.  On more than one occasion my wife and I were ready to pull the pin and withdraw from the loan application because of the continued frustration of your not giving us straight and timely answers to our questions.  Finally once we applied for the loan with Rocket Mortgage we were barraged with at least 30 telephone and email contacts wanting to make a loan at a discounted rate; quite annoying to say the least.  Who provided these people with our contact information?  There it is then....", "rating": 1}, {"title": "Every time I spoke with rocket the…", "text": "Every time I spoke with rocket the price changed and numbers never matched up. Underwriters were a pain as I would give exactly what was requested and then they would ask for it to be changed. Had my insurance company and independent engineer say I did not need flood insurance and y’all would not accept current elevation survey showing changes. Y’all went of a 1950 map with “approximate location” instead of 2024 survey showing elevation down to 1/10 th of an inch. Complete bs. Very unsatisfied with rocket. Chris was helpful but rocket is crap. I have several investment properties and a constantly adding new properties but will never consider rocket again. ", "rating": 1}, {"title": "I found this to be an awful experience", "text": "I found this to be an awful experience. It took 2 1/2 weeks longer than expected because they people handling the gathering of information didn't call me for help.It also seemed like no one was in charge.", "rating": 1}, {"title": "Bad experience…", "text": "Didn’t know how to handle certain situations.  Made commitments didn’t meet.   Asked for same documentation multiple times.  Not smooth.  Took longer than promised.  Kept coming up w new issues.  A bad experience", "rating": 1}, {"title": "Team of goofballs", "text": "Every step of the process has been through several different people. One guy doesnt know what the other guy did and I had to resend tax returns and P&L statements etc again and again. The closing was postponed again and finally the wire transfer was denied, and so they decided without consulting me, to ups overnight a check. they sent the check to my old address 14 hours away on the day I needed it to clozse on a new property purchase. What a team of F-ups!", "rating": 1}, {"title": "Our complaint is regarding the notary…", "text": "Our complaint is regarding the notary that came to our home. Out of social politeness, I am use to greet and be greeted, especially when I am invited into a home. This woman did not acknowledge me and even spoke to my husband as if I wasn't even in the room! We asked her simple questions to which she didn't know the answer, usually a professional will at least say, \" let me find out for you,\" or some similar response. I couldn't tell you her name, as she didn't introduce herself. We are disappointed in adults social skills.", "rating": 1}, {"title": "I am not happy with the way my mortgage…", "text": "I am not happy with the way my mortgage lender handled this loan. My interest rate was changed atleast 5 times, maybe more. Every time I spoke with him there was another “issue” and my interest rate would go up and the loan amount would change. Kind of felt like a bait and switch. I had invested a lot of time in preparing paperwork ect. for this Rocket equity line and needed the money by a certain date. He kept giving me different quotes and loan packages as the weeks passed by. I ended up not having enough time to compare the rate with another lender. If I had known the loan amount and interest rate were gonna change multiple times I would have looked elsewhere. I was quoted 7.75% with my submitted initial application, estimated home appraisal and credit report. My lender came up with his own home appraisal which was much higher than mine. This ended up causing my interest rate to go up significantly. In the end I got 9.375%! Not happy, I plan on refinancing elsewhere in the near future. ", "rating": 1}, {"title": "No good it was very frustrating I tuck…", "text": "No good it was very frustrating I tuck for ever to do paperwork.", "rating": 1}, {"title": "Bad support overall", "text": "Bad support overall. No communication and no support", "rating": 1}, {"title": "Frustrating ", "text": "Documents requested duplicate times by different finance people. Seemed Rocket members didn’t interact w/each other. People were kind, but frustrating as they kept asking for 1 more thing. Maybe a list of all needed documents could be created…some sort of standard work. ", "rating": 1}, {"title": "Avoid Rocket Mortgage", "text": "I would not use rocket mortgage. There was lack of communication, customer service people were not knowledgeable. I finally found some who was knowledgeable to help me through the process appraisal demands unreasonable.", "rating": 1}, {"title": "Worst experience ", "text": "Already did a review ", "rating": 1}, {"title": "It pays to shop", "text": "We should have shopped more. Turns out your closing costs were way too high and you put no effort into trying to resolve the issue on your end with the wire transfer. This issue was a tremendous inconvenience that cost me hundreds of dollars in interest that otherwise could have been avoided. Your people were nice and for the most part responsive but in the end you cost me more money some of which was your fault as explained above. I recommend people shop, even a little, and you’ll find a much better deal.", "rating": 1}, {"title": "RM is one of the worst mistakes of my life", "text": "My advisor, Josh Laura, consistently gave me false information that ended up costing me thousands of dollars. He told me if I close on March 1, I would not have to pay my first mortgage payment until May. I found out, ON CLOSING day, that I would have to pay in April. I did not budget for that. He also told me everything was fine with our appraisal. 5 business days from closing, he gave me to another person to work with. This new person, Chris, informed me that I would also need contract work done before I could close, from the appraisal. I had to scramble to find a contractor that could fix things quickly and had no time to negotiate cost with the contractor or the seller. The issues go on and on. Josh stopped taking my calls because he knew he messed up my case. Everyone I worked with had a unempathetic attitude. I sincerely hope God himself curses this business into an unrecoverable bankruptcy. As soon as I can refinance, I will, so you do not get any more business from me.", "rating": 1}, {"title": "Not up front about certain costs.", "text": "Many mistakes and took longer to close. Told us there was a “Promotion” today only to bring down our interest rate but charged us $3000 and we didn’t catch it in time.", "rating": 1}, {"title": "Rocket required over 50 documents to  l…", "text": "Rocket required over 50 documents of Financials and endless proof of repairs on letterhead by certified contractors from the seller up to 2 days before closing then finally gave up and decided we were low risk so cleared us for closing. It was a nightmare amd roller coaster ride for a standard conventional loan for a low risk loan.", "rating": 1}, {"title": "TERRIBLE COMMUNICATION", "text": "Communication between departments is absolutely horrific. No one is on the same page about anything. Constant transferring, waiting in home and repeating the same information several times. I neverGet a direct answer to a question. Unbelievable how bad the phone service is! ", "rating": 1}, {"title": "NEVER AGAIN Rocket Mortgage.", "text": "Rocket Mortgage was supposed to include old mortgage balance into new refi.  Chelsea said, the old mortgage was paid.  Rocket mortgage employees told me \"it should have been paid off.  Researching...never called me back as promised.  Deal closed 1 March 2024.  Old mortgaged still not paid.", "rating": 1}, {"title": "Communication  lack of", "text": "Communication  lack of, once you  get to a point of paper work the 1st person you  talk to is gone , alot of lies an leg work a customer  has to do ", "rating": 1}, {"title": "Horrible overall experience ", "text": "Horrible overall experience Never recommending it again", "rating": 1}, {"title": "Ghosted by Rocket Mortgage", "text": "After getting several calls and texts a day from Rocket Mortgage and knowing from my financial trials that I may not qualify, I finally spoke to a very nice loan officer. We spent an hour or more on the phone. I poured out my heart about lost finances during my husband and my COVID experience. I got my hopes up from her responses and, because three years before, my credit rating had been high and I know I’m a good risk with a COVID blip in my life. She even asked if she could call back with an answer that night. I told her to call in the morning. It already was late and I thought I wouldn’t sleep waiting. Then, I never heard back. Nothing. Ever. I presume I was rejected. I emailed for confirmation. Still nothing. If you worry you are a risk, you may not get good service like the rest of these folks. I didn’t and am pretty heartbroken at the time and hope I invested.", "rating": 1}, {"title": "I will never use Rocket Mortgage again", "text": "I will never use Rocket Mortgage again. Somehow they made a huge mistake and I had to pay for the price of almost $8,000 on the day of closing. NEVER AGAIN", "rating": 1}, {"title": "Bait and switch", "text": "Bait and switch. Too much detail required for simple transaction. Constant delays, causing new rounds of 'req'd' info. No cost loan became expensive, tried to add to the loan. Promised discounts were forgotten, rate buydowns were forced on us, and then didn't result in the expected discount. Won't use them again. Update 3/18/24: We were contacted, told they would review and work to credit us the money originally promised. After about a week they came back and said they would not be crediting anything. ", "rating": 1}, {"title": "Used VA cert and had to put down 38K", "text": "Used VA cert and had to put down 38K - that includes commission of 18K.  NOT ALLOWED for a 100% disabled VET. ", "rating": 1}, {"title": "Go with local lender instead", "text": "There was a lack of transparency and a general feel of pressure to just sign without thoroughly reviewing documents. The whole process felt very car sales like. There were several times it felt like a bait and switch scenario or that we were being taken advantage of somehow. There were also mistakes when it came to calculating the taxes that a local lender would have been more keen on due to the way property taxes work here specifically.If I could do it again, I would go with a local lender.", "rating": 1}, {"title": "Where is the full accounting for costs?", "text": "I did not receive an accounting for the closing costs, specifically the repayment of my HELOC. I believe I am owed several thousand dollars.", "rating": 1}, {"title": "Sensitive Documents Misplaced ", "text": "Sensitive documents were lost is your mailroom causing employment verification to happen numerous times which delayed closing. Poor customer service and lack of attention to investigate. ", "rating": 1}, {"title": "I told lender multiple times I didn’t…", "text": "I told lender multiple times I didn’t want buy down points but they slid them in there anyways. Buyers beware.  ", "rating": 1}, {"title": "I was asked to provide additional…", "text": "I was asked to provide additional documentation the day before the closing. Many of the docs were unrelated to myself but instead were my son’s thus making them harder to find.", "rating": 1}, {"title": "N comment do not e mail me for opinions…", "text": "N comment do not e mail me for opinions again", "rating": 1}, {"title": "Not happy with my refi", "text": "My payout did not come on the same day as promised, know one followed up with me to ensure the licensed agent that helped me during the refi did not get a commission or any type of payout because I was not happy with him as he tried to coerce me into adding more debt, and the payoff to my creditors came in the form of a check, which is ridiculous in this day and age.  It should have been electronically.", "rating": 1}, {"title": "I was lied to by the 'salesman'", "text": "I was lied to by the 'salesman'. Some of the things he said I found out were not true. ", "rating": 1}, {"title": "Due to Borrower Funds Shortfall…", "text": "Some of due to borrower funds were not received more than 2 weeks after closing.", "rating": 1}, {"title": "Due the borrower has still not been…", "text": "Due the borrower has still not been delivered. ", "rating": 1}, {"title": "Honesty", "text": "Honesty, is not the policy, its, say, do, whatever it takes to string the customer along until its almost impossible to change their mind.", "rating": 1}, {"title": "BAD BUSINESS PRACTICES", "text": "I called and spoke to a Loan Officer not licensed in my state but provided helpful information.I was referred to a Loan Officer with a License in my state and for some reason, I wanted me to call her.I called the next day and this person shared completely DIFFERENT information and that includes Origination fee.I regret calling since she needed to do her job.The 1st person did a soft pull and stated the Origination fee will bee $1125, worse case $1500 based on $200,000 loan.2nd person which was the following day, the Loan Officer should have been honest.  And based on $175,000 she stated my Origination fee will be $1930.I mentioned the fee provided the day before is different than hers.She stated the Origination fee is 1% and if I am that dumb and wouldn't have noticed that I am being over charged.  Maybe she couldn't count!She ignored the different amount given to me and stated, all Origination fee's are based on 1% of the cost of the home and it's capped at $2500.Someone in elementary can see without a calculator that $1930 isn't 1% from $175,000.Lets move on.I was referred to Rocket Homes from the Rocket Mortgage Loan Officer and even the agent wanted me to call her AS IF I WORK FOR THEM...  So I did not call!  They will learn today.I received a text and someone asked, \"when are you available\". I said, not to be rude but that is a question for email.If you are already using my numbers, WHY NOT call?Of course I said it in a better tone I hope. So she called and thought it would be just her speaking.I have questions, and I need to ask them.  I also do not allow people to speak for me. I am purchasing, so I am going to speak.She had questions and tried to speak for me in that call. So I asked, I said, so you want to ask questions and answer them?She stated, what most people do as if that was a good reason to answer the question for me...  Corrections needed to be made since I reject that!That was already starting off wrong...  But I continued in that call and the agent mentioned one home.  Literally ONE - HOME. The price was over my loan amount and she stated that is all I have!  She tried selling that and I stopped her and said, anyone who purchases the very 1st home they look at is a fool.So do not think that is me...I need at least 10 homes to tour and choose from.  Not some home that she didn't even want me to see. This is a business transaction and being up front is important.  I shared how I felt and what I am looking for. So I guess I was supposed to SO THIRSTY that I would purchase anything just be in a home I have not seen and without seeing other properties.  Let's move on.When she discovered that I may be a 1st time home buyer but the scam and games will be caught and mentioned since it's rejected.She started pushing me towards other lenders. I am on board with that since Rocket Mortgage isn't on board with LISTENING and being respectful and helping find the best deal.  Even if they are new, I need to be assisted by someone who has the sense to know that I need a selection of properties NOT JUST ONE HOME.So because I refused to go with the only home selected for me, my ROCKET MORTGAGE  ACCOUNT WAS CANCELED.This racial profiling and ignorance will not make me leave quietly.  I for sure will not walk away quiet.I sent the Loan Officer Alana and the Agent Michelle an email, informing them both that they are now OUT.It is 100% my choice which home I decide to go after.  100% my choice if I want to work with that Loan Officer and Agent.And they gave me nothing but BS instead of honesty and professionalism.That is a violation in my book and therefore needs to be reported. I am spending MY MONEY so I am going to get the best customer service and as for that racial profiling or whatever caused that stank behavior it will always be reported.I was treated like I need them and need to chase them.  They quickly learned it wasn't happening!Good Credit, Financially Stable and not going for any Clown Like behavior!I will look for another Lender but I am going to call Rocket Mortgage tomorrow to report the bad business practices and change to a better Loan Officer and better Real Estate again and for my account to be reopened.  Even though I am done with them.  That will be done to show that they are easily replaced.Any push back at all!I will be getting off the phone and contacting the Federal Trade Commission.DUE TO BAD BUSINESS PRACTICES.How dare them cancel my account for not jumping through their hoops and taking what ever deal works for them.  All of this is for me. If anything is for them, they should keep it to themselves.It's so not over yet!  I want their names completely removed from my account, I will never work with them again!And who cares if I go with Rocket Mortgage.The RED FLAG has turned my stomach.This is a Licensed Loan Officer for NV and a NV Real Estate agent.Shame on BOTH of them for losing a deal over their ignorance!", "rating": 1}, {"title": "Never try to qualify self employed people", "text": "You should never try to approve a self employed multi millionaire.   You have no idea how.  It was the worst banking experience I have ever had.  I own my house in clear and wanted to borrow against it.  Unqualified back office.  ", "rating": 1}, {"title": "Your lending policies are very shady", "text": "Your lending policies are very shady. Multiple promises were made to keep us on the hook with you guys. This loan is done. I will refinance this year and I will not use you under any circumstances. I am not a first time home buyer and am very loyal to companies who do a good job. My last mortgage company financed 4 of my houses and 2 of my daughter's houses on my recommendation. I will let anyone who asks know that you are a shady organization  ", "rating": 1}, {"title": "Throughout the process", "text": "Throughout the process, I did feel a little like we didn’t matter since some of our communications were at 8 o’clock at night our time, but the biggest problem was the payout. Why did we have to wait three days for a refinance payout that upset me we should’ve been able to waive that problem and then the second situation is paying the debt off on my refinance. You’ve cost me a ton of money and interest and I had to make extra payments and stress trying to get money back from the creditors because you didn’t do a wire transfer. You sent me damn checks when other companies would do wire transfers All because of the way you do the payout I am telling everyone at UPS not to use you 300,000 people and tell everyone they know and everyone in Hollywood because I have a lot of friends that are actors. I’m just really upset with how the payout was done. ", "rating": 1}, {"title": "You push for closing but become…", "text": "You push for closing but become unavailable jus days before closing. Force loan payoff and at the same time you say we can chose but don’t make selves available for changes ", "rating": 1}, {"title": "Rocket Mortgage is difficult to work with.", "text": "First I want to say that I know 100% of the blame for any issue can never be placed on an individual. Especially not when it comes to closing mortgages. There are so many moving parts and people involved. With that being said I am very disappointed that we could not get a clear to close on time knowing that we had more than 60 days to do so. I provided all of the documentation I had access to. My employer provided all of the documentation they had access to. All within a timely manner from the moment the documentation was requested. Rocket Mortgage and the team working on this home loan had more than 60 days to figure out what documentation was needed and to obtain that documentation so that a clear to close by Friday 02-23-2024 could have been obtained on time.This is all so very disappointing and unacceptable to me. If any of the blame falls on me, my employer, or my realtor I’m sure we will accept that. Maybe I should have stayed on top of Rocket Mortgage and the loan process more than I did. I incorrectly assumed that Rocket Mortgage would have stayed on top of it for me. As I was busy working long hours, out of town, and away from my family to make sure I had the cash to close.With all that being said I do appreciate the hard work from everyone involved to make buying this home a reality for me and my family. It’s a stressful process for everyone involved. None of that is lost on me. I just wish it would have been a more enjoyable and efficient process. I wish we could have closed on time so that my realtor could have been present at closing to represent me. So that I could have had more time to help my wife move in our new home after taking possession before having to leave for work again.", "rating": 1}, {"title": "Nobody told me a payoff check was being…", "text": "Nobody told me a payoff check was being sent directly to me. I never received it. Now I have to pay a months payment to the other creditor. I have additional interest that I shouldn't have. This has messed up plans I had and has cost me extra money. Closing my loan quickly was prioritized over giving me information. I now feel like I made a mistake using Rocket Mortgage and will be unlikely to use you all in future or recommend your services to anyone else.", "rating": 1}, {"title": "The communication skills and…", "text": "The communication skills and professionalism of the under writing and title team was extremely lacking. The App is not of much help. It is time consuming and the process from submission of documents was not bad but the process on Rockets side is inefficient and not customer centric at all. ", "rating": 1}, {"title": "Not impressed", "text": "Not impressed. Mortgage broker was pushy and aggressive, asking questions about your own loan is too much to ask and I felt I was inconveniencing him.  Provided all paperwork at the very beginning of the loan process (1/5) somehow though that paperwork didn't get to the processors when uploaded by their side, or it just wasn't uploaded. Foundation report turned in in early January, took over a month for them to request some conditions, however the information they were requesting was in the report! Had to get the engineer involved. Had to send in additional copies of the tags and the data sheet in the house that were included in the 800.00 appraisal!! Once loan is conditionally approved, there is no hand off to another person in processing as I was told in the beginning, you are left hanging, unless I stayed on top of this loan it would still not be done. Conditions were a mile long and never ending. Processors asked for the same information over and over and some didn't read what was sent. Appraisal took over 2 weeks to clear. I didn't find out until the end that I would receive paper checks to pay off my credit cards, so that means getting envelopes and stamps, mailed in checks a week ago and only two have posted to my accounts, when I could have done it myself over a week ago. Now I have to go back and collect close to $2,000-3,000 that was over paid. So ridiculous. Didn't even get a copy of my loan paperwork, had to request one, like WTH?? Seriously? This loan became a full time job for me, I don't work there. Needed a loan got one took 2 months unfortunately. I can only hope the servicing side is better than the lending side.", "rating": 1}, {"title": "Poor communication", "text": "Poor communication, I had to call to get updates, i was charged $5k to lower points and was not told about that. I got a discount from my employer that was not applied. And I don’t know how to get my property taxes refunded that were taken care of ", "rating": 1}, {"title": "significantly more steps and…", "text": "significantly more steps and documentation needed than from other lenders.  Biggest issue was the appraisal process.  the appraiser left out entire full bathroom on our appraisal and would not correct it without the house blue prints", "rating": 1}, {"title": "Please stop harassing me", "text": "Date of experience: February 26, 2024", "rating": 1}, {"title": "Process was complicated", "text": "Process was complicated.  Kept being asked for information they already had.   Been constantly told I was done then more information was requested.  Horrible process.", "rating": 1}, {"title": "Don’t refinance, ", "text": "Was pressed, rushed and only was able to speak 1 time, will not do it again ", "rating": 1}, {"title": "Loan closed but no refund after 12 days amd no communication ", "text": "You asked and I will tell you. I closed my loan and received an email that every was good and congratulations. This was a refinance to take cash out. 12 days after closing, no email, no phone call, no text messages and no refund. So I called to find out what was going on. I was on hold for 38 minutes before I got to talk to a person. It was much faster when I was in the closing process but this time it took much longer to talk to a person. So I get to talk to a person and I was told that the loan documents were missing some signatures on certain pages. 12 days after closing and nobody told me or contacted me about this. And this wasn’t my fault either. So I said you know what, I don’t want the refinance anymore because this process seemed like Rocket mortgage didn’t want to do the refi and even after closing I am still having issues. I told the person I spoke to to just cancel the refinance so I can keep my old 15 yr loan with 2.8% or so. She told me it can not be cancelled because it has past the 3 day period. If I received the refund after closing I wouldn’t even have considered that. Loan was closed on a Thursday, nothing on Friday or the Monday and Tuesday the following week bi felt like even though the closing team saw documentation wasn’t complete, they waited for 3 days to past and even more days to come so I won’t have the option to say I don’t want the refinance. I may be wrong but if I must say, the closing documents is not all signed which means closing is not complete because more documents will need to be sign so how are they saying the 3 days is past when more documents needs to be signed to complete the closing? And this right here don’t sit right in my head. So my rating of 1 star. ", "rating": 1}, {"title": "A nightmare", "text": "A nightmare ", "rating": 1}, {"title": "Do not recommend ", "text": "Communication & lack of consistency -what we were told from person to another at Rocket.Would not recommend them.", "rating": 1}, {"title": "I was told 3 credit cards would be paid…", "text": "I was told 3 credit cards would be paid off and only one was.  I was lied too basically ", "rating": 1}, {"title": "The inspection was made as difficult as possible and money came much later than expected. Was supposed to be charged 2.5% but charged 3.5%. No chance I’m using you guys again. ", "text": "Deceitful practices with the percentage points closing, and awful communication on what’s going on. ", "rating": 1}, {"title": "Unhappy with post-closing service", "text": "First, I told you many times that I do not receive mail at the address of my primary residence, that the Post Office gives us a PO Box instead, but you have it as my mailing address and have not changed it.  I made sure that we altered that mistake on the actual closing documents, but apparently no one looks at the changes made by hand.Second, I closed over two weeks ago and have not recieved any of the pay=off checks yet.  They were originally overnighted to my primary residence - which I told you that we would not be going back to until the end of April, and when I got you to cancel the checks and other materials, I have no idea where you sent the replacements to.  I sure haven't received anything at the address of my winter home, which happens to be the one this loan is on.", "rating": 1}, {"title": "they lied and kept  my appraisal fee I…You can't trust anyone", "text": "they lied and kept  my appraisal fee I was the one who called and canceled the appraisal", "rating": 1}, {"title": "unprofessional ", "text": "Please, you sent an appraiser who I should have thrown out and cost us more in interest.   You sent checks in mail that were left on steps.  60,000 on steps, who does that? And yea, I got that on video.   On top of it, we still haven't recieved notice of payments that should have been handled by you.  You said you want paper trail but we were paid electronically.  We paid 60 dollars in certified mail and still have not recieved payment notification to date and will most likely be charged more payments or late fees for the payoffs. Thanks for that!  Very unprofessional.  ", "rating": 1}, {"title": "Every single credit card that was being…", "text": "Every single credit card that was being paid was OVER paid AND I had to continue payments because RM waited till the 16th (I closed on the 12th) to send the checks to me (I received on the 19th) which I had to then mail the checks to CC companies. I tried to give correct balances and was told I would have to send a statement from the upcoming month (March) in order to change amounts and that would delay closing. RM used what my credit report said instead of the statements. RM should have made the check out to me and I could have paid directly through my bank like I always do.I will never refinance with Rocket Mortgage again, never.", "rating": 1}, {"title": "I Refinanced my mortgage and it was not…", "text": "I Refinanced my mortgage and it was not satisfactory at all. I was taking out a loan to pay of my credit cards. When I complained about the charges they said I would not have to pay for Februarys mortgage. That was untrue I was charged. Then instead of giving me the money they made out checks to my creditors. By me having to mail them I got late fees and interest charges added to four cards for February. The whole experience made me want to back out- I should have", "rating": 1}, {"title": "When starting the process they made it…", "text": "When starting the process they made it out to be real good our house we were looking at was a slam dunk. Right before we went to close they swiped the entire process out from under us n said we needed to my over $6000 of small bills between myself and the co signer they said I needed. N we did n they still told us no can do. Went and looked at a house for 30,000 less than our original option n everything was done on my own no co signer needed and it was done in 1 month. 7 long months we fought with them to get answers and then it was always something new 2 days later after they said everything was good n we were off to closing n then boom back to square one. Getting this second option house was easy. The first house made me not want to buy a house at all, talked to other companies and they said it should’ve this hard. I couldn’t go anywhere else because they ran my credit every month n took me down 80 point n them told me I had to get it back up before they would talk to me about house #2. My rocket mortgage crew when at the closing process was amazing. The people before were awful. Don’t recommend!! ", "rating": 1}, {"title": "Rocket held money that should have been…wired", "text": "Rocket held money that should have been wired.  Communication was bad. Fees too high.", "rating": 1}, {"title": "I have never had more trouble refi as…", "text": "I have never had more trouble refi as we did with these people. We had to do all the work while they got commission. Then was told could get closing back but called after done said we could not. Abunch of false words and more money ", "rating": 1}, {"title": "Having to buy points…", "text": "When I was told that interest rates were down and I agreed to refinance nothing was mentioned about having to buy 3 points. To me this is wrong. Plus the extra add on like pesticide inspection. Appraisal and cost for wire transfer of funds. We already owned the house. I could have and should have stopped the loan app but I had put myself in a position that I could stop it. Never again, lesson learned. ", "rating": 1}, {"title": "Not at All as Advertised. ", "text": "Well, it seemed to start off fine, then in the middle of the, beginning, process our case worker went on vacation without telling us even though he knew of our time crunch. What is worse is the fact that he did no due diligence during our process and handed us off to the next person, Zachary Friedel, who started off by harassing my wife. Openly accusing her of stealing all the money we have and killing her dying mom. My wife's mother died 1 month before this process, so she didn't even get to properly greave and this piece of trash had the audacity to treat her like a subclass human being. He is lucky he refused to call or deal with me! It seemed like, as soon as, they found out my wife was a black woman in America, they wanted us to jump through every hope they could make up. We gave them everything they asked for and no one was looking at it or doing anything. We submitted more information than the federal government has on us, and every time we sent exactly what they asked for they made up new hurdles to see if we would just stop the process. After making a formal complaint against the racist trash, Zachary Friedel, and we were ready to walk to another company they threw our case to the only person that helped us in this entire process, Dominique Benjamin, Triple Crown Purchase Specialist. She had to start from scratch because no one else did their job. All the info we had already submitted 5 to 6 times she took and reviewed it all in 1 day and had everything but 1 document approved and us moving forward. She needs a raise! Rocket threw the \"black folks\" on her table because apparently, they hire other people that think it is ok to treat us like substandard citizens even though we are more than qualified with more than enough money to take care of the process. I truly believe that if Dominique Benjamin had not been assigned to us, that we would not have gotten this completed. We truly appreciate everything she did. She was amazing and took care of us in a professional manner. I cannot stress enough how good she was for us. Other than that, I would not recommend Rocket to anyone I know due to this experience. The other people in the company took one of the happiest moments in our lives and sucked the joy out of it. We have moved on and finished the process, this will not break us or shatter our dreams, but you guys asked for my honest opinion of our experience.", "rating": 1}, {"title": "Non stop phone calls", "text": "Selling my phone number and asking me to do your job.  And no I do not want to talk to you Ann or anyone else.  Stop wasting my time….", "rating": 1}, {"title": "DO NOT RECOMMEND. Terrible Underwriting practices. ", "text": "During the Underwriting process, the underwriter team requested a lot of information, which is expected, however the requests were unclear, confusing, redundant and due dates were inconsistent in relation to requests. Ex.1: Please provide the full bank statement for the month of December. Request is due 12/15. Ex. 2: Provide your bank statement from 12/1 to 12/19, with a due date of 12/10. I was so frustrated, I almost cancelled the entire thing. Additionally, per my insurance company, on 12/28, Rocket requested an effective change date to my insurance to be effective 01/12/24 when closing was not scheduled until 01/30/24. I was never notified of this change by Rocket but was notified by my insurance company on 01/09/24. I immediately reached out to our document/closing coordinator (Brian Duncan) and advised this needed to fixed immediately since 01/12/24 was quickly approaching. All Brian responded with was, \"We have it. All set. Thanks!\"  I followed up with Brian \"So the effective date is now 1/30/24?\" to ensure it was amended. Brian's response \"Correct. Thank you.\" I responded \" Not correct. No one from Rocket contacted KIN yesterday to correct the error. I had to stop working to call XXX, and just got off the phone with them and they confirmed the policy effective date is 1/12. Which I fixed. Additionally I have a Rocket Rewards credit that still has not  been applied to my closing. This has really been a s***** experience with Rocket and I'm not recommending Rocket to the buyer of my current home which initially I planned on.  Brian, in writing, lied to me.  UDAAP. The entire experience was extremely stressful,confusing and frustrating. Turns out a family member of mine had a similar experience with Rocket. I would never recommend this company and will pursuing a refi in the future just to terminate Rocket as my servicer since I have no trust that Rocket will service my account in a consistent, professional and honest manner. ", "rating": 1}, {"title": "Sent emails to wrong address containing…", "text": "Sent emails to wrong address containing personal details", "rating": 1}, {"title": "Our experience was fairly unacceptable", "text": "Our experience was fairly unacceptable. Our first representative messed up our initial paperwork causing several weeks worth of delays, and the amount of additional legwork on our end needing to process the loan was flawed and honestly just severely unorganized. We signed our closing documents, and then Rocket Mortgage backpedaled to have us resign after whatever inconveniences came up from underwriting. We'll never use Rocket Mortgage again. ", "rating": 1}, {"title": "Rocket Mortgage is a scam company", "text": "Rocket Mortgage is a scam company. You can try and try to get things done with them and they just lead you along. My father passed away and they refuse to let me pay them to keep the house from foreclosure. They are not willing to work on the paperwork to get it done. Each time they answer there is some other document that is needed and weeks go by. They never call or email back so I continue to reach out to deaf ears with the same excuses. Horrible company to do business with - I do not recommend.", "rating": 1}, {"title": "Use Anyone Else, get the money from your in-laws or drunk uncle if you have to", "text": "From asking for documents days/weeks after we provided them, to putting erronous fees on our loan estimate to even changing our closing date at the last minute costing us over $2500 in expenses, this whole process was terribly unprofessional.  Rocket blamed the title company and when I asked for reduced fees from the title company they admitted the fault belonged to Rocket.  No explanation was ever given for all the wrong costs/fees on the estimate.  Understanding some fees were fluid, our \"sellers credit\" and our \"homeowners insurance\" was set from the beginning yet they kept changing the amount.   If there was an option for negative stars, I'd use it.  Who can make moving to Florida a negative experience?  Rocket can!", "rating": 1}, {"title": "Complete chaos", "text": "Complete chaos, low level intelligence, discombobulated,  uncoordinated circus. Education is key. Stop hiring people who don’t understand basic math or can’t comprehend and organize documents. I did half the work myself!!! I deserve to get paid for doing most the work!!!", "rating": 1}, {"title": "Rocket mortgage lie when they say that…", "text": "Rocket mortgage lie when they say that will help with closing expenses. At closing nothing", "rating": 1}, {"title": "did not send my checks out until i…", "text": "did not send my checks out until i called on the 19 th they should have gone out overnight on the 13th.", "rating": 1}, {"title": "Rocket was great to work with Amrock has not been able to correct their own mistake.", "text": "Rocket was great to work with, up until we found out last week that Amrock omitted some document that needed to be signed at closing. Trying to contact somebody at Amrock has been a miserable experience!", "rating": 1}, {"title": "The loan officer lied to me about my…", "text": "The loan officer lied to me about my account his name is Guy B. Don't trust him because he lied to me throughout the whole process all he cared about was making his commission money", "rating": 1}, {"title": "Absolutely the worst experience ever", "text": "Absolutely the worst experience ever. Was lied too way too many times. Worst ever unbelievable how you treat people", "rating": 1}, {"title": "Make sure your agent is clear with how they disperse funds.", "text": "You can improve by trusting your customers.", "rating": 1}, {"title": "Don't recommend …", "text": "After the initial approval process I received 174 phone calls and emails soliciting business. How else would all the creditors reach out to me if Rocket didn't spread my information out via web.  I was told an appraisal would have to completed but because I was such a great customer the fee would be waived.  Right until they put the total into closing!! Then lied about it. When I asked for a different program because the rates were to high as a refinance, I got about 2 weeks run around with phone calls about closing.  No I didn't want to close on that proposal.  I finally was able to be transferred to a different dept and ended up closing after a week.  But here is my BIGGEST FRUSTRATION, I was going to pay off debt with the home equity loan, but they didn't pay the creditors directly and then I had to mail out the checks to the different creditors.  I had nothing but problems trying to pay these creditors off because they wrote the checks off based on the name of the credit bureau and not the name they wanted the checks made out to.  It took additional days for the payoff to happen which cost me more money in interest!! I feel Rocket Mortgage owes me the interest for the extra days and the fees I had to pay because the payments were delayed.", "rating": 1}, {"title": "Will not be using this company again", "text": "This is our second time using Rocket Mortgage and we had nothing but positive things to say the first time through. While trying to purchase a new house after our move our mortgage experience was awful from beginning to end. Communication was terrible and confusing between our first two contact people. It often seemed that the right hand didn't know what the left hand was doing and we got different answers from different people on the same topics. We had multiple requests for the same documentation and had to resubmit the same paperwork multiple times. One contact person contacted me upset that I reported we hadn't heard from him when we had important questions and changes to make. I could not believe how myself and my husband were spoken to. We plan on refinancing in the next few months if rates drop and do not plan to use or recommend Rocket Mortgage. I love leaving positive reviews and being positive and encouraging when leaving reviews but this experience could not have been more frustrating or upsetting.", "rating": 1}, {"title": "Doing business with con-men.  Enter @ your own risk.", "text": "My initial bank officer did a fine job, explained everything and she was assistive in the loan process.  However after jumping through all of R's hoops, when I asked for the amount I would need at closing her colleague emailed me and said it would be $307K and the loan amount would be $65K less than the number I was told.  Untenable.   Rocket had all of my financials and I told them what I could easily manage. Rocket's business practices remind me of con-men at best, bait & switch experts.  Save your time and money AVOID ROCKET MORTGAGE!  FRM", "rating": 1}, {"title": "Your employee was dishonest", "text": "Your employee was dishonest he quoted a percentage rate as well as a debt being resolved as part of the loan and then it was changed at signing and when confronted he denied our earlier conversation.", "rating": 1}, {"title": "They use to be my go to mortgage…", "text": "They use to be my go to mortgage company I’ve purchased two homes with them. After all the business with them I wanted to get my PMI taken off my home they charge me $190 to get appraisal but they use SCAM home appraiser companies they appraiser that was sent low balled my home so bad it was obvious, I sent rocket mortgage proof and they sold me the story it’s nothing they can do. So they stole my money and sent a scam home appraiser after a decade and all the business I’ve done.", "rating": 1}, {"title": "I would not recommend Rocket Mortgage", "text": "The mortgage experience started well with the loan officer, however, once we got past the initial stage and we started to have other people from Rocket Mortgage involved it was a disaster of an experience and we thought about postponing the home purchase to find another loan company.1. The processor assigned to our case did not show much care to our case and made multiple mistakes. Her phone calls seems rushed every time, and it felt like we were just an item on her daily to-do list. She asked us multiple times for the same task items that we advised her on, and she didn’t understand what we were telling her. She reached out to our realtor for information, but when our realtor ask for clarifying details the processor forgot to send a reply for over a week and we had to call her to get the information moving along.2. Whoever sent information to the appraiser third party was not sending the correct information or enough information. We were purchasing a home over 4 states away from the house we were purchasing, so we had very limited information and access to the property. We advised rocket mortgage to contact and work with the builder and our realtor, which they had all the contact information for. The first appraiser called us, the BUYER, to ask for access to the property. Not only did we not have access to the property that day or the next day. Not only were we 4 states away, we were the buyers and couldn’t get access to the new construction. Then the appraiser did not even know it was a new construction, Rocket Mortgage failed to convey this information. The first appraisal was cancelled as the appraiser wanted the house to be fully complete. We had to work with processor again to get another appraisal order, which AGAIN they called THE BUYERS not the realtor, or the builder to get access to the property. The mix up on the appraisal was a massive headache and had us calling the other parties in the process multiple times to get the appraisal on track.3. When it came to finalizing the loan numbers, we had not heard from the loan officer once we were passed off to the processor unless we reached out. We received multiple new disclosures in our rocket mortgage account that contained the incorrect and/or incomplete information. The new disclosures gave us absolutely no comfort about where the loan stood, or what our final numbers would look like. We were advised by the loan officer multiple times to just not look at the new disclosures that go out until the final one as they are incorrect….I don’t understand why the system would continually send out disclosures that are incorrect and misleading.4. When we were sent the closing specialist, again it felt like just a person that wanted to check the box on the to do’s. The experience was not personal or comforting at all. When making a large purchase it is VERY uncomfortable when we get a call and the individuals barely know our names. Then the starting throwing out numbers that don’t align to what we were just told the day before by the loan officer.5. Rocket Mortgage was given the CORRECT tax number by the closing attorney and they complete ignored the amount. They used their third party who did not understand the tax laws for the area, and completely missed a credit that would apply to our primary residence. The value Rocket Mortgage wanted to use for the tax number was 2.5x larger than it actually should have been. This would have increased our closing close by over $4,000 and our monthly payments by $400. I called and had the loan officer check the number, but was informed it looked correct. I pushed back again and provided the tax law credit information and FINALLY it was corrected before closing. The buyer should not have to deal with these headaches when making a major purchase.6. We were going to get a credit of $5,000 from the builders loan company. We were told very straight forward that rocket mortgage could beat that and give us $8,000. When it came down to the end I honestly don’t feel were given the credit we were PROMISED and we basically felt cheated. The loan officer showed us a screenshot of how the credit is being applied and I could basically see the credit in the back end…not on the closing disclosure. The closing specialist informed us of completely different numbers for the credits and I don’t feel we got our credit. It honestly felt like Rocket Mortgage increased the costs somewhere else in the closing process to balance out the credit were owed so we wouldn’t notice that we didn’t get our full credit. Overall, we are very unhappy with our experience and I would not recommend Rocket Mortgage to other buyers. Use a local lender, you will probably have a smoother experience.", "rating": 1}, {"title": "My solar panels were not included and I…", "text": "My solar panels were not included and I specifically asked for them to be included and Redi ? Said they definitely would be! They were not!", "rating": 1}, {"title": "Very Unprofessional", "text": "When we closed we were sent 9 physical checks in the mail, via UPS. They arrived to us on the 10th of the month. They were written for specific amounts based on the prior month’s balances. We had to sit down and write 9 physical envelopes, buy stamps, call and get statements emailed to us to mail with the checks, and call all of the creditors for their physical address and where to mail these checks. Most all of the creditors discouraged us in mailing physical checks. 3 did not accept physical payments, but let us mail them anyway, to a lock box. Most all of them told us it would take 20 days to process, and they were all 5 mailing days away. So we flew past our due dates, in which all the balances specific to the physical checks changed. We accrued late charges and had to make second payments (again making the amounts on the physical checks irrelevant). A few of the creditors laughed at us for wanting to mail physical, incorrect amount, checks in the year 2024 where electronic payment is encouraged. One of the checks we had to get changed, as it was written to the wrong company. We are now having to call over and over to our creditors to see if they have received the check as we are listed as not having made our payment for the month period, which affects our credit score. We are also worried about 9 checks, totaling over $100,000 being out there with mail theft being such a problem, as well as hoping that NINE checks are going to make it error free to their destination. And again, we have to make a second payment to most of them. I am stunned at the unprofessionalism of this method, along with all the time and effort we are having to spend on it. As one of our creditors said: “who mails checks in 2024?”. This has made us embarrassed rather than proud as we pay off our debt.", "rating": 1}, {"title": "Too many useless request for same info…", "text": "Too many useless request for same info over and over inter departments do not share info", "rating": 1}, {"title": "Very satisfied with the service", "text": "Date of experience: February 08, 2024", "rating": 1}, {"title": "The appraisal.", "text": "The appraisal.Upon a reconsideration of value the appraiser went 40K below what his original value he originally listed. They would not accept the first value of the home or do anything else to assist me with this matter ex: lender credits.", "rating": 1}, {"title": "We didn't know what our closing costs…", "text": "We didn't know what our closing costs would be until the day before closing. We had multiple different \" final cash at closing\" numbers and our Rocket Mortgage closing agent got really nasty with us when we questioned the process! NEVER AGAIN!!Purchasing a property can be stressful enough without being degraded by company agents with dogs and kids in the background as we are trying to do business.We will be refinancing when interest rates drop, and it will definitely not be Rocket!", "rating": 1}, {"title": "I have nothing more to say to you guys", "text": "Date of experience: February 08, 2024", "rating": 1}, {"title": "Poor communication between their own…", "text": "Poor communication between their own teams overall! The last two weeks was chaos as we tried to close two separate loans simultaneously. After endless verbal promises that the money received from the first close would be applied immediately to the second close was a nightmare. I felt we was jumping through hoops, giving constant reminders, and endless conversations within the 96 hours of our last close. Lets just say spending 6 hours at a title company and talking to over 10 representatives from 3 companys in that same time frame to make your dream home a reality is the reason I would NOT recommend Rocket Mortgage to anyone.", "rating": 1}, {"title": "Stop bothering me", "text": "Date of experience: February 04, 2024", "rating": 1}, {"title": "Lack of communication that delayed the…", "text": "Lack of communication that delayed the closing of our house and cost us a lot of money to reschedule move and application installation.", "rating": 1}, {"title": "She was not helpful", "text": "Date of experience: February 05, 2024", "rating": 1}, {"title": "I did not want a refinance", "text": "I did not want a refinance. I needed to reduce my monthly mortgage payment, however, I feel that refinancing turned out too costly for me. Now I have a debt which is for much longer than what I wanted. I wanted to reduce my debt load, instead it has increased. The Loan Officer benefited more than I did. I am not happy!", "rating": 1}, {"title": "The experience getting my Home Equity…", "text": "The experience getting my Home Equity Loan was a rollercoaster. There was no consistency with providing me with the right information and tasks in order reach my desired loan amount even after I expressed what I was looking for. I was told that trading in my vehicle would help lower my DTI ratio and help me qualify for more money and I proceeded to trade in my vehicle just for them to tell me that they cannot remove that debt, so I traded in my vehicle for no reason. Additionally, even after pulling my credit and getting me approved, at the very very end all of a sudden I had to pay $30k or debt from the loan I was pulling out. Leaving me with a lower cash amount I needed. I would not recommend ever. They either knew and decided not tell me all along to hook me in or they don’t know what they are doing and are changing up the terms at the very last moment. Horrible experience.", "rating": 1}, {"title": "Left accounts out", "text": "Left accounts out, final numbers confused.  Left to pay about $ 20,000 which was left out.Really bad service.Thinking of filing lawsuit and complaint with federal overseers.So much angst I had a stroke ,", "rating": 1}, {"title": "Where to begin", "text": "Where to begin.  They can’t do math and had to keep updating our closing amount day of closing.  They kept coming up with obstacles that needed addressed before closing within days of the scheduled date.  Our builder, insurance company, and title company all complained about working with them.  This was the absolute worst experience I’ve ever had with any company in my life.  We were already talking with another bank prior to closing because of all the issues.  Also their interest rates are one of the worst in the business.  You would be crazy to ever use them and we can’t wait to refinance so we can never deal with them again.", "rating": 1}, {"title": "Very disjointed program", "text": "Very disjointed program. No accountability for communication between departments. No quarterback or team leader that could answer questions, each department had a different contact and none could understand the timeliness. Too many departments!", "rating": 1}, {"title": "Not informative when making a deal", "text": "My broker basically told me nothing I was very disappointed that I had to dins out lol my info as it popped up on my phone from app. He didn’t even tell me how much I was being charged for closing cost and i had to find out day of closing that i was w being charged 14k. I would not recommend rocket mortgage", "rating": 1}, {"title": "I have already expressed my feelings to…", "text": "I have already expressed my feelings to those that I was dealing with. If I had known, I would go through the hassles that I have gone through with this I would never have reached out to Rocket Mortgage. It was the biggest mistake I made.", "rating": 1}, {"title": "TERRIBLE EXPERIENCE", "text": "TERRIBLE  Don't believe you've closed on your loan, they raised my payment the day after I closed and then the resolution dept more less threatened me to resign and close all over again and raised my payment because their mistake. I was also told if they would of caught their mistake before the first time I closed they could of juggled some numbers around and my payment would of been the same. That's crazy, how could they possibly do that but thats what I was told.", "rating": 1}, {"title": "My $ down at signing was 2k over what I…", "text": "My $ down at signing was 2k over what I was told it would be. Documents needed and constantly needing to produce more information. Mostly underwriter and misleading.", "rating": 1}, {"title": "Worst experience ever wouldn’t…", "text": "Worst experience ever wouldn’t recommend this company to anyone. Communication horrible don’t tell you about all the fees regret ever calling this company.", "rating": 1}, {"title": "The loan officer Rockey Gaizi is very…", "text": "The loan officer Rockey Gaizi is very good thought the process.The reason for my rating is I still can’t use my mobile app. This issue was first reported about a month ago and is still not resolved. I don’t have any update other than engineering team is looking into it. Whenever I ask for update/ETA they simply reply saying to continue use the computer site", "rating": 1}, {"title": "Estevan Ramirez was completely ill…", "text": "Estevan Ramirez was completely ill equipped to handle this process. He was condescending and pushy and had we not been in the bind we were in with the rates and the previous garbage treatment from this company we would have walked away from months ago.", "rating": 1}, {"title": "This was a horrible first time…", "text": "This was a horrible first time experience. Now that I know how these people operate, I will NEVER recommend them to anybody. The communication amongst the employees is horrible! They are very unprofessional. I didn’t like the back and forth that I had with everyone at that company. I’m surprised they are still in business. DO NOT RECOMMEND!", "rating": 1}, {"title": "A nightmare", "text": "Recent 2nd mortgage disbursement was really awful. Initially we were told that funds would be disbursed electronically to our creditors but at the end of the settlement proceeds were disbursed by AMROCK via checks and sent to our home address . It would have been easier to deposit funds into our account to make settlement a smooth transition. Now we are stuck with a disbursement check of $529 for which the debt was settled in full in 2022 and yet it was still showing as outstanding debt through Experian. We have lodged complaints and there doesn’t seem to be any response from Rocket nor AMROCK and still waiting for a resolution on this issue", "rating": 1}, {"title": "Felt rushed the entire time", "text": "Felt rushed the entire time. Got A LOT of texts from while working even after I told the loan officer several times that I was busy. Very stressful and aggravating process! If I ever decide to do this again, it WILL NOT be with this company. I was literally told the day before that papers HAD to be signed the next day!!! I travel for work and it was hard for me to take off of work with NO notice to get this done. When this was explained, I was told that if it wasn’t completed that day that we would have to re do everything! Very unprofessional!!", "rating": 1}, {"title": "Could they have sucked any more?", "text": "Overall - it was terrible! Our loan officer would go days without answering a call, they sent an appraiser out who supposedly couldn’t find comps for property and ravaged the value. Had to submit an appeal (and find comps for them which I did without even having access to an MLS). They over promised on time. It took them 48 days to close (I’ve seen primary mortgages close in less than 30!!!!) When it came to underwriting, asked for documents that had been sent a month plus earlier - zero review of documents. Have purchased several homes and refinanced several times, this was the worst and most disorganized process ever!!!!", "rating": 1}, {"title": "Added debt accounts Without consulting with me", "text": "Without consulting with me, they added the co-signers debt to my  debt Consolidation with payout loan. I didn't catch it at closing because I had several cards withe the same name \"Capital One\" . Will not refer Rocket Mortage to anyone!", "rating": 1}, {"title": "Rocket needs to improve immediately. Review your documents and look for errors.", "text": "I have used Rocket for a home loan three times.  Each time while the technology seems to be user friendly, it's only as good as the Rocket team members who process the electronic documents. Rocket blamed the title company,  title blamed Rocket for not being able to review the closing documents in a timely manner.  I found $1500 in cash errors made by Rocket.  I am now being sent a check from the title and a credit.  So frustrated with this closing, and had I had time to review I could have caught the errors sooner.  No one followed up with me, and I did request to speak with someone about the challenges from Rocket.", "rating": 1}, {"title": "I repeatedly told the loan banker and…", "text": "I repeatedly told the loan banker and loan processor that I wanted to put an additional $100,000 and that I wanted ALL funds from the sale of my other property applied to the new loan. Neither of these happened. As a result, I had to pay points on $340,000 rather than $190,000. They messed up the closing date, I told the reps multiple times that the closing data was moved up.  All I heard was multiple excuses on why this didn't happen.I've been a big fan or Rocket, mortgaged several properties, and sent numerous friends to Rocket for their mortgage needs.  Needless to say, I won't be sending Rocket any more business.", "rating": 1}, {"title": "O.M.G", "text": "Where do I start, I guess they are bound to drop the ball eventually. It just happened to be my ball. They have made my life hell, they took my mortgage twice in less than 10 days, Put it back in my bank only to take it again. They put me in an overdraft position twice. As of today 27th January 2024. I see they are attempting to take it a third time as its pending. I called them, they admitted they  made the initial mistake, but cannot help as the system is automated. My bank BMO are no help, as they say they cannot stop the request, it is up to Rocket Mortgage. I called again to day, but was told there is nothing they can do. WTH. What can I do.I am in the process now of seeking a new lender. CUSTOMER SERVICE IS TRULY APPALING.", "rating": 1}, {"title": "Communication", "text": "Communication, consistency, and lack thereof was the biggest problem. I will not use rocket again. I set up a home loan with Rocket, and after the initial consultation with my loan agent, an error was found on my loan. My loan agent submitted it for correction. It was never corrected. I attempted to set up a closing date, having received communication that everything was ready for closing and had been corrected. I was given a closing date, and ten minutes later received a call from another agent stating that I needed to set a closing. When I explained I had just set a closing date, they stated it wasn't recorded and I needed to set a closing date. I set a closing date again, within 10 minutes of setting the closing date the first time, with another member of the \"closing team.\" I then received calls from multiple different loan agents, none of whom had spoken to each other, demanding different items, all after which I had already set up a closing date. I started receiving back to back to back calls from different agents all through the day at a time when I was at work and could not answer. It was worse than dealing with robot calling scams. I was at work and could not answer the phone, so my closing was cancelled. Because of this and multiple other delays, where every time members of my \"closing team\" -- a different person each time, with a different requirement for closing each time, none of whom had spoken to each other, or who gave a consistent message -- continued to contradict each other, my loan was delayed by months, when that timeframe was harmful to my personal economic plan. Thankfully, I found the error on this loan that was supposed to have been fixed the first time, before actually closing the loan, and corrected it. The gentleman who closed the loan was kind and cordial, but when I had questions about some of the documentation, there were questions he wasn't allowed to answer per company policy. There should be no limitations on what questions can be asked about a loan from the notary. If they do not know, that is one thing, but to be directed from the company, not to explain certain aspects of the loan, is unacceptable. I will not be using this company again. After closing, the payments were sent quickly. The initial loan agent was a kind person. The notary who closed was a kind person. Those are truly the only positive notes I can place on this review. This was the worst experience I have had with a bank, loan company, or mortgage agency.", "rating": 1}, {"title": "I'm a realtor with Keller Williams", "text": "I'm a realtor with Keller Williams, 23 years in the business as a top producer, for some background. The contract was written on 12/2, Nate was on vacation so no one covered his business for a week, we had to extend closing twice. Loan commitment back in mid December was received. It's now 1/26/2024, and the loan died two days prior to closing. Third experience with ROCKET MORTGAGE that has fallen apart in the past 5 years. In a market where a preapproval is key to winning offers, buyers please listen to your agent and pick a local agent. This should not happen 7 weeks in when a lender can close a loan in 2-3 weeks easily.", "rating": 1}, {"title": "My experience with Rocket Mortgage", "text": "I  had an existing 15yr house loan with Rocket.I contacted Rocket to see if I could get a homeequity loan to pay off 50k of credit card debt.I spoke with Justin Noone about the possibility.He suggested to me to apply for a 30yr refinanceloan. I told him from the start I didn't know what my house would be appraised at. I told him theappraisal would depend on IF the appraiser separated the two lots. One lot my house sitson. The lot beside me is a separate deeded lotthat I bought and payed 40k for it. I told him thiscause I needed a high enough appraisal to getthe 50k I needed to pay my credit card debt.He said \"no problem\" just mention that to theappraiser. So we made a deal for me to get45k and another 7k at closing. then it wentthru the loan process. When the appraiser cameto appraise my house I told him Twice how mylots are deeded separately,the extra lot I paid40k for. The appraiser said Nothing Both timesdidn't even write anything down. So when theappraisal came back it was Too low to pay theAgreed amount I Needed. So the best Justinwould do is to offer me a 20yr refinance loangive me 37k and 1400 ( 2pmts I don't make).I was Not Happy at all with the experienceI was Not able to pay off my credit card debt.I am Not going to argue about it! That's how itwent. Also I had great difficulty contactingJustin. More than once he said he would callme back later,Didn't. One time I was connected toan older man and complained about my exp.He said to me \" that's not acceptable\" he showed lots of disrespect to  me.. then hung up on me.That  was  My experience with Rocket Loans.", "rating": 1}, {"title": "there are many reasons that I cannot…", "text": "there are many reasons that I cannot recommend Rocket Mortgage.quotes on closing costs kept changing until hours just before the closing is #1.your 'underwriting team'  is absurd with inappropriate questions. not really worth my time to review. I will not recommend  you to anyone.in this case the seller was the City of Hagerstown. repeated questioning about the Mayor's signature was absured. then all of a sudden after weeks you dropped that request. many many reasons to avoid Rocket Mortgage.  first closing cost quote $9,000 less than final amount. on a $147,000 mortgage?", "rating": 1}, {"title": "You failed to send the necessary…", "text": "You failed to send the necessary paperwork to closing and had to reschedule closing a week later to resign ALL documents. This caused a delay in receiving funds and missed payment deadlines to contractor. I will NEVER use Rocket Mortgage again.", "rating": 1}, {"title": "Terrible communication …", "text": "Terrible communication at the beginning and when we locked", "rating": 1}, {"title": "This was my first time refinance and I…", "text": "This was my first time refinance and I asked a lot of questions. Some questions multiple times so I can make the right decision for myself. The main question I asked was how much would this cost me, if I don't have to make my mortgage payment for the month of January if we sign this and when I would roughly get the $2,000 dollars after signing it. Now here's what Happened. I ended up paying around 1400.00 for closing cost, then immediately had to pay my mortgage payment after I was told I wouldn't have to make that payment which now has me down over 2800.00. followed up with no sign of the supposed 2k I was gonna get. This was a horrible experience which has put me way to behind. I'll recover but first chance I get ill refinance with someone else I'm sorry. I felt misled I know I was lied to and for what? Removing 3 years off when I'll pay off the house?", "rating": 1}, {"title": "Constantly changing refi values", "text": "It seems like every other day the values shown in our refinance would change.  Then we get to our closing and the final numbers, specifically the cash we were supposed to receive, dropped considerably.  From about $15000 to a hair under $2000.  No explanation was given for the change and attempts to contact Rocket Mortgage have gone unanswered.  We signed the papers because we found out about the change during our closing appointment.  We were worried we would miss out on the refi entirely, so we signed anyway.  Initially we were very happy with Rocket Mortgage but in the end it feels like they have our money and now want nothing to do with us.  I'm not sure if I'll go with them again on future home purchases.", "rating": 1}, {"title": "Poor communication", "text": "Poor communication, poor follow up. Did not listen to my requests on amount or date needed. Bad experience. Will not recommend to anyone or ever use Rocket mortgage again!!", "rating": 1}, {"title": "We told you we do not want to do…", "text": "We told you we do not want to do anything on line...you keep insisting we do all on line---my husband is very anti tech.  Please just call or send me correspondence through the mail.  I would like to have the insurance quote but none will send it in the mail.", "rating": 1}, {"title": "You have unlicensed insurance agents on…", "text": "You have unlicensed insurance agents on your insurance team who cannot read policies and it caused me a lot of problems. You started asking me about the flood insurance before I even own this. if they can’t read the policy, how can they determine that I don’t have enough coverage? It’s silly I don’t know if you’ve trained those people I don’t think so. I’ve been sitting here trying to figure out why this is been going on for six months and I finally figured out to call and find out if these aren’t licensed agents, they don’t know how to read the policy.", "rating": 1}, {"title": "Everything wrong", "text": "Date of experience: January 16, 2024", "rating": 1}, {"title": "The closing team botched it up", "text": "The closing team botched it up. Crapped their pants and left me with mess.Will not recommend this company.Will refi when eligible.", "rating": 1}, {"title": "2 payoff payments weren't paid and no…", "text": "2 payoff payments weren't paid and no one explained why!", "rating": 1}, {"title": "You need to be more transparent about…", "text": "You need to be more transparent about your costs. Labeling a customer's earnest money a credit is shady and unethical in any industry.", "rating": 1}, {"title": "They suck and were no help", "text": "They suck and were no help. Worst experience getting a loan I have ever had.", "rating": 1}, {"title": "Do not recommend!", "text": "Did not enjoy my re-fi process with the rocket mortgage team. What was originally discussed is NOT what the outcome ended up being. I even called to let them know I was dissatisfied with my loan estimate numbers, they reassured me the final mortgage payment and cash out payments would be what was originally discussed, then continued on as if I had never spoken with them and changed exactly NOTHING. Also, the closing process was very unorganized. They rescheduled my closing 3 times in one day and then mailed me all of the payoff checks so I had to spend the better part of an afternoon printing, compiling, and mailing everything myself when this is something that should have been done by them.They are relying too heavily on their software and not interacting or communicating with customers. Once you get past the original loan officer you are cast into a nameless/faceless system where no one calls you to give you updates or to communicate issues. In summary, my issues are as follows 1) monthly payment was higher than what was promised, 2) cash out was less than what was promised, 3) very poor communication, 4) unorganized/inconvenient closing process. Needless to say I will NOT be using them again in the future and look forward to moving my loan somewhere else once it matures.", "rating": 1}, {"title": "Absolutely terrible experience with…", "text": "Absolutely terrible experience with refinancing. Lack of knowledge on required divorce forms and lack of communication was terrible.", "rating": 1}, {"title": "I was told one interest rate when I got…", "text": "I was told one interest rate when I got to paperwork it had a different interest rate on it Which was higher and I was lied too The whole process..", "rating": 1}, {"title": "Horrible Experince", "text": "We were told that our interest rate will be adjusted on the closing date and it was not true. Huge disappointment and its of great regret doing business with Rocket Mortgage. Also we were not informed that we were buying points. Since we were closing in a matter of days, we didn't have time to start the process again. Time was of the essence, if not we would have gone with USAA or VA loans. The worst!", "rating": 1}, {"title": "We will never do it online again", "text": "We will never do it online again! Person to person only!", "rating": 1}, {"title": "super slow and unorganized and my rate…", "text": "super slow and unorganized and my rate kept raising as it took longer than a month.  Asking for so much info for a second mortgage even when you guys are my first mortgage..Seems like a easy stream line situation but it was a huge mess .", "rating": 1}, {"title": "Rocket failed to close on time causing…", "text": "Rocket failed to close on time causing me to pay an extra $5000. in moving vans, hotel and restaurants.", "rating": 1}, {"title": "I feel I was lied to in order to leave…", "text": "I feel I was lied to in order to leave the other lender. This is the second time I’ve used rocket mortgage. I’m very confused to how this company plans on growing. Due to the experience I had, the lies I was told, I’ll refinance with another bank. This will pull roughly 200k away from you. All because of customer service. Mind boggling. I’ve already been in contact with customer relations. What I was told is basically,”sorry. What you were told can’t happen. It’s not our fault. It is what it is.” I will agree with the “it is what it is”. However, I control how much money you receive. You got me for roughly 800-1000, I’ll make sure you don’t receive much more.", "rating": 1}, {"title": "Rocket mortgage totally dropped the ball!!", "text": "The e sign docs weren't emailed right. took 2 extra days to fix it. Which made us late for closing on the 27th. of Dec. We had to get an extension. Then took another 2 days of no communication to find out they still needed my husbands work info. If I hadn't called numerous times it still wouldn't be done. We were suppose to close on the 8th of January. But the money didn't come in till the 9th. If I wouldn't have called at least 3-4 times a week. I would still be waiting. So fed up with this company right now. I wouldn't recommend you to anyone.", "rating": 1}, {"title": "Due to multiple delays on your part it…The closing Mess", "text": "Due to multiple delays on your part it cost me more money to close my new loan.A company I owned money too was paid prior to the loan closing which cost me more money. 1. loan officer did a good job2. the closing depart needs to improve the process for closing, (I did 2 singings?) because it was a mess and a delay on closing it cost me.Thank YouI do not plan on using your company in the future.", "rating": 1}, {"title": "Worst loan experience ever", "text": "Date of experience: January 11, 2024", "rating": 1}, {"title": "poor", "text": "The whole process felt like I was never in the complete know of what was going to be asked for next. I would have to upload the same document 3-4 times, and although the guidance was there with one of the people I worked with, I feel like they are not coordinated as a team. To be completely honest I would never recommend rocket to anyone and won’t be using them when I refinance.", "rating": 1}, {"title": "My closing came and went- the funds…", "text": "My closing came and went- the funds dispersement company called me to confirm my bank account info, was told everything was good to go. Four days later still no funds dispersement.  Come to find out they found out there was a delay with a payoff amount and chose not to tell me in an attempt to handle ‘in house’ we are now looking at 2-3 weeks to dispersement post closing day.", "rating": 1}, {"title": "My suggestion is even when the interest…", "text": "My suggestion is even when the interest rates are locked in and a lower rate is offered with your own company you honor the lowest rate. This will lead to more referrals for new customers instead of getting bad reviews and no references/referrals for new customers.", "rating": 1}, {"title": "Closing was postponed 4 times", "text": "Closing was postponed 4 times, due to grammatical errors on the part of Rocket, and notary staff sick or unavailable. Credit cards that were to be paid off were not included at closing.", "rating": 1}, {"title": "I got multiple calls from multiple…", "text": "I got multiple calls from multiple people at rocket throughout the day to ask me the same questions bc they didn’t communicate with each other , the title company or the realtors. It was very frustrating to be bothered all day bc the rocket mortgage people couldn’t communicate properly. They also failed to provide proper estimates and about 12 hours before closing I had to come up with $2700.T", "rating": 1}, {"title": "My initial loan officer just kept…", "text": "My initial loan officer just kept spouting off wrong information that I would later have to find out was incorrect through my own research. And all cost estimate at every step of the process were wildly off base. I understand some variance in costs and budgets, but when the initial budget I was given was about $40,000 dollars off of the final approval, I don't have much faith in who I'm working with. Or estimates of final cash to close being 26% higher than the actual cost. And various other issues during the process.I understand that there is state-by-state variance, but in my field, if I were to be spouting off completely unfounded advice and protocols to someone in another state as flippantly as he did, I'd be buried in lawsuits right now. Literally the only reason that I stuck with Rocket is that this was the only company that was willing to work through the unusual coding for my pay differentials and guaranteed overtime added.", "rating": 1}, {"title": "Whatever could go wrong", "text": "Whatever could go wrong, went wrong. Will never, ever use Rocket Mortgage", "rating": 1}, {"title": "Dissapointing experience", "text": "Hard to get to our rep. He wasn't available.Did not verify account payoffs, so payoff checks were over amount owed.With the amount we were charged, checks should have been mailed to creditors, especially since you don't send out hard copies of documents.", "rating": 1}, {"title": "Cost of loan to much", "text": "Date of experience: December 31, 2023", "rating": 1}, {"title": "Worst experience I've had with a mortgage company", "text": "Worst experience of a refinance, mortgage or second mortgage I've ever experienced. Definitely wouldn't recommend Rocket Mortgage.", "rating": 1}, {"title": "Bad Customer service", "text": "Closed Dec23 23. Still waiting for funds10 days later. Bad business for a well advertised company.", "rating": 1}, {"title": "THE BEAST", "text": "Nothing went wrong everything went right. I m very very happy with my new house that I have made my home. I want to THANK Anthony Eovaldi & his Team.I give u a five star rating.   I wud give u all the stars.", "rating": 1}, {"title": "Slow,slow,slow,slow!!", "text": "Slow,slow,slow,slow!!! Rocket ! No. Way, Won't patronize again.", "rating": 1}, {"title": "left hand didnt know what the right…", "text": "left hand didnt know what the right hand was doing  and a problem with INc.. the lady didnot keep up with what was going on", "rating": 1}, {"title": "I have used rocket mortgage several…", "text": "I have used rocket mortgage several times but recently they sold my mortgage loan to a flagstar Bank which is horrible. I never had any trouble with rocket mortgage. I will never use them again after having experienced them selling my loan to Flagstar.", "rating": 1}, {"title": "No one will listen to this review.", "text": "Date of experience: December 26, 2023", "rating": 1}, {"title": "Worst closing experience ever.", "text": "Could never get any of the information right, had to submit information multiple times, took too long, held up closing over a $50 window (even though we weren't purchasing or selling the home), changed our rate even after a 'rate lock', and none of the checks we received to pay off our debts were for the correct amount (and not just small differences explained by interest, but large amounts, like thousands of dollars off) and several of them had the wrong account owner listed on the check (my name was on every check even though some of the accounts being paid off were my wife's accounts and her name should have been on their, not mine).", "rating": 1}, {"title": "The underwriting team was incompetent", "text": "The underwriting team was incompetent. They frustrated our title/attorney team with duplicative requests, the frustrated me as the client with their inability to communicate and get documentation correct. I had used rocket mortgage for my first purchase and refinance prior to this but will never use this lender again.", "rating": 1}, {"title": "Shady. 0/10 do not recommend.", "text": "They waived inspection. Then a week before close they decided they wanted the electrical to an unattached shop fixed. A shop! This means I didn't get to review the closing documents until less than 12 hrs before close. I saw that they made me pay points, which I did not agree to do per previous discussions. I found this during close. I made at least a dozen calls to Rocket Mortgage and nobody would help me. The points cost me almost $9000! But I had to sign the papers or risk losing the house. Shady business tactics. I can't wait to refinance and not pay my hard earned money to this company again.", "rating": 1}, {"title": "Very Disappointed", "text": "My name is Leonard Moore. I am very disappointed with my loan because two of my bills was not paid   home depo and Sam's Club. But I still have the same payment at closing, which was on Dec 16, 2023. My payment stayed the same as it was estimated on Dec 7, 2023, when Home Depo and Sam's Club was two of the bills to be paid. My payment did not decrease I was told the checks would be sent over night. But I received the checks after I closed so I did not know the two bills was not paid. I talked to someone, and I was told it's too late to complain. Because I have already closed and around 2000 was added to my loan and home depo and Sam's Club was not paid. God knows this is not right My complaint is why was the two bills not paid. There was enough to pay them. Why?? Again 2000 has been added to my loan and my payment is the same as it was Estimated on Dec 7 when the two bills were to be paid. Very disappointed. Leonard Moore1204 Winding Hart DrIndianapolis Indiana 46229", "rating": 1}, {"title": "Did not receive my closing statement…", "text": "Did not receive my closing statement until THE DAY OF CLOSING!!", "rating": 1}, {"title": "An experience that I do not care to repeat", "text": "An experience that I do not care to repeat ever again!! It appeared to me that there was no communication between the people who were handling the loan process...very disorganized and very difficult for me as a customer. I would not recommend it to anyone!!!!!! Lesson learned!!!!", "rating": 1}, {"title": "Stop asking me to review you!", "text": "I rated you two stars when you first asked me to fill out a survey on 12/25/23, Christmas day. Since you are bugging me again for the same reason, you've lowered my satisfaction to one star.", "rating": 1}, {"title": "Terrible mortgage experience", "text": "The person handling the mortgage, Josh, constantly bothered us to lock in our interest rate even though we told him we were watching it and would do it closer to our closing date. Also wanted us to sign closing papers  with incorrect figures saying they would be corrected later. We didn't feel comfortable doing that and then he said it would delay our closing unless we signed. Very unprofessional  behavior.", "rating": 1}, {"title": "Horrendous experience - Mortgage for new purchase", "text": "We have used Rocket Mortgage for our last 2 or 3 mortgages and the experience has always been wonderful.  This time was horrible.  It was the most confusing and aggrevating transaction ever!  We were down to the wire and told to sign off on paperwork that was inaccurate but not to worry because the final numbers would be correct.  When I said I wasn't comfortable signing off on incorrect numbers I was told it would delay closing if i didn't.  I was constantly bothered about locking in interest rates when rates were clearly coming down and I told Josh I didn't want to lock in until the last minute.  The untrained people who seemingly couldn't handle a remote closing with a power of attorney at an attorney's office and again no help from  Josh.  The ultimate was when Josh called 10 days after our closing to see how things went.  A little late by then! This whole thing was like dealing with a used car salesman - and his untrained team throughout.  Never again will I use Rocket.  I fully intend to re-fi in 2024 when the interest rates are lower and will go anywhere other than Rocket.", "rating": 1}, {"title": "my loan officer was not transparent…", "text": "my loan officer was not transparent with me. She was quick to get me off the phone. I would’ve preferred speaking to someone else and or speaking with a person instead of receiving updates via text. There was no follow up. Not even with my closing. I felt this was too automated for me and I did not appreciate how the loan officer treated me.", "rating": 1}, {"title": "Called to ask a question and no one…", "text": "Called to ask a question and no one knows what’s going on I was transferred to 4 different people", "rating": 1}, {"title": "No communication skills", "text": "No communication skills. Worse experience of my life! Made me literally sick!", "rating": 1}, {"title": "This was the worst experience I’ve ever…", "text": "This was the worst experience I’ve ever had in financing a home. Rocket Mortgage knew the closing date and were so slow we missed the closing date and extended it by 1 day, then the next closing date was missed and we had to schedule a third closing date. The seller almost cancelled the deal and took my earnest money had it not been for my realtor and additional earnest money. Rocket Mortgage are the worst and nothing like they represent on TV. Stick with your local lenders.", "rating": 1}, {"title": "Communication wasn’t good.", "text": "Communication wasn’t good.We feel as if we were not told in a timely manner that we’d only get 1/2 the cash we asked for. And i question our loan officer many times about it. Escrow- also didn’t get what we were told. I don’t want to waste any more energy on this cause I wrote my review already. It is what it is!", "rating": 1}, {"title": "If I could give a negative 5 that would…", "text": "If I could give a negative 5 that would be my score. For a company that prides it self in communication this certainly is no longer your strong suit. I requested a phone call or text message if anything was needed more often than not I got an email. I explained to my banker I often don’t look at my email but once a week. Although he said he would be willing to communicate with text or phone I often received an email and I didn’t get notification but my husband did. I found this very frustrating. Next, your fees were a moving target.  These changed I believe 5x during our two month long very frustrating process with your company. I did understand that the fee would go up when the mortgage went up so the initial fee and one change I expected.  Our appraisal came back for more, congrats to us but then all of a sudden without notice your team tried to add an additional adjoining parcel to the mortgage even though it wasn’t part of the original deal. I call this very SNEAKY and you have bad practices. The banker said oh well we included it just incase you wanted us to include. Seriously who would leverage more than what is needed.  Loss of documentation and multiple people calling for the same items. I received a complaint from my land contract holder in which they informed me of the information sent over what day they sent it and it got lost with your title company after receiving a verbal communication saying they received it. Process was not at all smooth with the title company.. I had a land contract this land contract was between the land holder and my husband and I. For some reason the title company continued to ask for paperwork on my husband company so they could prepare a deed to move title from our company to us personally. NO WHERE WAS THIS A THING but just stopped our progress. I spoke at least three times with your banker Sean saying this item shouldn’t be part of this deal. My husband is a sole proprietor of a business, and we never have put land in his businesses name.  Therefore no deed should be required this wasted our time. On the day closing, the fees were increased again and at that point, I was on vacation and if it did not close on that particular day, my intention was to start the process over again with another company as not one person that I dealt with really knew what was going on. Your employees are not educated in title, customer service, and clarity.   After losing a whole day of my vacation, I think we finally closed by 8 o’clock that evening wasting a whole day that I paid to be with my family and I was stuck in a room fighting with your uploading technology, getting the proper fees and overall complete chaos on your part. I will never refer anyone to your mortgage company.  I have been a previous customer and your customer service at that time was wonderful. You certainly have gone down as a company.", "rating": 1}, {"title": "Lack of trust and communication", "text": "Our lending officer lacked in his communication and was not very helpful. It was my first time buying a home so I was not aware of certain terms and procedures and he seemed to have a limited knowledge himself. At moments it felt like the blind leading the blind. In the end my biggest complaint was he did not listen to what I wanted and I felt pressured to close with a loan that I was not completely happy with. I had explained how I was not interested in buying down the interest rate as I was planning on paying the mortgage back within 5 years. He proceeded to use our “discount” for using a Rocket Mortgage realtor towards buying points to lower our interest rate after I specifically said I wasn’t interested in doing that. The interest rate was still at market avg and it felt like any discount we would’ve gotten was wasted. We only found this out at closing and at that point we were ready to close and moved forward with this as we didn’t want to go through the underwriting process again.", "rating": 1}, {"title": "Not only does Rocket Mortgage call you…", "text": "Not only does Rocket Mortgage call you 1 million times and send you 1000 emails and regular mail but they choose to do what they wish with your account so when you refinance and say I’m wanting to pay off credit card debt and they choose what credit card debt you get to pay off And then they choose to add in a collection that is no void and then you end up with $1000 laying out there that you cannot get back. This is how they do their business makes you wonder if they’re in cahoots with some of these companies. Needless to say I will never ever use rocket again and I will make sure that everyone I know and see and talk to knows that Rocket Mortgage sucks .", "rating": 1}, {"title": "I recently did a Refi with Rocket…", "text": "I recently did a Refi with Rocket Mortgage. I put up my $800,000 home as collatoral for a 140,000 mortgage.I had a personal loan for $4,200 and a credit card balance of $2,800 to be paid from the proceeds.I paid both of these in full the following day,because nobody told me not to.The problem i have is that Rocket Mortgage then got into my American Express GOLD account that I have had for 44 Years with 0 late charges and tried to pay  my $670 balance that I had already paid.I set this account up[ in 1979 to be paid in full every month.I have some revolving streaming accounts that are paid from this account monthly. Before Rocket would reimburse me for the $670.00 They demanded to see a statement with a 0 Balance.Because of these small revolving amounts monthly it is very difficult to have a 0 balance on this account.This account should have never been included in the deal in the first place.I have felt harrased about this issue and there was no need for any of it.", "rating": 1}, {"title": "I was offered to refinance with a cash…", "text": "I was offered to refinance with a cash out in November. It has been a living nightmare! It started going from a conventional to an FHA which put me through hell with septic to well measurements, water testing and so forth. Then it was turned from FHA back to conventional and we finally closed. Anticipated dispersal of our funds was supposed to be December 20 until I learned that our loan is in audit! After this ordeal I am very nervous about refinancing again. Now it's 6 days after funds were supposed to be dispersed and still no funds!", "rating": 1}, {"title": "Musical chairs contacts", "text": "Musical chairs contacts, zero thought given to customer experience, multiple last minute fire drills, rudeness, to name a few. I had a good experience years ago, this will be our last.", "rating": 1}, {"title": "Promises of NO PMI and low down payment…", "text": "Promises of NO PMI and low down payment were made and supposedly verified so I went with Rocket despite always using Chase which is fantastic. Then, 6 days before my closing when I had NO TIME to change or do anything about it those promises were all broke and I was also told I couldn’t buy under a trust as I had said I wanted from the beginning. The whole process felt like lies and entrapment! I can’t wait to refi with another company. I will NEVER use Rocket again!", "rating": 1}, {"title": "funding fiasco", "text": "AMROC issued creditor chec 12/13/23 . I received check 12/14 Sent the check UPS express to  Capital  one. Checked my  capitaal one account on 12/22. The balance did not reflect receipt of the check . Called Amroc  on 12/22  to ask if they show the check cashed the y said no . I asked if they could cancell the check and issue a wire to my checking accpount so I could pay Capital one directly . They said I would have to wait three weeks from 12/22 before I can follow up again. At that point I will owe capital a months intersest on a $2,785.00 credit card balance that could have been paid if handled differently . Not Happy", "rating": 1}]