[{"title": "Great customer service ", "text": "I had a Great experience,Great customer service and friendly…Very easy to communicate withGreat customer service and friendly professional staff. Opening a new account was painless.", "rating": 1}, {"title": "They suck the jasper branch committed…", "text": "They suck the jasper branch committed fraud by lying and stating that someone made an overdraft purchase that never happened then after asking for the statement they give me a fake merchant with no address and a scam phone number. This bank gets a zero rating ", "rating": 1}, {"title": "The important of credit union is to let you clients feel welcomed and appreciated,which that is very good and I love credit union because they have that kind of service we are looking for", "text": "For me the only thing I think about this company is the upgrade with master card etc,but otherwise they are a very good company and I do love it.", "rating": 1}, {"title": "Weaponized against ordinary hard…", "text": "Weaponized against ordinary hard working middle class folks trying to survive under this tyrannical government. DuGood will NOT make simple, small loans unless you can prove you are paying Federal, State and local taxes. Since when has the Banks become extensions of the IRS?", "rating": 1}, {"title": "If I could leave 0 stars", "text": "If I could leave 0 stars, I would.  The loan department totally dropped the ball. The girl that was handling our loan, was very condescending, incompetent,and was of no help at all.  I had a pre approval and still sat in the bank ALL day long.  I ending up taking a loan out at the other bank.I have spoken to my local branch manager concerning this.  She said someone would be calling myself or my husband to discuss this, and we still have t heard anything.", "rating": 1}, {"title": "I own 1 arce of land on Toledo Bend…", "text": "I own 1 arce of land on Toledo Bend lake with a nice 3 BD, 2 Bath house. It has a nice boat house, and big pier going out into the water. The property has a full drive-thru driveway with 12x33 new shop. I owe less than 100k on 375K valued property. I needed to REFI from the owner financing due to a higher interest rate. DuGood denied it twice in two yrs. without proving any reason other than my business is an LLC and have a CPA Local firm that does it. All Fed. Tax return up to date. But the underwriter at DuGood stated, if I could not prove I was actively paying Federal Taxes they would not do the REFI!! Again, since when has my local Credit union become an extension of the IRS?? Banks a few years ago weren't WEAPONIZED as they seem to be in today's environment!! It's not only DuGood FCU, it's ALL of banking!", "rating": 1}, {"title": "I don't interesting", "text": "I don't interesting ", "rating": 1}, {"title": "People have to know  that you what you…", "text": "People have to know  that you what you can be helpful  though everything improve and show ", "rating": 1}, {"title": "Credit card", "text": "Credit card please I'm Adleradlervoltaire1gmail.comThanks send me credit card please ", "rating": 1}, {"title": "Nice and easy", "text": "Nice and easy ", "rating": 1}, {"title": "You've got to be kidding me!!!", "text": "You've got to be kidding me!!!! $10.00 to get a replacement debit card to access my own money???? WOW!!!! I don't think so.It's silly, stupid reasons like this that I will change from one Financial Institution to another. Ironically, we had just opened another account at DuGood to eventually switch from another Credit Union. But that decision is now being heavily reconsidered.NOT good customer service!!!", "rating": 1}, {"title": "Good bank account", "text": "Good bank account ", "rating": 1}, {"title": "Port Neches location", "text": "my experience at the Port Neches location is usually bad. Especially when I go through the drive through. When I am making a withdrawal I am never asked how want my cash to be returned back to me and there have been several instances when an employee has given me the incorrect amount. The customer service I have received at that location is usually not that good either.", "rating": 1}, {"title": "Unreasonable conditions to cash a third …", "text": "Unreasonable conditions to cash a third party check! If the checks were not valid( and I assure you they are) the only person to suffer any consequence would be me. All over a $60 and $150 checks totaling $210. I have enough money in checking and savings to cover. Unacceptable and I consider unreasonable.... no matter the rules. I left a big bank to try and have a more personal relationship with a credit union. Rethinking my choices.", "rating": 1}, {"title": "I have not had a feeling g of \"personal …", "text": "I have not had a feeling g of \"personal banker\" in 6 years, or since Letetia Armstrong left. The past 5 or 6 items I have called or went buy to request financing I am treated like someone off the street on their first trip in the door instead of like a 20 plus year member. Getting a loan for my wife's replacement car this week was the final time I will ever attempt a financing at Dugood. Mobil oil FCU now has my business. Allen Atwood", "rating": 1}, {"title": "Not happy with DuGood Credit Union", "text": "Even though my ex and I divorced and he was responsible for one vehicle and I was responsible for the other, the Credit Union personnel would not allow me to remove my name from his vehicle. And...since he has failed to pay for HIS vehicle in a timely manner, MY credit score has dropped about 200 points!!!", "rating": 1}, {"title": "Deposited wrong amount to checking and savings accounts", "text": "I opened a new account on 9/1/18 and they messed up the very first deposit I made. They deposited the wrong amount to both the checking and savings accounts. Not a good way to start off a banking relationship. I am very skeptical about keeping money at this credit union. Especially large amounts of money.Update: (6 weeks later on 10/26/18)Customer service means everything. How a business treats their customers says a lot about them. Dugood is the worst credit union in Southeast Texas. I wish I could give them 0 stars!", "rating": 1}, {"title": "I put in over $8,000 and now I am told…", "text": "I put in over $8,000 and now I am told I have to wait 9 days before I can use it.  What is the point of putting in money and not being able to use it.  The money was in the form of a Certified Check for my bank.  This is stupid.  It doesn't take that long to verify with my bank.", "rating": 1}, {"title": "ATM never works", "text": "ATM never works! The app updates account to slow.  I can walk up to the teller not show any identification and withdraw money from my account as long as I know my last name. You show try to be more proactive rather than reactive. I am will probably be moving banks unless something changes soon.", "rating": 1}, {"title": "Think twice before you do an auto loan with DuGood", "text": "If you are thinking about an auto loan with DuGood Lumberton, TX you should think twice. Getting them to endorse an insurance check is difficult at best. We Paid for repairs out of pocket. Took the insurance check to them and they needed a receipt as proof before they would endorse. Went back with receipt and now they want each of us to endorse before they will endorse. Why didn't they tell me that on the first visit. Now I get to drive an hour and a half again for a third visit. At this point I feel like they are holding our insurance money hostage.", "rating": 1}, {"title": "poor service", "text": "Date of experience: April 22, 2024", "rating": 1}, {"title": "Bad service", "text": "Date of experience: April 02, 2024", "rating": 1}, {"title": "No one available at the bank who vould …", "text": "No one available at the bank who vould postpone payment after a national disaster.  Pulled my car payment out when I still couldn't get my paycheck from work due to flooding.  Then never returned my call when i tried to talk to them about it", "rating": 1}, {"title": "Dupont= no customer fraud protection", "text": "Hope you never lose your debit card. I dropped mine and everywhere that someone used my card the credit union charged me 25 dollars to investigate. In my case it was 8 different places! That’s the money the thieves got from me plus an extra 200 from the credit union. It took almost 90 days to get my money back! I filed a police report and everything but it did not make the process any faster. I now use Mobil Oil Federal Credit Union and had something similar happen and got my money back within two days. The response that the bank gave was not true it was much more than three days of returning my money. What a slap in the face!! Credit Union trying to save face", "rating": 1}, {"title": "They messed up my account I asked him…", "text": "They messed up my account I asked him not to pay someone they paid him anyway I only received 385 in that account and they let someone take almost $500 out of my account and I just think it's ridiculous now I'm in the negative account and can't do no one account that I really wanted not fair to me. I know nobody cares cuz I've been finding a long time so I just gave up that's why my account is in the negative how do you pay a bill that's more than the money that I received I don't even have those people service and then I told him that. They pay them anyway so that's why the count look like that and I don't care because I'm mad", "rating": 1}, {"title": "Too much bad service.", "text": "Date of experience: June 11, 2024", "rating": 1}, {"title": "Thieves", "text": "Thieves that stole over $2000 of personal property from my van that they repossessed from me. They will not let me retrieve it. See you in court. Sabrina Cole smells", "rating": 1}, {"title": "Hard to obtain any help from any free…", "text": "Hard to obtain any help from any free person.  Misrepresented terms of account.  No manager present nor attempted to intervene.", "rating": 1}, {"title": "will soon be getting out after +25…", "text": "will soon be getting out after +25 years of being at that bank always want giv you any help when needed.", "rating": 1}, {"title": "I am a very good man", "text": "Date of experience: November 15, 2023", "rating": 1}, {"title": "they did not put any pressure on me to…", "text": "they did not put any pressure on me to make a decision to purchase a car", "rating": 1}, {"title": "My name is Getu", "text": "My name is Getu ", "rating": 1}, {"title": "Average", "text": "The tellers are great, the CEO Jada needs to go, time for a new CEO.", "rating": 1}, {"title": "Very good easy to use", "text": "Very good easy to use ", "rating": 1}, {"title": "Everything was good I enjoyed the bank…", "text": "Everything was good I enjoyed the bank they was very pilit", "rating": 1}, {"title": "tellers are very knowledgeable of…", "text": "tellers are very knowledgeable of different transactions", "rating": 1}, {"title": "The best service ever and great people…", "text": "The best service ever and great people to work with", "rating": 1}, {"title": "Nope ", "text": "Everything ", "rating": 1}, {"title": "Do Better", "text": "Baby, bye, bye, bye!", "rating": 1}, {"title": "Excellent service", "text": "Date of experience: September 15, 2019", "rating": 1}]