[{"title": "Don't be fooled", "text": "Don't be fooled, USA Today is a sham. Not all veterans are treated equally with this organization. As a 39 year retired veteran with excellent credit rating and financially sound, USA Today were unwilling to consider our request even though they say they have authority from VA to approve loans.", "rating": 1}, {"title": "1st off I am not mad", "text": "1st off I am not mad, just very disappointed. I as a disabled veteran (Navy) have seen for years commercials for NewDay and had been excited to use a veteran oriented firm. I speak only for myself, but am sure thousands of veterans feel the same. Some of us can't afford a big luxurious home all we can manage is a nice pricey manufactured home. After credit checks and phone calls, they stopped calling. Figuring they are working on my inquiry,I wait.  Still no phone call, I tried to call to find out what was going on. I finally got an answer....... they don't work with veterans in manufactured homes. So much for the Admiral wanting to wrap his arms around every vet, he just threw me to the ground. NewDay USA you need to adjust your advertising so you don't get everyone excited to use your service. ", "rating": 1}, {"title": "Inefficient & unorganized. ", "text": "During the whole process the underwriter kept moving the goal posts even after they issued the cash buyer certificate.  I didn't get the last of the paperwork literally until the morning of closing. Then they sold my loan before the first payment to a company that uses an Indian call center. I will NEVER use Newday again.", "rating": 1}, {"title": "This VA lender is absolutely horrible", "text": "This VA lender is absolutely horrible!  I had a Heart attack with emergency surgery.  After I was released from the hospital, I called and requested assistance/forbearance in my payment.  They said I need to complete the package which I did.  They then deleted the application, and I had to resubmit it.  Once they approved the second submittal, they sold my loan to another mortgage company who began demanding payment.  They claim to care about veterans by they don’t.  They gaslight customers and just want you to refinance and pull the cash out not for you but for them to line their pockets with the interest.  Avoid NEW DAY USA at all costs.Still No call!! The Admiral is a disgrace to our veterans and Naval Service.  What a nasty vile company.  Avoid this predator at all costs.  Updated 9/11/24.  ", "rating": 1}, {"title": "Very disappointed in the process.", "text": "Very disappointed in the process.Terry. W. Burt", "rating": 1}, {"title": "Horrible experience. ", "text": "My closing was scheduled for Monday morning at 8am. I get a call at 6pm on Friday from Andrew Nelson stating that the money we are getting from the sale of our house is not enough to cover the cost of the debts that New Day wanted us to pay off. So I needed to find almost $11,000 dollars!! Last minute! And all Andrew had to say was that he was sorry and it’s not New Day’s fault. And hopefully it will get sorted out on Monday. This is totally unacceptable that this was not takin into consideration before the closing disclosure was sent out. Then New Day did not put the termite inspection report that I had to sign in the closing documents and wouldn’t close the sale of the house until I had signed it in front of a notary and overnighted the paper. Again, unacceptable. I was able to sign the report and have it email. However the fact that this even happened was unacceptable. After all is said and done I will NOT be using New Day or recommending them to anyone in the future. ", "rating": 1}, {"title": "After being with New day", "text": "After being with New day, USA for a few years, they decided to not let me have access to my account because my husband is a primary if he dies I guess it just doesn’t get paid. I’ve talk to Christian twice and he refuses to give me access says that he needs my husband to call in why? when I’m on the account I have no idea so we’re gonna move our mortgage to somebody else that’s willing to work with me and my husband..", "rating": 1}, {"title": "I filled out a questionnaire on the…", "text": "I filled out a questionnaire on the website.  Within minutes I received phone calls.  At the same time I began getting spam emails.  A lot of them not involving loans.  Then I received a text which I did not answer.  After three days, I responded to an email which the questions about the process and fees were asked.  No answer via email.  Still getting phone calls and spam.Something doesn't fit right as well as the repetitive commercials where she says the exact same things but in different settings.  There are never true testimonials from real people on the commercials.", "rating": 1}, {"title": "Well I refinanced with you about a year…", "text": "Well I refinanced with you about a year ago  for 1700 a month then after a few months you jumped it to almost 2000 a month now I had to refinance again with you and made my payments back to 1700 and added 10000 to my mortgage! Thanks for nothing! ", "rating": 1}, {"title": "New Day USA increased my payment to…", "text": "New Day USA increased my payment to cover a so-called escrow shortfall without notifying me! Lucky I keep extra money in my account so I was able to cover the extra $100 a month that was was withdrawn via Autopay.", "rating": 1}, {"title": "Conniving legal thiefs", "text": "Well, we used to have new day. Then they sell out our loan under us without our knowledge or approval. And now they sent us another letter asking us,You trust us with our home loan Please allow you to help you again. Only sneaky $$$ banks try to manipulate people, How disgusting greedy evil can you possibly be?And the only amount they said we could even average cash out is 70000.  Which is  way under than it would be. But why anybody in the right f****** minds would cash out 70000 with the ridiculous interest rates today? It's sickening what this country allows the banks to steal from us, especially now in the scamflation recession", "rating": 1}, {"title": "The admiral doesn’t give a rats….", "text": "The admiral is a joke. High fees and very little knowledge. Let’s not forget if you’re 1 point under their requirement for credit you’re out. Better yet you get credit repair calls or pitifully bad advice on credit. We went elsewhere and had a VA loan closed in 26 days. Now my wife gets pre approval letters and she’s not a Veteran.", "rating": 1}, {"title": "Run while you can these people will…", "text": "Run while you can these people will give you the highest rate and charge you the most money they possibly can not even explain it to you talk so fast like car salesman with hours had a better deal from another company  then two days later another from my current mortgage company was told they would match or beat sent the other two sorry we can not do that  charging me 9 k more then others just a disgrace  do not care about bets like they say lies after lies  bad bad bad company  ", "rating": 1}, {"title": "No different than any other predatory lender...", "text": "This company is no different than any other predatory lender, trapping you with easy to apply on-line mailers and then instantly attacking you by phone while at work.  A place where talking through financial private information is impossible.  What is worse they cover their business with \"we are here to help veterans\" when they are in the same business as any other lender except their victims are the people serving the country.  Sad!", "rating": 1}, {"title": "A Lot of Hype....", "text": "I normally don't leave reviews, but the treatment we received when choosing NewDay USA for this veteran and his family was nothing short if shameful. In July of 2020, we decided to contact NewDay USA for a VA Rate Reduction Refi. After weeks of loan prepaperation and confusion regarding rates, we agreed on a rate. A day before closing we received the final loan disclosure statement which charged us for a rate reduction/ buy down, adding over 15k to our loan amount. We were in financial stress at that time, and really could have benefited from the option to skip 2 payments and ultimately reduce our monthly payment, so we accepted. Three weeks later NewDay USA sold our loan to Freedom Mortgage without even a thank you. Thank goodness they did, or we would not of discovered how amazing Freedom Mortgage is. We have been with them ever since. We continue to receive endless calls and mail asking us to consider changing back to NewDay. Thanks Admiral! Maybe one the the many retired MCPOs on the NewDay advertisement payroll could assist as well. What a joke.", "rating": 1}, {"title": "8 weeks of time, wasted.", "text": "Well, I went into this thinking that there would be no issues, I had used New Day before and had no problems. So, I applied for a cash out amount as I owned my home now. Paid off, and I wanted a loan to pay off all other debts and just use some home equity. NO, first 2 years of everything. Then VA value of home. Next more DOC. Including copy of marriage. Two weeks ago, loan approved but VA wanted more DOC. concerning my self employment P/L and Bal. year to date. My CPA could not sign DOC. legally. So VA unwilling to budge. Wasted time 8 weeks, Approved but not approved. Shame.", "rating": 1}, {"title": "Just wanted to let Veterans know if you…", "text": "Just wanted to let Veterans know if you are in trouble make sure that the only house you could buy isn't a manufactured home or they will not be there for you if you are in trouble and need a cash out. They need to be honest and say they only care for some Veterans. ", "rating": 1}, {"title": "Constitutionally ignorant", "text": "I called to straighten out some problems with my escrow account and in doing so was transferred two or three times. I was about to be transferred again, and I said this was b######t and the gentleman told me I cussed and hung up on me. if rates were lower, I would borrow the money somewhere else immediately due to the fact that my beacon score is 846 I can get money anywhere, but no cheap money right now. all you better out there think twice before using new day USA they are too sensitive for a veteran especially one who has seen any service.", "rating": 1}, {"title": "Vets beware", "text": "NewDay USA has sent me hundreds of dollars in marketing material trying to get me out of my current VA Loan.  They cover their mailers with the names and ranks of retired military who work at NewDay.  If you have to sell me on your prior service to buy your current product/service--run!", "rating": 1}, {"title": "Do not recommend ", "text": "Things that happened:-told closing would be on a specific date and ended up being 4 days later due to \"errors on their end\".-was not told that an inspection, insect, and well tests needed to be done until asked when they can schedule them. -agent took a vacation two days after we started the process which was fine except there was very little communication with the company during that time which delayed the inspections. -communication with agent was great at first but dwindled down to very little-during the initial consult, was told the consolidation checks would have the addresses of where to send them and they would be cashiers checks. Found out that this is not true and they are regular checks with abbreviation of the company that you are paying off. In which some of the companies have denied the checks due to this-after the close of the loan, was told  the checks would be overnighted and receive them 4 days after closing. We were told the 25th overnighted and receive the 26th but we did not receive the checks until the 27th. The documents on the FedEx package showed that they were supposed to be sent out on the 25th but the documents/checks were not sent out until 7pm on the 26th. --have text from agent stating that checks would be sent out overnight on the 25th. Agent tried telling my husband  that there was no such text when we started to inquire where are checks are. Showed my husband the text and read it out loud to agent who then changed the subject. All of this after having to contact the manager because the agent would not respond for three days to us. These were just the big items. Crap happens and I understand that. The biggest piece is making sure the agent knows what he/she is talking about and then not giving information that is false along with providing timely communication. They are no help once you receive your checks either. ", "rating": 1}, {"title": "What Bullsh t", "text": "What Bullsh t! Called and wanted $60,000 to consolidate. I own a $500,000 house outright! I was told I need and extra $2700 per month on top of what I get from SSI, VA pension and a small pension in order to qualify! That's about $1600 per month. So I have to back to work to get a loan. Help the Veterans! Bullsh t! Just another loan company.", "rating": 1}, {"title": "Misinformation/Distrust", "text": "We were almost fully through the process and it was stopped.  Not a big deal but after the appraisal was done I was told that I would get a copy.  After not receiving a copy I contacted the Appraisal company. They informed me that the lending company put a stop on it.  This is not what I was told would happen and is a shame that misinformation had to happen. This makes me not trust other things that they have said and I would steer away from doing business with this company due \"misinformation\"  feels like they are trying to slide things through and hide information that you (the customer) should know.", "rating": 1}, {"title": "Submarine veteran, no snowflakes", "text": "I was trying to get insurance and escrow from straightened out due to fact that insurance is going up everywhere. During the phone call after three or four transfers I said this is BS but said the whole word. I was immediately hung up on and the last thing I heard, is you cuss and I don’t have to talk to you. I’m hanging up. I will call them back and try to get rid of that escrow account due to the fact that I want to have as little to do with them as possible other than pay them my mortgage payment. They must’ve gone woke or I must’ve had a DEI employee. All you veterans out there? Beware. I guess I should have had more sensitivity training before I spent a year underwater on a submarine, I am sorry new day USA, that I don’t fit into your snowflake mode.", "rating": 1}, {"title": "NewDay it's not trustworthy", "text": "NewDay it's not trustworthy. I am a retired veteran 22yrs Army. I went with NewDay when I saw there ads commitments to veterans and was told 3 times during the Loan process that ot would not be sold to another company. 2 years later it was sold to Freedom Mortgage.", "rating": 1}, {"title": "No response", "text": "Closed on loan a week ago was supposed to receive checks last Saturday it is Monday still no checks. I have tried calling numerous times (Friday, Saturday and Monday)and left messages but have gotten zero responses", "rating": 1}, {"title": "I had a HORRIBLE experience with New…", "text": "I had a HORRIBLE experience with New Day. The agent was inexperienced or just didn't care, offered no help in my situation. The home appraiser was absolutely unprofessional. I know many people have had great experiences with New Day, but mine was terrible.", "rating": 1}, {"title": "Predators", "text": "Previous review has vanished.These predators prey upon our country's defenders, and it should be illegal. They will gladly throw you a bigger shovel to dig yourself a deeper financial hole.", "rating": 1}, {"title": "New Day is not loyal to the Veteran", "text": "New Day is not loyal to the Veteran. The Admiral needs to step out and stop lying.  One of the worst Customer service ever.  New Day sells off mortgages, takes forever to transfer the loan and then has a list of excuses. It's never been about the VET, it's about the dollar. Always has been.", "rating": 1}, {"title": "Shameful Veteran Treatment", "text": "The person I was assigned to contact with any questions or concerns is, surprisingly a New Day VP and Program Team Leader. This man's lack of concern and/or interest in fulfilling New Day's commitment to assist me in the loan process was unbelievably sad...especially given his position.I followed up 3 days ago and was assured I would be hearing from \"Him\" no later than Tuesday, December 6th. Well, today is December 8th and I have yet to receive one reply to my numerous emails, voice mail messages and texts.I am so very disappointed in the the performance of the New Day USA's staff, lack of follow up and overall communication. As a Woman, a Veteran and a previous New Day Client, I would hope that Admiral Lynch will take this review to heart and look into why I was treated so poorly. A simple email, phone call or text to me from New Day would have made every difference. Ignoring me, especially after I called and complained, was just wrong. Adding insult to injury...my credit took a 6 point hard hit dip. Shameful.", "rating": 1}, {"title": "New Day ruined my Veterans Day.", "text": "I was effectively blocked from paying off my credit card bills electronically through my bank's bill pay service. Instead I was given a stack of checks with no other information than the creditor name, or worse, just an acronym,  with no address or account number on them.  It took over 4 hours of my Veterans Day weekend to get it sorted out and I'm still not confident all checks went to the correct addresses with correct account information on them. To make bad even worse I'm now relying on the Post Office to actually deliver those checks; the same Post Office that lost the title to my cargo trailer just last week. Had I known what an ordeal this was going to be it would have been a deal breaker. New Day is NOT all about Veterans, just the money. My failing health is suffering from this ordeal as I consider civil action.", "rating": 1}, {"title": "They sell your information to scammers.", "text": "EDIT - Fascinating.  After leaving my review, suddenly there are all these first time posters leaving 5 star reviews.  Seriously guys?  Good grief.  Your company's reputation should stand on its merits, not clouded by fake reviews.....These folks have my mortgage and I must say, the original application and all that went fine. That was a few years ago. But fast forward to 2023. They kept telling me they had a \"special\" program for \"select\" veterans. So, I finally started that application process. By the time they were done, my 2.75 APR was going to be bumped to current market rates taking my payment of $1700 a month and putting it well over $3K. So much for special programs for vets.But to compound the issue, I have been called and texted relentlessly since then, by scummy, scammy outfits like Nations Credit among others. I have NEVER had this happen like this on a refi before so apparently these aye-wholes sold my information to the lowest of the low in the financial scammer's world.If I didn't already have a very sweet APR, I would be kicking these clowns to the curb.", "rating": 1}, {"title": "Predatory and Fraudulent", "text": "This is a predatory and fraudulent \"mortgage loan service\" that preys on Veterans.  They endlessly hound veterans with misleading and fraudulent home equity loan offers.  This is a sick, greedy company and their Chairman Thomas Lynch is a greedy, evil person who betrays the real veterans who sacrificed for their Country.  I have repeatedly told them I wasn't interested in their offers and told them to stop harassing me, but they continue to hound me.", "rating": 1}, {"title": "Why does this company feel it necessary…", "text": "Why does this company feel it necessary to have a woman on their TV ads with her cleavage and or breasts exposed to the public???  This is a business as not a soliciting ad.  Make this a business ad not a breast advertisement!!!", "rating": 1}, {"title": "I would never use these guys", "text": "I would never use these guys!   I was working with an agent for about two weeks.  He set my rate at 7.99% which, I thought was a little high but, what do I know.   I discussed this the rate several times asking, if I get my credit score form 620 to a 680 would it help.  Was told “NO, I would need a score of at least 720 to lower the rate.  Finley just took it on my self to call rocket Morgage.  Chad laughed out loud and said, “that is a high rate even without VA backing.”   He automatically offered 6.0% and, I don’t need my spouse on the loan.  I qualified alone wich new day said “NO”.  informed my agent at New Day and he had the nerve to ask me to send him my agreement with Rocket to see if he could match/beat it.  Why the hell would I? I asked you on 4 separate phone called and you told me it was the best rate possible.  This is not how I thought a business, “for veterans” would treat a veteran.   The guy is a used car salesman.  ", "rating": 1}, {"title": "This company is a predatory lender", "text": "This company is a predatory lender, who states that they are in the best interest of the veterans, but that is not true. After 210 days and making 7 consecutive payments New Day USA refused to refinance my VA loan under what is called an IRRRL. New Day USA stated they didn't offer the IRRRL. So I went with Rocket Mortgage they completed my IRRRL refinance in 10 day. Newday USA should be taken of the list for providing loans and services to veterans.  They are about keeping you at a high interest rate for 12 months before they offer you the IRRRL , which can be done every 210 days with 7 payments to reduce for mortgage payment and lower your interest rate. Newday USA is not playing by the rules and guidelines setup by the VA , they are prolonging a process that veterans have earned. Stay away from this company they are all about the profit they get out of veterans. Run Fast if they make you and offer, and if you use them after 210 day use your IRRRL to change to another lender.", "rating": 1}, {"title": "As a veteran I have NewDay", "text": "As a veteran I have NewDay. I was going to refinance with NewDay to continue with them however not only are they higher on the interest rate etc a week before I go to close with another company they switch me to a new company and now I can't do anything with my home I don't even know where to send my payments thank you newday 🙄", "rating": 1}, {"title": "I talk with Rich and told him I only…", "text": "I talk with Rich and told him I only needed a small loan  off $25000 on the equity of my house, after talking with him it ended up he wanted to refinance my house and a higher interest rate and started to take all my loans and put them on one.  iIt ended up I was borrowing after he put my house on the loan$168000 would’ve have ended up paying back over $500000. I went to the bank which has my house loan borrowed.$25000 with lower interest rate. I’m retired military but this company was ready to take me to the cleaners. I would not deal with them. They don’t listen to you but do what they want ", "rating": 1}, {"title": "These people are total BULL", "text": "These people are total BULLThey call you & tell you that they are here to help the veteransThat they want to get rid of the high credit cards & high interest ratesSo you give them your SSN & DOBThey call back hours or days later & say that they can’t help you as you have to many debts & too many high interest credit cardsAnd in the process they have ruined your credit more!!!", "rating": 1}, {"title": "I thought when you were doing a home…", "text": "I thought when you were doing a home equity loan, they were looking at the houses structure,Not appraising your home because it was slightly messy, or because your smoke alarms may b chirping,New day sent to clowns to appraise our home and the things they did were not  what I was told an appraisal was done.They devalued my home for things that had nothing to do with the homes beauty or structure,and it lost us quite a bit of money,If this is what you call helping your vets then you need to regroup,Why would it take 2 men 25 min in a tiny bathroom staring at the walls,and standing in  a garage 30 min what are you looking at standing in the doorway,everything they did was totally ridiculous!And it cost us,In a home  9 years that was valued over 517,And your clowns ruined our value,I think it was unfair and also a setup,And then you tell me contact you in 6 months !I will never trust new day again with anything,I'm a veteran and I know my home and my area that what they did was rotten to the core,whereever you found those 2 appraisers should be sent back where they came from,appraise the home for its structure I had been very ill yes  it was a bit messy but my realtor told me not to worry about that the appraisal was based on the homes structure not if it was neat and orderlyDon't trust them !!", "rating": 1}, {"title": "What should have taken a month took 4…", "text": "What should have taken a month took 4 months. They kept going back and forth for title companies. I had to do title company work for them. They kept saying we had a closing date and then come back and say oh you need this and you need that and they did not do their job. It was not Griffen Bell. It was the higher upper people which I am not happy at all with. We even almost got behind one month on bills because we were told we were going to close and not to pay our bills. Then Griffen came back and said yes go ahead and pay your bills because we're not going to close this time. It's going to be this x amount of days and it's going to be next month and we don't want you to get 30 days behind but then we have to start all over. They should not release any information until they are ready with the final say on everything. I have all the emails. They're on my phone all the text messages. I have all the data because. My husband served this country for 28 years, a disabled vet and we are not satisfied with your service at all", "rating": 1}, {"title": "Nothing but a liar", "text": "They lied to me and my wife. When we first talked to new day we asked them if they would sell us and they pacifically told us no. Well now our mortgage is being sold to a company with a low rating and has also faced fraud charges in 2016.", "rating": 1}, {"title": "Apology NOT accepted", "text": "I appreciated the call from Craig to make apologies on behalf of the New Day Team Members that totally dropped the ball on my application.  However, the poor substitute for a rejection letter I “finally” received from New Day was vague and impersonal.  It was a form letter that bordered on rude and should have been preceded by a call from the loan processor. Needless to say, I am not changing my previous review of the New Day 100 Refi application process.  I say this since the time of my initial application to the time Craig contacted me (which, by the way, was before I received the very impersonal rejection form letter) interest rates had increased over four full percentage points.  I have elected to hang onto my very low current VA rate and sit on my very high dollar equity position.I have requested that Craig remove my name from all New Day mailing lists for receiving refinance materials.  As I told Craig; entirely removing me and OPTING ME OUT from all mailing lists is the very least they can do for me at this juncture.", "rating": 1}, {"title": "NewDay USA is a joke", "text": "NewDay is a joke. They are not in it to help out veterans. They are in it to screw the veterans and charge them an ungodly amount of fees. The appraisers are a joke and the underwriters are a joke as well. We gave them everything they asked for and they kept coming back for more and more things that didn’t even make since. It was like they were just making things up to make it difficult. It’s pretty sad that they prey upon the veterans that they said they are here to help. New Day USA isn’t in it to help the veteran. I would never recommend them to anyone.", "rating": 1}, {"title": "Never paid for site inspection", "text": "Performed an site inspection ok'ed by Matias, then performed as agreed and was tiffed by the company, Never do business with this company", "rating": 1}, {"title": "No help", "text": "Cody Dennis started out motivated to help us with refinancing our mortgages with the balloon that had matured. But because of the complications with us starting the process late our current lien holder is not working with us in good faith. NewDay cannot and will not offer any other options to close on the deal. They won’t even answer my calls or provide a response to my emails. Their silence is deafening. Therefore, we have to move forward to resolve our current issue. So when things go sideways, watch out, not only will NewDay drop any more progress in a heartbeat they will completely ignore you. They don’t even have the courtesy to acknowledge you or provide an explanation of why they are no longer working with you. Unlike other companies I have contacted (after NewDay’s failure) that at least were upfront at the beginning. NewDay is deceitful. Be watchful.Update: 19June2023There are two different versions of events. It does not bother me that NewDay could no longer help our situation. The problem is the utter silence until I wrote a review here. I had to stop the VP with telling me what I already knew through Cody. The VP was at least courteous enough to listen to my version of events. Ultimately they have nothing more to provide. And I had to move in another direction since they were providing no other option. Which I had made NewDay aware of even before moving forward with plan C and they still remained silent. Unfortunately, plan C is going to cost me a lot more. Thanks NewDay, especially, Cody Dennis for stringing me along. I can’t trust NewDay and I won’t recommend the organization.", "rating": 1}, {"title": "Disrespected", "text": "About 6 years ago I contacted Newday about a loan. The person on the phone was rude and short with me. Did not treat me with respect. I called to complain, emailed to complain to the admiral. Never heard a word back. I want to puke every time I see their add. Served 69-73. Not sure of the exact date", "rating": 1}, {"title": "Kick you when you're down", "text": "Here is a company that is all for the veterans.  Wrong this is a company that,  when you have to make a insurance claim, they have to sign the check before you can cash it..but when  that check is so little, it can't fix anything, from damage from hurricane, new day signs the check to make sure the fixes get done ,instead new day jumps  in bed with the insurance company, and sells my mortgage to another mortgage company,,,,the same one I had right before  new day. This mortgage company new day, doesn't  care one bit for vets at all , they just another flag waver for money, as a 100 percent  disabled veteran ,,they get paid on auto pay..guaranteed.. but they don't help...they will kick you when you're  down... my advise to you,, don't get involved with this mortgage company, they wave the flag, for money .and not  for you the vet  I called  them and could not, answer, a simple question.....why..  instead they will sell you out .avoid this, mortgage company. This mortgage company  is not loyal,,,committed,,or concerned about you the vet  ,they will  have one of there best wolf's they that have, write a rely,,they ran in time of trouble...and sold me out to the lowest bitter,,  without any warning ..that was there intention. Walk way from people like this. No loyalty and no commitment.", "rating": 1}, {"title": "I’ll take my mortgage to a trustworthy lender. Beware", "text": "Update 3/8/2023: NewDay emailed me stating they would get me $379 back out of the $1000 in escrow. Would have been nice had that actually happened but they never sent anything. I reached out to my rep and they had no idea and said they have no way of tracking it either. To my veteran brothers and sisters, they make everything sound good but as a customer trust me they’re not. The have no ethics in that company and they don’t keep their word. I will be looking to refinance through someone else and will never do anything with this company again. So we closed on our loan, and they had told me to make it right they were going to cut some fees (emails to prove that.) They contacted and told me that they were able to cut some fees and some get me the amount that I had originally signed. So we closed and unfortunately for me I should’ve paid better attention because instead of me getting an escrow refund they rolled it over, so they really didn’t cut any fees they just shorted me about $1000 in a different place. The ethics of this place are laughable and when the streamline comes back I’ll be taking my mortgage somewhere else.Worked with Tom from NewDay on my refinance and the oversold me on how much my home was worth so it ended up being like 35k less. Wasn’t interested in continuing with them but with what they were gonna offer I figured we could make it work. Closing day comes and the numbers don’t match what I signed on the CD. So around and around with excuses, and trying to find a way to not accept responsibility that he was promising things they couldn’t make happen, so I sent the lady on her way and refused to sign", "rating": 1}, {"title": "I didn’t get a copy of the contract", "text": "I didn’t get a copy of the contract.  I was told I would not have to pay some of the charges, (i.e. Appraisal) and I was charged. Further they sent checks to payoff some of my accounts, every one of them were for the wrong amount.  They were all short.", "rating": 1}, {"title": "Not New Day people but the VA appraisal…", "text": "Not New Day people but the VA appraisal person Blake E. Ernst.He did not prepare me for what appraisal would be in order for me to be prepared.I informed him that I am suffering from a bad ankle that caused my rotator cuff to be impaired and that my cleaning lady has been out with Covid and another illness as a result of Covid.He came with another person who did all of the appraisal work.  I explained to them that the loan is to prepare the basement shower which was not used for a couple decades.  He still wrote up that the shower needed to be repaired before loan would be approved.  He stipulated this in two VA write ups.  Not only did he not listen, he was rude both times that he was here.  First time here was 20 minutes, seconds time no more than 10. Once again, the lady with him did all the work that I had completed within three days.  This whole thing took prolonged time where the contractor did not get started because of the VA was not working in a timely manner The person who was working with me from New Day was amazing.  He also spoke in my behalf but, was also going by what the appraisal Ernst put forth New Day kept me informed constantly and reassured me that this information would be sent to you, Admiral Lynch.Getting a contractor paid to come in to get things done was very expensive when the last minute hot water heater needed to up to code, where Ernst hadn't even written me up for that!Ernst should not be paid by me twice!  He does not represent Veterans!  He is rude, treated me as a female veteran, stupid, condescending, and does not listen.  Is really the type person despite fact that he is a Veteran, to have this wonderful position?  I don't even know why two people showed up for the appraisal.  The lady with him showed up in a dress with high heels and had to go up in the attic!  I had the ladder, flashlight, and hand wipes to help her.Ladele A. Tojuols should be commented for helping me through this experience.  Never once did he give up on helping nor failing to keep me posted.I was at a Women Veterans Pow-Wow and passed on your pamphlet to ladies.  I am not telling other Veterans about the miserable parts of my experience only the good as Ernst caused most of it.Please speak with Ladele A. Tojuola, Account Executive, he is blameless in this whole experience.  He is a treasure and should be commented in your \"Labor of Love\" for our Veterans.Respectfully,Maria Olivia SierockiWAC Veteran", "rating": 1}, {"title": "Completely unsatisfied", "text": "I called for information about a loan to install a pool. Wife and I have history of home ownership and no missed payments ever. Both have credit scores over 800.  Recently moved to Florida and purchased home.  Called and was told that she needed to check to see if length of ownership of new home would be a problem, spoke to manager and then continued with the process.  Ran credit score- though asked her not to since we were just in the info gathering program.  Denied due to the length of ownership of new home.  Went to a bank and got the loan for a rate well below current rates.  All I got from NewDay was an unnecessary inquiry.  As a Veteran, I wanted to believe in the Admiral and the ads.  Corporate banks took better care of this veteran.  Very disappointed in New Day.", "rating": 1}, {"title": "We had situations where we had to…", "text": "We had situations where we had to immediately leave the program.", "rating": 1}, {"title": "New Day said they wouldn't be selling…", "text": "New Day said they wouldn't be selling my loan this time around.  They called me specifically to refinance and told me they had built their own bank and no longer needed the assistance of other banks.  That was a lie.  I got ahead on payments for the holidays so I didn't have to worry about anything.  I wasn't due to make a payment until February of 2023.  I now owe one in November of 2022.", "rating": 1}, {"title": "I have been ghosted.", "text": "I have been ghosted by plenty of women. They decide to break it off and forget to tell you. You text, email, call but they don't answer.That is what New Day USA has done to me. Matt Z has vanished from the planet And no one else at New Day will answer. You get a message that their mailbox is full.Their loss. I can take my business elsewhere.", "rating": 1}, {"title": "help, but not help", "text": "They say their goal is to help veterans, but only if it suits them. We are sinking in debt but have the equity in our home and 90% disability to use my VA certificate, but they won't even try to help because my credit score is below a threshold that seems to change. We tried this last year, and we were below the threshold then too - but my credit score was higher than it is now. Their response is basically we're just going to let you and your family drown.", "rating": 1}, {"title": "When I needed help with a VA load New…", "text": "When I needed help with a VA load New Day said No when Others said yes.  Never trust the Navy.  Lol", "rating": 1}, {"title": "Started on 4/11/22", "text": "Started on 4/11/22. The painfully slow \"less than professional back office handling of details\" cost us more than 100 basis points in final APR. Never before was it required to cancel our land trust (a costly move). The check amt's sent were not accurate and a simple deposit of funds in our joint checking account allowing our mgmt of payoffs worked fine in our past.", "rating": 1}, {"title": "I am a vet and was turned down by them…", "text": "I am a vet and was turned down by them for credit rating.  Within a few days, I was able to qualify with another lender with no issues.  After I closed, I started getting calls from new day. All of a sudden miraculously, I was qualified for a loan from them.", "rating": 1}, {"title": "Taking advantage of veterans", "text": "Taking advantage of veterans since inception. Disgraceful, shameful, and should be stopped.", "rating": 1}, {"title": "Received a mailer from \"New Day USA\"", "text": "Received a mailer from \"New Day USA\". Have received them before but never followed up on them. Am having some issues, due to the Pandemic, Health Issues and the New Age, (No Work Ethic). Contacted New Day USA, looking for some help with my situation. Due to some issues with my Credit Report, Mr. Lynches Team, explained to me that they have guidelines to follow, which I understand. But, please don't send out the flyers with, \"Dear Veteran,I'm writing to bring you good news. You have earned one of the most valuable benefits our country gives to military service members: eligibility to apply for a VA Cash Out Loan. So, like everyone else, Rear Admiral Thomas Lynch is expressing my right to apply, but not receive a VA Cash Out Loan!Evidently the Navy's Motto isn't like the Army's, \"No Soldier left Behind!\"", "rating": 1}, {"title": "Re :Liars", "text": "They are scam artists who have been fined millions.I get scam offers at my protected address but they continue to harass me a Navy veteran.He was forced to retire .They are cooks RUN.They need to cease and desist harassing me as filling complaints with the post office.", "rating": 1}, {"title": "Mark L", "text": "Mark LWhat a scam new day USA is they have uneducated people trying to walk you through a mortgage over the Internet they actually wanted a COA for my DD 214 which comes with a seal of approval on it it also comes with a letter stating that it comes from the national archives not only do they not respond in a reasonable amount of time they actually refuse to give you a rate with your credit score and your holdings I would tell all veterans to stay away from this company", "rating": 1}, {"title": "Not a real caring company", "text": "I am a disabled veteran who was trying to refinance with a cash out.  I owe 55 thou on my property and it worth over 100 thou easy. They totally refused to help me and penalized me because some my past payments were deferred on my existing account due to covid. Wouldnt this pay off the deferral? Stupid policy and thanks for taking care of the disabled.  I'll never try here again. Thanks for nothing and misleading me.", "rating": 1}, {"title": "Would be nice to get my 1098 so I can…", "text": "Would be nice to get my 1098 so I can file my taxes. I called and they said they would email the 1098 to me since it was not on customer portal. Got the email and document center was down as well so I could not get my 1098. That was Monday and still waiting.  Hey new day 1098's are required to be sent to mortgage holders by Jan 31st! Not impressed with your administrative abilities, no excuse for this.Retired Veteran", "rating": 1}, {"title": "Worst experience ever", "text": "Worst experience ever. We had 3 different account executives. Had to resend documents several times. Part way through this nightmare they notify us that we need an appraisal. Then a week later they need a pest inspection. Worse of all, we set a date for closing and the notary fails to show up. No notification. Stay away from this company. Their incompetent and unprofessional. There are better companies. From a Retired Veteran", "rating": 1}, {"title": "Interest rates kept going up on my…", "text": "Interest rates kept going up on my paperwork and Now they are down and we’re down -I felt as if discriminated against! I had a 6 month seasoning after my husband VET in AF for 20 years and paying bills on credit cards and yet you just look at numbers and NOt the individual-Now I don’t know if I can do payments-shame to New Day the VA mortgage company! I deserve n my deceased husband a 2.25 percent loan!!", "rating": 1}, {"title": "The loan took incredibly long for…", "text": "The loan took incredibly long for absolutely no reason. I provided the same documentation FIVE different times. I don't understand why it took so long (never was told). Every time I would call Joseph Stanton (loan agent) he would either not answer or give me zero information. The loan is finalized and done but the whole experience was not good at all. I hope it improves as time passes.", "rating": 1}, {"title": "I am a 100% SC veteran", "text": "I am a 100% SC veteran. I thought using NewDay USA would benefit me in that I would have a fairly intact retirement nest egg from the sale of my house. I was wrong. I retired early from the VA due to health concerns.  I thought NewDay would have better (lower) closing costs than other commercial lenders. I was wrong. I am grateful for the low interest rate. NewDay and the other closing company took $30,000 from my retirement nest egg. Now I will have to try and find work. NewDay and the other closing company should be ashamed for taking so much money in closing costs from a disabled veteran.", "rating": 1}, {"title": "I am retired army", "text": "I am retired army.  The advertisements talk about how helpful New Day USA is to veterans.  My experience was the opposite.A couple months ago I called to inquire about refinancing my home of 6 years.  The representative did a credit check with me on the phone.He immediately said New Day USA would not help me.   He said it showed a couple late payments over a year ago.  Not missed payments just late during COVID.I called Guaranteed Rate.  They immediately started the process of refinancing.  They got me a 3.12% rate.  Closed in less than a month.Thanks for NOTHING New Day.", "rating": 1}, {"title": "WARNING!!!This company is garbage", "text": "This company is garbage. They waited til AFTER the pest inspection and AFTER the appraisal and AFTER they had me miss work to tell me they cant help!!! My refi was in Underwriting and now they say it cant be done. This is UNSAT. Will be contacting BBB next. STAY AWAY, warning you. If i could give ZERO stars i would.", "rating": 1}, {"title": "Crazy Town!", "text": "Why would anyone with a half a brain take equity out of their home at 4% to put it in the bank at 0.01%.Tatiana is either stupid for saying that or she doesn't care about customers. I understand she is getting paid but people should have some self respect. Sad thing is there are stupid people who will think that's a great idea.This review is on the commercial only.", "rating": 1}, {"title": "The worst company in the world!  DO NOT USE THIS COMPANY!!!!", "text": "The worst company in the world!.  Veterans Beware! The loan process took over 6 months.  The tax servicing department is terrible.  I have an escrow account for property taxes.  Taxes were due January 31, 2022.  The taxes are   DELIQUENT because NEW DAY USA still HAS NOT paid as of April 24, 2022.  I have made many telephone calls to NewDayUSA and they continue to lie to me with incorrect information.  I have wrote letters with no response and NewDay USA responds with, \"we want to reach out to you\"? This is BS. DoNOT use this company. It will be a never-ending nightmare!", "rating": 1}, {"title": "here we are just about a month later…", "text": "here we are just about a month later and still havent got my taxs paid have been told that the check is on the wayabout 4 times,also told the county taxs office the same thing say somebody will call and exsplain but they dont.maybe just dont pay the payment and use the money to pay the taxs", "rating": 1}, {"title": "Ben Taylor did me wrong", "text": "This company held my property for over 90 days to tell me he couldn't get the job done.  Yes Mr Ben Taylor you didn't get the job done. He took so long to do anything and was quite rude when I asked him how it was going. I am combat veteran  OIF05-06 I really needed this refinance. I hope your company gets a better way to treat veterans.", "rating": 1}, {"title": "No matter how many times I have called…", "text": "No matter how many times I have called or emailed they still continue to send me junk mail. I was the victim of identity theft and the amount of work it took to straighten all damage was ridiculous. Now I have a company whose supposed Chairman is a retired Rear Admiral yet they will just not stop and still sending me ridiculous amounts of garbage!", "rating": 1}, {"title": "Rude, disrespectful, cocky, and pushy. Beware!!!", "text": "Ben Groff was rude as soon as he learned we had a 665 credit rating. How dare I ask for a reasonable interest rate with that kind of score. Well Ben, my in-laws let us borrow the 30K to pay off our credit card debt (The entire reason I applied in the first place). Now my wifes rating is over 810 and mine is at 760. And now we do not need the money. So basically, if you need the money to pay off debt, be prepared to pay higher interest rates. Thanks for treating me like I am stupid for turning down a bad deal. I will never go to a company like this and hope you don't either!", "rating": 1}, {"title": "Company with no respect for older veterans", "text": "I had a very negative experience when I called for information about refinancing my mortgage. The account \"executive\" that I spoke with was condescending and arrogant. He proceeded with a credit check that was reported to credit agencies without my permission. I definitely felt that their advertised rate are not actually available. As a senior veteran who has never used a VA loan I guess I don't fit their profile. They should stop wasting money on marketing and work on better customer service.", "rating": 1}, {"title": "I'am an Army Veteran", "text": "I'am an Army Veteran, I wasted my time giving Andrew Joseph Howard all my personal information to see If I could refinance my home. Emailed me back once and said having software issues hang tight. I called him twice and no return call. Emailed him and no response. Called a week later and talked to another gentlemen he said he would call me back after 4 pm and guess what no return call......... DO NOT WASTE YOUR TIME LIKE I DID..RICH", "rating": 1}, {"title": "the worst experience ever", "text": "the worst experience ever. made to jump through hoops I gave all info just like the last few times nothing had changed, Then add-ons and charged the Month I was to have skipped ,not able to log-in I will be calling not at all happy this time, I think my last", "rating": 1}, {"title": "RE-FiNANCE", "text": "I contacted the company in September to re-finance. It is now the end of October and the process still going. I had to be the one in touch with the company because they were not keeping me up to date with the application. I ended up having to remove my application. I WILL NOT RECOMMEND THIS COMPANY TO ANY VETERANS FRIENDS. MARIA PALK", "rating": 1}, {"title": "non payment of property taxs", "text": "taxs were to be paid by nov 15 2021 for a 3percent saveing,its now jan 10 and still not payed now on jan 15 I start getting late fees why the taxs department is takeing 15 days to try and figure out why they didnt pay them.I would not recommend this this place of bussnes to anyone.", "rating": 1}, {"title": "If I could give this company a big fat…", "text": "If I could give this company a big fat 0 I would....don't deal with these folks, they lied to us from the beginning...they knew our credit was not so hot however they assured us we qualified for their program.....we were told to take our home out of our trust before they could proceed...500.00 that we didn't have but WE did it anyway...first red flag, all through this process we were told everything is ok, a WEEK before we were to close we got a call, they couldn't help us, now we don't have the funds to put our home back into the trust. Iam furious with them...just be honest and up front....BEWARE DON'T TRUST THEM", "rating": 1}, {"title": "NewDay USA transferred my mortgage loan…", "text": "NewDay USA transferred my mortgage loan from PHH. A two month credit that I carry on my account disappeared, and the new temporary payment coupon states due by 11/02/21 vice 01/012022, and I just received the payment coupon on 14 Nov - 12 days over the required payment due date. Attempts to contact their customer service - left call back number (when they called back hour and a half later -went to VM; had to call them back, currently have been waiting 1 hr and 53 mins!!!! At this point I’d love to go back to PHH….", "rating": 1}, {"title": "I need a manager to call me back…", "text": "I need a manager to call me back immediately.  Nigel Stickland and Amanda Schmid will not call me back and do not answer their phones.  I should have listened to reviews. It has been one problem after another and I am more than furious. You have put us in a huge bind when we thought this would help us and in has been the complete opposite.  I will be filing another complaint as you have many with the BBB and whoever else I can find.  I will not hold my breath waiting for a manager to call me.", "rating": 1}, {"title": "Rip off", "text": "Animal you're a company it's the biggest rip off to veterans they say I owe something but yet they didn't get my paint my loan until November 8th they said I owe October but they cannot produce a bill so I'm not paying I should have known not to listen to flag officers", "rating": 1}, {"title": "I went through the process thinking the…", "text": "I went through the process thinking the company would be friendly towards vets, I was wrong. After going through all the \"hoop\" I saw the \"Closing Costs\" document. $14,000 in closing costs. I e-mailed them back saying this was no good. I got no response back. 5 days later I went to 5/3 bank, got the same deal I was looking for, cash out, and my closing cost was just over $600. I would not recommend any vet use this company.", "rating": 1}, {"title": "Our first closing was January…", "text": "Our first closing was January 2021...2nd was February 2021...3rd March 2021... 4th April 2021....5th May 2021.  Yes, it took that long for the actual signing of the closing paper.  Incompetence, failure, aggravation, anger.   All the above, we had to endure.  All we wanted was a lower interest rate.  Recommend Newday...not likely!Ella Wegscheid", "rating": 1}, {"title": "The loan officer had little knowledge…", "text": "The loan officer had little knowledge of the process. Rate locks expired, I wasn't warned. Paper work that was reqested had to be resubmitted multiple times. I'm left with the feeling of being extorted into excepting their terms because after over 3 months I can no longer wait or afford to start the process over with a new lender.  I would warn every veteran against using this company.", "rating": 1}, {"title": "New Day made this extremely easy to do", "text": "New Day made this extremely easy to do.  My rep keep on top of everything and answered all questions.  To my surprise the time from when I first called and the closing was only about a week.  The original closing was almost 2 months and there were all kinds of problems from the mortgage company. This was a different company for original closing, New Day was a refinance and I recommend them over all others.", "rating": 1}, {"title": "Bad people", "text": "This company told me that if I refi. by Feb 5th I would not pay first pmt until April. The company rushed the closing and closed on 1/21/21. They then did nokt wait until Feb. to close acct, but paid the acct. off on 1/27/21. Then told me my ist pmt would be in March. Such BS. They lied to me and held up their lie. I will stay with them for six pmts by law After that they are history. Be careful if you choose them they are slick.", "rating": 1}, {"title": "Received a mailer advertising \"VA…", "text": "Received a mailer advertising \"VA Mortgage Rates have just dropped again to 50yr lows\" which is a complete false statement, rates have moved up .5%. I am on the \"Do Not Mail List\" however they continue to violate. Why does the mailer say no-PMI? VA loans only have a VA Funding Fee. This is misleading information. As a Vet I would not use this company and anyone that considers them should seriously consider doing business with them.", "rating": 1}, {"title": "SCAM ARTISTS NOT FOR VETERANS", "text": "Lied about locking me in a 2.74% 25yr Fixed interest rate which was on my initial contract. After weeks of having paid for inspections and spent hrs getting/scanning/uploading documents, the agent calls me saying congratulations & he locked me in at a 3.85%. ALL SET!!!! I AM AT 2.75% 30YR FIXED RIGHT NOW!!! Wasted my time & money... SCAM ARTISTS. TYPICAL BANK SCUM!! They are NOT for taking care of veterans! Took advantage & misled me......", "rating": 1}, {"title": "I believe in the truth and the whole…", "text": "I believe in the truth and the whole truth. A question I had asked the person who started my application with New Day was \"Will New Day be servicing my mortgage? He said yes.\" Now I find that some other outfit and not New Day will be servicing my mortgage. Which donates to me a lie was told to me. I would not have proceeded with this refi if I was to that New Day would not be servicing my mortgage. Thus, the low rating, I will not recommend anyone in my circle to New Day.Kevin, FMP, COR", "rating": 1}, {"title": "Fall 2020 Rate Shopping", "text": "Fall 2020 - I compared VA refinancing from 6 different lenders (excellent credit score).  Newday USA offered me the least competitive rate/points combo of all 6.  Just because they take advantage of Rear Adm Tom Lynch as a shill in their ads doesn't mean he has any meaningful role in the company or they do a good job for veterans.  Always shop around - you'll be amazed at how much better you can do! BTW, Tom Lynch was a kid when I was in the Navy.", "rating": 1}, {"title": "I have a complainant I am a marine…bad company", "text": "I have a complainant I am a marine corps veteran also 65 years old great credit most of my life until about three years old had to file bankruptcy chapter 7 call for a mortgage last week was told had to wait 5 years that’s crazy u are suppose to be here for us I’m going to contact the state of Florida and see if I can get your company out of Florida", "rating": 1}, {"title": "I think you are crooks", "text": "I think you are crooks, who pulled a bait and switch on me.i was told i would get a 2.2% interest rate. wound up at 2.7% you said it was because you had to verify information, the same information you had from the beginning you kept asking for again and again. when you finally locked the rate in, it was too late for me to go somewhere else as rates did raise. I've never had a loan that didn't lock in at the time of application before. i'm sure i'm not the only victim to this scam!", "rating": 1}, {"title": "quoted me an interest rate 1% higher…", "text": "quoted me an interest rate 1% higher than I received from a legitimate mortgage company and also wanted 4 points.....OUTRAGEOUS!!!  this company is praying on Veteran's that don't know any better...they should be out of business", "rating": 1}, {"title": "We started the process in July and we…", "text": "We started the process in July and we finally closed mid October. The lack of communication in your department is unacceptable. At one point we did not receive any phone calls, text messages or emails from the person helping us. We were told he was out sick but no one would help. Tried calling several times, message after message and nothing. We will not use this company again", "rating": 1}, {"title": "Shifting goal posts, BEWARE", "text": "As a retired Naval Officer it brings me no pleasure in writing this review, but New Day USA is just another mortgage company that leads with one thing and the reality is different.They changed \"Underwriting guidelines\" within 2 weeks, and have now blocked a refi that we really need, which if I had applied two weeks ago, I could have gotten.So much for \"hugging\" veterans.", "rating": 1}, {"title": "We reached out to NewDay USA in order…", "text": "We reached out to NewDay USA in order to explore options to get out of our mortgage with Wells Fargo.  We were basically stonewalled and told to take hike as we didn't fit the standard mold of veteran customers seeking VA loans.  It was an awful and dismissive experience and I'd advise anyone who isn't a standard VA mortgage or streamline re-fi customer to avoid this company as they clearly aren't competent to deal with anything else and rude to anyone who asks.", "rating": 1}, {"title": "Absolutely the worst experience I've…", "text": "Absolutely the worst experience I've ever had!  It took four months for New Day USA to finally close on my refinance. I could not get information on the status of my loan without leaving multiple voicemails and voicemails. I had to call my loan officer every couple of days to get any information at all. During the four month ordeal I was only contacted twice by him to let me know how the process was going. I would not recommend using New Day USA.", "rating": 1}, {"title": "I was told a month ago that I was…", "text": "I was told a month ago that I was eligible for a loan for $200,000. Pre approved. Then they sent me a credit card 2 weeks later. I worked hard to get my credit score good. But it was denied and they hurt my credit score. I thought it was for veterans, I have never been so disappointed. It’s not what they say!", "rating": 1}, {"title": "TAKE ME OFF YOUR MAILING LIST PLEASE !!!!", "text": "I have never used this company and never will I receive so much mail from New Day USA I think they are personally responsible for Global Warming because they are killing so many trees. I have asked 3 times to be taken of your mailing list and the mail keeps coming everyday. Can somebody, anybody at this company tell me how to stop this", "rating": 1}, {"title": "Vets beware", "text": "Vets beware.  What a scam. I have nearly perfect credit yet they refused to refinance my VA loan at a lower rate because I took advantage of the VA allowed deferment of mortgage payments.  They said I have to be making  6 months of payments before they would consider me.  So much for streamline refinancing.  Stay away.  Stay far away.  Their advertising and mailings are misleading at best.  The person I spoke to was \"Cody\" a real jerk in attitude and tone.  So much for being a veteran.", "rating": 1}, {"title": "'Account Executives' don't know what they're doing", "text": "Called to explore refinancing. Agent asked for existing loan details including date of origination. Then said they can't move forward without a hard credit pull. After the hard credit pull, he notified me that New Day does not allow for a refinance within the first 6 months of a new loan even though he knew that we were only 2 months out. So my wife and I both have hard credit pulls from New Day for nothing because the agent doesn't know his own company's policy.", "rating": 1}, {"title": "This was the most stressful and…", "text": "This was the most stressful and unpleasant loan experience I have ever had. There was a fundamental lack of professionalism and communication throughout the entire process.  I had to intervene with the title company or the loan would have failed. I will never use, or recommend New Day again.", "rating": 1}, {"title": "You people quoted me a payment decrease…", "text": "You people quoted me a payment decrease of $333 some odd and it went down 3 times. Ended up with $80, decrease. Went from a 25 year loan to a 30. Some damn improvement. The whole process was a scam. You are not the first outfit I have sought  a refi with but you all operate the same. Big promise, little deliver. Add the \"costs\" you add in the loan and I am no more ahead that I would have been if I had sat pat.  I will never recommend you to anyone I know and I turn off the TV every time one of your adds comes on.", "rating": 1}, {"title": "STOP BUGGING ME", "text": "I am getting tired of getting these showing up in my mailbox. I bought my house, I am keeping my house, and I do not need multiple people telling me to either sell or refinance my house for money. I have plenty of money, I don't need to get more money, and they can shove their offers where fecal matter comes from, because I hate people who don't take NO for and answer and keep pushing. My husband is fed up enough to find out where these people are and take the complaint to their offices personally with a highspeed wireless device. And if they don't like that idea, then STOP SENDING ME THIS FECAL MATTER!!!", "rating": 1}, {"title": "I have a loan with new day it was one…", "text": "I have a loan with new day it was one of the hardest refi.I had to go through it took 3 months at an interest rate of 2.99 and closing coast of 6000 dollars I am disappointed as a 60% disabled vet if you are looking for a refi. look for another lender", "rating": 1}, {"title": "After 8 weeks and 2 missed closing…", "text": "After 8 weeks and 2 missed closing dates we closed last week now Jeremy is telling me the. Losing is no good and we will have to close again.This whole experience has been a nightmare and we are still not done.What a joke this has been not sure what the hell os going on.", "rating": 1}, {"title": "DO NOT USE THIS COMPANY!!", "text": "Refinancing through New Day was the worst thing I could have done. They waited until the last minute for closing and sent in the pay off for my loan too late. It was getting close and I kept calling and was told it’s all fine. It will be paid off in time. Don’t won’t about it... yeah well they lied! My credit score dropped 62 points because my payment was late... do not - I repeat - do not sue this company. I am disgusted. It’s ran by a retired admiral. You would think they would care about veterans... you would be wrong.", "rating": 1}, {"title": "I receive non-stop unsolicited mailers…", "text": "I receive non-stop unsolicited mailers from this company. They clearly know they're over mailing people as they have a method to get off their mailing list but it doesn't work. You have to email it to them, and all it's done is caused me to get emails from them too.", "rating": 1}, {"title": "FINALLY RECEIVED DOCUMENT.  Asking for Admiral Lynch's help certainly got it done!", "text": "I had previously posted posted positive review of NewDay.  My second refinance with them, all went well with closing, but they required original power of attorney for my husband, and was promised this would be returned.  I have followed up since closing to get the document back, and still have not received.  This was their last response dated 9/28/2020 \"Yes our recording dept will be returning this to you directly.  It should be sent out soon to you and I will let them know to get it rushed for you.\".  Still have not received.", "rating": 1}, {"title": "Don't understand I applied but was…", "text": "Don't understand I applied but was turned down because I missed a truck payment last November because myself and family was quarantined for 6 weeks do to covid 19 and in December I paid bought payments but no one cares I thought you were here to help us", "rating": 1}, {"title": "I was disappointed with the bait and…", "text": "I was disappointed with the bait and switch tactic that was used on my loan. I asked for the 100% refi and I ended with refinancing a a lower rate that I bought down the rate with. Did not look like you were looking out for this veteran", "rating": 1}, {"title": "Veterans beware", "text": "Veterans beware. I was very disappointed in this process.  The loan process went smoothly enough however they took money out to pay my taxes and for 5 months now have not paid my taxes. I'm about to become delinquent because they are not paying the taxes. Im going to have to pay out of pocket, means I will have paid for my taxes twice now...I'm not going to lose my house for their ineptitude.. When I call to inquire about the status all I get is lip service from people who claim to be managers and their escalation team. I give them credit for being polite but I need action.", "rating": 1}, {"title": "Got snail mail saying congratulations…", "text": "Got snail mail saying congratulations veteran.....um, problem is I am not a veteran. Never served, so how come I am getting misleading snail mail from NewDayUSA? Thanks for the reply, but you didn't answer my question.", "rating": 1}, {"title": "I am once again rating New Day USA", "text": "I am once again rating New Day USA, they are untrustworthy , my original review explained my situation how we were told after taking our home out of our trust that cost $375 plus fees for filing ect... that they could not help us. I was furious and a man named Benjamin decided after he read my review that NOW they could help us, wellllll the interest rate is WAY to high now and he only offered us that after the horrible review , these folks are not for you, they talk a good talk but dont deliver. We received the $375 back that it took to take our home out of the trust but Benjamin told us we could not get the second $375 to put back into the trust , they are shady and its all about the money for them no integrity at all, as a disabled vet I would have hoped for something better from them. BEWARE", "rating": 1}, {"title": "Be careful about the closing costs added to your loan", "text": "I spoke with a NewDay USA rep this AM.  He was great, but...the \"deal\" offered and advertised in the mail and on TV, by Newday USA, is a bit misleading.  I simply wanted to refinance my mortgage of about $294K to see if I could lower my monthly payment.  In order to do that, I would need to add in, to my new loan, about $18,000 in closing costs.  My monthly premium would be lowered by $215, however, it would take 6.5 years to recover the $18, 000 that would be added to my loan.  So, be sure to ask the question...\"how much will I pay to have my monthly mortgage premium reduced.\"", "rating": 1}, {"title": "We worked over three months sending in…", "text": "We worked over three months sending in paperwork that was \"misplaced\" MULTIPLE times, two different agents after one apparently left the company but we were never informed or moved to a new agent.  We were told many times there was no issue and the refi was already approved,\"just a few more paperwork issues\".  Then suddenly we were told it wasn't approved.  Absolute garbage customer service.  Lied to on multiple occasions.  These people should be ashamed treating an older veteran this way.  You've upset her to the point of her sobbing because of all the hoops she went through after your lies and mishandling of private banking information.  Garbage company.", "rating": 1}, {"title": "I am getting tired of all their…", "text": "I am getting tired of all their commercials and especially the female spokes person. There are banks that have better rates you just have to call and ask like I did. My Credit Union under cut USA Day rates", "rating": 1}, {"title": "We loved the commercials", "text": "We loved the commercials, however, our experience was awful!  We have ;urchased and re-financed many homes over 50 years and this was the worst experience we have ever had.  We began in November with our initial application, and 5 months later we finally closed.  The process was cumbersome, redundant and so slow that we had to update our information many times.  The accuracy of the documents required many corrections before we agreed to sign.  Our loan officer, Mr. Harkness did the best job he could, but he was obviously hindered by the New Day process. He communicated well and was very diligent.   Needless to say, we will not be recommending New Day to any veteran.", "rating": 1}, {"title": "Not as Advertised", "text": "Your as advertised, no out of pocket expense, was not true in our case. Our Account Executive did not know the process for our area causing unnecessary expense, worry, and time delays. For example water report for well, (cost to us) septic system report, (cost to us) termite inspections (cost to us) You state no appraisal required, but we were required to have an individual come to out home to an appraisal. You state No income verification but one required.The additional out of pocket cost to us was approximately, $1000.00The closing finally did occur, with Notary coming to our home with all  required documents. She was very knowledgeable and efficient.", "rating": 1}, {"title": "Communications breakdown ..", "text": "Communications breakdown ... with apologies to Led Zeppelin.  Was bombarded with phone calls and emails.  Selected one associate to work with.  He was supposed to stop all the calls and emails .. he didn't.  I asked him to send me a list of all required information ... he didn't.  We arranged a call at a specific day and time.  When I tried calling the company's robot answering system left me in a loop that only disconnecting cured.  I tried calling the cell phone number provided but got dumped into an answering system that didn't even let me finish my message.  Sheer frustration.  Not worth the time already invested so decided to cut my losses and opt out of their process.", "rating": 1}, {"title": "Don't waste your time", "text": "They had us spend over a thousand dollars out of our own pocket an# still would not okay the loan without doing even more before approving", "rating": 1}, {"title": "I have been approved by multiple…", "text": "I have been approved by multiple mortgage companies but new day would not accept my supervisors email to show that I can relocate. Beware of this company and their commercials that the want to help veterans", "rating": 1}, {"title": "Veteran's BEWARE!   Would not recommend!", "text": "My original loan agent was fired during my application process- I was lied to about it.  The second person rushed/pushed me through the process, provided misinformation about how much I could expect at closing, and in general did not listen to my requests.   When I tried to explain the situation that the original loan agent and I discussed, he said that he was sorry but that was misleading information and not possible.  When I tried to discuss the timing of the closing, he told me that could not adust and pushed the closing 14 days earlier.  At the closing when I noted the mistakes in the pre-paids, it was too late to make changes.I would not recommend New Day to ANY veteran the didn't know their mtg. financing well.", "rating": 1}, {"title": "He lied", "text": "My rep was Tony, he told me about this new program they had to be able to get me a refi. It sounded great. Went through a month of getting papers and all he needed. All the while he’s reassuring me that I should have no problems getting approved. Got the appraisal done and he calls me to tell me otherwise. Said that it couldn’t be done because it’s a manufactured home. Normally I wouldn’t get worked up about that but I told him from the beginning that it was and he still led me on. I know I told him cause I explained that it’s on a permanent foundation and can never be taken apart or moved again. He got my hopes up then just like that crushed me. I’m going through enough right now and the last thing I needed was another let down.", "rating": 1}, {"title": "I'm very sad that I've read good…", "text": "I'm very sad that I've read good reviews on this company. We've been working with William Hall since August. It's now January. He has ran our credit twice. He never returns calls or emails. He would always say we can wrap it up in a week. A week would come and go then he would say he needed something else. This has gone on since the beginning. I'm disgusted with this company I would tell people to run. We have asked to speak with managers and nothing happens. Basically they left us with nothing other than running our credit. Not sure if that's how they make money by selling our information. Hate that they even have commercial on Fox News.Course they replied to this post, but of course NO management ever called!", "rating": 1}, {"title": "New Day isn’t truly concerned about the vet!", "text": "I am a 100% combat disabled vet and because in 2008 the bottom fell out of housing and I did the right thing in 2017 after I bought a new home I gave the toxic property back as a in lue of and Wells Fargo was understanding and gave me no issues, now my house is a va secured loan and I wanted to refi to better price New Day decides nope because my non secured house that I did NOT just let go and stop paying they will not allow me to refinance my secured house that I have no problem paying for! They are ONLY in it for the bottom dollar and could care less about the vet who is hurting! Dont use them if you are thinking about it. The Lady who helped was very nice she did a great job its the Adm who makes these policies that is to blame !", "rating": 1}, {"title": "Every facet from calling the ad on the…", "text": "Every facet from calling the ad on the History channel to the gentleman from the notary public providing the forms to sign for closing, have been nothing short of convenience and professionalism.", "rating": 1}, {"title": "NEVER Recommend!", "text": "A number of months ago we applied for a re-finance. I am a Vietnam veteran, have a small farm with nice home. NewDay took all my info and Finally replied that we qualify. Called an was told our debt to income was too high. With excellent credit scores, 18 yrs. of never a late or missed payment, ONLY other debt besides $94,000 for home was $4,800 due for car, NO credit card debt or any outstanding bills and, last our property was valued over $300,000!!! There is No Way their evaluation was correct! Went to a small local bank and had an even cheaper loan in a couple days!! Even with a Purple Heart this veteran was slapped in the face!! The agents were not informed and seemd confused by questions. Would NEVER recommend them...they are NOT for the Veteran!", "rating": 1}, {"title": "No Help For Wounded Warriors", "text": "Over the past 3 weeks I have spoke with several NewDay “employees” (5 to be exact) of which none were helpful, regarding obtaining an IRS W9 form from your company (first contact was 11/29/21). I requested this form as it is needed by the Wounded Warrior Project and American Red Cross to assist qualified vets in mortgage relief for 100% Combat Wounded / Disabled veterans. As your company is totally unsat in assisting me I will be moving back to Rocket Mortgage after the first of the year. I am completely unimpressed with your customer service and feel totally disrespected as a 100% disabled wounded warrior. Your commercials are apparently mere scams to use veterans as poster children for you bottomline. I cannot and will not recommend your company to anyone, especially veterans. Very sad.Dr. Russell Hale, BCCLCDR, CHC, USN (Ret)", "rating": 1}, {"title": "Frustrating", "text": "We had a VA loan on our home in West Virginia, through a different lender, and it went so smooth, with absolutely no out-of-pocket costs.NewDay USA was the most frustrating company I've ever had to deal with.  I sent several items to them, only to turn around and have to send it again.  We started out with total closing costs out of our pocket at $7700, then it dropped to $5200, and then to $3900.  The day before closing, we found out that NewDay USA didn't have one form that they needed from the Putnam County Clerk; therefore, our closing was postponed from 9/9/21 to 9/14/21.  We already had everything scheduled, including the piano mover and all of the utility changes.  Needless to say, it wasn't a pleasant experience.  If we ever sell and buy another one, we will go with Veterans United again.", "rating": 1}, {"title": "F*cked up...don't deal Steven Wilbert…", "text": "F*cked up...don't deal Steven Wilbert Clerizier!! Doesn't communicate well. Always talking about calling ppl back but he never does. Or my computer doesn't work!!!", "rating": 1}, {"title": "I was trying to refinance my home", "text": "I was trying to refinance my home, they collected all my information. I asked mid-way if that was necessary to see what rates I could qualify for.... I was asking because I know I have excellent credit and an income to back it. Instead of telling me what rate I could get at my best case scenario and asking me if I would want to continue, they ran my credit to tell me that the rate is the same is my current loan. Now I've gone nowhere and have a hard inquiry on my application. Not to mention they took more than 20 mins for a 2 minute phone call. I am going to avoid any company that can't work in an efficient manner. This means they're only screening customers that best benefit them but give no regards as to what their actions do to inquiring customers' credits.", "rating": 1}, {"title": "I recently refinanced with New Day USA…", "text": "I recently refinanced with New Day USA and the agent doing the refi assured me that my mortgage would be serviced by New Day USA and not my old mortgage company. I asked him several times and he guaranteed that my old mortgage company would not get my mortgage. Now, just a week before my first payment is due, I received a bill and a letter from my old mortgage company stating that they are now serving my mortgage from New Day and that I have to make my first payment to. This really put me in a pickle because my bank has already sent a check for my first payment to New Day. Now I have to get my bank to put a stop payment on that check and make another out to my old mortgage company. I feel that New Day's agent lied to me and I do not appreciate being lied to.", "rating": 1}, {"title": "Is business down?", "text": "Is business down?? Tattiana dressings are. Getting lower & lower in front! Just go ahead & show us her tits & get it over with.", "rating": 1}, {"title": "Requires US Veterans to give up right to sue or participate in class action.", "text": "I am a US Veteran, reacting to a TV ad for New Day USA refinancing program. While filling out the online form on the company's website, I was asked to agree to all Terms and Conditions, which includes waiving my rights to a jury trial or participating in a class action suit in any dispute with New Day USA.When I called to question this, the call taker was unfamiliar with this Condition, and instead pressed me to give more information about myself, clearly more interested in making a sale than in answering my questions about this restriction or referring me to someone who could answer.  This evasion suggests the company has had individual suits and/or class action suits filed against it. Surprising and disappointing that a company that purports to favor US Veterans would require us to give up one of our basic rights.", "rating": 1}, {"title": "Was cleared in May for loan from NewDay…", "text": "Was cleared in May for loan from NewDay first loan officer Michael Jones was professional and courteous .NewDay changed loan officers several times, NewDay took a couple more weeks than they were supposed to.  Everything requested by NewDay  that held the loan up we had furnished at least once sometimes three or four times.  On the way to the Title Co. we received a call from NewDay wanting yet more information that had been furnished at least four previous times.  We had to sit in front of the Title Co.  waiting on NewDay before they sent closing paperwork over for over three and a half hours.  We kept trying to call NewDay last several days no response.  We went to NewDay in the first place because I’m a retired disabled veteran.  I guess this is the thanks NewDay gives to veterans.", "rating": 1}, {"title": "I am so glad I decided to go with New…", "text": "I am so glad I decided to go with New Day. I had all ready payed another co.500.00. I . good that I am with many  brother and sister. Let me say mr.Silva was exellent . thank again", "rating": 1}, {"title": "Worst Service Ever!", "text": "Worst service I have ever received from any company! No returned emails or phone calls from the rep or customer service.1710325.\"Followup\" Got a call back from customer service on August 6th after my review. She told me she would get a senior account executive to call me back and address my concerns. She then gave me her direct phone number in an email if I had any other concerns. A supposed senior account executive then called me on August 6th and told me he would look into my concerns and get back to me by the end of the day and texted me his contact info. Today is August 24th and I have left 3 messages for the senior executive and 2 messages for the customer service rep that gave me her direct line. NO RETURNED PHONE CALL FROM EITHER!!!  Veterans beware, it is a numbers game with this company. They could care less about you!", "rating": 1}, {"title": "It almost all fell apart at closing.", "text": "Pre-Approval process was fantastic. Never able to get a straight answer as far as a timeline. Both parties drove 2 hours for the closing, and the notary bailed thirty mins before we were supposed to sign - citing that her husband wouldn’t let her drive that late at night (6pm) after already being assigned to us. So we ended up waiting 2 more hours for a second notary to take the case on short notice. She’s the bomb. Also was outright lied to by our agent during the disclosures about the seller paying closing costs, as that was not agreed upon on the seller’s side. He was never contacted by title. He was seeing the documents for the first time at closing. We had to cut him a check for the closing costs in order for us to finish closing on schedule. Ridiculous and frustrating. Plus the added expense on my end. I will not use New Day in the future after this experience.", "rating": 1}, {"title": "Do Not Do Business with Alex Foley or NewDay", "text": "I worked with Alex Foley. He was slow in returning my initial calls and he does not even know his own company's policies. At the beginning of the COVID-19 outbreak, I took a forbearance under the relief plan. I stopped the forbearance and paid it back early. I told Alex this and he did not bother to tell me that New Day's underwriters do not bother to investigate anything unusual. Alex's manager told me that if underwriting sees a forbearance in six months, they immediately reject the application. There is no appeal process. I took the forbearance to help free up cash for a homeless family.  I ended the forbearance and paid it back early. They denied me on Veterans Day. This is the thanks I get. Also, they made themselves the beneficiary on my homeowners insurance without my knowledge or consent.", "rating": 1}, {"title": "Only cares about the numbers, not the person", "text": "Overall start to finish, this was one of the worst experiences that I've had. Originally was supposed to close in November. Was delayed by almost a month because the VA appraisal was ordered in the wrong county. It took me calling the local regional VA office myself to find this out, and I had to report it back to my loan officer.Additionally, when the paperwork review was started, I was given 1 item to correct, once that was fixed, I was given another item, then another, then another. This went on for around 5 items I needed to correct. I still cannot understand why I wasn't given all those items at once to correct, and could have saved over a week there.Finally, overall I was made to feel like an inconvenience each time I reached out for an update. If the numbers I received hadn't been exactly what I need financially, I would have pulled out from dealing with New Day all together.", "rating": 1}, {"title": "Newday USA refi", "text": "Our 'Account Executive' is worthless.  Phone calls and emails go unreturned. Our refi has closed yet remains unfunded. The whole refi experience has been terrible.", "rating": 1}, {"title": "If I knew that the closing cost was…", "text": "If I knew that the closing cost was going to cost over $15,000 I would have never gone NewDay USA,  what I received from my refinancing, was ,$32,858.43 with rocket mortgage I owe on the house $113000. More or less. And refinancing with NewDay USA I owe now $166.999. The interest Didnt go down low as I thought.  And I can't figure where  $6,000 went to. I was suckered in,  nice job guys what a way to go, I am sure I'm going to spread the word around not to go with NewDay USA. From experience from somebody that got it in the butt,  i am sure Temi Fawehimi is enjoying his 2 week vacation in Hawaii with the commission he made of me, and of course everybody that got a piece of the commission. And if you guys can stop sending me mail indicating I will receive $54,000.00 if refinancing with NewDay USA. Yes I am still getting  letters. Not much to say good about it. Would appreciate nobody email's  me no more.", "rating": 1}, {"title": "Wounded Warrior Assist F/U from 12/16/21", "text": "Follow up on my review from 12/16/21I have contacted NewDayUSA Financial more than 2 dozen times and cannot get to speak to anyone beyond a first or second level script reader. And now, after several individuals have returned calls I still cannot get a IRS Form W-9. My request was escalated to the point it was sent outside of the company to a customer resolution specialist with ServiceMac (FirstAmerican) and guess what? That’s right, Ms. Rhonda the contractor who promised the world and delivered like NewDay, sent the requester a W-9 for her company, who is not my lender.  So there is not resolution and I could not recommend a company less than I do NewDay. This is now theater of the absurd. Their customer service and follow up after closing and getting paid is to pass along to third parties? First, why? I requested a tax form from NewDayUSA- a W9 form. Is it that hard? And second why is a request for a tax form something to be escalated to consumer relations specialist? Completely UNSAT.", "rating": 1}, {"title": "Fleecing Veterans…", "text": "Update 8.13.21. Former Admiral is fleecing veterans loyalty by charging 2%points that no other lender charges to get the same rate. Hes not his rank and should quit using it to fleece veterans. It took this complaint to get them to release the appraisal and not a word from the pathetic customer service rep warren gatewood. . It took a complaint to trust Update: warren gatewood has the information from myself and Truist, formally SuntrustI started the loan application with Warren Gatewood assistant vice president. When they refuse to email me the terms and then told me they would be charging me 2 points at 1% per point to get down to a loan rate the same as other lenders it seemed a fleecing of our veterans. As they did my appraisal they are refusing to release the VA form to the new lender. It seems to me they are preying on Veterans loyalties and fleecing them out of thousands of dollars by charging the additional points that other lenders will not", "rating": 1}, {"title": "Too Aggressive", "text": "Too Aggressive. I have been trying to get them to stopmailing me 2 or 3 times a week for the past 8 years and they won’t stop the harassment.", "rating": 1}, {"title": "Buyer beware, bait and switch, set you up for bad business", "text": "My experience is turned out to be deceived, bate and switch, i was  told, and sign a  rate fix at 2.5%  ....... 30 days later I get a letter  from usa..stating they are now switching, company name and changing rate from fixed to variable rate!!!!!!, what  kind of bait and switch  and  taking advantage of 100% disable vet. Buyer beware!!!!!!! This is a company full of lies, and is not out for vets at all ..just a playing games to take your money, and maybe lose your home, set you up for big... Problems. Time to expose this terrible company, let all veterans know.. that what  say and what they do are two different things.  I will start with lawyers, then get  in touch  with vfw,  American legion , wounded worrier project, and any organizations that vets talk together about company like this  one ,scaming and looking for a to take your money, and your home, don't  get  scammed!!! This company will lie to you. Shame on usa today, setting up people with great credit rating, to spit on them Buyer beware!!!!!!!!!!!!!!!", "rating": 1}, {"title": "This company is an absolute disgrace", "text": "They don't deserve one star! We refinanced through them one year ago and thought that they would be good because they're supposed to be veteran friendly. That's a complete joke, they do not care about vets, especially disabled vets! We have always made our payments early and sometimes make an overpayment. Recently, we've been trying to get them to send an email to our county tax office, that would take them all of 2 minutes, but they have jerked us around for over 3 months! They have no legal reason to not request a tax refund, for overpayment, on our behalf. The only reason we can think of is that they are completely inept and they just don't care. It's our money, but they are holding it hostage, out of spite. at this point. I would never recommend this mortgage company and as soon as we can, we're going to find a different one, a company that truly cares about veterans! In the meantime, we might actually have to hire a lawyer, just to deal with our own mortgage company, incredible!", "rating": 1}, {"title": "False advertising", "text": "False advertising, misleading our veterans. They need to stop. They’ve been fined in the past.", "rating": 1}, {"title": "Scamming American Veterans", "text": "Customer service is the worst I have ever experienced in my life. If it would let me give 0 stars I would. After waiting 5 almost 6 months, credit being pulled twice they finally told me they weren't going to be able to close my loan. Every time I spoke with my loan officer William Hall which was only a handful of times,he would tell me we were in the home stretch and will be closing in just a few days. I believe this type of customer service is unethical and doesn't hold true to the values/mission statement they have on their website and doesn't match up with what you hear Admiral Lynch say on TV. Very disappointing they targeting and scamming veterans like myself and many others I have learned about over the past few weeks. I wish Admiral Lynch would read this and give me a call and tell me personally that this isn't the way they conduct business but I know that will never happen. Please read all reviews including BBB reviews. I don't want any other veteran to go through what I did.", "rating": 1}, {"title": "loan # 9102070276", "text": "loan # 9102070276As of 1/18/2021 we have not received the $972 we were told was on the way from Lending tree, as you know we were charged an extra payment by Planet Home Lending because Newday failed to payoff the mortgage in full held by Lending tree on or before the agreed on date.My under standing according to Planet Lending is that Newday did not pay off the total amount owing on the mortgage, because of that Planet Lending charged us another payment for December, we want those funds returned ASAP!  IF NOT;we will  contact a Lawyer to take what ever action is necessary against Newday and Planet lending as well as filing complaints with what ever state and or federal agencies that deal with lending fraud.The closing figures between Newday and Planet lending can not be exact as we made an extra payment to Planet lending that was or should have been credited to our account.I don't care who resolves this issue but unless it is resolved within 7 days we are moving ahead against both parties", "rating": 1}, {"title": "1st let me say I'm a veteran with 16…", "text": "1st let me say I'm a veteran with 16 years of service. I contacted NewDay USA thinking I would be able to get a better rate and some cash out using my VA benefits. NOT TRUE!!!!! They tried to rape me financially. My current rate with Rocket Mortgage is 2.50% no closing costs, no appraisal fee, no under writing fee, no points, only the VA funding fee with Rocket Mortgage, plus I took out $40K in equity on a 30 year note. NewDay wanted to sell me a 25 year 3.65% rate  taking $40K in equity. 3rd party costs of $3864., Settlement costs of $4483. 1% origination fee $4159. 2 discount points of $8319. VA funding $14,455. Are F-ing kidding me! and its gets worse. If I didnt take the 2 discounts points at $8319 then my interest rate would go up to 4.85% I asked you how is this serving veterans? other than sticking it in my A** I'm telling everyone I know to stay the H*ll away from NewDay on all my social media sites and through my blog. What a disgrace they should be ashamed for taking advantage of veterans. BTW my  credit is excellent and have never had a late payment on anything.", "rating": 1}, {"title": "This was an awful and exhausting…", "text": "This was an awful and exhausting experience.  The first loan officer?two weeks into the loan process, went on an extended leave and never notified us, i called and left msgs and never was called back, the second loan officer was awful, he never responded to text mgs, phone calls or emails!  It took weeks to get the appraisal back, when i requested a copy(sent by email), the file was encrypted!  (97 pages). I was told i would recv copy at closing, I did not!,  it was sent later by mail with half of pages missing.  The day before closing yhe Notary called to confirm, and told me that the officer told her we were meeting at A fast food place, Chik fil a!  huh?, I told her that were supposed to fo it at my home, if she hadn’t called, she would have been at the restaurant snd I would have been home ( she thought it was odd to me there!), Trent NEVER called to inform me of the meeting place! I could go on and on, needless to say Im glad it’s over.  My husband is a VET and we expected better service from a company that claims to do the BEST for VETS….", "rating": 1}, {"title": "A very disappointing experience…", "text": "After watching numerous NewDay USA ads on tv, and as a disabled veteran myself, I had anticipated a sincere and supportive attitude from and relationship with the NewDay USA mortgage processing staff. I was very wrong! EVERYTHING about our NewDay experience was frustrating…or worse! First, we were pressured into digitally signing a document that we had not and could not read. And, when we asked about the length of the document and were told that it was 70+ pages, we were also told by the NewDay representative, literally, “Don’t worry, I will cover the highlights.”That did NOT happen, and it was also the beginning of an alarming pattern of non-disclosure of very important and significant information.The realtors involved with our sale and purchase were great. However, virtually ALL of the NewDay employees that we had discussions with during this process (except for the out-sourced “purchase advocate”) were consistently and seemingly deliberately vague, non-responsive, misleading or, at best, patronizing. This whole mortgage process was disappointing, and it was made much more painful and difficult than it could have and should have been. Was I wrong to expect honesty, integrity and customer care? Veterans should feel supported during such a process, not used and (though I don’t like saying it) even financially abused.", "rating": 1}, {"title": "They don’t help all veterans", "text": "They don’t help all veterans, only the ones with great credit. If you’re a veteran who actually needs help, don’t go here.", "rating": 1}, {"title": "NEW DAY TAKING ADVANTAGE OF VETS", "text": "Stay clear of this New Day con, there is nothing legitimate about them, what they did to me is criminal", "rating": 1}, {"title": "Refinancing my home through New Day USA…", "text": "Refinancing my home through New Day USA proved to be one of the worst experiences I've had in a long time.I was totally frustrated and pissed off most of the time. I am ex-military and people will understand when I say it was an utter s**t-show for me.I'm not sure if it was the agent I had, or the whole organization.I was refinancing to pay off a travel trailer and a credit card. I told the agent, Justin Abrams, that I had recently refinanced my travel trailer through Muskegon Federal Credit Union. Prior to that I had a finance through MSU Federal Credit Union. He assured me that the accounting people would take care of that. When I received the check for the payoff on the trailer it was addressed to MSU Federal Credit Union, and not Muskegon Federal Credit Union. That started a whole debacle, wherein I was trying to prove that I had refinanced trailer through Muskegon Federal Credit Union. They left it to me to try to straight things out for them. In the end I never did get a check made out to Muskegon Federal Credit Union, but rather to myself.I would never use the services of New Day USA again, after the experience I had.", "rating": 1}, {"title": "Disappointing Experience", "text": "Worse experience working with a lender for a refinance or new loan in 35 years.Experience rapidly deteriorated once an appraisal was received.  Issues with rate lock - two notices were received, both dated before I received communication regarding confirmation of lock;  Cost ~0.5% rate.One day before \"advertised close\", no communication was received.  I ended up closing over one month later - total process for a refinance over 2 months. Current lenders were blamed for not providing information; one lender contended no requests were ever received. Issues with final disclosure documents; changes made up to the night prior to close.  Lack of communication with Title company, notary, and inaccurate closure documents required last minute wire transfer (at my expense).  Two and a half weeks after close, no communication regarding loan servicing; only communication has been this survey. I am however still receiving inquires via mail regarding refinancing my loan.  My hope is that the loan is sold off quickly.  As a veteran and former Naval officer, I can not recommend or endorse NewDay USA.", "rating": 1}, {"title": "Your firm is not at all what it says it…", "text": "Your firm is not at all what it says it is I found Mr. Craig Burris not forth coming and his numbers did not come in where he said they would. When I ask him how come I'm paying more he told me my insurance went up. I went 3.25 to a 2.62 rate and my house payment went up not down. I will not use you or your firm again and I recommend Vets look for another lender. It is sad that I have had the displeasure of dealing with this firm it won't happen again. I signed my loan DOC's because I was told not make my December payment. I was first told that my loan would close on the 1st it didn't close until the 14th. I didn't want any negative remarks on my credit report. I felt through this process that I was a burden to Mr. Craig Burris. My loan was locked into a rate for so long that a better rate became available, was I offered the lower rate no, I had to resign at the old rate. I felt like your firm didn't do anything to get me a better rate. I have never had a refi where I ended up paying more that when I started. Last but not least not happy at all with these results. One very unhappy Retiree!!!", "rating": 1}, {"title": "Want real, honest feedback? Here…", "text": "If I could make any recommendations, it would be to never use NewDay. This process took nearly 4 months. It took so long that I had to have my credit pulled twice because the time limit expired before we closed. On top of that, I was called and emailed so many times with changes in lists of requirements that I don’t even have an estimated number. My wife and I both have solid credit, are both veterans, and have owned or home for a few years now. Also, and probably the worst part, is that this took SO long that the rates changed and we had to take a higher interest rate then what we were originally quoted. This pisses me off because we were a month and a half into the process already. So we we’re left with a decision to either keep pushing through or start all over with another company (which would have hit our credit with a second hard inquiry). Out of principal, I chose to continue on because this company supposedly supports veterans. I should have stopped everything and gone with another company. If I could give zero stars on this review, I would. Thank goodness we’re financially able to take such a setback. I could only imagine if this happened to a veteran who needed this done in a timely manor. …..What a sh!t show.", "rating": 1}, {"title": "My wife and I were extremely…", "text": "My wife and I were extremely disappointed in the service from New Day. What was supposed to take 30 to 60 days ended up being 6 months. We felt like Gabby had no idea what she was doing. We had to have two home inspections and we find out now that there was water under our house with mold that nobody mentioned.  We had sold our trailer and committed to buy another and my wife had to take  $45,000 out of her IRA because we were supposed to close any day.  She needed to pay that back within 60 calendar days with no penalties plus she had to pay $18,000 in taxes to take it out.  The process went long over \"the any day now\".  Like I said it was 6 months to get it finalized. We filed papers that were recorded by the clerks office,in our county, yet the VA attorney wouldnIt accept them.  The VA blamed New Day, New Day blamed the VA.  New Day would promise to call back multiple times and then wouldnt. I really felt like we were just tossed to and fro and it ended up costing us money and so much heartache and stress I can't even begin to tell you. Because it took so long, they ended up doing two credit checks, which dinged our credit TWICE!! I would NEVER deal with New Day again....probably one of the most stressful experiences for both my wife and me.", "rating": 1}, {"title": "I did not have a great experience with…", "text": "I did not have a great experience with NewDay loan.  On the website it stated that a veteran would have a proactive experience, you wouldn’t need an appraisal, and that they had a closing guarantee.   We had to have our home appraised, and because we were given a closing date.  We turned away others who were soliciting our business.  We were told 3 days  before closing that we could not close, unless we could come up with more income.  Our agent Tom Castanza stated late, that we could contact him if anything changed and that we could use them as a resource.  He has not returned any calls from all of his numbers.  I had to call and ask someone else to have him call us.  Not to mention that the person I spoke with told me he was on the phone.  Which meant he’s just been avoiding returning our phone call.  I’m perturbed at the late notice and the lack of follow-up on his part.  I served during Desert/Shield.  It seems that this agency over promises and under delivers.  I’m one Veteran who has experienced this from various agencies that state that they are here to help but don’t.  It seems that don’t want another exercise In futility, don’t chance them running your credit and not delivering when you can use someone else who has a better success rate.", "rating": 1}, {"title": "Scam on Veterans", "text": "I can’t tell you about their fees or customer service, but what I can tell you is that their hype and claim on the commercials about doing this for the Veteran and for the Veteran is a lie and they are just using vets to make money.  I am a retired vet and had to do a loan modification in 2020 due to COVID and a job loss.  I ended my deferment as soon as I found a new job and the lender talked me into a Loan Modification BUT should have just done a refinance instead, but was mislead by my lender into doing a mod instead.  These lending companies must be getting some benefit from the federal government to do mods instead of offering refinances.  This ultimately hurt me and my future as I did not need a loan modification.  So we now want to cash out and pay down all our debt and want to refinance my home to cash out, but NEWDAY USA has an internal NEWDAY policy that they will not loan to veterans who have had a loan modification in the past 36 monthsNOT a company I would trust and they  seem to be using veterans as they don’t really care what the situations are, and anyone who makes an internal policies to eliminate the most needy like this and then insist they are doing this for the veterans is a liar and a cheat.  They are using veterans to make money, not help veterans.This is their SCAM and they should be ashamed", "rating": 1}, {"title": "Worst company EVER!!!", "text": "Worst company EVER!!!All the promises and I get stuck with the appraisal billSTAY AWAY!!!", "rating": 1}, {"title": "This company is a joke", "text": "This company is a joke! They state they are here to help the veteran; don't believe it! This organization is no better then any other non-military organation that claims to be here for the veteran.I'm a retired Master Sergeant, 24 years and was told I do not qualify.That's funny!Went to my local credit union and had no problem getting a refi.I'm a 100% disabled retired Master Sergeant receiving a retirement and disability check. It's not like I can't pay my mortgage payment!New Day USA is not the be all, end all of refinancing that they portray themselves to be.To all my fellow veterans, do your homework, seek out options.And one more thing. New Day USA take me off your mailing list. I get so much junk mail from your organization.If you all would stop spending so much on advertising, you might be able to approve more refi applications.****12/01/2021****Since I can not reply to New Day's reply, I will edit my original post and reply here.I do not need your organization to identify me. All you need to know is, I am a veteran, like everyone else leaving feedback for other veterans.New Day USA, you do not need to further assist me, I got my refi like I said in my original reply.I will never consider this company EVER AGAIN! And to all my fellow veterans, do your homework, read reviews and go with your gut!Lastly, shame on you Thomas Lynch.", "rating": 1}, {"title": "The New Day Con", "text": "I don’t normally leave reviews but when I do it’s to help other customers out there that want to hear the truth and know what they are getting into.  New Day has been put on notice by the government for their untruthful information that they provide customers in an attempt to secure more business and revenue for their company.  Trust me, they don’t have veterans interests at the top of the list here.  I started to use them but saw their scheme during the first documents that they provide you.  First, their loan officers on the phone are not aware of lending policies and guidelines and are reading off a script.  Typical sales person.  Then they tell you will keep you informed on the process.  Couldn’t be further from the truth.  I had to call numerous times to get a hold of the loan officer I was dealing with leaving messages to call me back.  Then their paperwork.  They will not lock you into an interest rate and say it is due to fluctuating markets and they can’t guarantee that rate.  What?  Any home lender locks you in when you are signing and agreement with them.  Please avoid this company and their scheme if you can in order to put you and your family first and safe from cons out there simply trying to get richer while dragging you through the dirt.  This is coming from a military veteran.  There are better options out there.", "rating": 1}, {"title": "Slow", "text": "Slow, unresponsive services. No accountability or consistency. Go somewhere else.", "rating": 1}, {"title": "New Day USA needs to drop PHH mortgage", "text": "PHH mortgage is garbage and New Day USA should not be using them. I had to talk to five people before I got help. Also, the automated phone system sucks. There is no option to speak to a rep about something that is not in one of the choices. I spoke to two people and got cut off, or they hung up on me. Either way, no call back.  When I spoke to someone who was finding out why PHH did not pay my homeowners or flood insurance, there was a hold on releasing the funds. After waiting on hold ten minutes, the rep said she would find out what is going on and then call me back. NEVER happened. I had to call back again and go through 20 mins to talk to someone. The fifth person actually helped me. If I knew New Day USA would be using PHH, I would have never refinanced with them! In addition, I should have not had to waste my time with PHH. New Day USA should have to ensure everything goes smoothly for the customer. New Day USA should confirm everything is ok with PHH. The customer should not have to find out that the homeowners and flood was not paid by PHH by receiving bills in the mail. The two employees from New Day USA who helped us were fantastic. They were on the ball for everything and answered all my questions. They get a five star rating but New Day USA needs to drop PHH. I would never recommend New Day USA until PHH is gone", "rating": 1}, {"title": "We just did a refinance after having…", "text": "We just did a refinance after having our original mortgage with NewDay for six months.  While our Account Executive Gabrielle Garza was fantastic, this experience was a nightmare. You called us, we did not reach out.  We were told we could get 100% of the appraised value of our home.  We thought this was a good idea because we need a new roof in the next couple of years and wanted to get some debt paid off. Everything was going great until your underwriting department received our application. We were told that we could only get 90% appraised value unless we added sink hole insurance to our homeowners policy which was going to cost us and additional $500 PER MONTH on our mortgage.  We provided thirty pages of inspections and certifications to your underwriters that this house had been mitigated and had $100k of reinforcements installed to prevent any sinkhole, and also had our insurance agent provide a letter that they didn’t require us to carry this additional insurance.   In other words, if the entire state fell into a sinkhole our house would still be standing.  Your underwriting department couldn’t care less and we were told they didn’t “feel comfortable” giving us the loan at 100%. I asked if NewDay required all homes in the state of Florida to carry sinkhole insurance and was told they do not, but could not get a real answer as to why we were being required have it. We feel as though we were singled out and discriminated against, and the reason we feel this way is we were not given ANY REASONABLE explanation for the lower amount.", "rating": 1}, {"title": "RETIRED VETERANS BEWARE!!!", "text": "They called me not the other way around and promised 130K and ended up with no cash, we are willing to pay off debt, and finally you are lucky that our underwriter is even considering approving you. Now my mortgage payment is going up 700 dollars monthly and went from 2.75% to 4.6% to pay off debt that I had been paying to national debt. Starting on day one and every day for two months I had to call every creditor, scan, email, text and every form of communication with no help from New Day. Everything I sent to your associate at new day I had to send him over and over because he always said that he didn’t get it. Even once we got to the closing disclosures I had to send back 3 times because of missing debt to be paid that he was still confused about. I received a package of checks to send the creditors and had to call one of the managers at new day to find out where to mail the checks, which I spent 161.00 dollars for next day mail. Now it turns out that the checks say escrow on them which voids the settlement amount and adds thousands to what was agreed upon, now paying double in some cases. So now I have refied for 700 more monthly with a 4.6% interest rate and not even able to pay what is owed with the checked sent to me by New Day. As my associate Dylan Sipler told me, “ At least this will clear all of your debt”, what this has done has added many thousands of dollars to what was already owed. I could end owing as much as New Day just gave me, was supposed to pay 30k and could now end up owing 60K", "rating": 1}, {"title": "All went", "text": "All went. The folks that we dealt with were professional, helpful and pleasant.", "rating": 1}, {"title": "I was always very skeptical of Home…", "text": "I was always very skeptical of Home Refinance/ and more recently Cash Out Refinance programs. My mail box would overflow with offers from many companies to include New Day USA. After watching hours of commercials for New Day on the FOX Network, i decided to take the chance. The process was as tedious as I expected, and my executive loan agent was extremely professional and courteous. We did the financials and after providing all the necessary documents, I had to explain some late payments to my present Mortgage company to the underwriters. A closing date pending the appraisal, was set for Sept 4 2021. After the appraisal, I was notified by New Day that I had to make certain repairs before they would close, and that they would extend the closing date to Oct 4th in order for to get those repairs done. After spending more than $9,000.00 dollars by September 15th, i was notified by New Day that they were not able to continue the process due to the fact that I had a 120 day late payment in 2018. Why was this not discovered earlier on in the application process? I'm quite sure New Day accrued significant expenses servicing my application, but I'll bet my pension that New Day IS NOT maxed out on their credit cards and NOT behind 1 month's mortgage payment, which is exactly what this experience has resulted in. I did write an email to my executive loan processor and did not receive a reply. Looking forward to getting an explanation.", "rating": 1}, {"title": "What a dissapointment! Vets Beware!", "text": "My wife and I were extremely disappointed in the service from New Day. We were going to refinance our home late 2021. We started working with Nicholas James Barth at NewDay USA, the initial process seem very smooth however, when NewDay USA sent out the appraiser, our house did not come back as originally appraised Nicholas suggested we appealed through the VA and filled out some forms. We filled out the forms as best as we could. Although our house did appraised high enough to look at other lending options. At this point NewDay USA lost interest in our business and did not hear from Nicholas to give us any update. After a few attempts, we were able to contact Nicholas, he informed us that our account was re-assigned to Kyle Hammond and was supposed to contact us. He did not contact us until Nicholas informed him of the situation. Kyle Hammond eventually called me back and assured me that he would look into our account and let me know next steps. We did not hear back from Kyle at all after that called. We tried to access our NewDay USA portal account and found out that “Your account is no longer active. Please contact your account executive.” We tried to get a hold of Nicholas James Barth but as of today (January 12, 2022) we have not heard back from them. We were just tossed aside with no reason. My fellow active duty, guard and reserve don’t waste your time with this company, I am sure the Admiral Thomas Lynch does not hear any of these complaints, perhaps he too does not care.", "rating": 1}, {"title": "As a disabled combat veteran and…", "text": "As a disabled combat veteran and viewing the commercial with an Admiral guided me to want to refinancing utilizing New Day...waste of time and its disheartening to see a formar military member use his rank to entice people into a program which is certainly not geared for military veterans and sacrifices that are made...I lost everything after my 2nd combat deployment  and then did everything to repair my credit upon returning as a large percentage of soldiers do when returning after injuries and attempting to readjust...my finances,  job, credit score qualify me with Veterans United but not New Day...don't waste your time with New Day...just because they mention the Admiral and his team which is a bunch of crap, smoke and mirror commercials does not mean they are there for the veterans....wanted to let members of the military community that I was approved by Veterans United...would not happen w New Day...cracks me up watching those commercials from New Day utilizing military as well as former military members as a ploy...please men and women don't be fooled by this...don't you love their reply to me!!! Can't find anything or file on my case....trying to make it out that I never applied or don't exist....trust me, I would give anything to a former and current member of the armed forces and I'm not a lier!!!  We served and they are utilizing America's heroes for their own personal agenda!!!", "rating": 1}, {"title": "All was good and I thought things went…", "text": "All was good and I thought things went well, until we got our \"Notice of Action Taken and Statement of Reason(s), Statement of Credit Denial, Termination or Change\" in the mail!  As a veteran, we were interested in refinancing our mortgage.  Unfortunately, we have a revocable living trust which makes going through the process of refinancing more difficult than normal,  Have to take your home out of the trust, borrow the money, go to closing, then return the home to the living trust.  Hassel, since their offer wasn't as good as the one we had.  My statement is marked \":Value or type of collateral not sufficient\".  Even though my credit score is in the 800\"s.  This statement makes it sound as though I have not enough income or bad credit and can't borrow.  My agent Anthony Grecco informed me that this is the way they handle people that have this particular situation with a trust.  We feel insulted and are worried other institutions may see this information, although I was assured by Tony that it is an internal paper only.  We feel someone needs to make a change to the document they use for their denial.  There is a block called \"other\" but that can't be used for my situation and they couldn't even add it as a notation in the Part 11 of the document.   We are very dissatisfied with this company's handling of our case and wish we never called to check into this offer for Veterans!  Robert and Diana", "rating": 1}, {"title": "NEW DAY no friend of the VET", "text": "If you don't want to read this entirely it took from Dec 3 2020 until May 14 2021 to finally be done with loan. And New Day USA is no friend of the vet. Their loan origination fee was $5000 plus VA got $4000 plus all of the other inspections. Total closing cost over $14000. I should have walked away but I had jumped through so many hoops I felt like a trained dog.The rep I had, Alex F. was a nice guy and I cant blame him for the constant asking for more information. The underwriters I'm sure were at blame. They had me contact my bank 6 times for a payoff for my home. Each time I figured we were close to closing only to have to provide them more information. The final straw was at the closing there were 229 pages of paperwork. Thank God not everyone had to be signed but the notary went through a ream of paper for 1 loan. They took the routing numbers so they could direct deposit the funds into my bank yet today I received the check for the funds. I had signed a rate lock at one point for 2.5 % and then I had to sign another because 45 days had gone by for 2.99% (plus I paid for 2 points). I told Alex that if this loan didnt close before this rate lock expired I would not continue with the loan. He responded we could sign an extension -why the hell didnt we sign an extension for the lower rate? Do yourselves a favor and go to another lender. New Day USA is the worst financial institution I've ever dealt with.", "rating": 1}, {"title": "I have been a customer of New day for a…", "text": "I have been a customer of New day for a couple of years and have never been late on a payment.  I am a single parent and have to watch my money closely.  They needed a Christmas gift from me this year I guess. This year they have changed who I have to pay my mortgage payment several times and the last time the info on the account to take the payment from ended up having a zero and a 1 in it so they tried to take it out of my savings account instead of my checking account.  I have Tinker Federal Credit Union and have very little in savings, just enough to keep the account open. A week after I made the payment I noticed it had not come out of my account yet so I called New Day Services and asked them why.  They said they did not know why and tried to take it out of my savings again and again the bank denied access to the savings account.  I called again New Day and was told I was charged $50 for insufficient funds and I told them that there had been a mistake on the account number.  They didn't care about my payment history or anything else but getting their $50. I have sent emails to them about this and they basically say they don't care.  I try to call them and they will not answer my calls now.  I know $50 is not a lot of money to them but to my son and I it means a lot.  I hope they enjoy my son's Christmas money.  What a horrible way to treat veterans and their families.  I have requested an address to send them checks so they can't do this to me again but they just ignore me now.", "rating": 1}, {"title": "If you want to glad this is over know  call me", "text": "If you want to know  call me", "rating": 1}, {"title": "Horrible do not use these guys!", "text": "I have been dealing with New Day USA for going on 2 months trying to refinance my house now. At first I was guaranteed a lower rate nope that was a crock they came back with the same rate that i am currently in because the appraisal took so long to come back 2 weeks by the way an of course wouldnt you know it in that time the rates changes sorry about your luck.  I have provided everything required immediately and done everything that has been asked I payed out of pocket for all of the required inspections etc. I am currently in a VA mortgage that does not require flood insurance for my property. New Day is saying that in order for me to refinance that I now need to acquire flood insurance at over 6 weeks into this! How is that possible? I have provided plenty of evidence that my house is not in a flood zone and I am still met with the same response this is the worst and the most rediculous service that I have ever experienced in my life! They want me to now pay out almost another 1000 dollars to have an elevation certificate done in order to even obtain flood insurance when this property doesnt even need it.  They are just like every other mortgage company out there just out for themselves and making sure they cover themselves there is no regard for what it means for anyone else. Just for the record flood water would half to rise 27 ft to ever reach this house. please show me where that has ever happend in this area (ever) in history! Dont use New Day USA.", "rating": 1}, {"title": "Tianna commercials", "text": "These commercials are getting real old and so is this Tiaanna person.", "rating": 1}, {"title": "As a disabled Vet I was expecting a…", "text": "As a disabled Vet I was expecting a better experience. It was painful for me and emotionally upsetting for my spouse, as well as the seller. Here are a few examples. The account executive and loan processor were professional, yet several times it seemed they were not coordinating the process. I had to go back and forth between them. The Title company did not get an attorney to my closing, and took 2 business days later to finally get one so I could close. Even then, the seller was not getting paid the day of closing and thus he was not letting me have the house. He was calling New Day USA and me. I called the title co. and finally talked with the NewDay Director of Loan Processing. He fixed it and said it was an IT mistake. In other words, I was doing the job of New Day so the seller could get paid and I could get my house. I've closed on several properties. This was the most difficult, frustrating, upsetting process/closing I've experienced compared to the several properties I've bought and sold, What I've written is only a portion of what occurred. So when I asked the Acct Ex and Dir of Processing for compensation for my grief and pain they balked and would not entertain the idea, because they did not want to work at advocating for me at a higher level. Admiral Lynch, when my resturaunt food is cold or wrong the Manager normally comps me. He or she doesn't just say sorry, take my money and let me walk away with a bad taste in my mouth. Yet, I feel like this is what has happened to me. Perhaps, Sir, you can fix this.", "rating": 1}, {"title": "34 year veteran with PTSD treated with…", "text": "34 year veteran with PTSD treated with lack of respectNo New Day", "rating": 1}, {"title": "Refinance", "text": "Very expensive.  Should have refinanced thru my present company.", "rating": 1}, {"title": "The review and financing went very…", "text": "The review and financing went very smoothly. I was satisfied", "rating": 1}, {"title": "Caution please read before using this…", "text": "Caution please read before using this company. I refinanced with New Day USA about a year ago. At first everything was great; then unexpectedly my monthly payment was increased by $600. I called to ask why and I was bounced around for over an hour.  Finally I was told they had miscalculated my taxes and there was not enough in my escrow account to cover the taxes hence the payment increase.  I tried to pay what they wanted a month but could not afford it. I called back and after playing the transfer game yet again I was able to speak with a human who said “ yeah that’s over a 30% increase; that should not have happened”. They lowered the monthly payment to the maximum legally allowed amount. Odd thing is within a couple of months of the reduction I get a call saying “hey you didn’t pay what you were supposed to last month(June 2022) your $500 short.”  I found my receipts and provided them to New Day USA and provided the dates that three of the Money orders were cashed with a fourth that had not been. I informed them that all four money orders were sent in the same envelope and that they were in numerical sequence. I was told they would open an inquiry into the situation. A couple of months go by and I get a bill for over $3000 I called them back again they tell me yeah we don’t know what happened to the other 1000+ dollars and we still can’t find the other 500. They again asked for the proof of payment which I provided. Couple more months go by I get the same phone call again I have to explain the same thing again to another operator this happens three more times finally I asked to speak with a supervisor. I get told a supervisor will contact you but we can’t and won’t tell you when .  This has been going on for five months still no supervisor. I started getting threatening letters in the mail threatening foreclosure. I called them back they still can’t find the money order and they are unwilling to work with me. I went with new day USA because I thought they were a veteran friendly company my brothers and sisters I tell you this they are not.  They do not care about your circumstances and will never admit fault on their side even with proof; I strongly urge you to consider your options before dealing with this company. God bless and good luck", "rating": 1}, {"title": "I will never use NewDay again.", "text": "i startded my new home finance with nicholas monfalcone. one of the worse experiences i have had with a mortgage co. hard to reach, couldnt get straight answers from him, wouldnt call back in a timely manner. it would be several days even a week if then. he even closed my account without telling me. then i started with sara jones, and jessica feddersen. they couldnt even do simple task, would ask for same paper work several time. tried to get me and my realtor to do their job. there were times we had to because they missed 2 closing dates which cost me 2500 dollars. never said they were sorry or apologized for anything. i asked for help from there boss brittnay darnstead, which she was just as bad. they lied for each other didnt care about any of my concerns. then after missing two closing dates, didnt show any concers or a solution or help paying 2500 dollars for  all their mistakes.. they acted like they have never did a mortgage before. all 4 should find another job that doesn't have to deal with people. newday is an sorry excuse for a mortgage company. they say they care for veterans. i can promise you they dont, even disabled one(me). i even turn the tv channel when they show there commercials  i was contacted from newday usa.  all i got was words, nothing to change my mind and the way i feel.   i brought up the 2500 dollars but the rep, didnt not reply or recognized that it was there fault but i really didnt think newday would have honor and fix the problem. all i got was thanks for feedback. and will try and do better from this day forward. im disabled  and just think if they dont care about me, what do you think they would care about anyone else. stay clear of this company. this is an sorry excuse of a company that says they care about veteran and actice military members. they do one thing right... they lie and dont say they are sorry for the way they treat you.", "rating": 1}, {"title": "Very professional process", "text": "Very professional process.  Megan Sauder’s is the best.", "rating": 1}, {"title": "they lie to you", "text": "they lie to you. don't call you back. pittfull", "rating": 1}, {"title": "Horrible experience and worst customer…", "text": "Horrible experience and worst customer service of any homebuying process or refinance we have ever done. Started the process in NOVEMBER with an agent named Jason who assured us the loan would go through when he presented all our options. VA appraisal came in lower than expected and we were instructed in how to do the Reconsideration of Value process through the VA. Took a couple days to think it over and decide to proceed…..cannot reach Jason through phone or email. Finally have a live agent re-direct us to his manager Kevin Lasek who informs us he has had to take a leave of absence. Fine, life happens. Kevin becomes our manager. Impossible to reach during the entire process except when he is able to return calls and emails after hours. Assured us the process was going smoothly. Have waited 6 weeks since the new appraisal was re-submitted with higher value. Keep getting told (verbally and in writing) that the delay is because the underwriting department is “understaffed”. Also repeatedly given times that communication would occur and it was ignored and the excuse of “he was out of office” was given. Any time I am out of office I am required to set email and phone notices to indicate this. Finally reached out to Kevin’s manager last night and was told the loan couldn’t be funded. He was unable to give any clear reason except for information they *already* had at the start of this process. Have requested a clear reason for why it wasn’t approved when we were assured it would go through…..still waiting on the call back. Stay away. Absolutely wretched customer service and my husband was treated like a second- class citizen.Update- still waiting on customer service to resolve the issue. When asking for updates or for reasons that are required by law for them to give in writing- manager becomes very snippy and irritated. At this point it seems as if my husband is being discriminated against due to his disability status.", "rating": 1}, {"title": "Refinance to New Day, Terrible Experience", "text": "I recently refinanced with NewDay from USAA. I was excited about getting a better rate for my family using the streamlined VA process. The experience has not been good at all since the very beginning. The loan officer miscalculated the estimate from the start which resulted in the final loan amount increasing by over 5k! Egregious, considering I have experience with purchasing a home and refinancing in the past. The loan officer took no responsibility and blamed the software when she inserted the figures herself after I provided facts and figures from documentation I had. After that, I was told I would receive a welcome package welcoming me and providing information on submitting payments and online portal information. That welcome package never came. I had to call to request it be sent out. I was also shorted escrow refund which NewDay is looking into. I had to call NewDay to get a link emailed to me so I can set up and access my account online, it's sad I had to do that. When I was able to set up my account online, I could not submit my first payment online. I then had to call NewDay again to ask why I couldn't. I was informed by NewDay that I needed to sign a payment authorization form. NewDay rep confirmed the form was never sent to me, so they initiated it to be sent. That form was not included in my first statement that was sent to me. During that same call I asked to speak to a supervisor to voice all of these concerns and the poor quality of service and terrible experience so far. I had to wait on hold for 25 minutes before an escalation person answered the line. She did not apologize for the wait and dismissed it and told me \"it's normal for that long of a wait time\". She did help by submitting a requesting the welcome package to be sent out to me after acknowledging that it should have been sent to me, I appreciate that. If friends or family ask me about my experience with NewDay I will have to be honest in sharing my experience and feedback, and it's not good. The marketing and messages that NewDay puts out does not match or meet the expectations or experience for me.", "rating": 1}, {"title": "When I tell you I normally do NOT write Reviews - PLEASE READ", "text": "When I tell you I normally do NOT write reviews - but I needed to share this to save any other veterans the time.  My sister lost her job (while pregnant) during COVID and she came to stay with me (different state) while my brother-in-law stayed there to keep working as a Sheriff.  I picked up a lot of the family's day-to-day costs, allowing minimum for him as they are a two household family.  As a result, I needed a forbearance because I went from a house of one to a house of five.  My brother-in-law is also a Marine veteran.  I did a covid forbearance, ended it when my sister was rehired by the company as things began to ease up.  I rolled the missed payments into my loan under a COVID modification last year.  Today, looking to do a cash out refinance, I was told I could NOT be serviced because I've had a modification in the past two years.  I advised that the VA's policy is that you must wait 210 days, and I'm well past that and was told I still could not be serviced.  I explained the situation and my brother being a veteran as well (because he spoke over and over about the commitment to vets and the Admiral's mission for vets).  I was told, I could not be helped because of this.  I asked why wasn't this upfront BEFORE running my credit and taking all of my information \"on a recorded line\".  I was advised because we can't pre-screen for everyone/everything.  SURELY when in the past two years we've had a pandemic and MANY people have unfortunately yet (blessed) utilized a covid forbearance, you would ask this question upfront if you cannot provide me service. I'm trying to understand how knowing the this, knowing many vets would fall into this category, knowing the VA makes you only wait 10 days, would you still not service anyone.  But hey, company's have a right to run their business and assess the risks as they see fit - fair enough.  But to collect my data and run my credit, and NOT let me know this upfront is unfair. I also \"personally\" find it unfortunate that you don't support people in my situation.  Every company isn't for everyone but this country went through something collectively and thank goodness my family made it out.  Kind of hard to say you are a number one supporter of veterans but yet won't service anyone with a modification in the past two years when the VA's own guidance says you have to only wait 210 days. My recommendation - be fair with your practices UPFRONT.  The same way you asked me all of those prescreening questions about prior foreclosures, delinquent federal debt, etc. - ask me about that BEFORE you cause a hit on my credit report and get all of my personal and pertinent details.  I worked with a gentleman named Benjamin Taylor who is the \"Vice President\" of Loan Origination #905190. To ensure this is not a discriminatory practice, I reached out to Mr. Taylor and Corporate and requested a copy of the written policy.  As stated, my biggest issue is more of a surprise of this policy as so many have used a modification in the past two years of this pandemic (but I respect a company's risk assessment for them) and the fact this was not revealed until AFTER my credit was pulled.", "rating": 1}, {"title": "Veterans STAY AWAY!", "text": "Veterans STAY AWAY!! I’ve got no clue how this company got such a high rating!! They don’t know how to read the VA Home Loan Regulations! Told me I didn’t qualify after working on my refinance for 3 months because of the VA Seasoning Rule, I called the VA to discuss and the VA said that NewDay was reading it wrong! Asked NewDay to call to get clarification and they refused! A bunch of con artists and ass holes! If your considering refinance or VA home loan, go with Military backed Credit union!! Stay away from NewDay....terrible company!!Update: In response to NewDay’s reply; NewDay did not apply any VA guidelines in our situation! After NewDay’s poor excuse of Seasoning guidelines I contacted the Atlanta VA Regional Home Loan Office, went in to great detail and discussed my specific situation & what NewDay was insisting the issue was and relayed that back to Mr. Abrams, Supervisor of Mr. Jefferson Steeb, who apparently knows more than the VA & is to good to pick up the phone and clarify the issue at hand.  The other issue involves my 2 property’s being listed as 1 Tax Lien, I went to my local Tax Office obtained the specific request that NewDay had made for my property titles and also obtained the response & documents sent back to them; let it be know that none of the documents listed any type of lien holder information, which I had provided to Mr. Steeb showing the 2 separate collateral loans for both my property and my land. However, NewDay (not sure who) continued to say that my property had 1 Lien on it, which is the farthest thing from the truth!! NewDay can hide behind their corporate garbage, but at the end of the day they failed to clarify with the governing agency (the VA) when the guidelines they were quoting were challenged! In conclusion, I’ve asked to NewDay to turn over the Title documentation to see if it has been falsified in any way because if it has been then that becomes a Federal Crime under the Federal Mortgage Act! So far Mr. Steeb & Mr. Abrams has failed to respond to my email request or voicemail request for those documents. If not received by COB 4 June 2021 (5pm EST) my attorney will take the appropriate action!  Again...all Veterans BEWARE OF NewDay!! Don’t be fooled by their paid endorsement with Admiral Lynch!! If he cared about the company he advertised for then he would pick up the phone & call me!!", "rating": 1}, {"title": "More Than Disappointing", "text": "I have had disappointing and then bad experiences with this company.  As a veteran and seeing their advertisements, I contacted them about a year ago only to be told they could not do jumbo refi loans in my state.  But they expected they would be able to in the future. Several months ago I tried again and they said they can do jumbo loans in my state.  I asked what their best rate would be for a 30-year fixed rate jumbo loan (I told them the amount) refi with no cash out, under the assumptions, subject to later verification, that I was a veteran, would be borrowing less than 1/4 of the value of my home, had a top credit rating, and had more than enough income to qualify and nothing else that would disqualify me.  I said I wanted to know what the best interest rate could be so I could determine whether it was worth starting the refinancing process before I wasted time and privacy in providing personal information.  They refused to provide a rate without my providing information which I considered personal and confidential.More recently, after being bombarded with advertisements about their 2.25% 30-year fixed rate for veterans, I contacted them again. I told them I had a conventional loan and the amount, and a little about it and my situation and objectives to make sure it would be applicable before I started the whole process.  I was assured that this rate was available and I decided to proceed.  So they transferred me to the \"streamlined loan division\" and I began providing additional personal  information including emailing a copy of a bank statement showing my existing mortgage loan details that they requested, and they did a credit history pull, which I know was favorable.  I made it clear from the beginning that my existing loan was a conventional jumbo-sized loan (rather than a VA loan) and provided the most recent loan statement.  But they apparently didn't believe me because the NewDat agent put me on hold and actually phoned the lender to confirm what I had already told him.  (I only found out he was doing this because the lender required I be on the phone to give authorization to answer.)  When my bank confirmed what I had said about it being a conventional loan, the NewDay USA agent apologized saying that his group only handled refinancing of existing VA loans, and transferred me to another group.After the transfer, I explained the situation to this other agent and requested he confirm the availability of the advertised 2.25% rate. I was told that this rate was only available to those refinancing existing VA loans, and the rate for me would be 2.75%.  I expressed dismay that I had already provided personal and confidential information that I would not have, had I not been mislead and I requested that all such information be deleted from their systems.  This agent, though knowledgable, courteous and professional, said he could not do that.  I said I understood and asked to speak with a supervisor.  I was told to expect a call back.  I never received the call-back despite my following up a week later making that request again.I decided to proceed with another lender where I have since received approvals for a 30-year fixed jumbo loan with Annual Percentage Rate (without using my veteran status), that is better than what NewDay USA was offering even with its 2.25% come-on rate that I was not eligiible for.  That lender is Ally Bank which allows you to check and lock in a rate online, and then provide all required documents online. The experience with NewDay USA was quite disappointing especially given the advertising campaign featuring Admiral Tom Lynch.", "rating": 1}, {"title": "NewDay USA Did Not Deserve My Trust", "text": "I have had disappointing and then bad experiences with this company.  As a veteran and seeing their advertisements, I contacted them about a year ago only to be told they could not do jumbo refi loans in my state.  But they expected they would be able to in the future. Several months ago I tried again and they said they can do jumbo loans in my state.  I asked what their best rate would be for a 30-year fixed rate jumbo loan (I told them the amount) refi with no cash out, under the assumptions, subject to later verification, that I was a veteran, would be borrowing less than 1/4 of the value of my home, had a top credit rating, and had more than enough income to qualify and nothing else that would disqualify me.  I said I wanted to know what the best interest rate could be so I could determine whether it was worth starting the refinancing process before I wasted time and privacy in providing personal information.  They refused to provide a rate without my providing information which I considered personal and confidential.More recently, after being bombarded with advertisements about their 2.25% 30-year fixed rate for veterans, I contacted them again. I told them I had a conventional loan and the amount, and a little about it and my situation and objectives to make sure it would be applicable before I started the whole process.  I was assured that this rate was available and I decided to proceed.  So they transferred me to the \"streamlined loan division\" and I began providing additional personal  information including emailing a copy of a bank statement showing my existing mortgage loan details that they requested, and they did a credit history pull, which I know was favorable.  I made it clear from the beginning that my existing loan was a conventional jumbo-sized loan (rather than a VA loan) and provided the most recent loan statement.  But they apparently didn't believe me because the NewDay agent put me on hold and actually phoned the lender to confirm what I had already told him.  (I only found out he was doing this because the lender required I be on the phone to give authorization to answer.)  When my bank confirmed what I had said about it being a conventional loan, the NewDay USA agent apologized saying that his group only handled refinancing of existing VA loans, and transferred me to another group.After the transfer, I explained the situation to this other agent and requested he confirm the availability of the advertised 2.25% rate. I was told that this rate was only available to those refinancing existing VA loans, and the rate for me would be 2.75%.  I expressed dismay that I had already provided personal and confidential information that I would not have if I not been mislead, and I requested that all such information be deleted from their systems.  This agent, though knowledgable, courteous and professional, said he could not do that.  I said I understood and asked to speak with a supervisor.  I was told to expect a call back.  I never received the call-back despite my following up a week later making that request again.I decided to proceed with another lender where I have since received approvals for a 30-year fixed jumbo loan with Annual Percentage Rate (without using my veteran status), that is better than what NewDay USA was offering even if I could have gotten its 2.25% come-on rate that I was not eligible for.  That lender is Ally Bank which allows you to check and lock in a rate online, and then provide all required documents online. The experience with NewDay USA was quite disappointing especially given the advertising campaign featuring Admiral Tom Lynch.", "rating": 1}, {"title": "Another Co. Taking Advantage of Vets", "text": "As an active duty Naval Officer, it’s with no great pleasure that I write that New Day USA is not the Veteran friendly company that it advertises.  Rather, it is another mortgage company owned by PHH that preys upon Vets and uses the DOD’s resources (including imposing cost on the member’s command) to take advantage of service members while claiming to be the best option for military.  It is also not the cheapest option for Veterans. In short, the customer service was poor, their fees were high (they did not give me the free appraisal they advertise on television) and they offered numerous, laughable moments of incompetence.I could write a Stephen King length novel detailing my bad experience with New Day, but here are a few stories that sum it up in microcosm:One particular employee made seven individual requests for documents instead of doing what other mortgage companies do which is give you a list upfront. What's more, they refused to accept documents from SNIP IT Tool or from a scanning app, forcing me to find an actual PDF scanner while I was oversees. In terms of imposing cost on the command, they do not have a paralegal and rely on the title companies for the service. Because their requirements are so specific, the title company could not comply with New Day USA's demands for a Power of Attorney (which are stricter than any other mortgage company I've ever used, a claim repeated by the title company). New Day USA suggested I use my command's JAG. Big mistake. The New Day employee engaged my command paralegal in a 19 email back and forth and endangered my standing at work. In the end, I still paid someone a paralegal fee (plus an appraisal fee which was supposed to be free). Furthermore, their closing costs and interest rates were pretty average during the start of the COVID crisis.  I had at least one vendor offer a better deal with fewer closing costs or money put toward them. I stuck with New Day because I was overseas and trying to buy a house INCONUS during COVID. Again, big mistake.Last, at the 11th hour, two days before closing, the same employee informs me that he moved by closing up a day and that I need to call USAA to change all of the insurance policies I purchased. Again, this would take an hour on the phone at least and invovled calling the states from an overseas line, and it occurred at 2300 my time in Europe. When I called USAA, they claimed the employee said the policy change was not related to his attempt to move my closing day and that I had authorized it. I had not, and hadn't talked to the employee in days. I bluntly told them that my closing day would not change and that if they required different dates, they should have told me sooner than 2300 at night the day of. What's more, they called my POA rep up and had her drive an hour to their office, unscheduled and during the height of COVID.Last, even though they sold my mortgage to another company two months after I moved in, they still send me bills........One employee, a VP, was helpful; she apologized for the incompetence and threw $1,000 toward our closing costs. Dealing with her was the only good part of our experience, but when I didn't' deal with her directly, incompetence from her team took the reins.If you're a Vet, think hard before you buy what this company is selling. Many vendors deal with VA loans, New Day USA is another group taking advantage of us. Also watch their offers for Re Fi, many costs come with this. My advice, shop around and don't hit the easy button by trusting these people, a small brick and mortar lender can beat them and be more efficient. Vets beware.", "rating": 1}, {"title": "Withdrawing my Refinance, Very Bad Experience", "text": "I wanted to write this review regarding my experience with NewDayUSA. I had a VA Loan before and never had the experience that I had with NewDayUSA. First of all, there advertisement stated that there will be no Income Verification and yet that is the first thing they asked for. I started my refinance application on August 2020 to lower my mortgage payment and lock in into a low rate. I did everything that my patron asked me to do. I uploaded everything that was requested in the portal except the kitchen sink. My patro informed me that it will take awhile before we could close. I understood. I was patient and very much looking forward to the new low mortgage and rate. Days, weeks and months went by and we have not closed. I called my patron numerous time, left voice messages and texts. It was so hard to get a hold of him. By the way, I think he preferred text messaging instead of talking because that's how we communicated (texting). His voice messages stated that if I want to get in touch with him, text him at a different number. Which I did! When I did text him, it took several days before I get a response. I advised him to call me instead because i prefer of talking to him but texting is his options. Even when I request for him to call me now, it takes several days before i could get a response. Another month passed by and still have not closed. On November 5, 2020, I received a voice message requesting if I know the last mortgage company before my current one. I informed him that i don't know at this time but will surely find out. I will email him as soon as I get it. I tried my best to gather the requested information and emailed it to him. I also texted him and this time he responseded immediately. Then on November 6 at 10:52 am, he texted me and he stated that the title company is asking if I knew what title company I used for that refinance. I reply, I don't remember. I asked him if this is going to hinder our closing and asked to call me instead of texting me. No response.On November 10, 2020, 5:38 am, I texted him because I couldn't get a hold of him by phone. I was asking if we closed, please advise!  At 11:44 am, he stated that he was waiting for an update from the title company, they have been having some IT issues but he will call me lated that day. I was waiting for his call but nothing. On November 12, 2020, 7:22 pm, I texted him asking the status of the refinance. Did we Closed? No response. I then received a voice message that the fix rate has expired and i should be receiving a new esign notice. I texted and informing him that I have not received the esign notice. On November 13, 2020, 01:01 am, I recieved a text stated that he will look into it tomorrow, I should have gottena esign notice today. When I woke up at 4:48 am, i read the text and thank him. November 14, 2020, 10:05 am, i texted him that i haven't gotten the esign notice. What is the status of the closing? Thank you. He texted back at 5:24 pm stated: \"You should have gotten an email with the rate lock redisclosure, I can resend if you did not. I responded at 7:07 pm, stating i didn't get it. Please resend it. No response after that. On November 16, 2020 at 5:26 am, I texted him asking to please send me the rate lock disclosure so I could take a look and sign it. Then i went into the portal and finally saw the esign disclosure. I read it and was shock about. This is my email to him:Mr. Hall,I just saw the new disclosure. First it started at $1300+ monthly, then it went up to $1400+ and now the new monthly payment is $1500+. What's going on? It's getting closer to my old mortgage. The reason for my refinancing is to cut down my mortgage. Why the sudden increase? It's almost a $200 increase. Please explain? At 8:51 am, he texted: i will look into it and call you today. Thanks. At 4:23 pm, I texted him that I signed the rate disclosure to locked in my new rate. Can you give me the closing paperwork as soon as you can? Hopefully, i can get it this Friday. Thank you. On November 17 at 8:42 am, I texted him asking if he recieve my text and to please let me know. At 1:24 pm, he stated yes and he should be submitting my loan for clear to close once we recieve the updated payoff. I then received a voice message requesting for me to request my mortgage payoff from my current mortgage. He stated that if they requested it, it will take 30-45 days before they can recieve it. If I requested it, it will take 24-48 hours. I can't type everything because there is a limit. It took 4 months and we have not close so I decided to cancel my refinancing with NewDayUSA. I did everything they asked for but it seems that everytime that we are close, they need this and that. I had to pay my old mortgage a late payment for to months because we could close. Yes, it was a BAD Experience and regretfully withdraw from it. He stated that no need to call our main office, I will withdraw. Thank you.", "rating": 1}, {"title": "Terrible experience", "text": "It took 8 weeks and 4 days for our mortgage to complete. It sat untouched for nearly 2 weeks. We were asked to submit the same information multiple times. Such as, we were asked 5 times why we didn't pay for childcare. Answering the question: Do you pay for childcare should have been sufficient. We should not have had to prove why we didn't pay for childcare. If we said no, no should have been accepted and we move on. The process took so long that my husband had to verify his employment three times. He works for the government, we had submitted our bank statements (three times). You could tell he was being paid by looking at the bank statements. And why did we have to submit our statements three times? When we finally, had our closing, we didn't get to complete it because the seller was informed they needed money for us to close. This should not have been the case. We said many times that we were paying all fees and costs. When I questioned our originator as to why we did not know there would be money needed from the seller at closing, I was informed that she represented me, the buyer, not the seller. However, because she didn't go over the paperwork and inform us, her customer was unable to complete the sale.  It was at that point that the case was taken over by someone else and we were able to close. I do not feel like my veteran was treated with respect. Your advertisement speaks of an easy process for vets. This was not easy. It was frustrating and I\"m still not sure it was done correctly because the asking price of the house was 2,000 more than the pay off and the sellers didn't receive the difference. This was a terrible experience and I would not recommend NewDay USA to anyone. However, thank goodness for Matthew Russel for taking over the case and getting things done. Stacy", "rating": 1}, {"title": "No call back", "text": "I called their 800# and had a screener take my information and promised to have a loan officer return my call.  Since I am a Vietnam Vet, I thought I'd get a quick response.  It's been 5 days and still I've not heard from them.", "rating": 1}, {"title": "This company starts by promising…", "text": "This company starts by promising everything they can.  Including estimated closing date approx 1 month away.  I provided all documentation needed the same day I initially contacted them.  Then had to call them for updates even though Frank stated he would be in regular contact with me.  Estimated closing was Aug 3rd, we are now at the 10th with no explanation to what the issue is.  Was told I shouldn't need to make a mortgage payment to my current lender due to closing and funding before the 15th, now I have to make a late payment to them.  Today I received a call from a disaster assessment company who want to take pictures of my home for a hurricane that did not hit our area delaying closing even longer.  If you use this company do not believe their timeline or their estimated origination fee discount, neither are close to accurate.", "rating": 1}, {"title": "Fees are astronomical!", "text": "This organization should be ashamed of itself, they go after vets (such as myself) with the promise of being on their side. Their closing costs are more than 3 times than they should be. They charge 1% of the total loan, in TWO separate areas. Veterans, do yourself a favor, shop around, newday is not hard to beat at all. .", "rating": 1}, {"title": "Not a friend of this retired Veteran", "text": "Perfect credit (820) $100k equity in my home of 61/2 years.I wanted to cash out $30k and a 30 year fixed My old rate 4.5% even at a 3.5% loan with this Company that is suppose to look out for us veterans. My new monthly payment would be at least $70.00 lest than I presently paying now. Kyle told me, do to loan parameters I do not qualify because of my limited income. I have both automobiles paid for for the past 5 years and no, credit card debt, never carry a balance on   a credit card ever. Yet with all this New Day USA dismissed my request in 10 minuets, I will never look at the TV commercial the same way again. This will not go unreported to all of my retired veterans friends, and anyone else looking to get a loan from this supposed Veteran friendly company. Sad", "rating": 1}, {"title": "Why Not Available in all 50 States?", "text": "Why is this financial product not available in Massachusetts, Nevada, and several other states? My experience when this situation exists, it's because the product is defective. I would stay away from such an organization.", "rating": 1}, {"title": "NewDay USA doesn't take care of veterans.", "text": "NewDay USA is a terrible company and is not there for all veterans. I'm a US Army Veteran with 25 years of service. During my time of financial need, I contacted NewDay in order to secure a Mortgage so my wife and I would not be homeless. They refused to help us and we were forced out of the house we were living in at my last duty station. For 14 months, my wife and I were homeless until I was able to pull money out of my retirement funds to pay cash for the home we currently live in. NewDay USA claims to put their arms around veterans and help them with their mortgage needs. What a lie! Unless you are on active duty with perfect credit, they won't touch you. Don't waste your time with this dishonest company.", "rating": 1}, {"title": "Shady and they seem to jumble their figures around in an attempt to confuse the consumer", "text": "NewDay contacted me and their rep whom I'll reference as Brian R. could never give me clear figures on the closing costs. Additionally his demeanor was a bit rude, and at one point after I told him I wasn't satisfied with his vague figures he told me I should lock the rate in and \"if you can let us do our job\" they would be able to give me the actual numbers. So I did lock it in but still received vague numbers and talks of a discount. Ultimately, their closing costs were way higher than the lender I chose. The entire experience seemed shady and based on pressure tactics. I would not recommend them to anyone.", "rating": 1}, {"title": "Horrible Company", "text": "The only reason I gave them any stars was due to the fact they had one of the most professional and helpful representative's helping me. So you all need to really  thank Josh for his work ethics. I can not and do not believe that this company specialize in working with veterans or active duty military. The incompetent workers other than Josh, that I had to work with was the absolute worst. They had all my paperwork FedEx to me. It should've been sent to the notary. So I had my WHOLE ENTIRE LIFE sitting outside an apartment complex building. They didn't even tell me it was being sent directly to me. They emphasized that the paperwork would go to the notary. So I wasn't even expecting a package. I just so happen to be walking my dog at night and saw the package with my name on it. There's way more things that transpired throughout this horrible process. All I can say is I WILL NEVER DO BUSINESS WITH THIS COMPANY AGAIN. I WILL RUN FAST AND FAR FROM THEM.", "rating": 1}, {"title": "Don’t like how Tom lynch takes…", "text": "Don’t like how Tom lynch takes advantage of the young and the uneducated troops!", "rating": 1}, {"title": "My wife and I were trying to refinance…", "text": "My wife and I were trying to refinance our home.  We own a separate piece of property that for some reason they couldn't figure out was not attached to our current home even though there were separate parcel #s etc.  We worked with a fellow by the name of Devin Waller and he couldn't have been less helpful.  He screened our calls and doesn't return our emails. We were supposed to close in May and now it is the end of June.  Can't get them to call or email me back even though our credit is good (700+) and they said we should be in good shape but how would I know since I can't get them to return my calls/emails?  I would never do business with this company again or recommend them to anyone.", "rating": 1}, {"title": "I was trying to get out of my mortgage…", "text": "I was trying to get out of my mortgage company and took New Day on their offer.   Although I went with them and up my loan amount (by 9,000.00) the up side is that I could ditch my old mortgage company.  I got a letter from New Day on closing that I was sold to my original mortgage company.  I think that is a unethical just for someone to make a commission and false advertising. I will spread this around as New Day is a rip off.", "rating": 1}, {"title": "From the very start nothing was known", "text": "From the very start nothing was known.  Rate quoted was 2.99% changed to 3.25%. Documents requested kept being added to. I understand you are a business, but nickel and dime?  add to the total cost things I paid the add a little to the total at 1 point?? And The  \tThe Newday USA VA loan process for loan number 1492876 either initiated a fraudulent or knowing participated in  a fraudulent payment to our Property Owner's Association.We initiated a refinance request with Newday USA at the end of March, with the goal of closing prior to the end of April.  Document and appraisal were completed and a closing was scheduled for April 22nd.Before the closing could be completed as series of delays came up. First was the failure of Newday's Esignature process, then the need for Property Owners Association's assessment for road repairs and proof that the property was not on the market. The Esignature problem was fixed with a hardcopy signing of a Closing Disclosure that was dated April 28th.\tThe April 28th Closing Disclosure is the basis of the fraud claim.  In this document the closing date was listed as May 5th, and more importantly Payoffs at closing were listed as follows:1. First Mortgage2. Second Mortgage3. Termite and pest controlProperty Owner Association's assessment for road repairs had been answered by an Email from the Association's current President stating the 20 years of assessment had been paid and we were in dispute over amount of current payment due. \tWe were told that the actual closing date would be May 2nd. But, other delays (documentation etc.).  We did not reach our goal of end of April, but May 2nd was close.  We did not get to actual signing until May 13th.  At the signing it was  noticed that an additional Payoff to the Property Owners Association had been added..  The payoffs were now  $1,836.00 more with payments as follows:1. First Mortgage2. Second Mortgage3. Termite and pest control4. Property Owners AssociationThe notary said we could contact the Escrow company and have removed.  We tried the Escrow company and were directed to Newday.  Newday was informed that the amount was false, and that the amount assumed actions we would not take.Damage caused.  Increase total mortgage by about $2,000 ($1,836 + 1% points and increased closing costs). 30 years of 3.25% monthly payments on increased mortgage amount.", "rating": 1}, {"title": "NO Contact from New Day USA", "text": "I called New Day and spoke to a Man who answered the phone. He took some information from me and told me that a Mortgage Specialist would call me back in about one hour! That was TWO MONTHS ago and no one has ever called me. I wont be doing business with New Day USA.", "rating": 1}, {"title": "I would never recommend new day", "text": "I would never recommend new day. 3 months to close, close to $2500 I could of saved if you guys did the job you advertised. Customer Service unbelievable, I was in Customer Service for over 30 years, my advice listen to the tapes, follow my paperwork and take a look at your company. It can't be this bad without it being visible to management or else you need to look further up. I am Shocked and disappointed with you and your company. If I can be of further assistance call me.", "rating": 1}, {"title": "Not too happy", "text": "Communication was poor and service was fragmented", "rating": 1}, {"title": "Shop before you stop here.", "text": "YGKM; offered an amazing good interest rate, but wanted $22K to get there.  This is a serious rip off.  Done a bunch of VA Streamilines in my time.  I usually have very little closing costs - if any.  Did one that paid my principle down over $8K, with zero closing costs.   Look around.  Too many great deals.  Typical Military advantage taker.  You decide if this is something you want to get into by shopping this company; use a broker...independents get the best deals out there.", "rating": 1}, {"title": "Missed closing date...twice", "text": "Missed closing date...twice. Cost me over $500 in expenses due to contractors that were coordinated based on initial closing dates.", "rating": 1}, {"title": "New Day USA Disappointment", "text": "I talked to Chris Samba a week ago and started a loan application.  I asked him to review a loan application from another company to see if NewDay's term might be better. He gave me his email and direct phone line and would review it and get back to be ASAP.  He has not gotten back with me.  He has not returned my calls or answered my emails. I call another \"loan specialist\", who told me my loan application was withdrawn (no explanation why) and told me he would start the application process over again. He seem more interested in getting my business in his name then help resolve the issue.  I am very disappointed in NewDay, especially based on their advertisement presentations.", "rating": 1}, {"title": "Failed at the last minute and cost me thousands.", "text": "Night before closing got a call that we would not be able to close on time due to them not having all the paperwork. Still unknown how long we will have to wait to close. Was assured for weeks that all was good. This will cost me thousands in unexpected expenses. Unprofessional and unacceptable. Will not be recommending them to anyone. Avoid this company.", "rating": 1}, {"title": "YOU ARE LIARS!!  You'll likely not read this but just…", "text": "You'll likely not read this but just in-case you do, here is my opinion.  My loan funded on Tuesday, May 5, 2020 and my loan refi application was made on JANUARY 6, 2020 about FOUR months in processing. Ive been lied to by all of  your representatives, you lost information that was received and supported by certified mail, you lied to the State of New Jersey, so on and so forth.  I actually applied to another mortgage company during this cluster F---and was approved with a lower rate.. Once I showed this to your representatives, they matched it...I wonder why?  I will NEVER recommend your company to any veteran for fear that they would experience the unprofessional service by  in-experienced people. It was like dealing with the \"KEY STONE COPS. You advertise a smooth and speedy process which was also a lie. The funny thing is that this loan was initially placed thru your company while the rates were higher  2 years ago yet they couldn't find information from that the first go around found.  You are just INCREDIBLE. I still don't know who or where my next mortgage payment is to go to???..By the way, I have documented all the employees that contributed to this calamity including YOUR VP.   HOW DARE YOU!!!", "rating": 1}, {"title": "Easy closing not worth HORRIBLE customer service", "text": "Sales rep for the loan was great, closing was smooth and quick.  Customer service on the other side is HORRIBLE.  I called the automated line to limit the sharing of my personal info, which has probably already been sold....was told the automated line can't help me.  Called customer service...rep was rude, interrupting, speaking over me, said I had to mail in a form to limit sharing....how sketchy.  I asked to speak to his manager as the letter I was sent read \"you can contact us at any time to limit sharing\"....I was placed on hold for 12 minutes, then hung up on.  I should have researched customer service ratings prior to using this company for my refinance...I'll know for next time.", "rating": 1}, {"title": "Worst refinance we have ever done.", "text": "Worst refinance we have ever done. 6 Months. Started Oct with Ben Taylor & he dropped us in Dec when A Woodward took over. Hundreds of paper work sent & according to them our private road in a rural road was a problem for the VA. The road was deeded to us.  And our  2  basement vent less heaters which they said were not vented & we had to pay the gas (propane) company come out to write a paper about it. Stupid. A fireplace has a flue . My husband is 77 retired disabled AF vet &  we never had a VA loan before & now I know why we didn't . Plus VA says free appraisal in commercial & we paid almost $500 in as a closing fee. I will not recommend NewDay USA to any vet.", "rating": 1}, {"title": "I would like to warn any VET not to use!!!!", "text": "I would like to warn any VET not to use this company.   From the start i was lied to and given miss information.  My phone calls went unanswered, my questions went unanswered, i was told this was a done deal, only at the end to be told a absolute like about why they couldn't help me.  They wasted 2 months in this process now to find out that they were going to charge me 19k in fees!!!!!!!!!! OUTRAGEOUS!!", "rating": 1}, {"title": "The 2 persons I that handled my…", "text": "The 2 persons I that handled my mortgage were not very professional. They asked for the same things over And over again,and they had an attitude. I am a veteran and I thought this company was veteran friendly, it is not.Murphy and Walsh were the 2 people  I had to deal with.", "rating": 1}, {"title": "I wouldn’t give any stars if it was possible.", "text": "I wouldn’t give any stars if that was possible. I’m happy our refinance is finally over, but I would never use this company ever again if we hadn’t already completed. I have never received such horrible customer service ever. We were never given an update unless we called and called and called. We were told “21 day” escrow. We started our process at the end of November 2019 and just barely finished at the end of January 2020. There was plenty of time before the holidays to finish our refinance. When refinancing, the company works for the client and the client should never feel like they have to pull teeth just to get some damn answers about their process. It’s just poor customer service. I will never recommend this company to anyone.", "rating": 1}, {"title": "This was the worst experience with…", "text": "This was the worst experience with refinancing our home we have ever experienced we will never go with this Newsday again from beginning to end it took way too long it literally made us nauseated there was a breakdown in communication with in your operation people were not doing their job every time you needed something we gave it to you it took way over a month to get done I would never recommend this place and we do plan on filing a complaint with the Better Business Bureau", "rating": 1}, {"title": "The USADAY lacks trusted process", "text": "The USADAY process is a never ending chain of information request which comes in the form of both portal supplied & faxed or emailed documents. A checklist or required documents is not provided up front only a continuous request to satisfy their underwriter.  It’s like the first time they have ever taken a VA mortgage application!Don’t be fooled by the VADM.", "rating": 1}, {"title": "Our VA Loan Experience September 5 - November 29 2019", "text": "In over 44 years of home ownership this has by far been the worst experience my wife and I have ever had.  As a Naval Academy graduate and a retired Marine I am extremely frustrated by the difference between the extensive NewDay advertising and the process we had to endure.  In the end it almost felt  as if we were begging to have our loan closed and over with.  I would recommend 2 things to improve your service:1.)  A written list of VA terms and requirements for a loan to be approved, to be furnished to prospective clients at the beginning of the process2.)  A dedicated customer service hotline for clients to use to obtain information concerning the status of their loan when their assigned agent is working on other projects or otherwise unavailable                                           John and Laura Gaumer", "rating": 1}, {"title": "Very misleading TV advertising!", "text": "Date of experience: December 13, 2019", "rating": 1}, {"title": "False Advertising", "text": "I’m a veteran and my credit score wasn’t the best in the business but it was workable. After hearing all the tv commercials about NewDayUSA and their advertisements about working with your credit score, I decided to apply for a home refinance. After jumping through all the hoops and waiting for weeks, I received a letter saying how sorry they were that my credit score was too low for them. For reference, it was 670 at the time. Another bank that actually DID work with peoples credit scores gladly helped me out. NewDayUSA will not back up their advertised claims....pretty disappointing.", "rating": 1}, {"title": "Can't say I was real impressed", "text": "Can't say I was real impressed, their commercial states NO APPRAISALS and NO FINANCIAL required, farthest from the truth and the way mortgage companies work it since Obama screwed up that industry the independent business owner, or disabled veteran gets screwed. Yet another industry Obama screwed up. I think I will just use my bank they know who I am and their comfortable writing my loan.....", "rating": 1}, {"title": "Worst place you can use for anything", "text": "Worst place you can use for anything, worst customer service and compliance", "rating": 1}, {"title": "I would never suggest using NewDay to…", "text": "I would never suggest using NewDay to anyone.  I will be personally making sure to get the word out about the utter incompetence and attention to detail by most of the people involved in the entire process.The representative couldn't keep track of documents, asked for the same things over and over.  Asked me to sign incorrect documents and then failed to get the documents done on time causing me to miss my close date. As a DAV and VFW Marine of 10 years, and Single Dad to 3 kids, this isn't professional or acceptable.   I called and called and at times the calls were ignored, my realtor's calls were ignored as were titles calls. I went up the chain and Michael the department head never returned my calls. Destiny was the only one that finally got engaged.  Everyone involved from outside NewDay had the same comment about NewDay.  It's not professional. DON'T COUNT ON THESE GUYS, TAKE YOUR BUSINESS ELSEWHERE.I will be posting and sharing my opinion with anyone and every site I can.", "rating": 1}, {"title": "Poor mgmt.", "text": "Poor mgmt., poor customer service.  I am a veteran and used newday to get a VA loan refinance.  I believed they would provide me with the best rate.  I have a credit score of 801 at the time of refinance.  Upon completion and closing, I received multiple calls and realized I paid 1.5 to 1.75 pts higher than the going rate.  I was soo dissatisfied I tried to contact my rep and he would not return my call because the loan was closed.  WARNING:  Shop around.  Just because you are a veteran does not mean these leaches will provide you with the best rate.  I think they turn and burn the loans regardless!!!!  Shop ARound. stay away from NEWDAY.", "rating": 1}, {"title": "The process of obtaining fro Newday USA…", "text": "The process of obtaining fro Newday USA was the most stressful thing I ever went through. Every day something changed whether it was having the proper paperwork and supplying several times to the cost to close on the loan, which changed almost daily. I started to wonder whether these people even knew how to grant a Mortgage.When I heard that this company was by Veteran's for Veteran's I thought that this is the way to go, boy was I wrong!", "rating": 1}, {"title": "Never do it again nothing but lies and…", "text": "Never do it again nothing but lies and robed the “F€£K” out of me", "rating": 1}, {"title": "I was badly misled to believe NewDay…", "text": "I was badly misled to believe NewDay would be my loan administer only to get passed off to TMS.  I will not recommend you to any of my friends, in fact, I will steer them away from NewDay.  Admiral, I enjoyed my days under your command and always considered you a stand up guy - guess I was very wrong.  Things we do for $$$.V/r, Eric", "rating": 1}, {"title": "Worst experience EVER with a mortgage…", "text": "Worst experience EVER with a mortgage company.  Applied mid May with John and after jumping through the usual hoops for people with rental income and schedule C income we were told we had made the cut with underwriting.  Then John had a family emergency and Cody was our guy to get us over the goal line.  1 week, 2 weeks....we are told the paperwork is being finalized, then we are told our rental income (which we documented with 25 monthly bank statements) was not valid because it wasn't on our taxes.  Also, the schedule C income, which IS on our taxes will need to be certified by an accountant.  We are talking about 150 dollars a month of income.  Really?  Loan is now denied due to too little income for our debts (yeah take 775 dollars off my income and it would look that way). I called a week ago and was promised a second look and follow up from the supervisor.  Nada!These guys stink.  The communication was terrible, to boot but the rest of the story was the real problem.7/9/19The canned response just illustrates my point.  Did anyone at new day review my last email to Cody?  It looks like they did not, nor does your response account for the issue I raised in this review.  I DO have the capacity to repay.  I pay my bills now...after a refi it would have been even easier.  Your underwriters went back on their decision for some reason.  I suspect it was because my loan was too small.  A trite response on this website does not qualify as a review.  Lazy.7/10/19Again, you prove my point.  The original post says I showed 25 months of rental income, steady and unwavering.  25 is more than 24 right?  Honesty would be to just admit you don't want to do business with me for  whatever reason and it doesn't matter what hoops I jump through.  Obviously, several others have had the same experience.  I can't know your mind, but your motives don't seem pure.  The whole process is very subjective.", "rating": 1}, {"title": "So very unhappy with the service we…", "text": "So very unhappy with the service we recieved.  Hard to even begin to elaborate on how many times my wife and I had to jump through hoops to get this loan done.   If we would have had more time to close we would have gone to a different lender.", "rating": 1}, {"title": "I would never use Newday again and…", "text": "I would never use Newday again and would never recommend it to anyone.", "rating": 1}, {"title": "Much of what Guy N from Phoenix we also experienced and more.", "text": "Much of what Guy N. from Phoenix experienced we did as well. Ridiculous. At the last minute wouldn't use verified employment and income because it was less than the year before.It was less because my wife went back to school. Covering one full time and one part time job with school demands is a stressful enough without dealing with Newday's constant request for more information. They put a hard hit on my credit rating (which was excellent) but it dropped my score by 14 pts. They didn't even use the score because they decided her drop in income which would be for 6 months was enough to throw out her entire wage base. Of course her debt went up significantly from the advanced medical program she was enrolled in so it was double trouble. Then the audacity to say you can apply again in 6 months but we can't guarantee anything. This is all after a 300,000 pre-qualified loan was approved. The non-disclosure of income reduction which disqualifies us automatically at the first application caused weeks of 'more information' requests from Newday and needless work on our part.   If Newday's loan portfolio has any  self-employed or contract workers where their income varies year to year then a troublesome discriminatory policy must be in place.", "rating": 1}, {"title": "Cost Me $500.00 For Nothing!!!", "text": "Spent a week sending paperwork for a refi. Paid $500.00 for a Appraisal and New Day said No.Ate the $500.00 for NOTHING!!!Worst Scam Company!!!", "rating": 1}, {"title": "Never Again with New Day!", "text": "All too often there were \"additional requirements\" or things to provide at the last minute which ended up pushing my closing date out further than I wanted -- all because New Day acted like it was \"amateur hour\" and like they had never done this before -- ever.  Simple things like because I was a 1099 employee -- I have to have my tax returns for the last couple of years.  Even though I was working with New Day for almost two months prior, they didn't let me know that until 48 hours BEFORE the scheduled closing.  Then I had a Vice President from New Day call (and I still have the voice mail) stating that if I provided these documents by the end of the day -- we could still keep the original closing date.  I took the afternoon away from my job to provide this information -- just to be told the next morning that, oh, \"something else\" has now come up as well (we have to wait six days after the appraisal) so the closing date will have to be moved out -- and on and on and on and on..... again.  I would have thought that New Day would have had a better Quality Control process.  Then I was told by a New Day rep -- that \"New Day would make it right\" and sorry for all the hassle.  Don't know what they meant by that --- but --- I have yet to see the results of that promise either.  Another area of concern was the over-the-top requests for information regarding my finances.  They made me feel like I was always on the defensive.  \"Please provide a paper trail\" (like all the way back to the printing press) of where the money originated, how it got into your account, bank statements from every person on the planet that you have ever dealt with -- (or so it seemed) -- etc.  I know they have regulations to follow, but the attitude was that I was made to feel guilty about something -- like it originated from ill-gotten gains and anyone putting a large sum of money down on a place and not requiring 100% financing is subject to suspicion.  Buying a new home is stressful enough without the lender adding to the worry-bucket.  It was supposed to be fun and exciting and my wife and I were really looking forward to the new home -- and it turned into a surreal nightmare.  I should have gone to another lender but I was too far invested in the process and risked losing the one house we found to change at the last minute.", "rating": 1}, {"title": "Everyone that helped us was kind", "text": "Everyone that helped us was kind. But seemed very GREEN and new to the field..  Went thru so many hoops and felt like an employee not a customer... Great loan though. I must say .", "rating": 1}, {"title": "Dissatisfied is an understatement. Do not use!", "text": "Will seemed to be trying his best but I will never use NewDay again. Just the fact that I am being issued checks to pay off my bills is ridiculous! Everyone takes electronic payments and I was told that I would receive the checks by 4/13. Now it's 4/15 no checks and no one can even give me a tracking number to watch for them. I've now paid two months of bills over what the checks were cut for and have to deal with waiting for a refund for the overpayments which I'm told can take 6 to 8 weeks. If I had been wired the money all of my bills that I did the refi for would have been paid off but instead I'm paying everything over because these ridiculous checks are still not here. Every step of the way there was a problem. I'm so disappointed. I chose NewDay because of it being Veteran run and I wish I wouldn't have. To add to the hassle I have to pay extra to overnight the checks, whenever they get here, so that I can stop overpaying on these bills. There will be literally over $5,000 that will be overpaid because I guess I cannot be trusted to pay off the bills with the refinance money. I could have shown proof of pay off and saved interest and mailing fees.", "rating": 1}, {"title": "Ridiculous amount of work for the…", "text": "Ridiculous amount of work for the customer and took way too long to complete.  Also the finished checks are wrong. Very disappointed. Arthur and Cheryl Krieger. Please call me 509-595-0361 I have tried our representative and that is not working.  Need to speak to someone above.", "rating": 1}, {"title": "Beware", "text": "I contacted NewDay USA regarding a refinance a couple of times.  On both occasions they ask me for a substantial amount of personal information and I gave them most.  However, when I asked common questions like what is the interest rate or cost to close, the guy refused to give me that info stating that it varies.  I then ask, well then give me a range for the interest rate and he still refused.  I felt like I was giving up everything while they were putting me at a disadvantage.  I further feel that most of the people who refinance with them probably are disparate and want the extra money at any cost.  USA is thriving on higher than normal interest rates and super high closing cost.  I refinanced locally and got a much better deal.", "rating": 1}, {"title": "New Day claims to want to help Veterans…", "text": "New Day claims to want to help Veterans but when the situation gets a bit tough, they shut you down and claim they can't help.   By all appearances, New Day USA is out to help no one except themselves. I know what it is to work to be a profitable company. As a business owner myself, sometimes it is tough but regardless, I always go the extra mile for my customers as they are the life blood of my business. Veterans, there are other companies willing to help with mortgages. I would certainly try another company first before you waste your time with New Day.", "rating": 1}, {"title": "Nightmare!!! BEWARE!!!", "text": "In my opinion, I’d say don’t trust these super nice mortgage people who wants to reel you in by painting you a false hope!!! My experience was a nightmare!! And after they obtained my mortgage, they sold it out before even a payment was made! To a company that had poor & scary reviews! They tell you one amount that you even signed for and agreed to get! They send a closing rep to your home to go over each document! Hmmm that didn’t happen, she basically just wanted our signature! I told her I had bad eyes and couldn’t read and my wife had a stroke! I didn’t notice on the document sheet that had the amount I was to get back had a lower meaning about $4000.00 lower cash back amount than what I was supposed to get!! After telling the guy that was working with me about the incorrect amount, he looked it up and agreed that they def sent me the wrong amount in that document. He assured me not to worry that it would get corrected!!! A lie!! I had to call multiples times and still got the run around! A few times I was told my supervisor would call you back etc and NO CALL back!! Very unprofessional! But very kind and quick to answer any questions at the beginning, oh and quick to return a call or email back as well! They seem to want to withhold and cheat the elderly disabled out of part of their cash out amount after refinancing! BEWARE!! They even tried to send me my own escrow money as part of what they owed me back! So just be very cautious working with this company! I thought we had great trust at the get go and a very nice man assisting us!! Huhh Fake False!! Nice don’t leave you wondering where the rest of your funds went! I was supposed to have $12,646  something dollars, the title company deposited on $9,800 sonething! Someone sent a check with like a little over $2000.00, still to this day I don’t have the full amount refunded to me!  My wife and I was hurt and very upset, this turned out so stressful! As I stated a nightmare! Best of luck!", "rating": 1}, {"title": "In my opinion I think it was handled…", "text": "In my opinion I think it was handled very wrong, It took a lot longer than you advertise to get this loan taken care of. Then someone spilled my name on the loan doc's wrong and all of the paper work needed to be change all over again. There was a stupid person handling this loan.", "rating": 1}, {"title": "Total rip off", "text": "NewDayUSA offered me terms almost 2% higher in APR and $10,000 more in closing costs. Total rip off and thankfully I had several other excellent offers to choose from. NewDay USA should be ashamed if this is how they are treating veterans. Boooooo to you!", "rating": 1}, {"title": "the worst company I ever delt with", "text": "Date of experience: January 10, 2019", "rating": 1}, {"title": "Denied my loan!!!", "text": "I would like to say that this is by far the worst company I have ever dealt with in my life. Being a widow, whose husband served almost 23 years in our military being declined a loan when I was desperate to pay off debt with my refinance was just horribly degrading to me. I will give credit to my loan agent which was Courtland Womble because he did everything in his power to try to help me. This company denied my loan because of a lying appraiser that was a horrible person who lied to your company about a stupid crawl space that we had fixed to fit the VA standard but rather than send out a Different appraiser to verify we had fixed the issue you went with his word and denied my loan. He is a horrible person who my boyfriend had to literally grab by his shirt to get him off of my property, He was told 3 times to leave and just would not leave. I think you made a  mistake to deny a loan to a late veteran's wife but I guess that is just the kind of people you are. You should be ashamed especially since your loan process drug on for almost a month just for me to be denied! None the less I would like to thank Courtland once again for his effort. I actually feel sorry for him.", "rating": 1}, {"title": "The person that was helping gave us…", "text": "The person that was helping gave us misleading information , he told us one thing at closing he told us wrong information,  then he ignore my calls and emails", "rating": 1}, {"title": "Never Going to Use New Day Again", "text": "Never Going to Use New Day Again. While I was excited to be able to get this done. I was told at least a dozen different times about different closing dates. Because we had an HVAC unit added last year and a loan on that product that company had a lien on that product not the house. However, New Day gave me more than a runaround about having to use at least half of my cash back from the refinance to pay that off before they would confirm everything and set it for closing. I lost over 5k in cash back that was supposed to pay off high interest c.c. debt because of this. The loan company did everything they could to get New Day to not for me to do this even offering to subordinate it, yet New Day still said NO!  I still chose to proceed though I probably should not have. At least I was able to pay some debt, but not all and not what needed to be paid off first. Had I been able to use that additional 5k+, I would have been able to pay off those high interest debts and the pay off the loan for the HVAC unit early with the money saved. Because of this debacle and the resistance from New Day to work with the HVAC loan company and help me out, I will not recommend New Day to anyone, nor will I use them at any time in the future should we choose to refinance again. I am sorry to be this way, but your company offered very little help with this, and it would have saved me so much more in the long run.", "rating": 1}, {"title": "My experience was the worst that I've…", "text": "My experience was the worst that I've ever had refinancing or purchasing a home.", "rating": 1}, {"title": "They told me they would never…", "text": "They told me they would never sell/transfer my loan to any other company, \"oh you will never have to worry about that we never do that\" is what they said, but they just did. Typical, you can't trust what they say. Now I have to deal with the other company which still hasn't sent me any information and when I call them they say there's nothing they can do without an acct #. Guess ill be missing payments because now no one can help me..", "rating": 1}, {"title": "If I had to do this over again I…", "text": "If I had to do this over again I wouldn't. This was a totally nightmare. All I ask is to get the voice recordings to my loan, then if you want to hear my veteran side give me a call admiral.", "rating": 1}, {"title": "Stay away from this company!", "text": "Unsolicited phone and written marketing that wouldn't stop without legislative intervention! Sadmiral (trading on his FORMER military status- shame!!)heads the company; Matthew Berka, 'account executive (seriously? more like professional manchild). Go home and grow up Matt while your karma lands on you like a freight train! Stay far away from this shameless corporate ameoba!", "rating": 1}, {"title": "A mistake to refinance.", "text": "Company is a joke. The commercials say on thing and in reality it does something different.", "rating": 1}, {"title": "Deception At It's Best", "text": "The fact that from conception of contact with NewDay USA I emphasized when asked what I was seeking with a refinance loan all I wanted was removal from the worst mortgage company I've had in 60 years (PHH) and to find out following the loan that NewDay used for my loan was \"PHH\" is more than disturbing.  I informed Mr. Eric Manley from the very first moments of even thinking about a refinance of my disgust with PHH and that my interest was already lower than the loan NewDay could provide but my dissatisfaction of PHH's service forced the move.  Why would he keep the fact that NewDay intended to use PHH?  It is simple deceit and I stressed over and over my dissatisfaction with PHH only to have this happen.  I could have gone directly through PHH and saved over $3,500.00 which was charged for current documents, property docs, and more which were not required as PHH already had them.  I had numerous calls by PHH to refinance the loan to obtain additional monies but ignored them all.   I never needed the additional money.  All I sought was tranquility of leaving PHH and if your conversations are recorded as your representative consistently stated.....then you need to verify everything I'm saying because its true and as an officer and honorable person, I attest this to be true.", "rating": 1}, {"title": "My honest opinion about new day and…", "text": "My honest opinion about new day and their Mortgage Firm that they take it with the loans through it is a joke you ask to have stuff done or to make a partial payment and they can accept it that's totally uncalled for they refuse to accept a partial payment when people fall on Hard Times They preached and preached and preached about how there for the veterans for the veterans they're not for the veterans there for the people so they can take and line their own pockets they can give a s*** less about the veterans", "rating": 1}, {"title": "Shame on Lynch", "text": "Shame on LynchThey are obnoxious and send letters every couple weeks.  You would think after the first couple times I don’t respond they would stop.  Shame on Rear Admiral Lynch for using his veteran status and rank to promote a for profit company.", "rating": 1}, {"title": "Lame", "text": "these frauds strung me along for like 3 months, two different agents, and then denied me after daily and weekly requests for more and more information.  all I got from these podunks is wasted time and my information sold to spammers, getting multiple and daily calls from autobots since dealing with them.", "rating": 1}, {"title": "They turned me down within minutes", "text": "They turned me down within minutes. My credit scores were the problem. What ever happened to finding out what the problems are? They advertise for veterans. But they all must be squeaky clean. Im sick of bankers. Taking advantage of veterans.thru advertising.Im tired of seeing businesses advertising\"Veteran owned\" i guess if your not a recent vet you're not profit worthy.", "rating": 1}, {"title": "Put in an application", "text": "Put in an application, was not not contacted for nearly 10 days.  When I was contacted, representative stated my file had been reassigned due to a change in employment status of one of their employees and said I would need to begin the process over.  Additionally, they sell themselves as offering incentives to veterans, when I asked what those particular benefits were they basically repeat the benefits given to anyone with a VA loan, kind of misleading-no tangible benefit to using them over any other lender...Ill use USAA.", "rating": 1}, {"title": "This has been by ar the worst company I…", "text": "This has been by ar the worst company I have ever dealt with. I wanted to rate it with no stars but that unfortunately was not an option. You would think that a company that supposedly caters to veterans would be more professional and be on point with their service...not at all the case. I was constantly being asked for the same information over and over again. When all was said and done they didn't even find my account on time. I would not recommend this company to my worst enemy. Totally disgusted.", "rating": 1}, {"title": "no Loans for Alian home buyers", "text": "its really hard when you take all the application information and says that am alien and you cannot process after pulling my credit report its really awe full. in first place the process it to check if the applicant fit to the New day policy and then process the credit report. for your foot print and business you cannot ruin my credit.", "rating": 1}, {"title": "After being turned down for refinance", "text": "After being turned down for refinance, NewDay keeps sending Pre-Approved cash-out loan offers... I'm not amused.", "rating": 1}, {"title": "New Day USA is just another lender", "text": "New Day USA is just another lender. They use the same basic criteria as any other lender dealing with VA loans. They cannot, and will not, do any more than any other lender in that regard. You give them your info over the phone. They tell you they will call back after they \"crunch the numbers\". If you do not meet the said criteria they do not call you back. That simple. They use the word 'veterans' as a selling point.", "rating": 1}, {"title": "Mailing marketing out of control", "text": "I checked this website out more than two years ago, and I continually receive mailing letters from this company. From one retired veteran to another, leave me the hell alone already!!!", "rating": 1}, {"title": "This company is such a ripoff to…", "text": "This company is such a ripoff to Veterans. Closing cost over 15K to pull out 30k equity. Increase in interest rate from 3.25% to 5.25%. This company takes advantage of people that are in a financial bind,,,, get your VA loan financed elsewhere.Told advisor Matthew Berka not to proceed with loan and withdraw application,,, he overnighted the paperwork to finalize loan,, what a joke", "rating": 1}, {"title": "After filling out an application on…", "text": "After filling out an application on Saturday June 9, New Day was one of the 5 companies that was provided.  I was contacted by the 4 other companies immediately and was preapproved by all 4. I tried to contact New Day that weekend and was unable.On Monday I was called by a New Day Agent.  I told him I had 4 preapproval letters and completed an application.  He put me on hold and came back and stated that all the credit reports but Trans Union said they had no record of my wife.  I said that it must be a mistake with Trans Union, since the other 2 credit agencies reported excellent credit and that her credit was reviewed by 4 other banks this weekend.  I told him to resubmit it to Trans Union.  He replied we would have to do that.  I reminded that I had 4 preapprovals for other lenders and if he did not want to do that then I did not want New Day to have anything to do with our loan.", "rating": 1}, {"title": "I recently refinanced my home with…", "text": "I recently refinanced my home with NewDay USA. Yesterday I received a notification from NewDay that my escrow balance was $11,725.83 short and my monthly mortgage payment would increase to $3,079.59; more than double my original payment. After waiting 40 minutes on hold, I was informed that someone at NewDay moved the decimal point on my home insurance one space to the right which resulted in my insurance increasing 10 fold. If I could sue, I would.", "rating": 1}, {"title": "Prativa Snyder was very condescending", "text": "Prativa Snyder was very condescending.  She lied to me on the 30th of May told me I could close on the 31st.  She told me I needed to be at the title company before noon with a valid photo ID.  My wife had to take 4 hours off work and we had to drive 50 miles one way from home only to show up and the title company and they did not have the paperwork.  When I called to find out what was going on, Prativa yelled at me on the phone so loud that the sellers and title clerk could hear.  Prativa told me she would not have told me that because it was against the federal rules which she did not tell me anything about that on the 30th.  When I spoke to her supervisor about the treatment he was suppose to call me back and that was on the 31st and, as of the 8th, I still have not recieved a call back. Also I emailed Prativa and told her I found survey markers for the property and I was going to contact the company who did the survey to see if they had the information on file.  Prativa ordered a survey anyway and told the company it was urgent so that cost me the full price of a new survey.  The company put a rush on it and sent the survey to Prativa by the time frame she ordered and he recieved an automatic response she was out of the office for 4 days.   He voiced his frustration about having to drop everything he was working on only to get that type of response.Finally, Prativa argued at legnth with the real estate attorney who drew up our purchase contract.  Her back and forth with the attorney cost him time and us a lot of money.  Ultimately, the whole experience from start to finish was fruatrating and unprofessional.  We used New Day to \"save money\", but ended up spending WAY more in the end than we would have if we had used another bank.  We will not be recommending your services and are very displeased with the way your company treats those who have served this country.", "rating": 1}, {"title": "Unwilling To Give Out General Information Without Credit Check!", "text": "I received a phone call at 8:30 this morning after submitting general information.  I explained that I was just looking for some general information in which I could sit down with my wife and make an informed decision if we wanted to refinance.  I asked the representative for what the interest rates and fees would be?  He told me he couldn't give me those until he got a little information from me.  Fair enough I started answering his questions.  During that time I heard about the Admiral 4 times.  Finally, I told him I didn't need to know all that.  I just needed some general information.  20 minutes later he asked me for my wife's and my middle initial.  Without thinking I gave it to him.  Then the light went on.  I asked him if he was submitting a credit report?  He said yes!  I told him that he did not have that permission because I was not yet apply for a mortgage through them and then hung up the phone.I will be honest that I honestly feel that this bait and switch game.  They are playing on the Veterans.  Finally before posting this review I decided I would contact the the Head Office.  I called the front desk number listed on the website.  All that happened there was I was requested to leave a message.  To whom I have know idea.  I thought I was calling the Front Desk.  Obviously their voice mail system is not capable of handling incoming a call and can only take a message.", "rating": 1}, {"title": "The rep assigned to me only answered…", "text": "The rep assigned to me only answered calls when he wanted something from me.  After days of no return calls I called a different # and got another rep to answer.  He gave the message to my rep and he called back immediately and pretended not to know what I was calling about.  He was obviously performing for the guy I talked to sitting next to him.  I also told him that the closing statement showing the accounts to be paid off were incorrectly spelled, TWICE!  As I expected the checks came with the creditors business spelled wrong.  Again, no return call from him.  I had to call their check issuing co. myself.  I CAN GO ON AND ON", "rating": 1}, {"title": "I was lied to by their agent Ryan S", "text": "I was lied to by their agent Ryan S. I was told that due to my excellent credit I was going to have to pay 5% interest. Though my first loan was only 3.75%. He said that after 6 months I, with his help would contact the VA to ask for a reduction. They also brought my excellent credit down 58 points on one and 62 on the other. They suck. A day or so after the loan went through the company New Day sold my mortgage to another company leaving with no help from Ryan S. or anyone at New Day. This is a ripoff!!", "rating": 1}, {"title": "I wanted to refinance to be able to pay…", "text": "I wanted to refinance to be able to pay off credit card debt and remodel.  My husband is a Vietnam vet and I am his wife since 1997.  Anyway, the rep ran my credit and did part of loan ap to then tell me I didn't qualify because my husband had no credit and all the credit was in my name!  Would have been great to have known that up front.  Now, my credit score dropped 21 pts due to the application and they could not help me or my husband.  He then offered to send it over to the FHA side and I agreed but he never did. So, it hurt my credit score applying with them and he did not follow through. Not pleased with the \"helping veterans\" and their \"families\" experience.  Glenda-Spring Hill, TN", "rating": 1}, {"title": "If I could give these jerks a -100 I…", "text": "If I could give these jerks a -100 I would. Do not use these people to purchase a home. They are terrible, do not return phone calls, or emails in a timely manner. If you want your deal to bust it will happen. Listen to your Realtor when they tell you to use a LOCAL LENDER. This company will only make you cry, cuss and want to punch something with frustration.", "rating": 1}, {"title": "Liars", "text": "Liars.  The commercial they run on tv is the total opposite of what really happens when you call to seek assistance.  For example, they we'll help you when others have turned you down.  Outright FALSE.  They provide you with same exact answer as with other lending institutions.  No, I am no seeking your help anymore.", "rating": 1}, {"title": "Bad experience...was not given the…", "text": "Bad experience...was not given the necessary facts that I needed in my decision making. I was not told that the property I was looking at, would not meet eligibility requirements. Getting a credit report on me seemed to be more important than giving me the information I needed....I would not do business with them....besides....with a credit scores of 750...we were told the best interest rate available was 5%........we made a call to a lender here in TN, and was given 4.2%............Its my experience its better to deal with someone local, at least in the same state.....you want a real person in a real office that you can sit down with if necessary.....New Day, is basically an internet company......Their salesman spend a lot of time reading scripted sales pitches full of compliments and mush about veterans......not really listening or being sincere......its all scripted....I was told that they could get my letter of eligibility faster than me, because they had a special portal to the VA....if I tried to get it on my own, it could take weeks...... I let them apply for me, and I made my own application as well through Ebenefits. I had a response with my letter of eligibility by email the next day...........I still have not heard from New Day.....", "rating": 1}, {"title": "Be careful veterans - Don't trust so easily!", "text": "Be careful veterans. As a veteran,  we tend to trust others who share our common experiences.  However,  you have to critically think and weigh all of your options out. NewDay is playing on your trust. Compare them to more trusted and established companies and save yourself and your family some money.", "rating": 1}, {"title": "New Day USA doesn’t know their way…", "text": "New Day USA doesn’t know their way around a VA loan. I was in the process of buying a bank owned home which had a 5% buyers premium. They assured me that the 5% could be put on the loan. Weeks later I was instructed to send my escrow deposit of 3,000 dollars so I did. The afternoon of the day before closing the VA shot me down because of the 5% being on the loan and now I lost my escrow deposit. Cody Solar at New Day USA told me it was the lender who shot me down “because they want the 5% separate” but he was lying to me to save his rear end. The next day I found out that New Day USA removed themselves as the lender when they found out they messed up.  I’m a vet without much money and $3,000 is a ton of money to me and I can’t afford to lose it, for this reason I don’t bet or gamble and watch my pennies carefully. It’s a real shame that companies like New Day USA are allowed to prey on veterans. I’ll be filing a complaint with the VA and probably suing the company. Besides the lost escrow I lost another 900 dollars on inspections and repairs to get it inspected.", "rating": 1}, {"title": "Bernard Rocha was excellent/New Day Sucks", "text": "Bernard Rocha was excellent. He was very helpful and attempted to make the process as pain free as possible. However, the Newday loan experience itself was terrible. They constantly kept questioning me on my income, which is more than reasonable, and every time I met all the requirements they would come back with more questions and more demands. They also kept wanting to make me refi even more of the value of my house even though there was no need what so ever, my debt to income ratio is very good, but every time I turned around they were demanded I pay off something else just so they could add it to the loan.They would NOT ACCEPT the LEGAL POWER OF ATTORNEY that I had given my wife and it held up my loan process for several weeks as I was out of the country and had to wait to finally close until I returned. I wanted to back out but Bernard did his job to calm me down every time. In the end I had put too much effort to back out and needed to finish the refi. I would recommend Bernard, HOWEVER, I WOULD NEVER RECOMMEND NEWDAY TO ANYBODY!!!!!! WORST LOAN PROCESS EXPERIENCE. I got the loan in the end but I would never go through it again. They even respond in a way that acts like you are not someone that has been through the process before and knows what to expect.  They ask for information that is irrelevant to the loan process.", "rating": 1}, {"title": "Our representative was nice, but NEW DAY is dishonest", "text": "Our representative, though it changed twice in process always 'seemed' to be our advocate.  We locked in before rates went up.  New Day's rates were slightly lower than other lenders of better repute.  However, we were left with the overall impression that this was designed as a bait and switch tactic to make the locked rate fail so they could apply new, higher rates. We've done a LOT of loans in the past.  None of which required as much detail, nor as many last minute requirements or the loan would miss it's lock - all contrived by the lender - all met within one day by my wife and I.  NEVER HAVE I HAD A REPRESENTATIVE SAY TO ME \" Once we get that back today from the bank then we will submit everything to our Closing Department and it should be about 24-48 hours afterwards when the Closing Disclosure is sent out to you both.  After we get that electronically signed, we can schedule the closing for 3 business days afterwards so I would plan on closing some time on Friday or Saturday of this week.  The current rate lock expires on 3/18 so I do just have to confirm that you’d like to proceed with closing on the current rate lock (3.375%) and if for whatever reason the loan does not close before 3/18... then you would have to reapply subject to new rates.  I just have to confirm this is alright with you… \" That was sent on 3/12 - their closing department didn't finish for 4 days.  NEW DAY CAUSED EVERY DELAY THAT COULD HAVE MADE THIS LOAN LOCK EXPIRE - not us.  If I'm charitable, I'll blame it on unprofessional behavior by their audit department - if I'm honest, I'll express my feelings that this was a blatant attempt to default on the locked rate because the fed is going up for the foreseeable future.  Our representative was friendly, but this was the hardest, the worst loan experience of my life.  My only hesitation in leaving this honest review is that they now service our loan and given the application process, I fear reprisal.  I leave this review at great personal risk in hope that it steers other veterans toward a better experience.", "rating": 1}, {"title": "Don’t Do It!!", "text": "This experience was terrible!! I started my loan process in the beginning of December and closed on the loan in March ( That was not a typo). My loan officer Zach Spahn did not have a clue because of repeated paperwork requests I submitted over and over. The only thing consistent was letting me be aware that I am on a recorded line. Apply the  consistency in training i.e. customer service techniques and proper work ethics in a professional environment especially dealing with people personal and important information. I know this review may not get far but I would not recommend this company. I would rather collect aluminum cans and get the money needed from the recycling yard. Great job  Admiral Thomas C. Lynch :(", "rating": 1}, {"title": "Bad from start to finish", "text": "Bad from start to finish - shame on you (and i am talking about this last transaction) So shame on you!!!! How dare you warn the notary about how difficult I AM - when you have super cheeseball working for you.", "rating": 1}, {"title": "The people that worked with me were …", "text": "The people that worked with me were curious and helpful through the whole process", "rating": 1}, {"title": "You need to work on your Communication …", "text": "You need to work on your Communication skills, our Rep. Mr. Pirri did a phenomenal job until he asked us if we wanted any money back, my husband said well that depends on our payment, we need to keep it under $1,000.00a month, because of our limited income. Mr. Pirri did some figuring, based on $20,000.00 back, with a $1,300.00 a month payment, we of course said no, can’t do that, need to be $1,000.00 or under...he came back with $1,600.00 and $1,000.00 payment, we agreed on $1,600.00 back at closing. Mr. Pirri was trying to close before Christmas, we were thrilled with that, he went out of town, we had completed all tasks on the very short list, 1 thing we were asked to do in a very short time, was to paint the trim of our house, my husband is 77 yrs. old, we had to hire help, but it got done in two days. Plus inspection for the 2nd time. While we thought everything was done and handled, Mr. Pirris boss called and ...his words...” our deal was off” some lame excuse, we were devastated, worst Christmas we’ve ever had, not knowing what had happened, Mr. Pirri promised everthing was done and next step Laura was com8ng to our house to sign paper. Well we called Laure and she said  “ the lender pulled out”... worst New Years we’ve ever had...finally After several phone calls to Mr. Pirri, and emails, he called us Jan. 4th, never mentioning anything about pay offs or our check...finally we signed all of the paper work, where we were told, Laura left, I’m reading the paper work after she left, and discovered we were only getting $1,600.00 big, huge difference when we were expecting $16,000.00. Communication is key...keep the hands of that manager out of Mr. Pirris business...no one has explained to us yet, why we only received $1,600.00. Needless to say we are not very happy, plus the interest rate now is lower then what we had to hurry up and lock in at...i have shared my story...I will not be recommending your company, any time soon...I don’t know how you can fix this...it should have been in the conversation prior to any signing, we may have not gone through with this...we were expecting $16,000.00. What would you do in this situation ? Regina and Robert Bradley", "rating": 1}, {"title": "They do not look after the Veteran!", "text": "They do not look after the Veteran! I became disabled and told them I had to go 6 months without a paycheck. They rushed me to get all my paperwork in to them ASAP. At the end declined me as I was over 30 Day late with my House payment! Never 2 months late! I had told them this! They said it’s Ok! NOT! A total wast of my time!", "rating": 1}, {"title": "Don't like getting the run around!!!", "text": "My husband Is a veteran and we thought that refinancing through y'all would be an answer to our prayers....well after we got ALL of our documents in,signed everything and after hours of gathering more info,faxing and emailing stuff...we never heard from our dude that was helping us again. I tried to reach out to him many times and then out of the blue we got a call from another man informing us our application was incomplete and he wanted to help us continue....well... It would have been nice to get a phone call or email from this other man to let us know what was going on... Started out great..that's the only reason I would give you 1 star. Now we have no idea what is going on. We were told we were able to refinance and even got an amazing offer..... Now im sure it was not accurate...no gray area with new day", "rating": 1}, {"title": "Friendly and helpful staff.", "text": "Date of experience: January 09, 2018", "rating": 1}, {"title": "Hello my name is Jarrod first and …", "text": "Hello my name is Jarrod first and foremost I would never recommend new day USA to be your VA loan lender I have had the most difficult situations in my life dealing with these lenders I have missed two closing dates because of their unprofessionalism to communicate between all groups I have had many situations where they gave me their expectations I proceeded with those expectations and then they’ve change them everything seems to change what benefits them all the documentation that they’ve always needed  was supplied to them and they’ve never get back to you at a good rate there’s been lies there’s been tons unprofessionalism failure to communicate. Most the time I would never review or even give my two cents but customer beware that these are most unprofessional people you would deal with. Even my own realtor agent in 25 years is never seen a lender so unprofessional  so on organized and playing out lies to get what they need they did not look out for the customer and the show support.  I have never been so displeased being a customer in my life typically I would never support this type of review but buyer beware these guys are not the ones you need I’ve shown my concern and the level of unprofessionalism to them.  And nothing was done and it seems like it didn’t matter I would not recommend them at all if you’re looking for a good VA lender I would go with your local realtor group to suggest one in the area going online to try to find a responsible and professional VA lender is not adequate we have learned the hard hard way.", "rating": 1}, {"title": "I am a Desert Storm combat Veteran", "text": "I am a Desert Storm combat Veteran. I served four years and received an honorable discharge. NewDayUSA would not offer me a home loan,,because my score is 637. Run from this loan compaby,,you will only get a credit inquiry on your credit report.", "rating": 1}, {"title": "Best", "text": "Best! Think New Day USA is great.", "rating": 1}, {"title": "The entire process was a mess from …", "text": "The entire process was a mess from start to finish.  Unacceptable performance and I would never recommend NewDay based on this experience.  Took months, no updates and nobody seemed to care.", "rating": 1}, {"title": "Service by Courtland Womble", "text": "I emailed the CEO.  Think massive improvements need to happen. 1. Communication and proactiveness doesn’t exist.  Had to prompt my rep. Faxed my paperwork to the rep.  He didn’t call me to say he didn’t need it and threatened me to end the process because I was upset and raised my voice.  He wasted 6 hours faxing paperwork he didn’t need! Courtland waited three weeks to say he had an issue with hoa. Can’t believe you trust him to train new agents. I should get refund on fees paid.  Because he can’t deal with straight forward military folks, he only called me when he needed something.  Never mentioned issue with the title and he was again upset I called- when he should have said what was going on! He kept me in the dark acted clueless when I asked for process and basic service several times.  He was mad I demanded service and called it on him! This is my third refi.  I know the process.  It should have been more professional and Courtland acted like he was the maryter!  He has the emails and so do I an audit should be done. No explanations of when funds would be distributed were explained.  When I asked him to send me the employement verification he said it didn’t need to be done even when I asked him to send me the link to my .mil he refused.  My boss got an email from another department for a letter to verify my employment.  This was a lie I didn’t appreciate!  I don’t just ask for refund when he wasted so much time and money acted like I was the problem!  It’s has me doubt the functional abilities of the company.  He always had an excuse on why he didn’t do something or answer his phone.  Willing to discuss with someone just leave me a message at phone number.  I very busy army officer.", "rating": 1}, {"title": "Terrible refinancing experience", "text": "Date of experience: November 14, 2017", "rating": 1}, {"title": "Great experience very Professional very …New Day USA is the most amazing way to Refinance a Home mortgage thanks again Great Job", "text": "Great experience very Professional very much satisfied", "rating": 1}, {"title": "I was looking for help to obtain cash …", "text": "I was looking for help to obtain cash for personal issues. My home is clear and free and valued/ appraised at 220k & looking for a 25 or 30yr loan. I was turned down for a VA loan of $100k because I owe nothing on the house or any other help. I'm retired and clear $1,865 month and NewDay stated reason was because I don't make enough money....I'm certainly disillusion with the T.V. COMMERCIALS ads stating looking out for us vets(1971-74)...baloney!", "rating": 1}, {"title": "Credit Score", "text": "Newday team member (Alina Cooper) made a inquiry as to my credit score thru Credit Plus to establish my eligibility for a loan, that inquiry caused my credit score to plummet 21 points. I called her back to resolve this issue and was told it’s part of the process nothing can be done. I would recommend to inform all Veterans in future of the conquences of checking their credit scores.Wesley Marquis, USN, (Ret)", "rating": 1}, {"title": "Terrible communication", "text": "Date of experience: October 10, 2017", "rating": 1}, {"title": "Loan is based on five years history.They do not tell you this in the tv ad.", "text": "I got letters in the mail every week for a month or more. called and applied to refinance. They ran a credit check and said that I was 120 days late on my payment in 2013. i tried to explain that this was due to a home modification. I was told by the agent that he could not help me. I had just stopped a loan closing with another  bank to  help a veterans' business.I don't think  that I will have any problem  getting a loan to refinance.", "rating": 1}, {"title": "HELP OUR VETS WE WILL﻿ SCAM U ALL LIES …", "text": "HELP OUR VETS WE WILL﻿ SCAM U ALL LIES ON TV WONT HEP LOW CREDIT SCORE VETS LIAR BS BS BS I CALLED STOP USING VETERANS FOR SELLING YOUR SCAMS100% SC COMBAT DISABLED #MAGA #USA #TRUMP #MILITARY#VETERAN E-4 US NAVY WITH USMC #MARINES #AVIATION#TOP #GUN movie #BLUE #ANGELS former MILITARY hee#FOX #NEWS NEEDS TO PULL THEIR TV COMMERCIALS ADSFOR FRAUD AM GOING TO REPORT THEM TO THE FEDS FTC FOR FALSE ADVERTISINGTHEY NEVER MENTION CREDIT SCORE THEIR ADMIRAL RUNNING THIS SCAM PROBABLY GOT KICKE OUT LIKE FLYNN AND COMEY FRAUD NEW DAY USA FAKE VETERAN FRAUD VETS AVOID THIS VENDOR PLEASE SAVE YOURSELF TIME THEN THEY SPAM YOU WILL UCE UNSOLICITED CALLS FROM A 3Rd Party Vendor CREDIT REPAIR FIRMMY DAD WAS WW2 B-17 BOMBER PILOT ARMY AIRCORPS AIRFORCE MY UNCLES IN THE NAVY AND US MARINES KOREAN WAR I AM VIENAM WAR  THEY DID NOT NEED CREDIT SCORES TO GET OUR EARNED VA HOME LOAN BENEFIT FOR MY DAD AND UNCLES   TOO BAD A LOT OF VETS GOT BAD CREDT OR NOT ENOUGHT INCOME TO QUALIFY FOR A NEW DAY LOAN PRESIDENT REAGAN WOULD SHUT THEM DOWN I HOPE THE FTC AND FBI SHUTS THEM DOWN FOR FRAUD LIKE ENRON AND OTHERS IN THE PAST  NEW DAY IS PURE BS I HAVE THE INCOME BUT NOT THE CREDIT AND THEIR TV ADS TARGETING US MILITARY RETIRED AND VETS IS MISLEADING AND FRADULULENT ADVERTISING AS THE DO NOT HAVE CRDEDIT SCORE MENTIONED IF I HAVE A PRO BONO ATTORNEY FOR A CLASS ACTION LAWSUIT I WOULD EMPHATICALLY PURSUE SUCH COURSE OF LEGAL ACTION AGAINST NEWDAYHOMELOANS THERE ADVERTISING IS FALSE AND MISLEADING DO NOT LET YOUR VETERAN RELATIVES FAMILY GET SCAMMED BY THERE SHOP AROUND ONLINE IN GOOGLE BBB STATUS MEANS NOTHING CHECK RIPOFFREPORT.com AND SCAMADVISOR.com as well as YELP.com when I have time I will file reports on them on those platforms as well enjoy your day UCLA Engineering Alumni GOOGLE(R) Partner San Francisco CA US Silicon Valley 31 years in biz as an SEO Consultant Programmer with a heft VA 100% Disability Pension and i cant get a home to live in THANKS A LOT UNCLE SAME U SCREWED THE VETS AGAIN US VIETNAM VETS", "rating": 1}, {"title": "I am so tired of getting letters from …", "text": "I am so tired of getting letters from newday usa about every other day. Looked on their site to unsubscribe and it wasn't found. Ok did what new day said and still getting the same letters from them? Ok did exactly what new day said to do and since then have gotten 34 more letters from them. come up with another way to get off your damn mailing list!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "rating": 1}, {"title": "Try Quicken Loans instead.", "text": "New Day tried to get me to sign up for an incredibly bad refinancing offer. Quicken Loans was much better and easier. Even after turning it down my wife and continue to receive their stupid fliers in the mail. I am really tired of getting them in the mail.  I am sure this review will not show up on their website.", "rating": 1}, {"title": "I was drawn to New Day by the ads …", "text": "I was drawn to New Day by the ads talking about easy and streamlined experience designed for veterans.  I would have to say that out of the 12+ mortgages my family and i have had over our 27 years of service this was by far the worst experience. I would not recommend New Day to anyone.", "rating": 1}, {"title": "NEW DAY IS A RIP OFF FOR VETERANS", "text": "I was offered a 4.25% on a cash out VA loan which was costing 3% in origination (a 2% buydown and a 1% underwriting fee). A local broker could lock me in at the same rate at 4.25% crediting 2% and no underwriting fee. On my 400k loan amount that equates to a $20,000 difference. Either be overcharged by New Day over $12,000 or go with my broker and receive a credit of $8,000 with my Sunwest Mortgage broker. I am so glad I talked to him. Don't walk away from New Day...RUN.", "rating": 1}, {"title": "Absolute WORST COMPANY that flat out …", "text": "Absolute WORST COMPANY that flat out lies about SO-CALLED helping veterans. ..I am a 100% permanent and total disabled veteran BOTH through the VA AND state as well as my wife is my caregiver through the veteran's caregiver program. ..don't let them lie to you. ..they WILL NOT HELP YOU AT ALL. ..", "rating": 1}, {"title": "Worst experience", "text": "Worst experience, wanted to add $16,000 on to my mortgage, my wife and I are on Social security, but would lower my monthly payment by $300 dallors. A terribly way to treat a Vietnam veteran.", "rating": 1}, {"title": "Sadly I just like straight up honesty", "text": "Sadly I just like straight up honesty.  If there web site said \"unable to do Mobil Homes\" then I would have never filled out the info,  Yet it even allows you to select Mobile Homes,  So it just wasted my time....", "rating": 1}, {"title": "Sick and tired of getting junk mail …", "text": "Sick and tired of getting junk mail from these people.  When you call the number to opt out, it asks for your SSN, which they are NOT going to get from me.  I originally had a VA mortgage on my home almost 30 years ago, but refinanced to conventional.  I can't refi a conventional loan to a VA.  Leave me alone, NewDay!", "rating": 1}, {"title": "i have a manufactured home", "text": "i have a manufactured home.  i was blown off by your staff.  i inherited this home from my father, who spent 22 years in the navy, and my mother, who was a WAVE during WWII, helping to bust jap codes.  I did my time in NAM, and this is the thanks i get.  once again, a poor vet gets blown off, and is treated like s--t.  THANKS FOR NOTHING!!!!!", "rating": 1}, {"title": "After watching TV advertisement", "text": "After watching TV advertisement, I applied for a bill consolidation loan.  Had a great, easy experience with assigned account executive, but thing started to change; 1. Turns out that a VA loan could not be used because I owned my home, 2. I was directed to FHA, 3. I had to pay $450 for home appraisal, 4. I provided my property tax info, my pension info, HOA info, home owners insurance info.  I requested a interest lock as requested, and signed papers.  A few hours later I get a call saying the loan was being denied because I was in a flood zone, and did not have flood insurance.  The redirection of my loan to FHA because VA would not accept, and spending $450 for appraisal, then being denied due to flood insurance.  This has not assisted a veteran, but caused him to spend $450 needlessly.", "rating": 1}, {"title": "Sent a personal letter to you Admiral", "text": "Sent a personal letter to you Admiral, explaining our experience with New Day USA and your agent Kendall Jones who guided us through, always available, always patient, and ever assuring that we made the right choicein choosing NEW DAY USA.", "rating": 1}, {"title": "I went to get pre-qualified but I …", "text": "I went to get pre-qualified but I wanted to wait another month until I was caught up on my credit card and my credit score was better and she kept pushing and pushing and pushing to do it now at the end of our phone conversation I qualified for a $30,000 loan when four years ago I was qualified for $194,000 loan and you use to hard inquiry so what I could buy a garage I'm letting everybody know about this", "rating": 1}, {"title": "Scam of Vets", "text": "Very cumbersome process.  A less than accurate appraisal of property, to put it nicely. The claim of 100% of home's value is easily attained by a lowball assessment ( approx 70% of real world value). Use your local bank/lender.  Admiral Lynch should be ashamedof shafting Vets!! Financial rep claims hands are tied and at the VA is the deciding factor.  Performed a \"reconsideration of value\", far better than the assigned appraiser.   Received a higher appraisal and VA rep stated that we shouldn't have received it and chose the lesser original and faulty appraisal.   Appraisal was littered with major errors, not typos. New Day appraisal rolled in 20k less than purchase price 7years ago!!!  Remodeled entire home and property since purchase to have appraiser document \"no updates in 15 years\".    Once you begin process, hard inquiries on credit report prevent you from trying to do a loan or refinance at local institutions.   Scam, scam, scam!!!!!!!!", "rating": 1}, {"title": "Not a Vet", "text": "Not a Vet, but they continue to mail this stuff to my house. So annoying!", "rating": 1}, {"title": "Myself like several Veterans of the US …", "text": "Myself like several Veterans of the US military live in a manufactured/mobile home. Unfortunately fellow vets, apparently if you live in one of these, we must be in a class of vets that don't deserve a chance to better our circumstances. There for if you live in one of these, don't waste your time with this company. Not only will they not work with you, but they won't even take the time to give you the courtesy to contact you and inform you that you are not worthy to refinance. SGT Bill R Duncan Retired", "rating": 1}, {"title": "I applied for a $10,000 home …", "text": "I applied for a $10,000 home improvement loan. I own my home free and clear. I served proudly in the U.S. Navy and am a disabled Veteran, and I receive a relativly small pension monthly. After I'd givin all of my information as well as a hit on my credit report to new day usa, I was shot down because I don't make enough money to borrow money...what?! If I had the money I would not have applied for the loan in the first place...i know, I know it's based on ability to repay the loan...well if you guys were for veterans, why wouldn't you tailor payment based on income? Thanks for letting me know that I am a veteran...Just not veteran enough New Day USA.....", "rating": 1}, {"title": "Excessive Closing Costs", "text": "New day wanted over $8,000 to close a refinance loan of $205,000.  Reducing the amount of equity I would receive.  They asked me to shop other companies closing costs and send them other Loan Estimates showing lower closing costs, in lieu of just giving me their best cost.  Even when I sent them other loan estimates showing closing costs substantially less they kept telling me to move forward on the loan and they would let me know before closing if they would reduce their closing costs...Unacceptable, you should give me your best price up front and not ask me to go find other loan estimates for you to match, that is not ethical.  All this from a company that is owned by a veteran to service VA loans.  Off to the next company.", "rating": 1}, {"title": "Working with new day was a good …", "text": "Working with new day was a good experience.  But I was not happy with the loan rate that was locked in nor with the deposit required of me for the loan!", "rating": 1}, {"title": "This company is such a sham!", "text": "This company is such a shame. None of this sounds like NewDay USA at all. I did a refinance and it took over 90 days because of all their mistakes, calling me nearly every day of that 90 days asking for a new document. They sure as hell don't know what they're doing.DO NOT TAKE A LOAN from your own equity. They raise your interest rate a lot for the entire term of the loan. For example with basic math not APR math, here's an estimate of what a $20,000 loan will cost you:* $200,000 loan @ 3.25% for 30 years = $313,348* $220,000 loan @ 4.5% for 30 years = $401,295This means your 20,000 loan, of your own money (your equity), will cost you around $87,947. My advice to you for the loan is NO, go to a bank with 8% for 60 months, just like a car.If you want to see the real reviews for NewDayUSA, go somewhere else official like Consumer Affairs. There are hundreds and hundreds of 1 stars, and I experienced half of them with the refi. Buyer beware.Update:1) Don't try to discredit my review based on my user name. ACCEPT RESPONSIBILITY FOR YOUR ACTIONS and learn from your mistakes written in these comments then fix yourselves.2) Regardless of what name I used, I was still a customer treated poorly for over 90 days. Sad when my refi was over $450k, making you lots of money. I should have been treated better. Your employee, or more like intern, was the nuisance, not me the customer. You speak of equity loans, that they are individually calculated, but my credit score was over 750 and you offered me an outrageous APR, so I hate it for those with a lower credit score than mine that you gave equity loans to because they really got screwed on the adjusted APR for 30 years.3) You should do equity loans separately with maybe a 5-8% APR for 5 years,like a car loan. Then, maybe some comments posted in this forum would be more positive, but with so many other issues you have, I doubt it.", "rating": 1}, {"title": "My experience with these people was the …", "text": "My experience with these people was the absolute worst of my entire life. They gave me all of 4 minutes and then said no, no reason. I made a new call to a broker an was on my way, with the coment from him \"well that was because of who you were dealing with\" Never again NewDay USA in my opinion sucks big time", "rating": 1}, {"title": "I am a Vet with over 20 yrs in my home …", "text": "I am a Vet with over 20 yrs in my home and they could not help. I had to use another lender very disappointed", "rating": 1}, {"title": "I feel like they are like every other …", "text": "I feel like they are like every other place says they want to help veterans.  They are just in it for the money.  They don't want to give veterans a second chance. Everything has to be up to their standards before they will help.  Some veterans have had bad times.  That is the reason we have so many veterans living on the street. And can't get help.  It's so sad when money overcomes life's.  Our veterans didn't think about money when they took the oath to serve our country.  And now they r forgotten.", "rating": 1}, {"title": "unprofessional", "text": "Date of experience: May 23, 2017", "rating": 1}, {"title": "horrible", "text": "horrible. unprofessional. did not pay for the appraisal as promised even though the cost was below their projections. it was a va appraisal and was used by new day. only after money and sales. I am glad it is over. go with another outfit that would be much quicker. I am ex-navy. adm lynch hasembarrassed me.peter malherek  05/19/2017", "rating": 1}, {"title": "warning", "text": "warning. if your a veteran stay away. I have excellent credit and was told of their concern for veterans. I wanted to refinance my home which has a 3.75 interest rate currently. the new interest rate offered to me was over 4.00 with conditions. They talk about how they care for veterans but are only interested in money. I called a standard mortgage company and was given a 3.25 rate and real concern for my service. If this is the way they care for us veterans then I wonder why I am one.", "rating": 1}, {"title": "This is a scam that some how is taking advantage of Vets.", "text": "I see Admiral Tom Lynch on TV at least a half dozen times a day lying his hiney off about how much he cares about Veterans getting a refi loan for their mortgages.   Not sure what the reason is, but that’s all lies.  I applied for such a loan and after two days of giving out personal information (which may be the reason for the ad) I was decline because they said that I make too much money.For God’s sake, I’m below the poverty lever. I’m on Social Security and that’s it.After I pay my truck note and my mortgage note I barely have enough to pay my utilities.  That’s why I wanted the refi.   So that I would have enough left for food.How does the Admiral and your people sleep at night without nightmares?", "rating": 1}, {"title": "Not cool...", "text": "That Retired Admiral Lynch tv commercials make it sound like this company is the only company helping vets and doing these type loans. He is a scumbag praying on military vets... Every mortgage company in the US can and does do the exact same VA loans, many of them cheaper. As a vet, I am saddened and sickened by former military scamming our military and vets. I", "rating": 1}, {"title": "Tried to get a quote from New Day", "text": "Tried to get a quote from New Day.  Great response initially, but once the quote was completed, I wanted to make a couple of changes.  After many emails and voicemail messages (Couldn't get thru to the agent live) with not one return call or email....I give up.  Going somewhere else.", "rating": 1}, {"title": "This is a joke They say they will work …", "text": "This is a joke They say they will work with you and your credit report isn't the only thing they use they won't let you explain yourself  they are looking for the easy loans and just talk crap if you have anything on your report they just blow you off and add another item to your credit report  which is just another mark against you on your credit report I only owe $112,000 on my loan didn't want any money out just a refinance of loan at a lower rate I wanted to talk with someone else That didn't happen", "rating": 1}, {"title": "I was recently turned down", "text": "I was recently turned down;  these people do not give a crap about veterans, my wife and I are 80 years old [Korean Vet] that was the reason for turn down; our credit is excellent; in fact we are with another company, and less interest rate; my loan agent was a Mr. Cohen, these are loan sharks utilizing the VA and veterans, making them think they are special, and higher rates, and distributed among many mortgage companies, this Admiral leading the charge; shame on them !!!  This fake VA set-up pretends to be a financial institution strictly dealing with helping veterans, U do not have a VA loan with the advertized company, it is a pool of loan sharks feeding off the frenzy and pretense of helping veterans; not so, U R farmed out to mortgage companies U never heard of, and may cease to exist after a certain  length of time, then U R farmed out to others.  U see New Day's reply to me ? All the equity I have and score of 700 for both me and my wife, their interest to veterans is above board for what they can get, and I did get from another financial institution; 3.87 and cash out  for home upgrading, I do not like institutions lying to vets period ; this Admirial and this lady veteran ought to be ashamed of themselves, involving themselves in a financial mortgage game, and that against veterans, NewDay USA is nothing but a bait/switch involving a pool of rogue mortgage companies, there is no financial group called New Day USA, just a setup to snag vets and over charge them with higher rates.", "rating": 1}, {"title": "A Ripoff in Interest Rates", "text": "I am the process of getting a refinance on my principal residence.  I am a 100% disabled veteran, with a good credit score and plan to use my VA Eligibility for my new loan.   I have contacted several mortgage companies, including NewDay USA.  I have received intrest quotes of 3.125, 4.00 and 5.25 from NewDay USA.  From all the advertisements on TV and the weekly mailings I get from NewDay USA, I thought that they would be the lowest, not the highest.  I doubt that this \"rating\" will be published, but I will be looking for it.", "rating": 1}, {"title": "Failed to disclose PHH Mortgage Services as debt collectors.", "text": "I had an average experience with Jordan Stout but I was not  agency that handles payments.  I had to pay a fee to pay a one time payment by internet or phone today. To the average person you come accross as a one stop financial institution but you're not. This is the worst refinance i have ever experienced! I had a 3.15% loan with Wells Fargo but when I got in a bind and came to you I go.t charged 4.15%. I know it was my credit rating that had something to do with it. I knew I should never listen to an officer! I am a member of a very large American Legion in Mederia beach in Pinnellas county Florida and I will NOT recommend you to anyone!", "rating": 1}, {"title": "Horrible Experience", "text": "If I had it to do all over again with the time available, I would have used another refinance company. It started off good with good communication but once I had too much time invested to stop the process the communication pretty much stopped too and the process slowed down tremendously. Although I had to go through the process of removing my ex-wife from the title (which I understood that delay), the process that I was told would close before Christmas of 2016 ended up closing in February of 2017 and my loan manager put the blame off on my ex wife over and over although it had nothing to do with her. It was simply the miscommunication that was the problem and it finally led into a verbal confrontation between myself and the loan manager because the loan manager kept insisting that we were holding up the process when none of it had to do with us, but they had failed to clarify information with the title company and that was what was holding us up. I was very displeased with the lack of communication, being lied to on several occasions, and the lack of professionalism.", "rating": 1}, {"title": "Don't believe what you hear on TV.", "text": "I am a retired USAF officer of 25 years.  I was outright denied by NewDay USA.  I went to another mortgage company and was approved for 3.25% APR 5 weeks later.  NewDay conveys marketable statements without legitimate follow through.  I rate this company a “zero” and will not be recommending this company to the surrounding military community of Las Vegas.  False advertising!  Thank you Alliance Home loans!", "rating": 1}, {"title": "Very slow process, next time I would use a different mortgage company.", "text": "Company asks things that are different from other mortgage companies, very awkward to deal with.", "rating": 1}, {"title": "Now The Worst Credit Rating We've Ever Had", "text": "We initially had a great impression of our New Day loan representative. He seemed friendly, trustworthy and willing to go an extra mile to help us. As time went on, we became more and more discouraged and frustrated.    We had to do all of the legwork. We faxed. We signed. We called people many times over.    We were interrogated about our credit report by the loan rep with far too many questions. The so-called \"interviews\" were far too personal and seemed to go on for weeks, even with all the information at hand for the rep (from the home we bought just 2 years ago).       The closings costs were almost double another home we just sold a year ago. The escrow had to be paid 1 year ahead of time. We just got another notice that the escrow amount had been raised yet again. We have had the loan for 3 months.    We didn't received our checks to creditors right away (or even a few days later or a week later). We told the rep. that we now had to leave to go to a funeral. I held all mail at the post office. Upon our return, the pay off checks were found (several weeks later) under the sprinkler system. They must have gotten here the week we told the rep we would be gone, and were totally ruined. Hasn't anyone at New Day heard of signed mail receipts or electronic transfer? Then, we were promised that the checks were in the mail again and not to bother about paying the monthly fees. The rep would personally talk to the card companies about it, or help us out.   '    We finally received the payoffs almost two months after closing. Meanwhile, the rep kept saying that the checks should be there and don't worry about paying the monthly fees. He would personally talk to the card companies about it. So, we didn't pay, thinking the checks would be here very soon and the promise that the rep was taking care of it.     When we talked to the rep later about this, he said he had conversations recorded exactly as to what had been said. Like we didn't know what had been said? So, this was an attempt at intimidation. The rep basically shut us up about our view or interpretation as to what happened. If I knew that he was not helping us, out as he said, we would of paid the very small fees.     Finally, about 2 months later, the checks arrived. Some were grossly misspelled.    Also as a veteran, I am not supposed to pay home taxes in the state of Arkansas. We said this over and over to the rep. We were told this would be cleared up by the rep and not to pay this home tax fee.   Then, guess what? We get called by New Day at least 5 times, saying that we needed to pay the $90.00 home tax fee and .....that we were late for the home tax fee.   We had had several late payments and one credit card account, that we had for 9 years, closed permanently (for being late 2 times and for falling credit scores).    We had to do the leg work again, and call the county to clear up the home tax situation. Nothing had been done by New Day in this regard as promised.     Nothing was smooth or easy about this loan. Everything was a dilemma. These promises to help us were not kept. Once we signed the paperwork, little did we know, we were on our own. We'd NEVER recommend New Day to any veterans, EVER.", "rating": 1}, {"title": "Matthew was awful . Took 4 months to close.", "text": "Matthew never followed up after all information was received. Had too call him to check progress on loan. Very bad experience.", "rating": 1}, {"title": "Harrasment and delaying closing", "text": "Too many instances where proof for information was not good enough for the requester (Underwriters) and an attitude that it was their way or the loan will be delayed or disapproved....", "rating": 1}, {"title": "Malcolm knew his job and was very professional and knowledgeable", "text": "I would recommend him and the company", "rating": 1}, {"title": "Procrastinating, incompetent service", "text": "Our loan was delayed by over two months because of lack of follow-through by your staff. I had to call YOU numerous times. You claimed the loans was delayed because of a lien from a solar power company.THEY contacted you and sent you the proper forms. But YOU claimed THEY hadn't followed up. I contact them and they sent me the email they sent you on time - Sept 26.I had to personally intervene to push this loan through.I will NEVER use you again, and will NOT recommend you to anyone else.", "rating": 1}, {"title": "Worst experience of my life", "text": "Absolutely the worst experience of my life. This is my 3rd refinance in my life and I know they take only 3 weeks to accomplish, but with Newday USA it took over 2 months. They also added $3,100 unnecessarily to the loan because they were too lazy to get the correct payoff from my other mortgage company. They harassed me every day for documentation the entire 2 months dragging out the process instead of simply asking me for it all up front.They asked me for an estimate on property taxes for the escrow account, so I gave them a letter from the property tax office with a near exact estimate of $1,304, then I had to fight with them for a month to use that number instead of an amount that was 80% less to determine my monthly mortgage payment. Probably to make their stats look better.When it came time to do the final signature I was given the name of a notary who was supposed to meet with me and the name I was given was the actual CEO of the NewDay USA Title Company 800 miles away, yeah that was an embarrassing call. As for the notary public, she called to confirm the appointment with me 1 hr 12 minutes before my appointment instead of a week earlier. I had no idea if I was going to meet with her or not until then because NewDay USA didn't keep any other deadlines throughout the entire process.Don't even think about the equity loan because they screw you by adding 1+% to the 30 year loan. In the long run as an example your $25K loan ends up to be around $100K, don't do it stick with a bank for small loans.I recommend anyone else over these clowns.", "rating": 1}, {"title": "Good experience", "text": "Knowledgable people. Took longer than expected", "rating": 1}, {"title": "Worst experiance ever please contac", "text": "Please cnontact me 406 223 9999 worst Co. ever dealt with. Imbarised for them to be associated with the VA. They didin't earn the. $15 k they charded me to process the VA loan.  I started with them in Feb scheduled cnosing on July 15. Finally closed on July 15 been through. 3 loan reprisentitives still haven't recived my money. And they can't guarintee ehen I will get it. I think they are bordering on breakind the lawPlease contact me 406 2523 9999. Thank you a very dissatisfied vetran.", "rating": 1}, {"title": "It was a nightmare", "text": "Today at near the end of this journey with You and New Day USA and although real improvements to our  home have been  made we are saddened  and extremely  disappointed. When we started  down  this road we put our trust in you’re  hands to make a way for us to make repairs  to our kitchen bathrooms and put in a new driveway- I made this abundantly  clear now we find ourselves where we started. If this were  truly about my service to my country- about me and my family then why do I feel like it was only about the  value of my home.              Sincerely.  Anthony E. Loche", "rating": 1}, {"title": "Clumsy and inefficient", "text": "I regret that my feedback is so negative.  I stayed very frustrated about working with New Day. To start with, I could not get any cost estimates even though such estimates are widely available with other lenders. I'm told that New Day's ridiculous requirements for information and documentation were because this was a VA loan, which might be accurate.  But it is not the VA's fault that the New Day employees working on my loan were inefficient, did not communicate well together internally, did not consider anything in advance, and continually dropped one last minute requirement after another on us.  We were especially surprised when they called inspectors and repair people that we had engaged to ask these vendors to verify that we had paid for the services. Why didn't New Day just ask us for receipts or bank records? This was totally invasive and made our vendors think New Day was ridiculous and rinky-dink.  It took six months to close on our purchase.  I will never use them again.", "rating": 1}, {"title": "Matt was outstanding.", "text": "The process was efficient and easily done", "rating": 1}, {"title": "Poor Experience", "text": "It has been a terrible experience due to the fact of a huge lack of constant communication from day one. Examples: 1. Sending us package of papers that we didn't even know what to do with them without explanation. 2. Kept questioning the fact if I was an exempt as a disabled Veteran when I clearly explained that I was. 3. Had to keep calling to find out what stage are we in through the process when that's not my job to do. 4. Didn't inform us when he was out of the office number of days so we had to call again just to find out we are in more of  a delay on your behalf not ours. 5. Finally signed our paper on the 11th of July and received our closing money direct deposit on Friday but nobody had no idea of who the carrier is that is delivery us the remainder of our checks to be paid to the creditors. Again, we had to call and chase for that information. I am glad that this is finally over but will not recommend another fellow veteran to go through this same process that went through.", "rating": 1}]