[{"title": "The licensing process was slow", "text": "The licensing process was slow.  I didn’t have plates or registration for two weeks after car arrived.  Checked with a local agency and they were unable to get a temporary license for me.  I had to wait until plates arrived by UPS.  All else went smoothly.", "rating": 2}, {"title": "Poor Communication", "text": "Although pleased with buy-out value, communication was extremely poor. No timeline of events given and did not have a consistent point of contact. Always left in the dark for several days where I had to initiate contact. Entire process took nearly a month!! ", "rating": 2}, {"title": "Poor Communication Process", "text": "Communication was horrible! I was having to initiate everything as whoever was working with me was always gone or didn't know I was in the buying process. I had a few great employees who were able to get some things spearheaded so it didn't keep drawing out longer but the buying process took well over a month to complete and not from my lack of providing information as requested. It was hard to get ahold of anyone when I needed assistance half the time and when I did get ahold of them I would be told one thing and that things looked good but then emails would say I didn't do things and it was delaying the process. I have a vehicle I'm happy with in the end but it was a LONG, PAINFUL process that I won't be going through again.", "rating": 2}, {"title": "No return calls from customer service…", "text": "No return calls from customer service charging cable was not with car when delivered took a week to get was supposed to be overnight did not get response until I threatened to give car back. Very poor follow up and experience. I know you won’t do anything with feedback ", "rating": 2}, {"title": "If communication is important, dont sell your car to Driveway", "text": "Overall the starting experience was fine. The first person I spoke with via text/call was very helpful. He did give me timelines that were not accurate, but not a big deal. Every couple days they pass you off to somebody else without warning. Once you get past talking to the first person in the process the communication deteriorates. It goes from instant responses to a day later and eventually you get no replies. I wont go through this process with the Lithia dealership group again. ", "rating": 2}, {"title": "The communication was terrible", "text": "The communication was terrible. It seemed as though each person I spoke to had no idea what the last person was talking about or gave the opposite answer. The delivery drive also didn’t pick up the vehicle when scheduled to and we had taken the day off work to be available for the car getting delivered. They say 7 days or 400 miles to return the car if you don’t like it but the place I bought the vehicle from does not provide temp tags. The vehicle has to sit in my garage until I receive my actual plates in order to drive it. The agreement should be changed to 400 miles because the 7 day window of test driving the vehicle is already done and passed. I would not buy another vehicle driveway. ", "rating": 2}, {"title": "I was told different thing by different…", "text": "I was told different thing by different people.  I was laughed at when I wasn't understanding the process. The last lady I talked with was amazing so thanks to her I didn't back out.", "rating": 2}, {"title": "Sent a vehicle that should have been…", "text": "Sent a vehicle that should have been fixed before sold. Steering wheel is at 30 deg angle when driving straight, there's no way they could have accidentally missed this. Wasted hours of my time and their own time. Ghosted me several times when trying to return it. Marking 2 instead of 1 stars because the people are pleasant when you can actually get them on the phone.", "rating": 2}, {"title": "Communication was void", "text": "Communication was void. Dealt with several different agents that had conflicting outlines of the process. I was told that I would be able to have the vehicle delivered to my place of work in La Jolla, but it was shipped to my home city instead before finally be shipped back to original dealer. I then just drove to the dealership myself to take possession. Overall, an unpleasant transaction. Certainly not the painless exchange that I was hoping for, or as advertised.", "rating": 2}, {"title": "Felt scammy until my car showed up.", "text": "Felt scammy until my car showed up.No overview of steps or outline of the process left me feeling like I was sending my personal info and a cashier’s check to a scammer. I had to do significant research on the company to gain confidence and still felt weird the whole time. Tell customers how the process works so we know what stage of the process we’re in and what to expect next. ", "rating": 2}, {"title": "Nope", "text": "I was a second time customer. The first time used driveway.com, I found the company to be somewhat unprofessional, but the advantages of the site made me think that the unprofessionalism was worth a second time, a poor choice on my part. The unprofessionalism at driveway.com had increased exponentially. ", "rating": 2}, {"title": "Great at taking payment delivery may be a struggle though in fairness it'll happen. ", "text": "Through the stages of paperwork and wire transfer everything was smooth and easy. Then through multiple delays in shipping communication completely broke down to the point where I was pretty sure no vehicle would ever show up. It was impossible to get basic information. On the day of delivery, I had to call at the end of business to find out that they had delayed shipment again after having to take a day off of work to be close if they called for delivery. I eventually received the vehicle but it took almost a month after full payment had been made, and 4 separate delivery dates spanning 2 weeks. This was the most stressful and frustrating vehicle purchases I have ever had. At present I am still waiting for a reply to an email so I can sign for final deliver when a link expired. ", "rating": 2}, {"title": "Service alert on my next day of my car delivery ", "text": "After delivery next day I received service notification . Informed my agent and she told me to take to service center and ask them to check oil and if required change the oil . The amount will be reimbursed she told but later once after I did oil change she shared oil was changed before my delivery and she is not responding to my email or msg I’m disappointed and not sure whether they will respond if there is actually an issue occured", "rating": 2}, {"title": "I would not recommend Driveway.com! ", "text": "I would not recommend Driveway to nobody. They never kept their word, I always got a different story when I CALLED THEM. I started the process of purchasing a car on May 25th, I didn't received my car until June 20th. Almost a month. Worst experience of my life. ", "rating": 2}, {"title": "TOO MANY GLITCHES!They dropped the  ball after the…", "text": "They dropped the  ball after the initial email/bid.I wanted to have someone call me back but they would only email and the customer service was very poor up front.The actual pick up  went well.Your \"reminder\" email came out 3 days after the transaction was completed reminding me that the documentation was past due...Too many glitches in your process!", "rating": 2}, {"title": "Honestly, a complete mess and waste of time. Bought truck with bad tranny. ", "text": "There was very little communication, I was constantly being handed off to another person, I never knew the current status of my order without asking, and the process took 3 weeks. In the end I had to return the truck because the transmission was bad. ", "rating": 2}, {"title": "It took over 2 months to get the car", "text": "It took over 2 months to get the car. I encountered frustrations from the beginning. I first paid the deposit and received a confirmation that the car has been reserved. Two days later a person called me and told me that it was an error, ‘someone’ else previously bought the car so it’s no longer available. I knew it was BS, the car was still listed for sale for the next 2 days. It went downhill from there", "rating": 2}, {"title": "The lower rating for Difficulty…", "text": "Lower rating's for the difficulty of uploading photos. It's usually objectively easy to take pictures of your vehicle in a usual application when trying to sell the car but Driveway makes it really difficult. It's set up in such a way where you have to angle your phone and then you can't set your auto flash and it will reject your photos. When trying to explain it to the rep that I was having difficulty he rejected me and the offer. That's fine, I'll just keep my car. Honestly the offer was very low. But they need to make the remote appraisal process easier. Other \"apps\" where you upload pictures where super easy is what a seller is looking for After a point you give up. He didn't even offer to help me or walk me through it. They only give you one option to submit photos.", "rating": 2}, {"title": "Make this a last option ", "text": "The only good part was the product. They are awful at communication. I constantly had to ask for updates even though they say they will let you know. They also forgot to send all the paper the first time, stalling the process but again I had to call to see why it was taking so long and that the answer they gave me. They will take your money asap but take as long as they can to deliver it. ", "rating": 2}, {"title": "It’s been two weeks and I’m still…", "text": "It’s been two weeks and I’m still waiting on my vehicle. They sent me the paperwork to sign twice via email and said that everything was fine but now they have to send the documents through the mail?  This is some kind of scam and I think that I might call the BBB.", "rating": 2}, {"title": "I purchase a car in April 2023", "text": "I purchase a car in April 2023. It is now July7th. I have yet to receive registration or tags. Sitting with a $40,000 car and can not drive it and insurance company cancel coverage. Promises from every department yet NO response from from their DMV department. I had to call sellers company, they stated they sent title to Driveway, and I still don’t have registration. How much longer must I wait? I will not recommend this company.", "rating": 2}, {"title": "Continuity of care and earlier disclosure", "text": "Everyone at Driveway was very nice and courteous. They responded relatively quickly via email. The problem was two fold: 1. No continuity of care. Each call I was connected to a new customer service rep and felt that I had to \"start over\" with regard to where I was in the process.2. It was not until the end of the process that they disclosed that they require either:a) a lien-free title (lien release letter from the lender was not sufficient) or b) a \"notarized\" lien-release letter. Neither the DMV nor my lender knew what a \"notarized\" lien release letter was.This information should be disclosed earlier before putting so much time and effort into the listing process.", "rating": 2}, {"title": "The initial discussion through signing…", "text": "The initial discussion through signing paperwork was fine.    Then you all told me a trucking company would call to make an appointment to pick up truck and all hell broke loose.   I got a call while I was teaching and could t answer phone so trucking company said \"to bad\".  I was in the bathroom two days later when they called then wouldn't answer or return my call.  Then ai was teaching again and couldn't get call so again wouldn't take a return call.  I finally had to leave my cell phone home (thankfully my daughter moved back home) so she could be there to get call.  I was told by trucking company the drivers call when they are about 30 minutes away.   That is not making an appointment and now is it feasible for a working person.     I finally got an email the truck company would be there by 8:30 on A Friday morning.     He showed up at 630ish when we were heading out of the house for dinner.    No calls or updates on him.  I also noticed I received my money but the bank hadn't.  When I called you all to find out the guy I spoke to was an ass and sounded like he was reading a script.   I called back after talking to my bank and got a different person and she was extremely helpful   So.  I am not pleased with the overall service.  ", "rating": 2}, {"title": "Train the staff better", "text": "Train the staff better, everyone  was saying  different info. And only 1 person  call back out of the 10 person  I spoke to", "rating": 2}, {"title": "Do not buy a car from this company", "text": "Do not buy a car from this company. For one, they take literally FOREVER to get your registration and title for the vehicle. For two, the “limited warranty” doesn’t specify what exactly it covers in the contract, so they’ll screw you over and not cover anything because they don’t write specifically what they cover. They’re only getting two stars because I got a good deal and low interest rate on the vehicle, but I’ll never buy from them again. Horrible company.", "rating": 2}, {"title": "Car yes! Team no. ", "text": "Overall I’m extremely happy with my vehicle! But not the team I had. Poor communication with me. Took longer than the time they told me to get my vehicle. Didn’t disclose any imperfections. ", "rating": 2}, {"title": "Waste of Time and $$", "text": "I liked the car, but found an engine leak. I had the car inspected immedaiately upon arrival. Initially ghe warrenty department was very helpful. Saying it was no problem, as long as I paid for the diagnostic up front, they would reimburse me and pay for the repair. When they were unable to find the source of the leak with the initial diagnostic and recommended taking apart the transmition to find it (labor cost of $1100) suddenly the car was and older car (2020) and they weren't certain if the labor would be covered, even if they did find a faulty part and had it repaired. I feel like they would have used any tiny excuse to wiggle out of the return. I'm glad it was within the 7 days and I didnt drive it, so it was below 400 miles. They also advertised the vehicle without a remote start. It was the main reason I picked this car. Their remedy was $500 towards the install of a remote start. Turns out if remote start doesn't come with the car, it's not something that can be installed later. It was within the 7-day time frame, so I opted to return the vehicle. I can't get my money back until they decide to pick up the car, which they also don't want me to drive in the meantime. So now I'm out the delivery fee of $1600 or so. It took over 2 weeks to get the vehicle. A week dealing with the diagnoses, and now they are saying 12-15 days for them to pick it up. I will avidly be recommending anyone steer clear of any online car buying experience. ", "rating": 2}, {"title": "I signed the order on 6-10-23.", "text": "I signed the order on 6-10-23.Order #NK4322L is currently delayed in contracting department.I have contacted Driveway customer service multiple times. The agents have been courteous.I am looking to expedite the contract process beyond the normal time frame.There are time sensitive cash offers from stellantis that are in risk of expiring.Are you able to assist in expediting this process to ensure i am able to capture the rebates from Stellantis?", "rating": 2}, {"title": "Disappointed in Driveway", "text": "We figured it would be a better experience shopping online for a vehicle as to using the dealerships around us. Especially with add on fees they like to drop. However, driveway did the same thing with adding on extra fees. It took about 10 days to deliver the vehicle. When we got the vehicle, the inside was dirty trash stuffed in back of the pockets,  no detail seemed to have been done not even vacuum. We also noticed the back tires were way low on tread. We reached out to driveway and all they told us was that “it passed their inspection”. We took it down to a tire shop and they said we were right at borderline of the tires reaching 4/32. We even gave Driveway that report & because we are “right above the 4/32 that’s passing inspection”. Overall I wouldn’t consider going through them again. Not worth the headache, rudeness from their customer service resolution team & supervisor, nor the wait on a vehicle. ", "rating": 2}, {"title": "Got a lemon and don’t like lemonade", "text": "Once received we drove for about 15 minutes then parked the car. After the weekend we went to take it to DMV for tags. Upon getting in the fob would not open the doors. We had to use the emergency key to open the car. The dash stated that the battery needed to be replaced. After replacing the car went into reprogram mode. During this time every time we opened the doors the alarm would go off and the fob did not work at all. We requested the car be returned. The Rep stated it sounds like the fob just needed reprogramming. We attempted to call a locksmith with no avail and no help from the sales Rep. The power locks only lock from inside and do not unlock. We have stated that the car is not functioning and would like to return it several times. It has been in my driveway now 3 weeks and can’t even start it up. The staff with vehicle were very deceitful and never followed up on anything they said. We have had to call over and over. Just recently did we get the forms to return it. I would like to add that once getting ahold of a supervisor named Amy our return has started. She has been super helpful and compassionate. It WAS the dealership in Elk Grove that pushed out a lemon. ALSO the robo generated response is BULLS&@T!!!!! This vehicle has never been in a repair shop !!!!! So what are they monitoring. ", "rating": 2}, {"title": "Awful experience ", "text": "We originally ordered a car, went through the entire financing approval process, credit pulls and all, and then were told the next day that the car was no longer available. They did nothing to make up for the unnecessary hit to our credit. Rather than going somewhere else and going through a credit approval again we decided just to pick a different car. It took almost 3 weeks for delivery, during which time driveway informed us that it was having work done on it. They never told us what was wrong. Once we received the car it quickly through a check engine light. We contacted driveway and they said they would reimburse us for the diagnostic and to get them an itemized quote with labor and part numbers. Turns out the check engine light is an easy fix, not really a problem. But thank goodness we took it in to a dealership, they did their normal multipoint inspection and found that head gasket, and oil pan seals are leaking, rear shocks bed to be replaced and one of the axels is leaking. Over $7000 worth of work. Needless to say, unless driveway cover this, we will be returning the vehicle. I don’t think the mechanical troubles are necessarily driveways fault, since the car is from a separate dealership, but maybe it’s a sign they don’t hold the dealerships they work with accountable.", "rating": 2}, {"title": "Stop! They will sell you a banged up car. ", "text": "Great service and easy process at first.When I received the vehicle it was damaged which was not revealed. They would not take it back unless I paid another $1672 for return. Then to justify it, they sent fuzzy pictures that they felt showed it was damaged. I would never recommend this company to anyone. ", "rating": 2}, {"title": "I wasn't happy that it took 2 months to…", "text": "I wasn't happy that it took 2 months to complete the sale of my vehicle. To many hoops to jump through. I had to spend money that I didn't have, just to sell it. And never got reimbursed. Then screwed me outta $500 from the original sale price agreed upon.", "rating": 2}, {"title": "Don’t use this company if you expect plates for your car!", "text": "I purchased a 2018 Volkswagen Tiguan in early October 2022. Everything seemed very impressive with this company. Delivery was quick, car was beautiful, financing was seamless, and yet, here we are middle of February 2023, and no plates! I don’t even have a current temporary tag! My “DMV Specialist” Kelsi Hutchinson has completely disappeared. Emails are being returned as undeliverable. I was told 2-3 weeks to get my plates after the registration papers were overnighted back to her (in October), yet here we are… I finally spoke to someone named Alexander yesterday. He is telling me that it is my fault for leaving DMV without my plates. So I sent him EVERY SINGLE EMAIL I have showing how this “process” is supposed to go according to this Kelsi Hutchinson, and still NOTHING. What a disappointment!", "rating": 2}, {"title": "Not a good experience", "text": "Not a good experience. Submitted all the paperwork and paid the deposit. I was told the next day that the vehicle had been sold to someone else. Not sure how that's possible because when you start the purchase the vehicle is listed as 'Sale Pending' which states that they are holding the vehicle for a shopper who started the purchase process. 2 stars because the agent was easy to work with but I would not recommend.", "rating": 2}, {"title": "They'll ask for money first and require an insurance policy before ever confirming with their bank they are happy with your info.", "text": "I'm giving two stars and not one because I should've known better, but you'd think the VERY FIRST STEP would be to make sure with your bank the information the customer put on his application meets their requirements BEFORE making them pay for insurance and a down payment. It's ass backwards and I still don't have a refund leaving me in a situation where I either have to wait indefinitely or dispute with my bank.", "rating": 2}, {"title": "The process to sell my vehicle was very long and cumbersome", "text": "The process to sell my vehicle was incredibly long and tedious.  I had to speak with 5-6 different employees at Driveway along the way.  There are certainly a few steps that can be removed along the way to streamline the process.  It felt very long and cumbersome.  By the time the last step came around for pickup and I had to get on the phone again, I was ready to scream!  Also, some of the calls were extremely detailed and were over 20 minutes long.  Selling a car to carmax takes less than 15 minutes.  You guys can do better.  This was all for an old car I have that you offered me $4,500 for.  My time was hardly worth it.", "rating": 2}, {"title": "Communication and follow through are…", "text": "Communication and follow through are inconsistent at best.They are quick to make an offer and clearly want sellers to finish all paperwork in a short order, but then things slow d o w n.. a. Lot.Their next day delivery of documents took 3 days to send.  They wanted everything by the end of the week.  Tough to do when package arrived on Thursday night.  Then they needed extra time needed to get vehicle picked up.  I did receive my part of the funds in 24 hours, but bank payoff did not initiate until 2 weeks after they hady car.  That happened because I called looking for the payment. I got told, literally, the check is in the mail via Next Day Air.  Well the last time that happened, it took 4 days.I was given an invalid tracking number.  It took 2ore follow ups to get a confirmation that had correct tracking info and showed the payment had been made.So, started process 5/31, finished on 7/2.Seems to work well if you do not have to deal with any lienholders.   Be prepared to be quoted \"our policy...\" and not receive updates as promised.Payment amounts were fair, but service attitudes need work.", "rating": 2}, {"title": "No ability to coordinate with driver", "text": "I recently order a 2019 Malibu, I've started the process about 2 weeks ago. The delivery of the car was expected yesterday, but they changed it to today. I've tried calling dispatch to see if it's still coming today but was met with voicemail. I'm assuming no one is there today due to Thanksgiving. They need to give the customers more access to their carriers, customers can't coordinate with drivers or carriers when there no information.", "rating": 2}, {"title": "Bait and Switch Scam", "text": "I had read these reviews before and engaging with Driveway and I don’t know why I thought my experience would be different. I paid my deposit and down payment for a car, signed all the paper that I needed to, sent what I needed to back to them, only to be told that the car I was purchasing had already been sold to another person. I could feel sympathetic if this was an isolated incidence but it’s not based on what I’ve read in these reviews it’s not. I don’t quite understand how a car can be “secured” for you only to be told it’s actually not. I have two stars because the team was polite about whole situation but that alone isn’t enough since I’ve ended up disappointed with this entire experience. Just another bait and switch scam. Proceed with caution and only use if you can wait over a month to receive your car and have the capacity to possibly face this same disappointment.", "rating": 2}, {"title": "I tried to buy a car", "text": "I tried to buy a car, and they had no idea about the DMV rules/process in my state and tried to sell me a car that I wouldn’t be able to drive for weeks because it wouldn’t have temp plates since it was coming from Cali, and they didn’t know the process until I pointed it out to them. They were apologetic at least (which is why I’m not giving them one star), and said they would refund my $500 deposit. It’s been about 10~ days and I still haven’t got my deposit, my calls aren’t going through and no one’s responded to my email or texts asking about a status on the refund.", "rating": 2}, {"title": "So far I’m about a month Into this…", "text": "So far I’m about a month Into this process and still have no vehicle. Initially the first vehicle I selected ended up being already sold but It took someone about a week to let me know this after I had already paid the deposit. After that I found a new vehicle got approved got the paperwork about a week later sent it back the next day along with my down payment. This was 2 weeks ago. Last week I got a text saying my vehicle was scheduled to be delivered Saturday 8/3 I wait all day and nothing. No calls not texts. Sunday rolls around and everything is closed so they told me I had to wait till Monday when people were in the office. Monday rolls around, today, they tell me my vehicle was supposed to be picked up from the dealership Friday but it never was. Why no one decided to communicate that with me is beyond me. Now they tell me they have to find another delivery driver and they will let me know. This process is long and they expect you to do everything in a timely manner but they do not do the same in return. They had no problem making sure they got money from me though. In total I’ve paid almost $9000 for my deposit down payment insurance and delivery and I still don’t have a vehicle or an update on when it will be delivered. I can honestly say I will never purchase through them again. ", "rating": 2}, {"title": "Timely response and coordination is an Issue", "text": "I was immediate in my responses but Driveway was a cluster of miscommunication and delay. Not sure why but fortunately I was in no hurry so put up with it.", "rating": 2}, {"title": "First online car shopping experience", "text": "The paperwork and financing was simple and easy. I felt like everything was taken care of and had no concerns or issues with the upfront process. The problems occurred when it came to actually getting the vehicle I purchased. Some of this may be unique to my cross country delivery, and i wasnt forewarned of the nuances. Once delivered, no tags, registration, or state inspection. The driveway team is much harder to get a hold of once they've already gotten their money. I was told the vehicle would be cleaned and get state inspection once it arrived to the local location. The vehicle came to me dirty and with no inspection. There were far more \"imperfections\" on the vehicle than what was disclosed to me by salesman. There may be miscommunication with the 3rd party local delivery team, but I still feel lied to on multiple levels. If it wasn't for forfeiting the huge delivery fee, I'd have returned the vehicle. The price of fixing the undisclosed issues is less than the non-refundable fee, and the vehicle will be (and would have been) great without the additional small issues. Won't be using Driveway again.", "rating": 2}, {"title": "My (trade-in) 2018 Kia Sedona has not…", "text": "My (trade-in) 2018 Kia Sedona has not been paid off and it is over one month since Driveway picked it up.  I have had to make two monthly payments due to the negligence", "rating": 2}, {"title": "Decent experience but ANNOYING…", "text": "Decent experience but actually so annoying at the end. Bought a 2021 Kia Seltos S. Approved at a good rate. Signed a ton of paperwork and they needed wet signatures too, which makes no sense. So they overnighted more paperwork and I sent it back. Also for some reason the down payment couldn't be done via credit card and they wanted me to mail my 10k down payment. So I mailed a cashier's check as well. A day after it was received I picked up my car. So far all good. They delivered the CAR WITHOUT TEMP TAGS. It has NOW BEEN 3 days without TEMP TAGS and I am being given terrible customer service trying to fix it. All of the agents have been nice, but have not done ANYTHING to help the process or explain to me how a car can come from a dealer without TEMP TAGS.", "rating": 2}, {"title": "Not worth it", "text": "The prices are good. That’s it. The company is made up of departments that don’t speak to each other. I actually cannot believe that they manage to get anything done at all. I have never seen such a disorganized company in my life. Everything you have seen in these reviews about ineptitude regarding registration is correct. I purchased a car in March and we’re coming up to the end of May and they’re telling me the estimate is 4-5 weeks for registration. I have been told that this is just how long DMVs take to complete registrations which is completely absurd. I now am making payments and paying for insurance on a car I cannot drive. Only go through driveway if paying a bit less is worth months of hassle to you.EDIT: As you can see from Driveway's response, absolutely nothing will be done to help. They are simply not capable of completing transactions in a timely manner. It seems to be an issue of a company with limited resources and not much time spent on training attempting to take on too much", "rating": 2}, {"title": "Save yourself a lot of frustration!!", "text": "When I say this is the worse car buying experience I ever had. I’ve had my car 2 months and still haven’t received hard plates. I’ve been riding on expired tags since March 1st. I keep getting the run around from everyone at driveway about this issue. It is a nightmare.", "rating": 2}, {"title": "Car was delivered with no registration…", "text": "Car was delivered with no registration or tags. Extremely difficult to get any response to correct this issue.", "rating": 2}, {"title": "Very poor communication", "text": "Very poor communication. If you ever want to return a vehicle it is not an easy process. ", "rating": 2}, {"title": "I got approved a week ago", "text": "I got approved a week ago. I received a call 2days later stating that the vehicle I wanted had rust spots. He told me I could pick another vehicle in which I did. It’s been almost 3 days and haven’t heard anything! And both of the vehicles are still for sale on the website with no “sale pending” attached. I would like to know what’s going on? I’m fixing to just ask for money back and forget about it! Emails remain unanswered also.Update… they got back with me and tried to fix everything. Hopefully I’ll have a vehicle delivered soon.", "rating": 2}, {"title": "More aggravating than it should have been", "text": "Sold and old car to them.It seems every interaction with them is with a different person.After pictures, signatures, notarized paperwork, etc shipped off, I get an email saying \"We understand your car doesn't run.  We cant buy it\"  WRONG, I don't know where they got this info.  Called, explained, and they said they will proceed with purchase.  Then I go ANOTHER email from someone else claiming \"We understand the car is inconstant starting, and will decline offer\"  WRONG AGAIN.   Another call, more frustration and aggravation.  I was ready to pull the plug on it myself, suspecting some kind of scam outfit.To set up for payment receipt, they need to txt a code for verification - I had my land-line number on the account and had to jump through more hoops to get that changed to a cell to receive txt.Eventually they did complete the transaction, picked up the car, and I got paid.I feel the whole experience was more aggravating than it needed to be.Edit:  This number was in one of the emails: 1ZY308V10192793479That was another thing that was kind of odd - there was no clearly identifying number I was told to use.  They just relied on my email and phone number, which I won't reveal here.I don't even see a receipt number on the Bill of Sale.Edit #2: On the receipt from the transport company, there is a note \"Upon delivery ... Driveway  - 5480213\" Hope that helps.", "rating": 2}, {"title": "The experience with Driveway itself was…disappointing upon receipt of car", "text": "The experience with Driveway itself was very favorable until the delivery of my car. Up to that point, communication was good with lots of follow up.  When my car arrived (2021 BMW with 12k miles) the check engine line immediately came on. I had no one to contact except a generic customer care. I left a message that I wanted to return the car with 7 day period. I received a call the next day (Saturday) advising me that a supervisor would call on Sunday. The supervisor was very reluctant to discuss 7 day return. In the meantime, we took the car to our local dealer. Turns out the selling dealer in another state made a negligent repair which was NOT covered by manufacturer's warranty.  I reached out to Driveway a couple of time and communication was very slow, if at all.  I presume this is to move past the 7 day return policy.  My car was in the shop for 7 days. I was not able to drive it until 11 days after delivery! After multiple attempts from my local dealer to the selling dealer, an arrangement was finally worked out where the seller sent my dealer a $1300+ repair check.  This was certainly not an ideal transaction.  My suggestion is that Driveway reconsider its relationship with this selling dealer....  I bought the car on Aug 6 and first drove it on Aug 29.", "rating": 2}, {"title": "Payout process always changing while it…", "text": "Payout process always changing while it is ongoing and you have already committed and most especially when they already got my car. ", "rating": 2}, {"title": "STILL no car..Secured “my” car on 9/26", "text": "Secured “my” car on 9/26, still no car 😩 I wanted to give a better review because my sales associate was extremely professional, kind, worked very thoroughly with me for over a month to find my car and she stayed in communication. In fact the paperwork process of my purchase was thorough and smooth. It’s in the “transport/delivery” of my car. I was told a tentative date of 10/9-10/10 from my transportation specialist. Since then it’s been stressful due to miscommunication. I’m losing money because I’m now 4 days into my loan term, I’m paying for car insurance (down payment included) AND I’m paying for transportation for my daily commute! Every time I reach out to anyone, including a manager, it’s being “looked into” or escalated??? If this is the normal delivery process why is it being escalated? Also, I was told it was at the “hub” waiting to be inspected and then I was told the title wasn’t with it, then told it’s the 3 point inspection that’s the hold up. At this point I’m frustrated and disappointed. I’m a business major and CURRENTLY taking a business law course… I’m trying to avoid taking a legal action or tort, my professor is urging me to because now I’m draining money and stressed… hence, I’m leaving this review at 4 am 😖 This sucks!", "rating": 2}, {"title": "Not honoring the 7 Day Warranty", "text": "After receiving text all day and night, I finally received the vehicle, a 2022 F350 Ford Gold CPO. 3 days later I state the tailgate does not work and am told sorry, the dealership knew about it and \"priced accordingly,\" yet they failed to mention this to me. As a Gold CPO vehicle the tailgate is part of the checklist to be checked/repaired before being sold as such, so it never should've been up for sale to begin with. After going back & forth for many days being refused, I asked about the 7-day return and was told I'm outside the window, yet I reported it 3 days after receipt. WOW! Never Again!RESPONSE TO REPLY: I believe you miss the point entirely, but understand you have to rebut all negative comments. All \"Ford Gold CPO\" certified vehicles are guaranteed to have passed a set checklist to obtain this classification in order to advertise for sale as such, which the tailgate lock is specifically listed. People purchase these vehicles more confidently based on the fact they carry this classification, which Ford strongly enforces. This was not an \"as-is\" purchase but a Ford Gold CPO purchase with warranty, meaning the truck never should've been listed for sale unless and until it passed this certification. Heck, at the very least disclose the issue instead of hiding it until after the fact. Please think it through. BTW, I can send a signed copy of 7-day if you like. When legitimate things go wrong staff shouldn't be taught to first say no, but to understand the situation & determine the facts, then assist the customers who support them.", "rating": 2}, {"title": "My experience with driveway was sub par at best.", "text": "My experience with driveway was awful and I do not recommend them.  From the buying process/sales people, to the contract process/person, but worst of all the delivery process/specialist.  My entire experience was full of problems which were never resolved, just passed on with a ‘a customer care rep will reach out’ which never happened. I wish I had just gone to a dealership and got a vehicle. The last person I dealt with was Tim from Detroit and I wish he would’ve been the one to handle my entire order from start to finish he was on top of everything and had answers not excuses.  I’m apprehensive to leave this review since I’m still having issues. I wanted to wait until they were resolved, but I have a bad feeling they won’t be so I say this, when dealing with driveway use caution.  It’s not a scam, but it’s not an easy process at all and there’s minimal communication and when they make a mistake they won’t be accountable and it isn’t quick or convenient.  I ended up with a good car at a decent price, 4 cars and 2 months later than expected. I’m now hoping they send me the spare tire that was missing from the vehicle, and the trip permit tags which expire in 7 days. Keeping my fingers crossed that it was just a bumpy beginning.", "rating": 2}, {"title": "Their process to buy takes too long", "text": "The process to sell my car to Driveway took nearly 1 month. This held me up from being able to buy another vehicle. Gotta do better.", "rating": 2}, {"title": "I like the car I received from them…", "text": "I like the car I received from them besides the fact the tires on it were pretty bad and I had to replace them. That being said, if they took care of my registration in a timely manner, I would’ve been happy to give them a good review and recommend them to everyone. Just like all the other reviewers, I’m dealing with the same issue- I had my temporary tags for two weeks, I let them know a week before my tags were about to expire, they said they will overnight new ones, they didn’t keep their promise, my tags still expired and now I can’t drive my car. It shouldn’t take this long to register a car, just like other reviewers mentioned, I would’ve preferred to register my own vehicle than deal with this. I can’t express in words how frustrating this experience is, I call and email and nobody answers or returns my call. FYI- do not reply to my review with “send us an email” because I already did, you want to make it right, respond to my calls and emails, send me the registration ASAP and reimburse me for the days I couldn’t go to work due to not having plates. There’s no other way you can change my opinion about your company.", "rating": 2}, {"title": "I bought my 2018 Lincoln navigator from…", "text": "I bought my 2018 Lincoln navigator from driveway a year ago and only put 11,000 miles on it and my transmission is gone bad I would never buy another car from driveway!!!", "rating": 2}, {"title": "Hard to get in touch with someone to…", "text": "Hard to get in touch with someone to find out what was going on.  Took very long time the whole process.  Was told a date for delivery and that I would be called 2 hours before. Got a call a day early when they were already at my house      I wasn’t home.  ", "rating": 2}, {"title": "The truck I bought has issues that…", "text": "The truck I bought has issues that should have been seen in a pre sale inspection. ", "rating": 2}, {"title": "Seems to be a common occurrence with…", "text": "Seems to be a common occurrence with this company losing titles, issues with tags and registration. I saw the reviews but still gave them a chance and even mentioned to them right off the bat about the negative reviews. I was reassured and now I’m in a predicament that they lost my title, had to reorder a new one in order for me to register the vehicle. Which they do by the way “at their own DMV”? I’ve never heard of such a thing before! How do you process someone else’s registration and out of state plates at your own dmv??? My original temporary plate expired and only four days before that tag expired is when they said “oh sorry we misplaced the title and had to order a new one”. No other details. I had to buy a temp tag but that’s only good for 20 days. After that I’m up s**ts creek without a paddle and a $560 a month car payment. I have reached out multiple times, emailed called. And no one can respond??? Prior to this communication was great. Then you just go and screw your customer over!? How about letting the customer take care of their own registration and plates by mailing them the paperwork instead of doing it “at your own dmv”? Stick to a local dealer! I learned my lesson. But if they think I’m paying for a vehicle I can’t drive due to their negligence they can think again.I Received your response and I will email you guys AGAIN. I will remove this post once I received a resolution", "rating": 2}, {"title": "From Good to STRESSFUL ", "text": "Things started off so well. The individual I first spoke with was very helpful and responded to my information provided very quickly. Then I got transferred to my paperwork coordinator, this is where things started to fall apart. If I had a question, I couldn't get a response. I kept receiving emails that stated things needed done in a timely manner, but I couldn't reach anyone. I finally reached out to a supervisor that was able to help me with the remainder of the paperwork. They claimed they didn't have my wire transfer sent 3 days prior, which was very concerning! After it was located, I was sent to ANOTHER person who was a delivery coordinator. He was very responsive...at first.  He originally told me I would receive my new vehicle on Monday, September 9th. Monday came and went with no communication and no vehicle. Late Tuesday I receive a call stating that the delivery driver will be arriving late and will deliver my car the next morning. I ask if it will be delivered prior to 2 pm, as I had to go to work. I get a text response of \"I can't tell you that\". At this point I'm frustrated, worried I spent money on a vehicle I'll never receive, or a who knows. Finally, I get a message stating it will be delivered \"sometime after lunch\". Great! I will be here. Noon comes and goes and still no word. Now I'm freaking out. I reach out to 3 different people and no one is able to give me an estimated time. After a bit I get an estimate of 3-4 pm. Mind you, it's WEDNESDAY now. The vehicle was supposed to be here Monday!! I have to inform them that no one will be here due to my work schedule and my husbands schedule. I have to try to adjust the time to 5 pm so we can coordinate. I get a response of \"that should be fine\". At 4:26 pm I receive a phone call from an individual who spoke very broken English stating he couldn't come to my house to drop off the vehicle and he needed someone to meet him on the main road out from our house, which is a VERY busy main road. I tried to explain to him that our road loops around. He can make it. But he refused to listen. My husband jogged down to the main road and waited. Once the truck arrived he stopped part way in someone's yard amd part in the main road!! My husband had to try to direct traffic around the truck while the deliverer proceeded to offload my new vehicle into someone's yard, onto a busy road and back it into this other individuals driveway. Meantime the homeowner comes home and needs in their driveway now blocked by this truck and my new vehicle. Luckily, the homeowner was very sweet and understanding. After signing the papers my husband proceeds to drive the new vehicle back to the house where he realized he only had one key faub. SO, the next day I contact the company about obtaining another faub. I was basically told no. I got a response of \"typically used vehicles only come with 1 faub\". Not my trade in! It comes with two! No informed me it was missing a faub when I purchased it and it wasn't stated in the description that it only had one faub. Nice! Onto the 7 day trial period. I made a point to have the vehicle FULLY inspected, especially after the whole ordeal I had been through. Thankfully, things were in order and is a sound vehicle. I expected a phone call of some sort asking of I liked the vehicle or if I planned to keep it before they picked up my trade-in. Nothing! I got a phone call the following Wednesday to let me know they were coming to pick up my trade-in. We'll, ok then. Good thing I planned to keep the new vehicle. The pick up was very uneventful, thankfully, and they were able to come down my street...imagine that! At this point I am STILL waiting on plates and a title. My temp tags expire in 6 days. Needless to say, I'm not optimistic that they will come in time. I began this whole process August 20th, didn't receive the vehicle until late September 11th, and as of September 30th I still don't have my title, registration, or plates. I do NOT recommend Driveway. Communication is terrible and there timeline to do things is very asscued.", "rating": 2}, {"title": "I got car with cosmetic issue my…", "text": "I got car with cosmetic issue my problem was not solved.", "rating": 2}, {"title": "I just got my car and the valet was…", "text": "I just got my car and the valet was great.  They made it happen although there were some hiccups.  The process prior was a bit stressful.   Communication could be much better.  I felt like I didn’t know what to expect next or have a good timeline as to when I would receive my car and it was difficult to receive updates.  I did find out that there was a storm that caused some issues but a email or notification would have gone a long was to relieve my anxiety. My biggest complaint is that there are 3 small dings on the car.  Two of which I was made aware of but not until I signed all the paperwork and paid my deposit and I was scheduling delivery- I should have known this upfront and the third I found when it was delivered.  I really hope that driveway will make this right.     I have reached out to the original agent but haven’t heard anything yet. I also was in the process of purchasing another car, paid my deposit and then found out it had been rear ended.  I have read the reviews about difficulties with registration and title so I am hoping that I don’t experience the same.  In the end I got the car I wanted and it was delivered as promised but a few balls were dropped along the way.* Thank you for your respond, however I just realized that the light on the dash is indicating there is a power train fault.   I still have not heard anything from my selling agent which is concerning since I only have 7 days.", "rating": 2}, {"title": "Car sold to someone else after $500 deposit", "text": "Update: $500 deposit was returned within 2 days. Not an absolute disaster of an experience, but still frustrating that a car I had put a deposit down on was sold out from under me. I missed an opportunity to buy another car because of it.Original review:Website was fairly easy to navigate, and they had a ton of options. I made an offer on a vehicle and worked with a representative to submit some easy paperwork/proof of identity. That part worked fine, good communication, easy working processes etc. I accepted their offer and made a $500 deposit. I was told that the actual dealership would be contacting me through a separate channel to arrange the sale - that was the first red flag. Totally different channel, new person, different incentives etc, as opposed to an online dealer like Carvana, which owns and sells their inventory directly. There's evidently also a lack of communication and coordination between Driveway and their \"partner\" dealerships, because less than a day later the driveway representative I was working with called to say that the dealership had already sold the car, despite me putting a $500 deposit on it.I went and checked the dealer's website directly, and the car is still for sale there. Maybe they just haven't updated their website, but something seems fishy - maybe the dealership didn't want to sell to me (I was paying cash). Many similar reviews stated that cars were pulled out from under people even after a deposit, although it sounds like most people get deposits back eventually. Maybe Driveway is accepting and then cancelling orders just to earn interest on the transitory deposits. Total speculation. We'll see how long it takes to get my deposit back.Needless to say I'm not going to be pursuing another car with Driveway. Hopefully I'll get my deposit back soon.", "rating": 2}, {"title": "Don’t trust them to do the inspection.", "text": "Driveway Deal# 33636, Cust# 1103495, STK# D5263340A, Driveway claimed to have inspected the vehicle before delivery to me, but either they didn't do the inspection or if they did then they neglected to mention the differential was obviously leaking fluid. I had the vehicle inspected by my own mechanic the day after I received delivery. After I reported this to Driveway they honored their 7-Day Money back guarantee, but they reduced the amount of the refund by the shipping cost of $1,070.00 to deliver the car to me. The Driveway guarantee does state that \"the amount of the refund will be reduced by $1.00 per mile greater than 400 miles from the delivery date,\" and the car dealership was about1,470 miles away, so that was expected. However, I wouldn't have agreed to have the vehicle delivered in the first place if they had disclosed that there was a differential fluid leak which is a symptom of transmission problems potentially requiring costly repairs. I appealed to Driveway to refund the shipping charge but they refused, even though it appears they either intentionally or through negligence failed to disclose problems with the vehicle they supplied. If I hadn't hired my own mechanic to double-check their inspection work the problem might not have become apparent until after their 7-Day guarantee had lapsed. So Buyer Beware! Buying a car from this service without having the ability to have an inspection by an independent mechanic before taking delivery of it may cost you dearly! They did reply to say Help ticket CSR-27052 has been created including this sentiment for their visibility and reference.", "rating": 2}, {"title": "3-months gone and still no license plates, registration and title", "text": "I bought a preowned 2019 MINI Cooper in end Oct'22, paid in full, and received it on 7 Nov'22. The buying process was straight forward and seamless. Kudos on that. However, the pain point for me - as raised by many other reviewers - is the poor administrative processes at Driveway.  It's been more than three-months and I'm still awaiting to received my registration, car plates and title. At the very least I reckon I should have been issued a bill of sale but nope.So I just called customer service and was informed that the paper trail for my DMV registration was last updated in Nov'22 and it went cold thereafter - apparently nothing moved the  past 3 months.Unfortunately the call center lady said she had no visibility on the issue and had to check in with the agent handling it and get back to me.I think there's sufficient feedback from customers that Driveway needs to improve its paperwork operations but I reckon that's not their priority - after all, they are a car dealer - the goal is to hit sales quota not handle DMV paperwork.I give two stars rating as credit due for the smooth purchase process and helpful call-center staff who assisted me. So overall, the pros from my experience with  driveway are:+ Convenience+ Seamless buying process+ Good selection of cars+ Helpful call center staffMeanwhile, the cons with Driveway are: - Poor accountability- The prolong delays, uncertainty and stress dealing with registration/title issues- Poor after-sales comms/service. Nobody is gonna update you about your registrations etc. It's up to you to chase and enquire, otherwise nothing gets done.  For all its worth, I think the stress and uncertainty of not knowing from admin paperwork is a deal breaker for me. This is probably going to be the first and last time I'm getting a car from Driveway or any online dealer for that matter.update: So the call center staff got back to me to inform that Driveway does not process DMV registrations for in state purchase and I have to contact the car dealer the car was from to handle the DMV process. This was not made known to me at the point of sale. =(", "rating": 2}, {"title": "AVOID this company.", "text": "Firstly I’d like to say both my sales associate, and customer service rep have been pleasant and this review is nothing personal against them, rather against Driveway as a company. The sales process was simple, and they were very quick to take my money. It goes downhill right after you pay that deposit.I purchased a CPO honda odyssey from Wesley chapel honda in Florida, via Driveway.com, this month.A few issues. 1. The car broke down shortly after receiving it, and it needs a new alternator and a new battery. No one seems to want to help me with this issue, driveway does have a 60 day warranty program they are unwilling to honor, because they say since the car is CPO it should be covered by Honda. Honda, says this is not the case, and driveways warranty should cover it. It took over a week of my car sitting in the shop for them to relay this information to me. This means I have been without my car, for over a week (almost the same amount of time that I’ve actually owned the car) with three small children at home and no other means of transportation.I purchased a Honda for the space (minivan!) and reliability. I feel like I was scammed and sold a total lemon of a car. The warranty is not being honored as promised on the website and on the hold message when you call the company.Also, I asked several times to be resent my final contract package from both driveway, and the dealership they used. I cannot get the car registered without this information. I was under the impression they registered the car for me, but then I was told to go register it and do not have the proper paperwork to do so, now my temporary tag is expired, and the car is literally sitting at the shop and cannot be driven anyway due to the alternator.Final take - don’t do it. While the employees are pleasant, and trying their best, they seem to be met with bogus policies and road blocks and can’t actually help and It’s impossible to speak to someone hire up with more authority. It’s been 3 weeks of owning this car and I am stuck with a car I cannot drive or register. I am legit losing sleep worrying about this, coordinating how I will get my 3 kids in car seats to and from OT tomorrow morning. Sooo stressful", "rating": 2}, {"title": "I did a trade because i wanted to get…", "text": "I did a trade because i wanted to get away from my high payments on a car that was worth much more than the trade i was getting but i knew this and wanted to be payment free.   Im In arkansas helping my mom when i found out the 2016 hyundai Tucson was perfect so i thought.  One owner nice car and clean.  I take a test drive and back up camera came on Blue screen then switched to camera view.  That should have been my first sign to say NO.  I thought well maybe thats how they work on those cars.  Anyways less than 24 hrs im driving around town and hear a sound pretty loud from rear passenger side.  Had my friend drive it too and he heard same thing.  Said it sounded like wheel bearing issue.   I contact Driveway because car i traded in had NO ISSUES!.  So Sarah tells me I need to pay for diagnostics and they will reimburse me LMAO like i trust that.  So here i paid in CASH the difference between my trade and price of car to be payment free.  RIGHT!  I dont want a car that i just get and then have to pay for diagnostic and hope they pay me back??? I added the $3000 warranty as well.  She said i have that warranty and that is $100 deductible. SO basically I should dish out more.  I decided to do the 7 day return policy no quesitons asked.  Well be careful because they will take there sweet time to get it all done lmao.   In meantime i cant drive or work because of the 400 mile 7 day policy so lost more money.  Im happy to get my bigger payment back and know what i have is a great vehicle.   Never again.", "rating": 2}, {"title": "Crickets!!!", "text": "They made an offer.  I accepted.  Then the wheels came off!!  After accepting the offer there are 2 steps. 1 - upload documents, 2 - take pictures.  Step 1 sounds easy, right?  Except the link they give you to upload gives an error that it has expired, contact your agent.  Who's my agent?  Where do I find that?  Nothing in the portal and no emails.  So I send an email to support......and wait.......;and..  So let's do 2, take the pictures.  But you have to use their app, PAVE to take the pictures, which means you must have a phone.  Well I do but I guess Samsung's aren't quite up to it. The app takes control of the camera so you can adjust nothing.  Every picture fails so the 13 picture 5 minute process is now spanning hours.  Oh well, I'll wait for support.  \"crickets\". So on the 3rd day I open a chat session and of course the chat rep can't really do anything other than to tell me that my agent will be texting me.   Still waiting.......   Forget it!  what a waste of time!!!  In the long run I'll be better off with a private sale but was willing to short cut the process with the right order.  These folks have some kinks in their processes.Added 10/11/2023 - I'm only adding this because Trustpilot sent me a request on 10/5 for additional info that if I didn't provide it to Driveway they would remove this review.  So I did provide it.  And here we are 6 days later and I've heard nothing.  Guess I named this correctly!Response to Driveway - There are NO messages from Sarah or anyone else from your company.  We check our voicemail often everyday. Wish it were true.  I've moved on.  I've reviewed the entire call log and there is nothing there from your organization or anyone that i've not identified.  No biggie.  Like i said, i moved on.", "rating": 2}, {"title": "DRIVEWAY DOESN'T FULFILL THEIR PROMISES BEWARE!!", "text": "I have purchased a Santa Fe Ultimate, from Driveway starting back in late December after having a wreck. I had some positive experiences but more negative experiences with my experience. I will mention names of people who I remember and had interactions with. Chris, My Contract Analysis, he was by the most professional, and accommodating. He would be understanding if I was at work, needed clarification on something, and even admit his faults. Next, I'd like to put some focus on the Dealership the vehicle was purchased from, and the sales representative,  John Hutchinson. He seemed to be a very relaxed, easy-going, happy gentleman. He sent a video of the outside of the vehicle. I have requested for a video of the interior of the video. He promised to do that. I know exactly why he didn't do this video, so the Dealership could hide that mileage wasn't what they posted, and show that they are selling a vehicle that needs a new radio/navigation system that's priced at $4,418.16 for the system itself that's not labor included. This vehicle claims that it wasn't in a wreck by CarFax, but I will tell you from the Dealership that I went to they told me any good faith dealer would tell you something must've happened. This is due to when you open the hatch you can hear glass moving around in the hatch, many touch up paint spots. Moisture/Condensation build up in driver running light which is a HUGE safety concern since it's significantly not as bright as the passenger side. Many things the Dealership should've mentioned, noted, and Mr. Hutchinson failed to follow-up on his promises & had every chance to reach out to be HONEST. Following with Cheyenne a Dispatcher and Kassandra, Post-Delivery Customer Service Department. Both of these ladies have some improvements they need to make. Cheyenne with basic communication skills, of proper grammar, giving customers time to reply( she expected me to drop my life to cater to her needs), wouldn't answer questions so I would have to repeat myself, and would send important messages when she's about to be gone for her weekend. Overall, not professional at all. She couldn't even call even address me by my first name but my last name. Importantly, I mentioned my issues to Cheyenne on Saturday, February 3rd since she was away due to her weekend. Kassandra finally reached out to me on Tuesday, February 6th which was 2 day before a week of owning the car. Kassandra failed to offer me a return of the vehicle, just only offered me a fraction of the repairs that need to be done with this vehicle. She wanted me to write this review. The money she claimed to make these repairs had a label made but never sent out in over 48 hours. Why wasn't I given options for my vehicle? It was within the window? She needs help with customer service skills, work on her responses to customers, and offer ALL solutions to a customer. All in all, I'm not thrilled with my experience with Driveway, I feel as if I was taken advantage of, disrespected, getting short changed, and doesn't fulfill their promises just like the Dealership salesman, John Hutchinson. Who by the way still sends me messages on my vehicle. Driveway what is up with not fulfilling your warranty or even the 60 day warranty?!", "rating": 2}, {"title": "Just because they say they are a specialist, does not mean they know what they are doing.", "text": "I do want to say that Angie B is freaking amazing. Patrik had some amazing out of the box thinking and Noemi, our delivery coordinator was great after we worked through the kinks of the process. But I, unfortunately would not recommend driveway.com to anyone.We bought this car for our daughter. And we thought with the reviews on the page, it would be amazing and easy. ... The sales team was hard to work with. There were red flags, but our daughter loved the car so much, we pushed through their process. It took a long time for the car to be delivered. So long that the temp tags from New Jersey were set to expire 2 days after delivery. But Noemi got it renewed for us.Their DMV Specialist that we worked with did not document any of our calls, emails, or conversations. We even did a 3-way call with the Kansas DMV and the specialist and none of that was documented. The specialist insisted that we could just walk into the DMV and handle everything there even though she was told during our 3-way call that the DMV would only work with them since this was a 3rd party purchase.  The specialist went as far to state that she works with 30 states and knows what she is talking about. And then stated that we would have a license plate in hand in a week or two... and would not need a temporary tag from the state of Kansas. That was laughable. Why wouldn’t we? The temp tag from New Jersey was expired.  It was literally exhausting dealing with her.   The only saving grace was Angie B escalating this to Patrik. He helped us and the fact that their specialist said everything was on track, but the temp tags had expired, I think they even realized something was suspicious with her documentation and the way she was handling the case. We would have had 3 weeks of no car because of our \"specialist\" mistakes.  Driveway rented a car for our daughter to use until her license plate came in. But a temp tag from Kansas came in a week later, and 3 1/2 weeks later her plates came in. I wish their  DMV specialists would know more about the states they are dealing with and listen to their customers and the Kansas DMV. That's what still gets me. She did not even listen to the Kansas DMV with how their laws work. It was so stressful, this was not an enjoyable experience. From start to finish, it took 2 months. Buying a car should never be a 2-month stress fest.", "rating": 2}, {"title": "Update on below complaint", "text": "Update on below complaint: Still no call.  Still calling their customer service daily with no resolution and explanation as to why I do not have my plates.  Emailed at address provided in their response, and zero response.  Called their \"supervisor\" and left a message.  No response.", "rating": 2}, {"title": "No temp tags delivered with vehicle", "text": "Update: we did end up  receiving the temporary tag a week after receiving the vehicle. Fast forward to present day- said tag expired. I reached out to Driveway BEFORE the tag was set to expire to inquire about my permanent tag or a replacement. For a week the individual in charge of plates has been unresponsive.  So yet again my vehicle is sitting in the driveway unable to be driven. This is unacceptable!   Why would I pay monthly for a vehicle that I can’t even drive to work?I don’t want apologies I want action! We recently purchased a truck using Driveway. The process between paperwork and vehicle delivery was longer than anticipated and not as fluid as it could be.  Although we have received the vehicle we have not received any temporary tags essentially leaving us without use of said purchase.  It’s been quite frustrating speaking to different team members on the originating car dealership side and Driveways side. Although everyone we have spoken to has been apologetic there has been 0 sense of urgency. This could be our only vehicle! This could have been a gift! This could be my only transportation to work! I fully expect to be able to drive a vehicle that I purchased the same day!  I really was optimistic in having a positive experience with this company however I cannot express how disappointed I am.  We are paying insurance and a payment is expected in 2 weeks on a vehicle we haven’t had the opportunity to test drive. No temp tags or registration", "rating": 2}, {"title": "Carvana can but Driveway can’t", "text": "Unable to reasonably work with a Service Member on deployment to complete purchase of car upon returning  back to the the states in less than a month.Issue 1: driveway needs to mail a contract for a wet signature before deposit can be made. Don’t know how it’s 2022 and we can’t do things digitally but okay.. Issue 2: I was told all that was left was verity proof insurance and a deposit and we’d be in business. I’m glad I bought insurance for this specific car just to find out the limited capabilities of this company. This was after I called them and explained my situation. Bad kudos  for not having company situational awareness.Carvana has worked with me before so I guess I’ll just buy from them again.", "rating": 2}, {"title": "Great car terrible customer service", "text": "Great car, but it is sitting in our driveway because our temporary tags expired 2 weeks ago and we haven’t yet received our plates.  Horrible customer service. We bought a car 4 years ago from Carvana and the process went perfectly.  I do think we saved a few thousand dollars buying our car from driveway after doing comparisons.", "rating": 2}, {"title": "Tracking funding and not knowing VA…", "text": "Tracking funding and not knowing VA practices for disabled veterans ", "rating": 2}, {"title": "There are lithia motorsmotors corporation", "text": "After spending 7 days trying to purchase a car. Submitting all the picture ID, license insurance. They didn't tell me the car is not available anymore but they have another one that I can buy. At $5,000 more. It's lithia they're the worst people to deal with. Please don't use these people. Call a dealer directly or text a dealer directly and make a deal. But not lithia.", "rating": 2}, {"title": "Temp Tag issues", "text": "First off, I was very hopeful that online car buying would be as easy as media portrays it....and maybe it is, but that was not my experience with Driveway.  When initially purchasing the car, everyone was very responsive to my phone calls and emails.  However, once the deal was locked in, it went silent.  Getting ANYONE to return my calls about the status of the car felt like a daily battle.  I had to call multiple times a day complaining until someone would get back to me.  You have my money, but where is the car and what is the delivery process?  The car itself is wonderful, however, I am now 2 months in and still waiting on my tag.  I have called no less than 5 times in the past few weeks and am told the same thing, we will call you back.  No one will ever call back.  Ever.  I think the concept of online car buying is great, but Driveway has yet to master the customer service side of things.  We will not be using driveway again.", "rating": 2}, {"title": "Process requires work ", "text": "Continuous review of offer, lowered offer, delays with paperwork resulted in loss.", "rating": 2}, {"title": "Super slow backend. Nothing happened until offer expires.", "text": "I got a quote and email to ask me for bunch of documents and upload 12 photos using an app. I sent over everything immediately but never heard back from them again. Now the quote is expired and still nothing happens. Feel like I’m getting scammed by sending over my driver license, car title, picture of odometer and cars.", "rating": 2}, {"title": "Bought new car from them(actually…", "text": "Bought new car from them(actually Toyota dealer in nj) in april, car took almost 2 months to get delivered, car was like new car off lot so that's good but it took almost 4 months to get license plate and registration in mail and as of now they are not responding to my text about title which I haven't received.  Looks like I'll be paying for a duplicate copy from my DMV don't really see the point of these people there Like between person that's not needed. Car prefect obviously it was new new....pl on phone with driveway nice polite speed of service very very slow.", "rating": 2}, {"title": "Purchased a vehicle in February and no title  …", "text": "We bought a vehicle in early February and still no title. Was told I would be sent a temp tag from a person at driveway and they never sent a tag like I was told.I called the dealer in April, that the car shipped from. He did send a temp tag that went out 6/16 and he said I would not get a title. I told him in Oklahoma we get title with the Lienholders on it, and that’s what we take to the Tag agency to get the tag. The guy  sounded lost about the whole situation, He said they don’t get the title in TX, But He would let them know in the tag office know and keep me updated but I haven’t  heard anything.", "rating": 2}, {"title": "Like many other reviews out there DO…", "text": "Like many other reviews out there DO NOT DEAL WITH THEM! Car showed up after over a month of dealing with stuff. (They never tell you ahead of time.) They then didn't send the Temp Tag with it so had to wait a week to legally drive it. ONLY after blowing up their phones did I get the Temp tag sent to me. They give you some B.S excuse after excuse of things. Now my temp tag has expired and still no actual plates. Went to my DMV and they have NOTHING on file about them trying to register my car. They have stopped responding to calls or texts when inquiring about my plates. It's now been expired for a week and nothing. So that makes me being legally able to drive my car for a total of about 2 weeks of \"ownership.\" Love making a payment on a car I can't even legally drive. The only reason this is not a 1 star is my salesman was decent to deal with but once the purchase was over they blow you off! I will NEVER be doing business with them again. EDIT: So they give you the same automated B.S response to your review. My salesman did reach out to tell me he escalated it as well but we all know that means nothin.", "rating": 2}, {"title": "Great inventory, terrible service", "text": "Driveway was a great place to find the car I wanted, but the back end service has been terrible!  I paid for my car 3 months ago and STILL don't have the title or registration!  I've sent multiple texts and emails and left voicemails every week for a month.  No answers, no help, nothing.  I'd give them 5 stars for providing the right vehicle, but zero for processing.UPDATE:  Two weeks later, one phone call from them, still no title, and can’t even tell me when I might get one.  Ridiculous!UPDATE #2:  It's now October 26, 5 MONTHS after purchase, and still no help on registration and title from Driveway despite repeated calls and messages left.  They won't even give me the name or extension of a supervisor to try to escalate the problem to.  My advice:  DO NOT BUY A CAR FROM DRIVEWAY.COM FOR ANY REASON!", "rating": 2}, {"title": "BIGGEST MISTAKR EVERRR!", "text": "Buying with Driveway was the biggest mistake EVERRR!!!!  I got my car on 12/14/21.. They got me a car quick--After that..it was A TOTAL SH$T SHOW!! I am about to try to get my 4th temporary tag because my car is still not registered nor Inspected in PA  I have sent my paperwork to DRIVEWAY 3 times.. All they had to do was transfer my tag over from my trade.  I never hear back from DMV Department-- Everytime I call they need to email the DMV Department-- there's no phone number... I never get responses from the calls or text messages...  Last call in February I was told they will ask for my paperwork to get expedited--- Haven't heard back on that either... It's now March 7th!!!  RUN PEOPLE DON'T FALL FOR IT!!", "rating": 2}, {"title": "This could have been an amazing…", "text": "This could have been an amazing experience but unfortunately it wasn’t. To start, I got a loan for a car that I started the process on but the car got sold from under me. I picked another car but wish I wouldn’t haven’t because I don’t love it as much. When I got the car, it was delivered without me having anything from the DMV for me to legally drive the car. I’ve had the car for over two weeks now and I am still driving illegally. Additionally, the car I traded in still hasn’t been paid off so now I’m paying for two cars. I traded in my car to downgrade due financial reasons so I’m not really in a position to be making two car payments. They said I’d be reimbursed when they get my loan paid but waiting for a reimbursement doesn’t help me when my rent is due. The amount of things they had me do that I shouldn’t of had to, re-doing things they messed up or following up on things that didn’t get done has made me an absurd amount of work. I’m deflated with this whole thing and disappointed in myself for still using them after the car I was originally getting got sold.", "rating": 2}, {"title": "Started rocky, got smooth UNTIL my temp tag expired😡", "text": "What started off scary has turned into a great day, thanks to Tez!! He was great and even when my vehicle needed repairs that was handled quickly, but now my temp plate/tag has expired and nobody is returning my calls,emails, or texts!! They offered to pay $50/day towards a rental but the cheapest I can find is $87/day I SHOULDN’T HAVE TO COME OUT OF POCKET, and pay my car payment and insurance until WHEN?? I even suggested overnighting me either another temp tag OR a check to cover dmv fees(since they were included in my sale) a bill of sale and the title with the lien or whatever I would need to go to dmv myself! Just to be IGNORED, so if I hear nothing by tomorrow looks like I have to involve my lawyer because no way I’m going to keep missing overtime at work and all this other stuff I gotta do for something they should have figured out by now!! UPDATE: they say they’ll reach out to me but still NOTHING,I’m not even being unreasonable as you have gotten your money all I want is to be able to drive my vehicle!!!", "rating": 2}, {"title": "I wanted to like Driveway as they…", "text": "I wanted to like Driveway as they offered me more for my trade in than anyone else but man are they unorganized with pretty bad employees. I started my trade in process on Feb 11 and chose a car I wanted to purchase but they don’t tell you where the car is. Turns out the car I picked was at a dealership in the LA area and I live in the Dallas area. They did assign a sales person to me and then an delivery coordinator but they didn’t answer emails or texts and I finally took delivery of the car on the 23rd. I asked about license plates transfer and I was told by the coordinator don’t worry about that as it will be handled by the dealership when I pick up my car but of course it wasn’t. This is important to me as I have personalized veterans plates and now I’ll have to go to my county assessors office to figure this out that should have been handled by Driveway. Driveway is a good idea but certainly not ready for national rollout.", "rating": 2}, {"title": "legit way to buy a car but not easy or smooth process", "text": "Pros: easy financing process, good car so farCONS: if you have an issue, prepare to talk to several people because all they do is pass you off to someone else, felt like it was up in the air for a day or two if i had a car or not due to poor comminucationcar delivered with no temp tag so you couldnt drive it. the only way we got temp tag was by calling actual dealership it was bought from, driveway was no helpmy temp tags are now expired and have not recieved the tags. instead of trying to figure out what was going on, no one at driveway knows why we havent gotten the tags and now we have to pay to try to get it delivered to another address becasuse we moved and IF it was delivered, which driveway has no clue if it was, they have not forwarded it like supposed to.", "rating": 2}, {"title": "No communication, I want my car payments covered", "text": "I’m writing another review because that seemed to be the only way to get someone to contact me. I’ve had my car over two weeks now it has been sitting in my garage with no tags. I understand it takes time but they’ve had my paperwork over 2 weeks now, when I tried to reach back out I was told there was a problem with one of my documents and they are resending a new one. Which they never contacted me, I had to contact them for them to tell me that. well that was 3 days ago and I haven’t received it. I even tried calling UPS and they told me there was no packages en route to my address.. so unless they’re shipping it through a different company this time my paperwork still hasn’t been sent out yet. Therefore the registration process hasn’t even started. My $550 car payment is in a week, for a car I haven’t driven, I’m paying $280 a month insurance for a car I can’t drive, which I already sent the first payment of. I do not want to pay my car payments until I get my registration and plates which I feel is fair. No one can provide me temp tags and I can’t even get the registration started because I haven’t received my new document yet. This is getting ridiculous. Please someone contact me and give me some sort of compensation", "rating": 2}, {"title": "Stellar service! Edit: Not so much", "text": "What can I say, my first experience with Driveway.com has been stellar. Previously I've shopped with Carvana and they've been pretty capable, but Driveway is on a different level entirely. First off, Driveway's representatives, whether in sales (Angela, Deja), finance (Eric), or dispatch/delivery (Donte) have been kind, friendly, attentive, and expedient. I never had to wonder what was going on throughout the process, as they kept me informed pretty much all the time. Started the trade-in and sale process on the 25th of October for a car I liked in New Jersey (I'm in Georgia). They sent me over the forms to e-sign almost immediately after I talked to them and had overnighted the paperwork that needed to be physically signed the next day. I had the forms notarized and returned the same day and Driveway had already shipped my car to their hub in Georgia. The car got there on the 28th and was delivered to me just yesterday (October 31st). Granted I was on point with providing all needed information to them in a timely fashion, but the level of speed at which I had my older car picked up and the new one delivered within a week was pretty awesome. The car was as described and I'm extremely happy with it. The only thing I wasn't too happy about was that the dealership stuck a plastic dealer badge to the back of my car that I now have to work on getting off (note to new/used car buyers - tell driveway that you want the dealer badging/decals to be off of your car. It's a big PITA to deal with removing it afterwards). Other than that, I'm just waiting for the registration to be done after my 7-day/400 mile trial period of testing the car is up. I understand registration is a longer process so unless I'm still waiting 2 months down the line for registration (I'll update the review if that's the case), using Driveway so far has been an amazing experience, at least for me. They definitely have my business the next time I feel like trading up.Edit 12/7/2022: Still have been waiting on my tag for the past 5 weeks after I received the car. Since the car originated from New Jersey, that state does not issue additional temps tags by law (my temp tag expired on November 24th, 2022), and my home state of Georgia will not issue a temp tag for a car that originated from an out of of state dealership. Essentially, I have been stuck with a car that I cannot legally drive and have no recourse on it. For any prospective customers of Driveway.com: Driveway will be very communicative up until the point of sale, but after that, and especially when following up on tag/title/registration - the communication goes down a black hole. I've called numerous times regarding my tag and have requested call backs over the past two weeks, but have received ZERO communication back. Unfortunately, once they have their money/trade-in, Driveway seems to have an issue with the follow-up processes. I cannot in good standing advocate Driveway after this point. Thanks and interpret this review as a cautionary tale.", "rating": 2}, {"title": "I did a trade-in with a purchase", "text": "I did a trade-in with a purchase. the trade value was better than the completion so I made the deal with Driveway. The salesperson was knowledgeable and took care of the transaction smoothly. The issues are after the sale, This company has no clue what customer service is. The vehicle came in damaged and no one addressed the issue until the day I picked up the truck Then it took another week which made my pay off late and I had to pay off the difference. I have not received my registration yet and have been calling for 15 days with no resolution. I called upset and they hung up on me because they felt a bad \"vibe\" their words not mine. I then was elevated to a manager MATT who is the manager over call center. At first, Matt was helpful but after the initial call I have not heard back from Matt who told me to go buy a temp tag and have the truck re-inspected and they would pay me back. I do not believe them because I can not even get a follow-up call back from the driveway telling me when my registration will be received. my next step is to file a state complaint and find every website to warn others to stay away. my truck temp has been out since June 16 and they still sent a weak reply", "rating": 2}, {"title": "Process not for me", "text": "Ordered a car from the web site on 5/17.  After completing the order the sire said I would be contacted \"shortly\" to verify some info.  I also has a number of questions about the process and what the purchase included.  Over the next week I received 2 text messages (both labelled as spam texts) that someone would call \"shortly\" - no one ever called and I even answered calls labelled as Spam.  I tried the online chat feature of the web site and was told someone would contact me.  Received 2 emails from driveway.com personnel asking if I had any questions.  I listed 5 questions and only one was answered - others were seemingly ignored.  On 7/25 I got an email from a 3rd person at driveway.com.  That person answered my questions pretty quickly but never asked for verification of the info they wanted - that call NEVER came over the 8 day period.  One of those questions was about the time the entire process took until vehicle delivery.  I was not satisfied with the response.  From placement of order to receipt of vehicle (which showed as in stock) would be over one month.  That was too long for me and I had the cancel the order.  This process may work for some but the timeframe was unacceptable to me and their definition of the word \"shortly\" is obviously different than mine.", "rating": 2}, {"title": "Poor communication", "text": "Poor communication, process was excessively long.", "rating": 2}, {"title": "Do not use, worst car buying experience", "text": "So, I bought a car through Driveway and can’t use the car now because they messed up license plates. You would think a company claiming they are the future of car shopping would know how to process title and registration but beware they know nothing. First of all, I got the car shipped without temporary tags and second key was missing which was never mentioned anywhere in the entire buying process. Since I couldn’t use the car,  I had to make several calls to get a temporary plates and I reminded them to apply for the actual plates. They sent me the temporary plates after 4 days and the temporary plates expired after 30 days last week and I have no clue where my new plates are and cannot drive my car again. They should not be doing business with this level of customer service. I will be suing them shortly for damages and stress caused with this experience.Update: I sent the info they requested for, will post here if they resolve the issue.Update: Still no plates as expected and still unable to use the car. On top of that I need to pay for transportation and waste my time calling them, dealer and dmv everyday. The customer rep keeps saying we are trying our best to locate my records instead of resolving the issue. I don’t think they are purposely messing up but their process is simply broken / not setup for online as I see numerous complaints from other customers about a similar issue. They should hire a better team for processing tittle and registration - Hopefully all the lawsuits will push them to do it.Final update: I finally got my plates after hours of calls and not having to drive my car for few weeks. I gave one more star on the review as they’ve actually fixed the issue. Hopefully they improve the registration process with this feedback for future customers.", "rating": 2}, {"title": "Canceled Order", "text": "I found a nearly perfect Toyota Certified SUV on Driveway.com.  The mileage was good and the price was in my range.  So, I decided to start the order process.  I immediately got hooked up with a good salesman who walked me through the 1st phase of the buying process.  When that part was done I put down a $500 deposit.  My salesman then told me I would get a paperwork packet within 48 hours.  When I didn't get the packet after the 2nd day I got curious and decided to Google reviews on Driveway.com.  Boy, was I shocked!  I found over 400 reviews for this company and the majority of them were 1 star.  The site had given Driveway.com a rating of \"poor\".  The reviews stated over and over that Driveway had poor communications and an inability to get customers vehicles registered with DMV,  Many customers were stuck with cars they could not legally drive.  After reading bad reviews after bad review on multiple review sites, I felt It would be foolish to proceed with my order.  Buying a car \"site unseen\" on the internet is risky enough without having to see all these poor reviews on top of that risk.  The thing that bothered me the most is the lack of improvement I saw in these problems.  The latest complaints were from just two days ago!  The company is clearly aware of these problems because each review had a response from Driveway apologizing for the problems.  Yet, these problems continue.  How can a large car company like Lithia (Driveway parent company) not be able to get DMV paperwork done.  I feel I would be foolish to send them my $40,000 and trust that I will be one of the lucky ones that doesn't experience all these stated issues.I was very disappointed to cancel my order.  I was thrilled that I finally found the car that fit my budget and was pretty much what what I was looking for.  I was also excited that I would not have to visit a dreaded car dealership in person.  The car I wanted is now back on the website and is now at a cheaper price.  Perhaps they lowered the price because others were wise enough to check reviews on Driveway.com first.  I do not look forward to the battle of getting my $500 deposit back. My advice to Driveway.com is to stop apologizing, fix your issues and fire whomever ever is doing your DMV paperwork...they are killing your business!Follow-up:I received the attached response from Driveway.com.  On the plus side, I did get my deposit back with no problems.  I am very grateful for that.  Yet, I am still angry that I can not trust them enough to make a purchase from them.  The car I wanted is still on their site and it is considerably cheaper now then before.  But, I don't trust them to get my registration and title to me if I did order it.  The reviews on this site and Reddit are horrible!  The response I got from the company did not address any of these issues.  They only offered a 7 day money back guarantee.  How about fixing your problems...Geeze!  What good is a 7day guarantee when your paperwork doesn't show up 30 days after your purchase?  Why do people have to go thru all this agony.  Your customers seem to be only offered help and attention after they get frustrated enough to write a scathing review.  What the heck Driveway?", "rating": 2}, {"title": "Easy to buy, impossible to get issues resolved.", "text": "Easy to buy, impossible to get any kind of issues fixed. I purchased a new Hyundai Santa Cruz through Driveway. I completed the contract and paperwork around May 23rd, took about 10 days to get the truck delivered from CA to AR, no problems there.   The issues started after getting the vehicle delivered. There are a couple of scratches that were on the vehicle which were recorded by the delivery drive while picking it up at the dealership, and when dropping with me. Driveway was made aware of these immediately. I went and got a quote to get them repaired, sent it in, and have heard nothing since.  Ive had the truck for about 10 days, and still have not been able to get anyone to email me a bill of sale showing that I purchased the vehicle, so if I'm stopped I will at the very least get a ticket.  The vehicle was also missing the second key fob and the floor mats that were listed on the window sticker....Once again, I made them aware of this as soon as I got the vehicle, but have heard nothing at all about it since that day.  Last, and maybe most importantly......after esigning contracts over 1 month ago, they have still not paid off my trade in. So to avoid any kind of late fees, I will have to make another payment on my trade in as well as a payment due on the new vehicle in a couple of weeks... so I'm out an additional sum of money. And yes, I know that it will be refunded to me... but there has been plenty of time for them to get it sent in to my old lender.  So in short.. I got a great price on the vehicle... got a great offer on my trade in... but since the new vehicle was delivered... I have gotten nothing but excuses out of Driveway and NOTHING has been fixed out of all the issues I've had.", "rating": 2}, {"title": "My experience started out great", "text": "My experience started out great, but the ending is still ongoing. I was initially contacted by Emill regarding my vehicle inquiry. He was very pleasant and helpful. If I needed anything or had questions, he was more than happy to help me.The second stage was financing. I originally was going to use my Credit Union because my quoted rate from Driveway was in the 8s (I’m an 800 fico w/ established credit), and that wasn’t going to work for me. That ended up falling through because my CU would only send a sight-letter draft to a non-franchise, out of state dealer. Emill ended up connecting me directly to the finance director of the dealership (Suburban Ford in Waterford Michigan). He submitted my application to a couple of prime lenders and was able to get me a rate comparable to my CU, around 3.5%.Third stage was shipping. Vehicle was delivered on time, but the dealership didn’t provide me with a temporary tag or registration. I reached out to Emill for assistance, and he got me in touch with an individual that handled it, and they overnighted my temp tag and registration.Final stage — where’s my permanent license plate and registration?!My temp registration was days away from expiring, so I contacted Emill (again), and he reached out to driveway’s DMV department regarding the issue. A couple of days later, I was sent a text by an agent from said department, and they stated that their DMV vendor was still waiting for a check from the dealership to pay for fees and registration. I received this information a month after taking delivery of the vehicle! And it’s information that I had to seek out. Anyhow, a few days go by and I don’t hear anything, so I texted the same number that came from the DMV agent for information. She tells me they still haven’t received the check from the dealership but the dealership is aware that it’s needed asap, and she’ll let me know when the dealer sends it. Frustration is starting to build. This is all happening after my temp registration has expired, and there was absolutely no sense of urgency from driveway’s DMV person, like it didn’t matter that I’d had my vehicle for 30+ days and my paperwork still hadn’t gone to the DMV to be processed. Hoping that I could speed up the process, I asked the agent if I could cover the cost of the fees (assuming they were just registration/tag fees), and the agent said their vendor can only take payment from the dealership, which leads us to today (38 days after taking delivery). Earlier, I received a text from the driveway DMV agent stating that the dealership realized they miscalculated the numbers on the contract, so now they aren’t going to send a check to cover the fees and they aren’t going to pay the $525 shortage (which is more than just fees, obviously), and now I needed to cover the costs in order for my vehicle to be registered. I replied back stating that I am not going to be responsible for fixing a calculation error they made on the contract, especially after 38 days. I also let the agent know that before signing the contract, I reviewed it line by line with the finance director. (I work in finance so I like to make sure everything is good to go prior to signing anything). The agent replied in a snarky way, basically asking why I was willing to pay for the cost before but not now. I told the agent that I was led to believe that the cost would be to cover small registration/tag fees, not a $525 dealer error. I said I wasn’t paying for their error, and that I’ll contact the dealer to flat cancel the contract and pick up their vehicle. Agent replied back stating it’s too late and the dealer will be contacting me soon to collect payment. I told the agent I legally have every right to return the vehicle if there were items/costs that weren’t disclosed on the contract at the time of purchase. I received a reply 4 minutes later telling me that the dealership has changed their mind and they sent a check. Wow. The agent was very unprofessional and rude. Let’s see how long it takes from here.2 stars now. Still waiting for help…Update— After multiple calls and texts with multiple reps, I was finally told that my deal is being sent to my local DMV, which is great, but now it’ll take 2-6 weeks to get my permanent tag/registration. What a cluster! They need to fire their third party vendor, and then they need to completely revamp their approach to customer service and transparency. No one is on the same page there. It makes for an absolutely horrible experience when a major issue arises. Before the tag/registration debacle, I would have recommended Driveway/Lithia, but now I will tell anyone I know to go elsewhere. Hopefully they make some much needed organizational changes.  Im giving 2 stars vs 1 star because the initial process was good.", "rating": 2}, {"title": "Poor service. GO ANYWHERE ELSE!!!!", "text": "Poor service. Make sure you check your contract, ASK QUESTIONS and inspect the car yourself. I received with NO temp tags (from California) without any notice prior to purchasing, I got 1 key (with refusal to provide another and no disclosure until I got the car,) the car has no navigation chip— another couple hundred to purchase, the tires were bad and the alignment is so bad the car shook and made noises when driving it. Had the car 1 day and I’m getting the run around about timelines for approving repairs. Now I’m being told I may need to pay a diagnostic fee and I have to wait for reimbursement—this is after I was told to take it to a local dealer. My 7days will run out and I only drove the car 35 Mi (23 to get it to the dealer)! They have no established processes, deadlines or real guarantees that will make you assured of their process. The chat will just say they will ask someone to reach out to you—no answers. The people who are supposed to be your contact also act like they don’t care. I purchased a newer Mercedes—this is not the experience I have ever had with any car let alone a luxury vehicle. I have already filed a complaint with the BBB. This company only gets 2 stars for the ease of approval. The follow up is terrible especially if you have a problem.UPDATE: I just sent the info they requested. I will update again, on how this all was handled.UPDATE:  No one has contacted me yet. (Their last response to trustpilot was yesterday). Today is Wednesday (morning), I gave the dealers quotes on Monday (1PM, updated 4PM). Car arrives last Thursday and has been at the dealer since Friday. I have until tomorrow to give the car back under the 7day “guarantee”. It feels like they are playing a game of chicken, trying to run out the clock. I texted my “primary contact” last night, and again about 20mins ago about getting confirmation of approval for the repairs.  No response so far. For reference, the car was shaking/ vibrating and making noises when driving. It is a real bad alignement and worn tires. The Mercedes dealer performed the diagnostic. Owning a luxury car is not cheap, maintence is a must. It is even more frustrating to have these problems when the vehicle first arrives, and you are looking forward to it—especially after it was supposed to have been inspected. Right now I told my rep Lidia, via text, that I will return the car if they can’t confirm that they will make the repair before my 7day period is up. I will update my review when I have more info.UPDATE 9/12: After lots of back and forth we suggested taking the car back to the partner dealership they delivered the car from—they agreed to get the repairs there but that shop could not do it. They eventually mailed a check to pay for the repairs. That process took an additional 2 days (I insisted on express mail delivery). Ok… I’ve come to terms with that—now the repairs are done. NEXT…. The temp tags… tired of playing a game of chance  with the GA police by riding with NO PLATES. I called the tags office myself. Discovered the delightful fact that I could get my own temp tags with the purchase agreement and the inspection. Great. I call Driveway and ask for the inspection which was supposed to happen prior to delivery. After getting the runaround since NO RECORD of an inspection was in their system (they could neither confirm or deny it took place), and fuming for about an hour about the ABSOLUTE ABSURDITY of this whole process and their supposed specialized departments, I have an aha moment and call the dealer that delivered my car and ask them for a copy. They claim they don’t have it either. Apparently, they have a liason from Driveway at their site, who takes the car offsite to get the emission inspection  done—he happened to be at lunch or otherwise unavailable. Fuming again for another hour. I decide to get my own inspection. I was literally in line at the emissions place when he called back. He emailed the inspection to me. Home to print it off. Next stop was the tag office and it was only a 1/3 success. Yes I got my temp tag. I should be jumping with joy right? No… they dated it to the date in the paperwork (9/9) which gave me all of 10 days to use my car—and I was going out of town for 7 of them. SMGDH. Planned to drive my car out of town, but the temp tag was due to expire during that timeframe. When I reached out to driveway AGAIN before they expired & they said a rep would contact me. That was 5 days ago! Since then I’ve contacted chat—same response (someone will call me). Today I called again and the person I spoke to told me that apparently the dealership was missing some paperwork. Missing paperwork??? Are you kidding me? Now they are “waiting” for the paperwork for review, THEN they will send it to my title office. It’s been 25 days since the car was delivered and 34 days ago. So car payment due on the 23rd for a car I cannot drive.", "rating": 2}, {"title": "Lesson Learned!!!", "text": "So… Where do I even begin? My name is Jerome I started looking for a vehicle back in March. I found a car I was interested in and started the paperwork & made a $500 down payment. Didn’t hear anything back, after 2-3 days I googled the selling dealership myself just to find out the vehicle has been sold! So I decided to give them another chance because I didn’t really have time to take off from work to look for a car physically at the dealership. Found another car I was interested in, had to restart the process re-send all the paperwork I had originally sent in. Then the selling dealership was mailing paperwork to me, HELLO HAVE YOU HEARD OF DOCUSIGN?!! It’s 2022!! Then Got the 2018 BMW within 3 days after sending the paperwork back. I really liked the vehicle and thought maybe it was worth it for a vehicle I wanted, AND I WAS WRONG. Received the vehicle March 28th. First off the brakes on the vehicle were grinding and shaking the steering wheel, had to replace all 4 brake pads and rotors and change the brake fluid. Attempted to contact the sales agent who initially completed the sale on my behalf, never heard from JR (name of the sales agent) again to this day. Ok so I bite the bullet because I liked the car and already received it. Then rolls around April 23rd, my temp tags are EXPIRED. After endlessly attempting to contact someone at driveway and getting no response regarding my registration, after a month and now my tags are expired, they tell me oh we’re having issues with funding your loan. I’ve already had the car for over a month at that point and was beyond furious that NO ONE in the entire company can tell me they needed more information from my employer to fund the loan. At this point I haven’t heard from the initial sales agent by the name of Luis \"J-R\" Retana, and someone from the DMV department who isn’t even in sales told me why they couldn’t complete my registration because the loan wasn’t funded is what baffled me, like what if I was to never endlessly call and ask for an update than I would never know. So I got with a very nice manager by the name of Chris Cook. He was very professional and worked with me to get my loan funded and was greatly appreciated seeing as I can barley get ahold of ANYONE to get me an update. I’ve called and called and called the selling dealership and westlake financial the bank funding my loan and getting the run around each time. Ok so May rolls around and I get the loan for the vehicle finally funded thanks to CHRIS COOK, he went above and beyond for me always following up, keeping me updated and I appreciate it so much because without him I have no idea where I would be in the process. So now it’s mid May and I’ve been driving around with an expired temp tag since April 23rd, and if I knew prior I would’ve been working on getting the loan funded prior to the temp tag expiring. Anyways now I’m at the point where my car needs to be registered. My mother works with the Massachusetts RMV and in their system it says my car has been registered 05/03 it’s 05/17, but where the h e double hockey sticks are my plates?!!!!! So I’ve been calling driveway to find out if they’ve even been mailed and when I will be receiving them and here we are again, no answer or response. I call in and they say each time “we’ll add it into our issue log and they will call you” sounding like a broken record because I never get any correspondence. I contact the selling dealership, Armando with DCH Kay Honda. He never even picks up the phone, I email him, text & nothing!!!! What is really going on here?! It’s a never ending cycle. I would suggest to go through Carvana for the best online auto purchase experience. I would say it’s too late and too much of a headache to give the car back and be done which I am very close to doing. I bought a car with Carvana before and there was minimal effort to do so and very user friendly, and I got my plates within 2 weeks of receiving the vehicle. After reading reviews of driveway I wouldn’t recommend this company even to my worst enemy, had the worst experience start to finish which seems to be a common issue with alot of customers. Do not go with this company if you don’t want the deal with back and forth BS, 2 months and counting to have the deal finalized and who knows how long it’ll be before I have plates.UPDATE:got a hold of a supervisor by the name of Canela who was very nice and assured me she will get an update for me. After my conversation with her I received a text from someone named Antoinette that stated “I will let your agent know to reach out to you” hello I haven’t spoken to agent Luis JR Retana since March I don’t think he even is with the company anymore. Seems like their priority is responding to reviews & telling the customer whatever they want to hear just to get them off the phone. I ended up getting my plates at the end of may Since I’ve had so many issues w/ the car.", "rating": 2}]