[{"title": "Too expensive for how long it all last", "text": "Too expensive for how long it all last. Need more promo codes or specials. Can’t afford everything so it’s hard to get everything I want t try or should be taking.", "rating": 2}, {"title": "I was not allowed to reset password…", "text": "I was not allowed to reset password using my email address ,it did not recognize it. I wasnt allowed to check out as a guest. Finall after several attempts throughout the day I was able to check out as a guest. I received another email from your website saying I could take 15% off. That never happened and I was going to purchase some more product but did not because ot that.Michael Gatti", "rating": 2}, {"title": "I.Dk responder and veterans…", "text": "I.Dk responder and veterans verification resources and Id.meProof of age calendar date of birth entry sucks big time the calendar makes the entry process really over extended just to entry. One year at a", "rating": 2}, {"title": "This company provides great research &…", "text": "This company provides great research & info to its client base. But I'm out and so are all of the friends of mine that use their products due to the way they responded to someone's issue about Chinese made products. There are many alternatives, by the way for Chinese made pine pollen, Canada has a very fine product for those who are also boycotting CCP manufacturing.", "rating": 2}, {"title": "Did not honor discount code.", "text": "I received an email from Lost Empire Herbs indicating that there was a \"flash sale\" with 20% off ALL formulas. This prompted me to go to the website and shop for approximately $189 worth of items. Thinking I was going to have huge savings on my purchase I proceeded to checkout only to find that the coupon code did not work. I reached out to customer service only to be told the sale was for select items. This was contrary to email I received. In a nutshell Lost Empire Herbs did not honor their advertised sale and only offered me a small discount for the \"misunderstanding.\" This was definitely not cool.", "rating": 2}, {"title": " Didn't get the results that were talked about!", "text": " The pine pollen didn't work for me I must be the one they were talking about in the advertisement  when they said it doesn't work for everyone! Discovered it is a fraction of the cost elsewhere as well!", "rating": 2}, {"title": "I have been taking the Black ant for a…", "text": "I have been taking the Black ant for a week now and Ii have not really felt any different. I must admit I do not work out as I used to in my younger days, and have not tried it yet pre-work out. So I will hold off judgement until I actually work out. Same for the Pine pollen- way better tasting!! LOL.", "rating": 2}, {"title": "I've been taking it every day since…", "text": "I've been taking it every day since receiving the product,, well over a month and no results yet. Haven't felt anything so I'm disappointed.", "rating": 2}, {"title": "The products are mainly from China", "text": "The products are mainly from China. I haven’t noticed any effects good or bad. I’m just disappointed because I was thinking I was getting products from their Oregon farm.", "rating": 2}, {"title": " don’t have a PayPal button…", "text": "You still don’t have a PayPal button that works. All you have is Google pay for inputting your credit card number.", "rating": 2}, {"title": "that some of your products are not alould in canad", "text": "1 have yet t0 get any of my orders.( 3) 2 in april&1 in march. & the carrier sent the orders to the east coast .instead of the west coast??? then they said the address was not found??? &the address has been notified.& they have not notified me!!!!!so i cannot buy any more products from you.until youget this clear-up.!!!!", "rating": 2}, {"title": "Phoenix formila", "text": "Tried the pine pollen and it gave me lots of energy and made me felt great. So I decided to try the Phoenix formula. Phoenix formula makes me feel lethargic and often times gives me a headache.", "rating": 2}, {"title": "Ordered Schizandra powder", "text": "Ordered Schizandra powder. Normally love this supplement, however this batch tastes like laundry soap. Very disappointed!!", "rating": 2}, {"title": "Your processing time was slow", "text": "Your processing time was slow. It took well over a week to ship out the product after payment. Other sellers are much quicker.", "rating": 2}, {"title": "Was looking forward to trying it.", "text": "May not have been a supplier issue but my package had been opened on the inside package when I received it.", "rating": 2}, {"title": "YOU SHOULD HAVE EXPIRATION DATE ON YOUR…", "text": "YOU SHOULD HAVE EXPIRATION DATE ON YOUR PRODUCT!THE POTENCY OF HERBS IS DEPEND ON TIME!", "rating": 2}, {"title": "I recently tried to use a LEH 15% off…", "text": "I recently tried to use a LEH 15% off coupon at Christmas But was unable to use.", "rating": 2}, {"title": "Made in China", "text": "I just realized the product was made in China.I don't trust China. I am concerned about taking it on a daily basis.", "rating": 2}, {"title": "I placed an order on 8-28 and was…", "text": "I placed an order on 8-28 and was shipped the next day. After a week I tracked my package and found it had gone to Wisconsin, New York, back to Wisconsin, back to New York, then to Texas and then was returned back to Kansas. At that point I called and was told they would ship my order out again. And now over 2 weeks later  It has not been shipped. I’m not happy", "rating": 2}, {"title": "Skeptical", "text": "I ordered four or five bottles of different types of herbsTo treat general Mens Health issues. I was skeptical that they would work, but some of the people pushing your website said they absolutely would. I have taken all the herbs in different combinations and at different intervals but it doesn’t seem to make any difference so I’ll probably will not be ordering any more in the future", "rating": 2}, {"title": "Still have not received my package", "text": "Date of experience: December 12, 2022", "rating": 2}, {"title": "Did not receive anything", "text": "Date of experience: December 10, 2022", "rating": 2}, {"title": "Awesome company and awesome customer…", "text": "Awesome company and awesome customer service. They are very authentic which is difficult to find these days with soooo many rip-off companies floating around. They are providing high quality herbs and excellent articles online+ newsletters.I personally haven't experienced much improvment in my low libido sitaution, which is cuz all of us are different with different DNAs. Maybe using them longer might help", "rating": 2}, {"title": "The powdered herbs taste horrible", "text": "The powdered herbs taste horrible.  I have Athena, Albizia, and Ziziphus. I can't get them down.  Wish they were in capsule or tincture form. They might be the best herbs in the world, but they are no good to me if I can't get them into me.", "rating": 2}, {"title": "Only one issue", "text": "This is an excellent company, products, and normally excellent customer service.   Had a couple issues concerning the elderberry powder, made a couple attempts to use my satisfaction guarantee, heard nothing but crickets after the first conversation.   Hopefully, they will return to better service.", "rating": 2}, {"title": "I wrote a very long review on the…", "text": "I wrote a very long review on the product in email form directly to the head of the company which was more a letter than a review. In it I asked for advice regarding managing the doseage and also other products that could help me since I am struggling with various medical issues. This was in response to an email sent to me after the first 2 weeks I had received the product and it has been a couple of months and I still have not received a reply. I am very disappointed to have spent all that time composing a response to their email to me only to never hear back from them. That is not very good customer service.", "rating": 2}, {"title": "For the price I didn't find the…", "text": "For the price I didn't find the products to be as effective as I had hoped. Maybe they need to be taken for a more sustained. Of time but it is financially not a viable option to invest that much money it was something that takes so long to show positive results. Maybe for the very wealthy it is a better option but for blue collar Working Class People it is not very practical.", "rating": 2}, {"title": "I may be dreaming at 80 years old of an…", "text": "I may be dreaming at 80 years old of an erection from my 30's hoping for the impossible? I am taking the different herbs hoping for a rise to occur, but so far no such luck. For the younger male, I am sure the action occurs. I will continue to use the products I purchased. Happy New Year2021.", "rating": 2}, {"title": "I may have circumstances that affect…", "text": "I may have circumstances that affect the performance of the herbs I purchased.  I have a BMI of 46, high blood pressure meds and water pill, celebrex and tamsulosin etc.  Felt no effect from the herbs I took.", "rating": 2}, {"title": "Service great product questionable.", "text": "The service is is fine.  No complaints there.  Each person is unique.  Saying that,  i took the Pine Pollen pills for 15 days and the Mucuana Powder for 15 days.  Never felt any change within myself at all.  In fact i felt worse.  What works for some doesnt always work for everyone.  I have since moved on to another comapny and am back to my normal self in a positive way i migjt add.", "rating": 2}, {"title": "Pine Pollen Tincture", "text": "Pine Pollen Tincture.  I have used this product twice.  Both times it burned under my tongue and could only keep the liquid there a few seconds.  On the second day I used it (only once, not twice like the bottle recommends), that night, I felt my heart Racing.  I haven’t used it since and don’t know if f I should try it again.  I believe it stated to use a pincture (?) of it.  It was a little over half full.  Suggestions????  John Fraher", "rating": 2}, {"title": "Marketing approach is over the top and in your face, feels like a carnival barker.", "text": "Shipments are on time and as ordered however marketing approach is over the top and in your face, feels like a carnival barker.  This applies somewhat to the website but especially to the massive volume of after-purchase email marketing that is so loud it's deafening.I buy from Lost Herbs in spite of their marketing not because of it.", "rating": 2}, {"title": "I ordered pine pollen during the last…", "text": "I ordered pine pollen during the last sale. I don't think you ever acknowledged the purchase. It was the first time that I had a problem.I don't know if the order even went through. I haven't checked the web site. It was aggravating. In all honesty though, you have performed very well in the past.", "rating": 2}, {"title": "The site and payment options were cool…", "text": "The site and payment options were cool but, I am not rating the a 2 star. I am rating the product a 2 star. It was Pine pollan. I found out the the product was from China which is a lower quality. I pefer ingrediants from other countries.", "rating": 2}, {"title": "I ordered the schisandra berry and it…", "text": "I ordered the schisandra berry and it was dull and brown, nothing like the fresh bright red color I have received in the past. It looked more like a Chinese brand/product than the US grown product  I am use to getting. I wasn’t impressed with customer service and may not be reordering.", "rating": 2}, {"title": "Marketing was not clear what the product was for men", "text": "The initial marketing didn't make it clear that the product was for men, hence I am a women and bought it thinking it was to balance my hormonal system so haven't used it. Will give it away at some point so it doesn't go unused.", "rating": 2}, {"title": "Thanks for opportunity to write a…", "text": "Thanks for opportunity to write a review Pine pollen tincture I hav purchased several times >I believe it is good This time I bought Pine pollen powder which has not helped in the area I had  been advised it would .used it in the your recommended dosage,3.tablespoons once daily.Also bought Cistanche powder, haven't fully used it up yet,so probably too early to comment .Should i return the Pine pollen package for a full refund or would you consider I should get another package for free .Or should I be trying Thors Hammer .Your thoughts  Regards Brian", "rating": 2}, {"title": "Not what it's cracked up to be", "text": "This product produced NO results and, it tasted like crap to boot. Although, that part was advertised. But, if a customer has to suffer through that taste nightmare, the least the product could do s deliver what it promised.", "rating": 2}, {"title": "2 stars because the communication was…", "text": "2 stars because the communication was good. Low star rating because on the packaging says \"Product of China\"!?! I'm not ingesting ANYTHING coming out of China!!", "rating": 2}, {"title": "I'm not rating the people who work…", "text": "I'm not rating the people who work there and that I spoke with. I think they are great. However the products and my reason and hope for those products to help my problem did not happen. Very disappointed in the lack of results.", "rating": 2}, {"title": "Thor's Hammer…", "text": "I purchased a bottle of Thor's Hammer Potency Formula on the recommendation of Bill Plater. I paid about $65 for a bottle of 90 capsules and I can honestly say that I have seen no benefit to this supplement.", "rating": 2}, {"title": "I forget to take them on an empty…", "text": "I forget to take them on an empty stomach as instructed on the bottle. This is a personal habit that needs to be adjusted rather than the product. I just wish it was more convenient for my life style.", "rating": 2}, {"title": "It's Time for a Customer Service Department", "text": "LEH contentiously says that it's to small for a customer service department, which I'm sure is true. However, \"we\" would like some place to list our concerns, and ask our questions. Twice, I have attempted to call and left a message, and never got a return call. Then on two other occasions, I tried contact LEH by email and I got s series of ridiculous excuses, and decided to just stop trying to reach LEH's.  Again the products I believe are top notch, but LEH needs to establish a dialogue with it's clients after all LEH with it's 3-5 emails a day is looking to establish a relationship with it's customers, so I think there ought to be a way for us to respond.", "rating": 2}, {"title": "No understanding of my situation", "text": "No understanding of my situation, only focused to clarify and have their own back covered \"that they have done nothing wrong\" and also big parts of answers very unpersonal and in template form.", "rating": 2}, {"title": "I haven't noticed any impact", "text": "I haven't noticed any impact when the product is used. I won't buy it again. Perhaps another Lose Empire Herbs product would work better, but I may be more apt to look elsewhere.", "rating": 2}, {"title": "Simply at this timissibg productme gave nit your…", "text": "Simply at this time gave nit your product yet", "rating": 2}, {"title": "A few years back their delivery service…", "text": "A few years back their delivery service had improved immensely, but since my last order during the early part of this year, its looks like they have taken a few steps back. First, my order was confirmed complete and had shipped, but it took longer than normal to receive my order. Once I had received my order there were some missing items. I contacted them and they responded right away, but told me the missing items had to be back ordered. When I asked why my order was initially confirmed complete, I got no answer. Second, I had to contact them again concerning the missing items because the back order once again took a long time. I finally received the missing items after having to wait a very long time for everything to be complete. Next time, I would appreciate some honesty if I'm told my order is complete when it's not.", "rating": 2}, {"title": "Ridiculously long wait for Bacopa", "text": "I had to wait months when you were out of bacopa. This does not bid well with people who have a real medical condition and who rely on your products. Excuses are unacceptable.", "rating": 2}, {"title": "Didn’t see any benefits or improvements …", "text": "I have used one bottle of stag swag but didn’t see any major difference and I wonder about the good reviews here. May be works for few but not for all.", "rating": 2}, {"title": "Never given discount on purchases as…", "text": "Never given discount on purchases as advertised.", "rating": 2}, {"title": "Felt no effect", "text": "Date of experience: February 20, 2023", "rating": 2}, {"title": "The herb does not help me much if at…", "text": "The herb does not help me much if at all.", "rating": 2}, {"title": "I still haven't got my package but my…", "text": "I still haven't got my package but my previous order I love it and wish I could get my package because it cost me a lot. Thank you", "rating": 2}, {"title": "I got this help with ED", "text": "I got this help with ED, but it did nothing for me. I was taking 2 tbsp a day. However, it didn't give me the boost I was hoping.", "rating": 2}, {"title": "I have noticed that the potency seems…", "text": "I have noticed that the potency seems to have been reduced than before, I am not sure if it's really worth the cost.", "rating": 2}, {"title": "I have not experience any benefits from…", "text": "I have not experience any benefits from the Tongkat Ali yet despite following the directions of 5 days on and 2 days off.", "rating": 2}, {"title": "Great Service - Poor Product", "text": "Great service. Nice packaging. Appreciate the tutorial videos but the 5 products I purchased don't seem to work. :/", "rating": 2}, {"title": "Did not actually do what I bought it for", "text": "Did not actually do what I bought it for but I guess sometimes you need to have more of the product in your system.", "rating": 2}, {"title": "Three scoops of your Pine Pollen did…", "text": "Three scoops of your Pine Pollen did Nothing after first night (which was only half successful).", "rating": 2}, {"title": "Three scoops of your Pine Pollen did…", "text": "Three scoops of your Pine Pollen did Nothing after first night (which was only half successful).", "rating": 2}, {"title": "Several products I have taken do not…", "text": "Several products I have taken do not live up to the hype of their advertisement. Waste of your time and money.", "rating": 2}, {"title": "I tried one of the blends and it didn't…", "text": "I tried one of the blends and it didn't work for me.  I returned it for a refund and never got one.", "rating": 2}, {"title": "because u say u are sold out of the…", "text": "because u say u are sold out of the “Tincture Bundles “ buy y I can purchase them individually! Smh !", "rating": 2}, {"title": "I buy Tongkat Ali and pine Pollen from…", "text": "I buy Tongkat Ali and pine Pollen from you guys for quite some time now I’m yet to see any results", "rating": 2}, {"title": "I bought thor hammer 🔨 was pretty…", "text": "I bought thor hammer 🔨 was pretty disappointed with the product it did not do very much", "rating": 2}, {"title": "Pine pollen tincture quality has gone…", "text": "Pine pollen tincture quality has gone down. It used to be a good product in the past.", "rating": 2}, {"title": "I have tried several products and can't…", "text": "I have tried several products and can't say any of them have lived up to their hype.", "rating": 2}, {"title": "The products I ordered did not meet my…", "text": "The products I ordered did not meet my expectations", "rating": 2}, {"title": "It's the real stuff but I'm just not…", "text": "It's the real stuff but I'm just not feeling it", "rating": 2}, {"title": "Products are overpriced and don't work…", "text": "Products are overpriced and don't work as advertised.", "rating": 2}, {"title": "Not affecting me", "text": "Not affecting meYou can contact me via email", "rating": 2}, {"title": "I never received what I ordered", "text": "Date of experience: February 14, 2022", "rating": 2}, {"title": "Don’t feel it", "text": "Don’t feel it. I’ll give it more time", "rating": 2}, {"title": "Had better results with ageless male", "text": "Date of experience: September 28, 2019", "rating": 2}, {"title": "Never my coupon code work", "text": "Date of experience: December 07, 2021", "rating": 2}, {"title": "Well nothing really happened.", "text": "Date of experience: January 11, 2021", "rating": 2}, {"title": "Not positive results at all", "text": "Date of experience: December 11, 2020", "rating": 2}, {"title": "tried it and it didnt work", "text": "Date of experience: April 05, 2021", "rating": 2}, {"title": "The product did not work.", "text": "Date of experience: August 19, 2020", "rating": 2}, {"title": "Did not work for me at all", "text": "Date of experience: July 27, 2019", "rating": 2}, {"title": "Pine Pollen was stale", "text": "Date of experience: June 09, 2021", "rating": 2}]